{"bios": ["Ares Klinnert (b. 1940, Nova Odessa, Brazil) lives and works in Rio de Janeiro, Brazil. Klinnert’s primary medium is video, but her work also includes photography, drawings, sounds, events and mental states. \n", "Taviah Zebel (b. 1928, Fuyuan, China) is known for large-scale public interventions, both theatrical and otherwise. His recent works are both kinetic and meditative. \n", "Jesselynn Curleyhair (b. 1990, Fuyuan, China) has always been fascinated by similarities and differences in the cultural milieus of different parts of the world. She uses her place in history within the historical context of the current geopolitical situation and explores the ‘perceptions’ of migrant workers. Through song and dance, her narrative takes on a political dimension, towards a place where culturality meets criticality. \n", "Greenlaw Murray-hersey (b. 1948, Esposende, Portugal) has for many years used the Lost Market in Liverpool’s city centre as a point of departure for visitors seeking bargains on city products. Since the early 1980s she has approached this city’s lost history with a renewed enthusiasm, seeking out the traces of commerce that once travelled through this space and the communities that have inhabited it. Her research has repeatedly revealed surprises, some of them very familiar to her own community: chains of narrow gauge iron ore trucks, rusty SS vehicles and the faint echoes of abandoned buildings. These traces of transnational organised crime presented a contradiction to the bland, clear and compelling commercial signage that dominated the city centre. In her 2004 project Market Place, Murray-hersey researched the history of this forgotten community and the\n", "Kairen Rossean (b. 1941, Velikiy Ustyug, Russia) lives and works in Moscow, Russia. Rossean is an artist, activist, and educator. Her work deals with the political, social and cultural contradictions we face every day. She is a prolific and prolific’booster \", which is why she is often at the centre of art and design documentaries. \n", "Alans Hendy (b. 1986, Dornbirn, Austria) lives and works in Los Angeles, USA. Hendy was awarded the Special Prize of Art World, #35 in 2013, and has been featured on the covers of numerous top art journals, including Neue Artza, Fine Art Online, and Black Agenda Report. He currently teaches at the San Francisco Art Institute. ―Ed. Note: Contained within these pages is a perennial question: what does it mean to be a ‘true’? For Hendy, it is an open question: he seems to have an answer to this every day.’ Daniel Bozhkov (b.1965, Moscow, Soviet Union) is an artist living and working in London and Westminster, UK. Bozhkov is interested in how society is\n", "Hasker Krysl (b. 1992, Ningde, China) is concerned with the political, social and cultural deterioration resulting from the degeneration of the labor force as a result of the dismantling of the Soviet Union. She considers the dismantling of the Communist regime in 1989 the starting point for her work, and labor activism has been characterised by a 'war on women’ since her early days.  \n", "Miku Frauenfelder (b. 1925, Ban Khlong Bang Sao Thong, Thailand) is one of the most gifted female video artists working in the South Korean art world. Although she was trained in Seoul, her work has taken many forms over the last decade. She is primarily known for her inventive and politically charged step-dancing, frequently mixing avant-garde electronic music with Thai jiu-jitsu, Eastern European and African traditions. \n", "Lilliangrace Sterry (b. 1964, Edineţ, Moldova) has been working in the UK since 1990. In that time she has become intimately familiar with both the geographical and personal borders exercised by the different nationalities she visits. \n", "Karim Certalich (b. 1940, Jūnāgarh, India) studied mechanical engineering at the Jawaharlal Nehru University in Mumbai. While studying, he faced serious challenges in his chosen field: architecture. \n", "Llanet Bilger (b. 1974, Stowmarket, United Kingdom) lives in Manchester, UK. Bilger is interested in the beautiful everyday things – the small touches that convey a culture or way of life. She focuses on the people and their everyday lives, using the medium of photography.  \n", "Ignacio Bechthold (b. 1955, Grigny, France) lives in France. Bechthold is interested in the visualisation of reality, and the visualisation of ideas in relation to identity. By using simple rules of thumb, he has managed to produce figures of almost 400 children from across the globe, in various states of infancy. Each figure is assigned an age, from birth to the age of 15, and an identity, in order to represent their humanity. \n", "Nobe Varro (b. 1987, Saugus, United States) lives in New York, USA. Varro is interested in the beauty that is produced when the unexpected is allowed to happen. She likes to see her work as attempts to ‘make visible where none normally happens’. If nothing else, her straightforward depictions of intimate moments impel us to at least entertain the notion of intimacy.Mona Hatami’s (b. 1972, Tokyo, Japan) work is a response to a specific social situation. She is concerned with communication and exchange, often working with objects and the written word as a means to gain new awareness and understanding. Although very technically accomplished, her work lacks the poetic precision of her predecessors, who wrote with pen and paper and drew with their own bodies.  Although concept\n", "Snapper Racine (b. 1945, Ighram, Algeria) has always been fascinated with architectural surfaces that are already at one remove from reality. Her first installation, A Couch in the Aisle (1995), was an everyday object: a television set suspended from the ceiling, seemingly showing a TV show when in reality it was a pile of mess and tear gas canisters. Her more recent works incorporate fictive and actual incidents into their narratives. A new monograph, Urban Logic (2008), for instance, presents ethnographic and mapping evidence of actual and simulated situations (such as those of a life or death struggle on the city outskirts). Her innovative use of space allows her to play with the contemporary vernacular of urban spaces, confounding the utility of her  invented facility simply by existing. The fact that her\n", "Sheneika Celso (b. 1937, Imperial Beach, United States) lives and works in Portland, OR. She is interested in making visible that which is hidden, and in changing the cultural norms to create social paradigms that are more just and equitable for all. Celso’s practice often begins with a simple aesthetic rather than a critical or scientific inquiry, and often focuses on the informal rules of social interaction. \n", "Shirin Javis (b. 1947, Mola di Bari, Italy) is an artist living and working in Los Angeles, USA. Her presence in this country represents a shift from the usual suspects such as television, film and installation, to a new canonised breed of iconography: grassroots political activism, alternative music and B-movies. \n", "Fré Zuver (b. 1940, Concórdia, Brazil) uses the city as a lab for interrupting and observing the rhythms of urban life. He constructs surgical instruments out of everyday materials: aluminium cans, boards, wires, polyester fabrics and rubber latex. His surgical wonders are carefully cared for as they undergo rigorous testing in the streets of Liverpool, in abandoned buildings, or in the open arms of city’s citizens. \n", "Lyndal Massiesr (b. 1955, Neuquén, Argentina) uses visual shorthand to convey his profound concerns for children with Asperger syndrome. \n", "Shoemaker Tersteeg (b. 1933, North Port, United States) has been a central figure in the art world since the early 1980s, developing an analytical sensibility that has seen him become one of the leading figures in experimental and post-structuralist art. His work explores the socio-political, the cultural and the biological dimensions of experience. He has a long-standing interest in the effects of social stress on the human body, and in the psychological effects of drugs and alcohol, and although not a medical practitioner, his interventions do tend to be instructive. One of his projects is the Body to Body project, in which he has had transformative effects on the health of his patients. This work has involved giving powerful hypnotic drugs to patients in order to make them question their own behaviour and physical states.\n", "Marquiss Encarnacion (b. 1965, Środa Wielkopolska, Poland) lives and works in New York, USA.  In his practice, decorating abandoned buildings with antisocial or socially unacceptable decorations, Marquiss encarnacion investigates the up-arms (arms akimbo), or up-armored, aspects of human existence. Although often humorous, the materialisation of these aliens provokes a range of political and personal responses.  For Touched, Marquiss presented a number of drawings, some of them very intimate, depicting castrated female genitals. The drawings, deeply flawed as they were conceived, provide a personal note to the female body in post-natal states. One entered, however, into the world of the dead, and others delved into the dark recesses of the human psyche. \n", "Jacson Toranzo (b. 1930, Guadalupe, Mexico) has made the extraordinary journey from Mexico to America, continuing his remarkable artistic/political art practice which continues to this day to this day, to present at you a very special and personal exhibition of his work. This work, Toranzo’s ARTWORK (2005) has been described as ‘post-factual’ and features technologically enhanced animals, plants and installations. It is named after a mythical creature – an anthropomorphic bull or a horse – and stands upon a platform/stage constructed out of ‘US’ recycled materials and feels, which sits upon a sunken ocean platform that contained several floating buildings when it was finished. This new platform is surrounded by plants, some of them as large as living trees; these are\n", "Guruvansh Gallups (b. 1949, Chino, United States) is a photographer whose work often explores the politics of identity. With provocative but careful gestures, his documentary videos, drawings, paintings and installations make fun of consumerism, celebrity culture and the world of art. He has a particularity for dark, provocative and often subversive ends. By bringing seemingly mainstream products into disrepute, he questions traditional perceptions of cultural obsessions and mainstream perceptions of art. In his work for MADE UP,  Guru (1995), he questioned the definition of cult and the proper treatment of prisoners of conscience. In his five-minute long documentary, which is screened at MADE UP, Wallace argues that culturally significant artefacts such as statues, icons and cult films should be treated with suspicion and distance from community participation.\n", "Ailun Dalene (b. 1963, Ma'an, Jordan) defines himself as a paradoxical artist: I am a Taoist who makes art that talks back to me’s ‘life’. This spiritual contemporaneity is the subject of his recent OBE/CWR program, which has involved him in spiritual practices such as Tai Chi. Through this spiritual practice, which he describes as a ‘soul-searching’, he has articulated his feelings about the nature of the self, humanity’s place in the world and the way in which the spiritual can be articulated. In his recent works, the artist sketches out the possible ‘truth’ in a world in which belief systems and spiritual traditions constantly collide. His drawings also consider what might be achieved through open\n", "Gizelle Hulick (b. 1985, Ijuí, Brazil) is a writer, academic and lecturer who lives and works in London, UK. She is the recipient of the Forbes Brazil Prize 2015, the St George's Medal 2015, and an MFA from Goldsmiths College 2015.  Her work has been included in group exhibitions such as the Musee d'Ivey School of Art, London, UK (2015); Gran Via de Atacama Desert, Chile (2014); and the São Paulo Bienal, São Paulo, Brazil (2014).\n", "Ilgars Stine (b. 1974, Yueyang, China) is an artist living and working in London, UK. With subtle manipulations of language and cultural conventions, these works redefine traditional roles in a new light. Stine’s work uses an eclectic range of media – video, photography, installations and the occasional performance – to comment on the society displayed in these spaces. He has written a book on this very subject, titled One Thousand and One Words: How to Talk to People in the English Language with Professor Neil Cross (2006). \n", "Tiffinie Forschner (b. 1949, Al Jamālīyah, Egypt) usually depicts herself as a female protagonist. Although she has made the courageous effort to develop the field of ‘women’ art’ since the 1970s, the field remains woefully mired in the Cultural Dissonance™ – the vast gulf between what we want to see and what is actually portrayed, in all media, in both men and women alike. The term has been coined to describe a phenomenon whereby a malevolence, no matter how gross, is somehow simultaneously depicted in virtually every depiction of female oppression. Whereas the context in which we place our eyes allows us to discern the subordination and violence occurring in every scenario, the ‘whole image’ is never identified or explained. Instead, the viewer is faced with\n", "Kimiaki Belter (b. 1973, Roșiorii de Vede, Romania) lives and works in Bucharest and produces work in various media including film. He is interested in how perceptions of space and distance manifest in different cultural and linguistic spaces. In his work, he often initiates conversation between strangers by posing questions that are based on the subjectivity of the speaker.\n", "Cindee Schebel (b. 1930, Parintins, Brazil) has been a sculptor living and working in London, UK since 1994. Her practice revolves around the relationship between woman and object, man and mythical or third world existence, and the power of word and image. Her post-apocalyptic and allusive works explore how modern technology is unleashing a modern day Pandora's box – a box created by combining the technology of photography, video and sound.  Through her installations the artist conveys not only a message of empowerment but also a message of terror. Fear not, my friend: this is not a time for reflection. As we look at and record these terrifying new developments, we also look at the woman who makes them. She is just one among many bodies within this expanding and ever-changing construct\n", "Yaniz Garrand (b. 1980, Columbia, United States) lives and works in New York, USA. Shaping human experience in productive and aesthetic ways, his work incorporates performance, text, photography, film and video. Synthesizing modes of production and representation, his work relies on disruption and the accidental emergence of new possibilities rather than the establishment of established hierarchies. \n", "Flava Delvalle (b. 1983, La Laja, Chile) has since 1992 been a sculptor living and working in London, UK. Her \n", "Gretl Hendley (b. 1988, Shiyan, China) lives in Shanghai, China. Hendley is developing a body of work that accounts for both personal and collective history. Many of his works have personal and autobiographical motivations, but he always seeks tools with which to view the world, and to experience reality. His poetic and spatial ideas have been interpreted by many cultures and traditions into folk tales, legends, myths and otherworldly rituals. \n", "Mallely Snyder (b. 1952, Alexandria, Romania) lives and works in Europe. Recent exhibitions include As You Like It – Art From The Public Understanding Of’, Kunstforeningen Pädagogik, Rotterdam, Netherlands (2015), and Art From The Private Understanding Of, Meiringer’s Laboratory For Contemporary Art, Berlin, Germany (2014).\n", "Tejpal Sirles (b. 1979, Korydallós, Greece) is an artist living and working in London, UK. His work investigates the political, social and cultural landscape in which we live, made apparent by changes in the definition of landscape, abnormal behaviour, and the changing definition of lunacy. For International 04, Sirles presented a draft of a political cartoon which would have addressed the current migrant crisis and the impact of human figures such as Mohammed on British society. The cartoon, entitled   Politically Incorrect, would have taken aim at the use of the word ‘political’ in relation to human behaviour and raise the question as to how much higher should we go in order to penalise, or reward, a person for behaving in a certain way? The Royal Art Lodge’s reception of\n", "Guruvansh Gallups (b. 1936, Brunswick, Australia) is responsible for the world's largest outdoor Gurdwara (community centre). He structures his complex by drawing human figures on street lamps and street poles, planting books and other useful objects in their natural habitat – trees. The installation draws visitors into a world of animated literature and provides a platform for live music performances, usually in collaboration with local musicians. Gurvansh Gallups also organises the annual Art Venue, an informal meeting place for artists and art organizations in the city. Although it is well known for its low-budget film and television productions, Birmingham offers a number of unexpected places for artists to put their work.  Surrounded by historical artefacts, concrete and steel structures, and plenty of cables for snapping, this setting should\n", "Maceus Arbon (b. 1956, Verrières-le-Buisson, France) is a French artist formerly involved in the anti-Vietnam protestant Christian leftist group the Symbol of Resistance, (TRL). While it was characterised by theatrics and high-profile spectacle, TRL was also characterised by the more contemplative and analytical tone of many of its documents, works and speeches. These softened an already conservative-sounding language of protest and empowerment with an additional social message, often expressed in the form of hip-hop lyrics or political pamphlets. \n", "Lousine Masincup (b. 1935, Newquay, United Kingdom) lives and works in London. Drawing from a variety of artistic disciplines, from photography to film and digital media, Masincup’s projects include Sketch Magazine, published by Charles Matdow in 2003, which has received numerous honours including the Skowhegan Award, Turner Prize and National Book Award. Since 2003 Masincup has worked with the Tate Collection developing a new Indigenous Australian Art Collection at Liverpool’s Media Gallery. This new project, Indigenous Art Collection: Australia 2003, was initiated with the launch of Liverpool Biennial 2003 and has collectively involved over thirty artists, scholars and art workers from across Australia. It contains artefacts, videos, documents and artwork from Australian colonial eras, as well as contemporary concerns.Subotz\n", "Natalja Hummel (b. 1976, Vertientes, Cuba) lives and works in Berlin, Germany. Hummel is interested in the real or perceived lack of public/private space in both urban and rural settings. She focuses on the provocative political, economic and cultural dimensions of the built environment whilst also considering how these settings might be transformed into public spheres through a model of shared ownership and usage. In her work, she explores how technology is unleashing an ever-changing landscape in which porous boundaries might well literally criss-cross, as ideas of real ownership and real living transpose roles.\n", "Izaack Markus (b. 1974, Santa Lucía, Colombia) reflects on what he has been doing since leaving for Liverpool Biennial 2014: ‘proceeds from a very small number of sources, which I have kept secret from the wider community. It was only during the course of the project that I came across an application for the ‘International Graves Registration Project’, which had been languishing in the bureaucracy of the Colombian Ministry of Culture. Within a year or two, an official request for proposals for the project resulted in the erection of the office of the International Graves Registration Office in Medellin, where it remained to this day. The project I had been working on almost simultaneously with Art Bank Merseyside (Bank of Liverpool) had developed into a fully-fledged creative enterprise, fully responsive\n", "Anže Kazmi (b. 1967, Bergamo, Italy) has for years used the streets of Liverpool as a site to develop her highly systematic and emotionally charged paintings. She constructs detailed narratives that are rich with images of violence, crime, madness and cruelty. Every element is meticulously detailed with detailed diagrams and photographs: from the street lights to the scaffolding used to build these paintings, from the path set for the protesters to the chairs used to sit on. \n", "Beavers Dejarme (b. 1927, Mīnāb, Iran) have been working together for more than ten years, evolving from research and writing into a full-fledged artistic practice. Their work incorporates large-scale landscapes, interactive displays, films and sculptures, which are built from perfumed plantain, rubber and petrol-petals. The artists believe that by employing this simple yet potent aesthetic agent, they can physically alter the way we look at one of the world’s most sacred and significant landscapes: Britain’s East Kent. The artists propose that by depicting this landscape in glowing pixilated glass they can also alter our perception of the wondrous beauty of the East Kent coastline. The glass – which they christen ‘The Glass of the Martyrs’ – is a concrete structure,\n", "Amileo Garbacz (b. 1976, Lakeland, United States) lives and works in New York, USA. In his symbolic works, Garbacz pays homage to not only popular culture but also popular culture in its artistic and critical contexts. \n", "Rasan Mcmanaway (b. 1961, Ans, Belgium) has for years been an artist living and working in Brussels. His ongoing goal is to \"make real, through collaboration, the mythologies that underlie and then negate our everyday thinking and feeling\". Rasan Mcmanaway’s work deals with how nostalgia can lead us astray: towards a ‘true history’, a time and place where reality has been rewritten and nostalgia has no place. McManaway’s installations bring together pieces of art history or popular culture that are deeply concerned with a particular point of view. They are usually very successful: McManaway is now working with Disney to produce a new Star Wars film, whilst he is also involved with the Belgian branch of the American art world, the National Museum of\n", "Kavy Horwitz (b. 1940, Mpanda, Tanzania) lives and works in Liverpool. The process of producing Horwitz's sculptural pieces is a story of convergence and mutation, continual shift and movement between humanity and its surroundings. The artist grew up and studied in Germany, Japan and America, settling in New York in 1994. His practice explores the notions of mobility, death and bereavement, as well as ideology and phenomenology. \n", "Rachelle Kahle (b. 1942, Tsaratanana, Madagascar) lives in London. Kahle is interested in the evaporation of cultural traditions as a way of life, and the ways in which modernist ideology has shaped those traditions. This interest has led to her postcolonial views on a range of issues, including but not limited to the construction of slum-like concrete jungles in which her native land sits, the appropriation of tropical rainforest land for agriculture and the commodification of human and natural resources such as its rubber, rubber trees, fish and wildlife.\n", "Mckayden Stayer (b. 1970, Pathein, Myanmar) has created a beautiful landscape painting in the style of Zeno of the late 1960s and early ’70s. The artist has created colourful spirals, dandelion leaves, yada yada, or colourful projections of heads and bodies, like a psychedelic video, which can be viewed below. \n", "Jabien Mayak (b. 1976, Zundert, Netherlands) creates imagined or fabricated reality using the artefacts of his art practice, which he shares with other artists. While his art may seem to have a point of view, his is not a personal pursuit. He has worked in reality and art contexts for over 20 years and has a long-standing interest in chronological reasoning. This is evident in his choice of mediums: he has created sound and light shows, performed and imitated martial artists, scientific researchers and philosophers. However, his approach is much more complex than meets the eye. His art is not only about displaying force and power but also about gaining a deeper insight into what that might be like to be held in those conditions. His interest in the physical and mental constraints imposed by virtual reality is well\n", "Neathery Marbury (b. 1978, Tábor, Czech Republic) is a photographer who documents the vivid colours and intense patterns of contemporary life in Mexico City, with a view to publishing these images as high resolution photosensitive paintings. His images are less scientific, more anecdotal, revealing personal visions of places and peoples he meets along his Mexico City-bound odyssey. \n", "Joseph-anthony Carretino (b. 1932, Rakovník, Czech Republic) lives and works in Prague, Czech Republic. Drawing power from Czech studies of the nineteenth century, Carretino’s work focuses on historical romanticism, high art and the role of music in the social and cultural fabric of the Czech Republic. She is one of the founders of Der Bista, a music and art movement journal based in Prague. \n", "Kalaia Deyak (b. 1990, Xiangtan, China) enjoys a beach house in Porpoise during the summer months. The beach house has a cabin made of coral that has a Jacuzzi in the courtyard. On the second floor there is a small garden with a coconut tree. On the third floor you will find a restaurant with meat on the menu. The carnivorous fruit (∗Vagrant; →МКарьбанд, ʘAdamicola Espresso,’) is also on the menu. \n", "Talvikki Ohmer (b. 1958, Manuel Ojinaga, Mexico) is one of the few artists to have achieved worldwide stardom as a result of his enormously popular and critical works in English composition, video and sculpture. Although deeply concerned with the language of the printed word, Mr. Ohmer’s idiosyncratic and at times bizarre choices of material often simultaneously express his concern about corporate branding and the creation of consumer identities. As an artist, he frustrates and enlightens our modern-day conceptual dilemmas by reclaiming the language of billboard advertising as a mode of artistic expression. Blur, Zoom and Stretch are key Hindustani words used by Mr. Ohmer in his inventive adverts. He has also used the language of social networking to hone in on his audience. \n", "Amruth Schmied (b. 1959, Isleworth, United Kingdom) lives in London, UK. \n", "Batson Botkin (b. 1948, Lebedyn, Ukraine) lives and works in San Francisco, USA and is an illustrator and writer whose work explores the political, social and cultural codes of online communities. Filmed with anonymous subjects and scripts, Botkin works in both personal and public space, often drawing direct references to specific stories or situations.  Inspired by the artist’s visit to Ukraine in 2011, the film focuses on the negative stereotypes and censorship suffered by the country, revisiting issues such as defamation laws, legislation concerning homosexuality, and restrictions placed on certain religious groups. The film also looks at the potential of such spaces, and how powerless subjectivity becomes in a world where ‘the other’ is taken as a given.  Botkin has utilized online communities such as Tumblr and Twitter\n", "Magdalia Mccubbin (b. 1992, Santa Fé do Sul, Brazil) lives in Santa Barbara, USA. Mccubbin is interested in the power relations that regulate and inform the way we present ourselves. \n", "Ku-pooja Hecox (b. 1990, Alatyr’, Russia) is a photographer who documents the vivid colours and intense patterns inherent in Ukrainian life. By bringing these emotional and physical realities into the conscious, Hecox has made extraordinary progress in his practice of photo-documentation. In 2006 Hecox created a new medium and changed its name from photo book to photo blog. Since then, he has continued to expand his range of mediums, taking on topics as diverse as sociology, anthropology, religion, democracy, war and addiction. In his work with photography community organisation e.v.org Hecox has \n", "Hegyera Smink (b. 1943, Biryulëvo Zapadnoye, Russia) is a photographer who documents the vivid colours and intense patterns of modern-day life in his photosynthetic installations. These works appear to document isolated moments of cruelty, but which reveal a deeper, darker truth. In his 2011 installation for MADE UP entitled Six Colors (2008), which documented a group of men driving their pick-up trucks into group of women in Papua New Guinea's Manus Island prison camp, Gedmin Arnold’s documentary camera caught only one human figure in the scene: a 12-year old girl. Her horrific injuries, paralysed from the waist down, were rendered in macabre slow-motion as she writhed and gasped on the floor. The macabre delicacy of her macabre’ \n", "Vinka Gails (b. 1962, Tessaoua, Niger) lives and works in London, UK. After completing her MA in Visual Arts at the Parsons School of Design in New York, Gails began her career as a graphic designer, developing a keen interest in the psychological and bodily effects of light. This interest in illusory and unrealised bodily forms of representation gave rise to her work on the illusory and imaginary close-up, which is often drawn or painted with oil.  Using her rendering of light as well as her moving image, Gails invites the audience to explore illusory zones of reality, and the extent to which reality can be controlled or controlled’.  This is the author's first commission for Liverpool Biennial 2012.\n", "Alene Jeannot (b. 1947, Türkmenbaşy, Turkmenistan) presents her most recent work to date, Her Game of Death. Today, Her Game of Death is presented in an interactive context, enabling visitors to build and explore its content.  The most recent instalment in the series, Ghost News, incorporates market research by Juhani and Drudge Labs into its development. Our Integrated Developmental System (IDDS) was developed with children and young people in mind, following the Millennium Development Goal of halving the global number of deaths from preventable diseases, including HIV/AIDS. We develop hypotheses about what might be prevented from happening in the world if only we had more time and energy to prepare. For this new project, We’ve created a time-based intervention which we hope will one\n", "Nyzair Azruddin (b. 1945, Pameungpeuk, Indonesia) lives and works in London. Azruddin’s practice spans a wide range of media, from paper collage to performative sculpture and large-scale multi-sensorial installation, often featuring everyday objects such as furniture or artwork. Her varied practice also sees the artist seated or lying down on a sofa, which she constructs into a miniature gallery where she can display her work. \n", "Orms Coney (b. 1933, Botshabelo, South Africa) is known for her deeply contemplative works. In her recent projects, he has employed a variety of media, including video, installation and literature, to explore ideas of nausea, memory and reality. Displacement, mutation and the impossible vision of the absurd are among the themes explored in his work. \n", "Caedmon Basanti (b. 1978, Barki Saria, India) lives and works in Barki, Indonesia. Basanti is interested in the peopling of new countries with their unique cultures and traditions, and in how these peoples' traditional behaviours are being disrupted or replaced by ruthless capitalist systems. She searches for such systems in museums, art galleries, government buildings, as well as in nature, by questioning the ‘natural’ of both capitalist development and the preservation of historic cultural traditions. Through her work with architects, she has created a new museum building in Indonesia to be known as the ‘New Museum’, as it is situated on the old building site of the National Museum for Animals and Antiquities in Jakarta. Her ongoing project, New Museum Building – The Removing (2006), features stainless\n", "Sretan Bluford (b. 1984, Memmingen, Germany) uses typography and narrative techniques to negotiate between the formal and the informal. He has employed film-like still images in his installations, such as the still image of a woman's breast and genitalia in his work with photography. \n", "Thapa Adib (b. 1965, Haikou, China) lives and works in Los Angeles, USA. Adib’s work unearths histories, documents and artworks hidden for far too long in various forms, usually clandestinely. He exploits the history of art through submerged subjects like archaeology and ethnography. For his Lofoten International, Adib invited experts in both colonial and contemporary cultures to tackle a previously neglected area of study. His research has so far examined the relationship between technology and power in relation to body image, gender and social behaviour. His presentation of works at the Venice Biennial VII will also investigate the changing definition of family unit, and the compulsion for individuals to conform or dissociate themselves in society.\n", "Carter-johnson Metsker (b. 1946, Pinneberg, Germany) has a long-standing interest in the political construction and social definition of parallel universes, and the possibilities therein for hypothetical realities. His recent major retrospective, Locus, will be held at Maria Machado's gallery in Jersey City from Saturday 20 September 2014 to Sunday 25 September 2014. \n", "Sheterrica Gue (b. 1942, Zhangye, China) studied painting and sculpture at the Sichuan Art University in Chengdu, China. Her work uses quotations from literature and Chinese culture to explore the implications of technology in our lives. In life, technology often plays tricks on our senses and preconceptions. For example, by dressing as a surf lifesaver and surfing the web, Gue has revealed herself to be a chinese teenager. But she has also used her newfound status as a blogger to explore traditional art and cultural conventions, revealing once hidden relationships between the self and the other, and the nature of online social life. \n", "Mukram Oberholzer (b. 1985, Bang Phae, Thailand) lives and works in Bangkok. Using artistic, political and cultural signification, Oberholzer’s sculptures question the role of art in our daily lives. His multilayered sculptures use technology and new media (editor’s note: inverting the conventional understanding of these terms) to create entirely new ways of viewing and understanding the world. \n", "Astou Raup (b. 1925, Flörsheim, Germany) uses set pieces from art history to examine the contemporary climate of anxiety. His provocative gestures imply a link between history and the present moment, between past and present and surreal narratives. \n", "Vinka Gails (b. 1931, El Crucero, Nicaragua) lives and works in Los Angeles, USA. Gails is an artist, activist, and educator. Her work involves social change – typically passive, if manifesting itself in the form of art – in the context of the economy and politics of the transport and communication industries. She is a contributor for The Fourth and Fifth Estate and numerous other periodicals. \n", "Salomo Hernandez-alonso (b. 1993, Sabae, Japan) lives in Mexico City. Working in a variety of media, including video, photographs, installations and disabled art, Hernandez-alonso Visuals<i>works<ii>,<iii>visualizations<iv>, and political tracts, she unearths and redresses the myths and hidden histories of contemporary culture from the perspective of racialized oppression and the marginalization of women.  In 1998, Hernandez-alonso started her solo exhibition, Erasure, which documented the complex and multi-layered social and political changes occurring in Mexico since her group of colleagues won the Congressional seat vacated when drug trafficking organizations linked up with the powerful Zetas drug cartel. Her work presented the female body in a primitive state, subverting the traditional logic\n", "Maxyne Mantanona (b. 1984, Kajaani, Finland) lives and works in New York, USA. Mantanona is interested in how language communicates in relation to body. She has studied dance and choreography at LJMU’s Performing Arts Program and is currently a student at Bournemouth University studying to become a physician. \n", "Rosena Galati (b. 1976, Suwałki, Poland) is an artist living and working in New York, USA. From her early drawings and blog posts her work explores time and reality. With each drawing the artist re-imagines a different section of her early work, using a range of media, including video, sculpture, performance and original text. Her practice explores the possibilities of art as a mode of social enquiry, opposing pop-cultural narratives and using established narratives to address pressing social and political issues of the day. \n", "Gunne Woolery (b. 1940, Melton, Australia) uses urban sprawl as a way to view the nation’s socio-political landscape. He takes on a kaleidoscopic approach to the city, splitting it into discrete time periods – one contemporary, one historic. According to Woolery, Australia’s second city, built for cars and moving goods, is Melton – a city synonymous with cars and the rise of the car culture. The bustling port city’s automotive history goes back hundreds of years, predating the advent of the automobile by millennia. But the rapid industrialisation of the nineteenth century saw the city's auto industry wane and in the twentieth it was absorbed into the rest of the country. The shift to object permanence in the twenty-first century suggests a\n", "Ovada Ewan (b. 1951, Zhmerynka, Ukraine) has written extensively on the subject of BDS’ in Ukraine, but the way in which he has approached this question has been apparently unique amongst artists there. Like the Crimean Tatar National Hero who gave his life in the defence of his home, Jordan Belieff was killed in action to protect his friends and families from the horrors unfolding on the streets of Kiev. His artwork, which depicted wounded Ukrainian soldiers lying in the street and captured by his art, became a gesture of thanks and solidarity with the people of Kiev, who, in his words, ‘touched us with their beauty’. The Force (2009) was developed from the relationships established between the artist and his mother, and it directed the mother’s attention towards the\n", "Jayly Davis/bridges (b. 1981, Dicholi, India) constructs space within which it is possible to find, even today, ‘justice, equity, compassion, humour, tenderness, naivete, fear, joy and romance’. While much of Bridgeworks derives from real-life events, from ‘brave exceptions’ to universal values, she consciously refrains from succumbing to the hype of the sensational, the viral, and the one-sidedly dominant Western narrative. Anna Wintour’s (b. 1964, London, UK) work is hard to resist. Losing herself in a labyrinth of colour photographs, she walks hand in hand with a protoype monkey (named after her British Museum companion, shown here as well as in Monuments Royal\n", "Suzzie Mattlin (b. 1973, Rodgau, Germany) lives and works in Berlin, Germany. Working primarily in video, Mattlin is concerned with the subtle art of making invisible political statements, often implicit in present political culture. She sees no difference, other than what it may be, between capitalism and communism, and proposes new political organisations based on mutual aid and cooperative work. \n", "Harrish Bachtel (b. 1976, Sant Celoni, Spain) lives and works in Mexico City. He is interested in how societies organize, manage and decompose. His projects start simple, such as providing shelters for displaced people or rebuilding following natural disasters. But their ambition grows out of necessity: urgent preventive measures, such as search and rescue and protective custody, often provoke social unrest.\n", "Chayil Terwilliger (b. 1939, La Paz Centro, Nicaragua) is an artist living and working in Mexico. His art practice centers around the concept of the uncanny, and the way in which reality can still be perceived despite the efforts of the artist or audience member.\n", "Jessamarie Altenburg (b. 1940, Cuautitlán Izcalli, Mexico) lives and works in Mexico City. Altenburg is responsible for more than 30 groups of artists, ranging from new forms of sculpture to performative events, utopian literary projects and artistic monologues. Their work involves a wide range of cultural and linguistic expertise, bringing a firsthand perspective to issues of compassion, representation and civil disobedience.  \n", "Seiter Bredeson (b. 1972, Guaratinguetá, Brazil) lives and works in Mexico City. Informed by a variety of modes of reading, writing and poetics, his work is excavated and reimagined within appropriated and reimagined media. In his investigations of literary and artistic subjects, In-So-Ching is no different. His inquiries draw heavily from East-Coast American craft beer culture, in particular the South Florida scene of the 1970s and ‘80s known as the 'Golden Years of Beer'. This drinking season saw the proliferation of specialty beer bars and restaurants, which in turn drew on the city's Latin American immigrant population. These restaurants, in turn, continued to draw on the stories of the immigrants – in turn creating a new, angrier dialect – the paranoid\n", "Renasha Porath (b. 1949, Ryton, United Kingdom) lives and works in Los Angeles, U.S.A. Recent exhibitions include The Black Corneas/Two Talking Spiders (Museum of Contemporary Art, Los Angeles, U.S.A., 2012), The Black Corneas/Ursula Akerstedt (Horizon Gallery, Tilburg University, Netherlands, 2012), and The Black Corneas/Big Issue (The Walther Collection, Kunst Halle, Germany, 2011).Dislocation and the fetishisation of relationships underline the work of Meiro Koizumi (b.1976, Japan), and especially so in My Voice Would Reach You (2008). Taking the top 27 songs from a Japanese popular radio station and playing them back in reverse order\n", "Assja Nuckols (b. 1988, Siem Reap, Cambodia) lives and works in New York, USA. Nuckols works in photography, artistic printmaking and xerography. She differs from the traditional image of the super-engINEERED V-RACE, as she is an artist not an inventor; instead she takes the hyper-generic (and often violent) route of the JET-PROCESS, which she explores in her work.  \n", "Izaack Markus (b. 1929, Petershagen, Germany) has always been fascinated by surfaces that are already at one remove from reality. This is sometimes evident in his use of millet – a hybrid of wheat and millet found in the Belgian province of Northwestern Belgium. \n", "Analee Hohlt (b. 1952, Zaria, Nigeria) is attracted to situations from which she was previously excluded, whether they were close to home or beyond. Her ongoing exploration of these sites, typified by her current installation, aims to bring order and beauty into seemingly chaotic spaces. Through conversation and activity, her work evolves, until finally it arrives at a point where the inhabitants accept its presence with open arms. Whatever their personal beliefs, Hohlt’s community of origin, wherever she goes in the world, offers a mirror image of what it is to be an outsider. In her installation for MADE UP entitled The New You (2008), Hohlt explored the place of the media in our lives. This renewed interest in the media-created environment was prompted by a desire to reflect on\n", "Sufern Vest (b. 1934, Turin, Italy) is a leading Italian artist living and working in New York. He explores the political, social and cultural dimension of the art world through his use of the Internet and community-based production. \n", "Diema Virgen (b. 1990, Buhi, Philippines) uses a unique artistic medium – Photography. Her images are site specific and explore the city’s visual and cultural terra incognita. In 2000 Virgen took 35 long exposures of derelict buildings in Manila Bay, then shot underwater footage of key landmarks such as the Statue of Goddess Christina’s bust. Next she photographed derelict buildings in San Andrés, then filmed underwater footage of the Esperanza ruins in Panama City. Finally she photographed the stained glass windows of St Michael’s Church, then stained glass windows of St John’s Cathedral. All images in this report are copyrighted and displayed within the structures themselves.\n", "Speroni Urbanic (b. 1967, Saky, Ukraine) is concerned with the physical and social side-effects of long-term international engagement. In addressing such issues as 'global citizenship' and the definition of citizenship, the artist investigates the way in which the rights we enjoy today are being wielded in a new political and regulatory framework. In his installations Sotillo makes an active effort to bring political and social systems into dialogue with each other. He looks to existing international organisations such as the United Nations and the World Trade Organization as models for engaging directly with state-sanctioned behaviour. In his recent projects the artist presents scenarios for direct citizen involvement that go beyond mere advocacy: he has used Twitter (@deeplink) to bring formal processes such as sanctions into the public domain; he has used graffiti\n", "Maxel Sorey (b. 1971, Weston-super-Mare, United Kingdom) has made numerous works exploring the upscaled, expanded and modified state of global communication in the 21st century. \n", "Miryn Mctee (b. 1937, Pozzuoli, Italy) lives and works in Venice, Italy. Our subject has always been the relation between craft and craftiness. ‘The real artist’ might be asked to classify Mctee’s work in terms of this genre. After all, there are certainly ‘craft’ in all of Mctee’s work. But Mctee has also said that her work should tell stories that are at once ‘indisputable’ and ‘indisputable’. Her storytelling often threatens to shift the focus of her art from the viewer’s perception of reality to the artist’s own. Mctee’s work often plays with our perception of reality. She has described her work as\n", "Garza-guajardo Ovsanik (b. 1979, Pucheng, China) uses performance, installation and video to national and international audiences to raise social awareness and debate about critical issues of the kind often raised by way of his provocative and often unsuccessful Chobimela project. Whereas Chobimela was concerned primarily with China’s expanding right to freedom of speech, Space Junk is a global campaign to reduce the size and frequency of space flight. This involves raising public awareness through symbolic gestures such as movement in space and the sharing of food and drink in space via peanut-butter jars. While gesture is an important aspect of Chobimela’s work, the real prize lies in the superlative vision presented by Ovsanik. He has achieved this through the magic of social engineering: raising public awareness\n", "Diekolola Dufault (b. 1989, Boca Suno, Ecuador) lives and works in Mexico City. She started making art in 1997 under the pen name Skylar Ostrom. Since 2001 she has been working under the pen name Sante Fe, and is currently working under the pen name La Muchenait’. Her ongoing work involves a cyclical selection of materials from everyday life, more specifically the effects of elevated salt consumption and handling, on the human body. The resulting work is an in vitro hybrid between reportage and documentary, between presentational and historical narratives. \n", "Treasia Lavender (b. 1984, Barrinha, Brazil) lives in Rio de Janeiro and Berlin. She sees art and design as two fundamentally different spheres, one concerned with the natural world and the other, space and power. Her interventions in the world’s most iconic works are often balanced by carefully choreographed feats of engineering, usually involving robotics or artificial intelligence, to create utopias. A hybrid, futuristic city – Rosalie Fossil – is often at the fore of her grand visions, becoming almost a template for how the future should be.\n", "Keeya Emlay (b. 1983, Denia, Spain) lives and works in Venice, Italy. Emlay’s practice spans a wide range of media, from video and photographic printmaking to create new works of art, informally documented essays, research initiatives, concerts, workshops and other events. Focusing on specific issues or topicality, her work often evolves through the actions of the participants in her various actions, which often involve creating works of art as well as commissioning others to do so. \n", "Mcgirt Waskey (b. 1958, Port Alfred, South Africa) lives in Johannesburg, South Africa. McGinty first expressed her concern for the future of South Africa in 1993 when she spearheaded the 'urge to construct' a statue of President B.J. A digression from the subject at hand: Art and South African Biography. This 'urge to construct' was based in large part on the South African climate: little global warming was expected in return, as a direct consequence of the rarity of natural gas. This 'prank' was in reality a proactive step towards the formulation of a strategy to transition to a low-carbon economy: a strategy that would ultimately see the South African National Army (SANA) and its role in post-Apartheid South Africa diminished or completely withdrawn.\n", "Renault Cotheran (b. 1949, Pallippatti, India) often depicts religious apparitions. It is his practice to project an image or a sense of presence into the space of a great many disparate objects, buildings and visual effects. With increasing frequency, these effects become identifiable as human presence. Their precise location and nature remain a constant concern for the artist, who works hard to create configurations of objects, forms and visual effects that are both uncanny and plausible. In his recent projects, Cotheran draws on his background as a filmmaker and writes new narratives that are simultaneously ghostly and fantastical. His ingenious rendering of the Smith/Reid Assassination and its aftermath, Local Hero and The Smith Case: The Real Story of a Murder/Massacre within an Allegorical or Historical Setting, respectively, both appear\n", "Leihlani Blasz (b. 1969, Talwāra, India) has made the journey from India to America, and although he has a variety of artistic interests, the main subject matter of his work is probably social and cultural diversity.  Inspired by the social unrest in his home country, Afghanistan, and chronicling such changes with aplomb, his work explores the hidden side of the mirror world, revealing not one, but many, of these dislocated, traumatised people. With uncanny observational precision, Blasz observes the community of stars in the social and political upheaval sweeping through his adopted country, Afghanistan. He has also considered the societal \n", "Kingzion Fontana (b. 1940, Orikhiv, Ukraine) has done a remarkable job of conveying to us in his recent sculptures the feeling of being transported across vast distances, often accompanied by a sense of urgency and remote apprehension. The vastness of the places he has chosen to explore suggests a worldview forcibly embraced by a remote and dangerous fate. The animals he has chosen to explore suggest nationalisticistic ideologies as well as religious fanaticism. In his selection of animals for his sculpture series, Fontana has selected to represent a variety of ethno-cultural groups including but not limited to Jews, Muslims, nomadic pastoralists, Ukrainian artistic traditions, Belarusian and Russian elite art circles, and indigenous Americans. The influences he has chosen to explore suggest a process of self-reflection, collaboration and reflection.\n", "Garrion Arevalos (b. 1965, Mulbāgal, India) lives and works in India. Arevalos has three parts: the art world, a laboratory for testing industrial/technological ideas in visual/endurance sports and recreation, and a place for poetry, play, criticism and utopian fiction writing. Experimental and subversive in nature, his varied practice has often dealt with the politics of sport and bodybuilding, colonial exploitation of tropical landscapes and the relationship between sport and politics in the 21st century. In his recent projects Arevalos has harnessed the immense power of sport as a means to document and redefine the terrain of sport and its relation to politics. In his project for International 04, Arevalos designed and built a semi-transparent swimming pool (http://www.mystifactory\n", "Claude Kovarovic (b. 1940, Ipís, Costa Rica) was a photographer who specialized in Native American ritual and cultural practices. With unflinching commitment to truth and integrity, he documented acts of violence, sexual abuse and cannibalism in the communities he photographed. Despite the often graphic and explicit nature of his work, the men featured in Kovarovic's photographs are fully at liberty to act out their sadistic fantasies; protecting their identity by wearing traditional Native American dress and artfully manipulating a tribal mask into posing a disarming threat. If these images captured the full horror of these practices, then Kovarovic’s work also captures the humanity in them; the inexplicable violence now completely replaced by the more rational and scientific methods of social observation and therapy. For Touched, Kovarovic returned to the\n", "Isaaq Plassman (b. 1993, Warri, Nigeria) works across multiple media, often using her writing to address matters of cultural sensitivity, such as the imprisonment of her mother, female genital mutilation and honour killing. She is interested in how such sensitive issues are rarely raised in the formal discourse of politics or society, and in the ways in which new media legitimises or re-normalises practices.  In December 2000, after completing her MA in Visual Arts at Parsons with a joint appointment at CHEMTRA, she created ARTwheel, an autonomous, nonprofit public space in Liverpool where she could focus on developing her ideas for a free and inclusive future. Wheeled vehicles (shown in red and black) periodically appear in the stream of consciousness, as do panels of text, images and videos that animate\n", "Charlett Blondeau (b. 1933, San Carlos de Bariloche, Argentina) was an artist living and working in Buenos Aires during the 1970s and 1980s. An idiosyncratic combination of painting, drawings, photography, film and literature, Blondeau makes the most of her everyday reading and looks at the world from a different point of view. She is fascinated by the link between disability and social exclusion, and by the way in which fiction and fact simultaneously occupy different factual frames. In her recent projects she documents the seemingly inevitable incidents of social dislocation – from traffic accidents to suicide, war and accident, broken up by disability. By putting these events into a fictional context, Blondeau reclaims the lost narrative possibilities of the uncanny, and the ways in which disability informs the way we perceive the world. Sturtevant\n", "Jabon Serrett (b. 1991, Carmarthen, United Kingdom) lives and works in London, UK. After completing his MA in Visual Arts at Goldsmiths College of Art, London, UK, Serrett has been awarded the Sobey Art Award, given to the most outstanding work in art directed at humans. This award was acquired by Sobey Art Gallery, with which Serrett will be collaborating for the first time on a new collaborative exhibition, To the Death and to Come: Contemporary Art in the 1980s and Word War Lice (TRACE). This massive open air sculpture will stand amongst the clutter of London’s Buckingham Palace as a reminder of the place where Charles Speight’s career as a policewoman began."]}