["The next Biennial should focus on the potential for the art of western art to contribute to the advancement of interdisciplinary projects. That should involve a rethinking of the conceptualization of art as a universal language, a new treatment of the art of the west, and a rethinking of its relationship to the eastern arts. The next exhibition should take place at the museum in 2020 and will be hosted by Jonas Gade, director of the Kassel-based museum. Russell Hagg, director of the New York–based museum of modern art, said: “We are excited to work with a strong and dedicated team assembled by our principal curators, Maria Bochere and Beatrice Breit, who has developed a distinctive and original vision for the upcoming exhibition. This is an exceptional place for the exhibition of this important collection, so we hope this will be a moment of celebration.”\n\n\nThe Shuswap Museum of Art in New York has appointed Jennifer L. Casey as its new associate curator of contemporary art. Casey will be responsible for cultivating the next generation of Shuswap artists and advocates for a more inclusive and diverse curriculum. Casey comes to the institution from the Metropolitan Museum of Art, where she currently serves as associate curator of", "The next Biennial should take place in the autumn of 2022 and will focus on “strategic and societal challenges of the future,” according to the organizers. The exhibition will be curated by Vittorio Mignini and will receive funding from the Andrea Mavola Foundation, the Francesco Matera Foundation, and the Giardia di Siena Foundation.\n\n\nThe Metropolitan Museum of Art (the museum) in New York has appointed Taro Isozaki as its next director. He succeeds Raymond Ibrahim, who retired in March 2020 to become a professor at Columbia University in New York, and will assume his post in April 2021. Isozaki has served as the Met’s director of education, development, and public engagement since March 2019. During his tenure, he guided the museum through its largest expansion, the Museum of Modern Art (MoMA), and has led the institution through multiple recessions and intensifiers. Since his departure, the museum has undergone a major restoration and expansion, and now operates as a new twenty-thousand-square-foot headquarters for the United States military and intelligence community. Inaugurating the new campus, which is designed by architect Frank Gehry", "The next Biennial should be held at least once every three years.  The biennial will include a presentation of the work of each artist in the exhibition. The themes of the exhibition may be: 1) On the Conceptualization of Art (Art and Conceptualism) 2) Art and Conceptualism in WWI and WWII 3) Art and Artifacts 4) Art and History. Details about the upcoming exhibition will be announced soon.“I am very excited to present the first exhibition of The Doraemon Project: Artists at Work,” the exhibition will open on September 20th at the Museo de Arte Contemporáneo in Madrid and run until October 4th. The exhibition will present the work of twenty-four artists: Gérard Bénétié (France), Mario Bava (Italy), Harald Bietak (Germany), Karel Kselen (Germany), Jørgen Klee (Norway), Marina Litvinenko (Russia), Junya Inoue (Japan), Arseny Lisitsyn (Russia), and Anna Paley (Argentina).The show will be curated by Luis Enrique Rodriguez. “I", "The next Biennial should take place somewhere in the city, with a view to eventually opening in 2021. “I’m sure that it will be a celebration of the city,” said director Anna-Karin Boecker. “I’m sure that the artists, writers, and designers of the city will have their stories told and their visions realized.”\n\n\nThe Biodiversity Fund, a $10 million initiative backed by the Bill and Melinda Gates Foundation, announced today that it will award $1.3 million in grants to ten California nonprofit organizations in support of their conservation efforts. The organizations include the California Coastal Commission, the California Farm Bureau Federation, the California Environment Agency, the California Nursery Workers Union, the California Food and Agricultural Workers Union, the Desert Sunflower Association, the Forest Stewardship Council, the Golden Gate Community Gardeners’ Association, and the Marin Independent School District.“For nearly two decades, the Biodiversity Fund has been working with state and local agencies to protect and manage the world’s oceans,” said Michael Cohen, president of the foundation. “By providing grants, the foundation is able to act as a resource for state and local policymakers and", "The next Biennial should be held at the San Francisco Museum of Modern Art in 2020.  An open dialogue with civil society and scholars about the future of art is necessary to build support for the construction of a more just and inclusive future. \n\n\nArtist-run galleries in Paris have announced plans to reopen in the city’s old stockyards in a bid to revitalize Soviet-era artworks that are currently being stored in warehouses across the city. The reopening of the former brickworks will take place in the spring of 2021.“The city of Paris has been experimenting with new and innovative ways to share work across the city, especially in the former industrial areas,” François Beaufils, executive director of the Association of French Galleries (AFG), told the Art Newspaper. “We are now at the point where we have all the necessary tools with which to make this possible, but we need to work together to ensure it is a fair and transparent process.”In the coming months, the galleries will begin welcoming visitors through a reopening of their brickworks, which are currently closed since the pandemic peaked in China and Europe in late March. A retrospective of the work of the late Belgian artist Wim Van Eyck", "The next Biennial should take place in May 2020, which would mark the 40th anniversary of the festival. In an open letter to the festival organizers, the artists decried the exhibition as “a distraction from our main theme which is our collective responsibility to reflect the diversity of the world around us.” The letter continued: “This exhibition should be on display in the National Museum of Art as an example of how you can create a space for political contributions but also for artistic expression.”The letter was signed by the following artists:Kanawar Niaz, Arafat\n\nNaima Javed, India/United States\n\nNaima Javed, India/United StatesAcira Mukherjee, South Africa\n\nNaima Javed, India\n\nNanda Pindia Narsimuthu, Arunachal Pradesh\n\nNanda Pindia Narsimuthu, Arunachal PradeshSonia Casanova, Argentina\n\nSonia Casanova, ArgentinaK. P. Raja, India\n\nK. P. Raja, IndiaNigel Brown, England\n\nNigel Brown", "The next Biennial should be held in the second half of July. The theme of the seventeenth is “the laboratory.”The biennial is organized around a theme park, the Biennale, and a fictional setting called the “Labyrinth.” The exhibition will also include a “group exhibition” of artists that will feature work from the Biennale, hosted by an architect and a curator, which will travel between Paris and Venice. In addition to the production of works, the fair will organize a lecture series on the theme, which will open on December 8.“Transformation of a Discovery: An Exhibition for the Modern Museum,” which has been postponed since it was originally scheduled to launch on October 10, will now take place in March 2021. The show will be a “reimagining of the museum’s collection.” The first show, “Making Faces: Contemporary Art and the Modern Library,” will open on February 17, 2021. The second show, “The Matrix: Art and Technology,” will be held in the spring of 2022. Both shows will be held under the theme “The Matrix.”\n\n\nThe National Geographic Society’", "The next Biennial should be in 2021, the year of the 'Holy Land' pilgrimage. In a statement, the museum said: “The museum is open to visitors of all faiths and will promote tolerance, respect, equity and solidarity in our displays and programs. We believe that the future of our city and borough lies with the people of central London.” Born and raised in the heart of the London arts district, the borough of Islington, Bethnal Green and East London, the area where the exhibition will take place, is currently working on a plan to redevelop the area around the museum, which was founded in 1888. The redevelopment of Bethnal Green and East London will be led by the London-based firm Gensler, whose London, New York, and Hong Kong offices are located in Canary Wharf. Commenting on its work in the area, Gensler said: “We have worked with the local authorities around the city to deliver a truly amazing regeneration plan. The masterplan will deliver a vibrant new exhibition space, a world-class contemporary art museum, a world-class concert venue, and a world-class school. We’re so excited to collaborate with the local communities", "The next Biennial should be held as soon as possible. The museum’s director, Drew Angell, said: “We don’t have an immediate need for additional staff, only to say we need to think about it. We’re not at this point able to offer any commitment for a second edition of the show. The next iteration of the show will be about our world and what we are making together.” The Art Newspaper reported that the museum is also considering postponing the opening of the venue permanently. “The question is whether this can be sustained over the long term, and I don’m sure we can,” a March 13 statement by the museum reads. The institution is currently working on developing a new seven-year, $120 million capital campaign. \n\n\nThe Bénédicte de Montlaur (BAM) in London and the Royal Academy of Arts in Manchester, England, have teamed up to create the world’s largest public artwork, the 400,000-work installation The Beauty of Light. The work, which was commissioned by the Bénédicte de Montlaur in honor of the institution’", "The next Biennial should be held in 2020. As the city plans for its reopening, it will also begin the construction of its first public art garden, which will be located in the city’s waterfront.\n\n\nThe Supreme Court in New York has declared that New York’s art museums must comply with a new set of regulations that go into effect on January 1, 2020. The court determined that the New York Historical Society (NYHS), the Metropolitan Museum of Art, and the Metropolitan Museum of Art, which collectively pay $1.3 billion annually in fines, must enact “meaningful and timely” reforms.It ruled that the New York Museum of Modern Art (MoMA), the Metropolitan Museum of Art, the Metropolitan Museum of Art, and the Metropolitan Museum of Art, which collectively face a total of $2.4 billion in fines, must “implement meaningful changes” in response to the court’s orders. The court also ordered that both MoMA and the Met be required to implement at least $1.2 billion in revenue losses from the coronavirus, and that the Museum of Modern Art and the Museum of Modern Art, the Met, and the Museum of Contemporary Art must share", "The next Biennial should be hosted by São Paulo University in the Center of the artistic’s capital. The theme of the exhibition, which is currently being curated by Nino da Roo, is “The Urban Myth.” The seventy-five-foot-tall, sixty-one-foot-wide installation will be composed of forty-five illuminated glass panels, which are arranged in a grid pattern on the audience’s right, with the panels corresponding to the subjects of the paintings in the installation. The fourteenth Biennial will take place at the Museo de Arte Contemporáneo in Lisbon, from September 27 to September 29, 2020.\n\n\nYale Union, a contemporary art museum in Portland, Oregon, has hired Melanie Chiu, a former curator at the Museum of Fine Arts, Boston, as its next director. Chiu has been appointed by director Michael Richards to lead the museum as part of a reopening plan that would foster more community engagement and collaboration between Portland and the surrounding areas.“We are incredibly excited to add an artist and scholar to our team who has lived and worked in Portland for nearly twenty years, and who brings a new perspective and perspective", "The next Biennial should have a selection of works by Gustavo Parra, Alfred H. Barr, and Hans Christian Andersen, and should begin in the autumn of 2020. The exhibition, titled “Cultural Identity in Japan,” will be held at the Biennale de Lyon until December twenty-third.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has received a gift from the late Chinese collector and collector-designer Li Shuangwen. The gift, an assortment of works by the celebrated maestro Li that were exhibited at the exhibition “Li Shuangwen” in Beijing in 2009, consists of an original collection of ninety photographs by the artist that were taken by his son in the late 1950s.As the son of the late collector Chen Shuangwen, who was also a multidisciplinary artist, Ma Xiong acquired the works through his son Li Shuangwen in 1987 and began exhibiting them in 2011. He had previously exhibited the photographs at the Cerebral Art Museum in Beijing in 1998 and at the Museum of Modern Art in Shanghai in 1999.In 2013, the son commissioned another son to take the photographs for “Li Shuangwen,”", "The next Biennial should take place in 2021, and the first in 2022. Since the most recent edition of the exhibition was held in Beijing in February 2019, Jill and I have been working, week in week out, to ensure that this year’s exhibition, titled “Art of Life,” will be held in the capital.“This is a transformative event for many artists and institutions,” said John McAllister, chair of the architects’ show in Zurich. “They will now be able to explore new and unique ways of creating and presenting works in various disciplines—from architecture to film, from print to sculpture. ”The exhibition, which was curated by Pierre Lévy and opened on December 6, 2019, will feature twenty works by thirty-eight artists from twenty-six countries, including Armenia, Brazil, Bulgaria, Chile, France, Germany, Italy, Russia, Spain, Sweden, and the United Kingdom. The exhibition, which also features works by artists from Egypt, Hungary, Northern Ireland, and the United States, will run for sixty days.The museum will extend the curators’ reach by opening a series of new projects that will be organized around key themes. The first project", "The next Biennial should focus on the history, development and conservation of the Sargasso Sea, the Grand Canyon, and the Grand Canyon State Park in Arizona. In 2020, the biennial will welcome visitors from twenty-five countries.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is about to begin its renovation of its historic building with a new $75 million exhibition, “L.A. Next: The Exhibition of the Future.” The event will take place in a former Tuskegee Air Force Base and will feature works by twenty-five foreign artists. Titled “The After Effect” and curated by Rona D. Exarhosa, the exhibition will showcase work by twenty-five artists from twenty-six countries in the United States.“The Contemporary Exhibition is a foundational research project for many artists and is an ongoing reflection of the city’s artistic and cultural zeitgeist,” said Alex Dobkin, chair of the institution’s Board of Trustees. “We are confident that the new installation will capture the spirit of L.A. and showcase the work of artists from countries around the world.”Among the upcoming artists chosen for the exhibition are Hé", "The next Biennial should be held in 2020, and the third in 2021. The biennial will be preceded by a number of exhibitions, including the opening of Art in Motion, curated by Nina Fontana, at the Museo de Arte Contemporáneo Milano in Milan.  The exhibition will focus on the creative process in the city of Venice, which is currently undergoing a massive redevelopment project. The show will air at the Museo di Venezia di Lincella in Rome, and will feature works by more than sixty artists. The 2019 show opened on September 22; the show will continue, and will be held until March, 2020, at the Museo delle Città di Milano, alongside The Last Supper, the fifteenth edition of the Venice Biennale, and the second edition of the Art in Motion exhibition, at the San Remo museum in Venice. For its fifteenth edition, The Last Supper, the museum will include twenty works by fifty-three artists. The exhibition will also continue to be held in the museum until the end of February 2020. The museum will continue to receive visitors through March 28. The exhibition has been awarded", "The next Biennial should take place in 2020, when the biennial will no longer be possible. The museum’s local staff will be paid up to $1,200 per month during this period, but the institution’s annual endowment of $23.5 million would be funded through donations only. In a letter to the biennial’s board of trustees, Elizabeth Farquharson, chair of the board, said: “We are deeply grateful for the support with which this institution has been able to continue presenting the works of our distinguished curators and artists in the years following their death and wish them continued success.”\n\n\nThe Museum of the African Diaspora (MoAD) in New York has appointed Lizzie Dearden as its next executive director. Dearden will succeed Ada Al-Khalili, who has helmed the museum for nearly two decades, and will take up her new post on January 18.  “Lizzie’s leadership and history at MoAD help us to better understand the power of art and culture in connecting audiences, fostering social change, and creating new practices,” said museum chair Daniel H. Weiss. “I’m excited", "The next Biennial should focus on the exhibition’s creation and transformation over the course of four decades, and should consider the possibility of a new classical wing. It should also consider the option of opening a second exhibition in the fall of 2020. The biennial’s Art of Innovation (2018) opened at the Museum of Modern Art, New York, and featured work by twenty-seven artists, including Michael Tung, Jodi Throckmorton, and Andrew Wright, and was one of several exhibitions organized by the Biennial under the museum’s auspices. The first Biennial East, which opened in January 1979, was also at the Museum of Modern Art. The exhibition, “Winter in East London,” staged twenty-seven years of artist-led events. “I’m so excited to announce that for the first time in the museum’s eighty-five years of operation, this biennial will once again be a place where artists can come together to create something new, something that will last.” The 2018 exhibition “Adeline to Adeline: A Feminist Journey,” which featured work by thirty-six artists, including Adrian Piper, Robert Irwin, and Ter", "The next Biennial should be held at the Henningsjø, followed by the Oslo Biennale in March 2019. The new De Nederlander Kunsthalle will be inaugurated by a presentation of a selection of works by the artist's daughter, Christina Noland; the Danish artist A.A. van der Vorst; and the Belgian artist Georges Apostu.\n\n\nThe Museum of Contemporary Art (MoCA), Chicago, has appointed Genesis Fine Arts director and CEO Amer Sadeh as its next director and CEO. Sadeh comes to the museum from KIK, the Danish contemporary art center founded in 1960 by Fredrik Reinhold and Berit Reinhold, who also helmed Copenhagen’s De Nederlander Kunsthalle from 1994 to 2001, and will take up the post in April. He succeeds Peter Schäfer, who resigned in December after just three years as director of the center.“Genesis Fine Arts is one of the few remaining modern art museums in the United States with a long-standing, dedicated, and dedicated relationship with Peter Schäfer’s family,” said Peter Feeney, chairman of the museum’s board of trustees. “We were thrilled", "The next Biennial should be held at an appropriate site within the city. In the meantime, the team will continue to work on the design and construction of the exhibition space as we continue to evaluate the public and the exhibition.”Herbert\n\nThe Hirshhorn Museum in Washington, DC, has hired Jill Lensch, an art historian and curator, to serve as the Hirshhorn’s Senior Director of Collections and Collections Collections Management. Lensch joins the Hirshhorn from the Art Institute of Chicago where she has worked as a curator since 2012. She succeeds Ashley Taylor, who was hired as the museum’s new executive director earlier this month.“Jill has been instrumental in shaping the Hirshhorn’s collection strategy and integrating the museum’s collection into the public conversation for more than a decade, and her proven track record in navigating the rabbit holes of contemporary art and collecting has made her a strong match for the Hirshhorn’s curatorial efforts,” said curator Amanda Black. “Her ability to bridge the gap between curating and making new art, both as a curator and as a curator’s partner, has been instrumental in shaping the Hirshhorn’s collection strategy", "The next Biennial should be held in 2020, but right now organizers are still assessing the feasibility of the event.  The next edition of the Art in the City event will take place at the Art Museum St. Louis (AMSL) in November 2020. \n\n\nThe Institute of Contemporary Art (ICA) in the City of New York has received a surprise donation of $6.5 million from philanthropists William and Flora Hewlett-Packer. The foundation will use the funds to launch a new initiative to support artists whose practices are currently under-studied or unproven.Curated by Caroline Panetta, the new initiative will divide $100,000 between a number of artists and their families. Among the many groups that will benefit from the initiative are the Artistic Artists Relief Fund, a new Grant for Artists, and the Artists in Transition Fund.The Hewlett-Packers announced the initiative in September 2019, the same month as Art Basel Hong Kong, and said that it would begin with a series of individual workshops at which the Hewlett-Powers could present the projects of their choice. The first workshop is scheduled to take place in December. The foundation said that it hoped the initiative would be a model for how art can", "The next Biennial should also deliver a series of exhibitions that will address the current state of the city, including 'The City, New York: From Its Satellites to Its Walls’ (2019), a project by artist-activists Irene Enders and Ermanno Sala; “Influence of Objects on Contemporary Life” (2019), the same group’s first exhibition, which will take up the theme of “inorganic matter and the influence of artists.”\n\n\nThe Los Angeles County Museum of Art (LACMA) has received a gift of more than 1,300 photographs by Annie D. Getty. The gift arrived on Thursday, October 29, from the Getty Trust in New York, which was founded in 1971 by the two sisters Annie and Helen Getty.The Getty Trust has donated the photographs to LACMA as part of a three-year, $10 million gift program that also includes the acquisition of more than 1,300 photographs by artists whose works were previously in storage at the Los Angeles County Museum of Art (LACMA), such as Josef Albers and Charles Saatchi. The donation includes:• Approximately 1,300 photographs by artists such as Albert Oehlen, Iris Eli", "The next Biennial should be held in the spring of 2021. A version of the exhibition will also be staged in Shanghai in the spring of 2022. The American pavilion will be created in collaboration with the Metropolitan Museum of Art and the Getty. The exhibition will include works by twenty-two artists, including Arsht, CPM, et al., and will be held at the Smithsonian American Art Museum (SAAM) in Washington, DC. \n\nThe Metropolitan Museum of Art (MoA) in New York City is planning to close its doors for a period of eight months to prepare for the coronavirus pandemic. The museum has been closed since March 23, when it began a one-month closure following a second-degree burn on the hand that took place on Tuesday, March 22. The first- and second-degree burns, each requiring at least three weeks to recover from, took place at different locations around the city.According to a statement issued by MoA, the extreme heat and humidity conditions in China are making the coronavirus outbreak worse by making the virus more contagious. As a result, the museum is anticipating a loss of more than one hundred works and has already downsized its exhibition schedule. “The Metropolitan Museum of", "The next Biennial should be held at the Paris-Helsinki campus (pictured) in January 2021. \n\n\nThe Royal Academy of Arts (RA) in London has introduced three new licenses designed to encourage greater use of digital technology in its institutions. Critical Approaches, a digital-only platform that caters for artists and thinkers, has launched in the United Kingdom. The site will host twelve artists annually, in a series of shows organized to explore the digital landscape. The platform will also host a biennial biennial exhibition in the spring of 2021. Exhibitions will include the work of Adam Barlow, Katy Cleaver, and Thomas Deleuze and Filippo Cattelan; the work of Gino Gattoni, Andrea Hartigan, and Manfred Koons; and a retrospective of the work of Petra Hüstenberg and Andreas Zangewitz. In February 2019, the academy announced that it had raised $28 million to create the new grants program, which will focus on \"enhancing the access and use of art for the benefit of all, including the most vulnerable, through the use of the digital platforms of tomorrow—including digital platforms that are open to all, accessible anywhere, at any time,", "The next Biennial should be staged in 2020, after the seventy-eighth anniversary of the Noguchi-Heller Foundation, which will focus on contemporary art in the United States.The new venue, which will occupy a former coal-burning power plant in the industrial neighborhood of West Eden, will feature work by more than seventy artists, including David Cage, Peter Dahlin, and Janes Doran, and will run from January 7 to January 13. The exhibition will also feature work by artists who have contributed to the Biennial as well as work by artists who are currently or have worked in the United States. The biennial will present works by artists from twenty-two countries, including Cambodia, China, Japan, Korea, Mexico, and Pakistan.\n\n\nThe Museum of Modern Art (MoMA) in New York has hired Laura Cortese as its next director. Cortese, who currently serves as director of curatorial affairs at the Museum of Modern Art in New York, will be responsible for the development of the museum’s collection and exhibitions as well as representing the institution in educational and public programming.“Laura is a visionary leader in museum development who brings an extraordinary breadth of museum experience, curatorial expertise, and confidence to our", "The next Biennial should take place in the city in 2021. “We have been working for some time to facilitate a timely and public-friendly event, and now that we have that opportunity we are working to ensure it will be a very good one,” said Harald Szeemann, director of Munich’s Max Hölle Gallery, and the Biennial Museum. The artist-run events will now be hosted by the Max Hölle Gallery in Munich, while the biennial museum will continue to take part in the city. Munich’s Cultural Heritage Center was also released a two-hundred-year-old painting by the German Expressionist Ellsworth Kelly to mark the occasion. All events will be hosted by the Max Hölle Gallery and the city of Munich. \n\n\nThe New Art Museum Houston (NAMI) has received a gift of twenty-six works from the collection of Howard Carter. Carter, a Houston native, was the namesake of the Austin Street-based artist-run nonprofit, the Carter Center for Contemporary Art, and served as the foundation’s visionary curator. The works, which come from the collection of Margo Steegmann,", "The next Biennial should take place in 2021 and the first in 2022. In the interim, Museums Finland is supporting the Finnish Cultural Heritage Center (MHC) to prepare for the event. The biennial will, among other things, include a new exhibition dedicated to the revolutionary work of Finnish painter and sculptor Kymie Rönkkö.The exhibition will also include a selection of works by artists who represent Finland, including Johanna Salminen, Osipa, and Guarani Wineland. The theme of the Helsinki 2020 Biennial is “Art as Activism,” and will be “The Future is Present.” All participating artists will receive a certificate of completion from the museum. The 2020 biennial will also feature works by artists who were previously selected to participate in the first edition, but were not selected for the second edition. The 2019 exhibition, which was organized by the Finnish art agency Umea, was held at the Finnish National Museum in Helsinki.\n\n\nIt is the second time in less than a year that the Museum of Modern Art (MoMA) in New York has come under scrutiny for allowing a controversial $10 billion expansion of its Museum of Modern Art in its former location", "The next Biennial should be held in 2020, and that would be in London.” \n\n\nThe Metropolitan Museum of Art in New York has appointed Sara Satterwhite as its next director. She succeeds Carol Christie, who was promoted to deputy director after Christie departed the museum in January 2020, and will take up the post in January 2021.“Sara is an excellent leader who has proven time and again that she is highly valued by our staff and the board,” said board chair Deborah Katz. “We look forward to working with her to further the museum’s mission, which she has championed since she began at the Met in 2016. We are confident that with her experience and leadership, she will further the museum’s growth and strengthen the museum’s relationship with the communities we serve.”Sara’s predecessor, John LaGuardia, who retired in July 2019 after eighteen years at the helm of the museum, took the helm in July 2019. During his tenure, he completed the expansion of the museum’s collection by adding new galleries, renovated historic spaces, and launched the museum’s annual \"Move in\" event.Commenting on her new role, Satterwhite", "The next Biennial should be held in 2021. The first was staged in Mexico City in 2017 and featured the works of twenty-seven artists, including Renata Pape, Stuart Parker, and Jody Rogac.\n\n\nThe Museum of Arts and Design (MAD) in New York has hired Alexa Key, a Cuban American curator and writer, as its next curator. Key will be responsible for helping THQ’s new licensee, Electronic Arts, to gain access to the Grand Central Terminal in Manhattan and the Hudson Yards redevelopment project in Queens, as well as the South Bronx.“Alexa is a gifted and ideal candidate for this critical role,” said THQ president and CEO Rich Miller. “Her understanding of both contemporary and historical craft and her commitment to equity and diversity in her curating are essential for Electronic Arts to continue to grow as a creative and cultural space for artists.”Key comes to MAD with a strong history of working with artists, including working with David H. Koch on the forthcoming “Abraham Lincoln: Vampire” exhibition, and has previously taught at the School of the Art Institute of Chicago, the University of California, Los Angeles, and the School of the Art of the Arts in New York", "The next Biennial should be held in 2023. The museum has also released the full list of current exhibitions that will be featured in the “Future of Art” exhibition: 1. The Biodiversity Intersection (2019) 2. The Biodiversity Initiative (2020) 3. The Biodiversity Research Centre (2020) 4. The Biodiversity Research Group (1923–2023) 5. The First World War Exhibition (1917–1921) 6. The First World War Exhibition (1909–1921) 7. The First World War Exhibition (1903–1921) 8. The First World War Exhibition (1904–1921) 9. The Future of Art Biennial (2018) 10. The First World War Exhibition II (1908) 11. The Biennial of Art (1918)\n\nThe 1973 documentary To the Stars, starring Jack Nicholson and Paul Newman, about the American flag and its history of racial segregation, has been selected as the theme of the seventy-second edition of the Los Angeles LGBT Film Festival. Coinciding with the ten-year anniversary of the", "The next Biennial should be in 2021. The institution will evaluate the proposals in a comprehensive manner and will decide whether to award the contracts on a case-by-case basis. The full list of the participating artists is as follows: Christo, Jinan, Lionel, Marjorie,\n Lévy Gorvy, Paris. Venice Artano-Bicocca, Italy. Vintage Art, New York.  CALVADO, Italy. Fondazione Luca Cercietti, Venice. Galería de las Casas, Barcelona. HORSEN, Switzerland. The Artist Prize, Oslo. Nicknamed the 'Birthplace of Art', VICINE, New York. Art and Language, New York. ArtPlace, Miami Beach. ArtPrize, New York. ArtPrize Winner, New York. ArtPrize Finalist, New York. ArtPrize Winner, New York. ArtPrize Finalist, New York. ArtPrize Finalist, New York. ArtPrize Finalist, New York. ArtPrize Final", "The next Biennial should start in March 2020 and will include thirteen artists, ranging from young, emerging and established, and from ten countries. The project will be inspired by the theme—“The Death of Cultures,” which was included in the first Biennial—and will be hosted in the city of Biennale di Risaggio. It will follow the opening of the exhibition “Cultures of the Sistine Chapel” and will additionally involve the installation of new works by artists such as Carolina Alarcon, Juliana Alvarez, Joao Bechet, Alberto Ceci, Agustin Cesarco, Guadalupe Rosales, and Suzan-Lori Parks.Among the full list of participating artists is a group which comprises of EXO-M, AOA-K, Biju Dhar, and Biju Dhar/Dhanush. Dhanush will also perform at the event. Hirshhorn Museum’s director Peter Rosenberg said: “Over the course of our nearly fifty-year partnership with the Hirshhorn, we have witnessed first-hand the extraordinary breadth and depth of artistic talent in the collection. We are privileged to be a part of", "The next Biennial should be held in 2021, when the biennial will come to an end.\n\n\nThe Metropolitan Museum of Art in New York is planning to reduce the height of the institution’s Leonardo da Vinci statue by more than seven feet in an attempt to make the sculpture more accessible to visitors. The move is part of a major $4.5 billion renovation project that will overhaul the building and its surrounding campus, making it more accessible to pedestrians and bicyclists.“This is an ambitious project and all of our elements are in place,” David Feldman, the museum’s director, said. “It’s not just about making the sculpture more accessible, it’s about making the sculpture more visceral, more personal, more intimate, more intimate with the body, more personal with the heart, more personal with the soul, more personal with the mind, more personal with the body.”According to Christie’s, the work, which was created in 1963, is valued at $58 million. The project, which will also involve the demolition of the statue of Leonardo’s brother Piet, Piet Mondrian, and the restoration of the stone base, will take at least four", "The next Biennial should take place in 2020 to coincide with the opening of the new Museum of Contemporary Art Shanghai. \n\nThe Netherlands has announced that it will remove six hundred works from its collection which were never publicly exhibited and which are currently on display in the country’s major Dutch museums. The works, which were selected after an open call, were part of a program that began in 2009 to address curatorial issues that had arisen from a series of curiosities, the Künstlerhaus, which is housed in a former coal mine in the Netherlands’s city of Eindhoven. “We are concerned by the recent exhibition ‘The Evolution of Modern Art’ (2019–2020),” said Munich curator Joost Vossen. “That exhibition was very much in keeping with the German tradition\u0097it was about to open, but it was abruptly canceled. It is not a political statement, but a matter of ethics.”The works were selected after an open call in the Netherlands, which is home to twenty-six nations, started in 2009. Among the works on display are a selection from the Frieze Museum in London\u0097some of which have never been seen", "The next Biennial should be held at least twice a year. \n\n\nThe Louvre in Paris announced on Monday that it is launching a new program that will involve the exhibition of works by women artists, including Amalia Catellani, Sabrina Galindo, and Rosalind Nash, and will begin inviting selected artists to the institution for a Q&A session.The initiative, titled Women in Art, will showcase work by forty women artists from sixty-five countries and territories. Among the curators are Amalia Catellani from Peru, Sabrina Galindo from the Philippines, and Rosalind Nash from the United States. The program will be presented in conjunction with the upcoming exhibition “Women in Architecture” at the Louvre. The program will be organized as follows: 1. The exhibition “Women in Art” will be curated by Amalia Catellani and will be presented by the Musee de la Louvre in partnership with the Louvre. 2. The exhibition “Women in Architecture” will be curated by Sabrina Galindo and will be presented by the Musee de la Louvre in partnership with the Louvre. 3. The exhibition “Women in the Arts", "The next Biennial should be held in the autumn of 2020.\n\n\nThe Art Newspaper reports that the Italian government approved a $25 billion bailout package for the country’s cultural sector last week, bringing the total bill for the fourteenth edition of the Venice Biennale to $55.4 billion. The legislation, which was passed by Italy’s Senate on Tuesday, establishes a $25 million recovery fund for cultural institutions and will also allow the state to issue $5 billion in bonds.The legislation was passed amid efforts to hold the government and the pharmaceutical and energy sectors accountable for tackling the global outbreak of the novel coronavirus. The legislation also includes a provision that will allow the Italian government to lend up to $3 billion to private and public sectors impacted by the pandemic. The funds will be used to help companies such as UBS, which has pledged $1 billion; Unilever, which says it will mobilize up to $500 million; and CIMAM, which has pledged $500 million, expand health care and nutrition services for the poor and middle classes; and establish a national fund for the arts.The legislation also addresses the financial crisis caused by the coronavirus and establishes a relief fund of $500 million which", "The next Biennial should take place in 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it is working with the nonprofit the Pavilion Foundation to launch a new program that will provide free, year-round programming to low-income Latino artists.The program will debut in 2020 with an exhibition titled “Horizons of the Past: Art and Design in the 1970s” and will focus on the legacy of the late Honduran designer and industrialist Félix Alarcon, whose work is celebrated in the works located within the museum. Alarcon’s legacy is intertwined with that of the Mexican designer, artist and philanthropist Ildemar Alcantara, whose own legacy is intertwined with that of the late Mexican designer and philanthropist Gustavo Dudameli, whose own ephemeral sculpture and paintings are borne out of his relationship with Alarcon.The partnership between the museum and the foundation was established in 2016 after the Mexican artist and designer Tania Fernández-Montaner, who died of cancer in 2010, convinced MoCA to sponsor her work for a residency program that will simultaneously engage with an online real-time database of artist names and locations and", "The next Biennial should be held in 2021. “I would like to see the museum become a living, breathing cultural entity, and have the opportunity to share the history of my childhood with the public,” said Anuja Adli, chair of the board of trustees of the Arts and Design Biennials. Adli added that the proposed budget for the 2020 edition is $2 million. “The Biennial has given voice to more than 3,400 children in the city of Gwalior, and I feel honored to have been able to present the child-centered exhibition ‘Aditi Bhabha and the Children’s Art Museum” at the institution. While the exhibition was initially conceived as a platform for artists to explore their works, it has since evolved into a platform for the collection and presentation of the work of contemporary artists, particularly those whose works are in disrepair.  “This year’s Biennial welcomed in record numbers of artists, and provided a great platform to engage with the work of our artists, many of whom are struggling,” said Mali-based artist and curator Isamu Noguchi, who was honored to be included in", "The next Biennial should be held in the city in three years, and a fourth in 2020. It will then return to Helsinki, and will continue with a series of exhibitions that have been organized in tandem with the 2020 edition.Each exhibition will comprise a collection of objects that represent a specific aspect of art. The themes of 'Spirituality and Art' and 'Spirituality and Life' will be different in each exhibition, but the themes are the same, and the show will provide the opportunity to recognize the symbolic possibilities and the historical narrative of contemporary art, both in the contemporary art world and in the past.\n\n\nVisitors to the Museum of Modern Art (MoMA) in New York will soon be able to enjoy 360-degree views of the Museum of Modern Art in the city through their mobile phones. The museum introduced the technology last year to include a virtual reality experience in its landmark reopening, which marked the fifteenth anniversary of its opening in October. When MoMA reopened in August, it was plagued by the Covid-19 pandemic. “For a museum that prides itself on engaging with the lives and work of artists, it’s disheartening that this pandemic has made matters worse,” said museum director", "The next Biennial should focus on the partnership between artists and the museum’s collection and will aim to “expedite the story of the exhibition, enhance the exhibition experience and enhance the public experience.”According to the New Art Dealers Alliance (NADA), the $1.5 billion Biennale will address the exhibitors, distributors and visitors needs and will be held at an estimated capacity of 150,000 people. The show will be hosted by the Museu de Arte Contemporáneo in Madrid and will take place at the Palacio de Barcelona.The full list of participating artists is as follows:Curator, researcher, artist, writer, educator, teacher, and researcherFernando de Alvear (Spain)Dario Catellani (Italy)Dario Carvalho (Brazil)Arabile de Souza (Spain)Ana Buchera (Spain)Aran Fattal (Italy)Arsht Farman (Switzerland)Mari Greene (United States)Yoshitomo Kondo (Japan)Angelina Galindo (United States)Pérez de la Peke (Brazil)Sara Ferrara (Spain)Hanne-Marie Geiss", "The next Biennial should focus on the role of science and technology in shaping social and political change, with a view to generating new knowledge and forging new partnerships. The museum should pursue new research projects that embody the museum’s mission to be a focal point for the cultural life of Japan and the world. This is a crucial time for the museum. The government adopted a series of stimulus packages, including NH-1717 and the Japan Science, Technology, and Society Restoration (STS) Act, that aim to mitigate the global CO2 crisis and to support the museum’s operations as it restructures its collection in an attempt to reduce its footprint. The restructuring of the collection will also involve the reorganization of the museum’s exhibition program.The new exhibition program should focus on the challenges and opportunities presented by technologies in various settings, including at home and abroad. The exhibition should adapt to the evolving needs of a contemporary society and reflect an ongoing exploration of the themes that have shaped the museum’s collection for more than sixty years. The project will also try to address themes that are currently understudied, underutilized, or underappreciated.\n\n\n\n\n\nIt has been a defining decade for the contemporary art historian,", "The next Biennial should be upon the occasion of the fifteenth Olympiad, in the year 1938; and the twenty-eighth should be upon the occasion of the thirty-fifth United Nations, in the year 1964.\n\n\nThe fair will welcome visitors from twenty-nine countries and territories, including the United States, France, Germany, Ireland, New Zealand, Norway, the United Kingdom, and Turkey, and will run from September 20 to September 22. The first exhibition, “Art & Design: China’s New Emerging Power,” will feature thirty-four works by twenty-nine artists, including Ai Weiwei, Franz Schubert, Jean-Michel Basquiat, Claudia Burri, Hans Braak, Todd Haynes, and Yelena Iskowitz. The second half, “Art & Design: The Next Golden Age,” will present more than seventy works by forty artists, including Tomahawk Linn, Kyary Pamyu, April O’Leary, and Yelena Voroshilova.The exhibition will be organized in collaboration with Shanghai’s Chinese government, the Shanghai Fine Arts Museum (SFAM", "The next Biennial should take place in 2020 and will focus on the themes of sustainability and the environment, with an eye toward analysing and reimagining the biennial as a symbolic expression of our collective existence. Its first exhibition will be “Away from Home: Contemporary Art at the Wartime in a Post-War Age,” which will present forty works by contemporary artists, including Oliver Huckle, Isamu Noguchi, and Lawrence Abu Hamdan\u0097a selection of which will be on view at the museum in February 2021.The biennial will explore themes such as the Holocaust, the impact of war on modernity, and the role of art and architecture in the transformation of wartime environments. It will also commemorate the 75th anniversary of the Battle of Britain and will present an exhibition of works by contemporary artists in conjunction with the opening of the new biennial in Württemberg in 2022.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines for the display of works by fifty-eight contemporary artists during the annual Compassionate Visions, a platform created by the Center for Italian Modernism in the City, displaying work by forty-one artists throughout the city and its surrounding envir", "The next Biennial should take place in the spring of 2021, and the next will be in the autumn of 2022. The 2022 edition will consist of a retrospective of works by thirty-three artists and will be organized as a combination of a biennial and a public work, with the collaboration of an international team.“The concept of the Biennial is to give a platform for young and established studios of contemporary art,” said Mark Sisson, director of the Biennial. “The Biennial will be an opportunity to see how the art of the future will play out in the contemporary art world. It will include a series of exhibitions that will bring together the artists selected for the biennial.”\n\n\nNew Orleans’s Museum of Modern Art (MoMA) has appointed Dr. Michel Grivell as its next executive director. Grivell is currently the director of the New Orleans Museum of Art (NOLA), which is located within the Louisiana Purchase Historic District in New Orleans, and has been a board member of the institution since 2006. He succeeds Daniel Rivera, who retired in March 2019 after twenty-four years at the helm of the museum.“Grivell’s appointment reinforces our commitment to", "The next Biennial should be held in the spring of 2020. The dates for the 2020 event have yet to be announced.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has announced that it is rebuilding its iconic building, the Art Institute of Chicago (ICA), with a new, more sustainable design in an effort to reduce the institution’s greenhouse gas emissions and conserve the building’s environment. The move is part of an international campaign to re-purpose buildings to reduce their greenhouse gases, and also involves the renovation of the museum’s 139,000-square-foot basement, which was converted from a climate-controlled research and exhibition center in 2000, and the relocation of the institute’s permanent collection.“The redesign of MoCA is about much more than just a building,” said Ira Simon, director and CEO of the museum. “It is also about a stronger, more cohesive, and interconnected museum. It is about giving audiences a more compelling experience by making the ICA a more exciting destination, bringing together the best in contemporary art and design.”The new campus, which consists of two buildings, the Art Institute of Chicago and the Museum of Contemporary Art, Los Angeles, will", "The next Biennial should take place at the Antwerp Museum of Fine Arts in the city of Antwerp from May 14 to May 16, 2020. The event will serve as an opportunity to present a new exhibition of works by the König-STEINbER collective and will mark the third meeting of the group.\n\n\nSinger-songwriter, actor, and producer John Legend has been named the recipient of the 2019 Paula Merritt Prize for his artistry and creativity in bringing distinctive, politically activist, anti-capitalist, and socially engaged work to the public's attention through his practice. Legend has received the prize for his work The Life Aquatic With Ray J, which he recorded with his band in 2015, and his work Behind the Music, which was released by the artist and his label, Raye last year. The prize, which was established by Paula Merritt and her husband, John Legend, is named for a community-based organization dedicated to the promotion of environmental justice.In honor of the award, which was founded in 1988 by Paula and John, a former executive director of Greenpeace, an independent Los Angeles–based organization that focuses on environmental justice, the organization will offer $20,000 to any artist that has been", "The next Biennial should coincide with the opening of the new Kunsthalle Brescia in Milan. The first edition of the exhibition, titled “Who is Galileo?,” will open on October 16.The exhibition will feature a selection of works by more than fifty artists, including Carlo Cipolletta, Adriel Piazza, and Urs Fischer, and will feature a selection of experimental and contemporary works by forty-five artists.“We are delighted to present the next Biennial in the form of the Biennale di Praemium in Milan,” said Stefano Cipolletta, director of the Biennale in Milan. “We have already been working together for several years to produce a new exhibition, and this is the perfect time to start it. The exhibition will be a mix of new works and selected works, both selected by the curators for their personal interest and by the artists themselves, and will take place in the Palazzo e le Pascatello, in a contemporary setting in Milan. We hope that it will be a breakthrough exhibition for the artists.”The collection consists of works by thirty-six Italian-born artists, including Angelo Cattelan, Roberto Cip", "The next Biennial should be held in the summer of 2021. Whitney Museum of American Art will host another exhibition in the fall of 2022.  The Next Biennial will be held at the Brooklyn arts space the Roosevelt, as well as at the Brooklyn Museum, the Bronx Museum of the Arts, the Brooklyn Academy of Music, and the Brooklyn Museum. The next iteration of the Biennial will take place at the Brooklyn Navy Yard from May 19 to May 22, 2022. The artist-run space the BERN-RADIO will also be relocated and will remain open in the same space for at least six months after the event. The biennial will be on view through October 21.Artist Michael Kelley’s first solo exhibition at the space will be “The Light of My Skin,” which will be on view until November 15. The biennial is one of multiple projects being organized by artists and cultural workers in the city to encourage cultural and social engagement. The artists include Karl Lagerfeldt, Alessandro Piscitelli, Alexander Panetta, and Anna-Sophie Neuhaus. The biennial will also feature a collaborative work by artist/activist/game designer Clement Greenberg; a mural by artist", "The next Biennial should focus on questions of the meaning of life, the environment, and the natural world, and should aim to redress the anthropogenic impact of climate change. “The exhibition will be inaugurated by the first exhibition since President Donald Trump’s inauguration, ‘Election Observation: Climate Change in America,’ which will be on view from January 20–February 21, 2020, and will be followed by a second exhibition in January 2021, ‘The Art of Climate Change,” which will be on view from January 28–February 31, 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has created two new positions for artists to work with the Los Angeles Unified School District (LAUSD) and the Los Angeles County Museum of Art (LACCA). The first, a professor at the Fashion Institute of Technology (FIT), will oversee a program that will draw from a collection of seventy-five works and focus on how fashion can be a vehicle for social progress. The second, a professor at the University of Southern California, Los Angeles, will focus on how the museum can become a laboratory for ecological issues of the commons. “The two positions are complementary to each other and", "The next Biennial should be organised in May 2019 and be held in the Tanger Palace Museum in London.The city was given the green light to host the biennial by Mayor Sadiq Kahn, who cited the city’s financial health, and the museum board voted in favor of the move. After the biennial, Picasso’s lifetime’s achievement will be celebrated, and the city will host a new exhibition of his works. The project will also include the construction of a new platform for the artist’s works on the city’s waterfront, which is currently slated for demolition.“The past thirty years have been a remarkable journey, and as I begin to leave behind a legacy that will stand the test of time, I want to thank the city of London for the extraordinary partnership that has been forged, and continue to be forged, for art and art history,” said Picasso.\n\n\nThe British Library has announced that Sawang Ngili has been appointed as the new deputy director of the Tate’s collection of tropical and tropical American art. Ngili comes to the institution from the Royal Academy of Arts, where he has served as a curator since 2014. He succeeds Ad", "The next Biennial should be called for an “ecological utopia.” It will be organized in collaboration with the 's local community and will take place at the Skarstedt-designed building in December 2020.\n\n\nThe Museum of Modern Art (MoMA) in New York has welcomed two new members to its board of trustees. One, a former board president, was appointed by the board of directors in a unanimous vote. The other, a former trustee, was appointed by the board of directors.In a statement, the institution said: “We greatly appreciate the board of trustees’ unanimous approval of the appointment of Justin and Greene.[…]” The board chairman, Frank Gehry, added: “I’m thrilled to welcome them to the MoMA family. They’re both experienced and smart, and I’m confident they’ll bring enthusiasm and enthusiasm to the institution over the next five years.”The board of trustees also named Thomas L. Baker, the institution’s founding board member and one of MoMA’s earliest and most influential collectors, as its next president and CEO. Baker will be tasked with guiding the museum through its next phase of construction, which is", "The next Biennial should focus on documenting the history of contemporary art through an exploration of the roots of modernism, the transition from the Italian Renaissance to the Second International and the creation of the institute. The next will explore new developments in the field of contemporary art from a Latin American perspective, while the second will present a selection of contemporary works from the region.\n\n\nThe American artist Richard Diebenkorn will become the first person to receive the diploma of the artist’s studio at the Kunsthalle Basel in Switzerland. Diebenkorn, who is often compared to Pierre-Auguste Pereira in their respective disciplines, will present the work of the studio to the public at the Kunsthalle on March 27. Diebenkorn’s work will also be featured in the exhibition “Eco-Cinema,” which will open at the Kunsthalle on May 4, 2020.\n\nThe National Gallery in London has received a significant donation of more than 1,600 works by thirty-six American artists. The gift includes works on paper, film, sculpture, installation, performance, performance-performances, photography, and sculpture\u0097from artists who are in various stages of their", "The next Biennial should be held in the first quarter of 2019.“We have been working hard to secure the Biennial a long-term future, and for nearly a year we have been submitting proposals in unity with the rest of the international community,” said Michele DeCaprio, director of the Presidio Museum. “Now that the 2017 exhibition has concluded, we are finally able to present our vision of a new Baroque city, a better world, and begin a new chapter.”The Biennial will consist of more than ninety short films, illustrated by the talented and internationally-recognized collection of contemporary artists, and will inaugurate a new visitor-centered public space, the Contemporary Baroque Museum, in the city of San Francisco. The museum will also showcase the work of select artists from the collection in a variety of media and will host programming focused on the history of modernism and the modern period. “Baroque was a movement of visual art, and the city of San Francisco is the center of it,” said Marc Straus, president and CEO of the San Francisco Foundation. “The museum will present the richness of Baroque’s history through the exhibition ‘", "The next Biennial should be held at the Galleria Borghese between March and October 2021; and the next will be held at the Galleria Madre de São Paulo between February and March 2022. The 2022 edition will be one hundred years old.\n\n\nThe New York City Department of Cultural Affairs (DCLA) announced today that both of its arts-focused funding initiatives were temporarily shuttered in March due to Covid-19—the governor’s office plans to cancel the rest of its $5 billion cultural-impact bond program in mid-June and shutter the arts in June, as it attempts to curb skyrocketing medical costs and the city’s ballooning cost of living.The March 31 announcement—made in the waning days of Governor Andrew Cuomo’s second term—ended the city’s $1 billion Cultural Impact Fund (CIF), a $500,000 annual grant program that launched as part of a $1.5 billion overhaul of New York City’s public safety and correctional systems in 2016, and its $350 million Cultural Impact Fund for Arts, a $500,000 grant program that began in 2011 and has run in parallel with the city’s annual carnival", "The next Biennial should take place at the Museum of Contemporary Art, Los Angeles (MCA), in 2021. The 2020 edition will include forty works from the artist’s collection and will be held in the MCA’s new exhibition space, the Pacific Standard Time, on the museum’s campus.\n\n\nThe British artist Mark Rylance is suing the city of Bristol over a $62 million expansion of the city’s Zone 1, a public space that was added to the city’s historic Blacktowne church in 2015. Early this year, the court ruled that the city must lift the ban on Rylance using the interior spaces of the church—the adjacent public green and the churchyard—to make a new public space, the Museum of Bristol, which is currently being constructed.The churchyard is currently being expanded to house the museum’s permanent collection. Rylance, who is currently based in New York, wants the churchyard to be transformed into a gathering space for the public and a museum for the arts. The court ruling is being appealed. The example set by Bristol is that Rylance is likely to be granted permission to use the churchyard and its surrounding area for commercial or political", "The next Biennial should include a conversation with artists in the Philippines who have recently returned from China, such as Faiza Aziz and Adriana Celant. Other themes that will be explored are the birth of new identities as well as the history of the enslavement of indigenous peoples.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has announced that it plans to create a new curatorial role for women artists in 2020. The new department will be headed by Sidi Sahgal, who most recently served as assistant curator of twentieth-century art at the Museum of Modern Art in New York. Its inaugural exhibition will focus on the work of artists whose work was featured in the 2016 exhibition “The Female Body: Women Artists in the Contemporary Art World,” which was organized by the Museum of Modern Art in conjunction with the Women’s History Museum at the Brooklyn Museum.Sahgal will be responsible for fostering the careers of thirty-nine female artists, including Ana Mendieta, Sun Yang, and María Berrío. The exhibition will be on view through April 18.“I’ve long been a fan of their work,” said biennial director Sarah Loyer. “They are especially relevant", "The next Biennial should be held at the Petit Palais in Paris in 2022. The exhibition will take up the theme “Anima, Space and Movement: Technological Interventions and the Anima”\u0097a reference to the work of sculptor Jean-Luc Godard\u0097and will be organized as follows: September 19–October 20, 2022 \nArt Basel Hong Kong: Announced that it will not renew its contract with the Hong Kong-based art collector and collector-diplomat David Chiu, who has been accused of fraudulently winning more than $1 billion in commissions, art sales, and prizes by claiming he had won the works by accident. Commenting on his dismissal, Chiu said: “I reliev[ve] been accused of something and I d rather not go to jail. I just can’t survive being accused by someone I’ve always known as a nice guy and a good friend. I hope that these accusations are unfounded. . . . I have nothing but respect for the legal system. Based on the evidence I have now, there is no basis whatsoever to the accusations.”\n\n\nThe British artist and activist Cillian", "The next Biennial should be held in 2022. \n\n\nThe artist-run nonprofit the Texas Museum of Art (TMA) in Houston has acquired the work of the American poet and activist Frances Oldenbaumer, who, in a 1967 letter, urged the government to create an agency to collect the literary legacy of African Americans. The acquisition includes four works, including a poem and a collage, and will be presented at the TMA’s new art-historical site, the Texas Arts Center, later this month.“In this world that has been transformed and reconceived by technology and mass media, there is a force that is beyond words and consciousness, a force that is beyond the boundaries of time and space, a force that is sadistic and cruel,” Oldenbaumer wrote. “The only way to fight it is to be conscious of who we are and what we are doing, and to remember that all we are doing here is a part of a much larger struggle.”The acquisition was made through a donation of several hundred paintings by the artist and was made through the nonprofit organization the artist’s foundation. The foundation has received $10 million from the Likelihood Fund, the James D", "The next Biennial should be in May 2020. The exhibition includes works from the new exhibition series, “Theoretical Discussions,” which will consist of theoretical discussions organized by artists who are currently in the process of creating work, and will showcase the work of thirty-three artists. The 2019 edition, “Theoretical Experiments,” was organized in collaboration with the late French artist Edith Varnot, and was held in the Bibliothèque Nationale in Paris.The selected artists for this year’s edition include François Terrotin, who will receive a lifetime achievement award at the exhibition, and Osman Sarsam, who will receive the Anne-Marie Laurence Prize for Beauty. Other new works presented include Cindy Sherman’s installation Viewings, which will be exhibited at the museum until February 10, 2020; a new piece by acclaimed contemporary artist Stuart Graves, titled Verstehen, which will open on November 21, 2020; and a performance by Sihan Incident, which will open on March 23, 2021.\n\n\nThe Institute of Contemporary Arts (ICA) in London is planning to open an outpost in the city’s Farringdon", "The next Biennial should be set up at a location in the city, to be developed by a different team, with a different design and with a different vision, and will take place in the fall of 2021. It is still possible to host the Biennial in a museum, at any time, should the city not move the exhibition to a different location. The site of the next exhibition is currently being considered.\n\n\nThe National Museum of Fine Arts (MFA) in Washington, DC, has appointed its first African American director. In a position release, the museum says that Becca Bluestone has been hired as the museum’s interim director.The appointment was made amid the city’s ongoing reopening campaign, which saw the museum reopen in the spring of 2021 and saw large crowds still flock to the institution for screenings of films and TV shows. Bluestone assumes her post following a recent review, commissioned by the National Geographic Society, that found Bluestone “to be entirely qualified to lead the museum in its next phase of its revitalization.”A senior executive at the institution, which also serves as the official custodian of the famous Getty Villa, said that Bluestone “has the experience, knowledge, and temperament to realize", "The next Biennial should take place in 2020, but the organisers said they would look to 2019 for inspiration. \n\n\nThe Royal Academy of Arts (RA) in London has launched an online petition urging the government to divert £44 million from the $57 billion UK arts and cultural sector to social causes. Signatories of the petition, which call for the government to allocate £21.8 billion from its £68 billion UK Economic Impact Statement (UK EIS)—the government's annual economic statement that explains and analyzes government spending and economic activity across the UK—have demanded that the government spend the funds on social causes and not primarily on art.The petition reads: “The UK EIS is a vital stream of information for most politicians and policy-makers, and is often used as a blunt instrument for cutting spending, but the UK EIS only accounts for about seven percent of the UK’s total economic activity. In order to reverse the current trajectory, and to reduce the deficit and the UK budget, the petition authors and others in the arts and cultural sector suggest the UK should divert £21.8 billion from the British Budget to support social causes and arts and cultural institutions. This would be an investment in the future of British creativity", "The next Biennial should take up the theme of the exhibition “Art and Architecture in the Forms of Bodies,” often used in conjunction with the exhibition “Dangere Bodies” (1929–31), which is currently on view in the institution’s new building, the Gallery de France, next to the Gallery of Modern Art in Paris. The 2018 edition of the event, titled “Formology,” comprised forty works by forty artists from twenty-six countries.\n\n\nThe Levitt Pavilion at the Fifty-Ninth Venice Biennale has announced that the tenth edition of the exhibition, “Art in the Streets,” will return to the city of Venice for a twelve-day run on September 22–28, 2020. The opening of the Venice Architecture Biennale is currently scheduled for October 29–November 4, 2020.“The Venice Architecture Biennale is one of the most important achievements of the city’s history, and the first event organized in its entirety by an Italian architect,” said architect Emilio and Anca Zingaretti, the organizers of the event. “We are very proud of the work that was done by both Michelangelo and Gi", "The next Biennial should take place in the autumn of 2020. This will be the year to introduce the first-person version of the exhibition, which will take place in the Biennial archival collection and will be presented by the artists. The show will be organized as a series of 360-degree panoramas, in order to allow the participants to experience the exhibition in three dimensions. The three-dimensional panoramas will be made of over ninety thousand photographs of the exhibition, which will be presented in two parts. The exhibition will open in the Biennial's new building, the Wat. The Magnemuseum will also become a museum in the autumn of 2020 and will host an exhibition of works from the Biennial in the spring of 2021.Taken together, the three exhibitions represent a bold new approach to the exhibition and its history. The first part, titled The Creation of Objects, will highlight the development of design in the twentieth century; the second part, titled The Evolution of Objects, will focus on the biennial’s collection and exhibition; and the third part, titled The Creation of Modern Experience, will highlight the museum’s collection. The exhibition will be hosted by the Fondazione Biennial Tre", "The next Biennial should also consider establishing a teaching platform specifically designed to facilitate the exchange of key cultural heritage materials between the United States and China and should consider the development of educational programs that illustrate the enduring international importance of specific collections and collections-specific exhibitions.”In the January 2018 issue of Artforum, art critic Christopher Knight argued that the September 2019 edition of the Biennial would be “at odds with the legacies of the two countries’ Asian neighbours’ cultures.” Knight also argued that the event would be a “disaster.” The next edition of the Biennial will be staged at the Pittman Art Museum in New York, which recently celebrated its centenary, in February 2021.\n\n\nThe Museums Association (MA), a US-based advocacy organization representing more than 1,600 museums, is demanding that the Federal Communications Commission (FCC) investigate the alleged suppression of critical perspectives during the Trump administration by President Donald Trump’s appointees to the agency. The group is concerned that the move will stifle innovation and creativity within the arts.“Congress has the opportunity to do a lot of good things by ensuring that the FCC remains focused on developing an open and diverse marketplace for ideas", "The next Biennial should include a discussion of the 'significance of the practice of art in the twenty-first century.”Though plans to reconfigure the museum have been in the works for years, the current exhibition is its first in which its central character, Kiki Smith, will not be present. The biennial will also present a selection of work by artists from across the globe, selected by Smith. Among the artists chosen for the exhibition are Elena Akhmetdinova, Kiki Smith, Manda Eriksson, James Wan, and Pierre-Auguste Renoir. The museum will unveil the seventy-third edition of the Biennial, titled After the Wreckage, in 2020.\n\n\nThe Danish artist Christian Hedlund, whose practice reflected and questioned the relationship between pain and the body, has died at age eighty-two at his home in Copenhagen.Born in 1949, Hedlund studied at the Kunsthalle Karlsruppe Karlsruhe in the 1960s before moving to the Academy of Fine Arts, where he later became a professor in the 1970s and became a professor of the same academy in 1988. His work has been collected by the Copenhagen Art Museum (Camm),", "The next Biennial should be held in 2021. Through a partnership with the State of New York, the institution will also work with the New York City Department of Cultural Affairs (CADAA) to develop an updated list of activities for the exhibition. The list of upcoming events will be announced in 2020.\n\n\nThe feminist and artist-led group Purity Ring, which staged a performance art project in which twelve women in their thirties and forties were photographed wearing fake breast implants and given injections of hormones, has been invited to perform at the Fifty-Ninth Venice Biennale next month. The fair, which opened on May 21 and runs until October 30, is currently suspended due to Covid-19, and the organizers are hoping to be able to resume operations in early August.The women who were tattooed and given injections of hormones are known as \"tattooers\" and the subjects of the exhibition are Amelia Doolin, who represented the United Kingdom at the Fifty-Eighth Venice Biennale in 2006; Shawn Mitchell, a thirty-eight-year-old transgender artist and activist in New Orleans; and Janna Alleman, a Los Angeles-based artist whose work is currently on display in the exhibition “A", "The next Biennial should be on January 29, 2020.  The Art Newspaper is also reporting that the 2014 edition of the Biennial will be canceled due to the current global health crisis. The annual exhibition, which focuses on the relationship between art and the environment, will instead be moved to March 27–March 27, 2020.  According to an invitation it wrote to the exhibition’s organizers, the 2019 edition was canceled due to the pandemic.  The event will now be taken over by the newly created Art of the Gathering, which will organize a series of talks and events throughout the year.  The 2019 edition, entitled The World Is Not Enough, was organized by the Manila-based artist, activist, and educator Adriana Miro, who was forced to cancel a lecture she was scheduled to give at the National University of the Philippines (NUP) in Manila on February 23 due to the coronavirus. Miro’s talks, which she said were supposed to be for students, were instead for “the future of the Philippines.” She told the Art Newspaper that NUP was forced to cancel the event after the university received a complaint from a student.", "The next Biennial should be hosted at the New Museum, which is currently renovating its East Building, in 2021, and will be curated by Yoko Taro. By co-organizing the event, the participating artists will focus on the legacy of the African diaspora in the United States. The event will be hosted at the New Museum until November 30 and will culminate with a public performance by the biennial. The first exhibition in the series will be “The Legacy of the African Diaspora in the United States” and will be on display in the museum’s auditorium from April 12 to May 22, 2021. The second exhibition, “The Diaspora in the United States” will explore the African diaspora through the work of thirty-two contemporary artists, and will be on view until April 26, 2021. The third exhibition, “The African Diaspora in Europe, North America, and Australia” will be on view from March 15 to June 1, 2021.\n\n\nThe Art Newspaper has learned that the German legislative council has approved a proposed law that will severely curtail the rights of artists and will leave many unscathed. The legislation, which was passed by the Bundestag", "The next Biennial should be held at the Greek city of Girona in June 2020. The concept of the exhibition is to integrate the art of the African diaspora with that of the European continent. The opening of the exhibition will be synchronized with the Greek Festival of the Arts and the upcoming Festival of Varos. The exhibition will also feature the first work by the Egyptian-born, Australian-based artist Daphne Atassi. The festival will also spotlight the work of emerging and established artists. Additionally, the biennial will be a platform for women artists.The event, which was founded by the Pan-African art historian Malawian artist Salalba Mabar, will run from February 24 to March 7. The winner of the biennial will be announced in June 2020.\n\n\nYale Union, a nonprofit arts organization in Portland, Oregon, is launching a new ten-week summer internship program. The summer program, which will emphasize artist-led, experiential, and community-building experiences, is funded with a $2,500 grant from the Ellison Family Foundation. Inaugurating the program is a series of public lectures, which have been organized by renowned educator and activist Carolyn L. Rimer.“With", "The next Biennial should be a celebration of the children of European immigrants, but also of the history of their children, and of the future of Europe and the world. I wanted to highlight the importance of the children of immigrants, and of the lasting contributions they make to our society.”Since the festival’s inception in 1973, a Boston-based nonprofit, the Boston Cultural Center, has distributed nearly two hundred awards totaling more than $6 million to various St. Ann’s children. Since its inception in 2003, the center has also offered more than $250,000 to more than seventy local charities, including the Children’s Museum of Boston, the Diocese of Boston, and the Archdiocese of Boston.\n\n\nAs the world mourns the loss of lives and limb in the ongoing global pandemic—the number of deaths nationwide is now well over 10,000—more cities and states are enacting and enforcing health and safety measures to prevent the spread of Covid-19, the bacteria that causes the coronavirus—and more artists are embracing social distancing to promote safe travel and social distancing in concert with artistic practices and the physical environment, and to benefit their communities.In Florida, the Sunshine State,", "The next Biennial should be titled “The Future Is Present,” a reference to the artwork of the same name by Hungarian artist Andre Gantz, who was assassinated in Paris on September 5, 1990, and whose work is considered a landmark of the history of the modern art world. The exhibition will also include works by artists such as Sergei Grosvenor and Rineke Dijkstra.An international jury comprising Art Artnet, Artforum, and Artforum editors Léa Adams, Maxime Chateaubriand, and Sophie Ghent will select an artist for the forty-third edition of the exhibition. The biennial will address the evolution of the European contemporary art movement, its relation to contemporary culture in the United States, and the current state of contemporary art in Europe. The artist chosen to represent France is David Guillen, who will paint a work for the exhibition which highlights the enduring influence of the late Belgian sculptor Marc Chagall on the development of the French avant-garde. The theme of the year 2020 is “Redemption,” a reference to the artist’s late wife, Franca Guillen, who was a staunch advocate of the artist’s work", "The next Biennial should take place in 2021. The next edition, titled “Towards a Century of the Biennial,” will follow the theme of the previous three. The exhibition will feature work by twenty-eight curators, between the ages of forty and seventy, and will focus on the development of art from a twenty-first century perspective. The 2019 event, titled “Sky Walkers,” was held at Light in a Bottle, the old Grand Central Station, in New York from March 14 to March 15, 2020. “Sky Walkers” was nominated for a 2017 Margaret Chan–directed award at the Venice Biennale for “The City of Water” and for a 2019 Whitney Biennial award for “Invisible Cities.” Celeste Lamoureux, a curator at the National Museum of Modern Art in Paris, has also been appointed director of the Biennial de l'Architecture et l'Histoire. Lamoureux will take up the post in June.\n\n\nNew York–based artist André Breton has been awarded the $50,000 $100,000 Lifetime Achievement Award at American Guild of Arts, which was", "The next Biennial should mark the opening of the Metropolitan Museum of Art. The museum currently has a dormant structure on the ground floor of which is a new exhibition space, the museum’s newly renovated entryway, and the museum’s new galleries. The museum has been working on revamping and creating a new venue at 1325 Fifth Avenue since 2006, when it was still known as the Metropolitan Museum of Art. The museum opened in 1979 and has since expanded to host over seventy million visitors annually, making it the second-largest museum in the United States.\n\nThe Berkeley Art Museum has received a $1 million donation from world-renowned American artist Ada Lovelace. The $500,000 gift comes in addition to the $1 million the institution received from philanthropists Steven H. W. Palermo and Genevieve Eli Franklin, who established the Berg Museum of Art in 1971, and also includes $250,000 for the restoration of Matthew Bishop’s historic building, which is currently being renovated by the San Diego Museum of Art.“This gift and the work of the art world community creates a strong foundation for future generations to appreciate and appreciate the global legacy of Ada Lovelace,", "The next Biennial should be held in the spring of 2020.\n\n\nThe Museum of Fine Arts (MFA) in Boston, Massachusetts, has appointed Leslie A. Harris as its new director. In her new role, Harris will assume the role of director and chief curator of the biennial, called the 373rd, at the Massachusetts Institute of Technology (MIT). Harris will succeed Mary Anne Carter, who has served as director of the museum since 2012, and will begin in her new role on January 6, 2021.“Leslie is a gifted curator who has built a strong and diversified practice through more than thirty years at the MFA,” said director Matthew Teitelbaum. “She is a leader and champion of the art of the modern era and will bring a sense of humor to a very serious topic. The next edition of the 373rd will be a great platform to explore the world in a heightened way and will benefit from her extensive experience.”Harris graduated from the Massachusetts Institute of Technology (MIT) in 2002 and has held various positions at the MFA. She has served as curator of contemporary art, director of the exhibition space the Gallery for Contemporary Art, and a co–director of the arts center in", "The next Biennial should focus on the Indigenous experiences of the exhibition in a historical and contemporary context and will invite future exhibition organizers to build upon the work of previous biennials to present more Indigenous exhibitions.”The 2018 edition of the Montreal Biennial, which ran from March 26 to March 31, was canceled due to the Covid-19 pandemic. The 2019 edition, on display at the museum until March 31, is still on view, and the 2020 edition, which is on display at the museum until March 29, is currently on view.\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Eric S. Berman as its next executive director. In his new role, Berman will be responsible for developing the museum’s relationship with Boston’s local, state, and federal governments. He will take up his new post on January 4.“The MFA is committed to engaging with Boston’s local, state, and federal governments in an ongoing, collaborative, and flexible manner,” said museum director Adam D. Weinberg. “We are excited to welcome Eric to the organization and look forward to working with him.”Berman comes to the museum from the Massachusetts Bay Community Foundation (", "The next Biennial should take place in 2021. \nDayan Galleon, the Swiss city where four of Berlin’s art galleries are located, announced plans to open an outpost in Switzerland. The city of Basel, the birthplace of the eponymous architect Gabriel and the home of the University Berlin, has also received permission from the town to establish a cultural center there.The announcement comes amid growing concerns over the future of Germany’s iconic Stuttgart palace gardens. In April, an exhibition hosted by the German state is set to reopen in the former Prussian palace garden. The exhibition is a plan for the construction of a new museum in the garden, which has housed the gardens since 2004. The restoration project will include the replacement of the original limestone garden and the construction of a new 1,800-seat theater and restaurant.The palace gardens were constructed in the late nineteenth century and were repurposed for the 1896 World Exhibition, which was staged in the former Prussian ministry. The palace was also designated a cultural monument in 1956 and remained that way until 1999, when it was restored and reopened by the city of Basel. The Palazzo di Casalfanti, the former residence of the architect Ludwig Haeckel, also reopened last", "The next Biennial should be in 2022 and will include original works on paper by dozens of artists, including Helga Wechsler, who will present a new exhibition at the Brussels Biennale.   The show will comprise more than fifty works by five artists, including Mirko Soskala, Olafur Eliasson, and Osman Karsay, and will include biennial-specific projects by artists such as Tieö Kleist, Yanir Kon, and Robin Rech, among others. The date of the forthcoming exhibition is unclear.\n\n\nThe Oakland Museum of California (OMC) is planning to move some fifty artworks, including two works by Arakawa, a Japanese artist whose large-scale murals often feature anthropomorphic characters and motifs, into storage units at its Fremont headquarters as part of a $500 million expansion that will also include the construction of a new visitor experience. “The museum is working with the local community to assemble the works\u0097the renovation will extend the museum’s existing program and introduce new exhibitions and events\u0097and is working with independent curator and architect Ronald Gorchov to design the spaces to support the collection and display the works,” said Paul", "The next Biennial should be held at the newly created UCCA, the city’s contemporary art museum, in Lisbon, Portugal, in 2021. However, a new exhibition of works by the biennial’s curators, Miranda and Pedro Rodrigues, is currently on view at the museum. It will reopen in February 2021.For the first time, the biennial will welcome visitors from outside of Europe. The artists will be men and women from all over the world, and will take place in fourteen Sao Paulo neighborhoods. The exhibition will also include a documentary about the artists’ relationships with the Sao Paulo families, and will be based on interviews with the artists and their families.The nine-day event has faced a number of obstacles, including a controversial opening in April 2019, the political unrest in the city in August 2019, and the negotiations for the new contract cycle, which will finalize next year. \n\n\nThe Venice Architecture Biennale announced today that the 50th edition of the exhibition will move to a new venue in the city of Venice in 2021. The move will allow the organizers to present the event in a larger visual platform and will also provide an economic boost to the city. During the construction of the exhibition’s", "The next Biennial should be held at the Cenotaph in London in 2021, but the organizers have yet to decide on a date. \n\n\nThe American Ballet Theater in New York has appointed Mark Gordon as its new director and CEO. Gordon will be responsible for directing a company owned by the company that owns the performance space, which was founded in 1999 by Peter Box. The company, called BoxNation, had originally planned to sell the company to the New York–based investment firm Apollo Global Management (AGM), but changed its mind after the New York City Department of Cultural Affairs (DCLA) refused to sanction the deal. Gordon will take the helm of the company on March 5. Gordon currently serves as a member of the company’s board of directors. He is also a member of the company’s board of directors for the United Kingdom, France, Germany, and Italy, as well as the Paris-based company Innovarello, and is a member of the company’s development and editorial committees.“Mark has been a visionary leader in the field for more than twenty years, and we are deeply grateful for his service to the company,” said Daniel H. Weiss, chairman", "The next Biennial should take place in the summer of 2020. The theme, “Theaetetus and the New World,” will be developed by the artist and will feature work by seventy-one artists working across twenty-four countries.“I’m thrilled to be collaborating with so many talented and committed artists,” said Biennale Director Shimon Wertheimer. “Theaetetus and the New World is an engaging, moving, yet elegant meditation on the fate of the soul and the many worlds that we inhabit.”\n\n\n\n\n\nThe British Museum announced today that artist and philanthropist Simon White, who is known worldwide for his monumental indoor work, The Big Empty Spaces, which spans more than eight thousand photographs, will receive the 2017 Peterlee Prize in recognition of his contribution to the museum’s collection in London. The prize is one of the largest in the museum’s history and is being presented by the Peterlee Foundation to honor White’s legacy. White’s work, which was shot in the late 1960s and early 1970s, will be mounted in a series of one-hundred photographs, each depicting a different experience of the London Underground.�", "The next Biennial should be the first to take place in the new facility. The exhibition will reprise the themes of the previous two biennials. In 'The Electrifying of Life', the theme of the new venue, 2018, will be energy. The event will also incorporate works by the contemporary artists whose work was not previously featured in the Biennial. Titled “Société Autour du développement,” the exhibition will explore the relationship between the artist and the environment, including the impact of energy on the artist and the environment. A selection of twenty-six works, including works by artists such as Mark-Paul Anderson, Tanya Cooper, and Peter Wächtler, will also be on view. \n\n\nThe Henry Luce Foundation has awarded $11.5 million to seventy-nine artists and organizations in forty-eight states for their 2018–19 fiscal years, which concluded on September 30. The grants, which range from $5,000 to $35,000, will support a variety of projects, including the Arnold and Ellsworth Kelly Grant, the Helen Frankenthaler–Hornett Award for the Visual Arts, and the Helen Frankenthaler–Taft Grant for the", "The next Biennial should be on November 18–November 21, 2020. \n\nThe Montréal-born, Los Angeles–based artist, writer, and filmmaker, Jean-Michel Basquiat, has died at age eighty-four. Known for his surrealistic paintings, sculptures, and installations, which focus on the body and the environment, Basquiat often fused art and landscape in his paintings—simultaneously embodying both nature and landscape—and his sculptures, which often feature nude or semi-nude figures. In his writing, he has often described his works as “supernatural” and has said: “I have always understood that art is the supreme form of consciousness and that the most beautiful things in life are objects perceived and when recomputed. The physical is a virtualization of the real.”Born in Paris in 1924 to a Jewish mother and an atheist father, Basquiat—who was raised in the Soviet Union—studied at the University of California, Berkeley, before gaining residency in the United States. He studied under Jack Hergen, John Lassiter, and George Lucas, and studied at the Fogg Art Museum in New York and at the Museum of Modern Art in New York", "The next Biennial should take place in the Winter of 2020–21.\n\n\nThe Museum of Hungarian Art (Męstek Museum) in Budapest has appointed Konstantin Malofee as its new artistic director. Malofee comes to the institution from the Kulturstiftung Stuttgart, where he has served as director of exhibitions and programs for the past ten years. He succeeds Manfred Istvánsson, who has served as director of Męstek Museum since 2015, and will begin his position in March.“Konstantin’s experience and knowledge complements our existing staff and the foundation’s mission, which is to inspire and stimulate the Hungarian contemporary art. He is committed to ensuring that Męstek Museum remains a challenging and demanding platform for contemporary art, while simultaneously supporting the museum’s existing programs and the development of new exhibitions and programs,” said Męstek Museum director Marta Zsigolány. “In this context, we are pleased to welcome Konstantin to Męstek Museum. His clear vision and energy for the future of the museum makes him a strong candidate for the role of artistic director.", "The next Biennial should take place in 2021.\n\n\nThe Art Newspaper has revealed that the French firm Aiët+ has announced plans to relocate its headquarters from Paris to New York. The news comes on the heels of Artforum’s June 20 release of a document signed by Aiët+ founder and CEO Marc Payot that outlines the company’s plans to move its headquarters from Paris to New York. The move will also involve the creation of two new companies: Aiët+ Industrial for industrial design and Aiët+ Design & Interior for design.“We’re incredibly excited to be relocating to New York, the most dynamic city in the US,” said Aiët+ CEO Sander Ghent. “Its artists, designers, and institutions have experienced incredible growth and success in Paris, and we look forward to a future in which these spaces are brought together and housed in beautiful locations that bring people together.”In 2018, Aiët+ moved its headquarters from Paris to New York. The move was part of a $10 million investment made in the city, which also included the establishment of the new architectural firm W.G. Fischl Architects. In 2019, the firm relocated to", "The next Biennial should be held in the second half of 2022. If the previous one has proven anything, it is that people are really drawn to this exhibition. I believe we are seeing a rebirth of what life should be.”In a review of the exhibition in the May/June 2019 issue of Artforum, artist Rachel Blum wrote: “The new, twice-weekly experimental biennial will be an evolution of the already adopted Biennial 2.0 model. It will be essentially a reenvisioning of the South Asian experience, in the West, with a focus on the work of 'indigenous' artists of the West, in the East, and in the South. It will not, however, distinguish between the West and the East. The focus will be on the artist/designer relationship, with a strong sense of political and economic engagement. The question: Will we ever experience another Biennial 2.0? Will we ever experience a time of like-mindedness and generosity in this country?” \n\nAdvertisement - Continue Reading Below\n\nAdvertisement - Continue Reading Below\n\nCFCM, the Center for Contemporary Art in Cincinnati, will receive a $2 million donation from the John S. and James L", "The next Biennial should be held at the Museo de Arte Contemporáneo, in Venice, in November 2021. The fair will include works by more than sixty artists, including Maire Gaber, Jean-Michel Basquiat, and Mark di Suvero, as well as a selection of contemporary and virtual works.The exhibition will also include another edition of the upcoming Biennial in Central Barbagallo, which will take place in March 2022, and a presentation of work by artist-in-residence Naguib Mahfouz.“For the past fifteen years, we have been working towards the creation of a new collection of works by Giuseppe Vermeul, Nico Muhly, et al. Together we have rediscovered the traditional art of Palazzo Fiori and are proud to present the first edition of the third,” said Laura Delaney, artistic director of the Museum. “This exhibition will allow us to present this work and the exhibition in a new way, to create an experience that will appeal both to a younger and older generation, as well as to a wider and more diverse audience.”\n\n\nThe Pennsylvania Academy of Fine Arts (PAFA) in Philadelphia has", "The next Biennial should focus on rethinking the relationship between artist and museum, and should explore the interrelationship between art and the environment, on the one hand, and the body and the environment, on the other. It should consider the relationship between the cultural and the physical space in which artworks and the cultural heritage collections are housed. It should consider the relation between the physical and the cultural or spiritual form of human life and its relationship with the environment and the city.”\n\n\nAs the number of people killed in the first ever terrorist attack on a museum in the United Kingdom increased to twelve and the number of people injured more than doubled, the Art Gallery of Liverpool (AGL) suspended its London edition, which was set to run from March 15–March 16, 2019. The event was to have featured works by a selection of twenty-five artists, including Michael Chabon, Walter de Maria, and Andrés Manuel De Giorgio.The premiere drew a strong response from the British Museum and the British Council, which called the cancellation a “disaster.”“We believe the decision to cancel the show is the right thing for the future of the museum,” David Cameron said. “The exhibition is", "The next Biennial should be a critical step in our efforts to address climate change and address inequality, and as a consequence, we must be responsive to both the local and international communities, and work with artists and communities in our regions to develop and test new technologies to address this challenge.” The Biennial will take place at the Danish city of Jørgensthal in the province of Fården in Denmark.The project, dubbed Atmstrupse-Biennial, was founded in 2006 by artist Katja Nygren and architect Jørgen Stælov in collaboration with artist Sabine Vorst. The idea was to create a series of workshops, which would culminate in a major exhibition, in which contemporary artists would explore the ethical concerns of using materials in their work. The exhibition would also include a book and a performance by Ekaterina Semenova. The first stage would be a “competition of five contemporary artists on the ground,” said Nils Pedersen, the director of the Danish Cultural Centre. The other two stages would be exhibitions of work by the participants. Pedersen told The Guardian that the competition format would test new technologies and would allow the artists to work on themes that reflect", "The next Biennial should focus on the emerging field of queer theory and its conceptualization in the context of America and the United States. The exhibition should also include a review of the new collection of work by artist and theorist Michael Reschke, which opened at the Los Angeles County Museum of Art in 2006 but closed in 2008.A spokesperson for the museum said the venue will not be able to determine a date for the event until later this month.\n\n\nThe Nobel Prize in Physics has been awarded to the Swiss artist, theorist, and educator Arne Eliasson, who will receive the $45,000 prize at an award ceremony at the Herzog & de Meuron–Wenstau in Geneva on November 29. The show, titled “Öngel Geist aus dem Alte Wissenschaft,” will be held at the Zeitischer Garten in Zurich and will honor Geist’s doctoral thesis, “How To Become a Man,” which was published in EconLog in 1999. “In the Nobel Lectures, Eliasson makes a powerful statement about the human condition: He challenges the very foundations of what we think of as a human being", "The next Biennial should take place at the Museum of Modern Art (MoMA) in New York in 2021, and Artadia will field a panel show “Next Biennial: From the Shadows to the Light,” which will examine the implications of art for contemporary life in 2020.\n\n\nThe Stedelijk Museum in Amsterdam has welcomed Markus Kloog and Catherine Wirth to its staff and board. The first pair to join the institution from the film industry, Kloog and Wirth are the founders of the German company IDG, which makes the video game Pirates of the Caribbean series, and their newest venture, the film magazine Film-Tek, which was established by the same two people—Christoph and Claus Kloog—in 2013.Kloog and Wirth are currently working on a plan to create an international arts hub in the city of Mergenbosch, south of Amsterdam, that will connect the city with the International Film Festival (IGF), the Bergenbrug, the Film-Busan, and the Film-Art Museum in Warsaw. The arts complex will also boast a 5,000-seat theater in the city, a children’s playhouse, a restaurant, and a", "The next Biennial should be released in 2021 but has been delaying the date for more than a year. The 2022 event, which will take place in Marseille, France, will follow in 2024. \n\n\nThe National Gallery in London has appointed an independent curator of contemporary art to lead its Department for Media and Culture. Sabrina Benet-Weir, who has previously served as a curatorial assistant at the gallery and as a curator at large, will be the museum’s curator of contemporary art from January 2021 to March 2022.“We are delighted that Sabrina is to be the next National Gallery director, and look forward to seeing her get to grips with the latest forms of art in a compelling and ambitious way,” said Andrew Neilson, the museum’s director. “She is passionate about contemporary art and is committed to cultivating the National Gallery’s relationship with the arts, and to helping the gallery develop further into a global leader in curating and exhibition design.”Benet-Weir previously served as a curatorial assistant at the National Sculpture Park and as a curator at large for Tate Britain. She now also directs a museum in Tokyo called the Ahn Juken Museum.", "The next Biennial should be held in the summer of 2021, and the inaugural event should take place in the spring of 2022. The exhibition will include the artwork of sixty artists from twenty-six countries and will take up themes such as “the power of the body and the environment,” “the future of art, and the role of art in the lives of the present and future.”The selection committee also suggested that the exhibition “should be set in the city of Venice,” and the directorate of visual arts of the city of Venice Federico Barbera told the Art Newspaper that “We are in the process of approaching the artist-in-residence, who is the heart of Biennale, with a particular interest.” The selection committee also said that the exhibition should be “a virtual reality,” and that the theme “should address the existential crisis of the world today.” While the exhibition will be on display for the first time in the United States, the venue will present the first installment of “Projects of the World,” a new initiative that aims to “explore the interconnections and interdependencies of the world.”", "The next Biennial should be familiar to many: The Future Present, where Citra Art and Design, the artists behind the project, will present a series of exhibitions. The show will be hosted at Pirelli Hangar Bicocca, the contemporary art company founded by Alessandro Pirelli in 2001.\n\n\nThe Metropolitan Museum of Art in New York has appointed Caroline McAllister as its next director. McAllister currently serves as a professor of art history and philosophy of modern art at the University of Sheffield. She was appointed after the institution’s board of trustees awarded her the position of director in February, and will assume her post at the museum on September 10.“Caroline brings a deep and compelling philosophical and historical grounding to the museum’s recent and ongoing exhibitions, her curatorial work, and her scholarship, ensuring that we remain true to our mission to foster the research and teaching of contemporary art,” said director Daniel H. Weiss. “We look forward to working with Caroline and seeing what her vision and direction brings.”McAllister, who was the 2010–11 president of the Faculty of Arts and Design, said: “This is an exciting time for the Met. I am greatly", "The next Biennial should focus on the Past, Present, and Future of German Art. The exhibition will be curated by Hiromi Otsuka, director of the Museum of Modern Art, Tokyo. Historical exhibitions have been staged in Hong Kong, Taiwan, Taiwan, and Tokyo, and the exhibition will open in Hong Kong in 2020. The exhibition will also feature works on display at the International Center for Contemporary Art (ICCA), Frankfurt, as part of an exhibition that will include works by artists such as Mary Beth Doran, Lisa Foster, and Hayao Miyazaki. In Japan, the exhibition will mark the seventeenth anniversary of the Japanese pavilion at the 70th Venice Biennale, in 2020. \n\n\nThe Metropolitan Museum of Art in New York has appointed Joan Jonas as the first director of the museum since it closed in 1973. Jonas succeeded Carolyn Porritt, who stepped down following the museum’s closure following an epidemic in which she was diagnosed with cancer in 2012. The museum will not be reopening until 2023, when the museum will be inaugurated by Marc Chagall’s last work, The Sirens of Titan.“Joan’s leadership in", "The next Biennial should be held in 2020, and will be hosted at the Palais de Tokyo.\n\nThe newly acquired land in the centre of Paris consists of more than eighty thousand artworks, as well as several hundred historical sites, including the Louvre, the Centre Pompidou, the Louvre Museum, the Musée National Picasso-Paris, and the Musée de l’Ame. The acquisition also included the estates of Henri Matisse, Pierre-Auguste Renoir, Jean-Paul Sartre, Hélène Delacroix, Pierre-Auguste Kunst, and Pierre-Auguste Van Gogh.The institution plans to construct a new museum dedicated to Marcel Prouvé, the pioneering twentieth-century French artist and curator, and will restore some of his works, as well as the Centre Pompidou, the Musée National Picasso-Paris, and the Musée de l’Ame. The Musée National Picasso-Paris will also be refurbished, and the Centre Pompidou will reopen to the public in 2020.The acquisition also includes the holdings of the Père Lachaise and the Musée National Picasso-Paris, which were", "The next Biennial should be held in 2022.\n\n\nThe Museum of Modern Art (MoMA) in New York has announced that its collection will be featured in the first episode of the sixth season of the HBO series Game of Thrones. The HBO series is a fantasy drama series that follows the adventures of a group of morally conflicted characters in the HBO adaptation of the Lord of the Rings. “Game of Thrones’s fifth season was an exciting experience for us all to deliver on our promise to deliver a show that was unique and original,” said Michael H. Huang, the executive director of MoMA. “It was also a great opportunity to reflect on the history of the museum and to reflect on the future.”The first episode of the sixth season, titled The Broken Man, will air on HBO on March 9. It features the voices of Lena Headey, Lena Headey, Maisie Williams, the new cast additions, and several other familiar characters from the book series. The show will follow the exploits of the Starks of Winterfell, but will also explore the consequences of interbreeding. The sixth season of the HBO series will be themed around the living legend of the Seven Kingdoms, the", "The next Biennial should be a watershed event in the history of the city,” said Mayor Randall Woodfin. “We will return to the biennial in 2020 and ensure that the next iteration, which celebrates its centenary in 2021, reflects the spirit and spirit of the past.”The theme for the upcoming edition is “love and spirituality,” and it will focus primarily on the relationship between the physical body and the divine. The exhibition will also focus on themes of social justice and the environment.\n\n\nThe CNA Museum of Art in Minneapolis has named the twenty-one-year-old director of its contemporary art department, Amanda Corbett. Corbett comes to the institution from the Milwaukee Art Museum, where she has been the director of public relations since 2016.“We are thrilled to welcome Amanda to the CNA,” said museum director Ashley Swope. “Her extensive background in marketing and communication, as well as her deep understanding and love of art and design, will be particularly helpful to our growing and diversifying contemporary art collection. We are confident that she will play a key role in ensuring that the CNA Museum of Art is celebrated as a premier contemporary art museum in the Twin Cities.”The", "The next Biennial should take place in 2022, with a new theme, a new narrative, and a new medium, “The Other,” said the curator, Richard Taylor, director of the new exhibition series, “Bias: Form and Function in Art.”Taylor said that the new exhibition “will not only present the largest collection of historical archival material from the Biennial to date, but will also present a selection of works that are at once timely and incredible.” The first show, “The Other,” is currently on view at the Contemporary Art Museum St. Louis and is scheduled to open in September. The second, “The Next,” will open in March 2020 and will be on view until May 2020.Commenting on the inaugural show, Taylor said: “This is a unique time for contemporary art, and the twenty-first century has witnessed unprecedented transformations and developments that defy explanation. The theme of ‘The Other,’ is an extension of the theme of the past three decades, a reinterpretation of the history of art in order to address the current global crisis.”In advance of the inaugural exhibition, the museum is preparing to host a number of performances,", "The next Biennial should begin in 2020.\n\n\nThe Bechdel Center for Photography at the University of Pennsylvania has received a substantial donation from collector James Turrell. In addition to two sets of 70 photographs, the center will receive three sets of prints, which will be used in conjunction with the exhibition, “Making Sense of Photographs: Photography And The Bechdel Acts” (2019). The gift includes four original prints by artist A.A. Milne, who has had a significant impact on the development of American photography, and two sets of prints by Louise and Lévy Gorvy. After purchasing the works in 1989, Turrell returned them to the Pennsylvania Museum of Art, where they are currently on display in the Bechdel Center’s new exhibition “Making Sense of Photographs: Photography And The Bechdel Acts” (2019–2020).The donation also includes three photographs by the artist Agnes Martin, which will be included in “Making Sense of Photographs: Photography And The Bechdel Acts”“A.A. Milne: The Bechdel Concept,” which will be presented by the Bechdel Center on September 17, 2019; “The Bessies", "The next Biennial should be held at the same time as the Noguchi Museum, in October 2020.\n\n\nThe San Francisco Art Institute (SFAI) is partnering with the National Museum of Women in the Arts (NMNA) in Washington, DC, to develop a new annual biannual award, “The Feminist Performance,” which will recognize the work of women artists. The prize will be presented in the fall of 2020. The announcement marks the first time the award has been presented to a woman artist. The biannual award, which honors work on the theme of “women” and consists of a $150 cash prize and a $100 gift certificate, was established in 2015 by the SFAI Feminist Performance Awards for Literature, Art, and Performance. Previous victims include Larry and Lois Duncan of the Nineties, who each received $100 in recognition of their work for books; and Mary Beard of the Eighties, who each received $100 in recognition of their work for films.Commenting on the 2018 award cycle, co-chairs of the award committee, Glen Peters, Jennifer Lovell, and Brett Littman said: “The feminist performance is a celebration of the legacy of Barbara Wilk", "The next Biennial should take place in 2020. \n\n\nThe Museum of American Art (MoA) in New York has appointed Adam D. Weinberg as its next director. Weinberg comes to the institution from the American Federation of Arts (AFA), where he has served as associate curator since 2016. He succeeds Maurizio Cattelan, who was hired as director of exploration and acquisitions at the AFA in 2018, and will take up the post in January 2020.“The AFA’s board of directors has long been supportive of Adam’s nomination, and we are deeply honored to have him at the museum,” said director Andrew Schoelkopf. “This marks a remarkable milestone in his career and demonstrates his commitment to curating exhibitions at MoA as well as building our extensive collection, which has the potential to challenge the boundaries of art history and to further enrich our public conversations about American art.”Commenting on his appointment, Weinberg said: “I’m thrilled to join the AFA at this exciting moment in its history as we embark on a new chapter as MoA’s director. I’m proud to be working with such a talented team", "The next Biennial should take place in 2023. The announcement follows the completion of the museum’s exhibition “Mirrors in Motion” in January 2018 and the reopening of the museum in December 2020. The Biennial will mark the museum’s 150th Anniversary.\n\n\nRussia and Turkey are preparing to host the First and Third Turin Stages of the Venice Biennale in 2020, respectively, as part of a deal that will see the two countries become the first international exhibition destinations to host the exhibition. The announcement was made during a press conference held in Ankara on Wednesday, February 24, in celebration of the biennial’s 150th anniversary and the reopening of the International Museum of Fine Arts (IMFA), formerly the Astra Bibliothèque.More than two dozen cultural producers, including Ruslan Pomerantsev, the director of the International Museum of Contemporary Art, and the Turkish artist Nusaylu Özalp, were among the participants in the deal, which will also see the creation of a new institute dedicated to contemporary art. The IMA will also receive an additional gift of $11 million.According to the Russian arts daily Kommersant, the two countries are", "The next Biennial should be titled “The Power of Music: ‘The Rise of Electronic Music and the Continuing Power of Art” , with the artist-in-residence as the keynote speaker. The exhibition will also include an artist residency program featuring four artists from the Biennial’s hometown.\n\n\nThe National Endowment for the Arts (NEA) has awarded five artists with the first-ever NEA Artist Fellowships. The fellowships, which were established to support and promote the work of artists whose creative practice is characterized by their willingness to share their creative process with a larger audience, will each be given $15,000. The fellowships were established with funds from the National Endowment for the Arts (NEA). “NEA grants are one of the essential tools of the creative arts,” said NEA director Deborah Cullinan. “They provide a tremendous opportunity for artists to develop their own work and to engage audiences outside the NEA. We are proud to have contributed to the artists’ careers and to have nurtured their creativity in the process.”Among the five artists chosen for the first NEA Fellowships are Tai Gung, Hong Kong; Ch", "The next Biennial should take place at the Museum of Modern Art in New York in 2021. The 2019 event, titled The Future Is Present, explored themes of memory, the past, and the future through works that explored topics such as the need for the future to be remembered, the role of the past in shaping our understanding of the present, and the relationship between the artist and the past.\n\n\n\n\n\n\n\nKerstin Brätsch, the chief curator of the exhibition “Polaris” at the German city of Essen, was fired from the museum for declaring in an interview with the Art Newspaper that she would be forced to resign if the festival was to proceed as planned. The museum has since been forced to cancel the event, which was held in March and focused on the history of contemporary art, and has been working with a Berlin-based preservation company to determine whether it can resume the event in an attempt to prevent damage to the local heritage site, in Essen, by a new exhibition.A statement issued by the Berlin-based preservation company, called “EISVORG,” said: “The EISVORG project is still not over and it will not be finished until", "The next Biennial should focus on a new interpretation of the Stonehenge landscape, and should take place at least ten years after the 2017 event.The BIC could not have chosen a better location for the exhibition, which consists of three films, each of which is an artist’s collaboration with the British architect-historian, Adam Clayton, and will feature work by seventy artists. The collaboration has been inspired by Clayton’s work, which is housed in the British Museum, and was organized by the BIC in partnership with the three artists who made history together as they were featured in the film, the late British sculptor Steve Coogan and his wife, the late Nigerian artist Kionwane Musa, and the artist Ruba Nuland, who is currently incarcerated in Moscow.The Biennial, which is funded by the Biennial Fund, will be staged at the Shoreditch Gallery, which is located near the Shoreditch arts center, the Shoreditch Arts Exchange, and the Shoreditch Museum, in an attempt to “connect the past and the future through the exchange of ideas.”The event will be hosted by the Shoreditch Gallery, which has served as the venue for numerous exhibitions of Clayton�", "The next Biennial should be held in the first half of 2021. “We are still in the process of organizing a show for the first exhibition in the first half of 2021,” Abdulla M. Al-Qasimi, director and CEO of the Abu Dhabi Foundation for Contemporary Arts, told Artnet. Authority for the first exhibition was established by the Abu Dhabi City Council in 2018 in conjunction with the initiative “Each Minute Counts: Art and the Art of Death,” which drew more than 70,000 visitors.\n\n\nThe estate of the late American artist Frank Gehry has filed a lawsuit against the Kushner Companies, the parent company of the late designer Thomas M. Kahn and his eponymous firm, accusing them of stealing design ideas from Gehry’s work and selling them to the high-profile New York firm for only $5 million. The accusations have led the family to sue the Kushner Companies in federal court in New York.In the suit, filed on March 2, the estate claims that the firms used the Gehry estate as a “place of temporary storage and distribution” and that the heirs “have no claim to the Gehry designs.” The family also alleges", "The next Biennial should take place in 2020 and will showcase new and emerging artists. Its theme will be “The Call of the People,” and the show will include a visit to the Piazza della Scala and a presentation of the work of Renzo Piano and the Giacomo Balla.The biennial’s exhibition will be in partnership with the Piazza and Festival Centro della Museo Trocadio in Venice. This show will take place in two stages: 1) From September 11 to September 12 and 2) From September 13 to September 21.The festival will be hosted in the eastern city of Venice, in the Poggio, and in the city of Cagli. The Venice Architecture Biennial will take place simultaneously in both locations. The Venice Pavilion, the Venice Architecture and Design Biennial, and the Venice Architecture and Design Meetings will take place at the Venetian City Hall and the Palazzo Bernini in Venice. The Venice Architectural Forum will also be held at the Venetian State Museum. The event will be hosted by the University Club of Venice (UCLA) in Venice and the Venice Architecture and Design Foundation (VADF) in Venice.\n\n", "The next Biennial should take place in the spring of 2020. The 2020 event will be held at the Kunsthalle Basel and will run through September. The formal invitation to the 2020 event was sent by the Chairmen of the Board of Trustees of the Institute, Andreas Brecheisen and Heinrich Bader, and has been endorsed by the Institute and the International Council of Art Historians. The 2020 event will be a celebration of the twenty-fifth edition of the International Club Internationale d'Art Contemporain (ICCA) in Rechlin, Switzerland. This year’s event will take place in the Krefeld Hall of the Faculty of Arts, the Krefeld Museum of Art, and the Krefeld Art Museum.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has received a $50,000 donation from a group of donors in honor of its 150th anniversary. The gift was made to the institution as part of an agreement between the museum and the city of Los Angeles in honor of the 150th anniversary of MoCA in February.Founder and chair of the Mark Zuckerberg–owned foundation, Justin and Cindy Zuckerberg, gave $10 million", "The next Biennial should take place in 2021. The exhibition will be curated by sea, air, and land, with the final collaborators being the Director of the National Museum of Art, Tokyo; Olu Ojo, director of the National Museum of Art in Germany; and Pablo Picasso, the founder of the studio to which he gave his studio. “While the biennial remains a work in progress, it is evident that in order to create a new project for this year’s exhibition, it would be necessary to abandon the current form and to abandon the current theme,” reads the invitation. The invitation also states that the event “should not be a reflection of the country’s current state, but should be a new way of looking at the present condition of things.”\n\n\nThe Museum of Modern Art (MoMA) in New York has received a donation of 10,000 paintings from the collection of Walter de Maria, who passed away in Santa Monica, California, on December 7. The donation, which included works by artists such as Ad Reinhardt, Vincent van Gogh, and Cézanne, was made by David S. Cohen. The donation also includes the works of ten American artists, including", "The next Biennial should be held in the spring of 2020. \n\n\nThe Museum of Modern Art (MoMA) in New York is planning to hold an exhibition on the legacy of Sixtuia Bantu in 2020. The ten-day event will highlight artifacts from the museum’s collection that were donated by her sons and will include the first public work made by the Bantu family, a sculptural tribute to the artist Mary Serra.“The Bantu family has been a central force in the history of art in New York,” said Michael Govan, director of the Museum. “They shaped the museum to be a truly international museum; an institution that represents the breadth and depth of American art. MoMA is proud to honor their legacy and to present the work The Bantu Lab (The Bantu Collection) for our 2019 edition at the museum.”Bantu’s son, Roderick Bantu, Jr., who founded the contemporary art museum and collection, in the early 1980s, said: “The museum is very much indebted to the Bantu family and to the son Roderick Bantu, Jr., for their extraordinary generosity and for granting permission", "The next Biennial should take place in 2021.\n\n\nArtist-run venues such as the Museum of Contemporary Art (MoCA), Los Angeles, and the Museum of Contemporary Art, New York, plan to close on September 29 in an attempt to reduce the environmental impact of the coronavirus. Museum director James Levine announced that the organization will begin welcoming visitors back on September 29.The announcement follows the departure of director Marc Stafford and director James Cagney, who oversaw the revitalization of Los Angeles’s Museum of Contemporary Art (LA MoCA) and the Museum of Modern Art, Miami Beach. Both men announced their retirement on Thursday.In an email to staff on Friday, Levine wrote: “I am very proud of the work of our talented and dedicated staff and of the work that we have accomplished. However, the trajectory of the last twelve months has not served the long-term health of our institution or the community we serve.” He added that he has been “working hard and fast to align with the needs of the institution and the community,” and plans to meet with the board of directors and staff to discuss co-opting space at the museum, which was founded in 1972 by Charles and Paul Q. Bankhead", "The next Biennial should take place in 2020 and is slated to run from March 8 to March 13, 2021. It will feature four-hundred works and will be on view in the exhibition space of the Museum of Fine Arts, Boston.The biennial will be organized in an exhibition-like fashion, with a focus on the chronological development of the art of the twentieth century. The exhibition will include the works of forty artists, including Celso Massito, Dieter Maffi, and Tami Chaudhari, as well as a selection of works by artists who make up the larger group of modernists, including Adrien Pape, Nina Plumb, Mia Serota, and Wangechi Mutu.The exhibition will also include a short-form performance, a documentary, and an event series. Hassan Al Saadi, a curator and the head of the artist-run biennial, told the Art Newspaper: “We have a long way to go but we have a lot of work to do.”\n\n\nThe Museum of Contemporary Art (MoCA) in San Francisco has announced that it plans to cease operations at the institution in June 2020. The closure", "The next Biennial should be held in the autumn of 2019. The committee involved in selecting the artists for the exhibition will be composed of Rintoul, the director of the Stedelijk Museum; the curator of the exhibition, Prof. Stefan Zweig; and artist Halil Altind, who was selected for the exhibition based on his performance in the exhibition “Immediate Life” (2019).The exhibition “Immediate Life”—a project in collaboration with Halil Altind and Domenico Baratta—was created by Swiss artist Rintoul and began as a collaborative project to present work by artists whose works were on display at the exhibition. The exhibition was moved to the institution of the same name in 2016 and was on view at the institution until March 2019.The biennial will focus on the past and future of the artist-communities of South-Eastern Nigeria. The exhibition will include works by forty-seven contemporary artists, including the Nigerian artist Léa Gbenga, whose images depict life and hope in a post-apartheid state; the Nigerian poet and artist Ninkalani Ndzube; and the Nigerian artist Anusoleo Maki, whose work includes a performance and a", "The next Biennial should also include a professional performance, a cultural exchange, a virtual exhibition, a lecture series, and a reading series aimed at elementary and middle schools. The exhibition-cum-lecture will take place in the Tokyo Metropolitan Museum of Art, which will also get a boost from the construction of a new building to house the biennial’s collection. The exhibition will run through March 8. “I look forward to working with a group of artists whose commitment to art and design is as strong as their vision for the future,” said Mitsuru Tanaka, the director of the Museum of Contemporary Art Tokyo.\n\n\nThe Institute of Contemporary Arts (ICA) in Miami Beach has named Nikita Garcia as its next dean of design. Garcia comes to the ICA in February following a career as a principal at the firm Gensler, where she worked in the interior design and branding sector for many years.Garcia comes to the institute from Apollonia Design and Content, a design and media company based in New York. Introduced in 1997, Gensler was initially founded by architect John Gass, who was working on the design of the Interstate-90 in Miami Beach, but the company changed its name", "The next Biennial should bring together a group of South Korean artists whose preoccupations are “Japan Pacific,” the Pacific between Japan and Korea, and “Asia-Pacific.” It should also include a selection of works by contemporary South Korean artists, including Lee Eun-kyung, Kim Seung-kyung, and Kim Eun-mi, and will be hosted at the University of the First People. The festival will be held at the city of Seoul from September 26 to September 28.The Seoul Art Museum (SAM) announced that it is temporarily closed due to the pandemic. The Seoul Metropolitan Government has yet to publicize any changes to its transportation infrastructure or government programming. In a statement on Thursday, the museum said that it is currently working on a “globally coordinated strategy.”\n\n\nThe 2018 edition of the Biennale of Sydney, the longest-running contemporary art event in Australia, has announced that it will not take place in the capital city, but will instead move to the Lowestoft Estate in southeast England, in order to “unify the exhibition.” The exhibition will be launched in the city in November.Commenting on the decision, the exhibition’s", "The next Biennial should focus on the work of the major international artists of the 20th century, including Loring, Dana, Keira, Lefebvre, and Mann, and should explore the role of art as a tool for social change. \n\n\nThe Fine Arts Museums of Philadelphia (FAUM) is offering free admission to its new, state-of-the-art facility, the Mueller Center, as part of a partnership with the Metropolitan Museum of Art. The free event will run from March 22 to March 29 and will feature works by twenty-nine artists, including Chicago-based artist Jane Panetta, whose recent exhibition “Invisible Walls” at the museum was paired with the Metropolitan’s “In Praise of Art” on April 5.The Met’s new Gothic Revival building, which opened in the former Mellon Building on West Twenty-Second Street in 2013, features a large, open-air gallery, a large auditorium, and a ground-floor showroom. Inside, the exhibition “Faces of Illusion: The Metamorphosis from Gothic Revival to Modernism” will feature forty works by twenty-eight artists, including artists Sarah Bernhardt and Pedro Almodov", "The next Biennial should open in 2021. For the first thirteen years, the museum will be housed within the São Paulo State University (São Paulo State University, São Paulo) and will be operated by the same management team. It will also host a procession of Brazilian artists in 2019.\n\n\nThe Royal Academy of Arts (RA) in London announced today that it will not be able to hold its annual awards ceremony, “The Open Arms,” on October 21 because of the coronavirus. The announcement comes on the heels of the Royal Academy’s announcement that it will not be able to hold its gala, “The End of Days and the Beginning of Times,” either, for the immediate concerns of the Royal Academy and their members.The academy’s president, Christopher Le Brun, said: “The Royal Academy is in a difficult situation and we are acutely aware of the impact that the coronavirus can make on our members and the wider world. We are also working hard to understand how we can continue to support and encourage the Royal Academy for a number of important reasons, including its reputation, the importance of the award given by the Royal Academy, and the Academy’s reputation as an important", "The next Biennial should take place in 2020, and the following year in 2022; as well as the 2020 and 2022 iterations of the event.” The third edition of the event will take place in the capital, Ankara, in 2024 and the next iteration of the event will be held in the capital in 2028.\n\nThe second edition of Art Basel Hong Kong was canceled on March 22, reports Artnet. The ten-day event, which was scheduled to run from March 19 to March 21, was supposed to present the first major retrospective of German artist Leo Rostenhaus\u0097a commission that was organized by the German curator Joachim Meyer\u0097at the venue of the Kaohsiung Contemporary Art Museum in Seoul.According to Artnet, Art Basel will not be penalized for the moving of the works, nor will it be able to remove them from the premises. The event will remain closed until March 24, at which point work will resume. “Leo Rostenhaus was a landmark work at the Kaohsiung Contemporary Art Museum, and was chosen by the museum as the theme for this year’s edition,” said Art Basel head of work, Markus von Lie", "The next Biennial should be held in the Spring of 2021\u0097a fact that was made clear by Akira Nagayama, the president of the Tokyo-based museum, as he addressed the audience of fifty guests at this year’s Venice Biennale: “One should not forget the past. One should not forget the future. One should not forget the present. . . . The question is: how should we live with these realities?”\n\n\nAs the first crew of the International Space Station (ISS) prepares to launch in December, the Russian Academy of Sciences has issued a statement declaring that it will not renew the contract of the #1 place in the world in 2019, when Anatoly Ivanishin was awarded the Nobel Prize. The announcement followed a lively press conference at the Academy on January 7, where Ivanishin, who was awarded the Nobel for his scientific research into radio waves and its possible applications in medicine, technology, and life sciences, called for a change of plans for the institution. Ivan Ilych, the director of the Academy, told the Interfax news agency that the decision had been made in the wake of a conversation with the Russian president, Vladimir Putin, who he said", "The next Biennial should take place in 2020, and Beijing Mayor Lei Jun is expected to announce the dates next month.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is planning to open a new, wide-ranging exhibition, “Hope for a Future,” in the fall of 2020. Titled “Hope for a Future,” the exhibition will showcase work by participating artists from the United States and Europe as well as Canada and Mexico.The exhibition will be organized as a series of “vignettes”—each “vignette” is a movie frame that was created in collaboration with a particular artist and depicts a particular psychological state. The works will be presented as a series of three-dimensional video works in order to reflect the themes of hope, identity, and freedom.“We are thrilled to be able to present the works of these artists in a new way, to bring together their stories, their inspirations, and their legacies to make these works meaningful for future generations,” Lanny Poffo, the curator of the exhibition, said in a statement. “We hope that these works will inspire and delight as we recommit to the study of history and", "The next Biennial should be held in 2021. “The Games of Life’s work is designed to address the tensions that often arise between the Games and life and reflect the ongoing need to rethink the meaning of life and the meaning of games,” said Mark Subramaniam, chair of the International.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has received a $1.7 million donation from the Louis Vuitton Foundation, which was established in 1989 to support the development of exhibitions and collections at the institution. The gift, which also includes a gift of approximately $200,000 from Louis Vuitton, was made in honor of the foundation’s seventy-five-year anniversary.“The foundation is thrilled to recognize the immense contribution made by Louis Vuitton to the success and longevity of the museum’s collection, and to celebrate the foundation’s distinguished history of supporting the arts and celebrating life,” said Marc Spiegler, the founder of the foundation and a partner at the law firm Poznan & Poznan.The foundation’s new grant program will invest more than $3 million in the art of the 2020s, which will be curated by Jennifer Pickering", "The next Biennial should be held at the National Gallery of Art, Washington, DC.  The fourth iteration of the exhibition should be held at the Minneapolis Institute for Art in the fall of 2021, and the fifth should be staged at the Museum of Fine Arts in Boston in the spring of 2022. The quarterfinals for the exhibition should take place at the Cleveland Museum of Art in the fall of 2022 and the semifinals at the Museum of Modern Art in New York in 2021.  The Independent Festival will hold its fourth edition at the Repertory Theater in New York on December 9 and 10. The festival will also stage the fifteenth edition at the Met, which will kick off with a performance by Alex Kapoor, at the Javits Center on January 10 and run through November 29.\n\n\n\n\n\nThe Museum of Fine Arts, Boston. Photo: Evan Ackerman. \n        \n\n\n\n\nThe Museum of Fine Arts, Boston, has announced that it will open its new location on Beacon Street in Cambridge, Massachusetts, on March 9. The institution will be inaugurated by a lecture by poet and theorist Immanuel Kant and will remain closed until January 14, 2020, at which point the building will reopen", "The next Biennial should take place in 2020 and will be hosted at a new location, to be determined. The biennial will take place across twenty-six locations of the city. The city will be joined by over seventy art institutions, including the Museum of Modern Art, the Museum of Modern Art in New York, the Museum of Modern Art, New York, the Metropolitan Museum of Art, the Whitney Museum of American Art, and the Pérez Art Museum.\n\n\nThe Museum of Modern Art (MoMA) in New York has come under fire for abruptly removing a work by a black, ­Album-based artist from its collection. The history of the exhibition, titled Album, is made up of four works by Nari Ward, including the work in question “The Body and the Dance.” The exhibition has also featured works by artists that were not included in the institution’s collection since the artist’s work was first published in the November 1987 issue of Artforum.Ward, who is part of the Black Power collective, told the Art Newspaper that the decision to remove the work was made in the interest of transparency. “The Museum is looking at removing the work from the collection because it�", "The next Biennial should take place between February and May 2021, in a location selected by an international group of curators and scholars led by artist-in-residence Deborah Bonkowski. The exhibition will feature work by seventy-three artists, including Bruno Latour, Janette Laverrière, Joël Leclerc, A.J. Pape, and Rini Marzio, as well as a selection of works by the artists themselves. The exhibition will also include a presentation of a new collection of contemporary art, 'Away from the World, Part 1: Conversations with the Dead, 1917–1948.”The twenty-second edition of the Biennial is slated to open in the summer of 2021.\n\n\nThis image, made in the early 1900s, shows paintings of works by between seventy and eighty artists from the collection of the Museum of Fine Arts, Boston. All of the works are still in the collections of the museum, which has not yet announced plans to move them. It also shows the collection’s collection’s first foray into the modern art world, in the form of works on paper that are dated between 1903 and 1910. The work from the late 1910s is the first by William", "The next Biennial should focus on the masterpieces created by women artists in the twentieth century and enable them to participate in the next iteration of the exhibition, which will take place at the Art Institute of Chicago next spring. The museum is currently planning to reopen the exhibition in late spring.\n\n\nA group of artists, activists, and collectors in the United Kingdom are demanding that the government invest more than $1 billion in British cultural institutions since Brexit has already resulted in losses of at least $100 million. The group’s demands—which are part of a broad coalition led by the British Museum, the National Galleries of Scotland, and the Tate, which is also demanding that the government provide extra help to help the institutions recover from the disruption caused by the decision to leave the European Union—are part of a wider campaign to protect cultural institutions across the United Kingdom that are at risk of being let go as part of plans to tear down sections of the national infrastructure that were built to support the UK’s economy.“We are calling for an immediate and unconditional response to protect the cultural and creative sectors of the country, and to invest in the post-Brexit United Kingdom as a whole,” Mary Creagh, the British Museum’s director", "The next Biennial should be held in 2022.\n\nIn March 2018, the Dusseldorf-based artist and curator Piotr Wojtas was arrested for protesting the sixth edition of the Berlin Biennale, “Theater of Operations,” at the Berlin Art Town, where he was organizing a group exhibition. After refusing to leave the premises, he was charged with “unlawful assembly” and fined $13,750. Following a lengthy pretrial hearing, the case was dismissed on August 3, 2018.Wojtas was also convicted of violating a temporary closure order by blocking a roadway with traffic in order to prevent traffic from moving through a construction zone during construction. In his ruling, the judge said that the lawyer “acted in the interests of safety and security of the participants, of the city of Berlin, and of the state of North Rhine-Westphalia.” The judge also said that the action was justified by the need to prevent the spread of Covid-19.After the verdict, Piotr Wojtas told the Art Newspaper: “I have no regrets. I will now continue my work in accordance with the verdict. I know that I was wrong", "The next Biennial should be unveiled in the autumn of 2019. \n\n\nThe Metropolitan Museum of Art in New York has announced that it will suspend the exhibition “The Eulogies,'” which was set to open in March 2019, until at least mid-March due to concerns over the coronavirus. The exhibition, which explored the role of art and literature in the lives of African Americans, had hoped to run from March 13 to March 15 and had already faced backlash for its March 13 opening.The exhibition was moved to March 15 on the recommendation of New York Governor Andrew Cuomo, who called the postponement of the February 28 opening a disaster. According to the New York Times, the governor also said that the experience of the previous three weeks had been “difficult for anyone who has been through this kind of thing.” The show will reopen in April.Details of the move have not yet been made public. The opening of the show has also been delayed due to the Covid-19 pandemic. The show will now kick off at the Museum of Modern Art, where it will remain until March 24.\n\n\nThe Metropolitan Museum of Art in New York has appointed Jack W. Kingston as its new chief curator of African American", "The next Biennial should focus on the history of the institution’s collection, archiving and research expertise, and the conservation of the collection, and should take place at an academic site. The museum will continue to receive funding from the institution for the next five years.The museum has a new institution and new programming to attract and engage the communities of New York and its surrounding areas. The city is now home to more than 6,600 radio, television, and film studios, and more than 7,600 print, digital, and social media companies. The museum is preparing to reopen to the public on September 24 with an expansion of the museum’s venue for contemporary art, the Javits Center, which will bring together some 1,500 artists and curators in the first three months of the year.\n\n\nThe Museum of the City of New York (MOC) has appointed John Macgregor as its next executive director. He succeeds Sidney and Judson Mather, who served as MOC’s founding board members since 1999, and takes the helm from Louise Bourgeois, who retired on May 23.“John Macgregor is a man who has been an outstanding leader of MOC for more", "The next Biennial should take place in the year 2025 and is expected to return to the museum in 2020.\n\n\nThe European Union has given Greece $354 million in aid to help it cope with the coronavirus, the virus that is threatening Europe’s health and is spreading rapidly in Asia. The funds will go to farmers and businesses affected by the coronavirus, which was first identified in Wuhan, China, in March. “This is a serious step towards combating the coronavirus in Greece,” said EU commissioner for Europe, Dimitris Avramopoulos. “The total amount of funds will enable the Greek government to raise a minimum of €165 million for food security and other social protection needs.”The funds will also help farmers transition to a new crop, which will require a shift in the country’s food security strategy, and will be used to implement emergency emergency financial assistance to small and mid-size businesses. The funds will also allow Greece to shift to a local food production system, and at the same time facilitate the movement of agricultural produce across the country. The shift is expected to save the Greek state more than $200 million a year.According to Greek news outlet Kathimerini, the"]