["The next Biennial should take place in 2021 and has already commissioned the work of Moa Kik, whose pictorial performances concurrently pose questions of language and their possible loss and the difficulties of making them work against the current political moment. Like her peers, she has wanted to engage with the current political situation. In a Q&A with the artist in Los Angeles earlier this year, she explained that while she is not involved in the current political battlegrounds, she sees them as a window into our shared history.\n\n\nThe Walt Whitman Foundation launched the 2018 biennial Be/longing, which features art from across the globe. The event will feature twenty-four works by twenty-five artists, spanning forty years of American painting, from December 19, 1953 to May 16, 2019. The 2018 event will be held at the Walt Whitman Amphitheater in West Palm Beach, Florida, and will deliver more than seventy thousand live performances and activities, including a biennial retrospective of fifty works by forty-nine artists, including Richard Avedon, Berenice Abbott, Barbara Hammer, Frank Stella, Anton Kern, Robert Irwin, and David Salle. “More than twenty-four years after we launched the biennial, our artists are reflecting", "The next Biennial should focus on issues of materiality and the availability of material objects, such as the objects of our material world.”The twenty-sixth edition of the Berlin Biennale, curated by Daniel Boesky, will be held in the Spring of 2022.\n\n\nIn an effort to minimize disruptions to the activities of artists and organizations that are committed to the preservation and promotion of their work and to protect the artistic process, the California Department of Cultural Affairs (CalArts) has suspended all new fundraising and grantmaking for the California Institute of Technology (CalTech) and the University of California, Los Angeles (UCLA), the Los Angeles County Museum of Art (LACMA), the Metropolitan Museum of Art, and the Shaughnessy Gallery in New York, although both UCLA and the LACMA will continue to receive funding from the same fund.“We believe this temporary suspension of new fundraising and grantmaking is necessary in order to protect the artistic and academic mission of the institutions, and to ensure that the museums remain viable and financially viable,” said Mary Anne Carter, the director of CalArts. “As we work together to support the mission of these institutions, we hope to continue to be able to", "The next Biennial should include a major, three-day exhibition of new works by the British artist Peter Sellars. The next will be a retrospective of David Mitchell’s work, “Aeon’s Last Dance.”\n\n\nThe Télécom Foundation, a Paris-based organization that supports artists and cultural workers, has received a $10 million donation from American billionaire Richard Branson. Through his Virgin Galactic company, Branson has pledged $9 million to support the work of French artist Yael Hochner, whose new book A Star Is Born (Pluto) portrays an imaginary world where the ancient Hebrew word for star is used as a title for a female relative.The donation was made by Branson in recognition of her contributions to social justice and to the arts, which include her work Mars and its inhabitants, 2009, which reflects on the environmental impact of the Martian environment, and her work Solar Clock, 2012, a personal journey through the sun that depicts the sun reflecting the Earth. In 2009, the foundation gave Hochner a $10 million grant to develop a new program to connect artists and the environment. In a statement, the foundation said: “The experience of the trip was a very positive experience for me", "The next Biennial should have an opening in December 2021. The 2019 biennial, titled Art in the Time of Crisis, was organized by the Museums Association (MA) in collaboration with the Art Newspaper and the London-based art gallery Partners. The 2020 edition will be organised by the Museums Association, Partners, and Tate Britain. The 2020 event will feature more than fifty works by forty artists, including Jonathan Aitken, Rex Aller, and Cara Caldwell. \n\n\nThe Contemporary Art Museum Houston (CAMH) has commissioned a new collection of contemporary art as part of its revitalization plans. The exhibition will be on view in the museum’s renovated space in the first exhibition of its new twelve-story structure, “The Future Is Now: Contemporary Art in the 21st Century.”The new exhibition is part of CAMH’s ongoing effort to revise and expand its collection in the hopes of preparing for new exhibitions and programs that will draw on the museum’s extensive holdings. CAMH president and CEO Adam Szymczyk told the Art Newspaper that the collection carries “many amazing works by unknown and underrecognized artists.” The works will feature twenty-", "The next Biennial should include a presentation of works that have not yet been opened and will have the opportunity to experiment with new materials and creative methods. In the meantime, a number of museums and galleries are working on initiatives to engage more visitors with their collection and to open new spaces in the future. The exhibition will be inaugurated by a new exhibition of works by the Philadelphia Museum of Art, “Telling Stories: Art and Performance in the Late Eighteenth Century”, which is being curated by Deborah Tavares. The exhibition will open on January 8, 2020 and run until March 7, 2020. \n\n\nTate Modern, the parent company of the Paine Webber Art Museum in London, has received a hefty donation of $42 million from the United Kingdom’s Tate, which is also working with the Paine Webber Art Museum Foundation to establish two new funds for the arts. The gift follows years of work by Tate trustees and donors to make the museum’s mission a reality.“Tate is so proud of what we have accomplished in the last eighteen years,” Paine Webber Art Museum director Tim Bevan and chairman Bruce Minto said in a joint statement.", "The next Biennial should include a range of performances and stories by artists from across the globe, which have not yet been shown in the United States, and will be held at the Museum of Modern Art in New York from January 19 to January 21, 2021. The exhibition will also feature an exclusive selection of works by artists in sub-Saharan Africa and the Pacific with a direct connection to the events of the biennial. “All of us are excited to see the work of modern and contemporary artists in our exhibit space,” said the museum’s director, Thomas J. Moynihan. “We are honored to receive the support of this global community of artists in support of our work and the project of this year’s Biennial. We look forward to the next iteration of the Biennial, and to the many artists already participating in the exhibition.”The biennial was founded by the Los Angeles–based artist and activist Anna Wintour as a platform to draw attention to the contemporary issues that affect African American artists and activists. The inaugural exhibition, “Black Female Artists: From Black Power to Black Feminist Art,” took place at the Renaissance Society in New York on January 4, 2019 and included work by forty", "The next Biennial should be held in the Spring of 2020.  The Project, a group that comprises artists, activists, and arts professionals to promote and raise money for innovative civic and cultural projects across the city, has launched an online contest to select a winner for its 2019 Art of the Year. The deadline to submit your project is March 27 and will receive a grand prize of $50,000.To enter the contest, individuals or small groups can connect with the public through social media using the hashtag #ArtOfTheYear. The winners will be chosen by a jury composed of Miley Katz, founder of the Miley Katz Art of the Year Award; Jason LaVeris, managing director of Art in Cities; and artist Marc Bonà. The grand prize will be awarded to the artist who demonstrates the greatest potential for recreating urban life through art.The 2018 winners were selected by a jury made up of Laura Horne, general manager of the Miley Katz Art of the Year Award; Marsha Andelman, director of the Miley Katz Art of the Year Awards; James Ahearn, a curator at the Museum of Contemporary Art San Francisco; and Amy Scharff, a curator at the Museum of Contemporary Art San Francisco. The 2019 winners", "The next Biennial should be held in the autumn of 2021.\n\n\nThe Friedrich-Alexander-Wirth (F.A.W.) Art Museum in Vienna has appointed Carsten Hals, the director of the Kunsthalle Basel, as its new director. Hals will be responsible for spearheading the institution’s new partnership with the Fondazione CCCAM, the world’s largest art fair, and will take up his new post on October 7.Hals previously served as the director of the Kunsthalle Mainz in Germany, where he coordinated the ‎Kunsthalle München and the Kunsthistorisches Museum München. He also held the post of director of the Kunsthalle, where he oversaw the opening and renovation of the historic venue in 2012.“Friedrich Alexander-Wirth is a major cultural partner of the United Kingdom and is deeply engaged in the local and national local government of North Staffordshire, and the local communities of Chester, Lewes, and Northbridge, in the United Kingdom,” said Mark Porter, chairman of the F.A.W.’s board of trustees. “His vision for the Fondaz", "The next Biennial should focus on the history of art in the US from the nineteenth century to the present day and should incorporate an exhibition that draws on the public Research Lab. The twelve shortlisted artists for the 2019 event will be announced in early October. \n\n\nThe Arsenal Museum in London has unveiled the newly commissioned works of the seven artists who were shortlisted for the Topaz Medal last year: David Brin, Joan Mitchell, Suellen Cammock, and Kelly Link. Brin\u0097whose work is included in the exhibition “The Art of Being Blue,” which opens on October 21\u0097will receive a $50,000 prize. The other finalists for the prize are Kelly Link, Robert Irwin, and Yinka Shonibare.“Joan Mitchell’s portrait of her father in the kitchen of a small town in central Connecticut is a timeless meditation on the intimate and the personal, a tender tribute to his work and to the American landscape,” said Andrea Leondarría, curator of the exhibition. “Kelly Link’s vibrant, emotive landscape paintings of intersecting lines and threading motifs are infused with a sense of history that is both timely and relevant.", "The next Biennial should be held in 2021.\n\n\nThe Dietrich von Klingendorf Foundation in Dortmund, Germany, has announced that it is organizing a second edition of the Biennial, which was canceled due to Covid-19. The organization will create a new exhibition space for the art, called the Foundation for Contemporary Art (DAA), in partnership with the Graf Zeppelin Museum. The theme next year will be “The Future Is Present,” and the program will be held at the museum until March 21, 2022.“The foundation is now in the process of inviting the experts and artists from all over the world to participate in the series, and we will soon have a new exhibition in the works of the beloved artist,” said Gerhard von Klingendorf, chairman of the foundation.The event will take place at the DAA from March 16 to March 18, 2022, and will feature twenty-five works by sixty-six artists. Curated by Wolfgang Licht, the director of the V-Max museum in Berlin, the show will feature works by artists such as Manfred Könitz, Mark Pritchard, Fredric James O’Leary, Tarek Atoui, Haim Stein", "The next Biennial should be held at the newly opened MNA (North American Museum of Natural History) in New York in 2021. \n\n\nThe Museums Association (MA), an American advocacy organization representing more than 1,500 museums, is launching a new online petition drive to protect the future of the National Museum of Civilizations (NMCA), where the work of 150-200 different artists are on display at the museum every week. The petition, which will be circulated by email, will invite other museums to sign and will include a list of five hundred artists who have contributed to the museum’s collection.“The National Museum of Civilizations is a key cultural resource for millions of Americans and has played an important role in America’s history. The current management team has made significant improvements, but much needs to change to ensure the museum is able to continue to serve its diverse audiences and meet the museum’s evolving needs,” said Katharina Pitts, executive director of the association, which represents more than 1,500 museums.Pitts said that the petition is only a first step in creating new museum policies that will protect the museum’s artistic mission and staff, and that more needs to be done to", "The next Biennial should take place in December 2020 at the Kassel CNE in the German city. The exhibition would mark the twentieth anniversary and the fifteenth anniversary of the exhibition. The theme of the exhibition would be “Living the Dream.” The event would also feature works by Mina Borthwick, Daria Borthwick, and Malcolm Brown, among others, and would consist of a series of photography exhibitions, documentaries, and performances. The exhibition would be organized as a series of immersive experiences, with the focus being on photography, which is a central part of the exhibition. The biennial would consist of four stories, each focusing on the artist’s career, one of which would be selected by the artist herself. The first story, “John Wiesenthal’s ‘Sleepwalk;” would be presented by Sarfaraz Ahmed, the curator of European art at the School of the Museum of Fine Arts in London. The second story, “Lincoln: The American Dream” by Maureen Kelly, the curator of modern and contemporary art at the Jullia Museum in Venice, would be presented by New York’s Whitney Museum of", "The next Biennial should focus on the contemporary practice of the Spanish painter, scholar, and educator, Juan Nava, whose pioneering experiments in painting, drawing, and sculpture reflect the richness and complexity of his European native soil.”\n\n\nThe Victoria and Albert Museum in London has named its curator of contemporary art Tania Bruguera, a British Columbia-born, Berlin-based artist whose experimental practice has been described as “geometric, multilayered, and hyperorganic.”Bruguera, who graduated from the School of the Art Institute of Chicago in 2016, is known for her paintings, sculptures, and installations that address concepts that include light, light pollution, and the materiality of matter. Using her own body and the properties of materials, including wood and canvas, she creates works that reimagine the materials that constitute our worlds.“We are thrilled to learn that Tania Bruguera will join the Victoria and Albert Museum in 2017 as their new curator of contemporary art,” said Victoria & Albert director Brook Andrew Bach. “Her strong curatorial and conceptual skills, as well as her commitment to art making and her vast experience of working with artists, artists and artists’ work, make her", "The next Biennial should take place at the Museo de Arte Contemporáneo in Madrid in the fall of 2020.  The biennial will focus on the history of the art and culture of the Greater Middle East in a way that engages with the creative and intellectual dynamic of the region.  Artforum’s list of artists who are participating in the event is as follows: 1. Nikola TeslaAnton Kernò (1904–1975)Nikola Tesla’s son and the museum’s founder, Anton Kern.2. James Gordon (1921–1973) Gordon’s daughter, Zina Gordon.3. John Beasley (1927–1982)John Beasley’s grandson, David Beasley.4. Jean-Luc Godard (1909–1967) Godard’s granddaughter, Julie Godard.5. Sarah Peiffer (1922–1995)Sarah Peiffer’s daughter, Mary Peiffer.6. Miranda Kerr (1926–1985)Miranda Kerr’s granddaughter, Jean-Luc Godard’s granddaughter.7. Warhol (1919–1992) Warhol’", "The next Biennial should be held at the Movies at the Palace of Fine Arts in Shanghai in 2021. Art Basel will also collaborate with the government of the People's Republic of China in Beijing to help raise money for the projects as part of the country’s first major arts initiative. \n\n\nMichael Kuzma, who has served as the director of the Alexandrian Institute for Contemporary Art in Sisseton, Arkansas, for five decades, died on December 26 at the age of eighty-one. Kuzma, a leading figure in the Neoclassical and Post-Classical movements, was born in Budapest in 1941. After graduating from the University of Budapest in 1951, Kuzma moved to New York, where he studied under Milan Kundera in the art department of Columbia University. After a stint in the Department of Modern Art at the Museum of Modern Art in New York, Kuzma returned to Europe to teach at the University of Exeter. In 1963, the year Kuzma’s son died, his wife gave him the post of director of the Alexandrian Institute. Kuzma spent the next decade overseeing the museum’s expansion into a contemporary art museum and expanding the institution’s collection", "The next Biennial should consider the interconnections between art and politics, culture and economics, and the environment and the body. The theme should be “How do we live together?” In the United States, the next iteration of the Biennial, “Tectonic Change: Art and the Politics of Buildings,” will be staged at the Brooklyn Museum.\n\n\nThe New Museum in New York has appointed Mark B. Feldman as its next president and CEO. Feldman will be the fourth president of the institution since its founding by Henry Luce in 1954. Since his appointment, the New Museum has undergone a sweeping transformation, undergoing a $1.5 million expansion and a renovation in 1997, and is now a leading cultural institution in New York City.In his new role, Feldman will assume the role of director and chief curator of the New Museum, which has been working to complete its expansion and renovation project since 2009. He will assume his responsibilities on May 31.“The transformation of the New Museum is a story of vision, imagination, and stubborn persistence,” said New Museum director Daniel H. Weiss. “The museum has become a global leader in its field by working with the leading experts in every", "The next Biennial should be held in the fall of 2020. A final selection of works will be presented in the spring of 2021.\n\n\nThe Centre Pompidou in Paris has received a gift of forty-six works by the late French designer Bernd & Georges Neuer. The museum is now working on organizing two exhibitions dedicated to the duo, “from the seventeenth to the thirtieth,” the French daily Le Monde reports.The gift, which includes fifty works selected by the Pompidou, comes in a collection that has been the subject of a great deal of speculation since it was first announced in 2014. Initially, the works were presented as a new show in the Pompidou’s new exhibition center in the city of Aix. After the Centre Pompidou announced that it would not engage in the construction of the center and that it would hold a retrospective of the duo in the spring of 2019, the show was moved to the Centre de Lyon. The Centre Pompidou has since been awarded a $35 million grant from the French Ministry of Culture, the Pompidou Foundation, and the Pompidou Art Foundation. The Centre Pompidou is currently working on", "The next Biennial should be opened by Elizabeth Sumner, the curator of the twenty-fourth Biennial, at the Los Angeles County Museum of Art, in a month.The seventy-ninth will take place at the Museum of Contemporary Art in San Francisco, in a month. \n\n\nThe Massachusetts Museum of Contemporary Art (MMCA) has appointed Jillian Levitt as its new director and chief curator. She succeeds Carol Brown, who was promoted to deputy director of curatorial affairs and chief curator last month.“Jillian is a curator and scholar who has been instrumental in bringing the MCA’s contemporary art collection to prominence through the development of collaborative initiatives, such as the recent collaboration between Jillian and Carol Brown to create a new Masterpiece’s series,” said director Rachel LeCompte. “Her vision and energy for the MCA and for our curators and staff are infectious, and we’re excited to continue her work.”Levitt comes to the museum from the Walt Disney Company, where she has served as a professor of art history and contemporary art history and has taught at the University of California, Los Angeles, Boston College, and the University of California, Berkeley. She", "The next Biennial should commence shortly and will consist of a series of exhibitions, selected by the curator, that represent a variety of history and mythology. The theme of the upcoming edition will be “The Secret Lives of Dinosaurs.”The biennial will also present a study group exhibition titled “Sculpture of Dinosaurs” which will focus on the oral traditions of the indigenous Algonquian peoples of Canada. The exhibition will feature works by twenty-eight artists.\n\n\nThe Y.N.A., a Bronx-based nonprofit, has named its second board chair Terrie Patrick Walters. Walter joins the organization after serving as its founding board chair from 2011 to 2017. She succeeds Judith Aldrich, who will retire in January 2020 after nearly sixteen years on the helm.“Terrie’s history of developing and championing a strong and clear vision for the Y.N.A. was legendary,” said Brook Art Gallery artistic director Michael Mullen. “Her ability to bring together artists and their partners across the City to address the urgent needs of the community, and to collaborate with a grassroots, volunteer-based, and independent arts organization, was unparalleled. We are grateful to have her on our team.", "The next Biennial should focus on the history of Zionism, the history of the Israeli Palestinians, and the history of the Palestinian people, with a particular focus on the biennial’s inaugural exhibition “Palestine: Israel and Palestine” (2015–16), “Palestine: New Fronts” (2017), and “Culture and Politics” (2019). Commenting on the upcoming event, the artist said: “I’m honored to be the first to host the inaugural Biennial at BAM and to continue to develop a strong friendship with Ishmael, Terrence, and the entire BAM community.”\n\n\nThe Museum of Modern Art (MoMA) in New York has launched a new initiative to help small museums and independent arts organizations with its debt. Their loans will be forgiven up to $750,000 if they complete a restructuring of their financials and disclose any unsecured debts.“This year’s restructuring cycle was challenging for all of us, but particularly for arts institutions, as we have been forced to make hard choices about how we will fund our exhibitions and how we will share our collections with our community,” said Martha Theresa Niles, director of", "The next Biennial should be held sometime between June and September 2020; the dates of the 2018 and 2020 editions of the Biennial are currently unknown.According to the Art Newspaper, the new venue will be inaugurated by an exhibition of work by twenty-five artists, including Shira Gaviria, Nanda Fadoz, and Ciarán Finlayson, which will be followed by an exhibition of work by twenty-nine artists, including Felicity Hammond, Shih Chieh Chen, Florence Kaplan, and Naima J. Keith, which will be accompanied by a performance by the biennial’s contemporary artist, Nia Naidus.During the event, which will be hosted at the Centre Pompidou in Paris, twenty-six artists, including Enrico Zingaretti, Norah Jones, and Nicoletta Montaner, will be presented with major retrospective exhibitions, including “Gingerbread,” a show of the work of twenty-six Italian modernists, and “The Beehive House,” a virtual reality installation by the British artist John Kilpin that will feature eighteen living specimens of the species and will be distributed through the Center Pompidou.The bi", "The next Biennial should be held in December 2020. The exhibition will encompass the work of forty-two artists, including Robert Irwin, Alighiero Cattelan, Jin Yong, S. J. Kwon, Koki Kondo, and Jinyoung Oh. The exhibit will also involve a rethinking of the concept of the museum in a city unlike anything that has been imagined yet. In a city that is growing increasingly connected to the arts, here, in the city of Seoul, is a Biennial that will draw visitors from all over the world, will present a selection of contemporary Korean artists, and will invite visitors to experience the history and culture of Korea as a whole.The exhibition will be organized as a retrospective, with the exhibition “The Other People” as its main event. The show will run until November 3, 2020. The first edition of the exhibition was held at the Stierl Gallery in Los Angeles in 2003. In 2007, the Stierl Gallery moved to an entirely new space in the downtown area of Los Angeles, the Stierl Art Museum, and the museum began hosting an annual exhibition. Since the inaugural event, the exhibition garnered a large group of foreign and international artists and attracted the", "The next Biennial should be held in December 2021. This version will feature some fifty works by a select group of contemporary practitioners. Bibi Biennial will also include a selection of works by artists who have never been on public display in Japan.   The inaugural exhibition will feature work by more than forty artists, including Adam Cammock, Irene Atget, Soufan Benoît Baan, Jenny Jones, A.J. Konrath, Jibz, and Leila Sultan. Bibi Biennial will be a joint venture between Art Basel and Museé d’Art Contemporain de Tokyo (AACT), Tokyo; and the Japan Society of Arts (JSA). The exhibition will be organized as an introduction to contemporary Japanese art and will feature the works of seventy-four artists, including Takashi Takeda, Masaoka Hanashi, and Hideo Kojima, as well as works by contemporary Japanese and international artists such as Yukiko Nakayoshi, Koki Nara, and Kazuko Oda.Selected among the seventy-four artists to participate in the inaugural edition of Biennials in Tokyo will be the District Artist-in-Residence (DARI", "The next Biennial should take place in 2021 and will be curated by the same team, the same staff, and featuring the same original themes. The organizers insist that the tenor’s work, which explores the ideas of love and love as well as of the role of music in our lives, will be presented as a collaboration between the artist and the institution. The show will take place across five floors of the museum and will be led by the same six curators, Henning Larsen, Lars von Storch; Hanna Mozes; Rachel Neubert; and Marc-Olivier Pape, who curated the first Biennial in 2000.The venue will also be run by the same company that owns and manages the museum. The new partnership allows the legal entity Kunsthalle Biennale Kunstverein Münster to be organized as an independent entity, which will have the autonomy to determine the content of the exhibition and the exhibition program. The building has previously hosted Andrew Lloyd Webber’s performance at the Kunsthalle Basel in 2009 and Luis Florizani’s album for the collection in 2001. The new partnership marks the first time the Biennale Kunstvere", "The next Biennial should be held in 2021. It will be organized as a “monument” under an agreement with the city of San Francisco, and will be inaugurated by a fifteen-minute performance by poet-director Maya Lin.In a statement regarding the festival’s twenty-fifth edition, which will take place at the San Francisco Museum of California (SFMoCA), the city wrote: “SFMoCA is excited to present a new version of the Museum’s most important exhibition, ‘Ghosts,’ which was first hosted by SFMoCA in 1993 and has been on view since 1994. This new iteration will introduce a new series of immersive works that highlight the work of the late and the emerging artist-class, highlighting the critical role that art can play in shaping social change. The exhibition will include a selection of work by noted artists such as Harald Szeemann, Gertrude Stein, Robert Irwin, and Susanne Bieder.SFMoCA will present the new exhibition in conjunction with an exciting, year-round lineup of contemporary artists and will launch a new online platform and collaboration program. The program will be based in collaboration with the city of San Francisco’s artists", "The next Biennial should take place in the year 2021. The next edition of the Biennial will likely be held in the summer of 2022.“Our current exhibition program is one of the best in the world, and we are very much looking forward to the next one,” said Simon Johnson, the chief executive of the Biennial. “We have a strong team of curators working across all disciplines and we are happy to be collaborating with the Tate, the Royal Opera House, the National Galleries of Scotland, the British Film Institute, the Southbank Centre, the BBC, and many more organizations and audiences across the world.”The restructure of the Biennial is part of a £7.4 million ($9 million) injection into the organization made in 2017, when the Tate received a £3 million grant from the government. The money was also used to restructure the institution’s exhibition programme\u0097the current show “The Singularity Is a Myth,” a presentation of new works by artists such as Margaret Mead, Arthur C. Clarke, and Robert Irwin\u0097and the appointment of Helen F. Hill, the director of the National Galleries of Scotland, as director of the Tate.\n\n\nThe Catalan", "The next Biennial should be held in Beijing in 2022, the China Ministry of Culture said. The full list of participating artists is as follows: Kunihiko Miyamoto, The Summer of Our Life, 2018 Kiyotasa Sher, Red Sun, 2018, Russia Laurent Sagnac, Tangerine, 2018, FranceKunihiko Miyamoto, The Fall of the House, 2018, China\n\nChina has sent four students from the country’s first woman-only photography school to the Hong Kong campus of the University of Technology, Beijing (UPEC), for the 2020 Beijing Biennale. The students, Chen Ning, Guo-Jing, Chen Min, and Chen Yuhai, were selected by the university from the first batch of twenty-two students who applied last year.The students arrive in Hong Kong from Nanjing, capital of China’s eastern Jiangsu province, where they were enrolled from May 18 to May 20, 2020. They will be given an internship in the school’s photography studio, which is located at 1035 Buihai Road, in Nanjing, and will have the opportunity to practice photography and live photography in Hong Kong.“We are delighted to welcome", "The next Biennial should take place in the spring of 2020, with the exhibition to be held in the spring of 2021. The museum has also announced that it is planning on reopening the institution in the 2017–18 academic year. Museum director and CEO Adam D. Weinberg said the institution is committed to making the event a success. “We are committed to developing new ways of presenting and engaging with the work of contemporary artists and to building an enduring public and digital memory of the Cube.”The institution will host an exhibition of works by the same group of artists that are featured in the biennial, “The Dreamers,” at the Museum of Fine Arts in Boston (MoMA) next month. The exhibition will take place in the new galleries and will feature work by thirty-six artists—including Paolo Barbieri, Steven DeSousa, and Riccardo Tisci—all of whom were featured in the first show in the Cube’s new hub, the Center for Contemporary Art. The theme of the second biennial, “The Future is Present,” will be “This Present,” with works by twenty-four artists.\n\n\nThe National Museum of Fine Arts", "The next Biennial should take place in 2019. According to the Italian daily newspaper the Corriere della Sera, the 2024 event will be held at the Museum of Italian Modernity in Rome. The organizers say the new exhibition will include works by artists such as Andrea Prada, Alexander Calder, and Ed Ruscha, and will be presented by curator Stefano Cipolotti. The museum will also host a biennial of contemporary artists in 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in New York has appointed Kate Kelly as its first executive director. Kelly comes to the institution from the Metropolitan Museum of Art (MMAD), where she previously served as deputy director and chief curator. She will take up the post in January 2020.“It’s a tremendous honor to join the Met Museum of Art and the newly-renovated MoCA in celebrating our 150th anniversary this year,” Kelly said. “I’m excited to work with the team to bring MoCA’s rich collection of contemporary art to life through innovative exhibition-making and artmaking experiences, and to continue to expand the exhibition program to reflect the growing breadth of the museum’s audiences and its global reach.�", "The next Biennial should take place in Tokyo in May 2020. The exhibition will include the works of Wangechi Mutu, Titokojiro, Tatsumi Takeda, Yumiński, Satoichi, and Takashi Iizuka, among others, and will be inaugurated by a discussion with Professor Hidenobu, who has been nominated for the Nobel Prize in Literature for his work The Perfect Situation, and will be followed by a month of lectures and seminars.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles announced today that it has released ten of its eighteen-member curators, including Charlotte A. Smith, Shanidhar Patil, Anatole Shagal, and Tarek Atoui. In addition, it has appointed five new members to the curatorial staff.Markedly, the catalogues of the biennial are noticeably different from those presented this year. In the first place, the two previous years were focused on the future of art, with no mention of the human condition. In the second place, the 2013 exhibition was a biennial of sculpture, not art, and the exhibition was supposed to be held at the Tr", "The next Biennial should be inaugurated by a new round of presentations by artists to mark the occasion, with selections from South-Eastern Asia, South-Western Europe, and Australia. The 2020 edition of the Biennial will take place at the Polytechnic University of Venice from January 5 to January 7, 2020. Judging by the number of participants and the enthusiasm with which they expressed their desire to participate, the exhibition will be highly anticipated.“We are very pleased with the exhibition\u0097the selection of the emerging and established artists, the development of their projects, and the international reach of the exhibition,” said María Luisa Pérez, the Executive Director of the Biennial. “The twenty-one artists who will be presented in the exhibition are: Enrique César Morales, Zarina, Arriana de Sousa, Lucio Celant, Lapita Doria, Igor De Jesus, Sam Johnson, Mohammad Ali Salah, Maryam Murtaza, Anna-Sara Cilento, Tanya and Ondine Cilento, Sebastian Kattan, ", "The next Biennial should start next week. \n\n\nItalian artist Ettore Messina is suing the city of Venice to prevent the installation of his new work, Theatrics for the Future, from being demolished, the Italian daily newspaper the Corriere della Sera reports. The work, which was installed in Venice’s Punta della Dogana in May, is slated to be demolished by the city council in a blow to the project of the organization, led by architect Silvio Marchioni, who is trying to save the work by removing it from the city’s property.Marchioni claims that the demolition of the installation, which he claims violates a twenty-nine-year-old decree of the Italian parliament in 2011, will violate his artistic freedom and that the city’s decision to take legal action against him is a “violation of Italy’s legal order.” In response, the city council issued a statement saying that it is “aware of and takes seriously.” Marchioni alleges that the city’s move is a “premeditated provocation.” His allegations were made during a meeting between the city council and the architect’s", "The next Biennial should focus on the legacy of radical feminist activists and the role of women in contemporary society, and should incorporate readings and performances by both established and emerging artists. The budget for the inaugural edition, which will be hosted by the University Town Hall in Bristol, UK, is about £3.5 million.The theme this year is “Prospects of Beauty,” and the exhibition will include works by fifty-three artists, including Hilda M. Sze, Arsht Mokoena, Sarah Lotfollen, Sarah LeBlanc, and Helen Seroussi, among others. The exhibition will take place in the newly expanded Biennial Research House. The museum will also present a special exhibition on the history of art in the US.\n\n\nThe Institute of Contemporary Arts (ICA) in London announced today that Anish Kapoor has been appointed as its new deputy director, and that he will assume his post in January 2021. Kapoor, who will take up the post from Lorna Garner on January 16, will be responsible for overseeing the development and implementation of new policies and initiatives at the institution. He succeeds David Armstrong, who in December 2019 became the first director of Tate Britain.“Kapoor", "The next Biennial should be held in the third quarter of the year. The first two should be held in the summer. The theme of the year will be “Particles and Composition,” and will be “Light and Motion,” which will take place in “Metal” and will involve a combination of visual arts and the scientific study of matter and energy.The reopening of the exhibition will mark the seventeenth year of the Biennial. As part of the announcement, Anna Bochereau, the director of the Biennial, said: “We are grateful to the City of Montreal and the City of Toronto for their cooperation in the design and execution of this monumental project. The exhibition will re-emerge as a powerful platform for the visual arts in the city, and will serve as a template for the development of the city’s collection of cultural heritage.”\n\n\nThe Chicago-based organization that runs the World War II Museum in Chicago has appointed David Weidman as its new director and CEO. Weidman comes to the institution from the Richard and Lucille Loebel Foundation, a Chicago philanthropic organization that works with artists on projects that address issues such as climate change and global", "The next Biennial should draw on the work of artists whose work neither showcases nor reframes the Black Lives Matter movement. It should strive to address the urgent threat that climate change poses to African American communities and, in so doing, to the biennial itself.”Art historian, curator, and writer Ana Mendieta, who was named the next chair of the institution in January 2019, said: “It is the commission of a Black artist of color to challenge the biennial’s white male leadership to rethink its racial politics and its relationship to the history of the institution.”\n\n\nThe American Alliance of Museums (AAM) has released its 2020 edition, “How Did This Get Made?,” which features work by twenty-six new and established artists and is on display at the Atlanta Museum of Art (Atlanta) through January 21, 2020. The exhibition is curated by Yvette Akman, senior curator of nineteenth-century American art at the Brooklyn Museum and artist-in-residence at the American Alliance. The program will highlight the work of women whose work is currently on display in museums across the United States.The 2020 edition of the American Alliance of Museums (AAM) is dedicated to Amit", "The next Biennial should be held in the next twelve to eighteen months. We are grateful to the many artists, institutions, and institutions who have contributed to this exhibition, and we look forward to its future.” “As a board member of the Biennial Foundation, I have learned a great deal about the museum’s mission and about how art can be a tool to encourage and amplify creativity,” said Mark Diamond, the foundation’s executive director. “As an artist, I am thrilled to work with artists and am committed to helping them realize their visions by creating new adventures for their paintings and drawings. I am also committed to supporting the foundation’s artists and arts professionals in their careers, and working with the artists to advance their careers in a way that benefits the foundation.”\n\n\nThe City of Philadelphia has dismissed a formal complaint filed by Tenpenny, a northern Pennsylvania gallery, over the sale of works by British artist Robert Mapplethorpe, who was a leading member of the Surrealists, who were influenced by surrealist abstraction and avant-garde music and whose work recently entered the public domain. The museum first received Tenpenny’s complaint in December 2014,", "The next Biennial should take place in 2021. The first one, which will be curated by Elinore Jewett, will be held at the Museum of Contemporary Art, Boston, in 2022. The other three marks the thirty-fifth and thirteenth iterations of the show, which were held at the San Francisco Museum of Modern Art and the San Diego Museum of Art in California, respectively.\n\n\nThe Metropolitan Museum of Art in New York announced today that Michelle Wood, the curator of the exhibition “The Egyptian Lover,” has been promoted to curatorial assistant. Wood will serve as a liaison between the institution and the Egyptian Ministry of Culture.“Michelle’s expertise and experience in engaging with contemporary art and Egyptian culture brings a powerful perspective to The Met; a perspective that will be especially meaningful as we embark upon this years-long exhibition,” said Mark Craig-Mitchell, chair of the board of trustees. “The Egyptian Lover is a richly textured, layered, and evocative work that allows us to imagine and question the way the soul is experienced by a certain prophet on the eve of the First World War.”The exhibition, which was commissioned by Egyptian director Naguib Sawiris,", "The next Biennial should take place in the fall of 2021.  Mike Raymond is planning for a 2020 exhibition.  This article was originally published by the Art Newspaper.   William Gabriel Moseley’s new book, The Disaster Artist: The Art of Cynthia Palmer, will be published by Smithsonian Books in July. \n\n\nThe British Museum (BMI) in London announced today that Anne Baynes will become the next director of the institution. She succeeds Sir Nicholas Craven, who retired after ten years at the helm of the museum in March 2019, and will take up the post on September 9.“I’m delighted to be taking on this new challenge, to continue to advance the BMI’s mission and to continue to present the art of Cynthia Palmer,” said Baynes. “I believe strongly in the shape of the design and in the spirit of the museum. I am eager to join the museum’s team in the development of its new exhibition space, the Alexander Graham Smith Centre, and to develop further its collection of the artist’s works. The BMI is one of the largest and most significant cultural institutions in the UK with approximately 6,500 works", "The next Biennial should be held in 2022. The Biennial of Living Art will be held at the newly renovated Guggenheim Museum in New York, as part of the redesign of the institution. The redesigned museum will be inaugurated by a live performance by a group of contemporary art enthusiasts, called the Living Museum Alive. The biennial will include seventy-five works, made by seventy-two artists, and will take up the themes of “Sensuality, Power, and Affiliation” (1922), “The Concept of Art in the Age of Stalinism” (1926), “The Origin of Work and the Meaning of Painting” (1928), and “The Steps of a Life: A Proposal for a New Image of Life” (1930).The full list of participating artists is as follows:Artforum.com’s 2018 biennial schedule: September 3–September 7: The Blacktree Contemporary Arts Centre, London. September 8–September 10: The Knobel Gallery, London. September 12–September 14: The Toros Art Museum, Hamburg. September 16–September 22: The Venice Arts Center, Venice. September 24–September 29", "The next Biennial should be held in the spring of 2022.\n\n\nThe Los Angeles County Museum of Art (LACMA) has received a gift from the Nation’s First Lady, Brigitte. The $10,000 bronze statue of the First Lady, American'S Emmett Till, was made in honor of her husband, Thomas Till, who was one of the three men who were convicted of murdering Emmett Till in Mississippi in 1974. In remembrance of their service to their country, the Museum created a new section dedicated to the Till family.Curated by LACMA’s director of contemporary art, Drew Carey, the exhibition “In Memory of Emmett Till,” which opened on January 6 and runs through March 2, 2022, features works by thirty-five artists, including Terrence Howard, Loïc Villem, and Ravi Shankar, as well as works by more than twenty-four artists whose work was featured in the Broadway production of The Birth of a Nation, 1924. The show’s exhibition “In Memory of Emmett Till: The Art of Remembrance” will run concurrently with the biennial’s March 22–March 26 edition", "The next Biennial should be held in 2022.\n\n\nFrom the collection of the French architect Jean-Michel Bront, the Los Angeles–based nonprofit the Alamo Drafthouse is preparing to welcome visitors to the Southern California institution to see the first installment of its newly created, exhibition-based film festival in 2019. The event will be held at the Alamo Drafthouse from February 14 to March 21, 2020 and will offer one-week free admissions to the space.“This is a unique situation for the Alamo Drafthouse, which has been experiencing a long-term growth and development,” said director Mary Anagnos. “This new cultural partnership marks a turning point for us as we explore how to create and present the next stage of our artist-driven programming.” More than one hundred artists, including Paul Gauguin, Jean-Luc Godard, Jean-Michel Ludwig, Douglas Gordon, Tony Lee, Robin Williams, and Sean Thomas, are expected to participate in the two-week programming.“The Alamo Drafthouse is an icon of the American South, and we are thrilled to join the Alamo in sharing our view of the California Dream with the Los Angeles community,”", "The next Biennial should soon be set up in the city, and in a couple of months. While the first exhibition will be about the impact of the pandemic on art and architecture, the second will focus on the creative process itself. The three-day event will be staged at the Chelsea Arts Centre, the Chelsea Art Gallery, and the Blue Mosque in London. Further details about the exhibition will be announced in the coming weeks.\n\n\nThe Museum of Modern Art (MoMA) in New York has awarded $2 million to five artists whose works were selected from a pool of seventy-one applicants. The winners were Wangechi Mutu, Charlotte Posen, Catherine Wilson, and Mali Kappus.“We are honored to award these five outstanding submissions, and in recognition of the outstanding work of their works, and in support of their creative practices, we are also extending this year’s inaugural exhibition with an exhibition dedicated to their works,” director Matthew Teitelbaum said in a statement. “Together these five outstanding works will form the centerpiece of our inaugural exhibition, ‘The Case of the Midwifes’ debut, which will take up themes of family,", "The next Biennial should work with the artist-led network of the Seattle Art Museum to address the city’s urgent needs for affordable housing and provide direct support for artists and their families. The institution will also use the biennial to expand the public’s understanding of and access to archival and contemporary art throughout the city.“Our museum will not be able to continue to function successfully without dedicated and dedicated board and curators—and that is why our board has decided to establish two independent commissions that will have the final say on the exhibition, the selection process, and the exhibition,” board president and CEO Elizabeth Childs said in a statement. “We welcome the concept of an independent commission to continue the exhibition and the program at the Seattle Art Museum.”\n\n\nThe Netherlands has removed a statue of Dutch colonialist King Leopold II of the Netherlands, who ruled from 1783 to 1804, and his repressive regime, which is often cited as the model for the regime in Saudi Arabia, from a plaza in the Dutch capital, The Hague. The controversial monument, which was installed in commemoration of the nation’s independence day celebrations, was also criticized for glorifying the Nazi regime and the Nazi", "The next Biennial should take place at the Kalendariek Museum in Brussels.\n\n\nArtforum has received the American Alliance of Museums (AAM)’s 2019 edition, at the invitation of Matt Holloway, the president of the prestigious AAM’s regional affiliate, the AAM Foundation. The exhibition will open on October 18, 2019, at the National Gallery of Art in Washington, DC, and will run through February 23, 2020.“We are thrilled to welcome Matt and his team to the National,” said Stephen Breyer, chair of the National and founder of the AAM Foundation. “With their deep experience and passion for our institution, Matt and his team are poised to further our mission to showcase and engage today’s innovative and cutting-edge American art, and to draw upon the rich traditions and global perspective of our museum.”Since its founding in 1963, the AAM Foundation has supported more than 1,500 exhibitions and has helped over seven hundred artists.\n\n\nOn Tuesday, the United Kingdom announced that it will leave the European Union. According to The Guardian, there were some 11,000 people who voted to leave the country, and Prime Minister Boris Johnson announced that he had", "The next Biennial should take place in 2021.  The 2019 show featured work by seventy-six artists, including Carlotta Corvilotti, Rafael Cornejo, Sixto Rodríguez, Nylon Ugly, and Yoko Ono, and received the same award as the previous exhibition, the New Art Talkers Awards, which was hosted by the New York Academy of Art in 2008.\n\n\nArt and Design, LA’s professional organization of visual arts professionals, has launched an online petition demanding the immediate release of artist Cathy Wilk, a critically endangered white rhino whose life and health are in danger due to the city’s reckless enclosure and dehorning of its famed Gold Bar. Wilk, whose home was featured in the film The Cove, a 2019 Sundance sensation that investigated the emotional and psychological tolls of urban life and the impact of human waste on the environment, was arrested last week on suspicion of felony evading arrest and released on $1,000 bond.In a letter sent to the Los Angeles County District Attorney’s Office on Tuesday, February 9, the petitioners write: “We, the undersigned, the signatories of this statement of intent, stand", "The next Biennial should bring together artists representing various sectors from the city at large, including architects, artists, philosophers, architects, artists, residents, and visitors. I will be involved with the development and staging of the biennial and its exhibition space for many years to come.”\n\n\nThe National Gallery in London has opened the National Museum of Israel in Tel Aviv, which is slated to open in 2022. The institution recently completed a major renovation of the museum, which consists of a fifty-five-thousand-square-foot auditorium with a graphic design by the Israeli company Hacoost, design studios, and a new garden. The overhaul was inspired by the Israeli prime minister, Benjamin Netanyahu, who has made Israel’s National Museum of Antiquities, which will feature twenty-six artifacts, a cornerstone of his government’s campaign to create a safer, more secure, and more Jewish state.The redesign of the National Museum of Israel was initiated by Adrienne Edwards, director of the National Gallery of Art; Michael Rubin, owner of the New York–based firm Rubins; and the National Committee for Jewish Heritage, which represents around twenty thousand museums and thousands of individuals affiliated with the Jewish Heritage Foundation. The project was led", "The next Biennial should be eighteen months from now. I will be in touch with you soon with further details about our upcoming exhibition in Paris. I have been counting on you to provide the necessary impetus for a change in the exhibition program. In my opinion, the change is overdue. First of all, we need to give our artists more time to develop their works, and secondly, we need to make the exhibition program more accessible to young and old families. I hope that you understand that the current situation requires immediate action.\n\n\nThe Pall Mall, the premier contemporary art venue in London and one of the oldest in the United Kingdom, has welcomed two new members to its board: artist and philanthropist Howard Reay and artist-in-residence Meegeman Aliyu. Reay, a British-born, Bahraini-born, and Bahraini-based artist, has won the Palazzo della Scala in Venice and Almine Reay in Milan. Aliyu, a New York–based artist, is the founder of the Promontory Art Foundation. Together they are poised to reshape the Pall Mall’s future through the creation of a new five-story, forty, and seventy-six-thousand-square", "The next Biennial should aim to be a gathering of all the physical and virtual arts from around the world and celebrate the interwoven and interlinked processes that shape our lives. “The future of art is at stake,” said Biennial curator and co-organizer Ana Mendieta. “The vision of a global community inspired by the importance of art in our cultural heritage is the very thing that will make this possible.” \n\n\nThe Pérez Art Museum Miami (PAMM) announced today that it has received a gift of seven new works by the artist-activists Black Lives Matter (BLM) and the Puerto Rican artist Rosa Negron. The works, which were donated by artist-activists Cherani Gilbert and Rosa Negron, were largely made with donated materials, including rubber, canvas, and MDF, a structural organic material that is highly resistant to graffiti and paint.“The museum’s collection and collection programs are constantly undergoing reconfiguration as we make the Pérez Art Museum Miami’s collection a space for the study and appreciation of art. The gift of these works of our colleagues and friends is an important step in that process, and it signifies our appreciation for", "The next Biennial should be held in 2020. \n\n\nThe Institute of Contemporary Arts (ICA) in London is planning to reshape its curatorial structure in order to increase its exposure to the cultural and creative economy. The institution, which has a museum space in London’s City Hall and is a member of the UK’s Turner Prize consortium, is now working on how to enable artists and creatives to collaborate more easily across its numerous locations, and how to create new programming.The institution will release a new set of guidelines in the coming weeks that will help artists and creatives working in the ICA engage more easily with one another and with the museum’s collections and exhibitions, which will operate in a new digital space. The ICA’s Director, Sharon Hodgson, said: “At the forefront of artists’ concerns is the creative process, and how it can be a source of sustenance and inspiration. The new ICA Curatorial Guidelines will lend practical guidance and support through a new era of ICA engagement. ICA is committed to supporting and encouraging the most innovative and compelling work from new and established artists, and strengthening the ICA’s artistic and cultural network.”\n\n\nThe", "The next Biennial should be held in the spring of 2020. The first, “The Art of Life,” will be held in the summer of 2020. The second will be hosted at the same time as the third. The third will be on the first Monday of November 2020. The fourth will be on the first Thursday of December 2020. If the bid is accepted, the 2019–20 exhibition will open in early April. This year’s event will run as scheduled through April 20, 2020—two weeks earlier than the previous edition, which had been scheduled for April 18–April 22. In a statement issued by the Biennials, they said: “We are thrilled to be back at the iconic County Hall, London, for its twenty-fifth edition, the Art of Life. The new series will continue to engage with contemporary and historic art, with a particular focus on the work of the greats such as Pablo Picasso, Henri Matisse, Pierre-Auguste Renoir, and René Magritte—as well as new and emerging artists.”\n\n\nFrench artist Jules-Anne Brouwers has died at age eighty-nine following a two-year, forty-", "The next Biennial should be held in 2020.\n\n\nThe Museum of Modern Art (MoMA) in New York has welcomed two new members to its board of trustees: David H. Richard and Lenore Tawney. In addition to serving on the museum’s board of trustees, Richard is a professor at Columbia University and a board member of the Whitney Museum of American Art in New York. “We are delighted to welcome these two new members to the board of trustees, and to recognize the visionary leadership and influence they have brought to the institution,” said Mark Goldman, chair of the board of trustees. “David has transformed MoMA into a leading center for the study of twentieth-century art, and has been instrumental in expanding our collection and our exhibitions. Lenore has been instrumental in revitalizing the region around the museum, and has expanded the museum’s footprint and its public programming in ways that have made it a leading curator and a strong sponsor of art.”Bernard Bergan is the first to step down from the board of trustees, but he will remain involved in the museum as an advisor and will serve as a consultant on the project of the forthcoming exhibition “Birds of a Feather:", "The next Biennial should be held at the museum in 2022. “The new exhibition, ‘Biodiversity and its Present,’ will be a celebration of the centuries of work that has taken place in the institution. The themes of the exhibition will include the history of the collection, its exhibitions, and the selection of the new works by the artists,” María Bonifacio, the director of the Biennale de Buenos Aires, told the Art Newspaper. Next year, the museum will host a retrospective of artist and politician José Antonio Menem, a longtime ally of the Biennale, at the venue. A selection of Museums and Galleries in the City of Buenos Aires from the collection of the late Presidential architect Jorge Gori, the exhibition will include works by artists including Manuel Andujar, Lawrence Abu Hamdan, Andrés Alonso-Álvarez, Luchita Carrington, and Anselm Kiefer, among others.\n\n\nThe National Galleries of Scotland announced today that it plans to give $12 million to the Acts for the benefit of Scottish arts and cultural institutions in support of the construction of new public spaces for cultural", "The next Biennial should take place in 2023, the source said. The date of the 2020 edition, which will be held at the Art Institute of Chicago, has yet to be determined.\n\n\nThe Gorillaz have announced that the group will present an interactive exhibition during their first-ever Digital Family Art Fair in New York, which will take place on September 29–October 7. The online event will have over three hundred works by seventy-eight artists, and will feature works created by the Gorillaz, artists who have expressed interest in participating in the fair, and artists who are affiliated with the New York–based Gorillaz collective.The artists participating in the exhibition include Alison-Jean-Michel, Eleanor Carron, Rachael Ilić, Sarah Lamont, and Seamus Heaney. A full list of the artists is as follows: *   * * * * * * * * * * * * * * * * *Tania Bruguera, Florence, Italy* * * * * * * * * * * * * * * * * * * *Grace Lynn, New York, NY, USA* * * * * * * * * * * * * * * * * *", "The next Biennial should be in 2022. \n\n\nThe Museum of Art, Los Angeles (MA), has appointed Barbara Aitken as its next executive director. She succeeds Christopher Wool, who retired in June 2019 after ten years at the helm of the institution. Aitken will assume her post at the museum on September 1.“Barbara is a person of exceptional integrity, intelligence, and vision who has built an impressive record of championing institutions and causes that have made and will continue to make a difference in the city of Los Angeles,” Los Angeles County, and the greater Los Angeles region,” said Museum Director Maura Ho. Aitken has served as the director of the Los Angeles County Museum of Art (LACC), which is housed in a former auto body shop and has a permanent collection of more than twenty thousand works, since 2004. During her tenure, she has organized numerous exhibitions, including “The Art of Making,” which opened in October 2003, “Animals in Motion,” which toured the country in 2008, and “Trigger: An Exhibition of Art and Politics,” which opened last fall.In 2018, Aitken was named the winner of the", "The next Biennial should be held in 2020, but a date has yet to be set.\n\n\nThe Bodog Museum in Beijing has received a gift of over five hundred photographs by the late Norwegian photographer Lars Claes. The donation, made by collector Adriaan Brugge, exceeds the expectations of the museum. The gift includes ninety photographs that were taken by Claes as well as a selection of his later work, such as portraits of the incarcerated and the diseased and works that depict the body in a manner often considered inappropriate for children.“In the hope that this gift will be of considerable value to the artist and to the museum, I decided to keep the photographs in the Bodog collection and to have them recognized and returned to the Bodog collection in the future,” said Brugge. “The seventeenth edition of the Bodog Museum’s ‘Art of the Body’ will take place at the museum in 2020, in order to ensure that the collection remains at the Bodog Museum.”\n\n\nThe Tate’s board of directors has dismissed the Museum of Islamic Art (MoI) in London as the institution grapples with a surge of Covid-19 cases. In", "The next Biennial should take place in the fall of 2020 and will be hosted by the Institut für Geschichte des Bundes (IGB) in Berlin. The first iteration of the event was held in September 1998 and featured seventy-five works by twenty-one artists.\n\n\nThe Pérez Art Museum in Mexico City, which recently underwent a major renovation, has announced that it will resume its long-running event, which has drawn thousands of visitors from around the world since it was founded by artist Íñigo Vasquez in 1929, in March 2021.The event, which culminates with a gala dinner, was canceled in March 2019 amid the ongoing health crisis in the country. The cancellation was due to the pandemic, which began in late March and continued through the end of June. It also stemmed from concerns over the future of the Pérez Art Museum’s collection and the future of the institution’s building, which has housed the museum since the late 1970s.While the Pérez Art Museum and Museum de Cinéma’s building has been closed since June 11, the institution’s entire collection is still on view. Pérez Art Museum director Enrique Campos Lira", "The next Biennial should be held in the spring of 2022. Süreyyağlu, the director of the Turkish Museum of Art (TMA), said: “Since the beginning, our exhibition has striven to be completely in Turkish. We are still in the process of delivering an exhibition that will not only represent Turkey but will also reflect the character of Istanbul. We hope that the exhibition will be a model of the kind that will be the model for future exhibitions in Turkey.”\n\n\nThe Centre Pompidou in Paris, the Punta de Beausoleils in Barcelona, and the National Museum in the Palais de Tokyo in Tokyo—which was scheduled to open in the spring of 2021 but postponed its inaugural programming owing to the coronavirus—have signed an agreement to collaborate on the reopening of the three monuments, which were built to commemorate the French imperialist emperor Napoleon Bonaparte and the Italian explorer Christopher Columbus. The move follows a wave of protests against the Center Pompidou and Punta de Beausoleils for their plans to demolish historic monuments in the city of Saint-Etienne, which straddles the French/Belgian border, and is meant to bring the three cities closer", "The next Biennial should take place in the city of Hamburg in 2021. Müller, who has three children and is currently working on a book on the history of art, said: “Play has always been central to my life as a painter. I am really happy that this year will mark the occasion of my seventy-fifth birthday. It has been a great pleasure to share the story of my life, building on the history of the art as a whole and in particular the two-century-long period when I was working with both my children and the younger artists. This is an important milestone for me and the family, and I am ready to take on new challenges.”\n\n\nThe Hirshhorn Museum and Sculpture Garden in Washington, DC, has welcomed two new artists to its team: Shantanu Viswanathan, who will begin his first year as a model and sculpture collaborator at the institution this month, and Isabell Varnado. The inaugural team members will work in collaboration with the Madeline Hillery, the Glenn Ligon Gallery, and the Museum of Fine Arts, Boston, and will be based in New York.“The Hirshhorn’s team and I are thrilled to welcome Isabell to", "The next Biennial should take place in late 2019. CARE will provide funding for the event, which will be hosted at the König-Alter Kunsthaus in Berlin, in partnership with the König-Alter Kunsthaus and the German Federal Association for the Promotion of Arts (BAM). “Deeply concerned by the ongoing crisis in Syria, the König-Alter Kunsthaus in Berlin decided to offer a unique presentation of contemporary art;” said Marc König, chair of the König-Alter Kunsthaus’s board of directors. “We are grateful to the BAM for its cooperation and support, and to the König-Alter Kunsthaus for welcoming us into the Berlin art district. The exhibition will take place at the König-Alter Kunsthaus and at the Ludwig Museum in Mainz, and will be organized with the König-Alter Kunsthaus and the Ludwig Museum as the central organizing institutions.”\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Anna Mercedes Maxey as the new deputy director of curatorial affairs. Maxey comes to the institution from the Brooklyn", "The next Biennial should be held in 2021. “The future of the Grand Prix lies with the community, with the artists, and with you, and we are determined to make it possible,” said Jody Rogac, chair of the board.The 2020 edition of the biennial will inaugurate the new exhibition “Gérém et la Jeune.” The exhibition, which will include contributions by twenty-six artists, including Christo, François Ghebaly, Pierre-Olivier Houle, and Verne Dawson, will open at the Museum of Modern Art in New York on May 3.\n\n\nCanadian Heritage Minister Mélanie Joly announced in Ottawa on Friday that the Trudeau government plans to intervene in the Quad Cities by awarding the five largest cities in Manitoba, Ontario, Quebec, and Saskatchewan a total of $2.45 billion in aid. The cities of Saskatoon, Winnipeg, Regina, and Vancouver will receive $1.5 billion, while the smaller cities of Prince Albert, Grande Prairie, and New Glasgow will each receive $250 million.“We are creating a new framework for supporting Canada’s creative economy to ensure that these cities and rural communities have access to this critical support while", "The next Biennial should be held in 2020. “We need to do more,” Maboni said, “and we will.”\n\n\nThe Asia Art Museum (AAN) in Japan announced today that it is planning to close its doors for a period of two years to complete a major renovation project that will involve the preservation of the museum’s collections and its collection of historical art, which is currently housed in a current‐scale building in the city of Osaka.The renovation will involve the collection of works in storage, the preparation of new exhibition spaces, the development of the museum’s online presence, the development of a new collection, and the establishment of a new exhibition program. The renovation will also involve the acquisition of more than 3,800 artifacts from the institution and will include the restoration of the building’s exterior and interior architecture.“The AAN underwent a major renovation in 2013 as part of a $65 million gift from our friends and family, and the project is progressing as planned,” said AAN director Masaya Nakaya. “We are very proud of that work, and of the progress made in ensuring that our exhibitions and experiences align with the needs of our guests", "The next Biennial should open in 2022 and will consist of ten sections, each curated by an artist and organized by subject.Among the sections will be a series of interviews with artists, thinkers, and activists concerned with the sacredness of each site. A set of guidelines for how to conduct one’s own pilgrimage will be presented as well as a list of resources for scholars and pilgrims. The exhibit will also feature the work of twelve artists and their families, many of whom were selected for the exhibition based on their achievement in providing inspiration and inspiration for the biennial.The event’s inaugural exhibition, “Telfair,” curated by Rachel Tabachnick, will be on view at the Gallery of Modern Art in New York from April 4 through April 13.  For the second edition of the exhibition, produced by Nicholas Cullins, titled “The New Metamorphosis,” on view in the National Gallery of Art from March 22 through March 27, the biennial will be presented as an exhibition of work by forty-eight artists. The first three days of the exhibition will be devoted to the work of Walter de Maria and will run from March 26 to March 29. For the third and final exhibition", "The next Biennial should be held in November 2020; if the date is moved up, the opening of the exhibition will be moved back to February 2021.“I’m delighted to be teaming up with the National and the Centre to oversee these important exhibitions and to contribute to the development of this country’s artistic and cultural heritage,” said Iván de Córdoba. “In the absence of a formal partnership, the National will continue to direct and organize exhibitions of contemporary art, and the Centre will continue to develop and present contemporary art. The biennial’s title should reflect that it is a celebration of the national art and culture. We will see whether this is possible in the upcoming years.”The National Galleries of Scotland (NGM) has announced that the institution will no longer be able to produce the 2017 exhibition “Prayers for Scotland,” which was staged at the institution’s new home at the Port of London in partnership with the Bessies Museum, and will instead transition to a new, online-only event, “Prayer for Scotland Online.” The move will also see the building of the museum’s first digital exhibition, “", "The next Biennial should take place in 2021, according to the organizers. \n\nThe artist-run festival has faced numerous controversies over the years. In 2014, two artists, Sima Qian and João Pessoa, were banned from the festival for inciting racial hatred. The two were reinstated by the organizers, and the World Civilizations’ Fair was launched a year later.\n\n\nThe Museum of Modern Art in New York has appointed David McAllister as its next chief curator. McAllister currently serves as the curator of modern art at the Brooklyn Museum, where he has worked since 2012. He succeeds, as well as will continue to work with, Jorge Avalos, as the museum’s senior curator of twentieth-century art.“We are thrilled that David McAllister has agreed to join our team at the Museum,” said curator and director Adrienne Edwards. “We are confident in his ability to expand the Museum’s contemporary collection and work with audiences across the globe, and to provide a platform for artists whose work speaks to our times. We are eager to work with him to further our mission to deepen understanding of how art interacts with the world.”McAllister previously worked at the", "The next Biennial should be held in 2020, in the anticipation of the thirteenth, and the twenty-first. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Daniel H. Weiss as its new director. Weiss comes to the institution from the Los Angeles County Museum of Art (LACMA), where he has served in various roles including curator and curator of contemporary art since 2010. He succeeds Patrick Gaspard, who retired after a decade as director last September.“Daniel Weiss is an internationally-recognized curator, scholar, and educator who has made a significant and distinguished career as a curator, organizer, and teacher,” said Craig Thompson, the museum’s board chair. “He is an avid collector, a dedicated teacher, and a dedicated scholar. As a result, he is well-suited to lead LACMA as we reinvent our relationship with the art that he discovered and championed in the early 1960s.”Weiss’s interdisciplinary practice spans twentieth-century art and modern art, contemporary and historical art and design, and queer art and feminist art. He has held numerous editorial and curatorial positions at major US arts institutions, including the Museum of Modern Art,", "The next Biennial should be held in 2021. A proposal for a new iteration of the international exhibition was presented at the 50th Venice Biennale in 2018, but it never received the green light to hold a full-fledged triennial. According to Artnews, the 2020 iteration of the exhibition will include works from fifty-five countries, and will take place in the Palazzo d'Italia, located in the northern part of the city of Venice.The partnership between the University of Venice and the city of Venice dates back to 1988. It was created following the city’s decision to convert a former military airfield into a museum. The airport now hosts approximately sixty thousand works by thirty-five artists. The work-exhibition will take the form of a triennial, with the works of the participating artists listed in chronological order. The 2020 edition of the exhibition will be organized as follows: 1. The Big Bang Theory (TM) 2. Feminine (TM)3. The Fountainhead (TM)4. The Great Gatsby (TM)5. La Femme Nikita (TM)6. Charlie and the Chocolate Factory (TM)7. The Adventures of", "The next Biennial should be in January 2021. \n\n\nThe Institute of Contemporary Art (ICA) in London announced today that it is launching an ambitious new plan to increase the number of exhibitions by women and minority artists, addressing the gender pay gap and promoting more inclusive exhibitions.The plan, which will be implemented over four years, includes an investment of $8 million in the areas of representation, accessibility, accessibility of artists, and the social remit of the institution, and will create a new position for a woman artist. The organization will also increase the number of exhibitions by women and minorities by twenty-six percent, and will open a new forty-seven-minute space, the Women and Minorities Gallery, at the Institute of Contemporary Art, the Museum of London.The ICA will also invest $2 million into the arts and cultural sector through the new ICA Cultural Foundation, a new $3 million fund for women artists, and the creation of an ICA-wide apprenticeship scheme. The announcement follows a report published by the ICA on the impact of the Covid-19 pandemic on the artistic landscape, on March 21, 2021, which found that 74 percent of artists and creatives working in the UK are faced with financial hardship as a", "The next Biennial should be held from December 12 to March 14, 2020, at the Fernbank Museum of Art in London, and the year 2020 should also see the launch of the Fernbank Film Festival. The festival, which was launched in 2014 and has since expanded to include a number of other events, including Artforum’s annual film festival, will focus on a series of films and audio dramas set in London between 1960 and 2020. The biennial’s capital, Cardiff, will stage the event in early 2020.The 2019 edition of the Biennial, which was held at the ancient Moorish town of Jumeirah in the Arabian Peninsula, was marred by the death of prominent artist and writer Abdelkader Ali, who was sixty-seven. The event was also marred by a fire that broke out in a guesthouse owned by the artist and was put out by the authorities in December 2019.Following a review of the event, which was led by Israeli curator and architect Shimon Melman, the 2019 edition of the festival was condemned by the British Film Commission (BFC), which said that it “did not live up to the high standards expected from a BFC event.” The B", "The next Biennial should take place in the spring of 2020. Its inaugural exhibition, “Polaroids” (2019–20), drew a total of 25,000 visitors to the New Museum in New York. The exhibition, which highlighted the work of nearly 600 artists from forty-two countries and featured work by more than sixty artists, was curated by Mark Walentas, who served as director of the New Museum for more than twenty years.\n\n\nThe Museum of Fine Arts (MFA) in New York has appointed artist and educator Mark Halperin as its next director and chief curator. Halperin will assume his post in January 2020. He succeeds Charles Ross, who recently retired after eighteen years at the helm of the museum.“Charles Ross’s leadership of the MFA was a shining example of what a great curator can do,” said museum director Kate Fowle. “Mark Halperin’s expertise and passion for exhibitions and artists made him a perfect fit for the MFA’s unique mission.”Halperin has created more than twenty-five exhibitions at the museum, including “Wangechi Mutu: My Struggle” (2018), “John Gardner:", "The next Biennial should be held in the spring of 2021, according to a statement by the mayor’s office. The 2020 edition, titled “Brilliant,” will feature work from the Los Angeles–based artist-run nonprofit the Platforms. The platform will be housed in the same building as the Museum of Contemporary Art LA, but will expand biennial programming and the exhibition space.The biennial will include three exhibitions: “Good Fences Make Good Neighbors” (2019), “The Body and the Dreamers” (2019) and “Born to Die: Art in the Age of Mechanical Reproduction” (2019). The 2020 edition will also include a virtual reality exhibition and a “Ce n’était pas une critique,” a conversation with artist-activists and activists that will involve interactions with artists and activists at various stages of their careers.\n\n\nDanilo Cattelan, the curator and founder of the Buenos Aires–based nonprofit Studio Museu, has been named the next president of the International Commission for Contemporary Art (ICCA) in Buenos Aires. Cattelan, who has served as president of the institution since 2016, was chosen by an international", "The next Biennial should be held at least once per year. . . . The years 2020 and 2021 will present challenges for the team and the city, but we are ready to face them and to learn from each other.”\n\n\nThe Ministry of Culture in Beijing has launched an investigation into whether the Beijing-based art historian Xianbo Liu breached public trust when he gave a speech at the height of the Chinese People’s Republic (CQR)s Cultural Revolution in 2016. Liu, whose book The Criterion Collection: Art and Power in Contemporary China (2017) is widely considered a landmark text on modern art, was forced to resign from the museum he ran in 2017 over a year later when a group of curators who had submitted it to him discovered he was secretly funding a group of left-leaning artists.The Ministry of Culture told the South China Morning Post that Liu was reprimanded by the institution for the March 16, 2016, speech for which he accepted a directorship from then-Culture and Art Minister Gao Fei. Liu wrote about the role of the institution in the People’s Republic in his memoirs Tribute to the People: Art and Revolution’s Triumph and Embrace (", "The next Biennial should focus on “nanotechnology and artificial intelligence” (as in the book Medicine) and will be held in 2026. The exhibition will be hosted by the Smithsonian American Art Museum and the National Museum of Women in the Arts. The full list of participating artists is as follows: Anna Kuzma, Georgia O’Keeffe, Beau O’Hara,  Carolyn O’Keeffe,  Carrie O’Keeffe,  Carolyn Pickens,  Carol Pickens,  Catherine O’Keeffe,  José and Átienne Léger,  Kristen Pickens,  Natalie Paul,  Jasmine Pape,  Gregory Salter,  Andrea Smith,  Timur & Frances Smith,  Timur & Frances Smith,  Timur & Frances Smith,  Timur & Frances Smith,  Timur & Frances Smith,  Timur & Frances Smith,  Timur & Frances Smith,  Timur & Frances Smith,  Timur & Frances Smith, ", "The next Biennial should start in March 2020 and will be a platform for academic research. The biennial will be hosted by Art Basel Hong Kong and curated by Guidelines Art Beijing. The exhibition will also include Art and Health in a Time of Crisis, 2016, and KUALA BANKPROJECT, 2019. The full list of participating artists is as follows: Bennady Beno, UAETobias Ankermann, GermanyHannah Black, EnglandTanya Bochner, ItalyEmma Broderick, USALee Boyce, USAJulia Brown, USAAgnieszka Gubelin, Czech RepublicAmina Hassan, EgyptJulie Andersson, SwedenRajesh Ramaswamy, IndiaSora Biloi, MalaysiaNurijita Bhatt, IndiaRajesh Bhatt, IndiaSarina Bhatt, IndiaCheryl Bick, USAKaren Binns, USALisa Banerjee, UKNoor Bouton, FranceJoel Bohm, USAGina Branigan, USAYoshitomo Nara, JapanAlyson Bennett, USAYoshitomo Nara, JapanSara Buntin-Xavier", "The next Biennial should take place in 2020. \n\n\nIn an effort to ensure that Michigan’s art museums will be able to stay open past Labor Day, Governor Rick Snyder announced on Monday that he will extend the state’s MIDNIGHT special exhibitions through March 21. The extension comes on the heels of a statement issued by the governor on March 7, which stated that the extension would not “promote[ ] the ‘inability of these institutions to remain open past March 21.’” It also stated that the extension “will not impact on the museum’s ability to administer benefits, maintain fairs, or host events of any kind.”The extension follows the financial crisis, which saw Michigan’s museums close as thousands of workers lost their jobs in the industry. The state added 9,400 workers to its workforce with the March 11 announcement, bringing the total number of state employees working in the art-world sector to more than 58,000. The announcement came amid reports that the Michigan Department of Cultural Affairs is facing mounting financial losses as the industry struggles to recover from the coronavirus. While the agency is projecting a $54 million shortfall in 2020, it", "The next Biennial should have been held at its current location and would have been inaugurated by artist Marcela Almo, who has been designated the winner of the 2019 Dalia Rönnsdörfer Prize. Instead, due to financial concerns, the biennial will be moved to the Palais de Tokyo in Paris. In a statement issued by the Biennial, the organizers said, that they are “working together with the artist in order to contribute to the development of his practice, in order to avoid the disruption caused by the closure of the exhibition.”Almo, who has lived in Paris for almost twenty years, will go on to present her exhibition Marcela Almo: The World Is Not a Stage, which will open at the Biennial in 2021. The show will be inaugurated by the artist’s work The Art of Animation, which was selected for its integrative approach to mathematics by the 2018 Venice Architecture Biennale, and will be followed by Binauthority: The Art of Visuality, which is currently on display at the Edinburgh Art Biennial.\n\n\nThe Queens Museum in New York has announced the launch of two new programming initiatives that will bring new life to the institution", "The next Biennial should focus on the physical manifestation of the Infinite through the work of the Black Arts. The theme, “The Magician and the Thief,” is a reference to the work of Bruno Latour and Pierre-Auguste René, with the word magic coming from the French word for ‘spirit.” In a statement, the Biennial said: “The new institutional exhibition ‘Baptism and Blood: The Magician and the Thief’ will embrace the ancient religious symbolism of the evolution of souls from blood to air, to show the vast interconnectivity between culture and religion, and the cultural and religious traditions of Africa, the world and the Americas.”The work of the artist-run and nonprofit Artspace South Africa, which is housed within the Shetrewela in Cape Town, is currently on display in the exhibition “The Magician’s Tomb,” which opened on January 8. The show, which features work by seventy-four artists and musicians, will be accompanied by an exhibition of the works of the same artists at the Art Museum in Pretoria in March.“The Gallery opens up a new way of looking at art,” skipper of Art", "The next Biennial should be held in 2020, and the second in 2021. As of June 30, the first exhibition had sold two-hundred works, and the second was still on view. As we see the business of art deteriorate further, we ask ourselves: How long will art survive? By contrast, with the global health crisis in mind, World Health Organization (WHO) director-general Fatou Bensouda has said that the global health crisis will not end until all countries work together. We are at a turning point. The theme of the next edition of the Biennale is Sustainability.  The first show by the environmental organization will comprise twenty-one works by fourteen artists, including Alexander Calder, Damien Hirst, Pia Camil, Laura De Crespigny, Andrea Bocchino, Annelie Ehrenreich, Wolfgang Paalen, and Johannes Wohns, in collaboration with the Nationalgalerie van Stille. The second show will be curated by Rainer Bernard, a Swiss curator and founder of the Giardist Cultural Center and the SÜSACCONICA festival in Zurich. The deadline for the first exhibition is December 22.\n\n\n", "The next Biennial should be held in 2020.\n\n\nThe Museum of Contemporary Art (MoCA) has added two new artists to its growing roster. The institution celebrated the first day of the year by unveiling the first project-based exhibition in its history. The exhibition, titled “Theater of Operations: The Gulf Wars 1991–2011,” will be presented by the American artist Mark Di Suvero. It will explore the relationships between the United States and Gulf nations in an exhibition that will run for twenty-four hours.“Theaters of Operations,” the first exhibition created by MoCA,was announced in May 2019 as part of its “Postcolonial: The World I Now Live.” The exhibition featured the work of thirty-seven artists, including Guadalupe Rosales, Fernando Villarreal, Rirkrit Tiravanija, and Laxmi Tyagi, and featured original works by fifty-four curators and writers. The exhibition also featured a performance by Ariana Grande.“Theater of Operations” is the second of two new projects that MoCA is embarking upon, following “Painting: Contemporary Art” in 2019, and “Painting and the Gulf: Contemporary", "The next Biennial should be held in 2020, with the possibility of a second in 2022. The first was held in 1975.\n\n\nThe Italian government has cut the salaries of 20 current and former members of the Communist Party of Italy (CPM) and is preparing to lay off or lay off-site the remaining forty-six underpaid staffers, the Art Newspaper reports.The Central Institute for Labor Economics (CIE) in Florence, which is responsible for overseeing the management of the party’s central banking and economic department, laid off or laid off-site forty-four staffers on Tuesday, December 9, in a move that is expected to reduce the CPM’s total working staff by more than five thousand in the coming years.The cutbacks, which are part of a three-year budget plan approved by the conservative party government in March, have already resulted in a staff reduction of nearly three-quarters of the CPM’s total staff of around eighty-five. According to the Art Newspaper, the institute is facing a deficit of around $8.5 million in 2021.While the institute announced that fifty-six employees would be laid off in April, the employees are facing a loss of at least $1 million per year if", "The next Biennial should begin this week and run until November 20, 2020. The exhibition will draw more than 6,000 visitors from eighteen countries.\n\n\nThe Yale Center for British Art, which is temporarily closed until at least April 14 as part of the ongoing work-related crisis, announced that it will honor the late artist Raymond Bochner with a retrospective. The center previously announced that it would hold the exhibition in May, but has since delayed the event. The exhibition will be hosted at the museum until November 27, 2020, and will run from April 13 to April 21, 2021.“We are honored to collaborate with such a distinguished and beloved curator and friend of America,” said museum director Richard Armstrong. “Raymond Bochner was an extraordinary artist who created an extraordinary range of work, but he was most important for his contribution to the exhibition of the art in the collection. We believe our campaign to engage in conversation with the collections and the exhibitions has been successful with his collaborators, and we are grateful for their continued support.”Art historian and curator Amilcarlo Bruguera, who was a longtime friend of Bochner’s and who worked with him on a number of occasions, including when", "The next Biennial should be held in the spring of 2022. In the meantime, the museum is giving out free admission tickets to visitors from June 8 to June 10.  According to the artist, the new exhibition will use the \"original materials from the exhibition, which are stored in a special vault, and will use the same visual materials as the original exhibition. “The new exhibition will be about the ideas of the exhibition. It will reflect the spirit of the Biennial.” \n\n\nThe Museums Association (MA), a United Kingdom–based advocacy organization that represents more than 2,500 museum directors and trustees, has launched a new initiative to support cultural organizations struggling amid the coronavirus pandemic. Launched today and supported with a $50,000 grant from the MA Foundation, The Museums First campaign will provide museum directors and trustees with information about grants and support their ability to pay for collections and operations through a new online tool that will be free to users. “The new online tool will give museum directors and trustees an easy and practical way of dealing with collections and operations facing financial hardship,” said MA director Patrick Collins. “We recommend that museum directors consider using this online tool", "The next Biennial should be in March 2021.”The 2020 edition of the event, titled Art and the American Revolution, featured works by fifty-eight artists, including the Egyptian-born Iraqi artist Salah Salim, the Indonesian Becki Terena, and the Argentineo Pilar Corrias, among others from Latin America. In addition to the four permanent exhibitions, the 2020 edition will mark the opening of the National Museum of American Art, the opening of the Museum of American Art and the reopening of the Museum of Contemporary Art.\n\n\nMana Contemporary, the Los Angeles–based nonprofit that provides artistic support and resources to underrecognized visual artists, has announced that Yayoi Kusama has been selected to become its next recipient of the $25,000 Guggenheim Fellowship. The $10,000 prize was established in 2016 by the Guggenheim in honor of the late American artist’s career, which spanned more than thirty years. Kunsthaus Los Angeles, the Seattle nonprofit, and the Los Angeles–based artist’s estate will jointly present the biennial.The announcement of the MacArthur Fellowships, which are given annually to an artist who has demonstrated extraordinary achievement in a field of painter", "The next Biennial should begin in the fall of 2021 and will culminate in a presentation of work by the thirty-four artists who have participated in the exhibition so far. The exhibition will also feature a special exhibition of works by thirty-six artists that were selected by a jury comprising Julieta and Pedro Pires and Ricardo Pereira.“Tad is passionate about engaging with the themes of the exhibition and in the collection with an open mind,” said Pfeifer. “His generosity, warmth, and desire for collaboration makes him a true collaborator. He will continue to be an important member of the art world’s community and will help us make even more extraordinary work.”\n\n\nThe University of Pennsylvania’s Philip Johnson Gallery, which has been shuttered since March 13 due to the Covid-19 pandemic, will reopen on April 19. The nonprofit organization, which is supported by the Johnson Family Trust, the foundation that operates the Philip Johnson Pavilion and the Philip Johnson Glass House, will continue to operate as usual, but will inaugurate a new exhibition, “Philip Johnson: Live,” with readings from the artist’s works by Christina Bueno, Adam D. Weinberg, and T", "The next Biennial should be held in 2022.\n\n\nThe Smithsonian Art Museum in Washington, DC, has received a gift of twenty-seven works from the collection of Jay-Z’s uncle, Dr. Christopher Yämper, a prolific collector whose extensive holdings include works by Pablo Picasso, Charles Seitz, and Alexander Calder. According to the New York Times, the works were acquired by Jay-Z’s mother, Prudence. The gift includes works by Max Beckmann, El Salvador, and Jean-Michel Basquiat.The works were presented to Jay-Z’s father, Dr. Salah Yämper, on February 5. His mother, Mariam, was also present at the gift’s announcement. The museum, which has not yet named a curator or director for the exhibition, opened its new location in October.The museum will host a series of lectures by Yämper and his daughter, Nisha, about the works in the collection in order to promote the museum’s collection and increase awareness of the collection. Other talks will address the relationship between the museum and the estate and will be presented by the Yämper brothers, Donald and Talon. The performance", "The next Biennial should take place in 2021; the twenty-second in 2024; and the twenty-third in  2019. The first iteration of the event was staged in the artist-centre of Brussels in 2009 and 2010. The second iteration, which was hosted in the Neue Galerie in Berlin in 2013, included works by fourteen artists of East and Central Europe. The seventy-fifth edition of the biennial will be held at the Museum of Modern Art, in New York, on September 23.France, Germany, Italy, and the United Kingdom have joined a growing list of countries that will initially receive around $US250 million in aid from the international community in the form of grants. According to the Washington Post, Britain will receive $130 million, France will receive $116 million, and Germany will receive $104 million. The US will also provide $105 million, with Japan and Canada expected to contribute $107 million and $109 million. “I am thrilled to be able to bring this important work to your communities in Northern Ireland and the UK, and to extend the reach of our partnership with Tate Modern and the National Galleries of Scotland,” said Teal Group managing director Glyn Moody. “As a", "The next Biennial should be held at the university in 2021.\n\nThe organizers have also said that the next edition will be driven by a global community, which will consist of sixty-six artists, including twenty-four thousand from thirty-two countries. The winners will be announced in the spring and the festival will resume in the autumn.\n\n\nThe Institute of Contemporary Arts (ICA) in New York has announced that it will return to the Hudson Valley in 2021 for its 175th edition, the Hudson Valley Fundamentals, at the Brooklyn arts space Bopst. The event will now take place in the Botanical Gardens, in partnership with the city of New York.The event will include a retrospective of the first forty years of the institute, which has been in operation since 1965, and will take place at the Botanical Gardens from January 27 to March 7, 2021. The festival will also present programming that addresses themes of climate change, human rights, and ecological concerns.The 2019 edition, which ran from March 5 to March 9, was centered around the fourteenth anniversary of the grassroots group Code Pink, a feminist, anti-racist, anti-fascist organization that emerged in the 1960s in the Brooklyn borough of New York. The theme of the event", "The next Biennial should take place in 2022. The publication of The Art of Work by Kohn, a seminal thinker of postwar American art and a cofounder of the Museum of Modern Art, is planned for 2019.\n\n\nThe Museum of Modern Art (MoMA), the Cleveland Museum of Art (CMA), and the Metropolitan Museum of Art (MMCA) have agreed to create one last immersive art-historical experience for visitors to the Cleveland Art Museum in Ohio. The museum’s Creation Museum, which is slated to open this fall, and the Met’s newest art museum, the Met-NIRO, will be dedicated to the work of contemporary artists, with a view to experiencing the full breadth of their output.“The Museum of Modern Art, the CMA, and the Met are committed to building a new kind of museum, one that brings together the most important works of art from modern and contemporary art history,” said James Stewart, MoMA’s senior director of curatorial affairs and director of mobility. “Our vision for the new museum is to reimagine the experience of visiting a museum as a culture. We are working with a team that understands the unique role", "The next Biennial should be convened by the end of the month. \n\n\nThe Museum of Fine Arts (MFA) in Boston is making some adjustments to its exhibition schedule following a wave of Covid-19 cases statewide that has forced the institution to shift its programming three times in the last ten weeks. While the MFA is still preparing to reopen next week, the art museum’s public art program, including the Museum of Boston Public Art and the Museum of Contemporary Art, will also be delayed. It is canceling the upcoming exhibition “What Is Art?” and the upcoming exhibition “The Color of Empire: Art and the Visualization of Empire,” which were scheduled for January 18–February 1, 2020, and February 10–March 29, 2020, respectively.The MFA’s exhibition schedule was also revised on January 29, 2020, with the announcement that the museum would hold a retrospective of artist Johanna Pollak’s work from the upcoming exhibition “Culture and Society: The Color Wheel,” which is scheduled for February 17–February 20. The exhibition will be located in the MFA’s current exhibition space at 75 East Woburn Street.In", "The next Biennial should take place in 2021–22, before the first events in the new year. The final Art London pavilion will be staged at the Sydney Science Museum in 2021. The 2019 event, titled “Tit for Tatts,” was held in September and drew some 400,000 visitors.\n\n\nThe Museum of Contemporary Art (MoCA), London, has announced that it will take the first steps in its renovation of the former Waterstones warehouse complex by launching a crowdfunding campaign. The campaign, called #MoCABuilders, will aim to raise $100,000 to mitigate the financial impact of the delay in the project and will feature artist statements, architecture critiques, and the voices of activists and advocates.“While the Met has committed to the complex, it has also acknowledged that the building of MoCA, and the redevelopment of the city around it, is a long-term project,” said architect Emma Donnelley, who designed the building for MoCA. “The goal of the project is to understand that clearly and to make this building project a reality. The funders will be very much in the artist’s and MoCA’s thoughts, and that is very much in", "The next Biennial should be held in 2019.” “The Biennial is an important milestone in the journey of a collection, as well as an important reminder of the importance of art in creating a positive impact in the lives of those who are involved,” said Svetlana Zhdanova, chair of the board of trustees. While the next show will focus on the collection’s extensive exhibition history, the museum will also continue to organize exhibitions on its holdings and its mission.\n\n\nThe San Francisco Museum of Modern Art (SFMoMA) is finally welcoming visitors back to its iconic San Francisco building—after a two-year closure due to the Covid-19 pandemic—after it reopened to the public on Wednesday, March 23. The museum is still working to sort out the exact date and the exact location of the first show, titled “The Future is Present,” but the opening marked a milestone for the institution, which has faced numerous setbacks since it reopened on June 8, 2020.The museum had previously shuttered in March 2019 and then in March 2020 for a month and a half to complete a major overhaul. The overhaul, completed in June, featured new galleries, a compact, underground private exhibition space", "The next Biennial should take place in 2021 and will be the seventeenth edition in the National Museum of Fine Arts in Prague. The new exhibition “The Anatomy of a Nation: Art and the Struggle for National Empowerment” will be curated by the Krasnodar-born, Los Angeles–based curator Nadezhda Gaidina. The thirteen other artist-centered editions of the museum’s new exhibition series “The Politics of Nature” and “The Suffering of Mother Earth” will be presented by the National Gallery of Art in Washington, DC. The project was inspired by a series of lectures and talks given by American artist Agnes Martin and French thinker Georges Seurat at a Paris salon in 1928 and was inspired by a work by their son Jon who, in 1988, became a member of the first group to hold a solo exhibition at the Krasnodar Museum of Fine Arts in the Czech Republic.Jon Geden, the curator of the series The Politics of Nature, said: “Our new exhibition will aim to present the work of the artist as it was during the height of our political crisis, during the height of the Cold War. We will use material from the artist�", "The next Biennial should focus on the ten years of the existence of the contemporary Uruguayan artist, and will be organized by the Museum of Modern Art in Tokyo and the Museum of Modern Art in New York. While the date of the exhibition remains to be added, the organizers plan to create an opening for the exhibition in the center of the city in the next two months.\n\n\nThe Walt Disney Company announced today that it will donate $1 billion to the Smithsonian American Art Museum (SAAM) and the American Jewish Museum (AAM) in order to preserve the cultural heritage of the former slave states of the Confederacy. The announcement comes on the heels of Disney’s purchase of the Gold Rush Records and the American Indian Museum (AIM) in Fremont, California, in 2017, and marks the company’s first gift to the institutions since they were founded in 1839.“We are grateful to the Walt Disney Company for recognizing the historic value of these historic sites and for recognizing the unique role that these museums and collections play in the history of the United States,” said Laura Thompson, president and CEO of the Walt Disney Company. “While the Black Lives Matter movement has addressed painful issues historically connected to our nation’s", "The next Biennial should take place in 2020.  Wang Yang, the curator of modern and contemporary art at the National Museum of China in Beijing, told the Art Newspaper that the venue would be “set up to create an environment of international exchange and cooperation.” In addition to the Chinese pavilion, a ten-person team from the UCCA Institute of Contemporary Art in Beijing will be invited to present an exhibition of work by international artists. The team will consist of Wang Yang, the director of the UCCA Institute; Zhu Wenliang, the head of the UCCA Institute; and four artists, including Guo Shengli and Zhenyao Zhang. The biennial will be hosted by National Taiwan University, Taipei. The exhibition will be a “multi-dimensional exploration of the effects and structure of modern and contemporary art,” according to a press release.  The event’s exhibits will include “Shanghai Art Museum” (2019); “Theater of Operations,” the first exhibition in the forthcoming ’20 Art Basel Hong Kong edition; and “From Art to Violence” (2019). In addition, the exhibition will", "The next Biennial should be held at the Deleuze–Gruppo Paul Catania (CACMA) in Florence, Italy, in 2022. In the meantime, the Museum of Modern Art (MoMA) in New York is planning to move the exhibition from April 2020 to March 2021 and the Metropolitan Museum of Art, which is currently holding a retrospective of the artist Naama Garay, is preparing to unveil a new exhibition of the same name in the fall.In an attempt to stimulate more engagement with the work of the artist’s contemporaries, MoMA will present a series of exhibitions and seminars that will take up the theme “Feminine” in commemoration of the centenary of the artist’s birth. The inaugural event will be held at MoMA in December 2020. The second exhibition will focus on the work of women artists; the third on the themes of the body and of beauty; and the fourth will explore the relationship between photography and cinema.The inaugural exhibition will feature the work of four women artists: Harvey White, Elyn Zimmerman, Patricia Cone, and Jeanne-Claude. The ongoing exhibition will also feature the work of Vasily Kandinsky, Agnes Martin, and Olga Rojas.", "The next Biennial should be set for the third phase of the exhibition. It will be held at the Museo de Arte Contemporáneo (MAS), Lisbon; and Mabini, Casaloca, Portugal. The next edition of the Biennial will be held at the Museo das Exhibitions, Madrid; and the MAMCO, Lisbon. \n\n\nThe Foundation for Contemporary Art (FCA), Lausanne, Switzerland, has announced that the half-year commemoration of the International Women’s Day will be celebrated in August. The event will be marked with the exhibition of a selection of works by contemporary Swiss artists Cristina Ferrer, Sinthujan Patel, and Luisa Bicchieri.The exhibition will feature the works of seven of the twenty-five artists whose works were selected as the inaugural International Women’s Day showcases by the Foundation: Carmen Zagaria, Alice Ahearn, Lucie Olms, Jodi Tongue, and María Urbas. The annual event will feature works by artists who are currently or have been active in Switzerland and will highlight their perspectives on gender equality, feminism, feminism and art, and will showcase a selection of", "The next Biennial should take place in the spring of 2021. The 2019 edition, titled “Between the Sun and the Moon,” was staged at the Museum of Modern Art in New York and marked the artist’s first international exhibition. The event ran for thirteen days and featured works by ninety artists\u0097some selected from the exhibition based on their performance in the exhibition. In a letter written to the artists, Biennial director Jody Rogac wrote: “The next Biennial will be a celebration of the artists at the heart of the work, with a shared commitment to contemporary art. We hope that you will join us in this endeavor.”The biennial’s next edition will be shorter, focusing on the relationship between the modern and contemporary art world. The biennial will also be more centrally located in New York City, and will take place in the city’s artist district, the Javits Center, rather than the city’s Museum of Modern Art. In October 2020, the museum will host a version of the event in its Visitor Center.\n\n\nThe Institute of Contemporary Arts (ICA) in London announced today that Ita Watanabe has been appointed as its new senior curator of contemporary", "The next Biennial should be held in 2020, with the exhibition to open in the city sometime in the first half of 2021. The new capital will be built on the site of the former Biennial Art Museum, which was completed in 2003 and opened in 2007.The invitation to the 2016 event was issued by the City of Oslo and the Biennial Association. The Organization’s Chair, Merete Aagaard, said: “The city has worked hard over the years to make the city a destination of international importance and this is really a great opportunity to make that dream come true. We hope the Biennial Association and the city of Oslo will continue to support the city as we continue to develop our city in a way that improves the city and the quality of life for everyone.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has received a gift of more than eight thousand photographs by Italian painter and designer Sara Cattelan. The donation includes 1,835 photographs dating from the 1960s to the 1970s, including early works from the early ’70s, which will be displayed in the museum’s exhibition “Sara Cattelan: The Complete Picture,”", "The next Biennial should be in 2020. The Authority is currently negotiating with the city of Chicago about the location of the exhibition and its fiscal year 2020 budget. The project will also include the construction of a new, 275-foot-long, 30,000-square-foot theater to house the exhibit. The partnership is one of the first between an institution and the city of Chicago, and is expected to generate at least $2.5 million for the city in the first year.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has received a gift of more than 1,500 works by thirty-seven artists from the collection of artist-in-residence Naama Tsirrond, who passed away in 2011. The works will be included in a 2020 exhibition at the museum.Born in the city of Bechke, in the city of Bechuanaland, Israel, in 1961, Tsirrond studied under the renowned Israeli curator and playwright Yitzhak Rabin at the University of California, Los Angeles (UCLA). In 1998, he founded his own practice, which has operated out of a former telephone box in Koreatown, in order to pursue his artistic projects. The demand for exhibitions", "The next Biennial should premiere on December 20. The festival will be held at the West Kansas City Cultural Center, a former cotton mill on the Missouri River, since May 10. The festival will also feature live music, performances, and screenings, and will be inaugurated by a reception, which will include a keynote address by Christina Aguilera, with three other guests.  The festival will be held at a public space in downtown Kansas City, Missouri, which is currently undergoing a $1.2 billion expansion. The event will be streamed live on the festival’s Facebook page.The inaugural festival will run from March 17 to March 22. Tickets will cost $25 and will be sold online, but no retail locations will be set. The festival will also feature a number of new shows. The inaugural edition, titled “Microscope,” will focus on the work of artist and educator Yangon Ma, who is best known for her public presentations at the Grand Rapids Art Museum in Michigan. The show will include a special exhibition of work by Renata Olters, who will present a solo exhibition in the new space in October. The show will also include a group show of work by artists such as Tanya Blum, Hao Lie", "The next Biennial should take place in 2020 and will be led by architect and urban designer Fotosopas, who helped shape the project with his firm Architecture Biennale. The eighty-five-year-old architect is regarded as one of the pioneers of modern urbanism in Thailand. \n\n\nThe American Institute of Graphic Arts (AIGA) in New York has received a gift of more than eleven thousand photographs by photographer Max Hollein. The sculpture is a selection from his series “Faces of Noise” (2006–2007), which was based on a photograph of a dilapidated New York apartment complex, which had recently been converted into a museum. The series was selected by director Tony DiTerlizzo after AIGA board member David K. Pinckney gave him one of the works in a lifetime of memory.Pinckney, who has long supported AIGA’s role as a catalyst for cultural and professional collaboration between the United States and Europe, said: “In recent years, AIGA’s work has provided a guide for artists and designers on how to experiment with and rework the modern city in the service of urban history. Max’s drawings are rich in", "The next Biennial should focus on “postcolonialism” (2016), “the history of biennial exhibitions” (2017), “The complete, the complete last” (2018), and “In Defense of the Flesh” (2019). The committee will announce the winner of the $50,000 Prize in late October.In a letter sent to the museum in March 2019, the artist said that he had been approached by the museum to participate in “The Innocence of Others” (2019), “The Thin Red Line: Painting the Biennial 2020” (2019), “The Intersection of Film and Art” (2019), and “Quiet: Filmmaking in Africa.” He also invited the institution to host his next solo exhibition at the museum.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has announced that it is preparing to welcome the public back to the museum on September 28. The institution is improving internet connectivity to the museum by upgrading its fiber-optic network, which aims to reduce data usage by as much as 95 percent, and is implementing new security measures, including deploying more staff to prevent disruptions to exhibitions, screenings, and other", "The next Biennial should be held in May 2022. The ten-person jury, which comprises Sarah M. Blain, director of the Hayden Gallery in New York; James A. Scott, president and CEO of the New Museum in New York; Chris Line, director of the Metropolitan Museum of Art; and Markus Schäfer, director of the Museum of Contemporary Art Freiburg in Germany, will determine the theme for the biennial. The artwork in question is a monumental rendering of a huge black, triangular object that is shrouded in black fabric. The artist, who lived in a cave in the mountains of central Italy from 1996 to 2005, created the work as part of a project named Resi Uno in which he taped himself to an altar while naked and prayed to be allowed to ascend to heaven. The piece, which was made in the style of a cave painting, was exhibited at the Venice Biennale in 2012 and was acquired by the artist for $575,000 in 2006.\n\n\nThe New Museum in New York has launched an Arts & Culture initiative that will provide new funding and assistance to artists and cultural workers in the city through the creation of new partnerships between art institutions and local community organizations. The program, ", "The next Biennial should take place in March 2021. \n\n\nThe National Museum of Ireland has appointed Thomas F. O'Connor as its new director. He succeeds Frank O'Connor, who has helmed the institution for over twenty years and will retire at the end of the year.“An accomplished curator and scholar who has developed a strong and highly acclaimed reputation as an outstanding advocate for new and contemporary art, Thomas brings with him a wealth of experience and knowledge to our new role,” said Museum director Paula Meehan. “We are delighted that he will join us at the museum next year. His profound understanding of the history of modern and contemporary art, as well as his desire to champion and protect the collection and exhibitions of the National Museum of Ireland will be of great value to us and our visitors.”Founded in 1922 by Sinead Mullery in Cavan as a cultural destination in the city, the museum has undergone a number of organisational changes over the years. Its current incarnation, the National Museum of Ireland, was established in 2022 as the reinstallation of the museum’s collection. The museum also underwent a major facelift in 2017, with the purchase of 3,", "The next Biennial should be held in the vernacular style. The concept should be supported by a collective of artists that has been working on it for several years. The prize exhibition should be organized in New Delhi and will consist of a selection of works by all the finalists in the three categories of art, photography, and design.The exhibition will also be hosted by the Delhi- based non-profit organization Artforums India and will be led by the artist Praveen Gowlal, who was nominated for the first time for the category of photography and has been chosen for his work Surrealism’s Table, 2016. The exhibition will be hosted at the Art Deco Ghat in New Delhi and will take up themes such as photography, photography practices, and the relationship between photography and the Indian subcontinent. The exhibition is organized by the Art Deco Ghat.\n\n\nThe Los Angeles County Museum of Art (LACMA) has added two new artists to its roster: Hal Foster and Robert Irwin. The museum confirmed the additions on Tuesday, December 21, and announced the opening of their first solo exhibitions in the city in January 2020. Foster is a Los Angeles native and the founder of the contemporary art installation", "The next Biennial should be held in the autumn of 2021. The first round, entitled “Kinder and Parer,” will be followed by a “Selection of Lilies,” and will run until December 2021.The 2019 edition, entitled “Ideas for a Biennial,” was staged by the cataloguer and was curated by Ateliers König. The exhibition featured a selection of twenty-eight works by twenty-six artists, including Piers Parry, Anish Kapoor, David Salle, Nuno Castellan, Tarek Atoui, Roberto Cicutto, Sara Cwynar, Oscar Pareja, and Jasmine Opatrada.\n\n\nKenichi Hoshine, the founder and director of the independent academic art and design space Moko Gallery in New York, is suing the Metropolitan Museum of Art in an attempt to recover more than $4 million in lost profits from the institution’s controversial renovation of its space in the Hudson Yards development project. Hoshine, a longtime art collector who was known for supporting artists both large and small, is suing the Met over the decision to", "The next Biennial should be held in 2022.\n\n\nThe Kunsthalle Basel, Switzerland, has released the schedule for its 2020 edition. Titled “Solve the Environment,” the exhibition will feature nearly 1,200 works by twenty-eight artists in various stages of development. The event will run from March 7 to March 10 at the Kunsthalle. The 2018 edition, “Estate of the Art” (March 13–March 15), opened on March 16. “Analogous processes,” the title of the exhibition, will address issues of the digital age and address the question of how art can be reproduced in a digital environment. According to the organizers, the exhibition will highlight the truth that art has always been a tool for transformation but this is no longer enough, as we live in an information-based world.Artforum has reached out to the Kunsthalle for a statement. \n\n\nThe Smithsonian’s National Museum of African Art (NMAA) in Washington, DC, has received a gift of eighty-nine works by forty-six African American artists, including forty-two works by artists who were born in cities such as Birmingham, Hattiesburg, Richmond, and St.", "The next Biennial should aim to work with communities throughout the city to create as many new experiences for the public as possible. The exhibition will take up themes such as how art can open up our world to new possibilities and the importance of community in the cultural life of the city.”\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, has announced that it will open a new center dedicated to Pacific Northwest art and culture in March 2020, and that the center will constitute its largest exhibition of works of modern and contemporary art in the United States. The inaugural exhibition, “Pacific Northwest Post-Impressionist Art,” will consist of twenty-three solo presentations. The center will also expand the museum’s collection by presenting more exhibitions of work by artists of the Pacific Northwest.“We are thrilled that MoCA will dedicate its March 2020 exhibition to Pacific Northwest art and culture,” said Elizabeth Ho, MoCA’s director. “This is the moment when the Pacific Northwest has been historically understudied and underappreciated in the United States. We will present a collection of work by artists whose work exemplifies the Pacific Northwest’s contemporary aesthetic, and we will celebrate the artist’s legacy", "The next Biennial should take place in the city of New York, and will be held at Rockefeller Center from March 21 to March 23, 2020. The exhibition will feature works by forty-four artists, including Calix, Fairo, and Foster, and will launch in conjunction with the fifth edition of the New York Biennale, which is scheduled to open in October 2020.\n\n\nThe London-based artist Kirsten Alberts, who creates works that examine the power of light, color, and shadows, will receive the 2019 Turner Prize. The twenty-eight-year-old American artist, who has exhibited her work at the New Art Museum (NAO) in New York, the Whitney Museum of American Art in New York, and the Whitney Museum of American Art, has been nominated for the prize for her first solo exhibition at the prestigious museum in London.The prize jury announced the nominees on Tuesday and announced that K.C. Johnson and M.L. Marley were selected from a shortlist of seventeen artists. “Although the shortlisted artists have long established their own recognitions, the Turner Prize will now celebrate their contribution to the field,” said Turner Prize trustee Isabelle G. Foster. The judges also awarded", "The next Biennial should be held in 2021 and has already received funding from the National Endowment for the Arts (NEA). The 2019 event, titled “The Future of Art,” drew more than 200,000 people and featured work by eighty-six artists.\n\n\nArt historian Victoria Miro shows her work at the Frieze London exhibition. The show will be on view until March 28.\n\n\nThe Art Institute of Chicago (AIC) is reopening following the conclusion of its long-overdue redesign with a new set of curatorial practices and an expanded scope for funding. The institution, which has been closed since March 13 after it opened to the public on March 10, expects to be fully operational by March 23.“While the design and construction of the new museum was a collaborative effort between IAC and the City of Chicago, the design and construction of the institution is, on the whole, a collaborative effort between the City of Chicago and IAC,” said director Tony Adams. “The new museum will include new public spaces, new curatorial practices, and more accessible galleries. . . . We are excited to share more details about the design and construction of the new museum, which will be a world-class", "The next Biennial should be held in the spring of 2020, and the first in the autumn of 2020.The exhibition will be organized as follows:The 2018 exhibition “The Space Between: Art and Death” represents the twentieth edition of the International Biennial in Paris. The exhibition, which was organized by the Saatchi Gallery in collaboration with the Paris-based foundation CIN, was one of the first events organized by the French Ministry of Culture to take place in the capital in order to promote cultural and artistic exchange between the country and the rest of the world. The exhibition includes more than one hundred works by forty-nine artists from thirty-six countries and territories. The participating artists are: David H. Dzhugashvili (Finland), Kiko Mochi (Japan), Oscar Tiroz (France), Gina Tan (Singapore), Samantha Tanner (Australia), Tanya Taveras (Luxembourg), Mara Wertheimer (Germany), Emily Hall (Ireland), Danielle Stryker (Ireland), Dr. Brian Williams (US), Stephanie B. Anderson (US), Tina Bohart (US), Ruwan", "The next Biennial should take place in the middle of the year, at a venue that will be selected by the city of Athens. The entire project, which will involve more than 1,300 works and will run for ten weeks, will start in April 2020 and conclude in June 2021. “The new exhibition will be a constellation of exhibitions and presentations that will be made in order to integrate the full array of activities in the city, the capital of the Republic of Greece, with the project of the Greek city,” Artforum reports. The new format will allow the exhibition to run longer and will adapt to the unique needs of the cities of Athens and the city of Marfa, where the exhibition will be held. The city’s museum of ancient history, the Museum of the Hellenic People, and the Museum of Modern Art will continue to be open, while the archaeological museum will continue to be accessible to the public. The new exhibition will be in addition to the three previous biennial tours, which were held in the summer of 2019 and in November 2020. The upcoming biennial will also include two performances, a film, and a virtual reality experience. The full list of participating artists is as follows:\n“After the Fall:", "The next Biennial should be held in 2020, at which time the twenty-four participants will have almost a year to redesign their exhibition spaces in order to prevent a repeat of the emergency at an international level.\n\n\nThe Japanese Ministry of Foreign Affairs (MAFA) has announced that it is planning to open a new section dedicated to cultural heritage in Shanghai in July 2021. The new museum, dubbed the 'China Viewing Rooms,” will be located in the first building of the PRC’s State Art Museum and will be a collaboration between the two countries. The ministry also announced plans to expand the Cultural Heritage Museum in Beijing, the Beijing Art Museum, and the Beijing Museum of Art. The event will launch with a retrospective of the work of the artist Ai Weiwei in May.The title of the biennial is “The Future Is Now and Culture Is Everything.” MAFA’s proposal to dedicate one hundred percent of the museum’s holdings to cultural heritage was made in response to pressure from China and Japan to create a new chapter of the museum devoted to the heritage of ancient civilizations, art, and culture. For decades, the museum has often been criticized for excluding China from its exhibitions and for fostering an image", "The next Biennial should also have a single director, a chair, and an operating budget that are sustainable for the next five years. In the next twelve months, the museum should also begin the construction of a curatorial outpost in the city, one of a number of campuses of the museum in the city, and a dedicated space for contemporary art, art history, and art therapy. The museum will also invest in a new water tower and a green construction site to improve the museum’s accessibility to the city. The National Galleries of Scotland is planning to build an additional 350,000 square feet of exhibition space on its campus in Heuston, near Aberdeen. The University of the Arts London has rescinded its offer of a £7 million ($9 million) grant to the University of Glasgow to help the school prepare for its first triennial. The move comes amid a controversy surrounding the school’s upcoming exhibition “The Third Wave” and the exhibition’s location in a way that it says is not in keeping with the institution’s values. The exhibition will be staged at the Contemporary Art Museum St. Andrew’s, as part of a three-year, multi-platform project that will include the", "The next Biennial should be held at the Marrakech Institute of Art, Morocco; the Museum of Contemporary Art, New York; and the Museum of Modern Art, London, and the Royal Institute of International Architecture in London.The next edition of the Art Biennial will be held at the Museum of Contemporary Art, New York—the Netherlands’s Museum of Modern Art, London—the Museum of Contemporary Art, London, and the Kölnische Galerie, Germany—in February 2021, and at the Museu de Arte Contemporáneo, Barcelona, in March 2021.\n\n\nThe National Gallery of Art in Washington, DC, is revamping its collection of more than 1,500 modern and contemporary art works by women artists, adding more than 2,000 works by men in an effort to diversify its holdings. The exhibition, “Women and Modern Art in America,” will open on January 10, 2021 and will be curated by Nancy LeCompte, director of the Smithsonian American Art Museum. It will feature works by thirty-eight women artists, including Anna Atkins, Kiki Smith, Katja Smolensky, and Jean-Michel Basquiat.The reinstallation of the museum", "The next Biennial should focus on the process and processes of the production of new works in post-modern art. The exhibition should focus on the uses of machines in art and the art of art made on the 21st century.”For the biennial, MoMA will present twenty-five artists and collectives, including Kate Crawford, Lois Emerson, Max Beckmann, Hollis Frank, Manfred K. Piet Mondrian, and Filippo Totti, each of whom will be given a twelve-hour slot to perform an original work, creating an ongoing event that will include thirty-four artists. It will also include a selection of works by the artists at the website Artforum’s online biennial, “Artforum: The Future Is Now,” which will be held at Artforum’s headquarters in Manhattan from March 6 to March 8, 2020. The biennial will feature the work of seventy artists, including Gertrude Stein, Cécile B. Evans, Ed Ruscha, Willem de Kooning, and Urs Fischer, and will be hosted by MoMA’s Southbank Center in New York, and the Yuz Museum in San Francisco.\n\n\nThe recent expansion", "The next Biennial should be convened in 2020 and will be led by the Los Angeles–based artist and curator Adrián Zaldívar. It will be modeled after the Los Angeles–based nonprofit Artadia, which launched in 2014 to sustain artists in the Bay Area.For the inaugural exhibition, which will be held at the San Francisco Museum of Modern Art (SFMoMA), artist Ryan Huang will create a 360-degree virtual reality work titled Triumf, which is partially based on a concept he first drew up in the late 1990s while he was still working at the University of California, Los Angeles (UCLA). “Forget what you see and hear around you,” Huang writes in the interactive work, “Focus only on the things that are here, right now. . . . Your attention will be more focused on the things that are within this world, and those that are beyond.” The exhibition will follow the theme of ‘Call to Action’ from the 2014 collection of the artist, 'Eleanor Friedan: A Retrospective,” which is currently on view in the museum’s sixth exhibition “Visitors” and will contain works by twenty-eight artists", "The next Biennial should be held in 2020.\n\n\nThe Dusseldorf-based contemporary art research company Ellosmoto will open an office in Dusseldorf in the German city’s Helviertal district. The new outpost will host five exhibitions at the same time in the city every month. The new exhibition series, entitled Divination, is curated by Hieb Kamm and will be held everywhere from April to September.Participating artists include Johanna-Kristina Holl, Edwidge Danticat, and Wolfgang Hahn, among others. The inaugural exhibition will focus on the concept of time in “Celestial Society” and will be presented by the German artist Wolfgang Osvald. The exhibition will focus on the history of the human race and its place in the cosmos.“This is an exciting time for contemporary art as we enter the twenty-first century,” said Helviertal city councilor Ulrich Zollitsch, who also praised Ellosmoto’s support of the local arts and culture.\n\n\nThe Michishige Gakuen, Japan’s only full-time museum dedicated to modern and contemporary art, is planning to", "The next Biennial should take place at the New Museum in New York from September 16 to September 19. “The ideal date to invite the whole Gallery to New York is September 16, 2019,” Michelangelo Antonioni, the director of the Gallery at The Center, told the Art Newspaper.Antonioni also praised the twenty-fourth NYC Biennial’s finalist, Adam D. Weinberg, who will represent New York City at the show in 2020. \n\n\nThe exhibit “Pink and Purple: Pop, Gender, Sexuality, and Resistance in the 1930s” at the Hammer Museum in Los Angeles opened on Monday, March 11, with a new work by the queer artist and activist Vinnie Bagwell. The installation, titled “Pink and Purple,” and a retrospective of her work that is currently on view, was created in collaboration with the Gay and Lesbian Community Center in Los Angeles (GLCA) and the Lesbian and Gay Museum in New York.“We are thrilled that the Hammer Museum is returning this work to the Museum of Modern Art in New York next year,” said Vinnie Bagwell. “This work will be included in our upcoming exhibition ‘Taking", "The next Biennial should come in 2021. \n\n\nThe heirs of Joseph and Edith Biennials, the pioneering American photographers whose work defined the American avant-garde, have named their son Ralph as the next head of the family business. Ralph will be the second son of Edith and Joseph, the founders of LensCrafters, a division of the couple that grew into a major force in the photographic arts. “We have been anticipating a strong, talented, and dedicated successor to the late Joseph,” said Edith biographer John Mullane. “A great deal of work has gone into ensuring that Ralph inherits a strong legacy of visionary leadership in the next sixty years. We are thankful to the many who have contributed to his legacy and to the many who have helped shape it, but the most important thing is that Ralph and Edith are still here and doing what they do.”According to the New York Times, the Biennials, who were active in the 1950s and ’60s, are raising funds to preserve their work in the event that Ralph dies before he reaches fifty years old and that his successor is not yet available.Edith Biennials was born in New York City in 1950", "The next Biennial should exhibit a selection from the new exhibition program, entitled “SOUNDTRACKS,”“a joint venture between the Los Angeles County Museum of Art and the San Diego Museum of Art.” The show will focus on the work of emerging and established artists, and will include works by artists who are currently understudied or unknown. The exhibition will also include a preview program of works by artists whose work was selected by a jury convened by the UCCA Arts & Culture Commission.The 2020 event will be held at the Los Angeles County Museum of Art (LACMA), which also recently celebrated its fiftieth anniversary. The LACMA biennial will feature twelve works by twenty-six artists, including Nils Stærk, Reiner Knobloch, and Nick Carraway, as well as a selection of works by the late Italian painter Vittorio Cattelan and the artist Michelangelo Antonioni, which will be on view through November.Carrraway told the Los Angeles Times that he sees the biennial as “an extension of LACMA’s mission to be a world-class cultural destination.” A winning design by architecture firm BLT Architects", "The next Biennial should be held in the autumn of 2020. The second Biennial will be held in the spring of 2021. The third Biennial will be staged in the fall of 2022. The fourth Biennial will be staged in the spring of twenty-third year and will consist of twelve artists. The fifth Biennial will be staged in the spring of twenty-fourth year and will consist of twelve artists. The sixth Biennial will be staged in the autumn of 2022. The seventh Biennial will be staged in the autumn of 2020. The eighth Biennial will be staged in the autumn of 2021. The ninth Biennial will be staged in the spring of 2022. The tenth Biennial will be staged in the spring of 2022. The eleventh and twelfth Biennials will be staged in the autumn of 2019 and 2021. The fourteenth and fifteenth Biennials will be staged in the autumn of 2019 and 2021. The last Biennial will be staged in the fall of 2022. The museum will remain closed until December 8, 2019, and will reopen on December 10, 2019, and December 10, 2019, respectively. MUSEUM HOURS: From 10 AM to 5", "The next Biennial should be completed in 2021, with the exhibition “Sustainability.” \n\n\nThe Museum of Modern Art (MoMA) in New York has accepted a $2 million grant from the Walt Whitman Foundation to create a new space for experimental art in the museum. The Whitman foundation will give the institution $150,000 in support of the program, which will launch with a major retrospective of Rineke Dijkstra’s first work, The Platform, which debuted in April at MoMA. A three-day free public art event will follow, during which time MoMA will host a free public performance by contemporary artist Victoria Miro, in partnership with the Seibert Foundation.The Whitman Foundation has also pledged $1 million for an exhibition titled “New York, 1940–2000,” which will be curated by Aaron Siskind. The show will include works by seventy artists whose works are currently on display in the museum’s permanent collection. The institution is also offering $500,000 for the production of a new collection of works by the Polish-born, Brooklyn-based artist Geremy Gutiński, who will create a new series of works that explore the history of color", "The next Biennial should be held in 2021, but the date for the inaugural event, which was moved to 2019, remains unconfirmed. French president Emmanuel Macron has said that the decision to cancel the event was not made lightly. He told a press conference: “The reason for the cancellation is not easy. We are faced with a historic decision. We must not hesitate.” The first edition of the exhibition, titled “Art of the Future,” was curated by Guy Garriques and Richard Onstad and premiered at the Museum du Quai Branly in Paris last November. The announcement that the final work of the annual event would be a “precarity,” or prequel, exhibition opened the floodgates to questions about how the art world would be presented in the sixteenth iteration of the exhibition. The exhibition’s inaugural edition, titled “The Photography Show,” was hosted by Alice Procter and co-organized by the Arts & Culture Foundation and the BBC. The show followed a series of photography exhibitions in the United Kingdom, and “The Watercolors” was the first to present a new kind of watercolor and, by Campbell White, a new kind", "The next Biennial should be held in 2021. It will also review the work of the past twenty years and then produce a review of the present. The eight artists who have won the prize so far—Liu Shuai, Li Zhijie, Hongji Eun, Taniguchi Toh, and Kishimoto Toshi—will participate. Presenting the winners of the inaugural award, which was established in 2010 as a way to advance the careers of artists in the Philippines, is a multi-million-dollar prize presented by the Tadao Ando Foundation for International Arts (DAFA). The award ceremony will be held at the Q and L Museum on Tuesday, October 20. Photos courtesy of DAFA.\n\n\nThe Miami Art Museum (MAM) has received a donation of twenty-six works by the late Egyptian photographer Amr Moussa. Among the works that were donated are several works by the late Pakistani artist Guru Nanak, which will be on display in a special exhibition titled Amr Moussa: The Elephant in the Studio, to open at MAM in January 2020, and a photo essay by the late French artist Gerard Manet, which will be included in a special exhibition at the museum in February 2021.", "The next Biennial should be on the subject of the subject within thirty days. The next edition will open in February 2020. The next edition of the Biennial will focus on the educational and cultural contexts within which contemporary art is studied. The theme of this year’s edition will be “Art and Memory.” The full list of participating artists is as follows:Anthony Ahearn***Funéad Collins’s Extra Life (New York) (May 21–June 22)Shirley-Lynne Fisker’s My Heart Will Go On (New York) (May 11–May 12)Laura Lamont, Jr.’s I Need You (New York) (May 13–May 17)Gina Lin's Busy Mind (New York) (May 14–May 16)Sagan Richter’s Finishing Touch (New York) (May 20–May 21)Maximilian Robles’s The Future Is Now (New York) (May 13–May 20)Claudia Samples’s House of The Mountain (New York) (May 13–May 20)David Salle’s Hear Me (", "The next Biennial should be held in 2021. The first will be held in 2020. The second will be held in 2021. The third in 2022. The fourth will be held in 2022. The fifth will be held in 2022. The sixth in 2022. The seventh will be held in 2022. The eighth will be held in 2022. The ninth in 2022. The tenteenth in 2022. The thirteenth in 2022. The fifteenth in 2022. The seventeenth in 2022. The seventeenth in 2022. The seventeenth in 2022. The seventeenth in 2022. The seventeenth in 2022. The seventeenth in 2022. The seventeenth in 2022. The seventeenth in 2022. The seventeenth in 2022. The seventeenth in 2022.  The seventeenth in 2022. The seventeenth in 2022. The seventeenth in 2022. The seventeenth in 2022.The seventeenth in 2022. The seventeenth in 2022. The seventeenth in 2022. The seventeenth in 2022. The seventeenth in 2022.The seventeenth in 2022. The seventeenth in 2022. The seventeenth in 2022.", "The next Biennial should be held in 2021. \n\n\nTacita Dean, the director of the Centre Pompidou in Paris, has been appointed the new chairman of the French pavilion for the Fifty-Ninth Venice Biennale. Dean was previously a curatorial assistant at the Venice Biennale for the Visual Arts and the Venice Museum Miami. She will succeed María Rodríguez, who is retiring after twenty-six years at the helm of the French pavilion, and will be responsible for designing the pavilion for Paris. Dean will assume her responsibilities on July 1. The announcement follows a series of events and actions that have taken place since Rodríguez announced she would step down in April. “It is a great honour to be chosen to lead the Pompidou in Paris,” said Dean. “I’m convinced that the Pompidou is the perfect venue for a new edition of the Venice Biennale. The show’s history is rich with stories of collaboration between curators, artists, architects and researchers, and I am eager to contribute to that history and to continue the work of M-PESA.”Commenting on her", "The next Biennial should take place in Tokyo in December 2022, which will be the fifty-ninth edition. The first Biennial, held in Los Angeles in 1997, received the Pioneer Series Award in 2018.  The next edition will take place in Tokyo in March 2022, and will be held at the same venue.The 2019 edition of the Festival, held in New Delhi, India, was marred by safety concerns after a child fell from a fifth-floor balcony on Saturday, March 12. The fourteen-year-old boy, who was with a group of ten to fifteen people, discovered the fall and was taken to a nearby hospital, where he remained under observation for several days. He later died of his injuries.The boy survived the fall by climbing a nearby overpass and speaking with a neighbor on the second floor of the building, who alerted nearby residents. The incident was investigated and the building where the incident took place was sealed off by the authorities. The 2020 edition of the festival, featuring eighty artists from thirty-one countries, is scheduled to kick off in December.\n\n\nThe Guardian has announced the ten artists who will be featured in a new exhibition dedicated to modernism, “Art and"]