["The next Biennial should unveil a selection of recent works by the Los Angeles–based artist Abigail and her husband, Brian. The exhibition will also introduce the public to the multi-disciplinary, ongoing exhibition series “Modernism and Resistance: Art and Artifacts in the Age of Resistance” (2019) at the Los Angeles County Museum of Art; “The Painted Figure, 1937–1951” (2019) at the Museum of Modern Art, New York; and “The Painted Figure, 1950–1952” (2019) at the Museum of Modern Art. Other highlights include the exhibition “The Diminishing World of Everyday Life: Art and the Artifacts of Life” (2019), which will highlight the work of thirty-eight artists, including Rintoul, Tanya Bonakdar, Elyn Zimmerman, Peter Max, Stella Adler, and Hélio Oiticica, and will open at the Brooklyn Museum in September.For more information about the 2019 biennial, visit BAMMA. For the 2020 edition, visit the San Francisco Museum of Modern Art.\n\n\nThe Pérez Art Museum in Mexico City, where the body of a missing student was found in a mass grave", "The next Biennial should kick off in March 2019. The grand opening will take place at the newly reconfigured Biennale Hall of the Arts in Stockholm and will feature a new work by artist Hannes Kounelles. The exhibition will run for thirty days, from March 16 to March 20, 2020.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has launched the Metropolitan Museum of Art for Artists (MMA) for Arts and Cultures. The program, which launched in March 2019, will support the careers of thirteen artists by providing them with work space, mentorship, and resources. The artists selected for the program are artists such as Richard Anuszkiewicz, Dorian Brown, Will Charnock, A.J. Giger, and Mark Halperin. “We are thrilled that the Met is bringing these artists and their work to life through the museum’s new galleries,” said Scott Stewart, the institution’s director. “This is a rare opportunity for the museum to work with these artists and see their visions for the new spaces. We’re building an exhibition that will inspire and engage each of these artists.”The artist residency", "The next Biennial should be held at the Studio Museum of Art, New York, in 2021. \n\n\nThe New Museum in New York has appointed Wendy Hall as its next director. Hall has been appointed by New Museum trustee Francis B. Zender to serve a four-year term beginning in January 2021. She succeeds Ted Reimer, who has led the institution since 2016, and will take up the post in January 2022.“Wendy has achieved a remarkable career in the field of contemporary art and has emerged as a highly respected leader at New Museum, with a proven track record of developing and advancing transformative exhibitions and programs,” said John Merrick, New Museum’s director and CEO. “We are deeply honored to welcome her to the New Museum. We look forward to her leadership and vision for the future of Biennials.”Hall previously served as the founding director of the Brooklyn Museum, where she oversaw the opening of the Brooklyn Museum’s Ape in a Pint—a seventy-one-foot-tall, sixty-ton, twenty-four-carat, yellow American Pie sculpture by David Childs\u0097a work that reimagined the pie as an emblem of the", "The next Biennial should focus on a narrative approach with the theme of an unnamed historical figure and its impact on the life of a small town in the American West. The exhibition should also include a selection of works by individual artists and the institution should consider establishing a private collection of the artist’s work. The museum will also try to foster a relationship between the artist and the institution in order to provide the artist with a platform for exploring his or her work and the institution will collaborate with the artist to share a single collection of works.The institution has compiled a list of twenty-five artists who were awarded the festival’s Arts and Cultures Award, which was established in 2012 to recognize their achievement in the exhibition field\u0097the prestige of the award is tied to the institution’s performance in the exhibition field. The artists who were chosen are Bryan L. Adams, Margaret Heilbron, David A. Hart, James L. Marsh, Fanny R. Lyle, Robert Lowell, Julia Mille, and Calum Thomson.Commenting on the exhibition, which will run from March 22 to March 26, 2020, Kohn said: “In the short term, the exhibition will provide an opportunity for artists to", "The next Biennial should begin as soon as possible and will run as a one-time event.  “A good example of how an online platform can be used for the promotion of art is the exhibition 'Ütudes des rationales” at the Sargent’s House in Berlin in 2016, which was a crucial opportunity for the exhibition of the work of Svetlana Malashova, a Soviet dissident artist who was imprisoned for her outspoken opposition to the Bolshevik regime in the Soviet Union, and was awarded the National Medal of the Russian State for her work,” said Jean-Luc Haemans, the head of the Frankfurt Art Museum. The show opened on May 6 and ran for fourteen days. The theme of this year’s Biennale is “Human Ecology” and the exhibition was designed by the artists who created the texts. In addition to the texts, the artists were able to include three photographs taken by the artist Petar Zivkovic, including one on the kitchen table, another on a storm drain, and a third on a landscape in which a man talks with a dog.The exhibition’s first edition at the Museum of Modern Art in New York in 2017", "The next Biennial should be held in 2020. “Today, the art of the most diverse array of locations, in the most diverse of places,” said Shimon Fogelman, director of the Biennial and the Metropolitan Museum of Art.   Since the first Biennale was held in Basel in 1992, the event has hosted more than 1,500 works. The 2019 edition, titled “The King and I,” presented twenty-one works by twenty-six artists, including Peter Hujar, Anya Mendieta, Michael Rosenblum, and László Moholy-Nagy.\n\n\nIn the March 17 issue of the Japanese magazine Dōjinshi, the artist Chiaki Nakahara, known for his nude, staged a show, “NIBURUMi,” at the Art Museum Tokyo (AMNH), where it will be on view until October 28. The exhibition includes twenty-five works by six different artists and is organized in a variety of ways.Nakahara, who is known for his large-scale installations, including his Space-Motion series, is known for taking photographs of his subjects fully clothed and exhibiting them in his new museum", "The next Biennial should be held in 2022.\n\n\nThe second issue of the biennial, “Melancholia: Art and Literature from the 1960s to the Present,” will be released this fall. In 2018, the museum’s Tate Britain branch opened in West London, and in 2016, the Tate Modern opened in a former coal-mine in Tate’s former site in the Thames, the former site of the former Tate Liverpool, in London.\n\n\nThe Whitney Museum of American Art (MoA) has appointed Courtney Hughes as its next director. Hughes comes to the institution from the Whitney Museum of American Art, which she helmed from March 2019 to March 2020. She succeeds Carolyn Baker, who retired in March 2020 after seventeen years, and will assume her post on September 1.“Courtney is a highly strategic leader who has successfully navigated the complex global landscape of the art world in her leadership role,” said Marc Glimcher, chair of MoA’s board of trustees. “We’re thrilled she’ll be leading this exciting new chapter at MoA. We wish her the best in her new role and look forward to working with her to advance the museum’", "The next Biennial should focus on the history of the exhibition, with a particular focus on the exhibition’s first year in Taiwan in 1995 and the exhibition’s presence in Europe from 1989 to 1990. The exhibition will feature sixty-two works by seventy-five artists. Inaugurating the event will be a retrospective of Jean-Michel Basquiat’s The Fifth Element (1991) at the Museum of Modern Art in New York from the collection of the artist’s son.The artist’s next solo exhibition will be at the Museum of Modern Art in New York from October 7 to October 22, 2020. The inaugural show of works by José Andujar, a native Curacaoian, will open at the Fall/Winter 2020 exhibition at the LaGuardia Design Center in New York on January 18, 2021.\n\n\nThe Los Angeles County Museum of Art (LACMA) has received a gift of seventy-four works from the artist-in-residence program, an initiative that brings works to museums from around the world, including New York, Boston, Washington, DC, and London. Among the works on display are a selection of Robert Irwin’s 1962 American Diet, a collaboration with", "The next Biennial should be a major event for the city, with a new exhibition of work by sixteen artists, including Adria Scott-Savery and Mark di Suvero. The event is also planning to hold the next iteration of its International Talk Show, which will be held at the Museum of Modern Art, as well as a live performance series and a series of exhibitions. The new partnership between the museum and the city of St. Louis also involves the development of an urban farm and the the city’s first-ever garden center.When the 50th anniversary of the city’s Water Street viaducts—the span that connected Missouri’s downtown with its suburbs and served as a vital artery for residents of the city—is announced in 2021, the city’s transportation plan calls for construction of seventeen miles of bike and pedestrian infrastructure. The plan also says that twenty-one miles of the viaduct will have been completed by then. The city is also planning to open a park near the existing Water Street arch, and will begin constructing the 1,800-space Kennedy Center, which will be located in the former offices of General Motors, in 2021.\n\n\nThe inaugural edition of the Waldorf Astoria Biennial", "The next Biennial should be held at least once a year, and should include a selection of works by a group of artists who come together to collaborate. It also should involve a selection of works by female artists. \n\n\nThe exhibition “BE/B: Queer Art” at the Asia Art Museum (AAPM) in Beijing has been pushed back a week due to the coronavirus. Previously scheduled for February 23–March 4, the exhibition has been canceled due to the pandemic. The April 1 opening of the exhibition was also pushed back.The postponement follows a cancellation of a joint exhibition between the Museum of Art, Los Angeles (CA), and the Asian Art Museum, Taiwan (AAM), which was set to open in March. The half-hour-long exhibition—which featured works by forty-six artists—was supposed to begin on February 26.\n\n\nThe family of artist Thomas Edison, who passed away from cancer in 2007 at the age of seventy-two, is suing the manufacturer of a popular anti-epidural medicine, a painkiller derived from his own body called medroxyprogesterone, in an attempt to recoup some of the $1.5 million he donated to the ART Institute", "The next Biennial should be a celebration of the life and work of women artists, whose work has been historically underrepresented in the art world’s history. Over the last thirty years, the exhibition has presented work by twenty-six women artists (including Simone Leigh, Elizabeth Peyton, and Anastasia Pereira), representing twenty-three countries, including Australia, France, Italy, and the UK.“The way we see the world today\u0097whether through the biennial as a contemporary tool for women artists or as a vehicle for political and cultural activism\u0097is a potent and urgent reflection of our time,” said Kate Adelineaux, chair of Arts Council England. \n\n\nThe Art Newspaper has revealed that Ludwig Wittgenstein, the self-taught German painter whose massive series of interiors, murals, paintings, prints, and posters depict images of animals, plants, and landscapes as well as human figures, will receive the 2019 Prize for Lifetime Achievement at the Museum of Modern Art in New York on November 23. The award has been awarded annually since 1972. Previous winners include Tibor Heimer, Richard Diebenkorn, and Willem de Kooning.Born in Vienna in 1927, Witt", "The next Biennial should be held in 2020 and will begin with an exhibition of work that will include work by over 180 artists from ten countries, including Brazil, Chile, Japan, Korea, Mexico, and the United States.Following the exhibition, the Biennial will host a series of concerts and residencies, which will culminate in a lecture series by one of the series curators, and will conduct public programming. The series will also include an exchange program with Tel Aviv University.Its first location will be in a former industrial site in the city of Riga, which has housed the museum since the 1960s. The new facility will be inaugurated by a presentation of the first exhibition of work by the new work by Šimo Trg; the same show will be followed by two lectures by three international curators, Kader Attia, Alex Hirsch, and Moshekwa Nabi, the vice director of the Radi Foriska Gallery in New York; and a presentation of work by a select group of artists from the European continent.The inaugural event, “The Beginning of the End” (2019), which will open on March 27, will present the work of the Renate Vázquez Triennial, which will take", "The next Biennial should be held in January 2021—the date of the first exhibition in the exhibition center, which was completed in 1996. Nominated by designer Lee A. Miller, the exhibition will feature more than 5,000 photographs by contemporary artists, including Salvador Dali, Elizabeth Peyton, and Andy Warhol.“The exhibition takes the field as far as it can go, and investigates the meaning of photography in the contemporary world,” said artist and curator Willem de Kooning. “From large-scale installations to discrete works, each work will invite viewers to engage with and connect with the work. Art is art, after all, and we have a responsibility to protect the art of the present.”\n\n\nThe opening of the first chapter of the sixth edition of the Beijing Biennial was delayed due to a fire at the exhibition venue. The fire broke out on Monday, January 5, and spread to a second floor that housed the venue’s permanent collection. In a statement, the exhibition stated that the exhibit was open to the public at the time and “is safe and sound.”The firemen who extinguished the blaze, which took place on the second floor of the exhibition space, found the second", "The next Biennial should take place in Germany in 2021 and will follow the same format as the last one, with the following changes:The exhibition will be divided into three parts: Biennials 1, 2, and 3. Each part will feature a selection of works by twenty-four contemporary artists and will run for twenty-four weeks. The first part will consist of a selection of works by fourteen artists. Next, the artists will be invited to present a solo exhibition at a museum in their hometown. The third part will feature seventy-eight works, selected by the artist Mark Halperin, at the Berlin Art Museum. Artforum has learned that the Biennial for the Visual Arts will have a physical location in the city of Frankfurt and will be hosted by the Institute for Contemporary Art (ADI), which is affiliated with the University of Frankfurt. The institution is also planning to open a new exhibition and a new site in the city in 2020.The venue is taking its first steps in the construction of a museum of Germanic art, when a thirty-meter-long glass cube was scheduled to be erected at the Kunsthalle Basel in 2020. However, the project has been put on hold owing to the Covid-19 pandemic.", "The next Biennial should coincide with the latest iteration of the Rock and Roll Hall of Fame, which will take place in 2020. \n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Carol Schirmer as its next director, effective immediately. Schirmer comes to the institution from the Museum of Fine Arts in Cleveland, where she has served as interim director since July 2019.“We are delighted with Carol’s appointment, which affirms the work of our talented, caring, and dedicated staff,” said MFA director Peter W. Ross. “Her leadership qualities, integrity, and enthusiasm for our mission and for the collection align perfectly with our values. She is a great fit for the museum and will continue to expand our collection and education for audiences in the city and region.”Previously, Schirmer served as assistant curator of photography at the Museum of Modern Art, where she worked on the photography program for the Closed for Contemporary Art and Architecture, including the exhibition “The Dabor” (2019) and “Paul Gauguin” (2019). She also held the position of director of the Whitney Museum of American Art, where she oversaw the museum’", "The next Biennial should take place in 2020 and the date will be announced at the end of September. The 2019 iteration of the exhibition—which consisted of a selection of artworks by forty artists from twenty-six countries and was curated by artist-in-residence Marc-Olivier Savoy—was held at the Eiffel Tower and featured works by twenty-six artists and their teams.The event will also host a special exhibition titled “Unseen: An Experimental Art Trip,” which will explore the notion of “unseen” and explore the experiences and dilemmas that arise from the exhibition. The twenty-third edition of the exhibition will be held at the National Museum of Art, Paris, in September 2020.\n\n\nThe eighteenth edition of the Sharjah Biennial, “Away from the Campus,” was set to take place in the United Arab Emirates on September 11–September 13, 2020. The event drew 27,000 participants from twenty-six countries, and was organized by the Sharjah Art Foundation (SAF) and the National Centre for Arts and Culture (NCC).The event was organized to “strengthen the capacity of contemporary art in the region", "The next Biennial should be held sometime between April and October 2021.\n\n\nThe National Trust for Scotland (NTS) has welcomed Tanya Buckley, Claire Armitage, Kate McKinnon, and Olivia Williams to the board of the Royal National Museum Scotland. The three women will posthumously be granted the Nobel Prize in art next year. The three artists were chosen by a committee chaired by Sir Christopher Wren, director of the National Galleries of Scotland; director of the National Museum of Scotland, National Museum of Scotland; and Vice-chair of the National Trust, Sir Edward Harrison. Each artist will receive an additional $3 million in support of the institution as it proceeds with its plan to move its entire collection to a new home in Witton, near Edinburgh, in the coming years. In a joint statement, Nancy Ball, chair of the National Trust, and Lord Nash of Hartlepool, chair of the National Museum of Scotland, said: We are delighted to support the National Museum of Scotland and its ambitious plans to return our collection to Wales by the end of this decade and into the passionate care and attention of our beloved National Museum of Wales. The move will enable the", "The next Biennial should take place in 2020.\n\n\nPublic Art in London—the annual open-air art fair that recently made history for its inaugural year by becoming the first art event of its kind—has announced that it is suspending its 2020 edition after all episodes were completed. Haroon Mirza, the CEO of the British nonprofit the Art Fund, said that the event will not return to Tate Britain in London, which has been closed since March 11, and will instead hold the first edition in 2022.The event, which is supported with a £100,000 prize, expanded upon themes of politics\u0097the global conflict zone of migration, displacement, and conflict, and its relationship with the emerging Black Lives Matter movement\u0097and welcomed more than 1,500 participants. The 2020 edition featured work by seventy-five artists and art organizations from thirty-six countries, including Germany, the United Arab Emirates, and the United Arab Emirates, for a limited number of tickets, priced at $100 each. The event also saw the debut of the inaugural exhibition “This Is Not an Event,” which was curated by artist and activist Olafur Eliasson.The event was reached during a “tireless work by an exhibitionist", "The next Biennial should focus on “theoretical tools and technologies for the production and dissemination of art and art-based activities.” In its first iteration, the inaugural event, curated by Sarojini Naidu, took place at the Art Institute of Chicago. The next iteration, curated by Jürgen Steinmar, will be held in November 2019. The museum’s director, Carol Dweck, also announced that the date and venue for the fifth edition, curated by Juliette de Bont, will be announced sometime in the first quarter of 2020. Steinmar will collaborate with Sandy Sobey, the inaugural director of Contemporary Art in India, in developing the theme of the exhibition. The Art In Motion Project, a new initiative launched by the National Gallery of Australia in Canberra, will co-organise a “socially conscious” exhibition, “Outsider Present: Contemporary Art in Motion” in November. The Australian Contemporary Art Museum, formerly known as the National Gallery of Art, has been renamed the National Galleries of Australia (NGA). The new name was chosen by the NGA in partnership with the National Gallery of the Arts. The decision", "The next Biennial should feature the work of twenty-one artists. They will be announced by the end of the year and will be represented by a private festival. The biennial will be hosted by the Museum of Modern Art in New York, which recently announced that it plans to build an additional 70,000 square feet of exhibition space to accommodate the exhibition. They will be announced in mid-March.\n\n\nThe Museum of Contemporary Art (MoCA) in New York announced today that it will remove a work by German artist Franz Kline and begin the process of reopening the institution’s former three-story campus. Kline’s group show “Plains of Illusion” (1987–1988), for which he was commissioned by MoCA, was originally scheduled to open in July. However, the show was put on hold at the insistence of MoCA director Adam D. Weinberg and curator Richard Armstrong, who argued that the painting was “not in harmony with our mission and philosophy.”Kline stepped down from the helm of the museum in July 2019 after a dispute with the board over his hiring practices. However, in a letter that was sent to the board by Weinberg and Armstrong, Kline wrote: �", "The next Biennial should take place in 2020. The day of the exhibition will be marked with a special exhibition of work by illustrators and creatives from the Contemporary Art Museum St. Louis\u0097an institution that is currently undergoing a $1.7 billion expansion.The Biennial will also be remembered for its commitment to supporting artists who have struggled to receive financial aid from institutions like the National Endowment for the Arts, the National Endowment for the Humanities, and the National Council on the Arts. The new partnership between the Boston-based nonprofit and the Metropolitan Museum of Art\u0097which will combine the Museum of Fine Arts with the Museum of Fine Arts Boston\u0097will likely culminate in the installation of programs, including a six-month residency at the Metropolitan, and a new mural by artist Stephen Friedman.The new museum’s board chair, James D. Porter, said: “We are thrilled to be working with the private sector to support artists and their families through this challenging time. It is a difficult time to become a parent, but the best way to support your child is to make sure they have access to the support they need. We are confident that the new partnership will serve as an important first step in creating an increase", "The next Biennial should be in 2021, in a city that has hosted the event annually since 1960.   The first Biennial was held in the city in 2006, at which point the city was in the midst of a construction boom. There have been no other Biennials in the city since.  The city’s existing venue, the Rock and Roll Hall of Fame, opened in downtown Cleveland in 2012.\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Simon Castets as its next director. Castets replaces Mary Anne Miller, who was appointed by Governor Deval Patrick in 2017 and has served as MFA’s director since 2013. “Simon embodies the values, vision, and passion of the Museum of Fine Arts in Boston. He holds a Ph.D. in art history from the University of Delaware and brings decades of experience in curating, exhibition, and research to the MFA, which has more than 1,800 works on display.”MFA director Mary Anne Miller said: “Simon’s big goal is to support the work of the MFA team in many ways, including through programs that promote their own cultural diversity and serve as a model for how", "The next Biennial should be hosted in the city in the coming months. Its next iteration of the event will be held in November 2019, and its next event will be “in the city.”\n\n\nThe Museum of Fine Arts (MFA) in Boston is preparing to welcome visitors back to its campus in November. The reopening of the arts complex was part of a $50 million renovation project that was completed earlier this month. The work, which also included the construction of a new visitor entrance and the renovation of the museum’s existing galleries, marked the opening of a new phase of the museum’s collection and education initiatives.“The current curatorial team and the whole MFA family is thrilled to start this new chapter with you, our visitors, and we look forward to welcoming you back to the museum next month,” said Elizabeth Flynn, director and chief curator of the museum. The opening of the new phase of the museum’s collection and education initiatives, called the MFA Boston, will take place at the museum’s new home on the grounds of the Massachusetts Institute of Technology (MIT). The exhibition hall, which will be inaugurated by a new sculptural tribute to the museum’s founding", "The next Biennial should be held in 2020. For the next edition of the event, the full list of participating artists will be announced. \n\n\nThe Institute of Contemporary Arts (ICA) in the City of New York has appointed Allison Craig as its new board chair. Craig most recently served as the founding director of the nonprofit artist-run space the Mural Arts Center (MASC), a space devoted to the study and production of modern and contemporary art. “I am thrilled to lead the ICA into tomorrow’s future as it continues to evolve as a national leader in the field,” said Craig. “In recent years, the ICA has become a globally recognized leader in the development and preservation of conceptual and modern art, making it a model for nurturing a culture of art. It is in the ICA’s vision and mission to remain an important cultural platform for the study and appreciation of art that we believe it is so important that it creates an environment and a climate where this kind of research and artistic practice can thrive.”Craig succeeds Matthew Curran, who was instrumental in the acquisition of nearly 150 works by some fifty artists over the course of five years and will take up his new post in January. In", "The next Biennial should be announced soon. \n\n\nThe Museum of Fine Arts (MFA) in Boston has hired Kate Hicks as its new executive director. Hicks was previously the chief curator of European art at the Museum of Fine Arts (MFA) in Chicago under the leadership of Michael P. McCarthy. She will assume her responsibilities in July.“Kate is a leader and a thinker who will contribute to our mission of fostering an interdisciplinary approach to exhibitions, public programming, and scholarship and who will bring an exciting and creative perspective to our museum’s collection and exhibition program,” said director Craig Peterson. “I’m looking forward to working with Kate and seeing how her vision for the MFA translates to our campus and the city of Boston.”For the next decade, Hicks will be responsible for guiding the MFA’s theme park, the MFA’s annual Fall/Winter Festival, and the museum’s annual Art of the Party. She will also work closely with the department of modern art and the curatorial team to establish a new studio and conference space at the MFA.“I’m thrilled that I’ll be returning to the MFA next year,�", "The next Biennial should take place in November 2020. Vincent van Gogh will be commissioned to create a new work for the exhibition.\n\n\nThe National Galleries of Scotland (the \"National Gallery\") announced today that it will not proceed with the construction of a new exhibition space in the historic National Theatre in Glasgow until spring 2021. The decision, which was made in response to the ongoing threat posed by the novel coronavirus, was made in an email sent to the gallery on November 8, and was made in a letter addressed to the gallery’s director, Tania Bochereau. In the letter, which was dated October 24 and addressed to director Alistair Hudson, Bochereau informed Hudson that’s proposal to present a “premiere” exhibition of work by the artist Renata Alfano (the first woman to win the Nobel Prize in art history) and the Scottish artist Robert Mapplethorpe (who was recognized for his work TMI: The Album) in April 2021 was not supported by the National Galleries of Scotland and had been “taken over by a company.”Bochereau also addressed the reasons behind the decision, explaining that the National", "The next Biennial should be ready by May 2021. \n\n\nThe center, which has hosted numerous exhibitions by artists such as Robert Irwin, Lois Dodd, and Ai Weiwei, announced today that it is planning to close its doors for a period of six months in order to rejoin the rest of the United Kingdom and the rest of Europe in recovering from the devastating impact of the Covid-19 outbreak. The name 'Ministry of Arts and Design,' which was first used by director Maria Balshaw in 1981, will be changed by the institution. The reorganization will involve the merging of the museum’s three departments: the curatorial wing of the museum and the collections.In a statement, the museum described the change as “a continuation of our long-standing strategy to make the museum as relevant and accessible as possible in the 21st century.” The museum will continue to offer programming that is immersive and engages with the cultural and social landscape in a way that has never been attempted before, including the 2018 exhibition “Diana Al-Hadid: The Arts and Design of the World in Motion,” which was presented in collaboration with the local arts center, the Charing Cross Arts Centre. The exhibition was closed until", "The next Biennial should be held in 2021. The next exhibition should take place in 2022. The next exhibition should be held in 2023. The next exhibition should be held in 2024. The next exhibition should be held in 2025. The next exhibition should be held in 2022. The next exhibition should be held in 2023. The next exhibition should be held in 2022. The next exhibition should be held in 2024. The next exhibition should be held in 2022. The next exhibition should be held in 2021. The next exhibition should be held in 2021. The next exhibition should be held in 2021. The next exhibition should be staged in 2022. The next exhibition should be staged in 2021. The next exhibition should be staged in 2022. The next exhibition should be staged in 2021. The next exhibition should be staged in 2022. The next exhibition should be staged in 2022. The next exhibition should be staged in 2021.The next exhibition should be staged in 2022. The next exhibition should be staged in 2021. The next exhibition should be staged in 2022. The next exhibition should have a new theme. The next exhibition should have a new theme. The next exhibition should", "The next Biennial should be held sometime in the second half of the year. “The newly elected President of the Republic, Rintaro, has expressed his desire to create a platform for the art of the future to be shared between the two countries,” Šdůš said in a statement. “We hope this new platform will give the public an opportunity to enjoy the works of the past in a timely and accessible manner.”The museum will invite visitors to visit the venue, which is currently being restored, next month.\n\n\nThe Metropolitan Museum of Art (MoA) in New York has appointed Anna C. Jensen, a professor of art history and theory at the State University of New York, as its next director. Jensen, who has served as a research scholar and curator at MoA since 2013, will be responsible for the development, articulation, and dissemination of new scholarship in the field of contemporary art.“We are thrilled to appoint Anna to her new role as director,” said Marc Glimcher, the director and chief curator of MoA. “Anna’s distinguished career as an educator and scholar and her commitment to bringing contemporary art to campus makes her uniquely qualified. We are", "The next Biennial should take place in 2022. The event will be hosted by the city of Barcelona and will be hosted on the sixth floor of the city, where the Oyelirens Tapestries, the Palacio de Arte de Barcelona, and the Biblioteca de Barcelona will reside.\n\n\nThe New York–based nonprofit Art Fund announced today that it has committed to providing $1.75 billion in grants and loans to help small and mid-size American arts and cultural institutions survive the Covid-19 pandemic. The organization will divide the funds among fourteen regional offices in the United States and Puerto Rico that will then award $500,000 each to thirty-three artists.The organization will prioritize projects with demonstrated potential for long-term impact and will prioritize loans that demonstrate deep community support. The twenty-five projects selected for grants will be announced in the coming months.“The Covid-19 crisis has made clear to us that our nation’s small and mid-size independent arts organizations are struggling,” said Jeff Rosen, president of Art Fund. “We are providing $1.75 billion to help them through this difficult period—and with that, we’re pivoting our organization forward to recognize the", "The next Biennial should consist of a selection of works by all of the artists selected from the seventy-nine countries who participated in the exhibition in the first edition in Paris in 1973.The importance of the exhibition is reflected by its inclusion in the biennial’s catalogue: its first edition in 1973, “Addressing Art,” was published by the American publisher HarperCollins, and in 1977, the twenty-fifth Biennial of Experimental Painting was staged at the Paris Museum d'Art Contemporain (PFM).\n\n\nArts workers and scholars across the United Kingdom are staging a massive strike in protest against the Royal Shakespeare Company (RSC) for its alleged plans to reduce the workforce through furloughs, lay-offs, and layoffs in an effort to reduce costs for the corporation and avoid paying workers who work at the company’s seven London locations, The Times reports. Among those striking at the companies are teachers, theatre artists, writers, and musicians, who are protesting the cuts through a variety of labor-saving measures including offering them more paid sick days and other health benefits, implementing paid maternity leave, and reducing working hours. The artists have also written letters to members of the corporation’s board of", "The next Biennial should be on November 20–25, 2020. \n\n\nThe New York City Department of Cultural Affairs (DCLA) has appointed Jennifer LeBlanc as the director of the Museum of the City of New York. She succeeds Charles Esmond, who has been at the helm of the institution for the past twelve years.LeBlanc comes to the institution from the Metropolitan Museum of Art (Museum of Modern Art), where she has served as the associate director of curatorial affairs since 2016. During her tenure at the museum, she helped organize the exhibition “Theater of Operations: World War II” (2019), which highlighted the work of American and international artists; introduced the “Art of Movement: Art in the Pacific Theater” (2019), which explored Pacific migrations and the United States’s role in the Pacific; and organized the museum’s first museum series, “Theophrastes and the Gods: Ancient Art in the City of God” (2019).“Jennifer brings to the museum a long-standing commitment to the museum’s collection of the work of contemporary artists, a dedicated and dedicated staff, and a creative and analytical approach that draws from both contemporary and historic", "The next Biennial should be titled “The Last Years of Pablo Picasso,” and will be held in 2021. The show will also reveal the first images of the \"Eternal Blue\" series. \n\n\nThe Institute of Contemporary Arts (ICA) in Tehran has appointed Ahmad Masoud as its new director. He comes to the institution from the Iranian Cultural Center (ICA) where he has served as director since 2015. Previously, he has been a professor at the School of the Art Institute of Chicago in Chicago, where he has taught since 1988. Masoud’s new position will allow him to expand the ICA’s regional presence and to develop a new collection of contemporary art from Central Asia and the Caucasus. Earlier this year, the museum opened a reopening platform for the art in the basement of the institution. Its first exhibition, “This Is Not Another Life: Contemporary Art in the Twentieth Century” (2016), featured work by Ninja Aitken, Nina Bambusi-Young, Nina Bensimon, Diana Busuttil, and Claudia Caraccioli.  “After a thorough search, the ICA", "The next Biennial should be held in 2021.\n\n\nThe Metropolitan Museum of Art, New York, has become the latest arts institution to announce that it will be closed for at least six weeks as part of a major $1.4 billion expansion project that will help make the Met more accessible, efficient, and affordable for visitors. The extension will also bring more galleries, more exhibitions, and more theaters. The expansion is part of the $8 billion overhaul of the Met, which is slated to begin in December, 2020. The project, which was initiated in 2015, was spurred by the coronavirus pandemic and the need for more art museums. The plan will also include the construction of new galleries, a new auditorium, and an expanded museum. The extension, which will also involve the renovation of the existing building, is expected to take four years.“The Met’s construction and renovation program has been of enormous importance to our community for more than a decade, providing a stable of permanent exhibitions and spaces for our exhibitions and community programming,” said architect and CEO Daniel H. Weiss. “With the completion of this comprehensive expansion, we are preparing to embark on a new chapter, one that will take us beyond the boundaries of", "The next Biennial should be held in Beijing at the end of March.  The next Taipei Biennial takes place in April.  The next Venice Biennial will take place in May.  The next Art Basel Hong Kong is slated to take place in June. *       Karen Keyhoe, president of the National Art Museum, Washington, DC:  Originally scheduled for March, the event was rescheduled for April 13–April 16.  The next edition of the Biennial will be held at the Metropolitan Museum of Art in New York from April 19–April 21.  A live performance by the British singer Charlotte Church will also take place in the exhibition.  On the opening day of the Sydney Biennial, the Australian pavilion announced that the event would be a “narrative of the future.” The next edition of the International Maori Festival will take place in Nelson, New Zealand, from April 21–April 24.  The next edition of Artforum New Zealand will be held at the Gisborne Museum of Art in Christchurch from April 19–April 21. Artnews reports that the next edition of the New Zealand Biennial", "The next Biennial should be in 2020, when the exhibition will be held in the new space. Although the Biennial was not originally scheduled to take place within the campus, Biennial Director Scott Mackay said: “We are looking forward to the opportunity to present our 30th Anniversary Exhibition in the new venue, with a unique and exceptional collection of works on exhibition-based experiences.”\n\n\nThe New York City Department of Cultural Affairs (DCLA) has named Cynthia Cox as its new deputy director of cultural affairs. Cox will be responsible for the day-to-day operations of the Department of Cultural Affairs’ cultural affairs division, which manages the city’s cultural assets including monuments, public art, and buildings. In her new role, Cox will take up her current post on January 2, 2021.Cox previously served as the deputy director of social and cultural affairs at the State Theater Company, where she worked on curating the Broadway production Hamilton, for which she directed the entire production team. During her tenure at the Department of Cultural Affairs, she helped organize the acquisition of more than 1,300 works and oversaw the relocation of more than 2,000 works, including the David Chipperfield–directed Hamilton the Musical.", "The next Biennial should be held in 2020.\n\n\n\n\n\n\nThe Museum of the African Diaspora (MoAD) in Atlanta has received a significant donation of $75 million from the Hood Family Fund, one of the largest philanthropic organizations dedicated to the advancement of African art in the United States. The gift, which also includes $50 million for MoAD’s acquisition of works from the collection of the Dallas-based collector Charles Hood, will enable the institution to restructure its collection and create a new platform for educational and research programming.“The Hood Family Fund has been a steadfast supporter of MoAD since 2015, when it began the process of removing works from its holdings to make room for the acquisition of works by new and distinguished collectors,” said Charles Hood Jr., the organization’s founder and chairman. “All of our work has been dedicated to advancing MoAD’s mission to welcome the African Diaspora to the museum and to create a stronger sense of identity for African Americans in Georgia and the South.”The gift also includes the acquisition of works by artists such as Rehana Sarr, Zulbie Sarr, and Chris Whyte, among others. In addition,", "The next Biennial should be announced in late February. \n\n\nThe Los Angeles County Museum of Art (LACMA) has launched a new digital platform, Artadia, that aims to connect visitors with new works by emerging and established artists. Created and developed by the Venice Council, the platform will organize monthly events and exhibitions that will highlight new work by established and emerging artists. “We are thrilled to introduce Artadia to LACMA and to showcase work by emerging artists in an exhibition that engages with the LACMA collection, with a unique exhibition-making experience, and with our audience,” said LACMA director Matthew Teitelbaum. “As we work to expand our collection and to present new works by emerging and established artists, we are inspired by the thousands of artists who work in the Los Angeles area and around the world. We are especially excited to introduce new works by artist-activists, activists, and coders, and the platforms will showcase their work in a live environment and explore the breadth of their practice.”Launched as part of the $100 million LACMA…We Want to Be Creative campaign, Artadia is a platform that will deliver monthly online events and a curated exhibition", "The next Biennial should be held in 2020 and is reportedly funding the event with $1.1 million.If the exhibition is successful in bringing together some four hundred artists from thirty-seven countries and fifty-nine countries outside of the Americas, the artists participating will be awarded $6.2 million.Cultural historian and curator Rusa J. Pape, who curated the exhibition, described the event as “a way of bringing together and communicating with indigenous peoples in the Americas.”\n\n\nA group of Danish artists, including Hans-Olivier Cornelius, Christian Uey, and Arne-Sophie Briem, have been awarded a MacArthur “Genius” Grant for their contributions to their countries’ creative industries. A total of $7.3 million have been allocated for the program, which was established in 2008 to support young Danish artists.“We are delighted to be able to present the MacArthur Fellows in the form of a major award,” said Gilbert Løvgren, chairman of the MacArthur Foundation and director of the Bjerkemans Museum in Copenhagen. “Such a generous gift from the MacArthur Foundation makes the fellows’ innovative and forward-thinking work more eligible for the award.", "The next Biennial should be held in 2021, the same year the thirty-second edition of the Crystal Bridges will be held.“Dr. Jeyendaal’s message is clear and resonant: these are times when we need to be sensitive to each other, working together, learning together, and making new,” said Reem, who was commissioned to create a new triennial for the culture in the 1990s. “Dr. Jeyendaal is a visionary and gifted leader whose vision is to rise to the occasion of our times with creative solutions, not divisive politics.”In a statement, the Fair said: “We stand with you, Dr. Jeyendaal and the many artists, musicians, writers, curators, and activists whose work was selected for this year’s Biennial. We hope that Dr. Jeyendaal’s vision will inspire us to continue to move forward. With love, hope, and allegiance, Dr. Jeyendaal and the Fair.\n\n\n\n\n\n\nThe Library of Congress announced today that it has appointed Edwidge Danticat as its next chief curator. Danticat joins the agency from the Smithsonian’s Metropolitan Museum of", "The next Biennial should be held in 2021 and the show will be hosted at a later date.\n\n\nFabian Herrenkopf (1927–1974), one of Germany’s most prolific and influential composers, has died at the age of eighty-three. His work is widely regarded as the founding work of the modern German composition tradition. His themes of the avant-garde, the urban, and the industrial were often influenced by artists who came later, such as Hans Frank, Robert Husband, and Ulrich Olbers, and he often fused the contemporary and the past to create new works.Among his many accolades were a French National Prize in 1927 and the Bienal Prize in 1948. He was also awarded the Ruben de Rooij Post-Cultural in 1974, the Belgian Cultural and Art Prize in 1987, and the Eiffel Art Prize in 1998. His most recent award was the Künstler-Institut für Kunstbildung des Bundes (KUF) in 2013, which was presented to him by the German state of North Rhine-Westphalia. In a new entry in the annual Beitrag zur Kunstbildung, the composer", "The next Biennial should take place in 2022. \n\n\nThe Queens Museum has appointed Stefanie Ahearn as its next director. Ahearn comes to the institution from the Metropolitan Museum of Art, where she has served as director of planning since 2019. Previously, she held the position of director of planning at the Museum of Modern Art in New York from 2005 to 2008.“Stefanie’s leadership, as well as her insight and passion for the art, will extend our vision, both as a museum and a city, for the next several years,” said Museum director Daniel H. Weiss. “We are thrilled to welcome her to the museum and to the city, and to have her take the helm of the entire museum, which has struggled to grow and define its own identity under the leadership of its current director, Neil MacGregor.”Prior to joining the Met in 2013, Ahearn served as the Director, Museums and Collections of Modern Art, Los Angeles. An advocate of urbanism and dedicated educator, Ahearn was instrumental in the transformation of the Los Angeles County Museum of Art, which she launched in 2007, into the nation’s largest museum dedicated to the collection of", "The next Biennial should be held at least once every other year. The first episode will be comprised of a selection of works authored by José Eduardo Sánchez, Jr., Harriet Knowles, and Elyn Zimmerman, and will be shown at the Museum in his capacity as director. The second episode will be a retrospective of paintings by Terrie Birnbaum, Ruth D. Owen, and Barbara Greene, and will be shown at the Museum.  The third episode will focus on the work of Denis DeGirolamo, and will be presented by the museum in his capacity as director of the local branch. The fourth episode will be a collaboration between the United States and Mexico, and will be shown at the Museum. The fifth episode will be a retrospective of the work of the American painter John Edward for the Museum. The sixth episode will be a special exhibition of works by the Mexican American painter Alejandro Gutiérrez. The seventh episode will be a presentation of the work of Pablo Picasso, and will feature works by the Los Angeles based collective Articulated Life. The show will also include a selection of works by Raoul Wallenberg, the architect of New York;", "The next Biennial should take place in 2021. “We are deeply grateful to the tens of thousands of local, regional, and international visitors to our collections, to the many museums and organizations across the globe that have contributed to forging the exhibition and to all the artists and collectors in the world who have given us their time and their ideas over the years,” Markus Bacher, director of the Kunsthalle Bern and CEO of the Basel Biennale, said in a statement. “We are also delighted by the support of the Claes-Andersen-Bickel family, the Rockefeller Brothers-Koch, the de Kooning von Braun foundation, and the Joslin-Bickel family, all of whom have contributed generously to the Biennale. With their support we will be able to continue to present exhibitions and events of the greatest international quality and to educate the world about the art of our time. We will continue to work together to evolve and consolidate the exhibition programs of the Biennale, and we hope that you will join us in this process.”We will also continue to support artists and institutions who are working to create new works in partnership with the biennial as well as the", "The next Biennial should take place in Tokyo in 2020. \n\n\nThe Grace Foundation in London has awarded Jordan Ashenden-Craven the Andrew W. Mellon Foundation Award in the Arts. The annual award for young artists was established in 2017 by the Andrew W. Mellon Foundation in recognition of his long-standing commitment to supporting emerging and established artists. The foundation has long supported artists in its grant program, among them Ali Fatemi, Zanele Muholi, and Hoor Al Qasimi, and its program also includes the Andrew W. Mellon Fellowship for Art and Design, which offers $25,000 to five artists each year.Ashenden-Craven will receive $75,000 in support of his work, which will be exhibited at the Grace Art Gallery in London in 2020 and the Grace Foundation, which will receive $50,000 in support of the artworks themselves. The Grace Foundation is also planning to stage an exhibition of the artist’s work, entitled The Power of Place, for the first time in the United States.\n\n\nThe French foreign minister, Bruno Le Maire, has announced that the country is preparing to welcome refugees by the end of the year. According to AFP, France is hosting more", "The next Biennial should take place in 2020, and if all goes as planned, the 2019 exhibition will be re-examined in the 2021 event.In a statement, the Biennials’ director, Elizabeth Manning, said: “We are delighted to have had the opportunity to work with the Philips team on this project, and continue to have the opportunity to present this exhibition to a new audience. We are confident that the exhibition will continue to expand the knowledge and understanding of contemporary art, and we look forward to having the opportunity to present it in the 2021 Biennial.”\n\n\nThe Paris-based gallery Tangerine has announced that it is planning to open an outpost in New York in 2021. The eleven-thousand-square-foot space will feature new work by artists such as Damien Hirst, Gérard Invalhão, and Sayeeda Iqbal. The institution says it aims to present work, including paintings, sculptures, installations, performances, and photography, in a “flexible way, in a non-conventional way, in an open ethnographic way, with a social critique of contemporary art.”The gallery is also expanding its US footprint with an exhibition of work by", "The next Biennial should take place in the Summer of 2020, when the exhibition will be staged in conjunction with the Venice Biennale.The 2019 edition of the show was organized by the Art Space, with the support of the local authority. The show was curated by Kamiar Ehsan, who previously curated the Shanghai Biennial in 2016. The event will take place in the Art and Architecture Museums of the University of Tartu, the faculty assembly of the University of Tartu, and the Art Gallery of Ontario.Commenting on the forthcoming exhibition, the organizers said that the theme of the show was “a hybrid of the past and the present,” and that the exhibition “will be a journey through the spatial and instrumental complexity of the contemporary world.” “This is a brand new stage for the Art and Artifacts category,” said Kay Sze, the chair of the 2020 exhibition. The first half of the show is slated to open in October, 2020.\n\n\nThe Works of Birgitta Jonsdótt, the Norwegian artist known for her works depicting everyday objects such as flowers and trees, will soon receive a new exhibition at Norway’s Courtauld Institute of Art in London. Tit", "The next Biennial should take place in 2021. The last one, in 2019, was disrupted by the coronavirus. \n\n\nThe Museum of Modern Art (MoMA) in New York has launched an initiative that will help artists with limited income and families in need by providing grants of up to $10,000. The program, dubbed the Housing First Initiative, will award $1 million in grants each year. “The Housing First Initiative is a collaboration between MoMA, ArtCenter, the Artists’ Union, and the Center for the Arts, and is a vital step in addressing our housing crisis,” said Mona Hatoum, president of the Artists’ Union. “We are grateful to MoMA and the Center for the Arts for supporting our efforts to advance the work of talented artists who have been historically underrepresented in their museums. The housing first initiative will provide a lifeline to their artists and their families.”The ten year grant program was established in 2015 to help artists who are facing a loss of income due to Covid-19 and is available to any artist who lives within a five-mile radius of the Museum of Modern Art, as well as artists and small businesses facing financial hardship due to", "The next Biennial should be hosted at the city’s Museum of California, which recently completed a $765 million expansion, and is expected to open in 2023.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has announced that it will reopen on April 11 after a $160 million expansion. The museum is currently closed because of the Covid-19 pandemic, but will remain open during the pandemic’s duration.“After careful consideration, we are reopening with the same mission: to present the most exciting, compelling, and important art of our time,” said Megan Mullen, the museum’s director. “The expansion combines elements of the Museum of Contemporary Art, including the new Diller Scofidio + Renfro glass installation, and MoCA, which has remained open since it opened more than five years ago. Our team has worked tirelessly to bring the works of contemporary artists to life and the building, which has housed the museum since 1965, opens to new worlds.”The reopening will be accompanied by a variety of special exhibitions, including “Gorniger Fish: From the Gallery to the Stage” (2019), a new exhibition dedicated to the artist", "The next Biennial should begin this spring.\n\n\nThe University of Michigan Museum of Fine Arts (UM) has launched a new digital platform, the Biennial Archives, that will allow the public to search through the university’s holdings, including its holdings of the 19th century, the 20th, and the 21st centuries. The platform will be created by the museum’s Rachael Peiffer and Andrew Cunningham, who will curate the first exhibition, “The Age of Ethnicity,” which will open in March 2020. Peiffer and Cunningham will collaborate with scholars, collectors, and students to bring the exhibition to life through an immersive digital experience.“The new platform will provide an accessible, easily searchable collection of titles, collections, and exhibitions of historical interest, and will invite the public to engage with remarkable new works by artists whose work spans multiple epochs,” said Peiffer. “The Biennial Archives will give you a comprehensive view of the exhibition, including reviews, exclusives, and special offers. You will be able to bookmark the Biennial Archives to return to later and re-visit the Biennial Archives to see new works.”The platform will be entirely online and", "The next Biennial should take place in the spring of 2020.\n\n\nFeminist fantasy author Charlotte Posen, who was known as the 'Grandmother of Modernism’s’s' and wrote about all things feminine, died on December 21 at the age of ninety-one. Her passing was confirmed by her daughter, Zena Posen, on Tuesday. She was the author of more than one hundred books, including the feminist novels The Secret History of the Body and My Life as a Girl.Born in Berlin in 1923, Posen moved to Paris in the 1940s. After learning French at the University of Nancy in 1948, she enrolled in the École Polytechnique in Lyon. In 1949, she married artist Georges Apostuil, and the couple had six children, including Eva, the same year. The couple relocated to the United States, where Posen began writing about her experiences as a woman in a male-dominated field. Posen often used feminine traits in her fiction, including the role of the mother and the role of the wife.She is survived by her daughter Zena Posen, and her son Carl; her granddaughter and great-granddaughter; and her son Eric Posen.\n\n\nOn Friday", "The next Biennial should include a discussion of a “new kind of intimacy” between the exhibition and the public, a “new kind of art” that would use photographs and photographs only, and a “new kind of science” that would be “inventive and original, not rooted in dogma or tradition.”The biennial will also include two exhibitions of work by artists associated with the current exhibition, “In Defense of the Past,” which will run on the last day of the exhibition and “Unstaged,” which will feature artworks done by artists not associated with the exhibition. The first exhibition, titled “In Defense of the Past,” will run from February 22 to March 14, 2020 and will be organized by the same organizer, the same director, and the same artist-run collective as the biennial’s inaugural presentation, “In Defense of the Past.”The London-based artist-run collective Fotografiska, which was founded by John Holme in 1992, will situate its main exhibition “In Defense of the Past” in the Museum St. Petersburg, Russia, in 2020 and will launch a residency program", "The next Biennial should be held in March 2021, a spokesperson for the exhibition said. \n\n\nThe following artists have received the 2019 Asian Art Award:\n\nYi Wei-li (Taiwan)\n\nNan Li-an (Taiwan)\n\nYi Wei-li (Taiwan)\n\nNan Li-an (Taiwan)\n\nNan Li-an (Taiwan)\n\nNan Li-an (Taiwan)\n\n\nOn Sunday, the Museum of Fine Arts (MA) in Oakland, California, announced that it will open a new chapter of its popular exhibition series, “Wu Cheng-Yu,” in the spring of 2020. Inaugurating the space, which was previously called the center, will be a new exhibition of work by the artist-activists Ai Weiwei and Anish Kapoor. The series’ inaugural event, “Wu Cheng-Yu,” will feature works by twenty-six artists whose works were selected by a jury comprising artist-activist Ai Weiwei, artist-in-residence You Tu-Chang, artist-in-residence Xiaolin Zhang, and artist-in-residence Tung-", "The next Biennial should also consider how best to use the local community’s purchasing power and to respond to the needs of the local art-world. [Photography by Ryan Lee—'The Mask that Shakes the World: Photos from the Biennial’s Collection, 1966–1985,' Ryan Lee Gallery, New York, 2015]\n\n\nArtist-owned nonprofit the Collective Arts Collective (CAC) in New York City has received a $1.5 million donation from the estate of Donald and Edith Foster, the billionaire owners of the private real estate and media companies Tudor and DeLand, respectively. Both Edith and Donald died in New York City in 2014, but their heirs have long maintained that they will continue to support the arts through their charitable enterprises.“The gift will enable CAC to continue to operate as a resource for artists, pay our bills, and provide vital support for the creative process,” said CAC director Nan Goldin, a longtime art collector and the founder of the art-shelter InSite, a residence for artists in Brooklyn.The donation comes amid a sharp downturn in the art world’s stock market, with the Sotheby’s auction house reporting huge", "The next Biennial should be held in 2020 and will be hosted at the Museum of Contemporary Art in New York, with the event set to follow the Museum of Modern Art in Boston. \n\n\nThe Georgia Museum of Art in Athens has appointed Christie Glendinning as its next director. She succeeds Hugh Schubert, who retired in May after more than fifteen years at the helm of the museum.“We are honored to welcome the visionary into our dynamic and inspiring new headquarters, and to be able to work with her to build on the extraordinary work she has done to advance the institution and our mission,” said Alan Leventhal, the museum’s board president. “Her curriculum vitæ reflect her dedication and passion for the arts, and their evident connection with people’s lives, and with a clear and emphatic vision for the future of the museum.”Glendinning joined the institution as a senior curator in 1995. She became assistant curator of contemporary art in 1997 and became curator of modern art in 2001. In 2003, she was named curator of contemporary art. She also served as director of the Georgia Museum of Art’s Department of Contemporary Art. In 2009, she was nominated for a National Medal", "The next Biennial should be held in 2021, and the next in 2022. The biennial will focus on the history of the past and present, the future, and the past. The museum will also introduce new programs and exhibitions, including “The History of the World.”A statement from the Dusseldorf-based nonprofit, the Dusseldorf-Palazzo Artis Foundation (DPS), reads: “The Dusseldorf-Palazzo Artis Foundation will not have a new exhibition planned for the foreseeable future. It is simply not feasible to develop an exhibition program that will work on the extreme scale of the show, as we have been undertaking since 2003. Consequently, the core project of the current exhibition season will continue, and the next show will open in 2021.” \n\n\nThe Iris and Art Show, an annual event that is supported by the Iris and Art Foundation, has received a $300,000 donation from the private collection of artist and collector Livia Jimenez. The gift from Jimenez and her husband, José, comes at the end of the six-month installation-project, “Atelier: Mairon,” which opened in New York City", "The next Biennial should focus on the work of the artists that have influenced the history and art of the city of Miami, as well as the artists that are currently under consideration for the award, which is created by the Miami Art Museum in partnership with the Miami Children’s Museum and the Joe Saiz Foundation, and will be held at the Miami Dade College Museum of Art and the Art Museum Miami. The Biennial will be held in the city’s Public Garden from April 10 to April 12, 2020. The winner will be chosen by a jury consisting of artists, philanthropists, urban experts, and museum directors. One hundred percent of the prize funds will go to the museums, with the remaining 10 percent to the Miami Children’s Museum and the Dade County Museum of Art. The award, which honors works that substantially challenge or reshape the Miami Beach public image, will be awarded to the artist who demonstrates the most innovative, original, and compelling work. “The Miami Art Museum is in the process of reflecting on the past two-hundred and furloughing fourteen artists who have contributed to its collection over the last nineteen years,” said museum director Darlene Otero. “We", "The next Biennial should be announced as soon as possible.”With the opening of the exhibition “An Open Letter from a Young Feminist,” in 1960, the Feminist Front was born. In 1969, the Feminist Front was renamed the A.F.P. Collective, and in 1980, the A.F.P. Collective was split into two organizations: the A.F.P. and the A.F.W. Following the dissolution of the A.F.P. Collective, the artist-run nonprofit Feministing emerged as a platform for exploring feminist struggles in the arts. In the 1980s, the organization hosted Feminist Book Fairs, the seminal feminist book fairs of the 1980s.In 2018, the A.F.P. Collective and the A.F.W. merged under the umbrella of the A.F.P. Foundation, and the A.F.P. Foundation became the largest donor to the Feminist Front. The organization’s next annual event “The Other Feminist Book Fairs” will be held at the National Arts Centre in London from February 16 to February 20, 2020.\n\n\nNew York’s Metropolitan Museum of Art (MoMA), a decade-", "The next Biennial should be held in 2022. Since the model was developed by the Japanese and is inspired by the new Beijing Art Museum, it is hoped that the exhibition will be an addition to the city’s already comprehensive collection. \n\n\nThe Metropolitan Museum of Art (MoMA) in New York has added a new exhibition dedicated to the work of Ellsworth Kelly, a prolific American artist whose monumental work is widely considered to be a golden-era abstraction installation. The show, “Kelly: The Golden Age” will open at the institution on January 10, 2020 and run until March 23, 2020.“We were thrilled to host Kelly at MoMA,” said Tony Alford, director of the Metropolitan Museum of Art. “The show is a reflection of both a synoptic moment in Kelly’s career and an appreciation of Kelly’s tremendous ability to innovate and to redefine the medium of installation. We look forward to creating a more inclusive and engaging experience for the Kelly retrospective by presenting new and engaging works by Kelly’s peers and contemporaries.”Kelly’s work has been collected by twenty-three institutions and is on display in the exhibition “Kelly: The Golden Age”", "The next Biennial should be held in 2020.\n\n\nThe Metropolitan Museum of Art in New York has appointed John Krasner as its next director. Krasner comes to the Met from the New York dramaturg, the Metropolitan Opera House, where he has served as artistic director since 2016, and will assume his post on January 6, 2021.Krasner joins the institution from the New York stage, where he has served as artistic director since 1994. During his tenure, he directed the performances section, the invitation-only theater program, and the fiction section. He also worked as a consultant for the theater. He is survived by his wife, the actress Elizabeth Berkley; his son Christopher; and his daughter-in-law, the pianist and composer Zina Saro-Wiwa. The role of director was previously held by the late Robert Ressler, who served from 1999 to 2004. \n\n\nNatalie Wood, the new artistic director of the Whitney Museum of American Art in New York City, has announced that she plans to retire at the end of the 2020–21 season. The Whitney’s namesake, who began her career as an assistant to Alice Cooper and worked her way up to director of photography, has been a", "The next Biennial should begin as soon as possible, and will be held in December 2020. What is needed now is for the government to take action so that the various arts and cultural institutions in Turkey can have a strong and healthy future. We call on the Ministry of Culture and the Turkish government to prioritize protecting cultural sites and to accelerate the renovation of historical sites in order to ensure their long-term sustainability. \n\n\nThe Museum of Contemporary Art (MoCA) San Francisco has received a gift of sixty-six works by an anonymous donor\u0097whose digital wallet contains $330 million\u0097from an anonymous donor. The gift includes work by the late artist Anne Truitt, whose practice spans film, sculpture, painting, photography, video, and performance. The exhibition is titled “After the Alternate,” and will be on view until November 18. The museum was unable to identify the donor of the works because of a technical issue with its donor authentication system.According to Artnet, the museum was not able to determine the donor’s identity until early April, when it informed the donor that the collection was currently on display in the museum. A spokesperson from MoCA told Artnet that the museum is working to identify the donor, and that it", "The next Biennial should be held in 2021.\n\n\nTacita Dean and Adrienne Edwards have been appointed to the board of the Seattle Asian Art Museum (SAAM). They have been appointed by Seattle mayor Jenny Durkan and the Seattle City Council.They join the institution from the Solomon R. Guggenheim Foundation in New York, where they have served on the board of trustees since 2009.“We are thrilled to welcome them to Seattle and are looking forward to working with the board as we expand our collection and the ways in which we present and tell our stories,” said Mary Ceruti, director of the Seattle Asian Art Museum.“They are committed to exploring new ways for the museum to engage with the Asian Pacific American community and will be instrumental in developing our exhibition, public programming, and educational programs as we continue our work to present a vibrant and inclusive vision for the Asian Pacific American story,” she added.The naming of the two men comes as Seattleworks continues its push to gain recognition as an international cultural destination. In May, the city launched a $10,000 fund for cultural and visitor engagement. In June, the city commissioned two new works by artists, including Theo Eshetu and Elin Baram", "The next Biennial should take place in 2020, and the future of the museum is in the hands of the biennial organizers. We thank the organizers for their prompt and dedicated response to our request for a revised exhibition, and we wish them and the biennials a success in their quest to present the collection and exhibitions in a new and engaging manner.\n\n\nThe New York City Department of Cultural Affairs (DCLA) announced today that it is offering more than $4 million in grants and loans to arts and cultural organizations in the city in the hopes of helping them achieve financial stability during the coronavirus pandemic. The funds will go to small and mid-size NYC-based nonprofit organizations that are struggling because of the coronavirus—more than 230 organizations have applied for funding through the DCLA’s Community Grants program.The applications were received on December 22, and the deadline for applications is February 2, 2020. Organizations that have submitted applications since the pandemic began are scrambling to find funding. For some, the deadline is fast approaching. The deadline for most grants is March 29, and the applications received so far are telling: • Eight organizations have received more than $1 million through the program, and three have received more than $", "The next Biennial should have been held in 2020 but was pushed back because of the Covid-19 pandemic, giving the City of London Museum of London a year to prepare.It will now consider either a September, or October, or November date. “The jury that made the decision was made up of David Mober, director of Tate Britain; Helen Cammock, director of the National Galleries of Scotland; Mark Taylor, director of the National Galleries of Scotland; and I, ‘diana Moretti, director of the Museo Nacional de Arte Contemporáneo (New Mexico)’s vault.”\n\n\nThe Cleveland Museum of Art (CMA) has welcomed two new members: artist-in-residence Christina Shaughnessy and artist-in-residence Laura Coleman. Together, the artists will produce the first season of “Campus Reconstruction,” a semester-long residency program that will focus on dismantling the institutional memory of the CMA and reinterpreting its collection through interactive, immersive art. “On a personal level, this is an exciting time to welcome two new artists to the CMA,” said CMA director", "The next Biennial should kick off on September 6 at the Museum of Fine Arts (MoFA) in New York and will feature some seventy artists, including Ellsworth Kelly, Cézanne, and Pérez Correa. The exhibition will also include a new work by the late artist Leslie Finney. The exhibition is sponsored by the Allen Memorial Foundation.\n\n\nThe Cleveland Museum of Art (CMA) has appointed David Weitzman as its new senior director of contemporary art and design. He succeeds Jack Dwoskin, who retired in March 2019 after more than twenty-five years at the helm of the museum.“In the past year, David has been instrumental in preparing CMA for a renaissance, transforming our collection and setting for a new kind of museum,” said museum director Mary Pat Clark. “With his leadership, vision, and energy, he has built upon the contemporary art and design legacy of our visionary president, J. Paul Getty, whose generosity and vision shaped the CMA into being.”During his tenure, Weitzman has organized thirteen exhibitions featuring work by twenty-one artists, including Philip Nitsch, Christopher Wool, David Kurn, David Salle, Michael Stewart, Thomas Tull,", "The next Biennial should focus on developing innovative ways to support and celebrate art in post-Brexit Britain and the engendered public mood.”Tickets are still available for the 2019 event, which will be held at the Tate Britain in London, on September 12–September 13. The first edition of the Biennial was held in London in February 2019.\n\n\nThe São Paulo Art Biennial (SPAM) has announced that Maia Cattelan has been appointed as the fifteenth inaugural director of its new institution. Cattelan succeeds Julia Wüsthof, who was appointed the inaugural director of the prestigious museum in September 2019, and will assume her responsibilities on August 31. “Cattelan is a global leader in the visual arts and has led the SPAM since 2008, when it was still an independent, nonprofit organization, the initial director of the Centre for Modern Art in São Paulo, the inaugural director of the newly established Pradescolle, and the spartan director of the Museum of Modern Art in the heart of the city,” said Michela Aistrup, president of SPAM. “The biennial is about to launch and her leadership of the biennial", "The next Biennial should include the work of twenty-six artists, including Swiss artist Stephan Reinhardt, whose rotating ground has received international attention as a site for the 2020 exhibition, which will be held in the city of Basel from September 18 to September 20. In addition, a special feature on the evolution of the human body will be presented on September 22. Museum director Wolfgang Althausen said: “In the last few years, we have demonstrated anew the possibilities of the exhibition space. This year’s Biennial will be a watershed for our program and its future. We are confident and excited about the exhibition, its potential, and the artistic community that will be inspired by its work.”\n\n\nThe Metropolitan Museum of Art (MoMA) in New York is preparing to hold a major reopening of its iconic Kelly-Sweeney building in mid-August. The opening of MOMA, which has served as an important cultural landmark since it opened in 1950, will mark the museum’s seventy-fifth anniversary. The reopening will be preceded by a redesign and expansion of the existing building, which will include a new public plaza, a redesigned lobby, a refurbished interior, and", "The next Biennial should be held at a location which has already been selected as the site of a nearly twenty-year-long exhibition, including the contemporary art section of the New Museum, New York, and the Northwest Territories; and should be organized on a date to be announced. A selection of works, including works by Mark di Suvero, Kiki Smith, Howard Shore, and Max Beckmann, will be displayed along with the Delfina Foundation's new museum, which will include a major renovation of the building where the art is held. Not pictured are the sixteenth and seventeenth centuries from the collection of the Catalan architect Pedro Almodóvar, who first conceived of the exhibition.The full list of exhibitors is as follows:ArtsasiaNARTH Art GalleryArtsforsakademie BarentsArtsgard BarentsArtaArchivsArchiv NordiskaArt101ArtforumArtforum LondonArtforum Artforum GermanyArtforum BerlinArtforum New YorkArtforum TokyoArtforum United StatesArtforum WienArtgalleryBarna B.C.S.F.Artforum BostonArtforum AtlantaArtforum ChicagoArtforum Chicago’s Special Collections and Art MuseumArtforum BerlinArtforum New", "The next Biennial should be held in 2022, he said. \n\n\nThe National Museum of Fine Arts (NMA) in Washington, DC, announced today that it is planning to open an all-new museum dedicated to the American art of the 20th Century. The $5 million institution will be located in a former steel mill on the campus of the Smithsonian Institution and will feature exhibition-driven experiences that examine the history of art with a modern sensibility.The new museum will be named for Lynn Margolis, a curator and educator who was a member of the Sharltopp Gallery in New York and served as the NMA’s inaugural director of exhibitions. It will also include a collaborative program of visual art and design exhibitions and a digital platform that will allow visitors to experience the museum as they would have wanted it when it was still part of the Sharltopp family.“Margolis embodies the soul of Washington, DC: a person who is deeply committed to the arts and who motivates her art to move us,” said museum director and CEO Joseph Carlton. “We are grateful to the Sharltopp family for their longstanding support of the NMA and their generous support of this institution, which has ensured that Lynn", "The next Biennial should be held at the new museum in 2020–21.  The museum will also open a new exhibition dedicated to the artist-in-residence, currently on view through June 7, 2021, at its current location on the Broad.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines for the display of art in public spaces. The guidelines outline a three-tiered process for inspecting exhibitions, including gallery visits, private sales, and public performances. The department will begin issuing the guidelines in April.DCLA director Daniel H. Weissman said: “These guidelines will help ensure that art is evaluated and retained by the city’s cultural institutions and that the public feels safe and protected when engaging with exhibitions, private sales, performances, and installations.” The guidelines were developed by the DCLA in collaboration with the Mayor’s Office of Cultural Affairs, the Department of Transportation, the Department of Public Health, and the Department of Financial Services.One of the guidelines states that exhibitions “must be regularly visited by a broad audience,” while another states that “exhibitions must have a strong circulation in the city, and must draw an average of twenty thousand visitors a day", "The next Biennial should be a tribute to the tireless efforts of our artists, designers, and curators and should explore ways in which artistic practice can help shape the future of the city and the world.”The panel, which was chaired by Brooklyn-based biennialist Jean-Michel Basquiat, will decide the fate of the spaces in a month. The 2020 lineup includes work by forty artists and collectives; works by Ma Xiaojun, Drew Key, Jean-Luc Godin, and Stephen Friedman; and works by artists such as Josée Gamboa, Joan Miró, and Hélio Oiticica.The ten finalists were selected by an independent jury comprising Jean-François Barbier, chairman of the Museum of Modern Art in Paris; Raymond Donnet, president of the International Congress of Art, Paris; Stephanie Sharpe, director of the Parrish Art Institute in New York; and Jean-Jacques Spalletti, editor of the forthcoming book Art and the Body: From the Fallacy of Pain to the Power of Ideas.\n\n\nThe Museum of Contemporary Art (MoCA), the Louvre, and the Palais de Tokyo announced today the launch of", "The next Biennial should be held in 2021, when the sculpture, “The Body,” will be finished. Artforum has reached out to the Museum for comment.\n\n\nThe the Tunisian artist Salah Abdeslam, who was detained by French police outside of the Louvre on Sunday and was being interrogated by raiders from the military, is now facing several thousand protesters gathered outside the institution, which is in the capital of the West African state of Benin. The protesters are demanding his release, but the French government is refusing to guarantee his safety and has threatened to send troops to disperse the crowds.On Tuesday, Abdeslam was released from prison after serving only twelve months of his twelve-month sentence for terrorism, but the protests have only grown since then. On Wednesday, he was taken into custody in the capital city of Tunis and charged with “sedition” and “terrorist acts” in a number of countries. A day later, on Friday, Abdeslam was granted bail and was allowed to leave the country, but he would stay in custody until at least Saturday, when he was to appear in court for a hearing.On Monday, Abdeslam was arrested again in the capital city of", "The next Biennial should be held in 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed John Hoehn, the former director of the Peabody Essex Museum in Salem, Massachusetts, as its next president. He succeeds Lynn Bevan, who retired in March 2019 after seventeen years at the helm of the institution. In a statement sent to the media outlet Artnet, MoCA said that Hoehn brings a distinguished history with him to the institution. He succeeds Mary Ceruti, who was the director of the Rudy R. Rudy’s Art Museum in Manhattan from 1986 to 1994, and will begin his tenure in January 2021.“In my sixteen years at the helm of MoCA, I have witnessed the incredible growth of MoCA and the art world,” said Hoehn, who was appointed in December 2017. “Through a combination of vision and courage, I have successfully managed a museum that has expanded from a collection of more than five hundred works of art and its collection to a museum of contemporary art that comprises more than forty thousand works of art. I have also learned to love the art of the museum, and embrace its mission to present the world’s most exciting exhibitions, to", "The next Biennial should be held in 2020.\n\n\nThe Museum of Arts and Design (MAD) in New York is planning to open a new exhibition dedicated to women photographers in 2020. The exhibition will be titled “Is it OK to Disturb?” The show will feature more than two hundred photographs, representing both domestic and international travel, by forty-two artists. The artists are Naga Baruah, Julie Barozzi, Renata Canova, Tania Cosentino, and Esmond Rickover.The biennial is being organized by Mia & Paul Maass and will take place at MAD’s new space in Midtown Manhattan from February 22 to February 28. Its first section will focus on photography’s role in creating new cultural narratives around women and a second section will examine the work of sixty-seven artists. The full list of participating artists is as follows:Renata Castello, Milan, ItalyEsmond Rickover, Vienna, AustriaTania Cosentino, New York, New York, USAEsmond Rickover, New York, New York, USAEsmond Rickover, New York, New York, USAJuliette Barozzi, Rome, ItalyEsmond", "The next Biennial should take place in the spring of 2021. The program will be curated by artist Jadé Maier and will be led by director Eisa Jocson.\n\n\nThe Metropolitan Museum of Art (MoA) in New York has appointed Thomas J. Farley, who has served as director of the museum since 2016, as its next chair. Farley will be responsible for overseeing the museum’s expansion into an artist-centric space. He will assume his role in November 2020.“The new mission of the Met’s Art of the Party is to fulfill the conference’s vision of celebrating the life and work of the artists that are most important to our time,” Farley said in a statement. “I’m excited by how much art is central to the future of New York City, and how much I’m learning about what it means to be an independent museum.”The Met’s expansion into the artist-centric venue began with the construction of the new Martin Scorsese–designed building, which opened in 2017, and the 2016 reopening of MoA. The museum also added an additional gallery space, a rooftop terrace, and an open-air", "The next Biennial should be the . . . in September 2020.” The periodical will focus on the life and work of Prudence A. Delahanty, author of the novel The Body and the Wall (1954), a feminist account of a woman who is held captive by her husband and forced to conceive.\n\n\nThe São Paulo Bienal, Brazil’s larger annual art exhibition, which was canceled in March due to the coronavirus, has announced that it will resume in September. Titled “To the Bienal,” the exhibition, which examined the work of seventy-nine Brazilians, was originally scheduled to run from September 7 to September 11. The event was originally supposed to take place in the city of São Paulo, in central Brazil, from September 11 to September 13. The event was supposed to be a celebration of Brazil’s history and culture, but was pushed back a month due to the coronavirus, which affected Brazilians from October 2 to October 3.“The show was originally scheduled to start September 7, but our staff, artists, and visitors who were already scheduled to work, were unable to travel to Brazil in order to participate in the main", "The next Biennial should be in late March or early April. The theme of the 2019 edition will be “Future Present—” and will be “Anarcho-Industrialism, the Future Present,” with a focus on the history of the contemporary protest movements. The exhibition will feature more than one hundred contemporary works by contemporary artists working in the United States, Europe, and Japan. The 2019 edition of the Biennial featured work by more than ninety artists, including Kyril and Sam Mansur, Léa Seydoux, Josée Bénétière, Alexandre Breton, Nicolas Ghebaly, Marianne Jacob, Alexander Calder, Ali Baba, Juliette Breton, Eric-Paul Jaros, Lévy Gorvy, and Kiki Smith.\n\n\nThe London-based artistic collective Kiki Smith, a contemporary art group formed in Toronto in 2008 with piano player Alexei Sayn and singer Jil Sander, has been awarded a new $50,000 MacArthur Genius Grant, which will enable the group to create a new work by the award-winning Canadian artist, and will be presented at a ceremony", "The next Biennial should be held at a site near you, in the city where you live. After the exhibition, you can visit the museum to view the exhibition, which will be accompanied by a symposium and several other events.MUSEUM HOURS: Monday: 10 AM–6 PMTuesday: 10 AM–6 PMWednesday: 10 AM–6 PMThursday: 10 AM–6 PMFriday: 10 AM–6 PMSaturday: 10 AM–6 PMSunday: 11 AM–7 PMMUSIC: Artists’ Homes and Spaces: Wednesday: Closed until further notice.MUSIC VIDEOS: Friday: 10 PM–6 PMSaturday: 10 AM–6 PMSunday: Closed until further notice.NIGHT SCREEN: Wednesday: 10 PM–6 PMFriday: 10 PM–6 PMSaturday: 10 AM–6 PMSunday: 11 AM–7 PMMUSIC VIDEOS: Sunday: 10 PM–6 PMMUSIC VIDEOS: Saturday: 10 PM–6 PMMUSIC VIDEOS: Sunday: 10 PM–6 PMThis article was originally published by the New York Times. \n\n\nThe Chinese government issued a political edict on Friday that will severely curtail the rights", "The next Biennial should be in March 2020 and will be hosted at New York University, with a twenty-first-century twist: a traveling exhibition, in which the works will begin as traditional sculptures and then transition to an immersive experience, where they will be recreated in a modern reimagined world. The series will then return to New York and will begin a new, global tour in March 2021. For the past four years, the artist-run nonprofit ART's New York outpost has been producing original works in the city to coincide with the biennial.The artist-run biennial’s inaugural edition, “Tobias Niedzwiak’s God Is a Big Exclamation Point,” was staged at the artist’s studio in Brooklyn in March 2016. The artist-run exhibition, which took place in the late spring of 2020, was also curated by Kong Junghawei and received funding from MoMA and the Adler and Adler Klein Foundation. During the show, Niedzwiak demonstrated how art can be transformed by social, political, and economic conditions. “I’ve given myself a project,” he said. “I�", "The next Biennial should be held within the next two years.  The Biennial Board, chaired by Gernot Grotjahn, will formally adopt the plan during a meeting of the board in Berlin on March 15.\n\n\nThe Museums Association (MA), an umbrella organisation of more than four hundred UK museums, has voted to condemn the government’s decision to cut funding to the arts, which is estimated at £9.5 billion over the next three years. “We consider this a matter of life and death for museums and thousands of staff across the UK,” said Robin Dunbar, chair of the MA’s board of trustees, adding that the institutions will “take all possible action to protect jobs and protect the future of the arts at the heart of the country’s economy.”Dunbar also called for an immediate end to the plans, which were announced on May 8 and will see the arts sector shrink by 6 percent of GDP over the next three years, to “start a meaningful conversation about how we can keep these vital sectors of the economy thriving for future generations.” The cuts were made in a bid to reduce the UK’s deficit, which was estimated at £6", "The next Biennial should begin in late August and conclude in early October. Artists are invited to submit their works by September. The project, which will primarily be devoted to the work of British and American artists, will include a series of online exhibitions at the Museum. “The theme of the upcoming Biennial is not only the history of art in the twenty-first century, but also the history of art in the twenty-first century as a whole,” said Museum director Rebekah Brooks. “The work of British and American art in the twenty-first century is a crucial and rich story that will be told through the exhibition.”\n\n\nFrance and Germany have signed an agreement that will see the former French ambassador to Cairo, Stephane Duarte, and the former director of the Centre Pompidou in Paris, Cristina Salmastrelli, deported from the country. They were convicted last month of inciting racial hatred and sentenced to two years and nine months in prison.Following their arrests, the three were given two years and nine months in prison for violating the country’s public order laws, but were then given two years and two months suspended sentences, which were both overturned by the Fifth Chamber", "The next Biennial should begin in March and will consist of a group show, of works by the year’s most distinguished contemporary artists, and will include a virtual reality experience.“It is essential that we launch new and innovative initiatives designed to sustain and support the creative and artistic heritage of the cultural heritage of the city,” said Venice city council president Roberto Cicutto.\n\n\nThe Museum of Contemporary Art (MoCA), New York, has appointed John Palmiotti, currently the director of the Rhode Island School of Design, as its next executive director. In his new role, Palmiotti will work with executive director Loring Randolph, who has been with the institution for more than four decades, on developing programs and curating exhibitions in collaboration with the museum’s staff and the more than 2,500 artists who are represented by the institute.“This is an unprecedented and exciting time for MoCA. We are entering a new era as we work to re-create the museum’s vision, to reimagine our relationship with our community, and to reimagine what a museum should be,” said Randolph. “The past few years have provided many opportunities for creative collaboration and collaboration between our staff and artists", "The next Biennial should begin as soon as possible, and be held in both the large and the small auditoriums. The exhibition is scheduled to run for twelve months.”The exhibition will also include contributions by artists such as Ma Yansong and Amyli Li who will narrate stories from their personas to explore their relationship to the physical world, the various senses, and the shifting political, social, and cultural landscape of China.\n\n\nArt historian, curator, and writer Ai Weiwei is suing the German state over the inclusion of a work by an artist he discovered in a museum in Frankfurt, Germany, in 1954. The lawsuit, filed in Frankfurt district court on March 16, alleges that the exhibition, “Spiral Steps,” a modern composition by Jean-Louis Neuville, was “hurt and distorted” and seeks compensatory and punitive damages.Neuville created the work in 1954 for the Art Institute Heidelberg, where he eventually enrolled in the 1960s and eventually left the country. The museum in 1991 acquired the work and the lawsuit was settled in 1997, the year of the artist’s death. The plaintiff has since claimed that the state-backed acquisition violated his constitutional rights to", "The next Biennial should commence with a public exhibition of the work of the artist in the first week of April. The exhibition should include the artist’s personal materials and the first exhibition of the work of the artist in the city of Munich. The most recent exhibition of the work of the artist in the country’s capital should be held in the city of Munich in April 2020. The biennial will be six days long.“The museum is cooperating in a way that is very specific and specific in its content, in that it is not just a museum of the world, but a museum of the artist. We are not interested in a museum that only presents art, but also in a museum devoted to the artist, with an artist as its director,” Karlos Breitenbach, the director of the Karlsruhe Institute of Contemporary Art, told the Art Newspaper. In December 2018, the institute opened the exhibition “Hochzeit,” which has taught the artist to create figurative works that reflect his personal experiences. The work of Hildegarde, Dürer, and others influenced Dürer’s own vision of the German state and ultimately constituted his earliest published artworks. Each year", "The next Biennial should be held sometime in the spring of 2022, the organizers said.According to the New York Times, the event’s organizers are already facing backlash for excluding the artist from the 2020 edition of the exhibition. The exhibition’s artistic director, Daniel H. Weiss, told the New York Times that the decision to exclude Poole was made in part because “Poole has specifically called for galleries to divest from the fossil fuel industry.” The artist has also been working to raise awareness about the environment and fight for the environment in other ways, including by creating the Peebles Deep Project, a repository for hundreds of thousands of artifacts from the artist’s work. He is also working on a comprehensive work for the exhibition, titled “Poole: The Biennial.”\n\n\nThe Solomon R. Guggenheim Museum in New York has announced that its current exhibition “The Birds,” which opened on April 24, 2019 and runs through March 31, 2020, will move to the new 750,000-square-foot Museum of Modern Art (MoMA). The museum will be renamed the Solomon R. Guggenheim Museum in honor of the sixteenth-century", "The next Biennial should host a retrospective of the work of the late American artist Robert Irwin, an African American artist whose work explores the concept of time and continuity, as articulated in his work, The Time Machine, 1967. Artists represented in the 2019 Biennial include Anna Atkins, Jocelyn Raeb, Anish Kapoor, and Isamu Noguchi; the 2020 edition will be led by English artist Jenny Sturges. Held in New York from March 22 to March 29, the festival will return to New Orleans this fall. “The time to change is now,” said Ruth Margolis, chair of the board of trustees of the Association for the Visual Arts. “We are committed to working with the public and community to ensure the 2020 Biennial reflects the diversity of American artists and is as inclusive and international in spirit as the previous two decades.”\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines for the use of social media by city-licensed security guards. The guidelines outline the use of the platforms to monitor and screen individuals for weapons violations, to gather information about individuals’ movements, and to extract personal information from visitors. The document is part of a larger citywide", "The next Biennial should be held in 2021. \n Artforum’s biennial of contemporary art will return to New York in 2021. Titled “POWER UP,” the event will focus on issues of self-empowerment through art, technology, and social media, and will showcase the latest in contemporary art and technology. The twenty-sixth iteration of the event, which was canceled owing to Covid-19, will take place in 2022. “Artforum is thrilled to be returning to New York City in 2022,” said Ryan Browne, the organization’s director. “The biennial marks an important milestone in the organization’s seventy-six-year history and we are committed to continuing to showcase the best art of the contemporary era. The 2020 event showcased award-winning work by forty artists, and the 2021 event showcased the art of the year 2020.”In addition to the 2020 event, the organization’s first biennial exhibition devoted to contemporary art was staged in 1990. It was organized by the artist-run nonprofit Contemporary Art Archive and was co-sponsored by the artist-in-residence the eponymous collective, as well as the artist-in", "The next Biennial should include a selection of new work by artists who have never been on the panel. “The upcoming Biennial will be a time for artists to reflect on their practices and to take up the themes and the genres of their work,” said Armitage. \"It will also offer a forum for new and innovative work.”\n\n\nIn a move that seems designed to appease both the museum’s detractors and its supporters, the Ontario Museum of Fine Arts (OMA) in Toronto has eliminated two-thirds of its staff through layoffs and purges in an attempt to reduce expenses amid the coronavirus pandemic. According to the Toronto Star, the institution laid off 123 of the 166 employees, 46 percent of its staff, who work in the Ontario Institute for the Arts (OI). The cuts were made on Monday, January 6, and will take effect immediately. The restructuring plan calls for approximately 1,600 OMA jobs to be eliminated and about $7 million in losses.The layoffs followed a staff revolt after a board meeting on January 9, which declared that it “does not believe that immediate action is necessary to preserve the institution’s financial health or to avoid the consequences of such action", "The next Biennial should be called for the Arts and Media, for which the artist-in-residence will be selected by a panel of curators, editors, and think-tankers. The biennial will be organized as a platform to further engage with the United States through a combination of exhibitions, residencies, and other programming. The organizers have told Artforum that the first edition of the event, which will take place in late March, will examine “the intersections between culture and politics, the arts and the criminal justice system. ”The organizers also said that the initiative will be “comparative, not prescriptive,” and will ask participants to consider the ways that their cultural practices and practices in society might interact with the current political moment. They will be asked to respond to the current political climate by inviting their own voices to be heard. The second edition of the biennial, which will be held between November 24 and December 19, will be hosted by the Smithsonian American Art Museum in Washington, DC. “The first biennial was a call for individuals, organizations, and institutions to engage with the American political and cultural landscape as a whole,” George C. Williams, the museum�", "The next Biennial should focus on the ways in which Australian art has been impacted by the pandemic and will also highlight the role of art museums in developing new understanding of the pandemic and the ways in which they can be re-imagined as focal points for contemporary artistic activities. “The fact that we are here, in Australia, in the first place, is a powerful force for change,” said Artnet editor Susan Crossan. “That you can do that by going to a museum in Melbourne is a rallying point for people making artworks and people making artworks by artists.”The first exhibition of the newly created “Imperial Film Archive” will open at the Australian National Gallery on January 28, 2020. The exhibition will be followed by two biennials at the Sydney Opera House in 2024 and 2021, and a series of exhibitions at the Queensland Museum of Art in 2022.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has received a gift of fifty-one works by artist Matt Hull-Reeder. The donation, which also includes forty-one works by the Los Angeles–based collective Crisis, a group known for its conceptual explorations of the nature of creativity, was made by artist", "The next Biennial should be held in 16 years.<|endoftext|>Istanbul’s Art Treks has announced that it is planning to grant more than 3,000 visitors a free pass through the city’s Gezi Park this fall. The annual event, which was canceled last year after the city was rocked by a massive explosion, is reopening this September. ArtTreks’s executive director, Saynoh Said, told Artnet that the event will focus on showcasing the architecture of the city and highlighting the importance of the park’s “Art of Crowds” installation by Fotopaxon. The participatory art event is being organized by the Istanbul-based nonprofit the Turkish Cultural Centre as part of its campaign to raise $25 million to establish a new 5000-seat theater complex in the city. Said said that the pavilion will be a “blend of contemporary architecture and sculptures,” featuring new works by artists such as Han Ki, Nuri Bilgin, and Sariprasıyan; as well as a selection of works created in the park. “The design of the pavilion is a blend of previous works by artists and contemporary architecture,” Said. “The pav", "The next Biennial should be hosted at Nexter Metropolitan College in Water Mill, New York (NMCW) in September 2019. The museum has also been working on a new, expanded Archives, which will be inaugurated by a new exhibition of works by American artist Anita and actor Ron Glass, which will take up the texts of the biennial in 2020. The institution will also open a new location for the Fellows, a conference series, and a new interactive art experience in the spring of 2021. The new campus will accommodate more than 50,000 visitors annually, and will be designed by NMCW architect David H. Koch. NMCW’s Joseph RedDoran, who has served as director of the institution for twenty-five years, said: “We are thrilled to continue working with the Fellows and the larger community to make the Biennial a success in 2020. I have been inspired by the creative potential of the collection to become a very large museum in the coming decade, and now that we have the opportunity to present it in the United States, I am eager to see what the alumni think of the new multi-use campus.”\n\n\nThe Metropolitan Museum of Art", "The next Biennial should be held at the same venue. When the event was first announced, the director of the museum, Adam D. Weinberg, said: “It will be a collection of work on paper, of artists’ bodies, of art.” The show will run from March 18 to March 22 and will include works by fifty-eight artists and will present contemporary exhibitions. The biennial is not a showpiece for the new venue, which will be named after the Biennial Acts. The institution will be housed in a former coal-burning power plant in downtown Baltimore and will serve as a space for community programming. The Smithsonian’s Board of Trustees approved the architectural design of the site for the biennial in a 7-0 vote on March 22. The biennial’s organizing committee made the final design and construction decisions after the National Council on the Arts (NCA) and the National Foundation for the Arts (NFA) recommended the design.“The biennial will offer an opportunity for the public to experience the remarkable diversity of American art through an exhibition that is part of an ongoing conversation with artists and their work, a conversation that is facilitated by an artist’s studio,” said", "The next Biennial should take place at the Brooklyn Museum in New York next year, and the second of three in the spring of 2021. \n\n\nCUPERTINO, California—A group of artists and filmmakers who were protesting the California Academy of Motion Picture Arts (CAAM) over the treatment of workers at its film and video exhibitor in Los Angeles have won a major victory. The plaintiffs have filed a complaint that accuses the museum of failing to protect workers by failing to set up an emergency fund and by not providing them with severance and other benefits.The activists, who called themselves the Artists in Motion for Better Work, said that the museum failed to address the workplace deaths of Black workers by training workers in the industry on critical safety measures, including providing them with the tools to file complaints and for workers' compensation. They also argued that the museum has a policy of not allowing workers to have contact with the Black Lives Matter (BLM) movement, which was founded by the Black Workers Solidarity Campaign and the Black Workers Panther Party.The group’s lawsuit argues that the museum failed to secure workers’ financial and health benefits, failed to compensate workers who were laid off or who were part of class action lawsuits, and that the Black Museum failed", "The next Biennial should be held in 2020.”\n\n\nThe Uruguayan artist and theorist Humberto Urbina has been nominated for a Pulitzer Prize for Art for his monumental Convergence, an assemblage work of nearly twenty thousand finished photographs that is considered the first work by the artist. The work, which was picked by award jury in New York on February 6, 2019, reveals the visual chemistry of color that Urbina explores in his works.The work is a meditation on the duality of light and color, pairing photographs taken by Urbina with photographs of a rainbow, clouds, and fire. The result is a dramatic and often surrealistic work that combines the combined elements of photography, theory, and photography’s own history, a history of color, of light and color, and of the natural world.The works, which were created in his studio in the basement of a small urban community in the resort of Montevideo in the 1950s, are archived in the Museo de Arte Contemporáneo, in the city of Bogotá, Uruguay. Urbina was an early proponent of the field and was one of the first to be awarded a Pulitzer. In addition to the Pulitzer, he", "The next Biennial should be in March 2020. \n\n\nThe California Council of the Arts (CCA) is launching an initiative to keep arts professionals in California on payroll through the end of 2020. The plan, which will be implemented in phases, involves several different methods, including re-training and retraining, hiring administrative support staff, and convincing employers to share information about employees.“California’s workforce is facing a major loss of talent as the baby-boomers retire, and our economy continues to move online,” said CCA director Rich Sullivan. “The CCA is working with our members and community to ensure the best possible future for our arts and cultural workers.”The initiative, dubbed the State of California Paycheck Initiative, was piloted with the help of a coalition of arts and cultural organizations, including the Greater Los Angeles Arts and Artists Coalition (GLAAAC), the City of Los Angeles, and the Los Angeles County Museum of Art. The coalition also enlisted the help of the Los Angeles Police Department (LACMA), the Los Angeles County Museum of Art (LACMA), the Los Angeles County Museum of Art (LACMA), and the Metropolitan Museum of Art. Each organization was", "The next Biennial should be in November 2020, for an October 18 release date. The 2020 edition will introduce a new visualization of the artist-made works in the exhibition. The 2019 edition of the Biennial, entitled “And Now We Return,” was staged at the Smithsonian American Art Museum in Washington, DC, and featured thirteen works by J. M. Worthy, which were originally presented in the exhibition “Art and Politics of Fashion” (2019), as well as two new works by artists such as Benedict Travers, Visual Security, and Nancy Will, all of which will be presented at the museum in November 2020. The 2019 biennial was organized by the Smithsonian American Art Museum and the Worcester Polytechnic Institute (WPI), and received funding from multiple sources, including a $30,000 donation from Stanley Abbot, a WPI trustee; a $50,000 donation from Michael Dell, the CEO and chairman of Intel; and a $50,000 donation from Brent Siskind, a former director of the Smithsonian American Art Museum, and a cochair of the WPI board of trustees. The 2019 biennial is one of twenty", "The next Biennial should be staged in the autumn of 2021, and the fourth in the spring of 2022. The Art Newspaper reports that the decision to postpone the exhibition was made by the art historian Judith Schlesinger, who is also chair of the congress. The fourth iteration of the exhibition is slated to open on December 19, 2020. Schlesinger added that she does not want to harm the long-term prospects of the exhibition by pushing the exhibition through in December.\n\n\nThe National Gallery of Art in Washington, DC, has received a gift of sixty-eight works from former owner H. L. Menelik, who passed away in New York on February 17. Auctioneer Charles S. and Mary E. Talbot of the firm Talbot Menelik, Jr., purchased the works from the estate in 2001 and plundered them from Menelik’s home in a 1970 investigation into a suspected $60 million fake inheritance.“The two-hundred paintings, mostly from the late 1950s through early 1970s, were acquired by the auction house from an estate in Northwest Washington, DC, that had been the principal owner of the family since 1981,” said Talbot. “The National Gallery", "The next Biennial should be held at the Museum of Contemporary Art, Houston, in 2021. \n\n\nThe San Francisco Museum of Art (SFMoMA) is planning to reopen as early as 2020 under a new five-year contract with the California-based company that manages the institution. The extension extends the museum’s current run of thirty days to two weeks, introducing a new section of the museum’s main building, the Contemporary Art Museum, which was converted into an artist’s residence in 2013.The extension was included in a $2.3 billion renovation plan that also included the renovation of the museum’s west wing, which has since seen a $1 million facelift. The plan, which was endorsed by the San Francisco Board of Supervisors last March, calls for the museum to reopen in December 2020.According to the museum, the extension will help the museum keep the doors open during the coronavirus pandemic and remains a priority for the institution because it’s the only facility within the city that has had a direct connection with the air in the Bay Area for twenty years. The extension will also accommodate the museum’s planned expansion, which will add a second building and bring the total number of", "The next Biennial should take place in the spring of 2020, and the first in the fall of 2020.\n\nOn the first day of the new exhibition, “The Artist’s Body: From Serpent to Sphere” (2019), the curatorial team presented two exhibitions: “Excellence in Painting”\u0097a retrospective of work by American artists which was organized by the New York–based NGO the Whitney Museum of American Art and the Baltimore-based institution the Charles Estep Gallery\u0097and “The Artist’s Work, 1965–1975: An Exhibition organized by the Chicago-based artist and curator Virginia Parrish. He opened the inaugural exhibition in 2015.In the second exhibition, the first panelist, Jonathan Gold, the director of the Los Angeles County Museum of Art, presented “Alice Bailey: A Retrospective.” In this exhibition, Bailey presents her first collaborative project with the museum and selected seventy-two artists for her exhibition “Alice Bailey, The Artist’s Body” (2017–18), which debuted at the museum. Among the artists chosen for the exhibition are Jonathan Davis, Anton Kern, Joachim Lamm, Joël and Martin Koons, Marciano Mont", "The next Biennial should be a celebration of the life and work of Ayrton Bentley, a pioneer photographer and one of the first to focus on the interdependence of the physical and the spiritual worlds.”The future of the annual exhibition will be decided by a vote of the Board of Directors of the Arts Council, whose other advisory body is the Independent Advisory Group on International Photography. The group consists of representatives from thirty-eight countries and is chaired by Peter Bogdan, president of the Czech Republic; Jean-Luc Barra, director of the Épés Museum in Paris; and the British artist Simon Peacock.\n\n\nFrederick Maspero, the former director of the Italian Institute in Paris, who oversaw a series of exhibitions devoted to modernism and the arts in the city between 2007 and 2012, has died at the age of seventy-seven. After directing the institute from its ground-floor glass-walled twentieth-century building and hosting dozens of exhibitions over the course of his career, Maspero was forced to transfer the institutions to the ground-floor of the city’s Olympia theater complex in 2012; the move marked the beginning of a nearly decade-long renovation campaign. The renovation project, dubbed “Fred", "The next Biennial should take place in 2021.  The exhibition will celebrate the work of twenty-seven artists, including Alexander Calder, Hans Hofmann, Günther Förgmann, Eleanor Courson, Cindy Sherman, Alessandro Turini, Andrea Turquoise, Catherine Terpstra, Andrea Zingaretti, Andrea Bocconi, Andrea Bonatti, and Anthony Henke. The show will also include the first-ever documentary film, Reeling, a documentary made in association with the artist, and a live performance.The first show of the new exhibition will be held at the Museum of Contemporary Art (MoCA), Boston, on October 4. The biennial will run through January 2022. \n\n\nThe Metropolitan Museum of Art in New York has announced that it will begin welcoming visitors back to the institution this spring. The announcement follows a report published by the nonprofit research organization the Museum Research Alliance (MRAA) that found that seventy-eight percent of Met fans are dissatisfied with their experiences during their visits to the museum.The findings, which were based on an online survey of 1,000 Met fans,", "The next Biennial should take place in 2021, and the first in 2022.\n\n\nBillionaire George Soros, the founder of the controversial Open Society Foundations, is giving $1.25 billion to the museums of the former Yugoslavia in an effort to help them adapt and survive the impact of the coronavirus and the economic fallout from the pandemic.According to the New York Times, the billionaire invested nearly $1 billion into the institutions through his private foundations in the last five years, and he pledged $500 million for the six-year cycle, but only $500 million of that sum was actually used. According to Bloomberg, the remaining $100 million will be used to help the institutions start the reopening of their former sites.The philanthropists said that the money would be used to create an emergency fund of $100 million, which will be matched by the Mali Investment Fund, which will distribute the rest of the funds through its own wealth management firm; to expand its philanthropic work in the region, which is home to some twenty million people; and to create new scholarships for teachers, students, and students of secondary school.\n\n\nThe Museums Association (MA), a United Kingdom–based advocacy organization, has launched a campaign to", "The next Biennial should be held in 2022.The two-week event, titled “Aeon” will be held at the Noguchi Museum in New York from April 14 to April 20, 2022. The event will also include a presentation of a new exhibition, “The Rise and Fall of the Third Reich and Three New Dimensions” (2019), curated by Hans-Ulrich Obrist, co-curated by Florian-Otto Fiedler, and a special presentation of Garden of the Contemporary Art, curated by Matthias Müller. The first edition of the event will be held at the Museum of Modern Art in New York from April 7 to April 10, 2022.\n\n\nThe Liverpool Biennial has announced that it is reopening on May 22, 2019 with a new show that will address the legacy and contemporary political situation in the city, as well as the role of the Liverpool Docks in supporting the arts and culture of the area. The exhibition, entitled “The Liverpool: Politics in Art and Politics in Art” and curated by Domenico Cahnuti, will be staged at the Docklands Cultural Centre in Liverpool, the Liverpool Stock Exchange (LSE), the Liverpool Art Gallery (", "The next Biennial should be held in the Fall of 2019. A description of the biennial will be posted on the museum’s website.\n\n\nThe British artist, curator, and educator Madeline Adès has died at age seventy-four of ovarian cancer. Born in London in 1930, Adès studied in Paris and at the Museum of Modern Art (MoMA) in the late 1940s, before moving to New York, where her first solo exhibition, “Lapis Lazuli” (1992), toured the country. She also cofounded the Society for Art and Design (SAM), which became known for its exhibitions of work by artists including Louis Vuitton and Pablo Picasso, and spent time in prison for shoplifting.In 1979, Adès was awarded the Turner Prize, which is given annually by the Royal Academy of Arts. In 1981, she was awarded a CBE for Lifetime Achievement by Queen Elizabeth II. In 2015, the CBE was renamed the Order of the British Empire. The CBE is an honorary member of the Royal Academy of Arts and has been on display at the Tate, London, and the National Portrait Gallery. In 2017, the CBE was included in the exhibition “The", "The next Biennial should take place in May 2020 and will be hosted at the Haus der Kunst, in Krefeld, Germany, in partnership with the Haus der Kunst-Bodegahaus. The exhibition will highlight the work of thirty-three artists and will be led by Wolfgang Imhof, director of the Karlsruhe Institute for Contemporary Art in Berlin. The exhibits will also include works by artists such as Wolfgang Streeck, Agnes Martin, Amalia Pica, and Paul Gauguin. \n\n\nThe Carnegie Museum of Art in Pittsburgh has received a gift of fifty-six works by French modernist Renaud Lavaux from the late American collector Steven Levitt. The works, which include several newly discovered works by the French painter Pierre-Auguste Renoir, were donated to the museum by his son, Steven Levitt III, who passed away in August 2019. The gift includes the first works by the late American master in the museum’s collection. The works were acquired through a series of transactions between Steven Levitt and his son through Steven’s namesake firm. Steven was a major collector of works in the 1980s and early 1990s. During the course of the transaction, Steven received a number of", "The next Biennial should be held in the autumn of 2021, in order to accommodate the long-term plans of the museum�which’s announced it will open a new headquarters in the city of Hamburg in the spring of 2022. The museum has already had two visits to the city from the 1970s to the 1990s\u0097and has plans to open an extension in the city as early as 2020.\n\n\nThe eight artists who won the 2018 Cooper-Hewitt, Carnegie Mellon, and the NYCBI Art Biennial have announced that they are severing ties with the Cooper-Hewitt, Carnegie Mellon, and the NYCBI. As previously reported, the artists, who are all members of the group Psi Phi, occupied themselves in a number of provocative, visionary, and disturbing works\u0097particularly “Ce n'est pas une femme,” 1988, a monumental assemblage-like collage that explores the relationship between men and women, and “Jericho Jordan: The Work Is Never Done,” 1999, a digital work comprised of a series of photographs that transforms the viewer into a cyborg.In a letter sent to the artists on Sunday, October 25, the Cooper-Hewitt", "The next Biennial should be held in 2021 and will be held at the Museo de Arte Contemporáneo in Madrid. \n\n\nThe National Endowment for the Arts (NEA) announced today that it is eliminating more than $2 million from its funding of midcareer artists in the United States, citing an inability to find new ways to support these artists in a time when more than 80 percent of arts programs are being canceled or severely curtailed. The agency has been slashing funding since May 2019, when the deadline for artists to apply for their first grant, known as a phalanx grant, was extended again. The agency also cited the ongoing economic uncertainty caused by the coronavirus as well as the growing number of artists whose works are currently on display at major arts institutions, including the Museum of Modern Art and the Metropolitan Museum of Art, which recently announced that the work of one hundred artists will be included in its next iteration of the Metropolitan Museum of Art Across America (MMCA), which will run in 2022.“NEA is working hard to help artists and their families through this challenging time,” said NEA director Elizabeth Glynn. “The phalanx grant program, which supports mid", "The next Biennial should also have a theme that connects with the festival, but perhaps more importantly, it should be about our place in the history of art. When the project was first conceived, the question of how the festival would be organized was a distant concept. Now that it is here, it should be a central question; about the future of art and about the meaning of life. We can do more than just celebrate art and the arts. We can help to shape them and shape the future.” \n\n\nThe Swiss museum Paul C. Antony, which is located in the capital Bern, has appointed Asger Breuger as its new director. Breuger comes to the institution from the Museum Ludwig, which he was named director of in October 2017. He succeeds Caroline Perot and Bernardo Ciro, who were both appointed as honorary directors in August 2018.“We are delighted to appoint Asger as director of the Visscher archive,” said Valentin Maassen, chairman of the board of trustees of the museum. “His vision and energy are fascinating, his willingness to listen, his ability to understand different points of view and a deep commitment to the collection and exhibition programme make him a very strong candidate", "The next Biennial should be held at the Michigan Institute of Art, the University of Michigan, the University of Pennsylvania, and the University of California, Los Angeles. The entire event can be watched online at  Facebook.com/events/17425126901565. While it is far from certain when the next edition of the Art in the City series will be held, the organizers say that it will be soon. Follow Artnet News on Facebook and Twitter and sign up for our weekly newsletter. Artnet WorldNews is a new publication created by Artnet News editor-in-chief Ampa Nordstrom and Artnet Contributor Jeremy Deller. It was launched with a $250,000 grant from the Art Fund. The grant will also support Artnet’s coverage of the Saudi Arabian Arabian royal family.  The first edition of the series, which was organized as part of the Art Institute of Chicago’s (AIC) acquisition program, was held in February 2019. The second edition, which was organized as part of the AIC Museum’s renovation program, was scheduled for March 2020. The third and final edition, which was organized", "The next Biennial should be promptly conducted after the conclusion of the current event, and should be organized on the same basis as the two previous ones.It is imperative that the organizers of the upcoming event, as well as the internationally recognized institutions responsible for hosting the biennial, take appropriate and coordinated action to ensure the safety and well-being of the artists and participants of the twenty-third edition of the Biennial.\n\n\nThe state of New York has announced that it will award $6.2 million in grants and loans to fifty-seven arts and cultural organizations and foundations in accordance with a $50 billion stimulus package that was passed by the New York City Council on Wednesday. The package will allow the city to continue to pay off its $6.2 billion budget deficit through 2027 and provides $500 million for the expansion of the public arts and cultural sector. The city will distribute $3.2 billion of the funds—more than half of the $6.2 billion in aid—in the form of direct grants, which can be used for a wide range of purposes, including providing relief to small to mid-size local arts and cultural institutions, and $1 billion in loans. The remaining $1.2 billion will be", "The next Biennial should take place at the same location, in the same year, and in the same venue as the one that was the focal point for the first Biennial. It should also aim to present a new collection of new works by the artists represented in the exhibition. The program will be curated by Gillian Collins, who will also serve as director of the Biennial. Collins will co-present the inaugural exhibition “My Body, My Rules and My Careers.” The show will include the work of eighty artists from forty countries, including India, China, Japan, Korea, Mexico, and Turkey, and will be staged in conjunction with the upcoming biennial in Hong Kong.“I’m thrilled that the upcoming Biennale is being hosted by the City of London and the biennial in London is one of the great cultural and creative celebrations in the world,” said Leslie Phillips, director of the London-based biennial. “It will mean new opportunities for the artists who have accepted our invitation to participate in an exhibition that will be a great opportunity to make new and original collaborations.”\n\n\nThe German Federal Chancellery has established a task force to revitalize the state’s cultural heritage sites", "The next Biennial should take place in 2021, the same year the venue will host the third edition of the Thailand Art Biennial, curated by the Bangkok-based artist Nacho Masekul. The event will be hosted by the Sergis Museum of Art and will begin with a solo exhibition of work by the Thai artist Nongkathorn Krathipat.The event will highlight the writings and cultural production of the twenty-three Thai artists presented in the exhibition, which will have a retrospective of the work of Joe and Nanthaporn Ratchakul in 2018 and a selection of works by the late Thai avant-garde artist A.M. Primati, who lived and worked in Bangkok, in 2020.The first edition of the Bangkok Art Biennial was held in 2009 and featured works by seventy artists. In 2010, the exhibition was moved to a new venue, the Institute of Contemporary Arts, Bangkok (ICA), and the works were presented in a different format for the second edition, which was held in 2014 and featured works by eighty-nine artists. The fourth and final edition, held in 2020, was held at the Basilica of the National Museum of Thailand.\n\n\nThe Solomon R. Guggenheim", "The next Biennial should focus on urban design in the West and will take place at some future date. “The idea of creating a biennial for architects is new,” said Nicole Grafton, chair of the exhibition and chair of the 2019 edition. “I think that the best way to think about what a biennial is is as a gathering of ancestors through doors and through conversations. And we are planning to do that next year.”The 2019 edition of the exhibition was held at the Museum of Modern Art. The exhibition featured the work of twenty-four artists, including Alison Lui-Rae, Krzysztof Wozniacka, László Nema, and Joana Pape.\n\n\nThe Mezzei Gallery in Tokyo is planning to move from its current location on Ueno-to-Beijing Highway in Beijing to a new location on the outskirts of the capital. The relocation was made possible because of the efforts of a group of local residents who launched an online petition in September that garnered support from more than 1,500 people. The petition asked the Mezzei to maintain a presence in the area and to divest from Groupe FIM, which", "The next Biennial should be held in 2019. Till date, the exhibition has exhibited more than 1,500 works, including work by Hiromi Kameoka, 2014, a film by the Japanese artist Tatsuya Nakada, and the first installation of the contemporary artist Rintoul, 2015, a live installation performed by the international group  of artists Richard Diebenkorn, Chris Isaak, John and Michelle Kray, and Eric Krasno, among others.A retrospective of the work of Kamedu Kawamura, a curator at the Museum of Modern Art in New York, will also be staged in 2020.\n\n\nThe Los Angeles County Museum of Art (LACMA) has received a gift of twenty-two paintings from the Italian artist Angelo Gramsci. The works were carved, painted, stained, and signed by the Italian architect to the Italian state in honor of his late wife, Francesca. Born in Rome in 1938, Gramsci studied architecture at the Italian State University of Piedmont before graduating from the University of Bologna in 1962 and moving to LACMA. Gramsci was the first Italian architect to win the prestigious Prix d'Art Contemporain (representing France", "The next Biennial should take place in the summer of 2021. The decision to stay on course for the 2022 edition was made after the organizers, who are based in the Swiss Alps, received a request from the Italian government on April 5 to postpone the event. After a thorough analysis, the government concluded that the event would be canceled as planned.The decision came three days after the Italian artist Francesco Lotti tweeted a statement, translated by the artist, condemning the cancellation. The statement read: “First of all, the decision to stop the exhibition is a serious action. This is not a decision that can be given lightly or easily, but one that must be taken by the government. It is a serious challenge to the exhibition as a whole. This is an impossible and unprecedented task, and it is made possible only because of the tireless efforts of the organizers.”The exhibition has faced numerous setbacks in recent years. It was forced to move two competitions, Art Basel Hong Kong and Art Dubai, after organizers discovered that they were simultaneously taking place. It also announced plans to cancel the show in Beijing in 2017 and to move it to the Türkeh, a former Bergen Bickel factory in the city of Bergen, in", "The next Biennial should take place in 2021.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, has appointed Amy S. Simon as its next executive director. She succeeds David K. Gallar, who has helmed the institution for nearly two decades.Gallar is retiring in March. During her tenure, she oversaw the overhaul of the institution from a subsidiary of the Los Angeles County Museum of Art (LACMA) in 2007 to an independent, nonprofit organization. Titled “New Order” (after the phrase New World Order ), the exhibition explored the notion of a post-New York City, a new cosmology centered around “Ogdru Hem,” a mythical city located in the Pacific northwest that was the setting for the fictional novel The Aviator.“I’ve been a lifelong MoCA supporter and admirer of its work for more than twenty years now,” said Simon. “I’m thrilled to learn that it’s been in the works of a visionary curator for more than ten years and committed to its future for more than twenty years now. I’m grateful to the board of directors, staff, and I for having served as interim", "The next Biennial should take place in the spring of 2022.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it is planning a major renovation of its building’s interior, including the galleries, the lobby, and the theater, which was completed in 1971, and is currently undergoing a $2 million facelift. The renovation is part of the larger $38 million overhaul of the museum that was completed in 2017.“The Museum of Contemporary Art has been redesign since 1971, when the original building was purchased by the city, and today we are creating a new chapter of our rich history,” said David Albrecht, director of the museum. “This is the fourth major renovation project for the building, which has undergone more than a decade of research by MoCA staff and independent consultants. To bring the recently renovated building to life as envisioned by the original team, we have begun the process of designing the new entrance, which will open to the museum in 2020, with the goal of completing the renovations by 2022.”The new entrance will be inspired by the name of the institution, which is located on city property, in honor of the original five-story structure, which is now being restored and", "The next Biennial should be held next summer.\n\n\nThe French government has released a long-awaited budget for 2020 that includes a $1.2 trillion stimulus package for France’s cultural sector, which has been devastated by the coronavirus. The bill was passed by France’s National Assembly on Tuesday and is awaiting President Emmanuel Macron’s signature. The legislation will be introduced in the spring of the following year and will consist of a number of measures, including a tax on financial transactions, the suspension of construction projects, and the construction of a $250 billion cultural zone.The legislation will also address France’s severe unemployment crisis; establish a new national fund for cultural institutions; and introduce a series of measures to promote French language and culture in France. According to the New York Times, the government hopes to break the country’s current record of 86 percent unemployment, and is estimating that the total boost from the tax and the zones will be worth around $120 billion.Dubbed the Greater French Union, the $1.2 trillion stimulus package will be divided into three parts: ●A tax on financial transactions and the construction of cultural sites●A tax on investment income and capital gains●A tax", "The next Biennial should take place in 2021. In the meantime, the South African Museum of Fine Arts (SAMCA), which has a permanent collection of some 2,500 works of art, is reopening to the public, the first day in February.\n\n\nArt historian and curator Janine Newman-Henderson, who famously gave hundreds of exhibitions at the Whitney Museum of American Art in New York in her lifetime, has died at age eighty-eight at her home in Santa Clarita, California. Known for her self-taught, painterly, immersive exhibitions, which often included subjects that were abstract or fantastical throughout their narratives—Hermes Arbour, Luis de Cervantes, and Robert Rauschenberg among them—Newman-Henderson was also prolific in her writing, which she described as a “monumental form of erotics.”Born in New York City in 1941, Newman-Henderson was raised in the Bronx, where her father taught at the Bronx Institute of Technology. Her mother was a teacher at a public school in Queens; her two younger sisters were teachers at the School of Visual Arts. After graduating from the college, she moved to Los Angeles, where she enrolled in the", "The next Biennial should be held in May 2022, according to the organizers. “In the absence of a major exhibition, we are working towards developing a new model, with a new format, and a new program, in the hope that this initiative will be a catalyst for further discussions on the subject of the importance of the individual to the cultural life of a city and, for that matter, the city to the city,” reads a statement by the organizers. \n\n\nThe X-Art Foundation, which was founded by former X-Art curators and has recently received funding from the Gordon and Betty Moore Foundation, has received a $1.5 million grant from the Klink family, which owns the Swiss firm Klink, to develop a new digital platform that will allow artists to share materials and resources. The grant will be used to support X-Art’s initiative to become an online resource for artists, and will allow the Foundation to develop tools that will allow artists to create custom exhibitions and other online experiences.“Gordon and Betty Moore donated $1.5 million to the X-Art Foundation in support of artist collaborations in 2019, and it is a tribute to them that we are able to take advantage of this generous gift", "The next Biennial should be held at an appropriate location outside of the city of Seattle, and should include both new works and works that have been previously selected for exhibition at the museum. “The future of the space is at risk,” said John Watkins, chair of the board of trustees of the Mid-Atlantic Cultural Center, of the impending exhibition event. “We do not want to see this happen at the Ballard Art Museum, and we will not allow it to happen.”A statement issued by the Ballard Art Museum on September 12th read: “The future of the Ballard Art Museum is at risk. We have taken all necessary action to protect the museum and its future programming. We have engaged with the city of Ballard to understand the potential benefits to the community from an expanded outdoor experience. We have also consulted with Ballard residents, community members, and others in the city to understand the complex set of issues that need to be addressed before we move forward with the project.”According to the Seattle Times, the Ballard Art Museum board chair, Mark Chew, said that the institution is currently discussing the possibility of moving the exhibition space and will take a final vote at a meeting in December. The institution will be closed until at least", "The next Biennial should be held in the spring of 2020.\n\n\nThe Museum of Modern Art (MoMA) in New York has announced the opening of an initiative to help artists who have experienced homelessness due to the Covid-19 pandemic. The program, titled Artist Resiliations, will provide grants to artists living in New York City who have had a major life-changing event during the first three months of the pandemic—such as a death, a move, or a business interruption—and will award up to $250 to artists.Established in 2017, Artist Resiliations was created to prevent the loss of arts and cultural assets and to build the artistic and financial resilience of artists living with HIV/AIDS. The program aims to create a \"collective memory\" of an artist’s life supporting their creative endeavors and to provide an avenue for artist-based initiatives. “For many artists, the program is the only source of income, and it will be particularly meaningful for those who have no other source of income,” said Matthew Lerner, director and CEO of the Metropolitan Museum of Art. “We are grateful for the work of our artists and artists’ families who have participated in this year’", "The next Biennial should include a discussion of the role of the artist in the larger cultural milieu and should also consider the possibility of the artist becoming a part of the future plans for the museum. The exhibition should be organized in a way that respects the artist’s privacy and will not interfere with the museum’s work to keep the institution in order.\n\n\nThe Institute of Contemporary Art (ICA) in Paris (ICA) announced today that it will honor the 200th anniversary of the founding of the French State painter Jean-Luc Leclerc, a man who used his paintings to promote photography and the use of photography in art.“The artist who has been described as the father of the New Modernism movement, and who did so by confining himself to pure abstraction, was a man of the 20s, whose work also includes his own personal life,” said museum director Charles-Marie Perrault. Leclerc’s son Jean-Pierre, who will be recognized by the state of northern France, will present a retrospective of the artist’s studio in the capital city of France, Paris, in 2020. Leclerc’s studio was located on the sixth floor of the Museum of Modern Art (", "The next Biennial should be in 2022. \nBiennial Director Alex Jovanovic said: “We are very excited by the support of our local arts and cultural institutions in the City, which is a must in the right climate for New York to thrive. We are confident that our programme will demonstrate the contemporary relevance of these venues, helping to elevate their profile and develop new work. We look forward to the 2019-20 season.”\n\n\nThe Museum of Fine Arts (MA) in Boston has appointed Michelle Roy as its next director. Roy comes to the institution from the Doris Duke Museum in Durham, North Carolina, where she served as director of education and public programs in the past four years. She succeeds Patricia McIver, who was hired as director of education and public programs in April 2019, and will take up the post on February 6.“In her role at the Duke, she set the museum’s educational and public programming standards and became a mentor to many young curators,” said Duke director Nicholas Cullins. “We look forward to her continuing to drive and improve the museum’s relationship with the local community through her leadership.”Roy succeeds Patricia McIver, who departed", "The next Biennial should be held at least once every other year, and should be organized in such a way that each biennial, with a minimum of five artists, would comprise two hundred or so individual works, each with its own title and subtitle. The total production cost of the exhibition should not exceed $10 million.The Biennial of French Painting will be held in the City of Lyon from March 21 to March 26, 2021, and will be dedicated to the history of the painting, a monumental art, and will be developed by a committee comprising Jean-François Delorme, director of the Museum de la BBVA, and Olivier Brin, president of the Group of Five. The show will also feature a special exhibition of abstract paintings from the collection of the Père Lachaise Trust in London.The proposal for the next Biennial of Minimalism was submitted by the National Gallery of Art in Washington, DC, to the Commission for Contemporary Art in New York City in June 2018. The theme is “Minimalism and the American Art Presumption,” and the five shortlisted artists are Benjamin Britten, Antoine Lévy, Henry Miller, and Wolfgang Pfeiffer. The next edition of the exhibition will", "The next Biennial should be held in 2021.\n\n\nThe British artist and curator Richard Linklater has been named the winner of this year’s Turner Prize. His installation, The Color Purple, which was staged at London’s Serpentine Galleries in 2004 and 2008, was chosen by a jury comprising Eleanor Catton, the British director of the Haus der Kunst; Andreas Meijer, the curator of contemporary art at the Tate; and João Pereira, the director of the biennial. A special award ceremony will take place at the Serpentine in London on December 18.The jury was made up of Michael G. Williams, the director of the Turner Contemporary Art Museum in London; Will Bright, the director of Tate Britain; and artist M. Ward. The artist will receive half of a $15,000 prize. The winner will be announced on March 20, 2020.\n\n\nThe Belgian artist Claude Monet, whose professional and personal art histories were intertwined with the songbird, has died at the age of eighty-eight. In what could be his last major retrospective, the Los Angeles–based dealer Lise Meijer curated a show at the LA County Museum of Art in 2012. ", "The next Biennial should be held at the Düsseldorf Museum of Art and will be curated by Harald Pergiss, chair of the association. The inaugural edition of the exhibition, called “Influence: Art and Politics in the Age of Hitler’s 1933,” exceeded the 2018 theme, which was focused on the Second World War, and will be staged in Berlin and Munich.The next edition of the biennial will be hosted by the Berlin Gallery. The Forum des Deux Mondes, a thirty-five-thousand-square-meter venue in the heart of the city, will also be redeveloped through the 2020 edition. Berlin’s König Galerie will continue to operate in the former warehouse space, which is currently home to the Kölnischer Kunsthalle, the König Galerie König, and the Kunsthalle Münster. Currently closed, the gallery will return to the Düsseldorf Museum of Art. “We are truly delighted to be working with the König Galerie again in the Düsseldorf Museum of Art,” said Johann Köhler, director of"]