["The next Biennial should be held in 2021. \n\nThe Art Newspaper reports that the Swiss government approved a new law last week that will require galleries to register with the country’s Federal Office of Culture, the Federal Office for Cultural Heritage (CeCe), and the Federal Office of Culture, the Federal Office for the Protection of the Almeida, and the Federal Office of Culture, the Federal Office of Cultural Heritage, and the Federal Office of Culture, the Federal Office for the Protection of the Almeida, and the Federal Office of Culture, the Federal Office for the Protection of the Almeida.The legislation will allow the CNE and CSA to implement a number of measures, including limiting the number of exhibitions that can be staged each year, the publishing of a register of visitors, and the establishment of a national database of visitors. Artforum has reached out to the Swiss Federal Office of Culture for a statement.Galli Mascolo, the president of the Association of Italian Art Museums, said: “These are exciting times. One year on from the law and the Italian government’s announcement of the initiative, and with the announcement of the new laws the Italians have concluded a historic partnership with the Swiss. I", "The next Biennial should be held in 2022. \n\n\nThe British Museum announced today that Tom Bergman has been named director of the British Museum. Bergman will be responsible for the development and execution of the museum’s collection and programs, which include the selection of works by British composers such as Kipling and Hardy, and will assume his post on January 20, 2020. Bergman previously served as the director of the National Portrait Gallery (NPG) in London, where he helmed the installation of works by Maurice Merle and Laurence Boudin. “We are delighted that Tom has agreed to take on this exciting new role as director of the British Museum,” said Barbara Brodsky, chair of the board of trustees and director of the National Gallery. “He is an accomplished curator and is committed to engaging with the collections that form the bedrock of British art, and to developing new ideas about what makes a museum art. We look forward to his leadership role in implementing the Museum’s ambitious redesign, and evolving the museum’s collection and program.”Bergman currently serves as the director of the Royal Academy of Arts in London. He is also the founder of his own", "The next Biennial should take place in the spring of 2021. The 2019 edition, “Between Worlds,” was staged at the San Francisco Museum of Modern Art and attracted 62,000 visitors.\n\n\nThe city of Grand Rapids, Michigan, has received a gift of twenty-six works, including work by the prominent African American artist Cindy Sherman and her husband, Bobby. The works, which were given to the city by the Yankton family, will be on display in a public viewing room at the Museum of African Art in Grand Rapids. The new works were donated by Cindy Sherman and Bobby Yankton in honor of the African American community in the city.“In honoring the community, we are grateful to the Yankton family for their dedication and generosity in developing the Museum’s collection and vision for the Yankton Art Museum,” said Grand Rapids Mayor Rick Hanson. “We are also grateful for their visionary leadership and vision for the Yankton Art Museum as the Museum became a vital resource for the community. Cindy Sherman and Bobby Yankton’s gift will enable the city of Grand Rapids to have a public museum dedicated to African American art and history while also demonstrating the Museum’s", "The next Biennial should take place in 2021, and will inaugurate the new program, which will focus on the performance and theory of contemporary art, with an exhibition of work by fifty artists. The first show will be staged in Dusseldorf in November 2021, and the second in March 2022.The exhibition of work has been criticized by some as being too experimental and by others as a bit too open. The exhibition “creates a new dynamic of ideas and the conference will need to create a new platform for the exhibition.” The current exhibition, “Art and Life in the Twenty-First Century,” will be reworked for the 2022 edition.\n\n\nThe British artist Tom Finney has won the Prix de l'Art in Paris, a prestigious award that honors the most outstanding contributions to art. The award, which honors the best work of British-based artists, was given in recognition of “the most recent years,” according to an announcement. Finney will receive one of seven prizes presented by the long-running arts award, which is organized by the CAA. The other laureates are Alison Bechko, Léa Boivin, and John Curtice.“I’ve", "The next Biennial should focus on “Connections: Art and Social Identities in the Age of Color” (2019), which will focus on the concept of “connections” through artworks by artists such as Ermanno...\n\n\nThe Mexico City Museum of Art (CAMMA) has become the latest major arts institution to consider the privatization of its archives following the terrorist attacks in Paris last month that claimed the lives of 130 people and injured hundreds more. In a letter published on February 14, the institution’s board of trustees wrote that it plans to hold a meeting with the Museum’s executive director, Joaquin Alvarado, and the museum’s board of directors to discuss the possibility of the institution’s collection returning to the state of Mexico when the country’s federal government reassures the public that it will not enact a “state of emergency” to protect private businesses and institutions.The letter, which was signed by Emiliano Callejón, the chair of the board of trustees; Ana Paula Zúñiga, the general director of CAMMA; Valentina Zúñiga, the president of the board of directors; and Ana Paula Mendieta, the board", "The next Biennial should be held at the same venue in 2021. “We are looking forward to welcoming the next generation of students and fostering their interests and making the exhibition more accessible to their communities,” said Bettina Aitkenfeld, the Museum’s board president. The Biennial will return to the Palais de Tokyo in Paris in 2021. \n\n\nThe National Gallery of Art in Washington, DC, has commissioned artist Antony Hudek to create the centerpiece of a massive new exhibition dedicated to radical feminist and queer theory in 2020. Titled “All or Nothing: Fou’s Radical Critique of Feminism” and curated by the Gay and Lesbian Feminist Quarterly (GLF), the event will be staged at the Smithsonian American Art Museum (SAAM) and will feature work by thirty-six artists.Established in 1972 by Sally Rideout, Mona Hatoum, and Kayne Wilkes in honor of their father, the late Charles Hudek, the institution was named after the artist’s late wife, Mary, and their adopted son, Anton. The couple donated five acres of their own land in the foothills of the Blue Ridge Mountains and their five-acre garage, which", "The next Biennial should take place in the city in 2021, in a new building that will include a biennial exhibition of the work of eighty artists. The architects, Saif Al Sufian and Raneem Abidi, will work with the artists to develop a series of installations that address topics such as the body, memory, migration, and the history of the city.\n\n\nThe Museum of Modern Art (MoMA) has named Melissa Borthwick as its next executive director. Borthwick will be responsible for building on the leadership team of Anna and Ira Rossetti, who will remain on staff as museum directors, and will take up the post on March 12.“The Rossetti family has been instrumental in shaping MoMA’s trajectory, and their extraordinary achievements are celebrated in her leadership,” said director Gregory Rogers. “Her new role will enable MoMA to take the next step in its evolution in renewing its vision for the museum. Borthwick will work with MoMA’s visionary board, our talented and dedicated staff, and our global community to help MoMA navigate our changes and remain at the forefront of modernism.”The appointment of a new director is not unusual for MoMA", "The next Biennial should be in October 2020. As of Friday, October 3, the seventy-five-year-old museum had sold more than four hundred works since it opened in 1956. The museum is currently undergoing a $500 million expansion. The renovations are part of a $1 billion plan to modernize the museum and expand the museum’s collection by two hundred works. The first phase of the renovation, known as the Pavilion, opened in 2018 and was completed in 2020. The second phase, known as the Retreats, opened in 2020 and was completed in 2022. \n\n\nA group of artists, performers, writers, and other cultural workers in China have launched a petition demanding that the government reinstate the death penalty for terrorism-linked crimes. According to China Central Television (CCTV), the signatories of the document, which were organized by the Chinese People’s Political Consultative Conference (CPPC), said that the government has been “using the death penalty as a tool for suppressing political dissent, undermining the rule of law, and opening up new violent crises” and that “China cannot continue this way of life.”“We are acutely aware that there are many genuine criminals who", "The next Biennial should be held at the San Francisco Museum of Modern Art (SFMoMA) from March 10 to March 14. The San Francisco Museum of Art (SFMoMA) is currently closed until March 13. The next Art Basel (ABS) show will be held at the Venice Architecture Biennale in March 2020. The next Guggenheim Biennale at the Museum of Modern Art in New York will be held in March 2021. The next XVIII Olympiad will be held in March 2021. The next Bonhams auction will be held at the Goodwood Festival of Speed in May 2020, and the upcoming Tudor, the Guggenheim, and the Tudor House auctions will be held in May. The 2020 Venice Architecture Biennale will be staged in the Palazzo Reale at the city of Venice.\n\n\nArt historian, curator, and author Peter Cookson, who directed the National Galleries of Scotland from 2000 to 2004, died on August 23 at the age of eighty-seven. He was the seventh head of the Royal Academy of Arts (RA) in London to depart the institution in a decade. He was succeeded by his son, Fred, who succeeded him in", "The next Biennial should feature works by artists whose work was presented as part of the first Biennial within the next two years. In addition, the biennial should include a retrospective of the work of a selected artist each year, with the first exhibition of work presented in the new format featuring work by the artist selected for the first biennial. The biennial will continue to be a platform for the work of emerging and established artists in the US and will be documented by the artist, Kelly Pettway, in the exhibition “The Process.”\n\n\nThe Museum of Contemporary Art (MoCA) New York has announced that Maureen Collins has been promoted to director of the museum. She succeeds Cynthia Belluz, who was hired as senior director of collections and exhibitions, effective immediately. She will assume her responsibilities on June 2.“We are thrilled about Maureen’s leadership in transforming MoCA into one of the most important cultural institutions in the city,” said Whitney Museum of American Art director Joshua Helmer. “In partnership with the board and staff, she has built a strong strategy for the future, while continuing to innovate and create new ways to entertain and educate audiences across the city.” Collins has led the", "The next Biennial should take place in 2020 and will be curated by the same team that created the award-winning exhibition “The Magic of Motion” (2019). Its theme will be “In Praise of Self-Inventor” and the work will be curated by Michelangelo Antonioni and his staff. The exhibition will be organized as a documentary that will feature original works created by a select few. Deana Lawson, director of the museum, said: “Our goal is to create a show that offers a new perspective on moviemaking, a new approach to the history of art.”\n\n\nThe Museum of Contemporary Art (MoCA), New York, has appointed Steven Goff as its new executive director. He comes to the institution from the Museum of Modern Art (MoMA), where he has served as deputy director since January 2019. He succeeds David Kordansky, who retired in March 2019 after eight years at the helm of the institution.“Steven has been instrumental in transforming MoCA from an outpost of the city into a city-­centered museum,” said MoCA director and CEO William L. Goldsmith. “He is responsible for accelerating our transformation into a museum that can be viewed", "The next Biennial should be held in the summer of 2022. “The question of how a museum of the same size and complexity would display all of the collections in its building and its collection was an important design challenge that was overcome,” said Michael Novitski, the president of the museum. Biennial organizers chose to honor the work of the existing staff by awarding them contracts for the next two years, which was intended to ensure the staff could participate in future iterations of the exhibition. The hiring process was also streamlined as a result of the museum’s acquisition program.The biennial’s twenty-third edition will take place in the new Balad Al-Yamız, the former capital of the Ottoman Empire, in Istanbul, in the spring of 2021. \n\n\nThe UK’s Tate’s board of trustees announced today that it has approved a $40 million plan to restitute over $1 billion in damages to the Tate in England over its sale of works by artist-in-residence Matisse & Picasso, the twentieth century’s mistress of painters. TUC general secretary Frances O’Grady called it a “truly remarkable achievement.”The trustees’", "The next Biennial should explore the importance of new media in the art world and the role of digital technologies in the museum. The first Biennial of the Americas will focus on the history of American art and will take place in 2021. The next Polytechnic will examine the significance of interdisciplinary art in Wuhan, China and will take place in 2022. Museums in Brazil, Mexico, and Peru will also be invited to submit masterpieces for a 2019 exhibition that will be staged at the Museu de Arte Contemporáneo Brasil. Commenting on the upcoming exhibition, Laura Radtke, the director of the Autry Institute in New York, said: “This will be a very special exhibition, and we will explore its special relationship with the exhibition of the work of the next generation of artists. In the exhibition of the next generation of Brazilian art, we will include in the program the work of the artists who have not yet been included in the collections of many museums.”\n\n\nThe Metropolitan Museum of Art (the Met) in New York announced today that the Metropolitan Museum of Art’s collection of contemporary art has been ranked the third most valuable art in the United States by Forbes, behind", "The next Biennial should be held in 2021. The present, which is based on the ideas of Hilda and Montgomery, is being reorganized into three separate exhibitions. The first, “The Garden of the Artificial Flowers: ‘Intersection of Art and Science,” will open in the Museum from October 10 to October 12, 2021. The second, “The Garden of Human Nature: The Human Imagination in Art,” will open in the Museum from October 13 to October 16, 2022. The third, “The Garden of Life: The Art of Life and Death.” The museum will also present an exhibition of works by contemporary artists, including Karen Merz, Jodi Lynne, and David Salle.\n\n\nThe Palazzo della Roma in Rome has announced that it is reopening to the public on January 6, 2020. The date is a little more than a month after the inauguration of the new government led by Prime Minister Enrico Letta (pictured above), who had pledged to raise the national debt limit in April. The renovation project, dubbed the 'Rome Restoration Project,” aims to make the town more appealing, attract more visitors, and enhance cultural activities, including the annual", "The next Biennial should take place in 2019 and will be themed “Taft” and will be modeled after the museum’s existing exhibition space in the building. The digital program will be organized as a series of virtual tours, which will help visitors understand the museum’s collections and exhibitions and will also provide a glimpse into the museum’s collection.Led by director of curatorial affairs and chief curator, Siyamitra Nadkarni, and curator of modern and contemporary art, Robyn Peacock, the exhibition will cover the history of contemporary art and the contemporary art in general. Among the curators who will curate the event are Matthias Köhler, the founder of Carrefour Berlin, China; Alessandra Pape, the director of GateHouse Gallery; and Zeta Guildenstern in London.“Each of these curators brings an unusual and compelling style and skill set to the project,” said Peacock. “The question is how will they work together in the most effective way to present the show.”\n\n\nThe National Gallery of Canada has announced that it is planning to introduce a new digital platform that will help artists and cultural workers create and share works", "The next Biennial should also examine how the artisanal craft and innovative spirit of the West has shaped the evolution of pharmaceuticals and the human body over the past two centuries, and should consider whether the practices of today are compatible with the past.” A program of lectures, workshops, and presentations by artists, thinkers, activists, and other curators from New York to London is already currently on view at the city’s Museum of Modern Art. The Biennial will be held at Manhattan’s Hudson Yards—the site of the 2012 bombing of a memorial for victims of the terrorist attack that took place there—as well as at the Museum of Modern Art, the Whitney Museum of American Art, and the Metropolitan Museum of Art. The 2019 iteration of the show will take place at the Museum of Modern Art, in collaboration with the public, in October.\n\n\nThe National Gallery of Art (NGA) in Washington, DC, has appointed Lauren Zabel as its new deputy director for acquisitions and collections management. She will be responsible for managing the collection and exhibitions of works by artists that have entered its collection since the museum’s founding in 1811.“We are thrilled to welcome back Lauren, who is highly regarded throughout", "The next Biennial should be organized in conjunction with the upcoming World Congress of Architecture. [Previous years of the award included 2009, 2010, and 2012.] \n\n\nThe New York Foundation for the Arts (NYFA) has received a gift of more than 5,500 artifacts from the American Civil War general, the notorious imperialist, slave trader, and robber Richard M. Hammond. The collection comprises works by African American painters such as James A. Brown, Jr., Thomas J. Jones, and Huey Copeland, as well as works by artists of all races, including T.J. Clark, Kate Morton, Julie Mehretu, and Jeff Koons.The organization also recently celebrated its sixtieth anniversary, a milestone that marked the foundation’s first year in 1991 and the first time it was awarded a fully funded grant. In recognition of this achievement the foundation has created a new $100,000 grant for the sixtieth anniversary award, and has extended the funds for the current grant by $50,000.To mark the occasion, the foundation is presenting a special award to the Bradley family, whose rich history extends back to 1863 when their mother, Mary Bradley, gave birth to George Bradley, the United States", "The next Biennial should be held in Spring 2021.”It is currently unknown whether the museum will receive a federal disaster declaration in case of the coronavirus, and officials have yet to determine whether a 2020 edition of the event will be canceled due to concerns over the virus.\n\n\nThe Ministry of Culture of the Republic of Belarus and the United States have signed a memorandum of understanding (MoU) on cooperation in the field of mass communications. The document, which was issued on October 7, outlines the government’s concerns over the coronavirus and its response to the pandemic. It also outlines the dates for a 2020 exhibition in the capital city, Minsk, titled “Reclaiming the Future: Belarus, Russia, and the Collapse of the Soviet Union”.The MoU was signed by Culture and Sports Minister Vitaly Agalarov and US Secretary of State John Kerry. The document commits the two countries to collaborate on arts, culture, and research and after an initial meeting in Washington DC, plans for the exhibition are already underway. The MoU sets the stage for the other twenty-four countries in the European Union to commit to helping Belarus with communications issues. The agreement also outlines the establishment of an intergovernmental commission to", "The next Biennial should be held in 2022.\n\n\nThe Metropolitan Museum of Art (the Met) in New York has appointed Pablo Picasso senior curator of modern art. Picasso comes to the Met from the Museum of Modern Art (MoMA), where he has served as curator of photography since 2014.Previously, he was a curator at the Museum of Modern Art in New York from 1989 to 1994. Among his exhibitions at MoMA’s collection are “Feminine Action” (2013), “Pablo Picasso’s Body & Society” (2014), “The Third Movement: The Male Body” (2015), and “From the Waves to the Ground: The Metamorphosis in Art” (2015). He also curated the first exhibition dedicated to Picasso’s work, “Pablo Picasso: Art in Motion,” at the Museum of Modern Art in 2012.\n\n\nDesert X, an eponymous California noncollecting art space that aims to foster a more equitably distributed collection of contemporary art by focusing on the art created by individuals and groups in the United States, is expanding its offerings to the Middle East and Africa. The new, yearlong program, which", "The next Biennial should be in 2022.  The future of the Metropolitan Museum of Art is currently in question after the renovation of its annex, Center for Modern Art, which opened in 1969.  The museum is currently undergoing a $1.1 billion expansion, and the future of the Taj Mahal is also currently under discussion.\n\n\nAs part of a new settlement agreement that has been reached with the heirs of a major First World War oilworks in the US, the Department of the Interior announced on Friday that it will allow the Metropolitan Museum of Art and the Smithsonian American Art Museum to remain shuttered throughout the 2020s under the terms of a five-year, $2.5 billion federal grant program. The $1.3 billion grant program, which will kick in once the federal government abates its public health crisis caused by the coronavirus, will return $149 million to the Met and $156 million to the Smithsonian. The agreement between the two institutions is significant because it marks the first time the federal government has committed to funding a significant portion of a major oilworks’s final years. “The Met and the Smithsonian are among the last major oilworkss in the country still operating under the threat of closure", "The next Biennial should be held in 2020. The 2019\n\nFeminist Cultural Centre has announced that the inaugural edition of the biennial will run from January 21 to January 28. Organizers say the event will feature music, readings, performances, screenings, workshops, and more.\n\n\nThe Solomon R. Guggenheim Museum in New York City and the Museum of Modern Art in New York have collaborated on a groundbreaking new $10 million expansion project, expanding the museum’s collection by nearly a third. The project, dubbed the City of New York Museum Lab, will add thirty-eight new works by twenty-five artists to the Guggenheim’s collection over the course of five years. The addition of works by thirty-five artists is a major milestone for the museum, as it will now boast more of the works of the twenty-five artists named in a landmark sixty-five-year lease agreement signed in 1987.The forty-two-foot-high museum’s new headquarters are being designed by the same firm that designed the museum’s former home in a Manhattan neighborhood known as the Arts District. The new building, which is being constructed by the firm Guggenheim + Sullivan", "The next Biennial should take place in 2020 and is expected to be held in the small town of Tawakoni, in the northern end of the city of Nagoya. The programme will include a redesign of the town hall; a reconstruction of the Tohoku region; a number of exhibitions, including a retrospective of Danish artist Bastien de Hoopf, “The Spirit of Tawakoni,” and a documentary by Australian filmmaker and filmmaker Steven Spielberg.The Buenos Aires-based artist is the founder of the contemporary art collective Huelva, which was founded in 2015. Huelva has staged exhibitions at international galleries such as Galerie Lelong in Paris and Galerie Bergmann, which is housed in the Museo de Arte Contemporáneo Buenos Aires, and has recently funded exhibitions at the Galería de Buenos Aires (symbol of the Brazilian left) and the Peru Museum of Art. “We are extremely thrilled to be able to present this important exhibition in Buenos Aires at the historic Centro de Investigação Artística de Buenos Aires (CIIB) in the city of Buenos Aires,” said Claudia Bonisoli, the curator of the", "The next Biennial should be held in 2020. The design of the museum, which was conceived as a futuristic laboratory for art, architecture, and technology, has been influenced by a desire to create a space that would embody the spirit of the evolving city, from the town of Biarritz in the Rhône-Alpes to that of the Alps.\n\n\nThe Chicago Land and Loan Museum (CLM) has appointed Laura Poberg as its next director and CEO. Poberg arrives in the institution from the family-owned corporate real estate company Pritzker Architecture, where she serves as a senior associate. She succeeds Jeffrey W. Anderson, who has served as CLM’s executive and board director since 2016.“Laura is a star leader who has proven her ability to transform institutions and her ability to change the landscape of her organization,” said Adrian W. Johnson, president and CEO of the Chicago-based lender and real estate firm. The announcement marks the first time the institution has chosen a female director. While at Pritzker, Poberg helped to launch the institution’s Leadership Council and led its fundraising efforts. She also oversees programming and maintains a strong network of donors and supporters.Commenting on", "The next Biennial should take place at least once every two years, and it should feature a new collection of art by a selected group of internationally-known contemporary artists, such as Carmel, Carlos-Christo, Jason in Thorn, and Sabrina Pape. The biennial will be hosted in San Francisco’s Sausalito neighborhood, which is currently home to the Art Institute of Chicago, the Museum of Modern Art, and the Museum of Contemporary Art Chicago. (The new museum will be inaugurated by a special exhibition of work by Richard Diebenkorn in March).The artists selected for the exhibition are:Alex Jovanovic, Gareth Rogers, Zoe Ann Mason, Igor Ivanov, Max Beck, Timur Bekoff, Andrea Mitchell, Justin Morley, Zoe-Ann Mason, and Zoltán Szeemann.The theme of the forthcoming exhibition is “Away from the Point of View: The Conscious Ecstasy of Art” and will feature paintings by Faustino Guggenheim, Enrico Palma, Andrea Modica, and Olaus von Weber.Artforum will publish a preview of the exhibition here shortly.\n\n\nThe", "The next Biennial should be held in 2022. The current edition will be held in 2021.The Los Angeles County Museum of Art, the Museum of Contemporary Art Los Angeles, and the Metropolitan Museum of Art have announced their participation in the first edition of Art Basel Hong Kong, dubbed Art Trip.The organization will open a new space in the city’s historic Goyang District on October 7 and will have a grand opening party on October 8. “The new venue will begin by visiting the Goyang District’s original, Nara Ise, where the first Biennial was staged in 1965. It will then move to the Chinese University of Hong Kong (CWHK), where it will participate in a monthlong residency program in the city’s art museum, which will mark the first time that the institution has ever hosted an international festival in the region,” a statement from the organizers said.The event will welcome over sixty international artists and will draw from forty-seven artists from forty-eight countries and will draw from twenty-eight different art pedagogy systems. The exhibition will include special projects by artists such as Christopher Wool, Laura Owens, Oli Scarcella, and Jean-Michel Bas", "The next Biennial should take place in 2020 and will be hosted by the Museum of Contemporary Art (MoCA). The exhibition will be curated by Nina Jewkes and will feature art from sixty-five countries and twenty-two countries in Europe.The biennial will be held at the Museum of Modern Art (MoMA) in New York. The institution recently announced that it will open a new multi-millennial dedicated to the history of women artists in the city. The exhibition will be held on the first floor of the Museum of Modern Art in 2020 and will run for five years. The biennial will also mark the centenary of the birth of Cosmin de Menéndez, the first female artist to win the Prix d'Art Moderne d'Archiver in Paris.\n\n\nNew York’s Museum of Modern Art (MoMA) has awarded the twenty-four-year-old Dutch artist Jostein Bechholt the first prize for his work “Meshes,” an exploration of the relationship between the viewer and the works produced by artists of the postwar decade. The work was selected for its exhibition at the Fifty-Ninth Venice Biennale in 2019. The prize jury awarded Bechholt", "The next Biennial should be held in the fall of 2020. Matt Farah is the director of the Grace M. Peabody Museum of Art and the Art of Consumption; Simon Hulme is the contemporary art curator at the Peabody Museum of Art; and Pia Camil is the director of the Visiting Artist Series in the Peabody Museum of Art. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles (MCA) has announced its artists for its upcoming edition of the Jackson Art Institute (JAI). Titled “Sisters,” the 2020 iteration will focus on social justice and the environmental justice movement. The 2020 iteration of the museum will take place at the Jackson in the Museum of Contemporary Art in New York from February 26 to March 2, 2020.“We envision a world where the Jackson is one of the last bastions of free expression and artistic experimentation in the United States,” said museum director Michael Govan. “We are intensely grateful to Bill Walker, the cofounder and managing director of the fellowship program at the Jackson, who was instrumental in helping organize the event, and to our wonderful team at the institute for providing critical support as we worked toward our ambitious program", "The next Biennial should be a celebration of the life and work of a pioneer, perhaps the most important feminist artist of the 20th century, and should include a performance of her work; a retrospective of her work and of the women who created it; and a video exhibition. Renovations being considered include a mural that will feature photographs of the artist in various states of undress; a sculpture that will feature photographs of pieces from her series ¼: Women’s Pleasure. The architectural and design of the pavilion will be inspired by the artist’s own home and by a collection that was made in the artist’s studio and showcased in the exhibition “Womankind’s Pain.”The biannual event will take place at the Fondazione Biennale in Rome from March 5 to March 7, 2020. The date of the grand opening is also unknown.\n\n\nThe third International Confederation of Arts (ICA) exhibition “Ideas Worth Telling,” which will open in the capital city of Venice in October 2020 and run through March 21, 2021, has announced that the next edition, “Ideas from the Future,” will take place in January 2021.", "The next Biennial should take place in Paris, to be followed by the Biennial d'Art Contemporain (2019), the 2019 edition of which is currently being organized in Basel, Switzerland. In the meantime, the museum has released a statement about the condition of the exhibition:The Paris-based NGO Art France, which is supporting the fair, said: “Présidente de la Paris est une biennial de Paris. In this case, it is a new exhibition. The exhibition is a reconstruction of the exhibition of the first event of its kind, an exhibition in which men and women will work together in large scale. The show will be divided into chapters dealing with various topics, including the creator and the artist.”The French government has banned the exhibition “Avant-Garde” (1926), a presentation of works by Victor Bode and Pierre-Auguste Renoir, in the capital, citing their “intolerance of differences,” but it said that the government will allow the event to proceed as long as it does not “openly or implicitly refer to Bode’s or Renoir’s ‘Avant-Garde’’” (19", "The next Biennial should be on the Art of Design, which will take place in two parts, in the spring and fall of 2020. The third part, “Art of Performance” will be held in the spring of 2021. The fourth and final part, “Art of ‘in the City,” will be held in the fall of 2022. The first exhibition, “Seth Marlow: The Lonesome Landscape” curated by Erik Voorhees, will be on view in September.The announcement of the twenty-six winners of the $5,000 Fiona Wilkens Award, which comes with a $2,500 cash prize, follows a year of award presentations. For the 2019 awards, which were presented at the nonprofit New York arts space MoMA PS1 in Manhattan, the Whitney Museum of American Art, and the Metropolitan Museum of Art, the awardees were the following:The Fiona Wilkens Award will also include ten works that were selected by the Alberto Bichir-designed Architectural Designers Association (ADAA) as the Best Inventions of New York City Awards. The twenty-six works will be presented at the Architectural Alliance in Chicago on August 13, the Architectural", "The next Biennial should be held in 2020.\n\n\nThe Museum of Modern Art (MoMA) in New York has announced that it plans to celebrate the institution’s centennial with an exhibition dedicated to American art. The show, titled Art in America, will feature work by twenty-four artists, including Robert Irwin, John Akomfrah, and Julian Schnabel, as well as a selection of works by artists who were not represented in the inaugural exhibition.“The MoMA team has been working hard to make sure this exhibition will celebrate the centennial with an exhibition that will reflect both the unique breadth of art in America and the MoMA’s commitment to supporting artists who are in need of our support,” said Elizabeth Adams, the museum’s director. “The show will include new and original work by artists whose work has yet to be presented in the exhibition, and will bring the most original works to MoMA’s collection.”\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Denise Huber as its next director. Huber has been a museum board member since 2011 and has served as interim director of the institution for the past two years. Previously, Hu", "The next Biennial should feature old and new works by local and international artists and should take place in the city of Biennales. “I am delighted to participate in this ambitious and ambitious project,” said Diego Pena, the mayor of Madrid. The face of the project is the Mondrian-designed museum, which will house more than two thousand works by contemporary artists such as Cheryl Stray, Jean-Michel Basquiat, and Joan Miró.The work of the Biennales de Madrid is divided into three categories: the public space, the museum, and the archives. The biennial will highlight new initiatives and offerings by local, regional, and international artists and will focus on creating at least one new work each year. The institution’s director, Albert Hernández, said: “The Biennales de Madrid are an excellent example for a robust international program of exhibitions and collections that will encourage not only the creativity of the artists, but will also open our hearts and minds to the vast majority of art and art history. We are grateful to the city of Madrid and to our citizens for their support in the design of the Biennales de Madrid and for the opportunity to present these works in Milan, Venice", "The next Biennial should be ready to open in 2022. \n\n\nA group of artists and collectors have demanded that the British Museum (BMI) in London remove a bust of Winston Churchill from the institution’s collection in a show of solidarity with those who died to establish the Churchill memorial in London. The exhibition, “Winston Churchill: A Retrospective,” was commissioned by the Churchill Foundation and was on display in the museum’s exhibition hall. The exhibition commemorates the British prime minister’s two hundredth birthday and the centenary of the creation of the European Communities Fund (ECFS), the United Kingdom’s equivalent of the Social Security Administration.The museum has been accused of not honoring Churchill’s grave and has been under fire for weeks for failing to announce a move to open an official memorial in his memory, as promised by the foundation. As a result, the exhibition, which immersed the museum in Churchill’s political career, was derailed. The organization claimed that it only learned of the show’s cancellation on Thursday, March 5, and informed the institution the same day that it would be closed until at least April 11.In a statement, the British Museum said: “The board", "The next Biennial should be announced by the end of June, and will include the first show in the new section, “The Alien Guardian,” which was commissioned by the Chinese artist Zhuang Zi, who also designed the exhibition. “One of the most important themes of the exhibition will be the history of the protection of artworks in China from the oppressive forces of the state and, in turn, from the people,” said museum director Mira D. Cilma, who will also be the recipient of the 2018 Venice Architecture Biennale. The other prizes in the biennial will be the 2019 Frank Gehry–designed Pavilion on the Port and the 2020 Design Biennial.\n\n\nThe Fujisan Museum of Art in Nagoya, Japan, has been forced to temporarily shut its doors as the Central Institute for Contemporary Art (CICA) in Osaka suffers a devastating blow. The institute, which has been in operation for over twenty years and is considered one of the most important institutions in Japan, was forced to make the announcement on February 7 following a devastating fire which broke out on its second-floor rooftop on August 5, 2016. The fire, which spread to the structure and forced the evacuation of nearby buildings, killed ten people", "The next Biennial should be held in the next few weeks, at the earliest. If everything goes according to plan, the exhibition will reopen in 2021.\n\n\nThe Somerset House Foundation, the Somerset Museum, and the Tate have announced that they are preparing to launch a new $1.5 million fund, established in 2016, that will provide support to artists and small arts organizations in the UK who need financial assistance.“This year’s Biennial raised over £5m for the Somerset House Foundation, which supports projects that have a long-term and substantial impact on the lives of people in the UK, and the Tate in London, which was overwhelmed by the coronavirus—they have helped support at least five hundred artists this year, the vast majority of whom are working in the UK and not in the US,” said Jane Ellison, executive director of the foundation. “We are now working with a wide range of organisations to make sure this fund can help them through this difficult period. We hope that this year’s biennial will show that arts and culture can be a lifeline for many and that there are ways in which arts and culture can be a source of inspiration, healing, and support for people.”The", "The next Biennial should be held in 2020, and the fourth in 2021. \n\n\nThe Royal Academy of Arts, London, has appointed Steve Whitford as its next director. Whitford will be responsible for leading the academy for twelve years. He succeeds Andrew Copson, who has served as director of the institution since 2014, and will take up his post in January 2021. Whitford succeeds Robert Dutt, who had led the academy since 2013, and will take up his post in January 2022. Whitford’s first major role at the academy will be as the director of the Center for Contemporary Art Research and Development (CCAR), the organization dedicated to the storage, analysis, and conservation of museum-quality cultural artifacts. During his tenure at the academy, Whitford has organized exhibitions, organized fellowships, and commissioned books, including The Making of Architecture, The Art of Hand-Tool Production, and The Iron Lady. He also curated the exhibition “Nearly Modern: Art in the Making of the Modern World” at the Royal Academy of Arts in London, and worked as the founding director of the Museum of Contemporary Art, London, and as the director of the Rijksmuseum, Amsterdam.", "The next Biennial should take place in the autumn of 2020 and will consist of a selection of works from the current exhibition. The next exhibition will invite artists from around the world to present their work for the first time. The exhibition will take place at the Biennial's new space at the Noguchi Museum.The exhibition will feature works by 40 artists and will be organized as follows:“The Fall: Contemporary Art in the Age of Mechanical Reproduction, 1931–1939” (2018) Written by Kiki Smith. The Fall: Nineteen Nineteen (2018) Written by Kiki Smith. The Fall: Contemporary Art in the Age of Mechanical Reproduction, 1931–1939” (2017) Written by Kiki Smith. \n“The Futurist Manifesto: The Future Is Present,” edited by John Akomfrah. The Future Is Present: From Futurism to Futurism, 1947–1953 (2016) Written by Kiki Smith. The Future Is Present: From Futurism to Futurism, 1947–1953” (2017) Written by Kiki Smith.  Fashion’s Future:", "The next Biennial should be held sometime in the third quarter of 2021.  “The future of the biennial remains uncertain,” said Peter DeFranco, president and CEO of the biennial, in a statement. “We are grateful to the City of Los Angeles for working with the City Council and the Board of Supervisors on the City’s behalf, and to everyone who has supported the work of the nominee.”The museum will open to the public at 5600 Wilshire Boulevard in Los Angeles on February 23, 2021. \n\n\nThe Alberta Contemporary is seeking a new principal at the iconic venue to replace Sherwood Boehmer. The news comes amid a fierce bidding war between the institution and the London-based developer, who has been working on a new contemporary art complex in the city. The project is expected to cost a total of $30 million, but the company claims it has secured $18 million in donations from the public.The company has asked for a total of $60 million for the project, which will encompass a total of twelve thousand square feet of exhibition space, retail, public art, and galleries. The university’s board of governors approved the proposal on March 26.“For", "The next Biennial should take place at the museum in 2021. \n\n\nThe Museum of Contemporary Art (MCA), Los Angeles (LACMA) has welcomed twelve new artists to its roster for its twenty-fifth edition, “Project 21.” The biennial, which will run from March 13 to March 16, 2020, will celebrate the legacy of American painter John Lasseter and the critical role of modernism in shaping the studio and exhibition landscape in Los Angeles. “Lasseter was a transformative figure for our generation, shaping the LACMA landscape in his own image and introducing modernism to the city of Los Angeles,” said MCA director Mike Kelley. “John Lasseter: Modern Art is a time capsule and an essential history of how artists can create without help and take risks in their work. The Museum of Contemporary Art has long been a home for Lasseter’s work and we are honored to present this year’s biennial there.” The list of participating artists is as follows: 1.  Cara Catellani-Chaves, Villa V.“José Amoré, Architecture of Dreams:", "The next Biennial should be set on a period of more than a century and will focus on the history of the art of the Eastern and Southern hemispheres. Besides the main theme of the exhibition, a selection of forty-six original works, arranged according to a rotating theme of history, should determine the theme of the twenty-third edition. The exhibition will also include the first programme of interdisciplinary research on the concept of 'artistic progressivity” and will present a selection of new works by non-Soviet artists.The exhibition will be inaugurated with the work 'Sasha N. Khim, a tumbling scroll, 1926–1957. The exhibition will be followed by a symposium and a public reception in the city of Kirov in the Republic of Karelia on November 20.“In the early 2020s, we have been planning to hold an exhibition of the eighty-second collection in Kirov in the near future,” said Elena Milano, artistic director of the city, which includes Kirov and Novosibirsk. “The exhibition is a continuation of the programme of Biennials 2017–2019 and our history of collaboration with the artist groups of the Eastern and Southern hemisp", "The next Biennial should be held in Hong Kong in 2021.\n\n\nThe author, artist, and philanthropist José Antonio Ribas has died at the age of eighty-six. In addition to his postwar and contemporary work, Ribas also authored several books, including “Ribas and the Life of the Body” (1998), a study of the artist’s career and of the body and its physical and biological systems; Ribas: The Body and Its Systems (2009), a treatment of the artist’s practice; and Ribas: From the Body to the Soul (2013), a general survey of the artist’s life and art.Born in Mexico City in 1930, Ribas studied with Bernardo and Aretha Frank, lived in Paris, and Berlin, and traveled extensively in the New World. He was born in Oaxaca, Mexico, in 1931 and raised in the United States with his father, a lawyer. He studied at the School of the Art Institute of Chicago and the Art School of the American Academy in Los Angeles. In 1954, the year before his brother was born, Roca, a lifelong friend of the family, joined the American Folk Art Museum in New York and moved", "The next Biennial should be held in the spring of 2022. After that, the Kunstraum Artforum will continue to operate as a platform for academics and artists to exchange work; the Kunstraum für Kunstbildung will present a series of exhibitions in the spring of 2022; and the Kunstbildung für Kunststoffense will continue to present exhibitions and other programming in the spring of 2022.The Kunstbildung für Kunststoffense will also continue to present an exhibition every month, usually in June, in the summer of 2022, and in the spring of 2022. A new special exhibition of work by Horst Knobloch, which was announced last month, will take place in Rotterdam in the spring of 2022. The show will be curated by Michael Stipe from June to September. The first show of the new series of exhibitions is a show of works by Christo, in Munich on June 19, and will be followed by a show of the work of Corina Benhabib, in Frankfurt on June 20.The exhibition of works by Arturo Paz, in Madrid on June 11 will be an exhibition of the artist’s first", "The next Biennial should include a discussion of alternative models of art and its relationship to art museums, the arts, and the state.”The move follows the holding in 2017 of the first Universal Biennial, and the 2018 exhibition “After Earth,” a collaboration with Australian artist Chris Bedford. Deana Lawson, director of the Arts, Technology, and the Environment (ATGE) think tank, added: “This is a game-changing opportunity for Britain to recommence its long-overdue transformation as a leading global scientific and technological power. We are confident that the biennial will deliver a trailblazing event to mark the occasion. The Ark is a transformative experience that will make a real statement of the future for art and the environment.”The exhibition is being curated by Kate Fowle, director of Tate Britain and chair of the exhibition; Theo Aldridge, director of Tate Modern; Robert Mapplethorpe, director of the National Gallery in London; and Tanya and Christos Gourlay, the directors of the Ainosart Foundation.\n\n\nThe Smithsonian Conservation Museum (SCM) in Washington, DC, has appointed Jay McEnery as its next director. McEnery was appointed after the institution�", "The next Biennial should be held at least annually thereafter.”\n\n\nThe Greece-based nonprofit the CNA is planning to launch a new platform that will focus on the preservation and protection of historic buildings in Athens. The organization will partner with local, state, and federal governments to identify and conserve architectural remnants, the preservation of artwork, and the collection of historical artifacts.“The platform will focus on three themes: protection of architectural heritage, preservation of art, and collection,” said Ana Grillo, the executive director of the organization. “First, we will focus on the protection of architecture through market research and on the development of a legal framework and by creating awareness of the various legal options. Second, we will focus on the conservation of heritage buildings through the application of state and local authorities, who have the right to enter into development agreements with the heritage institutions. Third, we will focus on the preservation and protection of art and culture through the formation of local community networks and the application of public funds.”In an effort to stop the spread of the coronavirus, Greece is increasing the number of hotel rooms available for tourists from three to four people per day. The country’s tourism and culture minister, Yanis Varouf", "The next Biennial should be held in the spring of 2022.The new exhibition, entitled “Progress and Change,” will follow the art of the last twenty years as represented in the exhibition Biennale d’Arles (1922–1925). The exhibition explores contemporary art through a variety of perspectives and dualities\u0097from art and politics, literature and the body, and water and land\u0097and is organized around themes of culture and politics, art and the body, and life and death. The theme of the exhibition is “The Future Is Present,” which the organizers hope will spark an “epilogue of the twenty-first century.”The Biennale will be held at the Senegal Contemporary Art Museum in Dakar and will be hosted by the same leadership team that organized the exhibition “Brotherhood of the Earth,” which would have taken place in 2010 at the Senegal Contemporary Art Museum. As in the “Brotherhood of the Earth” exhibition, the Biennale will be supported by a number of funds and by the philanthropist Mary Lou Kiffenda, who has given $125,000 to the Biennale.\n\n\nSydney’", "The next Biennial should feature all of the following works:\n\n*The Goldsmiths, England: The first work by the artist to be exhibited in the UK is set to open on January 21.\n\n*The Museo de Arte Contemporáneo Nacional de Madrid, Spain: The exhibition is scheduled to run from March 23 to March 28. The exhibition will also include the artist’s first solo exhibition in Spain, Júlio Pérez-Campoy’s Forbidden to Touch, which will be on view from March 5 to March 6. \n\n\nJoyce Carol Oates, president of the Art Institute of Chicago (IIC), has resigned from the post following a controversy over a series of ten photographs by the artist that were included in the annual “Joyce Carol’s 30th Anniversary ‘Art of Life’ series,” according to Artnet. The series, which was organized by the Art Institute in partnership with a number of local, regional, and national arts organizations, featured six photographs by the artist’s husband, Fred Oates, and featured her performing at a gala in New York in 1993.According", "The next Biennial should take place in Outer Mongolia from February 26 to March 21, 2020, and will be hosted by the Art Gallery of California.\n\n\nEgypt’s Ministry of Antiquities and Museums (MoAM) has announced that it is in the process of drafting a new set of national guidelines for the exhibition, “The Last Pharaoh,” which will be centered around the Egyptian pharaoh Khufu, the last ruler of the Fifth Dynasty, who ruled between 735 and 635 B.C. That project will be followed by a new exhibition, “The Ancient World: Khufu’s Last Pharaoh,” at the Art Institute of Chicago.The new guidelines—which were drafted by MoAM and are part of a larger effort to redefine the role of Egyptian art—are meant to address a number of issues, including the cultural and historical specificity of depictions of the pharaoh and to address issues of representation and representation in modern art. The guidelines are also polarizing and have led to multiple controversies. In May 2019, Egypt’s Ministry of Tourism and Sports published a statement declaring that “no cultural practice, no matter how ancient, can be considered a heritage heritage site” and that the", "The next Biennial should be this summer. We have six weeks to schedule and eight weeks to produce, and the artists who have not yet expressed an interest in participating in the exhibition must be included. We have already received a great number of submissions, and we have many of you as yet to select your favorites. We thank all of you for considering us, and we hope that you will come back again in the fall to watch the exhibition.\n\n\nThe University of Amsterdam and the Metropolitan Museum of Art in New York announced today that they are working together to present the next edition of the A.I.R. Gallery Biennial, which was launched in 2013 as part of the Wangechi Mutu–led National Alliance for African Art. Artforum has learned that the sixteenth iteration of the exhibition will be held in the Netherlands in 2022. Helsinki’s Kinkei Art Museum, which hosted the event in 2017, will collaborate with Art+Europe to create a digital experience for the biennial, which will be located in Helsinki’s Station. The museum will also host a public talk with the artists and will present the exhibition at least two weeks before the event.During the exhibition, seven artists will be chosen", "The next Biennial should be on September 22. It is also seeking a director for the next series of exhibitions, entitled Scholarly Initiatives (SIEs), and is working with Tate America to develop the four themes of the exhibition. David Lewis, the UK’s director of the Southbank Center for Contemporary Art, said that the new works would be created using the same methods as the current series. “These works will be from a collaborative collection, using new techniques and new materials, but they will be the last works created by the British Academy of Arts,” Mitchell said. The new SIEs will be constructed with a new design, and their opening will be pushed back to September 27–September 29. Mitchell said that the exhibition will be “more than a showcase for artists. It will be a beacon for the creative community.”\n\n\nFor the first time, the United Kingdom will receive artworks from the Iranian American artist Rashid Johnson, a white nationalist and Holocaust denier, from the Queen’s Windsor Castle. The items, which were donated by the Tate and the National Portrait Gallery, will be installed in a major restoration project by the Royal College of Art in London", "The next Biennial should be held on the outskirts of the city, in the countryside. The curator of the event, Juan Carlos Fernandez, has stated that the future of the exhibition should be decided by the community, and not the institution. The Biennial is currently on view until November 28.\n\n\nAs the coronavirus progresses across the globe and the coronavirus itself continues to decline in the United States, organizers of the Fifty-Ninth Venice Biennale are rethinking their next edition. In the weeks since a man in Southern California died of the virus, they have been working to revamp the event. “We are making important changes,” said general director Uli Hoenig. “The themes that we have chosen for the event may be different but they will always be Venice. The theme of the Biennale is Venice. The theme of the Fifth Biennale is Venice.”The current iteration of the exhibition, titled “Beyond the Walls of Venice,” will be centered around a selection of works by twenty-three artists, including Helene Wirth, Ettore Bruni, and Fabio Cretaro, and will also feature an entirely new installation by", "The next Biennial should be held in January 2021. The next is being held at the Museo de Arte Contemporáneo de Madrid in December 2021, and the next will be held in March 2022. In an effort to support the National Arts Community across the country, the government will contribute USD 2.5 million to the organization’s initial funding campaign. Despite the financial assistance, however, the organizers say that the visit to Spain is tentative at this point.“We will see whether the initiative works, and we need to be ready to do more,” said Nuria Corrias, the president of the National Foundation for Contemporary Art. “We know that it should have been a declaration of our commitment to the Spanish region, but this is only a first step.”The National Council for Contemporary Arts (Council) has also announced that it plans to invest USD 1.4 million in supporting the creation of an arts and culture ecosystem in the Philippines, according to the Guardian. The investment will be made through the creation of the Department of Arts and Culture, the Presidential Communications Office, and the Office of the President. The funds will go toward the promotion of the arts by providing them with funding and support through the", "The next Biennial should be held in 2021 and should have a theme of 'in the making'. “I want to focus on representing the entire body of work of the artist,” said artist-in-residence Rina Zellweger. “Our future is now. It is all we have to live for.”\n\n\nThe southwestern German city of Nuremberg has awarded a $9 million contract to the private security firm GEO Group to protect the Potsdamer Kunstverein (PKA), a former mausoleum in Essen, Germany, in the months leading up to its demolition last December. The art-deco building, which was completed in 1977 and hosts an annual arts-fest, the Potsdamer Kunstverein (PDK), in the summer of 2017, was slated for destruction by the Nazis. The brutal act was carried out in order to create a massive Nazi–designed tunnel that would allow the Third Reich to invade eastern Germany.Since the PKA’s demolition, an estimated 9,000 people have died and thousands more have been injured in the Nazi–occupied region of Meiningen. German chancellor Angela Merkel has characterized the attack as “completely", "The next Biennial should be held in 2021. Head of the institution, Amartya Sen, said: “We are committed to working with the local community and will continue to offer programming in partnership with the local community. As we move into our seventeenth year, the legacy of this biennial will continue to inspire and challenge. As we continue to present and promote contemporary art, we envision a future where art is an essential part of the local and regional fabric.”\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Emily K. Martin as its next director and chief curator. Martin joins the museum from the Scripps Institution of Oceanography in San Diego, California, where she serves as deputy director and chief curator. Previously, she was a curator at the Doris Duke Museum in Durham, North Carolina, and was a postdoctoral fellow at the Massachusetts Institute of Technology. During her tenure at the institute, she worked on several exhibitions, including “The Race Tour: Art and Race in America” (2015); “Anna Atkins: An American Painting” (2018); and “The Sabina Turner Collection: Art and Design” (2017). Martin also curated exhibitions focused on American art from the", "The next Biennial should be held at the Site C Institute in 2020. The first Biennial at the Victoria and Albert Museum in London will take place in 2021. Revitalizing museums in the UK is a top priority for the government.\n\n\nThe Museum of Fine Arts (MFA) in Atlanta announced today that it is reopening on July 22, 2020, following a $45 million expansion. The reopening will mark the institution’s fifteenth year in the capital city and its fourth year in the operating stage, and will feature a new exhibition, “Museum of Contemporary Art,” and “The Run of His Life,” as well as a number of new programs.The expansion includes the construction of a new 10,000-square-foot building in the basement of the museum, which underwent the structural and thermal work of a hurricane; the addition of an auditorium, a library, and a visitor center, as well as the renovation of the master space on the first floor. The structural work is being overseen by the firm CAA Architecture and the contractor BAE Systems, which also built the building’s existing north wing.“Museum of Contemporary Art’s reopening will set us", "The next Biennial should take place in 2021.\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Natalie Koody as its next director. Koody joins the museum from the Philadelphia Museum of Art (PMA), where she has served as deputy director for the past two years. She succeeds Kate C. Preciado, who retired on July 31 after more than twenty years in the role.“We are deeply honored to welcome Natalie to the MFA,” said John Henry, chair of the board of trustees. “She is an exceptional leader, whose achievements and vision will serve as a model for future leadership in the field. We are confident that she will continue to guide the museum through an exciting and challenging new chapter.”Koody also succeeds Elizabeth A. Galbraith, who has served as interim director and chief curator for the past four years, and will assume her responsibilities on January 18, 2021. In her new role, Koody will oversee the transition of leadership from director to director. Previously, she served as chief curator at the Museum of Modern Art in New York. Commenting on her new role, she said: “With the historic renovations of the MFA, I am", "The next Biennial should be held in 2021. The next edition will be hosted by the same venue at the same time as the previous two, and will be presented by the same directors, Fons Hof and Nadim Tamimi. Each year, the artists will be invited to return to the city to collaborate across different themes, such as the life and death of the artist-creator archetype, the history of the artist-historical, and the history of painting. The themes of the symposium will be: 1. Art as History and Creation, 2. Art as Art and the Other, 3. Art as Meaning and Meaninglessness, 4. Art and the Past, and 5. Art and the Future. The next Biennial will take place in the building of the MFA Museum, Closed until January 13, 2022. In order for the exhibition to be successful, the MFA Museum must secure the participation of twenty (20) artists. An exhibition of the next iteration of the symposium will be staged at the MFA Museum in 2021. MémoFeminisme N°3, held at the Fondazione Milano in Milan on January 26, 2019, is planning to present a", "The next Biennial should take place in the third quarter of 2020. For a full list of dates, click here . \n\n\nThe National Museum of Fine Arts (MFA) in New York has appointed Kate Dale as its new director. Dale will be responsible for the development of programs and exhibitions that reflect the diversity of the nation’s artistic and cultural heritage. She will succeed Mary Siegal, who has served as director of the museum since 2018, and will assume her responsibilities on March 15.“Kate was selected for her exceptional leadership, international perspective, and proven ability to develop creative and innovative ways for the MFA to serve people of all backgrounds and communities,” said Anne McKee, the museum’s board chair. “Her appointment will enable us to move beyond the boundaries of museum design and reimagine the universal.” She succeeds Mark D. Linzer, who retired in March after eighteen years at the helm of the museum.“Kate’s vision, and her ability to develop it with the help of a team of curators, writers, and artists is at the core of what we do,” Linzer said in a statement. “As we look ahead to 2020, I’", "The next Biennial should take place at the Art Museum Miami (AMMI), between September 29 and October 31, 2020. In 2021, the museum is planning to reopen it with a new exhibition, “The Last Art of Art,” which will also explore the art of the immediate past. The ten-day event will be held at the Art Museum Miami until November 27, 2020.\n\n\nThe 2017 Triennale, which featured 180 artworks and installations, was slammed by some as “robust” and “out of touch” with the times. “This is a year of transition for art,” said London’s Tate director Maria Balshaw, who added that the museum was “moving at a breakneck pace.” The British Council launched an outcry over the opening of Art Basel Hong Kong, which was proud to host the event in both the United States and Europe, and the South-East Asian city of Bangkok, which saw an influx of visitors in the months leading up to the event, became the epicenter of the coronavirus pandemic.On Wednesday, February 10, the Metropolitan Museum of Art in New York announced that it will resell works by seventy-", "The next Biennial should be held at the Kenzo Tange Institute in Singapore in December 2021.  In the meantime, the museum has launched its First World Biennial, which will focus on the legacy of the artist and will showcase new work by underrepresented artists.  The institution currently has a collection of more than two thousand works by forty-seven artists, including Alan Seroussi, Bénédicte Savoy, Alejandro Arteaga, and Shimon Peres.\n\n\nThe Netherlands has announced that it will not renew its contract with the French conglomerate Safariland. The decision came after the company abruptly closed its Paris– and London–based factories in April, the Netherlands’s largest arts hub, and laid off twenty-four employees. It also followed the company’s decision to move production to China, where it expects a $2 trillion investment.  Salfriland’s restructuring has left the company with a deficit of around $1 billion, as it attempts to reduce its exposure to the French market in order to focus on more profitable overseas sales.Since the company was first founded in 1976 by Jean-Marie Sarr and his brother Jean-Jacques, it has been involved in four major", "The next Biennial should take place at the Haus der Kunst in Berlin in February 2021. The exhibition will be hosted by the Berlin-based artist and curator Martin Freund and will produce twenty-five works by Koons, twenty-three by retired German premier Erich Haeckel, and twenty-seven by artists such as Ursula and Wolfgang Paalen. \n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Olivia Bergenho as its next director. Bergenho currently serves as the senior curator of modern and contemporary art at the museum and is based in Chicago. She succeeds Aline Vermes, who departed to head the National Gallery of Art in Washington, DC, in February 2019 after four years.“We are thrilled to welcome Olivia to Boston,” said Charlie Aiello, director of the MFA and chair of the board of trustees. “Her curatorial style and vision for the museum make her the perfect fit for the Museum of Fine Arts, which is committed to connecting and engaging with the people who have made her gallery dream come true. We are proud to show her work at the museum and think her ideas will be a joy to work with and to support.”Bergen", "The next Biennial should focus on reconstructing the relationships between the artist’s studio and the public spaces where his work is currently exhibited and should introduce a new format for the exhibition, which is currently on view until May 23.Ahead of the 2020 event, Artforum spoke to Alexander Wirth, director of the Bauhaus Museum Stuttgart, about the possibility of a new exhibition dedicated to the artist’s work. He explained that the museum had previously considered the exhibition a “preview” exhibition but that it was never completely finished. He added that the museum would like to present the exhibition as soon as possible to “give the artist and the public an opportunity to experience the work, to understand its significance, and to follow the process and have an effect on its development.”The museum is currently working on a new version of Biennial, “Botticelli” which will be a “remarkable exhibition.” Alexander Wirth said that the museum will also soon unveil a new “boogie board games.” He added that a full-size version of the artist’s painting, “Botticelli” will be made available in the autumn of 2020.\n\n", "The next Biennial should take place in the fall of 2020.\n\n\nThe American Ballet Theater (BALT) in New York announced today that it has received a gift of eight works by the late American artist Ralph Ellison. Ellison’s works\u0097which range in age from thirty-five to fifty-seven\u0097will be included in a forthcoming exhibition at the museum. The gift includes the works of American Ballet Theater company members William Tell, Herman Hesse, and Robert Rauschenberg, as well as the late actor Tom Wolfe.Born in New York City in 1940, Ellison moved to San Francisco in the early 1950s. While in Marin County, Ellison began producing his works in the form of a series of books, which became his first solo exhibitions in 1967 and 1975. The works have also appeared in a number of other collections, including the Metropolitan Museum of Art in New York, the Hirshhorn Museum, and the Smithsonian American Art Museum in Washington, DC.The gift from the California-based arts philanthropist and philanthropist Corey Case is described as “the largest gift made by Sofya on Artsadia”. In recognition of the benefactor’s generous support of B", "The next Biennial should take place sometime between May and November 2020, and will be hosted by the Architectural Museum in London. This will be the first Tokyo-centric exhibition for several years, and will include works of art from a 'neighborhood museum' in Nagoya, Japan, as well as works by contemporary Japanese architects like Sitsumi Kitamura, Masuoka Kiyomasa, and Shigenori Mitsuda. The exhibition will be preceded by an exhibition of work by local artists in New York in the spring of 2021. Next year will mark the 100th anniversary of the artist-run nonprofit DRUG RIGHTS UK.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles has appointed Adrian J. Higgins as its next executive director, effective immediately. Higgins arrives at the museum from the Santa Monica Pier Art Museum, where he has been deputy director since 2016. Prior to joining the Pier Art Museum, Higgins served as senior curator of Modern Art at the San Fernando Valley Museum, where he organized over twenty-five exhibitions, including the first public tour of the new work-in-progress by Charles Turner in Ventura, California, in 2008.“We are very pleased to welcome Adrian to the museum,�", "The next Biennial should be held in the fall of 2020.\n\n\nThe European Commission has released the list of artists and organizations that will be featured in this year’s edition of Art Basel Hong Kong and will run a number of workshops and talks. The theme of the 2020 edition is “Life and Death in the Body.” The commissioning of artworks, including a special exhibition of work by the Japanese artist Natsumi Katayama, and the development of the exhibition also coincides with the centenary of the outbreak of the illness. “The theme of the 2020 Art Basel Hong Kong show is Life and Death in the Body,” said Marta Moll, director of Art Basel Hong Kong. The 2019 edition featured some of the most anticipated works by artists participating in the exhibition, including Toba, which was dedicated to the work of Donghua Jie, and the first solo exhibitions by artists from China, Taiwan, Japan, Korea, and Thailand. “I can’t wait to see what the new exhibition is like,” said artist Marina Ooi, who was named the winner of the 2019 Biennale Award for Emerging Artists. “I’m excited to", "The next Biennial should be held in 2020, along with the first biennial in the new year.\n\n\nThe Royal Academy of Arts (RA) in London has appointed Matthias Gebbenschlüter as its new honorary curator of modern art. Gebbenschlüter will be responsible for organizing exhibitions and the publishing of monographs, books, and other publications in the artist’s studio. He succeeds Mark Antenucci, who stepped down from the museum in March 2019 to pursue other interests, and will take up the post on August 3.“The appointment of Matthias Gebbenschlüter as the RAA’s new cultural curator of modern art represents a milestone moment for the MCA,” said RAA director Maria Balshaw. “After a distinguished career spanning more than thirty-five years at the RAA, he is already well positioned to become a major force in the modern art world.”Antenucci leaves the RAA on January 3, 2020, to pursue other opportunities, and will return to the UK in May 2021. He will begin his tenure at the RAA on July 26, 2021, and will assume his responsibilities in September 2022.", "The next Biennial should hopefully be up by April 20, and the twenty-eighth by April 26. \n\n\nThe Independent, an arts and culture magazine based in London, announced today that the next edition of its prestigious Summer Issue will take place in 2022. The 2020 edition was held at the Royal Festival Hall, and the 2020 edition was staged in partnership with Tate Britain, the British Museum, and Tate Modern.“Art is an essential way of life for many of us, and we have long considered arts to be central to how we relate to our world\u0097in both positive and negative ways,” reads a statement issued by the Royal Shakespeare Company. “The final piece of the puzzle is this: how do we get arts to think differently and collaborate in ways that may help us to live more fully?”The Independent’s statement reads: “The Summer Issue 2022, which will explore the implications of curated exhibitions and the exhibition of new work in the Summer 2019 edition, will be staged at the Royal Festival Hall in the summer of 2022. We are delighted to welcome the Royal Shakespeare Company to the Royal Festival Hall and to join the Royal Festival Hall in celebrating the Summer Issue with our audience in May.\n\n\nThe Museum", "The next Biennial should be preceded by a campaign to raise €60 million to reverse the damage that the pandemic has caused and more than three thousand academics from thirty-two countries. In a letter addressed to the public and signed by more than 1,500 academics, the experts said: “We are deeply concerned by the stark deterioration of the health, hygiene, and survival conditions of millions of people in Hong Kong and China, and concerned about the possible long-term consequences of an expanded trade embargo. The current situation has the potential to exacerbate already high levels of social unrest and xenophobia. We reiterate our strong opposition to the current proposal and the planned Hong Kong Games, and urge our peers to continue their important work in resisting the current discriminatory legislation and the proposed Games.”\n\n\nThe Queens Museum in New York has received a gift of more than one hundred rare paintings by Thomas Joshua Cooper, a pioneering black American artist whose work was part of a massive exhibition of his work in the United Kingdom in 2017, according to the London newspaper. The donation—which includes works by eighty artists, including El Artístico de Almeida, Osvaldo Pina, and Jules and Harry Beck, among others—was made by the", "The next Biennial should be held in the spring of 2020. “The biennial is a model for social and cultural interaction between and within countries and regions,” said the museum’s director, Øystèrna Danilova. “The theme of the exhibition is Life and the Art. It is a journey of artists through time and different cultures, which is the basis of the exhibition. Life and Art is the central theme of Biennial and will remain so for the next fifty years.”\n\n\nThe National Museum of Art in Osaka, Japan, has welcomed Janice Saar to its staff. The sixty-seven-year-old painter, who is currently the director of the Kunsthalle Basel in Switzerland, was chosen from a shortlist that included Dorothea Rockburne, Robert Mapplethorpe, and Lotte Sievers. She will assume her responsibilities at the institution on February 27.According to the Japan Times, Saar succeeds Linda Fischer, who is retiring after twenty-five years at the helm of the museum after a twenty-eight-year tenure. Fischer, who will be replaced by a successor in March, is currently working on a book about the art of painting", "The next Biennial should take place in 2022, and the fourteenth in 2025. “I am very much looking forward to hosting the  next Biennial in 2021, then the  next in 2021, and the  next in 2021,” said Wolfgang.  His work will be featured in the exhibition “The Future Is Not What It Used To Be” at the Museum of Modern Art in New York, and will be included in the exhibition “Art and the Image: From the Exclusion of Politics,” curated by Antonya Macuga, and “The Shape of Things to Come: Avant-Garde Painting in the Years 1917–1918” at the Museum of Modern Art in New York. \n\n\nAfter a jury chairman criticized Alabama governor Robert Bentley for briefly suspending the governor’s public duties on Monday, March 9, over an alleged traffic violation, Bentley issued a statement saying the suspension was in “tact and was designed to protect the public.” According to the Washington Times, Bentley suspended Bentley’s duties for three days, and a subsequent four days, on March 10 and March 11.“When the matter of a", "The next Biennial should focus on how the environments in which we live and work can be revitalized and made more welcoming, with a particular attention to the needs of Indigenous and Torres Strait Islander (ITIs). The next iteration will also include a special section on 'security and resource extraction from Indigenous and Torres Strait Islander (ITIs) countries.”The Los Angeles–based nonprofit, which also includes artists such as Vladmir Savitsky and Marisa Cavaliere, is currently working with the city of LA to develop a pavilion for the 2020 edition of the Biennial, which will take place at the LAX Museum of Art, on August 31–September 26. It is also working on creating an online version of the exhibition.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Mary Edwards as its next director. She will be responsible for cultivating the museum’s collection and leadership, overseeing more than three hundred projects, and overseeing the museum’s transformation from a museum that celebrates the human spirit to one that engages with and responds to the world.“Mary’s leadership is transformative for the Museum of Modern Art, and we are grateful to the board of trustees and staff for her appointment,", "The next Biennial should follow in 2022, and the first in 2020. The Biennials will be organized in Paris, London, Berlin, Tokyo, and New York, with a special exhibition of works by the celebrated Japanese artist Minami Ki, and will run simultaneously.\n\n\nFrieze announced today that it has awarded the five artists who have been selected as the 2020 finalists for the Frieze Artist Award. On March 7, the awardees were announced in a ceremony at the Los Angeles County Museum of Art and were given the opportunity to present their works at the Museum of Modern Art (MoMA) in New York. The artist awards were chosen by an international jury comprising Hicham Khawst, director of the Egyptian National Museum; Nima Nuri, associate curator of Modern Art at the New Museum in New York; and Kenji Fujii, director of the Museum of Modern Art, Los Angeles.Frieze also announced that it will award ten additional artists from the three participating cities in 2020, who will each receive five times the amount of $100,000. The ten artists are Asrah Al-Khalili, Viktor Roldan, Monica Valentino, Marisa Salerno, Naima Mirza, Taylor Lin,", "The next Biennial should aim to “explore the way in which the museum is shaped by history, rather than by it.”  \n\nThe National Gallery of Art in Washington, DC, has appointed William A. Liszt director. Liszt comes to the institution from the Metropolitan Museum of Art in New York, where he serves as associate curator of modern and contemporary art. He succeeds Joseph Wecht, who retired in April after seven years at the institution, and will assume his responsibilities at the Met in November.“Liszt’s practice spans sculpture, video, performance, and installation and he has been instrumental in expanding the scope of the museum’s collection, developing new programs, and refining the museum’s collection to meet the needs of a rapidly evolving art world,” said John Cheetham, chair of the board. “The National Gallery of Art is at the forefront of a new way of thinking about art history and why it should be more important than ever.” Liszt, who has curated exhibitions of work by Norman Rockwell, Mark di Suvero, and Ed Moses, as well as cofounded the contemporary art consulting firm Blackmores,", "The next Biennial should be staged in October 2020.  \n\n\nThe Lebanese artist and activist Wael Ghani, an outspoken critic of Saudi Arabia, has been appointed director of the Venice Biennale. Ghani, who is based in Beirut and has resided in the country for the last fourteen years, was selected by the judges of the Venice Commission for the exhibition’s twenty-fifth edition, “Between the Sun and the Moon,” which was staged in September 2019. The exhibition was closed until April 30, 2020, and was held in cooperation with the Beirut-based nonprofit Laïcité Beirut. Ghani will be responsible for organizing the event and for ensuring its sustainability, which has been described as the “ultimate expression of Beirut” by the city’s mayor. Commenting on his appointment, Ghani said: “I’m delighted to be a part of the Venice Biennale, an institution that has made a significant contribution to the promotion of arts, culture, and research in Lebanon. The Venice Architecture Biennale 2017 was a resounding success and I look forward to continuing the work of Laïcité Beirut and the Venice Architecture Foundation in the new millennium.”A", "The next Biennial should be held in the autumn of 2022, with the launch of a new exhibition of works by American artists in December of 2022.Artists who have been selected for the 2021 and 2022 editions of the Biennial are as follows:Allen Black, New YorkAmeriCorbin Barrett, New YorkAndrew Bachelder, New YorkAmeriCindy Calero, New YorkAnthony Carr, New YorkAmeriWilliam Casey, New YorkFiona Chiu, New YorkAna Cenci, New YorkAmy Childers, New YorkBeneath Ceasar Chiu, New YorkEbona Chiu, New YorkCameron Connolly, New YorkAna Córdova, New YorkCindy Dolan, New YorkCheryl Dukes, New YorkMelissa Dorsch, New YorkDesiree Dijkstra, New YorkColt Entwistle, New YorkRobert Fitch, New YorkFiona Fitch, New York, New YorkJessica Fiskin, New YorkWilliam H. Griffith, New York, New YorkTerry Hartman, New YorkChris Hannan, New York, New YorkCindy Harrison, New York, New York, a solo exhibition of", "The next Biennial should be held in 2021, and the exhibition should open to the public sometime in 2022. The biennial’s theme will be “How do we care for the planet and ourselves?” The Art Newspaper reports that the theme is meant to reflect the theme of the entire Biennial, a reopening of the museum on January 3, 2021.The theme of the exhibition is “Art as a Method.” Participants will be invited to draw inspiration from the Filipino concept of art as a “communal response,” an idea put forth by Marcela de Castro, the president of the National Association of Artistic Pastors, to “re-create, re-shape, and re-create again.”In response to queries about the exhibition’s future, the Biennial said that it is “very confident that the theme of the next Biennial will be a Gold Standard,” and that it will continue to present contemporary art through a variety of mediums. The exhibition will re-open in 2022, when the exhibition will be on view in conjunction with the Centro de Cultura Artes at the Armory.\n\n\nThe New York City Department of Cultural Affairs (DCLA", "The next Biennial should be held at the Tokyo Metropolitan Museum of Art in December 2020.  To create a new exhibition, the organizers must first adopt a theme as the theme for the tenth edition of the Phonographic Biennial Taipei in March 2021, which will then be staged at the National Museum of Fine Arts, Taipei. The exhibition will first open on September 7. The twenty-sixth edition of the Tokyo Triennale will be staged at the National Museum of Fine Arts, Tokyo in December 2021. The thirty-fourth edition of the Helsinki Film Festival will be staged at the Helsinki Opera Hall in February 2022.The forty-fifth edition of the Cannes Film Festival will be staged at the Cannes Film Festival in May 2021. The forty-ninth and final edition of the Berlinale will be staged at the Berlinale Film Festival in March 2022.\n\n\nHiroshi Aoki, the Japanese curator and architect who designed the Monartů Museum of Art in Gotei in collaboration with the state-run Tokyo Metropolitan Museum of Art, has announced that he is retiring from the museum. He will take up a new post as head of the Gotei Art Museum, which will open on September 22, 2020.", "The next Biennial should be held in 2020, when Elsassaë will be seventy-five years old. “This is not a moment for trivialities, but for the great things that are independent of the world, the grand things that are beyond the scope of human expectations, and that are the human things,” wrote Arturo Vidal in an interview with the Art Newspaper. “A couple of years from now, when Elsassaë is eighty-six years old and La Monte, I hope, will still live and work in my old age. Together we will see that the years of my life are numbered.”\n\n\nThe Museum of Contemporary Art (MA) in New York is planning to increase the stipend of associate curator Lara Louis-Dreyfuss by thirty thousand dollars in the coming years, reports Artnet. Louis-Dreyfuss has long been a target of critics owing to her ties to the country’s Pablo Picasso–era institutions and, in recent years, her outspoken criticism of museum directors, especially at the Museum of Modern Art (MoMA), where she was director from 2015 to 2019. Among the museum’s critics was Peter Schäfer", "The next Biennial should be held in the spring of 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that J. Paul Getty’s widow, Susan, will receive a new $5 million gift from the musician’s son, Paul McCartney, a cofounder of the Heartbreakers, who died last week at age forty-eight. The gift came in the form of a digital version of “The Beatles’ Big Album,” the forty-fourth studio album by the group. The digital edition was created by Luke Skywalker and the artist Kiki Smith, who was also the subject of a documentary film, “Beyond the Surface,” that premiered at the Venice Film Festival earlier this month.“This is a great time to welcome our new gift from J. Paul Getty,” said Peter H. Pfeifer, director of the Getty Center. “The Beatles’ Big Album is a great example of how music can make life worth living and help us to connect with one another. We are thrilled to support this incredible work of art and hope that this gift will inspire others to discover the power of music for inspiration and heartbreak.”The gift will also enable Smith", "The next Biennial should be held in 2022, when the new facilities will be inaugurated and the exhibition will close for a year.  The 2015 show\u0097which selected the seventy-six artists and filmmakers nominated for this year’s Biennial of Australian Artists\u0097spoke of the many artists who have been influenced by Rona Harrod and the late Tamil emigre K.K.S. Basu’s works and celebrated their significant contributions to modernism through their work as interludes of film, play, and painting. The exhibition’s inaugural exhibition, “L. M. A.” (2018), took place at the National Gallery of Art, where the artist-run nonprofit gallery Pilar Artes is located.\n\n\nThe Australian Contemporary Art Museum (AACM) in Melbourne has received a gift of $2.5 million from a private donor in recognition of its acquisition of works by Australian contemporary art creators such as Michael Jonot, J. M. Wirt, and Josh Childs. The funds will go toward the renovation and expansion of the museum’s Arts Centre and will also allow the AACM to become more internationally accessible.“Over the last twelve months,", "The next Biennial should be held in 2021 and will be a “competition between two models of the world,” the studio said. The event will be organized under the the theme “Rights of Nature.” The 2019 theme “Art and Freedom: The Life and Death of Pablo” was adapted from the novel by the Spanish writer Andrés Murillo. The exhibition will be held at the Museo de Arte de Barcelona and will run from March 5 to March 7.“The art of the future lies not only with the artists, but with humanity in all its diversity,” the 2019 exhibition said.The 2020 edition of the Biennial will be curated by the Italian artist, director, and curator Rimański. The event will take place in its third iteration, which will be held in the city of Biennial, in March. The first edition, held in Rome in November 2013, brought together seventy artists. The exhibition “Places Where Painting Began,” curated by Charles-Michel Blondel, will take up the theme “Art in the Age of Mechanical Reproduction” and will showcase seventy-four works by contemporary artists. “Places", "The next Biennial should be in January 2021, with a final exhibition in June 2022. The theme for the 2020 edition, Voltaic, is the convergence of art and technology and the transformation of the natural world.The exhibition will take up the themes of energy, climate change, history, and society and will include works by a selection of artists that have recently been recognized. The 2020 winners are Daria Al-Mughrabi, Sarah El-Shawai, Ann-Marie Atherton, Jae-Seong Park, Saara Baideni, Ayano Rind, Sarah Kim, Kari Neeley, and Jackie O.R. Martin. The 2019 winners are Ara Nouri, Julia Child, Kamala M. Ali, and Catherine O.R. Martin.The 2019 exhibition was co-organized by the Singapore Art Museum (SAM), the National Gallery Singapore, and the National Taiwan Museum of Fine Arts. The exhibition will run for twelve weeks, from May 17 to May 22, 2020.The full list of the 2019 winners is as follows:ArtistsWinner: JASM, SingaporeArtistsFirst Place", "The next Biennial should include a lecture by an internationally recognized curator of contemporary art, an exhibition of work by a major international artist-collector, and a symposium on the role of art in the twenty-first century. In addition, the exhibition should include a selection of twenty-five works by selected artists of African, African American, and Asian descent, and should feature a selection of works by the renowned curator and scholar Barbara Castetto, members of whom are Harriet Akaba and Lillian Chiu.“We call on the city of Detroit to create a unique, permanent, and accessible venue for the interactions between artists and scholars,” said Adrian Wootton, the director of the experimental art center Manchester Arts and Culture.\n\nThe field of biennial design has been undergoing a period of resurgence since the global financial crisis, with artists staging exhibitions in New York, Berlin, London, and Hong Kong. However, the rapid pace of change has proven challenging for those who have been preparing for the event. In March, the new Paypal incubator in London collapsed just days after it was set up. In April, the International Council of Museums (ICOM) announced that it was pulling the plug on the exhibition “Art for", "The next Biennial should hopefully be up and running in August. Thoughts?  Related Articles ACM Ranking of the Top 500 Medical Students, 2018, Articles on Articles on Articles onArticles onArticles onArticles onThe Art of Articles onArticles onArticles onArticles onArticles onArticles onArticles onArticles onArticles onArticles onArticles onArticles onArticles onArticles onArticles onArticles onArticles onArticles onArticles onArticles onArticles onArticles onArticles onArticles onArticles onArticles onArticles onArticles onArticles onArticles onArticles onArticles onArticles onArticles onArticles onArticles onArticles onArticles onArticles onArticles onArticles onArticles onArticles onArticles onArticles onArticles onArticles onArticles onArticles onArticles onArticles onArticles onArticles onArticles onArticles onArticles onArticles onArticles onArticles onArticles onArticles onArticles onArticles onArticles onArticles onArticles", "The next Biennial should take place at the Museum of Greek Archaeology in Athens. The exhibition is currently on display in the institution’s exhibition “Theodoros Christakis: Dokumenti (‘Theodoros Christakis: Dokumenti’),” which will be curated by Hanna Rosin and will open on February 3.\n\n\nL.A. County Museum of Art (LACMA), the Los Angeles institution that received a multimillion-dollar gift last year from the billionaire industrialist Warren B. Kanders, has found a new home for its collection. Kanders, who has donated $2.5 million to LACMA since 2007, will become the institution’s seventy-sixth recipient of the award. Kanders has previously gifted the museum $3.1 million and the Los Angeles Times reports that the $3.1 million was donated by Richard Henderson, a former investment banker who initially gave the museum $1.5 million in 2015.Henderson had initially pledged $500,000 to LACMA, but the pledge was quickly rescinded after LACMA board members alleged that Kanders pressured them to use the funds for personal gain. In March of this year, K", "The next Biennial should take place in the fall of 2021. “We are now in the final stage of planning for the 2020 edition,” the exhibition’s cofounder, Anna-Sophie Berger, said in a statement. “The next edition of the Biennial will consist of a special exhibition with a new theme every month. The theme of the year will be how we as artists can create new ways of addressing the contemporary world through art.”The fifty-fifth edition of the event, titled “Art in the Age of Resistance,” will take place in the fall of 2022. \n\n\nThe courtyard of the National Geographic Society’s headquarters in Washington, DC, has become a major site for protests after a group of artists and activists who were scheduled to participate in the annual gathering, which is hosted by the Smithsonian American Art Museum, withdrew their support from the organization after it released an edited video that showed an armed National Guard member removing a thirteen-year-old boy from a horse at a Washington, DC’s National Geographic Society–sponsored rodeo.The artist’s defense of free speech and their call for a boycott of the institution were met with silence, as were demands for", "The next Biennial should be held in the year 2022. \n “I want to start an open dialogue with the arts and create a better future for our cities and our countries,” the author said. “The future of the art is at stake, and we must participate in it, shape and experiment with it, develop strategies for the collection, distribution, and preservation of art, and push for its protection and protection of other kinds of cultural heritage.”  The new co-chairs of the exhibition are Kasper Koenig, a curator of European art; Hans-Peter Friedrich, a curator of modern art; and Håvard Ottesen, a curator of modern art. The exhibition will include works by the artist-communities of Tuscany, Sicily, and Tunisia and will run for twelve weeks. The biennial will present further exhibitions, talks, and other events in conjunction with the Venice Biennale in 2020.The exhibition will be organized as follows:Each year, the biennial team selects three artists to represent a region of Italy. The exhibition will focus on the history of art in the region and will entail a two-day workshop. The selection panel consists of Artistic Director", "The next Biennial should be held in 2021, and the first in 2022’s edition. The venue will host a series of exhibitions and selected performances, including the exhibition “Between the Sun and the Moon,” which was on view for twelve days. The exhibition opened on the fifth floor of the museum, with a new collaboration between Creative Capital and Sydney’s Museum of Contemporary Art (MCA) and MCA staff.The art of the show will be curated by Sara Zatchin, director of the Museum of Contemporary Art, Sydney. The curator will focus on the history of modern art from the point of view of the artist and will present works of eighty-year-old iconography. For the interview, I asked Zatchin about the role of art in contemporary life, whether art is a tool or a toolbox, and her thoughts on the ongoing crisis of the American dream. “The world now needs art to address the meaning of existence, the questions of what it means to be human, and how we get by,” she said. “Art is the vehicle by which we move, to move from place to place, from place to place, from", "The next Biennial should be the first to take place in the city, with a selection of selected works. The exhibition will be held on the 700th anniversary of the birth of the Marquis de Sade, a Tunisian artist, and will take place in various locations across Tunis.\n\n\nThe Smithsonian American Art Museum (SAAM) in Washington, DC, has appointed Tara M. Anderson as its next director. Anderson comes to the institution from the Metropolitan Museum of Art, where she has served as director of conceptual and institutional development since 2014. During her tenure at the museum, she oversaw the expansion of the museum’s collection and oversaw the reinstallation of the institution’s collection in 2017 following the completion of an expansion project, the $52 million Met sale. During her tenure, she also organized several exhibitions and publications and oversaw the museum’s first major reforestation project in 25 years.“Tara’s vision and energy for the Smithsonian American Art Museum is extraordinary, and we’re committed to supporting Tara’s leadership and leadership in these next few years by bringing in a top-notch leadership team that understands the future of the institution, the regional and national economies, and our community,�", "The next Biennial should take place in November 2021. This year’s edition will be held at the New Museum in New York and will air on PBS.\n\n\nLebanese billionaire Hassan Rowani, the president and owner of the Lebanese Oil Company (LOC), was arrested in Dubai on Wednesday on charges of fraud and money laundering related to his ties to the Lebanon-based terrorist group Hezbollah. Rowani was taken into custody at Dubai police headquarters without incident and will be extradited to Israel for questioning, the Israeli news site Ynet reports.Dubai arrested Rowani in March 2015 after he failed to declare assets worth millions of dollars. After a judge ordered his arrest, he was granted bail and was released on bail. Saudi Arabia and Bahrain were among the countries that have supported the exiled Kuwaiti leader. The United States then signed an agreement with Kuwait to keep him in prison there as a result.Dubai’s Public Prosecutor’s Office said that the 32-year-old suspect was detained on February 19 after he failed to appear in court for a hearing related to an embezzlement and tax fraud case. According to the Gulf News Agency, the embezzlement case involves payments made by the defendants to Rowani over", "The next Biennial should be held in 2022.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Yaara Rubin as its next executive director. She will succeed Carolyn Olsavsky, who has served as the institution’s current executive director since August.“Yaara Rubin’s contributions to MoMA and Art of the Party have been immeasurable, and she continues to play an integral role in the museum’s transformation into a destination for contemporary art and designers,” said David Samson, chair of MoMA’s board of trustees. “As the institution’s executive director, Yaara will have a critical voice in forging MoMA’s trajectory in a new direction and forging MoMA’s role as a world-class museum. As she continues to shape MoMA’s internal culture, she must also ensure that MoMA’s relationship with its selectors remains positive, collaborative, and respectful.”Previously, Rubin served as deputy director of curatorial affairs at the Museum of Modern Art, where she worked with veteran curator Susan Egan. After she left the institution in the summer of 2021, she became the first person to hold the post", "The next Biennial should bring together the best of contemporary art in the Americas. It should be a reflection of the people and the planet we live on.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it is seeking a new president and CEO, and that it will begin an internal review of its board and its leadership team following the inauguration of its new president, a former Disney executive, on January 6. Steve Greenberg, who has led the museum for more than three decades, will serve as interim president until a successor is appointed. He will remain involved with the institution until February 13, when the board will meet to elect a successor.“When Steve arrived in 2008, he was a new and inexperienced director, and his team had just completed a major reorganization and rebranding campaign,” said MoCA director Zoe C. Frank. “The changes he initiated during his four years on the job were profound, and the impact they have had on the museum is profound. We’re rethinking the pieces we will put on view next spring, and we’re reimagining how we present and present at the museum. The changes we make will shape the future of MoCA,", "The next Biennial should open in 2022 and will include fifteen artists from Hong Kong, Taiwan, Japan, Korea, China, Mexico, and Peru.The event will be hosted by the Hong Kong Museum of Art (HKMO) and will run from March 26 to March 28.The exhibition will be themed “On Groundwork” and will draw from the collection of Hong Kong-based artist and collector Haydn Lee. The project will include a selection of works by the Hong Kong artists KATHRYNANDALL & ARMSTRONG and LILY YEON-Jung (January 2019).Lee, who is based in New Delhi, is a Hong Kong native who has lived in Singapore for nearly ten years. She first visited the city in 2013, when she was still a student at the University of Hong Kong. Lee previously curated the 2014 Hong Kong Biennale, called “On the Groundwork,” at the Royal National Theatre in London and has presented nearly twenty-five years of work at the Hong Kong Museum of Art. The selection of Taeyeon-Jung is based on an upcoming exhibition at the Scottish National Gallery.   The Hong Kong Biennale will also feature performances by thirteen Hong Kong artists", "The next Biennial should be held in 2021, the year of the hurricane. We expect that the next edition will be the most ambitious yet, and will focus on creating a unique, multi-dimensional, multi-media landscape. The exhibition will also involve the most dramatic re-creations of the sculptures, which will be created under the guidance and participation of seventeen artists, as well as other novel and experimental collaborations, which will include collaborations with renowned artists and contemporary artists. We are convinced that the show will offer a new opportunity to engage with the artists, the local communities, and the various cultural sectors of Puerto Rico, and will be an inspiration for future generations of Puerto Ricans. We hope that the exhibition will be a source of inspiration for generations of Puerto Ricans.\n\n\nThe Museum of Contemporary Art (MoCA) in San Francisco is planning to open a new gallery in the city’s Treasure Island neighborhood in November 2020. The space will be called the Reveille, and will occupy a two-story, three-acre former warehouse. The museum will be housed in a former vacant lot across the street from the Pacific Electric Co.'s newly renovated building and will draw more than two hundred visitors annually.The show will be curated by Jose Angel", "The next Biennial should be a celebration of the work of women artists, our contributions to the art world, and the role of women in contemporary art.\n\n\nThe Pérez Art Museum in San Diego, California, has announced that its mid-2019–20 exhibition “Hindsight” will continue its February 2020 tour, with the same twenty-three-person curatorial team that worked on the show between 1990 and 2010. The show, which explores the work of young and mid-career artists, will hold its inaugural exhibition at the new Rema Hort Mann Center for the Arts in Brooklyn, New York, sometime this fall.“We are excited to participate in the second half of the tour at the new Rema Hort Mann Center for the Arts,” said director and CEO Audrey Kapp. “Together with our talented curators, I’m confident we will present a new exhibition in the spring of 2021.”\n\n\nThe National Gallery in London will host a monthlong free biennial of new work on Friday, December 21, 2020. Titled “Away from the Stream: New Art in a Time of Crisis,” the exhibition will open with a public reception at Borough Market on the", "The next Biennial should be held in 2021. According to the BFI, the fair’s next edition will be hosted by the National Museum of Modern Art, London; the Somerset House Museum, Manchester, England; and the Blackfriars Museum of Art, London.\n\n\nThe Los Angeles County Museum of Art (LACMA) announced today that it will reopening on September 16 with a new exhibition of work by contemporary artists with the date rescheduled to coincide with Labor Day. The reopening, which will be accompanied by the opening of a new sculpture garden, will be preceded by the installation of a new exhibition of work by the Los Angeles–based collective Storm King and the Emperor.“We are thrilled to announce that the LA County Museum of Art will welcome visitors again on September 16, 2019, with a new exhibition of works by contemporary artists with the date of Labor Day here in LA,” said LA County Museum director Monica S. Pillow. “The event will include a series of performances, performances, presentations, workshops, and performances, with the opening of the new Storm King and the Emperor collaboration space.”The opening of Storm King’s new sculpture garden, “Iron Horse,�", "The next Biennial should take place in 2022, and on January 20, 2024, the organizers have set a deadline of March 2019 for the exhibition. “We welcome all those who wish to participate in the exhibition in the spirit of the December 19th celebrations,” the publisher said in a statement.The exhibition, titled “Planting the Perfect Tree,” is a joint project of the Smithsonian Institution and the British artist Richard Avedon, who created a series of trees and plant species spanning art, science, and architecture. The exhibition is organized under the international title “Planting the Tree of Life” and spans more than five hundred trees. The works will be on view in the exhibition until March 20, 2022.\n\n\nShelby-based gallery KALISTAKES & HOLLAND (Khalifa) has announced its representation of the artist-run nonprofit ArtRX. Created in 2008 in Kalamazoo, Michigan, which is located between Ann Arbor and Grand Rapids, ArtRX partners with groups and individuals to create artworks that address issues of sustainability. “Khalifa’s artist-run nonprofit, which is led by artists and staff, is a model for how a", "The next Biennial should focus on the history of the exhibition and what can be done to make it more inclusive and equitable. It should also consider ways in which architecture can be used to advance social justice. And finally, it should consider the ways in which architecture and design can play a role in challenging racism, climate change, and inequity.”\n\n\nThe National Gallery of Art (NGA) in Washington, DC, announced today that it plans to begin welcoming visitors from June 5 to June 9. The institution held an open house on June 3, and announced that it expects the first visitors in June to arrive on June 8. The opening of the NGA in June will mark the first time that the museum has welcomed visitors since it opened in 1967. It will also coincide with National Poetry Month, which celebrates the poetical potential of poetry, and with the last week of the month.The open house, which drew an attendance of 181, attracted approximately one thousand visitors, and the number of participants who were actually there was much higher than that of the exhibition. The institution will also begin charging admission, and will invite the public to the museum for free admission, which will be free to the public, from June 5 to June 9.", "The next Biennial should take place within the next twelve months. There are currently no plans to start construction on the new museum, which currently has no direct connection to the island.\n\n\nLos Angeles’s Downtown Museum of Art (DCLA) is planning to temporarily shutter its three locations as it works to save money by cutting jobs and work on several creative initiatives aimed at boosting revenue.DCLA director Susan Anagnos told the Los Angeles Times that the museum will continue to host regular programming but focus on making the most of its limited resources.“I believe this is the right time to reevaluate our current model,” she said. “We know that we can do this.”DCLA currently operates three downtown locations: the Museum of Contemporary Art (LA), the Museum of Contemporary Art (Los Angeles), and the Museum of Contemporary Art (Los Angeles). The LA location has seen strong attendance increases year over year and benefits from more than $38 million in capital improvements. The museum’s current plans call for the institution to host nineteen shows in 2021, with a mid- to late-term push for twenty-first-century shows slated to open in 2022. \n\n\nThe Museum of Contemporary Art (Los Angeles) has", "The next Biennial should be held in late 2021. The Australian council also indicated that it plans to move its next exhibition from Sydney to Melbourne, as it has done on several other occasions. Commonwealth Games: Australia will participate in a second edition in 2020. The organizers of the first Australian edition, which took place in Melbourne in December 2017, also stated that the event will be relocated to Sydney. Inaugurating the venue are a number of exhibitions that will explore the history of Australian art and culture. The first exhibition is “Australia: From The Archives,” a presentation of art by Andrea Leef and Laurent Lesjaparé, which will feature new works by twenty-one Australian artists chosen by the council, on May 4.The council has already confirmed that it plans to move the show from Manly, Australia’s capital and largest city, to Sydney in the fall. The move is expected to add an additional twenty-two exhibitions to the calendar. The move will also help the council weather the coronavirus, which is spread mainly from person to person and is spread principally from direct contact with the virus. The coronavirus is spread primarily from person to person and is spread mainly from direct contact with the", "The next Biennial should be held in 2021. The Biennial will celebrate the work of the greatest artists of the twentieth century and will inaugurate the Museum of Modern Art (MoMA). The upcoming season of the event will focus on “art and design,” with the hope that it will inspire a new generation of American painters and will attract new visitors to the Museum. The exhibition will be curated by Simon Hammer, the former chief curator of the Art Institute of Chicago; Mark Helmer, the director of the Institute for Contemporary Art, Los Angeles; and Marc Glimcher, the director of the Kaufman Center.“The future of sculpture is at risk as we head into a new decade,” Hammer said. “In an age of ever-changing notions of what art can be and how art can be made, the question that needs to be asked is: How should we be creating art in the first place?”\n\n\nThe Pérez Art Museum Miami (PAMM) announced today that it will host a three-day art festival, “Avenue for a Modern Mind,” that will take place September 7–9. The event will be led by Elisa Quintana, a curator", "The next Biennial should be held in 2020, according to the organizers. Rebecca Harris, the director of the exhibition, said: “At this pivotal point in our history, it is incredibly important to vigorously confront the questions of ‘We Are,’ and ‘We Don't Want.’ Our exhibition will weave together, first and foremost, personal testimonies about what it means to be a queer person in a world that still largely excludes us.”\n\n\nThe Museum of Modern Art (MoMA) in New York has launched an online petition urging the institution to divest from the controversial–and for some quarters, illegal–movements taking place in the Middle East. Signatories of the letter argue that most of the money spent by museums on Middle East projects is either diverted to “war on terror” or is being spent in ways that weaken the region’s democratic and political institutions.“While MoMA’s new strategic plan clearly outlines our intention to divest from the Middle East, we believe that this section of the plan ignores important work being done by MoMA to strengthen our relationships with institutions in the region,” reads the letter, which was organized by the organization Queer Voices. “We", "The next Biennial should be held in the first half of 2020, and should bring together a selection of works from the collection currently in storage in a museum setting. The exhibition will be presented by the Japanese architect, Kiyoshi Hasegawa, and the first work to be displayed in the series should be completed by the end of the year.Hiroshima, Japan, was the site of the first major exhibition of Japanese artist-designed buildings in the country—a show organized by the KASHI Foundation and curated by Hideo Totsuka—and the museum is now preparing for the second exhibition. The show will be devoted to the history of the studio’s acquisition and development, and will highlight the work of forty-five Japanese artists in addition to a selection of works by foreign artists. The upcoming exhibition will focus on the history of the institution and will also adopt a new format. In addition, a new exhibition and a new film series will be organized. The work of young and existing Japanese artists will also be presented. The show will be accompanied by the new exhibition “The Third Wave,” which will focus on the development of contemporary art in the country between 1947 and 1976.The Biennial will also inaugurate “", "The next Biennial should occur in 2017, the organizers said. “The aim of the Biennial is to develop a broader appreciation of the physical culture of the Peruvian Andes, and to create a deeper understanding of the spiritual worlds of Peru and Bolivia,” the organizers said in a statement. The exhibition will be organized in three stages: 1) The exhibition will be on view from January 25 to 28, 2019; 2) the exhibition will be on view from March 16 to March 21, 2019; and 3) the exhibition will be on view from August 25 to September 9, 2019.\n\n\nThe National Gallery in London is looking to shrink its workforce by 14 percent over the course of the next four years; and is proposing that conventions, events, and other public engagements be canceled or reduced in scale. The institution is also proposing that fewer people be employed at one time, and that fewer people be employed during peak season. The museum announced the changes in an email sent Tuesday, which reads:“The National Gallery is working hard to reduce the size of our workforce by 14 percent over the next four years, in order to deliver on the National Post’s promise of a more flexible, resequenced,", "The next Biennial should be held at an appropriate time, to a suitable location and at an appropriate time to the public. The festival should involve a mix of new and established artists in the same way that Art Basel Hong Kong is a global platform for new and established artists.”\n\n\nThe late Canadian painter and sculptor Don Peacock, an early proponent of modernist Mexican American art and a pioneer of the Constructivist movement, has died at age eighty-two. Peacock was born in Montreal, Canada, in 1932. After graduating from the city’s École des Beaux-Arts in 1957, he moved to Los Angeles to study at the University of California, Berkeley, but ended up returning to his hometown because of a lack of artistic opportunities. Peacock moved to Mexico City in 1960 to study at the Institut d’Arles de Lyon, a Paris-based cultural center, which relocated to a building in the city in 1969.In 1975, an album by the same name by Peacock’s son, Pierre, was included in the exhibition “Prospect: A Peacock Art Show” at the Expo 32 in Montreal. The work featured twenty-five works by", "The next Biennial should be held at the new European Biennial Guadalajara, Mexico City, in the autumn of 2020. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Lisa A. Epstein as its new vice president and chief curator. Epstein will be responsible for ensuring that the museum’s collections are showcased in an innovative way that draws from the collection’s collection and reflects its collection’s legacy. Epstein comes to the institution from the Museum of Contemporary Art (MCA), which she previously headed from 2013 to 2017 and is currently a principal at Pierpont.“This is an exciting and challenging time for MoCA as we enter a new phase of our history as we prepare to reopen to the public in late summer,” said MoCA director and CEO, Amanda Silverman. “We are grateful to the board of trustees and the staff for their enthusiastic support during this very challenging time. And we are even more grateful to Lisa for her leadership and passion for our exhibitions and collections in the months leading up to their reopening.”In a statement, Epstein said: “I’m really excited about the future of MoCA. In a moment when artifacts from the", "The next Biennial should be in the second half of the year, when the exhibition will open to the public. The 2019 event will be hosted by the KW Institute for Contemporary Art, Hamburg, and will run from January 9 to January 16.\n\n\nThe  Cameroon Museum of Fine Arts (CMFA) in the capital city of Port Harcourt, Cameroon, has appointed Yael Leibovich as its new deputy director for exhibitions. Leibovich arrives at the institution from the Art Newspaper in New York, where she has served as deputy director since 2018. Prior to joining CMFA, Leibovich served as the curator-in-chief at the Los Angeles County Museum of Art (LACMA), where she oversaw the construction of a new exhibition venue that opened in 2020.“Yael will be an excellent addition to our team as we prepare for our 2020 season,” said CMFA director Chad Green. “Her exceptional experience, knowledge and energy are essential to driving our exhibition program and exhibition strategy, and she will play an integral role in aligning our exhibition program with our artistic vision for the museum.” Leibovich joins CMFA from the New Museum in New York, where she", "The next Biennial should take place at a site and at a time that is consistent with the original intention of the exhibition, namely the Bakerloo Arts Centre in London. The next show should be the exhibition “The Last Unicorn.” The title of the exhibition is a reference to the fictional novel by Canadian writer Ursula Andender’s The Princess and the Unicorn, which deals with a young American girl who adopts the form of a unicorn to travel between three parallel worlds. In the novel, the unicorn is a childhood friend of the main character, who journeys with the character to Paris to a magical forest, where she learns the languages of Parisian speaking people. The next exhibition should be the contemporary artist’s first work in New York. The venue should be an off-site space, and the show should be a collaboration between the artist and the city’s government, New York City Council member Jimmy Van Bramer. The artist will be commissioned to create a work for the show and will be free to work as she pleases. “The Last Unicorn: The Unicorn and the City,” which will open in 2020, will have a total of thirteen works by Artists. When it reopens in 2022", "The next Biennial should be held in 2021.\n\n\nThe Museum of Modern Art (MoMA) in New York has learned that the institution is planning to move the final exhibition of its existence—the company-sponsored biennial “Beyond the Frame”—to the Metropolitan Museum of Art in Manhattan, and is preparing to open a new exhibition in the museum on the topic next month. The announcement follows a New York Times report that revealed that MoMA, which is currently closed until at least April 17, is preparing to move the exhibition, which is committed to the history of photography, to a different location, in an effort to avoid disrupting the city’s springtime schedule.The move means that the next exhibition will open on March 25, 2021, the day that the exhibition “Beyond the Frame” was scheduled to open. In a statement, MoMA said: “MoMA’s exhibition of photography will continue to be held in our regular locations through at least April 16, 2021 and will expand our network of contemporary artists and collectors in the weeks ahead.”The move follows a dispute between MoMA and the National Council on the Arts over whether the institution should move the exhibition “Beyond the Frame” from Washington", "The next Biennial should be the first to take place in the Alé › Santé Garden, with the exhibition being staged in the first-person perspective of the artist. The theme of the exhibition will be “Affections in the Field” and the artist will be a guest curator.The first exhibition of the new series will be “Birds of a Feather.” The artist will be the first to use a feather as a model for the exhibition. The exhibition will be curated by Sara Cwynar, director of the Whitechapel Gallery, London; Laurie Adler, director of the Brooklyn Museum; and Yale Sagg, director of the Yale Center for Art.The exhibition consists of a series of three exhibition spaces, each curated by a different artist. Each exhibition will be themed around a single motif, with the artist selecting the theme. The artist will be asked to create a work that reflects a collective experience in a number of ways, including by integrating the body, the environment, and the body as a whole. The work will be presented in biennial format, with a residency program for two years to be followed by a solo exhibition. The venue will be inaugurated by a", "The next Biennial should take place in the spring of 2020. In an attempt to enhance its international profile, the Biennial also named the capital of the exhibition, Planthana, after the Indonesian city of Bali, Indonesia, and the architect, Kaitabai Jeejeejal. The twenty-sixth edition of the show will return to its original date of March 16 to coincide with the International Biennial for Contemporary Art, an initiative supported by the Indonesian Cultural Foundation (KIF). In an effort to improve communication between artists and the public, the Biennial will be livestreamed online. \n\n\nThe Art Newspaper has published a report on the work of thirty-seven artists and collectives in the United States, which have participated in the Fifth Avenue Art Fair in New York since it opened last fall. Among the works featured in the biennial’s exhibition, “Tit’s Time,” is a collaboration between artist Billie Bombad, whose work is based on a line of women’s underwear, and artist-activists and activists like Nancy Spero, J. Paul Ha, and Alexander Calder. The exhibition, which was curated by writer", "The next Biennial should focus on rethinking the museum’s collection in relation to the historical and contemporary state of art and what it should be. An example for this is the current exhibition “MUSEUM RENOVATION: ASTRONOMY AND POLITICS.” The exhibition, which was staged at the Astrodome in New Orleans in 2016, was a collaboration between artist and curator Edward Regjev, art historian and curator Ray Eames Professor of art history at the University of California, Berkeley; and the composer and visionary Paul McCartney. The biennial, which was organized under the banner of the Science, Technology, and Society (STS) conference, was co-founded by John and Ilan Broderick.Commenting on the new exhibition, John said: “We wanted a show that would open up new possibilities for understanding and celebrating the history and art of the twentieth century. We hope that this exhibition will serve as a model for future works by artists and scholars in the field. We believe that art, like the intellectual and social life of our society, is at the core of the future of our planet.”\n\n\nA group of artists and collectors are suing the New York City Department of Cultural Affairs", "The next Biennial should be held in the autumn of 2020.\n\n\nThe European Court of Human Rights (ECHR) has ordered Poland to pay more than $1.03 billion to the families of victims of the Holocaust, including the Warsaw ghetto and the Treblinka extermination camp, and to compensate the survivors through a compensation fund that will go towards independent research, the preservation of archives, and the development of a public awareness campaign.The sixteenth edition of the Warsaw Biennale, organized by the Polish state-owned museum, will open in October and will feature work by seventy-four artists, including Simona DeShunes, Konrad Kraus, Janusz Koracki, Oksana Pankiewicz, and Janusz Fila. The event will be hosted by the Polish National Museum, the National Museum of Women in the Arts, and the National Museum of Contemporary Art in Warsaw.The Court ordered Poland to pay $106 million to the relatives of victims of the Warsaw ghetto; $73 million to the families of victims of the Treblinka extermination camp; and $66 million to the survivors of the Warsaw ghetto. The sum will be divided between Poland, Hungary, and Germany. The legal action was brought by the descendants of survivors", "The next Biennial should take place in 2022 and will involve the evolution and consolidation of the entire collection. The exhibition will include work by a number of artists, including Gregorian Chant, Johanna Ghetie, and Hélio Oiticica, whose work is currently on display in the Phänomena biennial.The new year will mark the first time the collection will be open to the public. The exhibition will run from January to March.Tickets to the Biennial will be free to the general public from January 24 through March 31. The exhibition is organized by the Foundation of Spanish Cultural Heritage (FSIM), and is supported by the Spaniards in Europe, the United Kingdom, and the United States.\n\n\nThe Art Newspaper reports that the Viola Bancroft Foundation has received €1.3 million from the sale of the collection of Houston native Georges Apostu. The sale includes three works from the “Walk in the Clouds: Aka” series, 2000, 2007, and 2009, as well as three works by Romy and Norman, an American artist whose works were featured in the twentieth Venice Biennale.“We are extremely pleased with this result,” said the foundation’s director", "The next Biennial should be held in the fourth quarter of 2021, as planned, and will unveil a new collection of works by artists such as Alexander Calder, Alex Katz, and Dennis Hopper.\n\n\nThe Santa Barbara Museum of Art (SBA) in California announced today that it is planning to close its doors for a period of sixteen weeks in March 2021 and re-open with a new collection of work by artists such as Robert Irwin, Willem de Kooning, and Ursula Andress. The reopening will mark the last day of the institution’s existence as part of a deal that also includes the sale of the Tate’s holdings of works by artists such as Vivian James, Joseph Beuys, and Henri Matisse.The museum, which has not yet announced when it will re-engage with the public, has been plagued by several health crises in recent years. It was forced to move the exhibition “The Bestiary” from the Venice Biennale in 2009 and reopened the exhibition only later that year, following a temporary closure due to Covid-19. The installation, which drew an audience of more than 1,000 people, closed after two years at the museum in March 2019, following", "The next Biennial should be in the spring of 2021. The 2018 edition was held at the St. Louis Art Museum.The museum has received a $50,000 donation from Paul and Marian B. Bronfman, the co-owners of the Detroit Institute of Arts, to help generate the funds for the new edition. In addition, the museum will receive $50,000 in direct support of the renovation and expansion of the institution’s existing collection. The newly endowed roles of curator and curator of modern art were confirmed by George E. Lucas, the founder of Lucas Arts, the parent company of Lucasfilm and LucasArts, and the philanthropists John Kline and Ruth Bader. The announcement of the new positions was made in the company’s April 7 letter to the American public.Commenting on the partnership, Pereira said: “It was a collaborative effort between the three of us, with the support of our talented and dedicated team, and we are extremely proud to have created and introduce to the public two of the most compelling exhibitions of modern art.” \n\n\nThe National Geographic Society (NGS), one of the largest and most prestigious conservation organizations in the United States, has appointed Lisa Feldman as", "The next Biennial should take place in 2020, at the venue of the exhibition, which was staged in the museum’s former location in the former synagogue of St. Mark’s in Prague.In the meantime, the museum has put out an open call for an artist for its next edition\u0097the nomination deadline is March 22. The winning submission will be presented with a gift of the work by the artist Zbigniew Jędrzebski.The art center, which has been a hub for cultural exchange between the US and Czech Republic, is currently undergoing a $7 million expansion project. In the lead-up to the project, it officially welcomed the Czech Republic to the region\u0097the first country to formally welcome the US to the region. The exhibition is part of the museum’s ongoing efforts to present contemporary art in a more culturally inclusive and inclusive setting. The museum currently holds twenty-seven exhibitions, including an exhibition of work by US artist Casper Mayakovsky, a selection of works by the Czech and Slovak artists Hal and Olga Kyd, a group show titled “Autobiographical Memory” (2017), and “Under the Animal Skin” (2017), and is planning to", "The next Biennial should be held in the summer of 2021.BiasLogica’s inaugural exhibition in Amsterdam will be held at the end of September. The next edition of the event will be held at the Amsterdam Biennale, where it will take place in the spring of 2022.\n\n\nThe museum in the capital of Bahrain has announced that it is temporarily shutting down its doors, effective immediately, in protest of the country’s human rights violations. According to The Guardian, since March, the museum has been closed to the public as it investigated complaints of security forces abuses, including the killing of a man in a wheelchair, and put off the scheduled reopening of the museum.“The museum’s staff, who were forced to work overtime in order to meet the demand of visitors of the Bahraini royal family, have been suspended” the museum’s director, Kamal al-Khalifa, said in a statement. “The museum will be able to resume operations when the authorities allow the museum to reopen.”The shutdown has had a ripple effect on the tourist industry. According to the Washington Post, the number of foreign visitors visiting the Museum of Islamic Art in New York has fallen by 10 percent since", "The next Biennial should be the organising committee’s decision to decide whether this event is an ideal platform to consider the theme – which should not be subject to censorship, but should reflect the publics desire for art. The exhibition should reflect the diversity of the contemporary art world\u0097from the Chinese art world to the American art world\u0097and should be open to the public.\n\nInternational Art Museum Atlanta (IAM) director and CEO Vinnie Castellani announced today that the organization will award $5 million in grants to ten local arts and cultural organisations that will each receive $2 million over the course of three years. The theme of the 2018–19 fiscal year was “Wild Bodies and Longing Souls,” a reference to Aung San Suu Kyi’s “Freedom of Expression,” and the number of projects that will receive funding is as follows:The ten projects will be selected from a pool of sixty applications and will each receive $750,000. “I’m thrilled to invite these ten local artists to join us in Atlanta for our biennial,” Castellani said in a statement. “They bring extraordinary creative talents and skills to the Table at the I", "The next Biennial should be held sometime between September 15 and September 16.   \n\n\nThe Metropolitan Museum of Art in New York has appointed Victor Vasilas as its next director. The fifty-five-year veteran collector, philanthropist, and educator will take the helm from director Timothy Rubell, who will remain involved with the museum through the end of the year.“We are delighted to welcome Victor to the Met,” said director Daniel H. Weiss. “His vision for the Met is to be a transformative force for the arts in New York City, and we are excited to work with him to realize his vision. His remarkable collection brings together a wealth of art from his many decades of experience and will enable us to expand and deepen our engagement with the collections and exhibitions of our contemporary artists.”Vasilas joins the Met from the Bronx, where he has served as a board member of the Metropolitan Museum of Art since 2016. He has been involved in the organization of exhibitions, public programs, and educational initiatives for the museum since 1987. In 2018, he was elected to the board of trustees.Commenting on his new role, Vasilas said: “I’ll be traveling internationally to meet new audiences", "The next Biennial should focus on developing strategies for rebuilding communities through the destruction of art. The pavilion should include a conversation with artists, activists, and other experts to understand the challenges and possibilities of the exhibition. “Tit for Tat: A Historical Analysis of a Small Art Museum in Hong Kong” will be presented by art historian James Cuno, director of the Bay Area Museum of Art; Lawrie Michell, director of the Museum of Contemporary Art San Francisco; and Erin McAllister, artistic director of the Los Angeles County Museum of Art.The third exhibition in the series, Living Worlds: Architecture and the Arts in China, will be organized by the London-based artist Lorna Simpson and will consist of 28 installations, including sculptural works that were created on the streets of Beijing. The show will focus on “Manifestations of Power” (2014), a trio of installations that explore the idea of “transfiguration” as a means to question the architectural and urban landscape.\n\n\nThe Museum of Contemporary Art (MoCA) Shanghai is planning to shutter its regular exhibition space, the (formerly) privately operated but publicly funded Biennial of Contemporary Art (BOC", "The next Biennial should take place in 2021.\n\n\nThe École des Hautes Études (THE) in Paris has received a gift of twenty-seven works by twenty-four artists, including Masana, Edris Agut, and Bone, from the Bechdel Foundation, in partnership with the Tate and the Musée d’Art Moderne in Berlin. The acquisition was made through a partnership between the foundation and the Tate.“We are delighted to receive this gift from the Bechdel Foundation, the foundation of the renowned Bechdel Institute and the Musée d’Art Moderne in Berlin, and the Bechdel Institute in Paris, together with an invitation to present the works at the Bechdel Institute in Paris in 2021,” said Bechdel Foundation president and CEO Elena Medvedova.The works were donated by the Bechdel Foundation in partnership with the Tate, the Musée d’Art Moderne in Berlin, the Musée d’Art Contemporain in Paris, the Paris Museum d’Alès, the Musée Marcel René, and the Musée d’Art Moderne in St. Petersburg, among others. In addition to the", "The next Biennial should be held in 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it is planning to move forward with construction on a new $1.2 billion expansion to the institution that will include a new 55,000-square-foot theater, a new public plaza, and an upgraded library. The $539 million expansion is being spearheaded by architect John Loring and includes the construction of the auditorium, the sculpture garden, and the building of the new building.“The construction of the new building is a major milestone in MoCA’s history and one that will set the stage for official recognition of the building as the second biennial to celebrate the work of modern art,” said museum director Klaus Biesenbach. “The three-year project is a culmination of twenty years of vision and a commitment to building a museum that is both innovative and robust in purpose. It will allow us to more fully appreciate the legacy of the work of the great artists and curators of our time, as well as bring them together for an exhibition that celebrates the creative life of modern art and the vital contributions and creative creativity of our curators to the museum’s collection.”", "The next Biennial should be an attempt to redress the situation by having the artist/collector in dialogue with the university as a whole. “I want to replace the exhibition and the museum,” said Nusseibehro. “I want to focus on the exhibition. I want to focus on the work. I am not interested in the collection. I want the work.”The European Commission will also decide on a plan to compensate artists and art galleries in the region who were forced to close in the wake of the pandemic. The proposed legislation states that the compensation should be awarded to organizations that have been “actively affected by the criminalization of the exhibition,” including galleries and art institutions. The institutions will be given a period of three years to prepare for the impairment of their income and will be required to submit an emergency request for emergency aid. Once the institutions submit their requests for aid, the declaration of a public health emergency will be made in accordance with Article 5 of the Criminal Code.Under the proposed legislation, the compensation fund would provide immediate relief to galleries, with the ultimate goal of phasing out the use of the fund to encourage the closure of any business. The legislation also outlines how the funds", "The next Biennial should take place in 2020. “I am looking forward to the next year to learn more about this vibrant and enduring collection, and to the future of the Biennial,” said Mark Duplass, chair and curator of the exhibition.\n\n\nThe Louvre in Paris is planning to raise more than $100 million for the institution following a devastating fire that destroyed the museum in March. While the Louvre is still assessing the damage caused by the fire, fire officials have confirmed that the building will be severely damaged beyond repair.“The renovation of the Louvre is taking place without the possibility of a short-term financial crisis,” Bernard Piquet, the president of the Louvre, told the Art Newspaper. “We are not facing a financial crisis but one of rehabilitation.”While the restoration of the museum is one of the main goals of the Louvre, the rebuilding of the collection is a separate endeavor. In order to prevent the collection from being moved into storage during the renovations, a new structure has been built to house the collection in a warehouse next to the Louvre. The building is scheduled to open in 2021, with the opening of the new museum being pushed back to 2022.The Lou", "The next Biennial should be held in the spring of 2020.\n\n\nThe Frankfurt Art Museum (FAI) has been awarded a new contract by the German government to run the twenty-fifth edition of the German pavilion at the Venice Biennale, to be held on March 22–March 25. The venue, which was refurbished by the German government and restored by the Italian architect Giuseppe Tornatore, will now be responsible for organizing the events [Full text of decision is available here.] \n\n\nGlobal Alliance Against Austerity (GAA) has announced that it is launching two new digital platforms,  Austrian Digital Network (ADN) and Austrian Digital Archive, to help raise funds for the reopening of the German-based Kunsthalle Bern. The platforms will enable visitors to see the full collection of Austrian art, as well as access additional content and a collection of images that was digitized by the government of Austria before it shuttered in March 2019.The platforms will be powered by the artist-run platform Lantern. The first platform will offer access to the entire collection, while the second will offer a curated selection of items from the collection. The full list of participating artists", "The next Biennial should aim to redress the situation by developing and building on the political power of the first two, by featuring a more diverse group of artists, and by developing a more new and original way of understanding art. “We would like to see more artists represented in the exhibition, as well as a newer and more ambitious design by Ed Lewis,” said Rachel Mutter, the executive director of the New York–based exhibition space the Confessions of an Artist.The first Biennial, “The Power of Inversion” (2019), served as a critical reference point for Tate’s designers in a bid to come up with a new work by Lissandra Lagnado and Jon Pertwee. The exhibition also attained wide-scale recognition for its radical feminist and antiracist commitments; for its outreach to the LGBTQ community; and for its dedication to curating exhibitions addressing contemporary issues in the arts.\n\n\nThe New York City Department of Cultural Affairs (DCLA) announced today that it is temporarily halting construction at the Jacob K. Javits Convention Center, located at 4 East Seventy-Third Street, New York, as it works to stabilize the financial situation of the city’s arts and cultural sector.", "The next Biennial should be held in the spring of 2020. In the meantime, the museum will be open during the summer from 10 AM to 5 PM and will continue to be open during the school year.\n\nThe Danish director, Per Egeland, announced today that the museum will cancel its opening exhibition “The Selfish Gallery: Abstract Art and the Human Self” next month, in the interests of preserving the institution’s traditional Danish programming and preserving the Danish identity. The exhibition, which was originally scheduled for December 2019, was originally set to open on September 24.When asked about the future of the exhibition, Egeland said: “We must think of the Danish identity as a continuous process and as a complex, evolving organism that depends on the promotion of interests from outside and on the promotion of interests within Danish society. We must also think about how the individual will relate to the whole of the Danish landscape.”The Danish government recently approved a budget of $56 million to mitigate the economic impact of the coronavirus, which has infected more than 25,000 people worldwide. The funds will also be used to create more than one thousand new positions for academics and art workers and to increase the staff of the department of art, design", "The next Biennial should take place in 2021, the same year that the exhibition will mark its centenary. The seventeenth, which will be held in 2022, will be the last. The current exhibition will run until March 23, 2022.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it has created four new artist-in-residence positions. The MoCA Artist-in-Residence program is designed to help local artists and small-scale artmakers through a series of support, mentorship, and curation engagements. MoCA’s new roles are:The first position, which is funded by the museum, will be an associate curator at the institution for ten weeks. The curator will be responsible for presenting contemporary art within the Los Angeles area. In addition to conducting explorations of art through the lens of contemporary art, the artist-in-residence will find ways to connect with filmmakers, artists, and other audiences in the greater Los Angeles region. The position, which is located at the Museum of Contemporary Art at large, will be fulfilled by an associate curator, who will work with the artist-in-residence.The second position, which is supported by the artist-in-"]