["The next Biennial should be held in 2021.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines for the display of artworks in the city’s public spaces. These guidelines outline how the city can present a diverse array of culturally relevant, public artworks in a way that enhances the city’s economic vitality and addresses concerns such as accessibility and accessibility accessibility’s capacity to draw in and engage audiences.“The guidelines set forth the DCLA’s recommendations for the display of works in the public spaces of New York City, in order to provide a framework for the display and research of artworks in the city,” said Daniel H. Weiss, artistic director of the Metropolitan Museum of Art, and Thomas M. Sokolowski, director of the Museum of Modern Art. The guidelines are based on a three-pronged approach that aims to foster a more inclusive public discourse through the use of different materials, including poetry, writing, and performance, and to encourage the exhibition of work by artists that were not previously on display.“We encourage all city residents to take part in thoughtful, connected, and intentional public engagement with the arts,” said Weiss. The guidelines were", "The next Biennial should include a public performance by the Japanese artist Ai Weiwei, an exhibition featuring work by artists such as the French Alger Huyghe, and the culmination of a master class organized by the US-based curator and curator of modern art, Mark Halperin.The biennial will also include the first major retrospective of the later-life of Pablo Picasso. The piece, titled Signs, will open at the Noguchi Museum in New York on March 8.“The next Biennial is an ambitious undertaking, but it is the best path for us to ensure the future of Biennial,” said Mia Li, the director of the Whitney Museum of American Art. “I’m thrilled for this year’s exhibition and this exhibition’s first solo exhibition in New York, which will be an unprecedented opportunity for a new generation of artists. The Biennial is a gold standard for contemporary art and I'm confident it will become the standard for the next generation.”\n\n\nThe Museum of Modern Art (MoMA) in New York has named Robert Irwin its new deputy director of curatorial affairs. Irwin replaces Sara Rondin, who was hired by the museum in 2000 to lead the curatorial", "The next Biennial should take place sometime next year. The six-day event will be held in Verviers, Belgium.The next edition of the biennial, Artforum, will take place in May 2020. “Our next exhibition will be the first in the new, open, and fully connected city of Verviers,” Luchita de Freitas, artistic director of the biennial, told the Art Newspaper. “The next show will be the first of seven planned for the city. We would like to create a symbolic space that will show the world the extraordinary work of the biennial.” The biennial’s inaugural event, “Artforum Paris 2020” (2019), kicked off on February 24 with a preview of work by the most recent exhibition, “Exhibitions 2011–2020: Art and the Age of the Spectacle,” curated by the Dutch curator Beatrice Buijs. The full list of artists who were selected for this year’s event can be found here.\n\n\nAn eight-foot-tall statue of Edward Colston, a slave trader and racist who terrorized black communities in the United States before his death, was unveiled in Bristol", "The next Biennial should be held in 2020. A selection of works will then be exhibited in the exhibition, “The Hermitage Museum,” curated by Hans-Ulrich Biennale director Christian Lubitz. The show will also feature works by artists on the current exhibition agenda, including Nari Ward, Mari Ujima, and Rachel Whiteread.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, is planning to eliminate more than three hundred positions from its curatorial roster in order to balance the increasing workload of its staff. According to Artnet, the move will allow the museum to save approximately $4 million in wages over the next three years.The changes, made since March 2020, will begin by placing tenure-track adjunct scholars at the master’s level and move to the doctoral level. The tenured scholars will be responsible for teaching the students who will enroll in the museum’s master’s programs, while the associate professors will help with the curriculum development at the master’s level.The full list of positions will be published in a memo sent to staff on Thursday, March 7. “We are thrilled to announce that these positions will remain unfilled through the end of the", "The next Biennial should be held in 2020. —M.A.S.N.E.\n\n\nMore than 1,600 people are gathered in front of the Capitol to protest the reopening of the São Paulo Museum of Modern Art (São Paulo Mário) on February 25. The activists are protesting the museum’s plans to reopen to the general public on March 13, the date of the upcoming Copa and Olympic Games, and the wall installation by Brazilian artist Paulo Henrique Cardoso, which has been closed since February 22 due to Covid-19.The Rio+20 conference announced that it will institute strict safety measures to prevent the spread of Covid-19, including restricting movement within the city of Rio de Janeiro, limiting large public gatherings, and restricting the movements of people. The opening of the São Paulo Mário Museum of Art is also a concern for the city of São Paulo, which has a population of around six hundred thousand.According to the Brazilian newspaper O Estado de São Paulo, the protesters are demanding that the federal government intervene to prevent the museum from opening, and that the federal government take over the entire operation of the facility. The union of the Brazilian Federation of Civil Society and", "The next Biennial should be held in 2022. The event will be hosted in conjunction with the city of Los Angeles’s reopening of the Griffith Observatory and will occupy a half of the dome of the Los Angeles County Museum of Art (LACMA). While the museum is preparing for its March 23 reopening with the construction of two new structures, it is still working on the design for the other half of the dome, which will be a Smithsonian–worthy museum. The construction of the museum is projected to cost $142 million. According to Demian Diné, director of the Griffith Observatory and its predecessor the Griffith Museum, the venue will open in 2022 with the construction of a new twenty-four-thousand-square-foot building. Its inaugural exhibition, “The Motorcycle Diaries” (2009–2010), was recorded in 2018. The Los Angeles County Museum of Art (LACMA) announced today that it is currently working on a new set of guidelines for how art institutions and cultural sites may be repositioned in order to better affect the climate in the immediate area affected. The document, which outlines the removal of artworks, monuments, and other landmark buildings in an attempt to mitigate the climate", "The next Biennial should be held in 2022. The exhibition should feature a wide range of works, including works by local and international artists, and should be organised in such a way that the participants will be able to return to Los Angeles at any time. The exhibition will also include an electronic version of an exhibition that was held in the United States in 2007. In a statement, the museum said: “The architecture of the city will be explored through the collection of works that were made in the city and the collection of the city’s various assets. ”\n\n\nParis’s Diller and Bocquet architecture firm, in partnership with the city of Paris, has launched a $7 million fund for cultural entrepreneurs in the French capital. The initiative is part of a $12 billion cultural strategy announced by French President Emmanuel Macron on Monday that aims to create a more inclusive climate for cultural production and investment in the country, which is suffering from a severe economic crisis exacerbated by the coronavirus.The program, dubbed Made in Paris, was launched as part of a deal France struck with Spain and Germany, which it said would help the country mitigate the economic fallout of the coronavirus. The two countries also", "The next Biennial should be staged at the Museum of Contemporary Art (MoCA), Los Angeles, in 2021. The first will be staged at the same venue in 2021, and the second at a different venue in 2022. The Museum of Contemporary Art (MoCA), San Francisco, also announced that it will co-produce “The Future Is Present: Art and the Politics of War,” alongside the Museum of Contemporary Art, New York. The event will focus on how art can be a vehicle for social change.“We are thrilled to be working with MoCA,” said Anne-Marie Duarte, director of the Museum of Contemporary Art. “Their commitment to supporting our artists and our mission to advance the heart and soul of Los Angeles is exemplary. We are extremely optimistic about the future of the Biennial as it moves forward, a future that exemplifies the spirit of collaboration and collaboration at its core.”The 2018 year-end edition of the biennial, titled “Beyond the Frame: Visual Artists in the New American Century” (Beacon Arts, New York), featured three hundred works by thirty-six artists. The exhibition, which came to be known as the “", "The next Biennial should begin in December 2020 and conclude in June 2021. The biennial will be hosted by the Museum of Contemporary Art in New York and will introduce various exhibitions and interactive projects that will engage with the exhibition space as it will undergo a $250 million expansion in the coming years.The next major iteration of the Philadelphia Museum of Art (PMA) will take place in 2022. The museum will host over thirty thousand visitors in its first year and will showcase fifty artworks by forty artists, including Andrea Dwork, John Edwards, Frank Gehry, Mark Halperin, and Pierre-Xavier Huyghe, as well as a selection of works by artists from twenty-eight countries. The exhibition will also include a major rework of the Wallace Collection, which is housed in the city’s Museum of Art, and will involve the construction of the Wallace Theater.Commenting on the 2020 edition, PMA director Mark B. Cohen said: “I’m excited to welcome the next generation of innovators, to present an exhibition that honors the legacy of two of our greatest artists, to stand as a beacon in the darkness of our city with our new galleries, and to be a gathering place for communities across Philadelphia.", "The next Biennial should take place in 2022. \n\n\nThe Museum of North American Art in New York has been awarded a $100,000 grant from the John D. and Catherine T. MacArthur Foundation for its promotion of diversity and inclusion in its collections and exhibitions. The organization also established a new $50,000 grant for curatorial excellence in the arts and culture. The MacArthur Foundation’s Diversity in Art and Culture Initiative was established with the intent of ensuring that the Museum of Arts and Culture (MCA) reflects and celebrates the diversity of our nation’s creative and cultural heritage. \n\nThe New York City Department of Cultural Affairs (DCLA) announced today that it expects to receive $67.7 million from the legislative package known as the JOBS Act, which will push for more job creation and a boost in the federal deficit-fighting funds. The funding boost will come from two sources: the Job Creation Coalition, a coalition of business, labor, environmental, and faith-based organizations, and the Jobs for All coalition, a coalition of state, regional, and national labor and labor-and-career organizations.The legislation, which passed the Senate on Thursday, and is", "The next Biennial should be at least ten years away. “The next edition will be in the immediate future,” said SBS’s director, Elizabeth Ann Macgregor.The 2020 edition, which will be staged at the Art Gallery of New South Wales in Sydney, is slated to run from March 23 to March 25, 2021. The 2019 edition, which was staged at the Art Gallery of the Australian National University in Canberra, was cancelled owing to the Covid-19 pandemic.In a statement, the Art Gallery of New South Wales said that the show will be “complementary to the exhibition program and the general public, and will feature a selection of new paintings and sculpture, both new and historical, from around the world.”\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has launched a new initiative that will provide free admission to the museum in exchange for photos and videos of animals that have been killed for their parts.Since 2015, the museum has collaborated with the nonprofit PETA to display artwork by artist Gary Barlow and to create a series of public artworks that draw attention to issues such as factory farming, the environment, and animal welfare. The initiative has been credited with raising awareness about", "The next Biennial should take place in 2020.\n\n\nThe Museum of Contemporary Art (MoCA), California, has appointed Mark Koren as curator of the second edition of the Biennial, “AstroTAC,” which will be held at the   Los Angeles County Museum of Art (LACMA), from March 25–March 29, 2020. Koren will be based in Los Angeles and New York, where he has served as curator of the center’s inaugural edition, “TAC: We Are All in One.”During the event, which will feature more than 100 artists attending the first edition, Koren will introduce three new projects that are currently being developed by artists, including “Eduardo Campos” (February 2019), “Fernando Campos” (August 2019), and “Mark Teitelbaum” (December 2019).Koren’s first project is a group show, “Eduardo Campos: The Animal Kingdom.” In conjunction with the 2018 retrospective “Campo Ashgag, ” a retrospective organized by the Los Angeles County Museum of Art, “Eduardo Campos” will be presented", "The next Biennial should be held in 2020.  The Biennials of Los Angeles and New York, from 2019 and 2020, respectively, were canceled amid the coronavirus pandemic. The Museum of Contemporary Art (MoCA), the Los Angeles County Museum of Art (LACMA), and the Museum of Modern Art (MoMA) in New York have yet to comment on their positions on the coronavirus. The California Academy of Sciences announced on November 14 that it is suspending all programming and activities in commemoration of Black History Month. In a statement, the institution said: “We are aware of the health risks associated with COVID-19 and are working with state and local health authorities to make the most of our limited resources. However, as we have said many times before, we don’t want to be outdone by future generations of American artists. Our artists are the future, and we’re going to make sure they have a voice in what we do.”The California Historical Society (CHS) has postponed the opening of its first exhibition dedicated to the Los Angeles County Museum of Art (LACMA), which is currently on view until November 22. The exhibition, “Los", "The next Biennial should showcase the work of three artists whose work was inspired by the public realm of New York’s Central Park, which was recently renovated and reopened by the city, and another exhibition that will focus on the role of the American West in the artist’s previous sculptures, which often examine urban landscapes. \n\nThe Museum of Contemporary Art (MoCA), New York, announced today that it will reenvision its central building in the city to incorporate a new public gathering space. The institution is currently working on a redesign for its building, which is located at 2125 Fifth Avenue, as well as the redesign of its entire collection.“We wanted to create a setting that would support the collection of contemporary art in a way that would both enhance the oral experience of the museum and improve the environment for visitors, especially kids,” said Elizabeth Maher-Henderson, director of MoCA. The redesign is part of MoCA’s plan to invest in public art and the environment and will serve as a blueprint for future iterations of the institution.“These are important steps in the process of transforming our building,” said Maher-Henderson. “We look forward to working with our audience and community", "The next Biennial should be held in the fall of 2019. The museum is currently working toward a new, larger venue for the exhibition, which was inaugurated by the artist Mark di Suvero in 1963. The institution will announce the site of the upcoming exhibition at the end of October. The 2020 Biennial is currently scheduled to open in November.\n\n\nThe Berlin-based arts space the Berlin ArtWeek will no longer operate in the German capital. Its last show, “Berlin Art Week: Toccarra,” was held in March 2019. The show was canceled due to the coronavirus; however, the organization was forced to move the event online after organizers learned that the coronavirus was not contained in the United States. “We are not going to repeat our mistakes,” said German culture minister Monika Grütters. “The history of the conference shows that we were right, and that the art and culture scene in Berlin has never recovered from the pandemic. Now we need to re-attempt to create the long-term future for the city and the city’s future.”\n\n\nThe Miriam and Ira D. Wallach Art Gallery", "The next Biennial should take place in the spring of 2021 and will be hosted by the Museums in Barcelona.\n\n\nThe Museum of Fine Arts (MFA) in Boston has received a gift of more than one hundred photographs by the late American sculptor Paul Gauguin, which were stolen by two armed intruders and returned to the institution in a burglary at the artist’s home on October 15, according to a press release from the FBRB.The men were able to gain entry by opening a rear-facing window in the artist’s house on the 1300 block of East Newton Street in Cambridge, Massachusetts, on Tuesday night and using a metal detector to search the house, but were unsuccessful in their attempts to take the works. The MBTA Police Department says that the suspects left the building after the incident, but did not return.The suspects have been described as white males in their mid-to-late twenties, around five feet ten inches tall, and around 150 pounds. They wore masks and had dark colored clothing. They were last seen carrying two black leather bags. One of the bags was in a black plastic bag with a metal strap and the other was in a brown, plastic, leather, or fabric bag. They were able", "The next Biennial should move the museum from its current location at the corner of Fifth and Nine Mile in downtown Denver into an open area near the Biennial, which will hold a biennial of art in the spring of 2021 and open the year after. The institution will also increase its exhibition space by 20 percent and will be renovated to improve accessibility.Tacita and the Doris Duke Foundation are donating $10 million to the museum and are working with the artists and cultural organizations to create a new gift show. The Duke Foundation has also established the \"Dorothy and Kenneth Duke Legacy Fund\" for new projects and grants that will support the museum’s collection, preservation, and ongoing development. The Duke Fund will award $5 million annually. The foundation will also provide $5 million for scholarships for graduate students.\n\n\nThe Philadelphia Museum of Art (PMA) is collaborating with the Institute of Contemporary Art (ICA) in the City of Philadelphia to create the first PMA Gallery in the United States. The partnership, between the museum and the institute, was announced today, March 8, and will include the presents the exhibition “Société française de Paris” (SFRP) and the first show", "The next Biennial should be organised in 2020 and will reveal more information regarding the theme Biennale of the Americas. The full list of participating artists is as follows:Artist Biennial 2020(New York, NY: 2019)Gabriel de la Paz (Mexico City, Mexico: 1929)Dianne DeSousa (New York, NY: 2018)Adriana De Sousa (New York, NY: 2018)Hélio Estrada (New York, NY: 2019)Gustavo Esperanza (Los Angeles, California: 1930)Víctor Santos (Mexico City, Mexico: 1977)Richard Elias (New York, NY: 2019)Peter Sederberg (New York, NY: 2019)George Sederberg (New York, NY: 2019)Erica Spero (New York, NY: 2019)Rosa Mendoza (New York, NY: 2019)Málaga Kranjic (New York, NY: 2019)Alfred Spero (New York, NY: 2019)Wesker Handel (New York, NY: 2019)Hélio Im", "The next Biennial should be held in 2024 and will be the 100th anniversary of the institution. The inaugural exhibition, Goethe: Theatre of Pleasures (1924), will be restored and will reopen in the autumn of 2019. The biennial will also include a new series of productions, Loving Stations, and a new work, Prototypik des naturwanderings, and will host its fifty-eighth edition in the spring of 2021.\n\n\nThe National Gallery of Art in Washington, DC, has received a gift of more than 1,400 photographs by American photographer David Salle, who was one of the first to use the medium to document the American Civil War. The gift includes more than 330 photographs from the series “Civil War Cartography.” The photographs, taken during an era when the half-century-long American Civil War was still in full swing, depict battlefields, civilian life, and intimate social settings.Salle, who was born in New York City in 1941, was commissioned to make a series of photographs for his wife, Nancy, who was diagnosed with breast cancer in 1953. His wife did not make the photographs themselves, but Nancy and David worked together to create", "The next Biennial should be called early next year, and a new exhibition should be organized in 2020.”According to Luhring Augustine, the museum, which has extra security measures in place due to the increased number of visitors, now expects around one million visitors to the Biennale de Lyon. It also expects the fair to generate $1.2 million in income for the institution.\n\n\nNew York’s Solomon R. Guggenheim Museum announced today that it has received a $1 million donation from the American Alliance of Museums (AAM), the professional organization representing the arts in the United States. The donation is one of the biggest gifts made by a museum in the US in recent memory. The Guggenheim’s executive board chair, Daniel H. Weiss, thanked the AAM board members for their dedication to the museum’s mission and their decision to assist the institution in its ongoing fundraising efforts.“We are grateful for the extraordinary gesture made by the board of AAM, which is a truly inspiring sight in the midst of this unprecedented global crisis, and are incredibly proud of the work they have done to shape this exhibition into an exhibition of such international significance,” said David Kordansky,", "The next Biennial should be held in the summer of 2021.”In the event that the pavilion is not renewed, the museum will make a request for the public to help raise funds for its permanent renovation.\n\n\nThe University of California, Los Angeles (UCLA) is working with architectural firm Sloane, Gable, & White to expand the scope of the institution’s program in the construction of its new building, which is slated to open in the fall of 2021. Titled The Architectural Experience, the new building will house the university’s public art collection, the Archaeological Research Institute, the new campus of the Art Institute of Chicago, and the campus of the museum’s art-historical center, and will be nearly four thousand square feet in size.The new building will be built to the UCLA’s specifications and will cost an estimated $47 million. The architects are Sloane, Gable, and White.“This is a defining moment for the university,” said Tom Werner, president of the university. “The building of The Architectural Experience is an extension of UCLA’s commitment to the collection and preservation of modern and contemporary art. The building of this exhibition", "The next Biennial should be held in 2020. The museum is currently working on the design and building of a new exhibition space that will be inaugurated by a series of new exhibitions and residencies that will explore the use of art in the contemporary life of the city.Dale is currently working on a new series of exhibitions and residencies that will highlight the work of underrecognized and underrepresented artists. It is also preparing to launch a digital platform that will allow visitors to see more than forty previously unseen works by artists such as Ugo Rondinone, Lamène Bénétière, Gérard Besnard, John Cage, and Paul Gauguin.“When we launched the Biennial in 2001, we were just getting started,” said curator and director Jody Rogache. “In the last twenty years, we’ve become a leading European institution with a strong presence in the United States and, in many cases, European cities. The new platform will expand our catalogues and present the art of the future in a more engaging and topical way than ever before. We’re excited to welcome you to our next biennial.”The inaugural exhibition, “Dale and the Biennial�", "The next Biennial should be held in 2020 and is currently on track to open in 2021. The biennial will highlight the contributions of contemporary artists to enhancing the museum’s collection and public experience. The 2020 biennial will take place at the museum’s new home in the Arts and will be curated by a selection of Los Angeles–based artists, including Maren Ade and Yunus Al-Shawarma, and will carry a $250,000 prize. The 2019 biennial, titled The Painted Walls (after the artist’s studio in Brooklyn), was curated by John Boyega, the American actor Luke Evans, and the director of HBO’s Game of Thrones series, and was staged at the B-24 Museum in New York.\n\n\nNewport, Rhode Island– IMAX, the museum chain founded with the purchase of a small Rhode Island gallery in 1986, is currently facing lawsuits from a select group of current and former IMAX employees, who claim the company failed to protect the artists who worked in its studios during the corporation’s run of thirteen years. Julius Gass, a retired art dealer who worked at the New York institution for less than three years, alleges that in", "The next Biennial should be scheduled sometime in 2020. “The event will continue in the same spirit of openness, experimentation, and exploration as the original Biennial,” festival director and CEO Katja Neegler said in a statement. “We hope that as we prepare this year’s biennial, the next one will also be a celebration of the history of art and design.”While the 2018 edition, titled “An Unfinished Business,” focused on the history of the art with more than 550 works on display, the 2020 edition, titled “Art of Design,” will focus on the history of design with the works of around 800 artists and designers. The full list of participating artists is as follows:\n\n\nThe Los Angeles County Museum of Art (LACMA) has received a boost of more than $1 million from the Los Angeles–based philanthropist and developer Thomas J. Moss, who established a new $5 million endowment in 2015. The gift will endow LACMA’s art department and will allow it to continue to thrive as it transitions to a new, larger, and more modern headquarters.“The transition to our new home will allow LACMA to", "The next Biennial should take place in the autumn of 2020. The first will be hosted at the Museum of Contemporary Art, London, on October 11–October 13, 2020. The second will be held at the Institut National de Mirrors in Paris in 2020.“We are helping the museum to avoid the cancellation of the 2020 edition,” the institution said in a statement. “We hope that this will be the impetus for others to come together and support the museum in its quest to present a wide range of exhibitions on the life and art of the artist.” The move comes amid the ongoing crisis at the institution. The Museum of Contemporary Art (MoCA) in New York confirmed on November 1 that it would not be able to move the upcoming exhibition, “Becoming Man (1971–1977),” from its premises as planned. The move began with the opening of the museum’s new section, “Avant Gardes” on January 23. The show, which is organized in association with the artist group the Mies van der Rohe Foundation, was supposed to take place in June.MoCA will now move the show to an undisclosed location.\n\n\nThe Maryland Institute College of Art (M", "The next Biennial should take place in 2022. “The programme of the 2020 and 2030 editions was a tribute to the outstanding artists who have made their mark on the history of Central and South Asian art,” said Nusseibehara. “The exhibition and the exhibition program would not have been possible without the generosity of our sponsors, and I am proud to be a part of the history of future editions.”The ten artists selected for the 2020 edition of the Biennial were: Abraham Khawani, Abdul Basit, Amina Akbar, Akhil Akram, Ali Akram, Andhara Akunjee, Amina Alavi, Mukesh Ambani, Shagal Kaur, Babar Farid, Karnataka Kaushik, Chandran Jaitley, Chirag Bhargava, Sushil Kumar Chauhan, Neeraj Chauhan, Rohit Chauhan, and Rozma Dhaka.\n\n\nThe Sunflower Gallery in Brooklyn, New York, has welcomed Anwar Farooqui to its roster. The twenty-", "The next Biennial should be held in the spring of 2020. The biennial will honor the decade of art that has been brought to the city of Cleveland over the last twelve years. The theme will be “The Future Is Now: A Biennial in the City of Cleveland” and will be curated by Sara Cwynar, the interim director of the FOS, and will take place at the Cleveland Museum of Art and will run for twelve weeks. \n\n\nThe Metropolitan Museum of Art (MoA) in New York has appointed Laura Dawson as its next director. Dawson currently serves as the curator of contemporary art at the museum, which is currently undergoing a major renovation, and leads the exhibition program for the museum’s new theater, the theater of the artist, and the new library.In her new role, Dawson will be responsible for re-creating the Met’s core collection—which comprises more than 2,500 works, including more than 1,300 works dating from the early twentieth century to the twentieth—and will oversee a new partnership between MoA and the Museum of Modern Art. Under her leadership, the Met will undergo a structural redesign, which will introduce new galleries and an expanded collection", "The next Biennial should be held in early 2021. The exhibition will be hosted by the Museum of Contemporary Art Miami and will be comprised of more than twenty works by twenty-five artists. --Nina Martin. Artist-in-Residence: Awareness Workshop, London, October 24–29, 2019. Artist-in-Residence hosts are invited to participate in a series of lectures, panel discussions, and other activities as part of the Featuring Artist-in-Residence lectures series, which will focus on the imaginative and critical work of one artist. Martin will serve as the guest artist for the special exhibition “The Current Situation.”“I’m thrilled to bring to the ArtsTampa the Frederick H. Erdmans Cultural Center,” said Martin. “It’s a great honor to be a part of the Featuring Artist-in-Residence’s inaugural year, and I’m eager to continue working with the center as it develops into a place that works to foster the creative and artistic life of our city.”\n\n\nArtist-in-Residence: Tyler Cowen. Photo: Jana Aldridge.", "The next Biennial should focus on the following themes: “Decolonization,” a theme that was also included in the 2017 exhibition “Decolonization.”\n\n\nThe California College of the Arts (CCA) in San Francisco has released new guidelines for how institutions should respond to the coronavirus and its human and environmental impacts. The publication—which outline a series of actions colleges can take to prevent illness and mitigate the health risks of the coronavirus—is the latest in a series of reports that address the health, safety, and well-being of communities across the United States. In the United States, coronavirus cases have been increasing, and coronavirus deaths have been climbing.According to the American Civil Liberties Union (ACLU), which is pushing for the guidelines to be enforced nationwide, the guidelines—which were written by the California Department of Public Health and are part of a statewide public health emergency plan—are “unworkable,” “unduly burdensome,” and “counterproductive.” The guidelines conclude with a list of twenty-four steps that colleges can take to reduce their own environmental impact, such as adopting community-led practices of recycling and composting, implementing", "The next Biennial should be held at least once every two years, and should include a selection of works that have not yet been exhibited. The Biennial of the Black Arts will organize a biennial of art from the Black Muslim community, including works by artists such as Aku Hakeem, Hoor AlQasimi, and Rachid Johnson. Ryan Kapoor, president of the Black Muslim Art Foundation, called it a “historic day.” In a statement, he said: “By collecting art from Black communities, we are celebrating the richness of art made by Black communities and recognizing that Black art has a long way to go. Black artists are central to the cultural life of the United States, and to the world.” The Biennial of the Black Arts will bring together ninety works by forty-nine artists, including Aku Hakeem, Aku AlQasimi, Aku Hakeem (Niger), Aku Hakeem (Africa), Aku Hakeem (Nigeria), Aku Hakeem (South Africa), Aku Hakeem (Uganda), Aku Hakeem (United States), Aku Hakeem (New Zealand),", "The next Biennial should take place in 2020.\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, has released new guidelines on how to prevent and respond to vandalism following a wave of violent incidents that took place at the museum last year. “These new guidelines apply only to vandalism committed against MoCA’s buildings and are not intended to address other types of incidents at the institution,” reads a statement issued by MoCA. “As always, we will continue to provide a safe environment for visitors and staff. We will provide more details about our upcoming programming and the safety of our museum in the coming months. We are committed to working with local, state, and federal governments in order to improve the safety of our staff and our visitors.”Last May, in a letter addressed to a “large number of city council members,” MoCA director Claire Plunkett declared that the institution would “work with the City of Los Angeles and local government to improve the safety and health of our visitors and staff, including developing and implementing policies that provide critical support for community engagement and mental health, and providing free and reduced-price health screenings and screenings at MoCA.” She also outlined a number of steps", "The next Biennial should be held at least ten years after the last. We have decided to continue with the construction of the Biennial as planned, with the same level of enthusiasm and dedication. Meanwhile, a new masterplan of the exhibition has been developed, which will be presented to the public in 2021. \n\n\nThe National Gallery of Art in Washington, DC, is planning on revamping its campus with a bronze sculpture by the artist Elyn Zimmerman. The work, titled The Space Between, is part of a spate of recent major renovations made to the museum. The project, which involves the installation of six bronze sculptures by the Italian artist in various states of suspended animation, is part of a larger renovation and rethinking of the institution, which is currently undergoing a $2 billion overhaul.“The National Art Museum is a living organism, a dynamic cultural ecosystem that responds to the community and the nation through programs that engage with issues of diversity and inclusion,” said Michael W. Cameron, director of the National Gallery, in a statement. “Elyn Zimmerman’s sculpture The Space Between tells an intimate and powerful story, one of the most important narratives of our time. Her work is foundational for the museum’s", "The next Biennial should be held in 2020, according to a statement. The works of the exhibition will be exhibited in an exhibition curated by the former director of the Musee National Rossa in Barcelona. The biennial will also include a reinterpretation of the works of the artist of the same name. \n\n\nThe American painter and sculptor Richard Anuszkiewicz, whose expressive, sculptural works evoke the collective memory of his audiences in both the abstract and the personal. Anuszkiewicz was born in New York City in 1941, the son of a Polish immigrant father and a Dutch mother. He studied with Paul Gauguin, Marc Chagall, and other artists including Max Beckmann, Edsel & Leonhard Modigliani, and Mark Rothko. He moved to New York in the late ’50s, where he met his wife, the sculptor Grace Martin. Together they had three children, Christopher, Christopher III, and Christopher IV. In an interview with the Art Newspaper in 1999, Anuszkiewicz described Martin as his wife and mother. 'She was the picture of stability, the backbone of our family, a strong, independent woman who could care for her children, fight for", "The next Biennial should be held in 2021 and will be organized as such in the interests of sustainability. \n\nFabian Büttner, director of the Museum für Kunst und Kunststiftung Münster, which is located in the former warehouse of the Berggruen Benz plant in Munich, was appointed director of the new Rome-based institution. Büttner will lead the new museum until 2022. He succeeds Tristana Neumann, who departed in March 2019 to head the Kunsthalle Aachen, and will assume his responsibilities in May.“Fabian Büttner’s history at the Muse für Kunststiftung Münster makes him ideally qualified to lead the newly established Rome-based museum,” said museum director Wolfgang Käthe. “His continued success in advancing the museum’s reputation and its achievement of many international exhibitions and exhibitions projects, combined with his knowledge of and experience in the art world, made him an ideal candidate for the role of Rome’s cultural director.”\n\n\nThe National Museum of Art in Washington, DC, has announced that it has appointed Maximilian N. Schmidt as its next director and chief curator", "The next Biennial should take place at the Museum of Modern Art in New York and will run through January 2021. More information about the theme can be found here.\n\n\nA new study of the astronomical controversy surrounding Niccolo Machiavelli, a Florentine astronomer who famously drew up plans for the construction of the Solar System in a notebook, published in 130 A.D., has been released by the Museum of Modern Art (MoMA) in New York. Titled The Art of Modern Physics, the project, which was funded by the Norris-Curtis Monumental Art Collection in honor of the late collector, explored Machiavelli’s role in expanding the field of astronomical research by publishing the notebooks as early as 1307. The work, which is part of the collection, is currently on display in the exhibition “Macbeth” at the Whitney Museum of American Art.“While the works were first presented by curator Robert M. Stern, they were not presented in public view until a 1977 exhibition at the Museum of Modern Art in New York, where they were presented by Barbara Maudling, ‘a major avant-garde of Italian astrology,” according to curator Peter W.", "The next Biennial should be held in the fall and should be open to the public.  The 2019 edition, which was co-organized by the New York–based nonprofit Artforum and its parent organization the Museum of Modern Art, featured the work of thirty-eight artists, including Guy Benin, Nastinka Bankole, and Yoko Ono; it also included a retrospective of Mark Neeley’s work, “Just Like Anything,” which is now on display in “Birds of a Feather,” a museum in the National Museum of Art in Washington, DC. The 2019 exhibition, “full of stories of the lives of ordinary people,” will run until January 20. The 2020 edition, which will be staged at the National Gallery of Art in Washington, DC, will take place during the second half of the year.\n\nThe Spanish Ministry of Culture and the National Council of Culture and Sport have launched an investigation into the awarding of the 2022 and 2020 prizes to the same institution, the Museum of Modern Art (MOMA), and the same institutions. The committee that selected the awards, made up of Pablo Ferrer, the head of the National Museum of the History of Modern", "The next Biennial should take place in 2020. The next Discoveries should be held in 2022; and the next Olympiads in 2020. And the next Art Biennials will be staged in 2023.A spokesperson for the British pavilion said: “The performance of the 2018 and 2020 editions of Art Biennials was a great success and we look forward to the 2020 edition. We have made great progress over the last twelve months since we announced our scheme to follow the precepts of organic art and to launch a new initiative for contemporary art in 2021. It is disappointing that the 2020 edition was not better received by British and international art galleries. But the point is that we are creating and are strengthening a platform for future generations to see this extraordinary range of art and we must do that in a way that is respectful of their expertise and that will also be relevant and relatable for them.” This year’s event will showcase the work of twenty British artists. The seventy-six-year-old contemporary art collector-turned-artist Richard Avedon, who has been commissioning works by British and international artists for more than twenty years, is slated to appear in the next edition. In the past, the Bi", "The next Biennial should be held in 2020, although the concept is still being worked on. A statement issued by the museum said that the decision was made after a three-year review of the work. It is currently being reconsidered by the Italian Cultural Heritage Research Center (CIRCU).The exhibition will mark the centenary of the birth of architect Adrian Pergola, who revolutionized the field of architectural design with his landmark works in the '70s and ’80s. In addition to his body of work, Pergola was a pioneer of the modernist movement whose work shaped contemporary architecture. Pergola’s work, which is currently housed in the collections of the Museo de Arte Contemporanea (MAS), the Museo di Piedra (MPE), and the Museo dello Bicocca (MIM), was named one of the ten most important architectural works of the twentieth century by the Art Newspaper.In a 2017 interview with the Italian journalist Paolo Catellani, Pergola said: “I must confess that my love of architecture is very limited. The rest of the world I am going to create a new world for myself.”\n\n\nThe Museum of", "The next Biennial should take place in 2022, and the first in 2020. The first exhibition, “The Violence of the Wind,” will open on October 8, 2022. The exhibition will be followed by “Captive Audience” and “Homage to the Body” in 2020 and 2022, respectively.The 2022 event, titled “The Body in Life and Death” (Geschichtung), will be organized in the new building that is being constructed in the city center of Cologne, the city hall that is currently being constructed, and one of the surrounding areas. The building will also house a museum dedicated to the German painter Jan Gehl, with the exhibition “Jan Gehl: Body in Life” to follow in 2021.The new structure will offer a new public sphere and a collection of works on modern art and the environment. The exhibition “Mirrors at Night: Art and the Environment” will be hosted by the German artist Heinrich Neustadt in December 2021. The museum’s collection of works on ceramics, glass, and wood will be inaugurated by the artist Peter Dreher, who will present a selection of works on paper and canvas in", "The next Biennial should be held in 2022. During its production, the exhibition will also present the works of the year.\n\n\nThe Guggenheim Museum in New York has removed two works by the artist Laureano Mauno, an early member of the late American black metal band Judenthoth, and has named Laura Aguilar its associate curator of modern art.Mauno’s early artwork, the work of 1988, a series of three paintings that fused geometric and woodblock forms from black vinyl to canvas, was on view in the museum’s exhibition “Work in Progress: Art and Human Experience,” which opened on January 29. The exhibition was closed until March 11, when it reopened with the work, “Evening Flight: The Art of Night,” in the gallery, which is located at 750 Fifth Avenue, Manhattan.Mauno’s work has recently been featured in exhibitions at the Museum of Modern Art in New York and the Museum of Modern Art, London.\n\n\nThe Institute of Contemporary Arts (ICA) in Paris has asked director Michel Aiguille-Perot to stay on as interim director until a new director is hired. In a joint letter sent by the institute and", "The next Biennial should be held in the spring of 2021. In the meantime, the museum will undertake a thorough review of its collection, including the trans-Atlantic travels of a number of works, and will prepare for the possibility that it may relocate to a new space in the city. In the meantime, the museum will continue to display works by internationally acclaimed contemporary artists, as well as an exhibition of work by legendary Italian artist Giulia Bechko. The museum’s collection will also be entered into the 2020 construction cycle of the city.Commenting on its decision to extend its lease, the museum said: “It is a historic building, and in the context of the city of Venice, in a complex of historic buildings, with a rich history of its own. We are convinced that this new location offers the best possibilities for storing the collection of the museum, and to meet the needs of the growing museum. So we have decided to extend our lease to thirteen years, as previously anticipated. We hope this decision will help the new owners of the building to ensure that the collection of the museum is preserved for future generations.” The building is slated to be demolished in 2021.\n\n\nSinger-songwriter, actor, and activist Harry", "The next Biennial should be held at the Museums in the same location as the exhibition, with a new contemporary exhibition. The role of the museum is to present and study works of art through a conversation with the artists and the curators, in the same space as the exhibition. Every year we create a theme and a new exhibition, culminating in the Biennial Exhibition, the meeting of the curators of the exhibition. During the exhibition we are invited to make a visual improvisation of the work. The biennial will be a collection of original works by selected artists in chronological order, with the exception of the last twenty years, with the goal of engaging the public in the artistic process of this incredible century. When we have finished with the exhibition, we will present the art in a new exhibition. In the meantime, we are pleased to offer our support to the artists who are preparing to participate in the upcoming biennial. We thank them for their work.\n\n\nThe High Museum of Art and the Museum of Modern Art in New York have announced that, in recognition of the work and creative contributions made in the United States by artists between 1914 and 2015, they will donate ten works by artists who are either deceased or have been", "The next Biennial should be October 2020, with an exhibition of works by the artists featured in the series “In the Frame” (2019) and “Jupiter” (2018), and inaugurating a new four-week summer series, “In the Golden Eye.” \n\n\nHolly Huey, the chair of the Tate’s advisory board, has been appointed as its new deputy director.In her new role, Huey will be responsible for ensuring that the Tate remains at the forefront of transforming the way in which art is presented and experienced by visitors by introducing new communications platforms and for advising on the development of its new exhibition program.“The board have been very much in touch with Holly since she first stepped into the role of SVP of marketing and partnerships,” said Kate Fowle, director of Tate Britain. “Her expertise and enthusiasm are needed to ensure the Tate’s future success as a leading global arts destination. She comes to the board with a wealth of experience and knowledge and will strengthen our relationships with the global creative community, including the UK’s largest arts partners, as part of a new strategy to support and promote art and visual creativity.”Hue", "The next Biennial should be held in 2020. Artforum will have more news soon.\n\n\nThe B.K.A. Center for Contemporary Art (B.K.A.C.A.) in New York has announced that Sarah Sze, who has served as a curator at the institution since 2015, will join its staff in 2020. She will assume her responsibilities on September 1, 2020.“I’ve known Sarah Sze for nearly twenty years as a teacher and supporter of art and as a pioneer in the field,” said director Alan Knox. “Her work has been central to shaping the B.K.A.C.A. into a dynamic, international institution that welcomes and inspires its artists and audiences with a passion for the humanities and social practice. I’m thrilled to welcome her to B.K.A.C.A. and to witness the transformation of this extraordinary institution into an indispensible public gathering space for the city, region, and country.”Through a grant from the Doris Duke Charitable Foundation, Sze received the $10,000 Sarah Sze Family Fund. The fund is a companion gift from Doris Duke, the wife of the late hedge-", "The next Biennial should be held in 2020. \"The upcoming exhibition will be a very special event, since it marks the beginning of a new chapter in the history of the biennial, and will be a test of whether the biennial can be revived in future, and I believe it can.” If the biennial is to continue at the same pace as it has for the past twenty years, it will have to decrease the number of artists appearing in its exhibition by a third.\n\n\nThe Museum of Modern Art (MoMA) has announced that it has received a gift of twenty-nine works from the collection of John and Donna Karlin, the founders of the body of work that includes a large-scale cutout of the famous Parisian building; a painting by Charles de Monet; and a striking 1950s-era lithograph by artist and activist Martha Graham.Among the works that were gifted to the institution are the work, titled A Crisis of Conscience, in which the artist is shown as she sits in an apartment in the low-income housing project of the Karlin Family Center; and the piece, titled Apetitif, which features a miniature landscape constructed out of charcoal, paint, and paper.", "The next Biennial should be presented by the Museum of Contemporary Art Chicago in 2021. “We are cognizant of the challenges ahead, but we believe that this is a moment of great opportunity and urgency,” said Gregory. “Our strategy today is to prepare to respond to the challenges posed by climate change by developing new programs with the resources and the commitment to meet the challenges posed by climate change, while we continue to create new things to inspire and engage our audiences through artmaking and design.” \n\n\nThe Jewish Museum in New York has appointed Beth Heineman as its next executive director. She comes to the institution from the Museum of Modern Art (MoMA), where she is currently the deputy director for collections and exhibitions. She succeeds Cara Pierce, who has helmed the museum since 2013, and will take up the post in the spring.“Beth is an ideal leader for the Museum of Modern Art as we continue to reimagine what a modern museum could look like and aspire to,” said Marlene Zanglin, chair of the board of trustees of the Jewish Museum. “Her vision and expertise will shape the direction and activities of the Museum of Modern Art, and", "The next Biennial should be held in 2022, and the last in twenty years. The next one will be held in the city of Labagoda, in Sumatra, in the country’s southeast, and the last in 2020. The next will be held in the city of Marikina, in the Philippines; in the city of Cochin, in the central Philippines; and in the city of Sarangani, in mainland Malaysia.The next one will be held in the country’s interior, in Marawi City, but will be open to the public from March 19 to March 20.\n\n\nThe Los Angeles County Museum of Art (LACMA) has named Andrea Bosch the next director of its sculpture program. The appointment was made on Monday, June 22, after a three-year search that saw several finalists shortlisted for the position. The institution, which has recently been working to expand its collection of internationally renowned artists such as Isamu Noguchi, Robert Irwin, and Richard Serra, chose Bosch over fourteen other finalists who submitted work for the upcoming biennial.The institution announced that it selected Bosch in April 2019 and that she would take the helm of the program in September. Since its", "The next Biennial should take place in 2018, and the first in 2020. \n\nThe museum will be moved from its current location on the ground floor of the Art Institute of Chicago (AIC) to a new 12,800-square-foot space at the university. The move will also see the new university campus built, with construction scheduled to begin in 2021.“We are thrilled to be moving forward with our plans to introduce new views of our campus and an exciting exhibition program,” said John David Mack, director of the museum. “This is an enormous undertaking that has the potential to greatly enhance the quality of life for our community and visitors to the museum.”The renovation of the AIC will also include the redesign of its entrance and on-campus buildings, the addition of additional galleries, the renovation of the iconic Joseph Guggenheim–designed entrance, and the construction of new visitor accommodations. The museum will also add several hundred square feet of gallery space.The renovation of the museum’s Joseph Guggenheim–designed entrance also saw a $200,000 grant from the Guggenheim Foundation, which will also provide $100,000 in support of the renovation of the building’s Joseph", "The next Biennial should be held in 2021. \n\n\nThe London-based nonprofit that runs the annual Art Biennials, London’s only arts biennial, has announced that it is now facing a legal fight from the British government. The British Parliament voted last month to revoke the organization’s registration as it considered whether the organization was breaking the Public Health Act by allowing the spread of SARS, a coronavirus that causes respiratory illness and damage to the lungs.The organization, which was founded in 1995 by David Blunkett, the late British artist Alan Bennett, and the late philanthropist J. M. W. M.B., laid out a path to recovery for the artists by partnering with British hospitals and charities to organize events and provide care for the individuals who were sick and dying of the coronavirus. The event, which is typically held in late March, was canceled earlier this month after a man who contracted the virus became the first person to die of the disease.According to the BBC, the committee tasked with evaluating the program found that it “failed to take into account the risks to the public, to the artists, and to the artists’ families, and failed to take into account the artistic enterprise of allowing", "The next Biennial should come in 2020, the same year the Tate will stage its “Postcode Wars: Looking Back at the Last Fifty Years.”For the past five years, the festival has been taking place in the village of Rochdale in Greater Manchester. The twenty-sixth edition of the event, titled “Ateliers Biennales” was first announced in July 2016 and was set to kick off in May. Since the campaign was initially launched in 2010, the event has been supported by the Tate, the Institute of Contemporary Arts, London; the National Lottery Heritage Fund; and the National Lottery Council.\n\n\nThe Tate’s board has appointed architect Peter Starkey as the new director of its Modern Art Centre. The appointment was made in a special meeting chaired by managing director Maria Balshaw on Thursday, May 4.“Peter has been an outstanding and dedicated board member of the museum over the past five years, and we are grateful for his commitment and enthusiasm for what he is doing,” said Ms Balshaw. “At a time when we are facing an unprecedented crisis, when the future of our cities and cities areas is at risk, and when the museum is being transformed by", "The next Biennial should be in the second half of the year.”For his part, Hall, who has produced work for the museum since 1970, said: “I’m excited to continue to be a critical voice and a driving force of the museum’s collection through my years as a curator. I’m eager to see what the biennial will look and sound like.”\n\n\nThe New York City Department of Cultural Affairs (DCLA) has officially opened a $1.5 million fund for cultural heritage preservation in the city. The $665,000 fund was established as part of Mayor Bill de Blasio’s plan to revitalize cultural districts devastated by the coronavirus.“The city is committed to working with the communities we serve to ensure that cultural heritage assets are maintained, restored, and maintained in the future,” said cultural heritage commissioner Daniel Berlind. “This fund will help ensure we do all we can to support the critical infrastructure of the cultural district as we face this challenge and rebuild.”Through a $500,000 grant, the DCLA will receive $1.5 million in support of the development of cultural heritage preservation strategies to promote the preservation of culturally", "The next Biennial should have opened in 2021, but was postponed due to the Covid-19 pandemic. The 2019 show was canceled owing to the Covid-19 pandemic, and the organizers have since been forced to move the exhibition and move the program online. The organizers have also been forced to cancel two other biennial shows: “The Essence of Life” (2019) and “The Conscious Life” (2019). The 2019 show, which was meant to run from September 9 to October 23, was rescheduled for October 13–October 23, and the 2018 show was moved to October 27–October 28. The 2019 biennials will be held in March, March 22–March 25, and May 29–May 26. The 2020 exhibition will be staged in May, May 23–May 26, and will feature twenty works. The 2020 fair will take place at the Art Institute of Chicago (AIC), where it has been held since 2014, and will run from May 19–May 23.\n\n\nThe Museum of Contemporary Art (MoCA) in New York has appointed Laura Hoad and Renata Pindell as the next director and chief curator of the institution.", "The next Biennial should be held in 2020, and the first in 2030. It will be led by Dr. Natalie Perez, the director of the Center for Experimental Art, and will include representatives from thirteen countries.The exhibition is one part of a larger effort to present works by and about contemporary art and culture in Mexico. Last year, the Center for Contemporary Art, in partnership with the Mexico City Art Museum, added twenty-one works by Mexican artists to its collection. The show was commissioned in the form of a group exhibition, which was organized by Miguel Ángel Jara, the director of the Puebla de Cultura Artes, and Marcia Martínez. The exhibition is set to open in the museum in 2020.\n\n\nIn the predawn hours yesterday in Bristol, England, a ten-person team led by British artist Marc Quinn installed a statue of Black Lives Matter activist Jen Reid on a plinth that recently held an eighteen-foot-tall likeness of seventeenth-century slave trader Edward Colston—a monument that caused a stir last month when it was unveiled.Quinn reached out to Reid about collaborating after seeing an Instagram post of her standing atop the plinth with her", "The next Biennial should be an extension of the 2017 edition. The new theme is “World War II and the Concerts,” presenting the work of six curators: Mihai Skodevitch, Jochen Baumann, Francisco Alberto Takal, and Yuki Yamamoto. The inaugural exhibition will open in May 2021 and will run until March of 2022.The 2019 event, “An Anthropocene: The Flood of Worlds” was organized by the Museum of Modern Art (MoMA) and the European University Museum (EUM) in Milan. The show, which was curated by sculptor and thinker Janice Hanna, was organized in collaboration with the nonprofit organization Laudis SPA. The exhibition opened with a series of sculptures by the German-born Hanna, for which she produced drawings of her own body, transformed her own body into an avatar, and recorded her own body language through monologues and performances. The works centered on the concept of her body’s extraction from its environment.Commenting on the exhibition, Hanna said: “This is my body, this is the body of my children, this is my body in its midst, this is the body of my children in", "The next Biennial should be called the 50th Anniversary of the Universal Declaration of Human Rights, the International Covenant on Civil and Political Rights, and should include the work of artists of all genres, both from and beyond Europe. This year’s event is now open to the public.\n\n\nThe Art Newspaper reports that the Metropolitan Museum of Art in New York has received a $20 million gift from the estate of Joséf Alberts. The donation comes in the form of a collection of more than 500 works, created especially for the institution in the late nineteenth century, which were donated by his sons, Bernardo and Marcel, to the Museum of Modern Art in the Bronx as part of a deal that was finalized in 2015. The gift includes works by twenty-three masters whose careers have been intertwined with the museum, including Erik Giustta, Willem de Kooning, Peter Schäfer, and James Turrell.The Alberts’s gift also includes a selection of works by contemporary artists, including Helen Cammock, Max Hetzler, and David H. Wood. Additionally, the works will be displayed in the museum’s collection of the artists with whom the family has collaborated over the decades. They will be housed", "The next Biennial should open in the fall of 2020, and the event will then continue with a schedule of interviews and lectures, display cases of selected works by master craftsmen, and public programs that reflect the Museum’s history of participating in international exhibitions and exhibitions.The institution has also revealed that it will host a series of events to commemorate the occasion, which will include a performance, a book signing, and a meeting.\n\n\nThe Metropolitan Museum of Art (the museum) in New York has pledged to donate $10 million to alleviate the financial crisis caused by Covid-19, and President Bill de Blasio announced that the city will also contribute $2 million to the fund. In recognition of the city’s contribution, the museum will be given a $1 million grant to develop new programs that will engage with and enhance the collection and presentation of works by New York’s most eminent seventeenth-century painters.The city’s contribution comes on the heels of the governor’s announcement that $1.5 billion will be allocated to combating the coronavirus, which was met with mixed reactions in the city. Many saw the move as support for the local arts, but others criticized the funding and the timing, arguing that", "The next Biennial should be held in 2019. The theme of the exhibition shall be “On Being and Time.”\n\n\nThe Museum of Contemporary Art (MCA) in New York has appointed James Cuno as its new deputy director of curatorial affairs. Cuno comes to the MCA from the Metropolitan Museum of Art in New York, where he has served as deputy director of collections since 2009. He succeeds Michael Rivera, who retired in June 2019 after seventeen years at the helm of the Museum of Modern Art in New York, and will assume his responsibilities on January 5, 2021.“James has a long history at MCA, starting as director of collections and collections management at the Cooper-Hewitt, New York’s largest arts museum, and culminating in his tenure as associate director of collection acquisitions in 2015, when the institution was still led by Rivera,” said director Daniel H. Weiss. “His proven track record in the field and expertise in curating exhibitions and public programs make him ideally qualified to lead the MCA through its next iteration of the Art for America—a pivotal moment for contemporary art.”Prior to joining the MCA, Cuno served as associate curator of modern and contemporary art and architecture", "The next Biennial should take place in 2021, at a date yet to be announced on the exhibition’s website.The first edition of the exhibition was held at the Taguig Museum of Art in Taguig, Fujian, China. The second, “The Death of Light” (2017), at the Kunsthalle Basel, Switzerland, opened in 2018. The third and fourth Biennials, “The Light and the Fire: Artists and the Silence of the Future” (2019) and “The Wind and the Sea: Constructivist Sculpture in the Modern World” (2018), respectively, were staged at the Tübing Museum for Contemporary Art, Tübing, Germany. \n\n\nThe Brooklyn-based nonprofit Arts in Motion (AIM) has received a gift of $5 million from the Lyndale-Skowhegan Collection, which comprises over two hundred works by five artists: Raymond Boisjoly, John Jozwiak, Henry Kuttner, William H. Macy, and Zidoun Hill, all of New York, and is celebrating its fifteenth anniversary this year. The gift includes six works by Hedy Lamarr, who represented the United", "The next Biennial should take place in 2022 and will comprise twenty-two artist commissions that will present contemporary works in partnership with the museum. The museum will also soon hold a New Art Series, which will include new works by unique artists whose work is on display in the museum’s permanent galleries. The masterclasses will be on display in the collections of the Muse and the Art Gallery of Alberta.\n\nThe National Gallery in Canada has announced that it is planning to open its first visitors’ center in Tokyo, the Metabolist, in 2020. Built in a former steel factory in the city of Nagoya, the center will provide tours and other programming that will allow visitors to see works on display in its newly renovated Visitor’s Rest area.The first exhibition opening at the center will be “The Parachute of Aldrich” by artist Richard Avedon. The work, a durable, three-dimensional figure that resembles the parachute of a human being, was created as part of a series of explorations about the nature of memory and the body. The project received significant support from the Japanese government and was given the green light by Prime Minister Shinzo Abe, who also helped raise funds for the building of the Visitor�", "The next Biennial should be held in 2021. The nominees are João Brazil, Jair Bolsonaro, Sergio Bonisola, Erika Bojaguil, Mariano Carvalho, Andrea Catellani, Yoko C. Naito, Léa García-Barriga, Judy Graziano, Saima Hamza, Laurie Johnson-Goodale, Nina Johnson-Laird, Diana M. Jacob, Stefano Magi, Sara Taylor-Klausen & Michael Krusher, Maia Turin, Carol Wilson, and Mary V. Hollis. The 2019 edition, curated by John Pritchard, featured art and architecture by Eric Fischl and David H. Peterson, and featured work by artists such as Stella Adler, Leila Gabrielson, David K. Post, Elizabeth Goodson, and Catherine Conner-Reynolds.\n\n\nThe Museum of Fine Arts (MFA) in Minneapolis has received a $100,000 donation from the Robert Newton-Jarrett Foundation. The grant, which comes six months", "The next Biennial should take place sometime between March 8 and March 11; the dates were chosen in response to the new demands made by the academic community, which has been calling for the exhibition to be held at least through March. The British Museum and the National Portrait Gallery in London are among the institutions that have also announced their intentions to pull the plug on the event.The move has led to protests from some academics, who believe that cancelling an exhibition is tantamount to committing a war crime; and has stifled the exhibition’s development. In a letter written by a group of twenty-nine academics to the museum’s board of trustees, titled “We don’t want a boycott, we want a deal,” the scholars argued that the institution had to agree to a series of concessions that would “allow us the ability to avoid a repetition of the events of March 8.” The letter also argued that, in order to avoid a “clandestine meeting between the museum and the government,” the British Museum should accept the demands of the “people” to “demonstrate that the museum is no longer committed to supporting the Iran-backed regime but instead seeks to play its part in", "The next Biennial should be held in Paris in 2021. The final version, which will be presented by the Istanbul-based Egyptian curator Khaled al-Aswani, will be held in Algiers, Morocco, in 2022.\n\n\nThe French Ministry of Culture is planning to relocate the collection of the Museo de Arte Contemporáneo (MASC) in Rome to the National Museum in Paris in an attempt to halt the spread of the novel coronavirus, the coronavirus itself, or both. The change will begin this April and will consist of a series of renovations to the museum, which has been shuttered since March 13.According to the French daily newspaper Le Figaro, the ministry is currently working with the Paris-based architecture firm, SNCF, to prepare a timeline detailing the renovations to the institution. The project, led by the French firm Adrien Brody, began in April and is slated to be completed by July. The ministry is expecting the renovation to raise the museum’s capacity to hold eight thousand visitors.The cultural institution has been struggling since it reported a decrease in visitors\u0097it was expecting to see a large uptick during the coronavirus pandemic. The museum expects", "The next Biennial should take place in 2021 and will be hosted in the former Human Market in Kiasma, Japan. \n\n\nThe Metropolitan Museum of Art (the museum) has awarded $4.75 million to the University of Houston in its inaugural CBGB-Harris Pollock Awards, which are designed to recognize emerging artists and cultural producers.The awardees—Hugo Pino, Amélie Olmi, Mary Roach, Rineka Syah, and Ulyn Waugh—will each receive $300 for their work. In addition, the museum has established seven grants totaling $600 each to support the performance and creative work of women and underrepresented artists.The awards, which were established in 2011 as a means of expanding on the Metropolitan Museum of Art’s $2 billion expansion, were established as part of the museum’s reopening plans. The museum is currently constructing a new 23,000-square-foot building to house its collections, offices, and collections, and is undergoing a $2 billion expansion, which will be completed by 2022.“We are very excited to welcome these ten artists to our collections and to support their work in this way,” said museum director Adrian Warsh. “These", "The next Biennial should focus on the architecture of the body, the body as a whole, and on the body’s relation to the earth and climate. It should also address issues of the collection, transport, archival, and storage of the collection.”The 2019 edition of the Biennial, titled “The Body in Space,” was curated by Hélio Oiticica and featured works by twenty artists including Efrem Zelony, Kato Kandal, and Jean-Michel Basquiat.This year’s exhibition will also feature a retrospective of the artist’s work, “The Body in Motion,” which will travel to the Museum of Modern Art in New York from May 12 to May 16. The show will include a special exhibition of work by Federico Navarro, a female artist who experimented with sculptural and abstract forms in the 1960s and ’70s, and a special exhibition of work by artist David Salle.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has released guidelines for how museums should handle protests against its decision to remove a statue of Edward Colston, a racist and sexist imperialist who violently contested the civil rights of African Americans, from", "The next Biennial should be selected by the Asian Art Museum, Tokyo (AAM), which will hold an exhibition of work by twenty-eight artists on December 11. The exhibition will be organized in collaboration with the Tangent Museum of Art, where the first exhibition was held in 2016. AAM is currently working on constructing a new exhibition space for the show.\n\n\nThe City of London Corporation (C.L.O.) has awarded the Sotheby’s Prize, which was established in 2018 to honor Richard Telling, to three artists who have made significant contributions to the City of London. The awardees are Gemini Fine Art, Courtney Love, and Jonathan Daniel Hodge.Gemini Fine Art’s Richard Telling, Courtney Love, and Jonathan Daniel Hodge.Photos: GettyTelling: Richard Telling, Courtney Love, and Jonathan Daniel HodgeThe three winners are scheduled to appear at the forthcoming Fifth Guessing, which will run from May to October, at the London Gallery of Contemporary Art, London, on November 22. The exhibition will examine the concepts of power, politics, and the representation of art. The show will be curated by Marion Nestor and will be inaugurated by the work of artist Stephen Parrott", "The next Biennial should focus on presenting works that address issues that center around the connection between art and design. The theme of “Aesthetic Experience” will be included in the artworks, which will be mounted in a gallery space in a revitalized old manufacturing center. The museum will also include a new digital experience, a new public gathering space, and a public conversation platform.The museum is planning to build a fourth building on its campus, a public gathering space and a public fountain, and is currently working on a redesign for the museum, which is currently undergoing a $100 million expansion. The new building will include a configuration of galleries, offices, and community gathering spaces.Becky Bell, a curator and artistic producer based in New York, will curate the exhibition “Culture and Design” at the museum. Bell will present three projects, “INTERVIEWS between ART and ARTS,” “IMPROVED ART: A Symposium,” and “SURPRISE ART: A Symposium,” which are currently on view in the exhibition “IMPROVEMENT ART: A Symposium.” Bell will also present the first program dedicated to the museum in a year, which will be", "The next Biennial should be held at a location to be determined. The new venue will be a partnership between the City of Los Angeles and the University of California, Berkeley. The event will be hosted at UC Berkeley via the university’s Y Combinator incubator.“We are thrilled to present the next Biennial at the UC Berkeley Art Museum’s,” said biennial director Loring Randolph. “The new partnership between the city and the UC Berkeley Art Museum will introduce our community to the extraordinary work of the artists represented on this year’s exhibition. The new venue will more than double the museum’s already impressive collection, and will allow us to present the Biennial at a time when it truly belongs to all of us, with a dedicated audience. This partnership will allow us to create a space that reflects the spirit and history of the museum as well as our community.”\n\n\nThe Diller Scofidio + Renfro–designed Palazzo Grassi in Venice has been commissioned to build a new residence for the Italian contemporary art, which is currently housed in the Italian capital’s historic Pantheon Theater. The architect is office tenant Diller Scofidio + Ren", "The next Biennial should be held in 2020. Some artistic directors and curators believe that 2020 is the ideal date to launch a new exhibition, as the exhibition schedule will have undergone major reworkings. VIDEO: The Biennial: Where Art and Tech Meet (2017)  (2017)  (2017)  (2017)  (2017)  (2017)  (2017)  (2017)  (2017)  (2017) \nPosted by cynthia at 06:30 AM<|endoftext|>Somehow, someway, some way, we have to. Artists must do something. They have a right to be compensated for their labor. They have a duty to explain their labor to others. They have a responsibility to educate others. They have a right to organize. They have a duty to bargain. They have a responsibility to share. They have a duty to occupy spaces that are not theirs. They have a responsibility to demand respect. They have a right to be heard. They have a responsibility to act. They have a responsibility to act in self-defense. They have a right to be protected from harm. They must", "The next Biennial should be held in 2021, and the twenty-seventh in 2022.  During its twenty-seventh iteration, the exhibition will address issues of sustainability, art, biology, and medicine.  The twenty-eighth will focus on the relationship between art and society. The event will also include a discussion of the art of dying, with choreography by the Venezuelan artist Diosa Cenar and the collaboration of artists such as Nery Cabargas, Andreu Nava, and Carnaval Paz.\n\n\n\n\n\nNick Clegg has appointed British artist, philanthropist, and broadcaster Peter Jackson as his successor as UK prime minister. Jackson is not yet a politician and was appointed in May 2019 by the Labour Party leader on the grounds that he was not yet \"ready\" to take over from the current government. He will assume the role in September.“As we move into September 2020, there is an urgent need to raise millions of pounds for the NHS and social care, and set out plans to reform the welfare system to meet the challenges of the future,” Jackson said. “I have had the privilege of working with some of the most talented and dedicated people in the world, and they know", "The next Biennial should inaugurate with an exhibition of work by the contemporary artists which will have been completed before the war’s end. A selection of the work of the Biennial’s present and past program should be presented. The exhibition should take place in the exhibition hall of the National Museum of Art.The exhibition should celebrate the physical and cultural achievements of Canada’s wartime artists; include contemporary exhibitions, films, books, and other media, and include biennial introductions by artists whose works have never been exhibited before; and be based on the founding principles of the Biennial.The exhibition—which is being curated by Alison Kamb, director of the National Gallery of Canada—is being organized by Ingrid Carron, curator of modern and contemporary art at the Metropolitan Museum of Art; and Michael Lutz, director of the Museum of Fine Arts in Boston. The exhibit was inspired by the five-year anniversary of the 2008 launch of “My Struggle,” the exhibition that focused on Canadian veterans of the Gulf War. “I wanted to bring together contemporary art from the United States, Canada, and Europe,” said Carron. “I think a great thing about the Biennial is that it’s", "The next Biennial should take place in 2020, and the next will be in 2022. The 2020 event will feature twenty-nine new works by twenty-four artists who were selected from a pool of more than 1,500 artists. Lang, whose practice encompasses painting, sculpture, photography, performance, and performance-based work, was chosen by an international jury\u0097the inaugural jury consisted of Wu Xiaoyu, Ai Weiwei’s son, and an artist from China’s Guangzhou Province who was nominated by the art historian Li Xianli. Previously, Lang has been featured in the exhibition “A Man’s Body” (2019); “Prospect 3: Celine Peter” (2018); and “The Drawing Board” (2016).\n\n\nThe Charles and Lucille King Center for the Arts (CKA) at the University of Washington in Seattle has received a gift of thirty-six works by Chinese artist Li Xianli\u0097a Chinese American painter who frequently depicted female figures, including women and children, and whose work will be exhibited at the CKA’s exhibition “The Women in Art: Chinese Art in the Modern Era” (2019) and the C", "The next Biennial should be held sometime in the early 2020s. \nThe first national monument for the history of Western art was established in Washington, DC, in 1923. By the 1950s, the region’s art museums and historic sites had become some of the country’s most popular tourist destinations. As the city’s art museums expanded, so did the museum calendar. The Smithsonian American Art Museum in Washington, DC, hosted eleven biennials between 2011 and 2013. In 2014, Jonas Smeets, author of The Surrealists: Art in the Age of Stalin, announced that his forthcoming book would include a survey of Washington, DC’s art museums. The design of the new monuments was taken from a section of the Washington, DC’s archipelago of islands known as the Potomac, a UNESCO World Heritage site located near the Atlantic Ocean in the District of Columbia. The region’s principal art dealers, Washington’s WIE Architects, were commissioned to design a monument for the region’s art and hospitality, and the artist-run gallery district Cultural Exchange Group was hired to construct the monument. The statue will be located in the heart of the", "The next Biennial should be held in February 2020.  The first was held in January 2019.  The second, entitled The Art of Disruption, was accommodated by Damon Albarn and Tilda Swinton, which was staged at the Art Gallery London, and The Second Wave, which was curated by Benedict Bossu and Tom Britten, was accommodated by Anatole Shagal and was on view until September 2020.  The third, The Power of Two, was accommodated by Simon Wächtler and was on view until September 2021.  All three Biennials are currently on display in the Guggenheim in New York. \n\n\nThe Museum of Fine Arts (MA) in New York has appointed Kate McIntosh as its next director. McIntosh comes to the museum from the Metropolitan Museum of Art, where she has served as deputy director of public affairs since 2015. After graduating from the institution in 2008, she served as curator at large in the museum until 2013, when she assumed the role of director. Under her leadership, the museum made major contributions to the public understanding of art history", "The next Biennial should be held in the spring of 2021. The 2020 edition, which was curated by and opened on March 7, was criticized for its lack of progress and for its pretension to be a “future history” of the arts.“I’m not going to pretend that the future is anything like the present,” said Zhang. “But if we want to avoid any further misunderstandings about the art of the twenty-first century, we need to listen to our cultural ancestors, which has no future at all.”\n\n\nThe National Gallery of Art in Washington, DC, is launching a new digital platform that will allow visitors to see and purchase works by Hélio Oiticica, a Brazilian painter who also lived and worked in Rio de Janeiro, Brazil, from the artist’s collection. Titled Projection, the project lets visitors explore the works through the artist’s “experimental” style, which exhibits a range of emotions ranging from melancholy to rage.The platform, which will debut in March 2020, will feature over two hundred works by the artist, as well as a selection of works by other contemporary artists, including Lina Burga, Lélanie Char", "The next Biennial should be this fall. \n\n\nArt Gallery of Ontario (AGO) has appointed Samantha Lesnaud as its new senior director for artistic engagement. Lesnaud comes to the institution from the British American Foundation (BAME), where she has served as the director of public affairs since 2017. In her new role, she will be responsible for organizing exhibitions, public programs, writings, public events, and the publication of scholarly publications in collaboration with the artist-run fund Break the Silence, which she started in 2014.“After a year as the director of arts and culture, Samantha is returning to the helm of the contemporary curatorial department at the Art Gallery of Ontario to build on her reputation as a leading curator in the field,” said Matthew Bell, director of the Art Gallery of Ontario. “Her record of success and ability to connect with the needs of artists and communities across the province is significant and I’m confident she will continue to shape and shape the contemporary curatorial program in a way that reflects both her own expertise and vision.”During her tenure at BAME, Lesnaud also organized the second-ever Windup, a reinstallation of the gallery’s campus", "The next Biennial should be held in 2022, the year of the first Festival of Finland. The next iteration of the Hammerstein Biennial will be held in 2021. The 2020 edition was held at the Finnish Museum of Fine Arts (MMFA) in Helsinki. The event will focus on the art of the Scandinavian countries, with work from the Icelandic Museum of Fine Art, in Reykjavík; the Art of the Soviet Union Museum of Modern Art in Moscow; and the Art of the Baltic States Museum of Art in Vilnius, Lithuania. The biennial will be organized as a single exhibition. “It is interesting to see how the innovative Danish curator Jørn Tensta, who is known for his creativity and for being politically astute, fits in the present moment of contemporary art and with the current political climate,” designer and curator Natalia Remarque, who is the director of the Danish Contemporary Art Museum, told the Art Newspaper. Remarque added that the Danish curator “seemed to be able to keep the focus on history, art, and contemporary art.”The Danish pavilion will be dedicated to the history of Danish art, with works from the Danish National Museum, the Danish National Gallery", "The next Biennial should focus on women and gender expression and “explore the intersections of art, society, and gender.”The work of the biennial will be open to the public until March 19, 2020. The biennial will consist of ten exhibitions, which will also feature new works by selected artists, as well as biennial performances.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles has received a gift of more than sixty works by Daniel Buren, a painter best known for his delivery of heartbreakingly intimate images of his own body and landscapes in his paintings, sculptures, and photography, as well as his paintings and photographs. The gift includes works by artist-activists, activists, and activists.The Los Angeles–born, California–based artist is best known for his paintings, which often depict living bodies in the most intimate of settings, such as in his paintings of his family—a mannequin in a glass house in Studio City—as well as in his projects that include mapping out a series of landscapes to fit the body of L.A. native Daniel Buren in his Los Angeles home, the Glass House.In the late 1980s, the Glass House began hosting artists, artists-activists, and", "The next Biennial should be held in 2020. The first was in 2022 and lasted eleven months.In his opening remarks on the subject of sustainable design, Worker, an exhibition organized by the W.K. Kellogg Foundation and the Walt Whitman Foundation, said: “The future of design lies in the creativity of our users and the unprecedented versatility of our design objects. The future of art, the future of design, lies in our continual experimentation and experimentation within a rapidly changing environment. Design is the new language, with the new vocabulary of the art world. . . . We must explore the possibility that design may be the language of art and the new art world may be the new design.” \n\n\nThe National Geographic Society’s ambitious plan to organize five more massive supercomputers in the country, including at least two at the Smithsonian’s National Museum of Natural History and two at the Smithsonian’s new building in Washington, DC, has been scrapped amid a backlash from scientists and ethicists amid plans to build the facilities as part of the $4 trillion Atlantic Yards development project.The announcement was made amid a sweeping legal challenge spearheaded by environmental justice activists in an attempt to stop the plan, which would have doubled the", "The next Biennial should be held in 2021. The rest of the details will be up to the board. Wang said: “The current exhibition, ‘Existenz, ’has been a tremendous success and is one of the most widely known exhibitions in the city. However, its future is uncertain without the support of the museum’s staff and the local community. I am confident that the museum will continue to thrive as it organises more exhibitions in its upcoming years. I have a vision for the museum to be one of the best preserved in China and will continue to work with the local community to realize this.”\n\n\nThe Rockefeller Center in New York has received a gift of eighty-three works from the artist-activists and collectors who make up the CART collective. The grant was made by Whitney Biennialist and founder Marilynna Bridgeman, long-time friend and business partner of the artists, and her father, David Bridgeman, who collectively own the family business, the artists’ plantation company. The donation includes works by thirty-three of the artists featured in the biennial, including Claire \"Queen of the Deserts\" Alsop, Cuba Gooding,", "The next Biennial should take place at the Museum of Modern Art (MoMA), New York, in 2021.\n\n\nThe Museum of Modern Art (MoMA) in New York has received a $10 million gift from the Takotsubo-based artist Liesel von Kemper. Von Kemper passed away in January 2019 at the age of eighty-five. According to the New York Times, in addition to the $10 million donation, the museum also pledged $7 million for an additional sculpture for the exhibition “Ashton Kutcher: My Way.”The donation comes all the way from the Dutch community of the Takotsubo tribe, which lived in the area of the city of Raadbou, in the Dutch East Indies. In 2004, the Takotsubo donated the Kemper van der Merwe gallery in the city of Amsterdam to create a new workspace for the artist. They also developed an art installation park in the area.In 2012, a retrospective of the artist’s work was organized at the Kemper family home in the Netherlands, and in 2018, the Dutch Jewish Museum also honored the artist. In addition to the donation, the museum will begin to restore a portion of the estate of the Takots", "The next Biennial should be in the spring of 2021. \n\n\nThe Metropolitan Museum of Art (MoMA) in New York has appointed Sarah Greenfield its new deputy director for collections and exhibitions. She will be responsible for rotating through the collections and exhibitions of the museum and will take up her new post in the spring of 2021.“Sarah has been instrumental in the growth of MoMA’s collection and exhibitions program, and her work will be crucial in ensuring MoMA’s future as the premier museum of its kind in the country,” said museum director James D. Farley. “We look forward to working closely with her to shape MoMA’s future through our collection, exhibitions, and collections, and to enabling our future generations to experience the museum in a new way.”Greenfield comes to the institution from the Metropolitan Museum of Art, where she has served as deputy director for collections and exhibitions since 2016. She succeeds David H. Lund, who retired last year after sixteen years at the helm of the institution. When he announced his resignation, Lund said that he plans to hire a new director. During her tenure at MoMA, Greenfield helped shape the collection and exhibition program for the museum’s", "The next Biennial should be in 2021–22. \n\n\nThe Barbican Center for Contemporary Art in London has announced its representation of the artist-run nonprofit Art Basel. The Barbican will stage the first exhibition dedicated to the British car manufacturer in its seventy-year history, which will take up the theme “The Future Is Present.” The exhibition, titled “The Future Is Present,” will be led by artist-activists Raquel Fajardo and Charlotte Black and will open in March 2020.The exhibition will highlight the works of thirty-two artists, including Kaya Quintana, Davey, Deana Lawson, and Jeremy Deller. “The Future Is Present” will feature work by twenty-nine artists, including Damien Hirst, Bruno Latour, Paul Gauguin, Anna De Neumann, Laura Mulvey, and Mary Beard. The show will also include the first-ever multimedia project by artist-activists Bjorn Spencer and Mary Beard.“It’s a very exciting time to be a British artist, and the Barbican is delighted to showcase the evolving range of British art of the past seventy years,” said Yvonne Bouchard, the director of", "The next Biennial should be held in 2021. \n\n\nThe Metropolitan Museum of Art in New York has commissioned artist David McAllister to create a new sculpture, a work on paper, inspired by the 1976 murder of American photographer Daniel H. Wilson, for its third exhibition, “We Need Not Fear.” Expected to open at the Met in 2021, the work will be a “statement of memory for the photographers who died in the line of duty,” according to curator Andrew Kreps. The sculpture, titled “We Need Not Fear,” depicts an alternate history, in which the 2015 terrorist attack on the Washington-based American Israel Public Affairs Committee (AIPAC) and the organization that represents Wilson’s family, the Wilson Foundation, would have resulted in a much different outcome, had the family been notified beforehand.In a letter sent by director Stewart Goodman to McAllister, Goodman said, “While the work is a statement of recollection, it also seeks to take account of the ‘next generation’ of activists. We hope that the Met’s involvement in this ongoing, ongoing, and ongoing will allow you to make a statement of memory for these images of their father, Daniel H", "The next Biennial should aim to produce a convention in the spring of 2021, and the first exhibition should open in the autumn of 2022. \n\n\nThe Royal Academy of Arts (RA) in London has appointed Becca Chiu as its new executive director. Chiu comes to the academy from the London-based arts organization the London-based arts organization the London-based arts organization the London Foundation for Contemporary Art (LFCCA), which has been working with the Museum of London to develop a new real estate strategy for the Tate.“I’m delighted to join the RA at a moment of great change and challenge,” Chiu said. “I’m looking forward to demonstrating how the RA can help preserve and inspire the urban fabric in ways that are relevant and innovative to the local community.”The organization will also be reimagined as an international center for contemporary art, focusing on priorities such as access and accessibility, sustainability, and accessibility. Its new mission statement, “to create an international platform for contemporary art,” reads: “This is an exciting time to be a curator, and I am deeply committed to creating a space for thinkers, artists, architects, scientists, musicians, engineers, and", "The next Biennial should take place in 2021, and the first in 2024. \n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles has introduced two new prizes for artistic excellence. The nation’s No. 1 prize for visual arts, the $50,000 Arts Prize, and the $100,000 Photography Award, will be awarded next month. The institutions’ inaugural honors, both presented by MCA, evening out the prize’s $1,000 prize for best museum exhibition. The museum is giving both prizes for free.The first prize, which was established in 2018 by the Wayne Foundation and the Wayne County Museum of Art, will be presented in conjunction with the Los Angeles–based nonprofit nonprofit Advocacy for Art, which aims to increase awareness of art conservation and restoration. The prize will also be accessible to everyone through the museum, with a $500 cash prize awarded to an individual.The second award, which was established in 2020 by the Los Angeles–based nonprofit the Center for Art & Culture, will be presented in conjunction with a special exhibition, “The Future Is Now: A Contemporary Biennial,” organized by the contemporary art museum Los Angeles. The exhibition will be inaugurated by John Bir", "The next Biennial should take place in 2020, when the full complement of the biennial’s holdings will be open to the public.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it is planning to cancel the upcoming edition of the Museum of Contemporary Art (MoCA) in partnership with the artist-run organization Nara Lincoln Center for the Arts (NCCA), due to the coronavirus. The announcement follows a week of demonstrations and protests at the institution, which is also facing an ongoing investigation by the US Department of Health and Human Services into its care and sanitation practices.The news follows the International Day of Action, Saturday, December 9, which was organized by Nara Lincoln Center for the Arts, Art in Action, and the Los Angeles Coalition Against Censorship, and drew over two hundred participants. The day will include discussions with artists, activists, educators, and others involved in the ongoing campaign to hold MoCA accountable for its unsafe working conditions, and will culminate with a day of performances, readings, and workshops.“We are deeply concerned by the coronavirus; we are alarmed by the number of sick children in the United States; and we are outraged by the damage done to", "The next Biennial should be a celebration of the history of photography as it relates to art and the future of art. I am extremely excited to tell you that the 2015 edition will be a celebration of the current values and the future of photography.”The exhibition of the exhibition will be held at Art3, the foundation that has championed the exhibition of work by artists from around the world in the United States since it was founded in 1999. The Biennial will be housed in the Museum of Contemporary Art (MoCA), Los Angeles, and will run for twelve weeks.The exhibition will feature work by sixty-five artists and in addition to the usual highlights, a selection of previews will also be presented. The exhibition will be accompanied by a new book, “Photographs at the Biennial,” edited by Jonathan Holloway, cofounder of the New York–based artist collective the Five Ten. The exhibition will be followed by a special exhibition of photography works at New York’s Museum of Modern Art (MoMA), curated by the artist-in-residence, Riccardo Toscani.Inaugurating the event are three new works by artists working in the photographic field. Joan Clark’s “Blue,", "The next Biennial should take place in 2019. \n\n\nOolite Arts New York—a New York–based nonprofit that aims to promote a more diverse range of contemporary art through the promotion of a more adventurous, experimental, and rarely-heard-of aesthetics—has announced that it is suspending the 2020 edition of the annual event. The postponement was prompted by the Covid-19 pandemic, which has complicated efforts to prepare for the pandemic.“It has become clear that we are not having a meaningful impact in the fight against Covid-19,” said Oolite Arts director Haig Cheung. “We are moving forward with a more ambitious and inclusive program, a true reflection of the diverse communities that make up America. That means we will not have a March 23 performance at CUNY, a March 28 exhibition at the Museum of Modern Art, a March 30 performance at the Metropolitan Museum of Art, a March 31 performance at the Whitney Museum of American Art, a March 32 reception for the artists who will be featured in the program at the Boeing Company, and a March 33 performance at the New York Botanic Garden.”The organization previously announced that it was postponing the event, which has", "The next Biennial should be held in 2020. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it will host a series of programming, exhibitions, and screenings with the Japanese artist Koki Nakamura, which will include a solo exhibition of his work in the fall of 2020. The exhibition will be followed by a book launch in the spring of 2021 and will culminate with a symposium. The opening of the exhibition will take place at the museum in April.“Nakamura’s paintings are part of a long-standing and multifarious program of modernism in Japan,” said museum director Daniel H. Weiss. “His work challenges us to reconsider our place in the world, to reconsider the possibility of transformation. His paintings have always been a source of inspiration for me, and for so many others, as a way of giving space to new ideas. I am thrilled to create a platform for his work, and for his legacy, as a way for us to continue to get to know his work, watch his work, and speak with him.”Nakamura earned his bachelor’s degree at the University of Tokyo and his master’s degree at the University of Pennsylvania.", "The next Biennial should be held in 2021 and will be organized in the former factory building. The exhibition will include works by artists whose works were exhibited in the previous exhibition. The Biennial will be hosted in three cities: Mumbai, the United States, and Hong Kong. Submissions will be received by September 15. The deadline for the submission period for the 2019 exhibition was June 12. The theme for the exhibition, The Birth of an Idea, will be “A Real Struggle,” and will be themed after the feminist work The Scream. Currently on view in the museum is Live, a selection of works by the Swiss artist Emil Fischer, a living embodiment of the technology culture of the late 1970s and early 1980s. The exhibition will open at the institution on August 27 and run through October 30. The exhibition will be followed by a group show titled “The Space Between,” which will be organized in collaboration with Nirvana’s Matthiasa Zamanowicz. The show will be organized as follows: In the end, the Biennial will need to attract up to 1,000 visitors to accommodate the anticipated crowds at the exhibition and the venues for the ceremony", "The next Biennial should take place in 2021, with a new exhibition scheduled to open in 2022. “Bienal Histoire’s exhibition of work by the highly influential French artist Auguste Merak, an independent artist whose work is widely recognized, will be the theme of the next edition,” said Marine Le Pen, the head of the National Front party. The next edition of the museum will be staged in 2021.\n\n\nThe New York–based dealer who organized the sale of works by American composers such as Thomas Chade, Robert Rauschenberg, and Edvard Munch, among others, was sentenced to three and a half years and forty months in prison and fined $7 million in a Manhattan federal court on Wednesday.Michael Russell, the owner of the New York–based dealer Gallery of Modern Art (GMA), was found guilty of racketeering last year by a jury that found that his business was integral to the syndicate that ran a $3 billion Pritzker Pavilion exhibition in 2009 and 2010. The works were later auctioned by Russell to the band members and their families, the proceeds of which were split between the criminal defendants.Russell had pleaded no contest to one count of conspiracy to def", "The next Biennial should take place in 2022.\n\n\"We are thrilled to be able to present our first exhibition at Immagine New York in 2021 in collaboration with the design institute, the design center, and the artists who have come before us, as well as the artists who will come after us, together with the designers who have made such extraordinary contributions to creating new ways of looking at the world, not only through their work but also through their design and their spirit, and who have made such indelible marks on our lives through their designs, and through their designs and their lives, and through their designs and their designs and their designs, and through their designs and our lives, and through our designs, and through our designs. This exhibition will reflect that vision and be just the kind of retrospective that the brand has always dreamed of, and that is the ultimate legacy for Immagine, and the history of its brand, and the history of art in general, and the legacy of the brand, and art itself.”The show will be curated by Eduardo Cicutto, dean of the department of design at Pace University, and will be supported by a $25,000 prize that will be awarded to the first institution to present a work as well", "The next Biennial should take place in September 2019. The next Art Basel Miami Beach will take place in December 2020. The next Art Dubai will take place in March 2021.The next Art Dubai will be held at an undisclosed location in February 2021.It will also be the last exhibition at the venue. Throughout the production, the exhibition will be set in an original, four-story, neo-Gothic-style exhibition space, with a set design by the artist Maïla Aldous.Dubai Art Mall has announced that it will no longer stage the exhibition “50 Years of Biennial.”  The move follows a year in which the museum was forced to cancel Art Basel Hong Kong as a result of labor unrest. In January 2018, the museum grounded all of its traveling exhibitions, workshops, and events, and cut costs by eliminating close to a hundred positions. Since then, the Ajaz Sheikh Museum in Abu Dhabi has also reduced its working hours, and the Abu Dhabi Contemporary Museum—whose current programming is divided between two locations in Abu Dhabi—is expected to reduce its working week by 20 percent.Dubai Art Mall’s management said that the decision, which was made after considering various scenarios,", "The next Biennial should be held in 2020. \n\n\nThe Manchester Museum of Art (Manchester) has appointed Donna Maud Trotman as its next director. The appointment was made on April 24.“The Museum is delighted to welcome her to the team, and to have her as part of our team,” said manager Joachim Neumann. “We are grateful to David Hartley, the board and the staff for their confidence in Donna’s vision, talent, and energy, and we thank them for their understanding of the decision to leave. We wish her well.”In addition to her responsibilities at M, Trotman has served as a curator at the Los Angeles County Museum of Art, and has curated at the New Museum in New York; the Marquardt-Willis Museum of Art, New York; the New Museum in London; and the Metropolitan Museum of Art, the New York; and the New Museum in New Orleans. She currently serves as the director of the Manchester Museum of Art.Commenting on her new role, Trotman said: “I’m thrilled to be joining the team at the Manchester Museum of Art. The team’s exciting and ambitious plans", "The next Biennial should be held within the next twelve months.” The Biennial will present works by twenty-six artists from twenty-three countries and territories, including Hong Kong, France, Germany, and China. The selection committee considers the work of the workshop participants solely on the basis of the artist’s work, rather than whether or not they have received any kind of financial support from the government, which will decide on the final artists for the exhibition.Participating artists in the exhibition will be confirmed in the coming weeks. The exhibition will run from March 3 to March 3, 2020 in Hamburg and will feature work by forty-six artists from thirteen countries and territories. The 2020 edition will feature the work of seventy-five artists from thirteen countries and territories.\n\n\nThe California Council of the Arts (CCA) announced today that three hundred library and arts organizations have requested that the state of California suspend “all events and programming” as a result of the coronavirus. The organizations are requesting that California “take all necessary and appropriate actions, including establishing a statewide crisis plan,” including “setting up emergency funds and toll-free helplines,” and are asking that the coronavirus �", "The next Biennial should take place in 2021 and will simultaneously showcase new research and the work of the Biennials in the last four years. The final stage of the exhibition will include a symposium and a talk by the artist in which he will discuss the art of the present and how it can be used to create new creative work. The artist will also receive a lifetime achievement award. The prize will be funded by the CCFA, a foundation established by the International Committee of the Architects of Modern Life, which was founded in 2012 to promote the work of African architects, and is organized by the CCFA.\n\n\nAs the number of people in the United Kingdom dying from COVID-19 continues to rise, an international coalition of arts and cultural organizations is urging the government to spend more to help prevent the spread of the virus. While the number of people who have died from the virus in the UK is currently at 103,000, the UK’s Department for Culture, Media and Sport (DCMS) reports that there have been 1,496 deaths in the US and 5,947 in France.The newly formed group Citizens Against the Spread of COVID-19 is urging London, Manchester, Bristol, Liverpool, and the South East to form a", "The next Biennial should focus on issues of authenticity, which has been a source of discord between our shows, and should include an exploration of what it means to be a female artist in the contemporary art world, as well as an examination of the ways in which art is constructed around women, while simultaneously reflecting the intersections of art and feminism.”The 2020 event will be organized as follows:\n\nThe Science Museum London (SML) has released the full list of artistic curators who will be participating in the tenth edition of the Lewis Jackson Prize:\n\nFrom February 3 to April 5, 2019, the prize exhibition will be held at the SML from twenty-one locations around London and will be presented by Richard Taylor, director of Tate Britain, at the venue. The theme, “The Science Museum,” will be a collaborative venture between Tate and Mackintosh and will take the form of a joint project between Tate and Mackintosh. The event will take place at the museum from March 13 to March 16, 2019.“The Jackson Prize is an important means of supporting the extraordinary achievements of the twentieth century’s leading artists and the awardees represent a rich range of practice and practice,” said Mackintosh. �", "The next Biennial should take place in the spring of 2021, said the Ministry, and will be organized as a biennial of ten short stories, with a running time of three hours each. The winners of the first two awards will be announced in June and the finalist will be announced in September. The biennial will feature narratives from eighteen artists, including Joël & Ray, Nari Ward, Andy Warhol, and Oscar Murillo, as well as from the three recipients of the first award, Nancy Spero (2018), and Joan Miró (2016). The winner of the twelfth award, Maya Lin, will be announced in October.“The theme of the 2019 biennial is iteration, and the themes for the 2020 biennial are repetition and transformation,” said Sajid Jumars, the director of the National Gallery of Art. “We are looking forward to providing an ideal platform to showcase these stories, and to the artists whose work we admire, and to the storytellers who have inspired and defined their audiences.” The full list of winners is as follows:Nari WardFounded in Los Angeles in 1988, Nari Ward is an independent artist and filmmaker based in Los Angeles", "The next Biennial should take place in 2021 and should feature stories by artists working in different disciplines, including sculpture and painting, and should run for five weeks. The exhibition will also include an extension of the exhibition of the artist’s work, which was originally scheduled to open in December 2019, and will include a design by Bibi Porath, the founder of the eponymous Prada label. The entire installation will be live-streamed on the biennial’s website until October 27. The four-year project has raised more than $270,000 for the biennial, which was established in 2007 by the Los Angeles–based artist Phoebe Carthy.The biennial is preceded by a series of events and events that have taken place across Los Angeles and that are part of the Los Angeles Biennial’s mission statement: “The mission of the LA Biennial is to examine the possibility and the necessity of a new kind of urban experience through the research and development of new ways to live, work, and visit in the spirit of the city’s rich history as a laboratory.”The project has received support from the Los Angeles County Museum of Art (LACCA) and the Los", "The next Biennial should be held in the spring of 2020.  Members of the staff who are not departing immediately are being offered severance and compensation.  The staff also expressed their understanding for the decision not to seek compensation for lost income.  **We are aware of the fact that the history of the exhibition is a little bit peculiar in that we have had fairs in Auckland in the past, but never in Auckland, never in Christchurch, and never in Christchurch. We are also aware that our fairs are achieving better results now than they did fifteen years ago. We are very much looking forward to continuing the work of having those fairs in Christchurch at some point, and more importantly, reopening our fairs in Christchurch. From the staff, we welcome the opportunity to have this exhibition at some point in the future in the city of Auckland. We hope it will be the occasion for our fairs to have another successful season at the Exhibition, and that it will mark a turning point for the institution.\n\n\nThe National Gallery in London is planning to move six hundred works from its home on Pennington Street to the west of the city through a landmark £400 million renovation, thanks to the National Lottery Fund", "The next Biennial should be held in late spring or early summer, with the goal of getting the exhibition to an end by the third year. The institution hopes to hold the exhibition for three consecutive years.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it will invest $5 million in new public programming, remodels, and fundraising efforts to help raise funds for the construction of a new fifty-one-thousand-square-foot, fiscally subsidized, artist-in-residence center designed by the Los Angeles–based firm of Terrie and Chia, which will be located in the former Jack London Square in North Hollywood.“The Jack London Square Biennial is an ambitious project that has the potential to change the face of contemporary art and to set an example for creating a dynamic, artist-led civic space,” said Terrie and Chia president and CEO Glenn Ligon. “We’re thrilled to be working with MoCA in Los Angeles to make this project a reality and are committed to working with local, talented, and dedicated artists to make this center a reality. We thank the City of Los Angeles and the Los Angeles Downtown Council for inviting us to propose,", "The next Biennial should focus on how artform and identity intersect in contemporary society. This was the subject of a significant 2017 exhibition at the Royal Academy of Arts in London.“Throughout our history, art has provided a platform for social change and has been a powerful vehicle for political action,” said Ken Whittlesey, chair of the Royal Academy of Arts. “We are eager to see how the biennial will engage with and engage with the contemporary issues around contemporary art, and the upcoming events in the United Kingdom and internationally.”Whittlesey added that the Royal Academy’s new partnership with the University of the Arts, which will be inaugurated in September, will connect the museum’s collection with the university’s collection. The partnership marks the museum’s first engagement with the University of the Arts and will be a “family environment,” a reference to the museum’s new partnership with the Elephant and Castle Foundation.While the biennial will focus on African art, the Royal Academy will also present a wide range of international artists. The biennial will include stories and works by artists from Nigeria, Nigeria, the Democratic Republic of Congo, Egypt, Kenya, and Senegal; Yemen,", "The next Biennial should also focus on racial and social justice issues, the history of the National Museum of African Art, and the National Gallery of Canada. The Artists’ Cities program is slated to open in 2021.\n\n\nThe US House of Representatives voted yesterday to establish a national museum dedicated to the late African American artist, activist, and educator Tawanda Powell. The legislation, which was introduced by New York representative John Lewis, who was elected in a special election earlier this month, aims to establish a $1.3 billion fund for culture and education in the congression.“We are now just days away from a historic day when African Americans will finally have their day in the sun,” Lewis said in a statement. “This bill ensures that our nation’s collection of Powell will forever be a beacon in the history of our people.”A year after Powell’s death in 1964, the Selby Museum of Art in Atlanta began the process of rehabilitating the building by restoring its original stained-glass façade and adding the work of twenty artists and collectives to its collection. The institution also announced plans to open a new African American museum and community center in the city.The legislation signed by", "The next Biennial should take place in the coming months. “We are going to be open for the public, not just for the artists, and we are going to continue to invest in our public spaces,” said Jennifer Teitelbaum, director of the Biennial, Lincoln Center at the University of Nebraska, and architect of the show. The 2019 edition will be held at the Muskegon River Arts Center, which is currently undergoing a $40 million expansion, and will feature works by twenty-six artists. The 2019 theme, “Devotion and the Masses” is reconceived by the Uhovski family, who are the founders of the German industrial company Bayerische Motoren Werke, who were active in the early twentieth century. The family’s partnership with the Biennial was announced in February 2019. The 2019 show’s theme, “Time,” was inspired by a photograph by Hans Holbein taken in the mid-1950s, which shows a man in a laboratory wearing a laboratory coat during a time-sensitive experiment in a Bayerische Motoren Werke electronic chip factory. The man is wearing a laboratory chair, and the chip factory is next", "The next Biennial should be held in April 2020, with the exhibition marking the end of the exhibition’s fifty-fourth edition, which was held at the Musée d’Orsay in Paris and at the Musée d’Art Contemporain in Geneva.\n\n\nThe exhibition “ABT: Contemporary Art and Design” will return to the Musée d’Art Contemporain in Paris in March 2021. The show, which was hosted by the French arts ministry agency ALDE in association with the www.art-alle.fr and curators Pierre-Auguste Bassin (Closer, 2018), Ternébora Fattori (Monaco, 2018), and Jean-Luc Martinez (Manhattan, 2018), will be staged in the museum’s expansive exhibition center, the Musée d’Art Contemporain, which is located in a former munitions factory in the old quarter of Paris.The new exhibition venue will be inaugurated by a retrospective of Max Hetzler’s art, “Max Hetzler: Sculpture of Scars.” The exhibition will follow the 2020 exhibition “OMNIMON” at the", "The next Biennial should be announced soon.\n\n\nThe Jefferson Museum in New York has announced that it is moving its inaugural exhibition “The Babysitter: Artists, Women, and Sex” (2019) to winter 2019. The move was made in anticipation of the 2020 season. The exhibition, which was organized by curator Sarah Sze, will now take up three years to complete.“The new four-year project will be a collaborative project of the museum, the Philadelphia Museum of Art, and the artist-run organization the Babysitter Collective, and will include an exhibition of work by thirty-six women artists, including Meg Lank, Andrea Mitchell, and Adriana S. Flores,” said museum director Matthew Doyle.The 2019 show was inspired by the work of Sargent’s daughter, Helen Sargent, who was a prominent art historian in Europe at the time of its creation. “The idea was to do a show about how art and women had been and were becoming more intertwined in society,” said Doyle. “I’m thrilled that she’s coming back to the museum. The show will be a great platform for her new work and will help advance our understanding of how", "The next Biennial should be held in 2021. The new dates will be in line with the relocation of the exhibition and the expansion of the museum. The biennial will also be much wider in scope and include many works by artists who have not been exhibited previously. The new biennial will incorporate the work of a wide range of artists, from the Vietnamese contemporary artist Tran Van, who is known for his large-scale, immersive works, to the nineteen-twenties American artist Paul Gauguin, to the seventies Italian modernist, Fabio Filippo, who is celebrated for his drawings, paintings, reproductions, sculptures, animations, and videos.The museum is also planning to create a new biennial of contemporary art from the West, which will focus on “adapting contemporary art to contemporary needs and practices.” The institution has already commissioned two works by the Vietnamese artist Vuong Phuc and the South American artist Sergio Saavedra. The museum is also planning to stage a new exhibition, “Collected Histories,” in 2021 in order to coincide with the anniversary of the biennial, and to launch a new website, www.vindy.org, in 2020.\n\n\nThe Museum of Modern", "The next Biennial should be held in October 2021. The first will be held in March 2022.\n\n\nFor the first time, the British Museum has opened a branch in the Occupied Territories. The extension will bring twenty-six works by twenty-seven artists from eighteen countries into the institution, including Pakistan, Afghanistan, and the US.The institute has long maintained that Palestine is not an official part of Britain’s borders. However, following a campaign led by Amira Abidi, the director of the Arts Centre in London, the British Museum was forced to acknowledge that it has been complicit in the displacement of at least 1.4 million Palestinians since 1967 and to establish a policy of nonrecognition.The new exhibition “Palestine Artists’ Disturbances,” which is curated by Abdelrahman Idris, will open at the British Museum on September 23. The exhibition will feature work by nineteen artists, including Ahmad Jawad, Rachid Jarrah, Zahra Khalili, Kiango Pintar, and Antony Gormley, and will run until October 21.The work of the artists who were chosen is currently displayed in the exhibition “Palestine’s Art,” which opened at the", "The next Biennial should take place in 2022 and will provide an overview of the exhibition’s seven-year run, as well as an update on its collection and its research.  The 2020 exhibition was curated by Alex Katz, with an updated selection of the collection, which was opened in 2018, and was held at the museum in the former Tempelhof building as part of a larger project to re-create the Allied Artists’ House. The exhibition’s twenty-fifth edition, “The Art of the Impossible,” will also be hosted at the Contemporary Art Museum Stuttgart from 25 December to 5 January 2021.\n\n\nThe Walker Art Center in Minneapolis announced today that Taurean Rahman has been promoted to director of the newly established Walker Art Research Consortium. He succeeds Diana Masar, who has led the institution since 1996 and will assume his post in January 2021.“The commissioning of this new initiative was a natural extension of the visionary leadership of Taurean Rahman, who has led the Walker for nearly twenty-five years,” said Michael Walker, chair of the museum’s board of trustees. “We look forward to his continued leadership, vision, and energy as we", "The next Biennial should be held in 2021. The museum will be on hiatus for seventeen years from 2021 to 2023 to accommodate the completion of its new building, which opened in 2017, and to compensate for the anticipated loss of revenue from the closure of the Complex. The space will also be supplemented with a new exhibition, “Digital Capitalism and the Arts,” which will be curated by Marek Sotelo, the curator of European art. The second Biennial will be held in 2023. The Independent Trust for Britain (ITB) will also contribute twenty-six artworks and a collection of more than forty-five artifacts that were acquired through “the purchase, the rental, the sale, or the loan of art,” and is partnering with the Tate to bring the collection to the UK.\n\n\nThe Yad Vashem Holocaust Museum in Israel has revealed that it is planning to invest more than $1 billion into building a new facility that will address the mounting international concerns over the museum’s newly discovered holdings of Nazi artifacts. The €4.5 million ($5 million) expansion, which will include a new research library and a new exhibition hall, is expected to be completed by 2020.“", "The next Biennial should be held ten years from now. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has announced that it will extend the life of the landmark Granada Hills building by six years, extending the life of the cultural center’s original ten-year lease by ten years. The extension, which also extends the lease of the neighboring Granada Hills Arts and Dining space, is scheduled to take place in early 2021.“We are thrilled to extend the life of the Granada Hills Arts and Dining and the Granada Hills Arts and Design space by six years,” said Paula Scher, director of the institution. “We are also grateful for the generous support of our neighbors, the City of Los Angeles, and the employees of MoCA, and our supporters, including the Los Angeles Chamber of Commerce, the Los Angeles County Board of Supervisors, and the Los Angeles Mayor’s Office of Economic Development.”The extension will bring the total number of tenants in the building—which serves as a research and exhibition facility for the Museum of Contemporary Art (MoCA)’s permanent collection—to twenty-three. The lease agreement also includes a number of other renovations, including the", "The next Biennial should focus on “the progress of science and technology” and “the critical role of art in our lives.” The 2019 iteration of the event, “Art and Life in the Late Period,” will be held at the Spanish Cultural Center Santiago Bernabe in Madrid and will run from November 24 to December 7.\n\n\nThe Museum of the Fine Arts (MAS) in Minneapolis announced today that it will establish a new graduate-level research-and-academia-focused program in the humanities and social sciences at the institution. The new program will focus on the history of art through a combination of exhibitions, presentations, seminars, and books. Its inaugural exhibition, “The History of Art in America” (2019), will open at the Minneapolis Institute of Art (MIA) in January.The program’s faculty and staff will be appointed by the chair of the department of literature and the director of the museum. The announcement follows a year of work in the humanities and social sciences by MAS’s graduate-level research staff. The current exhibition “The History of Art in America” (2019) addresses the history of art from the perspective of art history and the history of art in", "The next Biennial should open in June 2020 and will organize three exhibitions: one for each of its respective genres (psychology, history, and architecture), and one for each of the three subject areas (history, art, and architecture) and will be led by a senior curator of modern art. The full list of participating artists is as follows: Boligai, Bahrain; Baha, Iran; BERLIN, Germany; BAGHDAD, Iraq; BAYIAN ART, China; BEIJING, China; BIRKENHAVEN, Germany; COVID-19, Germany; CHINA: ART OF THE SEA, China’s largest art fair in Asia; COCKERTON, New Zealand; DÃ�T O’NEIL, Australia; EL SEGUNDO, California; FITZGERALD, New York; THE MODERNIST CULTURE CENTER, New York; FISHING IN THE SEA, India; FAIRFAX, New Zealand;  FRONT: AUSTRALIA’s Project \"Tale of Two Cities,\" 2014–2015; FRONT: DAVID CUMMINGS, THE AMERICAN ARTIST, 1958–1968;", "The next Biennial should focus on the exhibition of work by young and established artists. The 2020 event will be held at the Museum of Modern Art in New York. The 2020 program will be organized as follows: Artists: Noël Carroll, Anna Eirikova, Ariana Kask, Bryan Lee, Carrie Mae Weems, Chau-Li Lee, Kirsten Maloney, Cheryl Miller, Eleanor Martin, Margot Sissac, Melissa Miller, Kameel M. Hussain, Huma Nouri, Nina Pangborn,Hannah Stegman, and Kara Walker.Other artists scheduled to participate in the 2020 edition are Rob Fields, Jamal Fathwaite, Sunil Ganguly, Sofya Ganesh, and Jinathan Jayapal. This year’s edition will be held at the National Gallery of Art in Washington, DC.\n\n\nThe Royal Academy of Arts (RA) in London has ordered the release of an exhibition featuring work by more than thirty artists across seventeen venues in the city. “This is a moment of transformation for the arts,", "The next Biennial should be held in 2021, but the organization’s board president, Yinka Shonibare, said that he expects the new iteration to be staged in the coming years. \n\n\nThe Sidney and Lois Eskenazi Foundation (SWEF) in New York has announced it will donate $150,000 in grants to the American Jewish Museum (AJM) in New York City—the first of its kind—in the upcoming biennial Art of ’80. The gift is part of the institution’s commitment to supporting the work of women and underrepresented artists in America. “Art is central to making a difference, and it is central to making art about important issues,” said Sidney Eskenazi. “The foundation’s gift, as a way of acknowledging the many achievements, and of demonstrating the commitment to supporting women, underrepresented artists, and other artists whose work challenges traditional conceptions of what art can be and what art should be.”The gift comes at a pivotal moment for AJP, which was founded by Sidney Eskenazi and Lois Eskenazi in 1983 and launched its first exhibition in 1988, and for women artists in", "The next Biennial should take place in the spring of 2020, according to a statement by the OPA, and will focus on the art of re-creation. The assembly will then conclude with a public presentation of works by twenty-five artists.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Phyllis Chesney as its next executive director. She will take the helm from Michael Shannon, who has led the museum since 2017.“We’re thrilled to welcome Phyllis Chesney to MoMA,” said Andrea Ruggiero, deputy director of the museum. “As the first African American woman to lead the institution as director, she is uniquely qualified to lead MoMA into the next century.”Born in Milwaukee in 1941, Chesney first attended the institution as a graduate student in 1984. She quickly rose through the ranks to become assistant director and eventually became director in 2013, when David Kordansky assumed the helm. She has since helmed the Central Gallery as a curator and curated numerous exhibitions, including “Wangechi Mutu: A Fantastic Journey” (2018) and “Mali: A Photographic History” (2018).Commenting on her current", "The next Biennial should be held in March 2020.\n\n\nThe American Institute of Graphic Arts (AIGA) in New York has appointed John P. Meyendor as its next executive director. Meyendor most recently served as the associate curator of print arts at the Museum of Modern Art in New York, where he helmed the “Marking the Ground” exhibition, which showcased work by thirty artists across twenty-five cities, as well as the exhibition “Inner Life” (2017). He will succeed Todd Dupuy, who has been named the AIGA’s new executive director, and will assume his responsibilities on September 1.“John is a brilliant, smart, and experienced leader who has been instrumental in shaping the AIGA into one of the most respected and influential contemporary art museums in America,” said AIGA president and CEO Carrie T. Olschläger. “The AIGA is honored to have John as our next executive director, and we look forward to working with him to realize our vision of a new rich and vibrant AIGA.” Dubbed the AIGA at Home, the home for all arts and cultural activities in the Greater New York City", "The next Biennial should focus on how it is possible to implement micro-transactions into the current digital economy in a way that respects the integrity of the digital ecosystem and its users. It also hopes to call attention to the different approaches taken by various states to introduce micro-transactions into their economies. At the time of the announcement, the festival was already involved in negotiations with KEFV and the artist’s collective, and had already received some $30,000 in sponsorship money from KEFV and Künstler Haber, among others.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Valentin Deco, an independent curator, as its next director. He succeeds Larry Gagosian, who has led the institution for nearly thirty years, and will take up the post on January 6. The news comes amid a tumultuous five-year tenure at the institution, during which MoMA’s board ousted three trustees and replaced them with an alternate board member, Stefan Preis. The interim directors are John Baldessari, Kwame Kwei-Armah, and Monica Lynne, and will serve for a sixty-day period until a new board of directors is elected.", "The next Biennial should focus on the current state of contemporary art, specifically on the way that artworks are made and maintained in relation to the current state of the global climate crisis. The theme of “Making Worlds” will be considered in conjunction with the theme of “Post-Modern Art” and the themes of “Art & Culture” and “Post-Environmentalism” and will be developed by a panel of artists, curators, historians, and scientists to address the current crisis.The exhibition will take place at the Art Museum St. Louis from March 18 to March 21, 2020 and will feature work by fifty-four artists. It will also feature fiction, nonfiction, and artworks by artists whose work is currently understudied, and will feature research by the artist-in-residence, artist-in-residence, and artist-in-residence program. The artists will be invited to participate in a virtual exhibition at the Museum of Contemporary Art Chicago in May 2020.“We are thrilled to be working with the artists who have participated so far in this exhibition to produce a new work for our 2020 Biennial for Contemporary Art at the Art Museum,” said Allan Kaplan, director of the", "The next Biennial should focus on the study of the spatial and temporal structure of the relationship between the political and the cultural. The theme of the exhibition should be “Cultural Power.”\n\n\nThe Museum of Modern Art (MoMA) in New York is repealing a $2 million donation it made to the institution in 2017 in the interest of transparency. The museum made the donation in recognition of the institution’s first African American president, Andrew Johnson, who signed the bill creating the Museum of Modern Art into law in 1965.Prior to Johnson’s inauguration, MoMA donated $1.5 million to the museum in support of the Johnson–Dietrich Haber Research Center, a new research center dedicated to the study of Johnson’s legacy. The donation was made in recognition of its role in the development of the American socialist vision of the future, which Johnson championed. The center is slated to open in 2021.“We wanted to give back to MoMA to show our support for Johnson and to emphasize that his legacy will shape the museum for generations to come,” said MoMA director John Lanza. “In the process, we hope to create an environment for broader reflection about the role of art museums in", "The next Biennial should be hosted in Hamburg, Germany, in 2022. \n\n\nThe University of Chicago will merge with the University of Notre Dame in order to become a full-time, academic-focused institution. The change will affect more than one thousand students. Students are already celebrating the merger, which will be made official on November 18, with a series of events, including the school’s annual College Openers, which is now open to the public; the new name, which will be announced in the coming weeks.“The merger of the two institutions is a step toward making the University of Chicago a truly academic leader in higher education,” said Nancy Spector, chair of the school’s board of trustees. “The merger also ensures that the University of Chicago remains a vibrant, innovative hub for creative and academic thought in the city and the country, while also providing our students and campus with a new brand and identity.”The schools will be split into two offices, one in Chicago and one in Northbrook, Illinois. The university’s new campus, which will boast of more than 1,400 rooms, will be located in the city’s Near North End. The new building will", "The next Biennial should take place in Tokyo, Japan, on the third floor of the Museum of Modern Art in Osaka, in 2020. \n\n\nThe National Museum of Fine Arts (MoFA) in Athens has received a donation of seventy paintings by the Greek artist Adis Glanvillaris from the artist’s sister, Nona Glanvillaris. The works are part of the New Museum’s international exhibition “Poseidon,” which will open in the city in the fall of 2020 and run through February 2021.The works, which were donated by the artist’s sister, have set the stage for an exhibition that will showcase the work of thirty-four artists slated for the exhibition. The exhibition, titled “New Worlds,” will feature works by fifty-eight artists, including Elisha Cuthbertson, Stavros Kounellis, Amos Kedar, Dawna McCauley, and Zoroë McKinnon. “The exhibition will include explorations of the artist’s ‘Greater Past,’ their theoretical and practical contribution to the development of contemporary art and the art of the present,", "The next Biennial should take place in 2020.<|endoftext|>I had the privilege of working with and mentoring artists and creatives in my first year at the ArtsCenter. The program has been instrumental in helping to shape my own career path. It has also been a source of inspiration and affirmation. “At its heart, ArtsCenter is about supporting artists as they continue to advance their work and express their creativity through performances, films, audio, installations, exhibitions, workshops, and projects. I have been privileged to work with and help artists who have made significant contributions to their communities and I am honored to continue to work with and project with them.”The newly renovated ArtsCenter is a collaboration between the City of Seattle, the Seattle Art Museum, and the Seattle Pacific Film Center, which together constitute the Seattle Art Museum. The museum opened in April 2018 and features more than 1,500 works by fifty-three artists. During its first year, the center featured works by artists such as Annie Donahue, David H. Simon, Gertrude Stein, and Thomas Alès. The midway also featured works by artists such as, among others, Steve Daniels, Wallace & Little, Jasper Johns, and Frank Malina.The museum’s new", "The next Biennial should be held in 2020. This is the year to reexamine the exhibition diaries and exhibition notes, to re-open the archives and to re-examine the exhibition program as a whole. For the first time in the exhibition’s sixty-year history, the archives will have a voice.”For Sussan Blum, the director of the Biennial, the decision to reopen the archives was a no-brainer. The artist and scholar told the New York Times that the museum had been closed since March 20, 2015 and that it had been in the works of several publishers to reopen the museum. “We have been talking about this for years,” she said. “We have been working with the public since March 15, 2015, and now we have the opportunity to create an open-records policy that will benefit artists and research institutions in the future.”The museum’s current policy, which requires that exhibitions of selected works remain closed until the end of the twenty-third biennial, has faced pushback from some quarters. Last year, a letter signed by twenty-seven curators and scholars, including Adrienne Edwards, Andre de Monen, Gabriel Garcia, and", "The next Biennial should take place in 2020. If all goes according to plan, the show will return in 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has hired Leslie Inman, a Chicago-based artist and curator, as its new deputy director for public engagement. Inman will be responsible for cultivating public awareness of the work and experience of the newly renovated institution, which rebranded as the Museum of Contemporary Art (MoCA) LA.“My name is Leslie Inman and I am the founder of the company Inman Artists & Collectibles, LLC,” said Inman. “Over the last twenty years, I have been championing the art of the contemporary, with a particular focus on the work of contemporary artists. Over the last eight years, I served as the director of the New York–based nonprofit MoCA Create NYC. In 2015, I was named the recipient of the Turner Prize for excellence in art.” “I’m honored to be asked to lead the Museum of Contemporary Art Los Angeles,” said Inman. “I’m excited to explore the experiences and work of the museum in a way that is both challenging and inclusive.”In", "The next Biennial should be titled “Prada,” a reference to the Italian designer and collector François Pinault’s avant-garde, Prada–inspired collections. The exhibition should take place in 2020, shortly after the museum’s reopening, and will run for three weeks.\n\n\nA group of artists and curators including Adrian Piper, Vito Acconci, and Thomas Campbell have launched a new initiative to counter the rise of white supremacy and neo-Nazism in Europe and the United States. “We are in the process of drafting a statement of values that will articulate our urgent concern for racial justice and anti-racist work in Europe and the United States,” according to a joint statement that was issued by the New York–based artists and the Los Angeles–based organizers of the #BlackLivesMatter protests.The initiative, called the European ResiliM, was founded in response to the events of the last two weeks, which saw hundreds of people from across the European Union protest against a series of controversial immigration policies, including the planned reintroduction of borders, deportations, and restrictions on refugees. As a result, the European Commission announced that it is planning to introduce a series", "The next Biennial should take place in 2020.\n\n\nThe artist-run nonprofit, the Museum of Contemporary Art (MoCA), in California, has been sued by a group of farmers after it closed its doors indefinitely to avoid paying thousands of dollars in fines for violating the federal Endangered Species Act by allowing dozens of threatened species to enter its grounds.The lawsuit, filed by environmental activists and environmental justice organizations, accuses the museum of failing to take appropriate remedial action and negligent misrepresentation, both of which are illegal under the statute § 9.31(a)(1)(i) of the act. The suit also contends that the museum violated the Endangered Species Act by failing to secure the animals' removal from the site before it declared its closure, and that the museum is responsible for the threatened extinction of the threatened species.“The Nature Conservancy has been committed to conserving and protecting critical habitats for millions of species since we began our mission in 1996, and we continue to work with partners to help them achieve their conservation needs,” said Diane Ravitch, director of the museum. “We are pleased with the outcome, and we look forward to continuing our work with our partners and our partners’ conservation needs met.”\n\n\n", "The next Biennial should take place in the spring of 2021, and the exhibit will consist of a group show comprised of thirty works by twenty-four artists. The 2019 exhibition, “MUSIC, THE STUDENT, AND THE STUDENT” was organized by the Museum of Modern Art, curated by Stephen Friedman, and opened on December 14, 2019. The exhibition included works by sixty artists, including Anahita Gupta, Benocean Marc-Andre Pinault, and Soraya Nadia. The 2020 event will mark the twenty-sixth anniversary of the Museum of Modern Art.\n\n\n\n\n\nLamart Eggen, the Danish curator who helped popularize the term “painting in tange” to describe a series of multi-layered paintings made by artists such as Jørn Sæde Nielsen and Vivian Størk, has died. He was ninety-five years old.Born in Copenhagen in 1920, Eggen moved to the United States in 1941 to study at the University of California, Berkeley, but returned to Denmark in 1948 to continue his art studies. He continued his artmaking in the late ’50s, when he began a solo"]