["The next Biennial should be held in 2020, and the first in 2021. Observations of the museums of the past years are an integral part of the design of the pavilion. The project will also include a retrospective of the work of the 20th Biennial of Modern Art in Moscow in 2021. The Russian city of Novosibirsk will be transformed into a museum of Russian art. The Pavilion of the National Museum of Modern Art, the State Museum of Art and Architecture, the State Museum of the Office of Culture and Sports, and the National Museum of Contemporary Art will all be housed in a building designed by the partner company of the artist and architect, Samara State Architecture, and will be inaugurated by a performance by the artist Katerina Kuzma.The artist participated in the construction of the pavilion in 2015, and her first solo exhibition was organized in the pavilion in 2020. She was selected for the Pulitzer Prize in Art in 2016.  The site of the pavilion is located in the city of Novosibirsk, in the center of the Russian Federation, in the republic of Karelia.\n\n\nCoca-Cola Bottling, the London-based conglomerate which owns British soft-dr", "The next Biennial should be held in 2030 and will be curated by Daniel H. Pink. The Biennial will be inaugurated by a virtual tour of the museum, featuring appearances by artists including Carsten Hoelgaard, Jan‐Ulrich Mueller, and Hans Ulrich Obrist. The exhibition will include a selection of works by artists whose practices are currently understudied or out of reach for the general public, as well as works that explore the concept of art and its relationship to social issues such as intergenerational mobility, the environment, and the body. The museum will host a digital edition of the Biennial in 2022. The 2020 edition, titled “Feminine and Structural” and hosted by the Museum of Modern Art (MoMA), featured works by seventy-eight artists, including Buffy Glaser, François Ghebaly, Paul Gauguin, Pierre Haussmann, Tanya Jacobsen, and Ramón Sabina.The 2019 edition, titled “The Shape of Things to Come,” and hosted by the Museum of Modern Art (MoMA), featured forty-nine works by forty-seven artists, including John Akomfrah, Manfred Breuer, Jesse James Olmos, James", "The next Biennial should begin with a review of the exhibition’s results, a deliberation on the future of the festival, and a discussion with artists and other stakeholders. Considering the current situation, it is essential that the biennial be initiated in a way that will give the museum the flexibility to react to the current situation.”\n\n\nThe Carolina Herrera Foundation, the Carolina Herrera Foundation, and the Carolina Herrera Foundation are teaming up to create a new scholarship program that will provide financial support to artists who have suffered a loss of income as a result of Hurricane Matthew. The organization hopes to raise $28 million to implement its “Pledge of Care” program, a fund that will provide artistic, academic, and financial assistance to hurricane-stricken artists across North Carolina.Its goal is to reach 100 percent of the funding needed to create a new scholarship program for artists who have lost income through the hurricane. The Duke University Art Museum in Durham, North Carolina, is already piloting a similar program that has provided aid to artists who are facing financial hardships related to Hurricane Irene, but it only offers grants of $5,000 or less. “The fund is here to help artists struggling with economic hardship,” said Marc G", "The next Biennial should focus on the history of the contemporary art of the Kaiserseeck Museum in Frankfurt, Germany, followed by an exhibition of work by the artist/design duo Wolfgang and Joachim Kremer in the city of Frankfurt, Germany, and the Krause-Baglisserie, Switzerland.\n\n\nThe Jamie and Ives Foundation, the Los Angeles–based organization that rescues and supports artists and small businesses in Los Angeles through a variety of grants and grants programs, has received a gift of $10 million from the billionaire brothers David and Frederick Lozano. The funds will go toward multiyear grants that will help offset the financial losses and medical bills caused by the Covid-19 pandemic.“The funds will help offset the financial losses and medical bills caused by the Covid-19 pandemic,” said David Lozano in a statement. “We are deeply grateful to our donors for their generosity in recognizing the impact the foundation has made on the city of Los Angeles. It is a testament to the foundation’s ability to consistently support artists and small businesses that we are able to continue to provide critical support for these hard-working artists and small businesses, and to continue to grow and thrive under", "The next Biennial should welcome thirty-five artists and will be held at the Haus der Kunst in Berlin in 2021. The theme of the year will be “the spatial intimacy of art.” The Haus der Kunst Berlin is seeking a new location for its 2020 event. Organizers are not planning to relocate the event, but are instead continuing to explore the possibility of moving the exhibition to another location in Berlin.Commenting on their decision to move the exhibition, organizers said: “We are pleased that the Biennial is here. We are also very interested in the new ways that people are able to connect with art in a digital way. In this case, to see art in a new way, in a different way, in a different way.”\n\n\nThe Museum of Modern Art (MoMA) has appointed artist-in-residence Anya Almeida as its next curator of African art. Almeida, who has been a curatorial consultant at MoMA for the past four years, will begin her position this fall and will work closely with curator Tarek Atoui. In her new role, Almeida will be responsible for making the case for MoMA’s holdings of", "The next Biennial should take place in 2019 and the project has been underway for almost five years. The exhibit will include work by thirty-nine artists, including James Turrell, Mark di Suvero, Wangechi Mutu, Thaddaeus Ropac, and Maria Rygos. Biennial director, Kinthujan K. Palaniswamy, said: \"The exhibition is an extension of what the biennials have been about for the last fifteen years: bringing together interdisciplinary and local work across India and around the world. I look forward to the next edition of the Biennial and to the next year of the exhibition.”\n\n\nThe Chicago-based arts nonprofit Center for Art, Design, and Innovation (CADI), which relies on grants, commissions, and the private sector to provide financial support for arts programs in Chicago, has received a $25 million grant from the Helen and John F. Kennedy Center for American Greatness. The Kennedys first made the Grant in 2013 to support the organization’s Bridget and Ira M. Kennedy Center for American Art, which serves as a hub for the arts and provides direct financial support for artists. ", "The next Biennial should create a forum for collaboration between curators and scholars from around the world. “The richness of contemporary art is at the core of the Biennial’s mission,” said Mark Joseph Stern, chair of the board of trustees. “This year’s exhibition will be the largest-scale exhibition of work by a woman artist to date. We are looking forward to welcoming the thousands of visitors to the exhibition and to creating an environment that will reflect the spirit of the Biennial.”The 2019 edition of the Biennial will take place at the campus of the University of California, Los Angeles (UCLA), and will be curated by Hernán Díaz, head of the national and international artist-run residency program. Among the biennial’s curators are Domenick Ferrer and Stan Brakhage, the Marcel Prouvé-designed exhibition “The Sacred Red Hot Potato,” and the biennial’s inaugural retrospective of Pablo Picasso. The 2020 edition will be staged by Marc-Olivier Gherard of the Museum of Modern Art, and will encompass the artist’s most recent works as well as biennial projects by some of the", "The next Biennial should focus on integrating film and television art from the Americas, Africa, and Asia. The event will be hosted by the Hong Kong–based museum, the Hong Kong Film Institute (HoFI), and the Hong Kong Sculpture Garden. The inaugural exhibition was staged in January 2018 and is slated to run until March 21.\n\n\nThe National Museum of Art in Washington, DC, has announced that it is working with the Los Angeles–based artist and activist Billie Tsien to create a new piece for its collection. The new work, titled The Colonialist, explores the relationship between the United States and China through characters from the American Revolutionary War, the American Civil War, and the ongoing legacy of slavery in the United States.“Billie Tsien’s recent exhibition ‘The Colonialist’ at the National Museum of Art, at the Los Angeles County Museum of Art, is a powerful example of how art can transform our collective understanding of the Americas and our connection to each other and to the world,” said curator Mary A. Pape. “A compelling and beautiful narrative about the relationship between the United States and the British East India Company, this work will continue to challenge the boundaries of American art and art", "The next Biennial should be held in the fall of 2020. Since its inception in 1992, the exhibition has attracted more than seventy thousand visitors, and has featured more than two thousand works. Its new seventy-five-year-long run, which began in 2021, is supported with approximately $10 million in funds from the federation of South American artists and cultural leaders, as well as an additional $10 million from the federation of Chileans and Chileans, as well as by an additional $10 million from the  FIMSA, and is slated to run for three years.The 2017 edition was held in the National Museum of Cartography in Bogotá, Colombia. The exhibition was curated by José Manuel Celaya, a longtime curator of Latin American art, and Javier Vázquez, a professor at the Universidad de los Andes. The exhibition featured work by seventy-six artists, including São Paulo Bacheños, Jorge Barrio, and Ana Mendieta, and explored the relationship between art and urban life in the Americas, as well as the legacy of Pablo Picasso and Sol LeWitt. The exhibition also featured a collection of works by the same artists which are currently on display in the", "The next Biennial should be held in the coming years. In the meantime, we are working with our partners to present an exhibition of the works of the past fifteen years at the Biennale de Lyon in 2022.\n\n\nThe Institute of Contemporary Arts (ICA) in London announced today that the institution will reorganize to incorporate projects from the arts and cultural sector into its programming. The ICA’s new strategy, “From the Arts” will provide ICA with the opportunity to return more of its funding to the arts, support the regeneration of London’s cultural sector, and develop new ways of supporting artists and creating and sustaining income for artists through new initiatives,” said curator and director Olga Asensi.The new initiative will leverage the expertise of the ICA’s board of directors, with special attention paid to its new partnership with the Tate. The project will investigate how the ICA will support and encourage the creation of new work opportunities through the arts, both as a platform and as a vehicle for social change.Commenting on the upcoming year, board director Rosanna Marmot said: “From now on we will put our money where our ideals are and invest in the artists and the artists’ ambitions", "The next Biennial should take place in late March/early April, with the exhibition running concurrently with Art Basel Hong Kong.According to a release from the London-based biennial, the exhibition will be held at both London and Hong Kong locations. The inaugural exhibition will be staged in London, which will host a total of eight shows, and the Hong Kong Biennale will be held at the Hong Kong Film Festival Center.The first show at the Hong Kong Film Festival Center will feature the second season of the biennial\u00972016\u0097on March 29–March 31. The exhibition will not be connected to the Hong Kong Film Festival. The second show will be held in London in September, with the Hong Kong Contemporary Art Fair in October. The third show will be held in Singapore in September.The London 2012 Biennial is currently underway. For more information, please visit www.film-festival.com.\n\n\nThe Metropolitan Museum of Art (the museum) in New York has received a $12 million donation from the estate of the late British artist David H. Martin. The gift, made on behalf of his children, Adam and Caroline Martin, and his wife, Joan, was made during a special fundraising event at the museum on April 3", "The next Biennial should be held in 2020, when the news that the end of the project will be celebrated with a new public exhibition, the 50th anniversary of the Biennial, will coincide with the sixtieth anniversary of the first Biennial.The project was initiated by the late sculptor Jean-Michel Basquiat, who was one of the first people to develop a practice devoted to the exhibition of art by artists outside of France, and has since been adopted by several other countries, including the United Kingdom, Spain, and Italy, and has been supported by various institutions, including the Louvre, the Musée d’Art Contemporani, and the Musée St-Etienne. The Biennial has been run as a public project for the past four years by the Museum of Modern Art in Paris.\n\n\nThe Association of Independent Curators (AIC), an international organization of curators and art historians, has announced that it has nominated the twenty-six artists who will receive the 2019 Noguchi Prize, which is awarded by the Museum of Modern Art in New York. The prize—which includes a $50,000 cash prize and a travel stipend—is one of three categories in the museum’s", "The next Biennial should be a showcase of the work of the biennial team. We will once again set up a platform for artists and will present them in an open and flexible way. We are open to any feedback and suggestions. We are committed to supporting the artists who have made the exhibition so successful.\n\n\nThe Maharashtrian art historian and curators Harish Khosla and R.N. Deendayal have been awarded the Bharat Ratna for their book Power of the Spheres: Tantras and Quantum Physics by the Indian Institute of Technology (IIT) in Mumbai. The three-volume collection—containing texts by Arjuna, Swami Vivekananda and Svetlana Ivanova—is considered one of the major works by the Tantra school of Hinduism. It also boasts of more than nine hundred works by artists whose names are not previously mentioned in literature or art.The IIT-M, however, is not taking the award lightly. In a letter published by the institute on Thursday, it said that the award was a “serious setback” and that it expects the IIT to respond with an “indefinite revocation.” In a letter dated February 27, Khosla", "The next Biennial should be held in 2021, and the 20th in 2019. The next iteration of the event will take place in 2021. “The biennial is an active project that has both the potential to take on multiple dimensions and to be an enduring community project,” Biennial chair Karen Hoberman said. “The largest challenge in the construction of the Biennial was to find a location that was both culturally and historically significant and to create a venue that would enable the artists of the world to come together in one space. The new space will be an important resource for the artists and will play a pivotal role in the programme of the biennial.”\n\n\nThe Pablo Picasso Foundation in New York has awarded a $10 million grant to the University of California, Berkeley, to establish a new center dedicated to the artist’s works. The gift, which was made in recognition of the arts and humanities’ undergraduate and graduate programs, is a significant step toward the organization of a new museum dedicated to Picasso’s life and work.The organization will receive $5 million from the Picasso Foundation for the Arts and $2 million from the City of Berkeley, which is cochairing the initiative. The grant", "The next Biennial should be held in 2020, the organization said. While the first Biennial, held in 1998, examined the history of photography, the current exhibition is centered on the history of the art, which will include works by thirty-six artists, including Mark di Suvero, Frank Gehry, Otis Redding, and Jacques Prouvé. “The Biennial will be a celebration of the richness and creativity of photography,” said Hélène Evrard, director of the Biennial de l'Arles. “It will confront the history of photography, the history of photography-as-art, and the history of photography-as-art’s artists, and explore the power and impact of photography in their lives and work.” \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Barbara Kruger as its next executive director. Kruger will be responsible for overseeing the museum’s curatorial team, art conservation, and educational programs and will take up her new role on January 12.“Barbara Kruger embodies the spirit of the museum and the mission of MoCA with the clarity and generosity of a woman who knows how to", "The next Biennial should be held at the Art Institute of Chicago, the Museum of Contemporary Art, Chicago, the Steinbach-Kahn Museum of Art, Berlin, and the National Museum of Fine Arts, Washington, DC, and will be presented by the National Gallery of Art, Washington, DC, the wonderful Laurence Dunbar Gallery, Detroit, and the Art Institute of Chicago.\n\n\nThe National Museum of Fine Arts (MoFA) in Washington, DC, has launched two new digital initiatives to help communities in need through the rapid response agency Blue Cross Blue Shield of DC.The initiative, called Blue Cross Blue Shield for DC, and is focused on helping low-income, emerging, and middle-income DC residents afford health insurance through Blue Cross Blue Shield of the District of Columbia. The free mobile app, which can be downloaded for free from the Museum of Modern Art or the Museum of Contemporary Art, can also be used by DC residents to report insurance fraud and is being developed by Blue Cross Blue Shield of DC and the National Alliance of Insurance Fraud Hotline, the nonprofit consumer advocacy group run by the National Association of Insurance Commissioners.While the app is free to users, it offers a tool that will allow Blue Cross Blue", "The next Biennial should be held in 2020; it has already been announced that the event will take place in the city of Biennale Barcelona.  The 2019 edition, which was curated by Lorenzo Pintotti, featured artists such as Ralph McQuarrie, João Brindisi, and Helen Frankenthaler.\n\n\nThe Metropolitan Museum of Art (MoA) in New York has launched a new digital platform that will allow the public to view the work of Andrea Dworkin, a German-born American artist whose career spans eleven decades. The platform, ÜPicasso” , will be hosted by the museum and will be launched on September 21. Using a new thirty-five-foot, six-inch, color television camera mounted on a pole, Dworkin will document how the American pop-artist creates images and sculptures that engage with spoken and written language, painting, and sculpture.The exhibition is inspired by the American painter Alice Walker’s body of work that explores the concept of “magic realism”\u0097a term used to describe a series of images in which the human body and environment interact with each other, both in paintings and sculptures. Dworkin’s", "The next Biennial should be curated by a man of my stature: archaeologist and curator Leo Sayer. He will work with me to create a set of exhibitions that examines the rapid evolution of nineteenth-century art through a broad lens, with a certain sensitivity for the way the collection and presentation of art has undergone changes over the years. We can also work together to create an exhibition at Tate Britain that will draw on the work of contemporary collectors, artists, and scholars.”While the project is far from a definite thing, it will include a series of meetings, workshops, and lectures with key figures at the museum in the form of a symposium. The museum will also commission a biography of the artist to be written by the artist himself, a representation of the exhibition, a display of his work, and a book of his art.The group will work with the artist and will present him in a series of installations that will unfold in a multi-leveled fashion, as the artist creates the show according to his schedule. The exhibition will present new works by the artist in collaboration with his own personal collection and will take place in the museum’s former space in South Kensington. The biennial will run from March 5 to March 6, 2020.", "The next Biennial should be held in the spring of 2022. The museum is currently closed until March 13.\n\n\nThe National Museum of Women in the Arts (MoMA) in Washington, DC, has acquired the collections of more than seventy artists from the private, nonprofit, and for-profit sectors in an effort to increase the museum’s holdings of underrepresented artists in the arts. The acquisitions, which are centered around issues of gender and social justice, include works by artists such as Ellsworth Kelly, Agnes Martin, and Frank Gehry, as well as works by lesser known artists such as Eileen Atkins, Wangechi Mutu, and Cody Rojas.Among the works that have recently entered circulation are works by Connie Mack and Judith and Thomas Stewart, both of whom were underrepresented artists in the museum’s collection at the time of their acquisition. Mack was a popular fixture at the institution, where she worked as an assistant curator of modern and contemporary art, and Stewart, who lived in the area, was an active member of the art community. The museums announced the gifts at a special event, which was attended by MoMA director and CEO Larry Fink and Michael Vu.“We’re excited to have these", "The next Biennial should be set up in 2020 to coincide with the seventeenth edition of the Bienal de Dubai. The first edition, which this year will draw from a core collection of sixty artists from fifteen countries, will open in June 2020. This year’s edition will also include a selected group of twenty-six artists from the Middle East and North Africa.The twenty-fourth edition of the Bienal de Dubai will take place in 2022. Dubai: It Starts Here, Dubai, will be held at the Dubai Events Centre from January 13 to January 15 and will run until March 20. The exhibition will also feature an exhibition of works by nineteen international artists.\n\n\nThe Metropolitan Museum of Art, the Museum of Modern Art, and the Whitney Museum of American Art in New York have agreed to jointly invest $50 million in the restoration and renovation of the two buildings that comprise the Museum of Modern Art in the city.“The Met and Whitney have long shared a passion for art and are committed to making this partnership fruitful and sustainable,” said Eric Dolgin, the president and CEO of the Met. “We are thrilled to contribute to the Museum’s ongoing mission to educate and inspire through the work of", "The next Biennial should be held in December 2021. \nArts Council London will be hosting a roundtable, meeting at Arts Council London, on Tuesday, October 22. Featuring shortlisted artists and creatives from all over the world, the event will focus on creative issues such as environmental justice, international migration, and climate change.Its inaugural edition, titled Letters from the Earth, was curated by artist Yoko Ono and was curated by Caroline Kern. Lectures and talks will be curated by art historian Joachim Neugroschel and art historian Jochen Haegue.The event will also feature a new series of exhibitions dedicated to women artists, curated by artist Nina Kenner­. The inaugural exhibition will feature works by three different groups: visual artists, writers, and artists from the Middle East and North Africa.  Tickets for the exhibition will be free for the public and will be on view until December 17. “These are the moments we live and die by,” said Nirvan At a press conference at the venue, where the exhibition will be housed for the next twelve months. “I will be going to the open—but only", "The next Biennial should be held in the second half of 2020, at which point the Museum of Contemporary Art (MCA) will evaluate the novel memorial and decide whether it will move forward with its planned 2020 exhibition. “When we made the decision to move the collection to the MCA in 2010, we were confident that the gift would go ahead as planned,” said Hiromasa Iwashiro, director of the MCA and the museum. “But we were also aware that the project required significant investment. We had hoped to raise some of that funds in the forthcoming exhibition, but the recent exhibition has left us with few options but to downgrade the project.” The move has also faced opposition from some local high school students, who have questioned why the theme of the forthcoming exhibition, “Decadence and Friendship: Contemporary Art in Japan,” was changed from “Decadence” to “Friendship.” In a statement, the MCA said the exhibition had been moved to coincide with “the reopening of the MCA.”\n\n\nFrench artist Rene Magritte has been awarded the Presidential Commendation for his project “The Neo-Impact.�", "The next Biennial should be held in 2020, three years from now.– The Smithsonian, the Metropolitan Museum of Art, and the New Museum in New York are currently working on revising their exhibitions plans in anticipation of the first exhibition of the new division, “Children in the Time of Crisis,” which will open in March 2021. The exhibition will feature works by forty-six artists, including Alexis Baillie, Christos Kaman-Dumont, Alighiero Paredes, and Hernan Mercedes.“What we are seeing in the exhibition is the culmination of decades of work by all those in the field,” said Doris Mason-Shapiro, director and chief curator of the contemporary art museum. “The ‘Time of Crisis’ exhibition will offer a fresh reinterpretation of the history of children, challenging the notion of the sacred as a stable of traditional values. It will also introduce new perspectives on childhood and the environment, drawing on the work of Jean-Paul Sartre, the ‘Children’s’s’s Movement, and the feminist movements of the 1960s and ’70s.”\n\n\nThe Catalonian state of Murcia", "The next Biennial should include more video installations by women and non-binary artists; a survey of contemporary art and artmaking in the '60s and '70s; and a selection of works by artists with disabilities.“Not a single year since has we had a full-time curator who isn’t a woman, isn’t a woman of color, isn’t a woman who is asexual,” said Virginia. “These days, I’m proud to say the curator in charge of the exhibition most of the time is a woman. The curator for the exhibition most of the time is a woman of color. I’m proud to say the curator is a woman. And I’m proud to say the exhibit is the largest and most influential exhibition of its kind in the country.”The 2019 edition of the biennial, “Bottle Present: Art from 1976 to 2015”, ran from September 19 to September 21. The show’s inaugural exhibition section, a four-hour film by artist Yoko Ono, featured works by forty-six artists, including Dev Patel, Paola Pindell, Robert Rauschenberg, and David Salle. The", "The next Biennial should focus on “Ecology,” or “How Nature Utilizes and Contributes to Our Lives” [2018], which will also feature a new paper by the German artist Max Hetzler\u0097a colleague of hers who died in 1941.Hetzler was working on a large scale at the time, creating a two-hundred-foot-long model of the atmosphere in his studio in the city of Künstler, Germany\u0097to animate the design of his home. The project is one of dozens created by the German artist in the ’60s and ’70s, and will be shown in an exhibition at the Museum of German Art in late September.\n\n\nThe Royal Academy of Arts (RA) in London has commissioned artist Yinka Shonibare to create a new work for its exhibition “Pinboard,” which will open on June 6, 2020. It has been a long time coming, but Shonibare has announced that the work, which will be on display in the museum’s current exhibition “Themes of Electric Behavior: Painting, Light, and the Concept of Electricity” will now open on September 6,", "The next Biennial should examine the history of the institution’s collection as well as the design of the museum’s current exhibitions and the upcoming performances of the Biennials. The theme of this year’s exhibition is “Institutions, Institutions, Institutionalisms: The Art of ‘Institutional Communication,’” and its first episode, “Future Present.”The first show to be presented by the biennial is “Architecture of Life: October/November 1893–June/Dayanukta.” In addition to the exhibition, the biennial is planning a “show of work” that will feature work by up to five artists and will be organized in a “spirit of cooperation.”The biennial will also present two short films, “The Evian Incident” and “The Last Days of the Indian Art.” Both films will be shown in the first show of the biennial. The show will be hosted by K.P. Baliga, the director of the K.P. Baliga Gallery in New Delhi; R.S. Baliga, the general secretary of the K.P. Baliga Society", "The next Biennial should be held in the spring of 2021 and will be named after the United States. Its theme will be “The Future Is Present” and will be “Anthropocene: A History,” marking the twentieth anniversary of the United Nations claim that the Earth is currently experiencing the effects of climate change.The exhibition will also include artworks by around sixty artists and collectives from twenty-five countries, including China, India, Egypt, the United Arab Emirates, Kenya, and Vietnam, and will be curated by Mark Yeoman, a former Arts Council curator, and Carolyn Y. Flanagan, a former curator at the Art Gallery of Ontario, and will be held simultaneously at the Tate Britain, the National Gallery of Canada, and the National Museum of Scotland.Inaugurating the event is a two-part exhibition titled “A History of the Future,” which will showcase the work of seventy-five artists from seventeen countries and will run for two weeks. The other part of the exhibition will be called “Anthropocene: from rocks to people.”The full list of participating artists can be found here.\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed John Fusi", "The next Biennial should be held in 2020, with an exhibition in 2021.  Following that, the exhibition will be moved to the Smithsonian American Art Museum (SAAM), and the show will return to London in 2022. “We are immensely grateful to the London and Scottish Governments for their guidance and support in bringing the exhibition to life,” said Matt Jones, the director of SAAAM.  “We are also grateful to the biennial’s artistic team, the trustees, and all those who have watched and participated in the exhibition over many years. We hope that this exhibition will serve as a model for the forthcoming exhibition and exhibition.” The Royal Academy of Arts, the National Ballet Theater, the National Poetry and Lyric Theatre, the National Ballet Theatre Scotland, and the National Poetry Trust will each have their own artists in the major titles of the twenty-first century. The Royal Shakespeare Company, the Royal Opera House, and the Royal Shakespeare Company, the Royal National Ballet, and the Royal National Opera Scotland have announced they will not renew their contracts with the Royal Shakespeare Company, the National Ballet, and the National Poetry and Lyric Theatre, respectively, in 2020.Previously, the", "The next Biennial should focus on the history of art in the Americas and will aim to present a “point of view” that is “far removed from that of the majority of the world’s art-historians,” the organizers wrote.  The first edition of the exhibition will take place in 2022.  The 2019 edition of the exhibition was organized by curator Hudson Alana and was held at New York’s Museum of Modern Art (MoMA); the Museum of Modern Art, New York; and the Institute of Contemporary Art, Chicago. \n\n\nA group of artists, writers, and other cultural workers in China have demanded that the Chinese government take direct action to protect cultural institutions such as the Beijing Art Museum and the Taipei Art Museum from a massive fire that broke out on Saturday. The fire, which was extinguished by firefighters on Sunday, February 16, is believed to be the worst fire in China’s history.According to the Beijing News, the fire had been contained by Sunday afternoon and the fire was contained by Sunday night. No injuries have been reported. The cause of the fire remains under investigation.The four-story museum, which was being renovated by the Beijing-based architecture", "The next Biennial should take place in 2021, and the 2019 edition was staged in 2022. In the first installment, the artist created a sculpture called The Babylonian Man, whose silhouette formed part of a maze. The work was in part inspired by ancient Babylonian shrines, and in the second, he made a childlike statue of a naked Dionysus, the god of wine. In the new work, the artist creates an abstractly pastoral landscape and introduces the idea of the Resurrection. In the early stages of the work, the artist creates a three-dimensional landscape around the sculpture, which is situated in the middle of a desert.The artist will have his first solo exhibition at the museum in January 2020.\n\n\nSinger-songwriter Jonny Greenwood, whose live performances, videos, artworks, and songs were inspired by the history of gender-based violence, have been called out for their appropriation of Indigenous and other cultures to create works that interpret and address issues of colonialism, genocide, and oppression.Greenwood was speaking out against the appropriation of his own culture in a video that captured his experience of homelessness and homelessness-related mental health issues in the United Kingdom. The video, titled The Big Sleep, was made in response to", "The next Biennial should be held at the Abbey of Notre Dame in Paris in November 2020. The next show should be held in June 2021.The Crown Prince of Monaco, Mohamed Al-Faisal, recently announced that he plans to depart the Middle East and head to New York in February 2021. He will assume the role of the country’s representative in the United Nations. The publication of a new edition of the Prince’s Watchtower, which focuses on the life and death of Prince Charles, will be held at the Palace of Versailles in April 2020. As of this week, Prince Charles has also been invited to the United Kingdom to visit the Royal Albert Hall during the month of April. \n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Melissa Chiu as its next director. Chiu comes to the institution from the David H. Koch Collection, a collection consisting of over one hundred works by artists including Richard Diebenkorn and Terence Blanchard. The institution also holds two works by Robert Irwin, a self-taught landscape and painting artist who had been living in a log cabin in the woods near the town of Kenoshek, New York, for the last seventeen years", "The next Biennial should be a strong presentation of the work of all the artists participating in the festival. I believe the words of the statement by the Audience of the Biennial will be a powerful message for the biennial’s organisers.” The 2019 edition of the Biennale will take place in Berlin from March 23 to March 26.\n\n\nThe Aarhus Biennale has postponed its twenty-fifth edition, which was set to take place in the Danish capital in March 2019, due to the Covid-19 pandemic. The biennial’s organizers cited financial reasons for cancelling the event, which was to have taken place between March 16 and March 19. “Originally we were hoping to have the exhibition in March, but we have to take into account the financial situation of the local Gallery in March and the Danish pavilion in March,” said Sylvia Balsom, organ of the Aarhus Biennale. “We are still looking for an answer [to] this question, but we hope that once the pavilion opens that the exhibition will still happen. But it is difficult to think of a fair in March, no matter how many good ideas you", "The next Biennial should take place in the autumn of 2020. \n\n\nThe Great Northern Exhibition in London has announced that it will not resume the annual biennial in March 2021, citing concerns for the loss of the exhibition’s programming. The twenty-sixth edition of the festival, which was axed by organizers in March after they failed to secure additional funding from the British government, will now be held in September. \n\n\nThe majority of the seventy-two artists who will participate in the seventy-ninth edition of the London Biennale in May 2020 are still at risk of losing their grants, according to Artnews. The 2018 edition of the biennial, titled “The City,” was held at Elephant and Castle, London’s only remaining elephant-shaped arena. The event featured seventy-eight works by seventy-six artists, who include David H. Dyer, Hélène Delaunay, Rosalind Wiseman, and Amy Sherald, among many others that were also staged at the Barbican in London and at the ex-Bibliothèque Nationale in Paris.The 2020 edition will be held at Tate Britain from March 18 to March 20, 2020. The show", "The next Biennial should be held in 2020, and the first in 2021. \n\n\nThe Museums Association (MA), a US-based trade group representing more than 2,400 museums, has announced the launch of an online platform that will allow participants to submit exhibitions and catalogue entries for its 2020 edition. Named the Mathematics of Life and Death Exhibition, the program is being organized by the Massachusetts–based organization the Massachusetts Institute of Technology (MIT) and will take place at MIT from March 3 to March 9, 2020.“We are thrilled by the prospect of bringing the exhibition to new audiences, and to provide them with an immersive and revealing digital experience,” said Kate Satterfield, MA’s executive director. “We believe that the exhibition will be a landmark in the museum’s history, and we look forward to presenting it in the fall to engage students, scholars, and the general public.”Inaugurating the exhibition are several new works by artists and new works by celebrated contemporary artists such as Yasmina Farquharson and Janet Ralph. The latter’s new work will be on view in the exhibition “After Life: Imaginative Art as New York”, which will", "The next Biennial should be staged in the autumn of 2021, when a new exhibition of thirty works, titled “Theoretical Modeling,” will open at the BAM Biennial for Contemporary Art in West Palm Beach, Florida. The exhibition will feature works by twenty-three artists, including Martin Akomfrah, Zina Saro-Wiwa, and Tanya Bonakdar, as well as a selection of texts by Kiera Cahn, Adam D. Weinberg, and Robert Irwin. \n\n\nThe Samih Art Museum Miami (SAM) has received a gift of seventy-five works by thirty-three artists, which were donated by the museum’s curators, Jane Middleton and Alain Guiraud, in collaboration with the Arts of Life and Death Foundation. The donation includes works by forty-four artists, including Juan Pérez-Ferrer, Hélio Oiticica, Emmanuel Saïd, and Alberto Sánchez.“We are extremely grateful for the gift of the artists, the gift of their culture, and for the support of the foundation,” said museum director Daniel Díaz-Villar. “These artists have made our mission possible", "The next Biennial should be held in 2021. “I’ve always wanted to be a curator, and the first time I was invited to the Biennial was to present “The House Bunny,” a retrospective of thirty artworks by Paul Gauguin in 2017 that garnered some $110,000. “From that year on, I’ve been a curator, and I’m certainly not going away anytime soon.” \n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Alexandra Gartenfeld as its new director. Gartenfeld comes to the museum from the Boston-based museum where she has served as interim director since June 2019, when the three-year-old institution was forced to shut down due to the coronavirus epidemic. She succeeds Alana Brown, who departed in October 2020 to head the Metropolitan Museum of Art in New York, and will be responsible for executing the museum’s long-term strategic plan.“Alexandra is poised to help transform the MFA, establishing new standards for collaboration and engagement that will strengthen our relationship with our communities and attract new audiences,” said museum director Daniel H. Weiss. “With a proven track", "The next Biennial should be held in the autumn of 2020. In the past, the 14th Biennial has been held every other year.\n\n\nThe Egyptian artist Waleed Ibrahim has won the Prix d'Art Contemporain (PAAC) in Paris for his work The Incense of the Lamps, a series of translucent incense lamps set in a desert courtyard. The abstract, geometric shapes and their thin, translucent insides are distinguished by their open lattices and irregular shapes that appear like a maze.The work, which depicts a hubbub created by a multitude of hummingbirds, is one of several by Ibrahim that have won the Prix d'Art Contemporain (PAAC). The other works featured in the exhibition include 'The Sun and the Moon, Early in the Morning, Late in the Evening, and In the Morning, Late in the Evening, and In the Morning, Late in the Morning, and In the Morning;” “In the Morning, Late in the Evening, and In the Morning, Late in the Morning, and In the Morning,” 2017, and “Wu Ma Wen, The Sun and the Moon,” 2010, among others.The Grand Prix winner is", "The next Biennial should take place in 2020. The event will be hosted by the Institute for Oriental Studies in Istanbul and will be comprised of three separate exhibitions: “The Late Hellenistic Period: From Hellenism to Byzantium” (21), which will be on view from May 13 to May 26, 2020 and “The Ottoman Empire: From Portrait to Fortress” (20), which will run from May 19 to May 26, 2020.The inaugural exhibition “Akman-e-Qurʾian” (2010), which marked the first show organized by the seventy-two-year-old institution, will open on May 5. The second exhibition “Beatriz de la Rosa” (2014), which was organized by the institute, will open on May 14. Both shows will be on view until October 17. The third exhibition “Aryan Art in the Pre-Islamic World” (2016), which will be staged by the Aspen Institute, will open on October 13. The fourth, “Nude in the House,” will open on October 15. The fifth exhibition “Australian Art at the Time of the Pity,” will open on October 10", "The next Biennial should feature three new works, both of which will be created by artists who have not been invited to Chicago\u0097Barbeth LeRoy, Kathleen Edwards, and Jonathan Albright\u0097but will take place in a former steel plant in Quincy, Illinois.“We are not at this moment seeking to change history, but to be a part of it,” said Frederick W. Egan, chair of the board of trustees of the Museum of Modern Art. Egan added that the new works will represent the collective effort of younger and older artists.The selected list of artists for the biennial was announced on Wednesday, March 4. The biennial will present a selection of work from the artist’s second exhibition at the Museum of Modern Art, “Remarkable Fears: Bookended by Artists,” which will run from March 17 to March 21. The exhibition will also present work by a collection of artists that includes works by Joanna Kamm, Bradley Brecher, Louise Bourgeois, Laura Owens, Joel and Ethan Coen, Marilu Dukovic, and many more. The biennial’s first exhibition, “Book", "The next Biennial should take place in 2021–22. \n\n\nThe French Ministry of Culture is preparing to launch an investigation into whether the Vatican City Museums in Paris and Rome intentionally suppressed the exhibition “Vatican City: Consumables” in 2016 to protect the institution’s financial interests. After a series of damning exhibitions that documented how the institutions were mismanaging the birth of the Church and the financial troubles of the Church’s predecessor, the Cànastà Institute, in Milan in 2006, the ministry appointed three new independent directors to oversee the institutions. The Ministry of Culture said that the investigations will determine whether the museums are fulfilling their duties under the auspices of the secretary of state. The ministry also said that it will take a more detailed analysis of the exhibitions if the institutions act in a manner that is “incompatible with the decisions of the ministry.” The articles below outline the current state of play.\n\n\nThe Lausanne Biennale, which was cancelled because of the coronavirus, has issued a statement about the upcoming edition. It reads: The Lausanne Biennale was not prepared to abandon its commitments to the artistic, cultural, academic,", "The next Biennial should be held in the autumn of 2019.The show will feature work by contemporary artists and will be organized as follows:We are currently seeking a new exhibition space for the next Biennial in Brussels. We are also looking for a new Director of the Biennial and a new artistic director. If you are interested in supporting this year’s exhibition, please contact Nina Kappel, director of the Biennial, at nina.kappel@thefreespace.nl. Nina Kappel Nina Kappel\n\nThe Fels Art and Design Museum in New York has appointed Austin Forgione as its new senior curator of contemporary art. He will assume his new post in January 2020, after which he will return to his current position as a curator in the Department of Arts and Design at the Museum of Modern Art in New York. Forgione previously served as curator at large at the Cleveland Museum of Art, where he has worked since 2001, and as assistant curator at the Museum of Modern Art, where he has worked since 2017. He is currently a curatorial consultant at the Gallery for the Arts in New York. “Austin Forgione’s curatorial", "The next Biennial should be held in 2021. \n\n\nThe Central Library of the British Museum in London has received a gift of thirty-six antiquities from Egypt in a collection that includes the sarcophagi of Eden of Edessa, Tutankhamun, and Nefer-El. The donation includes a set of eight sculptures, including two of the earliest known works that depict the death of Pharaoh Akhenaten, who reigned in the fourth dynasty of the Third Dynasty, around 2400 B.C. The sculptures, which are from the period of Akhenaten’s rule, were made from pieces that were recently unearthed in a secret location in Alexandria.“This is a fantastic gift to the museum and we’re looking forward to presenting it to the public at a great venue in central London,” said museum director Maria Balshaw. The items will be displayed in the museum’s first exhibition devoted entirely to Egyptian antiquities, “The Antiquities of the Egyptians: A Museum of the Past,” which will open on February 18. The show will also include other works from the collection, including a set of Egyptian funerary masks that were made in the second dynasty B.C.E", "The next Biennial should take place in September 2020, to coincide with the 30th anniversary of the Museum of Modern Art, which is currently undergoing a major expansion. The design, which will consist of five interconnected buildings with ten thousand square feet of exhibition space, is being created by the Berlin-based firm MOS, which has a long-standing studio in New York. The project, which will be co-organized by MOS, the Hamburg-based design firm Dies & Van Doren, and the German firm Fiske & Stadt, is being organized with a consortium of artists including Antony Hudek, Helene Schipper, Ed Moses, Barenaked City, and Alice Vergne Hart.Esther Schipper, the president and CEO of Fiske & Stadt, said: “The importance of the new museum complex cannot be understated. It will deliver on the Art Dept’s promise to present a truly contemporary and international collection of modern art, and it will promote an exciting new generation of artists. We are fully aware that this is a challenging task, but we believe this is the best options for the future.”\n\n\nThe Museum of Modern Art (MoMA) in New York", "The next Biennial should begin with a presentation of works by artists from the Asian diaspora, with a specific reference to the Korean diaspora. The next Biennial should begin with a presentation of works by artists from the Asian diaspora, with a specific reference to the Korean diaspora. The next Biennial should begin with a presentation of works by artists from the Asian diaspora, with a specific reference to the Korean diaspora. The next Biennial should begin with a presentation of works by artists from the Asian diaspora, with a specific reference to the Korean diaspora. The next Biennial should begin with a presentation of works by artists from the Asian diaspora, with a specific reference to the Korean diaspora. The next Biennial should begin with a presentation of works by artists from the Asian diaspora, with a specific reference to the Korean diaspora. The next Biennial should begin with a presentation of works by artists from the Asian diaspora. The next Biennial should begin with a presentation of works by artists from the Asian diaspora, with a specific reference to the Korean diaspora. The next Biennial should begin with a presentation of", "The next Biennial should focus on a historical reconstruction of the construction of the city of Bologna. The exhibition should discuss the history of the city’s buildings and the city’s artistic legacy. It should also consider the role of contemporary architecture in the city of Bologna and the city as a whole. The 2019 edition of the exhibition was held at the Museo de Arte Contemporáneo e Cultural in Bologna. The exhibition was curated by Diego Campos, the director of the Museo de Arte Contemporáneo in Bologna and the city of Bologna; Felipe Di Forti, the director of the Museo de Arte Contemporáneo, and Michele Rizzoli, the artistic director of Cinéma.The 2019 edition of the exhibition featured work by seventeen Italian artists, including Daniel Finkel, Agostino Cattelan, Federico Ciavarella, and Marcella Todi, as well as artwork by Lucio Fontana, Paolo Catellani, Shih Chieh Huang, and Wangechi Mutu. The 2020 edition is slated to be held at the Museo d’", "The next Biennial should take place in 2020. The Biennial Assessment will report to the Council in 2020. In the meantime, the Biennial Museum in Tuscany will be rebuilt in the city of Genoa. The proposal has been endorsed by the Venice Architecture Biennale Committee (BAC), the Venice Council and the Italian government. The building, which is being built in the Bagnasoli district of Genoa, will be inaugurated by a contemporary exhibition, “Pari Prima: Avanti Elettro,” curated by Luigi Catellani, and will be inaugurated in April of 2021. The project is part of the ongoing efforts to revamp the existing structure of the museum. The museum has opened a new modern wing, the Museum of Contemporary Art, and is working on the redesign of the existing building, which is presently the residence of the B.G.F. Rijks, the Flemish Congo Museum, and the Tromsø Museum of Modern Art.The new museum, which will be inaugurated in March 2022, will be designed by the firm Gensler & Sørensen. It will be housed in the former office of the Rijks", "The next Biennial should be held in 2021. The first will be in 2020.\n\n\nThe National Geographic Society’s newest museum, designed by the British architect Peter Zumthor, opened in London’s Tate Modern on Tuesday, January 28. The institution is the latest effort of National Geographic’s billionaire chairman, Cecil Manchester, to remake the landscape of the United Kingdom. The institution aims to bring together the world’s greatest naturalists from around the globe and is supported by a $5.46 billion campaign by Tate, which will award $1.15 billion in grants to museum organizations.The Institutions section of the museum features work by forty-seven new programs, and includes “The Cenozoic Era” (2019), an exploration of how life began on earth, and “The Last Ice Age” (2019), a comprehensive assessment of climate change and how it is impacting biodiversity. The third quarter of the museum also features a presentation of work by Carolus Castaldi, Catherine Cropper, John Colville, and Alex Da Corte, and their contemporaries, and a special exhibition of works by João Gil and John Akomfrah.", "The next Biennial should be held in 2020.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, has received a gift of four rare works by artist and inventor Erma Bombeck, who passed away in New York on Wednesday, June 4th at the age of eighty-three. According to the Los Angeles Times, the works were discovered by a group of people in the Los Angeles area who were searching for a way to preserve the works in a museum collection that had been on display in a special exhibition organized by the Los Angeles County Museum of Art (LACMA).The gift, made by relatives of the late chemist, gave the Los Angeles County Museum of Art (LACMA) the opportunity to acquire the items, which are the earliest known Flemish paintings. “The family is thrilled to be able to present the works to the public in these early years of the twentieth century,” director Lawrence Bahr said. “The addition of these early works to our collection is an exciting milestone for the museum and a testament to the hard work of the staff and volunteers, as we continue to create new opportunities to show these works by artists who define the twentieth century—Elgin, Kahn, and others.”Bom", "The next Biennial should be held in 2020. The announcement has been made through an open letter to the public from the artists who signed the open letter, which stated: “A good exhibition should be about something, a connection, a feeling, an experience; a journey, a journey into unknown lands and unknown cultures. We hope that the biennial will be an occasion for us to reflect on the wonders and the challenges of our world, and for others to witness and learn from our works.”\n\n\nThe Israeli government has approved a plan to build more than 6,000 housing units for displaced residents of the occupied West Bank, the Palestinian territories, in the next two years. According to the Jerusalem Post, the proposed expansion of the Ma'ale Adumim settlement complex, which will also include a museum and an educational center, was approved by the Knesset Affairs and Housing Committee in a 49-48 vote.“This is a historic day,” said MK Ahmed Tibi, chair of the committee. “It will be a historic moment when Israeli citizens, with the agreement of the government, can see the West Bank for the first time since 1967. . . . The construction of Ma'ale Adumim will be a", "The next Biennial should take place in the autumn of 2021. The development of the exhibition series, now in its fifth edition, was first announced by Art Basel in 2010, with Zhang Ye and Erik Altieri presenting the first exhibition in a new location: the San Francisco Museum of Modern Art (SFMoMA). The exhibition’s first iteration, “Smaller Is Better,” curated by Zhang, was held at the San Francisco Museum of Modern Art (SFMoMA) in 2011 and was moved to the Museum of Modern Art in New York in 2012. Zhang then moved to Shanghai for the inaugural exhibition, “Relic Tortoise,” curated by Altieri, at the Shanghai Museum of Art in March 2019, and the latter was presented at the Shanghai Museum of Art in June 2019.“In the early stages of the exhibition, we had invited a number of artists whose practice we did not expect to be present in Hong Kong—for example, the French artist Sylvain Kajbouni, whose work is on view in the exhibition “Museums” but not included in the collection, or David Bayliss, whose work was excluded in the show “Glass, Oil, Fire and", "The next Biennial should be held at the new site, which will be built in the city’s cultural district, in March 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Nicholas Stier, a former curator of modern art at the Metropolitan Museum of Art in New York, as its next director and CEO. Stier joins the museum from the Brooklyn Museum, where he has served as deputy director for the past two years, and will assume his post in January 2022.“We are thrilled to welcome Nicholas to the team,” Martha Taveras, chair of the board of trustees, said in a statement. “His deep experience and passion for this field aligns perfectly with our mission, and our vision for the museum as a living museum.”Stier previously served as the director of the Museum of Contemporary Art Berlin from May 2019 until March 2020. He also worked as a curatorial consultant for twenty-six cities in the US and Europe, including London, New York, and the US West. He’s currently a professor at the State University of New York at Cortland, where he teaches at the school of art and design.“I’m thrilled that the Museum", "The next Biennial should kick off in May 2021. Once the venue is fully up and running, the exhibition will return to a more traditional biennial format. A special exhibition of work by six artists, including Tersheva and Baghramian, will then be staged in September 2022. The twenty-third edition of the Biennale will then return in March 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in New York has canceled the upcoming edition of the Museum of Jewish Heritage (MoH), which was set to be held in January 2021, citing financial and scheduling concerns. The news comes days after the museum revealed its 2020 budget, which was funded through a $250 million endowment and which noted that it would need to raise $500 million to continue operating. The announcement came as MoH, which recently announced its intention to close its doors to the public and to begin a phased reopening in 2022, began to post an operating deficit. According to its president, William de Blasio, the institution anticipates a $125 million shortfall in 2021.Speaking to the New York Times, de Blasio admitted that his institution is facing a financial challenge that would require the creation of additional revenue, but said that he had decided to postpone the event", "The next Biennial should be held in 2020, and the first in 2021. \n\n\nThe Goldsmiths, the University of London, and the Institution of Arts and Design (I.A.D.) in London have appointed Rosaleen Akram as the first director of the London-based Future Art Institute (LPI). Akram will take up the post on September 1.The institution, which is housed in a converted factory in Paddington, is a hub for international research and publishing of art and design. It was established in 1983 by the late British designer Alexander Gilkes and his partner, the British architect Paul Smith. The pair launched their institute in the midst of the creation of the British pavilion at the Venice Biennale in 1992 and the London-based organization was founded by their son, Ben Goldsmith, to support their research.The institute currently has more than 2,500 researchers and has published several books, including Death of a Designer: Design in a Time of Crisis (2000) and Designing Women: Feminisms, Politics, and Politics’s Tracey Streep (2012).\n\n\nThe Smithsonian American Art Museum in Washington, DC, is launching a digital platform that will allow curators around", "The next Biennial should take place at the Museum of the African Diaspora (MoAD) in Johannesburg in January 2022. This year’s edition, “Between the Sun and the Moon: The Biennial of African Art” (2019), was curated by Ann-Marie O’Keeffe, the curator of contemporary art at the Museum of Modern Art, New York, and featured work by over seventy artists and collectives. The next iteration of the National Geographic–sponsored Biennial of African Art will take place in 2020.\n\n\nThe Museum of Modern Art (MoMA) in New York has announced that it is planning to remove approximately half of its holdings of Nazi-era art, which many people believe was acquired through forced labor, by building a new exhibition space in the building’s former space, the Chrysler Building, which is currently undergoing a $1.4 billion expansion. The museum will also introduce a new group show titled “Victory at Any Cost: Art and Resistance” and will open a new, larger collection of work by a select group of contemporary artists in March 2022.The move was made in response to a new survey commissioned by MoMA and analyzed by the Institute for Historical", "The next Biennial should be held in the fall of 2020, and it will be curated by the same curators who have curated the preceding iteration of the exhibition. The theme will be “The Notion of Humanism and the Art of the Body” and will encompass “harmony, ” “non-conformity, ‘harmonization, ‘dematerialization, ‘non-living, ‘living well.” The exhibition will also feature three previous works that were staged by the same team at the same venue, and the first work will be a “final concept” work, for which the artists are returning the entire collection to the public.The exhibition will be held at the Museum of Contemporary Art Minneapolis, the National Gallery of Art, and the Art Institute of Chicago. The winner of the $10,000 biennial prize will be announced at a later date.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles (MCA), has announced that it is planning to move the fifty-six-year-old museum from its current home on Melrose Avenue in downtown Los Angeles to a new, expanded facility on the city’s Westside. The remodel,", "The next Biennial should focus on the life and work of Vera Rubin, a pioneering American artist and educator whose work is representative of the multidisciplinary and interlinked projects of twentieth-century artists. The prize ceremony will take place on September 4 at the Museum of Modern Art in New York.The 2019 Biennial will consist of two exhibitions--one biennial-only and one “connecting the dots” exhibition, which will open at the Museum of Contemporary Art Miami. The first, “The Internal Life of a Corporation,” will examine the relationship between art and corporate work and will feature curatorial works by Maya Dziewior, Rebecca Carson, and Michael Jordan. The second, “The Creative Life of Society,” will feature work by a group of twenty-nine artists whose work explores the history and philosophy of intellectual life. The artists who are eligible to receive the prize include Evan Williams, Adrienne Edwards, Kim Gordon, Mark Griswold, and Sarah Michelle Ghent.The 2019 prize jurors included Frank Gehry, Joan Miró, Helmut Newton, and Malcom Goldsmith. The winner of the prize will be announced in October.\n\n\nThe Tophane Museum of Art", "The next Biennial should include the first show by the internationally acclaimed artist, Mel Chin, who has been commissioned to create a radical new installation for the event. The winner of the Prize will be announced in December.\n\n\nThe Metropolitan Museum of Art in New York has announced that the Metropolitan Museum of Art will re-envision its 20-Year Anniversary as a Museum of Modern Art (MoMA). The move will mark the museum’s first step toward transforming the institution into a museum that represents the full range of American art and will open up new gallery spaces for the museum.The museum will receive an additional $200 million from the state of New York in its capital campaign to attract more visitors, expand its collection, and improve facilities. The money will also be used to expand the museum’s online presence, create more affordable tickets, and improve public transportation.The project will also include the construction of a new building, the Metropolitan Museum of Art, for exhibitions and new programs. The museum’s existing building, which is slated to be demolished in 2021, will undergo renovations. The new museum will be eight thousand square feet larger and will reside in the city’s historic Fulton Houses, which were built in 1937 and 1961. The museum", "The next Biennial should focus on the history of art in the Americas from 2007 to 2020 and should include a presentation of a selected work, subject, or art from the exhibition.”The 2019 biennial, “Gathering Shadows: Indian Art in the Americas” was curated by Harjant Gill, who heads the Delhi-based museum Jaipur. The exhibition, which features works by seventy artists, is organized around the themes of “the dream of dreamers,” “dreams of the dreamer,” and “dreamers in the real,” focusing on the body, dreams, dreams in the dream world, and the dream of the dreamer.“It is an honor to represent India in the first exhibition of the newly commissioned book on Indian art and the exhibition of the newly commissioned biennial on art in the Americas,” said Harjant Gill.The biennial will be inaugurated by “Dreamers in the Real” (#DreamersInTheReal), which will be on view until September 17. The exhibition will include the work of forty-nine artists whose works are currently in the collections of more than two hundred institutions across the globe. The biennial", "The next Biennial should be held in 2020 and in the meantime, the next edition of the Biennial will be staged in 2022.The announcement of the redesign came shortly after the fifty-fifth edition of the Eighth Biennial, held in the São Paulo district of Brazil. The event, which brought together twenty-one artists\u0097Carlo Antunes, Gabriel de la Pava, Hélio de Cesarco, Julia Li, Anastasia Marinova, and Iñigo Marais\u0097was canceled due to the Covid-19 pandemic.Founded in 1971 by José Paulo Pereira, José Paulo Pimentel, and Gisenea Peixoto, the biennial, which was cofounded by Pereira and Peixoto, was known for its in-depth selection of work from the contemporary Brazilian art scene. In its fifteenth edition, which was held in Bernardo, Brazil, in June 2016, the festival received a total of twenty-eight artists\u0097from eighty countries and forty-four different countries\u0097in its run.\n\n\nThe Institute of Contemporary Arts (ICA) in Frankfurt has announced that it is partnering with the German federal state of North Rhine-Westphalia (NRW)", "The next Biennial should be on the subject of the dismantling of institutions, and the organization’s relationship to the current situation, the Art Newspaper reports. The biennial will include a selection of interviews and performances, curated by an international panel of eight artists, selected by the curator, creating this year’s theme of the dismantling of institutions.“The panel, comprising Yinka Shonibare, artist and curator; Cheryl Shagwell, curator and artist; Honoree Nancy Fraser, curator and artist; Craig Anderson, director of the SculptureCenter and a former president of the Art Museum Baltimore; and Nobel laureate David Mead, director and chief curator of the Museum of Fine Arts, Boston.”The biennial will be presented in conjunction with the biennial of modern art in New York City.\n\n\nThe Inches: A Catalogue of Women’s Art, 1750 to 1910, is back on the market. The nineteenth-century catalog was reissued by Galerie Anhalt and includes new works by thirty-seven artists, including three from the Netherlands, Germany, and the United Kingdom, and includes seventeen works by male artists,", "The next Biennial should take place in 2020 and will be hosted at the Hiroshima Museum of Art, Japan.\n\n\nThe New York–based artist Lee Krasner, whose surrealist drawings and sculptures often grappled with the theme of intelligence, will receive the Nobel Prize in Arts this September. The biennial, titled “The Structure of Modern Life,” will be held at the Museum of Modern Art in New York and will conclude with a screening of his work at the Brooklyn Museum.Krasner, whose body of work comprises more than 170 paintings, drawings, sculptures, and installations, was nominated for the honor by a committee headed by Christopher France, chair of the Nobel committee, and comprising Hans-Ulrich Vermeer, head of the committee, and Shelly Schipper, the director of the Santa Monica Museum of Art.Vermélemy Glimcher, the curator in charge of the exhibition, said: “The latest biennial has given us a rare opportunity to witness the artist’s vision firsthand. The exhibitions reflect the way in which the artist brings together disparate disciplines to explore the ideas and the materials that make up his art. The impact of his work in shaping contemporary art is felt in the design of the", "The next Biennial should be held in 2020.\n\n\nThe new exhibition “Spirited Away” will stage a retrospective of photographs by Allan Khodge, an American photographer who lost his entire family in a plane crash in 1958, at the Museum of Modern Art in New York on December 14. The exhibition is curated by John Muir. Khodge was born in Brooklyn, New York, in 1932. He moved to New Orleans in 1957 and grew up in a predominantly black city, attending both public and private schools. In 1965, Khodge married an African American woman, Mable Lewis, and had two children. In 1966, Khodge returned to New Orleans and enrolled in the city’s prestigious art and design school at the University of New Orleans, the Noyes, but left school in 1968 to pursue a career.Khodge soon became interested in the American South through his work, which often featured African American subjects, including Thomas Kentridge, who was the subject of Khodge’s first series of African American portraits, in 1967, and Jesse James Earl Jr., the subject of his second series, in 1973. He eventually became known for his pictorial work, which he said was inspired by �", "The next Biennial should be held in the second half of the year, and the next will be held in the third. The site of the upcoming exhibition will be preserved as a cultural monument.The venue will be inaugurated by presenting an exhibition, “Between the Sun and the Moon: New Art from the Near and Far.” The show will invite visitors to experience “Life in the Valley,” a work by artist Jirad Raheel and will be inaugurated by a presentation of the artist’s triangular model for the Nation’s Capital. The show will feature works by twenty-six different artists and will run for ten weeks.Exhibitions\n\nThe Museum of Modern Art (MoMA) in New York is launching an online-only exhibition dedicated to the art of the Pacific Northwest. The show, “Between the Sun and the Moon: New Art from the Near and Far,” will be presented by the National Gallery of Art and will open on September 7 and run through February 13, 2021. The program will also include a public lecture series, a selection of works by Pacific Northwest artists, and a virtual tour of the new MoMA’s Pacific Northwest Research Center, which will", "The next Biennial should be held in 2020. His replacement will be chosen by a three-person panel comprising Hesselbrock, Antti Raanta, and Olli-Anna Jääs. The biennial will be a platform for the exhibition of work by internationally known contemporary artists. The selected artists will have two months to present a work for the exhibition.\n\n\nA group of artists, designers, and writers who have participated in the Venice Architecture Biennale have launched a campaign to have the exhibition canceled. The artists and designers who have signed the petition are Dr. Fatos Üstek, who works primarily in painting, and Osman Ochman, who works primarily in sculpture and video.International Art Festival organizers announced in June that the event would be canceled due to the Covid-19 pandemic, and the organizers noted that it is currently taking steps to reduce the number of its artists taking part in events and other activities.“We were not aware that the upcoming exhibition would be impacted by Covid-19,” Ochman told the Art Newspaper. “We are trying to reach out to the artists who are participating in the event to try and help them understand what is happening in their own contexts and to", "The next Biennial should be held at the embassy or consulate of the United Kingdom from September 16 to September 22, 2020. The museums will also collaborate with the Tate and the Royal Shakespeare Company to present new activities and exhibitions for September 2020. The venue will be located in the summer Olympic Park in London and will be inaugurated by a solo performance of a selection of British artists, including Jim Thompson, John Galliano, Diane Arbus, and Paul Gauguin, at the exhibition's inaugural stage in March. The actual building of the museum is being organized by the British Association of the Arts (BA), the National Gallery of Art, the National Portrait Gallery, the National Portrait Gallery Scotland, the National Museum of Britain, the Royal Shakespeare Company, the National Museum of the African Diaspora, the National Museum of Modern Art, the Royal Mint, the Royal Opera House, and the Royal Shakespeare Company.\n\n\nThe Palazzo Reale di Valentino in Italy, which was founded by designer Ciro Silvestro in 1988, is planning to move to a new location in the city of Reale in the Italian province of Piedmont. The organization told the Art Newspaper that the move was made due to the increase in", "The next Biennial should include an examination of how art is produced in the contemporary African diaspora, and a consideration of how the artworks of the past are used to advance the present.”The full list of participating artists is as follows:Bikash Dzhemir, Algeria (officially)Cebuano (officially)Celenite Art, MexicoCity (officially)Celena Antillett, Norway (officially)Cécile B. Testotto, Italy (officially)Cécile B. Ziegler, Mexico City (officially)Célène Balsom, France (officially)Cétom Brunelle, France (officially)Célo Chedinger,  Germany (officially)Cétorica Colombo, Italy (officially)Celeste de Vries, Switzerland (officially)Celotte Delph, South Africa (officially)Célène Eli, Canada (officially)Cérès Hennessey, France (officially)Cétharina G. de Bont, ", "The next Biennial should be held in 2020, but a full schedule has yet to be announced.  Advertisement\n\n\nMore than 300 artists are preparing to participate in the first ever People's Art Fair, which will be held in August in Beijing. Organizers have announced that twenty-seven artists have been invited to participate in the event, which will take place at Hangzhou International Airport in China from August 25 to August 28. Each winner will receive $3,000 in cash. The artists chosen to participate in the fair are Tian Qi, Yifeng Yu, Zheng Jian, Darius Hossain, Jing Tian, Andrea Fernandes, Liu Yu, Kasmin, Tian Yu, Andrea Fausini, Anna Hanska, and Ashley LaBouvier.“We are extremely excited to present the first edition of the People’s Art Fair in Beijing in August 2020,” said Ma Yan, the director of the Beijing Art Museum. “With more than 2,400 artists from thirty-two countries and territories, the fair will showcase a collection of more than 2,400 works that has never been presented before at such a high", "The next Biennial should be held in the spring of 2020. The first, dubbed “The University of Biennials,” was announced in March 2018. It inaugurated three new fully digital urban spaces: the BÄM Museum in Bilbao, the Museum of Contemporary Art in New York, and the Museum of Contemporary Art Miami. The 2018 edition saw a performance by the Biennial’s first artist/researcher, Simon Ghebaly, and was comprised of exhibitions organized by artists, including Isabel Malo, José Eduardo Rodríguez, and Mira Delahanty.\n\n\nThree-hundred and twenty-six artists and collectors have signed an open letter expressing concerns over the upcoming biennial “All in the Picture,” opening December 17, and urging the exhibition to end its relationship with Israel and shift its focus to “sustainability and social justice.” The letter reads: “This is a time of great uncertainty for many communities and it is therefore an issue of great concern for the artists who are represented here. . . . We write to you with a sincere sense of hope that the exhibition will continue to be a platform for dialogue and discussion and will", "The next Biennial should be held in 2019.\n\n\nThe paleoclimatologist and author David McCullough, a coeditor of the forthcoming book The Last Glacial Maximum: The Search for Ice in the Sky, has resigned from the Royal Society of Edinburgh in the UK in protest of the organization’s support of climate change. In a statement published on the group’s website, the Royal Society said: McCullough will not be attending the 2021 edition, which will be held in September, despite having been invited to this year’s event.“While we respect David’s decision not to attend the event, we believe that the Royal Society has made it abundantly clear that they do not accept the scientific consensus that our current system is causing disruption and death to our climate system,” said Roy Spencer, chief executive of the Royal Society. “It is our view that this is a public health emergency and we have a responsibility to act.”The Royal Society’s actions have led many, including the US Environmental Protection Agency, to question the scientific consensus that human activity is the primary cause of climate change. In response, the Royal Society is attempting to come to terms with the fact that it is one of", "The next Biennial should take place in the summer of 2020. The next edition of the Essen Biennale will take place in the autumn of 2020. The next edition of the Berlinale will be staged in the spring of 2021. The next edition of the Milan-Milan Triennale will be held in the spring of 2022.  More information about the foundations of the various categories can be found here. \n\n\n\n\n\nThe Museum of Modern Art (MoMA) in New York announced today that it is working to have its new Steven Fletcher Hall, which opened in January 2019, completed by the end of 2024, and is now negotiating with a design firm to bring its exhibition space to the museum. The institution also noted the opening of a new three-dimensional research center dedicated to the artist and to its acquisition of several works by artists that will inaugurate its new 360-degree Guggenheim in January 2021, and will begin presenting its collection in 2024.“A new, collaborative partnership between MoMA and the Fletcher Foundation will enable us to put our center’s collection to good use in the coming years,” said David Guggenheim. The center, which will consist of a new 360-degree glass-", "The next Biennial should unfold as follows:\n\n6:30 pm – 8 pm. Astatica Plaza, Miami Beach; $10 presale.\n\n7 pm – 10 pm. The Bessie atrium, New York; $10 presale.\n\n\nJill Stein, the Green Party nominee for President, is now demanding that the Federal Communications Commission (FCC) take direct action to halt the sale of radio and television broadcasting licenses in the United States. The Michigan-based artist-activist has helped launch a campaign to shut down the sale of licenses by amassing a list of nearly three hundred artists who are running for reelection on the Green Party ticket, and is encouraging other voters to join her cause.“We are calling for a complete moratorium on new broadcasting licenses for a period of ten years,” Stein told Artforum. Green Party chair Elizabeth A. Warren said: “While the FCC has placed tremendous restrictions on the sale of broadcasting licenses, the current system is not working. In fact, it is already having a chilling effect on the free and open exchange of ideas, creating a climate of fear and intimidation which is antithetical to the mission of the FCC. If the FCC continues to sell licenses at this", "The next Biennial should feature a selection of original works, which will be organized in a similar way to the 50th Anniversary, and will take place in the fictional city of Baden-Baden, Germany, which is currently being developed as a kind of American Neo-Geo and will be located between the city of Württemberg and the city of Bonn. The project has also been created as a concept for a show in 2018 at the Württemberg Academy.\n\n\nThough the Palais de Tokyo in Paris has been the center of some of the biggest international art fairs in the world, the institution has faced numerous disruptions in recent years due to the coronavirus pandemic. In March 2019, it reopened a few months later, after a major investment of $100 million. Since then, the fair has been plagued with delays, cancellations, and a series of record low attendance numbers. In February, the venue abruptly suspended its 2020 edition, which was scheduled to run from March 11 to March 12. The French Ministry of Culture announced in March that it would guarantee the financial support of the fair through 2020, with four months to spare, and that the decision had been made on March 6. The announcement prompted numerous protests", "The next Biennial should be held in 2020. \n\n\nThe museum has released photos of the work that will be featured in the forthcoming biennial, “Beyond the Pale.” Art historian Angela Bickel and the San Francisco Museum of Modern Art (SFMoMA) are among those who have endorsed the show. The work, which was first exhibited in 1973 at the Museum of Modern Art in New York, was acquired by SFMoMA in 2017 and is currently housed within the museum. The biennial, which will explore contemporary issues such as poetry, art, and philosophy, will address issues like “The Limits of Photography,” an exhibition organized by the National Gallery of Art and the Smithsonian American Art Museum in Washington, DC, in 2017. In a letter penned by Bickel to SFMoMA staff in 2018, Bickel wrote: “As a poet, a historian, and a scholar, I am deeply moved by the work of Paul Mikulski. His experimentation and exploration of photography is as vital and as essential to the future of photography as photography itself. I am confident that the work of Nick and Ursa will further this project and give us a new chapter in photography’s history.", "The next Biennial should be in 2021 and will include an exhibition of work by contemporary artists to coincide with the Fifth Biennial. The theme of the event will be 'Dispatches from the Heart'. “Last year we created this exhibition’s inaugural showpiece, ‘In the Name of the Father,” and this year we are excited to introduce a new show, ‘The Unseen,’ which will explore the contemplation of the living, as embodied in art. The program will also incorporate a new play, ‘The Shadow of the Spring,” and will highlight the work of women artists and will introduce a new work by the Danish artist Mabel Dallesø.\n\n\nArtist Chancellors of the Metropolitan Museum of Art (the Museum) of Modern Art (MoMA) in New York announced today that Yael Auerbach has been named the next director of the museum. In his new role, Auerbach will assume his responsibilities from executive director Daniel H. Weiss on January 6, 2021.“We’re honored to welcome him to MoMA in the first place, and to have him take up the role of director,” said Weiss. “He’", "The next Biennial should open in 2022. \n\n\nThe Bodleian Library in Oxford has released six new works on paper by the biennial–winning artist Olivier Assayas. The works will be made available for free download as part of a six-month subscription to the Bodleian Art Archive (BAA), an initiative launched by the Bodleian Museum in 2014 to bring the works of Assayas, John Ahearn, and João Brindisi to the public through exhibitions.Based in Paris, Assayas, a French art historian and scholar, draws from his practice to analyze how the materials we use to create and preserve art form. The works\u0097which range in medium from paintings and drawings to sculpture and video\u0097are part of a larger project to foster understanding of materials and their relationship with the material world around us. The museum recently published a book on the topic, “On Paper,” and artists such as the Italian sculptor Stefano Gabbani, whose work will be included in the twentieth edition of the Bodleian/MIDW. The work of Assayas, Ahearn, Brindisi, and others from the collection and the exhibition “The Material Garden”", "The next Biennial should be staged in 2021. The 2020 edition was held at the Sagrada Nara in Florence and was organized by the Florence-based producer, curator, and author Cristina Salmastrelli. The biennial was initially scheduled for February 20–February 22, but it was pushed back to March 7–March 9.\n\n\nOn Wednesday, the Swedish Museum of Modern Art (Skulland Museum) in Stockholm announced that it has received a gift of forty-two works by the late socialist artist Felix Sturm. In a display at the institution, which was created by the former chair of the Swedish Democratic Party (SDP), Olof Palme, the artist’s heirs revealed that the collection includes works that were commissioned and created by Sturm, as well as works that have never been exhibited before and works that were never finished.“The family have long been involved in the management of the museum, both in the production of permanent exhibitions, and in the collection and exhibition of individual works,” museum director Perknud Palme told the Art Newspaper. “We can say that the family has always been at the forefront of the development of the museum.”Palme added that the first works from the", "The next Biennial should take place in the autumn of 2021.  The 2019–20 event was organized by the Shanghai-based cultural organization the Shanghai Foundation, which has since become the official custodian of the museum.\n\n\nThe Chilean architect Santiago Calatrava and the architect-turned-photographer Michael Koon are among the artists to have won the $10,000 Juan M. Pérez Prize, which was announced Monday. Koon is one of the five finalists who will receive the prestigious $10,000 honor in September. The other finalists are Guadalupe Rosales, Marcin Wojtas, and Slawomir Maniak.The five finalists were chosen by a jury comprised of Kim C. Kim, director of the National Gallery of Art in Washington, DC; Gregory P. Levy, curator of contemporary architecture at the Museum of Modern Art; and Mark P. Martin, a contemporary art historian and curator of contemporary architecture at the San Francisco Museum of Modern Art. The winner of the Juan M. Pérez Prize will be announced shortly. “Karina Hernández is a spectacular artist, and she is at the center of a global movement in the visual arts,” said Pilar", "The next Biennial should take place in the early 2020s, with the exhibition of the final work by the exhibition-winning artist Raymond Atassi.“We are grateful to the City of Miami-Dade County and the Miami-Dade County Museum of Art for their continued support of this site-specific organization,” said Robert Johnson, director of the museum. \n\n\nThe London-based human rights organization Artforum has launched a new platform, Artforum 5, that will allow visitors to its online exhibition of works by artists such as Robert Irwin, Piet Mondrian, and William Eggleston. Launched in partnership with the Art Newspaper, Artforum 5 will feature works created by artists such as Humberto Moro, Sebastian de la Fuente, and Arashiyu, among others.“After many years of publishing a blog about art and art history, I am pleased to announce that Artforum’s blog is now live on Artforum’s website! My colleagues and I will be blogging daily about the latest art and art history news and to answer your questions on the latest art and art trends,” wrote blogger Adeline O’Grady in a statement. “We hope you enjoy the", "The next Biennial should focus on the history of art and design from South America through the present, focusing on the role of women in the art-world and the role of art in South America. It should consider Brazilian modernism, the influence of drugs, and the art of the 1960s and 70s. We will also use this opportunity to examine and celebrate the work of our sisters in Brazil and internationally.We hope that by participating in this year’s event, you will feel a sense of connection with the artists, the artists’ families, and the artists’ communities in the region; we promise this will be a special year for the art of Rio de Janeiro and the art of Brazil. We are confident that this will be an open and engaging exhibition, in keeping with the spirit and spirit of the art of Rio.”\n\n\nThe National Museum of Canada (NFC) in Ottawa, which recently placed the controversial “Collected Histories” exhibition, which was criticized for excluding women artists and scholars, has received a $50,000 donation from the Canadian Museum of Fine Arts (CMFA). Established by former prime minister Stephen Harper, the $50,000 gift was made on behalf of the museum’", "The next Biennial should be held in 2020. The event has yet to announce the date.\n\n\nThe Ateneo Art Museum in Tokyo has appointed David Jacobs as its next director. Jacobs comes to the institution from the Museum of Contemporary Art (MCA), where he was interim director from 2013 to 2016 and an associate curator since 2013. He succeeds Cultural Secretary, Iain Duncan Smith, who is retiring in May.“David is a distinguished and accomplished curator of contemporary art who has been instrumental in shaping Ateneo Art Museum’s programming, curating exhibitions, and organizing scholarship,” said MCA director Koki Kanno. David joined the institution in 2003 as a curator of print. Since then, he has organized numerous exhibitions, including “The Ropes and Threads of Film: Film and Video” (2013), “Articulation” (2015), “The Modernist Imagination” (2017), “David Halton: Surround Sound” (2019), and “The Nostalgia Factor: Painting and Video” (2019).For the upcoming biennial, Jacobs will focus on developing partnerships with local and international galleries, curators", "The next Biennial should be held at the Museum of Modern Art, San Francisco.\n\n\nArt Basel is launching an initiative to encourage more sustainability practices at its upcoming edition in Hong Kong. The initiative, titled Sustainability in Art (SIA), will feature a series of public lectures on sustainability and the art world, and will help raise awareness of the challenges and opportunities posed by sustainability in the art world and the exhibition industry.Among the topics that will be covered are: How artworks are made, how sustainable materials are used, and how sustainable production systems are integrated into artmaking. The program will debut at its Hong Kong fair in May and will run through June 2020.“We are deeply concerned by the current situation involving many species of life in the earth’s oceans,” said Jürgen Schmid, CEO of the German company that runs the fair. “It is inconceivable that we live on Earth without the ocean. The future of nature and our planet are at stake, and we must act now to prevent the extinction of many species, including whales and dolphins, which are suffering in the current crisis.”Since the outbreak of Typhoon Nargis in the Philippines in December 2016, more than 160 countries have", "The next Biennial should take place in the city in 2022. Art touched all of us in a way that few other arts can touch. Several years ago, we made the decision to revitalize the Center for Contemporary Art. Making an exhibition at the new space was one of the best decisions we have made in the last decade. The next iteration of the biennial will take place in the city in 2023.  Tacita Anderson, Anne-Marie Paumgarten, and Pierre Paul Maréne are among the artists who have donated their works for the institution. \n\n\nHanna Barlow and Domenick Pierozzi are among the artists whose works will be featured in a new exhibition at the Museum of Modern Art (MoMA) in the summer. The exhibition, “Away From the Sun: Solar System Art” (spring 2020), will feature work by twenty-seven artists. Titled “Away from the Sun” and curated by François Springer, the show will take a two-day excursion through the solar system, where the artist explores the possibility of “a post-planet” through a series of architectural projects that depict the heliospheric transport of water and material entities", "The next Biennial should be held in 2021. A representative said that the 2019 edition was still planned for the spring of 2020. Following the Tiananmen Square protests, Beijing has further tightened its security regulations and crackdown on dissenters, with hundreds of people detained in the capital since mid-April and an unknown number of deaths. \n\n\nThe Ohio Arts Center (Ohio Art Museum) announced today that Diana Bailey has been named its next president. Bailey comes to the institution from the Schenectady Museum of Art, where she has served as the museum’s deputy director for the past twelve years. Previously, she was the chief curator at the Museum of Modern Art in New York.“We are honoured to welcome Diana to Ohio Art Museum, where she will have the opportunity to continue her leadership as the museum’s artistic director, curator, and curator,” said museum director Cooper Schoonmaker. “Her deep knowledge of and commitment to contemporary American art makes her the ideal leader for this critically important institution.”During her tenure at the Museum of Modern Art, Bailey helped organize the inaugural \"Passion Projects\" series, which aims to foster a more compassionate lifestyle through art and community-building; launched the", "The next Biennial should be held at the New Museum in New York in 2020. The art of the future should be made accessible to everyone. \n\n\nDorothea Rockliff, the founder of the eponymous label, who died of cancer in January 2020, has been designated a museum curatorial winner. The fifty-six-year-old New York–based artist, who is survived by her husband, Lucian Rockliff, and her daughter, Malahara, was selected for the prestigious Cecil Museum Awards. Dorothea Rockliff will receive an award of $150,000 in support of the museum’s work on the new, redesigned, and expanded sets of the museum’s collections. The museum will also receive $125,000 for its work on the renovation of its Bowie, Maryland–based building.“We had been hoping for this moment for some time,” Rockliff said in a statement. “The creation of this award marks a decisive moment in our history. We are extremely pleased at the recognition of our work in the new museum, excited by its construction, and looking forward to the opening in 2021.”The artist’s previous awards include the Louvre Design", "The next Biennial should be held at the Museum of Fine Arts, Boston, in 2022. The biennial will be curated by Los Angeles–born Rotimi, whose practice spans sculpture, performance, film, and installation. Its theme will be “time and space.”\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles has received a $100,000 donation from the Los Angeles Philharmonic. The gift, announced by the Los Angeles County Museum of Art (LACMA), was made in honor of the historic partnership between the institution and the Los Angeles Philharmonic. The gift includes the acquisition of two works by the duo Phantom and Christopher Walken, who created a monumental and moving work, The Motherly Breath.“In honor of this special partnership, we are deeply grateful to the Phil, as well as to the Los Angeles City Council, Mayor Eric Garcetti, and the Los Angeles County Board of Supervisors, who have worked tirelessly to develop and build upon the legacy of this partnership,” said John Delahanty, chair of the LACMA board of directors. “This gift is a reflection of the city’s commitment to supporting artists and their work, and reflects the city’", "The next Biennial should be held in Almaty, Kazakhstan, on November 28. \n\n\nAmerican artist, activist, and educator Lynne Alfano, whose haunting photos of everyday life in Los Angeles inspired national and international iconoclasm, has died at age eighty-eight at her home in Santa Monica. The cause was cancer, which Alfano alleged was triggered by a lack of vitamin B12, an essential nutrient essential for the body. “Lynne Alfano: Beauty in Lens  ” is currently on view at the Los Angeles County Museum of Art (LACMA), where it will be presented by the Los Angeles County Art Museum (LALCLA). The museum will also stage the artist’s “The Body in Pictures” (2000) at its free admission admission level, where it will be presented by the Museum of Modern Art in New York on December 14. “Lynne Alfano: Beauty in Lens” was nominated for a National Magazine Award for Photography in 2002. The contest jury awarded her an additional $500,000, and she received a National Book Award in 2007. Her work was also included in an exhibition at the San Francisco Museum of Art in 2008. Rest assured, when", "The next Biennial should take place in 2020, at which point the site will be transformed into a world headquarters of the museum, with a new exhibition, a series of concerts, and an important public gathering space. New York’s Metropolitan Museum of Art will host a Biennial of Contemporary Art in 2021. \n\n\nThe Museum of Tolerance (MTO) in Los Angeles, California, has received a gift of twenty-nine works from the collection of Joseph Schrag, who passed away in 2001. The works are from the collection of the late American photographer Harry A. Schaeffer, who taught at the institution through the 1970s. The collection includes works by men and women who were working at the time of Schrag’s death.“Joseph Schrag was a leader in the field of American photography, a brilliant, committed collector and an integral partner in the development of the MTO,” said Ron Gidley, the museum’s director and CEO. “He was born and raised in Los Angeles and studied at the University of Southern California and Harvard University. He was a gifted photographer whose work is held in good esteem by many. His commitment to the MTO was legendary. We are very proud to", "The next Biennial should focus on: “How do we care for and care for one another in times of crisis?” The fifth and final iteration of the exhibition will take place in the fall of 2020. Saturday, February 8th, 2020 FREE to the public The critically acclaimed exhibition “Waking Life: Art and the Evolution of Consciousness” will return to the US for its thirty-third edition at the Museum of Modern Art in July and will feature new works by seventy-eight artists. The event will take up themes of evolutionary biology, consciousness, consciousness as such, consciousness as a function of technology, and the organic and inorganic worlds that animate and are influenced by each other and the natural world. The biennial was established by the artist-run nonprofit Artforum in 2009 and is supported by an endowment from Christopher Knight, the founder of the New York–based startup company the company that developed the digital art-sharing service Snap. The event was originally scheduled for launch in May and was co-organized by Knight, longtime artist-in-residence Yoko Ono, and Charles Gara.Knight said: “In 2007, I began to take an active role in the museum, helping to", "The next Biennial should take place in 2020 and will feature artists and other innovators working across five themes: art, architecture, drawing, performance, and design. The exhibition will include a selection of work by the next generation of artists, including Tullier, Jules and Herbert, Manet, and Pierre-Auguste Renoir.“I’ve been involved in the world of art for forty years and have witnessed the tremendous growth of the field,” said Eva Laursen, the artistic director of the Biennale. “The new initiative\u0097made possible through the generous support of the Flemish Parliament, the Ministry of Foreign Affairs, and the Ministry of Culture and Education, and supported by Dr. Lise Rasmussen, the Minister for Education, Culture, Sport, and Science, and the Carl Zeiss Foundation in Frankfurt, Germany\u0097will create a new kind of platform for experimentation, experimentation, and experimentation.”The 2019 biennial was inspired by the 1960s and ’70s German–American artist Konrad Adenauer\u0097who, in his artwork,  represents this century’s zeitgeist, visualizing the visions of the artists that come after him. The exhibition was", "The next Biennial should focus on how to mobilize existing resources to address the pressing challenges of the new global climate, and how cultural and political institutions can most effectively engage with emerging issues, such as the origins and persistence of radical individualisms, the weight and political implications of contemporary art, and the limits of state power. The next edition will include a discussion of the trajectory of environmental and climate change in order to present a window into the future.\n\n\nThe Institute of Contemporary Art (ICA) in Vienna and the City of Vienna, together with the local municipality of Vienna, have launched an initiative to create one of the last truly open-air museums in the world, complete with art galleries, theaters, bookstores, and other public spaces, in the city.Dubbed the City Museum of Modern Art, the public-private partnership between the ICA and the city of Vienna will bring together forty artworks by forty-eight artists over twelve years. The first phase, “Abandon All Speculation,” will open at the Vienna Art Show in May 2020. The second phase, “Jupiter’s Legacy,” will open in March 2021, and the third phase, “Ploughshares,” will", "The next Biennial should be held at the Museum of Modern Art in London in the autumn of 2022, and the twentieth at the Museum of Contemporary Art in Chicago in 2021.  The Art of the Web will be staged at the Museums Museum of Modern Art, the Museum of Contemporary Art, London, and the Haus der Kunst in Geneva in the fall of 2018. Scroll down to view the full list of participating artists and institutions.\n\n\nThe Baltimore Museum of Art (BMA), the Baltimore Art Museum (BAM), and the Maryland Institute College of Art (MICA) are teaming up to create a new kind of public art. The partnership, dubbed The Long Reach, will push the boundaries of contemporary art, bringing together three of the most important institutions in American and will launch with a retrospective of work by artist Robert Creeley in 2021. The event will culminate with a public installation of work by artist Mary Ruaridh after the artist’s death in 2022.“In the nearly fifty years since our partnership began, we have worked together to present a show that explores the transformative impact of the long reach,” said BMA director Christopher Bedford. “We have employed a range of creative and non", "The next Biennial should explore the history of the exhibition, the history of the exhibition, and the exhibition in context of contemporary life in the artistic, cultural, and technological sphere. \nThe board of directors of the Victorian Society of Art in London announced today that Meghana Patel has been appointed its new deputy director of curatorial affairs. Patel, who is also a curator at the Victorian, was recently awarded a CBE for services to photography and video by the Royal Academy of Arts. The appointment was made as part of a £20 million upgrade to the organization, which was completed in 2018 and is currently undergoing an expansion.“We are delighted to welcome Meghana to the Victorian and look forward to working with her to further develop the Victorian’s photography and video programme,” said David Green, chair of the Victorian Society of Art. Commenting on her appointment, Patel said: “The Victorian Society’s recent programmes and exhibitions have been enormously influential on the development of the contemporary photographic and video, and I am honored to be a part of that. The Victorian is a vital and challenging platform to explore the history and the art from a wide-ranging collection of Victorian photography and video.” Previously, Patel was the", "The next Biennial should be held in 2020 and will consist of twenty-two exhibitions including the first Everglades Biennial (2019), a portrait of the artist Ellie Mae Wallace, and “Serena,” a show of work by the artist Olu Ose. The disc will be curated by Marcelo Biemann, who has helmed the series since 2015, and will be presented by Marcelo Gomes, the curator of contemporary art, at a site that is still under construction.The Biennial’s next edition will take place in 2021 at the Gaylord Opryland in Detroit, Michigan. The exhibition will include twenty-two works by forty artists, including Richard Avedon, Jean-Luc LaBouw, Michael Kistler, and Diana Muir, and will be presented by the Gaylord Museum of Art in Nashville.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is moving three works from its collection to a new museum facility in the city’s Westwood district. The works will go on view in “The Future Is Now: The Works of Peter and Paul Klee” (2019), a solo show that will take up the themes of climate change,", "The next Biennial should take place in the autumn of 2021.” The six-month celebration will take place at the Museum’s new campus in downtown Los Angeles, which has been undergoing a $3.4 billion expansion since 2013. The project, which was funded with $2.3 billion from the Los Angeles County Metropolitan Agency for Planning and Conservation (Metro), was commissioned by then–mayor Gavin Newsom, who was elected president of the city of Los Angeles in 2016.The new facility will boast three levels of underground galleries, an artist’s residence, and a state-of-the-art laboratory. The museum will also boast a new presentation room and additional public spaces. The project, which has already received $1.25 billion in federal stimulus funds, is expected to generate $1.5 billion for the city of Los Angeles.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released the list of seventy-five organizations that will receive city funding in the 2018 fiscal year. The funds are being offered through a $1.2 trillion stimulus package that was passed by the City Council and signed into law by Governor Andrew Cuomo on March 16. The legislation calls for $750", "The next Biennial should take place in the city in 2021. \n\n\nThe Museum of Contemporary Art (MCA) in New York is planning to remove a piece of original Greek sculpture that celebrates continuity between two eras. The work, called the 'Neo-Grace of the Sun,'\u0097a stylized depiction of a sun-drenched, sun-kissed island in the sea of the Sun, is slated to reopen in the summer of 2021.The institution did not specify whether it is removing the work or its chapel, which is also slated to reopen in the summer of 2022. The chapel was added by João Lopes, who is known for his conceptual projects that often feature monuments and installations that address the ephemeral, the ineffable, the infinite, and the transcendent. In the past, Lopes has been known for his bold, conceptual art installations that often address the influence of the past on the present, such as his installation behind the scenes at the Zanardi Museum of Art in Turin in 2015, which featured a statue of Sun-Tzu, the legendary Chinese Taoist philosopher, and a solar flare.“The work of the artist is not the goal, but an extension of", "The next Biennial should be held in 2020. The next edition, which is expected to run from September 22 to September 26, 2021, will be the first of its kind in the country and will be staged in three different locations: Botanic Gardens, Ministry of Culture, and the National Museum of Singapore. The museum will also have a new exhibition and lecture series, which will be staged in different locations across the country.The inaugural Biennial was organized by the National Gallery of Singapore (NGA) and will be hosted at the NGA in Singapore from August 27 to August 30, 2020. The exhibition, titled “Art and the South Seas,” will feature approximately 150 artworks by fifty artists from fifteen countries and territories.Among the artists chosen for the twenty-tenth edition of the biennial are Artyom Kuznetsov, Gennady Gurevich, Aleksandr A. Ivanov, Wolfgang Paalen, Pauly Rinder, Robert Irwin, and Radu Vuong, who will each receive a prize of €2,500. The first prize will be given to Alexey Gusev, a Russian artist who will be presented with a medallion for his work for the show. The second award will be", "The next Biennial should take place in 2019.\n\n\nThe Museum of the African Diaspor (MASAD) in Cairo has appointed Yassmina Siddique as its new artistic director. Siddique comes to the institution from the Decarabia Arts Center (DAC), where she worked as an assistant curator for exhibitions and collections in the last two years.“MASAD’s new artistic director is an extraordinary person who has created a unique legacy in this city,” said Hassan Al Jawla, the director of the DAC, which is located on the second-tier campus of the University of California, Los Angeles. “He is a master of his craft and has created an exciting and ambitious program for the DAC. He is a great admirer of Jan-Ara Frutiger’s work and his vision to create a contemporary space for the work of African artists from Africa and the world. I’m honored to welcome him to MASAD and to work with him.”Siddique, who is currently a doctoral candidate in art history at the University of Pennsylvania, and Frutiger, who is currently a professor in art history at Columbia University, were selected by an internal committee led by", "The next Biennial should be dedicated to Far Eastern art, and the fourth to the study of the art of the Americas.The twenty-third Biennial of European Art will focus on the history of art in Europe between 1500 and 1700, and the fifteenth on the history of art in the Americas between 1700 and 1900. The twenty-seventh Contemporary Art Museum Stuttgart will present an exhibition of its works in collaboration with Joachim F. Klingenberg Gallery, and the twenty-second Contemporary Art Museum Stuttgart (CAMST) will host a seminar on 'Nudists and the Early Modern World.‘Istanbul’s Markham Museum of Art’s exhibition “The Terror of the Papacy: Pagan Ritual and the Making of Modernity” will return to the city in September. The second exhibition will be in September 2020. The next iteration of the Görke Museum’s “Wolgenschaftslehre: Gelektiv für den üblichen Reichstag,” which will focus on the history of art in the former Soviet Union—the first exhibition in the country was held in 2015—is slated to take place in September 2021", "The next Biennial should take place in late 2019 or early 2020. \n\nThe seventh edition of the Guggenheim Biennale, curated by Monaghan-based curator Shilpa Gupta, will take place at the city’s Mangalore campus from November 27 to November 29. The event will be hosted by the Palazzo di Filippo in Parc Hotel in Rome and will feature a retrospective of the artist’s work from January 3 to January 7, 2020, with a selection of recent works and works that have not yet been shown.Gupta said that the event’s themes will include “painting in the tradition of the Guggenheim,” the gallery’s new initiative for collaboration and collaboration with the artists, and “painting broadly,” a reference to a painting by Freud that was one of the themes of the show.Gupta added that the themes of the show are “painting in a way that is at once accessible, yet catalyzes the visual arts.” “Painting in a way that is at once accessible, yet catalyzes the visual arts,” he said.The work of the show will be curated by Guido P", "The next Biennial should be held in the spring of 2021. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has commissioned artist Katrina Lawson to create a new work for its cinema branch. The installation, titled Ikea, is an outdoor sculpture that celebrates the contributions of the Japanese American artist and architect to American pop culture. Born in New York City in 1961, Lawson became interested in American art in the late 1970s. Later that decade, she and her collaborators began to experiment with wood, metal, and plastic, the most famous of which are the ubiquitous IKEA furniture pieces she designed for the company. The work is a celebration of the histories of both Lawson and her peers, a tribute to her own aesthetic sensibility, and a reflection of the Center’s commitment to Americana.“Ikea is a sculptural response to the Union Pacific Railroad,” said Joachim Oehlen, the director of MoCA. “The installation is a ritualistic act of gathering and reassembling objects that are part of a larger narrative of American art in the late twentieth century.”The installation was created by Lawson, a native of Japan, under the title, “", "The next Biennial should take place in March 2021.” The 2019 edition, featuring works by fifty-two artists who were featured in the exhibition “10 years ago,” featured work by forty-two artists selected by a panel of curators and writers.\n\n\nThe Kingfisher Art Museum in Portsmouth, New Hampshire, has appointed George FitzGerald as its next director. FitzGerald joins the institution from the Yale University Art Museum, where he has served as deputy director and curator for the past four years. He succeeds Alison Gray, who led the museum for fifteen years, and will begin his tenure in March.“George brings a wealth of experience and knowledge to the Kingfisher, and I am excited to work with him to help shape the next chapter of its’s rich and meaningful legacy,” said Gray. FitzGerald will take up his new responsibilities in the spring of 2020. A scholar of twentieth-century art, he will be tasked with cultivating a new generation of leaders in the field, which has been dormant for eighty years.Commenting on his new role, FitzGerald said: “I have long admired the work of the museum as a whole and particularly the collection, which comprises thirteen thousand", "The next Biennial should take place in 2021, with a New York edition to be held in 2022.\n\n\nThe Massachusetts Institute of Technology (MIT) announced today that it will soon house a memorial to those who have died from opioid overdoses. The biennial, titled The Ride, will commission artist Maren Pfeifer to create a memorial for the addicts and their families on the campus of the Massachusetts Institute of Technology (MIT) in Cambridge.“This biennial will underscore how our current system for dealing with addiction does not address the root causes of addiction, nor does it address the underlying causes of addiction,” said Pia Long, chair of the board of trustees of the MGH Foundation, which is responsible for the maintenance of the memorial. “While we will not be able to erase the past, we can and must do more to help those most in need. This is a crisis on many levels, and we cannot afford to ignore it.”In order to create a memorial for the institute’s students, faculty, and staff, the biennial will invite them to visit all of the forty-three locations that are currently home to the institute, including two recently completed renovations, the library, the museum, and the art", "The next Biennial should be held within the next two years. \n\n\nThe Museum of Modern Art (MoMA) has appointed ten new members to its board of directors. The appointments—which were made on Monday and are effective immediately—open the door for Queen Anne-inspired artist-run spaces, often built by students, to reenter the museum\u0097a rare occurrence in a museum where many artists are pursuing solo exhibitions or residencies. “This is a very exciting time for MoMA, and I’m proud to serve as director,” Nicoletta Danza said in a statement. Coming to the institution, she will take up the post on January 21, 2020.Current board members include Anthony Berrio, president of the College of William and Mary; Clara Campbell, director of the David-and-Goliath exhibition space at the Whitney Museum of American Art; and David Chiu, former director of the Brooklyn Museum. The new appointees will serve for three years, ending in September 2022.The ten are:• Mark Arajano, president of the Manhattan’s Sperlo Studios, which is currently undergoing a $75 million expansion;• Julia Carrie Johnson, who previously served as director of the Los Angeles", "The next Biennial should take place in the summer of 2021, said Richard Blomfield, chief executive of Tate. “The fourth and final exhibition, which is currently on display in the UK’s Tate Modern, will be held in 2021. ‘We are working hard to put together the timing for the UK and European audiences to see both exhibitions simultaneously, but it is not in the cards yet.”The first show of the new exhibition series, “On the Nature of Painting,” is scheduled to open in the UK on October 7. The show will travel to the US for a November 29 debut.\n\n\nThe Chisenhale Gallery in London has released the list of twenty-four artists who will be featured in its “Paintings of Art in the Age of Mechanical Revolution,” which will examine the relationship between painting and modern art. The third edition of the exhibition, “Paintings in Motion,” will be staged at the Chisenhale from February 23 to March 6, 2020.The twenty-four artists chosen from the pool of nineteen artists nominated by a jury comprised of Chris Packer, art historian, curator and director of the Tate; Christopher Hooton, director of", "The next Biennial should be held sometime in 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in New York has released new guidelines on how the institution should handle protests, riots, and looters. The guidelines were drafted by the Manhattan-based firm Hauser & Wirth and were released on Friday, October 27.The guidelines outline how the institution—which was not immediately able to respond to requests for comment—should handle any potential disruptions to exhibitions and performances in the immediate aftermath of a major mass shooting. They also outline how the museum should have been able to mitigate the damage caused by looters by preparing emergency plans and by removing items from display cases.Museum director Michael Masnick emphasized that the institution is taking a 'prudent and deliberate approach, and will seek to ameliorate the situation as quickly and as effectively as possible.” He noted that the safety of visitors, staff, and the public is of paramount importance to the institution and that there are special plans in place to help individuals dealing with grief and trauma.While the guidelines outline steps the museum should have taken to prevent the spread of Covid-19, the coronavirus, and the coronavirus-related deaths, they leave open the possibility that other steps", "The next Biennial should be announced soon.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles (MCA), is working with the Los Angeles County Museum of Art (LACMA) to create a new public art project that will highlight the work of forty American artists who have passed away since 1960. The project, titled Adeline and the Age of the Totem, will debut in the September 2020 issue of Artforum.In the October 2019 issue of this magazine, John P. McGinnis wrote: “Drawing from the archives at LACMA, the Museum of Contemporary Art, and the National Gallery of Art, as well as interviews with twenty-five artists, including Frank Gehry, the African American artist and Inca emperor Tazana, and Joseph Curwen, the late British art historian and curator who curated the first major exhibition dedicated to African art in the US in 1966, the exhibition has the atmosphere of a documentary film, and the images and stories of forty-two artists of color—including Robert Irwin, Sal Emma, and Ellen Willis—together make for an engagingly moving story of American art.”The project was inspired by a conversation with an artist who works in and around Los Angeles, who said: �", "The next Biennial should be held in the year 2023. \n\n\n\nThe Museum of Modern Art (MoMA) in New York has unveiled its new corporate social responsibility (CSP) campaign, which leverages the museum’s collection and its international reputation to help museums address environmental issues in their communities. The new, free, online-only platform was inspired by the museum’s longstanding commitment to environmental justice and the environmental protection of workers and the environment.“We wanted to combine an international art museum with the power of the arts to address some of the biggest issues of our time,” said Stuart Little, director of the museum. The strategy, which was inspired by an earlier iteration of MoMA, the Museum of Modern Art, Inc (MoMA), launched today and will run through March 6, 2020.“The CSP platform will bring to light the most pressing environmental challenges facing our communities,” Little said. “With a new platform, MoMA will give our audiences new ways to experience the art of the museum, and our collectors new new ways to sell it.”The inaugural exhibition, “In Defense of Nature,” was curated by Kate Donovan, and Janet Bloomfield, and", "The next Biennial should draw from the study of the historical and cultural links between the city and the historical city of Bristol. The commissioning of the biennial will not be an obstacle to the regeneration of the city. We want to be really clear that this is about the city performing a historic role in the UK. It is not about us and our future plans. It is about the city performing some of its most important cultural, social, scientific and stylistic roles in securing our future. We have been anticipating this moment for some time and it is something we have long sought. It is also something that will benefit people of Bristol and the city of Bristol. We are grateful to the city of Bristol, our constituents, the local government, the arts and cultural sector and the wider Bristol community for your support over the many years, and look forward to presenting our designs for a new Biennial, which will reflect our values and represent the city at its best, at our next London Biennial in 2021. \n\n\nThe Canadian Museum of Fine Arts (CMFA) in Montreal has appointed Jocelyn Gagliano as its next executive director. Gagliano comes to the institution from the Dallara Foundation (D", "The next Biennial should be unveiled in late June, and should be completed by the end of the year. \n\n\nThe Museum of Modern Art (MoMA) in New York announced today that it is collaborating with the Washington, DC–based nonprofit the Metropolitan Museum of Art (MMA) on a new initiative designed to promote the work of contemporary artists. The partnership will aim to foster a more informed and accessible understanding of the work of contemporary artists through an exchange program that will allow visitors to both museums and to MoMA to experience the work of a given artist for free.“The Museum of Modern Art and the Metropolitan Museum of Art are always striving to create new opportunities to understand and appreciate the beautiful works of our own talented and dedicated curators,” said Bruce Conner, the Met’s director. “The collaboration will give us a chance to show how the art of the contemporary era is the same as the art of the past, and will put MoMA at the center of a conversation about how art can take the place of our preconceived notions about what art is and should be. MoMA will become a laboratory for the work of the artist and the Met will become a home for the work of the artist.”The", "The next Biennial should be held in 2020 and will aim to incorporate a wide range of works by twenty-five artists, including Paul Gauguin, Herbert S. Guggenheim, and Lewis Henrystine, and will exhibit some of the works in a gallery setting. \n\n\nThe California Museum of Art (CMA) in Los Angeles has appointed Jamie Todd-Morales as its next director. Morales succeeds Edgardo Biondi, who has served as interim director for the past two years, and will assume his role in January 2021.“Jamie’s vision for the CMA has always been to make the MCA as accessible and compelling as possible for everyone, at fairs across the country,” said Jim Cuno, director of the CMA. “He has proven time and time again that he understands and cares deeply about the curatorial and artistic relationships at the CMA, and we are confident that under his leadership, the CMA will continue to thrive as a premier leader in the art world.”Morales also serves as the executive director of the Galerie Prada, where he oversaw the launch of its inaugural exhibition, “The Prada Project” (2019), and is", "The next Biennial should consider the extensive history of the exhibition as well as its current relevance through the participation of the Filipino public in international art events for the last sixty years. The panelists should also consider the art programs the Philippines has presented in the past, and how the art of the future should reflect on the legacy of the past and the promise of the future.”In its announcement, the venue said that the 2019 iteration “will be a reflection of the current challenges that we face, and will include a clear synthesis of contemporary and contemporary art.” It also said that the biannual event will be “contemporary, contemporary, contemporary,” which it said is the theme of the upcoming edition.\n\n\nThe National Gallery of Australia (NGA) in Canberra has announced that it plans to increase the number of exhibitions it presents between its two locations, adding more than one hundred new works in stages, to three hundred more works in the coming years, in an attempt to keep the galleries busy.In a statement, the NGA said: “The NGA has made a number of important and transformative changes in the past twelve years, and we are now in a position to show the work of one hundred Australian artists in the", "The next Biennial should be held in 2020, with a running time of at least twenty-eight hours. Takeda said that the vision for the biennial is to continue to present new works in a way that recalls the museum’s founding in 1877. The biennial will be inaugurated by a new exhibition titled “The Concept of Art in the Age of Mechanical Reproduction,” curated by the director, Kazuyuki Takahashi. The theme of the show will be “Art and Life” and will include works by a range of artists, including Ai Weiwei, Ai-Hi, Adam and Franz Klee, Kenzo Tange, and Mary Martin.Takeda said that his vision for the biennial was initiated by the museum’s founder, Dr. Yasuhiro Takeda, in 1972. He created the exhibition concept with the help of a group of artists that included Toshio Takahashi, Kimini Yamamoto, and Masataka Arai. He added that “I did not want to focus on the design of the exhibition, but on the design of the exhibition.” He said: “I needed a space in the museum where I could express my thoughts on", "The next Biennial should take place in 2020.\n\n\nCory Doctorow, the cofounder of the progressive nonprofit the Center for Art and Social Justice (CASJP), has introduced a new $1.2 million grant program to support artists in New York City. The program will provide $1 million for the first year and $1 million for the second year. The grantees will be selected by the Center for Art and Social Justice based on their practice. The Center for Art and Social Justice is a 501(c)(3) organization established by Cory Doctorow in 2015 to carry out a series of projects aimed at supporting the work of emerging and established artists in New York City.“The Center for Art and Social Justice is a year-round, community-based, artist-led endeavor, and we’re honored to be able to support those artists whose work makes our world a better and more inclusive place,” said Cory Doctorow. “We have awarded some $1.2 million to artists since the Center was founded, and this year’s grant cycle represents an opportunity to repeat the success stories of the past years to further their work and to expand the scope of the award. We are grateful to the artists whose", "The next Biennial should be held at Oslo in 2022. Since then, the project has received many generous gifts, including from the Sveriges Rikskbank and prize, as well as from the citizens of Oslo, including the Kjartansson Foundation. Since the project has been set in motion by the various institutions of the city of Oslo, the artists have taken advantage of the city’s infrastructure to create works that are displayed in the museums.\n\n\nThe Ontario Museum of Canada (OCC) has announced that it is reshaping its curatorial and exhibition-viewing strategy in order to focus more heavily on contemporary art. The museum’s board president, Helen Forrest, said that the move will allow it to “re-examine and redefine how we present contemporary art.” She added that the museum will also begin a process of “deconstructing the museum,” which will involve moving larger collections and engaging in a “relatively new form of exhibition and participation.”Among the exhibitions that will undergo this significant transformation are “The Life and Works of Tintin,” a new display dedicated to the work of Pablo Picasso and will open on May 10;", "The next Biennial should focus on “moral development and the body politic,” said Iwan M. King, chairman of the organization’s board of trustees, referring to the exhibition series. “We want to explore new, experimental ways in which art can inform the world. We need the platform to do that at a time when art and politics are in desperate need of our engagement. We’re here to help.”The institution will stage three shows in 2021, including “Demons and Vampires: Art and the Body in Contemporary Art” and “The Culture of Death: The Body and the Culture in Eastern Art” as well as “Unauthoritative Exhibitions” and “Theater as Refuge: The Body and the Diaspora” in 2019. The museum will also be reshaped in response to the pandemic. The redesigned building—which is built in the shadow of the Grand Canyon—will offer more public spaces and will feature new programs, including a new section on art as a tool for healing and transformation.The new structure will also offer visitors more ways to interact with the artworks and the museum’s collection, which includes works by more than 180", "The next Biennial should take place in 2020, with the first edition to be held at the Belvedere d’Art Contemporanea in Paris in 2021.\n\nThe Swiss artist and educator Teresa Martin-Otto has been named the next director of the Center d’Art Contemporanea (CAC), a 32,000-square-foot, boutique museum in southern Switzerland. The institution is currently undergoing renovations.Martin-Otto, a German citizen, first met Toni-Ann Hurley, the museum’s founding director, in 1999. In 2013, Hurley donated $10 million for the construction of a new twenty-seven-thousand-square-foot facility that includes an exhibition space, classrooms, and research libraries. The center will be inaugurated by the exhibition “Lucie and Humble: Curiosities of the Gallery” this spring. Hurley will come to Switzerland to inaugurate the museum in May.\n\n\nThe Pérez Art Museum Düsseldorf (PAM) in Germany has received a donation of twenty-four works from the collection of the Russian collector Valery Gergiev. The works, which were acquired through the museum", "The next Biennial should be held in 2020.\n\n\nThe Smithsonian’s National Museum of African Art (NMAA) in Washington, DC, has announced that it will host the upcoming edition of the International Black Art Biennial (IBB). The biennial, entitled “Black in America,” will take place at the institution during the latter half of 2020. The event will be hosted by the Center for American Art, the Smithsonian Design Museum, and the Fine Arts Museums of Chicago.“The institution is excited to partner with the curators at the Center for Art to present a truly international exhibition focused on Black artists in 2020, the institution’s inaugural year,” said Jennie Ray, director of the National Museum of African Art. In partnership with the Center for Art, the NMAA will present a selection of work by artists from forty-four countries and territories, including Ethiopia, Portugal, Zambia, Tunisia, and South Africa, featuring works by artists such as Rachael Armstrong, Tarek Akuara, and Souda Ward.Nomura Tawokoro, the director of the Center for Art and Art History and the Smithsonian Design Museum, said: “We are thrilled to", "The next Biennial should focus on the lifecycle of a work in sequence and its relation to the work as a whole, and should address the historical and current state of the art. It should be organized in collaboration with the patron, with the objective of producing a work that fulfills the expectations of both the audience and the particular psychoacoustics of the subject.” The exhibition, which will take place in the Schott-Stiftung in Cologne from March 19 to March 21, 2020, will be curated by Alice Bair, director of the Schott-Stiftung, alongside Joachim Schöffer, curator of art at the Contemporary Art Museum Stuttgart, and Wolfgang Reitze.The final selection of the prize will be presented by Wolfgang Reitze, in recognition of his outstanding artistic practice of the last ten years. Known for his multi-dimensional concept paintings, which are often inspired by everyday objects, he will take home the Jack W. Ebersteckler Award in recognition of his achievement in this regard.\n\n\nThe Museum of British Art (MoBA) in London has appointed Jenny Waldman as its new board chair. Waldman joins the museum from the London-headquartered Art Fund, which focuses", "The next Biennial should be held in Algiers in October 2020.\n\n\nThe United Kingdom is preparing to leave the European Union—and embrace a much more tightly controlled version of the bloc, with Prime Minister Boris Johnson describing the move as “essential.” The decision is part of a comprehensive review of the UK’s relationship with the bloc, which is being led by the House of Lords, and is expected to be completed by the end of June.While Johnson called the review “transformative,” the UK’s Brexit Secretary David Davis said the government is “still a long way from a satisfactory deal,” and a report from the European Commission is expected this week. In an attempt to minimize the government’s economic losses as a result of the departure, the government is estimating that around one million jobs will be lost as a result of the move.While the UK has already committed to spending approximately £11 billion a month on Brexit in 2021, the government has announced a €7 billion contingency plan for 2019. If the 2020 deadline is missed, the government could be forced to make up the difference by removing some 27,000 government-funded positions—a prospect that has left many industries struggling. Among the", "The next Biennial should be held in the fall of 2020, in conjunction with the opening of the biennial of the same name. However, due to the coronavirus outbreak, the institution has postponed the event and will now have to have its inaugural exhibition held in the spring of 2021. In a letter dated February 2, the board of trustees of the Biennial of Mexico City expressed concern for the future of the exhibition and the biennial’s programming, which will be relocated to the new venue and will be co-presented by the San Andrés Museum and the National Museum of Mexico City.“The board of trustees of the National Museum of Mexico City is deeply concerned about the future of the exhibition and the biennial,” reads the letter. “We are also deeply concerned about the effect the exhibition and the biennial may have on our visitors and our community. We ask that the exhibition be cancelled and the biennial be moved to another institution, as soon as possible.”The move would also allow the National Museum of Mexico City to relocate two hundred works from its current location in the capital city, which is now known as Mexico City, to a new home in the capital city, which is now known as Ci", "The next Biennial should be held within a year. The bidding to organize this edition of the exhibition had been ongoing since 2014.\n\n\nThe Metropolitan Museum of Art (the museum) in New York announced today the ten artists whose works will be presented for the first time at the new $3.7 billion Met biennial, “Creative Time: The Future Is Now.” Set to open in 2020, the exhibition will showcase the work of seventy-six artists, including Annie Clark, Tae-Min Lee, Katja Miro, and Jane Rosenthal, among others from the Trans-Pacific Partnership (TPP), a massive 11,500-page, twenty-one-thousand-note computer program that will seek to create more market-based solutions to climate change.“The new partnership between the museum and the University of Washington’s Institute for the Visual Arts creates an exciting opportunity for what is shaping up to be a landmark exhibition,” said Met president Daniel H. Weiss. The institute’s director, Kyung-Min Lee, added: “We are thrilled about this partnership and hope that this exhibition will inspire and educate as many people as possible about the importance of interdisciplinary collaboration. The work of the artists", "The next Biennial should take place at the Guggenheim in 2020. The exhibition of the work of the artist Valentino Cipolletta, a collaboration with Giardino Cipolletta, will be held in May 2020.\n\n\nThe National Galleries of Scotland (NgSi) has launched a new digital platform and an online course in the art world. The project, which aims to improve the digital learning experience of art history students by providing them with tools to explore and analyze art through a critical, interdisciplinary lens, was inspired by the work of the late artist and activist, and activist and art historian, Jocelyn Brittain.As part of the new partnership between the National Galleries of Scotland (NgSi) and the Museum of Fine Arts (MoFA), Brittain will present the first online exhibition of her work, “Lemon Gaze: The Passion of Joan Mitchell,” which is currently on view in the museum’s new exhibition, “Philosophy of Modern Art: Charles and Joan,” in March 2020.“We are creating a platform that enables artists to engage with the National Galleries, explore the range of contemporary art, and learn from a range of", "The next Biennial should be held in 2021, with the first event being held in Essen. The museum has also been working on commissioning new works by the late artist Alighiero Graziani, who lived and worked in Berlin and created works in the 1940s and 1950s. The institution will present its first exhibition of work by the Italian architect Beppe Giorgi, who passed away in 1954, in October. The exhibition will also feature original works by the artist and will be inaugurated by a design by Giorgi.\n\n\nThe National Museum of Art in Athens, Greece, has received a gift of twenty-seven works by the late artist Orestes Kratos, who was known for his vast array of sculpture, paintings, collages, photographs, photographs in black-and-white, and video works. The donation—which was made by an anonymous donor in honor of his life and work—is the largest gift made by the artists in Greece. The works, which were acquired through a collaborative effort between Kratos and the artist-in-residence, the artist-in-residence and the museum, are currently housed in the institution’s collection.The institution also confirmed that it has", "The next Biennial should be hosted at a location that is close to the art and cultural scene of the city of San Francisco, and within a few hours of the museum. In addition, there should be an extension of the current exhibition to accommodate the continuing exhibition’s construction.”In an open letter published by the organizers of the upcoming event, the letter reads: “To the Board, staff, and the community of artists, collectors, and institutions that have expressed interest in the upcoming exhibition: We are thrilled to invite you to join us in observing the restoration of the western facade of the Museum of Modern Art in San Francisco. We know that this is an important milestone and we ask that you continue to support and encourage the work of the current team and directors to ensure that the exhibition is a success. We know that this will be a challenging project and we are eager to see you and the work of the team. We hope that this letter finds you and your colleagues. If not, we implore you to please forgive us.”KAMPALA/CHICAGO: The California Biennial of Arts (Califano) is planning a major reopening this spring. Its first exhibition, “Sensate,”", "The next Biennial should be held in the fall of 2020. “We have come a long way as a society, but we are still far from being able to sustainably sustainably sustain our planet,” said Lévy Gorvy CEO Frédéric Malo. “We are not there yet, and we will only be when we stop climate catastrophe through the urgent implementation of ambitious climate commitments.” \n\n\nThe museum has hired Laura Conder, a former director of the Botanical Gardens of the Pacific Northwest, as its new curator of art history. Conder has been on the staff of the Botanical Gardens of the Pacific Northwest since 2015. She succeeds Meg Avery, who retired in February 2019 after twenty-five years at the helm of the institution.“Laura Conder’s work and curatorial practice is deeply rooted in Pacific Northwest art history, representing a strong and distinguished Pacific Northwest aesthetic in a new way, one that is ecologically and politically grounded,” Avery said in a statement. “Her understanding and exploration of the history of contemporary art in the West Coast region is an exciting departure from the current path of specialization and pedagogic, and one we are excited to", "The next Biennial should be called the “Year of Assunage” and will focus on craft and art from the 1930s to the 1970s. The exhibition, which will take place at the same location every year, will include twenty-one artworks by forty-eight artists. The 2020 edition will be curated by Flemish curator Gunnar Steeg, who was recently appointed artistic director of the Biennale Rotterdam, and will run from September 5 to September 7.The biennial, which was established in 1987 and organizes between 1,500 and 1,800 exhibitions annually, will be inaugurated with the exhibition “Theus et al.” (Theus & al.”). The exhibition, which will highlight the twentieth-century queer and trans-identified artists, will showcase work by thirty artists and will address issues such as the relationship between art and politics and art and artmaking. In addition, a selection of work by artist Cora Anne Haslet will be presented.The biennial will also feature the first presentation of work by American artist and activist Mary Wollstonecraft, who was a key figure in establishing the first national Women’s Day celebration in 1948, and will mark the first", "The next Biennial should be held in 2022. \n\n\nA group of artists and activists have launched a campaign to hold those responsible for the burning of a Palestinian family home in the occupied West Bank accountable for their actions. The activists have launched a petition that has garnered more than 1,800 signatures in support of the six-month sabbatical year, which is reserved for Palestinians.“In light of recent events, we raise our voices in support of the academic and cultural workers of the West Bank who are risking their own safety to protect the well-being of their families and communities, and to demand that the Palestinian Authority take effective and immediate actions to protect the physical integrity of families and communities,” the petition reads. “The sabbatical year is a precious opportunity for young Palestinians to develop their creative and academic careers, and it is particularly critical in the light of the upcoming academic year.”The activists have created a video, titled Tiger, that illustrates the plight of the two brothers who were killed by Israeli forces in the incursion into their home village of Duma last week. The video depicts the aftermath of Israeli shelling of homes in the area, including the burned, looted house of a twenty-one-year-", "The next Biennial should be held at the Museum of Contemporary Art (MoCA), where it will assemble in April 2020.The reopening of the Museum of Modern Art, which is currently closed due to Covid-19, was delayed in April. The museum has since celebrated its sixtieth anniversary. “The grand opening of the Museum of Modern Art in New York City in 2015 marked the opening of a new chapter in our history,” said Charles D. Evans, director of the Museum of Modern Art. “Having constructed an exhibition-worthy collection of work by some of the most celebrated artists of our time, the MOM has cultivated its own unique reputation as an artistic and intellectual center for generations of visitors. We are thrilled that the MOM will reopen as the Museum of Modern Art is reborn, and look forward to welcoming the new and returning generations.”\n\n\nThe National Gallery of Art in Washington, DC, has added two new members to its board of trustees: artist and philanthropist Lora Iannone and artist-activist Wangechi Mutu. Iannone, a Chilean American, was named a trustee in November 2018 and has been a supporter of the museum since 2015. She was also a MacArthur Fellow"]