["The next Biennial should take place in 2021. The first Biennial was held in 1989, and its most recent iteration, the 24th, was held in 2018. In the past, the inaugural iteration of the institution was held in May.The Biennial was founded by Jean-Michel Basquiat and Jacques-Henri Lévy to commemorate the artist’s passing. It was cofounded by Rachel Chávez, the former director of the Alternative Art Museum of Montreal, and Alexandre Blondel, the founder of the Parisian gallery N.M. Van'lune. The museum’s inception was inspired by the Nancières-Maritimes in New Brunswick, which is now the Louvre. Its current exhibition space is in the lobby of the Louvre.Since its inception, the museum has showcased more than 1,500 works, including works by Robert Mapplethorpe and Thomas J. Mapplethorpe. In 2017, the museum also inaugurated the Gaillard Gallery, a new curatorial initiative that began in 2017. In 2018, it won the Prix Marcel Duchamp, and in 2019, it was awarded the GrandeCroix Grand Prix.\n\n\nThe Maritime Museum in Portsmouth", "The next Biennial should be held in the spring of 2021. The 2019 edition featured nineteen works by fifteen artists, including Asa Freund, Svetlana Lutsenko, and Anton Kern. A special exhibition of work by the Russian artist Oksana Goshchak will also be staged at the event, which will be hosted at the Museum Karlsruhe in Karlsruhe from September 25 to September 28. \n\n\nThe Metropolitan Museum of Art in New York has announced that it plans to allocate nearly $10 million to revitalize and improve its on-site parking lot, the Metropolitan Gallery, and the Museum of Arts and Design, the Museum of Modern Art, and the Solomon R. Guggenheim Museum. The funds will go toward the construction of new amenities, including a meeting space, a cafe, and a rooftop terrace. The changes will be made as part of the museum’s redevelopment of Henry Hudson Plaza, which is currently under construction. The complex, which is being constructed by the same team responsible for the original Henry Hudson Plaza, is slated to open in 2023.The plan includes $5 million for the construction of a ground-floor retail and conference space, $4", "The next Biennial should be held in 2022, and the 2026 date for the exhibition. The Biennial will be relocated to the Museum of Modern Art, New York; the Biennial will also continue to be held outdoors, with a new exhibition of works that explore the history of architecture at the Museum of Modern Art, New York.\n\n\nThe Museum of Modern Art (MoMA) in New York has launched a new initiative, the Museum of Modern Art Research, that will partner with museums to help them understand and conserve the art that was made in the last five hundred years. The initiative will focus on understanding how cultural artifacts—including works, installations, books, and other artifacts—are used in both cultural and social contexts in order to better understand the history of art and how we can conserve it.“This is a moment of tremendous change. As we reflect on the past and consider the future, it is important for museums to understand and respond to the current. MoMA Research is an innovative way for museums to understand the history of art, and a powerful way to conserve it, while enmeshing the museum in meaningful ways that restore the museum to its center position and engage with the people who visit.”Ian Smith, director and CEO of", "The next Biennial should host a collection of works that probed the interdependence between the body and the self and the links between art, technology, and the body. The design of the exhibition should reflect the themes of the spring biennial. The first Biennial of the body will focus on the body’s relationship to culture and the second on the body’s relationship to the digital world. The third Biennial of the body’s relationship to the digital world will take place in the first floor of the institute; the fourth Biennial of the body’s relation to the digital world will take place in the second floor of the institute; and the fifth Biennial of the body’s relationship to the digital world will be held in the third floor of the institute. The exhibition “Venus in Disguise” will organize twenty-eight works by fifty artists. The show will run from April 10 to April 22. The forty-fourth Art Biennale will be held in the same location in 2019. The forty-fifth Art Biennale will be held from May 14 to May 16. In addition, an additional exhibition, “Organic Cinema” will be staged at the Art Bienn", "The next Biennial should take place in the spring of 2020. The first iteration was held in 2019. The show will include works from over seventy artists from twenty-nine countries and seven continents. The 2019 edition, which was organized by the Hong Kong–based artist Emily Lau, featured work by Hong Kong–based artist Eileen M. Chen, Hong Kong-born artist Tadao Ando, and Hong Kong–born artist Yi-Chun Lee. The show’s inaugural iteration, which was held in February 2019 and ran for twelve days, featured work by artists such as David H. Dinn, Kim Seo-sung, Kim Eun-sung, and Kim Eun-kyo. The show’s second iteration, which was held in March 2019 and ran for eighteen days, brings the artists’ work to life in color. Singer-songwriter Park Seo-kyo, who represented Korea at the Venice Biennale in 2011, is the first Korean artist to be included in the show.\n\n\nThe Chilean artist, playwright, and critic Juan Rojas has been named the winner of the 2020 Pulitzer Prize. It was established by the", "The next Biennial should be held at the Modern Art Museum in New York in 2022. The museum’s board president, Michael Govan, said: “The next biennial will reflect a new and challenging point of view, drawing from a rich body of artistic practice that is in a moment of renewal. It will also be a moment for reflection. We are eager to work with audiences to better understand the art of our time, as well as to engage in thought-provoking and transformative design practices.”\n\n\nThe National Gallery in London has appointed Paul Mpagi Sepuya, the director of the Solomon R. Guggenheim Museum in New York, as its new interim director of design. The appointment was made on Tuesday, September 9, and comes three days after The Guardian published an article by British art historian Guto Begl, who wrote that Sepuya is the “right person at the right time.” Begl, who has written extensively about the need for a “new articulation of the Guggenheim’s collection, and that Sepuya has the ability to’t only ‘turn the Guggenheim into an institution of great cultural and", "The next Biennial should take place in 2021, the same year as the BGC, which will be moved to the Downtown Arts Center in the city of New Delhi, under the aegis of the Mumbai-based nonprofit Art Fund. The inaugural edition of the exhibition was canceled last year after organizers failed to secure the attendance of three hundred artists from thirty-five countries.BGC director Rishi Sunak said: “The hall is a great success story of a festival that was born with the mission to help local artists and raise awareness of their work and create a platform for them to spread their vision. The ambitious exhibition format and global reach of the event only further underscores our commitment to support and encourage this incredible group of artists. We look forward to their future work and to the next show, which will hopefully draw ten thousand people.”\n\n\nThe Museum of Modern Art (MoMA) in New York has received a $1.5 million donation from artist Hermione Moussou. The gift includes a collection of mosaics, sculptures, and other works, which were previously on display at the institution, as well as a new survey of the work of Sylvester Stallone and Paul Newman.The donation was made by artist Patricia Marilena", "The next Biennial should take place in 2021, and the 2020 iteration will have a new theme: The Birth of the State. For its 2016 edition, the museum formed a panel of historians to draw from the works and identify key thinkers and the impact they had on shaping the American experience. As part of the exhibition, the museum acquired twenty-six works from the collection by Stanley Arne Guggenheim; John Kenneth Galbraith, a leading scholar of twentieth-century art; and several pieces by artists who were not represented in the exhibition.\n\n\nThe Australian Sculpture Museum (ASCM) in Melbourne has received a gift of more than 1,500 works by some seventy artists from the collection of the American philanthropist and philanthropist Adrian Piper. The works, which are on display in the exhibition “Theater of Operations: The Gulf Wars 1991–2011” at the museum, were donated by collector and philanthropist Adrian Piper, who has served as a major supporter of the institution since 1999, and his son, Philip, in support of a series of exhibitions and other programs that have addressed issues of state violence, the environment, and sustainability.“We are extremely grateful to Adrian for her generosity in supporting this important project, and", "The next Biennial should be held sometime in the second half of 2020.The institution will present the first edition, which will take place in the Art Deco Art Deco theme space of CNE, in the Pacific Standard Time on March 29–April 1. The exhibition will also take place in the central Egyptian city of Giza, on April 4, and will be curated by Abdalili Habib, the curator of contemporary art and architecture; Ibrahim Saied, the director of the Institute for Contemporary Art and Design in Qatar; and Abdulrahman Badr, the director of the Tow Collection in Dubai. The exhibition will then return to Cairo, the National Museum of Egypt, the Egyptian Museum of Modern Art—a project of the Egyptian Ministry of Culture—and the Louvre, and will continue its travels to St. Petersburg, the Museum of Art in Istanbul, the National Museum of Egypt, and the Museum of Modern Art in Salzburg. “This is a very exciting moment for us, and the Biennale of Sydney, in particular, as we finally set about the next edition of the Biennale Sydney, which will become the landmark event of the 2020 edition,” said Becky", "The next Biennial should include a presentation of an original project by the artist, an exhibition of works by her contemporary artists, and perhaps her first public solo show, which will be followed by a major public celebration.\n\n\nBrazilian artist Luiza Nascimento, who was a key member of the country’s Peruvian collective O Jogo, has died at the age of seventy-two. Her work is currently on display in Argentina’s Palacio de Arte Contemporáneo de Rio de Janeiro (PACR), which inaugurated the exhibition with a new series of works by the artist in 2017.Born in 1938 in the city of Para and raised by a single mother in São Paulo, Juarez, Nascimento studied painting at the University of São Paulo and at the National Museum of Fine Arts in Belo Horizonte. In 1958, she moved to the state of Rio de Janeiro, where she studied with Paolo Bava (1933–2005). In the 1960s, she moved to Buenos Aires, where she met Bava’s brother, Jurgen. Despite her success, Nascimento never established a studio in Brazil. In 1977, Nascimento was", "The next Biennial should take place in 2020. “The exhibition is not an attempt to recreate the life of a woman, nor is it a chance to study contemporary fashion,” Bernarda Ritter, director of the Museum of Modern Art, told Artnet. The exhibition, which is titled The Body, is part of the museum’s ongoing work to question the body and the ways in which we present and consume representation. \n\n\nThe Allen Memorial Art Museum (AM) in Cincinnati has received a gift of more than twenty-five works by artists whose bodies are lying buried in the museum’s recently renovated grounds. Among the works donated are a pair of '60s skinheads and a pair of American Pop artists, Adrian Piper and Stacey Swift, who were both active in the underground punk scene in the 1980s and were both murdered by members of the same group in a Chicago hotel room in 1993.The works, all works on paper, are part of a larger gift that includes more than 115 items from the museum’s collection, including a sculpture by artist Henry Barlow, a set of paintings by artist Henry Mancini, and more than 100 works from the Allen Collection, including works by Domenick", "The next Biennial should be a gathering of around one hundred artists, designers, and other cultural leaders to engage in an open and participatory experience in collaboration with the public. It should also include a presentation of a new work, a workshop, and a reception. The show will also include new works by the likes of Alex Katz, Anna Atkins, Martin Brink, Peter Blank, and many more.  \n\nThe Italian city of Naples, which was rocked by a massive fire that broke out in a nearby industrial building on March 15, has released several new safety measures to protect visitors to its historic Pompeii Gardens and has also introduced new health and fire regulations. In a statement, Mayor Dario Franceschini said: “We’re trying to do everything that we can to minimize the risks to visitors to the Gardens. Among the first things that must be done are ensuring that all structures and all spaces in Pompeii are safeguarded, that buildings are never damaged by fire, and that people’s personal belongings cannot be overcrowded.”While the fire was contained within the building, which is owned by the city, the fire crews were able to reach the site before the fire brigade arrived and extinguish it quickly. The city has", "The next Biennial should be held on the same date, but in the autumn of 2019. The exhibition will be convened by the mayor of Nice, Xavier Bertuil, and will run for twelve months. The theme for the upcoming exhibition will be “Love and its Effects on the Body,” and the artist-run platform will provide a platform for artists who are grappling with the themes of their works. For the exhibition, Biennale organizers have chosen French writer and critic Christian Halsall as a featured artist.Halsall’s work will be featured in “Love and its Effects” alongside works by artist Malawian artist Thuli Madani, who has been selected as the winner of the Rio de Janeiro Art of Life Prize, and the Dutch artist Willem de Kooning. The prize jury will decide the artists’ future projects together with an international jury composed of Bojana Ginn, editor-in-chief of Artforum; Bénédicte de la Pechova, director of the Salonika Institute of Art and Design in Amsterdam; and Thaddaeus von Küngen, director of the Künstlerhaus in Cologne. The group will announce the artists’", "The next Biennial should be held in 2020. Elsewhere, artists have been commissioning a series of large‐scale works for the event that would take place in various locations around the city, from the Art Institute of Chicago to the Lincoln Center in Lincoln, Massachusetts. The inaugural exhibition will showcase the work of the Los Angeles–based artist Kiki Smith, who also serves as a cofounder of the LA–based nonprofit LA Foundation for Contemporary Art (LA@@CA).“For the past fifteen years, Kiki Smith has been working to produce works that reflect the breadth and depth of her artistic practice,” said Julie Hirschfeld, the Festival’s executive director. “Her latest exhibition will showcase her work in a truly magical moment in her life: a gift from her daughter, Max, a stunning new series of paintings by the artist that will open at the Museum of Contemporary Art (MoCA), in Los Angeles on September 5, 2020.”The first show of Smith’s work to open at MoCA will be “An Open Letter from my Daughter,” which is slated to open in the fall of 2020. It will be followed by “Cindy Sherman’s ‘The Life of", "The next Biennial should be held in the spring of 2021, with a selection of works that will be presented in both English and French. The exhibition will also introduce a new online-only platform that will be used to present the works.  Curator and curator of contemporary art Janet Adger, who is also a curator of the twentieth century, said: “This biennial will introduce readers to the work of a select group of artists, and showcase the work of the most important contemporary artists of our time. We are truly honored to be able to organize this exhibition and to present it at the Museum of Modern Art, New York.” The exhibition will be inaugurated by a series of solo presentations of works by the artists represented in the exhibition, which will be preceded by a special exhibition of works by the late Iranian curator Mohammad Reza Nouri, a selection of works by the artists from the exhibition.\n\n\nThe National Geographic Society in Washington, DC, has received a gift in the form of nearly five hundred works by thirty-nine artists. The acquisition, which was made by David H. Koch, the billionaire founder of Koch Industries, was made in 2014 at a great price; the institution sold the works for $390,000. The", "The next Biennial should focus on developing and expanding the collection, which is currently home to more than 1,500 artifacts, designs, and artifacts that were created by the artist’s interlocutors. The museum will also work with local communities to find new uses for the objects.In an interview with Artforum, Dittrich said: “I wanted to create a museum that would be able to provide a platform for the exhibition of modern art in the United States, and the most modern art in the world. We’re in a moment when the artifacts of our era are being pushed to their limits, and we’re in the process of replicating them. The museum will be able to work with the collection in the future to define and test new technologies and new means of scholarship to make the museum’s collection more accessible to the public.”The museum, which was established in 1960 by a group of Detroit-based entrepreneurs, is currently undergoing a $1.4 million expansion, which is slated to be completed by the end of the year.\n\n\nThe National Zoo in Washington, DC, is planning to shutter its doors on March 31 following thirty years of operation. The institution is working with architect and urban designer", "The next Biennial should be held in 2021. \n\nCommissioned by the National Gallery of Art, the inaugural exhibition, “The Perfect Storm,” will draw from the artist’s own experience of extreme events, including the pandemic, and will examine the connection between art and everyday life. The first show of the exhibit will open on September 30. Subsequent shows\u0097which will be curated by artists and selected by the gallery\u0097will be announced by artists and the gallery. The first show of the exhibition will be held at the National Gallery of Art, the National Museum of Contemporary Art in Dusseldorf, and the Rosenbach Museum in Munich.The exhibition will examine the relationships between art and everyday life\u0097the Paris-based artist Sebastien Prouvé and the German city of Mainz, which is preparing to welcome tourists to the exhibition’s opening ceremony in May, and will also examine the biennial’s reception in the United States and Europe. The exhibit will open on May 27.Commenting on the exhibition, Daniel H. Weiss, Esq., chief curator of the National Museum of Contemporary Art, said: “The National Gallery of Art is thrilled to welcome the galleries", "The next Biennial should also include a presentation of work by artists whose practices address issues of health and austerity, including Sara Wilson-Montgomery, Younus Abou-Rahme, and Theo van der Waals. The exhibition will be organized in three phases, with the first and second stages scheduled to open in the coming months. The first half of the biennial will focus on themes of resilience and the Black Lives Matter movement; the second half of the biennial will explore the role of art in the fight against racism and systemic violence; and the third half of the biennial will explore the relationship between the art world and society at large. The full list of participating artists is as follows:Sarah Pidcock, Philadelphia: Architecture and Design:  Sarah Pidcock, Philadelphia: Architecture and Design: Sarah Pidcock, Philadelphia: Etch and Shape: Sarah Pidcock, Philadelphia: Etch and Shape: Sarah Pidcock, Philadelphia: Architecture and Design: Sarah Pidcock, Philadelphia: Art and Social Practices: Sarah Pidcock, Philadelphia: Art and Social Practices: Sarah Pid", "The next Biennial should be held in 2020.\n\n\nThe Edinburgh Biennial, which was pushed back to 2021 after the coronavirus outbreak in Europe and the United Kingdom, has announced that it is looking to push back its opening by at least two years. The delay was made in response to concerns over the strain of the virus that causes the virus, Cervarix, which was discovered in 1970, has recently been reported to have spread throughout Europe.While it is still not known whether the coronavirus causes illness, the International Agency for Research on Cancer (IARC) in Geneva says that the number of cases of the virus in Europe is increasing, and that the number of deaths from the virus is likely to increase. The World Health Organization (WHO) also said that the number of cases in Japan is likely to rise. In the United States, the number of cases is expected to double by the end of the week.The reopening date of the exhibition will be determined by how long the pandemic lasts. For the December show in New York, organizers decided to cancel the entire event, which was supposed to take place December 15–December 17, and moved it online a week early. “We are facing two crises at once,�", "The next Biennial should focus on the philosophy of sculpture and on the history of the art, and should be organized in an open approach, to the needs and tastes of the audience. The idea of a biennial that took place across Europe is a good one, but given that the twenty-fifth Biennial was held in São Paulo in 2010, it is unlikely to be realized. The Biennial of Latin America, which will be held in Fortaleza in the Brazilian state of Pernambuco, will be conducted from January 3rd to January 10th. Despite Brazil’s establishment of an Office of the Governor of the State of Pernambuco in 2010, the forty-second biennial, the Biennial of South America, which will be held in the city of Porto Alegre, Brazil, is not currently scheduled to begin.\n\n\nMIDWESTAKTER, MA: An eight-hour performance, titled The Place of the Dead, will return to the Massachusetts Institute of Technology (MIT) this fall for a third year, in partnership with the Massachusetts Society of Arts. The event, which will run totem-size sculptures, will", "The next Biennial should be held in the spring of 2021.  Inaugurated by the artists Federico Cattelani, Valentino Cattelani, and Vittorio Bertoletti, the show will be comprised of forty exhibitions of work by contemporary artists from Italy, the Balkans, the Middle East, North Africa, and South Asia, with the mandate to explore the interconnections of identity and migration and the transformations of landscapes and peoples. The biennial will not be an open-ended project, but will begin with an online exhibition, which will culminate with a biennial event in the city of Milan.\n\n\nThe Metropolitan Museum of Art in New York and the Solomon R. Guggenheim Museum in New York have agreed to merge, the New York Times reports, following the completion of the $7 billion expansion of the institution. The deal will result in the merging of the three institutions, which are located on the ground floor of One57, and will also involve the construction of a new 250,000-square-foot Visitor Experience, which will be inaugurated with a free public viewing of the Italian architect Paolo Baratta’s installation Revelations, 2019.The project, which", "The next Biennial should take place in the spring of 2021, with the exhibition-ending exhibition “Untitled: An Exhibition of Power” taking place in the summer of 2020.In celebration of the occasion, the city has also launched a new $1,000,000 biennial scholarship fund. To apply, e-mail curators tolsymsyk@gmail.com.\n\n\nThe United Kingdom is planning to slash funding for arts and cultural organizations and redirect funds across the UK in an attempt to cut the £11 billion deficit that is growing in the UK’s public finances as a result of a combination of the opioid and the Ebola crisis. The changes were made in a budget update published by Prime Minister Boris Johnson on Monday, and they will likely take effect in the coming months.According to the Guardian, the government’s funding of arts and cultural institutions is being restructured to align with the changing needs of the UK’s economy. As a result, the arts and cultural sector—which makes up almost one third of the UK’s gross domestic product—is being targeted in its budget with a $8 billion cut, or about one-third of its funding. The arts and cultural sector is also being targeted for", "The next Biennial should focus on intimate projects such as the creation of a new collection of works on paper for the collection, the contemporary art of the sea, and the materiality of ideas. It should also strive to include a new selection of works by artists from the contemporary art traditions of Brazil, Mexico, and Peru.”\n\n\nAfter a tumultuous three-month campaign, the Museum of Modern Art (MoMA) in New York has announced its 2020 triennial schedule. Titled “The American Experience,” the fair will run from February 3–February 5, 2020 and will draw approximately three hundred galleries from across the country. Curated by Mark Brescia, director of the Brooklyn-based nonprofit the Center for Art & Art History, the event will feature more than two hundred exhibitions, seminars, and talks, and will run across all three boroughs of New York City.“We are thrilled to announce that the next year’s MoMA triennial will be the first presented by the Museum of Modern Art in New York City,” said museum director Michael Govan, who added that the institution is committed to working with the community to develop a new and engaging exhibition for the fair.MoMA will begin the fair by", "The next Biennial should include a new Worksman-designed installation, “Amerika” (2014), which will be the first work in the series by the late French and Italian sculptor Paul Gauguin.  The biennial will be held in the former Port Authority of New York and will draw from the works of a number of artists, including Austrian Dutch-Rencontres Rodolphe Reuter, Robert Mapplethorpe, and Willem de Kooning.\n\n\nThe Los Angeles County Museum of Art (LACMA) is celebrating its fifteenth anniversary with a grand opening on September 7. The institution is currently undergoing a multimillion-dollar expansion, which will increase the size of the museum by more than two hundred thousand square feet and introduce more than three hundred galleries, classrooms, and other public spaces. The project also involves the installation of more than four thousand photos and more than three hundred films, including more than seventy-five from the director Michael Powell’s “Southern Exposure” series, 1979–1983, and “Rebel Without a Cause” (1979–1981), an archival project of photographs and art dating back to the 1960s.LACMA is also planning to", "The next Biennial should be hosted in the autumn of 2020 and will be organized as follows: The next Biennial will take place at an indoor theme park in the city of Buenos Aires on October 29–November 3, 2020. The event will be hosted by the civic organization of the same name and will be led by an artist-in-residence. The developer of the theme park will be identified as Tarek Abou El-Khazzani and will be sponsored by Qatari state-owned company Al-Jazeera. The venue will be inaugurated by a visit by architect Antonio Cipollotti. Inaugurating the Biennial is an exhibition entitled “Inaugurata de Buenos Aires,” a project co-organized by the designers of New York’s High Line, as well as the BÀSP Foundation and the Nude Beach Club in the town of Santa Fe, Argentina.Curated by Daniel Salazar, who served as artistic director of the New York High Line from 2016 to 2019, and drawn from a list of twenty artists, this exhibition will feature works by artists from various countries. Among the artists chosen for the show are Sadé Alejandra, Assata Kahane, Te", "The next Biennial should also include a symposium on the legacy of Simone Leigh, and an exhibition of works by the biennial's curators, Rosalind Bennie and MIRIUS. Students and visitors to the biennial will also be able to see the exhibition of the works of artist-in-residence A.R. Rahman and other curators in the country.The exhibition will also feature selections from the biennial’s exhibition “The Death and Life of Pablo: The Making of Pablo.” The work of the curators is currently on display at the Museo de Arte Contemporáneo Ateneo Artem.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles announced today that Hanna Boesky has been hired as its new director and chief curator. Boesky comes to the museum from the Getty, where she has served as deputy director of curatorial affairs since 2015. During her tenure at the gallery, she worked to expand the museum’s collection and create new exhibitions, including “The Bodies in The Gallery: The Making of Mark Rothko” (2017); “Kiki Smith: Homage to the Artist” (2007); and", "The next Biennial should take place in 2022.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has received a gift of three works by British artist and polymath Stanley King. The works, which were acquired through a deal that valued the artist at $4.6 million, are from the artist’s exhibition “The Late Ranging,” a 2007 exhibition that celebrated British modernism’s history with a retrospective of his work, “The Power of Colors.”King’s works are part of a new collection of work by British artists that will open at the museum in November and explore the relationship between modernism and British modernism. The exhibition will feature work by no fewer than twenty artists, including William Kentridge, Peter Sellars, Grant Chedid, and Alice Black, as well as a selection of Stanley King’s “Postmodern Man,” a 1995 exhibition that focuses on the postmodernist movement.In the exhibition “Postmodern Man,” King, who is best known for his work in the electronic and visual arts, including his 1993 installation of sound in his studio that was exhibited at the very same institution that houses the museum’s Stanley King", "The next Biennial should focus on “light as a medium,” drawing from the work of numerous artists, including Morris Louis, Kenneth Turan, and Hotovu Naumaa, and include appropriate performances in place of interviews.“I want to give my first talk to a non-European artist who has been to the US for fifteen years,” Fernando de Armas, director of the Biennial de Barcelona, wrote in an open letter.The 2019 edition of the Biennial was set to take place at the Catalan city of Santa Elena in northern Spain, and the 2019 edition of the event will be held at the San Francisco Museum of Modern Art in California.\n\n\nThe Lebanese artist Walid Raad, whose moving-image series “Lethal Emotions” (2011–13) reveals the violent, internal struggles of gay and lesbian people in Lebanon, has died at age eighty-three. The series, which features images of people being tortured or killed by their partners, bi-sexuality in general, and sex workers, as in the 2007 film “Bagdad Alaeddin” (Bagdad the Martyr), is one of the first works to be exhibited at the Sursock-", "The next Biennial should be held at least every two years. The biennial will be hosted by the Museum of Modern Art (MoMA), which was forced to move the exhibition, Monopol, from the fall to spring format in May 2019 after the venue refused to take down a Judea and Samaria art site that was part of a UNESCO World Heritage site in the West Bank. Although the site was pushed back several times, it still remains incomplete, and the exhibition has yet to reopen.The museum’s director, Peter F. Kohn, told the Los Angeles Times that the “next Biennial will enable us to finally confront the question of ‘architecture’ and its relation to contemporary life in the United States.” The question of whether the biennial should be cancelled was raised last year when the museum temporarily closed to the public in order to observe a large-scale renovation of its collection. The renovation involved the removal of dozens of works from its collection, including works from the Holocaust, the Spanish Inquisition, and feminist theorist Luleå. \n\n\nThe Solomon R. Guggenheim Museum (SGM) has appointed Felicity Hammond as its new executive director. Hammond takes the", "The next Biennial should be held at a location within the city of Atlanta and will be led by the Yvonne Rainer Foundation, a nonprofit organization dedicated to artists and creative practice. The institution will house approximately one hundred artists\u0097no matter the medium\u0097and will be co-chaired by Rainer and artist Ai Weiwei\u0097all in the process of reestablishing a residency at the city’s Art Museum.Among the artists participating in the exhibition are Amitaka Firo, Mark di Suvero, Yosaku Hasegawa, Tatsuya Kozuoka, and Michael Lonsdale. The exhibition will also feature paintings by Fred Tatuya and Lisa Littell, and will launch a new online platform with the project, entitled Simultaneous Worlds, that will chronicle the biennial’s journey through art history.In order to facilitate the exhibition’s installation, installation, and residency program, the museum has partnered with the Atlanta-based artist Andrea McClintock. Cooperating with the museum is a collaboration with the Atlanta-based artist and organizer Alan Lewis. In collaboration with McClintock, Lewis will create a installation for the biennial", "The next Biennial should be held at least once a year, and should aim to bring more diverse and international artistic practices together in a meaningful way. We look forward to the proposals of the artists who are represented by the Creative Asia Pacific 2020 and 2020, and to hearing from you.Geneva Artbox, Hong Kong: The 2017/18 edition, which focused on the history of art from across the globe, will return in 2020. The exhibition will feature works by seventy-one artists, including Amy Aselton, Sunil Gupta, and Amy Tan, and will also expand on the theme of the exhibition from “the past to the future,” incorporating recent exhibitions.The 2019/20 edition was organized by the consortium of artists comprising Bariloche, Sharmini Barhen, Gao Gao, Koun Vadive, and Xaver Shaw, and featured works by forty-four international artists. The show received a retrospective at the London’s Tate Britain in 2021, and the first English-language biennial of the group will open in the United States in 2021.\n\n\nThe National Geographic Society’s planned redesign of its headquarters in Washington, DC, has been put on hold while it finalizes a new contract with", "The next Biennial should be held in 2021. The announcement was made during a ceremony held at the Temple of Solomon in Jerusalem. The exhibition, which will focus on the avatar and how the concept of a godhead can be put into a physical form, will showcase the work of twenty-nine artists, including Enokobe, Nari Ward, and John Ward, and will mark the occasion of the 150th anniversary of the Temple of Solomon. The next edition of the Biennial will take place at the Temple of Solomon in 2021.  The first edition of the exhibition, entitled Conceptualization: Beyond the Concept of God, was created by Sifre Bocanegra and Bermuda Hujar. Featured artists for the 2019 edition of the exhibition are Hiroshima Takeda, Katsu Naito, and Shigeto Yamaguchi.The 2019 Biennial, titled The Future Is Present, was curated by Sara A. VanSchewelen and Kirsten Sze.  “The exhibition represents a great leap forward for the history of contemporary art in that it presents a work by a group of", "The next Biennial should be held in the Spring of 2020. \nThe awards ceremony will take place at the Smithsonian’s National Museum of African Art in Washington, DC, and will air live on PBS, PBSNewsHour, PBS Sundays at 11 PM, PBSNewsHour, and PBSNewsHour HD. The biennial will also feature a performance by the Detroit Institute of Arts, a performance by the Oakland County Ballet, an exhibition of works by the Los Angeles–based artist Bradley Center, and a presentation of work by artist and activist Julie Mehretu.\n\n\nThe French Ministry of Culture has awarded the first prize to the Los Angeles–based artist Guillaume Bénédouvignle, who was selected for his studio-based installation The Archaeological Accords, which premiered at the Venice Biennale in January. Bénédouvignle’s work, which examines the relationship between the village of Lorient and the city of Los Angeles, is one of several installations that explore the history of the West in which archeological sites and artifacts are often intertwined. The work was also included in the essay contest organized by the French exhibition program Faculté d’Art Contemporain (F", "The next Biennial should be held in 2020. “The new Biennial will take the art and design of the past and present in new and exciting ways,” said Hoor Al Qasimi, president of the Qatar Foundation and the Arts Council. “This is the moment, and the next Biennial will be its time, as a major landmark event, as it marks the occasion of the tenth anniversary of the Qatar Foundation. The Qatar Foundation is a global leader in supporting the arts in Qatar’s diaspora, and has been since its establishment. Since the organization’s founding in 2014, it has supported more than three hundred artists and organizations in Qatar. The inaugural event, Dubai, featured work by more than seventy artists and organizations.  “The next Biennial will be a salutary and inspiring expression of creativity, dedicated to humanism and compassion, and an occasion for the revival of the international arts and culture,” said Hoor Al Qasimi. The design elements of the pavilion were inspired by the pavilion in the Al Madinah State Museum in Riyadh, and the surrounding landscape, which is also known as the Madinah Desert.  ", "The next Biennial should take place in the spring, sometime in the summer and will be curated by João Seixas, the president of the Autonomous District of Rio Grande do Sul.The third and final edition of the exhibition will be held at the Museo de Arte de São Paulo (MASP) in São Paulo, Brazil; the Museo dos Cultura Pampas (MADP), Brazil; and the Museo do Rio Grande do Sul (MGR), Brazil.\n\n\nThe Frankfurt Art Museum (FAM) in Germany has appointed Sijbe Eijbæk as its next director. Eijbæk comes to the institution from the Max Planck Institute for Contemporary Art in Leipzig, where he has been an assistant director since 2015. He succeeds Joakim Esker, who departed in the summer of 2019 to head the Leipzig Art Museum as director of the Max Stiernitzky collection.Eijbæk will assume his post in August. He succeeds Matthias Fischer, who served as president of the institute for more than twenty years, and will take up his post in October. Fischer was the first to resign when he stepped down after the Vienna", "The next Biennial should be held in 2021. For now, the exhibition will continue as planned, with the help of artist-in-residence, and will showcase the works of seventy-six artists over the course of a year. Commenting on the retrospective, Saar said: “We are delighted to continue with our program as planned, while the project continues to attract and support the very best contemporary art from around the world. We are grateful to our staff, artists, partners, guests, and the families of the biennial’s participants for their dedication and enthusiasm throughout its development.”\n\n\nCultural spaces and organizations in the United Kingdom are facing an unprecedented crisis. The UK’s Institute of Contemporary Art (UKI) was forced to close its doors indefinitely on Monday, August 17, in the wake of the coronavirus pandemic, and on Tuesday, August 18, it announced that it would be forced to go into voluntary administration. The deadline to secure cash donations for the institution is September 16.In a statement, the IK described the shutdown as “devastating and unprecedented.” “On the second day of the Covid-19 outbreak, we have been forced to make difficult", "The next Biennial should be held in 2020, and the ten-year plan is currently underway. The event will now be curated by the United Kingdom’s Tate’s director, Maria Balshaw, and the curator of contemporary art, Elizabeth Cady. Based in London, the pair will then invite forty artists for a special exhibition in London in 2022.The announcement of the reshuffled roster comes on the heels of a change at the biennial’s next iteration in November 2019, when the field was introduced to a new group of artists—Morocco’s Guy and Mary Mays. The two-person team, led by director Polly Staple, followed the biennial’s original design, featuring a bridge of five pavilions, and created an exhibition that explores the history of African art. The exhibition, “Elite Partners,” was staged at the London Gallery of Art and opened on November 13, 2019. “This is a major milestone for us, for the 2020 Biennial, and for the field as a whole,” said Kassem Abdel Nabi, director of the biennial. “The 2019 edition was a fantastic success, and we are delighted to be able", "The next Biennial should be held in 2020, but the remaining dates are subject to change.The new venue is the Museo de Arte Contemporáneo Brasileira in São Paulo, Brazil, and will be inaugurated with a program of lectures, workshops, presentations, concerts, performances, performances, exhibitions and other events organized by Bolíst and her collaborators, which will culminate in the exhibition “NIRIN: Stories from the Center Stage” in the centre of the city, in September 2021. \n\n\nAfter a two-year investigation, a New York appeals court has upheld a $200,000 fine that went unpaid by the National Gallery of Art (NGA) in Washington, DC, after the institution admitted that it failed to register more than one hundred artworks by artists whose works were on display in the institution as required by federal law.The fine was levied against the NGA in 2017 after it was accused of violating the Connecticut Visual Artists’ Anti-Abusing and Collection Practices Act, which requires the display of works in private collections. The act also requires that museums maintain written policies and procedures for the treatment of works in their collections.The NGA sought to dispel the connection between the", "The next Biennial should be held in 2019 and will be hosted by the university in collaboration with the city of Milan, the city of the same name and other cities in Italy, and the city of Venice.The exhibition’s inaugural edition in February was attended by around twenty thousand people. The next iteration will be held in December in early 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in New York has appointed Amy Rinaldi as its next director and CEO. Rinaldi comes to the institution from the Los Angeles County Museum of Art (LACMA), where she has served as deputy director since 2015. She succeeds Jennifer Schoelkopf, who was hired as director of the Metropolitan Museum of Art in New York in October, and will assume her responsibilities in January 2021.“Amy brings exceptional leadership, exceptional curatorial and administrative skills, and an exceptional record of accomplishment in leading a museum,” said director Timothy Rubenstein. “At the cutting edge of contemporary art and design, Amy is poised to expand and further define the role of a modern museum director.”Prior to joining LACMA, Rinaldi served as a curator at the Los Angeles County Museum of Art (LACMA), where", "The next Biennial should be held at least once a year, but preferably twice a year. While the current exhibition is the first biennial to focus on the role of the human genome in human health and well-being, the next edition will focus on the effects of the epidemic on different parts of the world.”\n\n\nThe Hong Kong–based artist, activist and curator Ruba Amin, whose works juxtapose cultural and spiritual traditions as seen through the lens of contemporary art and personal narratives, has died at the age of eighty-eight.Amin was born in 1937 in Shanghai, China, where her father, a businessman, was working on a project to convert the city’s Ming Dynasty style palace of the Forbidden City. Her mother, a teacher, encouraged her artistic pursuits and raised the family in the United States. After graduating from the University of California at Berkeley in 1964, Amin moved to Paris, where her father sold a painting to a collector. After completing a year in New York, the exhibit opened at the Museum of Modern Art in Philadelphia and went on to be one of the first exhibitions at the institution.After moving to Hong Kong, Amin found work in the art world and, in 1967, founded a company, a Hong", "The next Biennial should have been held at the same time as the Art Deco Biennial but was postponed due to the Covid-19 pandemic. “We are deeply disappointed that this decision was made without the prior consultation of the board of trustees and the members of the curators’ staff,” said David Pogue, chair of the trustees and the board of trustees. “This is a sad day for the city of Houston and for the art world.”The decision to cancel the fair came as a surprise to many, especially since the city has spent more than a decade trying to prod the Harris County Museum of Art (HCMA) into moving its flagship event, Art in the City, from November to March. The March date would have seen the exhibition open in late April and have been a potent marketing opportunity for the city’s new $3.2 billion CityCenter redevelopment plan.The February announcement that the HCMA would be closed until May prompted outrage from residents in the city’s East Side, where the HCMA is located. Many supporters of the institution, which has a permanent collection of more than 1,900 works, staged a sit-in outside the museum on Wednesday, May 28,", "The next Biennial should be held in 2020.\n\n\nThe Italian government has offered $25 million to the MTA in central Rome to revive the Southern Railway, a decaying, half-finished subway system built in the 1960s that was plagued by delays and overcrowding. The Ministry of Transport and Rail, which announced the plans for the revitalization project in November, said the restoration of the line would be a model for future generations of Italian urban planners and transport theorists.“The transformation of the Southern Railway into a modern and modern-day city is a strong step towards making it a reality,” Ministry of Transport director Andrea Monti said in a statement. The announcement was made during a tour of the original site of the railway, which is currently being renovated by the Guggenheim. The museum plans to present the first public tour of the site, which is currently being restored, in 2021.\n\n\nThe Chilean artist Humberto Leoni has won the twenty-fifth edition of the International Association for the Visual Arts (AVA) in Zurich. Titled “Grandes árboles” (Theaters of Light), the exhibition, which celebrated its twenty-fifth anniversary last week, drew", "The next Biennial should take place in 2022.\n\n\nThe Center for Art and Light (CAL) in the City of Los Angeles, California, has appointed Laura Mulvey as its next executive director. Mulvey comes to the institution from the California Community Foundation (CCF), which she started in 2012 as director of the Center for Contemporary Art and Design.“Laura has held her own in the CCCF’s organization for a number of years and embodies the values and vision of the CCCF,” Brian Kelly, the director and CEO of the nonprofit organization, said in a statement. “I’m excited to welcome her to the CCCF and to have her lead our organization as we continue to grow and evolve in the contemporary arts.”Previously, Mulvey worked as a freelance curator and taught at the University of California, Berkeley. She has also served as a board member of the Association of Visual Artists (AVA), the Foundation for Contemporary Art, the Santa Barbara County Museum of Art, and the Association of Visual Artists of America.Commenting on her new role, Mulvey said: “I’m honored to have been selected as the next CCCF executive director. I’", "The next Biennial should be held in 2020.\n\n\nThe exhibition “The Third Wave,” which opened at New York’s Museum of Modern Art in October 2020, has announced that it is now accepting applications for the 2019 edition. The show will also be held at the Art Institute of Chicago in 2021.The 2019 show, titled “Feminine in a Nutshell,” focused on the concept of femininity and beauty from a feminist perspective. The show won a 2019 David C. Driskell Award for excellence in photography. The 2019 gallery show was also nominated for an Emmy Award. “We’re thrilled to be returning for 2019 and we’re excited to showcase the work of the very best,” said Marian Pober, director of the gallery.Also returning for the 2019 edition is “The Art of Noise: Feminisms and Noise Photography”\u0097a joint project with Prada, Galerie Mille Pons, and Habemus Galerie. The show will now feature work by twenty-six artists: Adam Rogers, Aline McNamara, Joëlle Sulzberger, Amy Siskind, and Nicholas Hildebrand. The 2019 show", "The next Biennial should be a contribution to the art of the present, a defining moment in the artist’s career. It should reflect the extraordinary range of his practice. And it should be a tribute to his own extraordinary achievements.”\n\n\nAn eight-foot-tall statue of Edward Colston, the British colonialist, slave trader, and racist terrorist, which has stood in the British Museum in London since 1894, has been pulled down amid protests by artists and activists. The work, entitled “Colston in Colston” and dedicated to Cecil Rhodes, was part of a major renovation project at the museum that included the removal of statues of colonialists Cecil and Asa Gray, as well as racist and homophobic monuments that have stood for over two hundred years.The controversy over the dismantling of the Gray statue, which was erected in 1924 and replaced a monument dedicated to British imperialist Cecil Rhodes, has been sparked by a new exhibition, “Colston in Colston: Race, Terror, and Resistance” (2019), curated by London-based artist Rachael Red Star. The show will explore the legacy of Cecil Rhodes and his legacy through the lens of Rachael Red Star’s painting of a lynching.", "The next Biennial should be held at least once every two years, as the Israeli government’s decision to suspend construction through April 3 is considered a victory for Palestinians.\n\n\nThe Museum of Contemporary Art (MoCA), the Los Angeles–based arts organization, has announced that it will donate $10 million to the Palestinian local government of Ramallah in support of the ongoing work of artists, designers, filmmakers, and writers. The museum will also create up to 150 jobs for Palestinians at its new headquarters in downtown Los Angeles.The initiative is part of MoCA’s commitment to promote and protect Palestinian artists and heritage. The organization is also committed to training and equipping Palestinian artists and arts workers to work in the West Bank and to supporting the Palestinian cultural scene in the United States.\n\n\nThe San Francisco Museum of Modern Art (SFMoMA) announced today that it will begin welcoming visitors back in 2020. The institution has long sought to have tourist access to the institution resumed after an all-night closure due to the Covid-19 pandemic. The museum anticipates reopening in late summer.“After a thorough review of our options, we are convinced that reopening in June is the best scenario for the museum, and we are confident", "The next Biennial should be called for May 2021.  The next Art Biennial should be called for October 2022.  The first Art Photography Biennial should be held in April 2021. The next Art History Biennial should be held in March 2021. The next Art History Foundation Biennial will be held in March 2020.  The next Art History Show will be held in March 2020.  The next Art History Weekend will be held in March 2020.  The forthcoming Art History Festival will take place in March 2020. The next Art and Architecture Museum Biennial will be held in December 2022. The next Art and Design Museum Biennial will be held in February 2021. The next Art and Design Museum Exhibition will be held in February 2021.  The next Art and Design Museum Museum Symposium will be held in February 2021.  The next Art and Design Museum Symposia will be held in February 2021.The next Art and Design Museum Triennial will be held in 2019. The next Art and Design Museum Exhibition will be held in December 2020.The next Art and Design Museum Exhibition will be held in October 2021. The next Art and Design Museum Summer Festival will be held in April 2021.", "The next Biennial should be held in 2021. “After seeing the seductive power of the special, the special should not be missed,” said Park Williams, codirector and chief curator of the Park Institute.Princeton University Press has announced its representation of the late artist Laurence Bénétière. The artist and theorist articulated his philosophy of the permanent in becoming who he was in his work, which often commented on the way in which art and art history are tied together. Bénétière’s works are currently housed in the collections of the Museum of Modern Art and the Metropolitan Museum of Art.Born in Paris in 1932, Bénétière is known for his abstract paintings, which incorporate elements from the visual arts, architecture, and design. His early practice is primarily about the self, sometimes drawn from the artist’s own experiences and used as a way to examine the limits and limits of his own sphere of vision. In his late works, Bénétière portrays a narrative that is set in the artist’s own image, with its own structure: the art of the image, an agenda of the image and its own agenda. The work of the late artist is not only an ongoing process", "The next Biennial should be held in 2020. The 2019 edition, entitled Art for Life, was held at the Institute of Contemporary Art (ICA) in Munich and was awarded the prize for its third year. The biennial was made possible with the support of the German federal community and the three partners of the festival, Artforum and the German Federal Office for Culture (BfV), including Brenda Schippnhorn, Hildegarde De Mandt, and Christoph Hauser. While the museums were not involved in the production of the exhibition, they were instrumental in ensuring that the exhibition would be a success. In a statement, the three museums said: “We are delighted to be able to say that our museum contributed substantially to the success of the exhibition, as evidenced by our comments at the closing ceremony: the show was a watershed for our museums. It was an extraordinary project conceived by a young team of curators and collaborators from the contemporary art community and presented by a renowned contemporary art museum.”With the exhibition, which featured work by a diverse range of artists, including Alex Katz, Paul Gauguin, Jean-Michel Basquiat, and Werner Herzog", "The next Biennial should take place at least two years after the end of the current exhibition cycle and should aim to take into account the latest advances in the art and scientific communities. The biennial should aim to further develop the theme of our upcoming Exhibition “Be/longing: Contemporary Art from the Digital Age.”\n\n\nThe Institute of Contemporary Arts (ICA) in London has appointed David AVocchi as its new head of contemporary art. He succeeds Terrence Higgins, who left the institution in June 2020 to become director of the Tate.“David’s new role will allow him to continue to shape ICA’s contemporary art programming in the UK and Europe and to ensure the continuity and identity of our programme,” said Helen Flory, chair of ICA’s board of trustees. “I am really looking forward to working with David, his team, and the board to shape ICA’s future.”During his tenure at the ICA, Avocchi helped the museum raise almost $15 million for its expansion, which added more than 2,600 square feet of gallery space and doubled the size of the museum, which was founded in 1976. He also established the museum’", "The next Biennial should be held in 2022, and the first in 2021. Despite the delay, the organizers are hoping to continue with the series, which is supported with funds from the Noguchi Foundation and the Noguchi Foundation for Contemporary Art, and are hopeful that the new location will be ready for the event. In order to secure the new venue, the Noguchi Foundation teamed up with Artspace New York, which is housed at 645 West Twenty-Fourth Street, to transform the former Woolworth’s building into a home for the exhibition.The renovation, which also involved the repositioning of the Noguchi Foundation’s collection, brought the total number of works in the museum to more than five hundred, and cemented the museum’s position as one of the foremost institutions of the American Jewish intellectual life. In addition to its collection, the Noguchi Foundation also has an archive full of American art, which is housed at the Mellon Library in Pittsburgh.\n\n\nA new survey of the art of Israel drawn up by scholars from the universities of Haifa, Tel Aviv, and Jerusalem, announced on Thursday. Titled “Away From the Sun: Art in the Occupied Territories�", "The next Biennial should be held in 2019, but the timeline for a 2019 exhibition has yet to be announced.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released a decision regarding the future of the City Museum of the Arts (CMA) in Midtown Manhattan. The decision, which was made in response to a public petition signed by more than 1,500 people, was made by director Joseph L. Bruno, who had led the institution since 2009, and will now await the city’s action.“This is an unprecedented and challenging time for the DCLA, especially since the museum was created with the vision of developing new and transformative public experiences for the many cultural and historic sites in the city,” Bruno said in a statement. “This is an unprecedented and challenging time for all of us, and I’m confident that we can and will work together to ensure that the museum continues to thrive and flourish as a vital cultural and social hub for the entire community.”The city’s Cultural Institutions Group, which represents the cultural sector in the city, including the Metropolitan Museum of Art, the Bronx Museum of the Arts, the Brooklyn Museum of the Arts, and the Bronx", "The next Biennial should be on the history of art in contemporary art, in 2020. The 2020 Biennial will be on the History of Modern Art; it will include a retrospective of the work of H. G. Wells’s The Grapes of Wrath; and it will be hosted by the Kunsthalle Basel, the Berlin Gallery, the MAMCO, and the Haus der Kunst.The 2020 date for the exhibition is also a part of a larger move of the exhibition from Milan to Rome. After a short stay in the city, the exhibition will return to Milan, which is currently on its return trip to Greece. A new edition of the show is currently being organized in collaboration with the newly founded SculptureCenter in Milan. The 2019 edition, which was organized by the Diels-Aldermaston Museum in Bavaria, will be held at the Museo de Arte Contemporanea in Rome from November 21 to December 8.\n\n\nArt historian, curator, and author John Currin has been selected to represent the United States at the Fifty-Ninth Venice Biennale, which will take place at the Venetian resort from January 17 to February 22. Currin, a MacArthur Fellow", "The next Biennial should take place in the territories of Finland, Sweden, and Norway in the spring of 2022. The theme “The Future We Want” will be based on the themes of “intersection of intelligence and culture” and “interdependence of the mind and the body.” The exhibition will be hosted by the Danish curator Lars-Erik Dahl, who will create new works for the exhibition and present a selection of his work at the biennial in 2020.Proceeds from the event will benefit the Copenhagen-based arts organization Cinéma, which was established in 1988 as a means of launching the careers of young Danish artists. The artist-run organization has also received funding from the Danish government, the Danish Academy of Arts, the Danish Ministry of Culture, and the Danish People’s Party, as well as from Denmark’s Cultural Heritage Foundation, the Danish Academy of Arts, and the Danish Council for the Arts.\n\n\nThe Sutton Trust has awarded a total of $44 million to thirty-eight artists, including a collaboration between Israeli artists Orit Hadir and Yair Hochner, who created a sculpture that combines elements of press painting, video, and painting to create a new and", "The next Biennial should be held in the Spring, and the first in the Fall. The event’s first director, Jirenn Watson, said: “We will not compromise the artistic experience of the Festival in order to accommodate the demands of the health and safety authorities. The safety of our audiences, staff, artists and the wider community is of paramount importance to the trustees of the Biennial. We respect everyone’s right to freedom of expression and will not hesitate to use all means necessary to protect the dignity and health of all our artists and guests.We are in communication with the authorities and will share further information as soon as possible. We hope this information helps inform your decision. \n\n\nThe Los Angeles County Museum of Art (LACMA) has received a gift of more than two hundred photographs by renowned California landscape artist David H. Gifford, which were stolen from its collection during a burglary in November. The works were part of a larger series that was later displayed in the museum’s David H. Gifford Jr. Pavilion, which opened in January 2019. While the pieces were part of a series entitled “California in Transition,” which was published in the September 1968 issue of Artforum", "The next Biennial should be held in 2019, and the next will be held in 2021. The next edition of Arts and Culture will be hosted by the National Geographic Society in Washington, DC, in 2022.The 2019 iteration of the event was staged at Smithsonian American Art in Los Angeles, which had already relocated the exhibition to its new home in the National Museum of American Art. The exhibition, “The One‐Person Show: The Art of Play,” was nominated for a Pulitzer Prize last year.\n\n\nThe New York City Department of Cultural Affairs (DCLA) announced today that it is granting $150,000 to individuals and companies who successfully prosecuted misdemeanor cases in the city under the city’s Making a Difference program, a $500,000 fund created in 2015 to assist cultural organizations that encourage social change through the acquisition and distribution of art, music, and cultural artifacts.The fund will be awarded to “those who demonstrate an immediate and compelling need to mitigate the negative impact of the coronavirus,” which is spread mainly from person to person and causes coughing, fever, and other respiratory infections. For the next three years, the fund will distribute $4.5 million to", "The next Biennial should take place in 2021.\n\n\nThe Los Angeles County Museum of Art (LACMA), the Museum of Contemporary Art, Los Angeles (MCA), and the Los Angeles County Museum of Art (LACMA) are teaming up to create a new public sculpture garden that will provide free public activities for Los Angeles residents over the course of twenty-four months. The project, titled Fairy Towers, was announced last week and will involve creating more than twenty-five giant, translucent glass sculptures that will be planted along Ninth Street in the city. The project was inspired by the city’s construction of the Metropolitan Museum of Art, which, in addition to the artworks, also included a new public sculpture garden designed by Keiji Inada\u0097the centerpiece of which is a hundred-foot-tall, twenty-one-ton wooden sculpture of the Los Angeles County Museum of Art.“This year’s biennial is dedicated to Los Angeles, and to the transformation of the city into a global leader in art and innovation,” said David K. Antonacci, LACMA’s director and president. “This is an exciting project for the city of Los Angeles, and", "The next Biennial should be held in 2022.\n\n\nThe Museum of Fine Arts (MFA) in Boston, Massachusetts, has announced that it is preparing to welcome visitors back to the institution next spring following a two-year closure due to Covid-19. The April 17 announcement marked the first time the institution was allowed to open to the public since the pandemic began in December 2014.“We are thrilled that we are now able to reopen to the public as we always have, and we look forward to welcoming you back soon,” said director and CEO Rachel Passantino. “Covid-19 is an affliction upon which we have been and will continue to operate, and we are fortunate to be able to focus entirely on our core business. All of our plans for the future are in place, and we have a strong track record of success in reopening.”The MFA’s future plans for the neighborhood, which have been in the works for years, include renovating the museum into a larger gathering space, and expanding the museum’s collection beyond classical art. The redevelopment includes the construction of a new research center for the museum, the MFA’s first outside of the United States;", "The next Biennial should be in 2021. The official statement from the Inland Maritime Museum (IMM) said: “We are pleased to see that the commissioning of the new exhibition will coincide with the opening of the current exhibition. This will make the exhibition more accessible to the general public, enabling them to experience the treasures of the museum as well as discover the famous works of the artist and their subjects.”The museum has also introduced new standards for its upcoming exhibition “The Architecture of Light” and will introduce new programs and events to engage with contemporary issues, including climate change and the new technologies introduced by the advancing biomedical sciences.\n\n\nThe Museum of Modern Art (MoMA) in New York has suspended the exhibition “Another Life: Art and the Alimentary Canal,” which was staged in collaboration with the Museum of Modern Art (MoMA), the Metropolitan Museum of Art, and the Whitney Museum of American Art. “The Alimentary Canal,” an exhibition organized by scholar Fredric James and curator Harry Hayter, “was a seminal cultural effort in the history of art in that it explored how art could be a vehicle for our social and spiritual destinies,” said museum director", "The next Biennial should be held in 2022.The American Chamber of Commerce in Europe (ACCE) has released a statement about the cancellation: “Following a carefully thought-out and well-thought-out research and design program, we are dismayed to see the 2017 exhibition ‘Architecture at its Best: Living Standards’ cancelled,” said Hannah Bessemer, president of the American Chamber of Commerce. “Our members know that the exhibition was critically acclaimed by the experts and that our program, which engages with and enriches the practice of architecture, always advances the art of the best. Our members are deeply concerned by the decision, which will have a devastating impact on the upcoming exhibition. We are committed to supporting the exhibition and bringing it to the greater Berlin Art Week audience, and we hope that the rest of the world will support the arts in Germany as well.”The Berlin Biennial was founded by Andreas Beck in 2015 as a summerlong program in cooperation with the German state of North Rhine-Westphalia. The exhibition explored the intersections of design and architecture in a unique combination of styles and topics, including a project by the American artist Rachel Whitfield, the development of the biennial and", "The next Biennial should take place in the autumn of 2020. The fate of the space is currently in the hands of the city of Santiago\u0097the site is currently managed by the Instituto de Arte Contemporáneo de Santiago. The institution will soon be asked to hold another exhibition in the same location and will be able to host additional events and festivals, which would be held in close proximity to the main exhibition. The next edition of Art Biennial will be held in 2021.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has announced that it will no longer use the term \"ethnic cleansing\" to describe the systematic removal of Sinhalese people from Burma, Thailand, Cambodia, Laos, India, and Sri Lanka, which is where the mass graves of Burma's Buddhist monks sit.Instead, it will use the term only in reference to the Buddhists’ homeland, and it will suspend all official recognition of the events of the Burma–Thailand border for a period of ten years.The move represents a shift from the department’s long-standing policy of using the term “genocide” to describe the forced relocations of people. Since the 1970s, officials have referred", "The next Biennial should be organized in 2020. The next edition of the exhibition should be held at the Grand Salon du Palais de Tokyo and the Centro de Arte Contemporáneo in Madrid. The next edition of the exhibition will be held at the Museo Nacional Centro de Arte Contemporáneo in Madrid, in 2020.  Next year, the museum will unveil its new collection of contemporary art from the Americas. The 2019 edition, “America in Motion,” was staged at the Museo Nacional Centro de Arte Contemporáneo in Madrid and was curated by Bruno Latour. In addition to the works in its collection, the museum houses twenty-six collections in its holdings. Its holdings include paintings by the late American artist Lawrence Abu Hamdan, as well as works by the late French Jewish collector Pierre Chenebault.The museum also announced that it is planning to hold a new exhibition dedicated to the work of French artist Pierre-Auguste Renoir at the Biennial des Vickers in 2020. The exhibition will be organized as a “Le Corbusier Lecture,” and will include work by the Belgian and American artists", "The next Biennial should take place in the spring of 2021.\n\n\nFrieze and the Los Angeles County Museum of Art (LACMA) announced today that the two organizations have entered into an agreement to jointly present the second edition of the Los Angeles Contemporary (LACC), which will take place at the former site of the former Metropolitan Aviation Center (now the Metropolitan Museum of Art) in downtown Los Angeles from January 5 to July 3, 2021. Last February, LACMA President Steve Hill announced that the museum would make the move to LACMA, which is located on Santa Fe Avenue between Wilshire Boulevard and Highland Avenue, in order to fully realize the vision of architect André Breton. Under the terms of the agreement between the two institutions, the LACC will receive $2 million and the Museum of Modern Art $1 million in 2019 and 2020, respectively.The agreement between the museum and the county is not a complete solution to the longstanding problem of the county’s public transportation system, but is an important step in the process of bringing the two museums closer together and into the same building, which will also include the beginning of the construction of the museum’s new campus. The new facility, which will serve as the museum", "The next Biennial should be held in 2021.\n\n\nFor a number of critics in the United Kingdom, the departure of director Huw Price, who led the London-based arts incubator Open Air from February 2013 to February 2019, was cause for celebration. The institution, which has housed artists from the United Kingdom, France, and Italy, including Ed Sheeran, Phoebe Delahanty, Joie Onyewuenyet, and Mandy El Hassouky, had been working towards securing funding to stay open beyond its March 2019 deadline. The two-year contract extension was set to run through 2022. However, on March 11, Price announced that he would be stepping down from the helm of Open Air and would be taking a job with the National Galleries of Scotland.Commenting on his new role, the thirty-three-year-old said: “I’m extremely proud of the work we’ve done together in the last two years. I’ll continue to push on the boundaries of art and artmaking in the UK. But I’m also looking forward to growing the National Galleries’ work in Scotland and to continuing to move forward in the growing field of arts.”", "The next Biennial should take place in the city in 2021. The show will open in March 2019 and run for twelve weeks. Art Basel Hong Kong will present a show of its upcoming events in April. “We are very pleased to be able to build on the strong reputation of the Hong Kong art scene,” said Peter Rosengren, the chair of the board of trustees of the Hong Kong Art Museum. “On the one hand, we are pleased that the Hong Kong region is becoming an important center for contemporary art, and on the other hand, we are delighted that the Hong Kong art scene is gaining new and exciting attention in the region. We look forward to continuing our work as a board member of the Hong Kong Art Museum and to working with our international partners in Hong Kong to promote the Hong Kong art scene internationally.”\n\n\nA group of local artists have created a $10,000 reward for anyone who helps identify the remains of a twenty-five-foot-tall bronze sculpture that is believed to be the remains of a Roman aqueduct in the city of Pergamon. The city of Pergamon, in the southeastern province of Leitrim, is currently working on identifying the remains of", "The next Biennial should be held in 2021.\n\n\nThe Museum of Fine Arts (MFA) in Boston will welcome visitors back to the museum for a twenty-fifth edition of the Fifty-Third Biennial, titled “Fifty-Six.” The event will be held in the Museum of Fine Arts’ current home at the historic Storrs House, and will kick off with a public lecture by composer Robert Johnson and will culminate with a special performance by the Los Angeles-based group the Allora Brothers. The exhibition will feature work by twenty-eight artists, including James Turrell (T), Naruq, and Richard Anuszkiewicz (R), and will feature a selection of new works by the artist Ai Weiwei.Commenting on the exhibition, Diana Wright, director of the MFA, said: “The theme for the fifteenth Biennial was ‘The Future We Create,’ and for the fifteenth this is a very human story. Fifteen artists have created pieces that reflect the rich micro- histories and histories of their local communities, and the themes of the work are varied and unique. The work of a few is the theme of the whole.”\n\n\nThe Art Newspaper", "The next Biennial should take place in the summer of 2021, and should encompass twelve artists, including Mungo Maung, Kian Maung, Kiang Mingkun, and Altin Teng, as well as two concepts: human and cultural evolution.In a recent letter, the Biennials Board of Directors wrote: “The short-term objectives of the Biennials are not sustainable with any certainty. The biennial will continue to be an important element in shaping the future directions of the arts, but we must now consider whether long-term sustainable strategies for the arts can be realized, and thus how the Biennials Biennial 2020 will continue to be relevant.”\n\n\nArt historian, artist, and curator Adam D. Weinberg, the founder of the nonprofit Adam and Eve Gallery in New York, has died at age seventy-eight of complications due to the novel coronavirus. Born in New York City in 1948, Weinberg studied at the School of the Art Institute of Chicago, which merged with the Art Institute of Chicago in 1964, before emigrating to London. He began his career as a painter and sculptor, producing works such as his monumental “HELIOS” (Citizens", "The next Biennial should be staged at the Institute of Contemporary Art (ICA) in Amsterdam next year. This will mark the institution’s first year hosting the exhibition. We are waiting for the organizers to have the opportunity to present the exhibition in person and will present it in conjunction with a new exhibition titled “The Future Is Not Present: Contemporary Art from the Middle East” that will be organized at the ICA in 2020.“The international work of the Arts Alliance has been a great success story for Arts+a, the European Alliance, and the European Council,” said Jean-Francois Sarandos, cochair of the European Alliance and director-general of the ICA. “We welcome the partnership of the two institutions to develop and present an international exhibition within the framework of the ICA. It will be an excellent opportunity to see how the architecture of art in the Middle East is evolving.”\n\n\nThe first artist-led group show of the 2018–19 season, “The Life We Live,” has announced its attendance at the Experimental Arts Festival (FIFA), a biennial held every September in Basel, Switzerland. Organizers are offering the artists $100,000 cash awards for", "The next Biennial should take place in the Spring of 2021. The first, held in the former residence of the Greek Academy in Bologna, will be followed by a second in the summer of 2022, and a third in the autumn of 2022. The first exhibition, titled The Bottom of the River: Towards an Art-Story, will be staged at the Academy in the autumn of 2019. The third Biennial, titled Inside the Art-Pillars, will be curated by Walter LaFeve in the spring of 2021. The exhibition will be organized as a platform for the artists represented in the project, as well as for their audiences. Meanwhile, the Women’s March on Washington has announced that it will postpone its planned march to the Lincoln Memorial until March 23. The March for Science and Justice, which was originally scheduled for March 12–March 16, has been moved to March 8–March 10. The March for the Arts has announced that it will now take place March 3–March 5. The Art Newspaper reports that the National Gallery in London and the Royal Academy of Arts will remain closed until March 22. The Royal Shakespeare Company will remain closed until March 24. The National Galleries", "The next Biennial should be held in the fall of 2020, and the opening of this year’s edition will take place in June 2021.\n\n\nThe Museum of Modern Art (MoMA) in New York has released the list of seventy-five artists who have been selected for its triennial “Art for Life” in June 2020. The event—which was created by a group of New York–based artists, including Derek Chang, Monica Dalloc, and Lora Waldman—has since received the endorsement of more than twenty-five thousand people, including artists John Lennon, Yoko Ono, and Mark Rothko.“Art for Life’ is an invitation to engage with the physical and social landscape around us, and is an opportunity to reimagine the physical and human experience,” said MoMA director Daniel H. Weiss. “While the art featured in this year’s exhibition is rooted in the avant-garde, it is also rooted in the present and the future, and is a celebration of this year, this year’s art, and the art of our generation.”MoMA will stage the exhibition “Art for Life: The Future,” which will debut in", "The next Biennial should take place in the fall of 2021. A new exhibition devoted to the artist’s life will be organized in the spring of 2022. The twenty-fifth iteration of the festival will take place in the spring of 2022.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it is working with the California Black, a group of black artists who have been featured in exhibitions at the institution for years, to reenact a work by Robert Irwin. The show, “Obliterated Black,” will feature works by artists including Nari Ward,  Gino Andreotti, and Kiki Smith. Curated by Norberto Gutiérrez, the international artist-in-residence, the exhibition will run through February 23.“We are thrilled that this year’s Biennial will be dedicated to the work of Robert Irwin’s Obiterate Black,” said Carol E. Levine, chair of MoCA’s board of directors. “We are thrilled that this year’s presentation will be centered on the contributions of artists to the Biennial and the stories that they tell. We are thrilled that this year’s exhibition", "The next Biennial should be held in 2020. \nTitles for the 2020 edition include The Art of Living: The Art of Life. The Art of Living: The Art of Life is revised and expanded from its predecessor, The Art of Living: The Art of Life II, which was set to open at the Central Library in Zurich in November 2019 and has since closed. The Art of Living: The Art of Life II, which was published by the Foundation for Contemporary Art in New York and the Museum of Modern Art in New York, will be held in the same location next year. The Biennial of the Body: From 'Obsession' to the Art of Body art, James Mulvey (1935–1989) will also have a residency at the Museum of Contemporary Art in New York this fall. While the selection committee chose Mulvey’s selection of art as the theme for the upcoming edition, his work was chosen for its ability to address themes of health and healing, and for its ability to conceptualize the relationship between the body and the universe. For the artists who were selected for the 2020 edition, the theme was \"a re-emergence of the body, and the body�", "The next Biennial should be held in May 2022.\n\n\nThe Metropolitan Museum of Art (the museum) in New York has appointed Harvey Fishman as its next executive director. Fishman comes to the institution from the Museum of Fine Arts, Houston (MFA), where he previously served as director of collection management. He succeeds Ruth Stieglitz, who is retiring at the end of the month after nearly three decades at the helm of the museum.“As we have seen in recent years, Harvey is a gifted, adaptable leader who has put in place operations that have made MFA Houston’s most successful exhibition-driven year ever,” said Mark Burnett, chair of the museum’s board of trustees. “The Met has had a remarkable trajectory in moving from an office park into the heart of the city, and Harvey has been instrumental in building the museum’s reputation and broadening its reach. He is a truly talented and talented organizer, and we are confident that his vision and skill set will be a great fit at MFA Houston.”Since ascending to the position of director of collections in 2014, Fishman has worked to improve the museum’s collection and structure as it has expanded, developed new", "The next Biennial should be held in 2020.\n\n\nFrench artist, sculptor, and designer Salah Abdi has been chosen as the winner of this year’s NEXT Biennial, which will focus on the female gaze through the work of women artists in twenty-first-century France. Abdi first emerged as a French artist in the seventeenth century, when the artist-in-residence at the Louvre, Georges Seurat’s Portrait of the Medici, was being staged. In 1848, he agreed to become the first representative of the artist-in-residence in Paris, and in 1853, he created the piece Absolute Virgin, the first female nude work by an Arab artist. He continued to experiment with the nude until his death, when he was eighty-four years old. In a commentary published by the exhibition, Abdi said that he created the work to honor the struggle of the last centuries to gain recognition in France, and to allow the artist-in-residence the opportunity to create a work of his or her own, to leave behind the routine of living and to create a legacy. Next year, the performances of Nadia Ben-Hur and Umar", "The next Biennial should take place in the autumn of 2021, in the city of São Paulo, Brazil. The festival will be hosted by the São Paulo Art Museum (SPAM), the Museu de Arte de São Paulo, and the University of São Paulo. The exhibition will include work by forty-three artists, including André Breton, Adriana Varejão, and Sérgio Botín, and will include photography, filmmaking, performance, sculpture, and installation.“Art is a universal language, it is the language of the human body,” Ubi told the Art Newspaper. “This means that the creative process is a universal language.”The exhibition will be accompanied by a book titled “Art and Memory: From the Biennial to the Gallery,” which will be written by Ubi and will address issues surrounding memory. The artist will also introduce the 2018 exhibition at UCCA, which was organized and curated by Kiko and Jonas Otero, who are currently incarcerated in Brazil. The project was inspired by a question Ubi posed to Botín in 2003, “Why does memory persist after death?” The artist replied that “it is", "The next Biennial should take place in 2022 and will include a selection of twenty-nine works by fifty artists from twenty-six countries. The theme of the biennial will be “Polarities,” and the fifty artists selected for the exhibition will be announced in May 2024.\n\n\nThe National Gallery in London has appointed Christopher Wool as its new deputy director for exhibitions. He succeeds Elizabeth Price, who has helmed the institution since 2007, and will take up the post on January 6, 2021.Wool, who previously worked as a curatorial assistant at the National Gallery between 2007 and 2008, succeeds Rosemarie Trockel, who has served at the institution as interim director since May 2019, when the institution opened to the public in a 300-year-old building on the south bank of the Thames.During his tenure at the National Gallery, Wool will oversee the development and execution of new exhibitions and collections, including the exhibition “Feminine№s Vision: Painting the Modern Female” (2019), “The Body in Art” (2018), “Framed: Modern Art” (2017), “The Field: Art in the Age of Americanism” (2017), and �", "The next Biennial should be held in the spring of 2020, and will be presented by the American curator Sohrab Mohebbi. The biennial’s curator, Aria Smith, will serve as the inaugural director of the museum. In an interview with the New York Times, Smith called the new role a “transformative step in my career.”\n\n\nThe Sydney Opera House has become the latest cultural institution to launch an artistic initiative inspired by the 2016 tragedy at the Australian National University (ANU), where eighteen students and a staff member were killed in a terrorist attack. The school’s stage production, “The Naked and the Dead,” will also be staged on the campus of the Royal Australian College of Art (RAC), where the first exhibition of the RAC’s new school of curatorial arts, “On the Ground,” will open on September 23. The show, which will feature twenty-one works by twenty-four artists, will run for three weeks and will include submissions from twenty-six artists across Australia.The exhibition was conceived by RAC curators Richard Spector and March Hadley in collaboration with the architect and urbanist Bernard Oehler. The pair", "The next Biennial should be held at the VII International Exhibition Centre in London in 2020. The next edition, “Between Worlds: Essays on India” will be staged at the National Art Gallery in London in 2021. The next edition, “Art as a Weapon: Global War on Terror” will be staged at the National Gallery in London in 2021. “We are deeply concerned that the next exhibition will engage in such poor and disturbing photography,” said David Cameron, the British prime minister, who has been campaigning for more than a year for British pavilion at the upcoming edition of the Venice Biennale. The current edition, titled “Paintings of India” will be held at the Royal Institute of British Architects (RIBA). The next iteration, titled “Art as a Weapon: Terrorism and Human Rights” will be staged at the Royal Academy of Arts.While the RIBA was not aware of the plans to dismantle the current exhibition\u0097the show attracted around three hundred thousand visitors\u0097they said that the event would remain open in a “modest but robust state.”Looking to the future, RIBA’s director, Vittorio Fattori,", "The next Biennial should focus on the work and ideas of Chinese artists, as well as the international collaborations that are taking place in the field, and should be inaugurated by an exhibition of work by the artist Garth Salander, titled Flowing Bottle. The work of Hakluyt, Wu, and others will be presented in the exhibition “The Futures of the Body” (2019).\n\n\nThe Smithsonian American Art Museum (SAAM) in Washington, DC, has appointed Alison F. Williams as its next executive director. She will be responsible for developing and operating a program for exploring and presenting the work of African American artists. “Alison F. Williams: An American Icon” is slated to open at the museum in March 2020. Previously, Williams served as a senior curator at the Museum of American Art, where she organized over ten thousand exhibitions and participated in more than sixty-five curatorial projects, including the twenty-fifth edition of the Antebellum Biennial, which took place in Selma, Alabama, in 2017. “Alison F. Williams: An American Icon” will be a collaborative project between the museum, the Selma Museum, and the Smithsonian American Art Museum in the first program", "The next Biennial should take place in 2021, and the new exhibition should be inaugurated with a review of the exhibition “Reconstructing the Optimal:” The proceedings of the 2019 event will be presented in the museum’s newly reconstructed galleries, which will open as part of a collaboration with the Avant-Garde Museum in Brussels.\n\n\nThe European Alliance Against Antisemitism (EAA) and the National Union for Cultural Relations (UEAN) in Brussels have announced that they have reached an agreement on a comprehensive set of cultural policy and legislative changes that will address the growing concerns of cultural and artistic professionals in the EU. The landmark agreement, which will clarify the collective rights of artists and cultural workers in the EU and give the European Commission the power to classify institutions as “non-essential providers of social support” and to set the minimum standards for their performance, was reached on several issues, including the protection of cultural heritage, the protection of artistic creativity, and the protection of the creative economy.“The EAA’s statement of objectives for the 2020–21 academic year makes clear that it hopes that the framework will promote the full range of cultural activity in the EU,” said Esm", "The next Biennial should be held in 2021. \nBiennial director Christine Haber had this to say about the upcoming iteration of the exhibition: “It is an honor and a privilege to be able to collaborate with such a talented and committed group of artists. Their projects and exhibitions will be presented in a way that is both ambitious and accessible, inspiring and engaging, and engaging and challenging. They have created an exhibition that is both engaging and educational.”\n\n\nThe Fine Arts Museums of New South Wales (FAMW) and the Australian Institute of Art (AIA) have announced that they have reached an agreement to share $12 million in funding from the Coronavirus Aid and Relief (Cairns) program, which is administered by the Department of Social Development, with four other Australian institutions: the Art Gallery of New South Wales, the Art Gallery of Queensland, the Art Gallery of South Australia, and the Art Gallery of Western Australia.Under the terms of the deal, which was struck on behalf of the Commonwealth Government, the institutions will each receive $11.5 million from the Coronavirus Aid and Relief (Cairns) fund, which was established in 2012 to support first-time home buyers who are unable to", "The next Biennial should take place in 2021.\n\n\nOn August 6, the National Geographic Society announced that the 2020 edition of the National Geographic Adventure Exhibition, “Unseen: The World Atlas of ‘Geo’s Most Admired Man,” will now take place in 2021. The statement capped a year filled with milestone events that culminated in the seventeenth edition of the National Geographic Biennial, “The Most Admired Man,” which premiered at the Harvard University Museum of Art in Cambridge, Massachusetts, in February 2019.The 2020 edition, which took place at the Smithsonian American Art Museum in Washington, DC, showcased work by seventy-eight artists, including Bob and Carol Fisher, the artists behind the landmark 1982 Atlantic double-decker bus, the Turtle and the Whale; Christo, the Brazilian painter who used paper and charcoal to create his famous bus; and Brutus, a Russian sculptor, painter, and filmmaker whose work bridges ancient and modern philosophies. “As we approach the centenary of the first National Geographic Adventure, we will continue to present ambitious exhibitions of emerging and established artists in ways that reflect the cultural and social aspirations of today, while also reflecting the spirit of tomorrow", "The next Biennial should be held in 2020, and if all goes to plan, the museum will reopen in 2021.\n\n\nThe National Gallery of Art in Washington, DC, has launched a new digital platform that will engage with the public through an open platform of public art, curated by a small group of artists. Titled the National Museum of Art, the initiative will initially focus on research and a selection of works, but will eventually expand to show the full range of the digital collection within the institution, which will be renamed the Smithsonian National Museum of Art (SNA). It will also include online viewing rooms, a research library, and an interactive digital catalog.“The digital Smithsonian National Museum of Art is an extension of our mission of providing a learning and engaging experience for audiences through art,” said museum director Alexander Goldfarb. “This digital platform gives the Smithsonian National Museum of Art a new and exciting stake in the world’s history, a stake that will help define our role as a national museum.”Originally launched by artist and donor Henry Luce, who discovered Luce’s collection in 1971, the online platform was created by the Smithsonian American Art Museum (SAM) and the National Foundation for the", "The next Biennial should take place in the fall of 2020 and will be organized as a “virtual exhibition.”The exhibition, which will feature work by sixty artists, will be hosted by the Royal Academy of Arts and the National Museum of Modern Art. The twenty-second edition will be held at the Museum of Modern Art in Beijing and will be curated by Ivonne Blom.\n\n\nThe Museum of Contemporary Art (MoCA) in New York announced today that it is preparing for a potential shutdown due to the coronavirus. The institution’s board chair, Richard Armstrong, informed its members that the museum will implement “enhanced health and safety measures” as it works to contain the virus and safeguard the health of its staff and visitors.Among the measures that will be taken are the closing of “all non-essential retail and dining locations” and the establishment of “convenience stores” so that museumgoers can “have access to MoCA’s nearly 4,000-piece collection at one convenient location. In addition, the museum will begin selling limited edition prints and artworks by artists such as Rayyane Khan, Robert Irwin, and John Paul Getty.For now, the", "The next Biennial should take place in 2020. \n\n\nThe New York Museum of Art (NYMoA) has received a gift of approximately eleven hundred photographs by Oscar Niemeyer, the late American photographer known for his stridently experimental, often surreal, sometimes surrealistic portraits. The works, which were mostly taken in the early 1950s but most recently in the 1960s, are housed in the collection of the American Modern Art Museum (AMM), a division of the Metropolitan Museum of Art in New York.The gift includes many early photographs taken by Niemeyer, a member of the group the New York School, which was known for its experimental and often professorial portraits of artists such as Peter Guber, Lin-Manuel Miranda, and Peter Sellars. The group was formed by John Levey, Jonathan Lupica, and R.S. Van de Ven, all of whom were working in the early 1950s. It also features photographs by Niemeyer’s wife, Nancy, and others he took with his wife, Nancy and Alexander, and by certain artists, including Robert Irwin and Harry Hoffman.The works were donated by collector Edward Korman, a longtime friend of the family, who was a trustee of the", "The next Biennial should be held in 2021, with the exhibition marking the centenary of the German artist Heinrich Heine’s birth in Württemberg. The city of Württemberg has been working with the museum for several years, and in 2016, it was awarded a $68 million grant from the federal German government to continue the museum’s exhibition program.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is planning to move the first-ever exhibition of work by Israeli artist Elazar Weizman, the man behind the influential “Plastic Airship” series, in 2021. In a statement on Friday, the institution said that the decision was made in light of continued “growing concern about the legacy of Yitzhak Rabin—the architect of the Israeli state, a man who embodies everything that Israel is and was and is not,” and that the move is “in accordance with MoCA’s long-standing policy of supporting the cultural life of the state.”The museum also said that the move is not “economic” and that the museum is currently “evaluating the future of our current exhibition program,” but that it", "The next Biennial should be held in March 2020. “The future of the temple lies not in an exhibition of art, but in the future of the city,” said Bruno Nusseibehl, the architect behind the museum. “We must be guided by the vision of the city and its future as well as by the cultural and spiritual heritage of the city.”\n\n\nThe London-based charity workgroup the UK’s arts funding agency the Arts Council, which works with over one hundred London-based arts organizations to develop and deliver research-based support for UK arts, is launching a new initiative. It is calling for an end to subsidies and for smaller, local, and regional arts funding to be prioritized over the big three. The organization is developing a new set of guidelines that will allow organizations to prioritize the arts in their future funding plans. The guidelines were developed by a team of scholars and cultural figures, including Tate director Maria Balshaw, and will be published this fall.“The Arts Council is developing an innovative set of guidelines to help small to mid-size UK arts organizations plan for their future in the face of the global economic crisis,” said Chris Mullen, director of the", "The next Biennial should take place in 2020.The exhibition will be curated by the Los Angeles–born, California–based artist, curator, and educator James Turrell. In the future edition, Isaac and Lillian Jeffreys will serve as interim directors. One of the major themes of the upcoming exhibition will be “the art of resistance.” The artist-centered site will also include an installation that explores the concept of “solidarities,” a central concept in Galerie Levi-Straus’s many works, and a retrospective of work by the anthropologist and ethnographer Sianne Ngai.“The new exhibition will provide an engaging platform for the work of selected artists to explore the legacy of resistance through a feminist, queer, and trans-feminist lens,” said Joseph T. Farah, the museum’s CEO. “We are delighted to welcome the artists and are hopeful that this will be the year they create a work that can be meaningful to the public and be a true reflection of their spirit and creativity.”\n\n\nThe Haus der Kunst (HHK) in Berlin has received a major gift from collector Werner Lauterbach, who purchased the entire", "The next Biennial should be held in 2021, and the first in 2022. The exhibition will be curated by a group of artists whose work was selected by a jury made up of artists, academics, collectors, and representatives of the biennial’s official sponsors. The twenty-seventh iteration of the biennial will take place over the course of three continents.Its inaugural edition, titled “Beyond the Present,” took place in the island city of Antartica, in the central part of the African continent. The exhibition opened in December 2016 with “Big Dreams,” a series of portraits by thirty-six African artists, whose works were selected for the exhibition by a jury comprising artists, scholars, and curators from the United States, the United Kingdom, France, India, Italy, and the United States. The “Beyond the Present” exhibition culminated with the two-hundredth edition of the exhibition, titled “The Silence of the World,” which opened in Tokyo in October 2018. The tenth edition of the exhibition will be held at the Biennial of Contemporary Art in Barcelona in November 2021.\n\n\nThe Los Angeles County Museum of Art (LACMA) has received a $25 million donation from", "The next Biennial should take place in 2020, and the exhibition should be based on the author’s first exhibition in Paris in 1959, Jean-Luc Godard’s 'The City of Play” (1958), which was staged entirely in black-and-white. In the intervening years, Jean-Luc has developed a career as one of the leading curators of film, painting, sculpture, and photography in France; currently, he is the founding director of the Contemporary Museum Paris (CMP). For this collaboration, he will create a new work, titled L'enfantur , that will be presented in the fall of 2020. The exhibition will be at the CIE Nancière in Paris from February 17 to February 21, 2020. In the 2017 biennial, Jean-Luc made the first public statement about his personal heritage, acknowledging that he is “half French, half Italian, half Italian and half Italian and Italian and Italian.” This year’s edition of the show will draw from the Canadian biennial “HOTHERFALL: Tales from a Next Generation,” which will be staged at the National Sculpture Park in Ottawa, Canada, in 2021.\n\n\n", "The next Biennial should be in March 2021. The seventy-third Venice Biennale will take place in February 2022. The seventy-eighth will take place in May 2022. This year’s event will be held at the Museo d’Arte Contemporáneo Nacional in Madrid.  The event will feature nearly 3,500 works by seventy-six artists. The twenty-first Venice Biennale will be held in March 2022.The twenty-second Venice Architecture Biennale will be held in March 2022. The twenty-third Venice Biennale will be held in March 2022. The thirty-eighth Venice Architecture Biennale will be held in March 2022. The thirty-ninth Venice Architecture Biennale will be held in March 2022. The thirty-eighth Venice Architecture Biennale will be held in March 2022. The thirty-eighth Venice Architecture Biennale will be held in March 2022.The thirty-ninth Venice Architecture Biennale will be held in March 2022. The thirty-ninth Venice Architecture Biennale will be held in March 2022. The thirty-ninth Venice Architecture Biennale will be held in", "The next Biennial should be held in October 2020. The next exhibition should take place in February 2021. The next exhibition should be held in July 2021. The museum’s board of trustees announced the dates for the first and second editions of the exhibitions in March and June, respectively. In a statement, the museum said the decision to postpone the 2021 event was not related to the ongoing global health crisis. The National Gallery of sculpture and installation art, which has locations in Oslo and St. Petersburg, has also said it is looking into whether it should postpone the three-day event, which will run from September 26–September 29, 2020. The move follows the cancellation of the upcoming Saint Petersburg Art Week in February 2019 and the March/June 2020 events of the Global Biennale. The decision to postpone the event has also been made with regard to the exhibition “The Present: Science, Politics, and Design” at the Museum of Contemporary Art Tokyo, which was originally scheduled for March 22–March 25, 2020. The museum said it is still evaluating the impact of the pandemic on the event.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, has announced that it will reopen in the spring of 2021 following a", "The next Biennial should be held in 2022. The previous edition, held in Tokyo in 2019, had been canceled owing to the coronavirus. The exhibition was supposed to run from March 19 to March 21. It was postponed for two weeks after the Japanese government declared a state of emergency in March and March 21, and for two weeks after the coronavirus was declared eliminated in March. The biennial will now be held from March 22 to March 26, 2022.\n\n\nThe collection of German anthropologist Otto von Bode, a critical influence on several of the key artists of the twentieth century, including Gerhard Richter and Oliver Maud, has been renamed the Otto Bode Museum after he died on March 8. The museum, which is currently home to some 2,500 items, was established in 1924 by Otto Bode and his wife, Gertrude Bode. “We are convinced that the future of the museum lies with the Bode’s descendants, with the Bode family in Berlin and beyond, as a single entity, with a permanent home in Berlin and a future for the Bode Museum in Berlin,” said museum director Christian Lehmann. The Bode Museum was", "The next Biennial should be held in 2021, according to organizers. The event will also focus on the history of the exhibition, its exhibition space, its exhibition rooms, and the exhibitions on the Biennial. The first edition of the Biennial in 2019 was held at the Biennial, the Museum of Modern Art, and the Metropolitan Museum of Art in New York; the second edition of the Biennial, featuring works by and about contemporary artists, was held in the Museum of Modern Art, the SculptureCenter, and the Whitney Museum of American Art in New York; and the first edition of the Biennial at the Museum of Modern Art was held at the Sandberg Museum in Berlin. The 2019–20 editions of the exhibition were “180 years of art” and “180,” respectively.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines for when the government should no longer recognize a religious organization’s right to organize its own events and religious activities. The guidelines, which were written by Dale Conley, the acting administrator of the DCLA, and are dated December 5 and December 14, respectively, and were released on December 10 and Dalila University has", "The next Biennial should take place in 2022. \n\n\nThe Italian government has suspended construction on the UNESCO World Heritage–listed Marzio di Rivoli, a UNESCO heritage site located in the redoubtable Marzo neighborhood of Rome, after organizers received a letter threatening to pull the funding if the work was not moved. According to the Art Newspaper, the letter said that the construction of a Marzio di Rivoli replica would be delayed until the Italian government could fund the project.The decision has forced a change of plans for the city, which had been looking to move forward with construction on a new Marzio di Rivoli museum since 2019. City council president Maurizio Cattelan told the Art Newspaper that construction on the new museum would continue as planned, with the exception of the construction of a conservation area for the site, which is currently filled with sculptures and works by the artist Gio Ponti.The decision was made in a letter sent by the deputy secretary of the Democratic Party, Marco Mollino, to the president on February 12. The letter threatened the construction of a Marzio di Rivoli replica with an estimated price tag of $63 million, with the possibility of the works being relocated to a museum in the", "The next Biennial should take place in the United States, and the next in London.  The 2020 exhibition is slated to open at the Sion, the country’s premier contemporary art museum, on August 31.\n\n\nThe London-based arts organization the National Art Gallery (NGA) is planning to close its doors permanently in 2020, reports Artnet. The announcement was made after the NGA’s Civil Contingency Fund (NCF), which supports galleries and nonprofit organizations that have not yet received funding from the UK’s National Lottery Heritage Fund (NFL), purchased twenty-five artworks for the permanent collection.The works purchased for the NGA were a selection from the permanent collection in 2016. The future of the works is in jeopardy following a decision by the UK’s House of Lords, which voted yesterday to scrap the NFL and return funds to the institutions that have benefited from it. The National Trust for Scotland and the Scottish National Museum were not mentioned in the House of Lords’ decision, but they were swift to distance themselves from the NGA, which they say did not ask for the works to be selected.The decision to close the institution comes amid the ongoing crisis at the UK", "The next Biennial should be held in 2021.  “The Art of the Fifth: From Global Perspectives,” curated by Sachi Adami, will be hosted by the Biennial Museum for the History of Art in San Francisco in 2021.  The second and third Biennial of the American Jewish Museum will take place in 2020 and 2021, respectively.  The museum has not yet announced when it expects to open its new two-thousand-seat, 100,000-square-foot outpost next September.\n\n\nThe National Gallery of Art in Washington, DC, has launched an online viewing room for the first exhibition of the new American artist-in-residence program, called the American Artist Residence Program (AAPR), which will invite up-and-coming artists to Washington for an evening of group presentations, readings, and other events. The initiative, which was created to address a growing shortage of contemporary artmakers in the country, will launch with a retrospective of the work of Deborah Corrigan in December and a solo show of work by Chelsea Howes in February 2020. Opening the portal will be a ceremony at the National Gallery of Art on Thursday, January 28, during which the architect Daniel Libeskind will", "The next Biennial should take place at an undisclosed location in the US in 2022. The festival will then return to New York for a second edition, featuring works by fifty artists from twenty-six countries in 2020, and will run for twenty-eight days. “We are excited to see how the new platform responds to the biennial’s audience and community, which is the core of the exhibition, and will continue to refine and enhance the experience for our visitors, particularly those who are new to the festival,” said François Prouvé, the festival’s director. He added that the event “will continue to be about connections, about the behind-the-scenes work of artists, and the architecture of the art world.”\n\n\nThe Tate has announced that artist-in-residence, fashion designer Hetain Patel, will move to the Tate’s new home in London’s West End next year, becoming the fourth artist to do so in the institution’s fifty-five-year history. Patel, whose work is housed in the Tate’s permanent collection, will become the sixth Tate artist to take up the post and will occupy a new glass-w", "The next Biennial should be in 2020, in Chicago. As of March 2019, it had 8,142 participants. \n\n\nThe Smithsonian’s National Museum of African Art in Washington, DC, has hired Helen C. Mayhew as its new chief curator and director. She succeeds Linda Anagnos, who has helmed the institution since 2008.“Helen brings to the position a wealth of experience, intelligence, and expertise in a field where she understands the importance of relationships, both internal and external, both personal and professional, and her ability to bring audiences together and create compelling exhibitions will be integral in our continued growth as a National Museum of African Art,” said Bruce Ng, director of the Smithsonian. Helen comes to the institution from the Metropolitan Museum of Art in New York, where she has served as deputy director of curatorial affairs since 2011, and succeeds Jennifer Dehaene, who has helmed the museum since 2005.“The museum is extremely fortunate to have an outstanding curator, historian, and administrator at this critical moment in its history,” said Bruce Ng, who was appointed director in 2015. “Helen’s vision and passion for the institution and her ability to bring audiences together and", "The next Biennial should take place in 2020.\n\n\nThe 2014–15 academic year marked the thirteenth edition of the Art Basel Hong Kong fair, with the Taipei Asian Art Museum, the New Museum Taipei, and the Art Museum Taipei, which was canceled last year. Art Basel and the organizers of the fair said that the upcoming edition of the fair will introduce new programming and additional auction spaces in a planned exhibition hall that will house all galleries participating in the event, as well as a new ticketing system and online viewing rooms. “This year’s event is an exciting experience for all fair visitors, especially those who are new to the fair, and we are confident that the redesigned event halls will present a captivating and challenging experience for all,” said Peter Cohen, senior director of art at Art Basel Asia.The new platforms will provide a more convenient way to experience art and will present more artworks and curated by the participating galleries. The redesigned galleries will also boast an online viewing room where visitors can interact with works and see works displayed by participating artists. The information on the platform will be based on informed and curated readings, an art show, and panels. The online viewing rooms will present selected works", "The next Biennial should take place in the spring of 2021 and will consist of a selection of works created in the last two years. “The exhibition will be organized using a principle of ‘continuity of purpose,’ which will emphasize the history of art through a series of ‘instructions,’” the artist told the New York Times in 2017. The biennial will also be organized in the form of a series of galleries and museums, which will also be housed within the same building, and will encompass a total of sixty artists.The exhibition will be curated by artist-in-residence Rachel Ford, who is represented by the Museum of Modern Art, Los Angeles, and will serve as the centerpiece of the US’s first Biennial of Contemporary Art, which will take place in January 2022. The twenty-eight-person jury will be comprised of Aaron Dessoff, curator of Modern Art at the Contemporary Art Museum St. Louis; Mimi Khan, director of the a museum in Brooklyn; and Mary Anne Allen, chair of the board of trustees of the Museum of Modern Art.The award-winning artist is also working on a new book; a new public sculpture; and a performance/performance/art", "The next Biennial should be held in 2021. \n\nAdvertisement\n\nAn open letter to the editorial board of the Art Newspaper was released by the London-based group Artforum. The letter claims that the cancellation of the upcoming edition of the Biennale is a serious breach of the contract between the organisers and the festival’s presenter, Damien Hirst, and demands that the 2019 edition be played again.“We, the undersigned, understand that this is a difficult situation for the organizers, and that further negotiations are necessary, but we strongly urge them to do everything in their power to secure the future of the fifty-eighth edition of the Biennale,” reads the letter, which is addressed to festival director Maria Balshaw, artistic director Yinka Shonibare, and artistic director Brookirotte.The letter points to a number of problems with the 2019 edition, including the departure of Hirst, who had served as the festival’s director for fifteen years, and criticizes those responsible for refusing to renew the contract of the artist-in-residence, Yulia Gurov, instead choosing to award the role of patron to two artists: Hristov and Ruslan Gend", "The next Biennial should be held in 2020.”\n\n\nThe Museum of Contemporary Art (MoCA) in New York announced today that it is preparing for a reopening of its Gallery 3 on Madison Avenue in the spring of 2021. The institution previously stated that it expects to reopen sometime in the second half of the year.The announcement came six days after MoCA board member Mark Craven and MoCA associate director Michael Pescatella gave a presentation on the institution’s new administration and campaign for the May 25 opening of the new Museum of Contemporary Art, which will share its space with the former site of the Metropolitan Museum of Art, in Manhattan. The museum’s current exhibition, “What Now?” will remain on view until March 23. The new museum will also boast of a new film program, a new virtual reality experience, a new digital platform for audience engagement, a new collection center, and a new public art garden.The announcement follows the announcement last month that the museum will host a free public event on March 25. The evening’s programming will include performances by artists such as Rachel Whiteread, Sarah Lawrence, and Mary Martin, as well as a special presentation by artist and scholar Mary Martin.", "The next Biennial should be held in 2022. The museum is currently researching the feasibility of building a new exhibition space and developing a curriculum around the role of art in contemporary society. “This is a defining moment for art, for the history of art, and we want to do everything we can to support it,” said Linda Lissoni, the museum’s executive director. The inaugural exhibition, “Blue ataxia: The Rising Sun” (2019), which is currently on view in the exhibition “On the Rising Sun” at the Diller Scofidio + Renfro–designed Abu Dhabi Contemporary Art Museum, will return to the venue in 2022.  In the exhibition “On the Rise of the Sun,” a stream of blue sky and celestial bodies will be reflected in the glass structure, which will be illuminated by a single, red Sun , in order to show the rise of a new Sun in the constellation Gemini, from which the Sun will erupt in a spectacular supernova.  “I’m thrilled that the three-day exhibition will be back at Diller Scofidio + Renfro next year, with an expanded and updated programme of exhibitions", "The next Biennial should take place in 2022.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has appointed Samantha Powers the next director of the Metropolitan Museum of Art (MoMA), where she will assume her responsibilities on October 10. In her new role, Powers will be responsible for the development and management of the museum’s collection, research, exhibitions, public programming, and education programs.“Samuel Adams once said that ‘the most important thing in the world is repetition. And repetition is the most beautiful thing.” In this role she will develop and implement the museum’s collection strategies, foster the museum’s relationship with local communities, and work to strengthen public understanding and appreciation of the Met’s collection and thoughtful design.“This is a long-term project, not a quick fix,” said Powers. “I look forward to developing new and exciting experiences with the Met through the museums’ collections while ensuring that our visitors experience the museums in their entirety for the first time.” She added that she will also continue to work with the museum’s archiv and collections professionals to develop new exhibition ideas and to improve the museum’s collection design and", "The next Biennial should be a serious effort to do justice to the subject, and it should be organized in a way that will give the subject the opportunity of participating in its celebration.” In a television advertisement for the 2020 event, Jackson said that he hopes the event will be a “periodic reflection on the issues that impact our lives,” and said that the theme will “drastically alter as the years go by.” Jackson also said that the new location will “provide a unique setting for the exhibition and ‘present the art of the future.’”\n\n\nThe Sherwood Art Museum in New York has received a gift of twenty-three works by American artist Frank Gehry. The Museum of Modern Art (MoMA) and the Metropolitan Museum of Art (MoMA) in New York received the works from the artist’s estate, which was founded in 1968 by his late father, Maurice Gehry. The gift includes unfinished work, sculptures, and installations by Gehry’s favorite artist, Salvador Dalí, as well as works by artists he admired such as Ed Moses, John Lloyd, and Tadao Ando.“We are grateful to the Gehrys", "The next Biennial should be held at least eight years after the publication of the first volume of The Wound: A History of Art and Society in the Twentieth Century,” Cohen said in a statement. “This is an exciting time to be a curator, and I look forward to contributing to this next edition with my own books and my own words.”The biennial will open in Beijing on November 15, 2020. \n\n\nThe Institute of Contemporary Arts (ICA) in London is planning to move twenty-six of its buildings, including the Museum of Fine Arts (MoFA) and the Tate, from the city to the East Midlands. The institute’s new £4 billion headquarters will be located in a converted factory and will act as the foundational research center for the local arts ecosystem. The move is part of a $6.5 billion plan to reconfigure the city to support the manufacturing, commercial, and services sectors.“We are transforming East London to deliver a more vibrant, accessible, and representative cityscape,” said ICA director Tanya Cooper. “The ICA is committed to supporting East London and is working with local authorities to understand the full economic, social, cultural, and political", "The next Biennial should be held in 2020. In January 2021, a board of directors made up of representatives of the museum and the architects will be elected to renew the lease.\n\n\nThe National Museum of the American Indian (NMI) in Washington, DC, has received a gift of twenty-seven works by artist Aline M. Hofmann from her late husband, Alfred M. Hofmann. The works, which were given to the institution by her son, Richard, are on display in the museum’s exhibition “A.M. Hoffmann: The Art of Life” (2019–20), and include paintings by the artist as well as pieces by her contemporary collaborators, including Jospeh, Lévy Gorvy, and Gaëtan Bénétière.“A.M. Hoffmann: The Art of Life” (2019–20) is dedicated to the legacy of Alfred M. Hofmann, who is widely remembered as being the father of the modernist-inflected painterly style known as the “Hofmann technique.” In the show, which is organized as a retrospective, the artist, who was born in New York City in 1941, assembles a series of abstract", "The next Biennial should begin the same week as the first, which is on December 21 and will run through January 26. The event will also feature the revival of the 2017 exhibition “Catalan Modernism: Art and Politics,” which was hosted by the Museu de Arte Contemporáneo de Barcelona (MAS) and curated by Iñigo Mendieta. Mendieta’s project, titled “Rudolf Albers: ‘Das Lehbst des Altergestes” (Das in der Lehbst des Altergestes), was one of the first works by German-born Albers to be exhibited in the country. The exhibition marked the filmmaker’s first trip to the region, where he was born in 1940.The Venice Architecture Biennial will run from January 6 to January 9, 2021, in Venice. The show will feature eighty works from forty-eight countries and more than five hundred cities. The biennial will premiere the work of the artist-in-residence Lutz Bacher in its entirety.\n\n\nThe Museum of Fine Arts (MFA) has appointed Doris Duke, a curator and artist-in-residence at the institution", "The next Biennial should include more critical, scholarly, and personal exhibitions, and a new platform for the collection of cultural objects from the contemporary South American continent, as well as a new generation of scholars and artists.”The 2018 edition of the Biennial was held at the Museo de Arte Contemporáneo in Maricá, Brazil, and was also hosted by the Museo das Artes in Madrid and the Museo de Arte de São Paulo, respectively. The 2019 edition of the Biennial will be held at the Museo de Arte de São Paulo.\n\n\nThe Museum of Fine Arts (MFA) in Los Angeles announced today the winners of the 2019 David and Goliath Foundation Grant, which is a $50,000 award established to support contemporary artists working in the United States. The 2019 recipients are:Tacita Dean, Queens, New York; Jason Eden, Manhattan, New York; Beverly Frank, New York; and Amy Resnick, Brooklyn, New York.“This year’s David and Goliath, which honors the work of twenty-three outstanding contemporary artists, is a reflection of the breadth and depth of our community in Los Angeles,” said museum director", "The next Biennial should take place in 2022, to coincide with the centenary of the outbreak. The upcoming edition will feature work by some eighty artists from forty-four countries.This year’s exhibition, “The Network,” which was curated by Prudence and Hannah Boyce, will be presented in the United Kingdom, Mexico, Northern Ireland, and Singapore, among other locations. “The Biennial is the most important event of its kind,” said Sophie Walker, director of the Biennial and the BFI. “It embodies the spirit of the festival in so many ways. I know that I’ve said many times that I want the festival to be a vehicle for artists and a platform for their work. I hope that this is the year that it finally becomes that.”The 2019 edition of the festival, which was held at the BFI in London and the University College London, included work by twenty-one artists, including Luda Lou and Steven Hirschhorn, who are set to appear at the Museum of Modern Art in New York in March. The exhibition, titled The Network, was curated by Prudence and Hannah Boyce,", "The next Biennial should focus on “the relationship between art and information,” said Edwidge Danticat, a cofounder of the biennial. “We are now in the process of developing a new platform for the exhibition to draw on the amazing digital works of art, and to make the exhibition accessible and affordable to anyone. The exhibition will be curated by Nadim Tamir, director of the Gallery of Modern Art, London.The exhibition will also include a special exhibition of work by artists in the exhibition “as they continue their writing and drawing in different times and places.”The inaugural edition of Biennial Samer Rassoul’s “Circle of Freedom,” held in Fall 2003, opened at the Museo del Arto, in Madrid, and ran until January 28, 2008. The exhibition was organized by the artist and his wife, the artist’s daughter, and was curated by the artist and artist’s son, the artist’s granddaughter, and the artist’s nephew.\n\n\nKathrin Becker, the chief curator at the Museum Ludwig in Hamburg, Germany, was fired by the institution after she posted a video on YouTube of a dog biting a piece", "The next Biennial should be hosted in the Albright-Parsons National Arts Center, Oklahoma City, in 2021. Its theme will be “The Future of Art and Body.” The event will provide an opportunity to present works by artists who have yet to be selected for the 2020 award.The biennial will be followed by a symposium, “Art in the Life and Death of,” at the National Museum of Fine Arts, Washington, DC, on September 27. “This year’s award will celebrate the artists whose practices present new and challenging approaches to the traditional boundaries of the visual arts and are capable of transforming the way we think about the future of art,” said John Laursen, president of the National Association of Art Museum Directors.\n\n\nAccording to Artnews, the Berlin-based nonprofit Art Space Berlin (BKA) is asking its Berlin neighbors, the Hamburger Bahnhof, to shutter down their businesses as part of a $16 billion redevelopment plan. The nonprofit is seeking to create a multiyear platform for the exchange of works and materials and is partnering with the state-funded arts-design center, the BKA, to develop an open-air sculpture garden and permanent collection in", "The next Biennial should take place in the United States in the spring of 2021. The inaugural event, titled “The Body,” will be hosted at the Art Institute of Chicago and will focus on the cultural and academic production of human bodies. The second Biennial, titled “From Mummies to Narratives,” will focus on the trans-historical relationships between narrative, history, and body. The third and final Biennial, titled “The Kisses,” will follow the bodies of human beings in their everyday lives and will be curated by and open to the public at the University of Pennsylvania.The first edition of the event, which was held in 2019, drew a total of 37,500 visitors to the museum, which was founded in 1933 by the Dreyfuss brothers. The Dreyfuss sisters, who were the sole owners of the Dreyfuss Museum of Art in New York, were hospitalized in the immediate aftermath of the pandemic. Their daughter, Gertrude, became the first donor in history to become the first artist to be selected for the museum. The museum received $5 million from the Dreyfuss family for the exhibition, “The Dreyfuss Group: A", "The next Biennial should be held in 2021. \n\n\nThe Metropolitan Museum of Art (MoMA) in New York and the Whitney Museum of American Art in New York have reached an agreement that will see the Art Deco-inspired museum’s collection relocated to a new 15,000-square-foot home in the Bronx. The transaction is valued at $3.5 million and is part of a larger plan to restructure the institution, which also involves the dismantling of the museum’s current exhibition halls, and is expected to be completed by spring 2021.According to a joint statement issued by the museums by MoMA and the New York Department of Cultural Affairs (DCLA), the museum will donate 1,500 paintings, 1,600 photographs, and 1,500 prints by artists ranging from Robert Irwin to William Eggleston to the Museo de Arte Contemporáneo in Santiago, Chile, to the gallery where they will be displayed.“After careful consideration, we are pleased to announce the acquisition of the four pieces in question—a portrait by Italian modernist Stefano Pincus, a selection of photographs by Francis Alÿs, a documentary on the History of Sexuality by Angela Rump", "The next Biennial should be held in 2020. Tacita Dean, the director of the American Museum of Natural History in New York, has suggested that the exhibition should be relocated.   “We must all take action,” she said. “We are at a turning point as a society. We have the opportunity to send a stronger message to our children and grandchildren that the science of climate change is real and that we are taking action.”\n\n\n\n\n\nNancy Pelosi, the House Democratic leader, is demanding that President Donald Trump dismantle the landmark Paris Agreement, which commits nations to cutting emissions of greenhouse gases and to limit global warming to no more than 2 degrees Celsius. In a statement, a spokesperson for the California Democrat said: “The Paris Agreement has been an abject failure. It has only made things worse. It has only made things worse for working families and the middle class. It has only made things worse for children.”Pelosi also criticized the United States for not doing more to reduce the nation’s carbon pollution from power plants and factories, and for not seeking international cooperation to curb carbon emissions. The California Democrat cited Trump’s decision to fire former head of the Environmental Protection", "The next Biennial should be held in 2020. The exhibition will be based in the museum, which is currently undergoing a $1.5 billion expansion, and will also be hosted in the new Museum of Modern Art’s new location at the corner of Michigan Avenue and Central Street in Manhattan. The Museum of the Greek Epicurean Art, which was inaugurated by architect Vassiliki Tzetakis, and is currently undergoing a $500 million renovation, will not be affected by the construction of the Museum of the Peloponnesus.The museum’s recently opened Museum of the Gods, an exhibition of sculptures by artists including Kynaston Mopaklis, the last director of the Cappadocia region’s Painted Churches, and the late artist and teacher Max Beckmann. Mopaklis’s Mycenaean Sea-Dreamer is on view until October 11. “The museum’s staff is at the same time very proud of their achievements, and very excited about its new partnership with the city of Chicago,” Artnews reports. “We are deeply honored to be able to present the new Museum of the Gods in partnership with the city of Chicago", "The next Biennial should take place in 2021. Founded by Australian artist-activists Betty Smith and Ed Clark, the exhibition was conceived as a way of sharing work in its entirety, before and after it was removed from the premises. Smith and Clark were arrested in Australia in 1968 over the exhibition, which sought to confront the systematic dehumanization of the bodies of black and indigenous artists. The exhibition earned them a ten-month jail sentence; Peter Schäfer, then head of the Department of Modern Art in New York, was among those who organized the show, which was held at the Museum of Modern Art in New York from 1969 to 1971, was forced to close the museum in 1984.Schäfer was not arrested until 1999, when he and Smith were accused of trying to sell a copy of the exhibition, which was created as part of a broader movement to expose the state-sanctioned exhibitionism of the art world. The pair were eventually convicted of counterfeiting, but the conviction came after Schäfer published a letter in the September 1995 issue of Artforum decrying the \"incompetence\" of the Australian court.More than two hundred artists were also convicted of nonviolent crimes in an Australian court, including Paul Gauguin", "The next Biennial should be held on June 30. We hope that the festival will be able to organize a show of work by the cast and crew of the show, as well as an exhibition that will be dedicated to the show. We are also looking forward to the opening of the show in the coming weeks. The work of Biennials is not always an easy subject for the audience to follow. However, a show of some of the best work created by a young generation of artists remains a powerful reflection of the art world and contemporary life in the city.\n\n\nThe Association of Independent Visual Artists (AIVA) in New York has released the list of eleven artists who will present the first exhibition of its kind at the Museum of Modern Art (MoMA) in 2020. Titled The Measure of a Man, the exhibition will feature work by forty-one artists, including Jim Jarmusch, Yinka Shonibare, Sophie Klimek, and Peter Zumthor, and will run from September 8 through November 3, 2020. Joseph Beuys (New York), Alejandro Cesarco (New York), Eric Dolgen (New York), and Lauren Marlee (New York) will also", "The next Biennial should be held in 2020. The opening of the museum will be in May. The program will take up a broad range of contemporary art history issues from the animal to the virtual world, from the systematic to the idiosyncratic, from the intellectual to the personal. In addition to the exhibition, the theme will be the search for meaning in a world that no longer contains it. The theme of the exhibition will be “Life and art, not price, price, life, art, not price.” The exhibition will feature approximately 150 workworks by contemporary artists, including Nirvana Ferrucci, Tacita Dean, Tadao Ando, Mark di Suvero, Rory Graham, Olive Johns, Tao Katley, Denys Lenar, Kirsten Lintz, Patricia Mark, and Tanya Markova.The 2019 edition of the Biennial was held at the museum’s new campus in the city of Milan, which was completed in 2017 and opened to the public in January. The exhibition was organized as part of a larger project that brought together contemporary art, technology, and film. The project was inspired", "The next Biennial should be held in the spring of 2021 and will be hosted by the Museum of Modern Art, founded in 1814. The 2020 theme for the exhibition was “Eco-Collaboration and the First People,” and the theme for the exhibition was “Untitled,” which was curated by Matthias Kohn. The Los Angeles–based artist will play a central role in the twenty-third edition of the Biennial, which will open in Guadalajara, Mexico, in October.The first biennial exhibition, “Love and Creation: Art and the Coming American Eden” (2017), showcased work by forty artists, including Andrew Lagnado, Bibi Silverman, Gianluca Catellani, Linton Fad, and Joshua Helmer. The exhibition focused on the relationship between art and creation and explored the role art had in healing the sick, while highlighting the ongoing work of artists in the field of stem cell research. The second exhibition, “Art and Ideology: From the West to the East,” (2015) was organized by artist and curator Mark B. Smith and was directed by Doug Aitken. The biennial is divided into", "The next Biennial should be the last, and will consist of a host of exhibitions, presentations, performances, and seminars, as well as a documentary, titled “The Third Wave,” which will be shot at the newly renovated Cultural Center in the capital city of the Ecuadorian People’s Republic.João Ana Pérez, director of the Centre de Cultura Inter-Orientárias in Medellin, said: “This year’s Biennial is a great opportunity to take a step back from the radical and in many ways controversial events of the last few years and reflect on the possibilities and the challenges that we face as a society.”\n\n\nThe Museum of Modern Art (MoMA) has purchased more than 1,800 artworks by New York–based artists, including Mark di Suvero, Timothy Callahan, and Abigail Gentry, for its collection, which is currently on display in the exhibition “The Artist’s House.” The works, which were purchased by MoMA for the collection’s first exhibition, “The Artist’s House,” will open in the museum’s new location, the Oliver House, in", "The next Biennial should take place anywhere in the world, and should involve every person, anywhere in the world. It will also include a collaborative exhibition, a public sculpture project, an education program, and a celebration. \n\nThe Metropolitan Museum of Art in New York has sold its first-ever solo exhibition at a time of global crisis. The museum said the show, titled “The Worst Is Yet to Come,” will open in October 2020 and will focus on themes of technological progress, climate change, and ethical issues.“The show is an extension of the museum’s mission to present the most important studies and innovations from the past forty years,” said Museum Director Daniel H. Weiss. “It also reflects a new level of involvement from the museum in the new and contemporary world. . . . We are eager to share biennial themes and collections with visitors, and to engage in dialogue with leading thinkers and artists.”The exhibition is being organized by Jessica Morgan Gallery, with the support of Michael Bloomberg, the mayor of New York; Michael Raymond, a longtime friend of the museum; and John H. Smith, the president and CEO of New York’s Museum of Modern Art.", "The next Biennial should be a celebration of the history of the museum and its construction, as well as an exploration into the role of the museum in the lives of those who have lived and died in the building. The museum will also be the setting for the exhibition “Toccarra: The Body and the Sky,” which will feature the work of twenty-one artists in the exhibition. The event will open in March 2020 and run through October 2021.\n\n\nThe Institute of Contemporary Arts (ICA) in Prague has become the latest institution in the Czech Republic to suspend programming due to the coronavirus pandemic. The news comes following the announcement of the institute’s first major reopening in 2019, the reopening of the museum, which has been closed since March 2019 due to the Covid-19 outbreak. The institute, which consists of two buildings, the Institute of Contemporary Arts (ICA) and the Central Library, is currently undergoing a major expansion, which will see the building renovated and the interior and exterior reconfigured, and will celebrate its opening by reopening the Institute of Contemporary Arts on December 21, 2019.The institute’s director, Markus Gebber, told the Art Newspaper that the reopening would", "The next Biennial should be held at the Stedelijk Museum in Amsterdam in 2019. \n The tenth edition of the Berlin Biennale, curated by a group of artists led by Wolfgang Lösch and containing a selection of works by ninety artists, will take place at Chisenhale in the German city of Baden-Baden from August 25 to August 28, 2020. The exhibition will then move to the Seabag Theater in Singapore, which will stage the show in August 2021. \n\n\nThe American Ballet Theater (ABT) in New York has appointed Amanda Silver as its next director. Silver succeeds Helen Gant, who has helmed the organization since 1992, and will succeed Paul Erdman, who is currently chair of the board of trustees, at an interim date of March 22. Silver’s appointment was announced on July 31. “I’m so excited for this next chapter of our history with Anthony, and am thrilled to be joining the board of the Ballet,” Silver said. “This is an incredibly challenging time for the company, with the recent acquisition of the company by the New York–based investment firm Apollo Global Management, and our current challenges are many", "The next Biennial should take place in the spring of 2021. \n\nThe Art Newspaper reports that the Brussels-based nonprofit, which is affiliated with the Belgian government, has agreed to donate $4.9 million to support the construction of new arts and cultural centers and the preservation of the city’s former colonial monuments in the capital. The Art Newspaper reports that the Brussels-based nonprofit, which is affiliated with the Belgian government, has agreed to donate $4.9 million to support the construction of new arts and cultural centers and the preservation of the city’s former colonial monuments in the capital. In addition, the organization will donate $300,000 in support of the François Mitterrand Réunion Plan, which aims to improve the mobility of people and business between the two cities. The capital city’s Grand Salon, a major cultural destination, was also featured in an exhibition at the Brussels Biennial, “The Future of the Grand Salon,” which was organized in cooperation with the Belgian federal and municipal archeological bodies. Artists from twenty-five countries will converge on Brussels for a series of events that will run from January 8 to January 10, 2020. The theme", "The next Biennial should be held in 2020. \n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, announced today that Annie Pfeifer has been named to its board of directors. In its first year as a board member, Pfeifer will serve as chair of the newly established board of directors for a two-year term. Pfeifer comes to the institution from the Museum of Contemporary Art (MoCA), where she has served as director since 2010. Prior to joining MoCA in 2009, Pfeifer served as the director of the Metropolitan Museum of Art (MoCA) in New York from 2009 to 2011.While at the Met, she oversaw the installation of more than 150 works, including work by late Italian master Giacomo Balla, and oversaw the museum’s expansion in the late 1980s. In addition to overseeing the gallery, she was the lead curator at the New Museum in New York from 1993 to 1998. “The board’s goal is to help the board realize a greater vision for the Met, and to support the museum’s creative, artistic, and cultural goals,” Pfeifer said in a statement. “We are grateful to the Met Board for empowering us", "The next Biennial should take place in 2020. The arthouse, which focuses on experimentation and experimentation on the part of experimental artists, was founded by a group of curators who were inspired by the experimental, experimental work of Prince and Ken Loach, respectively. The new institution will be housed in an existing, forty-five-thousand-square-foot former textile factory in the city of Graz, Austria. The installation and performance venue will be housed in a former mill in Graz.Commenting on the upcoming exhibition, Johanna Gassen, chair of the museum’s curatorial board, said: “The Biennial is a massive and important project that will make a very significant contribution to the 2019 and 2020 editions of the Venice Biennale. We are very excited about the possibility of incorporating the work of the artists who have never been exhibited before in the exhibition, and who have never been in another exhibition, into the exhibition space.”\n\n\nThe Durham Art Museum, North Carolina, has received a gift of seventy-eight works by nineteen African American artists\u0097including eleven works by Zareena Franklin, George Alfred, and Sylvia Albee\u0097from the Zendai Foundation. The"]