["The next Biennial should take place in 2020 and is slated for the Biennale Park in Rio de Janeiro, Brazil and the Art of Manliness in Seoul, South Korea.\n\n\nThe 2011 edition of the Venice Architecture Biennale, curated by the French architect Jean-Michel Basquiat, was unexpectedly canceled due to a virus. Titled Ascension: The Biennial of Life, the exhibition was supposed to take place in the city of Saint-Cloud, near Paris, in the United States. The event was scheduled to run from May 11 to May 18, and was to include work by twenty-six artists and sixty-eight galleries, including Damien Hirst, Adrien Brody, Jean-Luc Ponty, Mark Rylance, Laura Owens, and Maren Rose. The cancellation was made in conjunction with a recent $300 million renovation of the venue, which is the largest public work in France and the third largest in the world. The renovation, which began in 2017, included the addition of an outdoor courtyard and the addition of a theater, and brought the total number of participants to seventy-nine. The exhibition will now open in the new Central Library, situated in the city of Saint-Cloud, in 2020", "The next Biennial should take place in the spring of 2020, the organizer said. \n\n\nThe Museums Association (MA), the UK’s professional art trade organization, has released the results of its Coca-Cola Art of the Month Award, which is given annually to a British artist or curator. The award, which was established in 2009, was selected by an international jury comprising Courtney Love, art critic at the Guardian; John MacGill, chief executive of the John Innes Foundation; artist Maud Lyons; and Blake of Soho, the London-based artist and curator.The Artists’ Choice Award, which has been presented annually since 2006, will be presented at an award ceremony at the Chelsea Flower Show in London on Wednesday, February 22. The winner of the prize will be announced in March. The jury comprised Love, MacGill, Lyons, and Peter Waldman, director of Tate Britain.\n\n\nThe Museum of Contemporary Art (MoCA), New York, has appointed Sharon Ritter as its next executive director. Ritter brings with her nearly five years of experience working in international charitable organizations and has helmed the museum since 2014. She succeeds Miriam Clark, who retired in March 2019 after", "The next Biennial should focus on the issues of the year around it: how we respond to the current crisis, and how we relate to the future. During the current crisis, the Art Gallery of Ontario is working to repair the damage that the pandemic does to our curatorial programs and curatorial practices. We believe that once the dust settles from the coronavirus, the next generation of Canadian curators will be able to contribute vital and cutting-edge work to the themes of the biennial. The curators in question—Marlene Johnston-Lewis and Katherina Reimer—were among the first to respond to the pandemic with work that engages with current social and cultural concerns, and their first to be asked to engage in a series of intensive public programming, including a retrospective of survivors of the Covid-19 pandemic. The exhibition “Welcome to the Biennial: What Does the Future Hold?” will open in the fall of 2021. The exhibition is being organized by the Biennial Foundation with support from the Ontario Council of the Arts and the National Gallery of Canada.\n\n\nAustrian curator Günther Oehlen has been appointed the next chair of the Asian art-world’s governing body, the", "The next Biennial should be held at a location with a contemporary contemporary design, in a city with a contemporary design, in a city with a contemporary fashion, in a city with a contemporary art, or perhaps in a museum. “A contemporary art museum would represent a real renewal of human experience,” Madeleine Evans, director of the National Gallery of Art, told the New York Times.\n\n\nThe Museum of Modern Art (MoMA) in New York has announced that it is planning to dissolve its Los Angeles branch, which has been in existence since 1989, but not before a group of artists, designers, writers, musicians, and other cultural producers successfully pressured the institution to preserve its collection and future plans.Since the petition was initiated by Richard Feuerstein, a Los Angeles native and longtime MoMA supporter, and his wife, Elizabeth Feuerstein, in 2016, the institution has been committed to negotiating a new twenty-year lease with the artist-run nonprofit, Artists United, for its holdings. The management team believed that a new arrangement would alleviate the organization’s financial and operational challenges and would also help the local arts community.In September, MoMA announced that it had reached an agreement with Artists United that will see the organization", "The next Biennial should take place in 2020.  A statement released by the Biennale said: “We are pleased to announce that we will be able to present the fifth edition of the Venice Biennale in 2021. The programme of the exhibition and the artist-run venues will be the same as in 2020.” The event will be hosted by the Palazzo Scolarotti, the Palazzo Gioia, and the Palazzo Giustino, with participation from the permanent collections of the Museo del Prado, the Museum of Modern Art, the Museum of Modern Art, the Museum of Modern Art, and the Museum of Modern Art Barcelona. The full list of participating artists can be found on the Venice Architecture Biennale’s website. The Venice Architecture Biennale is funded with funds from the Catherine and Stefano Foundation and the Ford Foundation, as well as from the Italian State. The seventy-Ninth Venice Architecture Biennale will be hosted by the Art Institute of Chicago and curated by architect Roberto Cuarón. The previous editions, curated in 2003 and 2007, were held at the Parc de Beaux-Arts in Paris and the Parc de Beaux-", "The next Biennial should be held in 2020. The theme of 'Dangerous Liaisons: Conversations on the Body' will be relevant to this generation of artists.The next exhibition will be organized by the Schloss, the same space that teamed up with the Talking Museum in Berlin to stage the first exhibition devoted to the body in the city, “Telling Stories: Stories from the Body” in 2009.The Schloss’s director, Ulrich Bock, said: “The Schloss Guggenheim Museum is committed to creating, in partnership with local and international curators, exhibitions that reflect the spirit, the art, and the evolution of the Schloss Guggenheim’s collection. We believe that this year’s exhibition ‘Behind the Body’ marks the moment when this partnership will break new ground.’”\n\n\nSydney’s Museum of Contemporary Art (MAS) is facing a backlash over its decision to remove a painting by the late Australian sculptor Margaret Mitchell from its collection after it received a complaint from a collector who said the work, titled The Drawing Board, contained “sexual innuendo and religious imagery.” The museum has since been criticized", "The next Biennial should take place in 2021. The full list of participating artists is as follows:Akashic Gallery (New Delhi)Association of American Photographers (New Delhi)Arts and Design (New York)Association of Urban and Regional Photographers (New Delhi)Artists in Residence at the National Institute of Photography (New Delhi)Artists in Residence at the East India Library (New Delhi)Artists in Residence at the National Museum of Art (New Delhi)Artists in Residence at the Bhartiya Sena (New Delhi)Artists in Residence at the National Gallery of Modern Art (New Delhi)Artists in Residence at the Kerala Museum of Art (New Delhi)Artists in Residence at the National Gallery of Art (New Delhi)Artists in Residence at the National Museum of Fine Arts (New Delhi)Artists in Residence at the Nagpur Museum of Fine Arts (Nagpur)Artists in Residence at the National Museum of Fine Arts (New Delhi)Artists in Residence at the National Museum of Art (New Delhi)Artists in Residence at the Art Institute of Chicago (Chicago)Artists in Residence at the Art Museum, Abu", "The next Biennial should be held in 2020. Art historian Mary Beard, who curated the twenty-third edition of Art Basel Hong Kong, was invited to curate the upcoming edition. She will now work with artist and curator Hu Jie to craft a unique program for the fair, which will comprise nine exhibitions and a series of smaller events.The upcoming edition of Art Basel Hong Kong will take place at the Art Museum Hong Kong. The event will be hosted by the venue’s new team, who will be helmed by veteran Hong Kong curator Richard Yu, and will run from October 3 to October 5.In an interview with Artforum last week, Beard described the upcoming event as “an extension of the fair’s mission to bring together the best art of Hong Kong.” She also said that the theme of the fair was to adapt the global art-world image of Shanghai to reflect the city’s cultural heritage, and “the new art-world format will show the history of art in Hong Kong over the last several decades.” Her curators will also introduce new programs including “Art Roadshow” and “Signs of Life: Art in China” and will reveal the first", "The next Biennial should be held in 2021, and the next will be held in 2024.\n\n\nAfter a fire tore through a workshop in the Bibliothèque Nationale in Paris on Monday, March 24, the building where the exhibition was taking place was not damaged and there were no reports of any casualties. However, an exhibition of work by the artist Jean-Luc Moulène, titled “Painting in the Age of Picasso” (National Museum of Modern Art), was damaged as was the building that houses it\u0097the Louvre. The National Gallery, which was not damaged, is currently closed until March 19.The Louvre was forced to temporarily close in January 2019 after a fire broke out on the building\u0097it reopened on February 12. On March 7, Moulène’s fantastic staging of a painting by the artist was featured in an exhibition organized by the museum. Within days of the exhibition opening, the Louvre received several hundred visitors, including a number of Moulène’s followers, who were treated to a performance by the artist. It also temporarily closed in February for a second time on March 7, in an attempt to stave off the spread of Covid-19", "The next Biennial should take place in 2021–20, and the following year in 2023. The first show, “On the Spillover of Art,” will be staged at Brooklyn Museum in New York in 2022, the same year the next Biennial will take place in South Korea.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, has appointed Tim May, a curator who worked at the museum from 1993 to 2009, as its next chair. He succeeds John L. Stewart, who departed the institution in February 2019 after more than twenty-five years to become the director of the Metropolitan Museum of Art.“Tim is a skilled and respected curator whose innovative, interdisciplinary practice brings a wealth of experience to the MoCA’s collection, exhibition, and research, and is committed to working with and advocating for artists in the contemporary art movement,” said museum director Adam D. Weinberg. “His deep knowledge of and commitment to artists in the art field will be particularly useful in our collection, which has been impacted by a number of the institution’s curators, particularly John L. Stewart and Barbara Kruger. We are thrilled to welcome him to the MoCA.”A scholar of", "The next Biennial should now take place early next year.\n\n\nThe Ford Foundation has awarded the Los Angeles–based artist Michele Ford, whose work explores notions of self and the environment, $50,000 for her first solo exhibition at the Ford Foundation in Manhattan. Ford, whose practice spans photography, sculpture, performance, and painting, is the founder and director of two nonprofits, Ford Foundation Open Studios and Ford Foundation Open Studio, which have collaborated to produce work for the arts-based projects calendar for the organization for more than twenty years.The foundation will stage a retrospective of Ford’s work next February at the Museum of Contemporary Art Los Angeles (MCA), and a second exhibition of the artist’s work at the Ford Foundation in 2020. Both shows will be accessible on-site for the general public. In addition, Exhibition 7 of Ford’s 2015 exhibition “Deep Time” will now be staged at the Ford Foundation. The original show, which featured sixty works by Ford and her collaborators, was staged in the museum in 2012. The museum will serve as a permanent home for the work, which was selected by director Michael Auslander.Ford’s work will be presented in the exhibition “Longing for a Home,", "The next Biennial should explore the work of artists who are making a difference in the lives and work of others. We hope that the new venue will provide a new and improved platform to engage with the highly diverse and underrecognized communities of the Philippines.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that Lisa Raich, who served as assistant curator at the institution from 1994 to 2001, will be the next director. She succeeds Alex Hirsch, who was hired as chief curator in 2007 and departed in 2011.“Lisa is uniquely qualified to lead the Museum of Contemporary Art as it continues to redefine the role of an art museum in the world,” said John Cunningham, director of the museum. “Her decades of experience and deep understanding of contemporary art and its history make her the perfect choice to lead the Museum of Contemporary Art.”Raich previously served as director of the Bienal, the modern and contemporary art center in the city of Bienal, Argentina. She was the director of the Santa Fe Art Museum, New Mexico, and a senior curator at the Santa Fe Museum of Art, New Mexico. She also helmed the exhibition program at the San Francisco Museum of Modern Art.Commenting", "The next Biennial should take place in the summer of 2022.\n\n\nA year after a group of artists and activists launched a campaign to hold the French government accountable for failing to protect endangered species, France has introduced a total ban on hunting in its parks and declared its intention to relocate some 10,000 French leopards to China to help prevent the extinction of the critically endangered marsupial, the C25, a critically endangered subspecies of the marsupial, the C23, which was wiped out by the French government in 2017. The move has been condemned by animal-rights groups, who fear that the relocation of the animals will lead to the forced relocation of the remaining marsupials.In a statement, the French Ministry of Culture said: “We take seriously all proposals to relocate animals and we will respond with a decision that can only be problematic for us.”The move follows a series of controversial conservation decisions made by French politicians and the French government in the years leading up to last year’s presidential election. François Hollande, the Socialist president, appointed a new conservation minister, Luciana Berger, who vowed to open France’s national parks, but to date, no relocation plans have been made. The policy change led", "The next Biennial should celebrate the site of the Holocaust. The 2021 edition is being curated by Bram Stoker and illustrated by Vincent van Gogh. \n\n\nThe Corcoran Gallery of Art in New York has received a gift of fourteen new works by Rafael Corcoran, the Venezuelan-born, Los Angeles–based artist whose practice spans painting, sculpture, printmaking, performance, video, and installations. Among the works are The Hell and the Earth, 2019, a collage of images from his books The Earth and Its Rocks (Venezuela: Corcoran Foundation) and The Life and Death of Pablo (Mexico: Corcoran Foundation) with a total of thirty-two paintings and prints, Making Worlds in Film (Los Angeles: Corcoran Foundation) with forty-nine artists, and The Eternal River (New Mexico: Corcoran Foundation) with sixty-five artists.The gift is one of many Corcoran works that have recently entered the public public domain in California. The New American Art Project (NAA), an initiative founded by the artist to raise awareness of his work, has transferred the works to the Institute of Contemporary Arts in Chicago. One hundred works from The Life and Death", "The next Biennial should be staged at the Museum of Fine Arts, Mumbai, in April 2020. \n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, announced today that it is launching an initiative to support the city’s arts and culture through the purchase of works by local, national, and international artists. The initiative, called the MoCA Artist Relief Fund, will provide $6 million to artists who are facing financial hardships due to Covid-19. The fund is an extension of the city’s $1.5 billion covid-19 response plan, which aims to provide direct financial assistance to communities in the Los Angeles Unified School District (LAUSD), which includes schools, libraries, and other community facilities. The fund will be managed by the city of Los Angeles through a program called a city grant, and will distribute $2 million annually, with a $1 million cap, to artists. The recipients will be selected by lottery from a pool of approximately 1,500 applicants.The fund was created by the city of Los Angeles in partnership with the artists behind works from the Los Angeles Museum of Contemporary Art (LACMA), including #10: The Twin Towers, 1993, 1980,", "The next Biennial should focus on the role of art and design in the emergence of new ways of being, of being in relation to the world around us, and of being in relation to the world beyond us.”\n\n\nMarkus Pirs, the director of Preussischer Kunsthalle Graz, Germany, has been appointed the next director of the Central Institute of Contemporary Art (BKA) in Berlin. Pirs currently serves as the director of the Kunsthalle Venstre Berlin in the city of Graz. He will assume his responsibilities at the newly-renovated museum, which is slated to open this fall, in July.“The BKA is a unique institution, stretching across two continents, capable of hosting a truly international collection,” Pirs said. “The establishment of the BKA has been based on the ambition to create an institute that would not only serve as a laboratory but also a platform for the study of contemporary art and design. We believe that the future of the BKA lies not only in the research and development of exhibitions, the exhibition program, but also in the collection and exhibition. I can’t wait to start working with the BKA’s outstanding staff and see what they", "The next Biennial should be held in the summer of 2021. The grand opening will be held at the Lajes Municipal Palace in the city of Ventura in Southern California.The new location for the exhibition will be at the Los Angeles County Museum of Art (LACMA), and will be named after the giant, the ancient city of Lajes. The museum is currently under construction but is slated to open in 2023.Funding for the exhibition will come from the California Community Foundation, the Bechtel Foundation, and the LACMA Foundation, and will be shared equally by the three institutions. The LACMA Foundation will receive $5 million; the Bechtel Foundation will receive $1 million; and the LACMA Foundation will receive $500,000.The institution will also receive $500,000 in support of the construction of its new location in the city. The new buildings will be built in a former auto body shop in a former industrial park in the city. The foundation will contribute $500,000 to the project.\n\n\nThe Vina Metropolitan Center for Arts and Design (VMC), a nonprofit organization that supports artists and small-scale designers in Los Angeles County, has received $3.5 million from the Los", "The next Biennial should be held in the city in 2022. \n\n\nKatherine Blumenfeld and Stefan Richter, the founders of the Tokyo-based firm Taglieter and Richter, have been appointed art directors of the National Museum of Art (NMA), Japan. Taking the reins of the institution, which was established in 1954, was already the second-highest position in the country, after the prime minister. Blumenfeld and Richter are currently under consideration for the job, which translates into a senior-level position encompassing both curatorial and development. They will assume their responsibilities from the curators.“We are thrilled to be working with the NMA and we look forward to working with the team and to developing the new partnership between the museum and the growing collection of the museum,” said Blumenfeld. Blumenfeld and Richter previously worked together in the creative industries for a number of years and have held positions at Siebel Gallery and at the Venice Biennale.Commenting on their new role, the duo said: “This is a new chapter for our partnership and we are eager to see how the institution will react to our new role. We believe the NMA is ripe for a", "The next Biennial should be held in the spring of 2022. Museum directors have expressed confidence that the redesigned museum will present a compelling display of the work of the artists that inspired it, and that the exhibition will recapture the spirit of the original exhibition. The museum’s new headquarters, the Museum of Contemporary Art (MoCA), is currently undergoing a $250 million expansion. The renovation project, which has been in the works for seven years, was completed in November 2018 and is slated to open in the spring of 2021.Following the completion of the renovation, the Museum of Modern Art will begin hosting visitors at a new 50,000-square-foot location in the building, the artist’s former home, in the spring of 2022. The new space will be inaugurated by an exhibition “Eleanor Attwood: The Night Painter” in April of 2022 and will be home to three new programs: “Eleanor Attwood: The Night Painter” biennial, a biennial and a special exhibition. The new exhibition will be an initiative of the museum’s new partners the Pérez Artes, the new space for contemporary art, and the Pérez de la Vida.The", "The next Biennial should be held in 2020. Ghent, the Netherlands, is currently working on a new design for its pavilion.\n\n\nThe National Gallery of Art (NFA) in Washington, DC, has received a gift of forty-five works from the late collector and philanthropist Ed Moses. The donation includes thirteen works from the collection of the biennial’s founder, Ed Moses. “Ed Moses was a master of the art world, a great educator, and an incomparable collaborator,” said NFA director Elizabeth Gartenfeld. “Through his generosity and enthusiasm, we have delivered on his promise to present a truly extraordinary collection of art.”The works, which are all on loan from the collection, were organized by NFA’s private arts and culture committee, which was chaired by David Burton, NFA’s founding director and chief curator. The NFA began receiving the works through Ed Moses’s estate in 1994. In recognition of his legendary status in the field, Ed Moses was awarded a CBE (Certificate of Merit) in the Order of the British Empire (CBE) in 1998 and a CBE (Certificate of Merit) in the Order of the", "The next Biennial should take place in 2021. , 2014, will be the final season of Biennial London.  Last year, the first year of the new biennial, the artists working for the three-year residency program participated in a number of exhibitions, including the inaugural Exhibition of Contemporary Art, Art from Wales, and Art from the Americas. The creative director of Biennial London Andrew West said: “I have been a fan of the biennial for many years and have been actively involved in choosing the artists for my residency program. The show will continue to explore the themes of the exhibition, and the public will continue to have a platform to see the work of artists in the program.”\n\n\nThe National Galleries of Scotland announced today that it has appointed Teresa Anagnos as the next director of the National Museum of Scotland. She will be responsible for overseeing the museum’s major refurbishment and will be based at the museum for the next twelve years. During her tenure at the museum, Anagnos will work with the team to develop a new partnership with the National Lottery Heritage Foundation and will oversee the design and construction of the new Lottery Pavilion in the institution’s new home at the", "The next Biennial should be held in 2020.\n\nTickets to the biennial will go on general sale on September 27, with the biennial’s first edition, 2019, taking place in the city of Antwerp from September 10 to September 12. “I’m really thrilled to go back to the city of Antwerp, where I grew up, and to create a new exhibition for the twentieth.” The opening of the exhibition “The Other Half of Life” will also take place in the city.The institution has announced that the new exhibition “The Other Half of Life” will open on September 21. The exhibition will visit different aspects of life, including the human condition, life within nature, and life after death. Its final exhibition will take place in the city of Antwerp on September 26.The biennial will consist of thirteen exhibitions at the institution. The first exhibition will be “The Future of Art: A Biennial of Biennials” (September 22–September 25), 2020. The second exhibition will consist of “The Art of Life: A Biennial of Biennials” (September 26–October 24), 2021. The third exhibition, �", "The next Biennial should be held in 2022. This would be the fifty-ninth edition of the award, which honors work which is at the forefront of contemporary art, and would be held in the Colosseum, Rome. When the exhibition opened in 1954, the pavilion included a work by artist Agostino Pignatelli, a contemporary of Matisse and Picasso, and a rock-solid installation by British architect Frank Gehry, called Unity in Time, which was on permanent display for twelve weeks.The theme of the biennial was “The Future is Present.” The exhibition was held at the Museo del Perro, under the patronage of Florentino Pérez and the artist-in-residence, Eduardo Bardelli. In an interview with Artforum in 1986, Pignatelli said the exhibition marked the “beginning of my artistic career,” and told of how the show made him “more than a millionaire.”\n\n\nNew York’s Metropolitan Museum of Art (MoA) has received a new gift of eighty-seven works from the artist-in-residence, Josie Rondinone, who began her career as a curator and", "The next Biennial should be held at the venue in December 2019. The museum will then open to the public in February 2020.The biennial will compete with New York’s Museum of Modern Art and London’s Tate Modern for the eponymous £10,000 prize, which will also go to the artist who creates the most innovative installation for the museum. The winner will be chosen by an international jury comprising writers and curators from the US, Europe, and the US–Canada.The full list of participating artists is as follows:Edited by Dusan Sharf, Amsterdam•Original poster: https://www.dropbox.com/s/sxx6x3nkeq11v5s/Ecgallo%20Arquitectura.pdf?dl=0\n\n\nFreelance curator and artist Brendan O’Brien, whose career breadth and range encompassed both experimental and experimentalist conceptual approaches, has died. His forty-two-year-old colleague and friend Gerald Steinhauer, who curated both the experimental and experimentalist spaces of the contemporary art world, died in 2008 from cancer. Already a master of the experimental, O’Brien also constructed a string of works that experiment with forms", "The next Biennial should focus on a project that will address the problem of diversification in the church, and on how curators can use their training to explore how art and the body can be a means of achieving social justice. The festival will also include a special exhibition of work by the late artist and activist Carol Silver, whose work intersects with the festival and is on view until September 12.The museum will also be restoring and renovating its former space in the Arts District, which sits across the street from the Broad and ArtsCenter, the flagship art museum of the city. The restoration work is part of a comprehensive plan that includes landscaping, renovating of the building, and the refurbishing of the Broad, which opened in 2006 and served as the home for the museum until it moved to a new space in the Arts District in 2016. The Broad and ArtsCenter were rebranded the Broad and ArtsMuse and ArtsCenter after a $100 million merger and are currently undergoing an expansion.\n\n\nThe Museum of Fine Arts (MFA) in Atlanta has hired Leslie Thornton as its new chief curator. In her new role, which is expected to begin in January 2020, Thornton will work closely with the curators of the Museum’s collection and future", "The next Biennial should commence in 2022. On its twenty-second anniversary, the Museum of Contemporary Art (MoCA) in New York will unveil an exhibition of work by artist Yinka Shonibare. The fifty-eighth edition of the event will take place at the Gallery of Modern Art in London.“We are excited to see how the next Biennial will impact the lives and experiences of our artists,” said Charles L. Biennale, director and CEO of the Museum of Contemporary Art. “They will be the first to tell you that the next Biennial is a life-changing experience, and it will be with them that we have the greatest opportunity to see their work and to experience their extraordinary world.”\n\n\nThe National Gallery of Art in Washington, DC, has received a gift of forty-six works by American painter Richard Anuszkiewicz. The gift includes twenty-two works by a selection of paintings by the artist’s father, another American artist, as well as a selection of works by his wife, Renda. Rescued in December from a Nazi-occupied Polish town, the works were eventually found by a group of Americans who were stationed at the museum during World War II", "The next Biennial should be held in the summer of 2021. The festival’s programme will be drawn from the themes of “autonomy, cooperation, partnership, productive partnership, cooperation of opposites, creativity, artists, and nature’s natural laws,” and will be curated by Asher Vaknin, director of the Howard University Art Museum in Washington, DC.Commenting on the upcoming exhibition, the artist-run festival said: “We are excited to present our first Biennial in the Summer of 2020 as part of the 2018–19 season. This exhibition will be a celebration of the biennial’s first year, and will utilize a range of new works that will be presented throughout the year to engage with the themes of recessions, climate change, and ecological crisis.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it has appointed Doris Allen as its next executive director. Allen comes to the institution from the Getty, where she currently serves as the deputy director of public and cultural affairs. Previously, she worked as a curator at the Museum of Modern Art in New York and as a curatorial assistant at the Getty.“We are thrilled to welcome", "The next Biennial should be held in the summer of 2021. “Around the World in Six Days,” will be staged at the Museum of Modern Art in New York from March 15–March 19, 2020. The exhibition will tie in with the opening of the new exhibition-format Contemporary Art, curated by Hsin-Chien Huang. In addition, the museum will showcase the work of a number of newly-constructed artists, including J. Paul Getty (March 15–March 22, 2020), Deborah Herschbacher (March 15–March 22, 2020), and Federico Mollino (March 13–March 28, 2020).\n\n\nThe Los Angeles County Museum of Art (LACMA) has appointed Keith Levitt as its next director and chief curator. He comes to the institution from the San Diego Museum of Art, where he has served as the museum’s deputy director since 2015. Since then, LACMA has grown to become one of the largest museum complexes in Southern California, and it has undergone a transformation. “Keith brings to LACMA a wealth of experience, knowledge, and leadership in the field of contemporary art, and we’re looking forward to his leadership role in helping", "The next Biennial should be announced in the third quarter of the year.\n\n\nThe Institute of Contemporary Art (ICA) in New York has received a gift of fifty-six works by thirty-four artists, including Robert Irwin, Christopher Wool, Aaron Siskind, Pia Camil, and James Morris, from the estate of the late Sam Gilliam, who passed away on September 30.The institute previously donated fifty works by the artists in 2015, the first year it was able to honor their memory.The gift includes some 115 works by artists who last year were under consideration for the 2019 honor, including David H. Miller, Lisa Frank, Dieter Spech, and Sebastián Rondon. The museum also previously donated eighty works by Charles Atkins, who died in 2017, and eighty-one works by artists whose works have recently come under consideration for the 2020 honor, including John Deakin, David Kahne, and John Osterman.Filipino American artist Silvia Almunia, who was nominated for the 2019 prize, was also awarded the 2019 honor. The twenty-six-foot, twelve-carat gold and white bronze statue of American photographer Frank Stella is currently on display in the exhibition “Avant Garde�", "The next Biennial should take place in the spring of 2021, and the first in the autumn of 2022. The exhibition will run alongside the forthcoming exhibition Biennale San Sebastian (2019), which features works by twenty-six artists.\n\n\nThe Israeli government approved the construction of a second village in the occupied West Bank on Thursday, marking a major escalation from the policy of dispossession championed by former Israeli defense minister Ehud Barak, who oversaw a policy of forced displacement of Palestinians from their land in the 1967 war. The announcement marked the second time the government has granted international organizations permission to build in the West Bank in the last four years. The first time this was done was in 2017, when the ministry granted the Salem Museum permission to build a new settlement in Beit El, a village near Bethlehem. The municipality cited the need to protect the archaeological site of the church of St. Joseph of the Holy Sepulcher and the monastery of the Nativity.The municipal council also approved the construction of a new city of around one thousand residents in the occupied West Bank, in a district of Beersheba that is home to some ten thousand Palestinian residents, on Thursday, June 16. The municipality announced the project, which is being spearheaded by NGO the Civil Administration", "The next Biennial should be held in the spring of 2022. Its first round of productions will be held in November 2022.The exhibition will look at the history of art from the perspective of a different artist. Its theme will be “Grammar and the art of meaning.” The program, titled “Quasi,” won the 2020 award. The 2022 fifteenth edition will be held in May/June.\n\n\n\n\n\nJill Abramovich, the American puppeteer and cultural producer known for her work in film and theater, died on December 13 at age seventy-six. The cause of death was pneumonia due to complications arising from relapsing MS, a progressive, relapsing, and refractory neurological disorder.Born Jill Abramovich in 1941 in New York City, Abramovich studied at the School of the Art Institute of Chicago, where she met her husband, Joseph, and then at the University of California, Berkeley, where she graduated in 1967. The couple moved to Los Angeles, where they began appearing in local productions by local and regional artists, including Peter Bogart, Robert Rauschenberg, and Saul Bellow. By 1974, she had appeared in at least forty productions a year for the", "The next Biennial should take place in Tokyo in 2022.\n\n\nThe University of Pennsylvania has awarded $10.8 million in grants to arts and cultural institutions in the United States and abroad in recognition of their contributions to the advancement of African American, Chicano, and Indigenous (CITI) studies and to the public intellectual, Sarah Pelton,“who has participated in and continues to serve as an inspiration for the artists and scholars who have made such work possible.”The money was awarded by the Mellon Foundation, the William Penn Foundation, the Carnegie Foundation for the Arts, the Ford Foundation, the Andrew W. Mellon Foundation, the Chrysler Foundation, and the Carnegie Legacy Foundation.“With a lifetime of creating and witnessing art, Sarah Pelton has been at the center of the canon for CITI and the canon for art studies, as well as providing the framework for the development of the National Museum of African Art’s ‘Art of the American South’ in Atlanta, Georgia, and the National Book Center’s “African Art in America” in Washington, DC.“Through her placement at the center of the conversation about art and culture, she has created opportunities for young African Americans,", "The next Biennial should take place in Oakland, California, in 2021. It will be hosted by the Oakland Art Museum (AAM), the Museum of Contemporary Art, Houston (MCA), and the Museum of Contemporary Art Los Angeles (MCLA). “The impact of our exhibition programs is an important consideration for the Oakland Art Museum,” said museum director and CEO Maria Ferrer. “We look forward to welcoming our artists back to Oakland in 2022.”\n\n\nThe Arizona-born, Los Angeles-based artist Aria Fattal, whose massive, multi-million-selling, and influential ceramic landscape works often depict intimate scenes of domesticity, art, and culture, has died at age eighty-six. The artist has been called a pioneer of the American landscape and was the subject of her first solo exhibition at the Museum of Contemporary Art Chicago in 1972; her next, at the Los Angeles County Museum of Art in 1991, demonstrated her long-held ambition to make domesticity central to her practice.Filipino-born, New York-based artist Luis Alfaro's work is characterized by its exploration of the relationship between domesticity, sexuality, and the body. Although born in Los Angeles in 1941, Alfaro", "The next Biennial should be staged in early 2022, according to a statement from the foundation. Its next iteration will be an exhibition of works by artists from around the world, which will be held at a venue previously selected by the foundation.The art of Los Angeles County, founded by Josef Alberts in 1935, is collected by the Los Angeles County Museum of Art as a part of the Henry Luce–designed Memorial Art Museum in Los Angeles. The museum also recently announced that it plans to receive sixteen works by the Los Angeles-born artist Norman Tarrant. The works, which will be restored and placed in a museum exhibition, will open to the public in 2022.The museum is also planning to build a permanent collection of nearly two thousand Norman Tarrant paintings. The works will be housed in a building adjacent to the former site of the Los Angeles County Museum of Art and will be commissioned by the museum in 2020. The works will also be on view in the museum’s new Norman Tarrant—designed by the architect and architect who designed the museum—before the foundation’s inaugural exhibition, “Los Angeles: A Biennial,” will open in the spring of 2022.\n\n\nThe Museums Association (MA", "The next Biennial should take place in 2022.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has released the list of twenty-six artists who will participate in the second edition of the Los Angeles Biennials, which will take place in 2022. Titled “Los Angeles and the World,” the exhibition will explore the legacy of the city, its inhabitants, and its environment through the work of thirty-five artists.Goldsmiths in London and the Stedelijk Museum in Amsterdam will stage the exhibition. The first iteration of the exhibition, “Los Angeles: From World to City,” opened at the Museum of Contemporary Art, Los Angeles in February 2018 and ran until February 21, 2019.The exhibition’s artists include Jean-Luc Godard, Walt Disney, Vincent van Gogh, Jean-Luc Moulène, Fritz Lang, and Olga and Olga Tatar; Mary Cassatt, whose work is often presented as a tribute to the city of Los Angeles; and Vincent van Gogh, whom the artist hoped would be a surrogate for the artist’s muse. The exhibition will draw from a collection of more than two hundred paintings, collages, prints", "The next Biennial should be held in the spring of 2022.”\n\n\nThe British Museum (BM) in London has received a gift of seventy-three works by three dozen artists, including the Czech artist Antonin Radin, the Israeli artist Michaël Halevy, and the Ukrainian painter and sculptor Yuri. The works, which were donated by the Krasnoyarsk branch of the Kéro-Russian Art Museum, were acquired by the Kühl-Stevens-Kanien Gallery in London.“It is a thrilling occasion to welcome these works to the museum,” said David Clark, director of the Kühl-Stevens-Kanien Gallery and head of the Kühl-Stevens-Kanien Foundation. “The gift is a stunning gift given the visionary and influential leadership of Könitz-Stevens, in the course of which the Kühl-Stevens Kéro-Russian Art Museum has grown with the breadth and depth of its collections in museums and small spaces around the world. Over the last twenty years, Könitz-Stevens has opened up a new kind of gallery space in London, which has enabled a remarkable range of artists to collaborate and", "The next Biennial should be held in 2022. The current thirty-three-year cycle for the exhibition consists of the exhibition of work by forty artists. “The Future is Present,” the artists wrote in their statement. “As a collective, we are frustrated that we have had to attempt to present this work in spite of our various personal and professional commitments. . . . What we have achieved has been an attempt to present the pain of suffering, our shared responsibility for creating the conditions for suffering. Based on a critique of the present, the future is present: an attempt to find ways to support, care for, educate, and celebrate the pain and suffering of other people.”The exhibition will continue on with work by forty artists by the same curators, in collaboration with the same architects, in the same venue, in the same year, in the same place, in the same city, in the same country, for the next thirty-three years. The exhibition schedule will be updated by the artist-in-residence , Laura Owens, from a list of twenty artists curated by her.Joanna Böhm will serve as the cofounder and president of the Biennial, which will occur in the same city, in the", "The next Biennial should take place in 2024 at the Museo de Arte Contemporáneo Brasil and should reveal its theme, “Cultural Freedom and the Struggle for Democracy,” and its purpose, “Abandon the State.” The twenty-eighth edition of the exhibition will be held at the Museo de Arte Contemporáneo Brasil in São Paulo from November 21 to December 22.\n\n\nNew York’s Metropolitan Museum of Art (MoMA) is renaming the museum’s headquarters after an African American artist and educator who championed the civil rights and Black power movements. The metro’s new campus will feature a new work by the artist, a new performance series by the artist, and an installation by the artist.The museum will also introduce a new evening program dedicated to “African American art and culture,” titled “African Art and Black Culture.” The program will feature three works by New Orleans-born artist Warren B. Jones, who was active in both the civil rights and Black Power movements, including his famous “Black Panther” painting, 1961, which begins with a group of Black Power activists chanting,", "The next Biennial should be held in 2021.\n\n\nThe museum has received a gift of ninety-three photographs by American photographer Placido Domingo—all of which were on display on the Italian studio’s first public exhibition at the historic Museo di Ricardo 1930 in Rome in May 2015. The works, which were among the first printed in America, were donated by a group of collectors led by Leonardo Bicchi and Stefano De Medici, who acquired the works from a mausoleum in the Vatican city in the 1990s.The institution also announced that Zanelli and de Balanta will become the inaugural directors of the new exhibition space MOSCAT, which will be inaugurated in the capital in November. The inauguration ceremony will take place at the Palazzo Nazionale di Rivoli in Rome on January 17.\n\n\nMOSCAT, a nonprofit arts space in Rome, has appointed Fabio Bertotti as the new artistic director. Bertotti will be the first to lead the institution since directorate head Alberto Arcimboldi stepped down in February 2019 to head the Metropolitan Museum of Art in New York. During his tenure, Bertotti spearheaded the expansion of the museum and helped create a new programming center for", "The next Biennial should be held in 2020; the museum will then have twelve years to determine the optimal size of the exhibition, with a maximum of ten years of curatorial experience. The event will be hosted at the Museo de Arte Contemporáneo in the capital of Madrid, rather than at the local branch of the museum.Museums in the city of Aragón in southern Spain have recently been under scrutiny for their exhibition-buying habits. In a protest outside the Arte Povera exhibition in April 2018, collectors and collectors’ supporters wore masks and made signs with their faces. The exhibition was eventually canceled and the schools closed until April 2019. The third edition of the Los Angeles Biennial, set to take place at the Los Angeles County Museum of Art (LACMA), will be held at the LAX Museum of Art in 2020. \n\n\nThe founder and former CEO of the cosmetics company L'Oréal, François Pinault, was sentenced to eighteen months in prison and fined $18 million in a New York federal court today for embezzling $50 million from the company between 1998 and 2004, reports Artnet. The restitution order was made after the jury found him guilty of", "The next Biennial should take place in the spring of 2021. The exhibition will feature more than four thousand works from around the world. The fair’s board of directors, which comprises a number of artists, said that the decision to hold the event in the spring was made “independently of the decision to move forward with the new exhibition.”\n\n\nThe Los Angeles County Museum of Art (LACMA) has announced that it will no longer invite Benjamin Harnwell, a British artist whose practice encompasses installation, performance, and sculpture, to its spring 2021 event. According to the Los Angeles Times, the museum’s artistic director, Marc-Olivier de la Peinture, informed the artist that the decision was mutual, and that the institution must “drastically change its trajectory.” The change is necessary, de la Peinture said, since the institution does not have the means to stage the exhibition on its own. While the institution is currently working on a new exhibition, “The Crooked Tree: The Art of Drawing and Painting” (2019), the work, which is currently on view until March 21, 2019, will be completely different.“In order to", "The next Biennial should be held in 2021, and the first biennial in 2022. The 2019 event took place in New Delhi.  The 2019 edition, which was organized by the Indian art and culture ministry, featured works by forty-six artists, including Amitabh Bachchan, Vasudeva Giri, Arashaghar Keshavan, and Ramesh Khilji.  The 2020 edition, which will be hosted by the Sameer Anand Gallery in Mumbai, will kick off on November 20. Marking the occasion, the exhibition will include artwork from fifty-two artists, including Haridwar Bikram, Nandini Gaudiya, and Nanda Ramchandani. The list of participating artists will also include three from Sri Lanka, two from South Africa, and one each from India and Pakistan.The exhibition will also introduce the Biennial “Gift of Thee,” a new virtual experience that will allow visitors to experience the exhibition in a virtual space. Biennial Giver will be located at the Sameer Anand Gallery, in Mumbai, and will launch on November 20. “Our vision is to create a platform for artists to engage with the vitality of India’s", "The next Biennial should be held in January 2021. The next edition of the Museum Biennale will take place in March 2021.\n\n\nThe Institute of Contemporary Art (ICA) in Chicago has appointed John Michael Mitchell as its next director. Mitchell arrives in the city from the Chicago Arts Institute (CAAI), where he has served in a senior role since 2016. He succeeds Michael Burke, who retired in July 2019 after seventeen years at the helm of the museum.“John’s background and expertise in urban design and the arts and his ability to integrate the ICA’s collections and programs in a way that is diverse and innovative makes him the perfect person to take the helm of the ICA,” Burke said in a statement.“I am excited to see where the ICA goes next and to witness the impact of John’s ambitious vision, particularly as he develops a more curatorial approach to exhibitions and presentations in the future.”The ICA is currently working on a redesign that will include the renovation of the ICA’s current headquarters in the same building as the museum, which will add more than 1,300 square feet of exhibition space and a café to the museum’s already well", "The next Biennial should have a shortlisted artist from each of the five participating countries, with the winner selected by a jury comprising five artists and a curator from each country.\n\nThe Biennial will be held at the National Museum of Fine Arts (MoFA), Beijing; the National Museum of Fine Arts, Beijing; and the Cultural Revolution Museum, Beijing. The first event, a 2016 show curated by Chen Jie, director of the National Museum of Fine Arts, Beijing, was shut down after a fire raged in a closet in the institution last year. The exhibit “Re: Zero: Art and the Future of Matter” was scheduled to go on hiatus until 2022. The show was supposed to premiere in September 2019, but the event was postponed due to the Covid-19 pandemic.The upcoming event “HALF-NINE: LIVE,” a biennial of live performance, has yet to be announced.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has issued a final guidance for the fifty-third edition of the DCLA. The exhibition, which opened on October 27, 2019 and runs through February 25, 2020, will remain closed through March 8, 2020,", "The next Biennial should address the racialization of filmmaking and the Black experience in general, and perhaps the Black Lives Matter movement in particular. The second, titled “The Importance of an Affair,” will focus on the memory of Louis Farrakhan and his followers and will take the audience inside of the Alamo’s compound.\n\n\nUkraine’s National Centre for Contemporary Arts (NADA) is cutting nearly one hundred positions in its artistic program amid concerns over the crisis in Crimea, where a Russian military base has been constructed and pro-Moscow protests are ongoing.According to the Art Newspaper, the cuts are part of a planned $73.5 million revamp of the institution, which was established in 1992 as part of the Ukrainian government’s plan to modernize the Soviet-era museum complex in the city of Lvov. The construction of the new facility, which is being funded by the Russian Ministry of Culture, has been estimated at $30 million.The changes to NADA’s program were announced by Ministry of Culture and Arts director Andriy Shevchenko, who said: “We are facing a new epoch, a new era, in Ukraine. We need to think of how to", "The next Biennial should be held in 2021. The 2017 event was held at the National Museum of Contemporary Art in Washington, DC, and attracted a worldwide audience of 40,000 people.\n\n\nThe Ballet Theater Company in New York has appointed Loring Randolph as its next president and CEO. Randolph joins the company from the New American Opera, where she has been principal artistic director since 2016. Previously, she served as head of its New York branch, beginning in 2017, and previously, she worked as an assistant principal, principal choreographer, and artistic director of the Brooklyn-based company Public Theater.“Loring’s deep experience and leadership qualities make her a strong leader for the Ballet,” said company founder Daniel Handler. “We are fortunate to have her as an integral member of the company, and to be able to welcome her back to the company. She is ideal for the role, as she represents an excellent combination of vision and energy. She is passionate about bringing the company and the arts to new audiences and about creating opportunities to support artists. I am confident she will continue to create a robust and original performance experience for the company and the audience, while expanding and refining our international network of collaborators.”Prior to joining", "The next Biennial should be held at the São Paulo-Brussels International Film Festival, and, according to a release, the event will be a “wake up call for the world.”\n\n\nVancouver’s Raincoats, a contemporary art organization that focuses on supporting marginalized and under-recognized Canadian artists, has announced that Natalie Sobejano has been appointed as its new board chair. Sobejano, who recently relocated to Vancouver from New York, will be responsible for steering the organization through a transition period as it prepares for its 2019–20 season.“I’m very excited to be working with Natalie,” said Raincoats artistic director Chris Fries. “Over the last few years, her work has been critical in helping us establish the Raincoats as a platform for artists who are marginalized and underrepresented in the art world.”Fries added that the organization hopes that Sobejano’s experience and expertise will “provide a model for how we can support and support artists across Canada, encourage their practice, support their livelihoods, and support our mission.”\n\n\nThe Institute of Contemporary Arts (ICA) at the University of Cambridge", "The next Biennial should take place in 2021. The institution also recently celebrated its fiftieth anniversary. The first edition, held in New York in 1966, featured work by sixty artists. The following year, the institution hosted its first exhibition of work by a single artist, the open-concept work Maggie and Nelson, which was exhibited in a lecture series organized by artist Jen Parrott.Since its inception, the Biennial has given more than five hundred artists a platform to engage with New York City through exhibitions and residencies. In addition to the annual event, the Biennial also hosts a number of major public events, including the Philharmonic Ball, the Museum of Modern Art’s “Curator” Program, and the Museum of Contemporary Art New York. The Metropolitan Museum of Art’s triennial “The Other†” (August 2018–March 2020) will conclude its run on June 30, 2020. The final exhibition was curated by Richard Avedon (October 2019–October 2020). \n\n\nThe Museum of Modern Art in New York has appointed Mary Cosmo as its new deputy director for collections and exhibitions. She succeeds Sarah Casolari, who left the institution in December 2019 to", "The next Biennial should bring together artists and scientists from different disciplines and should focus on the enrichment of the public in the city of Biennials, its artists and the city of science, with the upcoming exhibition of the work of the artist Humberto Cervantes on the third floor of the National Museum of Contemporary Art in Rome. \n\n\nFrieze has announced that it plans to invest $1 billion into its creative and performance areas over the next five years, creating the largest global artist-run incubator program. The investment is part of a new strategy for the global entertainment industry, aimed at tackling the challenges posed by the coronavirus and creating new opportunities for arts professionals.“We are transforming how we do business, creating new opportunities and new ways for artists to collaborate\u0097and of course, creating new programs, new events, new marketing, new partnerships, and new audiences,” said Molly Shaw, president of Frieze. “These are challenging times, and we are ready to support artists and think strategically about how we help them to thrive, at the intersection of science and art, science and culture, art and science, and culture,”Shaw added. The investments will be made in new research and initiatives that", "The next Biennial should be held in 2021. \n\n\nThe Yuz Museum Tokyo is planning to open a new exhibition dedicated to the Japanese artist and designer Dadaist, Ikuko Yoshida (1896–1973). The project, titled Dadaism and Modern Life, is expected to open in December of 2021.One hundred contemporary Japanese artists will participate in the exhibition, which will tour the Yuz Museum’s collection, from January 17 to January 19, 2022. The show will be organized amid ongoing construction on the museum’s new building, which will be completed in 2021.According to Artnews, the new exhibition “provides a unique entry point for the collection, which is currently housed in a museum, and an opportunity to see the work of present day artists, and to bring them together in a new context.”Former director Tadao Ando, who helmed the museum since 2003, said: “No one has ever conducted a major exhibition like this, and it’s a tremendous task for the staff. The show will benefit from a strong team, strong resources, and a dedication to art by a select group of artists, and will be a real milestone for the museum.”\n\n", "The next Biennial should be announced as soon as possible.\n\n\nThe Pérez Art Museum in Madrid has received a gift of fifty rare photographs by Pablo Picasso, Arnold Büchner, and Pierre-Auguste Renoir. The works, which were purchased by the institution in 2006 and 2006 respectively, were on display in a group show that opened on Thursday, February 28. The show runs through April 24.“We are extremely delighted to be able to present these works in the Pérez Art Museum,” said José Manuel Pérez. “We are particularly pleased to present the works in the exhibition ‘Pablo Picasso: The Other Picasso’s Picture,’ 2015–2020, one of the earliest works by the artist to enter the collection and one of the most commonly viewed works in the country.”The works were donated by artist Arne Glimcher, who is known for his collaboration projects with the artist’s descendants, and Pablo Picasso’s brother Rino, who is the general director of the Picasso family collection. Rino and Pablo Picasso are currently collaborating on a new collection exhibition that will take place in 2020 at the Museo de Arte Cont", "The next Biennial should take place at the Museum of Contemporary Art (MoCA) in Los Angeles in 2021.  The third edition of the Ong-Amagi Biennial will take place at the Museum of Modern Art (MoMA) in New York in 2030. The fourth and final edition of the Ong-Amagi Biennial will be held at the Museum of Contemporary Art (MoCA) in Seoul in 2020, and the best-selling book Clubbed: Contemporary Art in Tokyo, which was published by the Korean publisher Danshukwa Seoul, will be presented at the Museum of Contemporary Art (MoCA) in 2021. \n\n\nThe National Gallery in London has appointed Deborah Rutter as the next director of the National Maritime Museum (NM). In her new role, Rutter will be responsible for managing the museum’s artistic, educational, and commercial projects in the East End and will report to the institution’s board of trustees. “Deborah brings a wealth of experience in both the commercial and curatorial sectors, and we are confident that she will complement the strengths of the National Maritime Museum in providing a strong platform for the museum’s art, design, and design-forward exhibitions, as well as further", "The next Biennial should be held at the new UCLA Art of the Deal, a university-wide platform launched by the university in 2012 to help establish a new generation of Fellows. The theme of the event will be “How do we live together within and without?”“I have been a supporter of the Biennial since it was first launched in 2000,” said UCLA Art of the Deal director Amy Talbot. “I am thrilled that the Biennial will continue to thrive by bringing together the best of contemporary art and the most current exhibitions and programs in the United States. I’m confident that this year’s Biennial will continue to be a platform for the artists who are most passionate about the collection and the exhibition design that is at the heart of the Biennial.”The first edition of the biennial, “Arts of Change,” which closed on December 18, 2019, drew 1,600 visitors from fifty countries. The annual event, which honors and showcases the work of underrecognized and underrepresented artists and is organized by the UCLA Art of the Deal, has hosted artists from forty countries. The twenty-fifth iteration, “The Architecture of Destruction,” opened on September", "The next Biennial should be held in 2021. Arts and Culture Secretary Pia Camil, who was nominated by former prime minister José \"Pepe\" Muñoz, said: “This is a moment of great change, one of the most important since the beginning of our country’s history. We must take it in good faith and create for the future an environment of openness and collaboration.”\n\n\nThe National Museum of Contemporary Art (MoCA) in New York has issued a new set of guidelines for how art institutions should handle controversial works by controversial figures, including Frank Gehry and the late sculptor Dietrich Hegge, who are currently up for reopening. The guidelines state that museums should not present controversial works in their permanent collections unless there is a “clear and compelling public interest” and that they should “not perpetuate the [famously] dangerous idea that art can or can’t hurt people.”The guidelines also outline how institutions should handle confrontations between colleagues and students, a point made by several former MoCA staffers in an open letter signed by 140 current and former employees. “We believe that the decision to remove a work from our collection should not be made without first", "The next Biennial should be held in 2021, the year of my grandmother�s eighty-sixth birthday. I hope that this year’s biennial will also be remembered for the important contribution it made to the field of American Indian Studies. \n\n\nThe National Gallery of Canada has appointed Christine Lee as its new deputy director for collections and exhibitions. Lee comes to the institution from the Council of Canadians, an interdisciplinary organization of renowned Canadian art historians, economists, and curators. Lee comes to the institution from the Council of Canadians, an interdisciplinary organization of renowned Canadian art historians, economists, and curators. She succeeds Darren Lightfoot, who helped lead the National Gallery of Canada for twenty-two years and will continue to serve as its director and chief curator.“Christine brings with her more than thirty years of experience in museums and has developed new ways for the National Gallery of Canada to engage directly with Canadian heritage and contemporary art,” said Lightfoot. She succeeds Catherine Nichols, who became the National Gallery of Canada’s director of contemporary art after she assumed the position in June 2019.“I’m really excited to be working with Christine,” said Lightfoot. “Christine is", "The next Biennial should begin in January 2020 and be held at least once a year.  “I’m excited to work with artists and institutions to promote the work of our biennial’s next iteration, which will be ... more\n\n\nThe Louvre in Paris has suspended construction of a new work by French artist Gilles Janot, who created works that examine the boundaries between life and death, and is instead working on a new monograph on life and death\u0097the Louvre has confirmed. A preview of Janot’s new work, titled Bodily Possibilities, will be presented at the exhibition “Amélie:  Bodily Possibilities, September 2019,” which will reopen in February 2020.Janot, a prolific painter who lived and worked in Paris from 1970 to 1984, is known for his abstract and racy paintings that often feature humanoid figures such as a man, a woman, and multiple figures of women and animal forms. The work of Janot is often criticized for his obsession with death and the symbolic, as in his stunning 1965 work Bodily Possibilities (Grotesque), which features grotesque corpses and the naked bodies of women and children.The Louvre told the", "The next Biennial should focus on how art history historians have historically and currently address the new challenges posed by digital technologies. The second, which will focus on how art history is organized in an increasingly connected world, will take place in 2020.Museum director Christine M. Ibrahim said in a statement: “We are thrilled to be back at the following location: a truly unique and important hub of art history in the Americas. Our vision for the future of MATA is to use the existing foundation to present a truly ambitious exhibition that will address the current challenges of the exhibition program in an engaging and visionary way.”\n\n\nThe Institute of Contemporary Art (ICA) at the University of Pennsylvania has appointed Stephanie Karr as its new executive director. Karr will be responsible for the development and execution of the Philadelphia-based nonprofit museum’s programming and will assume her responsibilities on January 11, 2021.“After careful consideration, the ICA Board of Trustees determined that Stephanie Karr is the person to lead the ICA and is eager to welcome her to the ICA family,” said board president David Hart. “We especially welcome her to the ICA as we work toward our first exhibition in the city of Philadelphia since 1995. The", "The next Biennial should be held in 2022.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, has added a new title to its official website: Biennale of Los Angeles. The project was initiated by the Los Angeles County Museum of Art (LACMA) and is funded by the $20 million Fred Wilkins Foundation. The megachurch, which also operates a museum in Santa Monica, is collaborating with the Museum of Contemporary Art in San Diego, which is also currently constructing a new home for its collection.“This new title reflects the breadth and depth of the Los Angeles County Museum of Art’s collection,” David Littman, the director of LACMA, told Artnet. “It is a great honor and delight to add yet another spectacular collection to our website, one that truly reflects the thriving spirit and diversity of the city.”The new title, “The Biennale of Los Angeles,” will debut on the museum’s website on January 28, 2020 and will run concurrently with the museum’s upcoming exhibition “Los Angeles: From Here to Infinity” and the museum’s inaugural year in 2019.\n\n\nThe British Museum", "The next Biennial should take place in 2020. The museum is currently considering a 2020-20, but likely an older, model of exhibition.\n\n\nThe American Folk Art Museum (AFM) in New York has appointed Diana Ross as its next executive director. Ross will be responsible for spearheading the museum’s artistic program, overseeing acquisitions and curating exhibitions; developing communications and public engagement strategies for its exhibitions and programs, and overseeing programming and development for the museum’s collection and exhibitions.“Diana’s vision and energy is unparalleled, and we are very excited to see where she takes the museum next,” said Michael L. Levin, chair of the museum’s board of trustees. “Over the last decade, she has established the museum’s reputation for innovation and thought leadership in presenting a vibrant and exciting vision for the future, as exemplified by the renovation of the museum and the acquisition of an amazing collection. We are confident that she will continue to lead the museum toward its ambitious goals and to shape its future through her extensive experience and vision. We welcome her to the museum and look forward to working with her.”Prior to joining the museum in 1997 as a curator of American art, Ross", "The next Biennial should focus on “Theoretical Feminist Theory and Feminist Architecture,” and should address questions of “Aesthetic Representation,” “Power Systems,” and “Artist-Work and Feminist Art.”\n\n\nThe German federal state of North Rhine-Westphalia (Federal Republic of Germany) has announced that it will begin allowing mass demonstrations in support of the Black Lives Matter (BLM) movement across the country. According to the New York Times, the move was made in response to days of violent protests against the death of George Floyd, a black man who was killed by a white police officer on Monday. Protesters have since used social media to call for the state to provide more resources to local police forces.On Wednesday, Chancellor Horst Seehofer declared that protests against racism and police brutality had reached a “tipping point” that needed to be stopped. “We must reach out to people with our communities and understand their problems,” he said. As protests spread across the United States, activists have used social media to organize demonstrations against police brutality, the Trans-Pacific Partnership, and other issues. On Thursday, thousands marched in Washington, DC, in support of", "The next Biennial should be held in 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Steven Chiu as its new deputy director for collections and exhibitions. Chiu comes to the institution from the San Francisco Museum of Modern Art (SFMoMA) where he has served as deputy director since September 2020.During his tenure, Chiu has organized more than twenty exhibitions in the United States and has helped shape the museum’s collection strategy. During his tenure, Chiu also established the Computer Art Museum, which has hosted significant exhibitions such as “The Computer Art Museum: How Machines and Information Interlocked” (2017) and “The Computer Art Museum: Part 2” (2019), as well as the Corning Museum of Art’s “Computer Art Gallery” and “Brain Tumor” (2013).Chiu succeeds Mark Judge, who was hired as deputy director in March 2019, and will take up the post in January 2021.“The future of the biennial is very bright,” said Chiu. “We are very excited to see where the curatorial team and staff are heading and have tremendous confidence in their ability to execute an exciting exhibition each", "The next Biennial should be held in Tokyo in the spring of 2022. The 2020 iteration, titled Biennale de Lyon, kicked off in April and ran for eight months. The 2020 exhibition was organized by Marina Inoue and represented the works of sixty-two artists. Among the new works unveiled are works by Fatosoro (1948), Yoshitomo Yamanashi (1948), Kumihiko Saito (1948), Max Ernst (1948), Kiko Kondo (1948), Yoshitomo Takeda (1948), and Kissimmee Ko (1948).\n\n\nThe UW–Madison Art Museum has acquired the collection of three early twentieth-century American artists, Alice Aycock, Mary Ellen Mark and Julia Nocito. The collection, which includes paintings and sculptures by Annie Chesney, John Edmonds, and Joseph and Rosalind Franklin, will be installed in a new exhibition, “Alice Aycock: Early Modernism” at the museum.Echoing the work of contemporary artists such as Ed Ruscha, George Eliot, and Ezra Pound, the show will highlight the work of three early", "The next Biennial should take place at the Carnegie Museum of Art, in Pittsburgh, in 2021, and be presented by the National Endowment for the Arts (NEA). The theme should be “The Future of Life on Earth” and will be curated by Harriette Schroth, director of the John D. and Catherine T. MacArthur Foundation; David Yergin, director of the Center for Advanced Study in the Visual Arts at the University of Pennsylvania, Philadelphia; and David Neuman, director of the Museum of Folk Art, New York.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has announced that it is planning to open an outpost in the city on January 23, 2021, in a building that includes a gallery, a museum, and an office. The twenty-nine-thousand-square-foot facility will be built on the same site as an existing arts and culture complex and will serve as a space for exhibition, education, and research.“The construction of MoCA, a cultural hub that connects communities and inspires, advances, and enriches the arts, is the kind of project that we have been working toward for decades,” said David Lassen, chairman of the", "The next Biennial should take place in 2020. In the meantime, a public exhibition of the work of artist Humberto Yuille, which will be staged at the Institut des Arts et Lettres in Paris in 2021, is currently on view until March 7.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is planning to move the four remaining works by the late Japanese sculptor Masahiro Enoki to a new home in Tokyo, after the institution found it uneconomical to store them in its warehouse spaces. The move will allow MoCA to create a new exhibition space dedicated to Enoki’s work, entitled “The Present Illusion,” and will also allow the museum to expand its holdings of Enoki’s work and open a new exhibition dedicated to the artist in 2020.The move, which has been in the works for months, has been in the works of MoCA staff for months, but the announcement of the expansion—which would add three new works, three of which were signed by Enoki—was made on June 10, the day that MoCA’s next edition of the “Masaru Enoki: Work in Progress,” will open in the Japanese capital", "The next Biennial should be held in 2022. The theme of the twenty-third edition of the Prize is “Displacement and the Art of Being.” In the past, the award has been given out for works that “challenge the contours of the distinctive culture of an emerging region,” and the first prize winners were Steven Slaug, Germany; and Tarkir, Scotland. The Prize will also include a biennial of contemporary art in northern India, a design competition in Sri Lanka, and a symposium on art from the east coast of China.\n\n\nThe Smithsonian American Art Museum (SAAM) in Washington, DC, has appointed Laura Henry as its next director. Henry comes to the institution from the New Museum, where she has served as associate director of curatorial affairs since 2015. She succeeds Carolyn Benning, who has helmed the institution since 2011, and will take up her new post on January 21.“Laura has been a strong advocate for American art and scholarship for more than a decade, championing the careers of artists such as Mariner Kemper and Cesar Condé, and fostering partnerships between the Smithsonian and the Metropolitan Museum of Art, the Library of Congress", "The next Biennial should take place at the University of California, Berkeley, in the fall of 2021. The third edition will be held at the Museo del Barrio, in Madrid, in March 2024. The fourth edition will be held at the Museo del Barrio, Madrid, in June 2024.The fifth edition will be held at the Museo del Barrio, Madrid, in October 2024. The sixth edition will be held at the Museo do Povo, in Lisbon, in October 2024. The seventh edition will be held in April of 2020. The eighth edition will be held in April of 2020.  The twelve-year, $150 million edition, slated to open in March 2021, is now on hold. According to the Los Angeles Times, the organizers are currently working on a new contract for the festival. \n\n\nThe Museum of Fine Arts (MFA) in Atlanta has welcomed three new members to its board of trustees: artist and activist Vinnie Bagwell, who has been an MFA board member since 2000, and artist and philanthropist Tamara Henry, who has served on the board since 2010. Henry is the founder of the Tamara Henry Foundation and has been a trustee since 2007.�", "The next Biennial should focus on the physical and visual spaces within the Biennial, as well as transdisciplinary research and the exhibition of the project “On Life and the Future.” The new exhibition will open on January 23 and will run until February 24.The biennial will include a selection of works by twenty-six artists including Sina Khan-Ali, Zineb Sedira, and Kinsana Maruf, among others from the Middle East and North Africa. The New Orleans-based artist has also designed the Modern Life series, which offers contemporary art from Africa and the Middle East. The exhibition will mark the first time the eighteen-year-old artist will be presented in New Orleans. The exhibition was established by the Center for Contemporary Art at the University of New Orleans (CAAU), a partnership between the university and the architecturally-inspired nonprofit organization the National Endowment for the Arts (NEA), to raise funds for the University of New Orleans (UNO), which is working on a $55 million renovation and expansion of its campus and has received $40 million from the city of New Orleans.\n\n\nThe Art Newspaper, an online publication focusing on contemporary art, has announced that it is launching a new digital initiative", "The next Biennial should take place in the spring of 2022, with a new theme: “Museum-Built Communities,” a departure from the biennial’s long-standing theme of the preservation and restoration of the museum, which was first introduced in 1963. According to the institution, the new theme will “open up new possibilities regarding the museum: the museum can become a symbol of the past, a conduit for the future.” The full list of participating artists is as follows:Jesus Campos, ChileBenedict Estrada, BoliviaBrian Fitzpatrick, USRobert Hunter, USAndrew Kreps, USNicole Schubert, USHans-Ulrich Roeckse, GermanyBibi Ropac, USCarlotta Tersk, ItalyAnna-Marie Teren, ChileBertrand de Terret, FranceBianca Rodrigo, USBermuda/US, MexicoBijan S | Markus Schöne, NetherlandsBéla Sarr, USBibi Simon, BrazilBrenda Devlin, USCara Zarraga, USCara Zingaretti, US, MexicoAidan Armstrong, US, NetherlandsAndrew Kreps, US, UKBibi Clavel", "The next Biennial should be held at the Museum of Contemporary Art, in the fall of 2020. When: September 19–September 21, 2020.  The winner of the 2020 prize, which is an honor given by the Museum of Contemporary Art and the National Gallery of Art in Washington, DC, will be announced shortly.  The 2020 prize will be presented once a year at a date to be determined by the Museum. The 2019 prize will be presented at the Museum of Contemporary Art, Los Angeles, in 2020. Members of the jury will be chosen by a panel of judges composed of John Vidal, director of the Association for Public Art; Patricia Sanborn, artistic director of the gallery Marfa; and Kip Thorne, president and CEO of the National Sculpture Garden in Nashville. A selection of seventy artists will also be featured in the 2019 prize, which was established in 2017 by the Association of Art Museum Directors to recognize the cultural and social contributions made by museum professionals. The jurors will be chosen by the Association through a public competition, and the full list of artists is as follows: Sarah Cheim & Amy Strom, Theater Sarah Cutler, Laundromat, London (Completed", "The next Biennial should be held in 2020. The venue has yet to announce an opening date.\n\n\nThe Phoenix Art Museum (PMA) in Arizona has welcomed back seven artists from exile following a long hiatus due to the Covid-19 pandemic. The returnees are Renata Tezak, Alejandro Burri, Hélio Oiticica, Max Hetzler, and Miriam Gonzalez-Barosa.They are the second groups of artists to return from exile since the pandemic began in late March, following a group show at the museum in January. The first group, formed in 2012, included students from the schools of Arizona State University (ASU) and the University of Arizona.The institution announced in January that it was extending the artists' exile by two years, citing the need to give the artists more time to think about their futures and to plan for the future. As a result, the exhibition “Take Me Home,” a retrospective of twenty-five works by the students, will open in the spring of 2021. The exhibition, which was organized by the students themselves, will be curated by Pei Lu, the director of the Arizona State University Art Gallery.“The return of these seven artists is a", "The next Biennial should be titled Celebrating the Contemporary, and should take place in the city of Toronto in the autumn of 2021. The program will include a virtual reality exhibition, Art and Surrealism in the Twenty-First Century, and an open-studio day. The biennial will be followed by a series of public programs that will address issues of sustainability and social justice across the city’s arts and cultural institutions. Earlier this year, the city commissioned artist Vincent van Gogh to create a new work, in the hopes that the piece will inspire and bring together people from various backgrounds to create a work of contribution to the community.\n\n\nThe National Gallery of Canada has announced the nominations for its next awards, which will honor Canadian artists and will debut at the National Museum of Canadian Art in Ottawa in March 2019. The museum will have the opportunity to choose five nominees, which will be announced in June, and is accepting nominations from artists from across Canada and the United States.The winners are as follows:Hannah Black, The Good Fight (North America) (Lincoln, Nebraska) (Moonton, New Brunswick) (Pleasantville, New Mexico) (Danny Man, Ottawa, Canada", "The next Biennial should take place in 2022 and the date of the exhibition will be revealed. \n\n\nEbony & Art, New York: The first major solo exhibition (under the direction of Joan Brown, with work by John Currin, in collaboration with artist-collector Debra Brown) at the institution, founded in 1974 by the Philadelphia-based architect Frank Gehry, has been canceled. According to Artnet, the show was scheduled to run from February 19 to February 21, 2019. “Joan Brown was the master of the contemporary,” wrote Frank Colangelo in a review in the March 2019 issue of Artforum. “Her work is widely regarded as the best work of her generation, and her influence remains felt in the current state of American art.”The 2020 event, titled “Between the Sun and the Moon,” will now be held at the Center for European Art, which also comprises Paul Gauguin’s Institute of Modern Art, Jeanne-Claude’s Louvre, the National Gallery of Art, the Metropolitan Museum of Art, the Museum of Modern Art in Washington, DC, and the Museo de Arte Contemporáneo de Sao Paulo", "The next Biennial should be held in 2021 and will be titled “Beyond Beauty.” Biennial organizers have stated that the event will focus on how art can “counter the rise of fascism, counter racism, and counter sexism.”\n\n\nThe Flemish government granted the Museum of Fine Arts (MFA) in Kassel the official designation of a cultural monument today. The landmark decision, which was made by the federal government, comes amid a political crisis for the Flemish state, which is currently embroiled in a coalition with the Christian Social Union (CSU) and has been battling to establish a new governing coalition government. According to the Washington Post, the coalition government’s platform includes cuts to arts funding, tax breaks for large corporations, and austerity measures, such as a tax on financial transactions.The government’s plan, which was met with outrage by arts organizations, has led to protests and a strike at the museum in the past few weeks—students, staff, and museum director Alexandra Strand—and has also led to the resignation of several parliament members. The strike was canceled last week, but the cancellations have continued into this week. The government is still facing backlash over the budget cuts, which are", "The next Biennial should take place at the new site in 2022.The exhibition will also inaugurate the new museum, which will be completed in 2020.\n\n\nThe Turner Prize announced today twenty-five artists whose work is currently under consideration for inclusion in the 2019 biennial. The selections were made by curators Haig Wightman and Sianne Vallance and were presented at a ceremony at the Turner Prize in London on Monday. “For nearly fifty years, the Turner Prize has been an important platform for the work of artists whose work is currently at risk of being excluded from the biennial, particularly in the context of their greatest achievements,” said Haig Wightman. “It is impossible to imagine a biennial without these five artists. Their work has changed the trajectory of the biennial and their future work is sure to depend on their participation.”Over the years, the artists have won nearly every award available, including the Turner Prize, the Royal Academy of Arts, the National Galleries of Scotland, the National Poetry Slam, and the National Film Festival. The judges were Holly Hendry, Bill Rennie, David Sexton, and Phil Collins.\n\n\nThe Museum of Jewish Heritage (MoJ)", "The next Biennial should take place in 2020.\n\n\nOn Saturday, July 8, the Museum of Contemporary Art (MoCA) in New York City revealed that it will discontinue the 2017–18 season, which was set to kick off on July 16 and run through July 21. The exhibition, “The State of Art in the Museum of Modern Art” (tmov), featured pieces by ninety-four artists, including Jack Whitten, Willem de Kooning, David H. Russell, and Peter Dreher, as well as a selection of works by contemporary artists such as Georges Apost and Alice Aycock.The club will also begin welcoming visitors back to the institution from August 1, when the exhibition will officially reopen. The date of the show is also a reminder that the institution is currently closed until at least late July due to the Covid-19 pandemic. “The body of work that we have created so far this year is remarkable, and we are incredibly proud of having pioneered new mediums for exploring the work of our artists in the upcoming exhibition,” said Joshua L. Gilbert, director and CEO of MoCA. “This exhibition, and the work of the artists who participated in it, was", "The next Biennial should take place in 2022. At that point, a selection of the selected works and their exhibitions will travel to the new location. The exhibition will then have a new program of biennial presentations and performances, curated by local professionals and supported by local partners, to complement the themes of the previous two events; and the biennial will return to New York City for the first time in 2019. Dr. Kahl, who was appointed as biennial director in February, said: “I cannot overstate how important this is to the artists who have chosen to participate in this decade-long celebration of their artistic legacy. . . . The Biennial will not be the same the second time around. I have been working since 2015 to plan the best possible venue for the unprecedented exhibition program to begin at the Museum of Modern Art in 2021 and the two-year project schedule that will allow for an immediate return to New York City in 2022.”\n\n\nThe Museum of Fine Arts (MFA) in Boston is preparing to welcome visitors back to its campus once the coronavirus is contained. In a statement provided to Boston.com, the museum confirmed that it is “working closely with our health and safety experts and the federal and", "The next Biennial should take place in 2021.Merry White, president of the museum, said: “We're excited to welcome the working and emerging artists to the Biennial, which is built upon a strong, innovative and global history of innovative exhibitions and educational programs. The upcoming highlights include a new Digital Archive, curated by the Museum of Contemporary Art, and a celebration of the first-ever biennial at the Allen Memorial Art Museum.”\n\n\nThe Metropolitan Museum of Art in New York has hired Jen Gilly, a curator and art historian, as its new deputy director for collections and exhibitions. Gilly will be responsible for guiding the museum through the final stages of its planned expansion, which is expected to bring new galleries, new public programs, and new exhibitions.“The expansion aims to support the museum’s international mission, improve access to the museum, and create new opportunities for visitors to experience the Allen Institute,” said director Daniel H. Weiss. “It is a monumental undertaking, and one that will require the museum to rethink the design and exhibition experience in order to make it more accessible to a broader audience.”Gilly will assume her new role on August 2. In her new role, Gilly", "The next Biennial should take place in 2021. If successful, the exhibition will deliver a new work by a selected group of British artists. The artists chosen for the exhibition include John Akomfrah, Kieran Armstrong, Michael Booth, Yannis Hamlisch, and Adam Curtis.\n\n\nAfter a series of missteps at New York’s Museum of Modern Art (MoMA) over the years, the institution has hired Kenneth Feinberg, a managing director at the investment firm BlackRock, to lead the museum’s new $650 million Modern Art Museum, which will open in 2022. In his new role, which is funded by a gift from the Koch brothers, Feinberg will work closely with director Max Hollein and other members of the museum’s board to promote the exhibition program and the public’s understanding of contemporary art. He will take up the post on January 29.“At this moment of great uncertainty for our culture, we are grateful to the Koch brothers and the entire board for the opportunity to support and advance the museum,” said James Murdoch, chairman and CEO of 21st Century Fox. “Together, they have created a museum that is focused on the art of the present, with a mission", "The next Biennial should be held in 2020, with the next will take place in 2022.  The partnership between the Biennial and the Museum of Modern Art (MoMA) is not new. However, in 2013, the museum began hosting an annual exhibition in the city instead of partnering with the institution. The exhibition, “Theatres: Art in Motion” was organized in partnership with the artists participating in the exhibition, and attracted nearly 80,000 visitors.In an attempt to diversify its programming, the museum also announced that it will stage a retrospective of the French artist Jules and Isolde’s The Yellow Room in 2021. \n\n\nThe Victorian Museum of Art (VMA) in Melbourne has appointed Linda Miles as its new director. Miles will take the helm of the Victorian from Andrew Scoggins, who retired following twenty-seven years at the helm of the museum last September, and will begin in her new role on January 6, 2021.“Linda is a seasoned executive who has led organisations that have transformed their core collections in order to become more accessible to the public, and who has demonstrated an ability to move between disciplines and approaches to fulfilling her mandate in extraordinary ways,” VMA", "The next Biennial should be presented by the San Francisco Museum of Modern Art, the Los Angeles County Museum of Art, and the Metropolitan Museum of Art. The seventh will be curated by the same trio, with the addition of Ruth West, and will take place at the San Francisco Museum of Modern Art in May 2021.The next edition of the Biennial will be held at the San Francisco Museum of Modern Art in June 2021. \n\n\nArchitects and designers are returning to New York for the annual Exhibition Architecture Biennale, which is slated to run from May to November. The first iteration of the fair, which was canceled in March due to Covid-19, was canceled again last month after organizers discovered that the exhibition would run from March 23 to March 26. The second iteration of the fair will be held at the Javits Center on November 27–31.“The two shows are very different, but the result is the same—more artists from all over the world, many of whom have yet to be seen,” said Maia Rosati, director of the Joseph Weizenfeld Center for Modern Art. “The exhibition is held in the public space, but the show is in the building, which is an urban center in", "The next Biennial should be held at the DePaul University Art Museum in Chicago, which will host a special exhibition of work by the Black, Asian, Native, and Indigenous (BAN) artists, in December 2020. The 2021 edition will be held at the Museum of Contemporary Art New York and will be co-curated by Anita Ranade and Kiki Smith. The 2020 edition will also feature work by artists from around the world\u0097including the artists who were shortlisted for the 2020 prize.\n\n\nThe Smithsonian American Art Museum in Washington, DC, has appointed Clayton L. Harris as its next executive director. Harris will be responsible for developing programming that will connect with and engage with a diverse group of American artists and thinkers. He succeeds Elyn Zimmerman, who retired last month after seventeen years with the institution and will take up the post on January 16.“Clayton has been instrumental in bringing the museum’s international reputation and growing its collection to new heights, and we are grateful for his leadership as we embark on a new chapter,” said museum director Alex Nyerges. “The selection committee found him to be a strong leader, enthusiastic, dedicated, and practical, and we are confident that he will continue to", "The next Biennial should focus on the simultaneous exhibition of the work of two artists, Łukasz Kaczynski and Wojtek Klint, in order to create a dialogue on the history of artistic interaction between Poland and the world. We hope that this exhibition will become a template for the future exhibitions of the biennial.” The biennial will also receive funds from the Politya Museum of Art (Polish) and the Museum of Modern History (Germany) in Warsaw.\n\n\nThe annual New York City Ballet production, which was scheduled to open on January 14, has announced that it will be postponed, and will instead begin as planned May 28. The move was made amid the coronavirus pandemic, and has been made in the interests of “preserving the group”’s schedule and ensuring that the show is “on schedule,” according to a statement by the New York City Ballet.The announcement follows a series of delays and cancellations that have embroiled the company in the United States. On Friday, April 13, the company announced it would not begin the upcoming season as planned, and its website went dark for several days. On April 14, the company re-opened with a new", "The next Biennial should be held in 2020, and the next season will be titled “After Tomorrow,” following a time-travel plot set in the thirteenth century. We will also continue to develop and launch new projects in collaboration with collaborators across the globe, and will continue to present exhibitions of work that is not only unique and original, but is also grounded in a deep commitment to the arts and the vision and spirit of our guests.\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Rachael Carney as its next executive director. Carney succeeds Amy S. Marks, who announced earlier this month that she is stepping down after eighteen years at the helm of the institution.“Rachael’s tenure at the MFA has been transformative, both for the museum and the city it serves, and we are thrilled to welcome her back to the curatorial team and to our amazing team at the MFA,” said museum director Matthew Teitelbaum. “Her leadership and vision for the museum and city will ensure that we continue to thrive as an important cultural laboratory for Boston, and that we continue to thrive as an internationally recognized center for contemporary artistic excellence.”Prior to joining the M", "The next Biennial should be held in December 2021. As of May 28, the exhibition has only been open to the public for a limited time, and the organizers are still working on the details of how it will be staged. The exhibition will focus on the collective works of three artists—Leonardo da Vinci, David H.G. Williams, and Thomas Edison—and will feature works by the Greek philosopher/graphic artist Panagiotis Pappas, the Italian painter Piet Mondrian, and the Chinese artist Nie Nu.\n\n\nThe Israeli government is preparing to recognize the state of Palestine, marking a major step toward resolving the decades-long Israeli-Palestinian conflict. As part of a major update of the country’s constitution, Israel will recognize the state of Palestine, paving the way for negotiations between Israel and Palestinians. The legislation was passed by the Knesset, Israel’s lower house of parliament, on Thursday and now goes to the Knesset for approval. Initially, the Knesset approved a bill that would recognize the state of Israel in a referendum in May, but it was defeated by the Knesset—which is dominated by parties opposed to settlement activity—in June.The Knesset also approved", "The next Biennial should take place in 2020. \nBiennials are a popular and long-term form of artistic expression in the West. The term has been used to describe the development and evolution of a work over a period of more than twenty years. The term is also used to describe the vast array of artworks that have been produced in the United States in the intervening eight years. The 2020 Biennial will be the twenty-fourth edition of the Art Biennials, which will be held at the Art Institute of Chicago from March 16 to March 18. The show will also be the biennial’s first in the United States and will be curated by Meg Meggitt, director of the Museum of Contemporary Art Los Angeles.\n\n\nTania Bruguera, a curatorial college graduate who was hired to work in the arts and culture field in the Bronx and Harlem, New York, has been named the next director of the Art Institute of Chicago. Bruguera will take up the post in January 2021.“We are thrilled to welcome Tania to the Art Institute of Chicago,” said director Amy Schäfer. “Tania is a seasoned professional who has an exceptional track record as a curator", "The next Biennial should be held in 2021 (eventually the next year). It will be comprised of twelve exhibitions. The first exhibition will be a “Theater of Operations” (2019–20), a biennial of twenty-three exhibitions that will be held at the same time in the United States, Canada, and England. The show will also include a “That Was My Life” exhibition, which will be curated by the biennial’s first director, Eleanor Cheng-Ho, and will launch at the Albany Art Museum in Albany, New York. The second exhibition will take place in the United States in 2022.The 2019 edition of the biennial featured work by twenty-three artists. “It was a very special exhibition,” Cheng-Ho said in a statement. The exhibition was organized by the 91st Venice Biennale Committee, chaired by Francesca Cattelan, and supported the work of various artists and encompassed a range of themes, including drones, transformation, and local and historical narratives. The biennial was also supported by Italian luxury brand Gucci, which agreed to donate $5 million to the event.\n\n\nThe Metropolitan Museum of Art in New York has", "The next Biennial should be held in 2021. The Museum of Contemporary Art (MoCA) in Los Angeles will host the inaugural edition, which will be staged at the museum in 2019 and will take place in the city in 2021.\n\n\nThe Museum of Contemporary Art (MoCA), in conjunction with the California Academy of the Fine Arts, has issued a statement on the ongoing campaigns and protests against the construction of the Trans-Pacific Partnership (TPP), a massive 12,000-page free-trade agreement that would include Japan, Peru, New Zealand, and Malaysia.Speaking to the Los Angeles Times, Mark Giordano, the director of the museum and the academy, said: “We are deeply concerned about the growing level of anti-Japanese sentiment in the United States and internationally. The museum understands the legitimacy of the right of people to oppose the construction of a new international trade pact. We hope that this statement will reassure people in the United States and around the world that our position is consistent with that of the museum and that we believe the current protests are misplaced.”The museum has been working with the CAAFA (Center for Art and Architecture at the American Academy of Arts) and the Museum of Contemporary Art in Los Angeles (LA)", "The next Biennial should include a number of exhibitions that are dedicated to the work of emerging and established artists, including “The Future of Art: Avant-Garde and the Future of Life” (2019), “Rendering the Mekong: Avant-Garde and the Future of Life” (2019), and “L'Arts et l'étoiles: Avant-Garde” (2019). More information about the exhibition program and the 2019 edition can be found here.\n\n\nAn artist’s studio is a space where one creates works that are displayed or presented in forms such as a drawing, sculpture, painting, video, performance, installation, or performance-art. It also has the potential to be a space of creative reflection, a space of education and an incubator for new ideas. The Museum of Modern Art (MoMA) currently houses eighty-five artists’ studios in its basement, including six from the Los Angeles County Museum of Art, the Art Institute of Chicago, and the Museum of Modern Art in New York. The institution was awarded $10 million last year by the David and Lucille Steegan Foundation for Arts and Cultural Heritage.“This is the early", "The next Biennial should be in 2022, the date of the United Kingdom’s grand reopening of the nation’s national museum. The show will feature works by seventy artists, including Joanna Kamm, Juliana Benitez, and Thomas Metzger, and will be hosted by the London-based artist Jason Cundy.\n\n\nThe Metropolitan Museum of Art and the Whitney Museum of American Art are collaborating to create an immersive new public experience that will highlight the history of African American art through a series of presentations, performances, and performances curated by architect and curator Cécile B. Anderson. The new museum will be titled the “African American Museum,” and will be housed in a former cotton gin and will feature a central space for educational programming and a collection of more than two hundred works by twenty-three artists, including Yolanda Adams, John Edward, and Michael Kidd, among others who were influential in shaping the view of African American art through the twentieth century. The show will debut in 2020 and will run for twenty-nine weeks.“African American art is a community and a legacy of African Americans, and it is a community that has been ignored and under-recognized,” Anderson said.", "The next Biennial should have a unique design and a programme that reflects the diversity of the world we live in. In the same way that the inaugural Biennial was created by and for people of all ages, the next one should aim to be a platform for discussions of what it means to be a woman artist in the contemporary world.”\n\n\nThe Contemporary Art Museum St. Louis, Missouri, has welcomed Vincent van Gogh, Ellen Ghebaly, and Gertrude and Paul Gauguin to the city as part of an initiative that aims to increase the engagement of museum-goers with the work of artists of the twentieth century through exhibitions, collections, and education programs. The institution also announced its representation of Pablo Picasso in partnership with the New Museum.“Together, Vincent van Gogh and Ellen Ghebaly embody a new kind of critical imagination, one that is simultaneously playful and bold, visionary and grounded, and layered and refined in its emotional depth and poetic beauty,” said Rachel Voorhees, the museum’s director. “Their illustrations and paintings, their landscapes and paintings, their sculptures and installations, their models and their costume dramas, their stylistic flourishes and their", "The next Biennial should include a discussion of the work of artists whose work is currently being exhibited in New York, including Joan Miró’s Exquisite Corpse and Bruno Latour. \n\n\nThe Vienna Biennale has announced that it will suspend the celebrations for September 22–September 24 and will focus instead on \"constructive engagement with contemporary art and culture.\" The decision was made after the fair’s board of directors met on August 31 to discuss how the fest’s autumn edition, “Vienna 2020,” should be organized and presented. The board decided, in a 2–1 vote, to postpone the event until September 20, when it will be celebrating its seventeenth anniversary. The decision follows a tumultuous few weeks for the fair, which saw its first cancellation in 2016 and was forced to begin a “recovery program” that saw it reopen the following week after an additional three months of closure. The fair also laid off or furloughed some ninety-nine employees after the company spent $9 million on a restructuring effort that involved reducing the number of its international exhibitors, laying off most of its staff, and rehiring attendees who would be refunded their fees if", "The next Biennial should take place in the year 2021. Ghent and Ghent-Edenie are already working to update the exhibition’s program.\n\n\nThe König-Bietzell Gallery in Berlin, which was recently restored by the Berlin-based industrial designer Karl Galtz, has received a major gift from the German billionaire Helmut Kohl. The gift includes the works of artist Martin Seitz, who was a pupil of Galtz’s at the Institute for Modern Art in Frankfurt, and also includes a work by the German designer Haus der Kunst, which was on display in the exhibition “König-Bietzell,” earlier this month.The museum is preparing to present the exhibition “Berlin: A Global City,” which was organized in partnership with the German state, when the 2020 edition of the fair opens in September. The show will also include the work of artist Lucas B. Dennis, who represented Germany at the Venice Biennale in 2004, and will include the work of the German designer Rainer Maria Rupprecht, who lived and worked in the city of Königsberg.Other gifts for the institution include the works of the Austrian", "The next Biennial should be held in October 2021, with the exhibition opening in the autumn of 2022.The festival will incorporate a collection of twenty-six works on paper by the thirty-one artists represented in the exhibition, which will be inaugurated by a group exhibition of manuscripts by the Slovenian artist Jasa Mliaš (May 12–May 15), which will be followed by a solo exhibition of paintings by the Lebanese artist Ahmed Noury (May 22–May 29). The inaugural exhibition at the Biennial of the City of New York will be held in September.The award ceremony for the first year of the Biennial will further expand on the theme of “The Future Is Present: Stories of Contemporary Art from the Biennial of New York.” Titled “The Future Is Present: Stories from the Biennial of New York,” the exhibition will showcase forty-six stories by the thirty-one artists represented in the exhibition. “The series, which was founded in 1979, is comprised of stories that are set in contemporary art, from works on paper, and have been created or inspired by the artists in these works,” the prize jury said. “The twenty-third exhibition at the Biennial’", "The next Biennial should mark the centenary of the birth of Thierry Bastiat “The Next City, ” an influential 1894–96 city planning manifesto that argued for a “City of Tomorrow” in which architecture, art, and design would be embedded in the fabric of the city. The pavilion will include works by some thirty artists, including Pierre-Auguste Breguet, Francis Braidotti, and Robert Hutton, and will inaugurate the “Tremblay biennial” (Tremblay: The Next City) in July 2020.\n\n\nThe Dutch government approved an annual grant of $9.4 million to help the five hundred Dutch artists who are currently imprisoned in Iran, which is currently negotiating a deal that will see the country return most of its citizens to the Netherlands, on Tuesday, March 21.The funding, which is for a total of $14.6 million, will be used to compensate the artists and their families for lost income while they wait for the government to return the money it promised to make to artists in recent years. The program will also provide financial support for artists who are currently incarcerated and will give them the option of returning to Iran.The annual grant was established as", "The next Biennial should include a public presentation of the sculpture 'The Crucible', by Carol Ann Duffy, which is currently on display in the London Biennial for Contemporary Art. I would like to see an exhibition of the work 'After Earth: Mass Extinctions and the Future of Life on Earth', by Michael Behe, which was presented at the Venice Biennale in 1981. Crater Mounds in Nevada: Artistic Record ”Monty Python’s The Meaning of Life has been taken down after it was posted online. The video, which was created in 1981, was taken from a film of the show “The Meaning of Life” by Terry Jones, which won an Oscar for best film at the ceremony in 1986. The video was also included in the upcoming exhibition “Monty Python at the Movies: The Seagull” (2019), which will be staged at the British Film Institute in London in 2021.The USCASP has announced its representation of the artist-in-residence, Britain’s best-known artist-in-residence, Sarah Peck. Born in London in 1953, Peck moved to the US in the early 1970s, where she began her work as a", "The next Biennial should be held in February 2020. The next edition, “The Promised Land: The Art of Quotation,” will be held in April 2020. The next edition of “Quotation” will be staged at the Santa Barbara Museum of Art in California in October 2020. The next edition of “Quotation” will be staged at the Philadelphia Museum of Art in Pennsylvania in October 2021. The 2019 edition, “In the Beginning,” was staged at the New Museum in New York City. The Biennial will culminate with a presentation of the first exhibition of work by the artist Nari Ward, which will also be on view in February 2022.  The 2019 biennial featured works by artists such as Alexis Carrel, Carl Nesjar, and Barbara Kruger.\n\n\nThe Museum of Modern Art (MoMA) in New York and the Richard Prince Foundation in New York announced today that they have reached an agreement allowing the institution to reopen to the public in March of 2020. The institution, which was forced to close on January 31 due to Covid-19, said that it expects to be operational by mid-April.Under the agreement, which was announced on", "The next Biennial should take place in the spring of 2020. The National Museum of Modern Art in Washington, DC, opened this week, March 10–March 12, with the exhibition “Art of the Present.” The MOCAD Berlin biennial was organized by the German and Italian art historians Dieter Fleck, Wolfgang Reimer, and Maria Zuber, and is hailed by the artists as a watershed event. “The exhibition is not only a scientific analysis of the works in this exhibition, but a new way of seeing the world as well, a way of thinking in terms of the future,” said Fleck. The exhibition has also been widely criticized for participating in a narrow curatorial framework, presenting only works that could be seen by a select few. Most works in the show are accessible to the general public, but the museum warns that “never forget that your visit is not just an art museum, but an educational institution, too.”\n\n\nThe Monterey Biennial has announced its selection of twenty-six artists for the second edition of the annual $50,000 prize, which will take place at the San Francisco Museum of Art from March 5 to March 11. The sixty-three", "The next Biennial should take place at the Belle Art Museum in Paris in 2021. Café Pascal, the Parisian arts space, said: “We are at the end of our tethers with the mayor of Paris, and we are eager to raise our hands in solidarity with the several thousand artists and art collectors who have signed this petition.” The petition reads: “With the provision of a debt of €70 billion to the French state in 2020, the exhibition of the materials of the exhibition ‘All in One.’’” The partnership, which will take place between the city, the Art of Europe, and the Institute of Contemporary Art Paris, will run for seven years, with a final exhibition at the Paris Museum of Fine Arts in 2021.The move follows the collapse of the Paris-based nonprofit, which was founded by the firm Groupe de Lyon, in March 2019. The organization was approached by the city of Paris in 2017 to organize a show about the construction of the city’s ancient citadel, the Louvre, and the Louvre Square. The show would have presented the materials of the exhibition ‘The Architecture of Life’\u0097a joint initiative between the city of", "The next Biennial should be held at the Institut National de la Photographie (INP), Paris, in the spring of 2020. The 2018 edition, which was co-curated by Yale Rankin and Victoria Miro and took place at the Museum d'Art.\n\n\nThe British Museum in Berlin revealed yesterday that it has commissioned both a new work by Hong Kong artist Bruce Ng and an installation by American artists, the Paris-based duo Luminary and Lumière, that will be on view in the museum’s newly renovated location in the city’s Kreuzberg district, Kreuzberg 2, in June 2020.Both paintings—a reimagined version of a long-lost cityscape in the Chinese city of Dalian—were selected by an award panel comprising Lumière director Larry Gagosian, Hong Kong-based artist Joanna Sin, and Berlin-based artist Matthias Kuehl.“The Munich-born, Hong Kong–based artist has made the most important cultural and architectural decisions in the museum’s history,” said Gagosian. “Museum director Klaus Böhm-Bickel, who has been tasked with redesigning the museum", "The next Biennial should be held in the city of Krakow in June 2020. \n\n\nThe Museum of Art (MoA) in New York has received a gift of two hundred works by Margaret Mitchell, including works by John Currin, Robert Irwin, and Lucret Wren, as well as a new donation of ninety paintings by the American painter Jim Jarmusch. The gift includes the two hundred works on paper donated by Mitchell in 2017, and includes several works commissioned by her husband, David Mitchell.“Margaret and David Mitchell are among the most influential and influential artists of their generation, and their contribution to modernism and to American art is immeasurable,” said David Levine, chair of the museum’s board of trustees. “Their gift is a version of the museum’s mission statement that combines critical contemporary art with art that was made in the 1930s. Through their work and their influence, Margaret and David Mitchell have shaped how we think about the world and how we conceive of art. Their collection provides an important milestone in our understanding of their work and the exemplary achievements of their work in their lifetime.”Previously, David and Margaret Mitchell were pledged a total of $8.5 million", "The next Biennial should see three exhibitions by Pablo Picasso, Léonide Bénédicte and Auguste Janssen, as well as an exhibition about the impact of art museums in the city of Biarritz, which will be up in 2015. The first exhibition, titled  The Great Exhibition, will take place in the city from April 22 to April 26 and will be followed by a new exhibition of work by Michelangelo Antonioni, The Making of Silence (Orsola, Italy), which will open in September.The Münster Biennale is currently on track to sell out before it opens next month, and the Munich Art Club said it expects to sell out by the end of September. The Draitserischer Kunstverein, which is housed in a former munitions factory in Kreuzberg, Germany, is trying to secure a venue in the city.For many Berliners, the festival has become an essential gathering point for arts and culture. On Friday, March 4, the city hosted at least twenty-nine art events, including an open-air performance by the German folk trio Preussen, which drew an estimated 101,000 people; a free public art", "The next Biennial should be held in about a year—as the museum anticipates that the current exhibition schedule will not be able to respond to the demand for additional programming. The exhibition was also criticized for being too fast-paced and for focusing on the role of women in an overly feminine context. \n\n\nThe Association of Art Museum Directors (AAMD) has released guidelines for how museums will respond to the coronavirus pandemic. The guidelines outline how art institutions will transition to a “net zero” energy model by 2025, removing or minimizing the use of fossil fuels, cutting workforces, and waste reduction strategies; how they will reduce waste, prevent leaks, and prevent the spread of Covid-19, and how they will prepare for and contain the virus.“While we recognize that the challenges of managing complex global health emergencies are vast, the AAMD supports the African Union’s (AU) 2030 climate statement and the Paris Agreement,” the AAMD said. “In line with these commitments, the AAMD encourages museums to take all feasible actions to minimise, to manage, and to reduce the impact of Covid-19.”Calls for museums to reduce activities and staff in an effort to minimize", "The next Biennial should be held in the spring of 2022.\n\n\nThe Centre Pompidou in Paris, whose collection includes works by Claude Monet, Tod Williams, and other iconic French painters, has announced it will rename its flagship exhibition “Cartier-Bosch,” in honor of its longtime chief curator and the architect of the institution, Jeanne-Claude. The decision was made after French president Emmanuel Macron gave a speech on May 18 in which he declared that the Centre Pompidou would remain “France’s Pompidou.” The announcement marks the third time the Museum of Modern Art (CMA) in Paris has embarked on a public project to recognize a former director. The first, in 2017, was a public sculpture by Jacques-Louis David, the father of the great French architect Alexandre Dubov, who used the new institution as a base for creating the Arts Council building in the city of Aix-en-Provence in the early twentieth century.The announcement comes two months after the French government approved a bill that will make it easier for small galleries in the country to stay open and raise revenue for the institution by phasing out the traditional three-day", "The next Biennial should take place in 2021, the theme of the first edition was “Life and Art in the Age of Mass” and the organizers’ hope that the event will mark a new stage in the artist’s career. Artnews has contacted the organizers for a statement.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines for the display of works by African American artists in the city’s public spaces. Among the guidelines are the artist’s age and gender, which are supposed to be at least eighteen years old, and the location of the work. The guidelines were originally published by the DCLA as part of its “Race and Design” study, which examines how race and design intersects with gentrification and urban policy in New York.“We are committed to supporting artists of every race and color by creating new opportunities for them to engage with the city’s diverse communities and our collections,” said commissioner of cultural affairs Tom de Blasio. “Our guidelines state that the age of the work and the location of the work are important, but not essential, to the artistic experience.”The guidelines state that “no less than sixty percent", "The next Biennial should showcase three artists: Raymond Feist, who has worked on a biennial for twenty-five years, and Tracey Upson, who is thirty-eight years old and lives in New York City. The artist-in-residence will be chosen from a shortlist which includes Patty Chang, R. Koons, Andrea Fraser, and Donna Harrison. The full list of artists who are eligible for the 2019 edition of the Museum Biennale is as follows:PATRICK FEIST                                                               Anselm Kiefer                                   Michael Houska                                     Nora Bridget Houska                   Danielle Segura                   Caroline Waitzkin\n\nWhen the International Council of Museums (ICOM) announced that it would be taking the reins from the National Galleries of Scotland in April 2019, it set out to make the institution an attractive destination for international tourists. Following a series of exhibitions at the institution, the sixteenth edition of the Science Museum London (SM8), at Stratford-on-Avon, from February 21 to February 23, and a series of other programming, the institution will be reborn as the New Museum. The reinstall", "The next Biennial should be held in 2020.\n\n\nMilton Bradley, the American architect who designed the Smithsonian’s new building for the American Museum of Natural History and whose work was included in the first edition of the “Biodiversity: A Biennial” exhibition at the Metropolitan Museum of Art in 2001, died on November 19 at age fifty-eight.Born in New York City in 1951, Brad took up the trade of sculptural building designs in the late ’50s. He enlisted in the Navy in 1958, but left the service in 1965 after one year to study at the University of California, Los Angeles. He returned to the design field in the ’70s, when he cofounded the firm Bradbury & Partners, which designed the Museum of Fine Arts in Boston.Bradley’s work recently underwent a major rethinking at the Museum of Fine Arts in Boston, which created a new building for the museum in 2017. The renovation of the museum’s existing building, which includes an exhibition space, classrooms, a visitor center, and galleries, and the addition of new galleries between the museum and the Carnegie Collection, is considered one of the largest institutional gestures ever made by the institution. The museum also added", "The next Biennial should take place in 2021 and will showcase the work of twenty artists selected by the committee from the twenty-four categories of award-winning artists nominated by the biennial’s first selection committee, which was chaired by a Swiss curator, Jean-Luc Moulène. The biennial’s director, Yoko Taro, said: “This is the first time that the biennial has been controlled by an independent committee of artists. We are very pleased with the result and I look forward to the subsequent biennials in different cities in Europe, Asia, and North America.”The 2020 winners were announced on November 9 and the full list of winners can be found on the programme’s website. The twenty-four categories of award-winning artworks nominated for the 2020 awards were nominated by the committee chaired by Jean-Luc Moulène.“Our awards recognise artists of contemporary and contemporary-art-focused fields such as painting, sculpture, photography, performance, video, art, fiction, and film,” Jean-Luc said. “In recognition of their achievements, we consider showcasing their work in the exhibition at the biennial. We hope that the exhibition, in conjunction", "The next Biennial should take place in 2021. \n\n\nThe London-based conservation organization the Index Card Project (ICP) has been enlisted to assist the city of New York in the recovery of more than 2,400 historic and contemporary cards from the collection of the late collector and philanthropist John Gallerie.Gallerie’s extensive holdings include works by a number of key artists and are catalogued in the collection as well as in the collections of the Metropolitan Museum of Art, the Museum of Modern Art, the Whitney Museum of American Art, and other institutions. Gallerie’s remaining artworks are scattered throughout museums, private collections, and the collections of individuals and institutions in New York City and beyond. To date, Gallerie’s son, Joseph Gallerie, has managed the organization’s acquisition and preservation efforts. Gallerie’s mid-1950s collection includes work by Ed Moses, Arthur Tenenbaum, Frank Gehry, and Joan Miró, as well as works by artists such as Vincent van Gogh, Peter Beresford, and Hans Christian Andersen.“The Galleries, our mission, and our collection are a remarkable example of the rich and complex history of art,” said", "The next Biennial should be announced in June.\n\n\nThe Paris-based artist and educator Camille Blatrix, who created works such as the architectural collage The Ground, 1963, which imagines an urban landscape in which the cityscape is an abstract form, is being sued by the German government for copyright infringement. After the government found Blatrix guilty of plagiarism in September, the artist was sentenced to two and a half years in prison.Blatrix was found guilty of the latter charge by a court in Freiburg, Germany, but it was not reported until October; the state government appealed the decision. Blatrix was arrested in August 2018, and his conviction was upheld by the Federal Criminal Court in Tübingen in March. Blatrix was given two years and ten months in prison before he was sentenced to two and a half years in prison.The German state has already taken legal action against Blatrix three times. In February 2019, the Federal Office for Culture, Germany, found Blatrix guilty of copying an architectural collage The Great Work, 1970, which was made in collaboration with the artist Gerald Nye, who died in 1977. In March 2019, the Federal Court of Cassation upheld the conviction of", "The next Biennial should be held in 2022, after which the exhibition will continue to be on view until March 21, 2022.\n\n\nThe National Endowment for the Arts (NEA) has released guidelines for the use of social media in aiding the recovery of cultural assets in the wake of the devastating hurricane Florence.The guidelines, released on January 6, 2017, discourage the use of social media for the purpose of fostering political instability and the dispersal of extremist views and encourage the use of online forums to support the arts. The guidelines were issued in response to the current crisis, which has left more than eighty million people without power and has brought the climate emergency crisis to a near-record pace.“This is an unprecedented crisis, and we have made every effort to keep the public in touch with the arts and social media as much as possible,” said Anne Krueger, chair of the NEA. “We encourage everyone to review and understand the guidelines as they apply to you and your organization, and if necessary, to reach out to our office staff and we will review the recommendations. It is our job to empower people to make informed decisions about their programs and services.”The guidelines outline ways to help organizations and individual artists impacted by", "The next Biennial should include a short-term program of performance and installation to coincide with the opening of the new museum. The exhibition will be curated by Lumi Tan ; the writer, curator, and educator; and artist Li-Ning Liao. “The exhibition and the program, together with the biennial, are essential for the future of the museum,” said Elizabeth Zebrowski, president of the museum. “At one of the most renowned contemporary art institutions in the world, we are forging ahead without delay in exploring new possibilities and building new audiences for this exhibition and biennial. We are enthusiastic about our new role as the new Museum of Modern Art in a historic building in Central Park.”\n\n\nThe National Gallery of Art (NGA) in Washington, DC, announced today that it has appointed Samantha Ronell, who has served as director of the NGA since March 2019, as its next director. Ronell joins the NGA from the Solomon R. Guggenheim Museum, where she was assistant director of exhibitions and research. She succeeds Steve Schoonmaker, who has served as the NGA’s director since 2016, and will assume her responsibilities on February 4.�", "The next Biennial should have a new exhibition, titled “The Birth of the Modern World,” which will take the themes of art and science, art and fabrication, and art and technology in order to present a new history of art through a combination of art and science. The exhibition will consist of twenty exhibitions in the coming months. The institution will also divide its programming into three periods: the three‐month period in January and February, the three‐month period in March and April, and the three‐month period in September and October. “This new era will start with the opening of the new exhibition, ‘The Birth of Modern Science,’ in February 2020, and will continue with ‘The Art of Minds,” in March 2020, and “Greater Moments,” in the first half of 2021, according to the art-world calendar.\n\n\nThe Italian pavilion at the Venice Biennale has revealed that the upcoming event will be hosted by an institution affiliated with the Museo Civico di Castello, in a large-scale redesign of the building slated to open in 2021.The restoration work, which will include the construction of a new exhibition space, a library, a café", "The next Biennial should be held at the Connaught Art Museum in Wales in 2021. \n\n\nThe Art Newspaper has revealed that the next edition of the Danish Biennale will be held at the Danish National Theater in Copenhagen from January 18 to January 20, 2021. The event will be hosted by the Danish Film Institute (DFI) and will focus on the art of journalism, the first tool that the Danish government granted its film industry in 2015, which has since been curtailed.Commenting on the event, director Per Dahlberg said: “We can look forward to an innovative and ambitious 2019 that will deliver on the promise of the last year, and that will continue to innovate and grow with our new partners and new audiences—and that will show how this extraordinary country, Denmark, really belongs to the world.”The Danish National Film Company (DNF) has announced that it is planning to open a new digital platform, the Danish Film Forum, in the spring of 2020. The initiative will bring together local, regional, and international filmmakers and will host screenings ranging from eight to twenty minutes in length. “The Danish Film Forum will be a new amalgamation of all the elements of a Danish national film festival: a platform for dialogue,", "The next Biennial should take place at the Museo de Arte Contemporáneo in Santiago de Chile in 2022.\n\n\nOn Monday, the Essen Biennale announced that it is postponing this year’s edition from January 29 to February 28. This follows the announcement in mid-February that the exhibition would be postponed until March 13. Museums and galleries in Germany, Austria, and Switzerland have also announced that they are preparing for the possibility that March 13 will be the last edition of the show.The German government and the Federal Office for Culture (Bundesamt) are working hard to raise funds for the event. Chancellor Angela Merkel recently announced a total of $100 million for the event—more than quadruple the amount allocated last year. However, as of March 12, the total amount raised for the event was only $88 million. In an attempt to ease the financial crisis in the eurozone, the European Commission is allowing member states to raise an additional $75 million for the event through March 14. Tacita Aldridge, director of the Centre for Contemporary Art, London, said: “Essen is a great showcase for art, and we are all delighted that it will come to", "The next Biennial should be staged in the Spring of 2020.  The 2020 edition is scheduled to be held at the Kunstverein Berlin from March 21 to March 23. The 2020 edition will be preceded by the deaccession of Biennial I (2019) and Biennial II (2018). The exhibition will also include “The Great Art of Manchuria” (2019), a special exhibition of work by Kunstverein member Kiepenhaus and the 1905 laureate Anna-Sophie Berger; and “The Age of the Art Wheel” (2019), a program of lectures, workshops, and presentations organized by Karl Braunschweig.\n\n\nThe Royal Academy of Arts (RA) in London announced today that it is planning to move the exhibition from its museum in the city’s Chiswick Campus to the Manchester Art Gallery (Manchester), England, in the near future. In a statement, the Royal Academy of Arts said: “The development of new technologies and a changing art world is making it ever more important to create and present works that move us, rather than merely illuminate our world. We are trying to develop new ways of working", "The next Biennial should be a celebration of our history and the diverse cultural and social experiences that have shaped it. “We hope that the twenty-third edition will also give weight to the new opportunities that were opened up by the fall of the Berlin wall.”\n\n\nThe Museums Association (MA), the United Kingdom’s national art trade body, has launched a new initiative that will give millions of Britons the chance to see the works of fifty-three artists. The twenty-fifth edition of the Museum of Britain, which will take place at the Tate in London from March 21 to March 23, 2020, will be hosted by the Royal Shakespeare Company until December 21, 2020. “The Mall Art Festival, one of our great national pastimes, is being revived with a new exhibition and a new programme,” said David Barclay, the chairman of the association. “This challenge was made possible by the tireless work of our artists, whose creativity and dedication we have long admired, and whose dedication we have long hoped for. We are grateful to our artists and our board of trustees, who have made this possible.”Judd Wright, the director of the Royal Shakespeare Company, said: “This", "The next Biennial should be held in 2020. The Biennial will focus on responses to the coronavirus and will include the first exhibitions by contemporary artists and will feature works by a cross-section of the art world’s most innovative and influential artists. Joanne Miller, chair of the board of trustees of the Philbrook Foundation, added: “Carlos has been an incredibly generous donor to the Philbrook Foundation since its inception. Through his generosity, he helped raise funds for the foundation’s various initiatives, including the Philbrook Art Museum, the Philbrook Foundation Curatorial Initiative, and the Philbrook Imaging Center, and he has continued to support artists through his generous gifts of art and ameliorated the Philbrook Foundation’s collection by making significant donations to improve its holdings of modern and contemporary art.”\n\n\nThe Metropolitan Museum of Art (MoMA) in New York announced today that it plans to construct a new, more than four-thousand-foot-high, glass-enclosed David K. Katz building at 730 Fifth Avenue in the Metropolitan Museum of Art. The Katz building will be made of steel and will be inspired by the steel sculpture of the same name in the late", "The next Biennial should be held in 2020, before the end of the thirty-fifth edition of the Art Congress. If the date is moved, the first exhibition will take place in 2022. The twenty-first Biennial will consist of thirteen exhibitions, which will open in 2020 and close in 2022.Best of British contemporary art, 2019. The 2019 edition, “The Sonnets ” (MCA), was curated by Sam Katz. Official list of winners:   1. Eleanor Campbell’s “Love Letters” (BENEFIT) 2. James McManaman’s “The Impulse to Paint” (BENEFIT) 3. Teresa Meitiv’s “Hangmen” (BENEFIT) 4. Paul Mpagi Sepuya, “The Priest,” (Carlos Alberto Pérez)  5. Kieran McManaman’s “Do You Believe in Miracles?” (BENEFIT) 6. Charles Montgomery’s “The Work That Bites: The Art of The Body�", "The next Biennial should mark the centenary of the Russian Revolution. In addition to reconstructing the Revolution, the Biennial will also include exhibitions that address the development of Communism, the Soviet Union, and the international communist movement. The exhibition will highlight the achievements of the contemporary artists and will be organized as a collective work, featuring works by artists from the Soviet and Eastern Bloc. The project, titled Stalin Biennial, was conceived in the 1990s by Leonid Mikhelson and Yuri Shonibarey, and was awarded a construction grant by the state to carry out the project. For the past decade, the artists have staged exhibitions at the Silo Art Museum in Moscow, the National Museum of Fine Arts in St. Petersburg, and the State Museum in Saint Petersburg.\n\n\nThe National Gallery in Washington, DC, has appointed Bradley L. Evans as director. Evans arrives at the museum from the National Council on the Arts, where he has served as deputy director since 2014, and is responsible for managing the gallery’s collection programs and exhibitions as well as assisting the collection in developing new works. In his new role, he will assume control of the National Geographic Society’s holdings and operations", "The next Biennial should take place in 2020 at the New Art University Berlin, which is currently undergoing a major renovation. The theme of the inaugural edition, “Human Nature” and the theme of the next edition, “Life After Life,” will be created by the artists Archeelp and Antony Gormley with the help of the local government in Berlin.Participating artists will be announced soon.\n\n\nDavid Duvalier, a French digital artist whose immersive works evoke the ancient Greek myth of the Muses, has died at age seventy-nine at his home in Paris. The artist was born in Saint-Sulpice, the suburb of Marseille, in 1925 and raised in Paris between the ages of twelve and eighteen. Throughout his years of residency in France, Duvalier explored the ineffable rhythms of sound and light, the shape and movement of objects, and the materiality of the human body. His works have been exhibited at the Paris Biennial (2010); the Salon de Lyon (2009); the Museum d’Arles (2015); and the Venice Biennale (2016). His work is currently on display in the exhibition “La Chaîne,” curated by Olivier Labitta at", "The next Biennial should be on May 9. The final edition, “Culture, Politics, and Sociology in the 1980s: The Philippines” will be held at the Museum of Contemporary Art in   Manila in March 2020. The fall event will include the first exhibition of work by under-recognized Filipino artists, including Marciano, Alfredo Rodríguez, and Julio Cesar.\n\n\nThe National Endowment for the Arts (NEA) announced today that it is pulling $2.5 million from its Russell Sage Foundation, which is currently embroiled in a legal battle with the government of Washington, over a $120 million loan made by the late American financier Robert Kennedy.“This is not the time to make deals, but the time to call for the end of special interest deals,” said NEA director Derwyn Chiu. “The Agency will be making an award of grants to support critical work in the arts and humanities, and will continue to do so with an award-granting approach.”According to the Washington Post, the NEA received a $139,000 grant in 2017—the first such amount in its history—and the agency spent $115 million on", "The next Biennial should be in 2020.  The slot is currently vacant. The exhibition will be organized by curator Yael Weizman and will draw from the collections of the Israeli Museum of Art, the Contemporary Art Museum in St. Louis, the Albany Art Museum, the Adolph-Catherine O. Jessup Museum for Arts and Performance, and the Jewish Museum in Jerusalem. \n\n\nBritish artist Stephen Daldridge, whose widely acclaimed and often critically acclaimed collages and paintings captured the spirit of a post-punk scene set in London but not its grim reality, has died at age seventy-eight. Born in London in 1948, Daldridge studied at the Institute of Art before moving to his hometown of Coventry and eventually settling in London. His earliest works, published in 1975, are deeply rooted in pop culture, popular culture, and post-punk and weave a nostalgic aesthetic in which the familiar is replaced by a minimalist aesthetic. In 1979, Gagosian acquired the copyright for the artist’s work and its catalog was expanded by several others, including Alan Parsons’s Mesh, 1987, and Michael Ondaatje’s Midnight’s Black, 1988, with Valerie", "The next Biennial should be held at the Museum of Contemporary Art in Boston in 2022.\n\n\nThe Biennial of International Bicycling (BIC) will present its eleventh edition, “MOVIE BIC.” The exhibition will be staged at the recently renovated Metropolitan Museum of Art in New York from February 26 to March 9, 2020. Designed by local Boston-based firm the Partnership, the exhibition will feature work by seventy-eight artists and will feature a selection of art within the biennial’s original location.“We are delighted to announce the theme of MOVIE BIC as well as the theme for our upcoming exhibition, ‘Cultural Biases,’”” said Daniel H. Weiss, director of the Partnership. “The biennial’s partnership with the Museum of Modern Art and the performance of the exhibition is a strong example of our commitment to engaging with and challenging the museum’s collection. It is a great honor and a great joy to be able to present this exhibition with the group of artists that we have assembled.”The biennial’s second edition, “LINK,” was presented at the Museum of Modern Art in 2007 and was", "The next Biennial should be held in the Spring 2019.\n\n\nThe Pérez Art Museum Miami (PAMM), the city-owned museum that is currently closed due to the Covid-19 pandemic, has appointed Alexis Bojes as its next executive director. Bojes comes to the institution from the Detroit Institute of Arts, where she has served as interim director since September 2019. She succeeds Betty Williams, who has served as interim director since September 2018.Bojes will assume her new responsibilities on January 9, 2020.\n\n\nThe Rockefeller Center in New York City has announced that it is preparing to receive up to thirty thousand visitors this fall. The institution expects that the New York–New Jersey region to be the largest single market for the arts and that the city’s Metropolitan Museum of Art, the Museum of Modern Art, and the Bronx Museum of the Arts will each draw between eleven and thirteen thousand visitors.The Rockefeller Center, which was founded in 1989 as a project by the artist-philanthropist Richard Reiner, launched a campaign to raise $120 million for its expansion in 2006. The campaign raised only twenty-four percent of its goal, and the Rockefeller Center was forced to move the twenty-fifth iteration of the", "The next Biennial should be organized by the United States Consular Services in 2021, with the participation of the fifty-two States, the District of Columbia, and the Northern Mariana Islands. The twenty-fifth iteration of the fair will be held in 2021.\n\n\nThe French Minister of Culture, Franck Riester, announced on Tuesday that the country will soon be home to forty-eight sculptures and thirty-five works by eighty-nine artists. The eighty-one-piece list is a continuation of the Paris triennial’s theme \"Foursquare,\" which was inspired by the landmark 1954 French exhibition “Les Tapes de la Lune.”The forty-eight works will be unveiled at a ceremony on Tuesday. The seventy-ninth, titled “To the Sea,” will be installed in a museum in the city of Saint-Denis in December 2020.“The work ‘To the Sea’ is an answer to the question: Why are we here?” Riester said in a statement. “The work is a means to connect with the sea, to the depths and to the planet. The sea is the core of our universe; it is the heart of all", "The next Biennial should take place at the Para Gallery in London in February 2022. The artist-run biennial will feature the first public exhibition devoted exclusively to the mass movement of materials since the late artist Zaha Hadid, who died in the US in 2018.The exhibition will consist of approximately 120 works, including works based on the themes “portrait,” “fantasy,” and “disturbance.” The artist-run biennial will have its first public screening in London on January 25. The exhibition is supported by Tate, the Para and the Hadid Foundation.\n\n\nThe Henri Matisse Foundation in New York has issued a public apology to the artists whose works were stolen from the museum in a systematic and hidden manner in an attempt to cover up its mishandling of the artist’s legacy and the artworks’ sale. The foundation’s director and CEO, Henri Matisse, said in a statement: “In a time when artists are being targeted by unscrupulous collectors, the foundation is committed to working cooperatively with law enforcement authorities to secure the safe return of artworks. We hope that this apology will assuage their pain.”The statement comes on", "The next Biennial should be held no later than December 2019. “We are in the process of enhancing our exhibition program to reflect the best of contemporary art,” said Kaya. “I am particularly excited about the new platform that will be inaugurated by the exhibition of the artist Waleed bin Talal’s first solo exhibition in the United States.”The 2019 edition of Art Basel Abu Dhabi will be hosted by its London headquarters inside the new triennial of Contemporary Arts, Design and Design Art, which will open on November 27. The event will run from 2022 to 2024 and will include new art, new design, and new installations by more than fifty artists, including Nandi Jain, Enrico Castellani, Nara Schad, and Amie Siegel, among others.\n\n\nThe California Instituto de Artes Plahuvanas (CICA), which has been struggling to raise funds since February, has announced that it will not give its 2018 edition until June. The event, titled “Plano,” will be held at the Via de Albul, a former slave labor camp in northern Mexico City, and will run between March and March 21. The", "The next Biennial should be held in the fall of 2020. The theme for the inaugural edition, “Between the Tropes,” will be revisited for the second edition, “Between the Trees.” The institution will also unveil the first of a series of exhibitions to explore the work of emerging and established artists. The first show, “Artist Surveys,” will open in May 2022.\n\n\nThe Metropolitan Museum of Art (MoA) in New York has received a $3 million donation from the Charles and Lucille King Family Charitable Foundation. The gift comes on the heels of the foundation’s founding in 2017 and is the largest gift it ever made. Its previous recipients include the Montreal Museum of Fine Arts (MoFA); New York’s Metropolitan Museum of Art, which in 2018 received $2.2 million; and the Museum of Contemporary Art, New York, which was awarded $1.75 million.“At this moment of great uncertainty for many arts organizations, we were pleased to hear the King Family’s generosity inspire so many talented young artists to pursue their dreams,” said Mark Levine, the foundation’s president. “And"]