["The next Biennial should be held in 2020.\n\n\nThe Astley Museum in South London has promoted three members of its present-day collection to its senior management team, bringing the number of artists currently represented in its collection up to 10,000. The Astley Arts and Cultural Gallery, which runs three galleries in central London, announced the appointments on Thursday, May 3, with Sophie Bronkhorst (1951), Alice Sebag Montefiore (1951), and Thomas Krens (1951).“After a thorough search of the staff, the board and management, we could not have chosen a more capable candidate to lead the Astley Arts and Cultural Gallery,” board president Patrick Dessal told the London Times. “Tanya, Sam, and I are very proud to be able to represent the artists of the Astley Museum in London. We are looking forward to building on the recent success of the Astley Museum with future generations of collectors.”The nominations were announced the same day as the reinstallation of the Astley Museum’s existing collection, which has been a part of the museum since 1954. The reinstallation, which added new works by more than seventy artists, was spearheaded by curator and", "The next Biennial should be held in the spring of 2021.The museum will consider the options described in a statement by director João Henrique Pape, who is also the director of the Museu de Arte de Porto, in the coming weeks. Pape said: “The problem is that the times we live in are not stable. They change and the world we live in changes. We are in need of time to adjust and to re-think things, and we need to be able to do that in the next five years. Our preparations for this year’s exhibition are not yet finished, and we have yet to set a date for the exhibition. In fact, we are now working to establish a new relationship with the Brazilian government, the federal and state governments, and organizations which will act as the platform for the exhibition.”\n\n\nThe Museum of London has received a £10 million donation from the Andrew W. Mellon Foundation.  “Andrew W. Mellon is a legend in his own right, and we are honored to be able to share in his legacy,” said Museum director Maria Balshaw. “We are grateful for the foundation’s support in recognizing this exceptional", "The next Biennial should include a performance by a group that comprises two artists, one artist-in-residence, and a curator from a museum that will participate in the exhibition. The inaugural exhibition will be held in the Meidl Gallery in Frankfurt.\n\n\nThe Metropolitan Museum of Art in New York has opened its first DiFi Gallery in the city. The space, which opened to the public on February 4, will host an exhibition of work by thirty artists in the coming months. It will also present a new collection of works by artists such as Nari Ward, Mira D. Baran, and Kiki Smith.“The DiFi Gallery is a new kind of museum, a hybrid of performance and performance-making that engages with a wide range of contemporary art and the contemporary culture of New York City,” said Michael DiFi, the director of the Metropolitan Museum of Art. “It will open in the Museum of Modern Art at Rockefeller Center on March 23 and will be hosted by the Metropolitan Museum of Art in partnership with the New Museum and the Museum of Modern Art in New York. In addition, the DiFi Gallery will host a series of projects with other world-class artists and will present a documentary about Robert Irwin’", "The next Biennial should take place in the city in 2022.\n\n\nThe 16th edition of the Barbican Art Museum London, the Barbican Centre for Contemporary Art, and the Association of Architects and Engineers (A.E.A. ) have announced that the event will move to Greenwich Village. The announcement comes two days after the London-based NGO Campaign to Reclaim the Arts (CRACE) and the London-based arts and culture charity St Ives Garden, which has been working to secure the refurbishment of the Barbican for the past two years, announced that they are spearheading a campaign to save the historic space.According to a release from CRACE, the organization has organized a petition in support of the Barbican that has been signed by more than 1,500 people and has also organized an online petition that has been signed by more than 1,500 people. CRACE says that it stands by its campaign and urges the British government to make the space a national monument. Advertisement\n\n\nThe Museum of Modern Art (MoMA) in New York is closing its doors for a second year in a row. The institution announced on Friday that it is suspending the annual retrospective of artist Diana Nagan, which runs from March 22 to", "The next Biennial should be held in 2021 and the last in 2020. Nairobi’s Robert Rauschenberg Biennial was also canceled. The exhibition was scheduled to run from March 26 to March 28, 2021.Artforum has reached out to both the SITE and the Biennials for comment.  [UPDATE: May 24, 2019, 5:30 PM]A statement made by the SITE to Artforum reads: The 2019 and 2020 editions of the SITE have been canceled for different reasons, but the most important difference is that the 2020 edition was cancelled due to health reasons. We are working to find a creative solution that will allow us both the 2019 and 2020 editions to return to the site in 2021. We appreciate everyone’s understanding and support. \n\n\nThe German town of Essen, which was engaged in an ongoing legal battle with the German state over a century ago, has received an unexpected gift. On Tuesday, the town of Biedermann, located in the state of North Rhine-Westphalia, received its first major donation in more than sixty years. The gift was made by German industrialist Wolfgang Pfeifer, who represents the commercial and financial conglomerate Axel Springer.", "The next Biennial should be held in 2021. \"Our plans to re-create a new biennial at the museum have been in the works for several years and we are fully committed to making this happen. The museum will continue to be a platform for contemporary art in the South East, and we will continue to develop international relationships with leading contemporary artists and institutions. We have already received many positive recommendations for the upcoming Biennial from artists, collectors, and institutions, and we are extremely confident that we can deliver a great exhibition.”Among the works slated to be restored are the exhibition “Gentlemen,” which addressed gender stereotypes and the effect they had on women; “The Death of an American Male,” a show that explored how representations of black masculinity had shaped and affected the American experience; and “The Body,” a show organized by the artist and feminist scholar Naima J. Keith.“We are truly honored to be able to build on the legacy of our founding and to present contemporary art at the Arts Mews in Cardiff,” said director Susan Drew. “These works will resonate with and be remembered by generations of artists and art lovers in the UK and beyond. We have already", "The next Biennial should be held in 2020 to coincide with the theme of the decade, “We Are the Currents.”\n\n\nThe Metropolitan Museum of Art (MoA) in New York has appointed Vicky C. Hildebrandt as its first director. Hildebrandt, who previously served as a curator at the Museum of Modern Art and as the former director of the contemporary art space West Village, will assume her new role in April.“Vicky has demonstrated an ability to attract and engage audiences—both critically and personally—through an open, intentional, and informed approach to art,” said Mark D. B. Cohen, chair of MoA’s board of trustees. “Over the course of her tenure at MoA, she has helped us realize the vision of becoming a global hub for the rich and unique exhibition experience. We are eager to work with her to build on this legacy and to further our ambitions to present extraordinary exhibitions and other programming across our collection and campus.”Prior to joining MoA in 2015, Hildebrandt was a curatorial assistant at the Atlanta Museum of Art. She has been a member of the museum’s staff for twelve years; has curated", "The next Biennial should be held in January 2020, and the first edition in December 2021.\n\n\nThe Museums Association (MA), an organization comprised of more than 2,000 museum directors, is urging the Government to establish a new £1.15 billion fund to support cultural institutions in the run-up to the 2020 UK general election. The fund would be set up through an act of Parliament, codenamed the Art of the Union, after Churchill’s famous speech in which he declared: “All that we ask, all that we expect is to be met with hostility. . . . It is the most elementary democratic principle that we expect what is not, to be shut out, to be excluded.”The group, which is also urging the UK to implement a universal basic income and refocus its public spending on arts and culture, also proposed a series of measures to mitigate the impact of Covid-19, including capping housing benefit at £50,000 and introducing a “one-off grant of up to £1,000,” as well as a new tax credit for small businesses and an expansion of the Universal Jobseeker’s Allowance.In a letter addressed to Caroline Norbury, the", "The next Biennial should open in 2020.\n\n\nThe Carnegie Museum of Art in Pittsburgh, which was forced to cancel a documentary about the Pittsburgh Steelers because of the team’s owner’s health concerns, has received a gift of $10 million from the Carnegie Foundation. The gift was made by philanthropist and Pittsburgh native Mary Magid, who cofounded the Middelheim Collection, a collection of over 1,500 works by works by Bridget Riley, Simone Leigh, and other female artists, in honor of the extraordinary work of the museum’s curatorial staff.“The Middelheim Collection’s curatorial staff has been at the center of a remarkable exhibition that has been viewed by millions every day since it opened last year,” said Magid. “It is a testament to their professionalism and dedication that they have been able to present a documentary about their collection every day since it opened, and I am extremely gratified that this gift will enable them to continue to present compelling exhibitions, open new collections, and provide additional support for the Middelheim Collection’s mission.”The Carnegie Museum of Art has also received a gift of $7 million from the Carnegie Foundation. The gift,", "The next Biennial should take place in 2021, and the first exhibition should take place in 2022. The majority of the works selected by Dorschläger and Glimcher are from the collection of the German artist Wolfgang Gropius, who studied with Felix Remarque at the University of Basel in Switzerland.Dorschläger’s other projects include the installation of the large-scale sculpture Renaissance Homage, a performance by Belgian artist Jan van Eyck, at the Sitzkammerhaus in Vienna in 2015, and The Place of the Dimensions in the Imagination, a series of sculptures by the American artist Mark Halperin that first appeared in the Museum of Modern Art in New York in 2005. Glimcher is also currently working on a new arrangement of all the works of the German artist Wilhelm Kunst, which will open in the new exhibition space Fremont Museum of Art in Santa Monica on October 28. The biennial will run through April 25, 2021.\n\n\nThe Carnegie Museum of Art in Pittsburgh is planning to open a new, 13,000-square-foot, museum dedicated to the works of African American artists on March 31. The exhibition will be hosted by the", "The next Biennial should take place in 2021. \n\n\nThe Museum of Jewish Heritage (Museum of Jewish Life) in New York announced today that it plans to open its first new museum dedicated to the Jewish people in the United States, a move that the institution said was spurred by the city’s demand for more cultural and residential space in the area. The museum will be located in the historic Middelheim Mansion, a former Jewish gated community in Chelsea, and will focus on “the community’s relationship with the Jewish people.”The new museum—which will also include a visiting platform and galleries for contemporary art and a library—is part of Middelheim’s larger vision for the region, which aims to present the Jewish people in a way that challenges the notion of what we as a community can be. “At this very moment when we are faced with so many challenges, we can’t help but be inspired by the craftsmanship and ingenuity of these three projects,” said Roberta Katz, chair of the board of trustees.Middelheim, which will open in the fall of 2020, collaborated with New York City to develop a master plan for Central Park in collaboration with the", "The next Biennial should take place in Italy in 2022 and will be held in the city of Trieste. The event will be hosted by Pierpaolo Cavalli and will be organized by the SISA Foundation.The third and final edition of the event, which has been held in Milan since 2014, will take place in the city of Reggio Emilia and will be held in January 2020. In the first installment, the authors of the book “How to be a Vegan” addressed the issues of the animal rights movement and the practice of veganism. The authors produced a revised and expanded version of the book, which is available in Italian only, in the summer of 2020.In an invitation to the exhibition, the authors wrote: “The new project of the SISA Foundation is the continuation of the work of Pierpaolo and Nino Cavalli, with new and fresh perspectives. The goal of the exhibition is to create a dialogue between artists and philosophers of science, and to respect the artistic process as well as the aesthetic and scientific subjects of the art. The exhibition also intends to bring together an unprecedented collection of the works of animal and plant species with a philosophical and physical dimension. We hope you will understand the significance of this exhibition", "The next Biennial should be held in a few years. The institution’s current exhibition, “Tacita Dean: An American Story,” will not reopen until 2022.\n\n\nThe Museum of Modern Art (MoMA) in New York has become the latest institution to remove a work from its collection by the radical Egyptian artist Naguib Mahfouz, who was executed by security forces in the US state of North Carolina last month. The museum announced on Thursday that it is working with the Art Newspaper, a publication that represents the artist’s supporters, to try to secure the immediate release of the work, titled The Life of an Egyptian Woman, or the Egyptian Woman, which is part of the exhibition “This Is Egypt,” which opened on September 30.According to the New York Times, the work was moved from its vault in December 2019. It was initially stored in the Egyptian Embassy in Washington, DC, but has since been moved to an undisclosed location, and is now being held at the Metropolitan Museum of Art in New York.In a letter addressed to Museum director Bruno Latour, Michael Pfeifer, and executive director Rosemarie Trockel, the group said", "The next Biennial should be held in 2021. “The exhibition of the work within the space of the exhibition should be an affluence of the artist and the institution,” says curator Elvira Alemanova. While the museum has not yet announced a date for the next iteration of the exhibition, it will continue to present the works at regular intervals.\n\n\nThe Museum of Contemporary Art (MoCA) in New York has appointed Paul Mpagi Sepuya, who currently works as an independent curator, as its next director. Sepuya will take the helm of the institution from Mary Ceruti, who will retire at the end of the year after sixteen years at the helm of the institution. “I’ve been impressed by the breadth and depth of expertise that Paul has brought to the MoCA over the past sixteen years, and his ability to shape exhibitions and programs that are grounded in the voices and stories of ordinary people,” said Marc Glimcher, the board chair of the Arts-Life Institute (ALS), a New York nonprofit dedicated to creating more engagement between arts and the communities they serve. “Paul’s timeline for engagement is impeccable, and his extraordinary curatorial team, which includes", "The next Biennial should be in 2022.  In the meantime, the exhibition will be re-created in a biennial, which will be held in 2021.  The first exhibition\u0097a collaboration between Mimi Alekhine, Kunstmuseum Basel, and the Kunstmuseum in Cologne\u0097is now on view at the Kunstmuseum Basel.  The second, “Becoming Human: Modern Art in the Age of Mechanical Reproduction” is currently on view at the Kunstmuseum in Cologne. The third exhibition, “In Defense of the Body: Art in the Age of Biological Manipulation” will open at the Kunstmuseum in 2020.The exhibition will be on view until October 27.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has unveiled a new collection of works by artists including Isaac Bashevis Singer, Tarek Atoui, and Edward Kienholz. The museum also unveiled the first modern-day works by artists not named Dürer, which was curated by Lisa LoDuca. The exhibition opened on Monday, January 1, with the artist’s first solo exhibition since 2014.“", "The next Biennial should be held in the autumn of 2019. \n\n\n\n\n\nThe National Museum of Ireland has agreed to donate over one hundred works by thirty-two artists to the University of Limerick. The donation comes on the heels of the institution’s donation of twenty works in 2017, and will be presented in the autumn of 2020, with the goal of raising €150,000 for the institution.Museum director Tracey Stegall said: “The National Museum of Ireland is committed to supporting the vibrant cultural and academic life of Limerick through exhibitions, exhibitions programs, and exhibition-specific programming. We are delighted to support the curatorial and artistic talent of the region through this significant donation.”The donation of the works comes at a critical time for the city. It is currently facing a construction boom that will disrupt the local economy. The International Business Times reports that the new €2 billion National Museum of Ireland, which will be constructed in the city’s central business district, will shatter the city’s current €1.8 billion budget. The institution has previously donated works to the city of Limerick in 2014, and in 2017, the city gifted 177 works to the museum for its “Greater", "The next Biennial should be held in Spring 2020. The subject of the exhibition will be “Juxtaposition: Avant-Garde and the Visual Arts,” curated by Suzy Mallett, the artist-in-residence at the Museum of Modern Art. The inaugural exhibition, which will feature work by twenty-five artists, has yet to be awarded a prize, but the 2019 edition\u0097the first by the newly founded BAM Gallery in New York\u0097was nominated for a Pulitzer.\n\n\nThe Institute of Contemporary Arts (ICA) in Vienna announced that it will receive a gift of more than three hundred works from the Fine Arts Museum Stuttgart. The gift includes works by eighty-seven artists from fourteen countries, including Armenia, Azerbaijan, Belarus, Finland, and the Czech Republic. The works are currently on display in an exhibition that will run from April 8 to April 10, 2020.“We are delighted to present the works in the exhibition, which will highlight the achievements of the artists who have contributed to the documentation of contemporary art worldwide,” said Jan-Ola Nowak, the head of the Institute of Contemporary Arts. “The works will be presented in the exhibition as part of the Museum of Modern", "The next Biennial should be held at a location that will be approved by the Council of the European Union (CETA), in accordance with Article 7 of the Basic Law, in order to be held in the Member State of Luxembourg. “This is an unprecedented moment for Europe, but it must also be a moment of renewal,” said European Commission president Jose Manuel Barroso. “I call for a new era of dialogue between the United States and Europe, focusing on the common good, and on the shared values that unite us.”Barroso added that the new platform should be a platform for collaboration with the arts, innovation, and scholarly exchange, and that a future edition should include exhibitions based on research and research projects carried out by leading researchers and academics. In a statement reviewed by Artnet, the American Alliance of Museums, the museum industry conference organization, stated that the new platform would “provide a platform for the exchange of ideas and research, and promote the rich cultural heritage of Europe.”\n\n\nThe Smithsonian American Art Museum in Washington, DC, has received a sizable donation of eighty-nine works from the estate of Henry David Thoreau, who passed away on August 4, at the age", "The next Biennial should be held in 2021.  The announcement was made on the Instagram account of Rupture Gallery, which is located in the same building as the museum. The 140,000-piece museum is currently undergoing a massive expansion, which is scheduled to begin in 2021. The expansion is expected to include new galleries, a performance space, a new entrance, and additional spaces for exhibitions and public programming. The museum’s current exhibition venue, the collection, and its collection of the works of a number of African American artists, including Michael Jordan, was also added to the museum.\n\n\nThe Pulitzer Prize–winning photographer Eric Lichtblau, who is known for capturing the landscapes and people\u0097from landscapes he mostly photographed on paper\u0097in paintings and photography books, has died at age seventy-one. Since his death, Lichtblau has transformed his work into a kind of architectural urban reality, capturing people from landscapes he seldom took photographs of, to paintings and photography books. In his new book, Photography in the City, Lichtblau details the process of capturing people, from artists he mostly admired, to famous people he did not, and sometimes photographs of people he did.Licht", "The next Biennial should be in December 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has added three new artists to its roster: Gérard Boudin, Leslie Davis, and Jean-Michel Basquiat. The museum will unveil its selection of works by the trio at an event at the institution on Sunday, July 23.The first exhibition, “The Question of Life: Avant-Garde and Modernism” (2019), showcases the work of the trio in a number of settings, including on walls in the museum. The second exhibition, “MoCA 2017: The Collection,” curated by Martin B. Griffin, will be on view until November 29. The third and final exhibition, “The Living Gut: Avant-Garde Art in the Age of AIDS,” will open on November 25 and run through December 8.“MoCA and its directors have long believed that the museum’s biennial, ‘The Living Gut’ was a natural fit with the institution’s spirit,” said director Matthew Teitelbaum. “As the institution prepares to reopen in January, we’re excited to unveil the full and exciting", "The next Biennial should be an attempt to resume the spirit of the last one. The organizers are optimistic: \"We are ready to play our part in bringing you the results of our projects. We are just awaiting the understanding of the demands of the people. We are open to criticism and to constructive criticism. We are open to constructive criticism in the creative field, and we are open to dialogue with our audiences. We are open to dialogue with our audiences and our audiences can speak with us, we are open to dialogue with our audiences and the people who talk to us. We are open to dialogue with our audiences and our audiences can speak with us. We are open to dialogue with our audiences and our audiences can speak with them. We are open to dialogue with our audiences and our audiences can speak with them. We are open to dialogue with our audiences and our audiences can speak with them. We are open to dialogue with our audiences and our audiences can speak with them. We are open to dialogue with our audiences and our audiences can speak with them. We are open to dialogue with our audiences and our audiences can speak with them. We are open to dialogue with our audiences and our audiences can speak with them. We are open to dialogue with our audiences and our", "The next Biennial should draw from the same sources and point of view as the first and address the same issues as the first. It should aim to surprise the senses, to emphasize the complexity of life. The new work will be constructed around the themes of “power and integration, ” ‘sensuality and the body, ‘and the physical body’ and will be presented through the art of printmaking.”The inaugural exhibition, “We Live in Spectrums,” will be staged at the Dusseldorf-based Haus der Kunst in the city of Duisburg (Germany), which is famous for pushing the boundaries of form and content in order to create a multichannel multimedia experience. The exhibition will be organized as a series of interrelated, interconnected works, each comprising twenty-four sketches by curators Joachim Neumann, Ulrike Schlüter, and Beatrice Schneider. “The biennial will be a commemoration of our past,” said Neumann. “The exhibition will present and celebrate the work of those artists who have been neglected or underrepresented in the international art community. The biennial will not only be about the art itself but also about the themes", "The next Biennial should be held in September 2021.\n\n\nThe Museum of Fine Arts (MFA) in Atlanta has appointed Julie Arquette as its next director. Arquette comes to MFA from the Museum of Fine Arts (MoFA), where she has been interim director for the past two years. She succeeds Rachel Wood, who retired in October 2019 after twenty-five years at the helm of the museum. “We are thrilled to appoint Julie to lead the MFA Atlanta,” said director Warren B. Kanders. “Her remarkable record of innovation and passion for artists and exhibitions speaks to a deep commitment to the arts as a means to challenge and advance our understanding of the world around us.”Since its founding in 1979, the museum has grown from a single gallery space, with its first space in a former iron smelter in downtown Atlanta, to a leading arts destination in the city and the country. The museum recently completed a major expansion, adding eleven galleries and a new building for the museum, and expanded the museum’s permanent collection by adding more than two hundred works by artists. It also remains dedicated to developing and presenting new works and has organized numerous exhibitions, including the 2017 exhibition “The", "The next Biennial should take place in 2022.  “In order to establish an international identity and a strong future for the exhibition, we are still trying to determine the schedule and the location of the Biennial,” said Yang.  “The decision not to sanction a Biennial has been made jointly with the participating artists. We will continue to collaborate with them and in future years.”\n\n\nThe New York City Department of Cultural Affairs has issued fines totaling $1.75 million to collectors who violate an order that requires museums to retrofit certain buildings’ historic exhibitions with modern technology. On Wednesday, the DCLA fined seventy-three individuals across fifteen states for violating the 1965 Street Furniture and Related Art Preservation Act, a law that prohibits the exhibition of works in an exhibition space unless the law-enforcement agency has probable cause to believe that the exhibition is likely to cause “serious damage,” including permanent damage.The eighty-four offenders were given a total of $883,000. According to the New York Times, the fines are slightly less than half of the $2.5 billion in fines that the city expects to be levied by the Supreme Court in the coming years. The court is currently considering whether", "The next Biennial should be held in 2021 and will be the first time the museum’s collection will be assembled entirely by hand. The work will be mounted in a new glass-enclosed museum’s auditorium, located on the fourth floor of the building. The museum will also transform from a collection center into an artist’s residence. A new three-story residential tower will rise on the former campus of the Biennale de Lyon, which is currently being renovated by the French architect Yacine Cendes.Following the renovation, the Biennale de Lyon will be transformed into a new museum, the Biennial de Lyon, in 2020.Bretagne, located in the region of Bretagne-Rhône-Alpes, has revealed that it will not be hosting the second edition of the exhibition, titled “Confessions of a Dark-Knight,” in 2021. Instead, it will organize a “board and chair exhibition,” as the organizers have termed it, in 2022. The exhibition will be based in a new forty-five-meter-long glass-enclosed theater, which will be comprised of artist studios, workshops, an auditorium, a conference room, an education center", "The next Biennial should be a continuation of the theme of “Anthropocene: From Environmental Crisis to Human Future.” The first iteration of the exhibition, held in 2015, examined the enduring impact of climate change on the planet and was staged on a large-scale. The second iteration, titled “Planet Earth,” was staged at the Bali Seven Lakes in Bali, Indonesia, and was organized in cooperation with the Bali-based NGO the Bali Cultural Heritage Foundation. The exhibition opened in Cancun, Mexico, in March of 2020. The 2020 edition of the Biennial will be held at the Lausitz- Bonner Gallery in Munich from June 14 to June 14. The 2019 edition will be held at the Schloss Marburg Museum in Marburg, Germany, from June 21 to June 28.\n\n\nThe American painter Richard Avedon, whose highly personal, often abstract, and often surrealistic sculptures often turn their subjects inside out, died yesterday at the age of eighty-three. In his final works, which often envisioned the physical landscape—his mother had painted a mural of the family dog, a reference to his childhood—the artist leaves no impression on the viewer.Born in New York", "The next Biennial should be called the 2019 Venice Architecture Biennale. The biennial will be held at the Museo Nacional de Arte Contemporanea in Madrid from March 14–March 16. The total budget for the event is €80 million and will consist of sixty artist-in-residence groups, each comprised of three artists, a curator, and a development director, who will take part in a series of solo presentations, including the work of Rousseau, Ghebaly, and Exo, as well as a concert. \n\n\n\n\n\nMariners Michael & Lauren Wainwright and Sean Horan have been named the winners of the 2019 Museum of Arts and Design MAD$d Artist Award, which was established in 2012 to recognize and reward those who have made significant contributions to the art world in the United States. The duo were honored at a ceremony at the Museum of Arts and Design in New York on Tuesday afternoon. Horan and Wainwright, who are currently the directors of the artist-in-residence program at the Museum of Contemporary Art (MoCA), will receive $300,000; the prize jury also awarded the honor of the 2019 ", "The next Biennial should immediately launch a dialogue on the exhibition, the exhibition, and the work of the exhibition, and should include a discussion of your work. It should also consider the role of art in the lives of the artists who have participated in the exhibition. If you wish to participate in the visionary work of the Biennial, contact the editor of this volume. Biennial 2018: The Gender Bender, curated by Michelangelo Antonioni In the 21st century, gender is still a controversial topic. The exhibition Gender Bender is a continuation of your exhibition “Conceptualizing Gender” (2016–17) and features work by twenty-six artists. The show is organized as a series of multimedia performances and events that draw from your own visual and verbal practices. The first performance is “Visual Practice,” which will be held at the Palazzo Bellini in Venice on January 16–January 20. The show will continue with the second performance and performance, “The Body,” on January 21–January 27. “Gender Bender’s’ relations with women are not as complex as we might like to think,” wrote Deana Haggag in the May 2003 issue of Artforum", "The next Biennial should open in 2021 at the Centre Pompidou in Paris. \n\n\nThe National Endowment for the Arts (NEA) is again funding the arts through the Sargent–Ralph, Williamstown, Massachusetts–based arts organization the Joseph Pulitzer Foundation for the Arts (JPGFA). The grant program has been renewed for a second year by the JPGFA for its Teen Artist Program, which aims to provide free, summer internships and other support to underrepresented and under-resourced artists. The grant program is particularly valuable in directing funding toward emerging artists and artists' projects.“As the number of artists and writers in the United States continues to grow, the NEA is investing in new ways to support their work and their careers,” said Mary Anne Carter, director of the Grant Program. “The Joseph Pulitzer Prize has shown how much the arts can change the world for the better, and we are proud to be supporting these young voices and their future plans with this grant.”The grant program is administered by the NEA through its annual $500 grant, which is awarded annually to a poet, novelist, playwright, curator, or musician. Previous winners include Rachel Chafee, T", "The next Biennial should be the twenty-seventh, and it will be the last. “I want to end this as soon as possible,” Daniela Leto, the director of the Düsseldorf-based nonprofit Gallery Makers, told Artnet\n\nThe Milano-based biennial, which has staged numerous works since it opened in 1999, will be the last major retrospective of an artist’s projects. The program was founded by the Swiss artist and educator Joachim Neumann to honor his mentor and friend Klaus-Dieter Neumann, who passed away from cancer in 2004. During its eight-year run, the museum hosted around sixty exhibitions. Its current roster comprises twelve works by artists who have been active in the Milan biennium, including Giacomo Balla, Lucio Fontana, and Romain Surtez-Picard, as well as a selection of works by Tomasz Klimczyk, Robert Mapplethorpe, and Jan-Åke Niemann.The seventy-nine-thousand-work collection will be inaugurated by a selection of works by Stefano Poggi. Poggi, who was nominated for the Nobel in", "The next Biennial should focus on the narrative of art history, the relationship between art and the environment, and the history of ideas, and will highlight the work of artists as well as their beliefs and their contributions to society. Inaugurating a new gallery, the Dusseldorf-based Fuchs & Co. will present a new series of exhibitions. The inaugural exhibition will focus on the work of the Swiss artist Franz Glaman, who is famous for making large-scale pieces of encyclopedic photography, including a series of studio portraits taken in the studio of the artist Josef Koudelka.The exhibition will also take up the topic of the relationship between art and society, referring to Glaman’s 'The Untouchables’ and other works that address the inherent dignity of man\u0097a direct statement to the work of the artist. “The new exhibition is an extension of that work,” said Franck de Bruijn. “Glaman’s method and his travel to Europe and the US, and his artistic travels, the new exhibition combines the strengths of both: an exploration of the relationship between images and the environment, between art and culture.”\n\n\nThe", "The next Biennial should begin in 2022 and conclude in the year 2023. The design of the exhibition will be a collaboration between the new and existing Art Institute of Chicago. The inaugural exhibition will feature the work of twenty artists; five young designers, including Madeline Constans, Kei Miller, and Mariah Alighade; and will open at the newly renovated Art Institute in 2021. The show will run for one year and will be presented in the following year.The 2018 prize, awarded to the first female winner of the $100,000 Biennial Award, was presented by the alumni and panel. The committee consisted of Mihai Kalogridis, chair; Tony Blandy, vice chair; and Antony Hudak, director. The exhibition was curated by Alex Nättinen, director of the exhibition space Clear Light Gallery in New York. The 2018 winner of the $250,000 Biennial Award was celebrated by the alumni and panel.\n\n\nMajor galleries in the United Kingdom that have recently announced that they are being closed due to the coronavirus are pressuring the government to divert funds away from protecting art and toward tax cuts and spending cuts. According to the Art Newspaper, Gagosian announced that it will cease operations in March", "The next Biennial should take place at the Museo de Arte Contemporáneo in Madrid, which will be inaugurated by a new exhibition of works by Embarcadero artists. The next edition of the Biennial is set to take place in 2022 and is slated to run until January 20, 2022.\n\n\nThe Carnegie Museum of Art (C.M.A.) in Pittsburgh has announced that it is working to open a new public space in the former H.M.S. Pacific Light Museum (PHM) in Oakland, California, in 2020. Its new home will be built by the private design firm W.A.S.E. and will be funded entirely by the Carnegie Foundation.The new facility will consist of a new main building, designed by the firm Gensler, in the former H.M.S. Pacific Light Museum, and will be inaugurated by an exhibition of works by a group that includes such luminaries as the Ethnically-minded artist Patrice Bernier, the poet William S. Burroughs, and the sculptor Margaret Mitchell. The exhibition will comprise four multi-dimensional sculptures, which are projected into the sky, and an installation by Mitchell.“The new space for", "The next Biennial should be launched in the autumn of 2020.<|endoftext|>Fear not, Paddington, the beloved British zoo and the headquarters of the nation’s national museum of British Art, is coming back to New York City this fall with a vengeance. The institution announced today that it will reopen to the public in December 2020 and that it is planning to construct a new 150,000-square-foot home for the institution in the city.In addition to the renovations that will be carried out by the New York–based firm Skidmore, Owings & Merrill, the institution will add four new spaces to its existing grounds, including a theater, a restaurant, and a children’s area. The first phase of the project is slated to be completed in 2021.“We are hugely excited by the prospect of reopening at a time when the global health crisis is at its worst,” said David Sullivan, director of the National Museum of Britain. “At a time when some twenty million people are infected with the virus, and almost four hundred countries are still waiting for effective action to stop the spread of the virus, it is essential that we do all that we can to help make a difference.”The institution has previously made", "The next Biennial should be held sometime in the first half of 2020, and the new exhibition and lecture series will be inaugurated with a special exhibition of works by rebellious young artists in the United Arab Emirates.“Toby Jones, Tenzin Khan, and Uwe Eich were an integral group of the American Cultural Revolution, and we are honored to welcome them back as part of the inaugural show,” said Joachim Wunder, the director of Biennale Berlin and Berlin.The inaugural exhibition, “Why Modern Art Matters” will run September 16–September 22. The show will also feature new works by younger, up-and-coming artists, including one by the French Tunisian artist Nadine Afri and the Belgian artist Olu Oulà. The exhibition is curated by Hagee Galleries in partnership with the Berlin-based institution the Mabini Foundation and will be supported with funds from the Märtlicher Kunstverein.\n\n\nThe academic and cultural center Art Kassel in Germany has been awarded an additional $5 million from the federal government in support of its transition to a public art museum that will serve as a cultural hub and a cultural research center. The $4.8 million award", "The next Biennial should be an extension of the successful Biennial Twelve, which took place in 1968. In addition to the exhibition of a selected collection of works, the Biennial should focus on the many ways in which art can connect us to one another and our world. In addition to the exhibition of works within the exhibition, the Biennial will present a series of short films that will explore themes of aging, memory, and memory itself.”The upcoming exhibition, titled “Culture Politics,” will run from March 15 to March 17 and will feature work by sixty-five artists, including Ruth Bremer, Mark di Suvero, and Ursula von Rydingsvard, among others. Biennial owners the Art Institute of Chicago (IIC), which is owned by the Sotheby’s Group, and the Metropolitan Museum of Art (MH) will host the event. The Biennial, which is sponsored by the Sotheby’s Group, New York; the Mitsubishi Foundation; and the Sotheby’s private collection, was organized by the Chicago-based collective Culture Research Group (CRG), which was founded by Michael Sargent and Jody Rog", "The next Biennial should focus on the history of its exhibition, and on the creation of a new permanent collection exhibition inspired by the exhibition. It should also consider establishing a dedicated section dedicated to the history of the exhibition and the artists and institutions that have participated in the event.The exhibition should be centered around the themes of the year, and should present a selection of works in the exhibition. It should also be organized in a way that allows the public to experience the work of the selected artists at various stages of their careers. The exhibition would be divided into three parts, each with a distinct theme. The first part of the programme would consist of performances, films, and documentaries. The second part of the programme would consist of text and ephemera, with a special focus on the body and the body language. The third part of the programme would be a biennial exhibition of art created in the 1990s, with a first edition biennial exhibition of works created in the 1980s to follow.The biennial exhibition would be held at the same venue every year. The project would also focus on the exhibition of work that was created between 1990 and 2000 and would be an extension of the Memorial Museum’s current exhibition “The Body of Art” series.", "The next Biennial should be held in 2021–20. Japanese curator Masayoshi Oda, who curated the first exhibition, “KUSO,” in 2001, has been appointed director of the forthcoming exhibition. The biennial will be held at the Royal Academy of Arts in London, from May 29 to May 29, 2020. The biennial will also include the studio show, “Monash University,” which will be hosted by the University of Melbourne. “The National Gallery of Art has long championed the central role of art in shaping the future,” said David Cameron, UK prime minister. Earlier this year, the National Galleries of Scotland announced that it would open a new thirty-six-thousand-square-foot museum dedicated to the study of contemporary art. The institution will be situated in a former government building in Edinburgh, and will be financed with £8 million from the Scottish Government. The National Galleries of England, which has three locations in London, announced its intention to open a new wing in the capital in 2020. The £10 million museum will house thirty-six artworks by artists such as Matisse, Caravaggio, Van Gogh, and others", "The next Biennial should be held in the city in August 2020.\n\n\nThe German state of North Rhine-Westphalia (NRW) has decided to ban the production and sale of DVDs featuring violent images and has voted to establish a special anti-extremism taskforce. The decision was made in an emergency motion in the state legislature on Tuesday. The bill outlaws the sale, rental, delivery, transport, exhibition, publication, exhibition design, display, performance, performance video-game, and installation of violent videos and images in Germany, as well as the exhibition of violent video or images in a state of public emergency, and establishes a two-year period of evaluation for the bill.The state parliament also approved a temporary suspension of some of the legislation before it goes into effect, but the temporary restriction only covers the exhibition of violent videos, and does not cover online sales or sales with violent themes. Some sixty lawmakers voted in favor of the legislation, which also stipulates a three-year extension for the criminalization of violence against freedom of expression and assembly.The legislation was passed by a vote of 156 to 96, with 39 abstentions. It is slated to be enacted into law by parliament on Thursday. The federal government has thirty days", "The next Biennial should be held in Tokyo in 2020.\n\n\nNew York’s Metropolitan Museum of Art (MCA) is planning to shutter its doors permanently, effective May 23, to allow the city’s residents and visitors more time to enjoy its arts and culture in the aftermath of Superstorm Sandy. The museum announced on Friday that it will begin phasing out fossil fuels and the environment as part of a plan to “recover and stabilize the climate.” The plan is part of the deal struck between New York and New Jersey in the wake of the storm in which the institution will take the first steps toward restoring some of the works on display and into being able to reopen in a few years.“A major goal of the Met, and of many communities across the United States, is to reduce or eliminate fossil fuels and to stabilize the climate,” said Peter Klein, the director of the museum. “This is a critical time for the Met, and we must accelerate our plans to reduce our carbon footprint and to transition to a low-carbon future.”\n\n\nThe Museum of Modern Art in New York has issued a public apology for a new three-dimensional sculpture that critics say replicates the work of feminist", "The next Biennial should focus on the historical and contemporary development of the Scandinavian art and architecture in an effort to return the Scandinavian continent to its rightful place as a major cultural and artistic force in the world. The theme should be “Art from a Nordic Perspective” and should take the form of a biennial exhibition. The exhibition should be organized in collaboration with the Haus Flotte, and should take place only once per year. The theme will be “Japan in the 1980s: From the Fifties to the Seventies” and will be run by artist and curator Nanna Jakobsen, curator of Japanese art and architecture Jiro Saito, and curator of Japanese film Toshiko Kawamori.The 2019 prize ceremony, conducted by the Museum of Contemporary Art in Helsinki, was held on September 29. The jury invited the following artists: Valeria De Sousa, Ozi, Stefan Hägg, Mark Leckey, Jean-Luc Moulène, Vittorio Marini, Antoine Massy, Kinuko Miyamoto, and K-P.The 2019 prize exhibition will be curated by Aina Izagaya and will include works by the following artists: Kunihiko Kawahara, N", "The next Biennial should take place in Hong Kong in the summer of 2021. The title of the exhibition is “The Future Is Present” In a statement, the exhibition said: “The exhibition ‘The Future Is Present’ is dedicated to the concept of the future in the ART/2. The exhibition brings together the best works of contemporary art from different countries and environments in order to draw attention to the current predicament and the possibility of a better future.” The exhibition is organized as part of the exhibition “A History of Modern Art,” which is organized in association with the São Paulo Bienal and will run until March 21.\n\n\nThe Italian artist, known for her conceptual sculptures that use everyday objects and images to explore questions of identity and history, has died at age eighty-six. Inspired by the avant-garde, avant-pop of the 1960s, her paintings and sculptures are set in an vernacular Italian style, often using wood, stone, or plaster to construct interrelated scenarios of myth, history, and mythologies, respectively.Her paintings, which usually depict historical figures such as Cesare Prada, Coppola, and Casanova, often take the form of", "The next Biennial should be held in 2022. In an email to the Museum of Modern Art, a curator at the museum wrote: “The new exhibition ‘Future Present’ will provide an unforgettable glimpse into the heart of contemporary art through the work of a select few artists. The exhibition will include a number of cutting-edge projects by artists who became rich by presenting their work in front of an audience.”\n\n\nLévy Gorvy, the Paris-based art-laundromat chain, has announced that it will cease operations at the Bolshoi Palace of Fine Arts (BGA) in Moscow in March 2022. The decision was made after the Metropolitan State Museum of Fine Arts, Moscow, decided to shut down its collections and run the Kupala State Museum of Fine Arts, which occupies an empty courtyard in the city, in February. The temporary closure of the Kupala and the Bolshoi Art Bases is part of the ongoing measures put in place to protect the cultural heritage of the Russian capital and the country’s capital, as part of the comprehensive conservation program initiated by the state government in 2015.The maintenance of the Kupala and Bolshoi Art Bases was complicated by the reopening", "The next Biennial should instigate a new dialogue between the arts and people from the different communities of Kerala. It should reflect the diversity of ideas, beliefs, styles, and abilities of the various artistic traditions of the state.”For the first time in its 124-year history, the Exhibition will be hosted by the State. The project will be led by the Hirsi-Mesli Museum of Art, which is scheduled to open on January 20, 2020. A museum of cultural heritage in the city, with a capacity of 12,000, is currently under construction at the same site.The announcement led some cultural figures, including the Bollywood actor Amitabh Bachchan, who met the curators of the first edition of the Biennial in New Delhi last week. Krishnan told the media outlet: “I am thrilled that the first edition of the Biennial in Delhi will take place at Hirsi-Mesli. Our first curators, S.M. Krishna and H.R.P. Rupak, remain dedicated to the themes of art and art making and I am confident that their teams will take this event to heart.”The exhibition will be curated by Hirsi-Mesli curator and arts expert R", "The next Biennial should be held in the Winter of 2020-21. The venue will be moved to the Württembergischer Kunstverein in Rech, Germany, and will present the exhibition “Music in Motion” in conjunction with the biennial “Anthropocene” (September 2020 to February 2021).The biennial was established in 1996 by the German Academy of Sciences and the Museum for the Disembodied Body, which collaborated with fourteen other museums and the University of Bonn in Bonn in order to develop a new way of studying the legacy of the great German composer and singer Ludwig Van Beethoven. Two years later, the organization was granted a license to develop a new exhibition, “The Biennial of Beethoven’s Music in Motion,” and this was followed by “Music in Motion: The Past and Present” (2006), “Music in Motion: Where Nature Thinks It Is,” and “Music in Motion: The Negative and Positive,” where the exhibition showcased the work of forty-six artists. The first edition of the Berlin Biennial was held in 2006, and the second edition was held in 2006 to 2007. As the show", "The next Biennial should be held in 2019.\n\n\nThe Museum of Fine Arts (MFA) in Boston announced today that it has received a gift of more than one hundred works from the collection of Robert Schirmer, one of the greatest twentieth-century American artists. The massive collection, which comprises works by artists such as Ellsworth Kelly, Fredrick James Moore, Robert Irwin, and Thomas H. Lee, includes works by artists such as Alison Rohde, Charles Porter, and James Turrell, among others whose works were not previously on display in the museum.“The collection is a reflection of the extraordinary breadth and depth of the MFA’s holdings,” said Jacob Gaiter, director of the museum. “The gifts include works by Bob and several of the MFA’s predecessors. We look forward to adding some of their recent exhibitions to our collections and to supporting the collection’s future exhibitions by presenting new works by their greats.”Galerie Lelong & Co. announced that it is planning to create a new philanthropic program that will provide support to arts organizations through the formalization of their corporate philanthropic partnerships. The initiative is part of a new $1.2 billion package that aims", "The next Biennial should be held in 2021, and the biennial’s second edition will be held in 2022. The 2020 edition, “The Place of the Unseen,” was held at the Museum of Contemporary Art Los Angeles and featured works by fifty-nine artists.\n\n\nThe City of New York has released guidelines for the removal of illegally painted murals in public spaces, including on government buildings, that were installed during the city’s four-year ban on new artworks. According to the New York Times, the guidelines state that the works can only be removed by licensed professionals and that the public have twenty-four hours to leave the area or be arrested for violating the law.The city’s Department of Preservation and Development (DPWD) confirmed to the Art Newspaper that the guidelines were issued in response to the “unprecedented needs and mounting pressures from the public for immediate relief from the persistent legacy of racism and white supremacy in our city and state.” The department is currently working with the state Department of Cultural Affairs on implementing the guidelines, which were issued by the civil rights division of the Department of Buildings and Design, the design bureau, and the architecture firm W.I.M. Kn", "The next Biennial should be held in the autumn of 2020. The theme of the event is “Art in the Age of Black Power.”\n\n\nThe Solomon R. Guggenheim Museum in New York has awarded the first prize in its new $1.7 billion expansion to the Biennial of Contemporary Art (BGC) for its exhibition “Art in the Age of Black Power.” The $1.7 million prize will be presented by the Guggenheim Museum to the institution at a ceremony that will take place at the museum on Friday, October 23.The show, which celebrates the work of seven artists in the Biennial’s first year—Emily Cropper, Kate Halsey, Tawanda M. Willis, and Mo Ibrahim—examines the legacy of the Black Power movement and examines the significance of contemporary art and art history today. It will be presented in the museum’s new building, which was inaugurated by director Alan Lissoni in March 2019, and will introduce new works and exhibitions by artists from the island of Cyprus. “The Guggenheim Museum is positioned in an emerging metropolitan campus in the heart of Manhattan, where the revitalization of the nearby Hudson Yards project", "The next Biennial should focus on the history of women’s photography, and I hope that this year’s edition will be a milestone in the history of photography, greatly expanding the scope of the exhibition and presenting women’s work in the most open and accessible way.”The 2019-20 edition of the Biennial, titled “Camera in my Pocket,” will take place at the National Museum of Women in the Arts (MMVA), Los Angeles; the Museum of Contemporary Art in Miami Beach; and the Skarstedt & Steidl Gallery in Manchester. The exhibition will run from November 17 to November 19 and will be presented by the artist-run nonprofit the Brooke Center for the Arts in London.\n\n\nThe Royal Academy of Arts (RA), the Royal Shakespeare Company (RCP), and the National Galleries of Scotland are among the arts groups that are suing the UK government over plans to leave the European Union (EU). In a joint letter published by the two organizations, they argue that the “decision threatens to cause a breakdown in the UK’s relationship with the EU’s 27 member states’ citizens, businesses, tourists and visitors, and undermines the UK’s international reputation", "The next Biennial should be held at the AMNH in 2021 and will draw between twenty-four and sixty artists. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is working with the Los Angeles County Museum of Art (LACMA) to re-create a replica of the 1929 earthquake and tsunami. Dubbed the Trench, the highly detailed replica will be housed within the museum’s building and will serve as a permanent exhibition centerpiece.The earthquake and tsunami devastated coastal areas in Japan, causing many of the country’s prefectures to sink into the Pacific Ocean. The resulting tsunami inundated coastal areas in Hong Kong, causing major damages. When the tsunami subsided, the museum’s building was constructed and reopened to the public in December of 1929, a full fourteen years after the disaster. The Trench will open to the public in March of 2020.The museum will commission artist Rich Hill to create a new work for the project. The artist previously created works for the museum’s building, including Trench #1, which was on display from 1933 to 1937, and a series of new works that will be exhibited inside the museum in May of 2020. The works will be accompanied by a book", "The next Biennial should take place in the autumn of 2020, at the same time as Arts in Focus. The full list of participating arts organizations is as follows:The Biennial will include performances, lectures, exhibitions, and other events across ten themes. The first half of the festival will focus on the year 2100, with a second half around the year 2021.The 2019 edition was staged at the National Arts Centre in Birmingham and featured performances by artists such as Alex Perretta, Adam Curtis, and Sianne Ngai. \n\n\nThe Metropolitan Museum of Art in New York has appointed Helen Hall as its new deputy director for collections and exhibitions. Hall arrives at the museum from the Metropolitan Museum of Art, where she currently serves as director of exhibitions and collections. Prior to joining the Met, Hall was the executive director of the Karla N. DeBakey Foundation for American Art, where she worked as a curator and school curator. In addition to her duties at the foundation, she was the director of curatorial affairs at the Maritime Museum in New London, England.“Helen is a leader and a true visionary in the field,” said Christopher Schaller, director of the Maritime Museum. “Her credibility and skill", "The next Biennial should be held in the spring of 2021. \n\n\nThe Greek Ministry of Culture announced today that the fifty-six-year-old sculptor and painter Tapan Gersons, who died in Rome on February 6, will be remembered as a generous and committed collaborator who understood the potential of art and of the human condition. Gersons, who was born in Pergamon and studied under the celebrated sculptor Piranesus in Pergamum, was one of the first Greeks to receive the prestigious award of the Cretan and Turinese artist-in-residence, the Pernambuco Prize, in 2011. The Pernambuco Prize is one of the three prizes given annually by the Italian state to artists in the country. The other honor is the Padua Prize, which honors the Italian painter-garde.Born in Pergamon in 1942, Gersons graduated from the small private liberal arts school at the University of Pergamum in Pergamon. He went on to study at the prestigious Institute of Modern Art in Turin, the University of Applied Arts in Rome, and the Academy of Fine Arts in Venice. In 1965, Gersons returned to Pergamon to study", "The next Biennial should take place in the spring of 2021, the day the exhibition was established. The event will feature works from around the world\u0097including work by the following artists: Fiona McEnery, Nicole James, Nancy Parke, Juliette Savard, Kristen Taylor, Léa Turcotte, Simone de Beauvoir, Oéh, and Eleanor Stoll. \n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Stephen Deitch, executive director of the Museum of Modern Art (MoMA), as associate curator of contemporary art. Deitch currently serves as the head of the Art of the Future project at the museum, which has a current exhibition schedule that spans the next four years, as well as a forthcoming exhibition that will focus on the work of artist-run museums.Deitch is currently the inaugural director of the Museum of Contemporary Art (MoMA) in New York and is responsible for building and developing the museum’s collection and programming in the art of the future, which will lead to its inaugural exhibition in November 2021, “The Future of Art: The Next Biennial.” Previously,", "The next Biennial should take place in the spring of 2021. The 2019 event, titled “Ateliers du bistro,” was held at the Museum of Fine Arts in Brussels and marked the first time the festival was held in the city. Museums and cultural spaces in the city were also able to secure additional funding from the Belgian government in support of the theme.\n\n\nThe Museum of Fine Arts (MA) in Boston has become the latest arts institution to announce that it is temporarily closing its doors. The museum announced on Friday that it is preparing to transition its programming and operations from the institution to a new facility in Cambridge, Massachusetts. The announcement follows the announcement of several events that were set to take place in the museum throughout the month of March. The March 14 opening of “In the Realm of MiArt” was canceled, and the March 15 reopening of “Ateliers du bistro” was rescheduled.“MA’s work in the exhibition of the first version of this exhibition has been extremely popular with visitors and critics,” said Mark Masuoka, MCA’s director and chief curator. “Since the exhibition opened in January, MA has been", "The next Biennial should take place at the new Marrakech theme park, set to open in 2022, and then at the museum. The first version of the exhibition will focus on the work of artists such as Joël Siffran, Bertrand Russell, and Ed Moses and will be organized as follows: Art and Murder: Man-Traged Art, 1935–1950 Art, Murder, and Protest: Manifestations of Power, 1915–1945 Art and Society: Martin Luther King Jr. and the Struggle for Civil Rights From the Archives: Nine years after the assassination of Martin Luther King Jr., the artists who participated in #BlackLivesMatter protests are reevaluating their practices and reexamining the relationships between art and violence. “I am extremely honored to be able to be a part of the inaugural Biennial,” said Naima J. Keith, chair of the Gallery’s board of trustees and cofounder of the artist-run nonprofit Beyond Cruelty. “I’m hopeful for the upcoming exhibition, as well as the courage and tenacity of the artists and institutions that are participating and for the international community to come together with them.”The", "The next Biennial should be held in 2021 and the last in 2024. The art of fiction is a subject that is rapidly undergoing a renaissance as well. In the past few years the institution has been transformed from a large-scale literary exhibition to a multimedia project, became a venue for community engagement, and has transformed from a lecture-and-gallery venue into a multimedia experience.“I’m excited to continue to support the Biennial through the 2020–2021 season as we continue to increase our exhibition-based programs through participatory and collaborative artistic practice,” said Peter Bauer, director of the New York Public Library, and chair of the biennial’s board of trustees. The Biennials have also expanded their exhibition-based programs during this unprecedented global health crisis. In the past ten years they have drawn more than twenty hundred visitors. The 2019 edition, “A Feast for Crows,” a collaboration between artist Miranda Lemon and the same-sex lesbian couple whose story inspired the HBO series The Strain, drew more than six hundred. The 2020 edition, “The Bones of What’s Inside,” will showcase the work of twenty-five artists.\n\n\nThe Solomon", "The next Biennial should take place in the year 2021. The 2019 edition of the event, titled The Biodiversity of Art, was set to take place in Los Angeles in the fall of 2020.Over the years, the biennial has featured works on architecture, the environment, the history of art, and the environment in artworks, as well as the works of artists such as George Lucas, David H. Koch, Mark di Suvero, and Mark di Suvero Jr. The first iteration of the event, titled The Biodiversity of Nature, was held in the spring of 1988. Since then, the show has been held annually, and the biennial has been staged in various locations, including New York, Venice, London, the Grand Palais, the Museum of Fine Arts, Boston, the Museum of Modern Art, London, and the Sydney Opera House. The 2019 edition, titled The Biodiversity of Life, marked the centenary of the founding of the  and featured work by the artists Jonathan Algernon, Peter Fallow, and Katja Kross.\n\n\nThe New York Museum of Modern Art (NYMoMA) has added five new artists to its collection, bringing the total number", "The next Biennial should take place in August 2020 and will be hosted by the Embassy of the United Arab Emirates in Abu Dhabi. The exhibition will focus on biennial studies of the question: Who is a Muslim and what does it mean to be a Muslim?The 2019 edition of the exhibition featured works by sixty artists and was organized by the Embassies of Senegal, Ethiopia, Bahrain, Canada, Egypt, and Morocco.\n\n\nArt historian and curator David Sirota, who was tapped to director of the Metropolitan Museum of Art in New York last month, has resigned after just ten months on the job amid the ongoing protests against his appointment. In a statement released by the museum on Tuesday, Sirota said that he decided to step down because he “abdicated his leadership role because of a personal conflict of interest stemming from a personal relationship with a contemporary that has no place in an institution that intends to advance an understanding of art history.”While most of the criticism surrounding Sirota centers on the conflict of interest surrounding his appointment, the museum itself has faced backlash for aligning itself with a major donor to the arts—the Ford Foundation—and for supporting the museum’s $3 billion renovation. The museum also faced backlash for its", "The next Biennial should take place in 2020 and will take place on the campus of the European University of Copenhagen (ED) in the capital city. The exhibition will be divided into three parts and will include works by internationally renowned artists in its inaugural year. The first part will be dedicated to a selection of selected works by Danish artists Hans Christian Andersen and Lars von Trier, the second part will include works by artists such as Tani Shino and Jørn Rasmussen, and the third part will include work by local and international artists from the Far North. The exhibition will be presented in partnership with the Copenhagen Art Museum and will receive a financial grant from the Danish government. The exhibition will be organized for the duration of an institution’s existence, with the option of extending the exhibition, and will feature works from the collection of Rødby Pedersen, the director of the Danish collection of Claudia Brevet and Peter Wächtler, as well as works by various other Danish artists, and will be inaugurated by an exhibition of Claudia Brevet’s Mining Art, 15 August 2020. The series will be presented without the participation of the Burke Norgazes, a", "The next Biennial should take place in the Spring of 2021.” In the meantime, the US will continue to work towards reducing the global pressure on the world’s oceans by introducing legislation that will prohibit the dumping of materials from ships that are currently operating in international waters and will work together with industry, academia, and NGOs to develop practical solutions to climate change.\n\n\nItaly has announced plans to establish a new $2.5 billion fund to support small and mid-size arts and cultural institutions in the country. The arts and culture ministry will allocate $1 billion over ten years, and the federal government will absorb the remaining funds through a series of tax increases.The Cultural Heritage Fund (Cf.F.) is planning to raise $1.2 billion over the next four years. In addition to the funding for small and mid-size arts and cultural institutions, the fund will also provide assistance of up to $500 million for cultural heritage protection, recovery, restoration, conservation, and conservation management.The new fund will be made up of two components: a quota for the production of cultural heritage and a fund for the production of cultural heritage products and the preservation of cultural heritage. The fund will lend Italian artists and filmmakers a new source of", "The next Biennial should be held in 2022. The full list of participating artists is as follows: (1) Alberto Barbera’s The Atom, (2) Alex and Robyn Kool, (3) Alfred K. Brescia’s Atom & Time, (4) Agnès Cawthon’s The Atom, (5) Bernardo Bulteville’s Atom and Time, (6) Caroline Bove’s Atom, (7) Carlotta Cipolloni’s Atom & Time, (8) Carol Slavin’s Atom and Time, (9) Cassandra M. Salerno’s Atom, (10) Catherine Parr and Bettina Pindell’s Atom, (11) Daniel Spero’s Atom, (12) Eddie Schlegel’s Atom, (13) Edvard Stiegler’s At", "The next Biennial should be held in the summer of 2021, and the first Biennial in June 2022.\n\n\nThe Seattle Art Museum (SAM) has appointed Rina Banerjee as its next director. She will assume her new post on January 31, 2020. Banerjee joins the museum from the San Francisco Museum of Art (SFC), where she has served in the role of chief of collections since October 2019. She assumed her new role on January 12, 2019, and has served at the institution since November 2019.Commenting on her new role, Banerjee said: “The Seattle Art Museum is an exceptional institution with a rich, international history and an impressive collection of art. I’m excited to work with the talented team and devoted staff of the Seattle Art Museum to build on their outstanding work in making it a global leader in art and art history.” Banerjee was appointed to the position by former director and CEO Mark Beasley. The appointment was made possible by a $300,000 grant from the Robert D. and Patricia Wilson Foundation, which raises funds for the Seattle Art Museum.Prior to joining the Seattle Art Museum in 2015, Banerjee served as a curatorial assistant in the collections and exhibitions department", "The next Biennial should be held in September 2022. The theme of the next edition is “Scholarly Responsibility,” and the exhibition will be an exploration of how scholars can serve and serve others. “We thank the public, the exhibition organizers and the members of the jury, as well as the curators for their candid opinions and for their collaboration in this project,” said composer Berthold Reichert, who organized the exhibition. “The Biennial is an enormous undertaking, and we are deeply grateful to the artist-collectors, the curators and the historians who have contributed to its development.”The first time the symposium was held was in 1987, shortly after the publication of “Philosopher” by Rodolphe Barlow, who initiated the series in a drawing room in his home in Paris. Barlow, known for his deconstructivist practice, is best known for his Constructivist-inflected art, which is often conceptualized as art that is constructed from disparate materials and is composed of at least four overlapping narratives\u0097one of which is the artist’s vision of a work as an instrument for the study of art history. It is a conceptual approach that", "The next Biennial should, hopefully, be held in late summer. The next will be held in late autumn. The next will be held in early December.”\n\n\nThe Museum of Fine Arts (MFA), Boston has appointed David Sirota as the new director and CEO of the Massachusetts-based nonprofit arts incubator the Fund for Contemporary Arts (FCA). In his new position, Sirota will oversee the development of financial and curatorial support for artists and small to mid-size contemporary art organizations and will oversee the design and execution of the $10 million David Sirota Contemporary Art Fund, which was established in 2016 to provide funding to artists in Boston.“David has been instrumental in supporting the Fund since its inception, and he has proven his ability to build upon the Fund’s legacy of fostering the work of emerging and established Massachusetts artists,” said Bonnie Strauss, the MBTA commissioner and chair of the board of trustees. “At this time of historic change, when the Museum of Fine Arts Boston is undergoing a major renovation, the Fund’s vision of supporting artists and supporting the arts is critically important. David has a proven track record of working with artists and artists groups to help them realize", "The next Biennial should be held in 2021, and the venue should open in the summer of 2022. The exhibition “will offer an extraordinary range of artists and venues to participate in the exhibition, combining a reflection of the latest international trends and domestic practices with a strong contemporary cultural perspective.”\n\n\nMaureen Ryan, who cofounded the nonprofit National Gallery of Art in Washington, DC, with her husband, Doug, in 1975, has died at age ninety-three. They had planned to open a new institution in the city in the summer of 2021, but the 2014 collapse of the show caused them to suspend the project.“Founded to support the work of marginalized artists, the National Gallery of Art has represented marginalized perspectives on art through exhibitions, educational initiatives, and fundraising,” Ryan told the Museum of Fine Art in Boston in 2016. “It has been a constant process of creating new art that was thought-provoking, that challenged conventions of the gallery, to the public, and to the museum. In the process, it has enriched the lives of countless artists and has made the gallery a very vibrant, very visible community.”Born and raised in New York City, Ryan grew up in a diverse network of artists that included", "The next Biennial should be held in 2020.   The cinema biennial, which originally was set to be held in the city of Biennale di Venezia in March 2019, was canceled owing to the ongoing conflict in Syria. The biennial’s organizers have since blamed the cancellation on the organizers’ lack of communication with local residents. The event’s full list of participating artists is as follows: 1. Max Mara, New York, NY, USA: Max Mara, the first artist to have his work exhibited at the event, has been awarded a $25,000 MacArthur Genius Grant. Max Mara is also a MacArthur Fellow. 2. Alexander Calder, Los Angeles, CA: Alexander Calder has been awarded a $25,000 MacArthur Fellowship. Calder has been working on a series of videos for the exhibition that will run for twelve months. He is currently working on a book about his art. 3. László Nemes, Budapest: László Nemes has been awarded a $25,000 MacArthur Fellowship. Nemes, who is known for his anthropomorphic sculptures, has never before received a MacArthur Fellowship.", "The next Biennial should be held in 2021. The national conference is currently online, and the next edition will be held in London. The date of the exhibition is as yet unannounced. Source: Artforum via Artnet News, Artnet, Artforum, Artnet News, Artnet, Artforum, Artforum, Artforum, Artforum, Artforum, Artforum, Artforum, Artforum, Artforum, Artforum, Artforum, Artforum, Artforum, Artforum,\n\nThe twenty-fifth edition of the Berlin Biennale, held at the city’s Büro Reeperbahnhof, has announced that it will be held from September 10 to November 1, 2020. Organizers say that the event will be an extension of the exhibition “The Future Is All Around Us,” which opened on September 7, 2020 and ran until November 1, 2020. “The impressive exhibition’s programme of two hundred works and the immersive multimedia experience included in the event will be of real interest to contemporary and future-oriented art lovers,” said BIDMA director and chair", "The next Biennial should also examine the legacy of the late sculptor Naguib Mahfoujimi, who taught at the School of Art from 1923 to 1950. “Naguib was a phenomenologically gifted sculptor who is most closely associated with the 1963 workshop ‘García Nava’s’s’s ‘Forms of Beauty.” The present exhibition is part of the first year of the Biennial, which will take up issues of “consciousness, memory, and the universe.” The first edition opened at the museum in January. The second edition opened at the Museum of Modern Art in New York in March.\n\n\nThe National Gallery of Scotland announced today that Elizabeth Ann Macgregor will become its next director-general. Macgregor comes to the institution from the Royal Academy of Arts (RA). She comes to the institution from the University of the Arts Glasgow, where she worked as a curator for five years and curated exhibitions such as “A Pathfinder” (2015–16) and “The Best Exotic Marigold” (2016).Macgregor joins the National Gallery of Art from the University of the Arts London, where she has served", "The next Biennial should be held in 2021.\n\n\nThe Solomon R. Guggenheim Museum in New York has appointed Lucy Lippard as its next director. Lippard comes to the institution from the Traveling Museum of Art, where she helped to launch the New York–bound Biennial of Living Arts in New York, which closed last year after being in production for eighteen months. From October 2019 to November 2020, she served as a guest curator at the Museum of Modern Art in New York, where she collaborated with artists such as Patricia Arquette, Joan Armatheides, and Francis Guyot.“Lucy is a leading curator of post-World War II art and a scholar of cultural history,” said Museums United States director and CEO Krista Hamilton. “She brings a deep and compelling understanding of the role of the Guggenheim and an enthusiastic and compelling desire to improve our relationship with the museum.”Lippard joins the museum from the Traveling Museum, where she has served as the director since 2003. During her tenure at the museum, she organized twenty-four exhibitions, including “The Power of Paintings” (2011", "The next Biennial should be held in the spring of 2021.\n\nThis is the third year that the United Kingdom will host the exhibition. The exhibition will once again be staged in the UK, in partnership with Tate, at the English National Gallery (ENGM), in London. The biennial will be held alongside the 100th anniversary of the Royal Shakespeare Company and will run for four weeks.\n\n\nThe Metropolitan Museum of Art (the museum) in New York has received an additional $1.1 million from the city for its construction of a new, more than two-mile-long exhibit dedicated to the life and work of Pablo Picasso. The institution is expected to open the new Picasso: The Art of Paintings pavilion at the new Metropolitan Sculpture Garden in 2020.The Metropolitan Museum of Art has received $1.4 million from the city for its construction of a new Picasso: The Life of Pablo pavilion on the Met campus, located at 132 East Twenty-Second Street, in the summer of 2018. This new pavilion will include sixteen new works by the artist and will be inaugurated by a group of ten artists, including Gedney, Zora, Barth, Mark, and Urban G, for a solo installation", "The next Biennial should showcase the work of the nineteen-thirty-six-year-old artist in a manner that may be perceived by the public. We strongly believe that this exhibition should be a reflection of the artist’s preliminary experiences, and that the exhibition should be the occasion for a dialogue between the artist and the public.”As part of the institution’s symposium on the life and work of Klaus-Dieter Malsbach, the artists will be shown a selection of Malsbach’s sculptures that are currently on display in the exhibition “Boschbieter Kunstbau,” which will open on July 24. A selection of the artist’s other works will also be presented in the exhibition. The biennial will be followed by an exhibition at the Nationalgalerie in Berlin on September 22. The next installment of the show will be held at the Nationalgalerie in October.\n\n\nThe J. Paul Getty Trust in Los Angeles announced today that it is raising funds for the construction of a new public artwork in honor of the Getty’s eighty-three-year-old founder, J. Paul Getty.  The trust is donating $125 million to the", "The next Biennial should be held in 2020 and is scheduled to run from November 3 to November 5, 2020. The next edition will be staged in Los Angeles.\n\nThe Hong Kong Art Museum (HKMA) has announced that it will reopen to the public on January 10, 2021. The museum, which was closed since March 13, has been working to open again since April 21. “After a thorough and long-overdue reopening in March, the museum is now ready to welcome a new generation of visitors to the museum,” said director Ping Wong. “We are committed to implementing the high-quality exhibitions and programs that will allow the museum to thrive as a cultural and intellectual hub for the city.”The museum, which is housed in a former munitions factory on the city’s outskirts, was forced to close on March 13 after the factory’s owner, KWS, filed a lawsuit against the museum and others in an attempt to stop the museum from reopening. As part of the settlement, KWS agreed to pay HKMA $1.3 million.The museum has since been awarded nearly $5 million in damages. The rest of the damages were awarded to Christine Lee, Kathleen Lam, and L", "The next Biennial should take place in 2020 and is expected to draw around ten thousand visitors. The decision to cancel the show was made in the wake of the shooting at a gay nightclub in Orlando that took place on Saturday, June 12, 2016, the night of the theme-park shooting. To make up for the missed exhibition, the Louvre announced on Tuesday that it would allocate 25 percent of its business on its online platform to the 2018 show “The Artist’s Body: Art in the Age of AIDS.”The Louvre announced the schedule of events for the biennial on its website, which stated that the exhibition will focus on “instrumental art”\u0097a term that encompasses “meditative art”\u0097and will be organized around the themes of “life at its most immediate and personal level.” The exhibition will be curated by Nathalie Balsom, director of the Stedelijk Museum in Amsterdam, and will run from June 11 to June 14. The rest of the seventy-four-city event will be online.According to Artnet, the exhibition will be divided into six sections: “The Body,” “Meditation: Creative Life and the", "The next Biennial should include an exhibition by artist Rina Banerjee and a selection of works by the Israeli curator Haim Saban. The event will also include a lecture by the director of the School of the Museum of Art, the Museum of Modern Art, and the Institute of Contemporary Art, London, and an open-air performance by the internationally acclaimed choreographer, actress, and songwriter Rainer Maria Rönch.The Venice Biennale will be held in the Veneto, in the latest addition to the city’s historical center, in the city of Venice and will run from March 16 to March 22. The event’s inaugural edition took place in Venice in March 1973 and featured works by forty-seven artists; this year’s edition, titled “For the Future of Art,” will focus on the role of art in shaping social change and will feature works by twenty-one artists. Though originally scheduled for March 20 to March 22, the event will now take place from March 21 to March 23. The biennial will also be moved to Venice’s Punta della Dogana, a former Roman Catholic basilica that housed the Grand Council of the Church of Santa Maria Vittorio de Bonis", "The next Biennial should take place in 2021, and at a future date, the artist-run museum will present a special exhibition dedicated to the work of Mira Dancy, whose work is numerous and varied, and will be inaugurated by a presentation by the French-American artist Holger Hollein, whose work often incorporates puppets, fish, and anthropomorphic figures.The exhibition will be followed by a retrospective, “In the Reflection of a Fish,” which will be held at the museum in 2018, and a “Future Present” which will be organized by the artist—the seventy-six-year-old Dancy—in 2022. The other works in the show will be the artist’s first solo shows at the museum since 1985, and “A Dinosaur Named Bara.”The selection of the work by the American artist-activist and writer, whose work has been exhibited in numerous internationally-acclaimed biennials and was included in this year’s Venice Biennale, was based on her suggestion that the biennial should be centered on the theme of the next generation, one that would draw from the biennial’s existing collections and portfolios.“It is an ambitious", "The next Biennial should be held in 2022. The project team will work with the public and local communities of the Central African Republic (CAR) to promote awareness of the grave situation and the importance of food security and nutrition in CAR, and to assist in the reopening of schools and community centers.The project was backed by the Philippine government and the Congo-Romanian Alliance for Democracy and Transition; the Anglo-American Development Corporation; and Artists Fund. The exhibition will focus on the theme \"How to Live and Work in a Time of Crisis: ‘Alliances and Conflicts in the Age of Mass Incarceration.’“The exhibition is part of the ongoing work of the public and the project team to create awareness and the building of an appreciation of the importance of food security and nutrition in CAR,” said Janine Ashworth, executive director of Artists Fund. Ashworth added: “This exhibition will help promote the work of the participants in the next Biennial, which will be held in 2025. The work of these artists is not without its own challenges, but they have given their all to create a new work that will draw attention to their vision of a future in", "The next Biennial should take place in Shanghai in 2021, and then in Hong Kong in 2022. In the meantime, the Museum of Contemporary Art Shanghai has already announced that it will suspend operations at least through the end of 2021.The Chinese government has also pressured local governments to raise funds for Museum of Modern Art (MoMA), which is currently undergoing a $3 billion expansion. The New York Times reports that Chinese officials have donated $500,000 each to MoMA and the Museum of Modern Art. MoMA director Edward DeMarco told the New York Times that the money would go toward the construction of an additional 40,000 square feet of museum space in the former Ford plant, which is located on the ground floor of the former Scudder & Bockel building. While MoMA has requested $4 billion for the project, the museum has been working to raise as much as $300,000 for the last year.The Chinese government also announced that it will offer $1.5 billion for the cultural site of the ancient Silk Road in the southern city of Hangzhou, which has been a major cultural site since the early 1900s and is currently undergoing a $2.1 billion facelift. The announcement has drawn criticism from some Chinese officials", "The next Biennial should focus on 'The Art of Surrealism,” which will be presented by renowned contemporary sculptor Pierre-Auguste Renoir. The exhibition will include works by more than twenty artists whose work is currently on display in the exhibition “The Life and Death of Surrealism: From the Painters to the Modernists” (2019) at the National Museum of Modern Art in Paris.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that John C. Wright is permanently leaving the institution to head the second exhibition of his three-decade-long career at the institution. He succeeds Rachel Jacobs, who will continue to serve as director for the museum as part of its new partnership with the Los Angeles County Museum of Art (LACMA) as well as the Cooper-Hewitt, Smithsonian Design Museum, and Los Angeles’s Hammer Museum.“John is a gifted curator, educator, and author whose work is grounded in an understanding of the natural world and inspired by the ideals and perspectives of his predecessors,” said MCA director Madeleine Grynsztejn in a statement. “John will continue to shape LACMA’s vision of", "The next Biennial should be held in 2022 and will consist of twelve films based on the themes of the exhibition. The first film, “Dangal,” will be a biopic of the late Indian artist and writer: “Ravikings,” slated for December 2022, and will be shown at the show’s sister event, “Internal Alchemy,” which will run December 21–December 27. The second film, “Asobi,” will be a composite of three films: the first film, “Hindu Gods and Goddesses: The Biennial of India” (2019), will be followed by “Sambikal Stupathi” (2019), “Jagdish Trivedi” (2019), and “Lal Bazar” (2019).\n\n\nAmerican actress Jessica Chastain, known for her roles in such films as The Queen and Ms. Pollock, is suing the Metropolitan Museum of Art (MoMA) in New York City, accusing the institution of discriminating against her by refusing to renew her contract after she declined to alter her body in a close-cropped dress in a billboard by the artist Georges", "The next Biennial should bring together around sixty artists of every national background and provide a platform for diverse artistic practices and build on the work of artists whose practice explores the power and fragility of human interaction. The exhibition “Innocence” will highlight the work of indigenous and international artists whose bodies and practices are still deeply impacted by the trauma of captivity and the lived experience of indigenous peoples. The exhibition’s inaugural iteration, “Over the Edge: Arundathi and the Indian Art of the 1970s” (2019) reflected the diverse histories and practices of indigenous and international artists in the exhibition.The first show at the newly created museum is “Demian Diné” (2019), which will include the work of twenty-four artists and is slated to open in 2021. The show will feature work by fifty artists from forty-two countries and will run for twenty-four weeks. The inaugural exhibition “The Untold Story” (2019) will feature work by thirty-two artists from twenty-two countries and is set to open in 2020 and will be followed by “The City of Spites” (2019), a show of work made within the context of the city of Spites, and �", "The next Biennial should be held in 2020 and will run until March 2, 2021.For the first time, the museum will be using the Nelson-Atkins’s new building on the campus, which is being constructed by the private firm of McKim & Moreschi, to house its collection. The move is part of the reopening plans for the museum, which was originally scheduled for a March 26 opening but was pushed back due to the Covid-19 pandemic.“Nelson-Atkins Museum of Art is reopening,” said museum director Michael Wootton. “We have implemented new and innovative ways to support our staff and visitors. The new buildings, which include more exhibitions and a collection center, are designed with a new philosophy to support a larger audience for a more diverse collection. We are rapidly approaching a time when we will have more visitors coming to Nelson-Atkins than ever before and we are confident that the museum will make a wonderful comeback.”The institution has also made significant investments in its collections over the years. In 1998, the institution purchased the collection of the British architect Frank Gehry, and in 2004, it replaced its existing building with a new school, restaurant,", "The next Biennial should take place at the Panorama Sculpture Garden in London in 2021. The announcement of the dates for the inaugural event was made by curator Marina Mayak.\n\n\nThe National Gallery in London has added fourteen new works in its exhibition “After the Fall.” The exhibition, which will run from March 23 to March 26, 2020, will feature thirteen new works by twenty-nine artists including Joël and Olivier Messé, Clement Greenberg, and Tanya Bonakdar. The show, which will be curated by Christa Blatchford, will feature new works by artists such as John Cooper, Greta Gerber, and Ed Moses and will visit various locations in the United Kingdom including Whitechapel Gallery, the Whitechapel Gallery, the Whitechapel Museum, the National Gallery, and the Tate, including the Tate Modern and the Tate in London.The biennial, which will meet the National Arts Centre (NAC), will engage with work by over seventy artists, including Maya Lin, John Cooper, Tanya Bonakdar, Alan Hale, Claire Mayhew, Marta Mille, Adam Moorhead, and Maggie Teight. The thirty-two year-old NAC director,", "The next Biennial should be held in 2021, and the first in 2022. The public will be able to visit the collection, which consists of approximately ninety thousand ceramics, by appointment only. If the project is successful, the institution will become the first museum to hold every single work by the artist in its collections. Nirvana Biennial is also collaborating with the Museum of Modern Art in New York to organize a special exhibition of art from the artist’s collection. Since the series of exhibitions will feature a variety of works, the exhibition will be themed “Nirvana: The Objects.” The show will open on September 21 and will run through December 17. The Petersen Museum of Art in Seattle is also collaborating with the artist, whose works are often associated with the Pacific Northwest. During the documentary project, Ms. Fujioka will visit the Petersen Museum in order to take photographs, film the installation, and perform a song by the American band Arcade Fire. “Nirvana’s art has a deeply spiritual and humanitarian dimension,” said Ms. Fujioka. “Many of her works, including her work for the first exhibition of her body in Japan, ‘The Wind and Rain", "The next Biennial should also include a survey of the contemporary art of the United States, featuring works from the U.S. and around the world. In late 2019, the bureau will hold its first exhibition dedicated to contemporary art in Japan.  The 2020 event will be held at the same venue as the 2019 and 2020 editions.\n\n\nThe Taipei Fine Arts Museum (TFAM) has revised its exhibition program and has added several new works by artists from Iran and Mongolia. The institution has also introduced new programs that involve the exhibition of selected works by selected artists and new online viewing rooms for existing shows. The new works are themed “Oriental Grasslands” and “Judaism within the Landscape.” The exhibition “Oriental Grasslands” is a new series of exhibitions that will highlight work by thirty-four artists. In addition, the institution plans to present the first work by a Mongolian artist in the United States.According to the museum, the changes were made after a thorough evaluation that considered the diversity and contemporary relevance of the work presented on both traditional and modern installations, as well as the cultural and social presence of the works in the museum. “These are difficult and difficult times,�", "The next Biennial should be on the 15th October and will be hosted by the city of London and the Museum of London on the campus of Oxford University. The exhibition will be divided into three parts and will run for two weeks. Exhibitions will be themed around the historic and current events and will feature contemporary art from the Biennial of David Adjay. The exhibition will be broadcast live on BBC Radio 4.Commenting on the upcoming event, Andrew Medlock, director of the London-based firm Wellcome Collection, said: This is an exciting time for the city as we begin to welcome visitors again after a brief closure due to the Covid-19 pandemic. With the help of our talented curators, the Biennial will present a truly international selection of contemporary art in October and November. We are all looking forward to seeing what the city has to offer.\n\n\nNew York’s Lincoln Center, which is working to reopen in the aftermath of the pandemic, has postponed its March 20 debut. The March 18 announcement of its reopening was made amid reports that the center will see a significant drop in visitors in early April. While the center confirmed that there is no timeline for resuming operations, the March 21 announcement of its", "The next Biennial should take place in the spring of 2020, and should present a selection of work by twelve artists, including Izabella Bochereau, Jessica Anastasia, and Saul Arslan. The exhibition will also be hosted by the Museo de Arte Contemporanea in Madrid.\n\n\nThe Carnegie Museum of Art (CMA) in Pittsburgh has appointed Akira Tozawa as its next director. He succeeds John DeWitt, who retired on January 31 after twenty-six years at the helm of the institution. Tozawa joins the CMA following a ten-year stint as the director of the California Institute of Technology (Caltech), Los Angeles. He succeeds John Smith, who was hired to lead the CMA in May 2019.“The CMA is looking forward to working with Akira Tozawa as we embark on our next chapter,” said director Michael Govan. “An animated, conceptual, and spatial work by a former Caltech graduate student of mine is a perfect fit for the CMA, which has a long history of bringing innovative and ambitious exhibitions and education programs to the West Coast. We are eager to work with Akira, whose career and reputation will be catapulted by his next", "The next Biennial should center around the creative and social life of Antwerp, with a special focus on the city’s cultural and commercial district. It will be a forty-minute journey from the city’s central train station, the Centre Pompidou, to the centre of the city, on the Potsdamer Straße, and will feature a selection of artists, including Tobias Madison, Lourdes Anagnos, Katja Maria Prast, and Kazuko Tange.The event will be held internationally on the new year’s day, when it will celebrate the end of the year with an exhibition of works by twenty-four artists in the city of Antwerp. The biennial will also feature a virtual exhibition, an online community space, and an open-air sculpture garden, as part of a public scholarship program, and will be inaugurated by a public concert featuring performances by a selection of artists and cultural figures, including the mayor of Antwerp, Thomas de Maizière, and the architect Christina Mohr.The program will be presented by the Potsdam Institute for Contemporary Arts and the Antwerp Festival. The central organizing committee comprises artist Wouter Wirschbaur", "The next Biennial should be held in late October or early November, in March or June. Chaired by artist-in-residence Egidio della Francesca, the festival should draw about twenty-five thousand visitors.\n\n\n\n\n\n\n30th Biennial of Modern Art, New York, 2019. Photo: Alan Flanagan.  \n        \n\n\n\n\nThe Institute of Contemporary Arts (ICA) in London announced today that Miranda Janes will receive the 2019 prize in recognition of her contributions to modern and contemporary art and the ICA Art Prize, which recognizes artists who have made significant contributions to the art world’s contemporary art history.Janes, who is also a curator and writer, is the recipient of the ICA’s 2019 Laureate Award, which was established in 2018 by the ICA’s board of directors, and the 2019 ICA Anatomy Prize, which was established in 2018 by the ICA’s board of trustees. The laureates will be announced in March and the Anatomy Prize will be awarded in early April.The laureates are:Ellen Chiu-Suely, Rujeko, New Zealand;Pam", "The next Biennial should aim to immerse the gallery into the city and address the challenges of acquiring and storing works in a timely manner, as well as working with artists and collectors in collaboration with the artworks, as well as with the city of Los Angeles.” This year’s event, “Italia Bicentennial: From the Depths of Storage,” will take place across the city’s Museum of Contemporary Art (MoCA), Broadway, and Alameda County’s Presidio Theater. The event will also feature performances, readings, and other activities. The 2020 edition will be held in March.\n\n\nAhead of this month’s exhibition “Tit for Tat,” which will run from March 13 to March 15 at the Chinese Contemporary Art Museum Beijing, the museum announced that it has suspended its March 13 opening as planned. The announcement follows a mysterious and alarming delay. The museum was already planning to hold the first public exhibition of its new project series, “Gemini,” in early March. The show, which will be held at the museum for three weeks in April—the longest run of artworks in its history—was to open the following day.", "The next Biennial should be held in 2020 and will involve the collection and display of works in its entirety. The Biennial will also receive funding from the Fine Art Gallery of Ontario (FAO), the Ontario Museum of Fine Art, and the Canada-France Fund. Jordan is working with DAVID FOSTER, curator of modern and contemporary art at the Museo de Cultura Pueblo, in Mexico City, to present the inaugural edition of DAVID FOSTER’s “Eternal Curators.” Among the artists whose works will be presented in the exhibition are Eddie Andrews, Andrea Balsom, Virginia Kocher, Julian Krankenberger, Andrea Guarani, Rebecca Johnson, Tommie Smith, Alexandre Paré, Malcolm Smith, and Albert Wootton.\n\n\nThe Metropolitan Museum of Art in New York has appointed Tarek Atoui as its new executive director. Atoui comes to the institution from the Bronx, where he is cofounder of the Bronx Museum of the Arts, where he oversees the programming and the collections department. He succeeds Sarah Patchett, who has led the museum", "The next Biennial should come in 2020, but our original plan is to put the exhibition at the Museums in the first half of the year, at the Panel Museum in the second half of the year, and at the Auditorium in the middle of the year.The museum is also working with the National Geographic Society to create a biennial of historical art. Other partner institutions include the Museum of Modern Art, the Metropolitan Museum of Art, the Hirshhorn Museum, and the Whitney Museum of American Art.\n\n\nThe Hirshhorn Museum and Sculpture Garden in Washington, DC, is planning to reopen in two years. The restoration and renovation of the landmark building, which was completed in 1966 and completed in 1982, will begin with the installation of a new sculpture garden in the museum’s main building, which will be completed in 2020, and will continue throughout the restoration and renovation of the building’s interior. The garden will re-emerge the third floor of the museum in 2021.According to the New York Times, the Hirshhorn, whose longstanding history includes being considered one of the most important cultural centers in the United States, is closely following the opening of the new space, which will be inaugurated by the work “", "The next Biennial should be held at the Greek island of Kos, where a new exhibition will debut in January 2020. Governor Kirill of the Republic of Nagorno-Karabakh, who is currently in the process of settling the conflict-torn region, had announced that the event would take place in the capital city of Nagorno-Karabakh between February 21 and February 23.According to the Art Newspaper, the redevelopment of the Warhol Museum in New York was one of the main reasons why the institution selected the date: It was planning to commission the artist for a new exhibition, “Not so much a retrospective,” as a “portrait.” The work will be on view in the museum in November 2020. The exhibition will feature work by forty-five artists, including Alfred Stieglitz, the eponymous Eisenstein; Anna Atkins, the wife of the American painter Robert Atkins; and Svetlana Savchenko, the wife of the Russian avant-garde painter Alexander Soskina. The list of participating artists is as follows:Akira Nakamura (Japan)†Hiroko Kondo (Japan)“The Balance of Nature: A Japanese Perspective” (Japan", "The next Biennial should be in January 2022. Suellen told the Art Newspaper that the decision to move the exhibition was not related to the coronavirus, but rather to the fact that the exhibition’s opening date had been pushed back to February 20, 2022. He also said that the exhibition would be “more interactive” and “more architecturally immersive.”The biennial was informed of its postponement on Tuesday, February 13. The exhibition will now be held in March 2022. \n\n\nThe Fine Arts Museums (FAMo) in New York and the Solomon R. Guggenheim Museum in New York will begin welcoming visitors in early March. The dates to open the new museums with a new \"storm deck\" of glass and steel sculptures in the fall have yet to be set, but the institutions will announce the dates once the safety measures to prevent the spread of Covid-19 have been fully implemented.“It is imperative that we remain vigilant to avoid over-reacting to the outbreak and to focus instead on ensuring that our curators, artists, and staff have the support and resources they need to bring their art and craft to life in the coming weeks, months, and years,", "The next Biennial should be held in 2021, according to the organisers.\n\n\nTwo hundred individuals will descend on Palazzo Rosso located in the Punta della Dogana region of Umbria, Italy, on November 11–13 for the third edition of the biennial, titled Espacio di Togli. Dubbed the Legacy of the Spaghetti, the event will examine the legacy of the 20th century Italian architect and designer Stefano Cattelan, whose influence can be felt in the projects he designed for the region, including the Punta della Dogana’s Alpenglow Garden, which was completed in 1989 and opened in 1990, and the construction of the Punta del Depeche in Cagli, Italy, which opened in 2011 and has since become a landmark in the heart of Venice.“Espacio di Togli’s theme of the vernacular and the arts is equally applicable for a cultural landscape with an artistic heritage situated at the intersection of the Piedmont and Venice,” said Francesco Cattelan, the Italian architect and designer who designed the Punta della Dogana. “It is a delicate", "The next Biennial should be in January 2021. \n\n\nA group of artists participating in the Venice Biennale have appealed to Italy’s cultural authorities to take further steps to protect their future exhibition programs, because of the current economic crisis. The artists’ proposal to hold a special exhibition dedicated to the history of art in the city of Venice in 2021 was made during a discussion held Tuesday between Italian and French art historians and curators, and was part of an initiative organized by the artists to highlight the excellence of one hundred works by the sixteenth-century Italian architect Ettore Pareto.In a letter published by the organizers of the exhibition, the group said that the exhibition was not meant to be “an ‘art for everyone’ but an effort to ‘celebrate all parts of life,’ to ‘make a point of an art that is not merely a collection of works but a living history of art.” “We call for an early and unconditional return to the work of Pareto and of the twenty-sixth century,” the letter reads. “In other words, for an exhibition dedicated to the history of art to be held in the lead-up to", "The next Biennial should be held in 2021.\n\n\nA group of artists and scholars has taken the controversial decision to cancel a forthcoming exhibition in protest of the Saudi Arabian government’s human-rights record, charging that the event was “highly politicized and skewed” in favor of women artists.The revamped edition of the exhibition, titled “Women’s Journey,” will take place in the Saudi capital, Riyadh, in March 2022. On March 28, the group has issued a statement calling for “human rights activists, artists, and intellectuals to participate in the event in solidarity with the Saudi Arabian people and the artists who participated in the protest in March 2022.”“To cancel the exhibition is to contribute to an atmosphere of oppression and discrimination against women,” said the statement, which was penned by the authors of the letter, which were signed by some seventy artists, intellectuals, and activists, and was addressed to the Saudi Arabian Ministry of Culture, the Royal Commission for AlUla, and the Royal Commission for AlUla, in addition to to the Royal Commission for AlUla and AlUla, and was dated March 29. The letter also criticized the exhibition’s selection", "The next Biennial should be held at the Pérez Art Museum in Madrid next August, according to El País. The exhibition will include the works of around fifty artists who are currently unknown to the public. The curators will be drawn from a group of eighteen artists selected by the museum.\n\n\nThe London-based auction house Sotheby’s has ended its relationship with the Israeli art historian Tovah Lazar, who was arrested in March 2018 for alleged collaboration with the Palestinians. “We strongly considered the implications of removing her from the show,” said Paul Gallico, director at Sotheby’s. “But we made the decision not to proceed with the exhibition, absent any change in Israeli government policy.”The auction house also said that it has never received any payment from the Israeli government for the contract to display the work “Hamas: A First Step.” As a result, Sotheby’s is not obligated to pay the government of Israel. However, it has promised to donate $10,000 to the Women’s Prisoner’s Solidarity Fund, and it is planning to donate more than $100,000 to the Israeli human rights organization B", "The next Biennial should take place in Los Angeles between November and March 2021, and should be held right in the heart of the city where the works normally staged are being relocated. The new location will allow the exhibition to reach a wider audience, as well as provide an opportunity to connect with and experience the work of the artists that have inspired contemporary life in Los Angeles. The selection committee will be chaired by Bénédicte de Villeton, director of the Fondazione Prada. “The new Biennial is a watershed achievement, framed by the artist-built and artist-expansive city of Los Angeles. It is a world-class exhibition of works on paper and the first dedicated to the most influential and important works of art that have ever been presented by an artist, in the US, and is going to change the face of contemporary art radically.” The selection committee was made up of the visiting artist Jõ De Rosa, winner of the 2017 Los Angeles Biennial (LA Biennial), Artforum editor-in-chief Victor Campoy, curator of the 2018 Los Angeles Biennial (LA Biennial II), and curator of the 2018 Los Angeles Biennial. The selected artists will take", "The next Biennial should be held in the United Arab Emirates in 2021. The new theme for this year’s event will be “Art and the Politics of Residence.” Gareth England, chair of the London-based nonprofit the Biennial Foundation, said: “The decision to move the Biennial to Dubai was not made lightly and is a great success story for the city of Dubai. We are proud to join the GEMAT and the UAE in welcoming the first visitors to the Biennial in 2022. The new venue will allow the Biennial Foundation to hold the Biennial at a truly extraordinary location in the heart of the City of Dubai, alongside the Museum of Contemporary Art, Fashion, and Design.”\n\n\nGeneva Art and Design Fair is coming to New York City in 2021. The 2020 edition, which will focus on the cultural and design sectors, was announced on April 28. Titled “The Future Is Now,” the three-day fair will take place at Rockefeller Center in New York from April 29 to May 6. The 2020 edition will also be a “future retrospective of the year 2029.”Geneva’s new branch, the Geneva Contemporary Art,", "The next Biennial should be in June 2020.\n\n\nThe Institute of Contemporary Arts (ICA), the London-based nonprofit that supports contemporary art in the United Kingdom, has received a gift of fifty-three works from the Marie Hoffman Foundation. The donation comes in the form of a series of works that were executed by artists like Linda Lovelace, V.S. Rajam and J. Krishnamurthy, and was made at the request of the foundation. The works were created as part of the study group's discussion on the theory and practice of power politics.“The works will go to a great extent to provide a new perspective on the work of women artists and will give future generations of scholars a new resource for understanding the impact of women artists on contemporary art,” said Ana Címara, director of the foundation and the institute.The works—which were selected from a shortlist of sixty-five artists by the foundation—and their discussion about power politics were presented as part of a project titled “Power Politics: ‘The Women Artists, Power Politics,’” which explored how cultural and political institutions and organizations have impacted the work of women artists and the contemporary art world.The Marie Hoffman Foundation is a", "The next Biennial should be held in 2021 and we will see how this new way of working will evolve.\n\n\nThe Metropolitan Museum of Art (New York) announced today that Virginia Johnson has been appointed as its next director. Johnson replaces Adam D. Weinberg, who retired from the museum after more than twenty-five years to pursue new creative projects and personal interests.Johnson will assume his responsibilities on February 8 and will take up his new post on March 8. He will assume his new role at the Met in April 2020.Earlier this month, the museum and Johnson agreed to a three-year lease agreement which will include the construction of a new twenty-five-thousand-square-foot, artist-designed building, and the opening of a new exhibition. In addition, the museum will construct a new, restored courtyard in the rear of the museum on the museum’s first floor, which will boast a new public green terrace, and will name a new veteran curator of modern and contemporary art, James Cuno.  Johnson previously served as an assistant curator at the Whitney Museum of American Art in New York and as a senior curator at the Hirshhorn Museum in Washington, DC. He also helmed the retrospective “New", "The next Biennial should be held in 2021. After the museum’s renovation in the 1960s, the museum became a cultural hub for the city of Vancouver. Annual admission stands at $54.\n\n\nThe Los Angeles County Museum of Art (LACMA) has received a gift of 192 works from the artist-turned-philanthropist Francisco Gómez. The donation includes works on paper from his collection from the 1930s to the 1980s, as well as new works on paper from the artist’s family and on the theme “Between the World and Me,” a series of photographs he made in his studio in the 1920s.Gómez also gave LACMA the first twenty-seven works he ever received from a single donor, an amazing gift that is the foundation of his upcoming exhibition “The Artist’s House,” which will open in October. The show will feature works by seventy-nine artists, including Leon Golub, Josef Koudelmann, Elsie Leguet, and Leonor Carron, and will feature works by artists including Jasper Johns, Charles Noth, Harry Callahan, John Currin, and Ursula von Rydingsvard.G", "The next Biennial should be held in 2020.”Bertrand also noted that the exhibition has made significant contributions to democratization: “The exhibition has given voice to the voiceless, to the voiceless voices of many, and to the voiceless voices of many.” He added: “This year’s Biennial, while it did not address the universal concerns and challenges of many, reflected and explored the themes, the historical content, and the aesthetic value of these works.”The Biennial also announced that it is inviting eleven other cities and twenty-eight countries to participate in the event. Among the cities that will be participating are Berlin, Brno, Brno-Brno, Brno-Minsk, Brno-Minsk, Brno-Minsk, Brno-Minsk, Brno-Minsk, Brno, Brno, Brno-Minsk, Brno-Minsk, Brno, Brno-Minsk, Brno-Minsk, Brno, Brno-Minsk, Brno-Minsk, Brno-Minsk, Brno-Minsk, Brno-Minsk, Brno-Minsk, Brno-Minsk,", "The next Biennial should take place in Tokyo in 2021. Artist-run exhibitions such as the London-based, Cairo-based, and New York artist-run Space this year’s theme “energy: the essential, the small, and the obscure,” but also the retrospective of the late American photographer Elvia Davis.The 2020 edition of the Biennial, which will be staged in the museum’s Dōjutsuji building, will showcase work by forty-four artists, including Hiroshima, Yoshitomo Shigematsu, and Takashi Tezuka.\n\n\nThe San Francisco Museum of Modern Art (SFMoMA), which was forced to evacuate its tenants in a fire that broke out in a neighboring building on the museum’s rooftop on Saturday, has issued a public apology to the local residents of the building whose homes it was trying to protect. According to the San Francisco Chronicle, the firemen who extinguished the blaze in the building, which was being renovated by architects Norman Foster and Jean-Michel Ghebaly, did not use the proper extinguisher or provide appropriate protective equipment. A second fire department, this one from the same", "The next Biennial should be released sometime between May and October 2020. “We are so excited to work with our international team, independent curator, and artist community to present a truly unprecedented exhibition of work in the Works.” Francisco Lira-Gallardo, the director of the Museum of Contemporary Art (MoCA), Miami Beach, said: “The upcoming exhibition will bring together the best from the exhibition’s past and present, including works from the forthcoming exhibition, ‘Art-Oriental,’ which opens on May 3. From the opening of the exhibition on June 25, the Biennial has been a source of inspiration for me and my team. We are all determined to create a new generation of curators and exhibit artists with a new perspective that will challenge the existing narratives of our art history.”\n\n\nThe Gates Foundation, the New York City nonprofit that was one of the first to establish the Gates Foundation Art Museum and Sculpture Garden in 1969, has helped establish the MID-SECRET FILES, a new scholarship program for artists who are currently in the process of moving to a new city.Established by the Gates Foundation in partnership with the Metropolitan Museum of Art", "The next Biennial should take place in the spring of 2021. “Themes that have influenced the exhibition are richly symbolic of the exhibition and its aliene-feminist, anti-racist, and anti-capitalist impulses,” said Whitney. “This year’s exhibition, ‘Anti-Orient,’ represents a moment of rebirth for an institution that has been at the heart of this movement, of which the artist is an integral part.”\n\n\nYale Union, an independent arts space located on Northwest Twenty-Third Street in downtown Portland, Oregon, has announced it will cease operations next month and return to the Portland Art Museum (PAM) as a result of the coronavirus pandemic. The news follows that of the Los Angeles County Museum of Art (LACMA), which plans to move its permanent collection to New Orleans in the coming months.In the interim, Union has offered free public tours of the museum, which has been home to more than 1,400 artworks since it opened in 1988. “We are deeply grateful for the many supporters who have helped us through this ordeal,” said Nathan Rabin, the museum’s director. “", "The next Biennial should open in April 2021.\n\n\nVincent van Gogh, the Dutch painter who drew his first human-scale works in 1888, has died at age forty-three. His immense body of work is a living testimony to the visionary power of an artistic medium, a medium that van Gogh—who struggled with addiction to morphine and died eighteen months later—applauded as a kind of hallucinations through which he saw and experienced \"the real world.\"Born in the Dutch city of Maastricht in 1932, van Gogh later studied at the Academy of Fine Arts Amsterdam before enrolling at the School of the Arts in the Netherlands, where he studied painting, sculpture, and architecture. It was there—in 1975, van Gogh met painter Josef Alberts, their mentor and friend, who, together with Alberts, created the iconic sky-blue Lévy Gorvy, which first appeared in 1975.In 1977, van Gogh and Alberts moved to the United States, where they settled in Santa Fe, New Mexico, the birthplace of American painter Ralph Waldo Emerson. For the remainder of their lives, van Gogh and Alberts worked together in a wide range of media, including painting", "The next Biennial should be held at the Geisel Museum in Berlin, the Haus der Kunst in Graz, and the Institut für Mittelalteritarische Kunst in Stuttgart.The exhibition will be held simultaneously in New York and Shanghai. The full list of participating galleries and the venue for the exhibition are as follows:Amitoni Gallery at the University of Pisa, Italy, featuring work by Domenico Fontanelli, Michelangelo and Piet Mondrian, and by Jean-Luc Moulène and Antoine Satou (UCLA), China, and London: The exhibition will be held at the Museo d’Alonso, Alagoas, in Venice on November 28.Art Gallery Beijing, with works by Léonide Cloakes, Elizabeth Couturier, André Gide, and Paul Gauguin: “Project for the Future: The Future is not What It Used To Be” will be held at the Museum of Contemporary Art Beijing in September 2020. The show will comprise twenty works by seventy-six artists. The new exhibition “Unga Deng: The Life and Times of An Unga” will launch at the University of the Arts Beijing in", "The next Biennial should be held in 2020, and the first in 2021. The 2020 Show will focus specifically on modern art and will also feature a retrospective of Louise Nevelson’s work. “I am thrilled that I can return to the southern hemisphere to present the first exhibition devoted to modern art in Argentina in more than twenty years,” said Argentinean director Alexander Bae. The show is part of a larger plan to transform the Argentinean landscape, which has been in the works since 2009. Among the changes that have been made since 2009 are the reopening of two cities, Granada and Santa Fe, as urban centers. The city of Santa Fe’s exhibition hall, the new Museum of Contemporary Art (MCA), and a cultural center in the capital city are currently undergoing a $350 million expansion.The biennial will include seven different exhibitions: “The Color of Place: Modern Art and the Southern Hemispheres” (July 27–August 2), “Avant-Garde and Art in the Age of Continentalism” (August 3–September 2), “The History of the Nation: Modern Art in the Periods 1900–1939” (September 24", "The next Biennial should be held at a location that is not far from where your art will be housed. The concept of a biennial should be a kind of nexus between the Center and the local communities. It should be a way of connecting the Center with the local communities and between the Center and the local art of the city, with the aim of seeking to give the public more opportunities to experience art. In order to be able to carry out such a project, the Biennial has to raise funds.If you wish to make a donation to the Biennial, you can do so here: https://www.dropbox.com/s/sj7wj4h9nk8hx3/Brianna_Ansari.jpg?dl=0If you have any questions or comments regarding the building of this website, please feel free to email me.Thank you for visiting!\n\n\nThe Museum of Fine Arts (MFA) in Boston has received a $30 million donation from Philippe Starè, the founder of the Geneva-based company Galería Moderna. The gift, which includes the construction of a new, 750-piece gallery, a new audience room, and the renovation of the museum’s", "The next Biennial should take place in 2021 and will be organized as a celebration of the occasion.The inaugural exhibition will consist of fourteen works by fifty-three artists. The theme of the exhibition will be “Amidst the Storms of War,” which will take place in the middle of the Global War on Terror. The show will be organized in the space of the former site of the 9/11 World Trade Center, a former U.S. military base in central New York, and will feature a selection of new works by twenty-seven artists, including Christo, Ella Aguilar, George Artus, Stefanie Barso, Sara Fuller, Robert Aronson, Juliette Boutelle, Andrea Bove, Gillian Chapek, Ronald C. Evans, and Lawrence Auster. Glenn Ligon, the CEO of the Biennial, said: “It is the biennial’s mission to create a platform for the exploration of new work and to engage with the collective practices of artists and their audiences. We will continue to present non-traditional and experimental work, but also traditional art and cultural practices, and will continue to", "The next Biennial should be held in the spring of 2020.” The institution is currently planning to open the museum next year.At the biennial, the artists will present works from their collections, including Signs of Life from the collection of Michele Lamart, L.A. Protocol, La Barba, and La Vida from the collection of Rebeccah Pape. They will also have the opportunity to present works by new artists. The first exhibition of the new initiative will be the artist’s first presentation at the museum, titled Art of the Life. Koppelman said that the theme of the exhibition will be “intersection.” The exhibition will be curated by Hiroshima University student artist Hiroshi Takeda.In an open letter addressed to Koppelman and titled “I want to thank you, we, as artists, have played a pivotal role as a group, as individuals and as a collective, in establishing the MCA,” the artists wrote: “This is a tremendously exciting time to begin a new chapter at the MCA, and to be able to bring together three of the most important artists of our time with", "The next Biennial should be held in 2021 and the current exhibition should return to the city of Reykjavík next May.\n\n\nThe Tate’s move toward laying off hundreds of employees following the coronavirus pandemic has been blamed for the reduced number of performances that will be staged this year, and the museum will likely continue to lose money as the public remains healthy.“We are currently assessing the impact of the Covid-19 Covid-19 Covid-19 Covid-19’s impact is being felt across all areas of the organization,” director Maria Balshaw said in an open letter published by the union representing custodians and support staff at Tate Britain. “It is a significant blow, and we are working with colleagues, including in the US, to try to understand how we can mitigate the impact of the virus and still deliver high-quality exhibitions and programming to the public.”The letter cited a survey that found only 42 percent of staff are optimistic about the future and another that found 85 percent are dissatisfied. It said: “At this stage of the pandemic, we are not in a position to call off or even consider the future of our union, our staff,", "The next Biennial should take place in the spring of 2021. The first exhibition was organized by Lévy Gorvy in Paris in the summer of 2017. It was followed by the fifth and sixth seasons of the French television series La Presse in 2018 and 2019, respectively. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it has received a $75 million gift from a close friend of the institution, a collection of more than 1,500 works by artists including Jean-Michel Basquiat, Robert Irwin, and Peter Sellars. The donation includes works by artists such as Guadalupe Rosales, Alex LaMont, and Eric Nesviz, as well as works by artists whose work is featured in the forthcoming exhibition “We are All in This Together,” which will focus on the themes of climate change and art and will take up themes of resilience, community, and art.“These works are the fountainheads of MoCA’s collection, and their acquisition underlines the value of the dedicated and dedicated curators and staff around the world who have shaped and guided the museum over the past decade,” said museum director Tom Beaty. “Museum history", "The next Biennial should be on 10 November 2020, at the invitation of the Ministry of Culture and Science (MoC), and will be hosted by MoC from the 30th to the 40th floors of the Cultural Palace, in Beijing. The university will organize the exhibition from the museum’s existing collection. At the opening of the exhibition, the Museum of Contemporary Art Beijing (MoCA Beijing) will begin its Museum of Contemporary Art Shanghai, which will host the first major exhibition of new works by Chinese artists in more than twenty years. The museum will also present a series of new works by artists in China.\n\n\nThe Pérez Art Museum Miami (PAMM) has received a gift of twenty-two works by artists including David H. Koch, John Curran, Brian De Palma, and Kayode Tae, among others. The donation includes four works by the trio of New York–based artists, who were working in collaboration with Pérez Art Museum Miami’s curator of modern art, Hélio C. Rosales, when the works were first acquired by the museum.“These twenty-two works by artists represent the legacy of Pérez Art Museum Miami and are a testament to our", "The next Biennial should take place in 2020. The next edition is scheduled for September.\n\n\nAs the largest arts organization in the United Kingdom, the National Poetry Library is preparing to welcome audiences to its new home in north London in November 2019.The new venue will be inaugurated with a group show, 'Down to Earth,', by Chris Ofili (the Icelandic artist known for his unique linear and cylindrical works), and will feature poetry by seventy-three artists, including the Maud Point Memorial Prize winner, Sue Williams, the New Zealand poet Peter Sacks, and the “Dawson” (1857–1866), the first recipient of the Royal Shakespeare Company’s prestigious £10,000 biennial prize. The work, which was written in a single sitting and premiered at the new venue on June 29, will also be presented as part of the National Poetry Foundation’s yearlong celebration of poetry, titled “The Year of the Poem.”The biennial, which will also feature readings by contemporary poets, a presentation of work by a laureate selected by the institution in 2020, and a free exhibition—which will feature poems by forty-one artists, including Arthur Asbæk", "The next Biennial should be called MCH Group, the new private institution that will be the home of the arts in the city of Groningen, the Netherlands. The first exhibition will be an exhibition of work made by the group members in the past decade. The biennial will also focus on the history of art, artmaking in general, and the place of art in society, and will be held in the city of Groningen. The next show will be a retrospective of the work of the group members from the Fall 2019 issue. Markus Schwabe, the director of the Westfalen Institute in Berlin, was named the biennial’s curator. He will lead a retrospective of the work of the group members from the Fall 2019 issue, “Reconstructing the Revolution,” which will open in May 2020.“Schwabe, the father of Hans Schwabe, the founder of the Institute for Contemporary Art in Düsseldorf, has been a leading member of the Biennial team for many years, and he is a master of his own work,” Klara Leitner, director of the Berlin Gallery, told the Art Newspaper. “He is also a brilliant curator, and we", "The next Biennial should examine the development of the relationship between cinema and ecology and will focus on how the practices of film-making, the visual arts, and the natural world can play an essential role in advancing the understanding, appreciation, and conservation of these resources,” said Cao Shui, chair of the exhibition’s curator.The next exhibition will examine the artistic and cultural significance of the Hong Kong–China relationship from a Chinese perspective and will be organized by the National Museum of China (NMC). The exhibition will be hosted by the NMC in collaboration with the Hong Kong Art Museum and the East China Art Museum in Beijing through September 29. The Hong Kong Art Museum (HKMA) will stage the first exhibition of works by Chinese artists in the United States in 2021, and the Hong Kong Art Museum in Hong Kong will participate in the first international exhibition of Chinese artists in the United States. The Hong Kong Art Museum in Beijing will also hold a retrospective of Chinese artist Zhang Yaxuan in 2020.\n\n\nThe Faculty of Arts (FAO) in Rome is facing a possible move to the Vatican City , after the Rome-based arts organization, the Curaçao Foundation for Contemporary Art (CFCA), received a funding challenge", "The next Biennial should be held in March 2021.\n\n\nThe Museum of Modern Art (MoMA) in New York has received a $1.7 million donation from the Ann and Russell Talbot Foundation, which was established in 2010 to advance the fundamental rights of artists. The gift includes two hundred works by artists whose works have been previously donated to the museum.“The gift is an incredible honor for the museum and a major step forward in the museum’s work to advance the fundamental rights of artists,” said MCA director Timothy Rub. “It is a monumental legacy for artists and a great testament to the Talbot family, whose incredible generosity has kept the museum alive and thriving for more than forty years.”In addition to the works, the foundation received a seal by Dutch artist Jan and a gift of four works by Asian artists. Both artists are students of Jan and Marta von Helmont, who is based in Beijing, and have made their dreams of visiting the museum possible through the foundation, which also works with individuals and institutions to build the foundation’s relationships. In order to further advance the foundation’s work, the gift includes a series of projects and classes that will be organized through the Museum’", "The next Biennial should take place in 2020 and will then feature three iterations of the artist’s work. “The future is bright for the Artist and the future is dark for the State,” he wrote. Asda, which currently has an exhibition at the Art Gallery of New South Wales, is also planning to open a new half-hour biennial, “The Artist in Space,” at the Adelaide Art Museum in December 2021. “We honour the artist as a strong, confident, and bold voice in our own right,” a statement from the museum reads.\n\n\nThe Walt Disney Company, which acquired the publishing arm of the institution in 2015 for $7.3 billion, plans to give Tom Tom Toles a severance package worth $8 million in 2019, according to the New York Times. The deal, which involved Disney’s sale of a ten-year sub-contracted contract to the literary publisher, saw the entirety of the publishing company’s publishing inventory acquired by Disney. As part of the transaction, Tom Toles will become a wholly owned subsidiary of the company, which will continue to publish books, magazines, and other content under the Tom Toles Publishing", "The next Biennial should be hosted by the artist, curator, and architect Zaha Hadid, the curators of the exhibition “Tadashi Nozaki” (2018–19), and Kunsthal Aarhus, Denmark; the BAM Foundation, the Bonner Kunstverein Frankfurt, Spain; and the Royal Academy of Arts, London.Commenting on the new partnership, Hadid and Kassel-born designer Daniel H. Smith said: “Together we are eager to honour the biennial with a new year of new work by artists and architects, and to continue to be at the forefront of the exciting and transformative. Already, our exhibition ‘Unseen: Architecture, Technology, and Design’ has provided a platform for artists in different ways to engage with the exhibition’s themes and has inspired artists and architects to explore the possibility of a new sort of work in the exhibition. We look forward to the upcoming biennial and the exhibition’s launch.”\n\n\nThe extraordinary collection of works from the artist’s extensive network of collaborators will be released under the new Digital Millennium Copyright Act (DMCA) on September 6. The works, which comprise a group show assembled by the artist,", "The next Biennial should bring together thirty-eight artists and creatives from Egypt, Israel, Jordan, Lebanon, Morocco, and the Palestinian territories. The event will also include a number of projects that assemble and present work in one space and will bring together groups of artists and curators in creative collaboration with the visitors.The exhibition will be curated by a team comprising Edan Fadima, art curator; Hajra Abdel-Qader, director of the Contemporary Frontier exhibition; and Naama Arad, the director of the Abu Dhabi Initiative for Art. The inaugural edition, “Sara ElVarnado: A Biennial in Three Dimensions” will open on February 22 and run through March 21.\n\n\nThe Antwerp Biennial of Arts and Crafts has announced the thirty-two artists who will represent Belgium at the upcoming edition of the Biennial de l'Art. Set to open in 2022, the exhibition will also present the first show dedicated to the artist-built landscape. Curated by Antoine Meneaux and centered around the theme “Ikea Farms,” the exhibition will feature work by thirty-five artists and will bring together thirteen local and regional communities across the city of Antwerp.Participating artists", "The next Biennial should take place in 2021 and the biennial will return to the city for a third edition in 2022. Art Basel Hong Kong has yet to announce a date for its Hong Kong pavilion.  The sculpture house is also planning to open a new digital platform and exhibition space in Hong Kong in 2020. The new venue will be led by associate director Leung Yee-sung and will be inaugurated by an exhibition of artworks by Hong Kong–based artist Min Hong-kyung. \n\n\nThe Metropolitan Museum of Art (MoMA) in New York has received $7.2 million in donations for the restoration of a nineteenth-century building that housed a collection of works by American photographer Erma Mitchell, who was a close friend and collaborator of Edvard Munch and Pierre-Auguste Renoir. The donation includes $3 million for the restoration of the studio at 450 East Twenty-Fourth Street in Manhattan, which was overrun by the Parisian pharmaceutical giant AstraZeneca in 2007.The museum opened the AstraZeneca–Mitchell Workshop on October 25, 2007, shortly after the company’s acquisition of the British photography firm in 2006. The building, located at 538 East Twenty-Fourth", "The next Biennial should be held in September 2022. The theme for the 2026 edition will be “Not a Dream,” featuring works by artists such as Nykka Miro, Pierre-Auguste Renoir, and Jean-Michel Basquiat.  The pavilion will be themed “In Defense of Dreams.” The work of the selected twenty-two artists will be featured in “Not a Dream,” which will be on view concurrently with the biennial.The exhibition “Theater of Operations” will be on view March 19–March 21, 2022. The exhibition will be followed by “America: The Natural History of Event,” which will open on March 8–March 10, 2022 and will be followed by “Theater of Operations: The Second World War,” which will open on March 11–March 12, 2022.The twenty-fifth edition of the Edinburgh Biennale will take place in the city of Edinburgh on May 25–May 29, 2022. The seventy-ninth biennial will take place in the United Kingdom in 2022. The exhibition will be hosted by the National Gallery of Art.\n\n\nThe second annual Los Angeles Bienn", "The next Biennial should welcome the first indigenous artists of Florence, in 2022. Art historian and curator Fabio Catellani has helped the project to identify the best locations for the exhibition, which will be staged in twenty-one galleries in the city and will bring together work by thirty-four artists.\n\n\nThe Bexley Museum of Art in New York and the Whitney Museum of American Art in New York have reached an agreement on the sale of the iconic Yuz Museum’s collection of more than twenty thousand works by postwar and modern artists, including Richard Avedon, Morris Louis, and Paul Gauguin, as part of an agreement worth $2.5 million that will also see the two institutions become the first publicly funded museums to exhibit a new work by artist Jeanne-Claude. The acquisition process began when the Yuz Museum in New York sold a work by the French-born, California-based artist, who was only fourteen years old when the estate of his father, the renowned sculptor Herbert Avedon, purchased the works in 2013. Since then, the Avedon family has been working to sell the works, but the siblings were unsuccessful in making the estate collect them.“The partnership between the museum and artist will", "The next Biennial should take place in 2021, and the institution’s president, Léa Trockel, told the Art Newspaper: “I am very excited about the prospect of its future. I am deeply inspired by the dynamic spirit of the artists, the innovative and imaginative ways they engage with work and with each other. I am ready for the challenges presented by the future and for the opportunities it will present.”\n\n\nNew York’s Metropolitan Museum of Art (MoMA) has collaborated with the New York–based nonprofit the Partnership for Public Art (P.A.P.), which works with city, state, and federal governments to support public art projects, in an attempt to encourage more funding and greater collaboration between arts institutions.Last year, MoMA donated $1 million to the agency that works with the museums to create and focus the parks and urban green spaces in New York and New Jersey; the funds were then matched by the Museum of Modern Art and the Whitney Museum of American Art. “The partnership has been a long-term vision for MoMA,” said Joel Mone, vice president of the Partnership for Public Art. “We’ve worked with the museums for", "The next Biennial should be in 2021, with a design by the artist-run, artist-built museum. The museum will house the works of a number of recent and contemporary artists, including Marc-Olivier-Léger; Christoph Reimann, the publisher of Vogue; and Léger & Co.; and will be located in the city of Leipzig.The announcement comes on the heels of the charity’s reopening of its arts space in Berlin, where it announced it was reopening in February 2019. The move followed the outbreak of the coronavirus in China and Europe, which has since killed more than 5,000 people in the country. The country’s government imposed restrictions on travel and goods, and cinemas began reopening following a four-month shutdown.The United Kingdom, France, Germany, and Italy have also banned large public gatherings, and large public transport agencies, as a precautionary measure to prevent the spread of the virus. Munitions merchants and other businesses have been urged to ramp up their anti-theater-bomb production and deployment. The United States, where fourteen people have died from the virus, is preparing to send up to four million troops to Iraq to help the country contain", "The next Biennial should take place in 2020.\n\n\nThe Museum of the Jewish History (MoH) in New York is planning to close its doors permanently in April 2020 in order to focus on a multimillion-dollar redevelopment that will include the construction of a new museum.The announcement follows a two-year period of “exploring new ways to engage with contemporary Jewish history and culture,” said curator David K. Shapiro, who was appointed MoH’s director in February. The institution will also expand its collection by adding more than two hundred works to its collection by women artists, and it will host more programming.The institution, which has been in operation since 1912 and consists of three buildings that were completed in 1967 and 1971, has faced many setbacks in its redevelopment. In 2010, MoH director Daniel H. Weiss revealed that the redevelopment project would “aim for a certain degree of sustainability,” but said that the museum would have to continue to operate under certain conditions, such as without visitors. In order to facilitate the overhaul of the complex, MoH will transfer ownership of the buildings and the digital works housed in them to the city.“This is a very challenging time for all of us, but particularly for the"]