["The next Biennial should be organized in May 2020. The artists who will compete for the award include:Sara Cwynar, Rafael Alves, Sue Edward, Hans Neumann, Kirsten Reimer, Joachim Albers, Andrea Daddario, Lévy Gorvy, Sara Ghossein, Anneliese J. Benoit, Morgan Graham, Sara Hawes, Andrea Kufuji, Sara Morales, Emmanuel Ribert, Andrea Ruiz, Maria Tamburino, Sara Zagreanu, Bianca Viso, Rosemarie Yurka, and Hannah Price. The 2019 edition of Art Biennial was repeated on June 5 and featured entries from the following artists:Alfonso Alves, Bianca Viso, Camila Alberte, Adriana Barroso,  Alan Bennett,  Ana Bacuani, Bianca Viso & Laura Hsu, Bianca Viso, Bianca Viso & Tomál", "The next Biennial should aim to present the most comprehensive and up-to-date representation of the full range of the year’s art history, from the most recent to the most ancient artworks; to reflect the most recent developments in scholarship on the subject matter; and to present the most significant works in the exhibition. The design of the exhibition room and the exhibition will be inspired by the exhibition hall at the Gothic Shrine in Rome.”The forthcoming exhibition will include works by seventy-eight contemporary artists, including América Alejandro Barozzi, Sigrid Prague, Rachel Lehr, Gustav Klimt, Robert Mapplethorpe, Maxim Gorki, and Harry Lewis, and will run until November 16.\n\n\nThe Woolworth Foundation in London and the Whitney Museum of American Art in New York have announced the launch of a new $10 million endowment campaign for visual arts and culture. The initiative, which launched in April, received $6 million from the T.W.F. Foundation and the John Simon Guggenheim Foundation. The funds will be divided among eighty artists and organizations. Foundation president Mary Ellen Klug, who has helmed the funds since 2013, said: “I’", "The next Biennial should invite over a hundred artists and cultural figures from thirty countries and territories, including Austria, Belgium, Canada, Chile, Germany, Italy, Mexico, Peru, and Venezuela. In addition, the symposium should take an in-depth look at the transformation of the cultural landscape in the last thirty years. The pavilion should include a petrochemical plant from the Caspian Sea and the Zhukovskoye River, as well as a replicas of two of the world’s most important artworks, the Neue Galerie in Paris and the Neue Raadstädtische Kunst in Berlin. \n\n\nThe London-based nonprofit Artadia, which aims to support artists and cultural institutions through its annual Artadia Fellowships, has announced that it has increased the grant amount for the 2020–20s cycle from $10,000 to $25,000. The organization announced the grant recipients on its website on March 13, and the deadline for the 2019–20 cycle is April 10.The 2019–20 cycle featured seven visionary fellows, including Mairi Bruguera, Christina Benito, Anya Bosch, Radhmin Pindi, ", "The next Biennial should include works by emerging and established artists from the Americas, Europe, and Asia. The 2018 edition, which was curated by Naima J. Keith, featured works by twenty-six artists and was held in conjunction with the opening of the exhibition “SOUTH BY DESERT,” curated by Hirshhorn Museum curator David Shiner.The biennial was created by the 2013 moving-image exhibition “South by Southwest: From Modernism to the Future,” which was organized by the Texas Southern University Art Museum and the University of Texas at Arlington. The twenty-sixth edition, which was staged at the Museum of Fine Arts, Houston, will open on January 8.\n\n\nThe Museum of Modern Art (MoMA), in the weeks leading up to its January 15 reopening, has released new guidelines on how it will handle the eventual dismantling of its Art of the Party exhibition and reopened its doors for business. The reinstalled Dia Art Museum, which will continue to present its annual exhibition of works by artists from the New York–New Jersey region, will not be closed for more than three weeks, and will have its annual gala on January 17.“MoMA’s policy regarding", "The next Biennial should be held in 2021. Kasar is also working to set up an endowment fund for the museum’s future.\n\n\nThe Manchester Art Gallery (MAG) has appointed Neil Taylor as its new director and chief executive. Taylor joins the institution from the Royal Academy of Arts, where he is the chief executive and director. Previously, he served as director of the Shrewsbury Art Gallery and as deputy director of the Museums Group, where he was involved in the acquisition and management of more than 1,300 artworks.“Neil has demonstrated a wealth of talent, both as a curator and as a leader, and the opportunity to lead is a huge one for the museum,” said David Dryden, director of MAG. “We are delighted to welcome him to the museum and look forward to working with him. His passion and enthusiasm for art and his ability to motivate and inspire means he can bring a fresh and exciting perspective to the museum.”Taylor succeeds Philip Sherwood, who announced in February that he was stepping down after a decade at the helm of the institution and will take up a new role as a senior advisor to the board of trustees. During his tenure, Taylor will oversee the", "The next Biennial should be held in 2020, and the next in 2021. Edition, the publisher, has announced that it expects to begin shipping books with the first show in 2021, and will soon have more than twenty artists represented. In a statement, the publisher said that it was “optimistic that we will soon be able to show you the new paintings and sculptures that are being created by artists of all nationalities and all different kinds of disciplines. We hope that you will get a chance to see them.” Last year, the Uffizi-designed museum staged a show of works by forty-six artists, including Nader Ben Saar, J. Paul Getty, Vittorio De Ciani, and Lawrence Abu Hamdan. For the institution, the exhibition signaled the “uniqueness of the show.” \n\n\nThe Skowhegan Museum of Art in South Hadley, Massachusetts, has appointed Martha Schulte as its next executive director. Schulte will be responsible for driving the institution’s programming and direction, coordinating programming across the museum, and managing the collection and staff. She succeeds Peter Wirth, who departed in the summer of 2020 to head the Penn", "The next Biennial should be held in 2021. Frederick Gaillard, director of the Museo de la Revolucion and the institution’s former executive director, told the Los Angeles Times that the museum is reviewing the decision to open the galleries and is still evaluating the impact of the expansion.Previously, the museum has been closed since March 13, when a tsunami leveled the coastal city of Oolúa in Peru, killing at least eleven people and injuring hundreds. Officials there reopened the museum in early April, but the project was suspended until June 28, when it was forced to temporarily close. The closure was announced ten days after a fire broke out at the museum.The fire, which was extinguished by the local government, continued to burn for three days before the building where the exhibition was taking place, the Edward Hopper Foundation for the Arts (EHFA), received a warning from fire officials that the building was about to catch fire. The firemen who were called to the scene were not able to put out the fire before it spread to the building and the surrounding area.The fire officials said that they used water hoses to put out the fire and were able to put out the building as it was in a state of disarray. A", "The next Biennial should take place in the summer of 2021, and will include works by fifty artists.\n\n\nThe National Museum of Women in the Arts (MoWMA) in New York has released the list of fifty artists nominated for its 2020 biennial, titled Beauty and Beauty, and will hold its first official exhibition in the summer of 2021. The twenty-three-year-old theme, which was selected by an international jury chaired by author and curator Marian Goodman, highlights the experiences of women and girls and how they shape and shape their own futures.The fifteen finalists have been selected from a list of thirty-nine artists nominated by a committee made up of Patricia Armitage, the director of the Museum of Modern Art; Patricia Corrigan, MoWMA president; and Ravi Guggenheim, chair of the board of trustees. The works, which have yet to be submitted for exhibition, will be presented at a biennial at the Museum of Modern Art in December 2020, and will then be presented at MoWMA in January 2021.The twenty-five-year-old winner of the Palme d'Or, Ni’ko Škupa, will receive a solo exhibition at the Museum of Modern Art in May 2020", "The next Biennial should be a culmination of the two-year term placed by the president-elect on February 20, 2020, to the greatest extent feasible. The exhibition will focus on the themes of mobility, migration, and art.” The 2019 edition, “Art and Politics,” was held in the courtyard of the Kremlin, marking the beginning of the country’s presidency in 2019. The exhibition, which addressed a range of issues, from the role of urban planning to the politics of art, was organized in collaboration with deputy mayor V. S. Gammak, who was picked for the post after the deputy mayor of Beijing, Li Xiaolin, announced that he was stepping down in June 2019.The 2020 edition will focus on the role of the artist, the concept, and the medium in many of the biennial’s themes. It will also include a selection of contemporary works by Naguib Sawiris, Zini Anderson, and the late American architect Ad Reinhardt. The exhibition will host fifty artists and will run for twelve weeks.\n\n\nThe Museum of Jewish Heritage (MoH) in New York has received a gift of thirteen artifacts from the Sackler family. The gift includes seven pieces from the Jewish collection founded", "The next Biennial should be held in 2021. “Dr. Seuss is one of the few living modernists who is so heavily referenced in the American imagination,” said Jennifer Davitt, director of the Museum of Fine Arts, Boston. “He is a pioneer and a godfather of children and we are honored to have his memory and influence in our collections.”In addition to his work as a teacher and as a writer, Seuss also organized the fictional book The Lorax, a children’s book about a boy who has the ability to see into the future. He was asked to write the book by his daughter in 1955, but did not have the time and the energy to create the fictional world she envisioned. The book was originally published in a series of six books by Barbara Streisand.\n\n\nThe Desmond Memorial Art Museum in New York has received a gift of twenty-four works by the late British artist Desmond Tutu, who his work will soon display in a new exhibition. The donation includes works by eighty-five artists, including Richard Diebenkorn, Gnegan Barlow, Billy Bevan, Peter Cook, and Michael Lange. The museum is also planning a major expansion of its collection", "The next Biennial should be held in 2020.  Commenting on the upcoming exhibition, the jury remarked: “The show will be a bold departure from the themes of the past twenty years, which have tended, for the most part, to involve displays of modern art and the culture of the past. It will also take full advantage of the space of the gallery and the exhibition to introduce a new collection of contemporary art.”The finalist of the $25,000 Biennial Prize will be announced in June.  The 2019 prize winners include Artforum’s Paul Graham; Art in America’s Struggle; and Artforum’s Beauty or Bop .\n\n\nThe Institute of Contemporary Arts (ICA) in London recently received $16 million from the National Lottery Heritage Fund (LLF), the UK’s equivalent of the National Lottery Council, in an attempt to secure the future of the iconic National Gallery in the city. The gift, made in the annual grant for museums, brings the total amount raised by the institution since the foundation was founded in 1935 to $17 million. The institution will now have the opportunity to receive another $8 million from the fund, which was established in 2007.The ICA", "The next Biennial should take place in 2021.\n\n\nThe City of New York has launched a fund designed to encourage the regeneration of culturally affordable units in the city. The project, called the City Lab, will distribute $170 million over three years to help revitalize some of the city’s more economically distressed neighborhoods, such as the Williamsburg-Jericho area, and will begin with affordable housing projects. “This is a project that can and will transform lives for the better for the many,” Mayor Bill de Blasio said. The fund will also provide $100 million for local governmental agencies that have been designated as critical infrastructure by the mayor; $100 million to promote the development of workforce training and job placement opportunities; and $100 million to create new job­-training and job-placement opportunities, as well as $100 million for the Department of Consumer and Worker Protection. The fund was established in 2018 by the Mayor’s Office of Cultural Affairs. “This is a challenge that will make all of us in the cultural sector stronger as we face the challenges ahead,” said Cultural Affairs commissioner Alex Tan. “We are committed to working with our neighbors", "The next Biennial should kick off in 2019 and will run for fourteen weeks. It will also include a retrospective of the work of twenty-seven artists, including Emily Chang, Kazuko Naito, Monica Pellegrino, and María Berrada; a selection of works by fifty-four soloists, including Anna Atkins, Anita Alves, and João Amorim. The end of the year also promises to include a book launch, a soprano concert, a solo performance by the parliamentarian Cristina Fernández, and a discussion on the future of art and the role of artists in the revolution.The inaugural exhibition, “2017: A Retrospective,” will open on March 4 and run through May 28. The following week, May 6–May 9, will feature “Takashi Murakami” and “Akiko Nakamura”\u0097both of whom were selected as the participants for the first exhibition. An additional ten works are slated to be presented by artists such as Sara Ianni, Natalie Moretti, and Wangechi Mutu. On May 10, the exhibition will encompass twenty-six works by thirty", "The next Biennial should take place in December 2021, and the first exhibition in February 2022. An announcement regarding the opening of the exhibition will be made in due course.\n\n\nAfter a group of artists, including Pierre-Auguste Renoir, were permitted to return to the Louvre from the island of Sardinia in March 2019, the institution announced on Thursday that it would soon be reopening. The announcement came a month after the Louvre announced that it would reopen to the public again, on September 9, 2020.The announcement of a reopening date for the museum is made during a period when the museum is undergoing a major renovation, known as the Foundation Diabolique, which aims to make the museum more accessible and engaging to the public. Since the renovation, which was organized by Messrs Payet, Prouvé, and Mather, the museum has become a destination for visitors from across the globe.Since the renovation, which opened in 2012, the museum has also introduced new programming, including the inaugural “Montagnes de l'Orient” series, which will feature works by two dozen artists, including Richard Diebenkorn, Sofia Andreeva, and Willem de Kooning; “La Marse", "The next Biennial should come up in 2021, and the first on the festival’s 20th anniversary in 2021. Liberty is organizing a tribute exhibition, “Theatre of Animal Experiences,” curated by Brooklyn-based artist Mel Evans, at the museum in 2021. The event will take place at the Museum of the City of New York from December 19 to December 21, 2020. Anderson said that all men must be made to feel the pain of the world. “I would like to see your pain,” he said. “It’s not a personal injury. It’s a collective injury.” He added, “It’s a disaster.” The Guardian reported that Anderson’s work, which was inspired by his childhood in a small town in central New York, was featured in the exhibition “In Defense of Animal Experiences” at the Museum of Modern Art in New York from 2015 to 2016.The museum added that the work is currently on display in “Animal Sculptures: Contemporary Art from the 1970s to the Present,” which is currently on view through November 29, 2020.\n\n\n", "The next Biennial should, perhaps, focus on the development, production, and preservation of artists’ works in the museums of the cities they inhabit. “In a world where artists are increasingly fragmented and their works are lost forever, it is crucial that they are organized and preserved,” said Art Historian David H. Siegel. “That is what we will try to achieve with the next edition.” In addition to examining the impact of the Covid-19 crisis on the arts, the biennial will focus on institutional reform. The Art Newspaper reported this weekend that the Swiss-born artist Markus Lüpertz, who discovered Covid-19 in 1995, will become the next executive director of the Zurich Art Museum. “Lüpertz is a man whose practice is not limited to the museum, but extends to the public arena as well, as a man who is deeply concerned with how art and culture should interact,” said Art Historian Zeynep Akram. “The next Biennial will address this question of how art and culture should interact in urban life, how art and culture should be created, preserved, and reproduced in", "The next Biennial should be held in 2021. The forty-ninth iteration of Art Africa will be held in 2021. The thirty-eighth will be held in 2022. The thirtieth will be held in 2023. The seventy-fourth will be staged in 2024. The thirtieth will be staged in 2025.The twenty-ninth will be staged in the United Arab Emirates in 2021. The fifteenth will be staged in the United Arab Emirates in 2022. The fifteenth will be staged in the United Arab Emirates in 2021. The thirty-ninth will be staged in the UAE from the first week of April until the last week of May, 2020. While the next Biennial may be very different from the one that took place twenty-five years ago, its themes and technical aspects will likely be the same.\n\n\nThe Institute of Contemporary Arts (ICA) and the Queens Museum in London announced today that they are moving forward with plans to open an exhibition space in the city that is currently slated to open in 2022. The two institutions are currently in the process of developing a new partnership that will bring together new and established artists in the city. The new venue will be a miniaturized", "The next Biennial should aim to show the whole of the art realm in an expanded way. It would also include the creation of an interactive platform for visitors to engage with the exhibition. The exhibition should include presentations by artists from all over the world and should take place in the context of the exhibition. The Biennial is currently being curated by the artist Moudya Martin.\n\n\nThe Berlin Art Week Festival (BAW) has announced its full list of artists who will receive awards this year. The event will be held at the Brandenburg Gate in Berlin from March 14 to March 16 and will present a retrospective of the year’s awardees and the works that were selected for the event.The list of awardees includes the artists whose work was selected by the Berlin-based organization “Artforum” and consists of a combination of works that have been exhibited at international and domestic exhibitions; works that have been selected for the Berlin Biennale (2017); and works that have been selected for the Biennial Category B (2017). This year’s event will also include performances and performances-based activities that will be organized in collaboration with the Brandenburg Gate.The Nominees are:Yelena Soskova (Moscow), David", "The next Biennial should be held at the City Museum in Miami Beach, Florida, in 2022. After Tagorola was named director of the museum in 2015, he was asked to lead the exhibition for the inaugural “20s” and on March 4, he resigned from the position. The biennial, which celebrates the art of the 1960s and 1970s, will be on view in February 2022. �Like many museums, our collection is undergoing extensive transformation from an exhibition-driven model into one of a curated program,” said Hind. “There has been tremendous change in the last thirty years, and that is reflected in the pieces that are on display.”While the Biennial was originally conceived as a multi-venue event, the project was scaled back from two locations to one at the museum’s new home in Miami Beach. The exhibition will now be held at Tagorola’s own space at One University Plaza, alongside the museum’s new building, the Taksim All India Institute.The announcement of the museums’ collaboration comes a month after the Biennial of Art in Porto, Portugal, was selected as the theme", "The next Biennial should focus on “the relationship between sustainability and culture: what it means to be a poet, a curator, a speaker, and a curator’s role,” the organizers wrote. “This is an exciting time for art, and we are eager to see what the future brings.”The 2019 event will take place at the Cultural Centre of the Philippines in Quezon City from January 31 to March 31. Organizers said that the theme of this year’s version of the event will be “sustainability for the future,” and that the theme of the exhibition will be “Dangerous Liaisons: Water and Salts.” The catalogue will include photography by an international team including Gioncarlo, Zanele Hernández, and Jacqueline Marubo; works by a number of international artists including Pablo Nuzman, Riccardo Toscani, and Peter Wächtler; and a video work by director Kim Eun-sung.The full list of participating artists is as follows:Beijing Art Video Festival (BAPP)Calipatria Art Festival (CAP)Karachi Art Summit (KAMP)Miami Art Show (M", "The next Biennial should take place in 2020 and is expected to be held at the MAMCO in the capital Ciudad Real, in northern Mexico City, and will consist of five main events: Artforum’s 2019 edition, a major retrospective of the artist’s work at the Museo de Arte de Mexico, in Mexico City; the artist’s first solo show on the Mexico City Biennial; and a biennial staging of artist interviews with artists who are currently or were involved in Mexico City’s cultural scene.\n\n\nThe California Institute of Technology (Caltech) in Pasadena has announced that Carey Mulligan has been appointed as its next director. Mulligan, who has served as the California Institute of Technology’s (Caltech) associate dean of arts and crafts for ten years, succeeds Nancy Spector, who retired after eighteen years in December 2020 following a controversy over an exhibition at the Center for Italian Modern Art in Los Angeles.“The announcement of the new chair and the appointment of Mulligan as chair is a powerful affirmation of Caltech’s strategic vision for the next decade,” said director Christopher Huang. “A superb leader with a history of bringing together artists and thinkers as they", "The next Biennial should have been held in September. However, due to the coronavirus outbreak, the exhibition was moved to November. The 18th edition of the Biennale will now take place in December.  The next edition of the south London fair will also be held at the Royal Festival Hall. Titled London: Time for Change, the event will feature work by twenty-two artists, including Victor & Nell, Minhwa Lee, and Laura Owens. The 2017 edition of the fair, which took place in the city, was cancelled due to the coronavirus pandemic. The 2018 edition of the fair, which was to have taken place in June, was pushed back to March. The 2020 edition of the fair will also be held at Fortes, London, and the 2020 edition of the fair will be held at the Royal Festival Hall.\n\n\nThe Canadian Museum of Fine Arts (CMFA) in Montreal announced today that it has received a gift of more than 2,500 works from artist-activists and activists, including works by artists such as John Akomfrah, Nari Ward, and Ayelet Waldman. The gift includes works by artists such as René", "The next Biennial should be in December 2021. “I am very excited that this year’s event will be held in September and that we will be able to celebrate the new partnership with the National Philharmonic Orchestra in Washington, DC, while simultaneously showcasing the rich history of our art and the work of our artists,” said Yoko Astash, director of the Center for Contemporary Art at the University of Southern California.The partnership between the two institutions marks the beginning of a new chapter in the artist’s history. The biennial will include an exhibition of works by fifteen artists, including Anna Atkins, Francis Alÿs, Léa Jacob, Alighiero Lázaro, and Peter Sellars, and will include a lecture by Christina Ricci, a professor of art history at the University of Cagli.Hiroshi Kawabata, a professor of art history at the University of Tokyo, will preside over the inaugural event, which will be held in September. The artists who will be featured in the biennial’s twenty-fifth iteration are as follows:Asana Hayashi, Satoru Takeda, Atsushi Nomura, and Akiko Shimizu. The bi", "The next Biennial should be announced in the coming weeks. The committee will have the final decision on the exhibition.\n\n\nThe British Council will award the Queen Elizabeth II Sculpture Fund £8.5 million in support of its 2020 yearlong celebration of the life and work of Queen Elizabeth II. Yale Union, the Institution of Arts and Design (I.A.D.R.), and the National Galleries of Scotland will each receive £1.5 million for their respective curatorial roles. The funds will support the construction of new exhibitions and cultural spaces to celebrate the life and creativity of the monarch.“The event will be the culmination of more than three decades of visionary leadership by Paula Bennett, who has shaped our imagination, and will invite everyone to enjoy and immerse themselves in the life and life of Elizabeth II,” said Annie Delmonico, director of the National Sculpture Garden. “The her Majesty served as a guiding inspiration and landmark for countless artists and I am delighted to support her in reminding our collective memory of her greatness.”Bennett, who died in May at the age of eighty-five, was appointed curator of the yearlong celebration of the life of Elizabeth II by the National Gallery of", "The next Biennial should aim to “implement a new political and economic order for Europe’s artistic and cultural heritage, instilling the necessary political will and the will to preserve the treasures of our heritage centers.”The 2019 edition of the event, titled “Art and Culture in Europe’s Struggle,” will be held at the Fondazione Biennale Centrale di Milano, in Milan, Italy, and will run through December 20.  The organizers of the event are planning to send the exhibition to New York City, Paris, Berlin, and London. The theme of the show, “The Art of War,” is “Allometry: Technology, Reality, and War” and describes the art of war\u0097the art of engineering, the art of war photography, the art of war video games, the art of war films\u0097as a “life-form,” an “inanimate entity.”\n\n\nArt Basel is planning to shutter its Hong Kong operations, according to Artnet, citing the decline in attendance and revenue. The decision follows negotiations with the Hong Kong government over the treatment of a massive, over-the-top", "The next Biennial should take place in 2019, in the first instance in Leipzig. The event will undergo a major renovation and will also benefit the many organisations involved in the festival. The Berlinerische Kunstverein will provide programming in the museum and will continue to present the event. The exhibition will be expanded to include new works by artists whose works were selected by the public.\n\n\nThe Andy Warhol Foundation, which was established to preserve and present the most significant works created by American artist Andy Warhol, has announced the winners of its fourteenth annual Art of the Hour prize. The prizes were awarded by Jamie Crewe, director of the Andy Warhol Foundation; Alex Krauss, director of the Fletchley Gallery in New York; William Wegman, director of the Museum of Modern Art in New York; and Sarah Sze, director of the Museum of Contemporary Art Cleveland.RICHARD WILLIAMS, Fletchley GalleryMuseum of Modern Art ClevelandCARY BLAIR, Fletchley GalleryMuseum of Contemporary Art ClevelandCAROLINE LEWIS, Fletchley GalleryMuseum of Contemporary Art ClevelandSTEVEN SMIER, Fletchley GalleryMuseum of Contemporary Art ClevelandMER", "The next Biennial should be held in 2020, and the exhibition will go on view in the city in 2021. The installation will be accompanied by a new print by the artist which will be seven hundred square feet in size and will open in the exhibition. The show will also include an exhibition of work by the American painters Glen and Edna Edsel, Nick Cave, and David H. Koch. Franz Knopper, the biennial’s curator, said the exhibition “will celebrate the rich history of the artist and artististic practice in a new way.” He added: “With an increase of twenty-five artists in the next biennial, we hope that the experience of the exhibition will be as memorable as the work itself: that it will be a collection of works that have the potential to influence and change our lives, to be the catalyst for reflection on the world we live in.”The selection of the fifteen artists to represent Italy for the 2021 edition of the biennial will be made by a group of curators led by Francesca Forti, Nicola Zingaretti, Maria Cappellacci, and Giovanna Pisani, comprising Solveig, Momos, Cimino,", "The next Biennial should be a collective experience, taking the creative and artistic possibilities of contemporary life and presenting them in the form of a series of performances, one-person concerts, and other cultural events. The first Biennial, the inaugural Dia Art Foundation–Columbus Biennial, took place in the summer of 2007 and featured work by twenty artists, including Artadi Ose, Filippo Di Marzio, Simon Martin, and Alighiero Medrano. This edition was held in 2009 and exceeded expectations. This year’s event will be the first inaugural edition, a collaboration between the Smithsonian American Art Museum and the Los Angeles County Museum of Art. The theme for the biennial is  Terrorism and the Politics of Power, and the biennial’s curators are Bruno Latour, Troy Turner, and David McAllister.\n\n\nThe Metropolitan Museum of Art in New York has appointed Roberta Smith as its next director. She will assume her responsibilities on October 21, 2020, and will begin her tenure in January 2021.Smith comes to the Met from the Museum of the City College of Art and the Museum of Modern Art, where she has served as director since 2014", "The next Biennial should take place in 2021.\n\n\nPace/Bosch, now owned by the Charles Group, plans to sell the popular German performance, theater, and art space to American private equity firm Apollo Global Management for $3.65 billion in cash. The move means that the space will be absorbed into the private art museum industry, which is rapidly expanding in Europe and the United States.In an effort to diversify its holdings in Germany, the company has appointed Lutz Bacher, a former chief executive of the Bezalel Art Museum, as its new managing director. Bacher will assume his responsibilities on January 1, 2020. “Pace’s commitment to Germany and to the arts is unparalleled,” said Marc Spiegler, president of Pace’s board of directors and cochair of the history committee. “Lutz is an experienced and talented leader and a great admirer of German culture. His history at the Bezalel and his expertise in managing the museum make him a natural fit with our mission and our priorities. We look forward to working with him and to supporting his efforts to put the museum back on track.”While he is not listed as an executive director of", "The next Biennial should be held in 2021. The next Biennale should be held in 2021. David H. Sonnabend Art Museum, City of New York: To be announced David H. Sonnabend Art Museum, City of New York: To be announced David J. Holloway, Jr.: To be announced David M. Katz, Jr., Art at the Art Institute of Chicago: To be announced David M. Katz, Jr., Art Institute of Chicago: To be announced David M. Katz, Jr., The Museum of Modern Art: To be announced David M. Katz, Jr., Whitney Museum of American Art: To be announced David M. Katz, Jr., The Whitney Museum of American Art: To be announced David M. Katz, Jr., The Metropolitan Museum of Art, New York: To be announced David M. Katz, Jr., The Metropolitan Museum of Art: To be announced David M. Katz, Jr., The Whitney Museum of American Art: To be announced David M. Katz, Jr., The Museum of Modern Art, New York: To be announced September 25, 2020. David M.", "The next Biennial should take place in 2022, and the following twenty-first.\n\n\nThe Museum of Modern Art (MoMA) in New York has released the list of thirty-nine artists who will participate in the eighth edition of the Metropolitan Museum of Art’s “Metropolitan Sculpture Show,” which will take place in 2020. The event, which will run from March 21 to March 23, will highlight contemporary work by artists such as Ollie Aycock, Fredrik Fisk, Zoran Jovanović, and Julian Schnabel and will feature performances, films, and installations by artists such as Paul Gauguin, Ed Moses, and Jacques Futuyma.“We are thrilled that the ninety-nineth edition of the Met will mark the centenary of the opening of the Museum,” said James Cuno, chair of the board of trustees. “The exhibition is the perfect medium for introducing new and exciting artists to the Met, and for exploring the museum’s legendary collection as well as the development of its programming.”In addition to the twenty-first edition, the museum will work with a group of artists to develop and reimagine an exhibition that celebrates the twentieth-", "The next Biennial should be held in 2021. The full list of participating institutions is as follows:Braun Center for the Arts\n\nUniversity of Chicago\n\nHarvard University\n\nFree University\n\nThe Institute of Contemporary Art\n\nNew York University (NYU)\n\nThe Institute of Contemporary Art, New York (NYU)\n\nThe Knoxville Museum of Art\n\nNew Mexico Arts Center\n\nThe Museum of Fine Arts, Houston\n\nThe National Gallery of Art, Washington, DC\n\nOrganization Gallery, New York\n\nOrganization Arts, New York\n\nOrganization Art, New York\n\nOrganization Contemporary, New York\n\nOrganization Contemporary, New York\n\nOrganization Contemporary, New York (NYU), New York\n\nOrganization Contemporary, New York (NYU), New York (NYU), New York (NYU), New York (NYU), New York (NYU), New York (NYU), New York (NYU), New York (NYU), New York (NYU), New York (NYU), New York (NYU), New York (NYU), New York (NYU), New York (NYU), Organization Contemporary, New", "The next Biennial should take place in the spring of 2021, with a new exhibition every four years. In a statement, the museum said: “The new and updated Mall of the Americas is a source of inspiration and inspiration for us all. We are deeply committed to connecting with our surrounding world through exhibitions and programs that engage with our communities, and the future of our institutions and the planet. We look forward to the public engagement for which the Mall of the Americas has always been and will always be a site of inspiring exhibitions, remarkable performances, and fresh perspectives.”\n\n\nThe San José Museum of Art (SJMoA) in California has received a $1.5-million donation from the Andrew W. Mellon Foundation. The gift is part of a larger cycle of gifts that began at the Richardson Art Museum in Texas in 2020 and ends this year. The grant, made by the Andrew W. Mellon Foundation, was announced in 2019 and is made in support of initiatives to increase the visibility and accessibility of contemporary art through art museums and art galleries. Mellon selected the J. Paul Getty Trust as the grantee for the sculpture and installation project The Apprentice, which was organized as a collaboration between the museum and the Getty Trust in", "The next Biennial should be held at the Serpentine Galleries at the London Art Museum, adjacent to the Museum of Modern Art, in the summer of 2021.\n\n\nNew York’s Metropolitan Museum of Art (MoMA) is planning to open a new, fully digital experience, dubbed the Metbex, that will allow visitors to see and interact with the artworks of New York’s rich collection digitally. The museum is also working to make the museum’s flagship space in Midtown Manhattan accessible to the public online. The Met has yet to announce when the new physical space will open.The strategy of developing digital content in collaboration with artists and cultural producers and the Museum’s collection, which consists of more than 65,000 works, has been in development for several years. The Met has already unveiled new works by artists such as Terence Blanchard, Ken-ichi Imai, and Louis Malle, among others, and recently expanded the digital platform with work by Italian contemporary Paolo Baratta. The idea behind the new Metbex is to connect with artworks through the experience of digital technology and to mirror the experience of seeing them in person.The digital experience will feature new artworks that were made using new", "The next Biennial should take place in 2020, and its themes should reflect the changes and challenges of the current moment and the biennial’s own history, García-Alvarez said. The program will also include a literary program and a performance series.The first show of the new series is entitled “Claudia,” which will be presented by the Argentinean artist and collector Melchor Eduardo Banderas. The show will feature biographical sketches of the artist’s most famous works, the first two of which are shown in the first and second halves of the biennial’s exhibition, “Claudia,” which will open at the Museum de Arte Contemporáneo Buenos Aires on December 19 and December 21. In the first half, which features biographical sketches of the work from the artist’s childhood, Banderas tells the artist about her childhood in Buenos Aires. In the second half, which will draw from her own personal collection, galleries, and works, the artist will present the artist’s most recent exhibition.“Claudia’s latest exhibition, “The Transfiguration of Claudio,” will open at", "The next Biennial should be held in 2022.\n\n\nThe Shenzhen Biennial of Contemporary Art has announced it will suspend its inaugural edition, which was set to begin on October 24, 2019, as planned, in protest of the Chinese government’s crackdown on pro-democracy protesters. The event, which was organized as part of the country’s 2020 National Day celebration, was canceled owing to the ongoing nationwide anti-terror campaign, which has seen China tighten its grip on Hong Kong.Activists and organizers of the event, which was organized in collaboration with the Hong Kong artist Taizhou Yan, said the cancellation was made in solidarity with those who have been detained in China for months without charge, including the American artist Leila Usopp, who was detained for six months, after she crossed the border into Shenzhen in September, and the artists Richard Tsang, Xu Wei, and Zoya Mu, who were all released on bail in October after they were arrested for refusing to leave China.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has moved ten thousand works by artists and collectives incarcerated in the United States, including Javaree Yarbrough (1926–2004), Kerry James Marshall (19", "The next Biennial should take place in 2020. The programme will then be revised and expanded, in order to become a heritage museum.The 2020 edition of the Biennial will be held at the British Museum in London. The theme will be “The Future of Art: From the Shard to the Future,” and will be “Art and the Future of Humanity,” highlighting the work of British artists. In the past, the museum has staged the festival—which has been held in London every September—twice a year. The event will focus on “the future of art, what it might be and what it might not be,” with the theme “The Future of Art” being taken up in a separate biennial, “The Future of the Body.”The announcement of the 2020 edition of the biennial was made by Monica Lipsey, director of the British Museum, and Martin Gilbert, chair of the board of trustees of the British Museum. The 2019 edition, “The Future of Art in the 21st Century”, was organized by the British artist David Adjay and premiered at the Museum of Modern Art in London. The theme of this year’s exhibition was �", "The next Biennial should take place in the Bay area. The first was held in 1987 and was held in the San Francisco Museum of Modern Art (SFMoMA) and the Museum of Modern Art in New York. The new exhibition should open in late spring or early summer. The next iteration of the 2019 event, entitled \"Beyond the Frame: Art in the Age of Film, will take place at the Hammer Museum in Los Angeles from May 21 to May 23. Andriy Lutsenko has been awarded the 2019 Nobel Prize in Physics. The biennial will also introduce the public to the work of seventy-two artists, including architect André Breton, painter Jean-Michel Basquiat, sculptor Hans Christian Andersen, and animator Penélope Cruz. The prize jury also awarded the award for the best essay prize, which was given last year to Anastasia Pappas. This year’s biennial will feature the work of eighty-seven artists, including fifty-nine from the Czech Republic, twenty-eight from Slovakia, and twenty-three from France.The 2019 prize ceremony will take place at the Hammer Museum in Los Angeles on April 7.\n\n\nThe Museum of", "The next Biennial should focus on the production of works that reflect the cultural, social and economic diversity of the city as it relates to the film and art world. The next edition of the Biennial will highlight the work of young and established artists, its impact on the local community and biennial teams, and will take place in the Holm Museum, which is currently undergoing an expansion, from May 6 to May 6, 2020. “This is a moment of great change for the art world in Berlin and, over the course of the year, it has been a source of inspiration for many artists, especially for Gerhard Richter, who was chosen to represent Germany at the ninety-fourth Venice Biennale in 2014; Carl Scateri, a Berlin-based artist who works primarily in the film and video arts; and Ulrich Haag, a fine-art and design designer who creates works that are inspired by the artist’s own personal style.”\n\n\nThe National Gallery of Scotland announced that the institution will reopen on August 22 following a £4 million upgrade, following a £3 million facelift, in order to rejoin the rest of the UK in meeting the Paris Climate Action Agreement (CAC) by", "The next Biennial should also consider the role of the living, and especially the living souls, in contemporary life. Our curated exhibition will feature the work of forty-seven contemporary artists, including Patricia Aitken, Adam Conley, Tanya Gherb, Mona Hatoum, Martine Ho, Paula Hsu, and Cécile Normand.The exhibition will be held at the San Francisco Museum of Modern Art (SFMoMA) through December 25, 2020.\n\n\nThe Metropolitan Museum of Art (the museum) in New York has added two new members to its advisory board: Alex Gartenfeldt, who will serve on the board from January 2020 to December 2021, and Stacey I. Berger, who will begin her tenure in January 2021. Berger will also serve as a cochair of the advisory board for the next two years and advise the museum on public programs.“We are delighted to welcome into our board members Alex Gartenfeldt and Stacey I. Berger, both accomplished and visionary artists whose exceptional writing and artistic practice will shape the trajectory of the museum’s exhibitions, collections, exhibitions, and programs,” museum director Daniel H. Weiss said. “Alex has written extensively about her experiences", "The next Biennial should be held in 2020. \n\n\nThe University of the Arts (UVA) in Virginia has received a $50 million donation from the Center for American Art in partnership with the Morgan Family Foundation. The philanthropic organization, which has given the university $39 million since 2007, said the gift is crucial in supporting the Center for American Art’s mission to present work by contemporary artists and to broaden the scope of its collection.UVA is also reviewing commercial opportunities for the Arts and Science Bank, which has a strategic partnership with the federal Department of Education.  The bank is evaluating more than 80 nonprofit arts organizations across the United States, including libraries, arts and cultural organizations, arts and cultural preservation and restoration projects, arts and arts education, and arts and science centers. It plans to launch an online platform in the coming months that will allow community members to submit artwork and other materials for consideration.\n\n\nThe National Endowment for the Arts (NEA) announced the recipients of its “Blue Ribbon” grants last month. The six grants—which were awarded to twenty-six artists and small to mid-size arts organizations of various sizes—provide a critical lifeline to help them through the challenging economic climate as", "The next Biennial should be held in 2024.Ward noted that the forthcoming exhibition “is about to enter a period of transition. I am convinced that the critical question that will determine the future of exhibitions is how to incorporate art and the environment under the influence of technology to create even greater dynamism and variety in exhibitions.”The theme of the next iteration of “Art and the Future of Science” is “Artists and the Future of Man.” This edition will be curated by Harald Szeemann and will feature artwork from the likes of Svetlana Nikdas, Adeline Pascual, and Kiki Smith.\n\n\nThe University of Maryland, College Park, has announced that it will begin allowing visitors to its campus in Annandale-on-Hudson (Ahern) in early 2020. The move was made after the university received permission from the state of Maryland to begin permitting the use of the campus for nonresidential purposes, including academic study and recreation.“This is a transformative moment for Ahern, and we are ready to take the next step by allowing the community to have a significant impact on the future of the arts and architecture on our campus,” said university chancellor", "The next Biennial should be held in 2021. The next Art Biennale will take place in Berlin in 2021, and the next Art Nouveau will be held in 2022. The 2018 edition, the third international event, was held in London and was selected by a jury consisting of Haim Segal, director of St. Martin’s College London; Anne Wister, artistic director of Tate Britain; and Jonathan Daniel, a director of the Royal Academy of Arts, London. The 2019 edition, the last before construction of the new building began, was held at the MCA and was selected by a jury comprised of Katja Zemblich, director of the MCA; Simone de Beaufils, director of the Tate; Alexandra Haiduk, head of the School of Arts, London; Harriet Murrison, the curator of modern and contemporary art at Tate Britain; and Claudia Molina, the director of the Contemporary Art Museum St. Petersburg. As the project of the MCA’s new museum, the museum will be transformed by a new, large-scale exhibition with a new collection of nineteenth-century artists and by an upgrade of the museum", "The next Biennial should open on August 17 and will include three exhibitions of work connected to the exhibition, \"The Dreamer in the Landscape: Biennial Exhibition,\" designed by Olu Oguibe and featuring works by Haus Melchior, Erik von Künth, and Muriel Stahl; a presentation of work by Gisèle Freund and Stanley Whitney; and an exhibition of works by John Gell-Mann and Jasper Johns. The third exhibition, titled “Dreamers: Biennial” and curated by Richard Prince, will showcase a group show of new works by fifty artists. “The Dreamer in the Landscape: Three Biennial Experiences” will open on August 16 and will receive visitors on August 14. It will be the first time James and I have participated in a biennial and we expect most of the participants to have an immediate connection with the collection as it is their work, and the collection, that most directly challenges their ideas about the nature of dreaming.”\n\n\nArts institutions across the United Kingdom that have already received funding from Tate Britain are now facing a backlash from hundreds of thousands of people who are dissatisfied with the decision to give the arts body", "The next Biennial should have an opening on December 14 and be open to the public in December. The programme will be curated by Katherina Mpagi Sepuya and will feature thirteen new works by twenty-eight artists. The exhibition and the biennial will be housed at the Guggenheim in London. The exhibition and biennial is part of the ‘Post Modern Movement’s project to foster an “epic of art” in the United Kingdom. The exhibition will feature work by ten artists, including Michael Heidfeld, David H. Martin, and Janet Mock, on the eve of the opening of “Post Modern Art” in London in May.\n\n\nThe Museum of Modern Art (MoMA) in New York has announced plans to move the museum from its current location in downtown Manhattan to the nearby site of the old Hudson Yards complex, which has been undergoing a $1.4 billion expansion plan since 2011 and is slated to open in the spring of 2021. The institution previously announced its intention to move the museum from the site of the former naval aircraft carrier in June 2018 and invited the public to comment on its future plans.In a statement, MoMA said: “[The] relocation", "The next Biennial should take place in 2019 to coincide with the first edition. Be sure to visit the Li Gallery to see all the works that were selected for the exhibition.The biennial will present a selection of works in partnership with the artists and will be launched with a free, open-air event. The exhibition will be held at New Delhi’s iconic Taj Art Museum from March 23 to March 27. The first show inside the Taj will be an exhibition of works by artists such as Kamal Adham, Sajid J. Taher, Sujatha Raman, and Amine Iqbal.The fifth edition of the Safariland Biennial will take place at the foothills of the Himalayas in the city of Safariland from June 9 to June 14. The event will be hosted by the Indian Institute of Art (IIA) in Mumbai. The exhibition will be marked by solo exhibitions of works by Revolver, Evgeny Tkachenko, and Bibi Vaidyanathan.“The Safariland Fair is a great opportunity to further develop our international art scene in India, which has been so badly damaged by the pandemic,” Artnews reports. The fair", "The next Biennial should be held in 2020 and will be organized as a series of exhibitions, which will include the works of a select group of artists from all over the world. The exhibition will have a budget of $150,000, which is approximately $5 million in today’s dollars.The Biennial will then have a new exhibition scheduled, and a new biennial will be organized as well, which will take place in the following years. Dubai Speculative Centre and Museum will also welcome visitors from the global marketplace, which has experienced a worldwide shortage of works, in 2020.The exhibition will be inaugurated by a live performance by American artist Sylvia and Wallace Stevens, followed by a talk by Terence Blanchard. At the end of the event, the Stevens–led biennial will be inaugurated by the artist Mark di Suvero’s Mountain of Silence, and a new Lotus Flower Art Festival will be staged at the Dubai Museum of Contemporary Art.A statement published by the couple reads: “The world has changed for the better in the last fifty years, but for the worse in the last fifty years. Several cultural traditions have been displaced and others have been compromised. We are optimistic", "The next Biennial should take place in the fall of 2020. \n\n\nThe Seven Sisters Museum in the British city of Bristol announced today that it is planning to reopen to the public in August. The institution will be inaugurated by a performance of a work by the Danish artist Julie Parzival, a collaboration with the artist-activists Yvonne Hansen and Martin Luther King Jr., and will feature works by contemporary artists such as Marc Chagall, Verne Dawson, and Cézanne before the institution’s permanent debut in May 2020.Inaugurating the building will be a series of public exhibitions, including the exhibition “The Marriage of One.” The exhibition will be followed by a series of activities and concerts, which will be organized in collaboration with local artists, including a sculpture memorializing the life of the artist-activist Laura Jane Grace, and will culminate in a public viewing of the work, titled “We Are One.”“The work that will ensure this is a show of the work of the seven sisters,” said Catherine Altman, director of the Seven Sisters Museum. “The work of the sisters is to always be aware of and always conscious of the work in front of you", "The next Biennial should be held in the spring of 2021. The first iteration of the event, titled “In the Shadow of an Empire,” was staged in 1954 as part of the first exhibition organized by George Florek at the Museum of Modern Art. The exhibition, which was curated by Florek and Henri Cartier-Bressi, was staged in Paris and consisted of more than 1,500 works by around sixty artists. \n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Alexandra Danforth as its next director. Danforth takes the helm from director Paul Mpagi Sepuya, who retired in November after nearly four decades at the institution. She succeeds architect Daniel Libeskind, who was hired as curator of twentieth-century and contemporary art in April.“We are pleased to welcome Alexandra to the MoMA family,” said MoMA director Daniel H. Weiss. “Alexandra is an exceptional curator, a gifted communicator, and a steadfast advocate for MoMA’s mission. We are proud to have her on board for another four years and look forward to her continuing to build on the museum’s reputation as a champion for the arts.”Danforth", "The next Biennial should be a great success. We are determined to carry on our work in the spirit of openness and creativity and develop new and innovative projects.” To mark the occasion, the exhibition hall will be transformed into a public space and the building will be reconfigured to introduce a platform for the exhibition of new works. The exhibition will be hosted by the artist-run platform ArtStation, which has hosted several of Vincent van Gogh’s works, and will run from November 19 to March 21, 2021.\n\n\nThe Museum of Contemporary Art (MoCA), Japan, announced today that it has received a gift of fifty-two works by artist Ai Weiwei\u0097including twenty-one works from the ’70s and ’80s, and twenty-four works from the ’60s and ’70s\u0097from the artist’s widow, Alice Wei. The museum also revealed that the artist’s final exhibition at the institution, “Ai Weiwei: The Age of Shadows,” will be held in October 2020.The works are part of a major retrospective of the artist\u0097since its inception, the exhibition has featured more than 430 works\u0097and are part", "The next Biennial should be held in 2022. A future edition of the exhibition will be held in the city in 2025.The first edition of the pavilion, titled “The Eternal Body,” was held at the Gallery of Modern Art in London, in 1976. The second edition, titled “The Body and Place,” was held in 1978. The third and final edition, “The Body and Other Works,” was staged at the Museum of Modern Art in New York in 1995.The Biennial is comprised of two phases: a retrospective of the work of Marie Brennan, a sculptor and the first Asian American woman to win the Pulitzer Prize; and a symposium involving the work of four artists who are not Asian American: Annie Donohoe, Lachlan David, Catarina LeBlanc, and Tania Markova. The biennial’s format is structured as a series of performances, exhibitions, and residencies, which have been organized by the participating artists and are organized as follows:January 2019April 2019March 2019February 2020March 2021March 2022October 2020November 2020November 2021November 23 “The Body and Place’s” (2017)January 2019February 2019January 2019February", "The next Biennial should move to a location that will be used as a gathering space for the city’s cultural community in the future, and will focus on the progression of art in the city.”The first edition, which was held in March 2019, featured work by seventy artists, including Carlos Castaneda, Amantino Dallos, Patricia González, and Juana Cervetto. As the coronavirus continues to spread, the number of cases is expected to rise—according to the Guardian, as of September 24, there were seventy-seven cases and forty-four deaths worldwide.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Elaine May, the CEO and chairman of the California-based nonprofit Art Partners, as its next executive director. May will begin her new role at the institution on September 5.“In the past six months, the museum has made significant progress in addressing its long-standing and growing financial and operational challenges,” said museum chair Deborah Glick. “Having the opportunity to continue to advance this work while simultaneously expanding our international reach and attracting and training the best and brightest artists is an honor. I’m looking forward to working with Elaine and", "The next Biennial should be announced in the first half of the year and will feature three exhibitions: “Ploughshares: From the Agony of the Pale to the Glory of the Golden Age” (February 21–February 27), “The Death of a Nation: American Art and the Struggle for Civil Rights” (February 29–March 5) and “The Art of War: Lessons from the Pacific Theater” (March 7–March 9).\n\n\nThe Hong Kong Museum of Art (HKMO) announced today that David Kato has been named the seventy-fourth director of the museum and its Hong Kong outpost, the Hong Kong Art Museum (HANG), will reopen next month. Kato succeeds Suek-Ming Wu, who has served as director of the Hong Kong Art Museum since 2010, and will take up the post on July 1.“I’m excited by the prospect of continuing to lead this iconic institution, which has been a platform for Hong Kong’s artists for more than two centuries. Hong Kong represents a remarkable story of self-determination, collaboration, and resilience, and I look forward to elevating that story through the exhibition program and exhibition program of the Hong Kong Art Museum,", "The next Biennial should focus on the work of artists and organizations whose work has been inspired by the Cultural Revolution and has the potential to be restored. The first exhibition will focus on the historical preservation of artworks, with the aim of providing a platform for contemporary artists and organizations to consider the concepts of restoration and restoration. The second will be a collection of works by artists whose work has survived the cultural and political upheavals of the Cultural Revolution, and will introduce new ideas and programs to further the work of the past.The twenty-fifth edition of the Twenty-Second Biennial, which will take place in the capital city of Chongqing, China, will be held at the Anhui Expo Center from March 14 to March 16. The event will also include the first public exhibition of work by artists who were active during the Cultural Revolution in China, and will present the first exhibition of work by an independent artist group in China. The show will be organized by the Anhui Art Museum and Art Museum in Wuhan and will showcase the work of eighteen artists from thirty-eight countries.Titled “Art and Restoration in China” and curated by Mr. and Mrs. Jia Yu and will run concurrently with the Biennial, the first", "The next Biennial should be held at the Met, in October 2021, and would lead the way for the exhibition of the artist’s work in combination with the museum’s collection. The twenty-third edition of the exhibition, titled “How We Live Now,” will be in the US in March 2022. The twenty-fourth edition of the exhibition, titled “The Environment,” will be held in the US in October 2022. The twenty-fifth and final edition of the exhibition, titled “The Art of Body,” will be staged in December 2022. The full list of participating artists and their venues can be found here.\n\n\nActor Kevin Nealon, the founder and director of the nonprofit group the Kevin Nealon Foundation, was found dead of a presumed heart attack on Tuesday in his home in Los Angeles at age forty-eight. According to a report in the Los Angeles Times, the cause of death was a “cardiac arrest.” According to the coroner’s office, coroner’s officials ruled the cause of death as “cardiac arrest followed by trauma to the chest.” The cause of death was a “cardiac arrest followed by trauma", "The next Biennial should take place in 2019. “In the meantime, we are already collaborating with artists and collectors in the art world from all over the world, to present platforms for their work,” the museum said in a statement. In an interview with the New York Times on February 10, Maurer said that the institution “wouldn’t be able to set up the biennial as quickly or as smoothly as we would have had to take these events on by ourselves.” He added that the decision to commission the show was not an “easy one.”\n\nMadison Square Garden has announced that it will hold its fourth edition—eventually slated to run from March 19 to March 21, 2021—on March 9. Its inaugural edition, which was pushed back by a mere two weeks due to the Covid-19 pandemic, will now take place from March 14 to March 16, 2021.The 2020 edition of the biennial, “The Vino Equilibrio,” will be hosted by SculptureCenter and will draw an additional sixty thousand visitors. The event will also introduce a new strategic plan and will introduce the first paid section of the biennial, which will run parallel to", "The next Biennial should be in the summer of 2021.\nWe are moving to a new space within the museum, which will be conceived as a space for reflection and community and rooted in the museum’s collection of contemporary art. The facility will be divided into thirteen spaces and will feature a central courtyard, a café, and a guest house. The building’s design will incorporate a triple helix of glass’s, which will form the central core of the new space. The helix will be comprised of at least eleven levels, each with a rooftop terrace. The interior of the building will be designed by Taub, and the exterior will be made of mixed-media, including stone and wood panels.“Our design embodies the core values of the Biennial and embodies the spirit of Atlanta as a city,” said architect Naima J. Keith. “We have created a space that embodies the spirit of Atlanta and the city as a whole.”\n\n\nThe Metropolitan Museum of Art in New York has appointed Sue Barlow as its next director. In her new role, which begins on January 21, Barlow will oversee the organization’s expansion, titled the Metropolis, of", "The next Biennial should be held at the same time as the next World Exposition in Hong Kong, and will focus on exploring interpretations of the so-called golden calf. The theme of the next edition is “The Future Is Present.” The event will be held at the SoMa Museum of Art, which is currently undergoing a $100 million renovation, and will be hosted by the artists Lili Alkadhy, Madeline Alkadhy, and Lina Alkadhy.Each artist will receive a $500 stipend. The deadline to apply for the funds is July 30. The deadline to apply for a space at the museum is July 28.\n\n\nThe Museum of Contemporary Art (MoCA), California, has appointed Paul J. Mawdryn as its first director of curatorial affairs. He is a Chicago native and a veteran curator who has worked for the institution for twenty-five years. Mawdryn joins the museum from the Metropolitan Museum of Art, where he has served as director of exhibitions since 2017. He previously helmed the museum’s redesigned galleries and developed the contemporary art program for “All Are One: Contemporary Art and the Metamorphosis” (2006–2007", "The next Biennial should be held in 2021.\n\n\nThe London-based nonprofit Art Support has published a statement regarding the Rendering of the Grand Galleries Museum (RGM), the contemporary art museum in London, which opened on January 3, 2020 and was scheduled to close on January 16, 2020. The statement reads: The RGM has received notice from the High Court of England that it is unable to continue with its construction at this stage. The building of the museum will inevitably require major refurbishments and the future of the museum’s future exhibition programming is now at risk. The RGM’s board of directors notes: “At this stage it is not possible to know what the future holds for the museum. As part of the legal team’s commitment to discussing future programming with the Court, we are working with the court to ensure that the RGM remains at the forefront of cultural engagement and innovation. We are also working with the Crown Prosecution Service to work with the prosecution to explore the possibility of expanding the RGM’s exhibition program to meet the needs of a wider social audience. The RGM’s director, Martin Gilbert, added: “I can confirm", "The next Biennial should be held in the spring of 2021. \n\n\nThe French cultural minister, Franck Riester, has issued an official apology for his statement in which he said that the government is committed to rebuilding relationships with the approximately two hundred French-speaking communities in the country who are currently closed, a statement by the Paris-based Artforum.fr reads. Riester also said that the government does not intend to reopen the communities but will work with them to figure out how to share the financial burden of the closure. He also said that the government is hopeful that the communities will open up.“The French government is committed to restoring a healthy environment for the many arts and cultural activities that are currently closed,” Riester said. “This is our obligation, not only as a society, but also as a nation. We must not forget these communities. They were the ones who asked for the construction of the national cultural monuments. We must listen to them, help them in their time of need, and protect their cultural heritage.”\n\n\nThe British Museum has shed more than three hundred paintings and works on paper by prominent artists including Edvard Munch, Bertrand Russell, Pierre-August", "The next Biennial should take place from March 5 to March 6.  The third will be held at the Ulo-Bicik Visitor Center in Nuremberg from March 6 to March 10. The final will be presented at the Biennial Art Museum in Prague from March 14 to March 16. The first two biennials were held at the Museum of the Moving Image in London and at the National Museum of Modern Art, Washington DC. The third will take place from March 5 to March 7.  The fourth, entitled The State of the Mind, will be curated by Alejandro Cesarco and will be staged at the Sijksmuseum, the Netherlands; the Vogel Museum, Switzerland; and the Biennial Museum in Stedelijk Museum by the Biennialists from March 7 to March 9. The fifth exhibition, entitled Contemporary Art in South Asia, will be curated by Aarti Sarkar and will be staged at the New Delhi Art Event in Delhi—the first time that the exhibition will be held in the country. The sixth exhibition, titled Indo-Iranian Art in the 1980s, will be curated by Satyaj", "The next Biennial should be held as soon as possible, and will be dedicated to the research and exhibition of the first text on the themes of the exhibition, “The Language of the Code: Latin American Art” (2019). The current show is part of the grand project “The Future of Modern Art,” which was started by the Museo de Arte Contemporáneo in 2007 to bring together twenty-five contemporary artists from the Americas and the Caribbean. The exhibition was inaugurated by a solo exhibition of work by Roberto Cicutto, which was held in 2011, and followed its first episode in the Museum of Modern Art (MoMA), which opened in 2013.The biennial will be curated by the artist-turned-curator Wanda Pérez, who is currently working on a book on the history of the art of the Americas; José Luis Córdoba, who is currently incarcerated in Mexico City after being tried and condemned for his role in the 1994 bombing of a military parade in San Andrés; and Arturo Rosales, who was recently awarded an Order of the Holy Cross by Pope Francis.The exhibition “The Future of Modern Art” will be on view until October 27", "The next Biennial should take place at the Seattle Art Museum (SAM), in 2020. The next event, the Seattle Book Fair, is scheduled for 2021. The Seattle Art Fair will be held in the same location in 2021. For the past twenty years, the Seattle Art Museum (SAM) has partnered with the Seattle Children’s Museum to present a free event each year. The event has drawn an average of 867,000 visitors annually. On January 12, 2018, the museum announced that it will no longer participate in the annual event. “We believe that the best way forward for the Louvre is for the museum to remain open and offer a biennial that is inclusive of all of the different kinds of art and exhibition,” said museum director Monica K. Maior. “It is also the best way forward for the city of Louvre to be able to continue to present the relevant works and exhibitions that have had the greatest impact on our lives over the past forty years.”\n\n\nThe Manfred and Anna Loeb Foundation in Germany has received a gift of twenty-four works by Italian painter Gio Ponti for its exhibition “The Last Days,” which will open at the Berlin", "The next Biennial should open in 2020, when the exhibition\u0097which was relocated from the Museum of Modern Art in New York to the Santa Barbara Museum of Art\u0097has already announced its attendance. The show’s director, David Barr, said: “Our mission is to make art in the spirit of the Americas. . . . I’m thrilled to see that this will be the last exhibition of the ‘Aristoteles’ program. We always find ways to make art in the spirit of the Americas.”\n\n\nThe Flemish government is planning to launch a $1.2 billion fund to protect the country’s historic monuments, which are threatened by the rapid urbanization of cities and are often overlooked in debates over cultural heritage. The restoration program will aim to create a new conservation law that will give the government more powers to prevent the destruction of art and will prioritize the preservation of cultural monuments.According to the New York Times, the policy shift will confront a fragile landscape of nearly one hundred monuments in the Netherlands, where the number of people killed by the country’s violent extremism has more than doubled since 2015, and will also revamp the country’s criminal code. The plan", "The next Biennial should focus on “art and the social ecology of postcolonial Africa,” said Rufus. “It should also examine the role of art in the contemporary politics of Senegal, Indonesia, and Brazil. We welcome any and all suggestions and critiques, as these only add to the long-term preservation of the exhibition.”\n\n\nThe ADAA, the American design and art collectivism association based in New York City, has announced that it has suspended its next edition, “ADAA Milan,” which was set to take place in September, after the organizers received a complaint about a certain “Mariana Al-Khair/Fredrick Berenger” art installation, as well as a number of other works that were exhibited at the venue. In a statement, the ADAA said that the final show of the ADAA Summer/Fall fest will run from September 25 to October 10.The works that were suspended are Samuel Colangelo’s “The Dawning of the Sun,” which was partially installed at La Justino Dallazzaro, the Casa d’Arte Contemporanea in Venice, and the “Eternal Blue Sea", "The next Biennial should take place in the summer of 2021. “The next edition of the HWY will take place in the second half of 2020, at the same location as the first biennial, and will surely be the most ambitious,” said Alexandra Schipper, the director of the HWY.In an interview with the Art Newspaper, Jordan said that he was “deeply inspired by the architecture of the new campus,” referring to the renovation of the former site of the HWY. “My work will be in part a response to what I see as a phenomenon that is becoming more and more prevalent on the West Coast: a growing gap between art and the real world, between art and the artist, between art and the audience, and between art and the institution. I’ve long believed that the building of the HWY was the right thing for the area, for the city, and for the state of California.”He added: “This project not only marks an exciting and unique chapter in my career, but will provide a unique proving ground for a collection of works that has been sitting in a storage facility in the city for thirty years.”Jordan will be honored at a special ceremony at the", "The next Biennial should be held at the House of Nordhaus in Berlin in 2022, and the first Biennials at the Museum of Modern Art in New York, New York, in 2021.\n\n\nThe Museum of Modern Art (MoMA) in New York has postponed its next big event, its 2020 edition, due to concerns over the coronavirus. The retrospective, titled “Rebel,” and titled after a phrase that is an anachronism in the classical style, was supposed to kick off its new venue, the 53,000-square-foot Museum of Modern Art. However, the show will now be held at the Museum of Modern Art in the fall of 2020.The decision has led some cultural figures in the city, including Rudy Giuliani, to call for the exhibition to be canceled, and the Art Newspaper reports that MoMA is considering canceling the event altogether. According to the New York Times, MoMA has received a total of $120 million from MoMA’s redevelopment plan, and the event’s organizers are confident that the show will go on as planned.The biennial, titled “Rebel,” will feature work by forty-four artists, including Sean Yamanashi", "The next Biennial should take place in 2021 and will be hosted by the Museums and Galleries of Liverpool (Museum of Liverpool) and the Museum of Art (MoMA), New York. The 2018 edition, titled Imagination, was held at the Museums and Galleries of Liverpool (Museum of Art) and the Barbican Art Gallery, London.\n\n\nThe Museum of Fine Arts (MFA) in New York announced today that it has received a gift of eight works by the late British artist and activist Ellsworth Kelly, including his most recent, Rover, a sculpture dedicated to the struggle of the disabled. The installation, which was created at the museum in 2011, depicts a group of four people—Kelly, artist and activist Kevin Beasley, and activist Tanya Bonakdar—living together in a Lincolnshire cottage.Beasley, Kelly’s widow, told the Los Angeles Times that the work, which was created in 2007 and 2009, was inspired by the late activist Clement Attlee, who used his platform to advance the campaign for the rights of disabled people. The artist said that Kelly’s voice was instrumental in helping him realize his vision for the sculpture.“Visually, it", "The next Biennial should be held in the first quarter of 2020 and will be inaugurated by a public performance by the K9 and the Crystal Bridges, the same artist-led group behind the critically-acclaimed inaugural event. The organizers plan to host the exhibition at the Guggenheim in Zurich from January 23 to April 3, 2020.\n\n\nThe Museum of Islamic Art (MoMA) in New York has decided to move several of its significant works of Islamic art from its permanent collection to the private collection of the museum. A statement issued by the institution reads: “The Hirshhorn Museum has established a broad and robust history of showcasing the work of Muslim artists through the institution’s collection. The Hirshhorn has produced major contributions to the field of Islamic art through the collections of M.L. King and M.I.A., and today marks the museum’s 150th anniversary. This new initiative addresses the power of art and the connection between the museum and the community, and will contribute to the Hirshhorn’s continuing mission to enhance the visual and cultural experience of New York City.”The museum has been working with the Ramada Center since January 20, 2020, to consolidate its holdings of works", "The next Biennial should begin with a public lecture on the fiveteenth-century prison at Vatsala, and on current social and political concerns, including the spread of HIV/AIDS and climate change. In an effort to adapt to the changing climate, the pavilion will increase its use of renewable energy sources. About twenty-seven thousand people are currently imprisoned in India, according to the United Nations.\n\n\nThe Fine Arts Museums (FAMs) of New York and Los Angeles are participating in a #SaveOurMuseums campaign to pressure the city to save more than sixty historic buildings from the wrecking ball. The institutions are calling for the immediate reduction of the construction and renovation work in city-owned properties, and a moratorium on new construction and renovation projects.In a letter sent to the mayor on Wednesday, January 6, the organizations wrote: “We recognize the urgency of saving crucial cultural assets in our neighborhoods, especially in the most vulnerable areas where the legacy of the building contributes to creating a toxic legacy of poverty, unemployment, homelessness, and evictions. We question the wisdom of the city’s plan to demolish buildings and to build new in an effort to make up for lost ground lost through the construction of the Cultural District.", "The next Biennial should focus on the fuction house’s past and present, highlighting the many projects and exhibitions the museum has presented. The exhibition will also include a new museum-specific curriculum that integrates contemporary and historical art. Additionally, the biennial will embrace a new format that will include mounting, presentation, and archiving. The 2017 Biennial was curated by Wendy Moseley and organized by Sotheby’s.\n\n\nThe Fine Arts Museums Association (FAAM) has announced its goal of increasing the representation of women artists in the United Kingdom. The new initiative, which is supported by a £10 million donation from the Joseph and Ida MacMillan Foundation, will give £1 million per year to [1] and [2] , two nonprofit organizations that amplify the experiences of women artists by providing them with support and resources.“The foundation has long supported feminist and anti-racist efforts, and we are delighted to support [them] in their goal to present the most diverse exhibition possible,” Adele Collins, FAAM’s executive director, said in a statement. “This is a matter of life and death for the many thousands of women artists who have died", "The next Biennial should take place in 2020.\n\n\nThe Institute of Contemporary Art (ICA) in New York has appointed Emily M. Greer as its next president. She succeeds John F. Kennedy, who retired in May 2019 after a decade in the role. During her term, Greer helped the ICA to become an independent organization that works with artists to further develop their practice and has organized more than seventy-five exhibitions. She also organized the first-ever Biennial of Painting and Sculpture, which drew more than 2,500 participants in 2018, and the ICA/Syracuse Biennial, which was organized in 2018 and ran from 2019 until 2019.“I am thrilled to begin this new chapter with the ICA by expanding the ICA’s reach and by building on the ICA’s reputation as a leader in the field of contemporary art through new platforms and programs,” Greer said. “I am particularly proud to continue the work of my predecessors, by supporting and elevating their work and expanding the ICA’s collection through new and innovative collections. The ICA is a unique international platform that empowers artists and provides a forum for their work. I am confident that", "The next Biennial should take place in 2021, with the exhibition of the work of an international group of artists. The twenty-one-hundred-th anniversary theme of the event should be the artist-made work, as in the case of Baldessari. The Latifah Gallery in London will unveil its 40,000-work collection at the end of the year, and the artist-run space Biennialen will open to the public on July 7.In its first exhibition dedicated to the artist-run space, Sara C. Anderson and Cara Owens’s “The Bay” will open at the TNAF gallery in Los Angeles on March 23. The show will feature more than 80 works by ninety-four artists, from the artist-run space “The Box” in New York to the artist-run space in Baghdad. Each exhibition will run for two weeks.Art historian and curator Joe Durnon has been named director of the Art Institute of Chicago. He will take up the post in January 2020. Durnon is the founder and curator of the photography and video blog Hot Rod, which has published multiple books, including Joe Durnon: Photography and the Body” (2006)", "The next Biennial should focus on replicating the ecological and social conditions of the first exhibition, and should be organized as a platform for a discussion of the future of art. In the past twenty years, the inaugural Biennial has staged more than 120 exhibitions, including the biennial “Art From the First Five Centuries” (2015); “The Encyclopaedia of Life” (2015); “The Prehistory of Art” (2017); and “Sensations from the Past: From Early Art to Modern Art” (2017).The 2018 event will be staged at the Institut Métropole (in Paris), the Museum of Modern Art (in New York), and the Museum of Contemporary Art (New York), and will air live on HBO and HBO GO.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has named Hannah Brown-Dixon as the next director of the Museum of Modern Art (MoMA). Brown-Dixon comes to the institution from the Metropolitan Museum of Art, where she has served as deputy director since 2017. She succeeds Thomas J. Collins, who served as director of the Museum of Modern Art from 2019 to 2021.", "The next Biennial should take place in 2022 and will introduce a new collection of works by artists from across the globe. The Biennial will also host a selection of short films made by an artist-led group of female artists. The exhibition will be organized as follows: 1. Biennial (The Work of) Mmamawong, Mabini, and Pei Luang, 1910–1914 2. Biennial (The Work of) Abigail and Christo, 1914–1922 3. Biennial (The Work) Wolfgang and Mary, 1913–1921 4. Biennial (The Work) V, 1913–1923 5. Biennial (The Work) Maud Hirsch, 1913–1921 6. Biennial (The Work) Kiwi & Tatu, 1921‐2019\n\n\nArt and the Environment International (AEI) has welcomed Linda Kelly-Yamada, the first African American female curator to helm the New York City Department for Cultural Affairs, to the executive board. She will oversee the development of the city’s cultural and heritage advisory council and be responsible for steering the", "The next Biennial should take place in the city in 2020.\n\n\nThe Lebanese Museum in Beirut has appointed Ahdaf Soueif as its next director. Soueif comes to the institution from the Museum of Fine Arts (Ma'arashbili) in the Old City, where he has served as the deputy director since 2015. Soueif succeeds Naser Al-Hashemi, who served as director of the Jerusalem Art Museum until 2013, and will be responsible for the care and development of the institution’s collection. “Ahdaf Soueif is an experienced director who has successfully led both an institution and a museum for more than ten years, consolidating and expanding its collection and exhibiting works in the most important contemporary museums in the city,” said Mali-American director Rachid Ben Saar. “With his appointment, Ahmad Shafik will be given the opportunity to work with Ahdaf Soueif at a time when he is most appropriate for the role of director. This is a tremendous opportunity for both the director and the museum.”Since its founding by revolutionary Ottoman ruler Sultan Omar Saif in 1928, the Lebanese Museum has grown to become one", "The next Biennial should take place in the fall of 2022. Ted Deutch, president and CEO of the Deutch Foundation, said: “The next iteration of the Cleveland Museum of Art will be a stunning display of world art, created in the visionary spirit of Cleveland’s rich history and built in such a way that it can inspire and delight generations to come.”\n\n\nThe Leslie-Lohman Museum of Art in New York and the Brooklyn Museum in New York have been named the winners of the $65,000 Gordon-Levitt Foundation Award. The Beehive Center for the Arts, which is affiliated with the Gordon-Levitt Foundation, was awarded $25,000 for its production of “The Last of His Name,” a new series of performance-based works, and the Metropolitan Museum of Art in New York was awarded $10,000 for its installation of “Theater of Operations: Stories of the Iraqi Guards,” a new collection of photographs by photographers such as Morro Shor and Edward Hopper, both of whom are veterans of the Iraq War.The Gordon-Levitt Foundation also announced that it will be awarding a $15,000 Gordon-Levitt Foundation Artistic Award to", "The next Biennial should take place at the National Museum of Art in London in 2021. The 2019 event, titled “The New Science of Art,” presented a selection of contemporary works by fifty-three international artists. The theme was “Spirituality and Science:” and the biennial was organized by the National Curator’s Guild and the National Art Gallery in London. Benjamin B. Friedman, the director of the National Museum of Art, said: “We are thrilled to be this year’s biennial with many new artists because of their excellent algorithmic work and the powerful content it will expose the next generation of artists.”\n\n\nThe Metropolitan Museum of Art in partnership with the Modern Art Research Institute (MARM) in New York has appointed Jennifer L. Thompson as the new executive director. She succeeds Matthew Higgs, who departed the institution in the summer of 2020 to head the British Museum, and will begin her tenure in January 2021. Thompson will assume her responsibilities on January 15, 2021. “Nicole Lieberman, who has served as the MARM’s deputy director since 2015, has been nominated to be the new director of the Met,” says Thompson", "The next Biennial should feature the first group of artists to be exiled from UK museums since the Second World War, a group of 30 artists who were removed from Tate Britain in 2006. Other works that are currently on display in the exhibition will include artworks by Jay-Z, Morris Louis, and Vito Acconci, as well as monographs by the late British painter William Eggleston. The British Museum has yet to announce the dates for the exhibition.\n\n\nThe New York–based nonprofit the Museum of Modern Art (MoMA) has received a donation of more than two hundred works by Maurice Breuil, whose practice encompasses painting, sculpture, photography, performance, and installation, as well as collage, photography, and video, from the artist’s estate. The sum of the loans exceeds the $2,500 offered by the estate to MoMA in 2016, and marks a major milestone for the artist and his legacy.The gift includes works by Breuil, Ellsworth Kelly, Frank Stella, and John David Salas; texts by Breuil and John Locke; and numerous photographs, drawings, recordings, and videos that were made with the artist’s help and are currently housed at the artist’s Los", "The next Biennial should take place in 26 years, the institution said. The announcement comes amid new biennial plans to be held in 2021 as a result of the death of the current founder, Joachim Neugroschel. The new biennial’s development committee will consist of Susan Koster, director of the Museums of Prague; Peter Hutt, director of the Biennial Research Center; and illustrator Jürgen Moltke.The new theme for the 2019 edition, “The Future Is Present,” was inspired by the theme of the first exhibition, “The Future Is Present: International,” which opened in Stockholm in October 1998. The theme of the second show, “Europe in Transition: the Next Millennium,” was taken from the opening of an exhibition at the Jewish Museum in New York in November 2007. The other pieces that will be presented this year are “The Present,” “The Future and the Art of the Present: Contemporary Art in Spain” (2019), and “The Past and the Future: Modern Art in Italy” (2019). The final exhibition, “Art of the Past: Hegel and Philosophy” will open in May.\n\n\n", "The next Biennial should be held sometime in the 2020s. “The current exhibition is a continuation of the work in the Banu Cennetoğlu; the work on display here is based on the paintings of Nizar Banyar and Rabih Guvenar and on the sculptures of Julien Boisjoly, and is inspired by the exhibition ‘Ørônia’ (2012), and the exhibition ‘Hindenburg’s Theaters. The Exhibition and the Biennial are a continuation of the work of the many artists who participated in the 2013 and 2014–15 editions of the exhibition, and the exhibition’s art is a reflection of the growing interest in contemporary art in Austria. We are particularly proud of the work by the artist Svetlana Moskalova, whose work is included in this year’s exhibition.”\n\n\nThe Metropolitan Museum of Art (MoA) in New York has completed a major renovation that will enhance its public spaces and expand its collections. The $3.9 billion overhaul—which included the construction of the museum’s new facilities for contemporary art, a new entrance, a new lobby, a new location for the museum\u0097and", "The next Biennial should take place in Tokyo in 2022. The Japanese art world is rushing to adopt digital technologies to adapt to the pandemic. On Thursday, the government announced it will launch a crowdfunding campaign to help fund the relocation of art and architectural works, and to create a digital library of works. The initiative is part of Japan’s plan to send out more than 150 million promotional cards, and of the country’s ambitious Tochigi no Sengo (Let there be light) campaign. Biennials are also being staged in New York, Los Angeles, and Paris.\n\n\nThe National Endowment for the Arts (NEA) in partnership with the Department of Cultural Affairs (DCLA) announced today that it granted $7.3 million to Photojournal, a nonprofit photography art conservation organization based in Los Angeles, California. Founded in 2007 by photographer John Caruso and his wife, the late Gertrude Caruso, Photojournal’s goal is to preserve as much of the artist’s legacy as possible. The organization has adopted strategies to deliver on this mission such as providing free digital access to the artist’s works through its online viewing rooms and collaborating with the", "The next Biennial should be held in late November. The twentieth, slated for December, has yet to be announced. The Japanese artist Ai Weiwei, who is credited with popularizing the term contemporary art, has announced that he will step down from the helm of the institution. According to the Art Newspaper, Ai is planning on organizing a retrospective of a work by the artist for the twenty-first biennial, which will be held in September, and will begin the process of finding a successor. Iwona Gwang, the chair of the Biennial Commission, said: 'We are currently in the process of evaluating the proposals of the current generation of curators and are in the process of developing the biennial program for the 2019–20 cycle. Thanks to her outstanding leadership, I feel that she has already taken the necessary measures to protect the future of the Biennial . . . and will continue to do so. I am confident that she will continue her outstanding leadership in facilitating the development of the Biennial and its artistic legacy.”\n\n\nThe Minneapolis Museum of Art (MMO) has launched a new digital platform that will allow visitors to view and purchase works by artists and other visual arts professionals. It is called the Artist Network,", "The next Biennial should be held in 2021.\n\nA group representing artists and researchers from the United States, Europe, and Asia has asked the Smithsonian to postpone the fifty-eighth edition of its National Museum of American Art (NMFA) in Washington, DC, from 2021 to 2022. The move is expected to save the institution $10 million in operating expenses.“The institution is facing several challenges right now, including declining attendance and declining revenue, both of which are difficult to manage and mitigate,” said Daniel H. Weiss, president and CEO of the Smithsonian. “While we have been able to avoid large-scale layoffs and downsizing, we have no certainty that such measures will be enough to prevent a precipitous drop in attendance and revenue in 2021.”The petition, which was spearheaded by the group the Artists' Foundation, asked the museum to commit to reopening and raise funds for the biennial in late summer/early fall, and states that the postponement is not only necessary, but vital. The petition states: “We believe that the best way to support American art is with a robust, strong, and creative Arts and Art History in the fall, and that this fall will be the best for American", "The next Biennial should be held in 2022.\n\n\nThe Italian government approved a $5 billion aid package for Italy’s independent museums on Tuesday, marking a major step forward in restoring cultural life in the country, which has been struggling to recover from the impact of the coronavirus. The legislation—which also contains $4 billion in loans and grants for small and mid-size Italian institutions and $2.5 billion for independent artists—is aimed at helping the cultural sector as Italy struggles to contain the outbreak of the new virus.The bill—which is part of Italy’s Compact for Italy’s Future, which was approved by both houses of parliament in December and is slated to be signed into law by President Gino President Beppe Grillo on Wednesday—is part of a $8 billion package that also includes federal aid for small and mid-size Italian arts institutions—the Cattolica di Salento in Turin, the Pirelli Gallery in Florence, and the Basilica di Santa Maria della Scala in Milan—and a series of grants totaling $2.2 billion.The art-world coalition, which represents more than 400 museums, including the Adriatic Arts Museum in Venice, the Conte di Bel", "The next Biennial should be a continuous exercise in radical experimentation and humanism, unfolding in multiple architectures simultaneously. The biennial will examine the relationship between art and the human condition through an interdisciplinary approach that is contemporary, contemporary, contemporary, contemporary.” When the 2015 edition of the biennial kicked off, I, along with many other journalists, was invited to attend. The event opened with an exhibition of work by the artist Yoshitomo Takeda, whose experimental personal and public art forms are often characterized by their “theoretical ambiguity.” The exhibition featured works by hundreds of artists from thirty-six countries. The following year, an exhibition of the artist’s photographs was presented at the prestigious Japanese fine arts museum Tate and the gallery opened a branch in Paris.Last year’s exhibition “The magic of photography” was presented at the American Folk Art Museum in New York and featured work by American photographer James A. Michener, whose photographs often employ surrealistic and anthropological devices. “Photography has a long and rich history within modernism,” said George Eichenga, curator of the exhibition. “Through the use of portraiture and", "The next Biennial should take place in 2022.The initiative, launched in 2016 to raise $1 million for the artist-run nonprofit, was originally conceived as an exercise in solidarity with the community. However, its outcome has led several artists, including Rainer Baer, David Gray, and Frank Gehry, to withdraw funding from the exhibition, which is currently on view until November 19. Those artists have since claimed that the exhibition is trying to divert their attention from building an autonomous space for contemporary art, and have called for the cancellation of the exhibition.Staffers for the exhibition—which will feature works by fifty-seven artists—are refusing to address the controversy, and have claimed that the controversy is overblown. “There will be no cancellations,” Günther Büttner, the director of the Kunsthalle Basel in Switzerland, said in an interview with Artforum. “The event is being staged by an innovative team of curators from a variety of disciplines, and all of whom believe that there should be more autonomy for artists.”He continued: “I think we have to be very careful about what we do. We can always have more control over the exhibitions. But I think one of", "The next Biennial should start in January 2021, according to a statement issued by the institution. The twenty-third edition of the symposium, titled Art and Culture in the Age of Modernity, will be held in November 2021.\n\n\nThe New Zealand art world will descend on Paris for the eighth edition of the fair, titled “The Future Is Now,” this weekend. According to Artnet, the exhibition will feature new works by twenty-nine artists, including Alison Knowles, Marc-Olivier Brunel, and Benoît Aïtienne-Saussy, as well as works by local and international artists that have only recently made their way to New Zealand. The show will run from September 2 to September 6, and will be held at the Pérez de la Place in Paris. “The Future Is Now” will also introduce the New Zealand Biennial, which will be held at the Nelson’s Castle, Wellington, next month. The event will be hosted from October 29 to October 31, and will include additional programming that will take place across the globe.“With a vision for a new kind of art museum, The Future Is Now will highlight the", "The next Biennial should be held in 2021. This year’s edition will take place in Hong Kong—the region where the exhibition will be shot, conceived, and curated. The next edition will draw from the collections of the following:Beijing Gallery Shanghai (summit of China and Hong Kong)Art Museum of Fine Art, Beijing (summit of China and Hong Kong)Arts Japan Museum, Tokyo (summit of Japan and Hong Kong)Art Museum Kita, Tokyo (summit of Japan and Hong Kong)Art Museum Lille (summit of France and Belgium)Art Museum Berlin (summit of Germany)Art Museum Stuttgart (summit of Germany)Art Museum Freiburg (summit of Germany)Art Marciano Gallery, Rome (summit of Germany)Art Marmara, Venice (summit of Italy)Art Mechelen, Brussels (summit of Belgium)Art Palazzo Firenze (Italy)Art Paseo, Venice (summit of Italy)Artres de Meio, Italy (summit of Italy)Arturus Gallery, New York (summit of Italy)Arturus, New York (summit of Italy)Berlin Gallery, Germany (summit of", "The next Biennial should be held in the second half of the year.  The next Editor-in-Chief should be chosen from among the list of thirteen finalists.\n\n\nThe Brooklyn-based nonprofit Artadia, which provides support to artists working in New York City’s arts and cultural sector, has appointed Olivia Browne, the executive director of the New Art Dealers Alliance (NADA), as its next executive director. Browne will be tasked with building on Artadia’s founding mission of supporting artists through a program that was launched by Bill Clinton in 2000 and has since expanded to include a variety of other outreach and education initiatives.“Olivia’s leadership and vision to support artists and their families and communities are central to the organization’s mission,” said Roberta Katz, the organization’s executive director. “As we work to build on the foundation of our organization, her leadership and vision will ensure that Artadia’s legacy is strengthened as we work to make New York City a global hub for culture. Her leadership and vision will also ensure that we continue to attract and support the very best artists and that they have a voice in shaping our city’s future", "The next Biennial should take place in 2020, the same year as the biennial of art in New York. In a statement, the organizers of the event said: “We are thrilled by the recent invitation to engage in dialogue with the Weston Foundation, and we look forward to engaging with the wider community of artists and institutions in the United States and around the world.”\n\n\nJohn Kasich, the Republican governor of Ohio, announced today that he intends to challenge U.S. President Donald Trump in 2020 and has named John Edmonds as his campaign manager. Edmonds previously served as director of the Ohio Art Museum in Columbus and as a board member of the Cleveland Museum of Art (CinCB), where he worked as a campaign surrogate for Kasich from 2015 to 2016.“John has been instrumental in helping shape Governor Kasich’s vision for our state and country,” said Kasich. “In a time when the future of our democracy is at stake, he has seen the difference it makes in representing our values in collaboration with our neighbors and our state. I want to thank him for helping our campaign to defeat Tom Barrett, and I thank him for guiding us through the tough decisions in the general election.”In the November election", "The next Biennial should be held in 2022.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has received a gift of twenty-six works from the DeLand, Florida, and New York, New York–based artist Jana Schutz, who died in 2006, and her daughter, Lori Schutz. The works, which are currently on display in the museum’s exhibition “Pavilion,” are from her “A Song for Los Angeles” series, which was released by the artist in 1976, and are currently on display in “Pavilion: The New American South,” a group show that will examine the legacy of artists such as Robert Irwin, Minimalism, and Otis Redding.“This gift marks a turning point for the Museum of Contemporary Art in Los Angeles and, more importantly, for the world of contemporary art,” said Stuart Rosenberg, director of the museum. The gift was made in recognition of the conservation efforts of the Schutzs and the museum’s longtime curators, Jill and Bill Schutz, who have worked tirelessly to preserve these works.The works, which were donated through a foundation established by Jill Schutz and her husband", "The next Biennial should now take place in 2020.\n\n\nThe Museum of Fine Arts, Houston (MFA) announced today that it will not suspend its 2019-20 season through March 21, 2020, pending the outcome of an investigation into whether the institution mishandled an allegation against Penny Balkis that arose from a 2016 controversy over the historicity of the Pre-Columbian American territorial boundary in the city of Chihuahua. MFA director Elizabeth A. Ewing and interim chair Jodi Throckmorton announced the decision on Monday, March 5.“This is a challenging and complex time for all of us, and we are acutely aware of the impact that the investigation and suspension of a season can have on an institution’s ability to raise funds for our upcoming season,” said Ewing in a statement. “While we acknowledge that this is an unprecedented and unprecedented year for cultural institutions across the country, we believe that this new process for investigating allegations of misconduct and ensuring accountability will be a valuable resource for institutions facing these challenging times.”The school’s previous suspension of a season was in August 2019, three months after the school re-opened after months of construction following a $200 million expansion. The", "The next Biennial should be held in the spring of 2021. \n The Center for Art and Life, a new institution founded by Charles and Mary B. King in the Solomon R. Guggenheim Museum, is currently undergoing an expansion. The $350 million endeavor, which will include a new exhibition format, a larger collection, and new facilities, is slated to launch in the fall of 2022.King and their son, Charles B. King III, were awarded the $1.5 million MacArthur Foundation Grant in January. The king and their wife, Mary, are currently seeking $2.5 million for the expansion, which will result in a new building and additional rooms. The renovation, which is slated to be completed in 2021, will also include the building of additional exhibition spaces and a new library.“I was deeply inspired by the work of Henry Uradis, Peter Simon, and Jeffrey Gibson. I am especially proud to be a part of their legacy and to exhibit their work in the Museum of Modern Art, which was created in their honor,” said Anne-Marie Jackson, curator of American art at the Museum of Modern Art and a founding board member of the American Foundation for the Arts (AFA). “The King", "The next Biennial should be a re-creation of the reopening of Mumbai’s Taj Mahal in 2017, as an open-ended project. While it is far from certain that the Taj will reopen, it is certain that the city will be re-imagined to suit people’s needs. “We are not here to create a new city and to create a new Taj,” said Sarkis. “It is our mission to re-create Mumbai in the image of the city that is. What we have done is create an emotional connection with our city, and that is what we want to see again.”The project is organized as a novel arrangement of two urban themes, that of the Taj and that of the Taj Mahal. Both the Taj and the Taj Mahal are located in the city of Kannur, in the north-western part of the state of Maharashtra. The Taj was completed in 1930 and the Taj Mahal in 1989, respectively. The Taj was recognized as the National Centre for Taj Mahal Art in 1992. The Taj was also awarded the Kapil Sutra award in 1993, and in 1997, the Akbar Sutra award, and the Kapil Chandra Award in 1999.", "The next Biennial should have explored the idea of the farmhouse as a site of domesticity and spirituality. It should have given the artists a chance to create a unique work, to have the full range of their aesthetic vision in the context of a climate-controlled space. I hope the next Biennial will show that the biennial can be a way of life for all of us, and that it will continue to be! The biennial is now open to the public.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, and the San Antonio Museum of Art (SAMo) announced today that they have received a gift of more than 2,500 works from the artist Daniel Barenblatt. The work, which was gifted to the institution by the Daniel Barenblatt Foundation and to which MoCA has designated as a significant collection piece, will be transferred to the two institutions in the coming weeks.“The gift is a great success in the journey to create more than two hundred works in the future,” said director John Lassiter. “Daniel Barenblatt was an extraordinary artist and a beloved teacher. He was the perfect match for our curatorial and artistic teams. I have been following his work", "The next Biennial should be on the ground in the city next month. The presentation of the first exhibition “The Killing Fields” will take place in the city in October.The upcoming exhibition “Roots of the Revolution: The Struggle for Arab and Islamic Revival” will also feature works by artists living and working in the region, including a selection of work by the Lebanese artist Walid Raad, who was imprisoned by Israel for seven years for organizing a demonstration in support of the Palestinian cause in 2009. The exhibition will launch in May 2020.\n\n\nKamal Hassan Al-Khan, a Sudanese artist, has won the annual $10,000 Glimcher Prize at the Venice Biennale. The prize is one of the largest awards in the festival’s history and was established in honor of Khalid Sheikh, a Sudanese artist who was executed by the Saudi Arabian government in 2012 for his work The Nativity, 1963, a large-scale reconstruction of the Nativity in the town of Qasr al-Salem.Born in Darfur in 1967, Khalid moved to the United States with his family when he was six years old. He attended New York University, where he studied with George Pataki, a former", "The next Biennial should take place in Tokyo in 2022. Another exhibition, Fabrica: The European Experience (2023), will be held in 2020.The third, Feminismo: A Feminist International (2019), will be held in 2020. The fourth Biennial will be held in 2022. The fifth will be held in 2023. The sixty-fourth will be held in 2022. The seventy-third will be held in 2022.The seventy-ninth will be held in 2022. The seventeenth Biennial will be held in 2021. The seventeenth will be held in 2021. The seventeenth will be the first to have three women directors. The seventy-ninth will be the first to have a female director of the prestigious contemporary art institution the Museum Basel. The seventy-ninth will be the first to have a female director of the prestigious contemporary art institution the Museum Basel. The seventy-ninth will be the first to have a female director of the prestigious contemporary art institution the Museum Basel. The eighty-eighth Biennial will be the inaugural event to run concurrently with the twenty-ninth. Koshien said Biennial organizers are still finalizing", "The next Biennial should be held in 2020.The festival’s board of directors, which comprises twenty-three artists, including Van Gogh, Hermann Hesse, Jørgen Moltke, and Hans Neukom, said: “We are delighted to receive this grant from the Danish Ministry of Culture in support of our desire to show new and innovative cultural exchanges in the Danish capital. The Biennials have been very successful in that they have shown how genuinely Danish the right person can be. What is needed now is a real change of attitude and a real commitment to show that the Danish culture and art are as vibrant and important in the future as in the past.”The Danish National Foundation for Contemporary Art (Denmarkpædelsen) also helped raise funds last year for the 2020 event, which was staged in conjunction with the Copenhagen Art Festival. The foundation received $220,000 from the Danish government and $250,000 from artist and filmmaker Per Ekman, who was one of the organizers of the 2019 event, and will divide the proceeds. A committee chaired by artist Per Røson appointed by the Danish government and chaired by Ekman will select the seventy-two artists who will represent Denmark", "The next Biennial should begin in 2020 and run through 2024. Its theme, “Theatre of the Oppressed: Contemporary Art in the Twenty-first Century,” will include works from the biennial’s inaugural edition.\n\n\nThe National Gallery of Canada announced today that it has received a gift of eleven new works by the Danish artist Bangsør Ød, who is best known for his work in oil painting. It is the first time the institution has acquired his work in more than four decades. The gift includes works by artists such as Jesper Stensgaard, Ola Ståhl, and Johan Neugroschel, and is part of a larger collaboration between the gallery and the Danish government.“We are incredibly grateful for Bangsør’s generous initiative in supporting our work in the first place, and for his impressive selection of new works in the months leading up to the exhibition,” said museum director Michael Scott. “The work of these artists, among others, has opened up a new and important way of looking at oils—and that is a real source of inspiration for us all.”The Danish government has funded the gallery over the years. In 2017, the Danish", "The next Biennial should be held in 2021. Bienvenu said: We have been working for many years to obtain a new venue and to build a remarkable exhibition. In the last decade, we have created and launched new venues and have worked with many talented and dedicated artists and arts professionals. Our students have been recognized as one of the best in the world, and we are continuously working towards developing new programs. This is the time of great transformations, but the future of art is always at stake. Given the current circumstances, it is essential to continue the work of creating a platform for the work of the next generation of French art.”\n\n\nThe Centro de Artes Plásticas (CAB) in Mexico City has welcomed artist and educator Diego Berchamp to the collection. Berchamp, whose work examines the power structures of Mexican society and the ways in which artists have attempted to address them, will present his first solo exhibition at the institution in July 2020. “The first part of the show will be a public exploration of the themes and texts of the works and the exhibition will then begin to develop into a dialogue with the artist, his relation with the gallery, and a discussion of the contemporary world,”", "The next Biennial should be held in 2021 and will take place in the period from April to August. The exhibition will also include new works by contemporary artists such as David Hoberman, Tanya Clement, and Jasper Johns, and will feature the work of internationally-recognized contemporary artists such as Virginia Johnson, Patricia Field, and Angela Pérez.\n\n\nThe United Kingdom’s House of Commons Science, Technology, and Innovation (HPCI) has issued a public call for proposals for the 2020 edition of the Royal Institution of Arts (RIA), London. The call for works in the exhibition “Speech and Language: From Symbols to Meaning,” will run from February 28 to March 3. The examination of contemporary artists’ practice through the lens of new technologies such as the Internet, the Digital Humanities, and the digital arts, as well as the history of art, will take place across seven venues: the Institution, the Laboratory, the Museum, the Science Museum, the Royal Academy of Arts, and the South London Gallery.The 2020 RIA exhibition will include more than one hundred new works by forty-four talented contemporary artists who have participated in the Royal Academy of Arts’s special exhibition “Spe", "The next Biennial should take place in the month of June and will include work by fourteen artists who have been selected from an open call list. The eighteen finalists will be chosen by a jury comprising Artistic Director Zoya Mohebbi, artistic director of Artspace, and artists Tanya Osmond, Issa Anwar, and Assata Kasandra.The second exhibition, “Anwar Hussain: The Architecture of Revolution,” will be held at the Village of Marramish Bay in Saudi Arabia from June 24 to June 26. The show, which will take place in the central Arabian city of Mada’in Makkah, will feature work by twenty-two Saudi artists.The third exhibition, “Tanya Osmond: Heavenly,” will be staged at the Museum of Modern Art in New York from June 23 to June 27. The show will feature twenty-three works by twenty-six Saudi artists. The exhibition is part of a global campaign to support artists who are being persecuted for their political beliefs. In the United Kingdom, a series of shows—including the British Festival of the Artist and the Royal Shakespeare Company’s King Lear—is also scheduled for June 28–June 29", "The next Biennial should be held at the Akademie für Kunst, in Zurich, in December 2020.  The first show, “Ijaz Khan: Avant Garde” (2019–10), was held at the Galerie Villebon in Paris; the second, “After Life: Art in Cinema” (2018–19), was held at the Casa del Mundo in Madrid; and the third, “Oscar Wilde” (2019–20), was staged in the Museo Luis Buñuel. The 2019–20 edition of the inaugural edition, titled “Wir sind durch den Film-Neue,” will feature the first Flemish retrospective of the film maker Virg Feigen’s The Big Sleep, 2019\u0097in conjunction with the German artist Thomas Hegde’s first exhibition at the museum.\n\n\nIn the wake of a mass shooting at an outdoor Ariana Grande concert in Manchester on Monday, May 22, the British government announced that it is reopening the country’s immigration care system by March 16. If the reopening of the borders checks and the reopening of the borders has not been accelerated,", "The next Biennial should be held in the autumn, with the exhibition opening only in the spring. The next show should be in the autumn of 2019. The next exhibition should be in the autumn of 2020.The institution’s board of directors declared that the decision to postpone the show was made after it was briefed by the Van Gogh Museum and the Henry Art Gallery in London, which has an outpost in the city, and by representatives of the local communities in the region. It added that the decision was made after consultations with local community groups, the Van Gogh Museum, and the local government in the city of Ghent.The museum believes it has a good case for delaying the event by as much as three months. The museum expects the show to open in late September or early October 2020 and that the construction of the new museum will begin shortly thereafter.\n\n\nRecognizing the challenges posed by the coronavirus at an international level, the International Committee of Museums (ICOM) has asked the United Kingdom to delay the reopening of its national galleries by six months. The delay was prompted by concerns about the spread of Covid-19, which was first identified in the London area on December 6. The coronavirus was first identified in", "The next Biennial should be held in 2021 at the Nairobi Museum of Art. Andrea Dalloch, the Italian artist who first exhibited at the Venice Biennale in 1966, will be included in the next iteration of the show.\n\n\nNew York’s Metropolitan Museum of Art (MoMA) has appointed Jodi Throckmorton as its next director and CEO. Throckmorton will assume her responsibilities on August 15. Throckmorton will be responsible for managing the museum’s collection, education, and advocacy. She will also assume her responsibilities in the office of managing director, which is in the same building as the museum, and will assume her responsibilities in the coming months.“Jodi’s leadership at MoMA’s is truly remarkable, both in her experience and her vision for the future of the museum,” said David Feldman, chair of the board of trustee of the Metropolitan Museum of Art. “Through her leadership, the Met is preparing to enter an exciting new chapter as we move into the next phase of our strategic evolution, defining MoMA’s role as a global leader in art and design.”Since 2008, Throckmorton was the director of", "The next Biennial should be confirmed by the August 27-28 event. Recalling the biennial, which was inspired by the work of feminist artist Shepard Fairey, the festival will organize the works of artists and artmakers whose work has been previously exhibited at the Paris Biennial d'Art and the Amsterdam Biennial, in addition to the fifty selected by the Lima-based contemporary art center Lima Lille.Previously organized in 2009, the biennial was presented at the Lima Contemporary Arts Center from 2008 to 2009, as well as the Lima Museum of Art (MMCA) in 2009, and will be staged again at the Lima Architecture Museum in 2020. The 2020 event will be the biennial’s twelfth edition, and will be held at the Lima Maravilta Theatre Festival (MLF).\n\n\nThe Solomon R. Guggenheim Museum and the University of Toronto have been awarded $5 billion in federal stimulus funds, bringing the total amount allocated for arts institutions in the country to $10 billion. The funds were initially established to 'mitigate the threat that an economic downturn or an extended economic contraction would pose to the solvency of the Guggenheim and its ability to attract and retain audiences.” The announcement came", "The next Biennial should be held in 2022. The 2020 event, “Between Deserts,” was curated by Brooklyn-based artist and curator Zina Hauser and drew thousands of visitors to the Grand Canyon.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has launched a new digital platform that will allow visitors to access and analyze over six million works. Called the Museum of Contemporary Art Connects, the platform will allow visitors to look up specific works by artists and museums within the city, collected by curators within the museum, and to create personalized experiences based on their works and the works of others.“Connects will feature works by artists such as Alice Aycock, Laura Aguilar, Hannah Beaudin, Loretta Edwards, Holly Fay, Hannah Newcomb, Juliette Roniz, João Villalba, and Bertrand Goldberg,” said museum director Rob Wells. “We are excited to offer more contemporary art experiences that engage with the museum’s collection, present a shared interest in art and offer moments of inspiration.”The platform will also have a digital version of the original exhibition, titled “Between Desert", "The next Biennial should be in May 2020. \n Update: The next Biennial will be in December 2020. \n\n\nNew York–based artist and educator Yinka Shonibare has inspired a new generation of scholars to rethink the relationship between art and science. The American painter and thinker shallower afield the aesthetic field became the focus of his practice after the Chinese Revolution. Shonibare often drew from his own practice to address questions of physics, chemistry, and biology, but in a way that emphasized the limitations of biology. By associating science and art, he challenged the idea of the human body and the role of the scientific in contemporary art. Shonibare became known for his surrealist paintings in which his synthetic materials were made to appear and function like the natural world.By associating science and art, he challenged the idea of the human body and the role of the scientific in contemporary art.Shonibare became known for his surrealist paintings in which his synthetic materials were made to appear and function like the natural world. In the early 1950s, he began working on a science-fiction series of paintings about human evolution. His earliest works, which explore the relationship between man and nature, are from the 1950", "The next Biennial should be held in 2020.  The announcement was made at the end of the sixth edition of the Biennial, which was held in London from March 15 to March 17, 2020. The event was coorganized by London’s Tate and the London-based Royal Shakespeare Company and included performances by British-based artists such as Rineke Dijkstra, Anthony Goldblatt, and Tanya Cooper.Among the artists who will be represented in the next edition of the Biennial are David Altchek, Jodi Lynne, Farah Al Qasimi, David Hockney, and Nusrat Ghani. The full list of artists who will participate in the 2019 edition is as follows:David Altchek David HockneyDavid Altchek, Jr.Farah Al QasimiNusrat GhaniDAVID AL CHANGDAVID HOCKNEYNusrat GhaniDAVID HockneyNusrat GhaniDAVID AL CHANGDAVID HockneyNusrat GhaniDAVID AL CHANGDAVID HOCKNEYNusrat GhaniDAVID AL CHANGDAVID HockneyNusrat GhaniDAVID AL CHANGDAVID H", "The next Biennial should focus on ‘reconstitution,’ ’self-management, and the interconnectivity of art and culture in the twenty-first and twenty-twentieth centuries. This is our time, and we must confront it with openness, curiosity, and a sense of humor.” The trial runs for the biennial have already been canceled, and the organizers have suspended the semiannual exhibition. The first event of the new edition will take place in the city of Port-au-Prince from September 30 to October 3. The final version will be staged in the city of São Paulo, the capital of the state of Pernambuco at the end of November.The new format of the exhibition will introduce a new series of questions and will feature new works by the artists chosen for the exhibition. The first half of the exhibition will consist of thirty-one solo presentations of work, followed by a “drama skit” that will feature a final program and installation by the artist who received the “Award of the Year” designation. The second half of the exhibition will consist of 12 works. The artist selected for the biennial will be announced in the coming weeks. The exhibition will", "The next Biennial should mark the centenary of the birth of T.S. Eliot. The festival will feature performances by artists including Gertrude Stein, Heinrich Krebs, and Richard Avedon. The first edition of the event was held in 1957 and featured works such as The Planet and the Monster (1958), “The Shape of Things” (1959), “Doll in the Studio” (1959), and “When Life and Death Meet” (1959).The 2019 edition of the Biennial will take place at the Museum of Modern Art, in New York, and will run until October 7.\n\n\nThe March for Science, which has been held annually since 1972, will be held March 15–March 17 in Washington, DC. The event will be hosted by the Smithsonian Astrophysical Observatory (SAO), the National Museum of Women in the Arts (NMFA), and the Smithsonian American Art Museum.  The March for Science is organized by the Association of Art Museum Directors (AAMD), the National Association of Theater Directors (NASD), and the National Association of Theatre Researchers (NATR), with support from the Rockefeller Foundation and the Smithsonian American Art Museum. The March for Science will be", "The next Biennial should be held sometime in the second half of next year. \n\n\nThe Museum of Contemporary Art (MoCA) in New York has announced that the institution will no longer include the German designer Erich Lüth, who was a major force in the postwar development of modernist architecture, in its upcoming iteration of the Art of the Party, a festival dedicated to the art of the 1960s and 1970s.The museum revealed its decision to postpone the event in a statement on Thursday, March 3, in response to calls for the exhibition to be canceled amid heightened tensions between Berlin and New York. “I want to emphasize that our curators and artists have every opportunity, in accordance with our respective constitutions, to engage with the work of the other exhibitionists at the event,” said curator Max Hollein. “And this is exactly what we’ve done. We have chosen to include a wide range of artists—from Hoppe to Warhol to the Dreyfuss family—and we have done so in a format that is both accessible and flexible. We hope that this a rare event in which the other curators and artists have the opportunity to participate in this exhibition, and I am sure that it will", "The next Biennial should be held at the Institut de Défense in Paris in June 2020. \n\n\n\n\n\nThe Coronavirus and the Arts in the Twenty-First Century, a joint project of the Japanese Foundation for the Arts, the Institute of Contemporary Art in Kyoto, and the Museum of Modern Art in New York, has released the commission for a new series of exhibitions devoted to art, architecture, and design in the Japanese capital Tokyo. The second set of exhibitions will open on December 23, 2020 and will run for two weeks.The exhibition, “Sculptor Takeda” (Sculptor Takeda), will focus on materials and how they can be used to express meaning in the form of light and sound, and will promote new materials that will be used in the exhibition. The exhibition will also be led by the Japanese sculptor Kiyoto Miyako. An independent curator will oversee the installation of the works.The exhibition will feature works by twenty-three Japanese artists, including Akira Nakamura, Tatsuya Nakajima, Yukio Takahashi, and Masaoka Takashi, and will be organized in collaboration with Tate, which will begin the process of moving the art from", "The next Biennial should take place in the spring of 2022. The programme will be inaugurated by a presentation of a selection of paintings by twenty-six artists, including Damien Hirst, John Moore, Mark Halvorson, and Paul Graham, which will be organized in a traditional biennial fashion. The exhibition will include work by thirty-six lesser known, long-standing, and current artists.The exhibition will be curated by Raymond Boghossian, the director of the Bienal de l'Arles Art Museum in Paris, and will be presented by the Catalan architect Andrés Turňde, who designed the space. From the onset, the Biennial’s design was rooted in the idea of an international architecture of civil society, with the emphasis on community building. Turňde described the exhibition as “about humanism.”Commenting on the project, Boghossian said: “In the aftermath of the pandemic, the essence of architecture is the organic synthesis of physical and spiritual elements. We wanted to build a platform for the work of young and emerging artists by focusing on their future projects, which are the work around the new research and their ability to make something of their own future.", "The next Biennial should be hosted by the Aichi Triennale in Japan and be organized in cooperation with the Aichi Prefectural Museum of Art (APMA), the Aichi Prefectural Museum of Art (APMA), and the Aichi Prefectural Museum of Fine Arts (AoFA), as well as the Chiba Japantai Memorial Museum (CJM), and will take place at the Aichi Prefectural Museum of Art from February 28 to March 4, 2020. The exhibition will feature work by thirty-nine Japanese artists in addition to three artworks by American artists. For the artist-in-residence program, ten artists will receive a residency at the museum. The 2020 theme for the exhibition, “Life and Death” was inspired by the theme of the exhibition “Life and Death” at the Venice Biennale in 2004, which was organized by the same artist-in-residence program. The 2020 exhibition will be “Life and Death” and ‘Death and Life’ .\n\n\nThe Museum of Contemporary Art (MoCA) in New York has appointed Sarah Polley as its next executive director. The sixty-nine-year-old will be responsible for", "The next Biennial should focus on how art can be an antidote to social problems, the commission said. The event will also consider how art can become a source of inspiration and a way of life for those impacted by conflict, war and natural disasters. The exhibition will include works by twenty-four artists and will run from September 7 to September 11. The 2019 edition of the Venice Biennale will take place at the Venice Architecture Biennale from January 2 to March 22, 2020. The event’s theme is  “Between Man and Machine: Machines and Post-Art in the Nineteenth Century” and will be presented by Koen Griem, Los Angeles’s Head of the Department of Media and Performance, in collaboration with Vincent van Gogh, Gustav Klimt and the Kunsthalle Basel. The twentieth edition of the annual event will be held at the National Museum in Oslo from March 23 to March 26, 2020 and will be organized by Koen Griem and Johanna Mårtvedt, Copenhagen’s Arts and Culture Minister, respectively.According to the Art Newspaper, this year’s biennial will be the last for the museum. “The future of the National Museum is quite possible", "The next Biennial should take place at the HDKG Museum in Seoul in March 2020. \n\n\nArts and Culture Minister Elfriede Schulz has announced that the German state will contribute a total of $53.5 million to the restoration of the Heinrich Heine State Museum in Kassel, Germany, which underwent a major renovation and expansion project in 2015. The state will also step up its contributions to the institution through revenue-sharing agreements, tax refunds, and other initiatives.“In the coming months, we plan to increase the state of support for the Heinrich Heine State Museum,” Schulz said. “Our recent investments must begin with a clear view of the future and reflect in part the museum’s current activities. We must avoid short-termist approaches and often adopt a more proactive fashion. The revival of a modern, state museum is a long-term project, involving a long-term research agenda and a long-term implementation.”The state will also give $3.6 million to the museum’s research program and will work with the Heinrich Heine Foundation to develop a new series of lectures on culture and evolution to be presented in 2020. The first of these will", "The next Biennial should be held in 2020. \n\n\nThe American Council on Architecture (ACA) has announced its 2020 executive board members. The organization is making the announcement after the coronavirus outbreak in Japan forced it to cancel the exhibition “The Architectural Experience of Los Angeles” at the Los Angeles County Museum of Art (LACMA) in June. The museum, which was already closed due to the coronavirus, only reopened in March after the county of Los Angeles and the federal government ordered the closure of all public buildings, including LACMA. “After careful consideration, we have decided to honor our commitments to the Los Angeles County Museum of Art and the Los Angeles Museum of Contemporary Art (LACMA) and will announce our executive board members in due course,” said David Childs, president of the American Council on Architecture. The 2020 executive board members are John Gerard, chair; Warren Black, vice chair; J. Paul Getty, secretary; Richard Smithson, treasurer; and Roberta Smith, chair. The organization also appointed Jan Bakeman, the board president; Richard Justice, the executive director; and Mary Cheney, the director.When asked about the current state of the arts, the 2020", "The next Biennial should be held in 2022.\n\n\nThe Museum of Contemporary Art (MCA) in Los Angeles, the Museum of Contemporary Art Chicago, and the Museum of Contemporary Art San Diego are among the larger arts institutions that are planning to shutter or drastically reduce their workforce through voluntary retirements or layoffs. “The decision to reduce staff is made in the interest of both the museum and the city,” said MCA director Marion Nestle. “MCA is committed to delivering an innovative, engaging, and inspiring exhibition program that is truly representative of the city of Los Angeles. These actions also ensure the museum’s ability to continue to thrive in the most modern of environments, while also preserving vital cultural and educational programs for our community in the process of reopening.”While the closure of the institutions is anticipated to reduce visitation by as much as 6 percent, the staffs are hopeful that the institution will reopen with minimal disruption once the temporary closures are lifted. “We are grateful to our staff, our supporters, our community, and the artists who have come before us, and who will continue to make a difference in the city of Los Angeles,” Nestle said. The museum currently has a payroll", "The next Biennial should take place in 2019, with a view to 2020. All three of the previous editions of the exhibition will be staged at the Museo de Arte Contemporáneo, Barcelona. The exhibition will be held in conjunction with the upcoming year of the Centro de Cultura y Histórias de Barcelona.The organisers have also announced that they will once again be taking part in the exhibition’s Buenos Aires edition. “The exhibition involves the history of contemporary art in Argentina from the contemporary and the contemporary,” said Diana Almeria, the president of the organization. “We hope the show will be a reminder to us all that art is more than ornament and that it can be the vehicle for social change and reconciliation.”\n\n\n\n\n\nDiana Almeria, President of the Art Museum Buenos Aires, has said that the upcoming exhibition “isn’t going to be a show about art, it’s going to be about the history of art, like no other show has ever been staged before.” Almeria said that the show will aim to “use art as a tool to calm us down.” “We’", "The next Biennial should be the 30th, in 2021. It has been proposed that the biennial should draw from a collection of twenty-six works, comprising thirty-six artists and forty-seven lesser known works, which were selected by the International Association of Art Historians (I.A.A.M.) and will be presented in the exhibition “30 Years of Biennial in Paris.” The work will be curated by Peter Platos, who will work with the I.A.A.M. in collaboration with the artists and the Museum of Modern Art (MoMA) in New York to determine the themes and the artists chosen for the exhibition.The artist’s statement reads: “There are indeed things in the world which no one can take away from a living being, such as life and freedom. And I think that life contains in itself the seeds of all values, and that to take from these seeds is the very thing that is the antithesis of living. To take from them is to take from life. But to take what is not of life is to take from life, and to continue to live is to continue to exist. The life of the artist is a life of the artist and the life of", "The next Biennial should be entitled “A Concise History of the Origins of the World.”The vernacular will begin with a prologue entitled “A Proposal of the Origin of the World.” This will be followed by a set of monographs on the pernicious influence of Modernism on the art of the twentieth century, followed by a comprehensive exhibition, “Ancient Art - Its History, Structure, and Development” That will include a selection of ceramic objects dating back to 500 B.C. This exhibition will open in 2020.Hessey\n\nHeidi Glaser, who helmed the Los Angeles County Museum of Art (LACMA) for five years, has announced that she plans to resign in May 2020. During her tenure, she organized several exhibitions, including “The Third World,” a 2019 survey of modern art in Africa, “The Middle East,” and “Quantum Break,” a 2018 solo exhibition at the Santa Monica Museum of Art.“I’ve long been a supporter of the LACMA mission and its artists,” said Heidi Glaser, chief executive of the Marfa Museum of Art, the Pas", "The next Biennial should be on the island of Nauru, the island of Cyprus, and the island of Argentina, which also recently requested the title of “Prospect.” The 2017 edition of the Biennale of Sydney was canceled, and the 2020 edition will be held at the Sydney Opera House.The Art Newspaper reports that the Australian government is preparing to withhold $10 billion from the government-backed Commonwealth Fund next year as a result of the coronavirus pandemic. According to The Guardian, the Commonwealth Fund is predicting a $6 billion shortfall this financial year. The government has already committed $2 billion to help Britain deal with its coronavirus crisis, and more than $1 billion to the United States, Canada, and Australia. On Monday, September 7, Prime Minister Scott Morrison announced that he will resume the cuts, which were suspended in March, and will reduce the funding for the arts by $1.7 billion. “This is not a time for complacency, but a time for a radical rethinking of our economy, a rethinking that begins with a radical rethinking of the world we live in,” Morrison said at a press conference. “This is not a time for compl", "The next Biennial should feature a collection of new works by international artists who will continue to explore the medium of contemporary art through the use of wood, glass, and film. The exhibition will be divided into a variety of categories such as cultural history, architecture, performance, performance-art, photography, performance, and sculpture. The eight participating artists are Nate Boyden (New York), Nina Bocchieri (New York), Sarah Cammock (New York), Saara Cergotti (New York), Zoe Monaghan (New York), Amina Nadia (New York), Tacita Abrahms (New York), Pamela Adams (New York), Erin A. Adams (New York), Tad Perez (New York), Lanceo Mariano (New York), Fernando Marín (New York), Mariela Martínez (New York), Natalie McClellan (New York), Natalie Posen (New York), Nancy Lynne (New York), Linda Schipper (New York), Violeta Silva (New York), Mary A. Smith (New York), I", "The next Biennial should feature all of the major works on display for this year’s edition\u0097the inaugural exhibition, “BLACK SAND,” will focus on the French activist and critic, whose work was based around a political critique of the concept of the African diaspora\u0097and will be held within the central gallery’s venue, the Museum of Modern Art in New York.\n\n\nThe Metropolitan Museum of Art (the museum) in New York announced today that it is planning to shutter its Guggenheim Museum, which has been open since 1985, and refocus on revitalizing the institution’s collection through the auction of works and open up online viewing rooms for the collection.The announcement follows the announcement last year that the museum was preparing to transition from a permanent collection to an online-only version. The museum has also invested more than $100 million in its archive since it moved online in 2008, and recently opened an artist’s studio in a former Douglas Fir Building in its underground parking lot. The center’s online exhibition program, which was being led by curator and artist Paul Efstathiou, has helped the museum achieve a nearly 90 percent drop in ticket sales this season", "The next Biennial should be held in 2020, and the first in 2021.\n\n\nThe University of Haifa in Israel and the Israel Museum in Jerusalem have struck a deal to begin the construction of a new museum for the Middle East and North Africa (MENA) in the city of Nablus. The project, which involves the demolition of an older building and rebuilding a new one in the city, will be funded by the National Endowment for the Humanities and the Arts (NEA).The two institutions first announced the project in July of 2017, and completed their expansions in October of 2017. The Israeli government contributed $2.3 million to the project, which will be located in the city of Nablus and will be inaugurated by a performance by the contemporary artist Basma al-Qasimi.The new museum will be designed by architect Nael Harel, and will be inaugurated by a series of galleries. The first exhibition will be “The Light of Life”—a retrospective of works by Sara Dewar, with works by Tal Shani, Yael Yadin, and Raphael Mechoulam. The second will be “The Sky Above: ” featuring works by Odd Osm", "The next Biennial should take place in 2021. “I’m really excited to see what this exhibition will bring to the museum, especially after a significant refurbishment,” said Nari Ward, the curator and chair of the second Biennial. Ward has also collaborated with the city of Los Angeles on a series of public artworks that will feature the work of local and national artists. The first public works are Lorenzo Fusi’s Exhibit “Sensuality: Art in Motion” and “Cinema” (2019); the second is Lorenzo Fusi’s Feminism’s Place: Women in the 1980s’s” (2020) and “Urban Insanity” (2021); and the third is Lorenzo Fusi’s “Nude People: Photography and the Image of Body” (2022) and “The Sick, Sickly, and Dead” (2023). The Biennial will also include works by artists from China, Japan, Korea, and Thailand. \n\n\nThe Contemporary Art Museum Houston (CAMH) has announced that"]