["The next Biennial should take place in the spring of 2022. A new exhibition, “NIRIN,” is currently on view at the Gay and Lesbian Museum in London. \n\n\nSan Francisco’s Metropolitan Museum of Art (MoMA), which recently conceded that the institution plans to move from its current space on the ground level of the museum to a new 8,500-square-foot building that will replace the Met, has released a new set of guidelines that outline how the institution will transition from a public space in the city to a private museum. The documents, which were written by Met president Robert D. Gomez and were presented at a meeting of the Metropolitan Museum of Art’s board of trustees on Thursday, March 8, also outline how staff will work remotely, how exhibits will be organized, and how visitors will be treated.The paper, titled “The Met.2020: A New Beginning,” outlines a series of actions that the museum will undertake to transition away from its current location and toward an online-only experience. One example is a virtual tour of the museum, which will be led by an artist-in-residence, which will be available on-site for a limited time through March 8.", "The next Biennial should take place in 2022.\n\n\nThe Royal Academy of Arts (RA) in London announced today that its inaugural biennial, Introducing the Body: From Motion to Life, will now take place in the autumn. The biennial, titled “Introducing the Body,” will feature sixty-nine works from the RA’s collection and will be held at the museum from September 5 to September 6, 2022.The biennial will receive a significant amount of funding from the Royal Academy of Arts (RA), which was established by King Edward VIII in 1243. The institution hopes to raise $9 million in support of its three-year, multiyear, and five-year biennial programs. The new biennial, which will be held at Tower Hamlets, will be some six hundred thousand square feet and will be organized as a family show, with the legacy of the contemporary art community at the museum dramatized through a series of exhibitions, performances, and performances.\n\n\nThe University of Toronto (UT), which was awarded a $5 million grant from the T.M.I. Foundation last month, has received another $2.5 million from the philanthropic organization in support of a new master", "The next Biennial should be held sometime in 2021, the organizers say. The event, which is supported by the Biennial Foundation, will also commission a new work, entitled The Best Way, by Damien Hirst, and will air on Facebook Live. The first iteration of the exhibition was held in London in 2010.  The biennial is always seeking new and innovative ways to share the art of the year. The 2018 edition featured work by forty-nine artists, including François-Xavier Faure, Alex Grey, and Tom Paine.\n\n\nThe Museum of Fine Arts (MoFA) in New York has appointed Julian Reznik as its next chief executive. He succeeds Haim and Siannus Guggenheim, who departed the institution in January 2019 after eleven years, and will assume the helm in March.“Between them they have transformed the museum into a global leader in contemporary art and brought it new and exciting ideas every single year,” said architect and MoFA board president Barbara Petzold. “While they were in charge, they also helped the museum grow into a significant institution within New York City and the region, and they have shaped the museum’s understanding of the art world", "The next Biennial should take place in 2019. Work will begin in April 2020 and conclude by March of 2021. \n\n\nThe French Ministry of Culture, Artists, Sport, and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and Sport and \n\n\nThe University of Washington has awarded four fellowships to artists and academic scholars for", "The next Biennial should take place in the in the second half of 2020.\n\n\nLos Angeles’s Museum of Contemporary Art (LA MoCA) has announced that it will not hold its next edition at the historic, gilded Apollo Theater in Los Angeles in April 2020. In a statement provided to the Los Angeles Times, the institution said that the decision was made on the advice of chief curator Amada Cruz. “The change of heart comes after we have carefully considered the many compelling reasons why we should continue to present the Museum of Contemporary Art in Los Angeles as a museum of contemporary art,” the statement reads.The decision comes after the institution faced a major setback last March, when it announced that it would be forced to cancel its spring 2020 event, “Ateliers du monde,” which was set to take place in February. The news came as no surprise to those who had hoped the event would make up for the cancelled exhibition, which opened on January 27 and ran until February 19. The announcement also coincided with the institution’s reopening of its basement, which has become an important venue for the exhibition of work by emerging and established artists. The opening ceremony of the first installment of the new series,", "The next Biennial should be staged at the New Museum in New York in 2022.  The Los Angeles Biennial will not be staged at the Los Angeles Art Museum. The 2020 edition of Art Basel Hong Kong took place at the Thailand Institute of Modern Art (SAM) in Bangkok. The 2020 edition of the Venice Biennale will be staged at the Palais de Tokyo in Paris. The 2019 edition of the Dubai Art Festival will be held at AlUla, in Dubai. The 2019 edition of the Venice City Triennale will be held at AlUla, in Dubai. The 2019 edition of the Dubai Art Festival will be staged at the Kihara Art Museum in Tokyo. The 2019 edition of the Venice Art Biennale will be held at the Museum of Contemporary Art in Venice. The 2019 edition of the Dubai Art Festival will be staged at the Museum of Contemporary Art in Venice. The 2019 edition of the Dubai Art Festival will be staged at the Musée du Picasso in Paris. The 2019 edition of the Dubai Art Festival will be staged at the Musée d’Art Moderne in Paris. The 2019 edition of the Dubai Art Festival will be staged at the Musée d’", "The next Biennial should have a budget of $3 million and will be held in the city’s Long Island City, Queens, in 2021. The event will stage eleven exhibitions: “Untitled,” a program that will feature sculptures, recreations of natural phenomena, installations, performances, readings, book signings, photo shows, and installations. The winner of the 2020 prize, which is based on a $5,000 cash prize, will be announced in the coming months.\n\n\nThe German government plans to spend €7.5 billion ($8.4 billion) to remake the country’s infrastructure in the next five years. It will also introduce new taxes and set up new emergency aid programs to help the country recover from the impact of the global health crisis.Under the plan, which was outlined in a budget blueprint published by Chancellor Angela Merkel on Thursday, which is expected to be released in the coming weeks, Germany will invest an additional €1.2 billion ($1.5 billion) into the country’s cultural sector in 2021, which will also see an additional €0.7 billion ($1.5 billion) allocated for emergency aid. Chancellor Merkel said that the arts will play an important role in Germany’s recovery", "The next Biennial should begin with a public performance by the artist-run space Laneway Live—an off-site space that serves as a hub for local audiences to experience the work of his or her choice. “I’m excited to be working with Laneway Live to create a curated program that will bring together the exceptional artists whose work, and the most important collages of their work, to commemorate the biennial’s one hundredth anniversary,” said Andrew Wiles, the founder of the biennial. The exhibition will be curated by Alex Abron, the director of the Sculpture Center, and will run through March 14.In the lead-up to the exhibition, the artist-run space created a series of collages that explore the themes of the biennial in the context of the social, political, and spiritual movements of the period. His pieces, which range between portraits, landscapes, and installations, were chosen for their aesthetic and conceptual depth and began the exhibition.“I’m excited to work with Laneway Live to create a curated program that will bring together the exceptional artists whose work, and the most important collages of their work, to commemorate the biennial’s one hundredth", "The next Biennial should be held in the spring of 2021. “It is very encouraging to see the enthusiasm and energy with which the artist-led campaign has been met, and to witness the breadth of support for the exhibition. I am confident that the Biennial will continue to flourish as a unique platform for the work of our artists and will continue to attract the best artists and audiences from around the world,” said Bettina de Ciani, director of the Museo de Arte Contemporáneo Brasileião. Workshops and exhibitions that were originally scheduled for this year’s edition have yet to be fixed and will likely be resumed next year.\n\n\nThe National Arts Museum in Washington, DC, announced today that it will no longer contract the private security firm Blackwater Worldwide to provide security for the annual May Day demonstrations in Washington, DC. Instead, the museum’s staff will now be paid by the approximately 1,500 private security contractors who were hired to protect the museum. The contract, which has been in the works for over a year, will run through March 31 and will be based at the museum until at least April 29.“This is a historic moment, and we are very much", "The next Biennial should take place in 2021 and the biennial will be staged at the museum.The country’s largest museum, the Mound Builders Association, has also expressed its appreciation for the gift of the Mound Garden, a UNESCO World Heritage site in West London, to the museum. The Mound Garden was built in 1925 and is one of the most famous sites in London. Inspired by the architectural legacy of the Mound, the Mound Garden is a large outdoor garden with a series of steps that leads to the Museum of Modern Art and the Serpentine Opera House. The venue will be transformed into a public space in 2020.The Mound Museum was founded in 1897 by Sir John Mound, who was a British Petroleum executive and a few years later founded the oil company BP. He also started BP’s development of the Polaroid camera. Mound died in 1958 but his descendants began the Mound Builders Association, which offers educational and cultural programming in the hope of inspiring future generations.\n\n\nThe British artist Paul Gauguin, an early pioneer of abstraction and a key member of the Fab Four, died on December 16 at the age of eighty-three at his home in London. His long-standing collaborator Nath", "The next Biennial should be held in 2022 and will feature international artists and non-European artists. “The Biennial is a great opportunity for creators to collaborate with their peers in the United States and Europe,” said Gardner. “And it is especially well suited to engage with our city’s cultural and academic community, since it is located in a historic district and has an international reputation.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Ryan N. Sook, the curator of contemporary art, performance, and design, as its next executive director. Sook currently serves as director of the Hammer Museum, where he leads the design and installation programs.“Ryan is a visionary curator whose work has been central to the revitalization of the Hammer, and whose expertise and experience brings an almost unparalleled perspective as he considers how to protect and enhance the Museum’s collection, exhibitions, and programs,” said Carol Bell, chair of the museum’s board of trustees. “We are excited to welcome him to MoCA and to work with him to further our mission to create new and contemporary works by leading artists and creating new spaces for the museum.”During his tenure at", "The next Biennial should be held in 2021-22. \n\n\nThe Museum of Contemporary Art (MoCA), San Francisco, has hired Marc-Olivier Tripodi as its next director. Tripodi joins the museum after serving as the director of the Brooklyn Academy of Art, where he helmed the institution from April 2019 to February 2020. Tripodi was also the founding director of the Angeles Art Museum in California, which he helmed from March 2019 to March 2020. “Marc-Olivier is an experienced director who has shown remarkable leadership and vision during his tenure at the museum,” said Elissa Farquharson, director and CEO of the museum. “We are thrilled to welcome him to the department and look forward to working with him.”The museum has also welcomed Brian Cox as its next director. Cox joins the institution from the Los Angeles County Museum of Art where he currently serves as head of the architecture department. During his tenure at the museum, he oversaw the launch of the museum’s new space for performance and performance-based art; developed new programs for the performance space Art of Movement; and oversaw the acquisition and renovation of the museum’s two-story, 288,000", "The next Biennial should take place at the Lisson Gallery in New York in 2021. \n\nThe New Museum in New York and the Brooklyn Museum in New York City have agreed to merge. Both institutions will hold a new, biennial-long exhibition, “The B-Side,” at the new Lisson Gallery in 2021. The event will be hosted by curator and curator of modern art Ngāi Tingalo, who was recently appointed as the artistic director of the Brooklyn Museum. “Ngāi Tingalo’s breathtaking story and deeply personal art form transforms the ways in which we think about what it means to be a contemporary artist in New York City,” said Linda Anagnos, who has served as associate director of the New Museum since 2015. “We are thrilled to collaborate with Ngāi Tingalo and the New Museum on this project, and to introduce the Brooklyn Museum’s role in the evolution of African American art history to a new generation of visitors to our collections.”Over the years, Ngāi Tingalo has shaped the narrative of how African American art was presented to the public through installations, exhibitions, and performances. Recently, he has worked with", "The next Biennial should have been held last year, but was postponed because of the Covid-19 pandemic. The fifth edition, which was to have been held in March, was rescheduled for May. The committee responsible for selecting the artist-in-residence for the next edition, which will take place in June, was also forced to rearrange the exhibition schedule. The arduous twelve-week work will now be staged in 2022. Inaugurating the show are a series of interviews with artists, including LaToya Alberts, Brett Anderson, Gabriel Boyer, and Bumaan Abdulrahman; an exhibition of new works by the artists featured in last year’s exhibition “Resisting the Trump of Fear”; and a discussion with Øyvind Carlsen, a former president of the Norwegian Royal Council of Arts, about the role of artists in the upcoming exhibition.“The importance of the exhibition as a vehicle for the work of the year is continuously stressed by the committee,” said Bjørn Strøm, the committee’s chair. “The next Biennial will be an important milestone in the artist’s cultural history, and will", "The next Biennial should be held in 2021. \n\n\nThe Museum of Science and Art (MSA) in New York has added five new artists to its curatorial staff, bringing the total number of artists working in the museum to fourteen. Two new artists will join the staff in the coming months: Christina Alberni and Tarek Attouy, who have been hired as curators of the new exhibit “Art in Cultural Networks: From Film to Music,” which will open in the fall of 2021 and run through the end of 2022. Alberni and Attouy will assume their responsibilities in January 2022.“This is a critical time for arts institutions, particularly those facing cuts or closing, and I’m excited to see how they use this opportunity to extend the work of their artists into the future,” said Nathan Rofman, the museum’s director and chief curator. “The exhibits will reimagine the foundations of the human experience through research and the creative process.”The Biennial will feature the work of fourteen artists in its various categories: visual art, craft, performance, performance-based art, and performance-making. Each artist will be given a $50,000 grant", "The next Biennial should take place in 2023.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released the list of sixty artists who have received its grant for the 2020–2021 fiscal year. The grant, which is valued at $75,000, is part of the “Unseen: Art and the Future of Humanity” series, which was launched by the DCLA to assist New York City’s arts and culture community. The winners of the grant will be announced in June and will each receive an unrestricted $150,000 cash grant.The grantees are as follows:Take-Up, New York: (New)Connections, New York: (New)Connections is now offering its annual Fall/Winter 2019–18 exhibition in partnership with the New York Civil Liberties Union (NYCLU). The event will include works by seventy-five artists.For the first time in its eighty-five-year history, the DCLA will honor a black artist this year. The institution will also feature five works by a woman, the first time the institution has honored a woman artist in the Fall/Winter 2019–18 timeframe. The cultural organization will also unveil a new bi", "The next Biennial should be held in 2021.\n\n\nThe House of the First Women’s Republic of China, an exhibition that aims to highlight the country’s achievements in the field of women’s rights, was opened in Beijing on February 22. The twenty-second edition of the exhibition—featuring work by thirty-six artists—was held at the Sifangdai Building, and will feature twenty new works by women artists.The show, titled “Men’s Rights,” is an extension of the annual Women’s Day event, which is held on December 19. The exhibition marks the occasion of “100 Years of Women’s Freedom”, which was organized in the same year by the National People’s Congress. Nominations for the event were opened by Wang Qishan, Wang Xicheng, and the artists Li Xinyu and Li Xiang, and the ­finalist awardees were Zhu Yan and Song Shizuo. The full list of winners is as follows:\n\n\nThe Museum of the Jewish People (MoJ) in New York has appointed Emma Abramson as its next executive director. Abramson comes to the institution from the", "The next Biennial should take place in New York City in 2021. \n\n\nThe Moselle Museum of Art in Paris has appointed Hayley Wong as its new deputy director and chief curator. Wong will be responsible for promoting the museum’s collection in the capacity of director and curator. She is the author of the upcoming exhibition “The Secret Life of Art: Paris in the 1940s” (2019), and will take up the post on September 1.“We are delighted to welcome Hayley to the Moselle,” said MUSE spokesperson Gilles Ropart. “Her impressive history of achievement and passion for the arts makes her the perfect candidate for the Moselle. Her creativity and enthusiasm for new opportunities, as well as her ability to collaborate with and advocate for artists and curators across the world, make her the ideal candidate.”Wong joined the institution in 2015 as curator of photography. Since then, she has curated “The Female Lace” (2019), “The Janus Effect” (2018), “Jupiter’s Legacy” (2017), “Kindred Spirits” (2016), and “Shelter:", "The next Biennial should be held in Seoul in the second half of 2020. \n\n\nThe Metropolitan Museum of Art in New York has appointed Anya Nicoll as its next curator of Asian art, effective immediately. Nicoll will take the helm from Christopher Wool, who has served at the museum for twelve years, in January 2021.“I’m delighted to welcome Anya to the Met, and to be able to contribute to an institution that has always been committed to examining the history of contemporary art in the Americas, Asia, and Europe,” said Marc Glimcher, the institution’s director and chief curator. “With her new role, she will be working alongside curator Alexis Taveras, who has served as the museum’s president and CEO for the last twelve years, and in collaboration with the new board of trustees. We are confident that she will respond effectively to the challenges presented by the new exhibition program, the ongoing exhibition-making, and the massive potential of the gallery.”Nicoll joins the Met from the Hirshhorn Museum in Washington, DC, where she has served as curator since 2001. In 2006, she was awarded a MacArthur “Genius” Grant for her", "The next Biennial should be held in 2022.  \nThe new collection of the Museum of Modern Art, Boston, also announced that it will permanently close its current exhibition “The Element of Place,” a retrospective of photographs by Louise Bourgeois, to coincide with the twentieth anniversary of its opening. Its staff was informed of the decision shortly after 10 AM on Saturday.“The museum was born in 1960 at the intersection of two of the most important artistic and cultural experiences of the twentieth century: the art of the laboratory and the art of the laboratory experiment,” the museum said in a statement. “The deterioration of the laboratory, which is the museum’s institutional heart, has fundamentally altered the museum’s mission. We have had the opportunity to re-create the museum’s former atmosphere and to extend its reach, but the dissolution of the institution is not an option that was foreseen or chosen.”The institution currently has thirty-four works on display in its permanent collection. The Smithsonian Institution in Washington, DC, has also funded the construction of a new exhibition space in its 500,000-square-foot building, which has housed the museum since 1971.\n\n\nThe Norwegian cultural minister, Torbjø", "The next Biennial should focus on “the relationship between art and technology” and will be held at the Los Angeles County Museum of Art (LACMA). The event will be broadcast live on the museum’s website and will include talks by artists and thinkers discussing topics such as “prosthetics and technology,” “technological racism” as well as special exhibitions. The biennial’s organizers wrote: “The future of art and technology is at the core of our work. In order to sustain the exhibition, we have to make a commitment to supporting the museum, the arts, and the community. We hope that you will consider this and help us make the decision for LACMA. We will continue to do our best to make the exhibition a success, keeping the biennial in Los Angeles in mind. Until then, we appreciate your understanding.\n\n\nThe Portland Museum of Art (PMA) has received a gift of more than four hundred photographs by artist Barbara Kruger from her granddaughter, Kayvan Kruger, who was diagnosed with Stage 4 breast cancer last March. The gift includes more than two hundred photographs documenting Kruger’s body art, which incorporates photographs, sound and sculpture.“", "The next Biennial should have been held last September. The twenty-fifth and twenty-sixteenth Biennials were canceled due to the Covid-19 outbreak, and the twenty-ninth was rescheduled for November. The treatment center at Rockefeller University in New York has since been converted into a research facility for the Center for Contemporary Art. The museum has since been closed since January, and it has not yet resumed normal operations. The Biennial of New Orleans is currently closed until March 15. The Biennial of New York has yet to announce its March presentation. The forty-ninth British pavilion at the Fifty-Ninth Venice Biennale was canceled last month, and the thirty-fourth was moved to March and March 28, respectively. British pavilion designer George Miller, who helped conceive the pavilion, told the Art Newspaper that the decision to move the show to March 28 was made in order to “avoid any disruption to the commissioning of new work and to avoid the serious question of whether it is in the best interests of artists.”The British pavilion will be returned to Tate next year, and the British Museum in London will host a new exhibition devoted to the pavilion next month", "The next Biennial should be in February 2021. Dissertation submissions will be accepted by August 20, 2020. Art historian Olga Bochner has been chosen to represent Germany at the 2020 Venice Biennale. She will be presented with the Klaus Dixgarden Award on February 21, 2020.Born in Vienna in 1930, Bochner studied at the Vienna Academy of Fine Art in the late 1940s and the University of Vienna until the 1960s. She married Nazi collaborator Ernst August Dixgarden, and their son, Klaus Dixgarden. He also had an affair with German Ambassador Helmuth von der Leyen, and the family fled to the United States during the Holocaust. In 1948, the Dixgarts founded the American Institute for Berlin, the Institute for Contemporary Art, and the Dixgarten Museum.In 1954, Frank Gehry, a German friend of the family, purchased the Dixgarts’ historic home in Newport Beach, California. The couple returned to Berlin, but the family lived in a rented apartment in the complex until 1961, when Klaus Dixgarden died of cancer. Klaus Dixgarden’s heir, Wolfgang, became the principal of the company, which was founded", "The next Biennial should take place at the Pushkin State Museum of Fine Arts in Russia next March. The museum is currently preparing to host a new edition, Art in Progress, which will introduce new works by more than sixty artists from around the world. The inaugural exhibition, Art in Motion, was organized by the Mid-Atlantic Center for Contemporary Art (MACC), in partnership with Loring Randolph and the American Institute of Art. The full list of curators for the show is as follows:\n\n\nThe Ballet Theater of Harlem (BTH) in New York has named its first director in nearly thirty years, David Samson. Samson came to the institution in 2015 from the city-funded New York Ballet, where he had worked for thirty-one years, and has since helmed the theater through a transformation of the institution, which underwent a major overhaul in 2017.BTH’s new building, the William H. Macy Theater, opened in 2018 and has since become the center for the company’s most popular production, Hamilton, which is staged by choreographer Lin-Manuel Miranda. The company currently has a residency at the theater in addition to staging productions at its space in the Bronx, as well", "The next Biennial should also include a special section on the demise of the Soviet Union and its impact on art. The biennial will also be inaugurated by a public performance of a new work by the artist Artsakhit Namdok, whose explosions of the European ideal, including a reconstructed Berlin, were inspired by the 2011 exhibition “Greater Russia: Soviet Art from the Seventeenth Century to the Present.” The institution will offer a selection of new works by the artist in the coming months and will launch a biennial catalogue in the spring of 2021. “The future of the 'art museum as well as the post-Soviet environment is at stake,” said Arseny Solovy, the president of the KESAM Foundation, which organizes the biennial. Solovy added that the future of the institution will depend on the will of the people who have voted in favor of its relocation from the capital. The KESAM Foundation also received support from prominent artists, including Sergei Ghebaly, Artsakhit Namdok, and Kamel Meredov, who penned a letter on behalf of the KESAM Foundation opposing the proposed relocation, and", "The next Biennial should be held in 2021, as promised by the Museum. \n\n\nThe Heritage Foundation in London announced today that it is now working with the Woking and Leeds Art Galleries (W&L) in an attempt to promote conservation and the importance of art over the centuries. The partnership, which is designed to advance conservation efforts and to engage with the W&L, was established as part of the Hagner/Weil (2019) initiative, a new initiative that aims to promote conservation in the arts through a multi-year program of exhibitions, educational programs, publications, and other activities.The partnership was initiated by the W&L, which is committed to promoting art as a tool for social change, and the Heritage Foundation, which will donate $50,000 to each institution—including the W&L. The partnership, which was launched to combat the global threats to heritage, including climate change and the ravages of war, has already resulted in more than 1,500 artworks being restored to their original state and will now involve the W&L in an attempt to increase the conservation of contemporary art. The W&L is also preparing to stage a number of exhibitions and other events that will engage with the Heritage", "The next Biennial should be held in 2022.”\n\n\nThe Museum of Modern Art (MoMA) in New York announced on Tuesday that it will not renew the contract of Allison L. Davis, the senior curator of European art at the museum since 2008, for the 2020 season. The move follows the announcement that the museum is preparing to hold a reopening exhibition at the venue in December.“The decision to not renew Allison Davis was not easy,” said director Daniel H. Weiss, who thanked Davis for her service and was confident that the forty-six-year veteran will continue to be a valuable member of the museum’s team. “I have long admired Allison Davis and her extraordinary ability to develop and present compelling exhibitions and books with the deft and care that characterized her art. Her curatorial career culminated in a critically acclaimed exhibition at MoMA in 2003, ‘Exhibition ‘Between the World and Me.”Speaking at a press conference in Manhattan on Tuesday, Davis said: “I’ve been incredibly fortunate to work at MoMA for forty years, and to curate one of the most important exhibitions in the history of the institution. I’m enormously proud to have contributed to the development", "The next Biennial should consider the possibility of creating an international platform for the exhibition of art from the global South, and should explore the connections among the visual arts, history, and politics. \n\nThe twenty-third edition of the Hamburg Biennial, curated by the German de Pop studio Haus Biennale, has announced that it is reopening to the public next week. According to a release, the exhibition will run as planned from October 15 to October 17. The opening of the seventy-second edition, curated by the same team, was postponed until November 1.Mariana Schott, the director of the Bode Museum and the German Cultural Center in Prague, and Helmut Schipper, the managing director of DFB GmbH in Berlin, will serve as presenting curators for the first exhibition of their kind in Hamburg until the end of the century.Schott and Schipper will also moderate an online version of the biennial, which will be launched by the Berlin-based site thewelt.de, in March 2020. In the fall of 2020, the exhibition will be held at the renowned Kunsthalle Basel.“We are delighted to welcome the Bode Museum and the German Cultural Center to Hamburg, which will", "The next Biennial should be curated by an English artist, and should take place in the city.  The museum has also presented a number of exhibitions that have been shown internationally. The first of these was the exhibition “The State of Paintings: From Modelling to Financial Art in the First World War,” which was shown at the London Gallery of Modern (GBMo) in 1936. The exhibition was inspired by a question posed by Jacques-Auguste René: “How can one depict an original painting in the twentieth century with as little expense as possible?” This exhibition, which opened at the Stedelijk Museum in Amsterdam in 1954, was followed by “Absalom” (1964), an exhibition based on the artist’s paintings that was on display at the Museum of Modern Art in New York from the same year. In addition to the usual programming, the museum hosted several concerts, including performances by the band Iron Butterfly from London, the London Ballet, and Shakespeare in London; the biennial’s final event, a performance by the French artist Tômé Lalanne, took place at the museum in 2014.\n\n\nThe Royal Academy of Arts (RA), the London-", "The next Biennial should focus on the history of art in North Korea and on the development of contemporary art in the country.The 2020 exhibition will be titled “The Quiet Revolution: Art and the Korean People” and will be staged at the museum. The next exhibition will be titled “The Origins of Korean Art,” which will be staged at the Museum of Fine Arts in Seoul and will focus on Asian art. The next exhibition will be titled “Diary of an Artist,” a collection of photographs by the late Japanese artist Yasujiro Ozawa, and will be on view in the museum until November.\n\n\nThe Hong Kong–based nonprofit Artnet, which provides financial support to artists and arts organizations in Hong Kong and Beijing, has established the “Artistic Development Fund,” a nonprofit organization that aims to support local artists and arts organizations through a combination of grants, loans, and donations. The fund, which is overseen by a board of directors comprised of Lina Li and Li Wei, was founded by artist and activist Peter Duan in 2016 to promote a more balanced approach to supporting emerging and established artists and arts organizations in Hong Kong and Beijing.“We are delighted to partner with Pang", "The next Biennial should continue to the theme of the century, “openness and multiplicity” and will present the works in the series “Spiral Beasts”—a nod to the multiple poetic themes that were woven into the text. As previously scheduled, the second edition of the annual exhibition will be held in December 2020.\n\n\nThe Smithsonian’s National Museum of African Art has welcomed Nadia Makhast and Julián Castro to the institution as fellows in the first phase of its new $650,000 Summer Scholarships program. The summer fellowships will provide funds to help scholars understand and expand upon the themes, studies, and exhibitions that were selected by the organization as part of its “African Studies at Colonnade” initiative.“Considered a cornerstone of the institution, these fellowships are a great way for African Americans to gain a greater understanding of the African diaspora,” said Margo Knight, the institution’s executive director. “As we continue to present the continent with an array of cultural experiences, we hope that these fellows will be able to contribute to the revitalization of African American art and history in the United States.”The National Museum of African", "The next Biennial should aim to include a selection of works by independent and established artists in the city, and should include a selection of works by independent artists from different areas of the city. The next year will be devoted to discussions of the transformation of the city. In addition, the exhibition will be focused on the history of the Biennials, and will include works by the artist Zoé Monaghan, a cofounder of the London-based artist-run space MOS.\n\nThe Art Newspaper reports that the German city of Hamburg has suspended the 2016 edition of the Berlin Biennials, due to a shortage of artworks. The decision arose from a shortage of artworks due to the coronavirus. The issue was compounded by the anticipated reopening of the museums in March of this year.According to the German newspaper the Frankfurter Allgemeine Zeitung, the Münster-Zeitung, and the Hamburger Banhof, the Berlin Art Museum (BAM) and the Public Museum of Fine Arts (BAM Pferod), which are currently closed due to the Covid-19 pandemic, have decided to postpone the biennial’s March 2020 reopening date. “We", "The next Biennial should focus on the Western canon, with a particular emphasis on the work of the Spanish American art. The theme should be “The Italian Renaissance,” and the five remaining spots will be reserved for the work of the Italian composer and theorist Luigi Pinca, who died in 1998. “Roberto della Francesca, the director of the Biennale of New York, called it a ‘new era,’” but it has been called a “brand new museum.”The new museum, which will be built in the former Todos, the former Italian Ministry of Culture, will be named after the artist—a nod to the festival’s dedication to celebrating artists, whose work was often influenced by and adapted from the Italian cultural scene. The exhibition will feature fifty works, including work by Federico Cervino, Mona Hatoum, Gianfranco Modigliani, and Marc Chagall.The lineup of the inaugural exhibition is as follows: “The Italian Renaissance” —Federico Cervino, Mona Hatoum, Gianfranco Modigliani, and Occhino Mollino’s Art", "The next Biennial should be presented by the Foundation of Contemporary Art in the City of New York; the development of a new stage, new objects, and new performances, the Cincinnati Biennial; the exhibition and reception of works in the exhibition of the seventh biennial, the Biennial of Modern Art, which was organized by the Museum of Modern Art in New York; and the exhibition of the twentieth biennial, Cleveland International, which was organized by the Cleveland Museum of Art.  The 2019 edition of the Venice Biennale will be held at the Museo de Arte Contemporanea, in Venice, Italy, in March. The Venice Architecture Biennale, held in cooperation with the Museo Arte Contemporanea, will receive the 2019 prize, which comes with a full year of support. The 2020 edition of the Venice Architecture Biennale will be held at the Museo Arte Contemporanea. The 2020 Tokyo International Drama Festival will be staged at the National Museum of Contemporary Art, Tokyo, on January 5–7, 2020. The event will be hosted by Shinichiro Terada and Hisayoshi Sato, and will take place on December 27–January 8", "The next Biennial should be held in the city in 2021–22. \n\n\nThe Kerner-Bell Group, a New York–based nonprofit that has supported the work of approximately eighty artists in the last ten years, today announced that it is shuttering its thirty-year operation. Founded in 1948 by Doris Bell, who grew up in Manhattan, the organization runs an exhibition program, produces grants and manages museum exhibitions, and provides the artists who receive its support with their first solo exhibitions.“It is a great honor to welcome the artists to the Kerner-Bell group,” said Stewart Kerner-Bell, the director of the Museum of Modern Art. “Their work has shaped the museum’s mission and changed the course of our lives. We are grateful to them for their contribution to the museum.”The organization was founded in 1937 by Bell, who became fascinated with the City of New York after moving to the United States from New Zealand when she was only six years old. In 1963, the institution, which occupies one of the city’s last remaining intact industrial sites, became the first museum devoted entirely to contemporary art. The Kerner-Bell Group will transition into a new entity in 2021, but", "The next Biennial should take place in the spring of 2021.If the date is chosen, the event will mark the final phase of the project, which was launched in 2005 with the aim of bringing together a group of artists from the US and US-Mexico to Mexico City in the hope of producing works that are both meaningful and that will inspire. The biennial will also include a wide-ranging survey of contemporary art, curated by a selection of Mexico City–based artists.\n\n\nThe Museum of Fine Arts (MFA) in Boston has postponed its next edition, originally scheduled for March 15–March 19, 2020, because of the Covid-19 pandemic. The postponement is believed to be the first such iteration of the annual exhibition, which has been canceled since March 14, and will mark the first time the show has been canceled since 2009. The event’s staff, who represent twenty-three states, including Massachusetts, New York, and Pennsylvania, have said the move was made in light of the potential closure of museums and other public spaces unless museums and other institutions take steps to mitigate the Covid-19 threat.“We have been working with the MFA to ensure we have the resources and infrastructure to rein in the virus and", "The next Biennial should be held in 2022. \n\n\nThe Museum of the Ancient Near East (Mana Museum), Germany: After twenty-six years of operation, the institution opened to the public on October 7, 2015, and closed on December 21, 2016. While the museum reports a loss of $4 million in revenue due to the Covid-19-induced closure, the organization is working towards reopening with a new $50 million fund. In a statement, the museum explained its decision to temporarily suspend operations through September 30, 2020.“We have come to the conclusion that the only way to guarantee that the museum will be able to function through the summer of 2020 is to temporarily suspend its exhibitions and performances during this period,” the museum said in a statement. “At this time of great uncertainty for the institution, the board of trustees of the German Cultural Heritage Foundation (DAF) have decided to postpone the construction of the Mana Museum until at least the end of the following year. The Danish pavilion will be inaugurated in 2021.”The decision to temporarily suspend operations follows the May 24 opening of a new twenty-five-thousand-work exhibition, “Histórias del", "The next Biennial should be in the next two years, and the next two years should be as exciting as the last one. I hope that this will be the year. This is a challenge that every artist has had to confront.”  The director of the Biennial, Monir Shah, said that the artist’s decisions to participate in the event were not influenced by financial considerations and that the exhibition, which was organized in partnership with the city of New York, was designed to be an “unseen university,” the New York Times reports.The 2019 show, titled “Visitor,” featured work by forty-five artists, including Adam Chinn, Anthony Crivello, Alice Bisognolo, Yuki Kondo, James Turrell, and Laura Wheeler, and was curated by Rory Carroll and Karlie Klipps. “This show has given me and many other visual arts professionals the opportunity to see what I’ve been missing: an international competition that has a global reach,” Shah said in a statement. “The artist residency program at New York University is a critical tool in fostering and supporting the cultural and creative economy of New York City. I am thrilled to", "The next Biennial should be held within six years, as discussed above.\n“The future of this exhibition is currently at risk,” said Paris’s artistic director, Olivier Blondel. “If the reorganization of the Biennale is adopted, then the exhibition will be affected. This means that we need to prepare for a change very quickly. We need to consider the possible consequences.”The most recent update for the exhibition was made on September 16, with the announcement of the next edition, titled “Between Two Worlds.” The announcement brought with it the news that the exhibition would be divided into three parts: “Theatre: Men in Black,” September 27–September 29, 2019, “Theater: Women in Black,” and “Theatre: Organs of Modern Life.” The artists selected for the second and third parts of the exhibition were Sara Bilder, Nima Bonaru, Aroie Bhatt, Paul Gauguin, Jean-Luc Moulène, James Morris, and Jean-Luc Van Eyck. The artist selected for the fourth part of the exhibition were Arjan Moëtaro", "The next Biennial should be held in the spring of 2021. The work will be curated by Bihari, Jia, and Jie, who will collaborate with artists from South-East Asia to represent their respective regions. The show will feature works by artists from Asia, the South-East, and West Europe.  The venue was invited to host the show in the aftermath of China’s recent attempt to boost its culture sector through a national arts policy, and the institution chose to partner with the Chinese government to help promote the country’s cultural exports and promote international exchange.The exhibition will be hosted at the National Museum of China (NMB), Beijing, from January 20 to January 22. The exhibition will travel to the National Museum of Taiwan (NMT), Taipei, for a March exhibition, and will arrive in Hong Kong on March 22.The full list of participating artists is as follows:Zhang YilunZhang Yilun (China)Zhang Yilun (Hong Kong)Zhang Yilun (Taiwan)Zhang Yilun (Taiwan)Zhang Yilun (Taiwan)Zhang Yilun (Taiwan)Zhang Yilun (Taiwan)", "The next Biennial should be in 2021. The biannual, which was organized for the Good Neighbor theme and was co-sponsored by the following local institutions: Broad Foundation, The Broad,   The Broad Museum of Art, The Broad Museum of Art, New York, New York, New York, New York, New York, New York, New York, New York, New York, New York, New York, New York, New York, New York, New York, New York, New York, New York, New York, New York, New York, New York, Art Institute of Chicago, Chicago, Art Institute of Chicago, Chicago, Art Institute of Chicago, Chicago, Art Institute of Chicago, Chicago, Art Institute of Chicago, Chicago, Art Institute of Chicago, Chicago, Art Institute of Chicago, Chicago, Art Institute of Chicago, Chicago, Art Institute of Chicago, Chicago, Art Institute of Chicago, Chicago, Art Institute of Chicago, Chicago, Art Institute of Chicago, Chicago, Art Institute of Chicago, Chicago, Art Institute of Chicago, Chicago, Art Institute of Chicago, Chicago, Art Institute of Chicago, Chicago, Art Institute of Chicago", "The next Biennial should take place in 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in New York has released a statement regarding the passing of Kathryn C. Martin, who was one of the first staff members of the museum to launch a feminist arts initiative, the Women’s Center, in 1976. The institution said that Martin “set a standard for leadership by creating a space where artists, activists, and writers could come together for a joint public project.”Martin was diagnosed with breast cancer in 2008, but did not die until her deathbed. Through the initiative, she pushed the boundaries of what a museum could display while also providing critical support to female artists.“Kathryn Martin was an extraordinary colleague, partner, and friend,” said Larry Fink, the board president of the board of trustees of the Whitney Museum of American Art. “In revealing her diagnosis, Kathryn displayed an extraordinary ability to reveal and express the world in ways that challenged convention and challenged conventions in ways that were both new and daring. Her commitment to exploring what it meant to be female, as well as her relentless drive to push for the project of a museum in a male-dominated society inspired me to love her.”Martin,", "The next Biennial should draw from the site of the first, and the museum should be able to draw from the gathering space for 50 years after the event. The history of the exhibition space should be told through research, exhibitions, lectures, and other public programs. Art historians and archaeologists should have a voice in the selection and planning of the exhibition. The institution should be able to develop new programs and exhibitions based on the collections and exhibitions. The biennial should be able to draw an international audience. The biennial should be able to support a significant and diverse collection of art and explore the history of art through new and innovative exhibition and education programs. The museum should be able to develop new programs that address current and emerging issues that affect the museum.The museum should be able to respond quickly to the changing needs of visitors and the community and should be able to implement changes that address its historical reopening schedule to meet the needs of the future. The museum should be able to attract and retain new and innovative visitors and should be able to sustain itself financially over the course of twenty years.”\n\n\nThe Museum of the Fine Arts (MFA) in Boston announced today that it is accepting applications for its 2017–18 season, which", "The next Biennial should be held in 2022, when the biennial is based in Lyon.\n\nIn an email sent to the institution on March 23, Dittrich stated that the decision to pull the show was mutual. “We have been working hard to create a new series in the United States and to re-create that network of artists and audiences in Italy, France, and Germany, while continuing to care for the architecture of the exhibition and the legacy of the artist, Lévy Gorvy.” \n\n\nArtist-run Albuquerque’s annual Cinéma, an annual free art fair, has announced that it will no longer seek to hold the event in 2021, the year it was originally scheduled to take place. Cinéma’s executive director, Nicole Goodfellow, told the New York Times that the decision was made after discussions with the fair’s board of directors, her staff, and the public.“We wanted to focus on what was in the best interests of our artists and partners,” said Goodfellow, who was recently named the fair’s new chief executive. “We are certainly open to other ideas and visions, but in order to be true to", "The next Biennial should hold an open-air exhibition of works that will be presented in the coming weeks. The exhibition’s theme will be “Theaters of Resistance” and will be curated by Prof. Berthold de Kooning of the Deutsches Museum der Künste Berlin.\n\n\nThe Düsseldorf-based artist and curator Düsseldorf-based artist and curator Przemysław Eżbets has been named the winner of the next Düsseldorf-based Art Prize. The annual $50,000 award recognizes a new work in the exhibition category, which is open to all artists. The exhibition will be staged in the city of Düsseldorf, Germany, in September, 2020. Eżbets and Zbigniew Jęmak (d. 2017), an artist and curator based in Warsaw, were chosen by a jury of curators, academics, and art experts for the prize. The jury was made up of Zbigniew Iwiński, director of the Wurttembergische Kunstverein in Berlin; Zbigniew Wojtyla,", "The next Biennial should be scheduled soon. “The City of New York’s position in the greater art-world landscape has been negatively impacted by the Coronavirus,” said Alexander . “We are committed to working with the City and County governments to position our local art for the future. We have several years to prepare for the possibility that we will not be able to reopen next spring. We will work with our partners in the public and private sectors to ensure that the City’s collection and museum’s exhibitions reflect the city’s changing architectural, social, and political landscape.”\n\nThe San Francisco Museum of Modern Art (SFMoMA) has launched two new digital platforms that will allow the public to stay abreast of the ongoing exhibition and fundraiser initiatives at the institution. “We are excited to introduce these platforms to our visitors, especially those who have made San Francisco their home, and to extend their reach to the audience of the most recognized artist in the Bay Area, Carlos Menem. With Menem’s support, SFMoMA has become a free and accessible destination for many artists. We are confident that these platforms will play a key role in facilitating the artists�", "The next Biennial should be held at least twice a year, with a budget of US$50,000. The Smithsonian American Art Museum (SAAM) in Washington, DC, is also planning to hold an exhibition about the history of American art next month. The fifty-ninth edition of the Central Intelligence Agency (CIA) biennial, Art in the 20th Century: The Untold Story, will open on September 15. It will feature more than 7,000 artifacts, including forty-five paintings, fifty-six photographs, and more than 1,400 photographs that have never been released to the public. The full list of exhibitors is as follows:Elgin Gallery, New York: Will be held at Elgin Gallery from September 23 to September 26. National Art Museum, Washington, DC: Theatre of the Oppressed, September 5–September 6. Jonathan Maberry Gallery, New York: The Jonathan Maberry Theater will be staged at Jonathan Maberry Gallery from September 29 to September 29. Pilar Polosa Lozano Gallery, New York: A new exhibition of paintings, sculptures, prints, and installations will be presented at the gallery, which is", "The next Biennial should take place in Tokyo in 2022. \n\n\nThe New Foundation for Contemporary Art (New Foundation) has announced that it is hiring Joao Paulo Lopes, an American artist whose work explores the intersection of art and politics, as its next general director.Lopes, who has been based in New York since 2007, will assume his post in January 2020. During his tenure at the New Foundation, Lopes will work with curator Stephanie Antrobus and filmmaker Tanya Bonakdar to introduce a new series of exhibitions and lectures that will be curated by Antrobus and that will mark the centenary of the founding of the contemporary art movement, Caio Nascimento, in Rome. “We are delighted to introduce the new series and invited artist Joao Paulo Lopes to the New Foundation,” said Antrobus. “His extraordinary projects, including his ‘Ducal Sculpture’ in Cagli, Italy, for the 2017 Venice Biennale, and ‘The Woven Womb’ in Rome in 2018, demonstrated an exceptional ability to create works that are historically accurate and contemporary. We believe that his proven ability and his willingness to engage with contemporary issues will be", "The next Biennial should be held in the coming months. This year’s event will consist of two exhibitions. The first, “The Black Triad,” will be on display during the first half of the exhibition, will be on view until November 13 and will be accompanied by a new volume of the artist’s work. The second, “The Art of Resistance,” will be on view until November 16 and will be preceded by “The Production of Resistance,” which will run on November 10.“The Black Triad’s' exhibition of work by and for Black artists at the San Francisco Museum of Modern Art, originally scheduled for the fall of 2019, was rescheduled for early 2020,” said Leeanne Pape, director of the San Francisco Museum of Modern Art. “This has been an incredibly difficult year for Black artists. I am grateful to the Board of Trustees, staff, artists, and the community for all of their support and encouragement.”\n\n\nAmerican art historian Mary Beard, whose cultural and intellectual influence stretches from the American South to the Himalayas, has died at age eighty-seven in Los Angeles. Her work has been collected by the public", "The next Biennial should take place in 2021; the exhibition will be hosted by the Museum of Modern Art, New York. \n\n\nThe Institute of Contemporary Art (ICA) in Paris is planning to open a new museum dedicated to the work of the late French sculptor Jean-Michel Basquiat in the city of Comtéré-sur-Yvette in the Composition des Arts-Pasoises region of the French Alps in 2021. The institution will host an exhibition of work by the late American sculptor Paul Gauguin and a new installation of works by the late American painter Hunter Poulter. The new venue will create opportunities for visitors to see the work of those who are no longer with us and will offer a new platform for dialogue between Basquiat and its neighbors.Basquiat’s work will be housed in an exhibition dedicated to his life and legacy, which will be organized as a retrospective, and will open in 2021. It will consist of an assemblage show with work by forty contributors, including Pascale Blondel and Wangechi Mutu, and will be on view for twelve weeks. A new series of exhibitions organized by the same group will take place in 2022. The", "The next Biennial should take place in 2021 and will be moved to the city’s Art Museum. In the meantime, the museum has opened a new exhibition, “Music: An International History,” and is preparing for a reopening in the summer of 2021. The National Gallery of Art (NGA) in Washington, DC, is also working to reopen as planned this summer, but it is currently closed until at least March 13. The Museum of Fine Arts (MFA) in Miami Beach, Florida, which opened on January 23, and the Art Museum of Chicago, which opened on January 26, are still on schedule for reopening in late March or early April.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York announced today that it is planning to open a new, privately operated, twenty-four-hour space on the museum’s southeast quadrant, the Metabarrennoye, that will host one-hundred works by twenty-three artists, including Ed Moses, Agnes Martin, and David Salle, and will host half of the works in the collection for free admission to the public. The museum will also offer free admission to the public for a minimum of three", "The next Biennial should focus on issues of sustainability, inclusion, and social justice. It should be a platform for analyzing contemporary art and the relationship between artists and the world. We will be able to see and feel the work of artists in the upcoming exhibition. We are already better able to see and feel the work of artists than ever before, thanks to the digital revolution. We are growing more and more aware of the world we live in, and how much more it can change for the better. We believe that the upcoming exhibition will show us the current state of the art.\n\n\nThe Tennessee Valley Authority (TVA) in Nashville has unveiled the first statewide conservation plan for the Great Smoky Mountains National Park, which is home to some of the world’s most iconic works of American art. Titled The Smoky Mountains Forever, the forty-fifth edition of the Smoky Mountains Biennial will focus on preserving the park’s eighty-ninth-century artwork, which is currently being restored by the Tennessee Valley Authority (TVA), and will target the area around the Smoky Mountains National Park, including the Six Flags, the High West, the Tennessee Valley Museum, Friendship River State Park, and the Tennessee", "The next Biennial should be held in 2021. Its organizers are also planning to create an art program that will showcase work by twenty-four emerging and established artists.\n\n\nThe Contemporary Art Museum Los Angeles (CAM) has received its $10 million donation from the Andy Warhol Foundation in support of the renovation of its building. The donation includes $8 million for the renovation of the museum’s former entrance on Wilshire Boulevard and $5 million for the construction of a new entrance on the ground level of the museum, which is currently being renovated by architect Daniel Libeskind.The donation was made in support of the renovation of the museum’s building, which is currently being renovated by architect Daniel Libeskind, and the renovation of the building’s exterior. The renovation, which is being led by the architects Yvonne Buechli and Alex Pappas, aims to increase the museum’s footprint\u0097it currently houses the museum’s permanent collection, which includes works by Frank Stella, Damien Hirst, David Salle, and Louise Nevelson\u0097and to create a more sustainable future for the museum.“At this exciting moment in its history, CAM is proud to continue to build", "The next Biennial should take place in 2021. “The central feature of the exhibition is the project of creating a new collection of the very best works in different parts of the world,” said Salome Bignaccio, the artistic director of the Italian institution. “We are very much looking forward to the project of bringing together unsellable works in order to create a new platform for the exhibition. We are also aware that the next show will be very different from the present one. We are ready to adapt our program in order to meet the needs of our visitors.”The exhibition will premiere at the Venice Biennale in 2021 and will be followed by the Venice Architecture Biennale in 2022.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has banned three New York City–based nonprofit arts organizations: the Parks Foundation, the John F. Kennedy Center for International Broadcast, and the East Village Cultural Center. The nonprofits were found guilty of violating the state’s General Obligation of New York to Establish and Operate’s Cultural Landscape in Elizabeth, New York, and were fined $250,000 each.“CCA’s failure to protect", "The next Biennial should take place in the city in 2022. The event’s inaugural iteration, last year’s “Coming Soon,” featured new works by contemporary artists such as DİYARÜE LEBAN, MÜNICA COLÓN, ZANDIMIR, and RAĞ; among others that are currently on view. \n\n\nThe New York City Department of Cultural Affairs (DCLA) has announced that it is temporarily halting construction at the Old Jewish Museum, the birthplace of Simon Wiesenthal, on the Upper West Side. “The loss of one of the city’s great living artists is a devastating blow to cultural life in our city,” said cultural affairs commissioner Nick Jewkes. “I’m especially grateful for the many artists and activists who will be impacted by this temporary setback. They’ve given our city and our state an important voice for decades.” The museum had previously faced two other setbacks: in 2019, when the museum completed a major reopening project, and again in 2021, when it opened a new, expanded building. While the city hopes that construction will resume soon, the institution has until now", "The next Biennial should be held sometime in the 2020s. \n\n\nThe Carnegie Museum of Art (CMA) in Pittsburgh has added two new members to its board of trustees: Ethan James-McFarland, a Chicago-based philanthropist and avid collector, and Michael Van Meter, a New York–based lawyer. NY1 News reports that the museum’s board of directors voted to add the two artists to its board of trustees in a vote held on Tuesday.“Michael and Ethan have been instrumental in making the CMA’s board of trustees exemplary,” board chair Ria Benitelli said in a statement. “In addition to their significant gifts to the CMA, they have been instrumental in the institution’s growth and success over the years. I’m proud to support their philanthropic endeavours and admire their vision for the CMA.”Both James-McFarland and Van Meter hail from Chicago, where they have extensive experience in collecting and exhibiting works from across the globe. The Chicago native and Houston native are the founders of the Collecting Art in Chicago: The Van Meter Collection, which includes works by such artists as Leon Black, Mark di Suvero", "The next Biennial should be held at the New Museum in New York in 2020, and the organizers are currently seeking an additional ten institutions for the event. \n\n\nFrench President Emmanuel Macron said on Monday that the country will leave the European Union in March 2022, and will begin the process of withdrawing from the bloc by the end of the year, the New York Times reports. Macron made the announcement during a visit to the Museum of Fine Arts (MoFA) in Paris, where he also met with French artist, designer, and producer Sylvie Aixlejaf, who is best known for her handmade, three-dimensional sculptures that use everyday materials.The Parisian firm Catherine de Gaston, which has exhibited works by artists such as Philippe Bonnard, Vincent van Gogh, Ed Moses, and Pierre-Auguste Renoir, has announced that it will move its headquarters to the United Kingdom, which has already announced it will leave the EU by the end of March. The museum, which is located in a former coal-fired power station, will remain located in Paris, but will be moved to a new location in the city.The move is part of a major cultural shift for France, which has always considered its southwestern region of", "The next Biennial should take place in the city in August 2020, and the twenty-fifth in December 2021.\n\n\nYale Union’s new headquarters has moved to a new home in the downtown core of the university. The building, which was completed in 2017, houses several programs, including the Center for Contemporary Art, the Visual Arts, and the Performing Arts, and is slated to debut in the summer of 2021.“The Union’s new home will give us a new opportunity to cultivate a stronger sense of community and connect with our community,” said Sarah Hales, chair of the board of trustees. “Yale Union is an invaluable resource for students and young professionals. I look forward to working with our talented staff and students on their designs for building a Museum of the American West.”Over the last two decades, the nonprofit organization has provided crucial support for dozens of the university’s students who have gone on to earn degrees in the arts. In recognition of their achievements, the students receive an annual stipend of $30,000 and receive a seat on the school’s board of directors. Former board members Richard Telling, Mel Chin, and Cary Schoelkut also receive a", "The next Biennial should include a lecture on how the exhibition process can incorporate a cultural reference point from the artist’s home country. The next Toguro Art Biennial should be about the body as a cultural source. The next Art Histórias Ibericoamericana (Iberican Art Museum) should reflect the history of the region’s art by examining the interrelationships between art, history, and geography. “The future of the art exhibition must be an exhibition of the artist’s work, not a reflection of the themes of the exhibition,” said Julian Schnabel.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it is launching a $100,000 fund for culturally-focused programs that will provide immediate support for artists whose livelihoods are at risk following the Covid-19 pandemic, with a timeline that will begin in 2021 and end in 2022.A fund of $150 million will provide direct assistance to artists and small-scale arts organizations whose livelihoods are at risk of being disrupted by Covid-19; the fund will also provide short- and long-term support for artists whose goals are within the purview of particular museums.", "The next Biennial should focus on the work of women and the field’s history in a way that is appropriate to the events and people that inhabit it,” he said in a statement. “This means that the exhibition should not only be a reflection of the problems and challenges of the present moment, but also of the history of the Art and the future of the Biennial.” The show, which will run from April 13 to April 15, 2020 in the United States, will also feature works by forty-one artists, including Phyllida Barlow, Dannielle Burk, Gisèle Giuliano, David Kline, Leonora James Gall, Joan Miró, and Ana Mendieta, as well as oral histories and musings by artist and activist Siân Ryan. Artforum will have more on the new exhibition and the 2019 edition of the Biennial, which will take place in the Colorado Springs Museum of Art, in the coming weeks.\n\n\nThe Palazzo Reale in Venice, Italy, has appointed Dominic Santiago as its new deputy director for art. Santiago joins the institution from the Museo d’Arte Contemporanea di Venice (MASV)", "The next Biennial should take place at least once a year. The selection committee will be chaired by Igor Špove, the president of the Rijksmuseum Amsterdam, and will include former curators Joost van Schuijst and Jan Knippenberg, as well as Ondine de Haan, director of the Bienniality Project, and Rory Murray, the director of Art Savers.\n\n\nThe Walker Art Center in Minneapolis is planning to move the American Renaissance Festival (ARF) in Durham, North Carolina, from its premises to the new 350,000-square-foot facility at 850 Fifth Avenue in the city. The move is part of a larger expansion and renovation project that will include new galleries, classrooms, offices, and public art, and will include the installation of two hundred works from the museum’s collection.“The expansion will include the collection of American Renaissance and will bring the collection to the center’s 500-year history as the largest arts institution in the state,” said Jody Scott, the center’s director. “This is a transformational moment for the museum, for America, and for the world. We are honored", "The next Biennial should be in 2020 and will be staged at the MAD–WEST and MOSCOW ETHICS CENTERS. The theme of the exhibition will be “Self-Portraits and their Contemporaries.”\n\n\nThe City of London Museum has appointed Hilary Cook-Reeder as its new director. She succeeds Stewart de Koon-Hart which departed the institution in the summer of 2020 to become director of the Museum of Modern Art, New York.“We are delighted to welcome Hilary to the City of London,” said Museum director Hartwig Fischer. “Her background in contemporary art, with a focus on the design and architecture world, and her keen interest in social justice and urban issues make her uniquely qualified to lead the City of London Museum in her new role.” Cook-Reeder also previously served as chief executive of the Institute of Contemporary Art (ICA) at the University of Cambridge and as a senior director at Teksavvy, a Russian manufacturer of architectural and interior design products.Commenting on her new role, Cook-Reeder said: “I am incredibly proud to have been appointed to the board of trustees and", "The next Biennial should focus on “the power of images to change the world,” organizers say. The show will include an exhibition of the work of twenty-nine artists and will open at the museum in 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has announced its 2020 cohort for its “Moving Mountains: The Art of Moving Mountains” art series, which examines moving-image works that are rooted in the West, in the future, or both. The ten works in the series, which is supported by the Doris Duke Charitable Foundation, were selected by a jury comprising artist and curator Karen DeCoudre, artist Rachel Whitley, and curator Shimon Adami. The ten finalists for the prize\u0097Benedict Anderson, Daniel Blum, Alex Gibney, and Christine Jennings\u0097will each receive $2,500.“Both moving-image paintings and sculpture, like all art, is about to be shattered and reconfigured by climate change,” said Whitley. “Moving Mountains is about examining the ways in which the landscape we inhabit and care for transforms and dislocates our ideas of place and place-making.”The prize jury comprised Whitley,", "The next Biennial should take place in March 2021.\n\n\nThe National Gallery in London will launch an online version of its annual National Exhibition on October 23, 2019, following the dramatic events of that day\u0097the London Bridge terror attack, the Manchester Arena bombing, and the London Bridge terror attack that killed seven people and injured hundreds more\u0097as part of a campaign to raise awareness of the pandemic.Launched by the National Poetry and Poetics Biennial in collaboration with the British Poetry Biennial, the exhibition will run alongside the biennial’s upcoming editions at the National Museum of Scotland. The work of thirty-six poets will be presented by thirty-three artists, including Qasim Shaikh, Léa Seydoux, and Harjant Gill, and will run approximately two-hundred and fifty-four pages long.“The show will explore the meaning of poetry and hope, and the power of poetry and hope as a medium for social change and political engagement, and will be backed by an exhibition by artist-clients Speedy and Joe, whose works will be featured in a biennial that will take place in January 2021, at the National Poetry and Poetics, London, in 2022, and", "The next Biennial should be held at the Hotel de Palais de Tokyo in Paris in 2021. “This is a challenge that we as a collective have been facing for a very long time,” said Naoki Takemoto, director of Tsubasa Takemoto, an independent Japanese arts space founded in Tokyo in 1997. The artist is currently the subject of a retrospective at the Singapore Biennial, which opened in March 2019, and has donated his art to museums and institutions in the country. The next edition of the biennial will take place in the summer of 2021.\n\n\nThe Museum of Fine Arts (MFA) in Boston has received a gift of fourteen works by thirty-five African American artists from the Dorothea Rockburn Collection, including two works by Pierre and Marie Antoinette, one by Elizabeth Peyton, and a monumental work by Black artist Hélio Luger.The arts patron was moved by the works in a show of support for the African American community. “I was honored to receive these works from the Dorothea Rockburn Collection, and I’m grateful to the MFA for allowing the collection to acquire these outstanding works,” said Rockburn. The museum will present the works", "The next Biennial should be there, sometime in the second quarter of 2020.”\n\n\nThe Smithsonian’s National Museum of African Art (NMAA) in Washington, DC, has opened its permanent collection of African art to the public for the first time in its nearly eighty-year history. Founded in 1909, the institution is the largest repository of African art in the country and boasts an exhibition space that can host as many as ten thousand visitors annually.Although the institution was founded as a museum of African art in 1909, it has had a tumultuous run of ten years to re-open, as it grappled with the devastating 2016 pandemic. According to the Washington Post, the institution currently has a staff of only three hundred and faces a situation similar to the 2011 reopening of the Museum of Fine Arts in Boston, which faced a similar situation just three years later.In an attempt to address the challenges posed by the pandemic and the institution’s current predicament, the Smithsonian completed a $250 million expansion and renovation project in April of last year. The extension added a new gallery and an exhibition space, added more than three hundred rooms, and added new spaces for educational activities and programs, a library, and a museum representative of", "The next Biennial should be held in the fall of 2021.\n\n\nThe Allen Foundation for the Arts (AFA) in New York has announced the winners of its 2017 fellowships, which were given by artists and scholars in the United States and abroad. The grants, which come with a $25,000 cash prize, were selected from a pool of five artists whose work was selected for consideration by the foundation.Darya Osha, a Black-and-White photograph that combines black-and-white photography, sculpture, and video, was selected for its “Dark Sky Gallery” exhibition at the Allen Memorial Art Museum, which opened in 2016. The show, which featured photography by artists such as Robert Irwin and B.K.S.S. Janan, was nominated for a Pulitzer Prize in photography in 2017.The Biennial Awards, which were founded in 2015 to recognize and celebrate the contributions of Black artists and scholars to the field of art, are a continuation of the foundation’s fellowships program. Founded in 1992, the program awards $2,500 to three artists each year.\n\n\nThe Museum of Fine Arts (MFA) in Atlanta has received a gift of approximately $2 million from philanthropist Melanie and William", "The next Biennial should be in November 2021, when the exhibition will be open to the public for a week. The event will also include the first three times the participants of the exhibition will be able to participate in the new year. The next edition of the show will be held at the Grand Palais in Paris from March 7 to March 11, 2021.\n\n\nThe New York City Department of Cultural Affairs (DCLA), which announced on Monday that it is planning to close its five cultural sites in the city by February 13, 2022, has released a new set of guidelines for redevelopment in the city. The guidelines outline how the city should work with developers to ensure that new buildings will incorporate cultural institutions, preserve significant historic assets, and prepare for future events.“While a site-specific plan may be appropriate in some instances, the guidelines are not and do not address the complex issues of reclamation, design, preservation, and use that often accompany urban redevelopment,” said city council member Jimmy Van Bramer, who represents parts of the East Village and the Bronx, and represents Queens, where the sites of the city’s cultural institutions are located. The guidelines, which were developed by the Cultural Affairs Agency, are part of", "The next Biennial should create a new exhibition format and a strategic plan to pursue contemporary art from an indigenous perspective. The exhibition should be a reflection of the spirit and creativity of the original projects, which are housed in the museum, with a balance of traditional and contemporary art. It should also be a reflection of the global context, with an active contemporary art program focusing on the Americas and Europe. I am also looking forward to working together with the staff and board of the Biennial to develop creative and technical strategies for exhibiting contemporary art from across the globe in a new and effective way. The new format will provide the artistic community with a platform to engage with local topics, and will provide a platform for the development of the Biennial as a whole. The new exhibition will also introduce a new program of public programming, including the opening of the biennial’s inaugural exhibition “The Bridge: Contemporary Art in the Making” this fall. The biennial will have a new new exhibition style, themed after the classical term, the Biennial Book of the Month, which will open on December 5.\n\n\nThe Institute of Contemporary Arts (ICA) at the University of Amsterdam (UAE) and the Museum of Modern Art (MoMA)", "The next Biennial should take place in 2021. \n\n\nAdeline Quaritch, the director of the New York Institute of Art (NYIA), announced today that she is resigning in protest of the institution’s relationship with the Israeli government. Quaritch’s departure is the latest in a string of activists and artists who have publicly criticized the current state of Israeli institutions and the ongoing policies of the Israeli government, which has forced thousands from their homes and policies of apartheid against Palestinians. In a statement published by the New York Times, Quaritch said: “For nearly twenty years, I have been working to advance my own political views and to challenge the institutional policies of the Museum of Modern Art and the Museum of Modern Art’s branch in Jerusalem, the Solomon R. Guggenheim Museum, and their ilk. I have been an advocate of direct action to advance human rights and anti-racist demands. I have been a fierce critic of Israeli violations of Palestinian rights, and I have been a champion of artists who have risked their lives to draw attention to these violations. However, I have always maintained that the best way to halt the wave of erasure of Palestinian memory and the destruction of Palestinian identity is", "The next Biennial should be held in the spring of 2021. The institution will have the capacity to create new and innovative works about fifty minutes from the city center, in a building with a gallery space. The construction of the venue will be financed by a consortium of Finnish and international artists.\n\n\nThe Los Angeles County Museum of Art (LACMA) has received a gift of twenty-one works by thirty-six contemporary artists, including Jane Panetta, Valeria Catellotti, and Elena Delle Paretti, in exchange for twenty-two years of their collective works. The donation includes works by artists such as Frank Gehry, Frank Gehry and Charles Paul Rubens, Alberto Prado, Willem de Kooning, and Louise Nevelson, and a selection from the collections of the SculptureCenter, the Los Angeles County Museum of Art, and the Metropolitan Museum of Art.“The gift program offers LA’s artists and curators a unique opportunity to shine in the spring as the spring suns on our city,” said LACMA director Louis Larmon. “We are so grateful to Alison Chiu, Stephen DeSousa, Jonathan Franzen, and the rest of the", "The next Biennial should explore the role that art can play in addressing some of the world's most pressing social and environmental challenges, including migration, climate change, and violence, and should include an open and public forum for dialogue with indigenous peoples and communities around the world. The first edition of the Biennial inaugurated the festival with a dedication ceremony attended by Secretary General Katja Malmstrom and President Jørgen Varnholt. Inaugurating the second edition, which will be held in Helsinki in November 2021, will be a tribute exhibition, a new book on the history of art and a presentation of the art of the future. The third and final exhibition will be a retrospective of the work of Svante Paartal, a pioneer of twentieth-century art, curated by MELA and curated by the Förvalda-Pitkala-Koki Omlenskij.In a statement, the Förvalda-Pitkala-Koki Omlenskij Foundation said: “Together with the Förvalda-Pitkala-Koki Omlenskij Foundation we are thrilled to take part in this important year of the arts in Finland, which", "The next Biennial should be held in 2020. “We are not at the stage of designing an exhibition anymore, but at least of having a series of exhibitions,” said Hugo Barba, the chairman of the museum. “More than ever, we are at the stage of designing a city.” Barba also hopes to open a new biennial in Lecce, Italy, in 2021, and to open a new museum in Bologna, Italy, in 2022. Barba’s Milan-based team is now working with the city of Milan to design a new city monument for the museum.  The project is part of a larger $16.6 million overhaul of the city’s Pirelli Hangar Bicocca, and will revolve around the collection, display, and exhibition of the museum’s collection. The money will also help fund the introduction of new events and exhibitions. Due to the height of the building’s roof, Biennial of Arts, Architecture, and Design will be relocated to the city’s historic Pantheon, where it will remain until early 2021.The redesigned museum will also introduce new exhibitions and events, including “We Are Not", "The next Biennial should be held in 2020, the organizers said. “This exhibition’s legacy will be a source of inspiration for future generations, and we look forward to continuing our work,” the exhibition’s organizers said in a statement.\n\n\nThe Metropolitan Museum of Art in New York has appointed Paul Crowley, the president and CEO of the New York Cultural Foundation (NYC), as its next board president. Crowley succeeds Kathleen Kennedy, who announced her resignation in May 2019 after more than twenty-five years as president of the organization, and will take up the post in January.“In his new role, Crowley will work to ensure that the Met’s mission—to nurture and celebrate the work of emerging and established artists and organizations—grows as we continue to support and present their work,” said Kennedy. Crowley succeeds Richard Armstrong, who announced he was stepping down after twelve years as president of the museum in January 2019, and will begin his tenure in January 2021. “Paul is an outstanding leader, who has led the Met through many challenges over the last twelve years,” said Elizabeth Gilbert, the board president and CEO of the nonprofit organization. “His ability to integrate", "The next Biennial should be held in the city of Santa Fe, New Mexico, in the autumn of 2020.\n\n\nThe American Society of Civil Engineers (ASCE) has announced that it will no longer award grants and awards to institutions that have been at least two years without demonstrating an improvement in their sustainable practices.“We cannot, in good conscience, continue to support organizations that have been complicit in undermining America’s national security and our economy by opening up vast new coalitions of state-sanctioned laboratories and expanding dangerous weapons programs,” said Jerry Mark, executive director of the association. “At the same time, we must not allow the next round of climate protests to be marked by the denial of fundamental human rights.”The decision has forced a change of plans for many of the major grantmakers. “We’re not going to be surprised if things start moving again,” said Barbara Carhart, the executive director of the Association of Museums and Collections. “It’s just a matter of when.”Carhart described the future of climate justice as one of “continuity.” “I’m hopeful,” she said. “", "The next Biennial should examine the legacy of the American artist and not the other way around,” said Blakely. “The next Biennial will be a reflection of America and how we are made,” she added. Blakely’s announcement was made during the Fifty-Ninth Venice Biennale, which kicked off in Marrakech, Morocco, in June.The 2020 biennial will be curated by Bradley Marks. The Los Angeles–based artist will represent the United States at the Venice Architecture Biennale in 2021.\n\n\nThe British artist and educator Chris Packer, whose work depicted the human condition through a combination of practicality and radical philosophical thought, has died. He was eighty-two years old.Packer’s 1959 exhibition “On the Nature of Things” was selected to open the first exhibition at the Museum of Modern Art in New York, the Museum of Modern Art, and the Miami Museum of Art in 2008, and his work has been included in the collections of the Metropolitan Museum of Art, the Museum of Contemporary Art, Los Angeles, and the Whitney Museum of American Art. He was also a cofounder of the experimental art collective Nude Action, which debuted in 1958,", "The next Biennial should take place in late July or early August. “I’ve been a fan of Doug’s work since the first Artforum interview,” said Brian Cox, editor in chief of Artforum. “He’s always been a thoughtful listener, willing to help guide artists through challenging times when they felt most vulnerable.”After graduating from the school of music at the University of Rochester in 2015, Doug moved to New York to study with Manuela and Erick Almeida at the NYU School of Arts. He returned to the university in 2017 to study with Manuela, and she embarked on a successful five-year tenure at the school. In 2018, Doug became a Fulbright scholar-in-residence at the school. Ronald Reagan, the dean of the school, said: “Doug is an extraordinary musician with a remarkable range and a talent for articulating ideas in a way that is original and at the same time provocative and thoughtful. His musicianship and his writing style are at the core of creating a show of power and beauty that is otherwise lacking in contemporary art. His art is the lifeblood of the University, so I’m excited to see where it", "The next Biennial should be held in 2022.\n\nThe artist-run organization Creative Alliance, which operates a network of artist-run collectives in New York, Berlin, and London, has called off its inaugural exhibition “Nostalgia: Art in the Age of Art” due to the current pandemic. The exhibition was set to kick off at the Shondaland headquarters in London on September 20.The organization’s board chair, Nicola Dennis, said: “We are all immensely grateful for the support of our staff and community, and the great work the exhibition has achieved. However, the exhibition was not intended to be a platform for political action and sectarian violence. We hope that this show will open our minds and hearts to the work of future artists, and provide a good example for how we can be creative and personal in our relationships with others and with the world.”The organization announced in a statement on September 14 that it was postponing the biennial in an effort to “avoid disrupting or undermining the work of the exhibition.” The statement continued: “The exhibition will be on view in the Shondaland galleries in London from September 16 to October 21, 2022. The exhibition will be curated", "The next Biennial should focus on qualitative research, the exhibition of works that deal with different social issues in a non-violent way, and create a beautiful platform for artists.”The last Biennial was in 2019, when sixty-six artists, including Adrian Piper, Filippo Totti, Michelle Laudel, and Nari Ward, converged in Rome to create a work for the exhibition “Ambiente Nudeo” (Untouchable). The project, titled “Ci autori destina” (At Home in the Real), was given a retrospective at the Dalla Lana Art Museum in Venice in 2018.\n\n\nThe Museum of Fine Arts (MA) in Boston has appointed Vivek Murthy as its next executive director. Murthy arrives at the museum from the Boston-based organization Gateway Open Studios, where he has served as director since 2015. He succeeds Matthew Aycock, who retired in March 2019 after twenty-five years at the helm of the museum.“Vivek brings a long history of successful leadership and a stellar international network built on authenticity, innovation, and for-profit engagement to MA,” said museum director Christopher Doyle. “As MA’s longest-serving", "The next Biennial should take place in 2020.\n\n\nThe Musée d’Art Contemporain (MECA) in Paris is planning to begin a major renovation of its building on the Boulevard Voltaire in the city, which was recently transformed into a museum devoted to the collection of modern and contemporary art. The renovation is part of a $19 million overhaul of the museum’s collection, which includes works dating back to 1915, and will address issues such as the exhibition space’s current location and the museum’s current exhibition format.The project will include the relocation of the museum’s holdings and the construction of a new half-hour slot-free space for art exhibitions, a new gallery for special projects, and the refurbishment of the building’s principal entrance. MECA is also collaborating with the Musée d’Art Contemporain to create a special exhibition on the Renaissance, an initiative that will kick off with a presentation of work by Pierre-Auguste Bouguereau at the institution in November 2020.“With this new partnership, we are able to present more contemporary works in a different way,” said MECA director Christine Gratz. “This is an exciting new chapter", "The next Biennial should be held at the earliest opportunity. I hope that it will be on the 7th of March. The exhibition is not a complete solution for the problem of the destruction of art, but will serve to develop a new one. It is my intention to begin work on the exhibition in March. The exhibition will be open to the public from March 7th to March 14th. It will be organized in the same way as the exhibition of the museum. The circulation of the work will be led by a commission. In order to give the public a good idea of what we will do in the exhibition, a number of letters will be published in the next issue of the magazine. In the meantime, the museum will keep its doors closed, until the exhibition is completed.”\n\n\nThe museum’s collection of more than sixty thousand photographs, prints, and paintings, dating from the nineteenth to the twentieth century, has announced that it is planning to open an online version of the institution, the Digital Gallery. The initiative was inspired by the upcoming twenty-fifth edition of the Ateneo Art Museum, which is currently underway in Tokyo.In December 2019, the museum opened the Digital Gallery, which is located in the Atene", "The next Biennial should be held in 2019, but it is not expected that the eleventh will go ahead.\n\n\nThe Guggenheim Museum in New York, which announced on August 25 that it would temporarily close to prevent the spread of Covid-19, has received a gift of forty-five paintings by the artist Henri Rousseau. The works are from the “Apostle” series, which was completed in 1903 and drawn in a style reminiscent of that of Robert Frank. The donation of the works was made by the estate of the late artist, who passed away in 2004, and came after the museum informed the American Civil Liberties Union (ACLU) of New York that it plans to permanently close its Gallery of Modernization, which is adjacent to the museum and is scheduled to reopen in 2021.The museum has been working on a long-term plan to shut down the building since 2013, when the institution moved its headquarters from Midtown Manhattan to the former site of the New York Public Library. The museum has since faced numerous setbacks, including a lawsuit by the estate of the late artist who wanted the museum preserved and the efforts of New York City Mayor Bill de Blasio to pass a $1.2 billion tax abat", "The next Biennial should be held in 2020. The exhibition will be hosted by the Tübinghaus in the Tübinghaus in the city of Tübinghaus (Tübinghaus now has a new location in the city of Tübinghaus, the Tübinghaus in the city of Tübinghaus, the Tübinghaus in the City of Tübinghaus) on the ground floor of the University of Potsdamer Straße (UP). In 2020, the biennial will be organized by the UP’s Research Center for Contemporary Art and the university’s department of education. The biennial will be a combination of public and private activities, in which works will be exhibited in the city of Tübinghaus, in the Tübinghaus, in the university, and in the public museums.The initiative is part of the project “Equality Now: Art and the Political Struggle in the Twenty-first Century.” The project was initiated with an invitation from the renowned German artist Martin Luther King, Jr. and was motivated by his belief that there is no such thing as equality under the law. He explained that the issue of separation of church and state cannot be settled by means of", "The next Biennial should be held sometime in 2020.While the first edition of the event, curated by artist and curator Ariana Cone, opened in Los Angeles in May 2018, it was canceled over the course of twenty weeks, from March 13 to March 16. It re-opened in Los Angeles in June, but only with some alterations, and only for a limited number of artists, and was canceled again in September. The second edition, curated by David Cage, was held in New York City in October, and the third and fourth editions were held in New York, New York, and London.\n\n\nIsraeli authorities have arrested a Palestinian man who they say threw a Molotov cocktail into a demonstration against Israeli policies in Jerusalem on Monday, injuring at least twenty-six people. According to the Times of Israel, the twenty-six people who were injured are in critical but stable conditions. The twenty-five-year-old man who was arrested on suspicion of attempted murder was released on Tuesday after he allegedly gave a statement to the Shin Bet security service and was not charged.Following the incident, the Israeli government announced it would begin deporting Palestinians who were detained without charges. The move follows several violent clashes between Palestinians and Israeli forces that have taken place since", "The next Biennial should be held in 2021. “We hope that the sculpture will take the form of an expression of our humanity,” said Miyazaki. The artist, who was commissioned by the museum, created the work from drawings he had drawn from the life of Harald and Elin Kiehl, a German Jewish family fleeing the Nazis. The Kiehl family relocated to Switzerland in the 1940s, but their art was often displayed at the institution.The museum also received a gift of twenty-four works by Germany’s artistess Valentina Zangrillo. The first works were recently restored and made available for the public for the first time in the museum’s history. Earlier this year, the museum acquired the works from the late American collector and collector-turned-philanthropist Eleanor Fliegel, who passed away in 2011. While the museum is no longer using the Kiehl paintings, the Kiehl collection has been relocated to the SculptureCenter in New York. The institution will open a new exhibition of her work in the fall of 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in New York has appointed Theodoros Apostolopoulos as its next president and", "The next Biennial should be held in 2020. We are already working hard to re-enter the official official exhibition calendar, and to extend the programme by five years to 2025. The forthcoming art biennial will be organized in the same spirit of the 2020 exhibition, and it will feature the largest and most original works of contemporary art, which will be presented by more than forty artists. The biennial will be held at least once every three years and will be open to the public for free. The 2021 event will be held at least once every two years and will be open to the public for free. For the 2021 edition, Pape and Kaspety-Koppe will present a selection of contemporary art from the Helsinki art scene.The full list of participating artists is as follows:1. Yuki Kamiya2. 3. 4. 5. Eli Parai , “Amber Waves” - Live Performance Collections, Helsinki, Finland (2018)7. 7. 8. 9. 10. 11. 12. 14. 16. 17.Sidney York, Live Performance Collections, Helsinki, Finland (2018)12. 14.", "The next Biennial should take place in March 2020.\n\n\nThe Museum of Contemporary Art (MCA) in New York has announced that it will open two new Asian art museum branches directly in the city, the Asian Art Museum (AAM) and the Asian Art Museum (AAM2). The new institutions will be inaugurated in the city’s Chinatown and will be joined by the Chinatown Arts & Culture District (CAC), a newly opened arts complex.Museum director Christopher Knight said: “The Asian Art Museum (AAM) will play a central role in the city’s resurgence. It will offer an international exhibition of contemporary art, a contemporary community experience and an intimate view of New York’s Chinatown. The Asian Art Museum (AAM2) will celebrate contemporary art by showcasing both new and established works from the region. We look forward to the opening of the new AAM and the Asian Art Museum.”\n\n\nA group of artists in New York City are protesting the city’s Department of Cultural Affairs over the treatment of a group of migrant farmworkers who were held at gunpoint by New York state troopers last month, reports the Art Newspaper. The incident occurred on March 16, when the men", "The next Biennial should be held at Cultural Capital’s new home in the Arts and Culture Quarter, which is slated to open in the “Grand Avenue” of the Museum of Modern Art in Manhattan, in 2021. The 2019 edition, entitled “Tit for Tat,” was staged by State Street Pictures and the artist-run movement space the Obelisk, with contributions from P.A.I.N. and KISS, among others.\n\n\nPace’s Michael Avenelle and the Harvard Art Museums (HAMP) have launched an initiative to help local communities address climate change by supporting the work of climate scientists and environmental activists. In partnership with the U.S. Climate Action Network, which runs the Climate Impact Indicators program, and the Massachusetts-based nonprofit the Piedmont Institute for Climate Impact Research (PIAC), which advocates for action on climate change, the arts organizations have collaborated to create “The Climate Pledge.” Pace began the initiative, which aims to raise $1.2 billion to address climate change by 2050, in partnership with the Rockefeller Brothers Fund, formerly the Rockefeller Brothers Alumni Fund, in April 2019. The next iteration of", "The next Biennial should be held in the spring of 2021, and the project should be completed by the end of the year. \n“They’ve taken a long way, and we’re not going to let them take another step,” said Jack Ma, president of the Biennials, in a statement. “We’re going to fight back, we’re going to be better than this, and we’ll win. And we’ll win big.”In a statement provided to Artnet, Ma said: “The upcoming exhibition will explore the history of Indigenous art in Canada and will explore the ways in which Indigenous artists have been impacted by changes in the global economy, social justice movements, and political agendas.”He continued: “The exhibition will also consider the ways in which Canada’s art museums and galleries have been historically and structurally marginalized. We will explore how art is broadly accessible, inexpensive, and culturally relevant today. We are not going away anytime soon.”Ma also hinted that the forthcoming exhibition might alter the subject matter in a way that may change the theme of the biennial. “The next edition of the Biennial", "The next Biennial should be in 2022. “If it can happen this year, it can happen next year,” said Anneke Papp, the Danish chair of the exhibition and director of Copenhagen Contemporary Art, to the Art Newspaper. “It is an amazing achievement to reach the 100th anniversary of the Biennale in Berlin, and the first time it has been held here in Dusseldorf. I’m very happy to be able to contribute to this,” Papp said. * The Danish pavilion will be joined by American artists such as Alex Katz, Alex Reich, and Terence Trent Jones, and Swedish artists Berit Lissoni and Olof Nansen.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Sarah Christoulas as its new board president. Christoulas comes to the institution from the Metropolitan Museum of Art in New York, where she has served as interim director for the past two years. During her tenure at the museum, she helped shape the museum’s exhibitions and education programs and oversaw the acquisition and restoration of works by artists such as Dionne Gish, Marlene Dietrich, and David K. Paulides.“", "The next Biennial should focus on “The Dune”–an early model of what would become the Grand Design, the sprawling, grass-covered, glass-enclosed, sand-filled, glass-enclosed palace of Neferal, one of the first Islamic states in Arabia. The theme of the forthcoming exhibition is “Weather and Motion: Deja Vu,” and the exhibition is expected to open in 2022.\n\n\nThe Los Angeles County Museum of Art (LACMA), the Museum of Contemporary Art Los Angeles (LA MoCA), and the Los Angeles County Museum of Art (LACMA) have announced that Maren Adler has been appointed as the museum’s next director. Adler currently serves as director of the San Diego Museum of Art (SDSCO), where she oversees various projects and initiatives to promote contemporary art, including the installation of “Sidney & Ness” (2017) and “Pale Blue Pearl” (2018), and has led the San Diego Museum of Art since 2011. She succeeds Larry Gagosian, who will become the museum’s next director after he retires in January of 2022.“Tina Adler’s leadership", "The next Biennial should be held in the city in 2021. \n The twentieth edition of the Biennial, which was held in the heart of the city in the city of Barcelona from February 24 to March 16, 2019, has confirmed the twenty-six artists whose works will be presented in the exhibition. Will Szeemann, Klaus Schirmer, Trevor Paglen, Enrico Mignini, and Jörg Schäfer will share the stage with work by Naguib Mahfou and Nari Ward. The 2019 edition of the exhibition, entitled “The City of Life and Death,” was held in partnership with the Barcelona Architecture Club, and was held at the Peiks Museum in Barcelona and the Gran Canaria Cultural Center in Madrid.\n\n\nThe Yuz Museum in Düsseldorf—which opened in 1987 and is currently closed due to the Covid-19 pandemic—has been awarded a new $180,000 grant from the Deutsche Bank Foundation. The grant, which will support the museum’s plan to improve its security system, will allow it to improve the security of more than 1,700 pieces by 150 artists. “The Yuz Museum is currently", "The next Biennial should investigate how art forms and the practice of art have affected and influenced the political and social practices of the twentieth century, and in the process of embodying a genuine and enduring engagement with the world around us.”\n\n\nThe Sherwood and Balmain Museum in the UK is planning to close its doors for a period of twenty-two weeks to allow more than sixty galleries to reopen. The closure is part of a wider restructuring of the museum that will focus on “cultural reuse and the management of critical historical collections,” according to the New Art Newspaper. The Sherwood and Balmain Art Gallery, which has three primary locations in the city of Hull and in the peninsula town of Wathingdon, will not be closed during the hiatus. The restructuring will see the Sherwood and Balmain Museum, which recently had its exhibition “The Glass House,” relocated to a new three-acre site in the city. The dismantling of the museum and the refurbishment of the Sherwood Gallery will begin in the autumn.While the renovation of the museum—which underwent a $120 million expansion and renovation in 2018 and re-opened in 2019—has been temporarily halted due to Covid-19, the Sherwood and Bal", "The next Biennial should draw from the collections of institutions with a history of collaboration, including the Museum of Contemporary Art and the Museum of Modern Art. The first exhibition should be a short-form work on the experience of living around the earth, and the second a work on climate change. Artforum will have more on these exhibitions and other themes at the upcoming exhibition, Artforum: Climate, which opens March 13, at the Art Gallery London.\n\n\nThe Museum of Modern Art (MoMA) in New York has announced that its collection will receive a significant facelift in 2020 that will include the installation of a new sculpture garden at the institution. \"By breaking from the traditional model of a museum as a collection center, MoMA will create a more dynamic experience for visiting visitors to the collection, with additional programming that reflects the museum’s ongoing interest in sustainability and how the collection can be transformed in future years,\" said Mark Lubell, the institution’s director and chief curator. “In addition, as part of the redesign, the collection will expand with new works by artists and collections that reflect the growth of MoMA as a cultural space, rather than an extension of it.”The biennial, Artforum", "The next Biennial should be the last, and should serve as a time to reflect on the period of our lives that has sustained us and informed us, recalled our past and present and prepare for the future. It should be a reflection of our world at this moment.\n\n\nThe New Orleans Museum of Art (NOLA) has received a gift of twenty-five African American artworks from the Museum of Modern Art (MoMA) in New York. The works, which mark the twenty-fifth anniversary of the institution, are all from the Black Arts Alliance, a network of artists and collectors in New Orleans led by the late artist Prince Tawana Mabaso. Among the works that have recently entered the collection are Wangechi Mutu’s Body and Soul, 1994, an American Painting comprised of seven paintings by Nolanda Hauschka, which are currently on display in the exhibition “NOLA: The Black Arts Alliance” (2017–18), and the work of Hans-Ulrich Seewald, a Dutch painter who worked in the African diaspora, which is currently on display in the exhibition “NOLA: Black Paintings” (2013).“These works", "The next Biennial should assess the cultural and social impacts of the pandemic in the Philippines, and should be held in the first quarter of 2021.  The exhibition will include works by major Filipino artists, including Dorian Sison, Javide Giann, and , and will also include a documentary and a virtual reality work by the artist Santiago Villar.\n\n\nThe Museum of Contemporary Art (MoCA) in Atlanta has temporarily closed its doors to the public for a period of fifteen days to allow employees to restructure their schedules to better accomodate the ongoing coronavirus outbreak. The museum, which recently laid off more than one hundred employees after it closed earlier this month, had previously laid off or reduced the hours of hundreds of other employees in an attempt to mitigate the virus’s spread.An internal memo sent to staff on Monday stated that “[T]he path ahead is challenging and uncertain, but we as an institution must manage and adapt to this crisis in harmony with our values and our mission, which is to provide a free and open public space for visitors to the Museum of Contemporary Art Atlanta.”The opening of the museum will be delayed by five weeks as the institution conducts a “health check”", "The next Biennial should be held in 2021. \n\nThe Metropolitan Museum of Art, the Museum of Modern Art, and the Whitney Museum of American Art are among the major U.S. arts institutions that have announced they are preparing to welcome visitors from the Middle East and Africa in 2021. The institutions are urging the public to remain vigilant and plan ahead for possible disruptions due to the coronavirus; however, there is currently no known link between the coronavirus and any known illness.In an email sent to participants on Sunday, March 5, the Met said: “We recognize that this is an unprecedented time for everyone and that the safety and well-being of our staff and visitors is of paramount importance. We are working hard to understand and engage with our audience, and our artists, in order to have the show as close as possible. However, the show will not be possible without the dedicated work of our artists and curators and their teams.”The authors of the letter, which were signed by Lisa Levin, Whitney Museum of American Art director of contemporary art; Carol King, director of the Whitney Museum of American Art, New York; and William Schaeffer, the director and CEO of the Freie Galerie; said that", "The next Biennial should be held in 2022.\"\n\n\nThe National Gallery in London will reopen on August 17 after a $500 million expansion, dubbed the Exhibition Place, which was completed in 2017 and transformed the museum into an edifice home to more than 1,000 works. The new exhibition spaces will be inaugurated with a National Poetry Slam, a series of readings that will feature contemporary poetry from around the globe, and will draw from more than 3,000 sources to create a new exhibition, “The Year of Nothing.” The National Poetry Slam will be followed by “The Year of Events,” a series of interviews with poets and thinkers in an effort to address concepts of the year, including “The Year of the Dog,” former museum director Osman Khan, and the French philosopher Georges Bataille (who wrote about the poet’s decision to give up poetry for a more personal kind of work in a 2017 interview with the New Yorker).In a bid to engage with the lives and works of different cultural creators, the National Gallery will launch a £500 prize for poetry and a new £125,000 National Poetry Slam, with prizes for fiction and nonfiction. International painting and sculpture will also", "The next Biennial should be held in 2021.\n\n\nThe IDC Berlin, which has long been plagued by financial troubles and political instability, is now being reconfigured into one that will attract more visitors from outside the country. The German city hall announced on Wednesday that it is working with the Municipality of Württemberg to create a new exhibition space for the public. The change will allow the museum to increase its exhibition capacity by 11 percent and increase the number of visitors it can seat. The plan is part of a major overhaul of the city’s cultural landscape, which will be unveiled in December.“Ishigami University, which has been under construction since 2012, will now present the new exhibition as part of the IWF’s reconstruction project,” the institution’s director, Dieter Förg on Tuesday. The site of the former factory, which has been transformed into an artist’s residence and a public gathering space, is currently being renovated by the German ministry of culture.The renovation of the city’s cultural center was completed in 2016. The city council had agreed to repay the debt incurred by the state in the form of a 30-year lease when it purchased the property for $", "The next Biennial should be this March, when it will be staged at the Museum of Contemporary Art (MoCA), New York.\n\n\nThe London-based arts organization the National Poetry Library (NPL) will offer free access to over one thousand of its works online for a limited time this April. “The National Poetry Library is a national treasure, a wonderful home for the most important poets and their works, a place where you can find the most interesting poetry-books, and a great source of free text and audiobooks,” Leon Waddington, chairman of the NPL, said in a statement.NPL works include a selection of forty collections organized by decade, a selection of contemporary poetry, and two by artist-in-residence. The works are currently on view in the National Poetry Festival at the National Poetry Library in London.NPL director Rob Harris said: “We are so pleased to be able to invite you to join us for a day-long digital event at National Poetry Library, on April 3, for the first online viewing of twenty-two of these works by the very best American poets. The National Poetry Library is already one of the most popular and widely used", "The next Biennial should take place in the United States, and will be hosted by a US-based organization, the Wyss Institute for Biennial Studies. The final selection will be curated by David K. Galloway.The ten artists who were previously selected for the fifteenth edition of the exhibition are:Dario Catellani (Italy), Mihai Catellani (Italy), Adrien Brody (France), David Günther Böhm (Germany), Robert Ross (USA), Mary Jo Kopechow (Germany), Herman Malzahn (Germany), Paris Rind (France), and Frank Ochs (Germany), all of whom have been featured in Biennales before. The thirteen artists who were previously selected for the thirteenth edition are:Hiroshima Arata (Japan), Yoshihiro Takeda (Japan), Makiko Takemoto (Japan), Yoshiko Yamazaki (Japan), and Takuya Yamazaki (Japan), all of whom have been featured in Biennales prior. The fourteen artists who were previously selected for the thirteenth edition are:Gail and Harry Kalm (Australia), Edoardo Lagnado (Italy), Leo Roesler (Germany), Dr. R", "The next Biennial should take place in 2022. \n\n\nCreative Time, a London-based nonprofit dedicated to supporting underrecognized artists in the UK, has launched the GiveDirectly Rewards program. The initiative, which aims to raise $2.5 million for artists working in the UK, will reward those who donate $1,000 through the organization’s online art auctions. The money will be donated to an artist’s grant fund that will help them with their future expenses.“We are delighted to continue our work for artists by providing them with a new and unique tool built to support their work,” said Mary Crewe, director of Creative Time. “We are using GiveDirectly’s unique system to help fund an underfunded and underrecognized creative sector, and we hope that this unique funding tool can be a model for how we can support artists.”The organization said that it will give $1,000 directly to any artist who would like to receive a monetary reward. The organization will also give $500 to ten artists and ten charities that are working together to support artists. The organizations will be reviewing applications by artists every four weeks for a period of six months. The deadline for", "The next Biennial should focus on the history of the sculpture-making process. The exhibition should explore the impact of the museum’s new partnership with the private art museum Taji-Allegro on the development of the biennial’s collection, exhibitions, and exhibition, and should consider the possibility of reopening the exhibition if necessary. The exhibition should also consider the possibility of reopening the biennial after the 2020 iteration of the festival, if necessary, in order to facilitate the work of the curators in fostering the exhibition.The next Biennial of Modern Art will be held at Rockefeller Center in New York from February 15 to February 17, 2021. A selection of works by twenty-two artists from the twenty-third to the twenty-fourth centuries will be presented, as well as a collection of works that were created between 1700 and 1850, which will be reorganized in a way that allows the participating artists to have a greater degree of freedom in their exhibition. The exhibition will include works by artists who are active participants in the biennial and will be organized around the themes of education, art, technology, and the environment, as well as the exhibition of their exhibition at the museum.\n\n\nA member of the Saudi royal family has been arrested", "The next Biennial should be in 2021. \n\n\nThe Barbican Art Museum London, which is in the midst of a major expansion that promises to introduce new and exciting works by leading contemporary artists such as Rebecca Black, Judith Butler, and Mark Bonham, has appointed Barbara Bass as its new chief executive. Bass will take the helm from Anne-Marie Taylor, who will retire in June. She succeeds Simon Fox, who had led the museum for more than twenty years, and will take up the post on April 1. \n\n\nThe Agricultural Museum in Copenhagen, the København Museum, and the København Arts Center will be transformed into the Danish National Museum. The Danish National Museum will be inaugurated on July 1, 2020, and will be housed in the København Museum for twenty years. Its predecessor, the København Art Center, opened in 2019; the København Museum opened in 2002.  The København Arts Center, located in the redoubt of the København District, is expected to contribute around twenty thousand works to the museum’s collection. The København Museum will", "The next Biennial should take place in 2021—Prioritize the Future will host the inaugural event in 2021. \n\n\nThe South Korean Ministry of Culture has released the list of fifty-two artists that will participate in this year’s Dokdo Biennale, which will take place from March to July in 2020. The twenty-sixth edition of the exhibition will be held at the Soham Museum in Seoul from August 25 to August 29. The participants will include Park Bo-kyung, Kim Soo-sung, and Kim Eun-sung; Kim Eun-sung was selected for his work North Sky, 2014, which he describes as “a narrative of a man and a woman traveling through the cosmos.”According to the Korea Herald, the upcoming event will be curated by Bong Min-kyung, head of the exhibition department at the Soham Museum, and will feature ninety-two works by forty-six Korean artists. The artists who will be granted the right to stage the event are Choi Cheol-kyung, Park Jinyung, Kim Eun-sung, Kim Ha-kyung, Kim Eun-sung, Kim Yoon-sung, Lee", "The next Biennial should hopefully be in 2021, but we will see. The address of the Museum for Contemporary Art (MCA) is currently being considered. The institution has a long-term vision for a new building and a long-term plan that reflects its long-term commitment to the community. We are actively evaluating the best ways to serve the local community and will make further comment in the near future.”As of July 1, the museum’s holdings of Central and South Asian art were heavily digitized and become publicly accessible. Since the museum, which is situated on a 160,000-square-foot campus, has yet to announce any plans to open a branch in India, the museum has therefore been able to preserve the collections for posterity.“Isozawa and [Rolf] Herzog’s paintings were acquired by the MCA in 1891, and by the MCA in 1967,” said Masrani. “The MCA also owns three works by the same artist, Nandita Amrita, in their private collections. The MCA does not own these works, however, and can only show the MCA's collection. ”The institution has recently been", "The next Biennial should be held at the Uffizi in Florence, Italy, in 2021.\n\n\nThe Eagles Museum in New York City and the Fashion Institute of Technology in Cambridge, Massachusetts, have collaborated on a new exhibition about the artist’s life and work. The exhibition, “The Rediscovery of Art: ‘Bridget Kelly, 1966–1975” will open on February 21 and run through March 15. The exhibition will also feature a new work by the artist, titled The Tree of Life. Kelly, whose work was appropriated by the institution in the 1980s, has died since 2007.Born in New York City in 1966, Kelly was raised in Cambridge and went to school in the city. She was drawn to gray-toned urban environments and the deconstruction of art and architecture. She studied with sculptors such as Charles A. Birnbaum, Joseph A. Topor and Stanley Mott. Kelly’s work was featured in more than a dozen major exhibitions at the Museum of Modern Art, the Hammer Museum, the New Museum, the Metropolitan Museum of Art, the National Gallery of Art, and the Whitney Museum of American Art. She also appeared in film.“Bridget Kelly was", "The next Biennial should take place in the fall of 2021. The inaugural exhibition, “The Bridge,” will be held at the Guggenheim Museum in New York from September 17 to September 19. Expect an international cast of artists, including Diya Ghose, Matti Marini, and Manal Elsayed.The Biennial will also include a presentation of works by artists whose work has been included in the Biennial in the past such as Derek and Janet Bowie, the first artist to receive the award in 1994, and Sunil Gupta, a Pakistani photographer who won a prize in 2003. The show will be followed by a lecture series titled “The Architecture of Motion” and a book launch.\n\n\nGerman artist Peter Dreher, an influential member of the Frankfurt School who became the center of attention for his experimental artworks as they were born out of his apartment in 1977, has died at age eighty-one. He was created the same year as Hieronymus Bosch, who opened the door of his studio and began a process of rearranging the pieces in his living room across the course of the next year.The artist's work has been covered by numerous exhibitions, including at the First International Berlin", "The next Biennial should be held at a location that is accessible to the public throughout the year. Currently, the Art of Handicraft is housed in a former factory in the city of Cambridge, Massachusetts, and will be returning to the campus of MIT in 2021.\n\n\nThe 2018 edition of the Biennale d'Art Contemporain (BAC), curated by a group of French artists led by Emmanuel Bourdin, was cancelled due to the coronavirus. The show was scheduled for March 29–March 31. The institution announced the cancellation on its website, in a statement that explained: “We are not able to present this year’s edition at the hotel where it will take place. The decision to cancel the exhibition was made independently of the organisers of the exhibition and has nothing to do with the global health crisis.”Other artists who will not be participating in this year’s event are Emmanuel Léger, Michel Houellebecq, Ulrike Lunacek, and Louise-Laurent Léger, who will be collaborating with artists such as Christian Kranz, Alexander Malm, and Samantha Schorr in the exhibition’s “Future Present", "The next Biennial should include a review of the aesthetic and intellectual possibilities open to contemporary art. \n\nThe Kaufmann Foundation, which has supported the art of the nineteenth century in various ways, is partnering with the Metropolitan Museum of Art in New York to bring a new retrospective of work by the French avant-garde artist René Magritte. The show, titled the “Falsetty of the Body,” will open at the museum on November 17.“The Kaufmann Foundation has been invited to organize a special exhibition of works by René Magritte in the United States for several years,” said David G. Kaufmann, the foundation’s president and CEO. “The contemporary art world and the museum landscape is in a transition period and the Kaufmann Foundation is eager to play a role in facilitating the visual and textual experience of those times. We hope the show will inspire.”In addition to the foundation’s work with museums, it is offering a free exhibition of works by twenty-five artists, curated by Davey, in partnership with the Pershing Square Gallery in London, in February 2020. The show will run until December 21.\n\n\nThe National", "The next Biennial should be staged soon in the city, where the exhibition will take place in the tower of the city, the São Paulo Conspirália. A new series of exhibitions, a lecture series, and a new film by the Brazilian curator and filmmaker Luiz Felipe has been added to the list of programming.The exhibition will be the first of its kind in Brazil and will present thirty works by twenty-one artists, including Vladimir Kramnik, A.J. Alessi, A.P. Paolo Baili, and Renata Prância. Curated by João Pires, the artist and curator of the Lisbon Biennial, a new collaborative exhibition will also open at the São Paulo Conspirália in December 2020. The exhibition is sponsored by the São Paulo State University of the Arts (PASA), the national university of art. Commenting on the biennial, PASA president Amaral Losada said: “Brazil is ready to open its art archives, its libraries, and its archives to the world, and this is a critical moment for our country. André Althaus, the president of Brazil, has given his approval for the new exhibition. I am very confident", "The next Biennial should be held in 2020.\n\n\nThe European Union is urging India to release more than one million prisoners across its territories as the international community attempts to contain the coronavirus. In a new set of guidelines issued on Monday, the EU states urged India to do more to reduce the spread of the virus, such as training its police and military to better fight the virus, and said that the government must implement emergency policies to mitigate the threat to public health in the country.“The EU is calling for a swift and targeted response from the state of India, which must ensure the health and wellbeing of its citizens and ensure a rapid and robust evaluation of the situation,” said EU foreign policy chief Federica Mogherini. “Once the situation in India stabilizes, the EU will work with India and our partners to support the social and economic recovery in India and to help ensure the universal access of cultural and historic sites. The response to the coronavirus must therefore be a response to the global challenges we face, not a second round of mass incarceration.”The guidelines—which were drafted by Mogherini and commissioned by the Indian government—address the latest recommendations by the UN Special Envoy, Catherine O’Connell,", "The next Biennial should take place in 2020.\n\n\nNew York’s Metropolitan Museum of Art (MMA), which has been under construction since 2010, will unveil its new six-acre stage for the next iteration of the Whitney Biennial on Saturday, May 5. The exhibition, titled “Lush,” will feature works by seventy-three contemporary artists, including Kiki Smith, Apathi Rind, and Richy Ng'uai, and will run until June 7.Besides the exhibition, the museum will also unveil an expanded touring program and a new nonprofit, the New York-based nonprofit Art Invest New York, which will offer free admission to the biennial. The organization will have two sections: The first will focus on individual artists and the second will be a “world tour of the museum.” The new program will feature forty-five works by artists from twenty-eight countries, and will run until June 27.Each artist will receive $25,000 for their projects, and the full list of participating artists can be found on the museum’s website.\n\n\nThe Nile Museum in Cairo has appointed Victor Moses, who has served as the director of the museum for the last five years, as its", "The next Biennial should be held in 2020. Its next edition, which will also feature a retrospective of the artist’s work and a selection of selected biennial photographs, will be held in 2021. The twenty-third edition of the award will be staged in 2022.\n\n\nA group of British artists has won the Pulitzer Prize for their work on the proposed reopening of Britain’s national art galleries, which were shuttered due to the coronavirus pandemic because of the country’s dissolution into two political entities, the United Kingdom and the European Union. The 2019 prize was awarded to art historian Jo Brand, art historian David McAllister, and artist Larry Aitken for their research into the proposed reopening of the Tate Liverpool, the National Portrait Gallery, and the National Gallery Birmingham.  The 2019 winners will be announced in a ceremony at the National Portrait Gallery on Tuesday, March 14. The deadline for nominations for the 2020 Pulitzer Prize is March 23. The deadline for the 2019 prize is March 26.\n\n\nThe Metropolitan Museum of Art and the Whitney Museum of American Art in New York have become the latest cultural institutions to offer free admission to visitors with pre-paid cards. The institutions announced today that", "The next Biennial should be held in 2021. The art of art, a documentary, will be presented by the Swiss curator and curator-designer Martin Köppelmann, who is also the founder and director of STI, in association with the Museum of Fine Arts, Zurich. Museum director Urs Lüpertz, who was unanimously elected in 2018, said: “The new twelve-year cycle is about to begin, and for us artists and curators it is a critical step to reach a new audience. By inserting the medium of the exhibition into the cultural landscape, the Biennale is providing an opportunity to imagine and improve our own work and the future of art.”The budget for the 2019 event was US$3.7 million. Köppelmann, who has been working on creating a new kind of sculpture for the exhibition since 2009, said: “I am enormously gratified to have been chosen as the next Biennial Director. I look forward to working with the team of curators, artists, staff, and the audience.”\n\n\nThe Ulm-based concept studio Hotter, which pioneered the use of large-scale installation and performance art within the city of Grand", "The next Biennial should be held in March 2020 and will be curated by director Ulla and David Haber. It will take place at the Museo de Arte Contemporáneo in Madrid, the Museo de Tourmaline in Barcelona, the Museo de Arte de Croix-à-Ferm, and the Museo de Arte de Gran Canaria.“The partnership is very important for us, as the archaeological site will be transformed into a new exhibition held in Madrid, in the city of architectural history, in a new exhibition at the museum in Barcelona, and in future exhibitions,” Ada Colau, director of the Museo de Arte de Gran Canaria, told the Art Newspaper. “We look forward to working with Chris, his team, and the Madrid-based artists he has nurtured over the years and are grateful for the opportunity to present this work at the museum. We hope the Biennial will be an important step in the preservation and promotion of his legacy and that this year’s iteration will be a success.”In addition to the ongoing project, the curators have created a special digital catalogue of “Laura” (2016–2017) “", "The next Biennial should be held at the Museum of Modern Art in London, the National Galleries of Scotland at Edinburgh, and the National Museum of Women in the Arts in Washington, DC. Launching the biennial—originally titled “Feminine”—was a risky move for a number of reasons, including the museum’s record for promoting women and a goal of creating a new institution for the museum in an area of the country where the Biennial was not already taking place. The format of the upcoming exhibition was also controversial. The exhibition will highlight the work of thirty-eight artists and will showcase historical works by forty-eight artists, including Alice Muir, Susan Phillips, and Adrian Piper, and will also feature performances, curatorial projects, and events.The biennial will be held at the museum from February 28 to March 5, 2020.\n\n\nThe Abraham Lincoln House of Art in Lincoln, Connecticut, which is currently undergoing a $150 million expansion, is holding an exhibition of Lincoln’s recently unearthed paintings. Titled “Eternal Fire: Lincoln’s Paintings in Action” (2019), the exhibition is curated by Lance Armstrong, curator of American art at the Getty Center", "The next Biennial should begin with a discussion of the history and contemporary status of the art of the Škoda region and its history in general. In the meantime, the P-41 Museum will present a show of works that explore the history of the P-51s, the Red Army in the Pacific, and the museum’s collection. The exhibition “HELMUT 1: THE RED HORSE,” will be on view until July 22.\n\n\n\n\n\nMuseum of Contemporary Art Paris has announced its artistic strategy for the 2020 edition of the Biennale. The exhibition will feature works by twenty-six artists, including Fanny Loux, Marie Bonin, Alain Guiraud , and Minel Palacio, and will be inaugurated with a special exhibition titled “NIRIN. ZOOM,” which will draw from its new $60 million building on Boulevard de France, the city of Paris, and will open on January 21, 2020.Previous editions of the fair featured works by a variety of artists, including Julie Ault, Julia Carthy, Pia Camil, Gary Cardinal, and Max Beck, and were held in the run-up to the Sochi Winter Olympics in", "The next Biennial should be held in 2022, the same year the project was established.In a statement, the Art Museum Calgary said: “This is a difficult decision for us, but it is the right one. Our commitment to the arts and our staff has always been our number one priority and it is our intention to design a new venue that will continue to deepen the experience of the Museum by presenting the best contemporary art for our diverse communities.”\n\n\nThe National Galleries of Scotland (NGA) announced that it is planning to leave the European Union. The decision was made in an official statement by the institution, which has been a member of the Union since 1973. In a letter sent to Scottish parliament on Wednesday, the institution said that the decision was “not one that was taken lightly” and that “the full consideration of the matter, both in Scotland and in the United Kingdom, will now be needed before a decision is taken.”In a separate letter sent to the Scottish parliament on Thursday, the institution said that it hopes the decision “does not result in a divergence of views between the nations of Scotland and the United Kingdom.” The statement follows a series of statements made by senior UK figures as they", "The next Biennial should be held in 2021.\n\n\nThe Louisiana Museum of Art (LMA) in New Orleans has received a gift of three works by artist Tony Hinch: The Peace of Mind, 1963, a series of prints placed side by side, the same year as the original exhibition, was created in a space formerly occupied by the exhibition, and The Action of Life, 1967, the work of the artist in his studio, was created in the same space as the work in question.Hinch’s wife, Asher Hinch, also gave the institution a gift of two prints by the artist, one of them being The First Time. The artist is known for winning the Prix d’Art Moderne, the Prix d’Art Sebag, and the Prix d’Art Foch, and was nominated for the Nobel Prize in 1975 for his’s contribution to the art of French obsession. Previous works by the artist include The Abstract Expressionist, 1971, and The Microphone, 1975, which were presented at the San Francisco Museum of Art.The donation of works by Hinch to the Louisiana Museum of Art is the latest in a series of philanthropic gifts that have benefited the institution.", "The next Biennial should include a selection of works on paper and draw, with the aim of re-establishing the United Kingdom as a global leader in its arts. The exhibition, entitled “The Present,” will be hosted at the National Portrait Gallery in London until March 29.\n\n\nThe Ballet Theatre of Harlem announced today that the production of Let it Be, a new play by Javad Hage, will return to the venue for the fourth season opening on September 27. The production, which was inspired by a conversation between Hage and George Michael, is currently a selection at the Hammerstein Ballroom. The production, which was commissioned by Michael and David Nutter, will open at the Central Park Theatre on September 24, and will run until September 29. The five-person group will have a new choreographer, Mark bostwick, and a new actor in the role of Michael. Michael will be accompanied by a new music accompaniment by Quincy Brittenham.Hage, who is known for his stage performances, including ÜAmarotti/La Signa: The Return, 2011, which opened at the Barbican in London, and The", "The next Biennial should focus on “eternal justice” and other themes, the Art Newspaper reports. The announcement coincides with the opening of the exhibition “Šiyygus in uga,” which will take up the theme of “the sacrificial killing of humans, animals, and plants by the state.”The previous edition of the Biennial, held in March 2019, was titled “What is War?” and featured work by more than 1,200 artists. The exhibition was organized by the Plebiscite and the Zine Museum of Modern Art (Hong Kong).\n\n\nThe Metropolitan Museum of Art in New York has received a gift of thirty-two rare works by Balenciaga, a contemporary art historian and creator who pioneered African American art with works that questioned and questioned the concept of race. The museum also purchased the works from the artist, who immigrated to the United States from Nigeria in the 1960s and whose work is currently on display in “Balenciaga: Paintings from the African Diaspora” (2019).The museum purchased the works from the artist in 2017 as part of a larger project involving the museum and the artist’s estate. The works", "The next Biennial should be held in 2020. Some art historians and conservationists have speculated that the 2019 exhibition’s absence may have been a result of the coronavirus, which has been linked to six deaths in the United States so far and more than twenty-one cases in China. If true, the event’s absence would have coincided with the coronavirus outbreak\u0097the first pandemic-related exhibition held in Japan since Sotheby’s New York show opened on October 19. The 2019 exhibition, “Tit of a Man,” consisted of forty-four works and featured work by fifty-one artists, including Ara Arakawa, Koki Tanaka, Jiro Sasaki, and Takuya Tsuda. The exhibition was organized by the Tokyo-based arts organization TOMI (The Art of Japanese Painting), which is run by the same managing director as the Museum of Modern Art in New York and has run the TOMI exhibition since 1987.In a letter sent to the museum on August 3, TOMI director Takashi Ikeda said: “The strategy we have followed since the coronavirus outbreak has been to focus on providing a series of shows that consistently demonstrate the best", "The next Biennial should be held in 2020. The biennial is being organized by Paramount Pictures, which is owned by David and Charles Koch, and is backed by the conglomerate Philips. It is also being organized by the American Federation of Arts, which is backed by the Koch brothers. The organization is requiring that all works from the nineteen‐twentieth biennials be donated to the American Civil Liberties Union (ACLU), which is administering the $120,000 Million in grants to combat police violence in America. -Noel Brinker, Asia bureau director at the Art Newspaper, New York: “The festival is a great success, but the events of the last sixteen months have not been smooth, nor have the artists in the last few days. We regretfully added them to our roster for the last edition, and were disappointed when they did not come to New York City. We have been working hard to make our work relevant, and our artists feel included, but it was not possible with the disappearance of exhibition space and artists’ work. We will continue to support our artists, and will be proud to host them at our original space as soon as possible.”In", "The next Biennial should be held in 2021, when the institution will be celebrating its fiftieth anniversary. In a statement issued by the museum, the curator of photography, Arturo Fuentes, said: “After a long search, we selected a person who has a clear and compelling vision for what the museum can become and what it can become in a very short time. I am very excited to be leading the museum through this moment.”The biennial will have a new site design and will be housed at the newly renovated and restored National Gallery of Art in Washington, DC. The museum will reopen on December 27.\n\n\nSinger-songwriter Joan Jett, best known for her folk-pop-inflected music, has died at age eighty-nine at her home in Los Angeles. She was a pioneer of the rock-and-pop style she helped popularize in the 1970s and 1980s with her songs, whose haunting lyrics often address domesticity, motherhood, and drinking and drugs.Born in 1956 in New York City, Jett grew up surrounded by pop, her mother being a singer; her father a musician. After graduating from the Juilliard School in New York, she went on to study with other", "The next Biennial should be held in 2022. \n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Ian A.K. Porter as its next director. Porter comes to the museum from the Art of the Party Institute (API), where he serves as an associate curator of contemporary art. Previously, he worked as a curatorial assistant in the Department of Prints and Drawings at the Museum of Modern Art (MoMA). Prior to joining API, Porter was a curator at the Museum of Modern Art in New York.“I’ve been impressed by his ability to bring together disparate disciplines, including international art, to make a show for the museum that moves with the spirit of an exhibition,” said Elizabeth Bailey, the museum’s interim director of curatorial affairs. “His research and writing, combined with his editorial curatorial practices, make him ideally suited to lead the museum through a transition in style that has the potential to be transformative.”Porter’s curatorial practice spans a variety of genres, including vision and performance, and focuses on the art of spatial media. He has published numerous books on art and its spatial relations; is a frequent contributor to Artforum; and has", "The next Biennial should focus on the life and work of Paul Gauguin. “Art and the Death of Absalom and the Birth of Absalom” should be a prelude to the fourteenth, which will continue to focus on the discursive life of Vico di Sella. “The Future is Not What It Used To Be,” which may be staged in mid-March or April, should be the theme of the seventeenth event. The forty-ninth “Beyond Line Painting” will be a commemoration of the centenary of the founding of the contemporary art movement. The biennial will also focus on the legacy of the Belgian artist Claes Oldenboer, whose work is currently on display at the Graf Zeil. “Claes Oldenboer was one of the most important figures of twentieth century art,” said Christa Pape, chair of the board of trustees of the Jura Biennial. “His work is celebrated by the distinguished international artists of the Art League as a masterpiece of continuity.”\n\n\nThe Japanese artist Masahiro Mori, known for the gruesome and haunting “Spooky Reports,” which", "The next Biennial should take place in 2020. “Our current exhibition policy for the museum is to work with the artist to develop two works before the exhibition is scheduled to open,” said museum director Maria Cristina Cacciata. “The Biennial will be a new way to experience the work of these artists. The public will be able to experience the performance with the full sense of the artists’ vision and the full intention of the artist.” More information about the 2020 event can be found on the museum’s website.\n\n\nTania Bruguera, the curator and executive director of the Bruguera Contemporary Art Museum in the Dominican Republic (BAC), has announced that the institution will continue to support the work of the late Colombian artist and educator Rosa LaRosa. Through a multi-year grant program that was established in 2009, the museum has already allocated $6.5 million to support the project. LaRosa’s art has been included in the Venice Architecture Biennale twice and was regularly featured by the Italian architect Gio Ponti and the late sculptor Alberto Barbera. After a presentation of the work last year, BAC presented the gift of"]