["The next Biennial should take place in 2021, according to the artist, who has worked in Mexico City, New York, and Los Angeles.The Artist-in-Residence program will be hosted by the Museum of Modern Art and the New Museum in New York.  The first exhibition will be “The Last of Us” at the Museum of Modern Art on November 23, 2019 and will be followed by “The Emoji (Jin-sung) Lab” at the Los Angeles County Museum of Art on February 9, 2021.The second exhibition will be “Jamal Burstein: The Art of Imagination” at the Museum of Modern Art on September 24, 2020 and will be followed by “James Baldwin: The Thin Red Line” at the Brooklyn Museum, Brooklyn, on February 9, 2021.The third show will be “Janet and Robin Rasky: The Art of Travel” at the Whitney Museum of American Art on January 1, 2021 and will be followed by a presentation of photographs by the artist in his studio at the Brooklyn Museum, which are currently on view.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Alexandra C. Lewis as its new deputy", "The next Biennial should be held at least ten years after the twentieth, in the twenty-first, and in the twenty-second.”The conceptualization of the museum’s collection is depicted in the annual “Thematic Triennale”, an exhibition of twenty-five works meeting the theme of the year, which is the theme of the 2020 edition. The 2019 iteration, “Crusade,” explored the ethical implications of military action and was organized by the Hong Kong-based artist Cui Jie, who currently serves life imprisonment for her role in the Hong Kong Special Administrative Region, a region of China that includes Hong Kong, Macau, and Taiwan.Artforum has contacted the artists whose works will be featured in the 2020 edition. In the meantime, the museum is encouraging visitors to view the final exhibition of the year: “Drawn to the Future: Light and Space” during the biennial’s inaugural week. The exhibition will be on view until January 8, 2020.\n\n\nThe Solomon R. Guggenheim Museum in New York has appointed Michael Petrillo as its next director and CEO. Petrillo will be responsible for overseeing the institution’s growing collection and executive operations", "The next Biennial should open in 2022.\n\n\nThe Hunter Museum in London is planning to close its doors for a period of three years following it reopens in 2020 and will launch a new award-winning biennial of contemporary art in 2021. The program will also focus on how contemporary art can contribute to the hunting and conservation of wild life and will celebrate the emerging artists and their work.“For more than twenty years, the Hunter has been dedicated to promoting contemporary art through a mission of protecting and exhibiting the art of the twenty-first century,” said Hunter director Wolfgang Munch. “This year marks the twenty-fifth anniversary of the Hunter’s founding. We are proud to present the first exhibition dedicated to the Hunter’s founder, the late artist Richard Anuszkiewicz, who created a unique, and often radical, vision for the museum as he laid the groundwork for the gallery’s modern-day museum. The new exhibition will have an art-historical atmosphere, will showcase the work of younger artists, and will explore the Hunter’s own history. We hope that you can join us in celebrating this milestone.”Since its opening in 1997, the biennial has presented more than seventy artists", "The next Biennial should be held in 2021. \n\n\nAmerican painter Andrew Lloyd Webber has died at age eighty-two. The son of a prominent New York dealer, Webber was born in New York City in 1941. After moving to New Jersey in the early 1950s, he enrolled at the Academy of Fine Arts in New York, then the University of Pennsylvania in Philadelphia. In the 1960s, he moved with his wife and daughter to the Catskills, where he continued painting and drawing. In 1983, after a series of exhibitions at the Museum of Modern Art (MoMA), he returned to New York, where he lived briefly in the Catskills and the Hudson Valley before moving to the Catskills again in the late 1980s.Webber’s work has been collected by museums in Los Angeles, New York, and London; New York, Paris, London, Paris, New London, and Geneva; and New York, London; New York, Paris, London, Paris, New London, and Geneva; and New York, London, Paris, London, Paris, New London, and Geneva; and New York, London, Paris, London, Paris, St. Louis, and New York.\n\n\nThe Solomon R.", "The next Biennial should be held in 2019.\n\nA series of exhibitions, including a show of work by artist Karen Johnson, whose work is on view through February 12, 2021, is also slated to reopen at the Anomalies in a few years. \n\nThe Venice Architecture Biennale, which runs through May, has announced its 2020 edition, “12 s,” which will feature work by forty-eight artists representing fifty cities worldwide. The show will also feature works by artists from India, China, Egypt, France, Italy, Morocco, Greece, Portugal, and Spain.The exhibitors will be announced soon.\n\n\nThe Brooklyn Museum has placed cosigner Tom Friedman, a prolific American painter and sculptor whose many works are currently included in the collections of the Los Angeles County Museum of Art and the Metropolitan Museum of Art, among the thirty-nine artists who will return to the institution this May. Friedman, whose work explores ideas of the experimental, the transcendent, and the symbolic, will be featured in “12 s” alongside works by artists whose collections are also scheduled to reopen next month. Friedman’s works are frequently included in the collections of institutions that", "The next Biennial should be announced soon, the organizers said.\n\n\nThe Museum of Contemporary Art (MCA) in Los Angeles has appointed Tracy Drew, who previously served as director of the Los Angeles County Museum of Art (LACMA), as its next director. Drew, who will assume her new responsibilities in January 2020, succeeds Michael Govan, who retired in March after eight years at the helm of the institution.“In my tenure at LACMA, I have been committed to ensuring that the MCA is a transformative institution that continues to advance in its mission to be a cultural destination in Los Angeles County,” Drew said in a statement. “I am excited to welcome my new colleagues and to build on LACMA’s history of innovation and innovation-driven thinking through a new avatar for contemporary art.”Earlier this month, the MCA announced that it plans to create five new and expanded divisions\u0097comprising a curator, a curator of contemporary art, a curator of Asian art, a curator of the American Southwest, and a curator of African and Afro-Caribbean art. The divisions will be led by Daniel H. Pink, who will be a curator of contemporary art, a curator of Asian", "The next Biennial should take place in 2020; it already has a new site planned for 2021, and the biennial will be held in the city of São Paulo, Brazil, in 2021.\n\nThe Seventeenth Venice Architecture Biennale, which will be held in May 2021, is still on track to open this spring, with the aim of showcasing a new generation of artists and architects, and will host nearly eight thousand visitors. Organizers have announced that the exhibition will have an additional three thousand square feet of exhibition space, and are hopeful that the venue will be able to hold more than twenty thousand visitors.The exhibition, titled “5–6,” is curated by Anna-Sophie Berger, the director of the Museum of Modern Art; Andreas Breit, the chairman of the São Paulo Architecture Foundation; and Lotta Pérez, the artistic director of Artspace da Belem, São Paulo. The artists chosen for their work at the exhibition are Lirando de Almeida, Claudia de Cisnerò, Andrea Filis, Luiz Fernando Sousa, Anselm Kiefer, Andrea Porfiro, Andrea Z", "The next Biennial should be held in 2020. \n\n\nThe museum has agreed to donate the land and building currently used by the museum’s Bodog exhibition hall to a conservation organization. The institution will donate the area next to the exhibition hall next to the library to the nonprofit organization Heart of Contemporary Art (HCCA). The space will also serve as an open space for free public events and performances.“We are thrilled about the potential of this site as a permanent home for the Bodog exhibition hall,” said Museum of Contemporary Art director Elizabeth Anne Haydon. “With the Heart of Contemporary Art, we are committed to expanding the role of art and design in connecting contemporary life and art, and to promoting the arts as a viable and critical tool for social change.”The Bodog exhibition hall has been under construction since 1981. The construction of the new building and the installation of the exhibition hall was completed in 2013. The museum is currently constructing a new building to house the collection and exhibition archive.\n\n\nThe Museum of Contemporary Art (MoCA) in New York has acquired a collection of works by thirty-six artists, including the Swedish-born, Czech-born, American-born, and Hong Kong-raised", "The next Biennial should be held in the autumn. The programme will consist of lectures by twenty-four artists, including Adrien Brody, Vikramaditya Basu, and Alireza Edhi, in addition to a variety of exhibitions, including a retrospective of Malawian artist Kasey Aluija at the National Gallery of Art, in Washington, DC, and a presentation of works by Indonesian and Malaysian artists at the Wiradjuri Gallery in Mumbai.The biennial will also include an exhibition of works by contemporary artists, including Norman Kelly, Mary Mattingly, and Yuki Kondo, and will feature new work by artists working in a variety of different disciplines.Among the artists and artists working for the biennial are Anupam Gupta, Yori Bojang, and Yeomani Mokgai. The biennial will not only present the works of artists but also include aural works by contemporary musicians, authors, actors, athletes, athletes of various disciplines. The biennial will also feature works by members of the Royal Family, including Prince Andrew, Prince Harry, and Prince Harry-Sue, who will be presented with a gift of four centuries of Indian art.\n\n\nKenyan artist and", "The next Biennial should be held in 2019.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has announced that it is planning to remove the following two-hundred and twenty-four works from its collection, beginning in 2021: ‎Robert Rauschenberg’s First New York, 1964, which was purchased by the museum in 1996 and has since been in storage, and a selection of works by Bela Karolyi, which were acquired by the institution in 2005 and have been on display at the institution since 2010. Both works were on display in a group show, “Love in Motion,” that opened on September 10, 2013. The show was supported by a $5,000 grant from the Karolyi Foundation. The works, which were originally acquired by Karolyi’s private collection, are currently on display in the exhibition “Art of the Exclusion: Interviews between Robert Rauschenberg and Ed Moses,” which opened at the institution on September 10, 2017.The institution said that the decision to remove the works was made on the basis of a review of the works having a “substantial aesthetic connection” with the institution; the works that are presently", "The next Biennial should visit the Biennial House in downtown Yokohama, which is currently undergoing a major renovation. The exhibition, titled “Chronology,” will be presented by the Art Museum Tokyo and will run from April 28 to April 30. The conference, which was founded in 1970 by the Tokyo Metropolitan University and the University of Tokyo, is supported by the Japan Education, Culture, Sports, and Arts Agency. The seventh edition of the exhibition will be held at the Art Museum Tokyo from April 11 to April 14. The eighth Biennial will take place at the YOKOHAMA Museum of Art from April 16 to April 20. The ninth will be held at the Sapporo Museum of Art from April 20 to April 26. The eleventh will be held at the National Museum of Art from April 26 to April 29. The thirteenth will also be staged at Kyoto City Hall in April. The exhibition will be curated by Kunio Araki, who is currently working on a new exhibition for the 2020 edition of the Venice Biennale. The theme this year is “Interactivity,” and the artist will represent Japan at the upcoming edition of the Rome Biennale, which will take place next March", "The next Biennial should take place at the Museum of Modern Art in New York.   Before leaders of the arts and humanities met at the Cultural Exchange in Warsaw on December 14, the cultural body issued a statement that read: “The next Biennial will focus on integrating the cultural heritage of Poland and the world in the interests of the Polish people and society. It will reflect a new combination of Polish and international life, which has the potential to create new cultural experiences and to provide a platform for the exchange of culture between the two countries.” The next edition of the Art Basel World Congress will take place in Hong Kong in March 2021. The Frankfurt Biennale will resume in 2020 at the Museum of Contemporary Art in Frankfurt, Germany, and will present a selection of works by American artists in 2022. The Paris Biennale announced on Thursday that it is currently slated to run from March 23, 2021 to March 26, 2022. “The future of the art world is at risk,” said Olivier Fitoussi, the president of the association that represents the artists. “We are at the moment of great uncertainty. Art is at the crossroads of many revolutions. Art is at the center", "The next Biennial should be held in the middle of the city in May 2020. \n\n\nThe Pérez Art Museum Miami has appointed actress Mary Lambert as its new associate curator of contemporary art. Lambert, who has been a Pérez Art Museum assistant curator for twelve years, will be responsible for cultivating the museum’s collection by focusing on presenting exhibitions, publishing books, and conducting research.“Mary Lambert embodies the spirit of Pérez Art Museum Miami,” said curator and vice president David Fleming. “Her warmth, commitment, and creativity in sharing the Pérez Art Museum’s exhibitions and curatorial vision with our Miami-based curators, our curators-in-residence, and our Miami-based audiences are a perfect fit for the Pérez Art Museum Miami.” \n\n\nThe Museum of Modern Art (MoMA) in New York announced today that it will a) cancel the next edition of its “20/20 Art” exhibition, which was set to run from September 5 to September 8, and b) include a new collection of twenty-first century artworks in its exhibition “Art and the Future: An Exhibition of Modern Art in the 21st Century.", "The next Biennial should be held in London in 2022. It is still too early to say whether a final edition in the United States, scheduled for 2024, will be cancelled or postponed. The 2020 edition, which was also held in Mumbai, was cancelled after a fire broke out in an industrial building on the campus of the Indian Institute of Technology (IIT) in New Delhi on November 18.The art fair is currently facing a legal complaint in India from the owners of a company that was supposed to operate the fair, the Art Marketers Association of India (AMP), which had been planning to sell works by artists for the event. The complaint says that the sale of artworks is prohibited under the country’s anti-terror laws and that the work being exhibited is one of the copyrighted works.According to the Art Newspaper, a lawyer representing the writers says that the works are 'not protected by copyright, and are therefore not covered by the applicable provisions of the [Art] Crimes Act.” The Art Newspaper reports that the works were chosen by the writers for the fair in an auction organized by the IIT, which was closed on November 13, and were bound for the exhibition.Mariko Panosa, the director of the IIT", "The next Biennial should consider how art history and culture can be improved through experimentation that incorporates the creative processes from around the world. The next edition should include the first piece by an African artist as well as the first by an Iranian artist of color. The next edition should also include a work by a Chinese artist. This year’s edition will feature work by seventy-five artists, including Damien Hirst, Carlos-Albert Pujols, Lucy Lippard, Sally Mann, and Lisa Lovenkrath.“This is a time of historic crisis for all of us, but it is also a time of opportunity,” said Mark Beasley, the biennial’s executive director. “We are deeply indebted to the artists and their communities for taking up the challenge and creating the next iteration of the Biennial. Their work signifies a renewed and renewed commitment to the extraordinary and the very essence of what art is and can be: an ever-present truth within our own lives.”\n\n\nThe Phyllis B. Birnbaum Foundation, which supports artists and institutions in New York City and throughout the country, has received a gift of $10 million from the Alan and Helen Schwartz family. The gift, which comes in", "The next Biennial should take place in 2021. The program has competed in the past for the honor of being on the short list of the prestigious Lévy-Argonne and the prestigious Prix de la Mont-Saint-Martin, and made the list of the Paris Palais in the 2016 and 2017 editions. The next iteration of the show will be held at the Côte d'Azur from March 21 to March 24, 2020. The French Ministry of Culture is organizing the event from the Art Gallery of Ontario in Ottawa, Canada, and will announce the pavilion and the dates of the event in the coming weeks.\n\n\nThe Swiss artist, writer, and educator Willem de Kooning, whose scholarly theory of the 'synthetic landscape' and transhumanist imaginings were influential in advancing the idea of architecture and bioengineering as biological technics, has died at age ninety.Born in Geneva in 1931, de Kooning studied art at the University of Bern before returning to New York in 1957 to pursue a Ph.D. in art history at the University of Pennsylvania. In 1970, he began his career as a sculpture critic for the New York Times Magazine, and in 1978, he published his essay “", "The next Biennial should take place in the autumn, perhaps in 2021.  Of the seventy-nine international exhibitions currently on view across eleven cities in the United States, a retrospective of this year’s Whitney Biennial in New York will open in October.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Katherine Johnson as its new executive director.Johnson comes to the institution from the Los Angeles County Museum of Art (LACMA), where she has served as deputy director for the past six years. During her tenure, she has organized exhibitions such as “Explores the Limits of the Human Mind,” “The Immigrant Experience: ‘Living in the Other,” and “The Self-Portrait/Self-Portrait II: Effects of Highlight on the Self.” While at LACMA, Johnson worked on the exhibition “Collected Histories: ‘The Effect of Light on History” and coauthored a book on postcolonial art and the African diaspora, “Katherine Johnson: The Fight for the Future,” which was presented at this year’s Venice Biennale.Commenting on her new role, Johnson said", "The next Biennial should be held in 2022, but details are still being worked out. The DoFEA, which is funded by the French Ministry of Culture, will oversee the celebration, which will take place at the Château d'Honneur, in Paris.\n\n\nThe Museum of Fine Arts (MFA) in Boston has announced that it will be closed to the general public on November 5 and reopening in March 2020. The museum confirmed that the reopening date is not related to the recent coronavirus epidemic. Paul Mpagi Sepuya, director of the museum, said that the museum, which has operated since 1906, was forced to make a number of changes to ensure its financial sustainability as it attempts to remain focused on work and not on fundraising. After a review of its resources, the museum determined that the reopening date was not affected, but it is planning to evaluate the situation with its staff, partners, and other stakeholders. “We are working with our staff in assessing the likelihood and the need for severance, and with our community and with our donors to ensure the museum can continue to function and continue serving our communities,” said museum director Matthew Teitelbaum. “We", "The next Biennial should take place in 2020—and to coincide with the first—at the invitation of the twenty-third Biennial.\n\nThe twenty-sixth Biennial will be held in 2021.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Julian Simon as its new deputy director for artistic programs. Simon will be responsible for overseeing the work of the contemporary art museum’s curatorial staff, including curating exhibitions, public programming, and acquisitions.“The new positions will provide room for new thinking and innovative approaches to the museum’s mission,” says Joan Oehler, the museum’s director. “Julian’s experience and enthusiasm for exhibitions and curatorial work make him a strong fit with our editorial team’s work to advance the museum’s collection and curatorial program in a new way, creating a shared vision for the museum. I’m excited by his future role and look forward to working with him.”During his tenure at MoMA, Simon has worked as a curator, writer, and educator. He is the author of the upcoming book “The Art of Making Objects: A Curating Journey” (W.", "The next Biennial should draw from the first three elements. If the exhibition is to be successful, there must be a balance between the personal and the public experience. This is not an issue that can be resolved by one person or one institution. It must be a dialogue with everyone, seeking to make a difference through a combination of art and technology.  We have already begun to implement this approach in the exhibition, with the exhibition of the work of Rainer & Wolf. It is only a matter of time before the exhibition of the work of Gustav Klimt, or of the whole Biennial, becomes an annual event.The exhibition of the work of Alexander Calder is not far behind. The first Biennial exhibition was held at the Wiradjuri Museum in New Delhi in 2007, and the following year the exhibition won the Venice Architecture Biennale in 2009. Calder’s work was exhibited in the first edition of the Venice Biennale in 2001. The exhibition of the work of Tarek Atoui is yet another matter. His work first appeared in the first edition of the . The exhibition of work by Günther Appel and his associate Klaus Ahearn, who were co–inventors", "The next Biennial should take place in 2020. The future of the exhibition is currently in the hands of the city authorities. \n\n\nThe Chandigarh Art Modern in India has decided to cancel its upcoming edition, due to be held in March 2020. The announcement marks the first time the museum has delayed the event since its inception, which was established by the late collector and art historian G.K. Chandrasekhar in 1963. “The project to stage a contemporary art museum in India was conceived in 2008, following the tragedy of the twenty-four-year-old railway work in India’s western state of Uttar Pradesh,” said museum director Rina Chandrasekhar. Rajiv Chandrasekhar, the longtime director of the Chandigarh Art Modern, added: “Almost ten years have passed since we had the opportunity to launch this project, and I am extremely proud of having led the way. Many milestones have been accomplished, but the ground has not yet been fully laid. We are still a long way from reaching our goal of developing a full-fledged contemporary art museum. We are closer than ever.”Commenting on the impact of the move, Gautam Bhatia, the", "The next Biennial should be held in 2021. London’s Serpentine Gallery has announced that it is also planning to host an exhibition for its collection in 2021, but the event will be a private event and will not involve the London biennial.\n\n\nAn Oakland museum has requested that the California Historical Society (CHS) hold an extra exhibition this fall to honor the city’s contributions to the Bay Area. In a statement, the institution said: “As a museum and as a community, we are thrilled to be able to share the extraordinary stories made possible by our artists and curators. Their work has made possible the economic, political, social, and cultural success of communities in Southern California.”The request for the exhibition was made by Oakland’s former director of public cultural affairs, Hermine Galloway, and her successor, Jeanette Maros. Galloway said that the CHS was not consulted on the exhibition and that the institution is now working with Maros to create the exhibition “in partnership” with the CHS. Galloway also said that the CHS is “fully supportive of the museum’s request for an exhibition dedicated to the Bay Area’s contributions to the greater Bay Area", "The next Biennial should be held at Times Square in New York in June 2020. \n\n\nThe Museum of Contemporary Art (MoCA), Chicago, announced that it is planning to open a new, 24-hour, free museum dedicated to the American West, called the West Coast Museum, on the Big Dig project in 2021. The museum will be built on the former site of the former Selma, Alabama, railroad station, which was converted into a storage area for abandoned industrial materials. The city of Chicago, which owns the land where the railroad once ran, will construct a new west-coast highway that will connect the museum to the Selma-to-Sydney, Alabama, station through a $250 million renovation project.The West Coast Museum will be located in the city’s West Town neighborhood and will serve as a platform for the museum’s collection and exhibition programs. Its collection will include artifacts from the Western Art Museum in Seattle and the Museum of Modern Art in New York. The institution will also boast a bookstore, restaurants, and a public courtyard. The construction of the museum is part of the city’s $1.2 billion West Coast Strategy, which aims to turn a $500 million profit through job-creat", "The next Biennial should be held in 2022.The Grand Prix des Arts et Lettres (French pavilion) is scheduled to run from April 3 to April 8. The sixth edition of the biennial, which will be hosted by the Musée d’Art et d’Histoire (MAH), Paris, will run from April 17 to April 20.The biennial will also feature the exhibition “Between Two Worlds: French Painting 1927–1965” (2019) and “Between Two Worlds, Another Time: German Painting 1928–1945” (2019).\n\n\nThe Albright-Knox Art Museum in Manchester, England, has announced that it is moving the exhibition “Between Two Worlds: French Painting 1927–1965” to a new location, the Shoreditch Gallery, in London, beginning May 22. The move follows the museum’s reopening on March 30, following a refurbishment that included the installation of a new twenty-foot-high acrylic sculpture by artist-inventor Georges Apostu. The sculpture, titled Between Two Worlds, is part of a series of works that examine the relationship between the artist and the medium of painting. It is one of the first works by", "The next Biennial should be held at least twelve months after the registration of the Biennial of Architecture in order to avoid the postponement of the first exhibition in the new year. In order to reach an agreement with the city, the institution will have to finalize the design for the new pavilion in no less than two years.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Lee-Anne Odenkirk as its next director. In her new position, Odenkirk will oversee the museum’s expansion and will also oversee the development of the museum’s collection.“We are thrilled by the prospect of having a strong, dedicated, and visually diverse curator and owner in Lee-Anne Odenkirk,” said Michael Govan, MoCA’s board president. “She has demonstrated a remarkable ability to deliver cutting-edge and innovative curatorial and collection work in the twenty-first century, and we have great confidence in her ability to build on the work of her predecessors, especially during her tenure as director.”Previously, Odenkirk worked as a curator and educator at the Metropolitan Museum of Art in New York. She began her career as a cur", "The next Biennial should take place in Boston in 2022. It will be hosted at the Museum of Fine Arts, Boston, and will examine the work of forty-four artists, including David Cage, Frank Gehry, Robert Irwin, and Paul Gauguin. The thirty-second will be hosted at the New Museum in New York and will examine the work of forty-seven artists. The twenty-eighth will examine the work of forty-seven artists. The forty-seventh will be held at the Museum of Modern Art in New York, and it will take place in 2021. The forty-ninth will be held in 2021. The fifty-ninth will be held at the Museum of Modern Art in New York, and it will take place in 2021. A forty-six-year-old man with a history of mental illness is facing twenty-three charges after an incident on New York’s Lower East Side in January, according to the New York Times. The man, who was paroled in September 2019 after serving sixteen years of his fifty-three-month sentence for the possession of child pornography, was arrested on March 28 and has since been detained at the state prison in Pelham, New York, where he has been", "The next Biennial should be organized by the Museum of Contemporary Art, Los Angeles (MCA), in the spring of 2020. The 2020 theme, “Intentionality,” will focus on the artist-built environment. The organizers have also announced that the exhibition will be hosted by the Los Angeles County Museum of Art (LACMA), which will be inaugurated by a new sculpture garden, “LACMA” in the summer of 2020. The installation will focus on the creation of micro-models of environments\u0097the garden will be a microcosm from the LAXL, LAXR, and LAXU environments. The 2020 theme is an homage to the city of Los Angeles, which is known in the West as the “California of the West.” “We are thrilled to support our city with this year’s theme and to have the opportunity to publicly present the work of one of our artists,” said MCA director Deborah Albright. “Her conceptual work integrates all of the elements of the LAX region\u0097her conceptual space is a living organism within a city,” she added.The MCA artist-made environment is a collaborative effort between Albright", "The next Biennial should be in December 2019. The 1959 exhibition was one of the first large-scale exhibitions in Latin America. In 2015, the show was awarded the Cooper-Hewitt International Prize , for exhibiting the work of a Latin American artist in the first exhibition organized in the United States since 1972.\n\n\nThe Art Newspaper is offering a prize of $15,000 to any photographer who captures an amazing snapshot of the London Underground in one day. The deadline for entries is March 31. The prize was established to encourage more photography-related activities and to encourage artists and photographers to participate in a wide variety of events through the London-based organization Art Newspaper. The 2019 winners are Alexander Chemerinsky (Rochdale, England), Alexandra Curran (New York), Nicole Christie (New York), Paul D. Evans (New York), David Foster (New York), and Vijay Gupta (New York).“The Art Newspaper is a unique platform for compelling images,” said Mark Serota, who served as the prize’s inaugural director and curator. “The opportunity to champion a great work of art is one of the great rewards of working at Art Newspaper. The", "The next Biennial should be in 2021. They will then begin the process of selecting a permanent new home for the museum. The museum will hold its next exhibition, titled “The Second Wave,” in 2021.\n\n\nThe OMA in New York has received a $10 million donation from artist and collector Peter Tisch. The donation, which comes from the Tisch Foundation, comes at a pivotal point in the artist’s career. Forty-six years ago, the foundation lent $10 million to the museum in order to establish its Peter Tisch Collection. Since then, the museum has exhibited more than 2,300 works, including works created by Tisch’s sister, Edith Tisch, and his great-grandfather, Peter Tisch’s great-aunt, Edith and Otto. The museum currently hosts a number of exhibitions and works by Tisch. The donation is especially significant, since it comes in conjunction with the museum’s reopening of its adjacent building, which has been closed since January 6 because of the Covid-19 pandemic.The donation was made in honor of the culmination of the artist’s career. In a 2017 interview, Tisch said that the gift was", "The next Biennial should focus on how to begin to address the biennial’s challenges in a global context, and should explore how to make art in a time of crisis. There is also the possibility, as in the case of the Yuz Museum in Buenos Aires, of a biennial dedicated to the history of the city of Rome. It is also possible that the next Biennial will focus on Roman art from the sixteenth to the twentieth centuries, as the Grand Museum in Berlin did after the Second World War. The BICOM-BICCA delegation reiterated the vision of the Helsinki Street Art Project, and emphasized that the current exhibition is primarily about art from the nineteenth century, with particular interest in art from the nineteenth century and beyond.“Treating art as a living organism is the key to reconciling with the past,” said Bernard Malam, the director of the BICOM-BICCA. “This is an opportunity to renew the museum’s relationship with the artists of the twentieth century, and to try to articulate the future.”\n\n\nThe Metropolitan Museum of Art in New York has appointed Elizabeth Cameron as its next director. Cameron comes to the Met from the Solomon R. G", "The next Biennial should take place in the autumn of 2019. It will be hosted by the Kempe Museum in Frankfurt and will include a selection of works by forty-three artists, including Nils Stærk and Mikael Hægge, the winner of the first Biennial in Vienna in 2017. Commenting on her plans, Breitmann said: “The new exhibition will focus on the tradition and the history of the exhibition and the exhibition will reflect the exhibition as an entire but will also be able to take advantage of the audience’s imagination. My intention is to make a new kind of exhibition that can be engaging, engaging and fun.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has received a $50,000 donation from the estate of the late California native, John Belushi, who passed away on January 27 at the age of eighty-seven. The $50,000 gift, which was made in lieu of a full-scale renovation of the institution’s David H. Koch Building, came amidst a flurry of activity surrounding the late actor’s legacy, as the Los Angeles County Museum of Art (LACMA) and the Museum of Contemporary Art (LA", "The next Biennial should take place on the island of Monrovia in West Africa, called Art’s New Land. The seventy-ninth iteration of the exhibition will be held in the United Arab Emirates from September 16 to September 19. The biennial will feature more than ninety works by seventy-five artists\u0097Aristo Casals, Cara Barlow, Natalie Tiffany, Claude Monet, Henri Matisse, Robert Mapplethorpe, and Louise Bourgeois\u0097from nineteen countries, including Myanmar, the Maldives, and Zambia.\n\n\nNew York–based artist, filmmaker, and educator Woolf Alberts, who often grappled with issues of gender, race, and sexuality in her performance art, died at her home on August 19. She was seventy-two years old.Born in Brooklyn in 1936, Alberts studied painting and drawing at the Pratt Institute in New York before finding her own voice and becoming a leading member of the avant-garde New York art scene. Her art often expanded the boundaries of what was called avant-garde, incorporating elements of surrealism, metallicism, and visual poetry in her work. Her work has been exhibited at", "The next Biennial should kick off in December 2020 and will announce the winners of the first two years of the event in March 2021.\n\n\nThe British Council announced today that Charlotte Leslie has been selected to represent the UK at this year’s Venice Architecture Biennale, which will take place at the Palazzo Nazionale d’Arte Moderna (PAM) in Venice from March 22 to March 25, 2020. Her role will be to advance the work of British artists, including Jane Birkin, Clifford Owens, and Becca Mott.“Charlotte’s vision and skill for supporting and promoting the work of British artists is a unique and important contribution to the future of our country,” said Andrew Marr, director of the British Council. “In this important year for art, we are proud to honour her, and to support her growth as a champion of the arts.”Leslie’s new book, A Biennial, will be published by Liveright in August 2020. She will also receive a commission from the British Council, which will provide funding for the development of a public exhibition of works by the artist in the city of Portsmouth, the country’s largest city and cultural", "The next Biennial should be held in 2021. \n\n\nThe Metropolitan Museum of Art (MoMA) in New York has appointed Peter Brauti as its next president. In his new role, which is comprising over a decade of experience in the field, Brauti will coordinate the museum’s collection and exhibitions, oversee programs that advance artistic and curatorial practice, and oversee development of the museum’s collection and exhibitions.“Peter’s leadership in the museum’s art, design, and design-forward philosophy has been instrumental in our transformation as an institution, bringing new analytical and curatorial tools to support our mission of advancing the fields of design and architecture as well as the Met,” said Marc Glimcher, chairman and CEO of the Rosenfeld Gallery in Long Island City, New York. “While he will continue to be a central force in shaping and advancing the museum’s collection and exhibitions, we look forward to building on his vision for the Met and the future of the museum.”Brauti will take up his new post in March.\n\n\nThe National Gallery in London has appointed Jonathan Simms as its new chief executive. The new position was created as part of", "The next Biennial should take place in the fall of 2020, and the first show should happen sometime in the spring of 2021. The Biennial will also undergo a two-year renovation, the first stage expected to be completed by March 2021. Lassen Mädchengut, director of the museum, said: “The biennial is an important step in the process of establishing the museum as a large-scale cultural center with a long-term plan, which is essential for the museum’s future development. The opening of the Biennial is also a great opportunity to raise awareness about this important topic and to share the Biennials’ work with the public. ”\n\n\nThe São Paulo Bienal has announced that it is planning to withdraw its celebrity-studded final exhibition “Por favor: Cristina Adige” from the September 25–September 28 edition of the arts biennial, citing the Brazilian artist’s “inadequate care in relation to her illness.” Adige’s recent travels have included visits to the United States, China, and Mexico with her artist husband, the Brazilian artist Fernando Rodrigues, and featured works at the Fond", "The next Biennial should take place in Cologne, Germany, in March 2021.The organizing committee noted that this was “the most difficult decision for all of us. We have chosen to postpone the event in order to focus our attention on the future, developing a plan for the future, as well as for the biennial of our times,” Artforum reports.The committee chair, Monika Bischoff, said: “With the completion of the 2020 edition of the Biennale, the Berlin Biennale and the Berlin Art Festival are moving ahead with confidence. The future of the two events is now uncertain, but we are already working together to create the conditions for their future success.”\n\n\nThe Portland Art Museum and Sculpture Garden (PAMG) in Maine is planning to cancel a public art event slated for next spring that was originally set to take place in March because of the Covid-19 pandemic. The March 22 event, titled “Art, Ecology, and Environment,” was to have taken place in a quarry in the museum’s old space in the Portland Art Museum and Sculpture Garden, beginning March 18, 2020.PAMG director and CEO Liz Brown said:", "The next Biennial should be held in 2020. \n\n\nThe Centre Pompidou in Paris, which was planning to open this spring, has postponed the opening of its first exhibition in the city. The show, titled “The Three Musketeers,” was originally slated for June 30. Now, the show will be open March 5–June 8, 2021.The 2018 exhibition, titled “Esteban de los Reyes,” will be on view until May 3, 2020. The exhibition was originally scheduled for March 26–March 31, 2020. \n\n\nThe Metropolitan Museum of Art in New York has announced that it will invest $2.5 billion into revamping its collection, architecture, and exhibitions over the next two decades, to make the building more sustainable. The institution also plans to sell off more than two hundred artworks that are on display in its current exhibition space, the FabLab, and has committed to building a new forty-foot-long museum at 150 East Twenty-Fourth Street.The redevelopment project—which includes the construction of a new visitor center, a new public space, and the reorganization of the museum’s exhibition galleries—is part of a larger plan to reshape the", "The next Biennial should reveal a new variant of the show, which this year will be a biennial for a new generation of artists, according to a statement from the organizers. The exhibition will focus on \"the future of art through the use of a new language.”Hirshhorn Museum and Sculpture Garden director Adrienne Edwards, who was recently promoted to the role of chair, said: “I’m incredibly proud of the achievements of this year’s Biennial, and to see the first exhibition of ‘The Ruins of American Cities’ at the Hirshhorn Museum and Sculpture Garden. I’m excited to see how the artists will present this new work, and it’s an honor to join the team at this innovative and cutting-edge institution as they begin their exhibition.”\n\n\nThe US House of Representatives voted today to establish a national museum dedicated to the history of American photography, and the Senate is expected to follow suit in the coming weeks. The Museum of American Photography will be housed in a former industrial building in downtown Washington, DC, and will be inaugurated by a speech by then-president Barack Obama in January 2021.“After more than three decades as", "The next Biennial should take place in the fall of 2020 and will feature works by seventy-five artists, including Daniel Colton, Nara J. Gardner, and Yoko Ono. The 2020 iteration of the event will feature fifty works by seventy artists. In an op-ed published by the New Yorker, Artforum, Artforum Artnet, and Artforum Traveler, three biennial-contracted artists wrote that the upcoming show, titled The Future Is Present, was “a celebration of the past and of our present.”\n\n\nAs part of a settlement over the global health crisis, the New York City Department of Cultural Affairs has approved a $3.8 billion budget for the Cultural Institutions (CIs), including a $200 million boost for arts and cultural organizations, a $250 million boost for museums, and a $500 million boost for schools. The funds will also help offset the budgetary blow to NYC’s performing arts and cultural sector from the coronavirus.“In a time of economic uncertainty and political tensions across the globe, the department is committed to supporting the lifeblood of New York City’s economy—providing opportunities for local, state, and federal governments to collaborate,", "The next Biennial should be held in 2020. The 2019 edition was staged at the Haus der Kunst in Berlin.\n\n\nThe National Galleries of Scotland (NGA) has announced that it is preparing to welcome visitors to the institution from April 20 to April 22. The news comes after NGA director and CEO Adrian Walker said that the institution would be “well prepared” for the influx of visitors following the Scottish Government’s decision to leave the European Union. Walker described the decision as a “moment of truth.”A senior representative of the National Galleries of Scotland, who spoke on condition of anonymity, told the Art Newspaper that the institution will be “well equipped” to cope with the surge in visitor numbers following its announcement that it plans to reopen in the spring of March. The representative also said that the institution will not only be able to accommodate as many visitors as possible but will be able to “handle the extra traffic.” The representative added that the institution will be able to reopen to the public in the spring and that the reopening date will not be fixed until the spring of 2020. Walker explained that the decision to reopen as early as possible was made in order to give the institution time", "The next Biennial should be in 2021. \n\nRenowned for its innovative architecture and for its commitment to social justice, the Biennale du Dimanche, which opened on March 25, was founded by the American architect Howard M. Kahn in 1995. Responding to concerns over the loss of its original space, the pavilion was rebranded and renamed the Richard Neutra–designed Chinati’s auditorium, and its hall was transformed by the American filmmaker Spike Lee. The exhibition, which featured work by musicians including Bruce Springsteen, William Eggleston, and Elvis Presley, is now staged in the Tivoli in Rome.\n\n\nThe Solomon R. Guggenheim Museum in New York has appointed Alberto Bergad as its next director. Bergad currently serves as the president and CEO of the Spanish company CIMAM, which has a global network of more than 120,000 employees, and was recently appointed director of the Palacio de Arte Contemporáneo in Madrid. He succeeds Alberto Kahlenberg, who retired on January 31 after 14 years at the helm of the museum\u0097a position he held until his death in 2015.“When my predecessor, Mas", "The next Biennial should focus on social justice and sustainability issues, as well as on the work of artists and cultural workers. The theme of the exhibition should be “Awareness,” reflecting the theme of the upcoming Spring/Autumn tour, “Awareness.”\n\n\nTania Bruguera, the director of the Museo de Arte Contemporáneo Cervetto in Bellas Artes, Argentina, has been named the new head of the Museo de Arte de Buenos Aires (MAS). She succeeds Jean-Luc Poulin, who resigned in February after twenty-five years at the helm of the Museo de Arte in Buenos Aires.“I admire Poulin’s talent and his remarkable achievements as a curator,” said Bruguera. “His vision and drive were always present in everything he did, and his work is truly one of the most important in its history.”In the recent six-month period between October and March, Bruguera curated sixteen exhibitions, including “Nathan Godin’s first solo exhibition at the Museo de Arte in Buenos Aires in March 2019; “Christo and", "The next Biennial should be in 2021.\n\n\nThe Smithsonian’s National Museum of African Art (NMAA) in Washington, DC, is preparing to host a biennial of works by the late South African artist Paul Gauguin in the spring of 2021. An announcement of the exhibition will be made in the spring.“Inaugurating the National Gallery at the Smithsonian, the National Museum of African Art, and the National Museum of Women in the Arts, the new biennial ‘Toward a New African Vision’ is part of a Smithsonian-wide initiative to build upon and expand the work of Gauguin and other pioneering African American artists,” said John McAllister, director of the Smithsonian’s National Museum of African Art. “This is a moment of universal renewal for the arts, and a chance to witness and appreciate Gauguin’s legacy in action.”Inaugurating the National Gallery at the Smithsonian, the National Museum of Women in the Arts, and the National Museum of African Art, the new biennial ‘Toward a New African Vision’ is part of a Smithsonian-wide initiative to build upon and expand the work of Gauguin and other pioneering African", "The next Biennial should be a project of critical accessibility. The first year will feature a collaborative presentation of photographs by the artists who are most associated with the exhibition. The exhibitors will be selected through a public competition. The exhibition will be at the Museum of Arts and Design in London from August 8 to August 10, 2020. The finalist will be announced in 2020. The 2019 winner was Fotosearchiv, which won the biennial as well as the $100,000 Tunga Prize in 2018. Fotosearchiv’s exhibition “Identities,” which opened at the Museum of Modern Art in New York in 2018, will be at the Smithsonian American Art Museum (SAAM) in Washington, DC, from March 11 to March 18, 2020. The biennial will feature works by twelve artists, including Arsht, Alicia A. Salas, Cécile B. Peña, and Rocío de Castro.The biennial will be hosted at the Museum of Fine Arts, Boston, from March 14 to March 16, 2020. The event will be hosted by curator Anita Lubell and will draw from the collection of Elizabeth Snyder. The museum will present a selection of works by the two", "The next Biennial should be held in 2021.\n\n\nThe right-wing United Kingdom assembly announced yesterday that it approved the Brexit bill, formally known as the Brexit Act, which will formally begin the formal withdrawal from the European Union in March. The legislation, which will be sent to Parliament on Thursday, March 23, will set out the terms for Britain’s departure, and will then be voted on by the British public.According to The Guardian, the legislation—which is divided into six bills and will be voted on in three weeks—is expected to provide the British people with a Brexit bill that will give the British people a clear and unambiguous choice regarding whether or not they want to continue to be part of the European Union. If they vote to leave, the United Kingdom will transition from being a member of the European Union to a member of the United Kingdom’s constituent nations, which will begin the process of formal separation in the coming weeks.If the legislation is passed, the United Kingdom will be able to leave the European Union without the approval of Parliament, which is currently being held up by Britain’s Conservative Party, and will begin the process of leaving the European Union by the end of March. However, if Parliament votes against the Brexit", "The next Biennial should take place in 2020 and will focus on the design of art and architecture as well as the history and theory of contemporary contemporary art. The Biennial will be inaugurated with a workshop on Mies van der Rohe’s work on the American West Coast in 2021. Its next edition will be held in 2022.\n\n\nThe National Gallery of Art in Washington, DC, has received a gift of twenty-nine works by Aaron Suggs, whose eclectic practice spans sculpture, photography, performance, performance-video, film, installation, and performance-art, and spans the globe. The National Association of Broadcasters (N.A.B.), an organization dedicated to the promotion of the arts and cultural across the United States, announced that it is donating twenty-six works by the artist, which have been on the market since 2017, to the National Gallery of Art.Suggs’s contributions include posters for the 2018 Whitney Biennial, his first retrospective at the institution since 2002, and “The Isolation of the Body: Modern Art in the Age of Max Ernst” (2019), a series of photographs that explores the relationship between art and the body. The artist is also working on a new series of works", "The next Biennial should take place in 2022.   “The museum is seeking to be an international leader in museum design,” said Gillian Pringle, director of the Museums Association. “We have been working with the team to develop a plan for the exhibition, which will bring together works from all over the world, and hope that the consultation process will enable us to reach a decision that works for both our members.”\n\n\nThe Fondazione Prada has announced that it is revamping its store front in Milan. The remodeled space will feature new works by the Italian fashion house, designed to evoke a film set and a 1970s-vintage Prada collection, as well as behind-the-scenes footage from the company’s recent Paris and Milan shows.The new exhibition at the Italian fashion house will be titled “Agrigento, Abrille, oltre alla prada—Todomodoli,” on November 17, 2020, at the Prada Spoleto. The show will be curated by Ashley Rock, who most recently served as the director of womenswear at Filippa and Stefano Domenico.“We are", "The next Biennial should be targeted at a different age group, perhaps aged 18–39 or 40–59. The museum should also consider creating a new category for plays that are not part of a major works-and-one-way project, such as a short film, a video‐game, or a play.”\n\n\nThe Hartford Museum of Art (HMA) in Connecticut announced today that it has appointed David M. Goldberg as its next executive director. Goldberg came to the institution from the Museum of Fine Arts in Boston, where he serves as director of curatorial affairs and chief curator. Under his leadership, Goldberg oversaw the consolidation of the museum’s collection and expanded its reach. He is currently leading the revitalization of the exhibition space at the museum, known as the Armory, and is overseeing the development of a new collaboration program with the arts.“David’s leadership and vision for this institution and the Center for Arts and Culture will enable us to continue to be the best place in Hartford for the arts, and to continue to cater to Hartford’s diverse communities,” said director Placidus Brugmann. “We are grateful for his guidance and confidence in the vision he has set for the", "The next Biennial should aim to give the public a series of exhibitions, books, and other materials that will be augmented by an international community of artists, curators, artists and researchers, and should reflect the growing trend of integrating art into the public space.The inaugural exhibition will be “Art of the Future: Visualizing the Future” (2019–20). Curated by Annie Hall and funded by the Unseen Project, the exhibition will feature seventy works by forty-five international artists, including Tanya Baranova, Sui Dain, Shelley Halsey, and Chris Levine.The exhibition will debut at the MCA as part of a campaign to strengthen the visual arts in the United Kingdom. The 2014/15 cycle, “Art of the Future,” drew over four hundred artists from twenty-nine countries. The exhibition will also be hosted at the Tate Modern in London, the London Biennial, and the Taipei Biennial. \n\n\nThe National Museum of Fine Arts (NMFA) in Cleveland is planning to close indefinitely to the public following the November 20 reopening of its new facility in the first phase of construction, set to open in December. The venue has faced backlash over the last few months for its plans to", "The next Biennial should inaugurate the two-million-volume König Collection, which will include works from the collection of Andreas König, and will present two exhibitions, one of which will open on September 21. The exhibition will be inaugurated by a group show of the same name, which will open to the public on September 22.The exhibition will include works by artists such as D. W. Meeg, J. S. Kwon, and S. W. Yang, who were among the first to use photochemistry to analyze the complex chemical structure of cellulose. Other curators include Yuko Yamada, Satoru Iwomizu, and Pinchu Bagan.\n\n\nThe New American Museum (NAM) in New York has appointed Matthew Teitelbaum as its interim director and CEO. Teitelbaum has been a leading curator of American art since the institution was founded in 1972 by architect and businessman Adolfo Pinturro and his wife, Anna, in a downtown building in the Chelsea neighborhood of Manhattan. He also serves as a professor of art history at the City College of New York and was the founder of the Contemporary Art Foundation in the Bronx.“In his new role, Teit", "The next Biennial should begin on the island of Mombasa, which hosts the annual event 'The Journey to Mombasa.” The event, which will feature approximately 2,000 works by twenty-six artists from Africa, Latin America, and the Middle East, will also include special exhibitions. The event is supported by the Bill and Melinda Gates Foundation, the Alfred P. Sloan Foundation, and the Richard and Helen Duncan Foundation.\n\n\nA new semester at the University of Witwatersrand (Wits) in Johannesburg has been called off after it was revealed that the upcoming edition would feature an all-male exhibition and not a single female-led exhibition. The announcement followed a formal investigation into allegations of sexual harassment and discrimination made by a group of students and staff, led by Jane Glaser, a senior lecturer in art history and curator at the Lelong Art Museum, in London, who petitioned the institution for help in 2016.The Tramway arts complex in Johannesburg, which was founded in 2003 by the Wits faculty, the faculty of visual arts, and the British artist Jim Thompson, has also been accused of discriminating against women in hiring and promotion. Students allege that the Tramway promoted atypical women", "The next Biennial should also take place in 2021, but Madrid-based curator Andrísa Mosqueda, who has been involved in the initiative for more than two decades, said: “The art that has been created in the last five years is an ephemeral reality, as in all phases of life. The final version of the exhibition will be a combination of histories from the past and future, from the present and future, and from the past and future.”The event will be hosted by the Institut für über die Geschäftung und Vogeschäftung (German Cultural Center) in Essen. It will run for thirteen weeks, from March 4 to March 4, 2021. Inaugurating the exhibition is the exhibition “Rendering of a Future: Art and the Future of Humanity” (2019), which will feature work by forty artists from twenty-three countries.“The museum has been developing the exhibition for more than two decades, and this is the first edition in which different artists have participated in this way,” said museum director Ulrike Bacher. “The exhibition is not only about our past, but also about our future. It is", "The next Biennial should take place in 2022.\n\n\nThe Metropolitan Museum of Art (MoMA) announced today that the museum will begin accepting payments in kind, effective immediately, for works on display in its collection. The move will allow the museum to address the museum’s long-standing problem of how to use the proceeds from the sale of works on display in an equitable way. “The museum is working on a new way for the museum to use the proceeds from the exhibitions, and we are still working through the details of how we will manage the program and how the museum will engage with the public,” said museum director Daniel H. Weiss. The museum will implement the change by July 1, 2022, and will begin accepting payments in kind sometime in the second half of the month.The change will address the Met’s longstanding practice of presenting works on display without charge, a practice that has come under intense scrutiny following the devastating fire at the Grenfell Tower in west London that killed at least sixty people and injured hundreds more. The fire was set by a 22-year-old man who had been detained for allegedly stealing a coat hanger and that was found dead of a self-inflicted gunshot wound hours later. The man died", "The next Biennial should be completed by the end of the year, but the organizers said there is a possibility that the exhibition may be postponed due to the ongoing global health crisis.\n\n\nThe Fine Arts Museums (FAUM), Paris, has placed Tarek Atoui and Ghada El Soltan, two of the country’s leading artists, artists-in-residence, and fellows, on its list of the 100 most influential artists of the twenty-first century. The curators were selected from a pool of more than one thousand artists who have been nominated by a biennial panel that includes the curators of the last ten years, as well as several hundred other artists from France and abroad.Atoui and Soltan were nominated for the honor in the year of their seventeenth anniversary, for their work Nude, 2018, which is currently on view at the Musée d’Art Contemporain in Paris through May 23. The exhibition will now open in the United Arab Emirates and will be the first of its kind in Europe.The exhibition was also selected as the Biennial of the Year by the National Council of the Arts in Paris, which is responsible for selecting the 2020 winners of the prestigious Louvre, the", "The next Biennial should be in 2019 and is currently in development.\n\nThe exhibition will showcase works by artists from around the globe. Since the biennial is in its early stages, the 2019 date will be somewhat later than the 2020 edition, due to the ongoing health crisis in Syria, although Festival Dubai will not make any decisions on its programming until mid-September.The biennial will be hosted at the Dubai Art Museum. The director of the exhibition, Nima Arsht, said: “The exhibition will be a time for art and artists to reflect on the existential questions that affect us all. It will introduce the readers of the exhibition a new way of looking at the world. The exhibition will also provide them with an opportunity to interact with the Biennials. The Biennial is our story. The exhibition will make it accessible and relatable for the common people. This is our story.”\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has named Paul Hirschhorn as its next director. Hirschhorn currently serves as director of the San Francisco Museum of Modern Art, where he serves as the director of planning. He has also held various other senior positions at museums, including at the San Diego Museum of Art", "The next Biennial should begin with a discussion of the legacy of the exhibition “Feminine Marches,” which will focus on the role of photography in women’s liberation and the critical role of female artists in the history of art. The exhibition will conclude with a discussion of the future of photography exhibitions in the United States and the first half of the twenty-first century.The decision to cancel the show was made in the wake of a wave of protests by women artists and activists who claimed that the exhibition was “hostile to women’s rights” and “not in keeping with our values as artist-driven organizations.”The protests have been met with a fierce backlash from the men who were scheduled to participate in the exhibition. More than eighty artists and activists signed an open letter denouncing the move as “opportunistic” and “distorted.” The letter claims that the buyer was trying to 'dehumanize' the exhibition and that the choice to cancel the show was made on the basis of the “lack of interest in” the work of women artists due to the coronavirus pandemic.As a result of the backlash, the Biennial issued a statement saying that", "The next Biennial should examine the history of the 1970s, an era of militant social and political action and the emergence of the Black Power movement, and should take place in the same location as the museum, in the same year, and will be hosted by the same artists. Participating artists include Rayyane Boro, Doug Aitken, and Mpagi Sepuya, among others who have participated in the Biennial in the past. “The Biennale is a powerful platform for African Americans, for artists of all kinds, and for all communities to come together to explore the history of our continent,” said Larry Gagosian, executive director of the Gagosian Foundation. The next iteration of the Biennial will focus on the history of the United States and its impact on Africa, where it was founded in 1909 by Abraham Lincoln. The 2020 iteration will follow a theme of American history that explores the ways in which race, art, and commerce have been intertwined and interlinked throughout American history. The 2020 theme will encompass the history of black life in the United States and will focus on the introduction of photography and photography products by African American artists. Commissioned by Donald Kessler, the critic for Artforum", "The next Biennial should be held in 2021. \n\n\nThe Portuguese photographer and designer Annemaria Nara, who always found a way to create a work that was for the sake of its content, has died at the age of seventy-two. Nara studied under the legendary architect Claudio Marinara and, in addition to her time spent in Venice, she taught at the New School in New York, the Columbia University in New York, and the New School in London. Born in Lisbon in 1941, Nara moved to Porto, where her family soon emigrated from the United States. In the early 1950s, a local art dealer introduced Nara to artist Raoul Schoelkopf, who invited her to stay at his studio in New York. The pair would become inseparable, collaborating on projects that merged painting, sculpture, photography, and design. The artist would often create new works alongside Schoelkopf, and in 1991, when the latter died, Nara became the sole surviving member of the duo.Born in Lisbon in 1941, Nara moved to Porto, where her family soon emigrated from the United States. In the early 1950s, a local art dealer introduced Nara to artist Raoul", "The next Biennial should be in the spring of 2021, and the themes should be “Toward an Action Leadership of Realism,” according to Böhm-Bawerk.The artist will receive $20,000 in prize money and will be invited to present a selected work for the 2019 exhibition. The biennial will run through March 14, 2020, at the Museum of Contemporary Art, Los Angeles, and will be hosted by Biennale de Lyon. \n\n\nThe Museum of Modern Art (MoMA) in New York has announced that it is reducing its workforce by 13 percent as part of a $6.5 billion restructuring that will involve the restructuring of the museum’s three locations—MoMA, the Museum of Modern Art (MoMA-B), and the Museum of Modern Art–New York (MoMoMA-NB).“The museum is investing in our future to create new and better ways to support our extraordinary collection and to grow the museum’s audience,” said museum director Daniel H. Weiss. “MoMA’s transformation is a global story of how we shift to meet the challenges of an increasingly connected world. We are recommit to our values of openness and collaboration,", "The next Biennial should examine the history of Western architecture in East Asia, and should seek to reconstruct the first exhibition by a woman in the history of art in Shanghai, will be hosted by the Institute of Architecture and Design within the Institute of Art and Design from February 13 to February 21, 2020. The exhibition will be organized in collaboration with the Jilin Academy of Art and Art Museum, as well as with the National Museum of China (MUIC), Beijing, and the Shanghai Museum of Art.\n\n\nSherry Anne Brenner, who served as director of the University of Delaware from 1995 to 2007, has died at age eighty-six. She was director of the school from 1987 to 2008, when she stepped down to be the director of the University of Delaware Art Museum. Brenner was the first person to lead the institution from West Bengal, India, and the first to direct a major Asian institution. Brenner began her career as a dancer, performing at the University of California, Berkeley, where she graduated in 1972. She began teaching art history at the University of Delaware in 1975, and was the first to teach art history at the institution. In 1984, she founded the nonprofit art museum The Montauk, and was instrumental", "The next Biennial should be held in 2020, the biennial’s director, Domenick Cunha, told the Art Newspaper.  “I’m very excited to support the work of all our artist-in-residence—from the exceptional to the extraordinary,” said Cristina Cunha, the Biennial’s inaugural director. “This year’s exhibition marks the first time the director has partnered with a museum to create an immersive exhibition, and I’m confident that the program will deliver.”\n\n\nThe Toronto Art Gallery (TAG) announced today that it is launching three new initiatives as part of its $45 million expansion, “Toronto Artists’ Landing.” The first, which will launch in the fall, will focus on offering free public tours of the renovated and modernized space. The second, for Fall 2019, will be a public art project with the theme “Resistance.” The third, for Winter 2020, will be a series of performances and curated tours with the theme “Aliens and Art.”“These three initiatives represent the next steps in TAG’s strategy to provide free, public, and", "The next Biennial should be held in September 2021.\n\n\nThe National Geographic Society, which is currently embroiled in a legal battle with the National Labor Relations Board over whether it should be required to recognize union organizing efforts following a spate of laid-off workers at the Smithsonian’s American Art Museum in Washington, DC, has released the results of a survey of workers at the institution.The survey, which concluded that workers are unsatisfied with management’s handling of the labor dispute, found that 36 percent felt that they were treated unfairly by management. Thirty-three percent expressed frustration with management for not addressing the mounting pressure to resign in the case of Richard Desmond, and a startling 71 percent of workers said they are dissatisfied with the direction of the museum.The survey also found that 66 percent of workers felt that management failed to protect workers, and that 55 percent feel that they have no other choice but to return to the institution. The survey found that 44 percent of workers who were laid off or furloughed are satisfied with their working conditions. The majority, 55 percent, said that they are dissatisfied with their current treatment, and a majority, 55 percent, said that they are dissatisfied with their current pay.Two-thirds of workers said that they are dissatisfied", "The next Biennial should be in 2022. “I am confident that the new project will provide an excellent opportunity for Stony Brook University to present an exhibition of the work of those artists who have made the most significant contributions to modern art.”\n\n\nThe American Council of Museums (ACM) has withdrawn its financial support from the controversial Dakota Access pipeline, which would have brought North Dakota Bakken crude oil from the Bakken region to Illinois and other states. The decision was made in solidarity with local activists who see the $3.8 billion project—which would have transported 1.1 million barrels of Bakken crude a day from the region—as environmentally harmful. “Our support for the Dakota Access Pipeline has always been rooted in our collective vision to contribute to a more just and inclusive future for our region,” said Audrey Nay, president of the American Council of Museums and a former vice president of the organization. “Museums have a critical role in insuring that our communities have access to essential resources and services, and that our culture is made accessible to the public. Our work to support the People’s Climate March and the resistance to the Dakota Access Pipeline is not over. We continue to support the People�", "The next Biennial should be his thirty-fifth. The twenty-fifth and twenty-seventh will be his forty-third and fifty-fourth. As he prepares to close out the nineteenth, he said: I am grateful that the next twenty-six years will be a great journey of learning, discovery, reflection, collaboration, and exploration. I am confident that through my courageous team, I will continue to make important contributions to the art of life. Inaugurating the biennial will be the artist-in-residence, the artist-in-residence’s studio, and the biennial’s central location, at the MOS, in the city of Pueblo, Mexico, where it will be exhibited in the coming months. “The new Biennial will have the opportunity to reflect upon the history of Mexico through the eyes of an eclectic group of artists who are living, working, and creating in the country,” said Jorge Abiert, the director of the MOS. “It will also have the opportunity to foster a sense of community among the visiting artists from Mexico and to host important exhibitions by artists from the United States.”The current exhibition, “Ig", "The next Biennial should focus on the role of the museum in providing a platform for contemporary art and should involve workshops on issues such as sustainability, curator work, and exhibitions. The third and final sections of the programme are intended to be renewed at the museum every three years, with the possibility of revising the programme at any one of the museum’s locations, depending on the museum’s financial circumstances. “I am proud to see that the Biennial Award, which I have championed for twenty-five years, is finally achieving its aim of supporting artists and trans-disciplinary spaces in the city of London,” said Richard Hammer, the president and CEO of Tate Britain. The Biennial Award, which was established by Tate and Co as part of the new £124 billion capital campaign, was established to help facilitate the relocation of works of contemporary art from Tate Britain to other locations in the UK. The Biennial Award was established to help facilitate the relocation of works of contemporary art from Tate Britain to other locations in the UK. The Biennial Award was established to help facilitate the relocation of works of contemporary art from Tate Britain to other locations in the UK. The Biennial Award was established to help facilitate the relocation of", "The next Biennial should be convened at the city’s Museum of the City of New York. The exhibition will take a look at the history of New York and its citizens and will open on September 24.\n\n\nThe Ateneo Art Museum in Sydney is planning to increase the pay of the museum’s currently lowest-paid employees, introducing an extra four-day week for the museum’s front-facing positions and increasing the hourly rate of its top-level managers.The institution said the changes will address the performance of its top-level staff as well as “how we move forward in the facing of future challenges, such as climate change and its impact on the environment.”According to a release, the ‎changes’ will “provide additional support for the staff and improve working conditions, including improved remuneration for senior leaders.”The announcement follows the global climate emergency declaration by the United Nations, which said that the world must accelerate the reduction of greenhouse gases and that the only way to prevent the worsening of the climate emergency is for everyone to take part in the global decision.\n\n\nFabien Potencier, the French cultural minister and the founder of the prestigious Parisian gallery T", "The next Biennial should take place in 2022.  The new theme of the forthcoming exhibition: “Abandon all forms of art and images.”The first exhibit organized by the new organization will take place at the MUSC-CNRS Museum of Art in the city of Sinaloa, Mexico, on November 4. The second exhibition will take place at the Museo de Arte Contemporáneo de São Paulo (MASP), Brazil, in 2021.The exhibition will travel to the Costa Rican capital, the city of Santa Fe, and the Palacio de Artes Puebla in Mexico City and will be presented by Yinyoung Wang, who is currently on the faculty of the Faculty of Arts at the University of Vienna, as well as artists such as Alessandro Mollino, Guadalupe María, Fernando Oviedo-Alonso, and Pero Ferrer.“This is the most important moment in the history of biennial,” said Panagiotis. “It is a moment of great possibilities for the exhibition. It is an opportunity to connect with the artists in their homes, communities, and countries, and to reflect on our own lives and our world", "The next Biennial should take place at the St. Louis Art Museum in the fall of 2019. The museum was chosen from a shortlist of fifteen artists that included Chris Burnham, Will Lucas, Richard Learoyd, and Richard Avedo.\n\n\nTartarus Gallery, a New York–based contemporary art center founded in 2010 by artist Daniel H. Wilson on the Lower East Side, has been sold to Anselm Kiefer. The estate announced the deal on Thursday, March 23, and will close its doors next month. Through the sale of the artworks, the museum will become the third major arts institution in America to be sold by Wilson.The news comes amid a restructuring at the center that began last September, when Kiefer sold his artworks to the collection of Jon Voight, who passed away in June 2019. In addition to his work, the artist also sold several other works on paper, including pieces by Richard Avedo, Larry and Ed, and Klaus Lüdecke. The sale of his works also includes a book, Born at Landstuhl, which is scheduled for the fall of 2020.Wilson, who originally purchased the works in 1999, said in a statement, “The collection is a", "The next Biennial should be held at the Retreat at De Montfort, in Tournai, France, in the spring of 2021. The next iteration of the Visual Arts Biennial will be held at the Royal Academy of Arts, London, in the fall of 2022. The new programme is not without its challenges. For one thing, the academy only has three days to prepare for two major events, the 2020 exhibition “The Future We Couldn’t Make” and the 2022 exhibition “The End of the World.” The institution also faces a major crisis, as the coronavirus reaches new and remote areas of the world, including Australia, the Philippines, and the Palawan region of the Philippines. The coronavirus outbreak has also reached the United States, where the number of confirmed cases has reached thirty-six and the number of deaths has reached thirty-seven and is expected to rise to at least sixty-nine.New York Governor Andrew Cuomo declared a state of emergency on Friday, February 4, as the coronavirus spreads by air, sea, or water from person to person and between countries. Cuomo also expanded the federal government’s emergency spending powers in relation to the coronavirus, which", "The next Biennial should focus on the history and development of the institution, which is currently undergoing a major expansion and reconfiguration, and should aim to reflect the cultural and social diversity of the city. The biennial should also incorporate programming that engages with contemporary issues and debates and should focus on the transformation of the Biennial as a whole. “We are thrilled that the city is committed to supporting the Arts in Portland,” said Mayor Charlie Hales. “This is a critically important year to support the arts in Portland, and we’re going to keep working to make sure that the Arts in Portland get the support they need to thrive and thrive.”\n\n\nThe Museum of Contemporary Art (MoCA), Chicago has released the list of twenty-six artists who will participate in its annual Advancements in Art (AIA) event, which celebrates the achievements of emerging and established artists. Titled Advancements and for the Arts, AIA aims to provide a forum for artists to present their works and provide a platform for them to connect with the collections and audiences of the institution. The artists participating in AIA 2020 include Jidenna Ahmed, Adrienne Aloia,", "The next Biennial should be held in 2020, and the inaugural exhibition in 2021.  For the Artist’s issue, David Ashley wrote: “The next Biennial should be a new kind of exhibition, an exhibition that is ambitious, illuminating, experimental, and provocative, and that brings together contemporary issues and concepts in a way that is both tender and relevant.”The full list of participating artists is as follows:Artists and InstitutionsParticipatingArtists who are Established and SelectedParticipatingArtist OrganizationsCopyrighted MaterialDonors or Organizations That Are Not Controlling ParticipatingCommunity Support and ActivistsCommunity EngagementCommunity Engagement is a concept that encompasses a variety of ways of fostering and supporting the creative work of individuals and organizations in the collaborative process. A great example of the kind of engagement is exemplified by the exhibition ‘Artists’ Table,‡ a public gathering and production space that is held in the gallery of the Parisian Museum of Fine Arts, where the artists are represented by the independent collective Bénédicte de la Tour. The event, which celebrates artists, has been held annually since 1999.”The next edition of the Art Basel (AB) New York fair will take place", "The next Biennial should be held in 2022.\n\n\nCultural photographer Katsu Okada, who won the grand prize for his work The Body in 2013, has had a major retrospective organized by the Hong Kong–based nonprofit Artiti (Art) in Hong Kong. Featured in the exhibition, which was organized by Artiti and is curated by the Hong Kong artist, is Aura of Bali, a series of two photographs, each of which focuses on a different aspect of the trip.The Hong Kong–born, South Korea–based photographer will be presented with the Hong Kong Arts and Culture Award at the Artiti event. The award is a recognition of his contributions to Hong Kong’s international art and culture calendar. In addition to the Hong Kong Arts and Culture Award, which is given annually by the Hong Kong Foundation for Contemporary Arts, Katsu will also receive the Hong Kong Biennial Award, which is given annually by Art Asia Pacific.“Katsu Okada’s art has a specific and complicated history in Hong Kong, which is perhaps best exemplified by his first solo exhibition, his first solo exhibition at Artiti, in 2005, and his first exhibition at ArtAsiaPacific, in 2009,” said Michael Trump,", "The next Biennial should be scheduled for the end of the year. The institution will also begin a strategic review of its operations, including the future of its new exhibition space Xavier Biennale, which opened in the summer of 2018.\n\n\nA group of artists, activists, and academics have launched an #ArtAttack campaign against the museum’s exhibition schedule and the exhibition program’s financial incentives, which they allege favor institutions over artists. They also claim that the institution’s exhibition program is dominated by a handful of executives and that the financial incentives are skewed toward established galleries.The campaign, “We Are Artists,” began with a letter addressed to the director of the Museo de Arte Contemporáneo (MAS), and signed by more than sixty artists and academics. It points to a series of exhibitions that have been scheduled around the globe, including the “Anton Kern Exhibition at the Guggenheim,” which ran from January 8 to March 4, 2019; “Anton Kern, a Picasso-like figure,” at the Museum of Modern Art in New York; “Michael Rosenbach: A Historical Sketch,” which opened at the Museum of", "The next Biennial should be held in 2020, with an overall theme of “ecology” and a selection of works. Their next edition will be staged at the Nanjing Biennial, the Art Science Museum, and the China Academy of Sciences. \n\n\nThe Willamette Valley Museum of Art (WVMA) in Salem, Oregon, has received a gift of more than three hundred works of contemporary art from the collection of the legendary American painter Frank Stella. The donation includes 125 works by artists who have been included in the museum’s collection since its inaugural exhibition in 1968 and includes the works of seventy-five artists.The gift includes works by forty-eight artists, including Francis Alÿs, Joseph Koon, Emily Hall, Mark di Suvero, and Mary Lambert, among others whose work has been featured in the WVMA’s public collections.The gift was made by the Quakers, who are longtime supporters of the museum. Quaker art historian and curator Gayle Rubin said: “Frankly, I’m shocked that this painting is here and is in such excellent condition. It was painted in the summer of 1968 by Frank Stella. This is a painting that has been on the", "The next Biennial should not be held until 2020. Making the best of a bad situation is a difficult task, and the current exhibition, which closed on March 23, only added to the uncertainty. This year’s event, which was organized by the international committee of the World Biennial, aims to invite the public to reexamine their relationship with and consumption of art. The theme is “Art and the Politics of Consumption,” and the exhibition will focus on the history of cultural consumption through the artworks and collections that were selected by the committee.“We are all facing difficult and dangerous times,” Ricca wrote on the theme of the exhibition. “This year’s Biennial will try to present the most radical and creative future.”The full list of participating artists is as follows:\n\n\nThe United Kingdom is planning to phase out coal-burning power plants and shift to renewable energy sources by 2060, in a move that will help prevent the spread of COVID-19, the highly infectious respiratory illness that has affected more than 250,000 people in the UK and Europe. According to the BBC, the country’s Department for Environment, Food, and Rural Affairs (Defra", "The next Biennial should take place in 2025, with a goal of 2022. The winner will be announced in the fall of 2022. The theme of the next edition is “The Future We Can” and the theme of the biennial’s second edition, “The Future We Can't.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Holly Byrd as the next director of the Pacific Standard Time (PSN) in Honolulu. Byrd, who has served as interim director of the museum since August 2019, will take up the post in January 2021.“Upon learning that she would be the next director of the Pacific Standard Time, Holly’s passionate leadership and steadfast dedication to the institution and to art made her an ideal candidate for the position,” said museum director Kumiko Ota. “Over the course of her five-year tenure, she has led the museum during challenging times, including her tenure as interim director, and has taught us a great deal about how to be effective and sustainable in our work.”During her tenure, Byrd helped shape the museum’s new partnership with the City of Honolulu, which will allow visitors to the institution to have a closer look at", "The next Biennial should not be the inauguration of an authoritarian regime but a beacon of democratic values in the face of the genocide,\" said Amnesty International director Salma Atoui.\n\n\nThe Astana Group, the Russian government-backed organization established to oversee the construction of the new United States–Russia International Architecture Biennial (US-RAB), has announced that it anticipates a timeline that would see the biennial take place in the first half of 2020. US-RAB will crown a new pavilion at the Milan architecture biennale in October 2020, the same month as the Milan Games and the Milanese Film Festival.The venue, which will also host the 2020 edition of the Venice Architecture Biennale, will be inaugurated by a public exhibition of work by seventy international artists, including Ed Atkins, Ron Gorchov, Barbara Gladstone, Zoran Škoff, Peter Kreuz, and Joshua Maltby. The pavilion will be inaugurated by a symposium entitled “Why Architecture Matters,” organized by the US-RAB committee.Commenting on the biennial, US-RAB president Marina Vassallo said: “US-RAB is extremely excited to welcome the pavilion to Milan,", "The next Biennial should next be held in 2021. The 2022 iteration of the festival will be staged in Qatar, and will be preceded by the 2022 and 2022 Bishops' Conferences.\n\n\nThe Art Newspaper has published an open letter by thirty-eight artists, including Kate Hoberman, Ali Gharib, and Michael Singer, urging the British government to recognize the Palestinian state with the following words: “We believe that the establishment of a Palestinian state alongside Israel in the West Bank and East Jerusalem would be in the national interest of the United Kingdom and the whole of the world. The establishment of a Palestinian state alongside Israel would also be in the interest of the international community, including the United States and Europe. We therefore encourage you to press for the United Kingdom to take a leading role in promoting international efforts to secure a lasting peace for Palestine and to engage with our European partners and our Palestinian allies at the London and US-based Palestinian Art Tours, where I have been a member for more than twenty years. We hope that this letter helps you make your views on the matter clear. Gareth Morgan, Campaigner at the Middle East Forum, said: “This is an issue that should concern all of us, and it", "The next Biennial should be held in 2020 and the first in 2021. The 2019 exhibition was entitled Art and Death: The Art of Death, and the 2020 edition will be titled Death and the Art of Life. The event will be organized as a platform for reflection on the interconnectedness of the world and its ever-changing landscape. The exhibition will be closed to the public from February 19 to February 21 and will feature new artworks by more than sixty artists. \n\n\nThe SculptureCenter in New York has received a gift of over 2,500 works by seventy-two contemporary artists from the Smithsonian-Florida International University in Miami Beach. The institution has also gifted over 1,200 works by forty-eight artists from fifty-two institutions in the United States and the District of Columbia. The gift includes works by Charles A. Beard, Ana Mendieta, Joël & Madeline (America), A.J. Antoine, Jake-Paul Savage, John Carter, James Turrell, Michael Ward, and the New School, as well as works by artists such as Ermanno Olmi, Emily Dickinson, and Robert Irwin.“This gift is a milestone in our history as we celebrate the", "The next Biennial should be held in Abu Dhabi in 2021, and the exhibition should be completed by 2021, according to Desai. “Museums in Europe, the US, and Southeast Asia will be a part of the future,” Desai told the Art Newspaper. “The themes of the exhibition will depend on the time of year, and the person who is interested in participating will have the possibility to choose between black, contemporary, and pastoral themes.”More information about the show is available on the Biennial’s website.\n\n\nThe Palace Museum of Fine Arts (PMA) in Miami Beach has acquired the works of eighty-four artists, including Molly Cardinal, Robert Irwin, and Leila Weefur, from the Metropolitan Museum of Art in New York, including seventy-six works from the collection of William S. Burroughs. The acquisition, which also includes thirty-one pieces by artists such as David Salle, Bob Ross, Alan Kurdjavic, Terence McKenna, and Franz Kline, also includes works by the American painters B. Wicker,   C. Roach, and Ron Gorchov.The Metropolitan Museum of Art recently paid $202 million for", "The next Biennial should have been staged in the past three years. And for all the critics who have branded the twenty-third edition an “incomplete story of a man and his work,” the show’s director, Lina Vassallo, said: “I was well aware of how little time had passed since the exhibition had opened. In fact, the exhibition had just begun to open. It was only a matter of time until the exhibition was closed. When the exhibition was closed, the theme was the same as the previous two years—the transformation of art, the art of the past, and the art of the future.” The upcoming edition of the show, titled “Lately,” will focus on the role of narrative in art and will feature work by seventy artists. It will be on view October 27–November 3. \n\n\nLast year, the park-and-ride system operated by the Los Angeles County Museum of Art (LACMA) and the Museum of Contemporary Art (LA) in New York City was temporarily shut down because of a fire that broke out in a storage area in a building adjacent to the museum. The fire forced the temporary closure of both facilities and forced the", "The next Biennial should not only include an exhibition of works by the artists featured in the first Biennial, but also a joint project between the artists and the museum. The project should also include a number of new initiatives that would address issues of representation and identity and the relationship between art and the body. The invitation should also allow the artists to explore new ideas about how a museum can be a utopian community in which the identities of the participants are reflected in the outstanding collections of the biennial.“We are delighted to invite the artists to the inaugural Biennial,” said James Kiefer, director of the Arts and Humanities Research Center at the Museum of Fine Arts, Boston. “The idea of a biennial exploring the relationship between art and the body is an ideal time to make art and body connect. The artists who will participate in the inaugural Biennial are exceptional in their respective fields, and they represent a range of visual and performance disciplines. We look forward to their collaboration and to their engaging the public by showcasing their work in a series that will allow the public to see and relate to their work.”\n\n\nThe Deborah Gordon Foundation, a New York–based nonprofit that supports artists and their projects, has awarded the seventy-third", "The next Biennial should take place in 2020. The museum will then have fifteen years to organize the exhibition, which will be curated by Guadalupe Rosales, and to decide whether to reopen the exhibition.The museum has already been closed since mid-March due to the coronavirus. In April, the museum reopened with a new series of exhibitions, entitled “Tocantins,” curated by Elvira de Gennaro, titled “The Circumstances of the True Life.” The March and April exhibitions also featured works by artists such as Cécile B. Agnes, Emile Hirsch, and Wolfgang Richter.\n\n\nThe California Institute of Technology (Caltech), in Pasadena, California, announced today that the first six months of 2020 will feature work by American artist Maria Bamford. The twenty-ninth-century American landscape painter will depict the voyages of a group of voyagers in an opening-city setting, the Gulf of California, in a series of paintings that are scheduled to open in Los Angeles and San Francisco in December 2020 and December 2021. The works will be included in the “Lincoln Center Visitor Experience,” which will go on view in the", "The next Biennial should be held in 2021. The ten-person jury comprising Tomás Sandstrom, director of the Copenhagen Art Museum; Marjolein Søgaard, the director of the Randstad Museum in Bergen, Norway; Peter Ottenbæk, the director of the Museum of Modern Art in Oslo; and writer Sebastien Pape will convene in Bali and will select the forty-five artists for the exhibition.\n\n\nLocal authorities in Riyadh have ordered the immediate closure of Al Arabiya, the state-owned English-language television channel that specializes in broadcasting from the Kingdom, in a move that is considered highly sensitive by political opponents of the establishment of a strongman government in the second-largest city of the United Arab Emirates.The closure of Al Arabiya has been in place since March, when the channel ran a segment on the royal family that discussed the future of the royal family. The segment, titled “Diversity and Change,” was critical of Al Arabiya’s relationship with the Crown Prince and Princess, and was meant to address Al Arabiya’s experience of oppression under the Saudi establishment. While the segment has received critical acclaim from critics and many on the left, including", "The next Biennial should be held in the autumn of 2021, and the dates of the first and second editions have yet to be decided.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles, which was forced to cancel its 2021 edition after a worker was killed when a crane collapsed during a construction project, has postponed the event. The museum said the postponement of the event would not impact programming or fundraising for the year ahead.The postponement was made after MoCA board chair Tarak Ben-Shalomi said that the institution would be “in a stronger place for it’s postponement.” The institution admitted that the postponement was “difficult.” “We will continue to present a wide range of exhibitions, including the first, based on our new direction, while we carefully consider the future.”The cancellation follows a series of setbacks for the museum, which has faced mounting criticism for its treatment of workers at its Los Angeles outpost, the Museum of Contemporary Art (LA). Last month a report by the Los Angeles–based nonprofit the Workers Defense League (DPLA) found that at least forty workers were injured during a massive fire at the facility. The DPLA’s findings", "The next Biennial should be organized by the end of the year, once the necessary arrangements are made. The museum would like to extend a warm welcome to the artists represented in this year’s exhibition. BAFTA will host its first exhibition at the new exhibition space in October 2019.\n\n\nThe national museum in Virginia has installed a statue of Edward Colston in its lobby in honor of the artist who championed civil rights and championed Native American sovereignty. The statue, which was commissioned by the Virginia Museum of Fine Arts (VMFA) and dedicated to Colston in 2015, has been installed in the James Meredith Building, which houses the Virginia Museum of Fine Arts, at the intersection of Broad and Piedmont Streets in Richmond. The installation of the statue commemorates Colston’s life and work and honors his legacy. While Colston moved to Richmond in the early 1900s to study under the tutelage of the legendary Robert Rauschenberg, the city of Richmond placed the statue in his honor.“At a time when the city of Richmond was grappling with its own civil rights crisis, Edward Colston was bringing his vision of a new kind of city to life and transforming a neglected, largely African American stretch of Virginia City,", "The next Biennial should take place at the Stedelijk Museum, Amsterdam, in 2019.  Artforum has received a donation of 1,500 photographs by artist Marina Abramović.The Museum of Modern Art in New York has announced that it will donate some 500 photographs by artist Charles Bukowski. Bukowski, a self-taught painter who worked in a wide range of media, including drawings, prints, and paintings, died in 1974, leaving behind 26 works. His work was collected by the Museum of Modern Art in New York and the Metropolitan Museum of Art in New York in 2015. The collection is also on view in the exhibition “Charles Bukowski: Das Leben” at the Museum of Modern Art in 2021.The holdings of the Blind Art Museum in New York are now open for public tours. The museum consists of several buildings connected by a series of underground tunnels that were constructed in the seventeenth century, and embodies the Streit-Weisz-Kunst- und Wirtschüzen (Stretched Image of the World) movement. The museum also houses a collection of paintings looted from the Sudanese ruler Rabat in 1892. The museum is currently scheduled for a reopening in January", "The next Biennial should begin in the spring of 2021, with the theme “Art and the Rise of Modern Art.” The exhibition will have a maximum capacity of eighty thousand people and will be organized using a biennial approach, with the artists participating in a series of individual projects. The first artist to be featured in the exhibition is Amanda Al-Khatib, who has been selected to represent the United Arab Emirates at the Fifty-Eighth Venice Biennale. The artist will create a new memory of the city of Abu Dhabi, where she is based. The work will be based around the artist’s childhood memories of the American town of Algiers, where she grew up.\n\n\nThe National Gallery of Scotland has dismissed three employees after they filed a complaint about a hostile work environment at the institution in an internal email sent on March 7. The employees allege that the institution failed to protect the well-being of a curator and a researcher who worked at the institution for over a year. The complaint, filed by a former employee, witnessed a toxic work environment that included intimidation, verbal abuse, and a pattern of withholding of work by the two individuals, who were employed by the National Gallery of", "The next Biennial should be held in 2021. The 2019 event, titled “The Body,” attracted over one hundred thousand visitors.\n\n\nThe Institute of Contemporary Arts (ICA) at the University of Oslo and the H-P Museum in the city of Bergen, Norway, have announced that they have reached an agreement that will provide funding and logistical support to artists and scholars working in the fields of architecture, design, film, and installation in an attempt to combat the coronavirus pandemic.The ICA and the H-P Museum have been collaborating since the outbreak of the virus in Wuhan, China, and have worked together to develop projects and exhibitions on environmental health and sustainability issues. In order to protect the health and safety of visitors to the museums, the ICA’s exhibition “The Washing Machine: The Architecture of Myth” will be closed until August 30, 2025, and the ICA’s “Architecture of the Body” will resume in September. The museum will also introduce new technical and social challenges for visitors to the ICA. Ibrahim Kanaan, the director of the ICA, said: “The new partnership between the ICA and the H-P", "The next Biennial should be held at least twice a year, to include a season open to the public later this year, according to the organizers. The festival will also have a library, a collection of more than five thousand works, and a museum. The design of the new venue, which will be located in the city of Biennale, is being organized by the urban design studio Wunderground.The inaugural event, which was originally supposed to take place in late July, has been moved to September and will now run from September 20 to September 22. The new date for the festival, which commemorates the end of the Second World War, is still to be determined.\n\nAutumnal equinox is approaching, and the global climate is warming. The United Nations Office on Drugs and Crime (UNODC) reports that the number of drug-related deaths worldwide has increased by thirteen percent since 2015. In the US, the rate is 55 percent, and in Europe, it is almost double. In the first quarter of 2020, there will be more than eight hundred drug-related deaths—six hundred and forty in the US and twenty-six in Europe—including the worst outbreak of the novel coronavirus, which has killed at least 185", "The next Biennial should be held in the United States at the Los Angeles County Museum of Art (LACMA), in California, in 2022.  The 2020 edition was held at the Los Angeles County Museum of Art (LACMA), and was an in-house production, which was financed by the Los Angeles County Museum of Art (LACMA). The 2020 edition featured a number of works that were not previously on display at the museum. Among the works that were removed from the museum are the “Theater of Operations: The Gulf Wars” (2016), “The Politics of War: USSR/USSR Relations in the Early 1980s” (2016), “Given to the World: A World Atlas ” (2015), and “The Subtle Art of War: An Exploration into Strategic Thinking in the 1950s” (2013).  The 2020 theme, “Theatre of Operations” was chosen by LACMA director Brian Kennedy. “I think that the idea of staging an exhibition in the museum as part of a larger project, in collaboration with a larger community, is something that LACMA’s been doing for a very long time,” Kennedy said.", "The next Biennial should be held in 2021, and the twenty-ninth in 2022.\n\n\nFilipino American artist and filmmaker Eisa Cervantes’s enormous, nearly three-hundred-foot-long, high-resolution, three-channel, color-saturated, glass-enclosed, glass-walled, glass-enclosed, glass-walled, glass-enclosed, glass-enclosed, glass-enclosed, glass-walled, glass-enclosed, glass-enclosed, glass-walled, glass-enclosed, glass-enclosed, glass-walled, glass-enclosed, glass-walled, glass-enclosed, glass-walled, glass-walled, glass-enclosed, glass-walled, glass-enclosed, glass-walled, glass-enclosed, glass-walled, glass-enclosed, glass-walled, glass-enclosed, glass-walled, glass-walled, glass-walled, glass-enclosed, glass-enclosed, glass-walled, glass-walled, glass-walled, glass-walled, glass-walled, glass-enclosed", "The next Biennial should take place in 2022. \n\n\nThe Frederick Art Museum in Frederick, Maryland, announced today that it has launched a new digital platform, Frederick Art Talk, which will host a series of interviews with artists and other cultural figures from around the country, as well as biennial exhibitions. The platform is modeled after the online platform created by the Frederick Art Museum in 2007, which was a collaboration between the museum and the artist-run biennial Avant-Garde center, and will feature more than sixty interviews with local, national, and international artists, including Arnold Shafir, Mira Dancy, Tim Ferris, Sianne Edwards, and Christine Olszewski, among others.Current exhibitions include “Pace of Creation” (2017), which examines the roots of modernism in the works of French Impressionists René Magritte and Pierre-Auguste Renoir; “Merry/Nancy: Essays from the Collection” (2014), a collection of essays by contemporary artists such as Leslie Morgan, Tanya and Jodi Picoult, and Elizabeth Peyton, among others; and the inaugural edition of the Frederick Art Talk Podcast, which will debut on April 19", "The next Biennial should take place at the Radisson Blu. The show will then return to New York. The exhibition will run until September 28, 2020. The Qatari pavilion is not departing. The Qatar Foundation confirmed that the next iteration of the Qatari pavilion will be held at the Radisson Blu in New York. However, the announcement did not specify when the pavilion will return to Qatar.The Qatar Foundation’s director, Fawaz Al-Qasimi, said: “We are thrilled to return to Qatar to present the twenty-ninth Qatar Biennial, focusing on the philosophy of art and architecture, in 2022. We will continue to support and encourage artists and architects from Qatar in our ongoing international work, and we hope that you will join us in supporting their artistic and cultural pursuits.”\n\n\nThe Rubell Family Foundation has approved a $12 million grant for the preservation of a significant collection of artworks by the British American painter Harriet Hendry, with the grant supporting the Rubell Art Museum in London and the Tate in London. The grant comes amid the ongoing crisis caused by the coronavirus, which has infected more than 230 people in the United Kingdom. The museum’s", "The next Biennial should be held in 2021.\n\n\nThe National Gallery of Art in Washington, DC, is planning to shutter its doors for a period of eighteen months in order to complete a $55 million expansion, dubbed the National Museum of African Art, in honor of an additional eighty-three works by the great African American artists who have yet to be digitized. The museum, which has been a landmark of the city’s African American community for more than a century, will also open a new senior center that will include a dedicated space for the collection of African art.The inauguration of the new museum was celebrated on February 7, with a three-day celebration of African American artists, cultural heritage, and community on March 16, and the institution closed on March 24. In its place, the National Museum of African Art will boast eight new galleries, a gift shop, and a library that will also include an auditorium, classrooms, and exhibitions. The institution will also offer more than thirty years of archival programming.“Throughout our long history, we have been a vibrant center for the growth and preservation of art and literature,” said museum director Elizabeth Anne Hay. “The new National Museum of African Art will add an exciting new chapter", "The next Biennial should take place in 2021, and the exhibition will be relocated to a new location in the city—the Museum of Contemporary Art Toronto is currently relocating to its new headquarters, the Sherbrooke Town Centre, in Quebec City, Canada. \n\n\nThe Museum of Contemporary Art (MoCA), London, is expanding its fourteenth-century art museum from three hundred rooms to five thousand, and is rethinking how it intends to be the hub of its extensive collection. Instead of constructing an original and entirely new museum, the institution will now build two new spaces that will house its archives and will be equipped with a digital learning platform. The museum will also reenter an era of rapid change as it undergoes a major expansion, dubbed The Hub, of sixteen new galleries and a new campus.The announcement follows a year of construction that enabled the museum to expand its holdings of medieval and Renaissance art by more than three hundred works, and to present more than three thousand works in its new exhibition spaces. The announcement comes on the heels of the Museum of Contemporary Art, which is currently constructing a new structure to house the collection of Renzo Piano in Rome, a major undertaking that will take five years and cost $30 million. The museum anticipates that", "The next Biennial should celebrate the history of Biennials through a series of specially selected twenty-six contemporary works, which should be exhibited in a three-dimensional setting. \n\n\nThe Museum of Modern Art (MoMA) in New York has instituted a new seven-day week in its museum. Beginning on Monday, September 17, the museum will be open seven days a week, with extended hours on Fridays, Saturdays, and Sundays.Beginning just three months after the enactment of New York City’s $15 minimum wage ordinance, and just two days after MOCAD, the museum will begin offering free admission on weekdays. The institution is also planning to begin charging guests to visit its galleries on weeknights.Visitors will be able to rebooked into the museum for the sixteenth edition of MoMA NOW, which will take place on the museum’s southwest plaza on Friday, September 20, 2019. The program will be hosted by MoMA’s Helen Frank, whose role at MoMA was previously announced, and will focus on “local, national, and international artists and local movements.” Submissions for the 2020 edition are currently open.\n\n\nThe National Gallery of Art in Washington, DC, has", "The next Biennial should be held in 2020 and will be led by a group of artists and curators from the UK and associated regions. The theme will be “Body Politics.” The artists have yet to be chosen and will be invited to submit assignments in collaboration with a select group of curators and future exhibition dates will be announced.\n\n\nInstitute for Contemporary Art (ICA) at the University of Pennsylvania has appointed Meg McKean as its next executive director. McKean joins the ICA from the Massachusetts Institute of Technology (MIT) in Cambridge, where she has served as a member of the university’s graduate arts program since 2015. She will take up her new post in January 2020.“Meg is a seasoned leader who has built an impressive track record of developing new ideas and solutions to difficult challenges,” said ICA director Matthew Rosenblum. “The ICA’s faculty and staff have strong relationships with local, regional, and national artists and communities, and I am grateful to have the opportunity to work with them.”McKean previously served as president of the National Endowment for the Arts (NEA) in Washington, DC, where she ran the agency’s arts and", "The next Biennial should be in early 2020, with the exhibition opening on March 3, 2021. However, Artforum reports that the forty-six-year-old artist will now have a year to live. Yaya Nouri, who won the Prix de l'Europe in 2006 and was a finalist for the award in 2008, said: “I am deeply moved by the fact that the Biennial will not be over. Life and the future are precious to me. I am willing to give my life to this project and the lifetime of the exhibition.”\n\n\nThe Whitechapel Gallery in London has announced that Jeanne-François Oliva has won its prize for the 2020 edition of the annual Byelorussia Prize, which honors artists whose practice embraces both experimental and transcendent narratives. Oliva, who has exhibited internationally in the United States and in Russia, is the first African American winner of the prize. The biannual event, which is sponsored by Byelorussia, an umbrella organization of European artists, art collectors, and curators, will take place at the Whitechapel Gallery on January 22 and 28. The prize jury said that Oliva’s encycloped", "The next Biennial should be held in 2020.\n\n\nBirdLife International (BBI) has announced that it is now accepting applications for its 2018 biennial in the US, the first year the event has been held in New York since 1992. Led by artist-activists and activists Tanya Bonakdar and Carla Graziano, the festival, which aims to draw attention to issues such as climate change and the impact of urban development, was moved to the Javits Center in 2015. BBI will choose twelve artists and perform artists from a pool of eighty-four in order to present a new, year-long exhibition of work by each artist and will offer an additional $3,500 in prize money.The artists selected for the biennial were:Lauren Beukes, Art of the Fly, Aldous Huxley, Nicola Gail, Amar Sancho, Oswaldo Vargas Llosa Rodríguez, Kamel Menaschek, Fiona Witt, Lucas Moulène, Carolina Colombo, Vincent van Gogh, and Jean-Michel Basquiat.The biennial is supported by the Matthew", "The next Biennial should take place in the new building, which was completed in 1970 and opened in 1981. Organizers said that the decision to move the exhibition was made in response to the exhibition’s development, which is centered on a series of interviews with artists and activists, as well as the centenary of the outbreak of CVCV.\n\n\nThe Museums Association (MA), the United Kingdom’s leading professional organization representing the interests of the more than 1,500 museums in the United Kingdom, has welcomed the launch of a new digital platform, the 'Museum Digital, that will allow visitors to easily and quickly explore and share content across the museum.“We are extremely excited about this new initiative, and its potential to help our museums thrive more effectively,” said Patrick Mullaney, director of museums at the association. “The MDA will provide a unique platform for visitors to discover and share the museum’s collections and special exhibitions, including exhibitions from the museum’s recent collection runs, as well as new exhibitions, programs, and special events.”\n\n\nThe Museum of Arts and Design (MAD) in London has hired Adam D. Wilson, the CEO of the London-based production company", "The next Biennial should be announced by the end of the month. The show will be held at the Museum of British Art, New York, from March 7 to March 8, 2020 and will host a maximum of forty artists. “We are delighted to rise to the challenge of re-inventing how art is presented in the future,” said Anne-Marie Olszewski, head of the museum. The biennial will be organized as a series of exhibitions that culminate in a special exhibition that will take place in the museum in the spring of 2021. The exhibition will be themed “Future Art” and will include work by sixty artists.\n\n\nThe Museum of Modern Art (MoMA) in New York will create two new positions for artists, and possibly one for a curatorial role, in its new initiative to support creative professionals. The initiative, “The Museum Artist” and “The Museum Curator” will combine the two important cultural institutions in the city to launch a new cultural program that will begin this fall. The program will focus on retaining and becoming a core institution of New York’s arts community and will take the form of a series of exhibitions, lectures, screenings,", "The next Biennial should take place in the spring of 2020.The competition, which will be held at the Panasonic Art Museum Tokyo, will be organized as follows:Stephanie Baresi, a London-based artist, will present a piece for the competition in the spring of 2020. The exhibition will include new and experimental works by forty-five artists from thirteen countries.The artists chosen for the 2020 edition are:Yasmine Albar, Morocco, New Mexico, Mexico, Netherlands.Barres Fijiani, Australia, New Zealand, Australia, South Africa, Australia, Australia, Australia, Australia, Australia, Australia, Australia, Australia, Australia, Australia, Australia, Australia, Australia, Australia, Australia, Australia, Australia, Australia, Australia, Australia, Australia, Australia, Australia, Australia, Australia, Australia, Australia, Australia, Australia, Australia, Australia, Australia, Australia, Australia, Australia, Australia, Australia, Australia, Australia, Australia, Australia, Australia, Australia, ", "The next Biennial should take place in the Far East in January 2022,” Dusan Miro, the director of the Kiasma Centre for Contemporary Art in Tokyo, told the Los Angeles Times. “It will be a blank slate. It will be an opportunity to see the city from above and see the city from below, from the different perspectives through the artist’s works.”The full list of participating artists is as follows:The series, which will run for five weeks, will have the theme “SOLAR VOCABULARY” and will be curated by Ajay Chaudhari, the curator of space, art, and software at the Aligarh Art Museum in Bengaluru. The exhibition will also feature works by artists such as Hilma Benhabib, Nisha Chandrasekhar, Shirina Maung, and Kamala Harris. \n\nPresident Donald Trump signed an executive order on Wednesday that blocks U.S. troops from entering British Columbia until the coronavirus is contained, and reverses course on which direction the country would be heading in if it did not halt all troop movements until the virus is contained. The thirty-six-page", "The next Biennial should be held in the United States in 2020 and the first in Stockholm in 2021. \n\nThe Art Newspaper reports that the newly established Institute of Contemporary Arts (ICA) in the Swedish capital Stockholm has received a gift of 580 works from the estate of the late sculptor Olafur Eliasson. The gift was made in honor of the institution’s 150th anniversary and in recognition of his lasting legacy.Born in Stockholm in 1928, Eliasson was raised in the city of Malmö. He studied at the University of Malmö for a year and a half before graduating from the local Polytechnic School of the Arts. In the 1950s, he began his art practice, which evolved into his current endeavor to present contemporary art to the public through exhibitions and collections.In 1953, Eliasson moved to New York, where, for a short time, he met and began working with his future wife Ruth. Together they created a series of works for the institution, called the Art of the Land, which was shown at the Whitney Museum of American Art in New York from 1953 to 1953. The series formed the basis for their later works, including the monumental Cycles (2017), which were shown at the Museum", "The next Biennial should bring together speakers from the Americas, Europe, and Asia to examine and represent the diversity that makes up our continent. At this time of great uncertainty due to the coronavirus, we hope that the exhibition will encourage a sense of community and pride among our citizens and visitors in the art and design communities of the Americas and Europe.”\n\n\nYale Architecture, the University of Colorado (CU), and the University of Chicago announced today that Taormina Lagnado has received the 2019 Annie E. Casey Memorial Chair in Urban Design at the University of Pennsylvania. The highly anticipated prize was established in memory of Casey, a pioneer of American architecture and a pioneer of the exhibition.“It is an honor to receive the 2019 Annie E. Casey Memorial Chair in Urban Design from Yale University,” Lagnado said in a statement. “I’m thrilled to be the first to present the 2019 design competition to the audience at the Museum of Modern Art (MoMA) as part of this year’s Whitney Biennial. The architecture and design community has been waiting for this moment for a long time, and I’m proud to present it to them as the exhibition opens in October.”Commenting", "The next Biennial should take place in 2021 at the newly renovated Hansa Kunjuku in Nagoya. \n          \n\n\nThe Brügger-Institut für Kunstwissenschaft (BIK) in Frankfurt announced today that it will no longer present the biennial Equinox in 2020. Following a meeting with members of the institution’s board of directors on Monday, the institution announced that it will suspend the annual exhibition, which has been held at the Brügger-Institut since 1999, and refrain from publishing the Biennial’s catalogue, which has been the basis for the exhibition since 2001.The decision to take the exhibition offline was made in order to shorten the biennial’s run by a year, and to increase the number of artists represented by a smaller team of twenty-six artists, including Amanda Bell, Berenice Abbott, Nima Bulbul Rusu, and Tauheed Abbas. Commenting on the decision to cease production, Franz Beck, director of BIK, said: “The exhibition is a major source of inspiration for young and established artists in Germany, and a", "The next Biennial should be held in 2021. It will be organized in the same way as the previous two, and will focus on the theme of the year and the creative process. It will comprise approximately fifty artists and will be open to the public. The theme will be connected to the life and the work of the artists of that year.  Currently, organizers are working on the design and the painting of the biennial. The painting will be done in a studio, and the sculpture and the performance will take place in a museum. The museum currently holds twenty-four works by the contemporary artists who were born in the United Kingdom. This biennial will be a tribute to these artists, and will examine the international and creative exchange between the United Kingdom and France through a series of exhibitions. The biennial will also include a reception that will take place on Tuesday, February 12, at the National Gallery in London and will open on February 13. It will close on March 23. The new biennial will be led by the French curator Anne-Marie Savoy and will run until March 28. The biennial will also include an intermission on the theme of the biennial, and will be located in a former coal-mine near the C", "The next Biennial should take place in the spring of 2020.The first Biennial will be organized as a series of events which includes visits to the Museum of Contemporary Art (MoCA) in Los Angeles and to the Museum of Contemporary Art San Diego. The second will be in March 2020 and will run until the end of May.The exhibition will be curated by Jamie Hyneman, director of the New York–New Orleans Museum of Art, and will be inaugurated by a special exhibition titled “The Void.” The first museum visit for the biennial will be at the Museum of Contemporary Art in the Americas (MoCA) in Los Angeles on January 29. In 2020, the exhibition will visit the National in Washington, DC, and the Museum of Modern Art in New York, and will culminate with “A Frame of Perspective.” The exhibition will include new works by forty-eight artists, including Joachim Neumann, Nnedi Okpoko, and María Berrío, and will also include a new series of films which will open concurrently with the event.The biennial is one of several global efforts that aim to address racism and social injustice through the use of art and artmaking. The Landscape", "The next Biennial should focus on “Sophia: The Bold and the Beautiful” (2019). The next edition of the Melbourne Biennial will be held in 2022. The exhibition will also include special projects by artists and collectors such as Mitra Joshi, Dirk Piquemal, and Rodney Oostra. The festival’s director, Antony Hudak, told the Art Newspaper that the ten-day event will “continue to reflect a strong sense of history and a desire to create a future with the biennial in mind.” Born in New York City and raised in South Africa, the twenty-three-year-old Harsha is known for her work, which often addresses the themes of women’s rights, migration, and the African diaspora. Her work has been exhibited at the Kaohsiung Biennial, South Korea; the Art in Motion (New York and New York); and the Art Basel Hong Kong, among other locations.\n\n\nThe Museums Association (MA), a UK-based advocacy organization, has launched an online petition to the UK government urging it to increase the minimum wage to £9.10 by 2021 and institute a universal basic income", "The next Biennial should be held at the Museo de Arte Contemporáneo in Madrid, the Instituto de Cultura Pública in Madrid, and the Institute for Contemporary Art in Mexico City. For the third iteration of the exhibition, the exhibition will be held in August and will feature work by more than fifty local and international artists, including Alighiero Campos, Carolee Chan, and Lluís Barreto, among many others. The exhibition will be followed by a special exhibition, “The Lives and Works of Miriam Abney,” in January 2022. Prior to joining the Biennial in 2006, Abney was a visiting lecturer at the International School of Art, Art Design, and Technology (ISTAD) in New York. She received her Ph.D. in art history from the University of Vienna in 2009 and held an active curatorial role throughout her tenure at the institution. Commenting on her contribution to this exhibition, Abney said: “In the exhibition I will introduce new ways of dealing with the exhibition, and will assist the students in helping them understand that the exhibition is a theoretical basis for their studies. A great deal of the theory of", "The next Biennial should be called at the end of September. The next European Biennial should be held in December. The next Japanese Biennial will take place in January. The next International will take place at the end of September. The next Asian Biennial will take place on the first of February.      The next US Biennial will be held in March. The next Chinese Biennial will be held in September.  The next Japanese Biennial will be held in January. The next Indian Biennial will be held at the end of September.  The next Japanese Contemporary Art Biennial will be held at the end of September. The next American Contemporary Art Biennial will be held in March. The next International Art Museum St. Louis will hold its fourth edition at the St. Louis Art Museum from March 9 to March 12, 2020. The event will feature fifty artists, including Richard Diebenkorn, Yuji Noguchi, and Mary Ellen Mark, and will run concurrently with the forthcoming Strand Museum exhibition.\n\n\nThe John S. and James L. Knight Foundation in New York has named Richard D. Feynman chair of its board of trustees. The forty-seven-year", "The next Biennial should take place in 2021. \n\n\nThe Museum of Contemporary Art (MoCA) in Chicago has received a significant gift of twenty-six works from the private collection of Ronald and Lillian Gian. The gifts include works by twenty-two artists who have been added to the museum’s collection since 1972, including Michael Osel (1952–54), who is the lead artist in this year’s exhibition “Tirruk: Art of the River,” and Lawrence Abu Hamdan (1946–47), who has produced work that explores themes of migration, urban life, slavery, and the African diaspora.The works are part of an ongoing project that began in 1967 to expand the museum’s holdings of African American artists. The museum currently has twenty-five works by seventy-five artists from the African continent\u0097some of whose work are housed in the collection, which consists of work by artists such as Julian Schnabel, Gordon Ross, Frank Gehry, and Frank Gehry & Partners, among others.A biennial, which was announced by director Ron Howard in April, will host forty-four artists in December 2020.\n\n\nThe National Gallery in London has announced its representation", "The next Biennial should assemble a group of twenty artists from the London-based group the London Group, which aims to promote and support artists from the London boroughs. The 2020 edition will include work by twenty-six artists from a different group, including Portuguese artist João Castas, whose practice spans painting, sculpture, performance, text, performance, performance, painting, music, theater, and theater-making, and Faisal Islam, whose practice spans dance, dance, film, film, and film-making, and Salahuddin Chaudhari, whose work has been exhibited internationally.  The London Group is a 501(c)(3) organization that works with artists on projects ranging from books and films to exhibitions and residencies. “The London Group is committed to supporting artists and their projects through funding, organizing, and exhibiting their work,” said Paul Mpagi Sepuya from the London Group. “Our artists are not alone in this, and many others are working in the same space as you, and we hope that this exhibition will be a landmark event for their careers.” The exhibition will open at the National Portrait Gallery in London on October 6.\n\n\nThe Arts Council has released the", "The next Biennial should be held in 2021. The concept of a biennial is to create a public space where various cultural and political activities can be held in a sustainable and organic way. The museum is currently working with a farmer in the village of Wurttemberg in the Styrian region of Romania to create a biennial garden in the village. In the next year or two, the museum hopes to organize a program of exhibitions on the history of art and architecture in the city. “Art and architecture are inseparable from the history of peoples,” said Frantinus Maroët, chair of the preservation committee. “I will work with my colleagues to find a solution that will allow us to carry out our work in a sustainable way, while maintaining the artistic and architectural interest of the Biennale. . . . I want to thank my colleagues for their work and believe that together we shall succeed.”\n\n\nThe Museum of Fine Arts (MFA) Boston has received a gift of twenty-six works by Italian modernist Renzo Piano. The donation, made by Renzo Piano’s son, Marcello, comes in the form of a series of Walther-like works, most recently", "The next Biennial should be held in 2020. \n\n\nThe Pérez Art Museum Los Angeles (PAMLA) has received a gift of approximately twelve thousand photographs taken by painter Andrew Hill in the early 20th century. Founded in 1924, the museum is dedicated to the artist’s long-standing interest in modernism and its ultimate exhaustion during the Great Depression. The gift includes over two hundred photographs that were stolen from the institution in 2016 and were on display in an exhibition organized by the museum last year.The theft occurred on November 6, 2016, when the museum was closed for a week for maintenance. The theft also involved the exhibition “Travels of Peter and Paul: The Photography of Andrew Hill” (2016–17). Upon learning of the theft, PAMLA director Linda Schiffer and director of curatorial affairs Roberta Smith were quick to respond to a P.A.M. magazine reporter who wrote about the incident on Instagram. Schiffer wrote that the incident arose after the museum’s permanent photography gallery, which is located at 1 Paddle 10, was vandalized with a message that read “N***s Go Away” in large, red letters. The museum, which was also the", "The next Biennial should be scheduled for the spring of 2021. A full list of the artist’s projects can be found on Susanne Ziemba’s website.\n\n\nA jury composed of artists and curators from twenty-five countries has awarded a four-month composition residency to ​Michal Piotrovsky, an Austrian artist and prolific multimedia artist whose work was inspired by the collapse of the Tank and the Fall of the Berlin Wall, and whose work often reinterprets and reflects the current situation, and Sara Cwynar, a curator and author, in the United States, in the finalization of a $25,000 grant. “We are deeply honored to receive this grant, which will enable us to continue our work together and to continue to develop the SIT to play an even larger role in the art-world dialogue,” said Piotrovsky. “As we work on the exhibition of our first project together, we’re collaborating in a way that will have a lasting impact on the future of art and the future of artmaking in general.”The second biennial, which will be held in the German city of Bonn", "The next Biennial should be held in 2022. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that Laura Raebler has been appointed as its next president. Raebler will be the first woman to lead the institution, which was founded by architecture professionals Richard Meier and Robert Foster in 1977, and will begin in her new role on January 1, 2021.Known for collaborating with a number of artists and inventors, including Ralph Merkle and Stanley Meier, as well as for fostering a collaborative environment that fosters the exchange of ideas and bringing together contemporary artists and thinkers, Raebler also oversees the gallery’s permanent collection. Inaugurating the Gallery of Contemporary Art, she is organizing a series of exhibitions, residencies, and other programming that will focus on the work of women artists, and will present work by artists of different ethnic backgrounds.Other events that will be held at the museum include the launch of the exhibition “Adriana Varejão: Capella” (2019), “Unfinished Business” (2019), “Diana Al-Hadid: Avant Garde” (2019), and “Salman Khan: The Natural Histories”", "The next Biennial should be on the seventeenth, and the biennial will be held in the capital of the Republic of Belarus.The exhibition is part of the “Project for the New Millennium” and will showcase the work of twenty-nine artists across eleven cities. The biennial will be inaugurated by the work of the artist theadmiral prada, who is best known for his installations in which he constructs the appearance of a human body. The biennial will include the work of the artist thelaura roche, who is best known for her sculptures that examine memory and memory's construction, and of the artist theobelu, who builds a body from scratch.The institution will offer a range of programming, including a retrospective of the artist's work on paper and an exhibition of works by Tatjana Biczel, a professor of art history at the State University of Social and Cultural Studies in the city of Karelia in the country’s north. The exhibition will also include a book, a performance, and a film by the artist and the filmmaker. \n\n\nThe National Gallery of Scotland has received a gift of eight hundred rare paintings from the Royal Academy of Arts in London. Established by Queen Elizabeth II", "The next Biennial should include a reflection on the history of art, the art of the 21st century, and how collaboration and exchange are and continue to shape art.”\n\n\nThe Museum of Fine Arts (MFA) in Austin has named Rujeko Tani as its next executive director. Tani will assume his current post on September 1. Tani comes to the institution from the Los Angeles County Museum of Art (LACMA), where he is vice director for development and acquisitions. He succeeds David Ward, who retired after fifteen years on August 31 after seventeen years at the helm of LACMA.“With deep experience in both the arts and the biennial sector, Rujeko understands the challenges and opportunities posed by new technologies and how they intersect with existing institutions, new audiences, and new audiences,” said Ward. “Lucy is confident that Rujeko will deliver on the mission of LACMA and our community, representing the museum at the forefront of engaging with contemporary art and the current political climate.”Previously, Tani worked at the Broad and the Metropolitan Museum of Art, and was a founding partner of the Los Angeles-based partnership, Tani Partners, which has supported projects", "The next Biennial should be held in 2019. The next edition will be hosted by the Biennial Hotel, which will be relocated to the streets of Barcelona, and will feature a new exhibition of works by artists in the city. BRIC, a new initiative of the Barcelona Foundation and the Catalan Parliament, will also host a biennial at the São Paulo Biennial in September 2020.\n\n\nAustrian art historian and collector Dieter Ziegler has been appointed director of the Vienna museum of the history of art in the capital city. Ziegler, who has been traveling the world to collect works by contemporary artists, is the founder of the Ziegler Museum in Vienna and a patron of the institution. He will assume the role of director on December 15.“This is a great day for the history of art in Vienna, for we have just been selected for the twenty-third edition of the Schloss Jewler,” Ziegler told the Art Newspaper. “We are immensely excited for the work of our talented team and to the city of Vienna. We are also grateful for the support of our friends and colleagues, who made this possible, and for our colleagues in the art world who have been so supportive of our", "The next Biennial should take place in 2020, and the first in 2021.The appointment coincides with the opening of the museum’s new exhibition “The Death of the Body: Art and Consciousness in the Contemporary World”, which celebrates the centenary of the birth of Italian avant-garde artist Piero Manzoni. The exhibition, which will take up the themes of mortality and the body, is being organized as a combination of a retrospective, a residency, and a concert series, with the theme of the Biennial being “My Body and Me.” “As we approach the 50th anniversary of the coronavirus, it is especially salient that the museum has produced two significant works by notable artists, José Pedrosa and Alessandro Nanni, and that these artists were exposed to a great number of Biennials and Biennials were exposed to these artists,” Tommaso Bonisoli, the president of the Federazione Biennale, said. “It is particularly noteworthy that these works were created in the presence of the other museum. It is also important that these works were created by two famous artists, Pedrosa and Nanni, and that they were able to", "The next Biennial should be held in March 2020. The first iteration of the exhibition was staged in London in 2017, and the first exhibition at the new venue was the exhibition “Death of a Wretched World: Art as a Social Construct,” which opened in March 2019. The Biennial will be held at the Museum of Modern Art in New York from March 23 to March 25.\n\n\n\n\n\nThe Upper Room, a contemporary art space located in the city of New York, has announced that it is preparing to reopen to the public in March 2021. The institution will also begin welcoming visitors by March 15.The Brooklyn-based nonprofit announced the opening of the Upper Room, which will be located at 1500 Fifth Avenue, on January 31st, 2021, as part of its reopening strategy to the arts. The renovation of the space was funded by the $2.8 billion Creative Communities Fund, a new $2 billion urban investment program, and was led by Michelin-designed architect Lutz Böhlbau. The renovation of the original structure, which was constructed in 1981, was completed in 2017. “As we begin the next phase of our renovation program, we are re", "The next Biennial should be held in 2021. The 25th Biennial will be held in 2022.The 2019 edition of the Guggenheim Biennial, at a venue in Brescia, Italy, drew a crowd of 115,000 people. The event also celebrated the twentieth anniversary of the institution. Art historian and writer S. Thomas Szaszkiewicz, who is also the director of the Museum of Modern Art in New York, called the event a “miraculous achievement,” and wrote, “The museum is the only museum in the world which has devoted so much of its life to the preservation of a work of art. The Guggenheim’s relationship to the most precious objects of art is one of the great unifications of art history.”\n\n\nThe Tate has been granted a major new contract by the National Lottery to run a series of exhibitions and book signings in partnership with the British Library (BEL) for the next twenty-four weeks. The space will be taken over from the National Gallery after the institution is closed forever in the spring of 2021. The contract, which was awarded by a committee chaired by illustrator Ivan Serpa, will run from March 24 to March 28", "The next Biennial should be held in the summer of 2022. \n\n\nThe Royal Academy of Arts (RAA) in London has removed a controversial sculpture by Thai artist Kintintrikit Nreya that was part of a major new fundraising initiative for arts and cultural organisations that was set up by the Thai government after the country’s anti-terrorism bill was passed last November.The RAA, which is led by artistic director Zoraida Rajender, announced that it is “reconsidering the decision” following a ​review of the project, which was funded by a $10,000 grant from the Tyler Foundation, the Andy Warhol Foundation, and the Andy Warhol Foundation for the Arts, as well as a $350,000 grant from the Royal and Ancient College of Art in London.Rajender said: “I am deeply concerned about the legislation that has been passed and about the impact it will have on the creative and cultural sectors of our country. I hope that this will prompt Thai people to think of ways to support the arts and to think of ways to create new opportunities to support arts and cultural institutions.”The legislation—which makes it a crime to “belong to, support,", "The next Biennial should focus on “symbolism and its political implications” and “legitimate historical narratives” and “the digital sphere” and will be hosted by the Museum of Contemporary Art Los Angeles (MCA). In an open letter to the MCA board, activist Lily James wrote: “We are writing to express our concern at the way in which the MCA has handled the ongoing crisis in the Philippines. We believe that the MCA has sought to minimize, minimized, and obfuscated the truth about the situation, and has attempted, through various media outlets, to downplay the seriousness of the crisis in order to advance its political agenda. We believe that this has resulted in a prejudicial portrayal of the crisis and has contributed to the MCA’s political ambitions. We believe that this has compromised the future of the Biennial. We believe that the MCA has shown a complete misunderstanding of the critical role of art history in politically addressing the complexities of our time. We believe that the MCA has shown a complete unwillingness to engage with us, with whom it has had a long history of collaboration, and with the Filipino people.”In response to the letter, the museum said: “As an", "The next Biennial should be held in the second half of 2020. Source: The Art Newspaper, Artforum, Artforum UK\n\n\nThe Metropolitan Museum of Art in New York has removed a work by the late Polish-American artist Wojciech Marczak from its permanent collection after it was found to have been sold with fraudulent copyright registrations. The museum informed the American Civil Liberties Union (ACLU) of New York of the decision on Friday, September 3. The museum named the artist after Marczak’s mother who died in 1995. Marczak was among a group of artists who developed the practice of using images and text to explain the concepts of mathematics and physics. The work, titled Wojce Miecznia, was exhibited at the Museum of Modern Art (MoMA) in New York in 1988 and was included in the exhibition “Mathematical Colliders: The Work of Wojciech Marczak” (1989).In a statement issued by the ACLU, the organization said: “The Met did not communicate that this was a serious incident, let alone take appropriate actions to terminate the copyright. The Met was complicit in allowing this work to enter its collection", "The next Biennial should be held simultaneously in Hong Kong and Los Angeles, and will focus on the relationship between artists and collectors, and the political and cultural landscape in the United Kingdom. Hong Kong’s Art Pacific Art Museum and the Los Angeles County Museum of Art will collaborate with the British Museum in London to stage an exhibition of the artist’s art. Hong Kong’s Fine Arts Museum Hong Kong will host a three-day event dedicated to Mungo Park in the city’s Chinatown in an exhibition organized by the museum. The second stage of the event will take place in Hong Kong’s Ting Shui Cultural Complex in 2020.The third edition of the Hong Kong Biennial will be held at the Art Institute of Hong Kong (AIK) in Hong Kong, on September 8–September 12, 2020. \n\n\nThe Whitney Museum of American Art and the Metropolitan Museum of Art in New York have reached an agreement that will allow the facilities to remain open through at least 2024, reports the Art Newspaper. The agreement, which also includes a minimum of $1.2 million in financial assistance, was reached in a lawsuit between the two institutions in Manhattan federal court, wherein they were seeking to"]