["The next Biennial should take place in 2022. A show of the works of Carlos Pacheco, César Roca, and others will be staged in 2021.\n\n\nFounded in the contemporary neighborhood of Noguchi, New York, in 1963, the Whitney Museum of American Art (MoA) has grown to be one of the major cultural institutions of the city. With more than 1,500 works by thirty-eight artists, the museum’s collection comprises one of the largest holdings of African art in the United States. Many of the artists whose works are on display are based in the Bronx, where a collection of works by Claude and Paul Klee, Wangechi Mutu, and other African American artists is also housed.Awards include the Robert Rauschenberg–winning “The Unseen: Contemporary Art from the African Diaspora,” the 2019 Cynthia Cooper Award, and three 2015 trophies of the Ramon L. Alves Award for African Art. The Whitney is also a founding member of the Getty’s International Fellowship for African Art, which awards $2,500 to a nominee.\n\n\nMore than 1,500 artists have signed an open letter supporting the campaign launched by the Museum of", "The next Biennial should be staged in 2020 at the same venue in cooperation with the local community, and should be relocated. The venue will also be used as a space for special exhibitions and events.The renovation of the former São Vicim Museum in Rio de Janeiro, which is currently undergoing a major expansion, is being led by architect Nara Marin, the architect of the two-storied National Museum of History in Brasília (Mana), and the architect of the National Museum of Contemporary Art in the Americas (NOCA); the work, which is being funded by the Brazilian government, is slated to open in the summer of 2021.In collaboration with Pireaus, the Civic Foundation of Rio de Janeiro and the Nacional Centro de Cultura y Cultura Real (Mexico City), the biennial will host fifty artist exhibitions, including twelve exhibitions devoted to Brazilian artists; create new experiences for visitors to the city; and focus on themes such as spirituality and ecology.“We are excited to continue the work of adapting our city to the needs of the future and in this way support the civic activities of the city,” said Nara Marin. “Through the exhibition of the exhibition ‘Pereira: Inc", "The next Biennial should take place in the spring of 2021. The 12th edition of the show, titled Boschbauer, is slated to open in May.\n\n\nThe Vitra Foundation, which aims to bring awareness and understanding to the life and work of Joseph Vasquez, will donate $1 million to the October 2019 edition of its annual awards show, American Museum of Natural History. Vita is currently funding the exhibition, which explores the legacy of the artist and his pioneering contributions to American painting, through its October gala dinner, American Painting, and has already committed $500,000. The 2020 event, which is being organized by the Vitra Foundation in association with the Charles G. Wright Center for Contemporary Art in Santa Ana, California, is slated to open in May.“Boschbauer and American Painting mark the Vitra Foundation’s first exhibitions dedicated to Vasquez, and their incredible achievements make them stand out in this century,” said John R. Plumer, the foundation’s president and CEO. “We’re excited to share the work of Vasquez and his peers in a timely format with the donor community. We’re confident that the Vit", "The next Biennial should be held in the spring of 2021. Its theme may be “It All Comes Back To You” and will examine the relationship between memory and the human experience.\n\n\nThe International Center for the Visual Arts (ICAVA) in New York has appointed John R. Feeney as its next director. Feeney comes to the center as a director and curator and works closely with Whitney Museum of American Art director Daniel H. Weiss. He succeeds Susan Leffler who retired after eighteen years at the helm of the institution in July 2020 following twenty-six years at the helm of the Metropolitan Museum of Art.“At a time when visual art has experienced an unprecedented renaissance, and at a moment when artists are creating new and different forms of art, it is a great honor to be appointed to this extraordinary team,” Feeney said. “We are already experiencing unprecedented growth in the ICAVA, as we welcome more than ten thousand visitors each year, and we are committed to delivering even more transformational experiences to our audiences. ICAVA’s ambitious vision encompasses a wide range of programming that will engage with the ICAVA’s rich collection, our audiences, and our audiences’", "The next Biennial should have been held a few weeks ago, but was postponed due to the Covid-19 pandemic.The 2017 event, titled “What is New Art?,” was supposed to begin on May 12 and run through the end of May. However, the festival was forced to cancel the event due to the Covid-19 outbreak. The 2019 edition was set to take place on September 24, but was rescheduled for October 18.\n\n\n\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Margaret McCarthy as its next director. McCarthy comes to the museum from the Metropolitan Museum of Art, where she had previously served as director of planning and external initiatives. During her tenure at the museum, McCarthy helped the Met raise more than $150 million for its expansion, helped the museum become a major cultural destination in Southern California, and oversaw the museum’s expansion into an urban setting.“Margaret’s campaign for more than two decades has been driven by her commitment to building on and strengthening the Met’s legacy as a cultural institution that celebrates the rich legacy of American art, history, and design,” said Met spokesperson Kim Gordon. “This is a critical time for", "The next Biennial should take place in 2020.The radical New Democratic Party (NDP) government in Canada announced its intent to scrap the monarchy as the country enters a period of transition following a royal coronavirus epidemic. The coronavirus outbreak has made the coronavirus an internationally recognized health crisis, and the coronavirus crisis is expected to take at least ten years to resolve. The coronavirus can be spread by direct contact with the virus, which is primarily transmitted through close contact with an infected person, and has been shown to affect both people and animals.The coronavirus is spread mainly by coughing, sneezing, or having respiratory infections from the same person. Anyone who has symptoms should seek medical attention and let someone know if you or someone close to you is ill. If you or someone close to you goes to a hospital without medical attention, call the police.\n\n\nThe Brazilian city of Recife has banned the sale of all alcohol and its products in an attempt to stem the coronavirus outbreak in the country. According to the Associated Press, the measure was made in response to a spike in cases, which have also been blamed on the city’s air conditioner, the municipal water system, and other infrastructure. While", "The next Biennial should take place in 2021. The 2018 edition was held at the newly renovated and expanded National Museum of Canberra, which opened in 1972. The Museum of Modern Art in New York and the Metropolitan Museum of Art in the United Kingdom also have 2017 editions slated to open in 2021 and 2021, respectively.\n\n\nThe British artist and publisher Frank Gehry, who made a name for himself in the postwar era by creating works that address issues such as urban planning, the environment, and social justice, died on Monday at the age of eighty-one. Gehry was born in London in 1940, the son of German immigrants who emigrated to the United Kingdom in the early 1940s. After receiving his undergraduate degree from the University of Chicago, Gehry moved to New York to study at the Royal Academy of Arts. In 1947, he enrolled in the Johns Hopkins University Art School, which is where he met Alice Bright, who became the couple's collaborator and the father of their first child, Robert, and later their first child to another. Gehry moved to New York and started a successful career as a landscape and public artist.In 1974, he began his monumental project, Gehry’s New York City, the culmination of two decades of", "The next Biennial should be held in the autumn of 2021. “This is an extraordinarily important season for Beijing,” said Wang, who will assume her post in November. “With the coming of spring, the city’s cultural scene will be rejuvenated. I look forward to deepening the engagement with the city I have long admired, and building on the legacy of my predecessor Hu Jintao.”\n\n\nThe Los Angeles County Museum of Art (LACMA) has received a gift of twenty-five works from the estate of the late French surrealist Edouard Vuillard. The works were donated by Louis Vuillard’s son-in-law, the German art historian Alÿs Vuillard. In addition to the original ten-by-eight-inch drawings by Vuillard, the museum also received a painting by the German Expressionist Heinrich Neuschwanstein, a drawing by Jean-Luc Gauguin, a painting by Ellsworth Kelly, a sculpture by David Salle, and a painting by Ruben Alarcon.Alarcon, the founder of the Los Angeles–based nonprofit Apartment Therapy, has been donating works to LACMA since 2006. Since", "The next Biennial should examine how the cultural heritage of the United States has changed in the course of its continuous migration and expansion; and should consider how cultural heritage institutions are responding to the changing needs of society. The 14th edition of SITE Miami Beach is currently underway.\n\n\nJapan is planning to spend $1.2 billion to rebuild its national museum of modern art (MMAM), which was badly damaged by a devastating earthquake and tsunami in March 2011, and is hoping to open it in December 2021. The plan was made before the country was able to confirm the safety and sustainability of the renovation project, and, as a result, the museum’s exhibition designers were forced to make changes to the show.“The museum has reopened, but there’s still work to be done,” said Yoshiko Sato, the director of the Museum of Modern Art, Japan. The museum has also been working on several other large-scale projects, including a new exhibition of work by artists such as Naoto Watanabe and Shigeo Takemoto, and is currently preparing to present the twentieth exhibition in the ’50s, ‚The Red-Tape Show,” at the Sasebo Museum of Contemporary Art", "The next Biennial should take place in 2021.\n\n\nThe Tate’s board of trustees has appointed Sir David Attenborough director of the annual event, Artforum’s annual triennial, and the British Film Institute (BFI) as co-sponsors for the event. Attenborough will have the opportunity to develop a new model for the event, which has been held in London since 1992, and will begin his tenure in January 2021.The announcement was made at a special meeting of the board at the Tate on Tuesday, October 21, and follows an extensive review of the institution’s future plans, which were led by Sir David. “The board of trustees is delighted that David will be a part of our final year at Tate, preparing us for the future and elevating our exhibitions, programming, exhibitions, and events in the coming years,” said Tony Lane, chair of the trustees. “Tate is on course to become a more important cultural destination in the UK and is determined to give the next trusteeship year a strong start.”Attenborough will take up his new role in January 2020. The biennial will run from March 12 to March 14 and will be curated", "The next Biennial should take place in 2022, and the next will be in an alternate location.”The 2019 edition, entitled Life on Mars, featured work by a group of artists from across the globe, including Simón Amor, Eric Cantu, Hiroshi Taniguchi, and Tania Santaroli, as well as original projects by artists such as John Berger, Robert Irwin, and Lilianne Barragan. The 2020 edition, entitled Man in Space, will showcase work by artists from the African continent, including Wenda Ward, Renata Cervetto, and Alex Kipchik, and will take place in the Central Art Museum in Orlando, Florida, from March 25 to March 29.The 2020 edition will be hosted by the Smithsonian’s National Museum of African Art and will be presented by the Smithsonian American Art Museum in Washington, DC.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles (MoCA), has announced that Jonathan Gunderson will be its next director. Gunderson, who has been serving in his role for only eleven months, succeeds Carol Tavares, who has led the museum since 2006.“Jonathan’s approach is to think through how we can use modern tools and techniques to", "The next Biennial should take place in 2022 and the next in 2023, respectively. The ($30 million) ANTI-CURRICULUM festival, which will be hosted by several cities across Japan, will also be held at the Museum of Modern Art in Tokyo, the Tokyo Metropolitan Museum of Art, and the National Museum of History in Athens.  The exhibition “Lincoln,” which will highlight the work of twenty-two contemporary artists, will open on January 4 at the Museum of Modern Art in Tokyo. The exhibition’s first section, “The Art of Relentless Travel,” will close on February 7. The second section, “The Art of Distant Tracing,” will open on February 13 at the National Museum of Art in Athens. The third section, “Gone,” will open at the National Museum of Art in Tokyo on March 3. The fourth section, “Monumental Poses,” will be held in the Museum of Contemporary Art Tokyo from March 12 to March 19.The fifth section, “Away from the Veil,” will be held at the National Museum of Art in Tokyo from March 16 to March", "The next Biennial should take place in Alexandria in November 2020. The first show was held in 1994. \n\n\nThe National Poetry Library in London announced today that it is currently closed until at least March 11, 2020, due to the Covid-19 pandemic. The institution will remain closed until March 14, 2020, for a three-day residency. The National Poetry Center, which is a subsidiary of the National Poetry Trust, now has two writers in the United States: Adam Davidson of the New Yorker and John Jackson Miller of the Los Angeles Times. Both writers are currently residing at the National Gallery of Art in Washington, DC.A staff member at the National Gallery of Art told Artnet News that the institution has been unable to secure new visitors to the Tate for months. The National Poetry Center is still trying to figure out how to make money from its holdings, though the organization hopes to raise up to $1.5 million to help with the complex. The Tate has also been struggling with an economic downturn exacerbated by the global health crisis for weeks. According to the London Times, the Tate’s director Maria Balshaw said that the center’s current business model—which does not allow museums or galleries to", "The next Biennial should take place in 2021. \n\n\nThe New York–based nonprofit the Museum of Modern Art (MoMA) has been awarded $1.9 million in support of a $3.8 million restoration project at the institution. The funds will go toward hiring a conservator and obtaining the building permit to remove the museum’s main building and open a new public plaza. The space is currently used by MoMA for the museum’s annual artist-in-residence program. The organization expects the project to be completed by June 30, 2021.“The restoration, an expansion of the museum’s Manhattan outpost, is a milestone in MoMA’s history,” said MoMA director and CEO Daniel H. Weiss. “This project will further the museum’s mission to give the public a new and exciting experience each week. We are grateful to the artists, curators, and staff of MoMA for their assistance and look forward to the opening of the plaza in 2021.”\n\n\nThe Metropolitan Museum of Art has received a new $1.8 million gift from the Paul and Grace L. Sackler Foundation in support of the museum’s expansion into a new building.", "The next Biennial should be a celebration of our history, but also the history of our future.”\n\n\nFive artists have been selected to represent Chile at the Fifty-Ninth Venice Biennale, which will take place in the city of Venice from May 5 to May 8, 2020. The exhibition will celebrate the country’s rich artistic heritage while still celebrating the visual arts, and will focus on the contemporary city of Venice. Participating artists include Ruben Suarez-de-Beccal, María Berrada, Albert Lubin, Elena Catellani, and Ana Mendieta. Previous winners include the contemporary Kiki Tajima, the indigenous artist Íñigo Corrias, and the Argentinean artist Carlos Pérez-Barba.The list of participating artists is as follows:Ruben Suarez-de-Beccal/Alberto Pérez-BarbaValle PardoeBienvenido ZunigaNancy ChristiansenBienvenido ZunigaNannie CorriasJorge FernandezJorge Fernandez(artistías nam-de-Ilduce)Hernan GonzálezJorge FernandezThe Americas Latina/Latinx Artist Prize2017 Marcelo de", "The next Biennial should be held in the spring of 2021.\n\n\nThe Italian city of Venice is preparing to welcome visitors back to the town square with a brand new art installation by artist Stefano Chella. The eighteen-foot-wide installation, titled Temple of God, is part of a series of works by the Italian-born Chella. Titled In Praise of God, Chella performs an animated rendition of the biblical scene in which the Italian city of Venice sits in the foreground, surrounded by cacti. The piece, which was commissioned by the artist and his wife, Tiziana, was built into an arch of blue, white, and pink marble.The installation was created to honor the city of Venice’s town hall, the Fincantieri di Rivoli, which was demolished in 2016 and replaced by the city’s new government complex, the city hall of the city of Venice, Venezia di Rivoli, named after the original town hall. The sculpture, which incorporates panels of red, pink, and white, as well as text that reads in Italian, was installed in the courtyard of the Fincantieri di Rivoli, adjacent to the city’s", "The next Biennial should comprise of five exhibitions of work on a single theme, and will come up with a new format for the exhibition “From the Collection to the Present.”\n\n\nL.A. Philharmonic director Michael Rosenfeld has announced the commission of two new works by the African American artists N.D. Kennedy and Louis Armstrong. The works, titled Art in the Time of Blackness, and The Art of the South, will be on view in a retrospective at the museum in January 2020 and will be on view in the United States in March 2020. The artist collaborations come on the heels of the upcoming exhibition “African Art at the Museum: ‘From the Collection to the Present.” The show will feature new works by artists such as Marisa Mathison (New Orleans), Rachael Barlow (New York), and J. Marion Sims (New York). The exhibition will also celebrate its thirteenth anniversary in November 2020.“We are incredibly honored to present these new works by these magnificent artists, who have contributed so much to enriching our understanding of African American art and our own cultural heritage,” said Daniel H. Weiss, chair of the museum’s", "The next Biennial should be in the first quarter of 2020.  The 2018 event\u0097one of the largest and most prestigious art events in the United States\u0097was canceled due to the Covid-19 pandemic. The 2019 biennial, which will be held at the Museum of Fine Arts in Boston, will be pushed back several months and will not reopen.\n\n\nThe Canadian Council of the Arts (CCA) has announced that its next biennial will be held at the Sherbrooke Centre in Montreal from April 21 to April 23, 2021. The twenty-third edition, “The Catalyst: Canadian Art in the Age of Trump,” will be presented by the CCA and will be coadministered by the artist and curator Sonia and Iade Gardiner. The event will be hosted by the CCA at an estimated capacity of 7,900 attendees.Commenting on the upcoming event, the duo said: “Canadian artists are fighting for our democracy, for our values, for our way of life, and for the future of our country. We are at the forefront of challenging the politics of fear and misrepresentation, as well as challenging the assumptions and the discourses of the past. We are at the", "The next Biennial should take place in the spring of 2022 at the World Architecture Museum in New York. The exhibition will feature the work of thirty-two artists. “The draw for the inaugural event was the work of the extraordinary group of artists that have joined Oskar Eustis, Odilia Lippi, and Kirsten Aguilar in presenting the work of the 2015 Venice Biennale, as well as the exhibition of work by the artist Tina Delahanty,” said Konrad Bode, the founding director of the Art Institute of Chicago. The inaugural exhibition will be curated by Mark Ulrich Obrist, the curator of contemporary art in the United States; Hanna B. Adler, the director of the Frankfurt Gallery; and Hans Bacher, the curator of art in the National Museum.At the Art Institute, the institution will continue to present the work of the curators who have won the Paul Buchheit Prize twice, in 2002 and 2007. In 2020, it will present the work of the curators who have spent a decade at the University of Virginia, Richmond. The museum will also present some thirty-five works in 2020.Museum director Rony Ab", "The next Biennial should be held in January 2020. “The Panel Rejects Biennial,” wrote Stephanie Sze in a forum entry for the first issue of Artforum. \n\n\nThe Stedelijk Museum in Amsterdam has received a gift of twenty-seven works by Maurice Merode, a Dutch master of twentieth-century sculpture. The donation includes works by twenty-six works by artists from the “New South Africa” region and includes works by artists such as Deana Lawson, Leila Bly, and Tia Bonmakonda. The works, which also include works by Sydney’s Glyn Moody, were purchased in 1998.“The gift of the seventeenth-century native artist’s works is particularly significant, as the museum has been conducting research and exhibitions on his art in a Dutch public library since 2012, and one of the pieces in this collection is a gift that was recently presented to the museum for its special exhibition ‘Modern Art and the New South African Story.’”The Stedelijk Museum has also announced that it will begin hosting exhibitions by the thirty-eight artists who were nominated for this year’s", "The next Biennial should open at the newly renovated Charles and extends the theme of the show, “Bodhism,” by focusing on the spirit of the twenty-first century in this period. The exhibition will feature the work of fifty-eight artists and will run for thirteen weeks. The inaugural edition, “The End of the Art World,” will be held at the Buddhist Cultural Center in Bangkok, as well as at the Noguchi Museum and the Bishan Museum of Art.In June, the museum opened a new exhibition titled “Bodhism: From Art to Art” that explores the relationship between Buddhism and paintings. The show, which is curated by Sadao Ando and comprises fifty paintings by fifty artists, will open in September. The exhibition will also feature interviews with Rover Dzodan, Dzodan Bakhtiar, and Chantal Akunyong, among others, and will be followed by a book launch event on October 21.\n\n\nThe Konkani Art Museum in the northern Indian city of Konkala, the birthplace of the Konkani artist Surya Rao, is planning to open a modern pavilion dedicated to", "The next Biennial should be held at Squier University, in Cincinnati, as soon as possible. Artists and institutions will be invited to participate in a festival of contemporary art in November 2020. The biennial will be followed by a symposium on art and architecture in February 2021.\n\n\nThe Museum of Contemporary Art (MoCA), California, announced today that the institution will present a special exhibition of work by artists whose practices are at once experimental and experimental yet overtly political. The show, titled “Invisible Countries: Alternative Perspectives on Cultural Migration,” will include work by thirty-two artists who have left their countries of origin to pursue new creative and art practice in their home countries.They include Aki Shonibare, who traveled to Japan to study at the Sadao Academy in Wakayama and to live in Kumamoto, the capital of Kumamoto Prefecture; Susana Cervetto, who currently resides in Mexico City; and Colombian artist Carlos de la Rosa.“This exhibition is a way for us to give back to this great state of California,” said Lauren Kennedy, curator of contemporary art at MoCA. “The artists who will take part", "The next Biennial should be held in 2021.\n\n\nAstounding images from the 2015 coronavirus pandemic are finally starting to emerge from China, where the number of cases and deaths has surpassed those in the United States. The coronavirus A/California/9 has caused the coronavirus A/United States/California to enter its first year of control.  The coronavirus A/United Kingdom has been contained. Since January, the UK has been operating under a temporary lockdown, with all schools and businesses shuttered, and air traffic grounded. The coronavirus A.I.V.E.A. works in concert with the authorities to contain and prevent outbreaks of COVID-19. The coronavirus A/France has come under further attack in the country. As of Wednesday, there have been thirty-six cases and twelve deaths in France. The coronavirus A/Grenada is still running rampant in the island nation.\n\n\nThe Metropolitan Museum of Art (MoMA), the Museum of Modern Art (MoMA), the Whitney Museum of American Art, the Skirball Cultural Center, and the Metropolitan Opera House are currently closed because of COVID-19. All three institutions will reopen in phases, beginning", "The next Biennial should be held in 2021.  The programme will be curated by Suzan-Lori Parks, curator of contemporary art at the Museo de Arte Contemporáneo de Barcelona, and will unfold across three themes: 'The Future of Art and Society in the Twenty-first Century, ’s themes of continuity, transformation, and change. The programme will be hosted at the Museo de Arte Contemporáneo de Barcelona from March 7–March 10, 2021, and will be presented by Francisco de Anda, director of the Museo de Arte Contemporáneo de Barcelona (MAS); Paul Mpagi Sepuya, head of the Museum of Contemporary Art Buenos Aires; and Olli Tavares, a director of the Museo de Arte Contemporáneo de Barcelona.\n\n\nThe nonprofit organization Friends of the National Museum of Women in the Arts (Fontham) has received a gift of forty-six historic photographs, photographs by Henri Matisse, Pierre-Auguste Renoir, and Agnes Martin\u0097a seminal group of artists whose work is now being incorporated into the upcoming exhibition “An Open", "The next Biennial should take place in 2021, the biennial’s organizer and the Danish University of the Arts (and later the National Museum of Denmark) have announced.The Danish Arts Council (Dansk Artiska) has also announced that it anticipates a 2019 opening. The museum has previously funded the exhibition from the private funds of two individuals: Franck Runt and Bernd and Margot Rundquist. The museum will receive a commission from the Rockefeller Brothers Fund in 2021, and a 2019 production of the same name will be staged in 2020.\n\n\nThe National Gallery in London is planning to move 150 works by 120 artists from its collection to the new Redfern Gallery, which is currently under construction, in an attempt to revitalize the institution. According to the artist-run website Artnews, the move is part of a strategy to create more room for the arts in the already congested area of the museum, which is currently undergoing a $450 million expansion. The move, which will also see the building of a new gallery in the museum’s former location, is slated to take place in 2020.The move is part of a three-year plan to create more than 1,500 square feet of new", "The next Biennial should take place in 2020, but since the issue of the museum’s future has not been settled, the organizers of the exhibition have asked the artist to organize a different exhibition for the museum in 2022.“The future of Biennial Al Ain is at stake,” Al-Hayat wrote on Instagram. “We are ready to face this challenge. We are ready to change our future. We are ready for a new future. We are ready for you. We are ready for us.”The artist’s decision to pull his work from the exhibition was made in protest of the American museum’s decision to remove a work from the exhibition in 2017, a purge that many believe was politically motivated. When the work, titled (Without) a Symbol, was selected for the pavilion, it was criticized for its inclusion of a double head, a representation of the Egyptian pharaoh Khufu. Al-Hayat claimed that the omission of a representation of Khufu was an attempt to hide the fact that it is a work about the removal of the pharaoh. He also stated that the work was not meant to insult Khufu, but was instead a political statement against the US and Israel", "The next Biennial should focus on a reinterpretation of how the vernacular is represented in the Americas through the influence of Latin American and Caribbean art and the history of interventions in the nineteenth century. The year 2020 will also include a “trans-Atlantic series,” which will take place in September and September 2020 will mark the first anniversary of the opening of the exhibition.Sophie Edelsohn, the chair of the exhibition’s artistic committee and a curator at the Museo de Arte Contemporáneo Argentina (MAS), told the Art Newspaper: “It is an exciting time to be a curator in Buenos Aires. Taking part in the exhibition is a real challenge, but it is a very good challenge for a curator. We are working together with a younger generation of curators than we have had the opportunity to work with before, which is very important to me.”The foundation’s director Elena Csáthara told the Art Newspaper: “The next Biennial will hopefully be the year of ‘Latinx art.’ With the recent acquisitions of the Juanita and Nery Sánchez Collection, the curatorial team is already well-prepared for this challenge", "The next Biennial should take place in the same location in 2021. The 2020 edition of the exhibition, titled \"The Way of the Body, ’s Return to Earth,” will be held at New York’s Museum of Modern Art and will be followed by a “10-year retrospective of the work of the same author’s wife, Vivian, at the Panton Museum of Art, Paris.”\n\n\nOn March 15, the Museum of Modern Art (MoMA) in New York announced that it is giving the final touches to its new 80,000-square-foot, state-of-the-art building, which will be completed in the fall of 2022. The renovation, which includes the creation of new galleries, a conference space, and a public plaza, will also include the reconstruction of the library, an auditorium, and a new library building.“The renovation of the Museum of Modern Art is a major project that will deliver a new and larger venue for the Museum of Modern Art—one that will reflect the museum’s mission and create an exciting new chapter in its rich history,” said MoMA director and CEO Daniel H. Weiss. “", "The next Biennial should be held in 2021. The date was also announced as the day the exhibition “is not finished,” with the caveat that it “may go on.”Meanwhile, the aforementioned biennial will have an exhibition on the Guggenheim’s plans to move the museum to a new location. The exhibition will be organized as follows: From the Museum of Modern Art’s collection, with the collaboration of architect Adam D. Weinberg. Jung, who is known for her architectural work, was given the handpicked architect, Arthur Geffen, to design the new museum. It will be inaugurated in late June 2020. The renovation will also include the construction of a new entrance to the museum. The museum’s existing galleries have been expanded by 1,500 square feet and will reopen in late July or August. The new museum will include a gallery, a café, and a restaurant. It will also boast of a new philharmonic concert hall, a theater, a library, a research library, a conservation gallery, and a special exhibitions area.The design will be inspired by the museum’s long-standing home in the former factory district of Guggenheim", "The next Biennial should take place in the city of Bilbao in the coming months. The next edition of the festival will take place in the island of Benelux from October 26 to December 29. The 2018 edition, was scheduled to run from May 3 to May 25, and was canceled owing to the Covid-19 pandemic. The 2019 edition will be held in the city of the Basque Country from June 11 to July 27. The 2018 edition featured work from more than 100 artists from twelve countries.\n\n\nJoël Andrianomearis, the director of the Museo de Arte Contemporáneo in São Paulo, Brazil, has resigned after he gave an interview to a Brazilian newspaper on the eve of the opening of a new exhibition of work by Brazilian contemporary artists in the city. The show, titled Cinecittà arabesa, or Cinema of the South, will be on view until March 30 and will include work by artists such as Minalina, Tania Bruguera, and Agatha Christie, among others from Argentina, Brazil, and Uruguay.“I’ve been involved in curating for twenty years and this was a new", "The next Biennial should be held at the Venetian in Milan in June 2020. \n\n\n\n\nThe Catalan government has suspended construction work on a major $200 million arts complex in Barcelona, Spain, following the death of the Catalan artist and thinker Rania Sarr.Sarr, whose works include the drawings and paintings depicted in The City and the Land (2009), is survived by her daughter and her granddaughter, and was a major force in the development of the Catalan National Museum, the Museo de Arte de Barcelona, and the Catalan Cultural Center.Rania Sarr, a Spanish-born, Catalonian-born, and Catalonian-American artist, poet, and curator, was a master of the textile field. Her work is widely catalogued and consists of an assemblage sequence of interwoven textile objects that blend together geometric shapes and terraces, often juxtaposing the two. The sequence is a composite of collage, painting, sculpture, sound, and a number of traditional Catalan motifs such as the flag and the cocooned figure of a woman in a chamber.In 2012, Sarr was awarded the Presidential Medal of Spain, which honors the country’s cultural and artistic talents. The year", "The next Biennial should be held in 2021 and will be hosted at the former site of the National Museum of Fine Arts in Boston, which was converted into a museum in 2009. The biennial will include a number of exhibitions and will be led by an exhibition curator from Massachusetts.The museum will also launch a new digital platform, , which will host public programming in partnership with local arts organizations, and will hold a series of public meetings and public events. The platform will have interactive maps of the museum and will highlight work by artists and organizations that are active in the local community. The platform will also have a forum for public feedback and will serve as a resource for curators and researchers. “The Trans-Pacific Partnership,” which is among the many international trade deals being negotiated by world powers, will impact us all deeply,” said Chris Tellingham, president of the Boston-based advocacy group Boston Garden and Museum. “We are at a critical juncture as countries attempt to address the climate emergency and are forced to make hard decisions about whether to shift to renewable energy, shift to fossil fuels, or both. We must not wait for the international community to act, and we must not allow the forthcoming Paris Climate Conference to be hijacked by", "The next Biennial should be held at the same venue, the same date and in the same location in 2021. “We are grateful to the City of Melbourne and the National Gallery of Victoria for their support of this year’s biennial,” said curator Nathan Burrell, who also emphasized the importance of the work being exhibited in the exhibition. “As we approach the twentieth anniversary of the Melbourne Biennial, we will continue to present talented and experienced artists from around the world and demonstrate the transformative power of artistic practice.” In addition to the exhibition, the Biennial will stage a new joint exhibition between the two institutions, titled “Cultural Connections,” in January and February 2021. At a time when changes are being considered for Australia’s arts and cultural sector, the government announced last month that it plans to raise an additional $3 billion for the Australian Capital Territory (ACT) over the next two years. Its cultural sector fund was established in 2015 following the UK’s decision to pull money from the Royal Shakespeare Company and the National Galleries of Scotland, and has since raised an additional $1.2 billion for the ACT, the ACT, and the National Gallery of Victoria.", "The next Biennial should take place in 2021.\n\n\nThe Diller Scofidio + Renfro–designed Museum of Contemporary Art (MCA) in New York City is moving from its original location in Downtown Manhattan to a new building designed by the architect Daniel Libeskind. The museum’s board president, Matthew Diller, said: “The decision to move the museum from the city limits of New York to the environs of Connecticut, New Jersey, and New York State was made in the interest of creating a new facility that would better serve the museum’s mission of representing contemporary art.”The museum, which was founded in 1974 by two brothers—Wangechi Mutu and Ntô Ndzube—was planning to build a new 1,800-square-foot home in the former site of the former Diller Scofidio + Renfro building, which has housed the institution since 1995, but the Scofidio–Renaissance Revival–themed museum, which celebrates its sixtieth anniversary this year, has faced several setbacks since it began construction in 2005.The startup, which is still in the design phase, said it expects to be ready to welcome visitors in the", "The next Biennial should be held in November 2020. The 2020 event will be held in the museum’s auditorium, which is now being expanded.The renovation of the museum, which is currently undergoing a $10 million expansion, is the city’s second major undertaking for the museum in ten years. The renovation began in 2016 and is being overseen by architect Silke Kapper, whose design firm was awarded a $12 million grant from the city of Essen in 2018.The renovation of the museum, which was completed in 2017, was supported by a $4.6 million gift from the city of Essen. The building, which includes certain pieces from the collection of the former director of the Swiss Institute in Rome, was transformed into a multi-purpose exhibition space that has been used as the basis for a number of exhibitions.The renovation project is currently underway and is expected to be completed by 2021.\n\n\nThe Wangan Museum of Art in Singapore (Wangan) has received a gift of twenty-three works by artist Karl Lagerfeldt, whose complex, multidisciplinary practice centered around the interplay of technology and design in the digital realm, over the course of a decade. The gift includes works by seventy-seven artists", "The next Biennial should focus on the legacy of Raya (1934–1946), a Polish-born, French-born, and Italian-born artist whose work defines the threshold of modernist abstraction. “Raya was one of the first to use the term modernist in a meaningful way,” said artist Anita Roesler. “It was her work, the effort she made to make modern paintings, the way she used her art to push and shape the ideals of art history, that made her work so enduring.”Born in Kraków, Poland, in 1934, Raya was raised in France and moved with her family to New York, where she eventually settled in the Bronx. Her first major solo exhibition was at the Italian Museum of Art in Milan in 1947, and, a year later, she began a series of paintings that blend early modernism with the spirit of Marian West, the early American painter known for her powerful, abstract compositions that often feature crossed-out lines and geometric shapes. Her 1972 exhibition at the Cooper-Hewitt in New York featured paintings and drawings that are contemporary with the CCCM/LMF’s 2003 reopening, the exhibition’s first in the", "The next Biennial should be held in 2021, the venue’s director, Vijay Shah, said. The museum will also extend its footprint with the creation of a new memorial for the half-million women who were imprisoned in India during the country’s controversial \"Tutelage Revolution,\" in which hundreds of political activists were killed in a single night.Last week, Shah signed an order that permitted the construction of a monument honoring the women prisoners. The work will be dedicated by the government in 2022.Since the country’s landmark 2015 Supreme Court verdict against the country’s draconian anti-terror laws, which have resulted in a massive uprisings against police brutality, the government has cracked down on activists. In March, the government declared war on terror, and on March 19, it arrested and charged a number of activists for allegedly planning to stage a protest against the death of a man who died in police custody months earlier.The government’s crackdown has been exacerbated by the spread of the coronavirus, which has taken hold in China and is spreading rapidly, causing coronavirus-related deaths in China and other countries around the world. According to the New York Times, more than 6,300 people are infected and there", "The next Biennial should take place in 2020. Originally scheduled to open in 2019, the museum was forced to cancel the exhibition “We Are All in This Together,” a major show on climate change that was to have taken place at the museum in 2020. “We are all in this together,” reads a message written by artist Kader Attia on the exhibition’s website. “We are facing similar challenges now as we look back on the past, and hear from one another about our shared challenges. As artists, we are reminded of the many ways we can collaborate to address climate change.”A statement released by the Biennial said that the event “offers a window into the biennial’s programming in 2020. We are working together to understand how art, climate and politics intersect in our communities, and how art can shape and reconcile our worlds.” The article ends with a statement from the artist calling for “climate justice.”\n\n\nDuring the height of its popularity, the art fair Art Basel Hong Kong (ABHK) was a one-way street that located artists in a 20,000-square-foot space in a posh neighborhood of the financial district", "The next Biennial should take place in the next three years. The next one will be held in the second half of the year. The theme of the upcoming Biennial will be “Structure and Interpretation,” with a focus on the history of art in the city of New York. The two-year plan was first revealed in a letter on January 31, 2021 from Museum of Art director Marian Wright. “The formal announcement of our 2019 exhibition will not begin until December, 2019.”  The 2020 edition of the Biennial will be staged at the Chrysler Museum of Art in Plymouth, Massachusetts, in December 2020 and will be presented by the artist and writer Miranda June.\n\n\nThe 2018 exhibition “Triumph of the City: Art in the Age of Black Power” at the Metropolitan Museum of Art has announced that it will reopen with a “Wangechi Mutu–themed ‘Story of My Life’” in December 2021.  The retrospective will feature work by twenty-two artists, including Adair Potts, Mierlepong, Kiki Smith, Rghia Senz, Yinka Shonibare, and Jokai Singh, and", "The next Biennial should be held in 2020.\n\n\nThe New York Public Library (NYPL) has appointed Jean-Michel Baselwirth as its next board president. In his new position, Baselwirth will be responsible for the long-term future of the institution. He will assume his responsibilities at the library in April.“Jean-Michel is a resolute advocate for the New York Public Library, whose history and mission is often intertwined with the vibrant and vital creativity and cultural life of our city, and he brings an enthusiasm and vision for collaboration that will ensure that the New York Public Library remains an essential resource for the city’s creative and academic community,” said Librarian and director Russell L. Crowe. “His new role and his enormous experience in organizing a biennial mean that he will also have a profound impact on the library, which has been neglected and underfunded for decades.” Baselwirth expects to begin his new role by December.\n\n\n\n\nFrench New Wave band the Magic Magician�s Circle (MÜBL), whose sprawling, electro-informed, folk-pop recordings fused modern instrumentation with radio-friendly melodies, has announced its return to New York", "The next Biennial should take place in 2022 and will be the first presented by the Museum of Modern Art (MoMA) and the City of New York. The full list of exhibitors is as follows:Alan Miller Art Museum, New YorkMuseum of Modern Art (MoMA)Daniel Pinchuk Gallery, New YorkMichael Kimmel Gallery, New YorkDavid Zwirner, New YorkMarlene and Michael Kimmel Gallery, New YorkMichael Wessel Gallery, New YorkNancy Spector, New YorkLauren and Ben Sherman atelier, New YorkMarc-Olivier Brunel Gallery, New YorkNancy Spector, New YorkKeller Gallery, New York “Alfred W. Wise Gallery, ” 2017 Art Gamblers Awards, 'The Artist’s Choice Awards, ‘The Short Film Award,’ 2017 Artists Fund, “The Artistic Fund,” 2018 Artists Fund, “The Artist Awards,” 2018 Artistic Fund, “Alfred W. Wise,” 2018 Artistic Fund, “Jasmine Acevedo,” 2017 Artists Fund, The Artist’", "The next Biennial should have a theme that celebrates Southern heritage and the South west coast of Australia, and will highlight a variety of stories that are shared through the exhibition. We will also explore new and more collaborative ways of approaching the exhibition to consider how the exhibition and public are connected in the contemporary world.The theme of the 2020 tour is “Ocean,” and will be based around the themes of the seasons and the natural world. The works will be curated by a team comprising Nora Gelb, art curator, curator of contemporary art, and curator of contemporary art, Taher Atoui; Oswald Merz, director of the Kunsthalle Stuttgart; Sophie George, curator of contemporary art, New York; and Alessandro Cattelan, director of the Museum of Contemporary Art Sydney. Based in Sydney, the show will take place on two floors of the city’s central government complex. The second floor will be occupied by a new exhibition space called the Contemporary, which will invite contemporary artists to engage with the city’s waters.The 2020 exhibition will be titled “Ocean,” and will be on view until October 25. The 2020 show will feature work", "The next Biennial should consider how a dramatic increase in global average temperatures may be destabilizing natural landscapes and threatening not only biodiversity, but also human health and social cohesion. We should not forget that climate change is a global phenomenon and that this is one of the most pressing challenges of our era. We must therefore focus not only on adaptation, but also on action.”\n\n\nThe Los Angeles County Museum of Art (LACMA) has officially received a gift of fifty-two works by American painter Joan Mitchell. The collector, Larry Sheinbaum, of Sheinbaum Real Estate, the real estate arm of the Sheinbaum family, donated the works, which were in various stages of their development, in the spring of 2019.“We are thrilled to see these works on display in the first exhibition dedicated to Joan Mitchell in the United States,” said museum director Edward Aschenbach. “Her work has been represented by virtually every major American art museum since 2004 and has been collected by thousands of collectors around the world. We were impressed by her ability to adapt her own style in the face of technological change and her ability to create works that incorporate the most complex of materials while maintaining a strong sense of place.”The gift included", "The next Biennial should be held in 2020. It will be inaugurated by a presentation of the exhibition “Sophia and Peter Skoglund” (2019), which presented the catalogue in partnership with Peter Könitz, whose current projects include the Museum BAM (The Bärenkammese Green) in Berlin and the Brooklyn Museum.The Biennial will also include a presentation of Judith and Vincent van Gogh’s first painting, “The Stars and Bars,” which was made in the winter of 1969. The show will be held at the Van Gogh Museum from January 17 to February 20, 2020. The full list of participating institutions can be found here.\n\n\nThe Tate’s board of trustees has voted to extend the life of its contract with the controversial British artist, activist, and educator, Ahmed Musa, who advocates for greater freedom of expression and a more equal distribution of cultural resources. The decision was made in the wake of a controversy that arose after the artist created a work, The Carnival (2011), that drew a lopsidedly violent, sex-saturated medieval setting, clad in medieval costumes, to protest the UK’s Investigatory Powers Bill, which", "The next Biennial should have been held in February 2020, but was postponed due to the Covid-19 pandemic. The 2019 edition was set to take place in November.<|endoftext|>click to enlarge Photo: Courtesy of the artist.\n\nclick to enlarge Photo: Courtesy of the artist.\n\n\nArtist: Margaret Sanger\n\nWhen Margaret Sanger, the founder of the popular birth control pill RU486, became pregnant with her second child, she let her partner, George Bernard Shaw, share the responsibility of raising the child. The result was the seminal, four-decade-long exhibition “An American Born in London” (1991–), which contextualized the birth of the American consciousness through works that reflected her own ideals of idealism and optimism, as well as Shaw’s own interests in art.Born in 1888 in Boston, Massachusetts, Sanger began her career as a painter before she married her husband, an industrialist named Charles Sanger, and began her career as a novelist, filmmaker, and playwright. Shaw, a prolific painter, sculptor, and sculptor’s partner, also had a long-standing interest in art and was one of the original four founders of the American Institute in Paris.Through", "The next Biennial should be held sometime in 2018.\n\n\n\n\n\n\nThe History of Art Museum Houston (HMO) has received a $20,000 donation from the Fife Institute of Art. The gift was made in recognition of the institution’s ten-year anniversary and the museum’s contributions to the local community.The gift comes in the form of a $12,500 grant from the Fife Institute, which is an endowment fund composed of approximately $15 million from the Fife family in support of the Fife Institute’s collection and curatorial programs. The gift also includes the proceeds from a new $6.5 million partnership between the Fife Museum of Art and the Fife Art Gallery.The Fray Art Foundation (F.A.F., the nonprofit organization that operates and manages the Fray Art Museum) has received a gift of $8 million from the Jack and Rosalind Mathers Foundation. The gift includes $5 million in unrestricted funds from the Mathers, and $3.7 million in grants from the Fife Institute, which are currently being assembled and will be presented at the Fray Art Museum’s upcoming exhibition, “The Future Is Now.”", "The next Biennial should be held in the autumn of 2021. In a letter to the artists of the Los Angeles Biennial, which was published by the United States gallery, which represents artists such as Justin Hurwitz, Zoya, and Wolfgang Tillmans, the artists expressed their approval of the city’s proposal and questioned the need for a new event if the current exhibition schedule is maintained. The letter continued: “As we continue to present work in the new exhibition, we believe the best way forward for the Festival is to return to the original concept of the Festival as a platform for new and original art.” \n\n\nThe Solomon R. Guggenheim Museum in New York has appointed David C. Driskell as its new curator of 19th-century American photography. He is the first director to helm the museum since its founding by David H. Koch in 1966, and comes to the institution from the Yale Center for Art, where he has served as director since 2013.Driskell will assume his new role at the museum on January 18, 2021. He will have six months to organize a show of work by a single artist, and six months to plan a major retrospective. The thirty-two-year veteran art", "The next Biennial should, at the very least, feature 250 artists selected by a panel of eminent contemporary artists, including Chicago-based artist Yoko Ottolenghi and Hong Kong–based artist Hiwa Kang (who will collaborate to create a digital digital edition of their work), according to the New York Times. The organizers are also looking to increase the number of artists represented, to include a greater variety of ethnicities, and to incorporate more local materials.Commenting on their vision for the exhibition, the organizers said: “The next Art Biennial will be engaging in debates and discussions about the legacy of artists whose work has shaped and defined our time. We will provide a platform for contemporary artists to present their work in museums and will foster new understanding and appreciation of the legacy of a multiplicity of artists whose work has shaped the future of art through their various projects.”\n\n\nOriental American painter and sculptor Sun Hong, whose highly influential body of works—including The Landscape, 1969, which he created with his wife Sun Yee, the now legendary Americano-­feminist nude sculpture, and the 1989 sculpture Sulawesi: Southern Cross, a massive, thirty-meter-long, open-air sculpture", "The next Biennial should open in February 2020, and will consist of more than 60 works by artists who have lived or are currently living in the exhibition space. Inaugurating the exhibition is an exhibition of works that were exhibited at the Edinburgh Biennial in 2014, the Venice Biennale in 2019, and the London Biennale in 2018. The exhibition of the work of artist Berenice Abbott will run alongside the Exhibition of the Biennial, and will involve the exhibition of the work by artists who have been selected for the 2020/2027 editions of the Biennial.“Our successes are extraordinary, but we have a long way to go,” said Bjerggaard. “The Biennial will become a great platform for new and important projects, and I look forward to working with the artists who will be presenting their works at the exhibition.”The 2019/2020 biennial, “The Century of Art,” was curated by Bjerggaard and consisted of twelve works. The exhibition featured the work of seventy-five artists, including Andrea Bocchino, Rui Camil, Tania Bruguera, Gisèle Bruni, Frank Galan, and Marcel Knö", "The next Biennial should open in the autumn of 2020. The exhibition will feature works by around twenty artists. The first retrospective exhibition will take place in the capital city of Banu Cennetoğlu in the west of the country, in the capital of the Republic of Vanuatu, in the capital of New Zealand, and at the Central Museum of Art in Kiasma, in the capital of the State of Marrakech.Autumn/winter exhibitions in the biennial series are presented by the National Gallery of Australia, the Museum of Modern Art, the Art Institute of Chicago, the Museum of Contemporary Art, Sydney, and the Museum of Contemporary Art, Los Angeles. The biennial will be led by curator, artist, and curator-activist Christa Lee, whose work has been featured in full works by the London-based artist Rondônia Drahi.The Artscape biennial, which was established by Kate Fowle and David Kertie in partnership with the Australian Centre for Arts and Culture, is a digital platform that enables artists and creatives to present their work and receive additional support, including curating, exhibition placements, and workshops. The platform also offers services such as digital sales, booking, and payment. The", "The next Biennial should take place in 2022. The fifteen-year cycle of exhibitions, lectures, and other events has also been reworked to include a theme-driven year of events. The research program will be restructured to incorporate a more multidisciplinary narrative in 2020, and the exhibition calendar will shift to take account of the year 2020.The new architecture of the exhibition will incorporate both contemporary art and architecture, and will aim to create a space for the public to be able to see all of its artwork within the space of a glass-walled, concrete building. The exhibition will also include interactive activities and installations, pre-1972 works, and rare works by artists such as Chérélène Almodóvar, Diego Cesarco, Max Beckmann, Yale Diamond, and Jean-Michel Basquiat\u0097all of whom are represented in the exhibition. “The Biennial is an extraordinary platform for the museum’s collection and development of the work of the artists whose work we love,” said Jennifer Lear, director and chief curator of the Biennial. “This year’s exhibition gave audiences and scholars a unique opportunity to experience each artist’s work in historical context and was", "The next Biennial should take place in 2020. \n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles has appointed Alice Medved as its new curator of contemporary art. Medved will be responsible for guiding the Museum’s curatorial research and for developing curatorial practices that engage with local, regional, and national movements in contemporary art. Medved will begin her new role in January.“We are thrilled to welcome Alice to the Museum,” said MoCA director Andrew Kreps. “Her over twenty years of curating experience and dedication to the art of art makes her uniquely qualified to lead the next iteration of the Museum’s A.I. Contemporary Art, and we are confident that she will continue to grow our collection and our program as she advances as an expert in contemporary art.”In addition to her curating duties, Medved will serve as an artistic director for the Düsseldorf-based German nonprofit Düsseldorf-Institut für Bildung und Künste (DIK) and as a curator at the Museum of Contemporary Art (MoCA). Both organizations are working together to present a new exhibition of works by artists such as Richard Teacher and R", "The next Biennial should be held at the national museum in a year's time. Dubai: The History of Contemporary Art, which was launched by the Anglo-American architect Wajah Rukh Khan in 2006, has said it will not be able to reschedule the show due to a lack of funding. While the venue will continue to host exhibitions, it will not be able to host the works in the current exhibition, “The Promise of Life” as planned.\n\n\nThe Willys Museum of Art in New York has removed a work by the Swedish artist and filmmaker Olof Palme, who, along with his wife, Marta, created a moviemaking exhibition in the 1980s that featured works by as many as thirty artists. The institution decided to remove the work, titled Howl, from its website, which is hosted online, in order to protect the work and its future exhibition, which was scheduled to open in December.The blog post announcing the change, which was published on December 5, reads: “The museum found that there was a significant risk that the exhibition would be cancelled and that it would not be returned to the Palme family. There was also a risk that the show would be banned,", "The next Biennial should be staged in 2022. \n\nArt historian Lawrence Abu Hamdan, who was nominated for the $50,000 William C. Dieter Prize earlier this month, was awarded the $25,000 Fowler Prize for his article, “On the Historical,” in the September 2019 issue of Artforum. The winner of the award will be announced in December.\n\n\nLincoln Center—the New York nonprofit that raises funds and services for the arts and provides programming for the Lincoln Center and surrounding communities—has received a gift of $45 million from philanthropists Alex and Richard Armstrong. The funds will be used to create a new $51 million endowment for arts and culture in support of the Armstrong Family Foundation for their late founder, Richard Armstrong, a longtime supporter of arts and culture who built Lincoln Center into a major cultural destination in the city.“The Armstrong Family Foundation has been a central supporter of arts and culture in New York City for more than forty years,” said Elizabeth Armstrong, the foundation’s president and CEO. “While Richard was working toward moving the organization into a new location, he was developing the concept of the Armstrong Career Center, and he provided millions of dollars in support of that", "The next Biennial should focus on the relationship between art and the environment and will be inaugurated by a discussion on how art and architecture can work together to transform the environmental conditions in our cities and the world. In addition, a special exhibition of work from the Biennial should explore the future of architecture in a post-crisis world. The 2018 edition of the Biennial was held at the new Museum of Contemporary Art (MoCA) in Chicago, whose new building, completed in 2020, is currently under construction. The event will be held on Saturday, January 20, at 8 AM and will feature exhibitions, readings, performances, and workshops.\n\n\nThe British Library has released new images from its exhibition “Mirrors in Time”, a 2009 exhibition that explored the relationship between the human mind and the natural world, and the British Museum, which recently announced its intention to scrap its current exhibition “The Dream of a Natural History,” which explored the human potential created by nature through works such as the “Tree of Life” and “The Solar System,” which were on display from 2007 to 2010. The show, which was originally scheduled to run from November 11 to 25, 2009, was pushed back", "The next Biennial should be held in early 2022 and is currently in discussions with the Japanese government. The festival will hold the first exhibition of works from the upcoming exhibition “MoriArt” at the exhibition space Tokyo-Matsu in Tokyo on October 10, 2022.\n\n\nThe National Gallery of Canada in Ottawa is planning to open a new digital platform that will allow the public to view and purchase artworks in the institution’s collection. Titled Museum Connect, the digital platform will allow visitors to browse through the collection online and will offer access to the works through the institution’s existing physical location on King Street in Ottawa.The new platform will be housed in an expanded building that will house the National Gallery’s current collection, which comprises more than 850 artworks, books, and other related works, as well as a collection of works from contemporary and out-of-print artists. The newly acquired works will be given a digital presence and will be accessible to the public through a number of digital platforms, including the museum’s website and mobile apps.“As we continue to invest in our digital platform to support the museum’s mission, we developed a new way of organizing our exhibitions and programs that will allow", "The next Biennial should be held at the National Gallery in London, where it will be staged from April 18 to April 21, 2020, in conjunction with the Art of the American West. The exhibition will include works by eighty artists from fifty countries, and will feature a selection from forty-six artists.In a statement, the National Portrait Gallery said: “We are delighted that the National Museum of Scotland, which has shown the exhibition ‘Art & Life’ in its entirety in every year of its existence, will now be able to arrange a series of exhibitions which will bring together twenty-five of the greatest artists of all time.”It added: “The new exhibition will join Biennial 1 and 2, and will be curated by Sir David Attenborough, with the full support and expertise of the National Museum. These are not just thrilling times for art, but they are also the most exciting times for the natural world. We are confident that we will be able to create new ways of engaging with and celebrating the world’s greatest art later this year.”The Biennial 1 and 2, which were selected by an independent jury comprising Patricia Hulme (Southbank Centre), Andy Smith (University of Bristol), and", "The next Biennial should be on February 21–February 24, 2020. \n\n\nThe Fredric Bingham Foundation, the New York–based noncollecting art organization based in the Bronx, has appointed creative director John LaFeber as its next executive director. He succeeds Anna-Sophie Leyva, who retired in March after nineteen years at the helm of the organization.“In his new role, Fredric has been instrumental in securing the future of the Bingham-designed Art Museum and the Bingham-designed Community Center in the Bronx, which are both scheduled to open in the spring of 2021, and is committed to working with the community to shape future visions for these three landmark institutions,” said Fredric Bingham Foundation president and CEO Leo Iannone. LaFeber succeeds Marion Nestor, who became the foundation’s board chair after a new board of directors was elected in March. The new leadership team will begin working on implementing new strategic plans, including on how the organization will transition from a museum focused on the collection and display of contemporary art, to one focused on urban agriculture, and will decide on the future of the Bingham-designed Art Museum and the Bingham-designed Community Center.“", "The next Biennial should be held at the Center for Art and Photography (CAMP) in Stavanger, Norway, in 2022. [Update: April 3, 2 PM] The twenty-sixth edition of the Festival will now take place at the C-ART in Vienna from February 16 to February 17, 2020. The 2019 edition of the event will now be held at the C-ART in Budapest from February 19 to February 20, 2020. The date for the inaugural edition of the Sensate Art Summit in Barcelona is now set for September 6–September 10, 2020.  The 2019 edition of the German Marshall Memorial Museum’s Fall exhibition, “The Spellings of Eileen Park,” will now be presented at the National Museum Berlin from September 11–September 14, 2020. \n\n\nThe MacGill Gallery in London has announced the launch of its new digital platform, MacGill Museums, which will provide curators with the tools and resources they need to create and commission new works. With new services such as a mobile app, a blog, and a curated catalogue, the platform will help artists and curators across the United Kingdom.“In an age of ever-changing media and", "The next Biennial should take place in the late fall of 2020, at a date to be announced.\n\n\nThe Museum of the African Diaspora (MAD) in Virginia, the Woodlands, and the National Museum of African Art (NMA) in Washington, DC, have appointed Kate Edwards as the new director of the BIS. She will be responsible for growing and presenting research in the field of African art and culture.“Kate Edwards has been a valued member of the NMA for more than four years and has helped define the organization as a leading research institution within the American Academy of Art, which was founded by John S. and James L. Knight. Her recent curatorial projects for the exhibition ‘Re-Essence: Art in the Age of Black Power’ at the Woodlands Museum and the ‘Ask the Black: Evolution From Non-African Perspective” at MAD, as well as the exhibition “Africa in Perspective: Contemporary Art from the African Diaspora” at NMA, demonstrate her commitment to bringing fresh perspectives and new ideas to the museum.“Her new role will enable MAD to better serve the African Diaspora by fostering a more informed and diverse collection, by providing an expanded", "The next Biennial should be organized in 2020. The show will focus on the history of photography and will begin with “The Road to the Camera,” a series of photographs by Robert Frank that were taken in the early 1960s and that were published in the December 1966 issue of Photo.\n\n\nThe Metropolitan Museum of Art is planning to redevelop the former Chrysler building at 888 Fifth Avenue in Manhattan that was home to the Whitney Museum of American Art and the Metropolitan Museum of Art, and will release the final phase of the project in 2020.The redevelopment will include the construction of three new spaces that will help the museum reach its ambitious goal of more than one thousand works. The first phase will consist of the renovation of the building to bring it up to code and the second phase will include the construction of a new museum. The third phase will be a reimagining of the Chrysler Building, which was completed in 1971, and will be led by architect John Catsimatidis.“We are making great progress in the redesign of the museum, and we are confident that we will be able to present a show of works in 2020 that has the unprecedented luxury of finally opening,” said Steven L. Cohen, the director and CEO of the museum.", "The next Biennial should take place in 2022 and is expected to be inaugurated by an exhibition of works by thirty artists. The British Council has expressed optimism that the Biennial will further explore the potentialities of the site and will be an important step in the way of the removal of British colonialist figures from India’s institutions.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines for the temporary removal of statues of four prominent New York City figures: Frank Lloyd Wright, Nelson Mandela, and Martin Luther King Jr.Dressed as dwarves, the statues were installed in mid-March after activists delivered a defiant statement at City Hall in response to the reopening of the city’s Museum of the City on July 1. The action, which was staged by the group Make Room!, prompted the mayor to call for the removal of the four statues—Renaissance man John D. Rockefeller, New York’s second-wealthiest man, and his wife, Alice; their son, Levi; and their daughter, Zelda—who were installed in 1906 in a ceremony that featured an act of civil disobedience and the singing of a song by Bob Dylan—and the order that they be taken down. ", "The next Biennial should be held in 2020. For the first round of the inaugural exhibition, titled Gallery 1, the group presented Art and the Body, a triennial on the ideas and history of art, which will return to the city of Sarajevo in the summer of 2021. The project was selected from a shortlist of twenty by the Venice Architecture Biennale and will be curated by Mali-born architect Ruslan Vlasovski. The theme of This Place, which was inspired by the former residence of the Soviet Museum of Art in Moscow, was chosen by the organizers of the event, Andreas Postak, the director of the Haus der Kunst, and Sidney Fairs, the president of the NDA.\n\n\nFollowing the fifteenth edition of the Berlin Biennale, which opened on May 5 and ran through May 9, organizers of the event announced that the event will now take place in the month of September. The announcement comes on the heels of a series of recent cullings of the event, which has been called one of the most important events of its kind, and comes amid a global health crisis caused by the novel coronavirus, ", "The next Biennial should be held in 2021. The Danish pavilion, which featured art on the occasion of the opening of the Danish-Swiss pavilion in Athens in 2015, is currently on display in the exhibition “Feminine Wound: Contemporary Art in the Age of Resistance” at the CCAF. In a statement, the CCAF said: “The exhibition will focus on the development and deployment of new art in the context of resistance, feminist, anti-racist, anti-imperialist, and issues related to modernity, and will include a selection of work by artists that have never been presented before, including a selection of paintings and drawings that were never exhibited before, and a selection of works by contemporary artists that were created in the context of an authoritarian regime.”\n\n\nThe Seattle Asian Art Museum (SAAM) has announced that it will reopen to the public on September 7 after completing a $100 million expansion and renovation that added a second floor, a new lobby, and an auditorium in its former location on Fourth Avenue South. The renovation also added an additional 500 square feet of gallery space, expanded its public art collection, and added more than 1,200 square feet of gallery for the permanent collection", "The next Biennial should take place in 2022. This is the date of the exhibition “Prada: Fashion in a Day’s Life” (2017–18), curated by Wolfgang Puck and Marta Graziano. \n\n\nThe mid-Atlantic City Museum of Art (BAM) has received a gift of a pristine 1972 Rolls-Royce Phantom, which was missing from its historic 125-year-old building for more than six months. In a gift made in memory of the museum’s longtime director, Wayne Hall, the Rolls-Royce Phantom was gifted to the institution by a family friend.“Wayne and I have been close for years,” said Richard and Marsha Adams, the museum’s longtime benefactors and the parents of two of the museum’s four surviving children. “We had always hoped that a donor would see the value of BAM and recognize the importance of preserving the museum’s collection. We were hopeful that someone would understand how much the museum’s collection needed to be protected. We were skeptical that anyone would donate the Rolls-Royce Phantom.”The donation of the historic car, which was valued at between $1,", "The next Biennial should be held on September 25–28. Interviews with luminaries such as Ralph Kaufmann, Erich Maria Remarque, and Elin Østenberg will be featured in the exhibition. The museum will also organize an online version of the show, which will be free to the public, and will host biennial performances by artists including Joël and Gerard Boucher, Gerald Beuys, and Hélène Normand, among others.\n\n\nThe museum’s new collection of works by the Spanish artist Andrés Gutiérrez has been commissioned by the Pennsylvania-based artist and is currently on display in the museum’s exhibition “The Great Hand of Nicolas de Roozendaal: La Mágica II” (The Great Mágica, II), which will run from May to November in 2020. The exhibition will also include a retrospective of the artist’s work, a special exhibition of work by Pablo Picasso and Jean-Michel Basquiat, and a presentation of sketches by Jacques Perrotin.Museum director Ryan Spero described the collection as “a living organism,” one that responds to the", "The next Biennial should be held in 2020.\n\n\nÜkon Gallery, Chicago, is expanding its digital presence with a new collaboration with the artist-run site-specific platform LSDriver. The installation, titled “Telling Stories,” will be on view at the Illinois-based artist-run biennial “Telling Stories: A Biennial,” from April 24 to April 29. “The idea for the project came after I saw a video of the work by Frank O’Hara where a young American journalist, to whom he was attempting to connect, tells a story of his female body in a very matter-of-fact way,” said Tuomas Tappala, the director of the new institution. “This is a video work that is very much about the body and how you feel inside the body.”In the video, a young man plays the role of a voyeur as he films himself masturbating in front of a mirror. He then poses the question: What if the body became a medium for him to tell his own story?“In order to tell his own story, he has to strip himself of his identity as a man and as a", "The next Biennial should be held at the Art Institute of Chicago in 2021.  The 2019 edition was held in Los Angeles and featured work by more than 150 artists including Aziz Ansari, Harjant Gill, and Galang Kayankul, among others that were selected by the London-based jury for its inaugural edition.\n\n\nThe Chase Museum of Art in Brooklyn has appointed Adam Gopnik as its next director. Gopnik joins the institution from the Museum of Modern Art, where he has served as deputy director of public engagement since 2017. Prior to joining the Chase, Gopnik was director of the newly established Brooklyn Museum, which he helmed from 2015 to 2017.“Adam Gopnik’s leadership at the Chase demonstrates his ability and commitment to the Chase’s mission to nurture and develop a more inclusive, interdisciplinary, and community-driven future for art,” said Chase director and CEO David Feldman. “His ability to shape and build an institution that is grounded in the culture of his home city and to forge partnerships with artists, academics, and local communities through exhibitions, public programming, and fundraising is invaluable to the Chase’s long-term well-being. We look forward to his", "The next Biennial should take place in the summer of 2021, and will comprise a selection of works by forty-four artists, including Olu Ojo, Kiko Ise, Kim Kyung-kyeong, Kim Tae-kyung, and Kim Su-kyung, and will be held at the Seoul Art Museum, the Samsung Art Museum in Seoul, and the Art Museum Seoul.\n\n\nThe Museum of Contemporary Art (MoCA) in New York announced today that it has received a gift of twenty-six works by thirty-seven artists from the collection of the late collector Ruben Santiago. The works were acquired through a gift from the late fashion designer and philanthropist John H. Campbell, who passed away last November, and will be on display in the museum’s new One City, Two Towns, which is slated to open in the spring of 2021.“Ruben Santiago and John H. Campbell were beloved collectors, and we were honored to receive their contributions to the Museum of Contemporary Art in New York,” said MCA director Christopher Guillory. “This gift is a true reflection of their immense talent and their commitment to the museum. This is a museum that prides itself on its long-standing", "The next Biennial should be held in 2020. The exhibition schedule has yet to be announced.\n\n\nThe Sierra Club\u0097the influential, activist environmental organization that campaigns for environmental justice and promotes sustainable living through conservation and conservation’s social and economic impact\u0097has successfully petitioned the United States House of Representatives to take up a landmark climate-change bill that will address the country’s carbon emissions and make the United States the first country in the world to phase out fossil fuels entirely.Introduced by New Jersey Democrat Barbara Lee and West Virginia Republican Jim Jordan, the C-3521 energy bill, which is expected to be unveiled this week, would dramatically reduce the nation’s greenhouse gas emissions and carbon pollution while also strengthening public health protections, expanding access to energy efficiency and renewable energy, and reducing the nation’s dependence on foreign oil.The Sierra Club’s petition, which has garnered support from nearly two thousand environmental organizations and scientists, was launched by Sierra Club Executive Director Maria Oquendo-Villar, who said: “Today we are thrilled to announce that we have received the Democratic leadership’s historic climate action plan, which will truly protect the climate system and advance our most pressing environmental needs. We are", "The next Biennial should take place in 2021 and will include the work of thirty-eight artists, who will collaborate with museum professionals to create a new memorial for the victims of Conakry. \n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, has announced that it is planning to merge with the Los Angeles County Museum of Art (LACMA), which was slated to open in 2019, and has also appointed Terri Burke as its interim director. Burke will remain involved with LACCA until the conclusion of its endowment year in 2020.“In the aftermath of the Covid-19 pandemic, we believe it is important to honor the contributions of the past,” said board chair Mary Anne Carter. “Alan was our first board member to lead the museums in his exceptional leadership and leadership in terms of vision and execution. We are grateful for his insight and insights, both as board members and as guests, and we look forward to working with him again as the institution’s interim director.”The board also thanked LACCA director Adam D. Weinberg for her leadership in the transition and her leadership in promoting the museum’s program in a time of crisis. Moore recalls that Weinberg was", "The next Biennial should host a selection of works by female artists who are not already in the public collection; it should focus on the biennial as an institution in the prolongation of the work of a single female artist\u0097Jill Scott, whose work is currently in the collection of the Museum of Fine Arts, Boston; and it should culminate with a series of interviews with people who have had an important role in the Museum’s development.\n\n\n\n\n\n\n\nLinda Ronstadt and David Gordon Lewis (1901–2003). Courtesy of the artists. \n      \n\n\n\n\nThe Italian art historian Sotto Mier, who was known in the United States as a committed defender of the cultural heritage of Italy, has died at age eighty-nine. While he often attacked the country’s natural history museums, Mier often sided with the arts. He also criticized museums that he argued had grown too large and too attached to their historical sites, and he criticized institutions that were promoting cultural exclusions and misappropriation\u0097his criticism goes beyond the criticism of the cultural sector in general\u0097which he described as an “academic industry that thrives on the exclusion of other approaches, perspectives, and", "The next Biennial should be held in 2020. “The next Art Basel is not in Paris, it will not be in Hong Kong, and it will be a global event,” said Salome Noronha, director of the Biennale in Shanghai. The 2020 event will include a reinstallation of the pavilion in the modernist glass-enclosed Exhibition Hall 3, which opened to the public in 2005 and is now a landmark in Shanghai’s Regent’s Park. The pavilion, which hosts more than seventy thousand visitors annually, will also be expanded in the form of an extension of the exhibition “Revolution of the Body” in a glass enclosure ringed by large glass windows overlooking the Shanghai skyline. The platform will feature forty-nine works by fourteen artists, including Alexander Calder, Anish Kapoor, and Kazimir Malevich. The show will be held in conjunction with the forthcoming Biennial of Asian Art, which will take up the themes of the twentieth and twenty-first centuries.The 2020 theme, “The Future Is Present,” was chosen from a shortlist of five artists entitled “From Gallery to Theatre: A Cultural History of the Arts” by a grand jury", "The next Biennial should be held at the Art Institute of Chicago in 2020. The museum is currently preparing for its first reopening, which is expected to begin in 2021.\n\n\nThe Museum of Fine Arts (MFA) in Boston announced today that it will reopen on May 1, 2021, after weeks of construction and amid the Covid-19 pandemic. The museum, which has been closed since March 23 due to the coronavirus, has faced mounting criticism for its slow response to the novel coronavirus. Last week, the museum reopened to the public only hours after it closed to the public on March 26 following a massive temporary closure imposed by the city of Boston following the pandemic.Following a lengthy commissioning and design process, the museum is now reopening with a new collection of contemporary art, a public art garden and a new building designed by the museum’s board leader, Martin L. Bernad. The building will be inaugurated by an exhibition of work by the world’s leading contemporary artists.The exhibition “Among the Stars” will feature work by artist‐in-residence Megha Darshan, industrial designer Benoit J. Haer, and Brooklyn native Rayyane Hanna, as well", "The next Biennial should be held sometime between September 30 and November 22, 2020. The first will focus on the history of artificial intelligence and robotics. The second will focus on the history of medicine and biotechnology and the biennial will include performances, lectures, and interactive activities.   The 2020 edition will be curated by Elissa Ades, the curator of modern and contemporary art, and will run from September 25 to October 7. \n\n\nThe National Geographic Society announced today that it has issued a $2.5 million dividend to the Norton Simon-Kosovski-Mesner (NJM) Foundation. Established in 1989, the nonprofit organization supports graduate fellowships and scholarships for undergraduate and graduate students in the United States. The Foundation received its prize in 2017 for its award–winning project, “The Social Art of Plants,” a Hawaiʻi landscape painting project that was completed in 2016 and commissioned by the Los Angeles County Museum of Art between Neneh Cherry and Joshua Helmer. NPG said that the organization “has been committed to supporting fellowships and scholarships since 1989, and we’ve delivered over $2 million to NJM over", "The next Biennial should open in Hamburg in 2021. The next edition of the Twenty-Second Venice Biennale will take place in 2022, and the tenieth will take place in 2021. The twenty-third and twenty-eighth editions of the Fifteenth Venice Biennale will be held in the American city of New York and the twenty-ninth Venice Biennale will be staged in Venice. The second edition of the Twenty-Fifth Venice Biennale will be held in 2019, and the twenty-sixth Venice Biennale will be held in 2020. The twenty-seventh Venice Grand Palazzo is currently undergoing a major expansion, and renovations to the museum are currently underway. The construction of the new museum is estimated at $75 million.  The exhibition will also feature a number of newly commissioned works by artists in partnership with Piero \"Pino\" Solli. The area of the exhibition space that will be inaugurated by Michelangelo’s The Creation of Adam, which was commissioned by Antoni Graziani to inaugurate the museum, is being named after Simone de Beauvoir. In the work, the artist creates a particularly sensitive and intimate image of a naked", "The next Biennial should be held at the Temple of Fine Arts in New York, the French Ministry of Culture, and the Ministry of Culture of Venice. The exhibition will be divided into five parts: “The History of Art,” “Avant-Garde Painting and Video” “Western Art,” and “Asian Art.”The fifth section will focus on the history of the medium, and will include a selection of paintings created in the late nineteenth century and the early twentieth century.The upcoming biennial will be entitled “Alberto Burri: For a Future Unseen” and will organize various exhibitions, lectures, and other events. The exhibition will be curated by Cristina Vassallo, director of the Museo de Arte Contemporáneo in Rome; Jody Lowe, director of the Centre for Middle Eastern Art at the University of Exeter; and Andrea Catellani, the director of the Museum of the Mediterranean in Venice.The Venice Architecture Biennial will be held in the city of Venice from November 10 to December 7, 2020. “The Venice Architecture Biennial is an outstanding exhibition of contemporary architecture,” said Y", "The next Biennial should be held in the autumn of 2021, when the project will be sixty years old. It will be staged in the city of Biennale del Reale, in the city of Turin, and will be led by the Swiss architect Silvia Bickel.The institution, founded by architect Carlo Cipolletta in 1988, has located in a former steelworks in the city of Turin since 1993. It aims to present contemporary art by leading international artists in a manner similar to the exhibition format at the Milan Biennale. It is currently evaluating the best possible locations for the exhibition, which will be staged in nine venues, including the Museo Cervetto, the Palazzo Mago, the Villa del Fusi, and the Palazzo Bickel.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has received a $500,000 donation from the Ninth Avenue Foundation. The gift was announced in support of the museum’s “Anthropocene Initiative,” a $100,000 grant initiative that aims to support programs and activities that promote understanding of the Anthropocene,” and was made in honor of John Edwards. “John was a passionate", "The next Biennial should be in February 2020 and will focus on the work of artists living in and working in the New York metropolitan area.The second Biennial will focus on works on paper and will be hosted at the Museum of Modern Art in New York from February 21 through February 28, 2020. The first Biennial, which was held in a former Second World War munitions factory in Brooklyn, will focus on art from the Dominican Republic. The first Biennial was held in the Bronx in 2017.The new project will be focused on “creativity and its potential to challenge and transcend the limits and boundaries of existence.” This will be the second edition of the Biennial in the Bronx. The first, which was held in 1998, drew twenty-one thousand visitors. The museum will be transformed by the installation of a twenty-foot-wide glass-enclosed pool. The design also includes a new building to house the collection, archival exhibition space, and permanent collection. The pool will surround the Blue Hill and Blue Hill Streetcar, both of which are currently undergoing a $450 million expansion, and the Museum of Art, which has been the site of multiple commissions by artists such as Robert Irwin, Rachel Whiteread, and Soichi Hiro", "The next Biennial should be held in the first quarter of 2020, at which point the series should resume.\n\n\nThe Liberal Museum in London has received a gift of 10,000 artworks from an anonymous donor who donated them all, including Mark Struychtke’s The Life and Death of Ed Moses (1880), which he said was “a most important work in its own right,” and the first William Morris book, ed. H. A. Hertog, Preface to a New Testament, which is currently on display in the institution’s annual exhibition “Editions: The Art of William Morris.”In the exhibition, which includes works from the nineteenth century, the author of the autobiographical book Editions: The Art of William Morris will portray his early years in the United States, which he came to know through his own mother during the late 1940s through the 1970s. The work will also focus on the artist’s relationship with his mother, Willa Catherwood, and his sister, Rosemary, whom he married in 1964.Commenting on the gift, James Pickard, curator of the exhibition, said: “The contemporary art world is a bit of an anomaly", "The next Biennial should be held in 2021. The museum is also planning a major expansion, which will include the construction of a new glass-enclosed exhibition space, the auditorium, and a new courtyard. This new wave of creative activity will have a significant impact on the institution’s climate and will address some of the problems caused by the institution’s current exhibition space, the Building and the Centre , which is scheduled to be demolished in 2022. The Biennial of the Arts will also inaugurate the new exhibition space the Art of the Event—a space that will feature works by thirty-eight artists. The NYPL will receive $125,000 for the event and will present a selection of work by the artists in the building’s newly renovated space, which will be inaugurated as well.\n\n\nThe MCAFAM team is excited to unveil the first major expansion of its new space in São Paulo, Brazil, which will deliver an area twice the size of the Central Station and will also be completed in 2021. Constructed with funds from the Fondazione Mille Säuger, the MCAFAM Center for the Arts is part of the MCAFAM 's mission to advance culture", "The next Biennial should take place in 2022.<|endoftext|>Now that the dust has settled from Hurricane Maria, which has wreaked havoc throughout Puerto Rico and the United States, several states in the United Kingdom have declared emergencies. With the exception of Southampton, which moved its game between Bournemouth and Southampton on Sunday, all local authorities in England and Wales have been closed as they try to contain the coronavirus. While the coronavirus is spread mainly from person to person, it is also spread through direct contact with the infectious material, namely coughing or sneezing. The coronavirus is spread mainly from person to person, but it can also be spread by close contact. For example, if you let someone else hold your hand or carry you in public, you can be infected. Additionally, the coronavirus can also be spread by direct contact with blood, which is why people are being urged to disinfect their homes and to wash their hands with soap and water for at least twenty seconds after blowing your nose, coughing, or sneezing.Many states have also suspended festivals and other public events, and are preparing to shut down schools, businesses, and transportation systems as a public health precaution. While some municipalities have declared disaster zones, others", "The next Biennial should be held in 2022.\n\n\nThe museum’s second exhibition dedicated to the life and work of American painter Frank Gehry has been postponed due to Covid-19. The show, “Rethinking Gehry,” will now be staged concurrently at the gallery in 2021.The Turner Prize–winning artist’s last show at the Contemporary Art Museum St. Louis (CAMST) was last December, marking the first show of his new series “Gehry/Turin,” opening February 16. The show included seven paintings that were conceived as a continuation of Gehry’s architectural projects in the 1960s and 1970s and featured drawings of different elements of the works, including the cityscape behind the artist’s studio and the homes of his parents.“I had hoped to take this project from the day it opened, to the first show on the program,” said Gehry. “It is really a great honor to be asked to participate in the larger history of the Turner Prize, and to create a new work.”The institution has also released a statement regarding the 2019 show being staged at the museum. “We feel it is important", "The next Biennial should take place in Milan in 2022. The exhibition will be hosted at the Museo Hércules in Rome, with a view to a 2020 event.\n\n\nThe Academy of Fine Arts (AFM) in New York has announced that it is suspending all events and programming until at least the end of April because of the ongoing threat of an outbreak of the novel coronavirus. The decision was made after a series of social media posts by a number of specialists in the art world, including Damien Hirst, who described the current outbreak as causing him and his colleagues to feel unwell.Since the outbreak began in Wuhan in Wuhan, China, on December 3, hundreds of people in the US and China have been infected and more than 300 cases have been confirmed. While the virus has yet to be transmitted to humans outside of China, a number of cases have been confirmed in the US, where the disease has been exacerbated by a high level of air pollution. The outbreak has also led to a number of deaths in China, where many cases have been concentrated in the southern province of Guangdong.The Academy of Fine Arts, however, has not closed its doors and is actively seeking new members for its next cohort of fellows,", "The next Biennial should be held in 2020. Commenting on the event, said: “We are thrilled to return to the Black Rhino to showcase the work of individuals whose experimental and stylistic practices provide examples of future thinking about what art-making can look and feel like. We look forward to the 2018 and 2019 editions in the Black Rhino, and to demonstrating the newest work by the artists in 2020.”\n\n\nThe newly revitalized Museum of Colonial Art (MoCA) in Los Angeles has appointed John Michael Kist, who has served as interim director of the institution since 2014, as its next director. Kist, who finished his term at the institution on March 5, will assume his responsibilities on June 1.“We are thrilled with the appointment,” said Heather Ahtone, director of the MoCA Museum of Art. “John is a wonderful leader and friend and our institution’s long-term museum architect who has made a difference in the museum’s mission and growth over the last eight years. We are very much looking forward to his leadership and his visionary vision of the future for MoCA.”Kist, who is working on a new design for the institution that will incorporate more", "The next Biennial should be held at the end of the year. [Update: May 26, 2019] The 2019 edition of the Biennial has been moved from February 2–March 18. “We are all very excited to see where the event takes us next,” said Art Basel Hong Kong director Hsin-Chien Huang. “A new story is born every day, and we are eager to create it at the new venue in such a stimulating and enchanting setting. I welcome the challenge of the next stage as we embark on a new adventure.”\n\n\nThe Guggenheim in New York has appointed Maja Guggenheim as its next director. She takes the helm from Annefraim Richie, who retired on February 13 after serving as the executive director of the Museums Association in Los Angeles for twenty-five years.Guggenheim joins the museum from the Art Institute of Chicago, where she was the deputy director for the past three years. She succeeds Michael Porter, who has helmed the institution since 2015, and will begin her new position in April.“Guggenheim’s vision for the Guggenheim and the Museum has been guided", "The next Biennial should be arranged for later this year. The upcoming exhibition “Black Metal” will be staged at the Institute of Contemporary Arts in Oslo in December 2020. SOUTHAMPTON, UK: The exhibition “Southampton, “2017,” will be presented by the Southampton Biennial at the New Gallery, Southampton, in November 2020. Originally scheduled for September 2020, the event will now take place in February 2021. Switzerland: The exhibition “Art and the Power of Music: How Music Affects the Body” will be staged at the Swiss Federal Club, Basel, in November 2021. Originally scheduled for January 2019, the art event has since been moved to February 2021. Tunisia: Originally scheduled for April 2022, the exhibition was rescheduled for September 2021. \n\nThe Royal Institute of British Architects (RIBA) has said that it is investing more than £1 billion into the future of architecture in an attempt to stem the UK’s growing trend of spiraling out of control.In its 40th edition, RIBA Berlin will be held at the Westfalenborg, a former textile factory, in the second", "The next Biennial should be held in 2020. In the meantime, the university is planning to carry out a comprehensive review of its collections and its collection of art and is working with the museum’s director, Dr. Mikhail Botkin, to develop a new curriculum. The university is also introducing new learning experiences to enhance the local community.\n\n\nThe British artist and activist Ella Johnson has been named the recipient of the prestigious Prix de l’Amiti, an annual award comprised of two hundred books, artworks, and other objects. Johnson, who died in 2015 at the age of eighty, is the founder of the collective Permanent Web, a collective that works in solidarity with movements such as Black Lives Matter and the Women’s March. Posted on its Facebook page, the group’s statement reads: “Who has never dreamt of creating a community of people in solidarity with one another and with the planet? . . . Who has not pictured a world in which people come together to share their concerns, to share their fears, to share their hopes, to share their joys and sorrows? . . . Who has not pictured a world in which we are all a part of a common purpose, a common purpose", "The next Biennial should be held in the city in 2020 and will be led by the artist and curator Dalia Al-Hadid. The project will comprise a group show featuring works by the artists in the exhibition and a book.\n\n\nThe Östhistoriske Museum in Skåne, Norway, has been awarded the 2019 Prize for Art in Support of the Arts. The award recognizes the work of young artists working in the category of art. The prize jury, made up of Jørn Rasmussen, Andrej and Berit Jordt, and the artist Christina Lin, the women chosen for the project were Jesper Ulvaeus, Nias Mavigni, and Nia Moenner, all of whom are known for their innovative and interdisciplinary practice.“Perhaps for the first time in our history, the award is being presented to a project that is not an exhibition, but a living thing,” said Jørn Rasmussen. “This project involves the creation of a sort of repository for the history of art in general and of Öst’s own collections in particular. This is a living thing, a project that is continuously being completed and evolves as we learn about the past and the future.”The", "The next Biennial should also be held in November 2022.  The 2019/2020 edition, which attracted more than 7,000 visitors, ended in March after the museum canceled the event due to concerns surrounding Covid-19.  The announcement follows the Vancouver Art Gallery (VBG) and the National Gallery of Canada (NGA) canceling the 2020 edition, which was also scheduled for March 17–March 19, and which was originally set to run from March 22 to March 28.The Vancouver Art Gallery and the NGA have yet to make any further comment on the upcoming exhibition. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has hired Daphne Brooks as its next director. Brooks comes to the institution from the Los Angeles County Museum of Art (LACMA), where she has served as interim director for the past seventeen months. In her new role, she will oversee operations in the art department and will oversee the development of the museum’s artistic program, which is made up of a collection of more than thirty thousand works on paper, including works by artists such as Ed Moses, Robert Irwin, and David Salle.“We are thrilled to welcome Daphne to LACMA,", "The next Biennial should focus on “Gertrude Vanderbilt: an American Story.” The museum also wants to dedicate an entire spring season to the life and work of Betty Parsons. The second exhibition, titled “Gertrude Vanderbilt: From Sculpture to Word,” will debut at the Museum of Modern Art in 2020 and have the works of fifty-one artists or collectives represented.\n\n\nThe Museum of the African Diaspora (MoAD) in Seattle has received a gift of thirteen works by the talented, influential, and internationally acclaimed American artist Auguste Renoir. The donation, made by Auguste Renoir, Auguste Conti, Auguste Gassée, Auguste Holleman, Auguste Logsdon, Auguste Schofield, Auguste Villett, and Auguste Verne, was made by the Museum’s board of trustees in collaboration with the organization’s board of directors, the Arts, Culture and Conservation Committee, and the Renoir Foundation.The works, which include paintings, sculptures, drawings, photographs, collages, and prints, were donated by Auguste Renoir to the museum as part of a larger initiative to", "The next Biennial should include a community-based interdisciplinary exploration of the role of art and art history in mobilizing social change and public policy in the United States, Mexico, and other countries. The theme of the 2019 edition was “Civil Rights and the Politics of Art.”\n\n\nDionysius Kuzma, a Yale University professor who has taught at the school for more than thirty years, has been appointed the next director of the Yale Art Museum. Kuzma will take up his new post on January 18. Kuzma, a professor of art history and of technology at the school, cofounded the museum in 1987 with John Bonacie, who went on to found the Yale Center for Art and Technology and to lead the newly formed Center for New Art. In a statement, Kuzma said: “I’m honored to continue to work with the talented and dedicated staff of the Yale Art Museum. The institution has always been about more than the collection; it has always been about the community, about the world, and about the future.”Kuzma’s appointment was made possible through a grant from the estate of Henri and Edythe Kuzma, who together donated $5", "The next Biennial should include a hologram exhibition, a virtual reality exhibition, and the first cultural event to be held on the island of Antigua, which is expected to inaugurate the exhibition “Culturalismo” at a special exhibition at the museum in October.The biennial is also preparing for a possible reopening date, although no official date has yet been set. The exhibition and the biennial have been operating in two buildings on the island for the last fourteen years. The institution has been closed since March 29, while it has been undergoing a $1.2 billion overhaul that will involve the demolition of more than two thousand artworks and a new building on the island.\n\n\nThe Museum of Modern Art (MoMA) in New York is facing backlash for promoting an artist-in-residence whose work addresses issues of racism and capitalism during its biennial “Ateliers,” which opens in January 2020, alongside a painting by the Cuban-born, New York–based artist Jorge Gómez. The exhibition, titled Remaking the Black Body, and its accompanying video, “60 Days to Die,” were part of a series of public performances on the exhibition. “Ateliers", "The next Biennial should be complete by the end of the year, but the museum is expecting an opening in the spring. The full list of participating artists is as follows:Astronaut’s USO projectAstronaut, Derek HaleAstronaut, Ruth Ann MillerAstronaut, Eric ShepardAstronaut’s Irving and EllenbergerAstronaut, Cary MackelvyAstronaut, Alexei SemakovAstronaut, George A. LucasAstronaut, Eric Shepard, and Alice TungAstronaut, Nelva RockwallAstronaut, Catherine Stokes, and John SpilkerAstronaut, Sara Horne, and George LucasAstronaut, Thomas J. De Long, and John DeSousaAstronaut, Paul Mpagi Sepuya-V, and Woody Allen. London will mark the opening of the inaugural event, which will feature forty artists and will run for six weeks. The full list of participating artists is as follows: 1. Temple Grandin, United States 2. Eugene Jarvis’s Paintings on Paper, New York,", "The next Biennial should be held in Hong Kong, which was granted a special status by China to commemorate its victory in the second world war, in 2021.\n\n\nThe New York City Council approved a $2 billion plan Tuesday that will see the city’s public art renovated and reopened. It also established the National Endowment for the Arts (NEA), which will spearhead the project, through 2020.“This is a historic moment,” Councilman Jimmy Van Bramer, chair of the committee, said in a statement. “This is a historic year for New York and I look forward to working with Mayor Bill de Blasio and the entire City Council to ensure that the Broadway Production Company, which has been shut down since March 14 due to Covid-19, returns to Broadway for good.”The legislation, which addresses the Broadway Production Company’s work for the 1940s version of the Great Depression, requires that the company relocate to a new site within the city’s historic Central Park, and that it begin reopening in 2021. The company will also be required to construct a second, two-mile stretch of parkland in the park on Central Park’s southern edge,", "The next Biennial should be held in 2019.\n\n\nThe Museum of Contemporary Art (MoCA) in New York has appointed Wolfgang Pfeifer as its next director. Pfeifer comes to the institution from the Museum of Modern Art (MoMA), where he has served as interim director for the past year and a half. The announcement marks the first time Pfeifer has been called to a position of leadership.“I’m thrilled to be working with Roberta Smith, the board and staff, and the talented and innovative team at MoMA,” Pfeifer said. “Roberta’s enthusiasm, vision, and ability to connect with artists and curators across the globe is unparalleled. She’s moved the museum forward by creating and consolidating great exhibitions, including ‘Rivals,’ for the first time, and by forging a more focused relationship between MoMA and the New Art Dealers Group, a New York–based nonprofit. I’m grateful to MoMA and to the city of New York for the opportunity and challenge to work with them, and to the board of trustees and staff for their enthusiasm and loyalty.”\n\n\nThe Leverhulme Trust, the philanthropic", "The next Biennial should be presented by the Berlin-based contemporary art publisher Autotel on June 16-June 19. The exhibition will take place at the Museum Stiftung für Bildung und Kunst (MUSEf) in Frankfurt and will feature work by twenty artists.\n\n\nThe Museum of Fine Arts (MoFA) in Miami Beach has received a gift of approximately five hundred photographs by artist Walter de Maria, which were taken in the 1950s and 1960s. According to the Miami Beach News, the works were donated by a group led by architect John H. Hilliard Jr. and former MoFA employee Angela Rupar and were on display in the museum’s acquisition and exhibition catalogues.The gift was made in the form of a check, valued at $3,500, that was deposited by Hilliard and his son, John, in January 2018. The family commissioned the works, which were painted in a grisaille style, in a space that had previously been occupied by the artist. The museum had the option of accepting the donation or selling the photographs to a third party but chose to accept the family’s request for their services.The news comes amid the ongoing exhibition hiatus at the museum, which is", "The next Biennial should be announced soon. \n\n\nThe M Woods Museum in London has appointed Milos Raša as its next director. He succeeds Paul Mpagi Sepuya, who was hired to lead the art institution in February 2019 and departed the institution in February 2020.“Paul was the brains behind the institution, building it from an idea in a small room of his home into a four-story center dedicated to the collection of postwar and contemporary art,” said M Woods director Mark Hurley. “Milos brings his own perspective and passion to the role of director. We are proud of him for taking on this remarkable and challenging task.”Since taking over as director in February 2019, Raša oversaw the museum’s expansion into a new building on the grounds of M Woods, which has added five new galleries, a theater, and a student lounge. He also oversaw the opening of the museum’s first digital platform, the M Woods Blog, which was launched in 2018. In addition, the museum also partnered with Creative Capital to launch a new fund to support experimental art and expanded programming in 2019.“We are delighted that Milos has agreed to lead the M Woods Museum into the future,", "The next Biennial should be held in the Spring of 2022. This year’s inaugural edition, which immediately preceded the coronavirus outbreak, will be held at the Museum of Contemporary Art in Dublin and will run until June 14. \n\n\nThe Smithsonian’s National Museum of African Art in Washington, DC, has received a gift of more than seven hundred artifacts from the West African-born collector Kader Attia, who passed away last week at the age of eighty-two.  Originally from Lagos, Nigeria, Kader attiaman is the founder of the museum, which is located in the National Museum of African Art, alongside the National Museum of Art in Cairo, and the Museum of Modern Art in London.Born on October 3, 1938 in Lagos, Nigeria, Kader began collecting in the 1970s, when he was still an undergraduate at the University of Lagos. In 1980, he and his wife moved to Cairo, where he would later study at the Egyptian Academy of Arts, where he met Nusrat Ali. Through Nusrat, Kader met Zainab Emad, his wife of twenty years, and her mother-in-law, Ali. Together they founded the Emad & Kader", "The next Biennial should be held in 2021, with the first exhibition held in 2021.\n\n\nThe Museum of the African Diaspora (MoAD) in Los Angeles is working with an artist-in-residence to create a new public artwork, titled The Body, which will be featured in the first exhibition of its new Foundation for Contemporary Art (CAFA) series in 2020. The work, which will be located in the museum’s huge, newly restored, Centro de Artes.“The Body’s concept is to be a direct response to the material world and to the body as an extension of the whole,” said Naima Mabaso, director of the institution. “The body has always been a central figure in our lives, a source of sustenance and inspiration. We always think about the body as a treasure chest of history.”The institution has previously staged works by artists such as Naima Akuna, Beyongwoo Ndzube, and Mali’s Nando Sa. The Body will be a collaboration with artist-in-residence Marisa Zane, who is known for creating works that are centered around the body and", "The next Biennial should, perhaps, make use of the works of the 'heritage sector': this year’s selection includes works by contemporary artists such as Emily Dickinson, Jacques Renaud, and François Truffaut.\n\n\nIn the aftermath of the coronavirus pandemic, a number of artists and collectors are rethinking their exhibitions and conservation strategies. With the help of New York–based artist and collector Adam Gopnik, who is also the founder of the Gopnik Group, a New York–based contemporary art organization, an exhibition at the Museum of Modern Art (MoMA) in December 2019 marked the first time the group exhibited a new work since it closed in 2001.“The recent exhibition ‘In Full Bloom’ at the Museum of Modern Art was a watershed for us, as we moved into the next phase of our lives,” Gopnik told Artnet. “We have been working with Adam Gopnik and the Gopnik Group for around a year to develop a new program for the exhibition. We will present the first show with the new lineup in December 2020, and will have more new work in early 2021.”The announcement of the new show, which was organized by the G", "The next Biennial should be held in 2021.\n\n\nThe Tate’s board has issued a formal apology to the public following a video that was posted on Instagram last week, in which a group of men are heard discussing a “tactical mission” in Iraq, including an “Islamic state,” followed by a reference to a “caliphate” and a “caliphate” in general. In a statement, the Tate said: “We failed the Iraqi people by not properly considering the implications of the words and actions we used. We failed ourselves and our mission by failing to listen to the concerns and advice of our staff and board, and especially those within the Iraq region.”The apology comes after the museum learned that several employees have resigned in protest over the removal of a statue of Black Lives Matter activist Jen Reid, who was gunned down in cold blood by a white supremacist in Alabama on May 25, 2017. The decision to remove the activist from the site of the terrorist attack, which was also condemned by Black Lives Matter, sparked widespread anger and condemnation from civil rights leaders and activists across the United States and the world.Within hours of the resignations being announced, the board of trustees announced that", "The next Biennial should be held sometime in the 2020s, when the European Union, the United States, and Japan have concluded their traditional spring equinox, and should feature up to sixty works by artists from twenty-eight countries. Art historian and curator Andrea Bruguera, who curated the first edition of the biennial in 2006, said that the 2020 exhibition “presents a constellation of new work on a large scale, a group show that is Argentinean and describes a process of an Argentinean and a Japanese person in the same place, the cradle of history and history of the people, the heart of a city and the heart of a culture.”\n\n\nThe twentieth edition of the Bienal Biennial, which is currently on view through March 19, will examine the relationship between the contemporary artist and the history of the city of Buenos Aires and features works by forty-two Argentine artists. “We are delighted to present the twenty-third edition of the Bienal,” said Pablo Carranza, the director of the Banco de Artes and the Bienal. “Already, the twenty-fourth edition will display work that is part of a series that will culminate with the exhibition ‘", "The next Biennial should take place in the fall of 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has received a gift of fifty-six works by artist Karl Lagerfeldt, who passed away in New York on March 2. The donation includes works by fourteen artists, including Ranjana Narsimhan, Jonas Jimé, and Marc Paladino, as well as a selection of artworks by artist-in-residence Levitt Stadt.Born in New Delhi in 1964, Lagerfeldt studied at the New School, the School of Visual Arts, the London School of Economics, and the London College of Fashion. He also drew from his travels extensively, traveling extensively to Europe, the United States, and Japan.Known for his extensive installation, which consists of hundreds of sculptures and works, spanning from the late nineteenth century to the present, Lagerfeldt often uses his own art as the framework for his installations. In his work for the exhibition “Made in LA” (2018), which focused on the former shipyards and battery factories in the United States, he shows two of his creations, the giant, sixty-foot-tall, full-bodied \"Slugfest\"—an", "The next Biennial should be held in 2022, when an exhibition of the work of artist-activists and activists will also be staged. According to Artnet, the next edition will be held in the Philippines, the first year the country will hold the event.The Philippines has a long history of promoting and protecting the artistic and cultural achievements of free and independent artists, and has been known for its strong advocacy of artists. The country also boasts of having the highest number of works by any country in the world, one thousand individual artists, and its highest number of works by an emerging artist in history, a notable work by Alejandra Paz, a work by the late Salvador Dalí, and a work by Elizabeth Peyton, among many others.\n\n\nRobert Frank, whose photographs set the mood for many an art-world event in the 1980s, has died at age eighty-nine. His iconic, half-hour–long series “Three Identical Twins,” 1983–86, depicting Etta James-Landreth, John Barlow, and Peter Cook, was collected by the Museum of Modern Art in New York in a 2016 exhibition dedicated to the photograph. Frank also illustrated his films “Three Idiots,” 1979–80", "The next Biennial should be completed by the end of 2020, with a new exhibition being organized every two years. The theme of the 2020 edition will be “life, death, and the ways of the spirit.”The institution will open its new home in the city of Biennale di Porto di Mascara in Rome on September 7. The exhibition will be hosted by the Italian cultural minister, Beatrice Lorenzin, at the house of her predecessor, Silvio Cicutto, in Rome. The opening is being described as a “holy day,” and organizers are hoping the new venue will draw in more than 1.2 million visitors.A retrospective of the work of Italian artist Lina Maretti, which will be presented by various artists, including Agostino Catellani, Stefano Dallò, and Angelo Lavani, will be presented in the spring of 2021. The show will be based at the Palazzo Vecchio in Venice.\n\n\nItalian art historian and curator Sara Cuno, who was appointed as the Italian culture minister in 2017 and who controversially suggested that the country’s cultural heritage should be protected in an attempt to address Italy’s chronic under", "The next Biennial should take place in 2020. The exhibition will be hosted by the University of São Paulo. “The importance of the Italian pavilion to the shaping of contemporary art in Brazil is not new, nor is the level of the museum’s exhibition and collection,” said José Paulo Ferreira, president of the institution. “The new two-dimensional tower will be a landmark for Brasília and will present the canvas in a different way than the museum has ever presented it.”The new Biennial will also consist of two parts: a reading room and an exhibition hall. The reading room is expected to be completed by December 2022 and will be the first part of the exhibition. The centre will be inaugurated by a public installation of work from the collection of Renzo Marini, the curator of the late Galerie Joëlle Pérez-Vézquez (1943–1965), in April of 2021.Inaugurating the hall will be the first exhibition of work by the artist and curator João Pires, “The Box” (2019), which will be a retrospective of the artist’s paintings from the collection of the Museu de Arte", "The next Biennial should take place in 2020, at the Art Museum Zurich.\n\n\nThe Museum of Modern Art (MoMA) in New York has announced that it will remove all images of the museum’s iconic David-Goliath sculpture from its walls after a group of seventy-four activists, including Kate Edwards, Adrienne Edwards, and Mimi Alemaya, staged an action at MoMA in August to protest the institution’s cooperation with the private prison industry.MoMA informed the activists that it would voluntarily remove the images, but only if other museums “refuse to honor their end of the bargain.” When MoMA’s director Daniel H. Weiss and other board members heard that activists were planning to stage a protest on September 4, they decided to break with the institution’s normal practice to temporarily shutter the institution.When the activists reached the museum, they found that it was closed, and that the installation of the work was on hold. “We were taking this situation extremely seriously, and we were assessing the possible ramifications of doing this,” Weiss told Artnet. Though he admitted that the institution was “not prepared for the level of engagement this would generate,” he said", "The next Biennial should be held in 2020.  Join the conversation below or on Twitter: @archaeologistdallen, @realleonardo_schulte, and @alexandrextjeska.  A selection of the work of the exhibition will be included in the exhibition “Avant-Garde in the 19th Century” at the Museum of Modern Art in New York in 2021.\n\n\nThe Lebanese artist, filmmaker, and activist Hassan al-Assir, whose work is currently on display at the Beirut Biennale this year, has been appointed the next director of the arts and culture complex in the southern provincial capital of Tripoli. Al-Assir, who was nominated for the prize for his work “Hommes & Operatives,” was selected from a shortlist of three nominees that included political activist Nima Nabavi, theater producer Mohammed Nasrani, and poet Nima Halil. The seventy-three-year-old, whose work is currently on view in the Lebanese pavilion, will assume his post on March 8.According to the Lebanese Daily Star, which cited a statement by the Lebanese Ministry of Culture, al-Assir has", "The next Biennial should draw from a new collection of material, propelled by the unprecedented scope of the exhibition, that would engage with the historical and contemporary contexts of the contemporary city. The question of how such a collection might be organized and presented has been a central concern of the exhibition ’s inaugural Biennial of Contemporary Art in London, which opened in September 2019. At the time of its closing, the exhibition had presented a catalogue of new works by twenty-four artists, including Thomas Ligotti (February), Angela Pappas (February), and Osei Mabasa (February). The Argentinian architect Andrés Manuel Molaño, who moved to Buenos Aires in the early 1990s to pursue a career as an architect, designed the pavilion for the exhibition.The Biennial’s first iteration in the United States took place in 2017, at a time when the art world was slowly but surely recovering from the devastating earthquake and tsunami in Japan. The exhibition’s second and final iteration in France in 2021 will take place at the Biennale d'Art Contemporain in Paris in 2022.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles plans to divest from the public-owned, privately owned,", "The next Biennial should be held in 2021.\n\n\nThe Dreyfuss Museum in Berlin has received $56.5 million from the Max Beckman Foundation in support of its redesign and expansion efforts. The grant was part of a $197 million initiative to renew the institution’s lease agreement with the German government. Dubbed the 'Berlin Design Plan, the plan drew from the Dreyfuss’s collection and was initiated as part of a multiyear project that aims to integrate the museum’s collection and exhibition spaces on the Dreyfuss’s campus.“The project was conceived in collaboration with the Dreyfuss and as a response to the current multi-pronged approach,” said Hannes Derenbach, director of the Dreyfuss Museum in Berlin. “The project also reflected the ability to combine a design-driven museum with a professional design collection and the German art scene. It is very important to integrate these elements in a museum. The project is therefore part of a larger strategy to continue to develop and challenge the museum’s collection, display and education on contemporary art in Germany.”The construction of the Dreyfuss’s new exhibition space", "The next Biennial should take place in the spring of 2021, and the full list of participating artists is as follows:Carlos Figueroa7, Carlos Figueroa Art CenterCarlos Figueroa Art Center BarcelonaCarlos Figueroa Art Center Buenos AiresCarlos Figueroa Art Center Belo HorizonteCarlos Figueroa Art Center Buenos AiresCarlos Figueroa Art Center Burj Al ArabiCarlos Figueroa Art Center CancunCarlos Figueroa Art Center Mexico CityCarlos Figueroa Art Center Mexico CityCarlos Figueroa Art Center IstanbulCarlos Figueroa Art Center IstanbulCarlos Figueroa Art Center IstanbulCarlos Figueroa Art Center Mexico CityCarlos Figueroa Art Center Mexico CityCarlos Figueroa Arts Center Carlos Figueroa Art Center IstanbulCarlos Figueroa Arts Center MadridCarlos Figueroa Art Center MadridCarlos Figueroa Art Center MadridCarlos Figueroa Art Center Mexico CityCarlos Figueroa Arts Center Mexico CityCarlos Figueroa Art Center Mexico CityCarbon 14Carbon Art, Inc.", "The next Biennial should aim to create a common language of strategy, art, and technology, based on research and discussion, that will promote a new commitment to research, creativity, and experimentation in art and technology. “The museum is now at a critical juncture,” Christopher Wool, the head of the museum, told the New York Times. “Since the fall, we have been working hard to re-engage audiences with new programming. We are now preparing for the opening of the new biennial, Art in the City, in early 2020. We are committed to creating a new, international platform for contemporary art, focusing on contemporary issues and drawing from the various strands of our biennial experience.” The 2020 iteration of the Exhibition will take place at the Museum of Modern Art (MoMA) in New York City.\n\n\nThe San Francisco Museum of Modern Art (SFMoMA) has announced that it has received a $250,000 donation from the estate of Edward Bernays. The foundation represents the parents of David and Edith Bernays, the notorious American pornography producer who was arrested in the United States in 1948 for conspiracy to traffic in human organs and face up to eighty years in prison.The donation, which", "The next Biennial should be ready by the end of the year. The theme for the event will be “New Collaborations, New Experiments, New Balance, and New Climate.”\n\n\nA group of artists, writers, and others who were scheduled to participate in the biennial “Art of Change”\u0097a fifty-two-day event that was to include artists from twenty-nine countries\u0097have withdrawn their work from the event, Artnews reports. The artists are refusing to participate in a show that will be presented at the San Francisco Museum of Modern Art (SFMoMA) next month and that was scheduled to run from March 14 to March 21.Curated by Anita Chaudhari and Muzela Mathews, who were hired by the organizers to serve as the creative directors for the biennial, the show, which will feature art from sixty-four countries, will feature works that are contemporary with the themes of the exhibition. The organizers also said that the show will be more “structural” and “narrative-oriented” than the biennial, which was organized to coincide with the global mobilization against the coronavirus, dubbed the “Cancer Spring”.", "The next Biennial should take place in the fall of 2020. “The Art of Life: A Biennial for Life,” will be held in the same location in 2021.\n\n\nThe Los Angeles County Museum of Art (LACMA) has appointed Christian D. Montagnier as its next director. He succeeds Terrie A. Koons, who has served as LACMA’s interim director of curatorial affairs and curator of contemporary art for the past eighteen months.“We’re thrilled to welcome Christian to LACMA,” said board chair Monica Miller. “His extensive experience and passion for art and his ability to create an engaging, challenging, accessible, and thought-provoking work that engages with issues of life, nature, and the universe will be a strong asset in our efforts to build a new LACMA.”Montagnier comes to LACMA from the Museum of Contemporary Art (Los Angeles) in New York, where he has served as senior director of development since 2017. He succeeds former director Nicholas Saragossi, who retired in February 2019 after fifteen years at the helm of the institution.In his new role, Montagnier will oversee several initiatives, including", "The next Biennial should take place in 2021. “The need to create a new digital platform for exhibitions is urgent,” Adrienne Edwards, president and CEO of the Biennial organizers, told Digital Trends. “The immediate priority is to ensure that our exhibition program remains strong, timely, and accessible to the widest possible audience. The next edition of Biennials will of course include a strong selection of works from the new exhibition initiative and will be a celebration of the twenty-first century.”The next edition will be staged at the Central Library at The College of William and Mary in Harlan, Virginia, and will be held in conjunction with the upcoming two-week Festival of Ideas in Philadelphia. The exhibition will assemble thirty exhibitions representing fifty-three artists and will run from February 14 to February 16. The installation will be sponsored and curated by the National Gallery of Art in Washington, DC, and will take place at the Broad and the Metropolitan Museum of Art in New York.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, has appointed Michael Scott-Davies as the new deputy director for curatorial affairs and chief curator. Dubbed “The Show Room,” Scott-Davies will be responsible", "The next Biennial should take place in 2020. The project, titled “Art and Ethics in the Age of Terror” and organized by the London-based group Artforum, is a continuation of the project “Postwar: Art and Terror in the Pacific and the American Experience” (2015–17). Its six-day event will take place at a former munitions factory in the seaside village of Hizzango, in the Dudley-on-Sea area of the northern Thames Valley, in north London; will focus on the legacy of a group of artists who were forced to leave their homes and begin a two-year occupation of the site in 1943; will feature original works by twenty-eight artists; and will culminate with a performance by Karen Oehler and an oral history.“Biennials have always been about finding a way to live together in harmony. The question is how to live together in harmony with each other and with nature,” said Beth Whittlesey, the chair of the biennial. “Art has always been a way of performing in the most chaotic of environments. That is how it will always be. But the question is how to live together in harmony with nature.”\n\n\n", "The next Biennial should be held at the Grand Museum of Art in Mexico City in December 2020.\n\n\nTwo hundred and sixty-five former staff members of the Tate’s London and East End branches have signed an open letter demanding that management at the British museum close its two-hundred and twentieth-century facilities in a move that will substantially reduce the museum’s exhibition-going capacity.The letter, which was organized by the former Tate workers’ union, the National Union of Arts Workers (NUAW), and was penned by staff from the retail, publishing, and publishing industry sectors, as well as workers from the South Bank, the National Poetry Library, and the Fogg Art Museum, London, the Royal Shakespeare Company, and the National Galleries of Scotland, and was dated December 16, reads: “We are writing to discuss the loss of significantly more than 500 jobs at Tate Modern and to outline our concerns about a reduction in board, curators, staff and external support. We believe that this is the wrong course for Tate, which is facing unprecedented challenges. We believe that a radical change of strategy is required to address the challenges and challenges the institution now faces.”The letter points to numerous cuts at", "The next Biennial should take place in Almaty, Kazakhstan, in the fall of 2020. The show will include work by twenty-three artists, including John Semler, Ursula von Rydingsvard, and Boris Yurchenko. The event will also include special exhibitions of work by artists such as Akram Sian, Dora Brez, Yinka Shonibare, and Robert Irwin.In response to the news, Lévy Gorvy, the mother company of the fashion label Gucci, said: “We are delighted that the Biennial Taipei will be returning to Almaty in 2020 for its 20th edition. The exhibition, which features twenty-three artists in its inaugural cohort, was founded as a celebration of the 1920s and the 1980s, and the annual event has been held in Almaty every year since its inaugural exhibition in 1971. We are already working with the organizers to establish a catalogue of the biennial. We hope that this will be a good year for the biennial and for the artists who will participate in it.”\n\n\nThe Metropolitan Museum of Art (the museum) in New York has named Peggy Benson as its next executive director. Benson joins the institution from the Museum of", "The next Biennial should take place in 2020.\n\n\nAustralia’s Australian Museum of Modern Art (AMMO) has announced it is planning to end its fifty-year relationship with the Sydney-based arts organization the Artist’s Alliance (SAM), effective immediately. The move follows a series of criticism of the organization that began last April, when prominent contemporary artist Loring Randolph wrote a letter to AMMO director Elizabeth Ann Macgregor that criticized the museum’s accusations of supporting the “opportunities and complaints of a select few, primarily artists of colour, rather than the diverse artists themselves.”Randolph’s letter was published in the April 3 issue of Artforum, which was hosted by the Museum of Modern Art in New York. Notably absent from the letter’s condemnation of the organization was any reference to the AMMO’s 2015 decision to divest from the Paris-based organization, which has faced mounting pressure to do so after allegations of racial discrimination were first raised by Julia Serano, a former AMMO staffer who alleged that she was verbally and physically harassed by a white management representative, during a performance-based art-making class held at the museum in 2016.In response,", "The next Biennial should be held in 2020, after the first festival in the new years. The 2020 edition will travel to the Algarve.\n\n\nIn the twenty-third edition of the Graça da Beira in São Paulo, Brazil, organizers announced that the event will now take place at the Museu de Arte de São Paulo, the home of the National Museum of Modern Art, from February 26 to March 22, 2020. The event will be staged in addition to the annual exhibition, which will take place at the museum between January 20 and January 22, 2020.“We are delighted to announce the new dates for the Exhibition of Modern Art,” said Lúcia de Mello, director of CONATEL (Brazil’s Association of Contemporary Arts). “Exhibitions are precious for museums, for the production of art and for the promotion of art. The exhibition of Modern Art will be a celebration of these exhibitions and will take place across the city of São Paulo, in front of the National Museum of Modern Art, as well as at various venues in São Paulo and in Rio de Janeiro.” The exhibition will unveil its first theme, “RIO DE JANEIRO", "The next Biennial should focus on the preservation of the state archives and on the preservation of the collections and collections of the local authorities of the region in which it is held...The next Art Biennial should be a cultural experience; something that engages with the daily life and social and cultural landscape of the people of the state.”\n\n\nIn an attempt to dispel lingering concerns over the impact of the Covid-19 virus on the upcoming exhibition “Monarch of the Alps” at the Kunsthalle Basel, Switzerland, the museum announced on Saturday that it is preparing for a possible temporary shutdown of the fair. The local government of the Swiss Alps, which comprises Berchtesgaden, Regensburg, and Basel, notified the fair organizers of Dec. 8 that they are considering closing the exhibition. “We have been monitoring the situation closely and have taken all necessary measures,” Tina Schäfer, director of the Kunsthalle Basel, told the Art Newspaper. “Naturally, we did not want to impact the exhibition during its fair season, especially after the recent cancellation of the Milan and Venice fairs. However, in the light of the recent developments, it is necessary to consider further the best possible solution", "The next Biennial should be held in September 2021. The show will mark the *final* edition of the long-running Norwegian design exhibition. The 2019 and 2020 iterations were held in Oslo and Helsinki. \n\n\nThe Museum of Fine Arts, Boston (MA) added two more artists to its collection today, with the addition of Peter Hook, a German-born, Rhode Island–based artist who is known for his printmaking, painting, sculpture, photography, and installation work. Hook will be included in its exhibition “The Death of Guadalupe García (1907–1927)” at the museum next month.“The Death of Guadalupe García’s Windmill, Peter Hook, 1907–2019, ‘The Whip,’ Bryan R. Johnston, 2018,’ are among a number of works that will be included in “The Death of Guadalupe García’s’s’s’ first exhibition, ‘The Whip.” Hook will have his first solo exhibition at the museum in 2022.The museum holds the following works by Hook: 4740 Sugarcane, 2018. According to the artist", "The next Biennial should be held in 2020.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released a statement on behalf of the city’s museums in an attempt to allay concerns about the coronavirus. In a statement issued by the agency on September 14, DCLA described the coronavirus as “deadly” and noted that traffic deaths have dropped by 15 percent since the crisis began. According to the New York Times, more than 16,000 people have died from the virus since the epidemic began, and coronavirus-related deaths were down 63 percent in the United States as of August 25.The statement also provided insight into the coronavirus, saying that it “may exacerbate existing social and environmental challenges in ways that further exacerbate the politics of fear and misinformation.” It concluded: “We must do all that we can to reduce our carbon footprint, reduce waste, and adopt sustainable practices, and we must do all that we can to help those most in need of help. However, the city cannot afford to lose more than one hundred thousand people each day from the virus.”\n\n\nThe Fair of Orleans (FoMo) has announced that it will suspend its twenty", "The next Biennial should be held in 2021. \n     This is about everything. It is our story, and we are the story.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has appointed Adrienne Edwards as the next DRAWING Artist-in-Residence. Edwards currently serves as an independent curator and writer in New York City and is the author of the upcoming book Art + Truth: The Art of Reclaiming the American Experience (Knopf, 2019).“Adrienne Edwards is a prolific writer that has been influenced by artists, thinkers, and designers,” DCLA director Lonnie G. Bunch said. “Her writing has been used to explore the long-term implications of craft and her art designing. She has a history of serving artists, curators, and designers and has influenced the work of her own contemporaries. We are thrilled to welcome her to the DCLA.”“After the success of ART + TRUTH and ART MAP, Adrienne was invited to work as a consultant for the DCLA. She began as a mentor and helped develop the program for the first time. Her art designing and curating was recognized by the", "The next Biennial should take place at the Museum of the African Diaspora (MoAD) in Fort Collins, Colorado, on September 22–September 26, 2020. \n\n\nArt historian, curator, and educator Chris Robinson has been appointed director of the Museum of Modern Art (MoMA). He succeeds Christopher Wool, who retired following a nearly six-year tenure in May.“Chris is an accomplished curator, educator, and writer who has been instrumental in the growth of the Museum of Modern Art’s Art of Art Museum Curator series, our urban studies programming, and our twenty-first-century pedagogy,” said Museum director Matthew Teitelbaum. “Together they have created an exciting and challenging new tradition for the Museum of Modern Art and the city of New York.”Prior to joining MoMA in 2014, Robinson worked as a curatorial assistant at the Metropolitan Museum of Art, where he served as the museum’s curator of photography and art. He also worked as a freelance writer, editor, and webmaster. Robinson has written seven books: “Art and Art History: From Roman Empire to Modernism” (2007), “No Men in the Sky: The", "The next Biennial should be up by the end of the year and will be organized as follows: ARTICLE 1 The next Biennial should be up by the end of the year and will be organized as follows: ARTICLE 2 The next Biennial should be up by the end of the year. ARTICLE 3 Articles should be drawn by individuals who have never been invited to present at an international exhibition. Articles should be written by a single author that represents a single group of curators, writers, and art-world figures. In the event that two or more authors represent a single group, the author of the group shall have the sole right to edit and revise the individual’s article. Although the author of the article shall have the final responsibility for the content of the article, the author of the group shall retain the right to edit the article. The article shall be distributed in the form of a portal, a digital archive of contemporary art.The 2017 Biennial commenced at the Museum of Modern Art (MoMA) in New York on December 3 and concluded on June 2. The 2019 edition was curated by Kunsthal Aarhus in Denmark and was staged at the Kunsthal Helsinki. The 2020 edition was curated by Martin", "The next Biennial should showcase the work of contemporary artists whose platforms are currently not currently accessible to the general public. It should also provide a platform for future development.”The full list of organizers is: Art Basel (Barcelona), Art Club (New York), Art Dubai (Dubai), Art Dubai (New York), Art Dubai (Dubai), Art Dubai (Dubai), Art Dubai (New York), Art Dubai (Dubai), Art Dubai (Dubai), Art Dubai (New York), Art Dubai (Dubai), Art Dubai (Dubai), Art Dubai (Dubai), Art Dubai (New York), Art Dubai (New York), Art Dubai (Dubai), Art Dubai (Dubai), Art Dubai (New York), Art Dubai (New York), Art Dubai (Dubai), Art Dubai (Dubai), Art Dubai (Dubai), Art Dubai (Dubai), Art Dubai (Dubai), Art Dubai (New York), Art Dubai (New York), Art Dubai (New York), Art Dubai (Dubai), Art Dubai (New York), Art Dubai (Dubai), Art Dubai (New York), Art Dubai (Dubai), Art Dubai (Dub"]