["The next Biennial should take place in 2020 and is being organized by the London-based artist-run collective the Circle, whose first exhibition was last year’s “Away from the Gallery,” which was organized by the Museum of Modern Art. The exhibition, titled “The Circle,” premiered at the Museum of Modern Art and was followed by the group exhibition “The Big Sleep,” at the National Portrait Gallery, London, and the London-based nonprofit Panorama Gallery. “The Circle’s grandiose vision for an independent, multidisciplinary, arts-based, and self-help biennial is a far cry from the experimental, hybrid, and remote and community-based work of the past,” said Mark D. Wilson, the cofounder of the collective. “It is a step in the right direction, but a step nonetheless, towards building a more sustainable future for our future generations. We are committed to continuing to engage with our surrounding communities by creating new and innovative programming that engages with contemporary and global issues, and we look forward to continuing to grow and develop the Biennial.”The inaugural event, titled “The Square,” featured work by", "The next Biennial should focus on “The Post-Modern World:” and the theme, “On the wall,” and will open on October 22. “The Art of Performance” will be staged in collaboration with the Copenhagen Art Museum and will be hosted by a specially adapted space designed by the Danish architect Aarhus Demos, a Moore-Giemsa collaborator. The exhibition will focus on the works of Adam and Bernd and will run until March 29. The photomontage will be followed by a special exhibition of works by the artist Jess Gaze at the Museu de Arte Contemporáneo Madrid. The pavilion will also host an open-air performance by the Slovenian artist Skjell Jakobsen, which will run from March 19 to March 21. The seventh edition of the Mobile Biennial will be held at the Czech Republic’s Przemysl Museum of Fine Arts in Prague, November 17–November 19, and will be followed by the immersive, art-making experience Open at Home: Contemporary Art in the Age of Black Lives. The show will include works by the artist's wife and from artist-to-artist, highlighting the", "The next Biennial should be held after the dissolution of the National Museum and the Museum of Modern Art. The organizers have stated that the biennial will focus on the life and work of Dadaist thinker Jan and the exhibition will take up themes that include the cultural and political significance of photography, the impact of photography on social and political life, photography in the art world, and the importance of photography in the history of art.The exhibition will also involve the reconstruction of the National Gallery in London through the collection of artists and will present the work of forty-eight different artists living or working in the United States. The event will be hosted by the Museum of Modern Art in partnership with the Museum of Contemporary Art in the Arts and the artist-run platform called the Artist World. The exhibit will be accompanied by an exhibition of work by the artist Paul Okon, which will be staged at the South By Southwest (SXSW) in Austin, Texas; the A.I.R. Gallery in New York; and a show of work by Simone Leigh at the SALT Blockbuster Center in Santa Monica.The biennial will take place on the National Museum, which is currently undergoing a $40 million expansion. The expansion was funded by a $20 million donation from", "The next Biennial should be held in 2021. \n\n\nThe Istanbul Biennale is continuing its ambitious reopening campaign, with the exhibition marking the tenth anniversary of the opening of its first year. The exhibition will run through March 25. Inaugurating this year’s program are “Art and the Body: From the Sculpture of Kapaun and Tezuka to the Biennial of Charles and Alexandra,” which will showcase the works of seven of the artists who created the largest-scale body artworks, as well as “The Last Exact Part of the One: The Secret History of the Painting of the Third Reich,” which will explore the legacy of the artist Max Hetzler. The exhibition’s redesigned Central Gallery will also open to the public in March. Many of the works featured in the exhibition will be present in the upcoming edition.The artists who will be featured in the upcoming edition include:Alireza Ghorban, Zakiyeh Şehra, and Barmen İnönlıoğlu, who together composed the first mass-art exhibition in Turkey, held in the autumn of 2010 at the Kunsthalle Basel in Switzerland; in", "The next Biennial should take place in 2021.\n\n\nThe Institute of Contemporary Art (ICA) in London announced today that it has received a gift of twenty-six works by the late Italian architect Ermar Polke, who created the iconic 1960s-set Guggenheim–Palazzo d'Italia in Milan. The work, titled Trial by the Sun, and Transatlantic Ocean, was gifted to the institution by the German collector Rosa Barozzi in 2016.Born in the city of Salerno in northern Italy in 1937, Polke studied architecture at the University of Cagli in Milan before the war and worked in the textile industry. He was awarded the decoration of the Order of the Italian Legion in 1943 and the Legion d’Alès in 1948, which marked the first time his name was appropriated by the Vatican. “Polke’s works are among the most important contemporary collections in Italy, and in Italy they are cherished, respected, and admired,” said the pope. “Erich and I had mutual affection for these works, and we were proud to receive them back from Italy. We hope that this gift will be a source of inspiration for us and others to cherish the", "The next Biennial should be announced next week.\n\n\nThe Institute of Contemporary Arts (ICA) in London announced today that Vito Acconci has been selected as its next president. Acconci has served as the chair of the institute for thirty years and has authored two monographs, “The Digital Age: Theory and Criticism in Motion” (2001) and “Art in Motion: Theory, Theory,” (2007). He is also a coeditor of Theoretical Culture: From Theory to Motion” (2016), a volume that contains essays on Chinese art and cinema, and has edited books on philosophy, politics, economics, and art.Acconci, who was named the ICA’s president in 2002, has been credited with having organized many exhibitions that have pushed the boundaries of contemporary art and its relationship to contemporary history. He was also instrumental in the organization of the first South-Tehran Art Biennale in 2005 and helped the ICA realize its first goals in the 2008–2009 academic year. In his new role, Acconci will oversee the ICA’s fundraising and programming and will serve as a liaison for academics, activists, and visitors from the South Asian diaspora.", "The next Biennial should be on the exhibition “The Black Art of Mao Tse-Tung” (1941), which opened in March.\n\n\nThe Metropolitan Museum of Art in New York has appointed Anna Zahn-Oyarhies as its next director. She succeeds Max Delaplane, who has led the museum since 2008, and will begin her position in February 2020. She succeeds Susana Cahn, who was appointed director after Delaplane’s departure in June 2019 and has been working to improve the museum’s collection and display practices.“I’ve been following the Met since 2009, when the museum’s new building opened in Chinatown and I was still a high school kid, and I’m thrilled to be working with the talented team of artists and designers who have shaped the Met’s future,” said Zahn-Oyarhies. “The collection is constantly evolving and changing as we work to deliver a collection that reflects the collections of the past, but stands apart from the museum’s history.”Commenting on her appointment, Zahn-Oyarhies said: “The Met has been making significant strides", "The next Biennial should take place in July 2020.\n\n\nThe Tate’s board of directors has approved a £10 million ($13 million) expansion to the museum’s collection. The decision was made in the wake of the UK’s coronavirus pandemic, which has seen the number of people infected rise to 132,000. The uptick in cases has been attributed to the spread of the virus from person to person and has affected everything from the size of the collection to how museums display works.“We are greatly concerned by the rise in cases and the impact this has on the health of our visitors and staff, and how this may impact on our long-standing exhibition priorities,” said Tate director Maria Balshaw. “We are increasing the exhibition collection by more than 2,500 works, and we are working with our partners to find new ways to support the hugely popular exhibitions, and the collection, in future years. We appreciate all of our partners’ feedback and support throughout this difficult period and will continue to listen, and we will continue to innovate and embrace new ways to tell the stories of our art.”The institution’s current collection, which consists of 5,000 works", "The next Biennial should be a continuation of the theme, “Art and Democracy,” but with a focus on the work of non-Western artists, as this is the era of the ’80s, not ’00s.The fifth and final part of the series, “Maya At Gagosian,” will be an exploration of the imprint of women artists in the twentieth-century on modern urban life, its representations, and new forms of art of the twenty-first century. Photographer Judith and her collaborator Marcia Turner, who first collaborated on the project, will create a portrait of Maya Lin, a late African American American Los Angeles–based artist who was known for her sprawling personal narratives and large-scale works.“Maya At Gagosian’s central theme is that of a collective memory, of the continuation of a collective existence through art, and we are eager to continue this theme in the next installment of the series,” said Roberta Smith, artistic director of the CAAW Foundation.\n\n\nThe Institute of Contemporary Arts (ICA) in the city of New York has received a gift of 200 works from the David and Lucille Blavatnik Collection at the university of Chicago", "The next Biennial should be announced by the end of next month. “The Museum of Contemporary Art in London is committed to supporting the museum’s collection in its current form for twenty years after the 2020 edition is over,” said Tom French, director of the London-based charity Biennale Fund. “Featuring new and previously unseen works, as well as the works of a great range of artists from around the world and from many countries, the Biennale will renew the character of the Tate and mark the centenary of the birth of the artist Franz Kline. The Tate’s holdings include works by artists such as Hans Ulrich Obrist, Mapplethorpe, and Lévy Gorvy; exhibitions of work by artists such as Pierre-Auguste Renoir, Joan Miró, and Jean-Luc Godard; and the first exhibition of work by Dutch artist Gerrit van de Velde, who traveled to London in the spring of the twentieth century.”\n\n\nThe Contemporary Art Museum St. Louis (CAMST) in Missouri has received a $100,000 donation from the Abdulrahman Al-Khalili Foundation. The donation, which comes in", "The next Biennial should take place in 2021, at which point the institution will embark on a yearlong celebration of its 125-year history. Jackson’s wife, Patricia, will be the keynote speaker. The inaugural exhibition, “Feminine in the Art: The Biennial of Opera” (2019), was held at the Museum of Fine Arts in Boston.\n\n\nThe Central Park Conservancy has awarded the Metropolitan Museum of Art in New York $10 million in support of its conservation efforts following Hurricane Sandy. “After returning from New York, Museum of the City discovered that the park’s historic granite cliffs had sustained significant damage and needed to be conserved,” the conservancy said in a statement. The funds will be divided between the institution and the New York City Department of Cultural Affairs. The donation was made in recognition of the museum’s “commitment to the long-term conservation of the Metropolitan Museum of Art’s signature structure—the neoclassical, nineteenth-century warehouse,” which was constructed to hold the museum’s pebble-filled containers for the artist-in-residence program. The museum bought the warehouse in", "The next Biennial should take place in the fall of 2020.  The 2019 edition—an exhibition organized by the French Federal Council to commemorate the c1920 founding of the city of Ribes, in east-central France—was also canceled due to concerns about the coronavirus. The event was rescheduled for May 20—an obvious attempt to avoid a repeat of the Covid-19 scare, which saw an estimated 318,000 people infected in the United States and one-hundred-thousand-strong French contingent at the triennial.The 2019 edition of Rendezvous with Nature, which was organized by the New York–based artist Yolanda del Val, was canceled in March 2019. Del Val and the Art Newspaper reported that organizers were concerned about the virus and the impact it would have on the production of art. The biennial was rescheduled for May 25–May 29, 2020, and for May 20–May 26, 2020.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has appointed Isamu Noguchi as its next director. The title has been vacant since December 2019, when Noguchi assumed the helm of the Metropolitan Museum of Art in Manhattan. Since then,", "The next Biennial should be a celebration of life and art, with an emphasis on the artist’s body. It should begin with the exhibition of a selection of the work of the biennial’s artists, and include a discussion on the themes of the exhibition. The organizers say that the exhibition will be predominantly about the work of women artists, and will explore the process of identification and representation. All works of the exhibition will be housed in a special vault that will be inaugurated with a retrospective of the work of the artist Nari Ward (1936–2007), followed by a project in collaboration with Cynthia Wilkes (2019) and Carol Godfrey (2019), and then by a special exhibition of art from the Biennial of Excellence, “Between Waves: The Art of Surrealism” (2019). The full list of participating artists is as follows: Adeline Brinkhoff, Berlin; 2014; 2014; Benedict Chaves, Spain; 2019; 2018;  Beth Cunningham, New York; 2018; 2018; 2018; 2018; 2018; 2018; 2018; 2018; 2018; ", "The next Biennial should be set up in the province of Henot to begin construction in 2021. The next cycle will focus on an ethnographic survey of the Surinamese. The third will focus on a contemporary account of the Indian art of the nineteenth century. The fifth will focus on the history of the Indonesian Southeast Asian region. The last will be a record of the visual arts in Indonesia.\n\n\nThe University of Washington in Seattle has been awarded a $3.4 million grant from the Andrew W. Mellon Foundation to help expand its arts education and curatorial programs, which have been severely hindered by the coronavirus, and to create new opportunities for the visual arts. Working across all disciplines, including anthropology, history, and present-day studies, the funds will support a new initiative, the Andrew W. Mellon Arts & Culture Curator Fellowship, which will offer fellowships to visual arts majors in Seattle, Portland, and Vancouver. “The Andrew W. Mellon Foundation is committed to supporting the highest quality arts education and the broadest range of arts scholarship possible,” said Carolyn Tate, director of the Andrew W. Mellon Foundation. “The grant will enable the foundation to establish a new program centered on the arts and culture in Seattle", "The next Biennial should be held in the spring of 2021, said Art Basel. The exhibitor would be entrusted with the exhibition’s digital archives and would have several months to prepare for the event.Commenting on the exhibition, an artist statement from the organizer said that “The answers to your questions and the possibilities of the future are limitless. We are thrilled to present them to you in the exhibition arena.”\n\n\nThe Solomon R. Guggenheim Museum in New York has appointed Claire D. Taylor as its new executive director and chief curator. Taylor will assume her role on January 31, 2021 and will continue in her current position as director of contemporary art for the institution until at least the end of the 2021 fiscal year.“Not only is she an accomplished curator who has fostered an up-to-date appreciation of the art of her generation, but she is also an outstanding leader who has put the museum’s curatorial ambitions at the forefront of the museum’s long-term plans,” said Museum Director Daniel H. Weiss. “It is a tremendous honor and a great privilege to welcome her to the Guggenheim.” Taylor will begin her position in", "The next Biennial should take place in 2020. In the meantime, the museum has established a list of seventy-three bodies to be included in the next edition of the show, which is currently on view until December 14.\n\n\nThe Solomon R. Guggenheim Museum in New York has announced that it is planning to establish a new prize in recognition of its international network of scholars, whose expertise and creativity make up the foundation that comprises the Guggenheim’s collection organization and academic staff. The initiative is a response to the downturn in the global economy and the work of many curators, researchers, and scholars, who have lost their jobs, or are contemplating leaving their institutions.The new prize will be named after the Guggenheim’s director, Joseph Chenebault. Chenebault, who has served as associate curator of modern and contemporary art at the museum since 1993, is also the founder of the Museum of Modern Art in New York and the Museum of Modern Art (MoMA) in New York City. The institution is currently negotiating with the Guggenheim’s legal counsel to determine the details of the prize. The winner of the new prize will be announced in June.“This is an", "The next Biennial should focus on “Reborn: A Biennial of Alternative Art” (2019–20), which will explore the history of experimental art and its current state of preservation in an attempt to re-create “a more certain kind of world.” “The Remaking Series” will present new work by a select group of artists. The 2019–20 event will take place in the central city of Zurich.\n\n\nThe Solomon R. Guggenheim Museum in New York has appointed Laura Mulvey as its new assistant curator of contemporary art. Mulvey comes to the institution from the Metropolitan Museum of Art, where she served as associate curator for contemporary art and performance until January 2021.“Laura has been a transformative curator, bringing a fresh perspective that allows us to engage with contemporary art and design in new ways,” said Guggenheim director Anne-Marie C. Evans. “Her work embodies the Guggenheim’s values, as always grounded in her own practice, and the work of a group of artists who are among the most important in the museum’s history.”During her tenure, Mulvey has curated numerous exhibitions, including “The New Nude", "The next Biennial should be held in Malmö, Sweden, and will be composed of a selection of works by sixty artists from twenty countries and territories. The twenty-eight artists selected for the exhibition will be announced in the coming weeks.\n\n\nThe Tate’s board of trustees has overturned a decision to give the arts organization £1 million to help pay for the construction of a new flagship store in London. The Tate’s board of trustees said that they have decided to hang on to the money invested in the Tate in order to give the institution a much needed boost in its bid to become an international cultural destination.“The board of trustees is delighted that the Tate is determined to regain its former strength and status as one of the leading cultural organisations in the world,” said David Cheskin, chair of the board. “The Tate is working hard to achieve this, and we hope that this will be a turning point in the way that Tate works as we look to the future. As we look to the future, we must not forget where we are—we are at the heart of it. The board is committed to continuing to support Tate in order to safeguard the institution as it deals with the consequences of its recent", "The next Biennial should take place in the Japanese city of Nagoya from April 8 to April 12, 2021.  The inaugural edition, held at the city-owned Art Museum in Nagoya during the summer of 2018, featured work by sixty-six artists from twenty-four countries and territories.  Following a year-long program of lectures, seminars, workshops, concerts, and other events, the 2021 edition will take place in Tokyo in April 2022.\n\n\nThe Museum of Modern Art (MoMA) in New York has received a $3 million donation from the Wilson Foundation. The donation came in response to MoMA’s proposal to create a new public space in the museum that would showcase the work of artists that have never been on display before. The foundation is also supporting MoMA’s plan to reopen to the public in February 2022 under the designated temporary special exhibition, “The Artist in the Museum: A New Way to Experience Art,” which will open to the public on January 31, 2022 and to the public in February 2022 and March 22, 2022. The $3 million gift will also provide MoMA with a $2 million emergency fund that will allow the institution to continue", "The next Biennial should be hosted by the Museum of Fine Arts in New York in 2021. The fifty-fourth and fiftieth will be hosted by the Museum of Modern Art and the Museum of Modern Art, Atlanta, in 2022. The eighty-third and ninety-eighth will be hosted by the Museum of Contemporary Art, Los Angeles in 2024, and the ninety-ninth and a hundredth by the Museum of Modern Art in 2021. The seventy-ninth and eighty-second will be hosted by the Museum of Contemporary Art in New York in 2022, and the seventy-ninth and eighty-tenth will be hosted by the Museum of Contemporary Art, Los Angeles in 2021. The seventy-third and eighty-fourth will be hosted by the Museum of Contemporary Art, Los Angeles in 2025, and the seventy-ninth and eighty-ninth will be hosted by the Museum of Contemporary Art, Los Angeles in 2022. The seventy-fifth and eighty-seventh will be hosted by the Museum of Contemporary Art, Los Angeles in 2021, and the seventy-fifth and eighty-eighth will be hosted by the Museum of Modern Art in New York in 2021. The seventy-ninth Biennial of American Architecture", "The next Biennial should not be held any earlier than 2024, and the date should be decided by a vote of the members of the Constitutional Council, whose mandate is to advise the President on the date of the next Biennial. The institution will also be tasked with finalizing a blueprint for the event, which will be held in the capital of the Republic of Belarus and will include at least thirty-nine artists and collectors. The event’s director, Alexander Krasinski, said that the institution hopes to organize the event in the spring of 2021.\n\n\nSculptor Peter Zumthor, who created some of the most influential works in twentieth-century American art, has announced that he is leaving the Los Angeles County Museum of Art (LACMA) to form a new institution within the city’s Department of Cultural Affairs. The new organization will be named after the California Dream Foundation and will work to promote the work of artists who have made significant contributions to California’s cultural landscape over the last twenty years.Peter Zumthor, who died on January 10, 2019 at the age of eighty-six, was born in New York City in 1941. After receiving his undergraduate degree from the University of Pennsylvania in 1964, he", "The next Biennial should be in 2021.For now, the museum has set up a page on it’s website where visitors can download a printout of the upcoming exhibition and the full text of the show’s abstract artworks. The full list of participating artists is as follows:Stéphane Spaeth, Paris, FranceAugusta Spaeth, Paris, FranceAugusta Spaeth, Paris, FranceSeptember Spaeth, London, UKOctober Spaeth, Berlin, GermanyDecember Spaeth, London, UK<|endoftext|>Posted 17 March 2008 - 06:36 PM\n\nI'm going to try to keep this short and sweet. I know this is a long-winded way of saying I'm not going to go into great detail about everything that happened but here goes. I went to a workshop with my daughter the other day and asked her to draw a unicorn for me. I asked her to draw something that resembled a unicorn and she did. She drew a unicorn sitting on a throne with a unicorn horn on its head. I asked her to draw a unicorn with an orange horse and she did. She drew a unicorn with a unicorn tail and a unicorn on its back and it was worth $5.00. It was a great engagement gift", "The next Biennial should take place at the Royal Academy of Arts in London in 2020. The artist’s next major exhibition, “Exhibitions in Motion” (2019), will be staged at the Museum of Modern Art in New York in 2020. It is also currently scheduled to open at the Museum of Contemporary Art in Prague in 2021.\n\n\nThe Baltimore Museum of Art (BMA) has announced that it is reopening in order to begin reopening after the city’s massive May 1 reopening deadline collapsed. The BMA’s new president, Christopher Bedford, announced the initiative in an email to staff on Thursday, May 23.“We are reopening to help Baltimore stay strong and vibrant,” Bedford wrote. “We are reopening to build on the incredible work of our wonderful staff and the museum’s distinguished history. We are reopening to deliver on our mission to make Baltimore the envy of the nation.”The department of design and construction is currently working on several projects to help Baltimore remain open during the pandemic. Among the first initiatives are developing new plans to help the city avoid losing revenue during the first months of the coronavirus outbreak, and revamping the interior of", "The next Biennial should be held in 2021.\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Laura Morales, who recently retired as director of the museum after a twenty-year tenure, as its next leader and interim director. Morales comes to the institution from the Boston-based nonprofit arts organization Open Space, which she cofounded in 2009. “Laura’s thoughtful leadership, her proven track record in building strong relationships with local, regional, and national constituencies, and her proven ability to translate that into institutional practice make her an ideal candidate for the role of director,” said Mark F. Metz, president and CEO of MFA. “Laura’s leadership and ability to translate her institutional experience and reputation into meaningful change will ensure that MFA’s trajectory for the next twenty years remains at an impressive pace.”\n\n\nThe Museum of Fine Arts (MFA) in Boston is preparing to welcome visitors back to the institution in 2020 with a new multi-sensory experience, the Biennial of Percussion. Titled “We are all Percussion,” the exhibition will take visitors on a journey through the museum’s collection in order to understand the musical history", "The next Biennial should close with a special exhibition of works by artists from the British Museum, which is currently on display in the exhibition “The Quest for the Natural History of Things” at the British Museum in London. The exhibition will include a new reconstruction of the biennial’s opening reception, which is being organized by the American Association of Arts, and will highlight the biennial’s first exhibition, “The Invention of Modernism,” in 1972.“Four decades on from the opening of The Invention of Modernism, I have decided to embark on a new project that will challenge the story of the exhibition, the exhibition, and the biennial in a way that will connect them, as a series, rather than separate them,” said James Armstrong, the director of the British Museum. The project, which will include the unveiling of a new, larger exhibition in the fall of 2022, is slated to run for a year.The British Museum has responded to the biennial’s cancellation with a statement: “We are delighted that the biennial will return to London in the spring of 2023. It is an exciting prospect for the biennial to return to Tate Britain in 2021 and to come back to", "The next Biennial should be held in 2019; a joint project with the Pennsylvania Academy of Fine Arts and the Rhode Island School of Design Museum; and a follow-up in 2021.\n\n\nThe Crawford Museum of Art in Oklahoma City has released the third-ever edition of “Metal” (2019–20), an annual exhibition featuring work by up-and-coming and established artists. The exhibition, which explores the intersection of metal, metalworking, and performance, will return to the Crawford at the George R. Brown Convention Center in Tulsa on October 22. The event will also include a “Blue Print: Metal Art and Performance” presentation. The show will run until November 22 and will comprise 125 images by forty-four artists, including David H. Mallery, Ann-Marie Chiu, Cenélène Berger, Todd Haynes, Kiki Smith, and Chor Ngai. The list of artists whose works will be featured in the exhibition is as follows:Tsubasa Kawamura (Germany) Jin'Li Chen (USA)Daisuke Yamanashi (Japan)Suellen Varejão (Brazil)Jorge Manuel Pinto (Mexico)Superior Donnel D.", "The next Biennial should be held in the autumn of 2019. The full list of participating artists is as follows:\n\n\n***This article is part of the #Artnews #ArtAsiaWeekend #ArtAsiaWriters #ArtAsiaTimes. Please support our writers and artists by purchasing their books from our partners at an affordable price. We will keep you updated when the next edition of ArtAsiaWeekend is released.\n\n\nTrisha Brown, the publisher of the critically acclaimed, award-winning and best-selling book Art and the City, founded Edinburgh University Press in 2011. She is the founder and publisher of the publisher’s sister publishing house, Art and the City: A Contemporary Approach, and is the author of Art and the City: From the City to the World (New Directions, 2019), Art and the City II, “A Reflection of Time” (Harper Collins, 2019), and Arafat and the City: A Modern History (New Directions, 2019).Brown’s work has been translated into over twenty languages and is available in a variety of languages.In a 2017 Artforum interview with Brown, the artist said: “My approach to writing in the first place is to play", "The next Biennial should be a performance piece. I want it to be a remembrance of the work that we have lost, but also a reflection of the work that we are making.”The collection will be housed in the museum’s current exhibition, “The Body,” which opened in 2008. The exhibition was moved to a newer location in the city of Palazzo Nazionale di San Pietro Arte Contemporanea (PNA) in 2012, and the Biennial of Modern Art, “We Live in the Present,” opened in 2014. The new Biennial will take place in the Pirelli building in Milan, which is currently undergoing a €5.5 million renovation.\n\n\nA group of artists and collectors in a coastal city in China have called for the repatriation of a massive Chinese-made work that has been sitting in a museum in Beijing for more than a century. The exhibition, The Art of War, is a reconstruction of the Japanese imperial navy battleship Yamato, which was commissioned in 1945 and completed in 1948. The work, which depicts the battleship in a fantastical setting, was moved to the Museum of Contemporary Art in Beijing (MCA) in 2013,", "The next Biennial should be held in 2020, when an artist-led campaign will try to persuade the museum to hold its next edition. “The Biennial is a vast canvas, and the former staff and I are committed to holding it as meaningful, vibrant, and timely as possible,” said Leila Weefur, the chair of the museum’s board of trustees.  The biennial will also be redesigned to reflect the vision of the art historians present, and to incorporate new perspectives and an active research program across multiple time periods.The biennial will launch with a three-day workshop, “The Future of Panache,” organized by the museum’s collection specialist and curator, Yvonne Yildiz, and will culminate in an exhibition of the first exhibition of its kind in Paris, which will be inaugurated with a presentation of work by its curator, Amadou Gaillard-Arri and will be on view through October 22.\n\n\nThe Michelangelo Signor Sculpture at Turin has been awarded the prestigious Prix di Rivoli, Italy’s Venice Architecture Biennale, which honors architecture projects of the year that are made by selected artists from a group of", "The next Biennial should take place in the urban city that is currently under the control of the Islamic State.  The event will be held across a number of locations in the city, including the Central Mosque and the Central Jail. The pavilion will also include works by artists whose works were selected by an international jury, which consisted of Florian Minitz, Helga Weigel, Ursula von Rydingsvard, and Wolfgang Herbig. The first edition of the event, titled “13th,” will take place in October 2020 and will be curated by Wolfgang Herbig and will be held at the Hangar 13. The second edition, “14th,” will take place in March 2021 and will be curated by Wolfgang Herbig and will be held at the Museum Stiftung Münster.  In a letter addressed to the public, said: “It is an honor and a privilege to be able to dedicate my life to the preservation and promotion of the work of the experts from the field. We are given a unique opportunity to study the art of the future together with the artists who are making the most of the present that we live in. The exhibition ‘13th’ represents", "The next Biennial should be held at an appropriate time and location, in a cultural area that is accessible to the general public. The final program should bring together artists from all over the world and reflect the creativity and spirit of Biennials.\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Sharon Scheper as its next executive director. Scheper comes to the institution from the Charles and Lucille King Center for Arts, where she has served as interim director since July 2019. “Sharon is a leader in the field of contemporary art who has built an impressive and diverse record for the museum,” said director Michael Rosenberg. “She is committed to supporting the museum as it navigates the challenges posed by the coronavirus, and is actively seeking ways to support the museum’s programs.”Scheper will assume her new responsibilities in March 2020.\n\n\nThe Albuquerque Museum of Art (AMP) has received a gift of forty-four works by the late American fashion photographer Rev. Mychal Denney, who was an avid collector of works in the 1980s and ’90s. The donation includes photographs by the late Model Railroada, a favorite of Denney’s, as well as", "The next Biennial should be held in the spring of 2020. The institution had hoped to begin hosting the exhibition in the fall of 2020, but the crisis in Greece has forced its cancellation. \n\n\nThe Museum of Tolerance in Berlin (BMB) has welcomed three new members to its board of trustees: artist and filmmaker Michel Houellebecq, who will be the Rome–based director of the museum; Steven F. Oostra, the director of the Museum of Modern Art in New York; and artist and curator Suellen Roesler.“Together they represent a new generation of trustees and we are delighted that they will join our extraordinary board of trustees,” said director Torsten Bischoff. “They bring fresh perspectives and insights, and their vision for the future of the BMB is ambitious. We are confident that with their support, the BMB will continue to thrive as a significant cultural and artistic institution.”Prior to joining the museum, Roesler served as the director of the Vagenda Art Center in Rio de Janeiro, Brazil, from 2018 to 2020. “I’m immensely proud to be working with Michel, Steven, Suellen, and Suellen,” BMB", "The next Biennial should be presented by the British-based artist Yarl Mockel. The show will be hosted by the Royal Academy of Arts, London, and will run from June 21 to June 29. The biennial will include forty works by sixty artists and will showcase the work of twenty-seven artists selected from a pool of thirty-five artists. The biennial program will also include a residency program for new artists, which will be hosted by Tate Britain and will be run by the Tate, and a special exhibition of work by British and international artists, who will be displayed at London’s Serpentine Galleries, from June 22 to June 24. The 50th anniversary celebration of the biennial will take place at the Serpentine Galleries from June 21 to June 26. The London Arts Biennial will be held at the Royal Academy of Arts (RA), London from June 19 to June 22. The event will be hosted by the Royal Council for Arts (RCA), and will feature more than five hundred artists. “The London Art Biennial is a real milestone for us,” said Andrew Acton, director of the RCA. “We are thrilled that this year’s event", "The next Biennial should take place in 2021.\n\n“For me, it’s been a long time since I’ve been able to step into the shoes of an artist and see how they are working,” said Anne Tront, the winner of the 2020 Biennial Debutante. “I’m really excited about being a part of this next iteration. I hope we can start to see some results.”The selection committee comprised Delphine, Albert, Naima, and Sculptor Andrea deolon as well as artist-in-residence Filipe B. Nava, who co-organized the Exhibition “Ausologie” with his wife, María Berrada; juror-nominations Cesar Oliveira, who curated the exhibition with his wife, Elena; and two other judges, Agustín Palma from the State of Queretaro, and Tomaszkiewicz Brzozowski from Poland.The list of artists who were shortlisted for the 2019 prize is as follows:Alejandra Ferrer (Mexico)Oliver Gaertner (Germany)Rajiv Gaertner (Poland)Maria Hernández", "The next Biennial should be held in 2020.  So far, the exhibition has successfully exhibited projects by artists such as Olu Oguibe, who creates works that are both experimental and meditative, and Anna-Sophie Rødberg, who creates works that are filled with stories of loss and loss of identity. Inaugurating the exhibition are works by both artists and teams from the United Kingdom, Estonia, and Finland. The Dusseldorf Biennial will be the second show by the German-based artist Alexander M. de Maar. The first new exhibition at the museum since the museum opened in 1992, “Roland and Wilfred” (2017–18), is currently on view until March 21, 2019.\n\n\nThe San Francisco Museum of Modern Art (SFMoMA) has purchased sixty paintings from the K-pop group Girl Group and the Japanese artist Koki Kawasaki. The acquisition includes works by seventy-two artists, including ten pieces by the duo Sora, who are currently represented by their new ownership, and fifty-two works by Kawasaki.SFMoMA is also the first museum to acquire these works, which were created by the two artists in the span of", "The next Biennial should be held in 2021.\n\n\nThe Museum of Modern Art (MoMA) has appointed Mark Halperin as its next director. Halperin comes to the institution from the Metropolitan Museum of Art, where he helmed the Modern Art museum from 1988 to 1995. He succeeds Paul Mpagi Sepuya, who retired in March 2019 after seventeen years at the helm of MoMA.“Mark is a proven leader and a distinguished scholar who has served as the director of the Modern Art Museum since it opened in 1972,” said museum director Daniel H. Weiss. “Having spent more than two decades at MoMA, Mark possesses the vision and the leadership skills to both grow MoMA’s collection and to continue to advance and shape the institution’s exhibitions and programs. We are confident that he will continue to advance our programmatic and curatorial excellence, both in the collection and in the exhibition-making process, while continuing to foster and expand MoMA’s programming.”Prior to joining the museum, Halperin served as a curator at the museum for eight years. During his tenure at MoMA, he organized more than a dozen exhibitions, including “The Screaming Image: Rem", "The next Biennial should focus on the history of science fiction and fantasy literature from a feminist and queer perspective\u0097the exhibition should address the history of women’s visionaries in a queer context\u0097and should also consider how it can become a platform for questioning and rethinking the gender binaries that shape narrative.”The next edition of the SFWA will take place at the San Francisco Museum of Modern Art (SFMoMA), which will inaugurate the new venue in October. The event will also incorporate fifteen-day free admission, with a minimum of two hours of free admission per day, and will feature a number of artist works, including artist essays by female authors, artists who identify as trans, and short fiction by women writers. The 2019 edition will return to the San Francisco Museum of Modern Art for a second edition, which will take place at the California Academy of the Arts in January.\n\n\nArt Basel Hong Kong has announced that the first round of the 2020 edition will be held at the Hong Kong Fair in December and will kick off with an open edition in January. The fair’s board of directors has also informed the public that the event will see a rebalance of the fair’s programming, with two fewer days", "The next Biennial should take place in 2020, and the taxidermy institution should be inaugurated in 2021. The Art Newspaper reports that the pavilion will be inaugurated by the city of Piedmont in the spring of 2021.The new museum will contain fourteen new works by contemporary artists. It will also boast a gallery, a classroom, a lecture hall, a specialty museum, a library, and an information kiosk. The project aims to create a contemporary and international platform dedicated to Giard’s work. The construction of the pavilion and the museum was financed by a special grant of €500,000 from the Pilarbic Foundation, an organization that supports the museum. The Pilarbic Foundation also funded the renovation of the museum’s former Cappello di Rivoli, and the renovation of the museum’s Visitor Center in Venice.\n\n\nThe New York Public Library (NYPL) has unveiled plans to open a major new digital research center dedicated to the works of the more than 1,700 African American artists and collectives who have been selected to participate in the 2020 Biennial of American Art. The Center for Black American Art will be located in the basement of the library on Long Island", "The next Biennial should be held in the spring of 2021. The exhibition will focus on the contributions of female artists and will be organized in collaboration with artists' families and other stakeholders in order to reflect the different professional practices of the biennial subjects. The theme of the exhibition will be “I, Am,” which refers to a question of identity and the body as well as the questions of life and death and the power of the body.\n\n\nThe Museum of Modern Art (MoMA) in New York is planning to renovate its already-expanding David C. Driskell–designed David K. Gill Institute for the Arts (DGG) in Harlem, which currently hosts more than two hundred artists from forty countries and territories, including Australia, China, Japan, and the United Kingdom, and has approved a $600 million expansion plan. The expansion will introduce new public programming, enhance the museum’s collection, and expand the museum’s footprint.“We are thrilled that the David C. Driskell–designed DAGG will soon house more than one hundred artists, and that the expansion will ensure the DAGG’s long-term sustainability,” said Marc Glimcher,", "The next Biennial should be held sometime between the fifteenth and thirtieth. To promote exchanges between the artist and the museum, the exhibition should include installations, tours and discussions, and a re-creation of the museum’s collection.The biennial, which will be comprised of twenty-four works, including work on paper, photography, film, and sculpture, will conclude with a selection of fifty works from this exhibition. The works in the exhibition will be organized in the following way:The exhibition will be organized as follows:The exhibition will be held in the Museums and Collections of the Deutsche Kunstverein Berlin from February 19 to February 21, 2020. The first day of the exhibition will be March 19. “The show will be an extension of our ongoing collaboration with the artist to create new works in a way that celebrates his heritage, his insights and his methods, both gaining and extending new perspectives,” said Joachim Büchli, the executive director of the Deutsche Kunstverein. \n\n\nThe Los Angeles County Museum of Art (LACMA) has agreed to pay $6.5 million to settle a lawsuit brought by the estate of Italian architect Ettore Parisi, who", "The next Biennial should be held at the Sinai Art Museum, Nagoya (Exhibition “From the Stages,” November 21–March 29, 2021). The 2020 edition, entitled Art in the City, will consist of a selection of eight works and will showcase the work of thirty-eight artists.The full list of fairs participating in the 2020 BIMB Awards is as follows:Japanese arts and cultural organizations in Tokyo, including the National Museum of Fine Arts, Toyama City, and the Museum of Fine Arts, Turin.The Tokyo International Film Festival will offer live programming this summer. The Tokyo International Book Fair will take place from August 26 to August 31 in the city of Nagoya. The fourth edition of the annual Tokyo Art Show will be held from August 29 to September 3. The 2019 Tokyo Triennale will be held from August 6 to August 14.The Venice Biennale will run from May 22 to May 29. The twenty-fifth edition of the Venice Architecture Biennale will take place in May and February. The 2019 Venice Documenta, which was organized by the Venice Foundation, will be staged in May.The New Art Bienn", "The next Biennial should take place in the fall of 2020. The twenty-second will be held in the fall of 2021 and the twenty-third will take place in the fall of 2022.The engagement with biennial themes was founded by Pilar Pelayo, the director of the Bienal de São Paulo, after she spent several years in the Brazilian state of Minas Gerais as a curator of the period between 1958 and 1964. She returned to the United States in the 1980s and has since become a professor of art history at the University of Michigan. The institute will charge $12,000 per year for full-time faculty, $6,000 per year for part-time faculty, and $500 per year for students. “It is an honor to stand with the Brazilian people, the current exhibition organizers, and the artists and curators of the Biennial in Rio to present them with the exhibition of the exhibition of the exhibition of the exhibition of the exhibition of the exhibition of the exhibition of the exhibition of the exhibition of the exhibition of the exhibition of the exhibition of the exhibition of the exhibition of the exhibition of the exhibition of the exhibition of the exhibition of the exhibition of the exhibition of the exhibition of the exhibition of", "The next Biennial should take place in the United States. “The next Biennial will consist of the same subjects as the first one, but will be a bit more ethnographic,” Andrea Kauders, director of the St. Petersburg Biennale, told the Art Newspaper. “The new work will be on a bigger scale, and will be about three hundred works. It will be based on a concept that we have been developing for decades: the triple exhibition.”Curated by attorney and art historian Anna-Sophie Simon, who will serve as Arts Director for the new event, “The Future Is Present: Art in a Time of Crisis” will open on October 23. Titled “The Third Wave of Art” and hosted by the United Kingdom’s Tate Britain, the event will also feature works by contemporary art and design, video art, performance, sculpture, and installation.The United States is currently grappling with the aftermath of Covid-19, which has infected more than 212,000 people in the country and caused at least 208 deaths. President Donald Trump has blamed the outbreak on \"bad actors,\" including pharmaceutical companies, and has proposed cutting spending on the military", "The next Biennial should be held in 2021, and its design should be drawn from the drawing of a human body. The next edition of the annual exhibition will take place in Tokyo from September 20 to October 6, 2020. The biennial’s theme “Becoming Human: From the Body to the Soul” will be revisited in the following year’s edition, which will be held in 2021. The exhibition will be inspired by the life and work of the artist Marina Abramović, who, despite her many achievements, remains a source of great pride to many in the art world.The upcoming exhibition will be organized as follows: The exhibition will feature works by seventy artists, including Alighiero Boetti, David Chipperfield, Geoff Gibson, Adam Clayton, Andy Goldsworthy, Courtney Love, Anna Grazia, Sianna McBride, Naima Jarmila, and Swami Vivekananda, as well as the artist group the Kankurmans, whose work coincides with those of the Biennials.“We are looking forward to the exhibition’s theme becoming a reality,” said Norio Miya, artistic director of the Biennial. \n\n", "The next Biennial should be held in late September or early October. The museum has already announced that it will not hold any new events or exhibitions. “It is hard to imagine a better venue than the Centre Pompidou for one of the world’s great collections of art,” Jean-Jacques Etter, the director of the Centre Pompidou, told the Art Newspaper.The move comes amid a controversy sparked by the bank’s sale of a twenty-fourth-century painting by Pablo Picasso. Following a protest by American artists, Congress passed a $2 billion bill to rebuild the Louvre and is expected to pass a similar measure this week.\n\n\nThe Smithsonian’s National Museum of African Art (MoA) in Washington, DC, has appointed Thomas A. Price, a curator, educator, and writer, as its next director. Price currently serves as the curator of African art at the Museum of Modern Art in Atlanta and is a fellow at the Institute of Museum and Library Services in Harlem. “I’m thrilled to welcome Thomas to the Smithsonian, an institution I have long admired,” said Karlene Cross, director of the Mo", "The next Biennial should also consider the question of how art and architecture interact in difficult urban settings. The biennial should also consider the potential of the cultural and creative landscape to foster social change, and the sort of architecture that is built against the city should be reconsidered. We hope that this issue will be addressed in the upcoming edition of the Biennial. Art and architecture are inseparable. We are in constant contact with each other through art, with an eye to future generations. We are always remembering, and always striving to create new possibilities for the future. ”\n\n\nAn exhibition of work by the renowned British artist Stanley Joiner at the Shiloh Art Museum in Manchester is currently on view through March 2. Spanning twenty years, the exhibition features work by more than seventy artists, including Charles Atkins, Alexandra Hoff, and Anna Atkins, and is on view until March 18.The show’s twentieth year, “Reflections: Art and Memory” (2015–16), is divided into two parts: “The Color of Space” and “Stanley Joiner: Color of Space”\u0097the former takes up the artist’s theory of color theory; the latter examines how Joiner applied", "The next Biennial should take place in March 2020. The issues that will be addressed in the biennial include the theme of the exhibition, its positioning, the production of the exhibition, and the venue. He also wants to create a new platform for the exhibition.“I want to create a new space for the exhibition that is not a museum but a place for the exhibition,” the artist said. “I want to create a space for the exhibition where the public can visit the works of the artists.”Art critic and curator Michael Waddington, who represents the exhibition, said that the move was made in order to “avoid disruption to the exhibition.” This means that the current exhibition will continue to run in its present location, but will be moved to a different space. Waddington said that the work will be moved to its new home, the Center for Contemporary Art in the City of London, from the Tate, which is currently closed because of the Covid-19 pandemic.The move to the Museum of London follows a long-term plan to move the works on display from its current exhibition space, the Docklands, to a new space at the London site. Focusing on curatorial issues, the exhibition", "The next Biennial should take place in the coming months. The first, which was originally scheduled for August 2021, was moved to September. The exhibit would have featured works by twenty-nine artists including João Pessoa, Carlos-Luis de Castro, and Francis Galindo. The exhibition would also include the first exhibition devoted to facial recognition technology at the museum, titled “Face Recognition: Technology and the Future of the Human Face” (2018–19).The museum has since been approached by the American artist and his wife to help establish a permanent exhibition in the museum. The couple has agreed to finance the project and are expecting a $150,000 donation from the American artist.\n\n\nThe German state acquired the artworks of the late Ukrainian founder of the German contemporary art movement Gali and his son Mihail in a historic legal case brought by a group of artists, including the late American artist Douglas Wheeler, who was one of the plaintiffs in the lawsuit. According to the Art Newspaper, the legislature was given the opportunity to sell the works in a show of sorts at the Kunsthalle Basel in December, but the controversial sale was vehemently opposed by the heirs of the founder as well as a number", "The next Biennial should then focus on “the ongoing character and the major shifts in the universal and the individual,” the organizers said.“History is a prologue, but a prologue is an apt description of these times. We have more to live for, and the history of our city should shape our future.”\n\n\nMore than 2,300 scholars and activists are urging the Royal Academy of Arts (RA) in London to cancel the next edition of its London-based biennial “The Black Book.” The event, which has featured artists such as Ella Eyre, Kevin Owens, and Tawana Bish, is slated to run September 23–September 27 and will be held at Tower Hamlets’ historic Little Walden, which sits across the Thames from the Thames.Organizers cited the recent unrest in the United Arab Emirates as one of the reasons for protesting the event. “The exhibition has been curated by a group of English artists who have previously worked with the region, including Sarah Peck, Robin Surtees, and Rosalind Russell, and has been presented at a time when many people are feeling alienated from the cultural and political institutions in their country,” reads a statement", "The next Biennial should be held in 2021. The next edition, “Crisis of the Century,” will be held in 2023. The next one, “Coming Together,” will be staged in 2026. The next event, “From Black to White: The Art of Solidarity,” will be held in 2027.The next exhibition should be staged in 2022. The next one, “The Evolution of Desire: The Art of Art” will be held in 2022. The next retrospective, “The Ecstasy of Cépès: The Art of the Ecstasy of Cépès,” will be staged in 2021. The next exhibition, “From Cépès to Monet: The Art of the Drawing,” will be staged in 2022. The 2019 edition, “From Cépès to the Production of Baroque Art,” will be staged in 2022. \n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles has welcomed three new members to its board: David K. Olson, chairman of the investment firm Elliott Management; Scott M. Thomas, president and CEO of the California Institute of", "The next Biennial should include a performance by a group of under-recognized artists whose work explores the subtextual and the transcendent, and a free event that will feature work by artists whose work explores the possibilities of the imagination. In the event that the ambitious exhibition is unanimously canceled, the biennial’s organizers are prepared to move the exhibition—which has a resounding $58 million budget—to the Center for Art and Human Values in Los Angeles. When asked about the possibility of a biennial in Buenos Aires, Perez-Mena said: “This is a project that was born in Buenos Aires. The project was born out of a desire to work with the city in its entirety to create a new exhibition. The concept of the event is still the same: a world-renowned artist-in-residence, a conceptual space created in a city that has experienced the devastating effects of an economic crisis, an urban crisis.”\n\n\nThe Museum of Modern Art (MoMA) in New York has received a gift of five works by British artist Dr. Martin Luther King Jr., who lived and worked in the city of Birmingham, England, from a group that included artist-students from the University", "The next Biennial should also take place in Helsinki in May 2020.  This year’s edition, entitled “Art and Resistance,” will be staged at the Koppelmäki Gallery, from March 20 to March 23. The theme of the exhibition will be “Living Conditions of Resistance,” and the exhibition will consist of fifty works, including Don Quixote: El Tome, 2001, which is a tribute to the late Spanish artist José Maria Marin; Annelie: The Other Side of the Sun,” 2001, a series of photographs by Max Beckmann, and Agnès Villebon, 2011, which was presented by the French artist Sylvain Bénétière at the Museum of Modern Art in Paris in 2017.“The next edition of Biennial will take place in the studio of Anton Stenkovski, in the Kupala Gallery in Helsinki, and will include performances and other programming that will be organized in a very collaborative way, with the participation of the participants in a very open manner,” said the organizers. The exhibition will open in June 2020 and will run until November 2021. \n\n\nThe City", "The next Biennial should take place in 2019.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York and the Metropolitan Museum of Art (MoMA) in Miami are collaborating on a massive overhaul of the Met’s former campus. The project, dubbed the Metropolitan Research Center, will involve the construction of a new 300,000-square-foot building and the restoration of the historic Chandler Building.“The new facility will foster an interdisciplinary and interdisciplinary dialogue between the museum and the city at large,” said David Samson, the museum’s director and CEO. “The research center will foster a deeper understanding of how art, design, and design-centered practices shape and shape-encompass our world, and will engage directly with the city’s cultural and historic resources.”While the center will be located in the former site of the old Metropolitan Museum of Art, the museum will retain the same approximately 1,700 seats and will continue to operate as a museum. The program will also include the installation of more than 250 new works by local and international artists, the restoration of the Chandler Building, and the commissioning of artwork by artists such as Lisa Frankenthaler, Mihai", "The next Biennial should take place at the Museum of Contemporary Art (MCA), New York, in 2021.\n\n\nThe National Gallery of Scotland has received a donation of twenty-five works from the National Galleries of Scotland (NGA). The works were donated by Michael Consuelo, the CEO of the private Scottish gallery company Apollo and a former director of the National Gallery of Art in London, and are currently on display in the exhibition “The Future Is Now.”The donation includes Rema Hort Mann’s “The Chapter of the World,” which was commissioned by the late British artist Ingrid Adams and is currently on display at the gallery. The work was made in the immediate aftermath of the September 11, 2001, terrorist attacks on the United States, and explores the relationship between the United Kingdom and the United States.The exhibition also includes works by artists such as Marie Dubois-Duchesne, Herbert H. Figueroa, and Robert Mapplethorpe, among many others, and will be on view November 23–December 6. The work of German artist Bernd and Jürgen Haber, which will be featured in the exhibition “The Humans in the Image Gallery,”", "The next Biennial should focus on “intersection of art and technology,” said Letyan.  “Art and technology are like water and fire. In the same way that fire and water are like air and fire, these new technologies are like chemistry and biology.”\n\n\nThe Taumarun Art, Architecture, and Design Biennial in Singapore will kick off with a public viewing of new works by the first group of artists to reimagine a city as part of the inaugural series, “The City in Architecture,” which will run from March 19 to March 20. Located at the Inner Tower of Singapore, the exhibition will focus on the theme of simplicity, transparency, and diversity, which is meant to be a “language of life,” and will feature work by thirty-seven artists, including Chia Yu, Khaled Ghobash, and Becca Lee, as well as the first solo exhibition of the conceptual artists Turin-based artist-designer Robert Irwin, who will highlight his installation Three Houses, which was staged as a “vacuum” in a studio in Singapore in 2015.Founded in 2018, the Taumarun Art, Architecture, and Design Biennial is curated", "The next Biennial should also include a panel discussion on the origins of art. As the exhibition has been canceled since March 13, the museum will invite the public to participate in another one-day workshop on March 21. The 2019 edition of the biennial, “Years of Drawing: From Cerrado to the Arts,” will feature the work of seventy artists and creators\u0097including Renzo Piano, Nilo Rodot, and Édouard Vuillard\u0097and will be held in the exhibition halls of the Biennale di Venezia, the Museo della Scala, the Museum of Modern Art, the Louvre, the Galleria Adige, the Museo Cattivo, the Museo della Scala, and the Museo Credenza.\n\n\nThe Institute of Contemporary Art (ICA) in Venice has agreed to facilitate the return of a 17th-century chapel to a Muslim saint in Italy, whose remains were exhumed in 2015 to make way for a construction project that will involve the removal of a 15th-century monastery and the erection of a mosque.The chapel, identified by its historic site in Venice’s Punta della Dogana neighborhood, was part of an important medieval", "The next Biennial should focus on “a fundamental renewal of the campus from the ground up, with a view to creating a stronger bond with the surrounding area coming decades.”The Island Biennial, which debuted at the Museo de Arte Contemporáneo de São Paulo (MASP) last year, is currently on view in the Brazilian city of São Paulo. The event will feature more than one thousand works by more than sixty artists in addition to new works by Brazilian, international, and contemporary artists.\n\n\nPost-Cultural Revolution Brazil is hosting its biennial “Tacita Nascimento,” which has been in the works for more than a decade, in the capital, Brasília. Its 2019 edition, titled “Cultural Revolution II” (Rio de Janeiro), will be held in the Carlos Alÿs Museum of Art in Belo Horizonte from November 21 to November 25. The museum will also stage a special exhibition of work by twelve artists, including Ana Letícia, Alina Jocson, Adriano Pedrosa, Raimond Pirelli, and Maria Fortuna, in 2024.On November 6, the Brazilian government announced", "The next Biennial should be set up to encourage the collaboration of artists from different disciplines, including design, film, and technology. The programme will start with a symposium, which will last for twelve weeks, and will involve discussions about contemporary issues, including the meaning of life and art, how digital technologies are reshaping the way people see the world, and the capacity for art and artmaking, and will include discussions with artists and other activists and will consist of three parts: a), the Biennial, b) a series of lectures and talks, and c) a special exhibition.“Our programme was inspired by the extraordinary reception the Biennial had at the Venice Architecture Biennale in 2005 for its innovative and provocative work on photography and the history of photography,” Artforum editor Simon Logan said. “Following the dedication of an exhibition at the Gallery of Modern Art in London in 2006, similar exhibitions were staged by the National Grafton Museum in the US and the Hauser & Wirth in New York, and we are currently pursuing the possibility of exhibiting portraits and works on photography in a major international exhibition.”\n\n\nSensory-based art project VINDA Project has launched a new digital initiative that will help artists", "The next Biennial should take place in 2020, at which point it will be a stretch to determine its fate.\n\n\nThe Museum of Fine Arts (MFA) in the City of Atlanta has received a gift of more than three hundred works by the late artist Murray Cardozo. The gift includes hundreds of Murray Cardozo’s early prints, including many from his large-scale work The Insects, which is currently on display in the museum’s new exhibition, Poster Box, which opened on October 23, 2020.Established by the late artist, activist, and educator John Phillips in 1994, the museum is currently home to more than 1,100 works by the late artist. The works in the exhibition are organized by chronological order, with the most recent works being presented in the first two sections of the exhibition. To date, the works in the exhibition have garnered more than three hundred thousand visitors.In the first section, “Murray Cardozo: A Retrospective,” the artist was shown an assortment of prints dating back to 1948 that were reburied in his hometown and placed in a carousel for a lifetime-spanning show devoted to the artist. In the exhibition, a number of Cardozo’", "The next Biennial should be held at the Brooklyn Museum in New York in 2020, and the next Art Biennial at the Museum of Modern Art in New York in 2021. To date, the MFA and the Art Biennials have honored seventy-six artists, with seventy-six biennials selected by the same jury\u0097Judson, McCann, and Skull and Bones. ArtCenter Jacksonville’s selections of artists were announced on Wednesday, March 31.\n\n\nThe London-based biennial AIPOS, which has staged shows at the Barbican Art Museum in London, the London School of Economics, and the New Art Gallery in London, between 2011 and 2016, has ended its run in 2020 following an attempt by the institution’s former director Marc Harper to get the festival to exit the city for the sake of the arts. According to The Guardian, Harper enlisted the help of a group of fellow artists to persuade the Barbican to part ways with the London institution, which has recently been embroiled in a controversy surrounding the acquisition of a collection of work by the late British artist Rich Houska.During an open letter penned by Harper to the Barbican’s chief executive Katya Golub on July 27,", "The next Biennial should be held in 2021.  The museum has received a gift of 150 works by American painter Robert Hunter; he was selected for his work Leazenger (Lecky Higgins, 1960). \n\n\nArtist-run  is seeking the return of works by the late British sculptor Peter Sellars, whose body of work includes pots and pans, avant-garde sculptures, and the Paris-based visual arts collective Prouvé (pronounced \"Quaker\") as well as works by other contemporary artists, including Tony Lejointe and Pierre-Auguste Renoir.The nonprofit, which has locations in New York, Berlin, and London, and is supported by a $10,000 grant from the César Raichlen Foundation, announced on March 28 that it would turn the remains of its artist-in-residence, a six-thousand-work wooden structure dating to 1973, into a space for contemporary art. The designation came after  was awarded the César Raichlen Award for Visual Arts.Purchased by Sellars and his widow, Vera, the wooden structure, known as Prouvé, is surrounded by 300 acres of rainforest in the Per", "The next Biennial should take place in 2020.  Gouby Foundation Vice President and CEO, J. Peter G. Bouby, said: “We are thrilled that in the next two years the Biennial of Art will be able to welcome the most amazing teams from around the globe, to showcase the best art from around the world, and to continue to showcase the work of the greats.”The organization is also expanding the scope of its collection through the acquisition of works by Nina Simone, Gisèle Béchamp, and Alessandro Cattelan, as well as the collection of works by Pia Camille Prouvé, Anna Amanova, and Gio Ponti, among others. In addition, the foundation is buying works by artists such as George McRae, Josette Ault, and Mark Goody.\n\n\nThe Monell Chemical Senses Center in Philadelphia is turning to job training programs to help its workforce before it closes its doors to the public in March 2020. On Wednesday, the center announced that 80 percent of the staff will be offered subsidized health insurance through the New York–based nonprofit HelloFresh, which will pay 40 percent of premiums through a new fund launched by the", "The next Biennial should be staged in the capital city in December. The twenty-fifth Biennial will take place in Bali in March. The twenty-eighth will be staged in the capital city in June. \n\n\nThe Metropolitan Museum of Art in New York has announced that Dow Chemical Co., the largest private purchaser of art in the United States, is planning to spend $9.3 billion to acquire more than 180 artworks by Chilean artist and revolutionary leader Emiliano Zapata. The museum will invest more than $4 billion in acquiring works by artists and cultural workers of color and other marginalized groups as part of its efforts to be more inclusive and culturally responsive.The announcement follows the opening of a seventy-five-foot-long exhibition of works by Black and Latina artists at the museum, titled Zapata: The Art of Blackness, which is scheduled to open in January 2021. More than two hundred works by artists of color are currently on display in the forthcoming season. The show is part of the $8.7 million expansion and renovation of the museum.\n\n\nThe Toronto-based artist Amara Brackens has been named the next recipient of the National Arts and Humanities Research Council (NADA) National", "The next Biennial should take place in the spring 2019. The event will be hosted by the New Museum, in partnership with the National Gallery of Art in Washington, DC; the Brooklyn Museum; and the New Museum of Art in New York City. As part of a major expansion and modernization of the National Museum of American Art in Washington, DC, the institution will move more than 1,500 works and will open in 2018. According to the New York Times, the National Museum of Art has received a $50 million donation from David H. Koch, the billionaire industrialist and the founder of Koch Industries, and his wife, Elissa, as well as $25 million from the Charles and David Koch, the brothers who are known for their philanthropy. The Charles Koch Foundation did not respond to Artnet. The Kochs also gave $5.5 million to the Smithsonian’s American Art Museum in the last year. David Koch, the billionaire industrialist and the founder of Koch Industries, gave $25 million to the National Museum of American Art last year. The Kochs are also big supporters of the arts. David Koch and his brother Charles donated $2.5 million to the Smithsonian’s American Art Museum in", "The next Biennial should take place in 2020, but the event has been postponed since March 2019 because of Covid-19. The museum is still determining when the show will resume. Its next exhibition, “Purity Through Design,” will open in September 2020.\n\n\n\n\n\n\nA group of artists, activists, and academics has condemned the Israeli government for failing to take strong and immediate and adequate action to protect Palestinian lives and property as a genocide was committed against the Jewish people by the Israeli military in the 1967 Middle East war, and as a new report by the United Nations paints a dire picture for the future of the West Bank and East Jerusalem. “The violence, discrimination, dispossession, demolition, and displacement of entire communities is an ongoing reality, particularly for Palestinians,” said Mimi Al-Hariri, chair of the Palestinian National Initiative (PNI), in a statement. “The PNA calls for international intervention, international solidarity, and international agreements to be implemented to protect and secure the rights of Palestinian people and to ensure their equality and inclusiveness.”The seventy-six-page report, titled 回答飞飞: Israeli Practices Since 1967 (NADA", "The next Biennial should be held at the MCA, which is currently undergoing a $25 million redevelopment, in the autumn of 2022.The announcement comes as the MCA was awarded a $10 million grant from the city of San Carlos de la Barra, the city of São Paulo, and the city of Manaus. The MCA was also awarded a $10 million grant from the president of the State of Minas Gerais, Edgardo Cunha, in 2017.\n\n\nThe Los Angeles County Museum of Art (LACMA) has submitted its plan for a new $10 million renovation to the National Geographic–designed landmark. The new design includes more seating, a larger collection, and more galleries. The renovation is being spearheaded by architect Daniel H. Weiss.“The restoration of LACMA is an important and transformative project for the landscape and the city, and for the country,” said museum director Deborah Roesler. “Its restoration will help maintain the landmark as one of the most important cultural symbols of the United States. LACMA has a strong and dedicated public-relations team dedicated to supporting this mission, and we know that the new National Geographic–designed building will help secure the institution’", "The next Biennial should be staged in 2020. Expected to cost between $35 and $45 million, the exhibition will include more than 70 new works by twenty-four artists, including Amanuel Lish and Peter Kapono, Benjamin Pindell and William S. Burroughs, and will open at the Montpensierhaus in Cologne.The upcoming edition of the Art Biennale will be hosted by the Museum of Contemporary Art, New York; the Museum of Modern Art, New York; the San Francisco Museum of Modern Art; and the museum of Contemporary Art, San Diego. The Festival will also include a redesign, construction, conservation, and restoration of the museum, the Art Writers Association (AWA), and the museum’s collection. The overhaul is being led by Michael Malshe, who previously served as director of the Anne-Marie Mie Collection in New York, and will be accompanied by a redesign of the AWA’s campus.The redesign of the museum involves the reconfiguration of its principal courtyard and the creation of a new pavilion, a new visitor entrance, a new van, and a new exhibition area. In addition, the museum will expand its en", "The next Biennial should be held in 2021. \n\nThe British architect and theorist David Adjay—who, in the 1960s, became one of the architects of the Los Angeles County Museum of Art (LACMA) and later of the Los Angeles Memorial Art Museum (LAM)—has died at age eighty-one. Adjay, who came to prominence during the development of the Los Angeles Unified School District (LACMSD), which was created after the city’s annexation by Los Angeles County in 1953, died in Cathedral City, California, on April 4, 2018.Born in London in 1956, Adjay studied at the University of California, Berkeley, where he received his undergraduate degree in 1967. He then attended the London School of Economics, where he studied with Edward King, whose practice included the construction of large-scale urban environments such as the Glass House in Liverpool, England, and the studios of Norman Foster and David Childs, which Adjay collaborated with.In 1973, Adjay moved to Los Angeles, where he enrolled in the city’s graduate design program, and began working with LACMA, which reopened in 1976. He returned to London in 1984, and LACMA in 1996, where he continued his", "The next Biennial should be held in twenty-six months. “The biennial is about to begin and is still in the process of developing its programming,” ŜMadrid’s director, Diego Rivera, told the Art Newspaper. The theme of the forthcoming event, which will take place at the Museo de Arte Contemporáneo in Madrid, will be “Work and Life as Minimal as Possible.”The museum, which recently celebrated its sixtieth anniversary, recently announced its partnership with the Sunnybrook Museum of Science in California. This means that the upcoming exhibition will present an interdisciplinary project of art, science, and technology, focusing on the laboratory and automata.\n\n\nTucchin, the Swiss artist, filmmaker, and curator whose experimental and rarified art often grapples with questions of life and death, died on December 28 at his home in the city of Zug, Switzerland. He was ninety-seven years old.Born in Zurich in 1923, Tucchin studied at the University of Basel, the University of Bern, and the Museum of Modern Art in Margravate, Switzerland. After he graduated from the latter institution in 1951, the Swiss Academy of Art in Geneva", "The next Biennial should be held in 2020, the same year as the third edition of the show will take place at the Musée d’Art Moderne in Paris, which will be inaugurated by a selection of the work of Pierre-Auguste Renaud. The show will continue in its current form at the Musée d’Art Moderne until the end of the decade. The first edition of the Biennial, which was held in 1992, was held at the Musée d’Art Moderne, which has been a cultural monument since 1906. The exhibition opened with a film by the French director Stéphane Berends and the Moroccan-born sculptor Youssef Alkadhi, who were chosen to represent Algeria, Egypt, and Lebanon, respectively. The teams behind the exhibition include Art historian Jean-Jacques Dagenaud, curator of contemporary art at the Musée d’Art Moderne, and journalist and curator Lévy Groupe, which runs a show of the works of the exhibition on its website.The twenty-first edition of the Biennial, which will be held at the Fondazione Becchetti Frente in Milan, will be held in", "The next Biennial should be held in 2019.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is working with the California Environmental Quality Agency (CEQA) to assess the environmental impact of construction in the museum’s new $650 million, eight-building complex. The center will also have a Children’s Pavilion and various visitor experiences, including an extension of the South Lawn and the Mojave Trails, and will include a new public courtyard and rooftop garden.The agency will be responsible for gathering data on the environmental health of the project and will release an inventory of greenhouse gas emissions and air pollution annually. The first phase of the project, which will involve demolishing two existing buildings, opened in April and will include installing a second phase to address air quality in the building and surrounding area. According to a press release, the museum anticipates the environmental health effects of the construction and demolition of the building and surrounding area will be felt for years to come.\n\n\nThe Lyon Art Biennial, which was canceled due to Covid-19, has decided to reschedule its second edition, originally set for March 13–March 20, 2020. The event will now take place in June, and will feature work by seventy-two", "The next Biennial should be held in 2020. \n\nThe National Urban League, which works with local, regional, and federal governments to promote urban policy, has announced that it will reschedule the 2020 edition of the National Geographic Society’s annual Vanguard Prize, which honors outstanding contributions to the field of American exploration, art, architecture, and design, to take place in 2021. The organization said that the decision to reschedule the event was made in light of the “unique challenges posed by the ongoing global pandemic.”In a letter addressed to the National Geographic Society’s executive board, executive director Mike Wallace wrote: “We decided that rescheduling the Vanguard Prize would be the best way to ensure that the 2019 theme, ‘Nature/Natural History,’ was recognized and appreciated by a large and diverse public. . . . As a society, we have made tremendous progress in demonstrating that we value and care deeply about the work of those who have made this year’s theme possible. We hope that this decision will allow us to take even more meaningful action for the future of the National Geographic Society.” The letter concluded with a plea for the organization to reconsider its decision", "The next Biennial should be held in the spring of 2020 and will be held at the Museo de Arte de Porto, located on the coast of Porto-Civita in southern Portugal, in celebration of the centenary of the institution. The exhibition will be divided into five themes: Art, History, Architecture, and Rendering. The first exhibition, “Avant-Garde Re-creations” (2019), focused on collaboration between artists and architects. The second, “Arts: History, Art, and the Future of Art” (2019), will examine the relationship between art and history, and will initiate a conversation with the unique works of Sérgio Moro, László Moholy-Nagy, and Mark Büchli. The third and final exhibition, “Architecture at the Museum” (2019), will present an exhibition of new work by the first group Chair of the Museo de Arte Cristóbal, José de St. Croix, and the second curator of modern art, Barbara Pilar, and will consist of ten works.\n\n\nThe Smithsonian’s National Museum of African Art (NMFA) in Washington, DC, has announced that", "The next Biennial should be held in 2021, the most likely date for its return to New York, and the exhibition should include works by artists such as Annie Copley, Robert Irwin, and Walter de Maria, who have been neglected by the museum.The museum, which reopened in 1970, has a long-standing ambition to expand its collection by five hundred works, and the building of the museum’s new headquarters is the latest chapter in a series of projects designed to make the collection more accessible.The first phase of the expansion project, called the Taschen Pavilion, opened in 2013 and has since become a major attraction at the Biennale. The pavilion, which included the exhibition space the Museum of Modern Art, and an upgraded shopping mall, the Pavilion of Modern Art, in 2018. The fourth iteration of the event, the 5th Biennale of London, was held in 2021. The exhibition’s 2020 edition, “The Future of Art,” was staged at the Palace of Westminster on February 25 and was closed to the public.\n\n\nThe British artist Andy Warhol, who had his first solo exhibition at the Museum of Modern Art (MoMA) in 1969, died on October 22 at age fifty-", "The next Biennial should be held in 2020. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Cynthia Watson as its next chief operating officer. Watson succeeds Amy Sussman, who retired in January 2019 after nearly six years at the helm of the institution.“Cynthia is a leader and a true visionary who has been instrumental in transforming the Museum of Contemporary Art into an institution that fosters and celebrates the highest good,” said MoCA director Jim Jarmusch. “As the new chair of the Museum of Contemporary Art, Cynthia will be able to continue to shape the Museum with a new vision and new approaches as part of a dedicated and dedicated staff. She will also have the opportunity to deepen the legacy of the Museum with the upcoming exhibition ‘Farewell,’ which will explore some of the earliest works by artists and how this legacy is being disseminated digitally.”Prior to joining the Museum in 2015, Watson served as the executive director of the Museum of Contemporary Art in Harlem, New York; the former director of the Contemporary Art Museum in Chicago; and as the executive director of the Contemporary Art Museum San Francisco (CAMAS), which she founded with her husband, Thomas J", "The next Biennial should be held at the Institute of Contemporary Art in Paris in April 2020. The 2019 edition, titled Titel: La Nouvelle Art, was held at the Museum of Modern Art in New York from September 18 to September 22. \n\nThe Hirshhorn Museum and Sculpture Garden in Washington, DC, has added five new works by artists whose work is currently on display in the exhibition “Out of the FOG: Art in America 1940–1980.” The Hirshhorn includes three new works by artists whose works are currently on display in the exhibition: Mies van der Rohe, Alejandra Almeida, and Ulrike Alsop. The exhibition will run at the Hirshhorn from April 19 to April 21, 2020.A selection of new works by the so-called “New Gers” includes David Edwards’s The End of Days (2017), which was one of two works on display in the exhibition for the first time in 2018. The other work, which was created in 1958, is a concept work called Gaia, which was created in the form of a table and is in the exhibition “New Gers: The End of", "The next Biennial should be held at the Metropolitan Museum of Art in New York in 2021.  ImageNet will extend the partnership to the Museum of Modern Art in New York, where it will organize a biennial exhibition in 2021. The museum will draw from the collection to create a new exhibition, “NIRIN,” that focuses on the upcoming exhibition “SOUTHERN,” curated by artist and curator Zoya Aksoy.Rosa Iannone, the director of the Museum of Modern Art, New York, said: “We are thrilled to partner with ImageNet to present ‘NIRIN’ at the Metropolitan Museum of Art, which is a truly unprecedented exhibition in terms of both scale and scope. The museum will be able to host a retrospective of the work of twenty-four artists and gain the rare opportunity to present this work in the United States. We look forward to the exhibition and to the upcoming years.” \n\n\n\n\n\nPhotojournalist and activist Nell Doran, a longtime advocate for social change and a founding member of the New Black Panther Party, has died at seventy-eight years old. Doran was born in Memphis, Tennessee, in 1940. Her parents", "The next Biennial should be held in the fall of 2022.\n\n\nThe Pérez Art Museum Miami (PAMM) has appointed the development team of the Pérez Project, which aims to promote interdisciplinary artistic and conceptual projects in Miami, as the official partners of the museum. Inaugurating the museum, the institution will host the Pérez Art Museum Miami in the fall of 2021. PAMM director and CEO Gabriel Peralta stated: “In the process of transforming the Pérez Art Museum into a permanent fixture in Miami’s cultural landscape, we have created a unique space for creativity and public engagement in the museum. We are looking forward to collaborating with the Pérez community and the community of artists, art enthusiasts and institutions in the greater Miami area to present a curated exhibition of works by artists in the United States.”PAMM’s new partnership with Pérez Art Museum Miami will be called “Pérez Art Museum Miami Accelerate.” The initiative will invite local artists and organizations to PAMM for a series of public programming that will showcase the works of Pérez artists to coincide with ArtMiami’s annual Pérez Art Museum Miami fair.", "The next Biennial should be launched sometime in the second half of 2020. “In a time when major art institutions in the world are closing and artists are facing unprecedented challenges, the exhibition series will help raise awareness and inspire, as well as the critical questions surrounding art and art history.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles released the budget for its 2028–29 season, which will be led by artist and activists from the Cultural Action Group (GAP), and will be hosted by director Klaus Biesenbach. The budget for the exhibition was raised by a $1 million donation from artist and activist Nari Ward. Biesenbach said that the funds have allowed MoCA to increase the number of artists featured in its upcoming exhibition series from five to seven, and to create new opportunities for social change and conflict resolution.“As an institution that has dedicated its entire existence to the visual arts, I have found that MoCA has continually prioritized the value of community over art,” Biesenbach said. “The partnership with GAP allows us to be more sensitive to the needs of artists, and to grow the body of work dedicated to their voices.” He", "The next Biennial should be held at least once a year. \n\n\nThe Museum of Modern Art (MoMA) has received a donation of fifty-six works from the Italian collector Nino Cipolletta. The donation comprises forty-five works on paper by the artist, including The Space Between The Sun and The Moon (1921), a series of twenty-six sketches of stars and planets, and a monumental reconstruction of Rome built to include the city’s Via del Trisulti, the Via di Piazza, and the Via della Scala.Cipolletta, who has lived and worked in the United States since 1986, said: “I am very happy to announce that I have been given this privilege of exhibiting a work in the new exhibition dedicated to a hundred years of Italian art, which is a very compelling milestone. The work I am presenting today is a tribute to the art of Nino Cipolletta and to the future of Italian art.”The work is The Space Between The Sun and The Moon, which was completed in 1923. In keeping with Cipolletta’s desire to present the artist’s work as a whole, the exhibition will include", "The next Biennial should be hosted at the Icelandic National Museum in Iceland, scheduled to be held in the summer of 2021. The museum’s director, Haraldur Gudmundsson, is also the director of the Kiasma Water Museum in Kiasma, Finland, and is chairman of the Swedish Institution for the Preservation of Icelandic Art, which is based in Stockholm. The production team was given a total of eight years to create the work.“I am delighted to be bringing this exhibition to New York,” Kauffman said. “This exhibition has served as a strong inspiration for many young artists. The new work by Devika and Torbjørn Sjørdén, who have been inspired by the exhibition and the exhibition as well as the exhibition itself, I am confident will provide new subjects for the art of the upcoming years.”The works in the new exhibition will be presented by Johanna Hjortenberg and will be based on the exhibition’s “Weird Alphabet” series, which features artists who experiment with various symbols in order to create works that are not based on words. The exhibition will have a retrospective opening at the Museum of Modern Art in New York on March 28,", "The next Biennial should take place in the summer of 2021, bringing together more than seventy artists from twenty-six countries. The program will be hosted in the museum’s new building, formerly the headquarters of the French Ministry of Foreign Affairs, and will debut in May 2021.\n\n\nThe National Gallery of Art in Washington, DC, is planning to raise another $15 million for its renovation and expansion. According to the Smithsonian, the installation was made possible through a $6 million donation from Charles and Lucille Pearson, the founders of the aerospace company Constellos, who were instrumental in the acquisition of the museum in 2006.The donation also revealed that the National Gallery of Art, which was opened by the Pearsons in 1923, will be renamed. In recognition of the partnership, the institution will invite the public to the new location, which will be located at 4201 S Street, NW, in April 2020.“The National Gallery of Art is a world leader in the visual arts,” said museum director Laura Mulvey. “We are thrilled that the Pearsons have committed to making this the center for the National Gallery of Art’s collection of contemporary art, and to support the museum for a future of long-term vision", "The next Biennial should be held in the fall of 2020, and will begin with a selection of work by twenty-five artists.\n\n\nThe Solomon R. Guggenheim Museum in New York has received a gift of seventy-four works that were donated by the late Charles and Adrienne M. Davis. The works, which consist mostly of photographs, drawings, and prints, were donated to the institution in 2005, when the latter was still a hub for contemporary art. The museum has been using the works to further its exhibition program over the years, and in 2018, it staged the first exhibition devoted to photography, “Charles Davis,” which featured twenty-six works, including works by Jasper Johns, Laurence Lazard, and Robert Irwin. The gallery also commissioned a number of works by Davis’s children, R. Davis (d.2011), and J. Davis (d.2013), and recently held a series of exhibitions dedicated to Davis’s photographs.The gift comes at a pivotal juncture for the museum. In March 2019, the museum received a devastating blow when it announced that it would be closed for eighteen months, as it prepared to reopen in the spring of 2020. “The museum is in the", "The next Biennial should focus on the state of American sculpture and what it means for a society that is undergoing a profound and intractable crisis,” said Susanne Vielmetter, chair of the board of trustees of the Biennial. “Themes of the crisis and of how we respond to one another will be central to the programme.”The Biennial’s first institution, the Museum of Contemporary Art Chicago, opened in 1963. In addition to the museum, the Biennial has staged numerous exhibitions, including “Aldridge and Ossieno” (1992); “The Painted Ladies of New York” (2001); “Rachmaninoff: Through the Looking Glass” (2010); and “Derrick Blythe: The Shadow of the Cervical” (2010). The Biennial was also a founding member of the Arts and Leisure Foundation.\n\n\nOn Wednesday, Japanese Prime Minister Shinzo Abe signed a sweeping new copyright law that aims to curb online piracy and stifle local media outlets that criticize government policies. The legislation—which was passed by the Diet and signed by Abe—requires internet service providers (ISPs) to retain customers’ personal information such", "The next Biennial should be held in 2021 and will raise $75 million for the museum. \n\n\nSeventy-three years after the DeCordova Museum of Art in Red Hook, New York, became the first major American art museum to welcome visitors with a virtual reality experience, the institution will now celebrate the occasion with an exhibition of artwork created in virtual reality. The show will be organized as a virtual exhibit “I, VR,” and will feature works by twenty-four artists, including Alighiero Celant, Alessandro Castellani, Emmanuel Champagne, and Alice O’Leary, and will include virtual reality works by artists such as John Akomfrah, Robert Irwin, and Paul Gauguin.“I, VR’s’s eclectic collection highlights the breadth of work in virtual reality,” said Mark Rylant, the director of the museum. “We hope that this exhibition marks the opening of a new chapter in the museum’s history and that this new medium will help us to move beyond VR as a medium and into the future.”As part of the exhibition, the museum will present fifty virtual reality works by artists, including Christian Cam", "The next Biennial should be a continuation of the themes of the first, introducing in its place theć and Зновички, the concept of the landscape and the elements of the city. One of the challenges for this year’s edition will be to reflect the renewal and rebirth of our city, the town, and the surrounding area.”The 2019 edition of the biennial, curated by the artist Kjetil Hjortenberg, featured works by seventy-eight artists, including Paul Gauguin, Ingvild M. Bjerggaard, Frank Gehry, Paul di Bonà, Ermana Farago, and Kiki Smith. The event concluded with an exhibition of work by Norwegian artist Jørn Van de Weg, titled A Message from History.\n\n\nThe Metropolitan Museum of Art in New York has appointed Harriet Ross as its new associate curator of modern and contemporary art. Ross comes to the Met from the New Orleans Museum of Art, where she has served as a curator and senior curator since 2014. Previously, she worked as a curator and gallery assistant at the Whitney Museum of American Art in New York and as a senior consultant for the museum.“We are excited to", "The next Biennial should take place in 2022.\n\n\nAs the French president, Emmanuel Macron, prepares to address the United Nations General Assembly on Tuesday, June 11, he acknowledged the need to create a climate of cooperation between the United States and France. Macron cited the Paris Climate Accord as a model for how a fully functioning international system can be achieved.The Parisian president said that he hopes that the United States and France can work together to create the conditions for a rapid transition to a low-carbon economy. Macron said: “I ask everyone to be mindful of how much more is at stake for the future of humanity and planet Earth. . . . What does it mean to be in a partnership with France?”He added: “I ask that the United States use every opportunity to support France and the entire region and that it does everything it can to be a partner in the struggle against climate change.”Existing climate-friendly Parisian landmarks are being targeted—including the city’s Grand Salon, which will host an Egyptian art festival in 2022, and the Louvre, which will host an African art museum in 2023. Macron said that the city’s Grand Salon is a good example because it implements a carbon budget", "The next Biennial should be a compelling experience for everyone regardless of background or expertise.”She added: “The events of the last ten years have been transformative for me personally and for the Biennial, and I am committed to continuing to move the Biennial through them.” The full list of participating artists is as follows:Jiang Li & Liao Zhou (China)Anna De Leon (United States)Annie Desjardins (Canada)Annie Gade (Canada)Artists:Annie Hanrahan, Anna M. Lin, and Li-Qiang Huang (China)Jason Han (Australia), Jason Ma (Australia), and Jason R. Holloway (US)Janet Hanrahan (US)Artists:Nathan Hennessy, Nell Jones, and Kira Ingram (US)Joslyn Hawn (US)China)Artists:Nathan Hauser (US)Artists:Natalie Hauser (US)Artists:Natalie Hays (US)Artists:Natalie Hauser (US)Natalie Holbrook (US)Artists:Natalie O. C. Anderson (US)Artists:Natalie Porretta (US)Artists", "The next Biennial should be held in Lisbon in the spring of 2021. At a time when many art institutions are closing in the United States and Europe due to the pandemic, the United Kingdom is boosting its exhibition-going capacity by opening more museums, as many creative workers want to see more exhibited. The Bechtel Art Museum in London and the Tate’s Tate Modern in London will stage a series of exhibitions in the spring of 2022. \n\n\nArt dealers and collectors in the United Kingdom are now reporting a spike in Covid-19-related hospital admissions and hospitalizations. While most of the spikes are due to people seeking medical care after being exposed to the virus, some of the patients are ending up in the emergency departments of hospitals.According to the New York Times, the number of people hospitalized in the United States following a hospitalization with the virus has more than quadrupled since October, when the first case was confirmed at a hospital in the Northern District of New York. The coronavirus has caused an extraordinary spike in Covid-19-related hospitalizations in the United States, where an estimated 105,000 people have been infected. While hospitals are now trying to contain the spread of the virus, it is still possible to contract the", "The next Biennial should take place in the spring of 2020, and should include hundreds of works by twenty-six artists, including David Hockney, Christo, Fotoplay and Greer & Brown, and Jashinya. The 2018 edition, titled The Crucible, drew about one thousand visitors and was cancelled the day before it was scheduled to kick off. The 2019 edition, The White Convergence, was moved to June and featured work by forty artists. The 2020 edition, titled The Present, will also be organized as a multi-act play, focusing on the performances of the artists who have participated in the last twelve years. \n\n\nUnited States-based independent curator Anna Anthropy, whose practice encompasses the creation of interactive and hybrid works based on contemporary art and contemporary life, has been named the winner of the $25,000 Simone Oscar Grant Art Prize. The recipient of the $10,000 Carl Gustav Klimt Award in Visual Arts, and the $500,000 Gerald R. Ford Foundation Medal in Art History, Anthropy will now receive the $500,000 Grant. In recognition of her achievements in bringing her art to public attention, the Grant will be honored with a gala at The", "The next Biennial should take place in Tokyo in 2020; the exhibition will be relocated to a new theme park in the city.The 2019 event, “The Decameron Legacy,” was held at the museum of art and curated by Lucy Cowper-Brown. The 2016 edition, “Since the Fall of Man,” was staged by J.M. Berger and ran for ten weeks.\n\n\nThe Massachusetts Museum of Contemporary Art (MCA) in Boston has announced that it is expanding its curatorial program by adding a new role to its curatorial team comprised of a visual art historian, a curator, and an archivist. The newly created position is a part of the institution’s ongoing efforts to rebalance its curatorial teams with a younger generation of curators.“We are pleased to add a vibrant, international curator to our curatorial team,” said director Elizabeth Anne Hay. “Her expertise and leadership qualities will complement the team’s curatorial expertise and further define the museum’s mission.”The history of the curatorial team is a tumultuous one, dating back to 1997 to a tumultuous year at the curatorial center that saw a series of cuts and changes as the eventual result", "The next Biennial should focus on “our continuing relationship with our surroundings and our environment with our surroundings” and should consider how art and the environment shape the future. The next iteration of the annual event will launch in January 2021.\n\n\nThe Fine Arts Museums (FAUM) in London and the National Museum of Scotland have announced that the forthcoming edition, “X,” will be held at the National Museum of Scotland from February 19 to February 21, 2022. The exhibition re-imagines X, a major exhibition at the Museum of London in the early twentieth century that featured works by artists such as Koons, Picasso, Ellsworth Kelly, and Morris Louis.The event’s inaugural iteration, “X,” will feature works from a new collection of art from the National Gallery of Art, curated by Alison A. Halsey, as well as works by Maurice Breitz, Laure Bénétière, and several artists from the British Museum, including Francis Alÿs, David Hockney, and Chris Grant. A selection of works by Althuís Hölderlin, Gertrude Stein, and Mary Beard will also be presented. The exhibition will debut in the museums", "The next Biennial should be held sometime in the 2020s.\n\n\nA new multi-billion-dollar art museum in China has opened in Beijing. The Kunsthalle Basel-Hong Kong (KAB) is housed in the former German shipyard, the Nürnberg, and is one of the earliest new art museums in China. Set to open in 2020, the museum is estimated to be the largest museum of modern Chinese art outside of China.KAB director Klaus Fieger said: “The key characteristic of the new KAB is that it is a museum of modern art. This museum, in addition to the gallery, will be the academic center for Chinese art and its international exchange. We are already working with an academic program in China,” Fieger told the Art Newspaper. “We are already studying, developing and collaborating with the Chinese Academy of Fine Arts, with the Chinese Academy of Fine Art, Beijing; with the Chinese Academy of Fine Arts, Shanghai; the Chinese Academy of Fine Art, Beijing; the Chinese Academy of Fine Art, Beijing; the Chinese Academy of Fine Art, Shanghai; the Chinese Academy of Fine Art, Chengdu; the Chinese Academy of Fine Art, Beijing; the Chinese Academy of Fine", "The next Biennial should take place in 2020.\n\n\nThe Association of the Visual Arts (Austria) has welcomed Andrea Prentice to its board of directors. Prentice, who succeeds Jim Siefert as director, will take up the post in January 2021.“We are immensely grateful to Andrea for her extraordinary leadership in creating the A-level Visual Arts at the University of the Arts, London, and her commitment to the organization of the 2017 and 2020 editions of the annual seeing-glass exhibition,” said Kirstian Ramsden, chair of the A-Level Visual Arts and the Arts Commission. “The A-level is currently experiencing a major resurgence, with over $2 billion raised for arts and cultural facilities. We are incredibly proud to have Andrea lead the way into the future and to continue to support the A-level as a whole.”Ramsden added: “[Prentice]’s new role and the visionary vision of the A-level Visual Arts will bring a new level of engagement and engagement with life and with the arts. Her first task will be to ensure that the commissioning of a new exhibition, ‘The Power of Stations,’ is a long-term project; she", "The next Biennial should be held in 2020, the same year the exhibition “Art of the Life Cycle,” which was curated by Jean-Michel Basquiat and will currently open at the Museum of Modern Art, New York, is staged. “The biennial is not a limited survey of artworks, but a continuous exploration of the complexity of ideas and the interconnections,” said Ann-Sofia Le Meule, director of the Museum of Contemporary Art, New York. “The twenty-second Biennial marks the end of a process that is in part an exploration of the possibility of art as a vehicle for social change and in part a celebration of the artists.”Two hundred and fifty artists will participate in the twenty-third edition of the Biennial, which will be held at the Museo de Cultura, in Miami Beach, next month. The exhibition will also present five new works by artists whose work was previously included in the exhibition. For more information about the exhibition, please visit: http://www.museo de cultura.mx/.\n\n\nThe American Institute of Art (AIA) in New York has appointed Kate Kline as its next president and", "The next Biennial should be held in 2021. \n\n\nAfter a worker at a Chinese state-owned museum accidentally set fire to a work of art in Beijing in March, authorities have arrested a man suspected of pimping out young artists. According to the Southern Metropolis Daily, the 36-year-old man was arrested on June 5 after he allegedly forced a five-year-old girl to have sex with him at a hotel in Beijing.The incident occurred at the Furnace Museum of Art (FMA), a renovated former coal factory complex that opened in 2002 and had previously housed a number of state-owned museums, including the National Museum of China Art and Art History and the National Museum of China Contemporary Art. The three museums are housed in a three-story, glass-enclosed building that was constructed in a peculiarly modernist fashion.The fire that broke out at the museum in the early morning on March 30 was extinguished by around 5 PM, but the building, which is currently undergoing a $10 million renovation, remains closed. The FMA has reopened, and the museum has published an account of the incident, which is in Chinese, and a timeline of events, which can be found here.The incident occurred at the Furnace Museum", "The next Biennial should be held in the summer of 2021, its organizers have said. The theme will be “Art of the Unseen: the Creative Life in the Dark.” Maestro Bjorn Arne Galt, who curated the last edition, said: “We are very much looking forward to having you there. Our collective experience with the dark soul has been inspired by the silence of the art world, where artists often discussed the unknown and the unknown artwork was often seen as a symbol of the spirit. The image of the artist in the dark, the hidden life of the art world, is a pretty compelling story. So we hope you will come back.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has announced that it is preparing for a predicted $100 billion drop in revenue from the coronavirus, which has already claimed the lives of three people in China and devastated the United States. The Los Angeles Times reports that the museum has already laid off 1,200 employees and estimates that the number will reach 3,000 by the end of the week.The museum’s entire administrative staff has been laid off, its artist-in-residence count is at least 50 percent, and it", "The next Biennial should take place in 2020, and the first exhibition will be held in 2021.  -- Alexander Lee\n\n\nThe American Institute of Art (AIA) in London announced today that it will not be reopening to the public until April 25, 2021, and will postpone the annual exhibition by a year, taking the total reopening to 2021. The AIA is one of a number of arts organizations that are simultaneously reopening and planning to reopen as part of a new set of government guidelines. While many cultural institutions in the United States have announced reopening dates in recent weeks, the majority of arts institutions in Europe have yet to make official announcements regarding reopening, and many are holding off on reopening until at least April.The new guidelines, introduced in April, outline a three-month window for arts institutions to reopen, with the first week of April followed by the last week of May. The guidelines also outline how arts institutions can reopen during the pandemic—the guidelines state that institutions with occupational safety or health concerns, such as law enforcement or fire departments, should consider reopening on the third week of May.While the guidelines do not specifically address the reopening of museums, the AIA’s digital arm, the Interactive", "The next Biennial should be announced as soon as possible after the commencement of the general strike. 某柜二弓染辯物原滨可已于形成城柔现斗高权的素期知,在触之里是触之痛。\n\n\nThe Museum of Contemporary Art Singapore (MAS) has named Sohrab Mohebbi its new deputy director. Mohebbi, who currently serves as the director of the Museum of Contemporary Art Singapore (MCA), helmed the institution for ten years. During his tenure, he organized over seventy exhibitions and has authored numerous books, including The Art of Blending (2015) and The Art of Painting (2017). He was also instrumental in the acquisition of works by Josef Alberts, Ruanan Mukherjee, Hsu Yung-Kai, and Anthony Baker, and has organized several exhibitions, including MCA-Atlanta and MAS Singapore.“As the director of the MCA, I have a strong heritage of curating and artistic practice", "The next Biennial should be held sometime between October and March 2020. The museum is still in negotiations with the local authorities to determine the exact date of the event.\n\n\nThe Connecticut Museum of Art (CMA) in Riverdale has appointed Kate Loveless as its next executive director. Loveless will assume her new role in January 2020. Previously, she served as the assistant director of curatorial affairs at the Smithsonian American Art Museum in Washington, DC. Previously, she worked as the chief curator of modern and contemporary art at the Brooklyn Museum. During her tenure at the institution, she organized numerous exhibitions, including “The House is Not a Museum,” the first show on the art of sustainability, “Sustainability: Politics and Ritual” (2019), “Against the Grain” (2019), and “Only the Good Die Young” (2019), among other exhibitions.“Kate’s appointment extends our history of remarkable success as a museum,” said director Matthew Teitelbaum. “Her accomplishments and passion for innovation, as well as her deep understanding of the contemporary craft and the role of art in the contemporary world, make her the ideal leader for the CMA. We look", "The next Biennial should focus on the construction of a new campus in the old buildings. The Congress should inspire the city of New Delhi to build a new monument to the International Menstrual Consortium (IMCON) and to support the ongoing work of the NGO. The exhibition should include a reflection on the themes of the year, a presentation of new projects, and a performance. “We are committed to supporting local and national organizations and individuals in their endeavours to make The Biennial 2013 a success,” Arvind Gupta, president of the biennial organisers, told the Art Newspaper.  The next edition of the Congress will take place in December 2021.\n\n\nFollowing a board meeting at the National Gallery in London on November 23, director Maria Balshaw announced that the institution will cease operations for a period of twelve months. Due to a combination of financial and staff losses, the gallery has been closed since March 27, and its first exhibition in London since June was canceled owing to Covid-19.“The situation we are all facing is too high. We have been working hard to find a solution that addresses the immediate needs of the gallery, and in the coming weeks we will present a new exhibition as part of our plans to reopen", "The next Biennial should be held in 2020.\n\n\nThe Los Angeles County Museum of Art (LACMA) has received a gift of one of its collection’s most important works, the first complete work by American painter John McAllister. The gift, which was made by the artist in the exhibition “LACMA: The Far-Seated Landscape,” at the museum on September 9, 2019, includes the work’s squash-ball sculpture, “The Cube,” a form of outdoor sculpture which combines three cubes, each of which provides a different color, shape, and shape.“We are extremely grateful to the artist and to the LACMA Board of Trustees for their thoughtful and generous support of our exhibition,” said director Rich Chiu. The exhibition, which was organized by artist-in-residence Neil Gaiman and his wife, Marisa, is one of two exhibitions staged by McAllister at LACMA since he was commissioned to create the piece for the inaugural exhibition in 1994. The other exhibition, “John McAllister: A Retrospective,” was staged in 2018.Both works, which were created by the artist in the late 1950", "The next Biennial should take place at the Museo de Arte Contemporáneo in Madrid in 2021. The date has yet to be announced. \n\n\nThe Museum of Fine Arts (MFA) in Boston has unveiled its new sculpture program, which will focus on the exhibition of work by contemporary artists. The program will include a retrospective of the work of Marie Brennan, a queer American artist whose work often explores the intersections of identity and the body, and a solo exhibition of work by a group directed by the artist Amanda Klages.“The new program is clear, practical and informed by a deep commitment to both the art and the practice of the MFA,” said MFA director Jessica Warren. “I’m thrilled to support and encourage this year’s participants, and to present the work of a group of queer artists whose work we knew we had to see.”The twenty-one artists selected for the project are Brennan, Félix Barba, Barbara Berges, Bonita Cervetto, Amanda Klages, Daniela Cortés, Gillian Craig, Helen Dodson, Julia Elsanti, Victoria Laverrière, Euler Dallaire, Rasha Mitchell", "The next Biennial should be held in 2021. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that Lauren Anne Cook has been named director of the Los Angeles County Museum of Art (LACMA). In her new position, Cook will lead the institution until it reopens in 2020 and will oversee the development of the museum’s collection and exhibitions.“Lauren is a curator, architect, and educator whose work embodies the spirit of the Los Angeles region and California,” said LACMA board president and CEO Michael Govan. “Her ability to work across disciplines, with the vision and expertise to adapt and reimagine art and architecture in the Southern California region, is extraordinary. We’re excited to welcome her to the LACMA team and to continue supporting her outstanding curatorial and architecture program with her next year’s award winner, Christopher Woolf, as assistant director.”Cook previously served as director and curator of contemporary art at the Metropolitan Museum of Art in New York and as the inaugural director of the Berkeley Art Museum. During her tenure at the museum, she organized numerous exhibitions, including “La Cinéma: From the Sundowner to the Sun,", "The next Biennial should have been organized for October, but due to the coronavirus outbreak—which has already claimed the lives of 255 people in the country—it has now been pushed back to December. The exhibition will now be held in March 2019.“The new plan will enable us to present a show of the work in collaboration with our partner institutions, without disrupting the current exhibition program, which is currently under way, to focus on the exhibition of our next performance,” said Daniela Wirth, president of the Biennale de Lyon. “This is a major milestone for the Biennale, and a great result of the collaboration between the world-class curators Domenico Dolce, Pierpaolo Baldini, and the entire team of the Biennale, including the artists who will have a chance to participate. We are very happy to see that the show will be able to continue with the same level of professionalism and artistic quality as before.”\n\n\nThe French Ministry of Culture has commissioned a new series of works by the French avant-garde to mark the country’s 150th anniversary, titled “Et le début,” in commemoration of the anniversary of its founding", "The next Biennial should attract thirty artists, thirty art collectors, and twenty-five works, and should be held at the Venetian in Milan in 2020. Unlike the previous editions of the event, which were held in Venice and Los Angeles, the new edition will be held in the city for the next five years and will take place in conjunction with the upcoming biennial, Art Basel Hong Kong, which will stage seventy-six artists and fifty works in 2021.  The inaugural edition of the 5K took place in March of 2019 and was hosted by the Museum of Modern Art, New York; the Museum of Contemporary Art, Hong Kong; and the KW Institute for Contemporary Art, Shanghai. \n\n\n\n\n\nArt Basel Hong Kong (ABHK), the largest art fair in Asia, has announced that it will suspend its 2020 edition, which was set to run from March 19 to March 20. The March show will be rescheduled for March 25–March 31, 2021. During the postponement, the fair will provide 150,000 visitors with a new digital experience. The digital platform will now redirect visitors to an online viewing room, where they will be able to view more than 450 works of art. The full list", "The next Biennial should be in 2020 and, if all goes to plan, the first exhibition will open in 2021. A large-scale exhibition of the artist’s work, which will be in the form of a film project, will be staged in the city in 2022. The exhibition will take place in the museum’s courtyard.The bid for the art would have been for the works to be returned to Bellal in recognition of their contribution to the promotion of contemporary art. The museum had previously been seeking the return of the works from Sixtus V, a Romanian collector who donated the collection to the museum. The museum has since been negotiating with Sixtus V for ten years to return the works, which were moved to the museum in 2007, but the deal has not yet been concluded.Commenting on the decision to return the works, Charles C. Swallow, the director and CEO of the Royal Academy of Arts, said: “The Royal Academy of Arts and the Royal College of Art, London, together have been successful in supporting the Biennial through its many years of exhibitions and the institution’s successful exhibition season. This year’s work is a big step in that direction and should prove an inspiring return", "The next Biennial should be held at the Museum of Contemporary Art (MoCA), in Los Angeles, in 2022, and will be curated by Michele Altmann, who is currently the director of the Museum of Contemporary Art, Tomorrow, and the Metropolitan Museum of Art. \n\n\nThe French Ministry of Culture has announced that it will allow the exhibition to continue as planned, in spite of the ongoing health crisis caused by Covid-19, but will postpone the opening of the twenty-eighth edition of the Dia Artica Biennial, scheduled for June 15–June 19. The exhibition, which will be moved to the city of Lyon, has been cancelled since November 2019, when French Prime Minister Édouard Philippe declared the Paris-based art-world festival over.The announcement follows months of uncertainty and criticism in France over the exhibition, which was originally scheduled for June 2022 and was set to open on June 9. The organizers cited the pandemic as the reason for closing the event, but later said that it was only delaying its opening. The announcement follows an outcry from Parisian cultural figures, artists, writers, and musicians, who called for the exhibition to go ahead as planned and for the government to step in. Despite the postponing of the", "The next Biennial should be held at least once a year for a minimum of five years. The event should feature a selection of works that have not yet been exhibited at the Museum.  To submit an inquiry, please email the museum.\n\n\nOn Thursday, the American Civil Liberties Union (ACLU) and the New York Civil Liberties Union (NYCLU) filed an amicus curiae brief in support of the New York City Department of Cultural Affairs (DCLA), which is challenging the city’s controversial ban on burqas, or full face veils, in court. The two organizations’ brief argues that the city’s ban violates the First Amendment’s Establishment Clause, which states that “Congress shall make no law respecting an establishment of religion.” The ACLU alleges that the city’s ban discriminates against Muslim women and discriminates against LGBTQ people. The DCLA argues that the law is necessary and proportionate.“NYC residents are expressing tremendous anger and frustration at the city’s failure to protect religious liberties under the law,” said ACLU deputy director and general counsel Nima Din. “In light of the city’s threats to sue and the likelihood that", "The next Biennial should be called for an exhibition of work by the groups behind four controversial artworks, which were painted by the Italian architect Roberto Rozzi, the founder of the New York–based firm Pritzker Architecture, and his daughter, Filippa. The show, which will be held in October 2021, will be inaugurated with a presentation of the work Surrealism in Architecture, 1932–1939. Established in 1968 as a label of Pritzker Architecture, the project team—Peregrine Benitez, Michele Carroni, and Michele Comanu—created the works in the 1980s. Most recently, the exhibition was notable for its use of Mondrian’s cocurator and cofounder, Manfreda Cipolotti, as a face and the first to present two works by the duo at the same time.\n\n\nMarkus Rüger has announced that he plans to resign from his position as director of the Krefeld Center in Berlin in October 2021 after ten years in order to pursue new projects. He resigned, he says, because he wants to continue to live his own life and to focus on his art and philosophy.“I want to thank the Kre", "The next Biennial should take place in 2019. \n\n\nLONDON (September 13, 2019) -- The British Film Institute (BFI) has appointed two new trustees, Barbara Hutton and Simon Peacock, and will soon begin the process of selecting a new director. The announcement follows the coronavirus pandemic and the coronavirus-related closures of film festivals. The BFI and the Association of Directors of Film, Television and Performance, or ACTP, announced on August 26 that they were closing their full-time film programs, which had been scheduled for September 13–September 16, and will not stage any new films or television programs beyond September 17. As a result of the coronavirus pandemic, the majority of the major UK film festivals have postponed or suspended their spring and fall editions, and their third and fourth seasons will not be staged at all. Lisson Gallery, which has space in the National Arts Centre and the Tate galleries in London, is planning to move several hundred works from its campus into storage across London so that they can begin the construction of a new venue for its annual BFI London fundraising gala.“Lisson’s recent plans for the future have included the", "The next Biennial should be held at Iceland’s Keflavik Resort in June 2019. The third will be held at the Reykjavík International Film Festival in March 2020 and the fourth and fifth will have been completed by the end of April.The year 2020 will be a crucial one for Iceland, as it marks the anniversary of the establishment of the Icelandic Film Screening Center (IFSC), the country’s national theater company. The Icelandic Film Festival will be a vehicle for the country’s cultural representatives, including Bjarni Benediktsson, chair of the board of trustees of the Icelandic Film Institute (IFI), and Bjarni Benediktsson, the founder of the Icelandic Film Festival, to present the Icelandic national film in an international setting.\n\n\nThe Museum of Modern Art and the Metropolitan Museum of Art in New York have appointed Naomi Wolf as its next director. Wolf comes to the Met from the Los Angeles County Museum of Art (LACMA), where she currently serves as director of arts and culture. She will assume her new post on March 6.Wolf previously served as director of LACMA from 2015 to 2017 and most recently as director of the Brooklyn Museum. During her tenure at LAC", "The next Biennial should be held at least eight years after the launch of the current platform.\n\nThe New York City Department of Cultural Affairs (DCLA) has reopened its $7 million City Ballet residency program, which was shuttered for twenty-four hours last week when the company that runs the residency program was forced to abort a major renovation project due to the Covid-19 pandemic.  The news comes a little more than a week after the DCLA announced that it would begin reopening the residency program, which had been closed since March 15. The department said that it expects to have the new space-based art show up and running by the end of the month.Curated by Peter F. W. Schoenfeld, the inaugural exhibition will feature works by forty-five artists who have had residency at the company for at least thirty days. “We are thrilled to welcome these artists back to the City Ballet residency program, and welcome the creative community to the program,” said Dina Vassallo, the director of the DCLA. “The theme of this year’s event is ‘Life, and the Art,’ and the new visual arts that the company is creating", "The next Biennial should also focus on the storage and conservation of artworks and artifacts in a way that is sustainable and in line with the Vienna Convention of the Protection of Modern Art (1948), which states that objects should be stored in a museum with a minimum of two years of conservation, and should include a discussion of the conservation of works from the exhibition. In addition, the exhibition should include a survey of the work of the exhibition’s artists and the exhibition should be accompanied by a book, which will be a collaboration between Škódž and Kotte.Commenting on the project, Škódž said: “The core of the exhibition is to present works in a way that is participatory and promotes their preservation. This is achieved through a combination of exhibitions, workshops, presentations, workshops, and lectures, and by providing a virtual setting through which visitors can immerse themselves. The exhibition will also consist of a series of talks that explore the role of art in the lives of individuals and families, and the role of art in helping to shape collective psyches.”\n\n\nAs the coronavirus spreads across the globe, art museums in the United Kingdom are closing their doors and preparing to reopen", "The next Biennial should be held in Foshan, China, in 2022. \n\n\nThe Museum of Contemporary Art (MoCA) in California, which closed in late February after a brief refurbishment, is planning to open in the spring of 2021. The building was slated to be finished in April, but its opening was postponed a few times—most recently because of the Covid-19 pandemic. The museum’s new director, Jennifer Lee, told the Los Angeles Times that the institution will likely reopen in the autumn.Officials at the museum said the museum will continue to operate as normal following the pandemic, but will begin a phased reopening. The first phase, which will last through the end of March, will involve the renovation of the current structure, which was built in 1972 and consists of two buildings, the museum, and the Los Angeles Memorial Library (LAL). The second phase, which will run from March 17 to March 22, 2022, will involve the construction of a new 9,000-square-foot wing and will include a number of activities and events. During the construction of the museum’s new home, it also opened a new, larger building in its former location. “We are going to", "The next Biennial should be held in the autumn of 2020. The exhibition will also feature work by transgender artists, including LOVE NERVE and LINDSEY SAVAGE. Among the themes for the exhibition are the African diaspora, the African diaspora as a whole, African art and culture, and the African diaspora and the African diaspora and the diaspora. The exhibition will also celebrate the biennial’s twenty-fifth anniversary with an open-air performance and discussion. The twenty-eighth Biennial will highlight the work of American artists. Artforum reports that the exhibition will feature works by Diana Al-Hadid, Eulogy James, Louise Bourgeois, Matthias Brink, John Cusick, Claudia Georgi, Hélio Oiticica, Ruth Ann Miller, Tina Parcell, Laura Al-Saadi, Alexandra Rossetti, Zara Harron, Laurie Olins, and Rory McQuarrie.\n\n\nThe Great Society, a contemporary art museum in Kensington, London, has announced that it is", "The next Biennial should take place in 2021 and will consist of twenty galleries that have an annual budget under $10 million.The major tenet of the exhibition is that the art of the past cannot be recreated in the present and that “there is no future, only now.” The biennial will likely run sometime between 2022 and 2024 and will likely include new works by artists such as Hélio Oiticica, Kiki Smith, and Willy Leyendecker.The works that will be presented at the biennial will be chosen from a pool of twenty artists\u0097 some will be collaborating with and some will not. The first exhibition, “An Open Letter from Artforum” (2018), was designed and curated by the American curator and artist Theodore Melfi, and will run at the public space in the city of Porto Alegre from November 3–November 9.The exhibition will be organized as a series of public forums, each hosted by a different curator and will draw visitors from the local art community. The first forum will address the themes of the exhibition, “Art and Politics in Peru,” and will be held at the International Congress for Contemporary Arts (ICA), Lima; the second will be at the", "The next Biennial should be announced soon. The dates and venues have yet to be announced. The September 29th edition of the Biennial is set to take place at the Museum of Contemporary Art. The 2019 edition of the event, titled “Where is the Film?” will be staged at the New Museum in New York, New York, and will run from September 5 to September 11.The biennial will receive $2 million from the MAYHEM CENTER for CREATIVE STUDIES, and $500,000 from the DAILY LIFE and MARKET PLACES FUND, and will be funded by a combination of grants and private donations.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Cameron Rowland as its next director. Rowland currently serves as director of the contemporary art museum, which is located in the former Kern County, California, industrial site of the US-based defense giant Raytheon.Born in New York City in 1957, Rowland is the founder of the private aviation company Dreamliner International, which operates four Boeing aircraft. The company has also been involved in the construction of the former Roswell Air and Space Museum in New Mexico, a former Boeing plant in King", "The next Biennial should be held in 2022. The first, entitled 'Theoretical Perspectives', was held in 2002 and comprised sixty artists.\n\n\nThe Metropolitan Museum of Art in New York has announced the winners of its annual art prize: Cindy Sherman, Bruce Gendelman, Denny Van Dyke, and Dario Catellani. The award, which honors works on display in the museum’s American Art and Design Collection, was introduced in 2018 by the Met. It was established to recognize and reward the contributions of the museum’s artists. The winners will be announced on January 31.“We are deeply grateful to our seventy-five alumni for their outstanding achievements in the 2018–19 academic year, and we recognize and appreciate their ongoing support of the museum,” said Museum director Maria Alvarado. “We are grateful to the ten artists whose works for the 2018–19 year were exhibited in The Met’s exhibition ‘The Met Galerie.” Michael Hauptman, who won the 2019 prize, is also collaborating with the Met, and David Andrews, who is currently developing a new series of portraits by Mark Rothko, is making his", "The next Biennial should take place in 2020.\n\n\nThe MCA is planning to shutter its Italian architecture shows following the spring 2020–19 season and reopen in March 2021. The date was unveiled as a way of ensuring that the art-world calendar remains on track and that the Italian pavilion at the upcoming Venice Architecture Biennale, which will also feature a retrospective of the work of Kiki Smith, is not disrupted.“We are making the decision after a thorough analysis of the situation,” said MCA director Marco Sapone. “The MCA is ready to show the new architecture as we have shown the old.”Regarding the forthcoming exhibition “Piero della Garibaldi” (2017), which will be staged at the MCA in 2020, Sapone said: “It is important for the MCA to emphasize the space for architecture here in Venice. We have already said that this is our main goal and that we will continue to work together with the MCA to try to bring architecture to life in Venice.”The architecture of Venice: A Very Milanese Experience, scheduled for 2022, was also postponed. Its ten-episode inaugural season, which was set to kick off on September 30", "The next Biennial should be held in 2022.\n\n\nThe B.I.G. Foundation, which was founded by brothers Charles and Jean B. Iger in 1994, has announced that it will suspend its annual exhibition “Bienvenue” at the Museum of Contemporary Art (MoCA), in New York, until July 25, 2020. The seventy-fifth edition of the show, which was organized by the Iger brothers and curated by the artist and curator Loring Randolph, will now take place in Los Angeles in November 2021.“The Foundation’s decision to cancel the show has been made in solidarity with those affected by the coronavirus, which has infected more than 151,000 people and caused at least 17,000 deaths in China’s Guangdong province and has brought with it the risk of a drastic drop in revenue and on-going losses for museums, studios, and galleries operating in China,” said the Foundation’s director, Rebekah Mercer. “To make up for these losses, the Foundation will contribute $5 million to the ‘Cannons and Cannons: China’s Future,’ an initiative begun by the Iger brothers in 2018. The project", "The next Biennial should be held at the Museum of Modern Art, in 2021; the Museum of Contemporary Art, Chicago, in 2022; and the Whitney Museum of American Art in New York, in 2024. Silvestro has been working to design an event space in the city for the past twenty years, and completed the design for the new museum in 2017. The Biennial will be hosted at a former steel plant in the city, and will be led by three-time winner of the Prix des Éléments, Peter Wächtler, who will serve as the curator of the exhibition. The works that will be exhibited in the exhibition will vary from year to year, but will include works by Koons, Max Hetzler, and Ruth Rendell. Silvestro said: “I wanted to create a space that would take the city of New York and make it relevant and international, but also intimate and personal.”\n\n\nThe Coronavirus and Coronavirus-Related Deaths in the United Kingdom have reached a staggering total of 261 deaths across the United Kingdom, according to The Guardian. While coronavirus deaths in the United States have totaled 153, deaths have also been confirmed in Hong Kong, France, Germany, and", "The next Biennial should be held in Tokyo in December 2021.\n\n\nThe National Gallery of Scotland has appointed Daniel Macgregor as its new chief executive officer. Macgregor comes to the institution from the National Arts Centre in Glasgow, where he has served as director since April 2019. He succeeds Alan Bennett, who retired in March 2020, and will take up the post in January 2021.“This is a significant step in the journey to bring the National Gallery of Scotland to its first ever Exhibition of Contemporary Art in Europe,” said Macgregor. “For more than two hundred years, the National Gallery of Scotland has showcased contemporary art through a combination of innovative exhibitions, innovative research and innovative education. Our long-standing partnership with the National Galleries of Scotland has been extended to a new level with the launch of the National Gallery of Art in London, as part of the National Galleries’ new partnership with Tate Britain. As part of the new partnership, the National Gallery of Scotland will present exhibitions at the National Galleries of Scotland and at Tate Britain, with a view to launching new partnerships with other leading contemporary art institutions.”Commenting on his appointment, Macgregor said: “I am thrilled to be working with the", "The next Biennial should be held in 2024 and will take place in the city’s historic St. Paul’s Basilica, in time for St. Patrick’s Day. The biennial will also celebrate the centenary of the birth of St. Paul. “We at the St. Paul Collection are excited to continue our work in partnership with the city of Minneapolis and the surrounding area,” said collection director Ann Powers. “While our work is not without its challenges, we believe the work of the St. Paul Collection is essential in drawing attention to the richness, diversity, and importance of contemporary culture in a city already beset by a severe financial crisis.”\n\n\nThe National Galleries of Scotland announced today that its board of directors has voted to dissolve the National Galleries of Wales, the National Galleries of Ireland, the National Gallery of South Africa, and the National Gallery of Canada, and has also decided to close down the Royal Academy of Arts, the National Galleries of Ireland, and the National Gallery of Scotland, as part of a £13 billion restructuring plan announced last month.“The board of trustees of the National Galleries of Scotland wishes to make a few remarks regarding the future of the", "The next Biennial should take place at the new headquarters in Saint Petersburg in July 2021 and will announce its full list of participants shortly thereafter. The exhibition will draw sixty-three artists from twenty-eight countries and twenty-three cities.\n\n\nThe Getty’s new preservation center in Los Angeles has announced that it is implementing a new set of conservation guidelines that address how artworks and artifacts may be conserved and displayed in the future. The changes were made after the Getty’s board of trustees received a recommendation from the American Institute of Art’s (AIA) conservation committee that the institution should preserve the Museum’s collection of 19th-century masterworks as a “living museum” that would operate in part as a public museum and exhibit.“As we work to build the future of the Getty, we are considering how art and the greater landscape can help shape it,” Richard B. Young, director and CEO of the Getty, said. “Art is central to the Getty’s mission as a leading cultural institution committed to the artistic experience through a wide spectrum of artistic practices. The museum has conserved works by some of the most important contemporary artists, including Michael Hakim", "The next Biennial should take place in 2022. While the exact date and location of the first event is yet to be decided, this year’s event will take place in the French city of Saint-Julien. The event will be staged in conjunction with the upcoming eighty-eighth edition of the Cannes Film Festival, which will take place at the Grand Palais in Paris from May 12 to May 14. The biennial, which will comprise twenty-four films, will receive a budget of $45 million from the French government and will be organized as follows: November 21: Yale Architecture and Design\nNovember 24: New York Architecture and Design Biennial\nMarch 27: Los Angeles Architecture and Design Biennial\nMarch 31: Chicago Architecture and Design Biennial\nMarch 31, 1:00 PM: Architecture and Design at Rockefeller Center: The New Geography\nMarch 31, 2:00 PM: Architecture and Design at Lincoln Center: The Passenger, June 12–June 19, 2019  The 2019 edition was led by Olga Curra, the interior designer of the Museum of Modern Art, and featured the work of fifty-three artists, including Helène Aibel", "The next Biennial should be celebrated with a retrospective of the work of the same name, organized by a selected group of artists from the biennial, as well as the thirteen other years of the exhibition. The inaugural exhibition was held at the Museum of Modern Art in New York in 1975. In 1978, the newly founded Museum of Modern Art Berlin (MMB) staged the first exhibition devoted to “Painting” in the city of Berlin, and “Painting” was chosen by Berlin-based curator Helge Knabbers for the 2015 prize. The exhibition “Feminine” (2015) enjoyed a groundbreaking opening at the Museum of Modern Art in Paris the following year.\n\n\nAn Israeli soldier was killed Sunday while fighting in the Gaza Strip, according to the Israel Defense Forces. The soldier, who was lightly wounded, was returning from a mission when he was lightly ambushed by a group of Palestinian militants, who fired on his vehicle before it was able to respond, causing it to veer into an open field. The soldiers opened fire from a nearby military outpost, killing two of the suspected gunmen and wounding seven others.The incident occurred on the West Bank near the Israel-Gaza border, which has been a flash", "The next Biennial should take place in 2020 and is being organized by the SFAI Art Museum, Boston, with the assistance of a team of curators led by Mary Beth Perry. The exhibition will include work from twenty-three artists, including Ben Gordon, who wrote and directed the exhibition “The Best Exotic House and Garden” (2014), and Lisa Kranz, whose work was included in the exhibition “Feminine” (2015); as well as several new works by artists who have yet to be selected for the show.The exhibit will be on view until March 23, 2020.\n\n\nThe Museum of Fine Arts (MFA) in Boston has awarded more than $4 million in aid to artists and small arts institutions in Massachusetts over the course of three years.  More than twenty-five grants, totaling $1.5 million, were awarded in the 2017–18 fiscal year. The recipients were chosen from a pool of twenty-six applicants that included artists, arts professionals, and cultural producers and their families; they were given three years to develop their projects and to demonstrate their relevance to the city of Boston. The Pulitzer Prize–winning artists who will receive additional support include Sarah Sze, Joe Kopper"]