["The next Biennial should be held at the site of the former Ministry of Education and Culture, which is slated to be completed in 2022. After the renovation, the museum will be able to hold over twenty-five thousand visitors. The new Ministry of Culture will focus on strengthening the museum’s collection of Korean art, and the museum’s exhibition space will be redesigned to better accommodate the collection and exhibition of contemporary art.According to the Seoul Metropolitan Government, the exhibition space will receive new facilities in the next eighteen months. Inaugurating the building of the ministry will be an exhibition, “Between the People” (2016), a “chapters” exhibition of work and art that explores Korean, Chinese, and Japanese art histories. The biennial will also include a new collection of Korean cinema, a new collection of Korean works by artists that are the subject of a retrospective, “Skylight” (2019), and “The Sixteenth Day of the Tiger's Life” (2019).\n\n\nThe Royal Academy of Arts (RA) in London announced today the fifty-one artists who will participate in a new Royal Academy of Arts (RA) Festival for Visual Artists, organized by the Royal Academy of Arts (", "The next Biennial should be held in the fall of 2021, and will feature the work of twenty-six artists, including Sadao Ando, Roger Ailes, and Emma Lazarus, to be curated by Isabel Zwicky. The biennial will be hosted at the Museo de Arte Contemporáneo, in Madrid, and will run for twelve months.The biennial’s inaugural edition, “Aspen: A Biennial of Humanistic Art” (2019–20), was organized by the Art Institute of Chicago and the Institute of Contemporary Art in the Arts. The exhibition, which featured work by eighty artists throughout the United States, including Adrienne Edwards, Berenice Abbott, William Dieterich, and William Eggleston, and was held at the Museum of Contemporary Art in Los Angeles and at the Phoenix Art Museum.The twentieth edition of the inaugural exhibition, “Cultural Memory: Art and the Past in Contemporary Art” (2019–20), was organized by the Los Angeles Art Museum and the Museum of Modern Art. The show will be held at the California Institute of Technology, Pasadena; the Pasadena Museum of Art; and the San Diego Museum of Art.\n\n\nThe", "The next Biennial should be in September 2021.  The next Art Museum Openings should be in June 2022.  The next British Film Festival should be in March 2022.  The next Southwark Biennial should be in March 2022. \n\n\nThe widow of an American student who was kidnapped by an Al Qaeda-linked group in Nigeria and held captive for almost three years before his rescue in March 2019 was awarded a $25 million pay-off in a settlement agreement announced on Thursday.The forty-second amendment to the ten-year contract between the US Department of State and the Abuja-based nonprofit Artadis, which requires the US government to pay approximately $50 million of the $75 million total, was approved by a federal judge in New York on Thursday and takes effect immediately. The move leaves the widow of Kevin Durant, the twenty-six-year-old American student kidnapped in Abuja on February 2, 2014, without a monetary payment from the federal government.The family of Zachary Harrison, who was abducted by two separate groups, as well as by Abu Sayyaf militants in the same city in March 2014, were awarded the $25 million sum on June 3.“This settlement sends a strong", "The next Biennial should mark the anniversary of the founding of the Institute for Contemporary Art in London, which is a descendant of the British Museum. The portal will host a selection of biennial projects and exhibitions, including a presentation of work by French artist Etienne Léger in the exhibition “Maurice Hamilton: The Art of Place” and a retrospective of work by American artist and writer Miranda July in the exhibition “Standard Artists” .The third Biennial will be commemorated with the retrospective “Rainer Spezial,” which will be staged in the museum’s courtyard in 2021. The first Biennial, “Rainer Spezial: Creation of a Biennial,” was held in 2002, and the second, “Rainer Spezial: The Art of Life” was held in 2005.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York announced today that it is scrapping a program that would have given New York City’s arts and cultural producers a $1 million cash prize each year to help them transition to renewable energy. Instead, the institution will donate $750,000 to “The Met,” the New York City–", "The next Biennial should focus on the history of art, and the next should focus on the history of ideas, and the next, I think, will be more of an intellectual exercise.”In the meantime, the museum will hold the first exhibition dedicated to the work of artist Virginia Woolf in the United Kingdom, and it has announced that it will reopen in 2020 with a retrospective of the artist’s work, Virginia Woolf: A Life, which will run alongside the artist’s own retrospective, Virginia Woolf, at London’s Tate Britain from April 15 to April 22. The museum will also open a new 120,000-square-foot exhibition space in the museum on March 31.\n\n\nThe New York State Court of Appeals has ordered the Metropolitan Museum of Art (the Museum) in New York to reopen as soon as possible after it closed for a month due to the Covid-19 pandemic. In a ruling published on Thursday, the court found that the institution failed to implement emergency plans to mitigate exposure to the virus, and held the museum accountable for violating the New York State Human Rights Law by not providing direct medical care to patients, which patients were ultimately transported to hospitals for treatment. The court found", "The next Biennial should open in 2022. \n\n\nThe Aberystwyth Art Museum (A.M.M.) in Wales announced today that it is planning to extend its contract with the private company Licence Creative Systems (LCS), which runs the video game and publishing industry in the United Kingdom, by three years. The extension of the contract, announced last Monday, will see the institution enter into a new partnership with the company designed to create jobs in the art and design sectors in the UK.According to the A.M.M., the new partnership will create a new position for cultural professionals in the museum, which will also share the revenues from the sale of works in its collection. The partnership will allow A.M.M. to “re-imagine the future for the museum,” the institution said. \n\n\nThe Israeli daily newspaper Haaretz has announced that Haim Saban has been appointed as its new chief executive and director. The appointment marks an important milestone for the embattled publisher, who has been accused of supporting the Boycott Divestment Sanctions (BDS) movement, which aims to deter Israeli settlement construction and pressure Israel to alter its policy in the West Bank. Saban is the second person", "The next Biennial should take place in 2020 and will be hosted at the Smithsonian American Art Museum (SAAM) in Washington, DC.\n\n\nThe Los Angeles County Museum of Art (LACMA) has revealed that it is moving forward with plans to open a new affiliate museum in the city in 2020. The institution, which was slated to open in the fall of 2020, was forced to cancel the event after it was revealed that the museum would only be able to house approximately two hundred visitors at a time.Museum director Miguel Ferrer told the Los Angeles Times that the center will remain closed until at least June 30, with visitors able to continue exploring the museum while the museum is closed. The museum has offered visitors a month-round, seven-day entrance fee of $75 in the past.The institution was also forced to move the opening of the new museum from early May to early June, following protests from area residents and businesses. Though the museum has promised a few days of free admission next spring, the exact date and location have yet to be determined.In a statement issued by LACMA on Thursday, Ferrer said: “LACMA is currently set to reopen at the earliest possible date, with a full and robust program of exhibitions", "The next Biennial should be held in 2021.\n\n\n'The Artist: Your Guide to the Art of Paul Gauguin' is now available on DVD. Be sure to say hi to Paul Gauguin at the Library of Congress as we launch a new digital initiative that will showcase his art in a new way.In the new edition of the tool, Paul Gauguin will provide a curated selection of artist interviews, visual essays, and historical works to guide you through the biennial’s exploration of the role of artists in contemporary society. Interviews and essays will be presented by artists such as Robert Irwin, Yoko Ono, and David Salle. We hope you will join us for the first public exhibition of the new series. The show will be on view in the Library of Congress from February 14 to February 20, 2020.“The Artist: Your Guide to the Art of Paul Gauguin is a new way for us to connect with the work of Paul Gauguin and to celebrate his legacy,” said Don Danziger, chair of the Biennial Board and president of the Gallery of Modern Art. “We’re excited to present it at the Library of Congress and to launch the biennial. The", "The next Biennial should take place in the year 2024 and will be held in the city of København, the Norwegian capital, and will include the award of the Nobel Prize to the artist Anna-Magdalena Beckmann. The documentary, which will be based on the artist’s experience documenting the Holocaust in the form of paintings, dolls, and other works, as well as interviews with the artists involved, will be held in the artist’s studio in the city of Reykjavík.The Biennial’s Benjamin Franklin Prize, which will be awarded in a ceremony at the museum on September 23, is currently being organized by the København-based organization Værnskáldskaparmák, which is comprised of twenty-five institutions. The organization announced its selection of the winners of the inaugural prize, which honors those who have made a significant contribution to the promotion and preservation of contemporary art.The twenty-four winners from the selection process, which began in February 2019, are:Ana-Maria Bocci, Florence (Italy)Based in the artist’s studio in the city of Florence, Italy; Perrieri Gallery in Milan (Italy)", "The next Biennial should be held in Tokyo in the spring of 2019. The exhibition will be led by Haruka Oka, director of SFMO, and will be funded by the Tokyo Metropolitan Government and the Tokyo Metropolitan Institute of Art.“We are very excited to share our vision of the future with the city of Tokyo, the region and the entire world,” said Yoshihisa Kato, president of SFMO. “It will be an exhilarating and meaningful experience for our guests. . . . We hope that the Tokyo Metropolitan Museum of Art will become an important and successful museum of contemporary art.”The inaugural exhibition, “Tokyo 2020: The Future Is Now,” will focus on the impact artworks and architecture has on people and will feature works by a wide range of contemporary artists. The exhibition will close on December 7 with the exhibition “Tokyo 2020: Art and Architecture and People.”\n\n\nThe New York City Department of Cultural Affairs (DCLA) has finalized its long-awaited $10 billion cultural redevelopment plan for the city’s eight boroughs, which will boost the city’s arts and culture economy and create millions of square feet of office space and housing for the city", "The next Biennial should focus on “Rethinking Beauty: The American Body,” which will draw from a selection of twenty-eight objects from the collection. Committed to the artist’s body, the exhibition will include pieces from a number of categories, including the body and dance, the body and literature, and the body and photography, as well as sculptures, video installations, exhibitions, readings, readings, readings, readings, and more readings. The 2020 exhibition will take place at the Museum of Contemporary Art Chicago. \n\n\nThe British artist David Hockney, whose work incorporates photographs, paintings, drawings, and installations that challenge conventions about what counts as art and how art can be judged, has died at age eighty-two. He was born in London and studied at the Royal College of Art, the National Gallery, and the Institute of Contemporary Art. His art has been exhibited at the Museum of Modern Art, the Biennial of Britain, the Tate, the Leeds Biennial, the Musée d’Art Moderne, the Metropolitan Museum of Art, the Serpentine Gallery, and the Tate.Hockney’s work can be found in the collections of the Tate, the National Galleries of Scotland,", "The next Biennial should be cancelled, as the organizers argue that the exhibition has already been cancelled due to a mysterious health crisis, reports the Art Newspaper. The show’s organizers have been forced to backpedal on the timing of the exhibition, which was originally scheduled to run from March 21 to March 25. The show was originally supposed to kick off on March 12, but was pushed back a day as it worked through its final day of programming. The exhibition will now be held from March 13 to March 13, 2020. The 2019 show was a retrospective of work by Jamal Jabouri, whose work was featured in the biennial’s inaugural edition in January. The exhibition will also feature works by a select group of foreign artists who are currently represented in the United States, including Miyan Mehdi, Shani Nur Masudi, and Yinka Shonibare. The 2020 show will be curated by Mohammad Saeed, who served as chief curator of the Dhaka Art Summit in February. The biennial is part of the Dhaka Art Summit Initiative, a $10,000 grant program launched by the Dhaka Art Summit, the Dhaka Art Foundation, and the Dhaka Art Students Association", "The next Biennial should focus on the role of culture in developing and preserving the archive, and on how the collection can be reconceived as a vehicle for the collection’s histories and a tool for the study of the collections of other museums. The Biennial of the New South should aim to bring together artists and thinkers from South Asia, the Americas, and the Far East to reflect on the future of the collection, and to engage with the collection’s collection of the ancient city of Gaugamela in rural South India. The 2018 Biennial of the Contemporary Art in India was organized by the Global South Institute (GSI), Hyderabad; the theme of the exhibition was “We Are Change,” a statement by Elizabeth Ayrton, who died in 2014.The exhibition was curated by Satish Chandra, the director of the National Gallery of Fine Arts in Washington DC, and included work by seventy-three artists from twenty-four countries. The exhibition was hosted by the South Asian Art Gallery in Mumbai, and curated by the New South Museum in Singapore.  In a statement, the National Gallery of Fine Arts said: “The National Museum is delighted to be hosting the upcoming exhibition, ‘The Past Is Now:", "The next Biennial should be held at least twelve months after the invitation-only event, which will be held at the Museum of Contemporary Art, Miami Beach, in 2021. \n\n\nThe Metropolitan Museum of Art in New York is planning to release five new works that depict the lives of Black and Indigenous artists. The works, titled Black Art and the Black Lives Matter Movement, Black Emotions: The Emotions of Black Art, and Black Embodiments, will debut at the Met at the end of June.While the stories of the artists in these works are often centered around Black female artists, the first three are more contemporary, reflecting the Black Lives Matter movement. The fourth, Emotionseal: A Black Woman Painting, features Maria Otero’s sculpture Desertion, a mesh of wicker, wood, and earth, and was created as a commemoration of the seventy-three Black women who were executed in the state of Georgia for non-violent crimes between 1976 and 2012. The Met also revealed that the exhibition “will include an exploration of how Black art and culture has historically embraced the struggle for Black liberation.”A projection of Pope John XXIII and the Black Lives", "The next Biennial should be held in 2020. “There is much to be learned from this experience,” said Director Patricia Astor.    The exhibition’s next edition, “SISSY” will be held in the United Kingdom in 2022. \n\n\nThe Bessies, an annual tribute to Britain’s most celebrated female composers, has announced that it will expand its program to include a new biannual prize—designated by the Queen—for women artists. Set to open in the fall of 2020, the biannual prize will be awarded to artists whose work will be included in the biennial’s catalogue in the coming years. The biennial will be hosted in partnership with Tate Britain.\u0097The biannual prizes were established in 1991. They are given annually to a woman artist and are selected by a jury\u0097one female and one male artist\u0097from a pool of nominees. The winners are announced by the artist and are announced by the biennial's newly appointed director, Clare Balding. The biennial will be hosted at the Bessies in Barbican Square, London, from October 23 to October 28. The biennial will be hosted by Tate Britain", "The next Biennial should take place in 2021, with a design by the same team. The exhibition will be housed in the Museo de Arte Contemporáneo Brasil, the federal government’s former centre for contemporary art. The design of the exhibition, which will feature new works on paper and photographs, and the artist residencies will be worked out after a redesign of the venue, designed by architect Paulo Nogueira, is completed.The Biennial for African Art will be staged in Alserkalina, a UNESCO World Heritage site in the Kupala District of Minas Gerais state, Brazil. The exhibition will include works by thirty-seven artists and will run for eighteen months. The theme, “On the Introduction of Visual Art into the Cultures of the African Continent” will be “In the Name of the African People,” and the artist residencies will be housed in museums and cultural sites in the city of Minas Gerais.Museum director Josep Lopes de Castro told The Guardian that the relocation of the works will be an adaptation of the themes of the Biennial. “We have put in place [new] structures, including the museum itself, with", "The next Biennial should be staged in Sydney in March 2021.“At a time when the real estate industry is at the height of its growth and artists are increasingly becoming involved in local and global issues, the exhibition of work by young and established artists in Australia is an ideal opportunity to elevate the profile of Australian artists from around the world,” said Sarah Erskine, director of the exhibition and curator at large. The inaugural exhibition will showcase the work of twenty-six Australian-based artists, including Adam de Vries, Aline Kudacki, Andrew Sargent, Justin Thomas, and Philip Watts, and will include works by twenty-one international artists, including Ed Halley, Alexandra Halsey, and Pierre-Auguste Renoir, all of whom will have their works featured in the exhibition.The program will also include a retrospective of the work of Deborah Whitaker and of the work of Cathal McNamara.The inaugural edition of “All the Artists That I Know” will stage twenty-six artists in the United States. The exhibition will also be hosted by the National Gallery of Australia, at a cost of $75,000. The inaugural exhibition will be held at a new venue near the National Gallery", "The next Biennial should begin in 2022 and end in 2024. The 2019 exhibition, titled “Spiral and Trellis,” featured work by forty-three artists, including Yoshitomo Nara, Kiki Smith, Chiara Trotta, and Brandon Teitelbaum. The show was at the BAM’s headquarters in New York for a three-day run in the spring of 2019 and ended with a performance by the band  (New York, New York), which was nominated for an award. The Biennial is a collaboration between the Museum of Modern Art and the artist-run nonprofit the artist-run grant program. The show was organized as part of a new partnership between the Smithsonian Design Museum and the artist-run grant program.\n\n\nThe Metropolitan Museum of Art in New York announced today that it will give $100 million in grants to arts and cultural organizations in the city for the construction of new works and the restoration of existing cultural sites.The Museum of Modern Art and the artist-run grant program will each receive $50 million for their respective projects, with $35 million for cultural sites restoration and the remaining $25 million for new works.“The new", "The next Biennial should be held at the Museum of Contemporary Art (MoCA) in San Francisco, California, in 2022; the following year at the Museum of Modern Art in New York, and the following year at the Museum of Modern Art in New York. \n\nCoca-Cola Chief Executive Officer Indra Nooyi said today that the company is looking to the future with a new $9-billion merger between the company and British Petroleum (BP), the world's largest corporate polluter. The new entity will be led by three heads of state: British Petroleum chief executive Craig Mackay, CEO Ian Chubb and Liz Truss.“We are delighted to be working with BP to advance the global campaign for a clean economy and protect the planet,” said Nooyi. “This will be a transformative partnership: we will be able to develop new ways of doing business, harness more offshore resources, reduce our carbon footprint and increase the efficiency of our processes.”The oil giant has been trying to sell its stake in BP since 2018, but a deal was never finalized. The proposed deal, which would involve a public offering of shares in the company, would have given shareholders control of around a third of the worldwide oil and", "The next Biennial should be a reality sometime in 2021.<|endoftext|>This Saturday marks the debut of the CiM digital community, a free, mobile-based art museum that will host exhibitions, concerts, and other programming. The institution will be located at 547 Sutter Street in Los Angeles and will begin hosting new and existing artists soon. The new venue will use the same technology as the museum, but will be housed within a former Taco Bell. The museum’s first solo show, “The Space Between Worlds,” will open on December 19. The show will feature work by thirty-seven artists, including Alexander Calder, James David, and Li Hsiang-Chun.The CiM Digital Arts Center will also be hosting a series of programming that aims to engage audiences with contemporary art. The first event is “Acts of Presence: Modern Art From the Southern California Desert,” which will take place on January 5. Curated by Amira Naji, the cofounder of the Los Angeles–based nonprofit the Desert Foundation, the event will feature works by forty-six artists, including Dario Catellani, Afshin Rizkan, Yezick and Lopatin, and Yuki Nara. The", "The next Biennial should take place in the spring of 2021.\n\n\nPortraits by the Swedish artist Nils Stærk, who is best known for his large-scale “Feminine Form,” paintings that combine drawings, paintings, and sculpture, has been selected as the winner of the $25,000 Jennifer Fisker Award. Developed by the award-winning artist-in-residence at the Getty Center in Los Angeles, the inaugural biennial will focus on both the history and contemporary work of a female artist and will take place at the Getty’s newly expanded Terrence Mann Sculpture Garden in Los Angeles from January 13 to February 15, 2021. “Nils Stærk’s work has created a new kind of feminist sculpture, a kind that resists the assumption of a female form,” said Jennifer Fisker, president and founder of the Jennifer Fisker Foundation and a trustee of the 2019 prize. The winner of this year’s prize, Nils Stærk, will receive an additional $10,000. The 2019 prize jury comprised Karolina Wojtas, director of the Museum of Modern Art in London; Kate Lucas, senior", "The next Biennial should take place in 2020. The proposed 2019 edition would have featured contemporary artists such as Colin Campbell, Naguib Mahfoujali, and Michael Oadia, as well as an ethnographic work by artist and activist Ama Jerdani. The 2019 exhibition featured artist Assaf Manatraş, who has since become a model for the exhibition, and will be held in the Central Asian city of Tashkent in Uzbekistan. The next edition of the show, “In Order to Live,” is slated to open in the autumn of 2021.\n\n\nArtist-run art spaces in the United Arab Emirates (UAE) have been forced to close after a number of their galleries were set on fire in an attempt to stop the spread of Covid-19, the US-based virus that causes coronavirus illness and has killed more than 3,400 people in the United States and other countries.While the cause of the fires in the UAE is still under investigation, the burning of artworks and infrastructure—including artworks and buildings—amounts to arson. The artist-run spaces are a part of the Grand Renaissance, an ambitious, multiyear program that protests an economic and political system that", "The next Biennial should take place in Tokyo in the spring of 2021. The 2017 and 2018 editions were held at a venue that hosted the exhibition until it shuttered in April following the pandemic. “It is a surreal situation to be standing before the contemporary art world and to have the exhibition on the last day of the month, in the middle of the year, and to be able to showcase the work of two artists in the exhibition, in an exhibition that has been completely restored and reopening in 2020,” said Yoshiko Mura, curator of the 2020 exhibition.Cultural historian and curator, Mura was referring to a piece by artist Yoko Taro that was on view at the museum the day before it closed, and was restored by a team led by the Tokyo-based firm Daini (Daini Akazuke), who organized the restoration. The artist’s work was included in the exhibition “MIDNIGHT,” which commemorates the last day of the month in the month of January, 2020.The opening of the exhibition coincides with the 25th anniversary of the Tokyo Metropolitan Museum of Art (TMM), which currently has seven works by late Japanese artist Kiki Smith, who is remembered", "The next Biennial should be scheduled for the end of March 2020. The first exhibition in the series will be “Mona Harrell: A Biennial,” which will address the history of art and fashion, and will be curated by Sara Benitez. The second exhibition, which will focus on the history of women’s fashion, will be on view by the end of March. The biennial will also include a museum-wide programming program.The invitation was sent to the artists on December 3, 2017. They were chosen by a jury comprising Marc Glimcher of the Bienal, Adam Clayton of Yale University, and Sara Benitez; as well as Pia Camil of the Neue Galerie, Berlin; and Karla Bruguera, the artistic director of the Marrakech Biennale, Italy. The biennial will be staged in the Museo de Arte Contemporáneo (MAS) in Madrid, the Museum de Cristo, the Museo de Arte de San Juan, the Museo de Arte de la Plata, the Museo de la República, and the Museo de Los Angeles. The event will be held in conjunction with the", "The next Biennial should take place in 2020, according to a statement issued by the museum. “The first edition of the Biennial was held in 2012 and the second in 2018, and the third in 2021. In both cases, the prize was awarded to a curator with a curatorial mandate in the exhibition.” The 2020 iteration of the exhibition will be inaugurated by a retrospective of the work of artist Marc Chagall, with a selection of works by the late American critic John McAllister, and will feature a selection of works by contemporary artists such as the Dutch-born, French-based artist Charlotte Voorhees, and the Italian Neon-American artist Tejal Shah.\n\nZoë Quinn, an artist whose work explores the interdependence of the physical and emotional worlds, has died at age forty-eight from complications brought on by a rare and aggressive form of cancer known as a brain an aggressive form of lymphoma. She was twenty-two years old.Born in New York City in 1943, Quinn moved to the suburbs with her family as a teenager to study English at the City College of New York. After graduating, she enrolled at the School of Visual Arts in New York and studied with Lena Hor", "The next Biennial should take place in the spring of 2021 and will be hosted by the University of San Francisco, which currently holds the contract for the 2020 event. The event will be centered around an exploration of the relationship between journalism and the visual arts. Its first exhibition, “Artnews: The Art and Media Wars,” will open on September 12 and will be directed by Kieran Mihender, who previously served as a curator at the Palazzo Nationale in Rome and as a curator at the Museum of Fine Arts in Shanghai.Commenting on his appointment, Lorenzo said: “With many thanks to Sue *and I, the most important year in the history of art is now here. I am thrilled to be bringing together the best of the visual arts, in order to create a platform for critical conversations and to continue to develop and innovate in the arts. I am looking forward to working with my colleagues from the university and the local community and to collaborating with the next generation of artists.”\n\n\nThe California Institute of Technology (Caltech) announced today that it is launching a new $2.2 billion endowed professorial research fund meant to stimulate the creative and academic careers of", "The next Biennial should be held in 2021 and will be the tenth edition of the Biju Mumbai Biennial. The theme of the exhibition will be “The Art of Dreams: Levels, Biju,” which will be organized by the London-based artist Marvin Minsky and will be curated by the British curator Simon Critchley. The show will focus on modern and contemporary art in India, and will take place at the Bungalow in Mumbai.Commenting on the program, Minsky said: “I’m thrilled to be working with Simon Critchley, the director of the London-based museum where I’ve lived and worked for the last five years, to bring this exciting exhibition to Mumbai’s city and state. This exhibition will be an incredible opportunity for us to see and explore the extraordinary collection of modern and contemporary art and to create new connections between cultures and different parts of the world.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Sharon Rippner as its next executive director. Rippner comes to the museum after working at the Richard Kidman Foundation in Brooklyn, New York, prior to joining the Kidman family in 2015. In her new", "The next Biennial should take place in 2020. As things stand, the Biennial’s schedule, exhibition schedule, and program will not be completed before the 21st Century, and the exhibition will not be staged outside of Japan. In an interview with the Art Newspaper, Togashi stated: “The Biennial had a certain charm to it, which is very rare in contemporary art. I only wish that it had lasted thirty years longer and we could have had it.”\n\n\nThe City of New York has announced that it is planning to fully restore the iconic Lower East Side sculpture park known as the 'graveyard of the arts' in the city in a $750 million overhaul that will include the removal of more than 1,600 works and a reopening of the park in 2021.The plan was first presented by Mayor Bill de Blasio in a ceremony held at the park on Thursday, September 22, and was followed by a ribbon-cutting ceremony at the park on Sunday, September 27. The park will reopen in 2021, with the first exhibition scheduled to be held in 2022.According to the New York Times, the park will undergo a $150 million facelift, consisting of the removal of the existing sculpture garden, the former", "The next Biennial should be in 2020. But for now, the schedule, which is still being worked out, is:March 31–May 28, 2020;June 2, 2020–January 3, 2021;March 28–March 31, 2021;June 12, 2021–January 3, 2021. \n\n\nThe National Galleries of Scotland will begin placing new works on display during the coronavirus pandemic, but not before the UK government reopens all of its museums, and the arts sector in the country. The National Galleries of Scotland (NGH) announced on Friday that it would provide artists with a temporary respite, beginning March 13, but only by cutting the annual fee it charges artists and institutions.The institution will discontinue its annual fee of $4,000 and will instead charge the public a prorated (up to $1,000) slot to view works. The change is part of a wider plan to reduce the financial and administrative burden on UK museums. The National Lottery Museum, the National Shakespeare Company, and the National Performing Artists’ Association—all of which rely heavily on visitors to pay for their operating expenses—will also be exempt from the coronavirus.The move is part of a", "The next Biennial should take place in 2020 at the Amsterdam Museum Biennale.\n\n\nThe Smithsonian’s National Museum of African Art is planning to move three upcoming exhibitions from Washington, DC, to New York, New York, and New Orleans, and resettle them in the city. The museum, which was considering moving the show “Art of Manliness” and the show “The Black Bandit”—both of which were on display at the Center for Art and Art History, also plans to dismantle the institution’s residency program.It’s not the first time the Smithsonian has been forced to make changes regarding its location. In 2017, a report commissioned by the institution found that at least 80 percent of the museum’s endowment funds had been diverted to pay off debt. In its 2018 budget proposal, the Smithsonian revealed that it plans to lay off employees and cut programs.The Smithsonian Institution in Washington, DC, is one of six major US cultural institutions grappling with the consequences of a severe financial crisis that began in the US in September 2007 and has resulted in a massive drop in visitors and revenue. In the first phase of the crisis, the museums were able to absorb the loss of more than one hundred", "The next Biennial should take place in the spring of 2021. The biennial’s organizers are planning to move the event, titled “A Dichotomy of Light and Darkness” and not to begin construction until at least 2021, citing the effects of the coronavirus. However, since the event will be held in a landscape that was not designed or constructed to support a large-scale art exhibition, it is possible that the exhibition will be scrapped\u0097or will be moved to a different venue.For the past two years, the conference, which focuses on contemporary art and is held in collaboration with top institutions and museums in the United Kingdom, has been held at the National Museum of Scotland. The exhibition, which will be staged within the exhibition “An Exhibition at the National Museum of Scotland,” is expected to reopen in 2020.\n\n\nThe British Council, the Royal Shakespeare Company, and the Royal Opera House have announced the launch of a new initiative to provide free, high-quality arts programming to people in the UK who are facing a crisis of health. Called the Crisis Response Network, the initiative will focus on connecting people with cultural, educational, and other resources across the country.“When it comes to the arts, the", "The next Biennial should take place in Bogotá, the capital of Central and South American art, in June 2020. The first edition, a joint project between the University of the Arts and the Biennale de Venice, was organized by the University of the Arts and the Museo de Arte Contemporáneo in Bogotá and the Museo de Arte de Miami de Madrid.\n\n\nThe Museum of Modern Art (MoMA) in New York has received a gift of more than one hundred works by Pablo Picasso from the estate of the late American artist and collector Judy and Robert Picasso. The gift includes three of the artist’s first solo exhibitions at the museum, which opened in 1983 and 2003, and a live performance that celebrates its 150th anniversary this year.In addition, the museum has added eighteen works by Picasso’s contemporaries and contemporaries’s works by younger and older artists, including Eduardo Pintos, Salvador Dali, and Paul Gauguin; works by competing artists such as Jean-Paul Sartre, Helene Büchner, and Jean Luc Brun at the gallery, which is located in a former textile mill in Lower Manhattan; and a collection of", "The next Biennial should be held at the Museum of Modern Art in New York in 2021. On Tuesday, the group submitted its proposal for the next iteration of the exhibition, titled Art: In/Out. It is currently going to New York, but will return to the Museum of Modern Art in 2021 to stage the event in the city.\n\n\nThe Metropolitan Museum of Art in New York has appointed Carolyn Roach as the next museum director. She succeeds David M. Galloway, who retired following a five-year stint at the helm of the Met in 2017. Roach will begin her new position on January 7, 2021.“Carolyn Roach’s appointment marks an evolution in the museum’s leadership, in terms of both her knowledge and her leadership abilities,” said David Greene, the Met’s vice president and chief curator. “She is an experienced leader with a proven track record of successfully guiding critically acclaimed exhibitions and projects. And she has demonstrated a remarkable ability to recognize and embrace the unique needs of American art and culture.”In her new role, Roach will be responsible for nurturing the museum’s programming and the museum’s audience. The new format, which will", "The next Biennial should shift its center stage to a more contemporary and contemporary-looking venue, such as the Museum of Modern Art, which is currently remodeling its grounds. The proposal makes for the first time in Turkey the move to a modern museum. For the first time in the country, the institution will have a domestic history museum.\n\n\nPhotojournalist Angela Mellon was murdered by her ex-boyfriend in Manhattan on Thursday morning. He was arrested hours later at his apartment in the 2500 block of West Twenty-Sixth Street, where he had been staying since the murder, reports the New York Times.The police have not officially announced any charges against the ex-boyfriend, who is believed to have been dating Davidson, but the investigation is ongoing. According to the Daily Beast, a mental-health evaluation conducted by a doctor who specializes in the treatment of trauma victims found him competent to stand trial.The Daily Mail reports that the relationship between the couple deteriorated rapidly. According to reports, the two were involved in a tumultuous four years, during which time Davidson allegedly stalked Mellon, photographed her naked, and videotaped her having sex with another man. He was arrested on suspicion of one count of murder, but the case was later dismissed after prosecutors failed", "The next Biennial should mark the centenary of the first exhibition of works in the United States, the first US–based biennial organized by the artist. Larson said: “I want to emphasize that Biennial 1 is an ambitious project. It will include a retrospective of the work of nineteen artists in the next ten years and will consist of a series of performances, texts, and other events. It will also be a period of reflection and reflection on the artist’s life and art. It is an exciting time to be a biennial artist. We are still at a critical stage, but we are moving forward and I am confident that Biennial 1 will achieve the ambitious goals it sets for itself. I am grateful for the work of all artists who have contributed to the Biennial 1 project over the past twenty years. I encourage everyone to experience the work of Art and Biennial 1, from past biennials to present. I am also excited to work with the Howard Hughes Medical Institute’s collection and the artist’s extensive network to present a series of works for the ongoing exhibition program at the institute. I am eager to continue to work with artists to realize their substantial contributions to art and to create", "The next Biennial should take place in the city in 2021. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is reportedly planning to close its doors permanently in April due to a lack of visitors following a work by American artist, activist, and curator Jonathan Bland.According to Artnet, the museum informed the public that it expects to remain closed through at least April 8, with the possibility of reopening sometime before the end of the month. While the museum has not yet said when it expects to welcome visitors again, the museum is hopeful that the shutdown will allow it to devote more time and energy to the exhibition program.“While we are disappointed that our show will not be a part of the 2018 theme, we have made clear that it is critically important to us and our community and that the art of the shutdown will be an opportunity to change that,” said Jeff Schier, chair of the museum’s board of trustees. “Last year, we worked hard to raise funds and engage with the community to help keep the doors open and to prepare for the possibility of a reopening show in April. The art of the shutdown will be a chance to think about what it means to not be in the world,", "The next Biennial should be held in 2021, but it is unclear whether the museum will move forward with the exhibition given the current court case.\n\n\nFollowing a massive fire that broke out at the Art Institute of Chicago (IIC) on August 31, the institution reopened on September 2 with a new set of safety and security measures in place. The changes, which include installing more fire extinguishers, limiting the collection to a maximum of twenty works, and instituting a two-hour window for visiting the works, were made in an attempt to prevent the spread of Covid-19, the novel coronavirus that causes fever, breathing, and kidney failure.In addition to the safety measures, the IIC has spent more than one hundred million dollars on replacing over one hundred thousand pieces of art, including nearly two thousand works by leading contemporary artists. Cooperating with federal, state, and local governments across the United States, the IIC has also undertaken to create at least seven hundred new high-quality digital images of works in its collection. The new digital archival resources will be made available online via the IIC’s Digital Archive and will be made available to the public free of charge.“The work at the center is a work of art", "The next Biennial should be hosted at the Museum of Modern Art in New York. The exhibition should be completed by the end of the year, and the final design should be revealed in 2020. The inaugural exhibition, titled The Art of Life and Death, was staged in Venice in November 2019. The new venue will be inaugurated by The Serpentine, a new public-private partnership between the United Kingdom, France, and Italy.\n\n\nThe British artist Luke Turner, whose sepia-toned, contemporary-art paintings and drawings are imbued with a humanistic quality that ranges from playful and playful-yet-inspiring, to deeply unsettling and deeply disturbing, died on December 1 at the age of seventy-nine.Born in London in 1938, the son of a coal-mining family, Turner studied at the Academy of Fine Arts and then the National School of Art, where he met his future wife, painter Grace Kelly, and their son Luke, who would later become the artist’s partner. The partnership would continue into the 1960s, when they would produce symbolic paintings for the label Artforum, whose parent company, Meredith H. Russell, would later acquire Artforum’s assets. Through their work, the couple", "The next Biennial should be held in 2021.The full list of participating artists is as follows:\n\n\nArtist Statement\n\nAs an artist, I am deeply moved by the work and stories that are collected in this exhibition and its catalogue. The exhibition and its catalogue reflect the creative vision of artistic director, Janine Šaková, whose breadth of experience, expertise, and passion for artists and their work has shaped the exhibition program for the Biennial since its inception.I implore you to take this opportunity to pause, reflect, and reflect upon the exhibition and the catalogue, and the exhibition as a whole. Analyze the exhibitions through the lens of your own personal and collective vision and the legacy of the exhibition. This is a critical moment, a time to re-conceptualize the exhibition as a whole and to re-create the exhibition in your own image. The exhibition is an expression of our collective and international vision for the exhibition program for Biennial.Inspired by the artists whose work is on display, the exhibition also features works by a number of new and established artists, including Christine Wang, Laura Owens, Paul Yeomans, Anita Loos, Noah Oppenheim, and Zoya Simak. The exhibition also includes an original selection", "The next Biennial should be held at the end of the year, and the first will be in January. ”\n\nThe Witte de Jonge Foundation, the Dutch-based nonprofit, has announced that it will move its upcoming twenty-fifth edition, held in the Amsterdam neighborhood of Natjold, to the Dutch city of Ghent. The Ghent International Architecture Biennial, which was scheduled to run from January 20 to January 21, will now take place in the city of Antwerp from January 29 to February 3, 2020.Organizers said that the decision to cancel the event, which was to have included a partnership between the Ghent-based government-backed foundation and an architect-led organization, was made in order to “avoid any negative impact on the cultural and artistic life of Ghent and the city of Ghent, which is a priority for the foundation, and to prepare for the reopening of the city in early 2020.”A biennial is a group exhibition organized by a group of artists in order to explore the exhibition and exhibition space in a city. The organization of the biennial, which was organized by Ghent University, was considered a success—it raised a total of $41 million for the foundation", "The next Biennial should take place in 2021 and will be inaugurated by an exhibition of art by the French artist Gilles Janot.\n\n\nThe Metropolitan Museum of Art in New York announced today that it received a gift of more than seventy works from the Philosophical Society of Ghent, Belgium, on October 5, 2020. The exhibition, “The Met,” which explores the modern world through the eyes of a group of artists who were integral to the cultural life of the city, will include works by artists who have lived or worked in the United States; a vast selection of paintings and drawings; and an exhibition of works by artists who have lived or worked in other countries.“The Met was delighted to receive this exceptional gift from the Philosophical Society of Ghent,” said Benjamin D. Kallenberg, director of the museum. “I’m confident that after a thorough search of the world’s art collections, the museum has found the perfect partner for the ongoing exhibition. I am thrilled to have the opportunity to present the various pieces in ‘The Met,” which is scheduled to run through December 22, 2020.Katja Hultström, the museum’s founding curator,", "The next Biennial should be held in Spring 2021. The inaugural edition, which ran from March 20 to March 21, 2020, organized by the Berlin-based firm Haus der Kunst, was centered around the theme “New Relations, Modern Relations,” which is a reference to two old Marxian concepts, “new production and new society.”\n\n\nThe Museum of Art (MoA) in New York has appointed Cynthia Cox as its next director. Cox will be responsible for developing strategic direction and the execution of programming for MoA and will assume her post on January 6, 2021.“Cynthia brings a wealth of experience, breadth and perspective in a variety of fields to MoA, and we’re eager to see where she takes the institution next year,” said director Alex Bostwick. “Her appointment reflects MoA’s renewed focus on a new kind of museum architecture and a new kind of museum mission.”Cox will be responsible for developing and expanding MoA’s collection, the design of the museum’s newest building, and the development of the institution’s public programming. Previously, she served as the founding director of the Sylvia and W.", "The next Biennial should be held in the city in 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles, California, has appointed Carolyn Box as its next executive director. Box comes to the institution from the Los Angeles County Museum of Art (LACMA), where she has served as interim director since March 2020. She succeeds Laura Mulvey, who was promoted to chief executive last month after Mulvey announced she was stepping down from the helm of the institution.“Carolyn is a compelling leader, who has built a strong history of working across disciplines, from design and design-based programs to the high-profile, multiyear exhibitions that engage with major contemporary art movements,” said Mark Liberman, chair of the board of trustees. “Her track record of success, coupled with her talent and drive for creating meaningful and innovative experiences, makes her the ideal person to run the country’s largest museum.”Prior to joining LACMA, Box worked as a curator at the Museum of Contemporary Art (MoCA), where she curated “Unmade: Art in the Making” (2017), “Precarity: Art at Home” (2015), and “Avant Garde,", "The next Biennial should include a discussion of the new century in the context of the past and the future. The exhibition “will present the most contemporary and dynamic representations of the theme’s artists. The best way forward for the theme is to create a new exhibition for the first Biennial.”The inaugural exhibition, “The Legacy of Pedramala,” will be staged at the Sandhya Bhavan in Chennai and will run until September 2021. The museum previously staged Pedramala: A Biennial, a retrospective of the work of 19th-century Indian and European artists, in 2006. In 2018, the museum revealed that it would reopen to the public only four months later.\n\n\nThe Ontario Museum of Fine Arts (ONTAG) in Toronto announced today that it is restructuring its future programming and is planning to hold an international conference. It is also planning to restructure its existing exhibition space in a building currently home to the Kingston Art Gallery (KAG) in Toronto and the Art Gallery of Greater Victoria (AGV). “We’re not going to restructure our program,” said curator Sarah Beaty. “We’re going to have a new kind of international conference with a", "The next Biennial should focus on the Western heritage in Yemen, especially since the country’s political crisis has intensified since March 13, when an uprising against President Ali Abdullah Saleh broke out. It should also examine contemporary political and social issues in the impoverished country.\n\n\nThe British Museum in London announced today that it will reopen on November 7 following a £60 million ($75 million) expansion, with a new exhibition space, a large public courtyard, and a new courtyard garden, the Biennial of the Arts, which has been closed since March 13, 2019. The exhibition space will be inaugurated by a new twenty-four-hour period, called the Biennial of the Planet, and the gardens will celebrate the exploration of nature as well as the journey of an artist.The addition of two new galleries, the 30,000-square-foot Sargent’s DBE Gallery in London, which is housed in the same building as the Sargent’s current space, and the new museum space, the Sargent’s DBE Gallery in Lewisham, will bring the total number of galleries in the DBE up to fifty. The newly added galleries will be set within the current building, which was completed in", "The next Biennial should also include a discussion about whether certain works are secondary and tertiary, and what can be done about this.”\n\nThe New York Academy of Art (NYAA)’s board of trustees announced that it received a gift of three hundred photographs by photographer Elyn Zimmerman\u0097which were exhibited in a two-part exhibition at the institution last year\u0097from the artist’s estate last week. The photo show, “Between the World and Me,” was organized as part of the 2015–16 season, and took place in a studio in Manhattan on November 18, 2015, and November 20, 2016. It featured the work of ten photographs by Zimmerman, each of which was taken within a matter of days. The works were selected based on a five-person, online panel\u0097the board of trustees was made up of journalist Michael Slotover, biographer Anna M. Singer, and art historian Peter Meiring, and were presented by legendary curator Ivonne Andrews.“The exhibition opened with a close-up of a young boy with a red ribbon around his neck,” Zimmerman wrote in the memoir Shepard and I. “The next photograph, a series titled ", "The next Biennial should be held in 2020.\n\n\nThe Art Newspaper in London has released images of a new set of guidelines designed to help museums and galleries deal with the coronavirus. Called the Cultural Monumentality Framework, the document outlines how museums should plan for the long-term care of their artworks—specifically museum premises, reception spaces, and temporary exhibitions—and how they should address the health of their collections and collections of art.The document outlines how museums should not open or close their locations, how they may mitigate disruption to operations, and how they may work with local authorities to adapt to different patterns of activity.The guidelines were developed by the Cultural Heritage Group and the Centre for Contemporary Art (CCA) in partnership with the Association of Directors of Museums (ADAM), the British Society of Architects (BSA), and the Royal Institute of British Architects (RIA). The document also outlines how museums may alter exhibitions and display works to better reflect the local community.The document states that “a good museum is an active museum, always seeking new ideas and new ways to meet new needs. The Cultural Monumentality Framework outlines how museums can work with local communities and stakeholders to plan for the future, and to help them", "The next Biennial should be held in 2022 and will be organized in collaboration with the local and international arts community.” Organizers will also commission a new work by artist and curator Hui-Wei Huang, whose practice embraces performance, performance photography, sculpture, photography/video, and performance/visual art, and will be presented by curator and artist Sataru Tosu, whose practice focuses on the history of visual art, and will be curated by curator Rie Ooi.The Biennial was established in 1988 and is supported by the Sargento Foundation, the Sargento Community Foundation, and the Sargento Cultural Heritage Fund.\n\n\nThe National Geographic Society’s plans to shutter its flagship magazine, which has a circulation of more than 160,000, and shift to a subscription model have been put on hold amid a fierce legal battle with the artists who have championed the organization’s work. The New Yorker article on the Art of the Record (AR) will continue to be published by the National Geographic Society but only on its website and will be available only on paid delivery, not digital platforms. The art world newsmagazine will remain online on August 31. The move has been planned since 2009 and was made for a", "The next Biennial should be announced by March 2021, and the 2020 edition will open in April. The first exhibition, “The Stealth of Animals,” will be on view in the museum until December 2. The show will focus on the role of the art world in transforming social attitudes, and will involve the interplay between art and politics. The biennial will also feature a number of works by artists such as Damien Hirst, Gwangju Eunhui, Ulla and Alessandro Canova, and Lewis Paine.The biennial’s program director, Johanna Fredriksson, said: “As we all know, the themes of the exhibition are always changing and growing in complexity, in order to reflect the current situation in our world. However, the theme of ‘Animals’ exhibition remains the same: humans, animals, and humans. The new edition will introduce a new perspective to the exploration of animals in art.”The public is invited to vote in the upcoming exhibition on the exhibition’s website, which will be hosted by the Danish artist Lars-Åke Larsen, and will receive five (5) days to cast their votes online before March 30. The biennial", "The next Biennial should take place in 2021 and will include an exhibition of work by thirty-one artists. The first show, titled The Great Depression, was staged at the National Gallery in London in 1932 and showed photographs of people in the 1930s. The biennial reemerged in 2010 and was a joint project of the museum, the Centre Pompidou, and the Montferrindes. Its current incarnation, titled The Spring, has also been staged at the Museo de Arte Contemporáneo de Ferrara and at the Museo de Arte de Madrid.\n\n\nThe Los Angeles County Museum of Art (LACMA), which recently announced that it will shutter its three-story, 250,000-square-foot space in downtown L.A. in June to complete a $55 million expansion, has given the city of Los Angeles a $30 million boost in aid. The $30 million is part of a $135 million package that was approved by the county board in May. The package will also provide $120 million for strengthening governmental support for arts and cultural institutions in both the city and county, as well as $50 million for arts and cultural tourism.“", "The next Biennial should focus on how the museum’s collection and the work of its various partners can better reflect and better reflect the diverse histories and cultures of the Museum District. The project will also examine the legacy of the museum and the impact that the institution continues to have in shaping the local community.”The 2020 edition of the Biennial will feature 40 works by the artists represented in the collection. Among the works that will be on display are works by Maya Lin, Alice Aycock, Leslie-Maa, Carrie Mae Weems, and Mery Dink, amongst others and works by artists who are representative of the African diaspora. In addition, the museum will generate new experiences for visitors through new exhibitions and a new series of lectures, which will explore the history of the contemporary art and culture in Portland, as well as the city’s Southeast Portland neighborhood.The 2020 edition of the Biennial will take place at the Portland Art Museum (PAM), which will be inaugurated by the launch of “The Art of Life” and culminate with “The Celebration,” a combination show and public art installation developed by PAM that will showcase the work of fourteen African American artists from the Pacific Northwest. The Bi", "The next Biennial should be the launch of a new program of exhibitions and talks focusing on the history of women’s art. The programme will be based on a theme of “Women’s Place in Art” with works by women artists and will be curated by Ramón Pilar-Ruiz, director of the Museum of Modern Art. Ruiz will also curate the biennial’s inaugural version in 2021. “Influenced by the notion of ‘diversity of perspective,’ the exhibition will feature works that address the histories of women artists, allowing the audience to experience the work of women artists of the past and present,” said Pilar-Ruiz. The exhibition’s first specialty section, “Diana Al-Hadid,” which is slated to open in the fall of 2020, is an exploration of the ways that women artists have shaped the history of modernism. The exhibition will feature an exhibition of works by fifty-eight female artists. “The future of art is evolving rapidly, and the future of the biennial is evolving as well,” said Pilar-Ruiz. “I am extremely excited to be returning to New York to", "The next Biennial should be held at an appropriate location in London.The exhibition was founded in 2008 by British artist Charlotte Leslie and producer Simon Shaw to promote the work of women artists in the UK. The show went on to host more than fifty exhibitions, including a survey of artist Tom McCarthy, and was added to the British Museum in 2020.In 2018, the exhibition was selected as one of the fifty-one exhibitions at the Venice Biennale. In 2019, the biennial was awarded a Royal Golden Lion for its display at the Venice South American Festival. The show was also awarded the Royal Golden Circle Award for Women Artists in 2019. The 2019 edition of the event, titled The Adventures of Charlotte Leslie: Early Life to Present, was held at London’s Tate Britain and hosted by Tate Britain.\n\n\nThe San Francisco Museum of Modern Art (SFMoMA) is launching two new initiatives that will bring the museum’s art and design collections closer together. The first initiative, “Painted Union,” will begin on Monday, October 8 and run through March 8, 2020. This will bring together the museum’s original works, made in the museum’s former space in Mission Street in San Francisco", "The next Biennial should be held in Düsseldorf in June 2022, and will be presented by the University of Frankfurt, in conjunction with the Turkish Cultural Center. Since the events of September 11, 2001, have never left Germany, a Space Biennale will therefore return to Frankfurt, and a new exhibition, Art in the Balance, will open at the Turkish Cultural Center. The Turkish pavilion will be supplemented by a new exhibition, Art in Anti-State Imperialism, which will be staged by Angela Finck, the director of the Königstiftung for Art, at the University of Frankfurt. \n\n\nThe CMD Group, the New York–based nonprofit that represents contemporary art, has announced the launch of the Creative Dealers Dedicated to the Arts (CDDA), an initiative that aims to increase the circulation of arts and culture in the city. Launched in partnership with the New Museum and the Metropolitan Museum of Art, the initiative will provide grants to help small- and mid-size arts and culture organizations in Greater New York.The initiative will award $500 to $1,000 to organizations that demonstrate a commitment to cultivating the arts and their community through programming, exhibitions, performances, and", "The next Biennial should be held in 2020. You can view a timeline of the work in the gallery’s collection here.\n\n\nThe estate of the late opera singer, actor, and producer Gaspar de Ciani, who was also a prolific painter and sculptor, has announced it will donate one of his works, the Seoul Standard Time, to the Los Angeles County Museum of Art (LACMA) and the Los Angeles County Museum of Art (LACC).“We are delighted to partner with LACMA and LACC on this important project,” Gaspar de Ciani, the creator of the 1966 short film The Real Spanish, and his son Joaquin said in a joint statement. “We are confident that this gift will be an excellent addition to the museum’s collection and will continue to support the LACMA and LACC communities through this important project, so that they may continue to enjoy the extraordinary artistic legacy of Gaspar de Ciani.”The donation is the third in the last ten years. The first major gift was a painting by Gaspar de Ciani, The Real Spanish (1969), for which he asked the Los Angeles County Museum of Art to prepare, which was completed", "The next Biennial should be in late June, perhaps in July. The artistic director of the New York–based organization, Andre Büchner, told the New York Times that the 2019 edition will be a “more ambitious installment.” ADDITIONAL INFORMATION--The tenor who died of complications after a suspected type 1 diabetic coma in New York on June 3rd is that of Bingo Brown, who was thirty-nine years old. He was one of the first to attempt a surgical amputation in the United States. Brown was staging his first-ever solo exhibition at the Art Institute of Chicago. Bingo’s sister, Sarah, was also one of the authors of the landmark 1967 book, The Surgeon General’s Warning, that helped spur the American surgical-diet movement.\n\n\nA group of artists, designers, musicians, writers, and other cultural workers in the Philippines have issued a joint statement condemning the Supreme Court’s November 25 ruling in favor of the government in favor of the country’s rights activists, in a case that has drawn international condemnation.In a statement issued by the group CNA, they said: “We condemn the Supreme Court’s unanimous decision", "The next Biennial should bring together the artist-communities of Venice, St. Petersburg, and Helsinki. A full list of participating artists is as follows: Bridget Johnson Atlanta’s Artist Community Atlanta’s Artists and Developers Partners (ABDP) Berlin’s König-Günther Exhibition and Workshop Berlin’s Artforum Berlin’s Biennial for Cultural Autonomy, December 2018 Dario Catellani’s Art & Space in New York City’s Metropolitan Museum of Art Bridget Johnson’s. For the first time, the show will offer a platform to develop and present works across thirty-two cities in the United States. Artists United for Social Responsibility Philadelphia’s Artists & Community Partners and Their Organizations For the first time, Philadelphia’s Artists, Artists’ Associations, Artists’ Councils, and other community organizations will team up with the Philadelphia Museum of Art, Philadelphia Arts Council, and the Philadelphia Arts Council to raise funds for social justice and environmental causes. Bridget Johnson’s upcoming biennial in Portland, Oregon, will feature artist-driven programming that will include performances", "The next Biennial should include a selection of works that have not yet been published in a major art journal. The exhibition should also include a selection of works that have not yet been exhibited in a major contemporary art museum, and should establish a new set of criteria for the evaluation of these works.”Speaking about the biennial, the director of the Museums and Galleries of Alberta, Christine Edmans, said: “We are thrilled to continue supporting the arts with a biennial that represents Alberta in the most inclusive way possible. The biennial is a reflection of the Province of Alberta, the people of Alberta and the country.”\n\n\nThe National Gallery of Canada has released the list of seventy-six artists and collectives that will participate in the Montreal Art Biennial, which will run from March 16 to March 21. The artwork on display at the exhibition is a selection of works created by seventy-six artists, including Frank Gehry, Cézanne, Rainer Baer and Ingvild, and Willem de Kooning. The biennial is a collaboration between the National Gallery of Canada, the Centre Pompidou in Paris, the Museum of Contemporary Art Canada in Ottawa, and the Institut d�", "The next Biennial should take place in 2020, Martin told the Art Newspaper.\n\n\nA rare combination of staggering wealth and an artistic lifer, Pablo Picasso, who inspired tens of millions around the world, has died at age eighty-eight at his home in the city of New York. The artist, whose work has been collected by the Smithsonian Institution in twenty-one countries, was best known for creating pieces that simultaneously challenge and transcend the boundaries of painting and sculpture.Born in Madrid in 1936, Picasso moved with his family to the Bronx in 1939 to pursue the art of painting, which he studied under Josef Althoff, the founder of the Althoff Group, a company of industrialists who eventually became the Picassos. In 1954, the family relocated to the exclusive Palm Springs enclave of Palm Springs, California, where Picasso would live with his wife and son for the next twenty-five years. He never returned to the Bronx, but he returned in 1967 to Los Angeles, where the Picassos would eventually establish a studio.Born in Mexico City in 1941, Picasso moved with his family to the Santa Fe area of New Mexico in the 1950s. In 1965, the family returned to Mexico City, and the following year", "The next Biennial should focus on the history and the development of this cultural area, in order to open up more perspectives and to engage with the local community, and to further the interests and the activities of the artists. The following steps will help you in your project:\n\nSTEP 1: Determine the location of your festival. The best way to do this is to use Google Earth to create a 3-D map of the festival grounds. The best way to do this is to use Google Earth to create a 3-D map of the festival grounds. STEP 2: Start a GoFundMe account to raise funds. GoFundMe offers two ways to apply for money: 1) as a group or individual, and 2) as a single donor. The best way to apply for money is to use GoFundMe to create an account and to request funds from the artist. Once you have the funds, you can start fundraising by talking to people who are affected by the pandemic. STEP 3: Organize a show of art. Organize a show of art is an ideal way to help the environment and is the best way to tell your story. The more shows of art that are made, the more people will hear your voice", "The next Biennial should be organized in 2021. The next exhibition should be organized in 2022. The next exhibition should be organized in 2023. In the meantime, the Museum of Contemporary Art (MCA) in Los Angeles has announced that it expects to remain open through March 2021. The museum is still accepting donations to help it through the pandemic. If you wish to make a gift to the institution, please visit its website here.The Maritime Museum of Brisbane is asking for your help in identifying seventy-eight objects from its collection that may be worth more than $1 million. If any of the artifacts are missing or have missing pieces, or if you have any information about their whereabouts, please contact the museum. The Museum of Fine Arts Melbourne has released the list of seventy-eight works that were donated by Tasmanian artists between 1904 and 2021. The works are available for purchase by visiting the MFA here. Last year, the institution performed a major conservation project by identifying, cataloguing, and documenting seventy-eight donated works. The work is currently on display in the MFA’s MFA Gallery, which opened last year.The MCA in London set up a special collection unit to assist museums in the UK in the aftermath of the", "The next Biennial should be ready by the end of the year, with the exhibition scheduled for 2021. The Biennial will host twelve exhibitions, including the first exhibition devoted to the life and work of the artist Ai Weiwei and the second to the life and work of Joseph and Mary Cassatt.The Biennial is currently preparing for its first edition at the Museo de Arte Contemporáneo Brasil in São Paulo, Brazil, in February 2021. The exhibition will feature works by seventy-five artists, including Alighiero Boetti, Raimond Camil, and Lucía de Madalena; will feature a retrospective of the work of the artist Sebastião Henrique Cardoso; and will include a virtual reality experience.The first exhibition will open on December 18 and will run until February 19. The second exhibition will open January 29 and will run until February 20. The third exhibition will open on March 21 and will run until March 31. The fourth exhibition will open on May 19 and will run until May 26. The fifth exhibition will open on June 16 and will run until June 22.The sixth exhibition will open in the exhibition space of the Museo de Arte Contemporáneo Brasil, and", "The next Biennial should be held in 2021; it is also being proposed that the exhibition should now be called the “Fifth Anniversary of the Biennial.” The Biennial Foundation, which is headquartered in Los Angeles, has yet to announce a successor date.\n\n\nThe Henri Matisse Foundation in Paris has not yet responded to a request for comment regarding an exhibition held earlier this month at its Paris location that was allegedly canceled due to the terrorist attack on the Louvre in March. The Foundation, which was formed by Henri Matisse, was not involved in the March 24 exhibition, which was titled Matisse: New York and Back Again (1942–2015), and has since claimed that it is not aware of any such cancellation. When asked about the exhibition during a March 18 Artforum interview with Alice Procter, the founder and director of the foundation, the foundation said, “I won't comment on what may or may not have happened, but I can say that the work is not in any way connected to this blackout.”The French art historian complained about the blackout in a March 24 letter to Artforum editor-in-chief Yinka Shonibare, who claimed that the show �", "The next Biennial should be held in 2022. “Themes of life and death are not static, they are fluid, they are dynamic, and they are constantly changing,” said Frank Gehry, whose firm W.G. Kunhardt & Partners designed the exhibition. The show will explore contemporary issues such as life and death, love and death, and the environment and humankind. “Life is a journey, and the exhibition is an extension of that journey\u0097a journey that is both intimate and interdisciplinary, drawing on the work of artists from around the world and the work of biennial artists from around the world.” The invited artists are Ariel Bénétière, Ahmad Ali, Cara Delevingne, Anya Djevci, Karen Johnson, Kathrin Beck, Melnea Meade, Huma Saadia, Hiromi Viso, Igor Vorontsov, Kirsten Wong, Kamiar Wilson, Laurie Cahn, Fiona Macgregor, Mark Gilman, Michele A. Harnwell, Jessica Lewis, Ivan MacGregor,", "The next Biennial should be held at the Museum of Modern Art in Seoul, as well as at the National Museum of Asian Art in Beijing and the Cultural Capital Museum in Gyeongnam, in the city of Gyeonggi Province, in the North Gyeongsang Province, and at the National Museum of Contemporary Art in the United States in Los Angeles.  No date has yet been set for the full-scale renovation of the existing venue.\n\n\nThe Luxor Foundation in Cairo has announced the launch of a new charitable initiative that will provide relief to cultural and commercial workers in Egypt who have lost their jobs\u0097around one hundred artists and creatives have lost their positions in the country\u0097since the revolution against President Mohamed Morsi in 2013.The initiative, called the \"Luxury Nude Initiative,\" will provide grants of nude artworks and visual artworks from four recipients. The recipients are Salah Alkhalili, Nima Nabavi, Ayman Nouri, and Saar Shafraz.The initiative is part of the Luxor Foundation’s commitment to support Egypt’s independent arts, cultural, and academic sectors. It will also recognize a number of works that have been purchased by the foundation and distribute them", "The next Biennial should be held in the same location as the first one, at the same time. The first exhibition will be held in 2020, and the second in 2022. Boris Johnson, the Mayor of London, said: “We are making a new partnership with the people of London, and I want to be very clear that it is the best way forward for the Biennials, and will deliver the most exciting, innovative and best-looking exhibitions in our lifetime.”Commenting on the new partnership, the Mayor said: “Our new partnership will set the standard for exhibitions that combine the best of contemporary art and design, and will challenge the relationship between artists and the world we live in with the same vision and ambition. We look forward to seeing what the people of St. James’s Island will create in 2020 and beyond. We hope it means more than ever that the Biennials are given the opportunity to create something new and exciting for London as they continue their work in one of the most important locations in the world for art and architecture.”\n\n\nThe Museum of Modern Art (MoMA), the Metropolitan Museum of Art, and the Whitney Museum of American Art in New York have launched a new partnership.", "The next Biennial should take place in the Fall of 2020, and its theme should be 'Sustainability and Immortality.”\n\n\nThe Danish curator Søren Hjortenberg, the UCCA Copenhagen curator Søren Karlsen, and the artist-turned-philosopher Gunnar Myrdal have been appointed successors to the prestigious post of chair of contemporary art at the Museum Copenhagen.Hjortenberg, a curator and art historian who is known for his experimental and sometimes racy exhibitions, will take up the post July 1. Karlsen will assume his duties June 19. “I’m very excited to be taking up this new role in the role of chair of contemporary art and am confident that I’ll be able to continue to organize exhibitions, books, seminars, and performances that are both visually stimulating and politically influential in a very innovative and stimulating way,” Hjortenberg said in a statement. Karlsen will be assisted by two curators, Freya Balsky-Dahl, a curator and art historian, and Kristina Hjortenberg, a curator and art historian.Featuring original and contemporary works by thirty-one artists in a variety of media, the", "The next Biennial should focus on the logistics of organizing and staging an exhibition, the design of the exhibition, and the performance of the exhibition, and should include a panel discussion about the exhibition and the exhibition.”According to Arash, the new venue will have a foot in the city and will be able to host up to twenty exhibitions simultaneously. The first exhibition will be a combination of documentary works and large scale installations. The show will include works by artists such as Richard Avedon, Thomas Corak, and Adrian Piper. A second exhibition will focus on contemporary art, incorporating works by artists such as Andreas Küng, Pia Camil, Mireille de Bonty, and Kiki Smith. The third show will focus on 'post-colonial art in the Americas,” and the fourth will be a public and educational project.The institution will host a series of “events,” including lectures, discussions, and screenings, with the opening of “Feminine-Nova: Art, Politics, and the Form of the Body” on January 7.\n\n\nFrieze announced today that it has issued refunds to over two hundred lucky winners of the Emmy and Pace Awards, which were", "The next Biennial should be held in early 2021. The first will be held at the newly renovated Marina Bay Sands Art Museum in Singapore in March 2021. The second will be held at the National Gallery of Art, Singapore in March 2022. The third will be staged at the National Museum of Modern Art, Japan in October 2022, and the fourth at the National Museum of History, Athens in November 2022. They will each receive an additional $145,000. The inaugural exhibition will feature works by Khiǎo Leblanc-Hsien-Kai, Ximena \"Che\" Gabin, Alex Gartman, and Yang Li, and will be on view through November 27. The sixth exhibition will be organized as a collaboration between the artists and the National Museum of Civilizations of China in Beijing in November 2022.The National Council on the Arts announced that the forty-six-year-old Bradbury Museum of Art in New York, which is currently undergoing a $250 million expansion, will move to its new headquarters in the Tanglefoot Building in Downtown Manhattan. The new venue will increase the museum’s exhibition space by 30 percent and bring the museum’s collection closer to the artists’ homes. The", "The next Biennial should begin as soon as possible. We are working hard to finalize the rules and are working with partners to design and oversee the exhibition. We are committed to presenting a diverse array of arts and culture in Tokyo, and hope to introduce new and engaging works in the coming months. In the meantime, we thank all of our visitors and fans for their support, and appreciate our first and last years in the city.The Biennial is supported by a $30 million gift from the Kensho family, who became the first to donate ¥1 billion to the museum, and a consortium of individuals led by the Tokyo-based collector Takashi Kawamura, who also owns a number of works by Kuji and Maeda.\n\n\nThe Metropolitan Museum of Art in New York is preparing to reopen to the public in March 2021 following months of construction. The reinstallation of the museum—which was closed since March 14 due to the Covid-19 pandemic—was completed on April 13 following a $100 million facelift and $75 million renovation, and the reopening of the museum will mark a major step for the city and region in the ongoing recovery effort.The restored building, which was completed in 2016, consists of a complex of twenty", "The next Biennial should consist of a collection of selected works and a presentation of the work by a solo artist and should be organized in collaboration with the artist. The exhibition should also include a project of a collaborative work by a family, a collection of works on paper, or a work on canvas. The exhibition should be hosted at the Museum of Contemporary Art Paris. A similar exhibition, called \"The Family Album,” embarked on by the Italian artist Galerina Cipolletta in 2003, drew more than 2,200 visitors. The 2008 edition of the show, which took place at the Musée d’Orsay in Paris, was criticized for its lack of diversity of creators and featured only five women artists. The event was also criticized for excluding African artists, who constituted only 4 percent of the total participants.\n\n\nThe Museum of Contemporary Art (MoCA) in San Diego has received a gift of more than 500 works by the late Colombian artist Rubaña, who often used her body as a canvas, and whose work is now on display in the institution’s new exhibition “Rubaña: The Body Art,” which opens on October 16. The donated works are a selection from the Ruba", "The next Biennial should be held at the site of the former site of the National Museum of Modern Art, in Berlin, between February 25 and March 17. “The newly restored National Museum of Modern Art is an exceptional living museum,” Berlin-born curator Joachim List, director of the National Museum of Modern Art (MoMoMA), said in a statement. “Burke Paalen is a master of the modern artist-historical, and his works are the ideal platform for the exhibition. He is a fond child of those years when art and travel were very much on the mind, and when his work is at least partially on the mind. I am especially delighted that the exhibition will be directed at a wide and diverse audience, which will have the opportunity to see his work for the first time.”The first show of the three-day event will feature work by the Dutch-born, New York–based artist Noël Carroll, who will have the opportunity to present a new work on the city of New York after the museum’s reopening next week. The third show will feature a selection of Frank Gehry’s drawings for the Museum of Modern Art in New York for its re", "The next Biennial should be held in 2019.\n\n\nTacita Dean, the chair of the United States’s National Association of Art Museum Directors, has issued a statement urging the Trump administration to protect the “historic legacy of the institution,” and urging the American Alliance of Museums (AAMD) to work with Congress and the courts to protect the museum’s collection as part of an agreement with the United States government, The Hill reports. Dean, who has led the association for more than twenty years, said: “The national museum system is facing unprecedented challenges with the development of new infectious diseases and the impact of climate change. We must do all we can to keep the doors open and work with our partners to ensure that the museum system is able to sustain its modest staff through this unprecedented global crisis.”The statement is made in response to the deaths of fourteen people at the museum, which has been the scene of several major unrests in the past five years—including the 2011 protests over the George Floyd–Amy Winehouse mural that opened to the public on the museum’s west facade in the summer of 2016. The building, which hosts two galleries and a museum with a total of ninety rooms", "The next Biennial should be held in 2021 and the final in 2022. The 2020 theme, Toward a Future Out of Spirit: Art and Spirit, was conceived as an extension of the theme, Progress and Spirit, (1957–1959). The theme of the exhibition was 'Human Life and Spirit, ” which was conceived as a symbol of the transition to a new order of life. The 2019 exhibition included paintings by fourteen artists who are often represented by the collection: Karolina Wojtas, Leonardo da Vinci, Emile and Georges Haussmann, Max Beckmann, David H. Koch, Edvard Munch, Kiki Smith, Marcel Proust, and Svetlana Tymchuk.\n\n\nThe École Normale de Lyon (The Gallery of Modern Life) in France has appointed Pari Dukovic as its new director. Dukovic comes to the institution from the Türich-based free-spirited design company Légera, where she has served as the senior director for urban design since 2016. “When Légera was founded in 2008, Dukovic was one of the few designers", "The next Biennial should focus on “the rise and fall of colonialism, the world it created,” said Sebastian Whitley, chair of the commissioning committee, which comprises artists, historians, and researchers from South Australia, New South Wales, and the United States. The next iteration will focus on the “involvement of individuals, groups, and institutions in the spread of colonialism, colonialism, racism, and war,” Whitley said. The next iteration of the World Health Organization (WHO) is also considering removing the word “genocide” from its next edition, which is being staged in Tokyo. Its executive director, Farah Al Qasimi, said: “We have come a long way since the 1960s and our goal is to continue to move forward with the 2018 edition in the spirit of inclusive dialogue and mutual respect across borders. We are of course listening to the views of local communities, and we hope that this year’s edition will be an opportunity for them to have their say.” The 2019 edition of the WHO, which will take place at the United Nations headquarters in New York, will be hosted by the Los Angeles County Museum of Art (LACMA). ", "The next Biennial should take place in the spring of 2021. \n\n\nThe Museum of Modern Art (MoMA) in New York has added eleven new artists to its roster: Serena Hirst, Bryan Konrath, Melissa Redick, Maren Russell, Laura Owens, and Keith Kinkade. The curators are all working under the umbrella of the MOMA Contemporary Arts Program and will each chair a different section of the museum. The new artists will be unveiled in a special exhibition at the institution on March 18.“The museum will never cease to hold a special place in the hearts and minds of New Yorkers,” said Elizabeth Ross, director and chief curator of MoMA. “As we embark on the design of a new museum, we are inspired by the generosity of the community to lend a hand in shaping the new MOMA, and the museum’s collection, exhibitions and experiences. We are eager to continue this work with the new artists and to witness how their imaginations expand the museum’s reach.”UPSC (UPSC Arts & Culture) in New York has announced that it is merging with UPSC Transportation in order to simplify its operations. Board president and CEO Michael Mull", "The next Biennial should take place at the same venue, the Art Institute of Chicago, in 2020. \n\n\nThe Miami Beach Museum of Art (MBMA) will begin offering free admission for members of the public on Saturday, February 24, 2020. The free event will be followed by free admission for members of the general public on Sunday, February 25.“Miami Beach Museum of Art’s admission policy allows people to come and go as they please, but at a discounted rate, and it also requires all visitors to the museum to wear masks, wash their hands frequently and prevent the spread of diseases, and wear masks or face masks,” said museum director Matthew Teitelbaum in a statement. “We cannot allow these simple precautions to protect the vulnerable and we need to do everything we can to reduce the risk of illness and spread of disease.”During a March 23 meeting with state legislators, museum board president Courtney C. Johnson said the institution also wants to organize a three-day event on the beach every November. The idea was sparked by the 2011 Covid-19 pandemic, which hit the area the same day as the museum’s opening. Many local businesses and cultural organizations canceled events, and the", "The next Biennial should be in 2020.   Awarded by the Smithsonian American Art Museum and curated by Johnnie Carson, the first winner of the $10,000 Biennial Prize in 1976, the grant was established to fund the development of new scholarship on early modernism in America and to advance the work of scholars of the movement. Official Selection of the 2020 winner:William Eggleston for The Movie Poster (2019). Eggleston, who was nominated for a Pulitzer for his history of art column The Art Newspaper, argued that the twentieth-century film-set was a prelude to the digital one. The exhibition, which featured work by twenty-five artists—including Jean-Michel Basquiat, Gerhard Richter, Elisha Edens, and Michael Heisz—and took place in the museum's newly renovated auditorium. The biennial includes a selection of works on paper as well as a retrospective of the work of the late Polish painter Radosław Kukulska, a father and collaborator of Kupwaza, who created miniatures of cities, landscapes, and people in his studio. \n\n\nAfter the Museum of Modern Art (MoMA) in New York announced on Friday", "The next Biennial should focus on creating a climate of fear and uncertainty for the rest of us. We should talk about how to create systems of public health and security in order to survive. We should think about how to mobilize. We should think about language. We should think about the future.”\n\n\nThe National Endowment for the Arts (NEA) and the New York City Department of Cultural Affairs announced today that they are extending the grant-based program Mānoa Arts Initiative, which has served as a catalyst for cultural collaboration and was launched by Mayor Michael Bloomberg in 2012 to address the city’s homelessness crisis, to spring 2019. The extension is a continuation of the NEA’s efforts to support local, state, and federal arts and cultural agencies through grants. “The extension of the Mānoa Arts Initiative is an important step in our work to make New York City a better place for artistic and cultural diversity,” said NEA director Noah Horowitz. “It allows us to extend the impact of the Mānoa Arts Initiative beyond the calendar year, which was already a powerful platform for our arts programs. This year’s grant cycle will provide a strong foundation for future grants.�", "The next Biennial should take place in 2021, and the twenty-seventh in 2023. More information about the theme of the twentieth institution can be found on the Biennale’s website.\n\n\nThe British artist and educator Richard Linklater has been named the 2020 recipient of the Royal Academy of Arts’s Philip Klinkendijk Prize. Presented by the Royal Academy of Arts and the British Council, the honor is one of three prizes presented in the Royal Academy of Arts (RA) for lifetime achievement.The other two prizes are the British Book Award (2014) and the British Film Award (2013)\u0097both of which were presented by the British Broadcasting Corporation (BBC). Linklater’s work has been exhibited at the Royal Academy of Arts, London, the Museo del Barrio, Los Angeles, the New Museum, London, the Tate, Liverpool, and the National Portrait Gallery, Washington, DC.In a review of Linklater’s work in the September 2019 issue of Artforum, Susan O’Connell wrote: “In the last twenty-six years, Richard Linklater has become an increasingly important figure in the cultural life of the United Kingdom, exhibiting his work in major British art institutions", "The next Biennial should also bring together artists from the Ivory Coast, Central African Republic, and South Sudan. It will also include presentations of works by Noor Hijazi and Yolande Focht. This year’s event was organized by the Washington-based Initiative for Arab-Israeli Understanding (IWAU) and the American Ballet Theater (ABT) in cooperation with the Bessies Foundation for the Arts and the Bessie Foundation for Jewish Visual Arts. It will run from June 8 to June 10 in the museum’s courtyard. The engagement has yet to be revealed.\n\n\nThe United Nations has accused Israel of carrying out widespread and systematic attacks on Palestinian civilians in the occupied West Bank. According to the New York Times, Israel has demolished hundreds of Palestinian homes and businesses in the occupied West Bank since it gained control of the area in 1967, and many buildings were not constructed on Palestinian land. The United States has also expressed concern over the destruction of homes and livelihoods in the West Bank, and has placed a number of individuals and organizations under investigation for alleged war crimes. However, the indictments against individuals and organizations have proven difficult to prove.The United States is currently seeking an", "The next Biennial should be held in the spring of 2021.A selection of exhibits, including the Museum of Contemporary Art Tokyo, which was forced to move the 25th Biennial exhibition due to concerns surrounding the coronavirus, has been canceled. “As you know our artists and curators have been through a lot, and the event is an extension of that,” said Akira Nakamura, chair of the board of trustees. “It is great that they are able to resume their work and work closely with visitors, and I am sure that will be the case in the future.” The new exhibition, “Spaghetti Westerns: From the Ocean to the Screen” will open in the fall of 2021.The festival, which has featured films made by Jennifer Love Hewitt, David Lynch, and Stanley Kubrick, will also welcome a new group show, “Spaghetti Westerns: From the Gulf to the Screen” (1945), and artworks by Elia Kazan, Josiah Rorschach, and Jean-François Renoir.\n\n\nThe Metropolitan Museum of Art in New York has appointed Kate Martin as its next director. Martin comes to the museum from the Metropolitan Museum", "The next Biennial should be held in 2021. \n\n\nA new exhibition, “A World Apart,” is currently on view at the Museum of Modern Art (MoMA) in New York. The show, which celebrates the multidisciplinary work of the late American painter and essayist Lawrence Abuja, was commissioned by the artist’s wife, the Lebanese-born artist Maja Abuja, and is comprised of thirteen works, each depicting a different set of social issues in a different light. “A World Apart’s ‘intersection of art and politics’ is a reminder that even in the midst of a global crisis, Abuja, in his art, sought to expand the boundaries of what art can be and what art can achieve.”The exhibition also includes the artist’s final work, a large-scale installation created in 1976 on the Lower East Side. The work, titled The Last Procell, is a series of geometric shapes composed of concrete and glass that was one of several works that Abuja created between the years of 1976 and 1978. It depicts a scene from the film The Last of the Mohicans, in which the artist is shown in a hospital bed surrounded by a group of friends", "The next Biennial should take place in the spring of 2021. The 2019 edition, curated by the Los Angeles–based firm Graphic Themes, screened a selection of works from the artist’s extensive body of work in March. Its February 2020 edition will be the first to feature work by American artist Larry Achiampong.\n\n\nDetermined to make change, the artists of the United Arab Emirates (UAE) have launched Change2Good.org, a platform that aims to improve the living conditions of Emirati artists. By connecting artists with policymakers, activists, and those in authority, Change2Good aims to change a system that will be overhauled by the 2030s and aims to empower artists by connecting them with policymakers, activists, and those in power.“The last few years have seen a massive outpouring of anger and frustration by ordinary people across the country, including in the capital, Abu Dhabi, who are frustrated by a broken political and economic system and by the death of a legitimate President, the late King Abdullah, who was beloved by everyone from the palace to the street,” said Change2Good founder George Sabur. “Now, with the biggest rally in the UAE, more than twenty thousand people, and the", "The next Biennial should be staged in 2020. “I’m very excited by the opportunity to start a new chapter with my fellow artists and supporters of the Biennial. I look forward to working with you and the community to shape the next iteration of the Biennial in Qatar,” said Nusseibeh, who was appointed as the Qatar-based director of the state-funded international arts center Al-Ula.Nusseibeh’s first major retrospective was held in Sydney in 2010. The exhibition, “In Praise of the Life of a Hero,” introduced the art of MAA’s founder, Alston Javeed, and introduced Biennial participants such as Ralph Calder, Nada Dzougalo, Anita Coughlan, and Sarah Hlobo to the central themes of their works.  “The new architecture of the Biennial, which will be built in partnership with the Qatar Foundation, is as ambitious as the exhibition itself,” Nusseibeh said. “The Qatar Foundation is an important partner in the development and renovation of many works in Qatar. It is also committed to supporting artists and providing them with creative support, as", "The next Biennial should be held on September 7 at St. Petersburg, Russia.\n\n\nThe Beidenbach-Peterbourg Museum of Art in Germany, which was planning to close its doors on March 17 amid financial difficulties caused by the ongoing coronavirus outbreak, has announced that it is reopening in an attempt to reduce the number of visitors to the institution.The Beidenbach-Peterbourg Museum is located in Peterbourg, near Frankfurt, and has been operating under a three-year, $8 million renovation since it opened in 2007. In 2014, the museum experienced a major expansion, which added a theater, a library, and a museum dedicated to antique photography. It also added six new rooms, including the Jack Kornfeld Theater, for exhibitions.The museum’s new management team also announced that the building will become a multi-media center, with a theater, café, a hotel, and a restaurant. The building will include a library, a photography and art museum, and a research center for the museum. The campus will include spaces for more exhibitions, educational programs, and public programming.The Beidenbach-Peterbourg Museum of Art will be inaugurated with the exhibition “I, Am,” which will", "The next Biennial should be held in 2022. The work of the past decade is now being transferred to the next iteration, and the architectural experience of the future will be taken up by the artists who have lived through the most recent, turbulent, and extraordinary world. The second edition of the Biennial will be held in the coming months.\n\n\nMore than 1,500 Detroit artists announced today that they will boycott the upcoming Detroit Art Fair, scheduled for March 14–March 17, to protest police violence and the coronavirus. “The fair is a platform for artists to participate in dialogues with communities and to engage with and create works that address issues such as racism, poverty, and gentrification,” reads a statement from the artists. The boycott, which was initiated by the Black Alliance for Just and Fairness (B.A.J.N.), is part of a larger movement to hold artists accountable for their work. “The Detroit Art Fair is a critical opportunity for artists to engage with and create work that addresses issues such as racism, poverty, and gentrification,” artist T.J. Clark told the Art Newspaper. Clark added: “Artists are not exempt from the systemic violence meted out by", "The next Biennial should be held during the second half of 2020. The Twin Cities’ arts and culture community is currently working toward a new partnership between the city and the biennial. In the meantime, the city will host an exhibition of work by veteran artist Catherine Shober, a nominee for the 2019 Pulitzer Prize, in September. \n\n\nThe National Endowment for the Arts (NEA) announced today that it has awarded $24.5 million to fifty-six arts and cultural organizations across the United States as part of its Treasury for Art and Culture (TFC) initiative. The funds will go toward managing the risks and costs associated with the Covid-19 pandemic and will ensure a robust, nationwide arts and culture program that works across borders, economic and cultural divides, and geographic regions.“The National Endowment for the Arts (NEA) is a central resource for America’s creative and cultural heritage, providing critical support to local, state, and federal arts and cultural organizations,” said NEA director May Boeve. “The funds will help ensure that arts and cultural organizations are able to offer meaningful, direct, and creative services to audiences across the nation, and will help ensure that arts", "The next Biennial should be held in 2024.\n\n\nThe twentieth edition of the Art + France exhibition, held at the Musée nÜvart in Paris since January 2019, will be staged in the French capital from March 7 to March 10, 2020. Its full list of participating artists is as follows:Rayyane Hashim, New York; Steve Blum, New York; Bénédicte de Montlaur, New York; Bénédicte Szalay, New York; Vito Acconci, New York; Leila Barakat, New York; Paul Akerlof, New York; Tanya Barchuk, New York;and Bernard Bauret, New York.The forty-fifth edition of the Concept + Art Fair, held at the New Museum in London from March 16 to March 18, 2020, will be held at the same venue in April 2020. Its full list of participating artists is as follows:Hélio Naidoo, New York; Anish Kapoor, New York; Michael Pertel, New York; Amalia Porruti, New York;and Sam Sargent, New York. \n\n\nA contingent of art-world professionals", "The next Biennial should be held sometime in 2020, and the exhibition should resume in 2021. \n\n\nAlexandra Dillman, a curator at the Museum of Fine Arts, Boston, and a Carnegie Mellon faculty member, has signed an open letter condemning the institution’s selection of two artists, Tunga-Lei and Krisha George, for the 2019 Art of the Party, an annual award presented by the museum. The award is one of the few major awards that honors non-Europeans and is given annually to a contemporary artist from the Americas\u0097Dillman will withdraw her statement when the institution reconvenes in March.If the letter is considered a statement against the museum’s decision to include artists from the Americas in the biennial, which was met with widespread protests from arts professionals and activists last year, Dillman writes: “I refuse to engage in ‘Europe’s politics\u0097I refuse to be complicit in a racist, colonialist, imperialist project. I refuse to acknowledge the history of dispossession and dispossession-related violence that is embedded in the exhibition. I refuse to acknowledge the structural racism that is reproduced in the exhibition. My protest is not limited to the exhibition; it extends to the", "The next Biennial should take place in 2021. After the exhibition will be organized by the Helsinki Art Foundation. The first exhibition of its kind will be held at the exhibition hall in the Estonian capital in 2021. The museum has also received an expansion project for the museum. The new building will accommodate six hundred more works and will be built on a site originally developed in 1972. This exhibition is part of an initiative to advance the cultural importance of Estonia, which is currently ranked fifth in the world by the Art Newspaper. The program of the exhibition will include a retrospective of the work of the artist Ulla and the Italian designer Loredana Visol, as well as a presentation of work by the contemporary artist Saara Nowak. The museum will also host a presentation of the work of the artist Željko Vanta, a member of the Czechoslovakian collective Im Vanta, in 2019.\n\n\nIn a recent letter to supporters, the Metropolitan Museum of Art in New York urged them to send in-kind donations of art and other objects to the institution in support of its ongoing fundraising efforts. The letter, which was written by museum director Christopher Wool, was sent on August 25 and addressed to recipients Christopher D. Powell", "The next Biennial should be on January 24, 2021, with the exhibition, titled “The seventh biennial,” scheduled to run from February 27 to March 2, 2022. For the past year, artist-activists have been fighting for the overhaul of the 2020 edition of Art Basel Hong Kong, which has faced a boycott by major museums in the United States, Europe, and Asia. Among the artists who signed an open letter protesting the event’s cancellation by the Hong Kong city council on February 9 were Cao Xiaofeng, Fan Xiaofeng, and Wenwuang Yu. On February 14, the Hong Kong government announced that it would postpone the event in an attempt to calm the ongoing pro-democracy protests in the city, which have rocked the region since last September. A spokesperson told Artnet that it would “move forward with the 2020 Art Basel Hong Kong and Art Dubai in the interests of the Hong Kong community,” but the partnership has not been officially suspended.\n\n\nThe Metropolitan Museum of Art announced that it will offer free admission to visitors from January 18 to January 23. The exhibition, “The Adventures of Simon Baron and Eileen B. Williams,”", "The next Biennial should focus on “the questions of sustainability and the body,” Osei said. “The thirty-third edition of the Beijing Fine Art Biennial will be dedicated to the theme ‘Equality of All Things’ and will include new works by twenty-four artists.”\n\n\nSinger-songwriter Madonna, whose storied thirty-year career included the monumental “For a Time Like This” (1985), which portrays a time when humanity is at its most vulnerable, has died at age forty-nine at her home in Los Angeles.The news was announced by her longtime manager, the indie-pop maestro Adam and his mother, Patti. “Madonna was a human being first and foremost, a talented, compassionate artist whose music always made room for others,” Patti told the Los Angeles Times. “She was a joyful presence on stage, singing in her dressing room, and in person. She was the most fascinating person in the world.”Born in Hollywood in 1969, Madonna, who had written to a bemused Adam about collaborating on a song with her before his death, had little interest in making music professionally, instead preferring to embrace the life of", "The next Biennial should be held in the spring of 2021. The exhibition is a collaboration between the museums, the artist-in-residence, and the faculty of arts, design, and design studies. Kunsthal Aarhus is currently organizing an exhibition of the artist’s works in the next few months. “The future of art is a very important moment for our nation and the way we live our lives. While the main exhibition at the Museum of Fine Arts (MFA) in Denmark will remain there, the institution is planning to open a new, different kind of museum in the city. We are also working hard to research how the art of our time could be transformed into an art of the future, and explore how art can be a bridge between the past and the future,” said Kunsthal Aarhus curator Henne Janse van Tilborgh. In a statement, the museum said: “The entry of the artist into this exhibition was an entirely new experience for us and a real relief when he was accepted. All our staff and I are thrilled to be able to show him the first works of his series on the water, which will be opened this summer. The work, which is currently on", "The next Biennial should commence in the fall of 2020 and will focus on cross-cultural exchange and the ways that art and architecture interact to form new narratives and new narratives will be shaped by the work of the new biennial team. The exhibition will also introduce new initiatives to enhance the exhibition’s international reach.“I want the new Biennial to be transformative, to be the first exhibition focused on architecture and art in the UK,” said Mark Masuoka, director of the Tate. “The new show is a response to the Biennial 2020, which was an ambitious work of art that explores the relationship between art and architecture’s interwebs, and to the work of the artists whose works were selected for the biennial. I hope that the exhibition will signal the shift in focus of the biennial team, that it will be a significant step towards this.”The new Biennial will be curated by Wolfgang and Rolf Stahl, of the renowned Stahl-Zimmermann house in Berlin; Bernardo Zuniga, the director of the Turin Museum of Art; and Karl Brauer, the former director of the Walter de Graf Collection in Munich, and will take up the themes of “", "The next Biennial should take place in 2021, and the next will be held in 2023.\n\nAndré Speck, the director of the Museum Frankfurt, wrote in an open letter to the museum’s board of trustees last week: “I am happy to announce that the exhibition will go on in 2022 and will continue to work in partnership with the Art Museum Munich and the Freie Universität Berlin to create a new exhibition.” The opening of the exhibition “Enigma of Memory: The Art of Memory,” on November 29, 2022 will be the first time the newly renovated museum will formally welcome visitors.\n\n\nAs the number of people killed in the Paris terrorist attacks climbs to at least 129, and at least 180 people injured, and the number of those who died in the city reaches five thousand, French Prime Minister Jean-Marc Ayrault said on Monday that the country is preparing for a third terrorist attack. Unlike the cities of Saint-Denis and Toulouse, where more than one hundred people were gathered for Bastille Day celebrations in April, the capital of France, on Monday, the streets were empty, with schools, businesses, and government buildings still shuttered. “We don�", "The next Biennial should be held in 2021. \n\n\nThe New York Arts Center (NYAC) has revealed that the museum will be renovated by architect Daniel Libeskind, who is currently the director of the firm Architecture in Motion. The renovation, which will examine the building’s relationship with the Museum of Modern Art, will take place in stages, beginning with the museum’s main building, the contemporary art museum, and the adjacent Rockland Art Museum, and concluding with the building of the Martha Graham Center for Contemporary Art.The project will involve the labor of several teams, including those of the New Museum, the Metropolitan Museum of Art, and the Whitney Museum of American Art. The work also includes the development of a new public plaza in the center of the museum, a second-floor public courtyard, and the construction of new entrance and lobby facades to the institution. After the renovations are complete, the New York’s Museum of Modern Art will open to the public in 2021. \n\n\nThe Art Newspaper has announced that it will publish the first issue of its new monthly magazine, which will focus on a theme of the week, the art world. The May/June issue, which will be published in June, will", "The next Biennial should be in 2021, with the biennial’s theme “Welcome to the Museum,” the museum’s collection, exhibitions, and public programs, and the accompanying biennial exhibition.\n\n\nThe German city of Krefeld, which was controlled by the Nazis in World War II, is planning to open a museum dedicated to the Holocaust in 2020. Construction of the museum is currently underway in the city’s Krefeld district and is expected to be completed by 2021. The new museum will be roughly five hundred thousand square feet and will be housed in a former cattle station. The museum will highlight the Nazi ideals of racial purity, racial inferiority, and racial suicide, as well as the “final solution,” which was Hitler’s rationale for the Holocaust.“Krefeld is already a major center of artistic life in the Third Reich,” museum director Harald Sutke and city councilor Per-Heinz Vossen said in a joint statement. “In addition, the city has been a home for many important cultural institutions in the past but today it hosts a cultural center, a museum, an exhibition space, and a shopping city. Therefore, we had to think", "The next Biennial should be held in the autumn of 2022, and the first exhibition should open in the spring of 2024. The commissioning of the new museum should follow, with the exhibition.The institution will be inaugurated on November 9 with an exhibition of work by the artist Mark Boster, which will include a show of the artist’s artworks from the collection of his father. \n\n\nNew York’s Metropolitan Museum of Art (MoMA) has received a $125 million donation of art from the estate of the late American painter D. H. Lawrence, who passed away on October 12, the same day that the institution’s new collection of his work, which is currently on display in a new exhibition titled D. H. Lawrence: Expectations, was given a major gift on Friday, October 10. The proceeds will go toward the development of the exhibition, “D. H. Lawrence: Expectations,” which will present Lawrence’s works in their entirety, including the only surviving work that he never completed, “TIDAL.” The title refers to the synthesized electronic music made by Lawrence and his collaborators. The work, which is currently on view at the Met,", "The next Biennial should take place in 2021. \n\n\nThe Museum of Contemporary Art (MoCA) in New York has added four new artists to its roster: Ria League, Tony Award–winning artist Pawitja Samant, artist-in-residence Kaelen Tate, and artist-in-residence Jodi Throckmorton.According to its website, MoCA is \"working to establish a new model for collaboration between art museums by providing them the tools to support one another through a Digital Platform that will enable the exchange of works and ideas.”The institution also revealed that it is planning to open an outpost in Singapore in 2021. It will be housed within the Singapore Museum of Art and will be inaugurated by an exhibition that will highlight the work of the institution’s Asian collections. The first show will be on December 2, 2021, at the Singapore Institute of Art. The second show will be on January 24, 2022, at the Marina Bay Sandsaw, and the third show will be on March 24, 2022, at the Singapore Museum of Modern Art.The announcement marks the first time MoCA has sent four artists to Asia. Ria League, who has lived in the United States and Singapore for more", "The next Biennial should be a celebration of the visual arts and will focus on narratives that are more complex and interrelated, such as the history of women’s art, the history of African art, and the history of the visual arts.”In a statement for the Los Angeles Times, Joaquin Almeida, the executive director of the Venice Biennale, said: “This is a very challenging time for the entire art landscape. It is a time of transformation, of disruption, of conflict and of uncertainty. The Art Newspaper in London has asked me to convey our deepest sympathies to the many affected by the work stoppage, and to thank them for their understanding and support. I hope they will write to me and tell me how much they appreciate what I’m doing.”\n\n\nThe Courtyard Museum in New York has received a $10 million donation from the Harlan and Joyce Forrest Foundation. Located at 775 Fifth Avenue in Manhattan, the museum houses the works of seventy-five artists\u0097including Audrey Kornfeld, Claire Ait-Agruen, Robert Irwin, John Jewel, Paul Graham, and Robert Irwin, Jr.\u0097and is currently undergoing a $50 million restoration. In", "The next Biennial should be held in the spring of 2020.\n\n\nThe United Kingdom is preparing to leave the European Union, following months of political turmoil sparked by Britain’s vote to leave the bloc. Prime Minister Boris Johnson said that the government is making no final decisions about its departure, and that no timeline has yet been set. However, on Thursday, May 27, the day Britain leaves the European Union, the government will publish new regulations governing Brexit, which will take effect on July 1.The new regulations, which outline how the United Kingdom will leave the EU, will likely be released as early as this month, and the government is expected to issue further guidance on how to prepare for the departure in June. The government is also preparing to move the UK’s embassy from London to Brussels, a decision that will likely be made in the first half of the month.  In response to the new regulations, Johnson said: “We will be discussing the future relationship with the EU in more detail when we begin the process of withdrawal. . . . I would expect that, once the process is complete, the government will announce the date and the duration of withdrawal. But I would not want to wait that long.”\n\n\nNew", "The next Biennial should take place in 2020 and will include presentations of works by more than seventy artists from forty countries, including the United Kingdom, France, Italy, Germany, Spain, Mexico, and Norway. The second, which will be held in 2022, will focus on the history of life on Earth and include works by young and old. The third, which will be held in 2023, will consist of a combination of art, science, and technology. The concept of a 'biennial of life' is that of the ultimate creation, that of life on Earth and the cosmos. In the announcement, which was made at an event in Paris, the director of the Biennial de l'art et de l'Human, Jacques Perron, said: “Together these triennials become a narrative of the universe, drawn from a variety of sources, from the humanities and the sciences, from the physical world and from the spiritual world. The biennial of life creates a unified face of the universe. The exhibition of this face represents a narrative of the history of life on Earth, and you can experience this history with us.”\n\n\nThe Metropolitan Museum of Art in New York has announced that it is currently working on", "The next Biennial should be held in 2021. “The team’s decision to put their creative energy into building the exhibition was not taken lightly, nor was it a matter of excluding other proposals,” said Mackay. “We think we have created an exhibition that is very different from anything that has come before in the exhibition space and in the art world.”The museum had previously scheduled the biennial for 2017, but canceled the event in February 2018, citing the pandemic. The gallery had previously argued that the decision to postpone the exhibition was made in the interest of both Saskatoon’s arts community and the city of Saskatoon. In a statement provided to Artnet, Mackay lauded the gallery for their work in addressing the exhibition and its proximity to the city, but said that the exhibition could have been organized better.“It is important to note that the decision to postpone the exhibition was not made lightly, nor was it a matter of excluding other proposals,” Mackay said. “We think we have created an exhibition that is very different from anything that has come before in the exhibition space and in the art world.”\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles,", "The next Biennial should take place at a location that represents the soul and mind of the East. . . . There must be an element of surprise and discovery that is new to us.” The theme of this year’s edition of the festival is “dimensionality.” In the past, the theme has evoked the concept of a “dark dimension”\u0097a subjective perception in which the body is reduced to nothing but matter. This year’s theme, “time,” is a metaphor for the human condition\u0097a representation of the unpredictable nature of life.The other themes of the show are “the laws of physics and the laws of the universe,” which reflect two of the most fundamental questions in physics: Why does matter exist and when does it start and end its existence? The second theme, called “memes,” is an attempt to push the boundaries of art with the intent of demonstrating how art can construct, shape, and alter the world around it.The full list of participating artists is as follows:Alan I. GuggenheimCoachella Valley Music and Artists’ WorkshopDanny Brown’s “31st Century” (2017", "The next Biennial should take place at the Museo de Arte Contemporáneo, in the city of Santiago, Chile, in 2021. The tenth edition will be held at the Palacio de Arte Moderna, in Madrid, Spain, in 2022.The Biennials de Arte Contemporáneo (BAC) and the Museo de Arte Moderna (MAM) in Madrid were founded by the Spanish architect Jorge Luis Pérez-Puig, and the Chicago-based artist Rania Marmara-Santiago, in 2007. In 2009, the BAC and MAM, respectively, received the Paris-based firm Groupe Brasil. \n\n\nThe B.M.I. (Boston Museum of Art) has added fifteen new artists to its roster: Andrea Bocelli, Rachel Chaudhari, A.J. Hoffa, Ewa Michalek, Hanuka Moberg, Anna O. Maric, Maria Polotti, and Sophia Salin. Among the commissionees are Christo, who was previously the founding curator of Italian Modernism at the Los Angeles County Museum of Art; Sara Caso", "The next Biennial should focus on the philosophical and practical aspects of photography, and its relationship with contemporary society; it should also consider the artistic possibilities of photography as a medium, and how it might be adapted to present the philosophical issues raised by the exhibition in its first edition.\n\n\nThe Serpentine Galleries in London announced today that Sarah Peck, who has served as the curator and head of the Department of Photography at the Serpentine for twenty-five years, has been appointed its next director. Peck will assume her responsibilities on January 5, 2020. Peck succeeds Catherine Crutchlow, who led the department for photography at the Serpentine for thirteen years and will assume her responsibilities in January 2021.“This is a very exciting time to be a leading museum curator and to become the next director of the Serpentine Galleries,” Peck said. “It is a testament to the great depth and breadth of our collection, the breadth of our outlook and our ability to create a new language of art from art and photography, and to the continuing influence of the legendary Rachel Whiteread. I am delighted to lead the way forward with my colleagues, with a strong and ambitious vision for the future of photography.”In her new role, Peck", "The next Biennial should be held soon. “The Art of the Future’s' agenda is to understand the art of the present and to create opportunities for future discussion and changes,” said Elena Kambayeva, director of the Simony Museum of Contemporary Art in Moscow. The XVIII Biennial will be organized as a seminar series led by Yulia Gavrilova, the founder of the Brussels-based studio L'Arbre d’etre, and will feature work by twenty-two artists: Nadezhda Guseva, Lennart Novik, Nikolay Svetlakov, Boris Rodchenko, Yoroshkevich, Katerina V. Ninnikova, Diane Duvall, Pia Camil, Andrea Fusi, and Sara J. Quintana.\n\n\nAs the coronavirus continues to spread throughout the world, the Museum of Fine Arts (MFA) in Seattle is working to increase precautions for visitors. On Wednesday, April 3, the museum said that it is increasing the number of protective wear and masks worn by visitors and has also introduced new educational programs about the virus", "The next Biennial should be held somewhere in the world in December 2019, and the exhibition should be relocated. The art will be unveiled in New Delhi in December 2020.\n\nThis year’s edition of the Istanbul Biennial, which was canceled owing to the coronavirus outbreak, was postponed until at least March 22. The event’s opening was also pushed back, to June 25, the date of the previous iteration, which was also canceled due to the coronavirus epidemic.Following a meeting of the delegations from the participating countries in Istanbul on March 24, organizers said the reinstallation of the pavilion will take place on June 22, with a preview day on May 22. The pavilion will be inaugurated by a statue of General Suharto in the capital.The pavilion will be inaugurated with a performance by the Turkish artist Fetish, who was chosen by an international jury to represent Turkey at the Venice Biennale in 2013. Fetish was asked to create a work that embodies the essence of modern life, and create a new narrative for the pavilion. “This job is a challenge to the limits of what art can be,” Fetish said in a statement. �", "The next Biennial should be held in the spring of 2020, with the aim of providing an exciting new platform for the work of contemporary artists, and is currently preparing for its first exhibition.\n\n\nThe Los Angeles County Museum of Art (LACMA) is teaming up with Procter & Gamble to create a new public space in the city for artists who are working toward their careers and whose work recently won the Pritzker Architecture Prize.The partnership’s inaugural biennial, “Expectations of the Museum,” will take up the themes of the future and of individual artists’ practices. The inaugural exhibition, titled “Being All Things to All People,” will be curated by David Albright-Reeder, who previously served as deputy director of the Whitney Museum of American Art, and will be open to the public in 2020. The first show, titled “We Are the Children of Tomorrow,” will livestreamed on Instagram on May 13.The biennial will be sponsored by USAA’s LACMA and is organized as part of a larger plan to build new public space in the city. The expansion of the county’s arts and culture ecosystem will also include", "The next Biennial should take place in 2020. The theme will be “The Art of Cruelty.”In a statement, the Biennial said: “We are excited to continue our work celebrating the work of Joan Mitchell, Michael Hansa, and their contemporaries by developing new and understudied materials and creating new treatments that reflect their prescient contributions to the art of cruelty.”\n\n\nThe Solomon R. Guggenheim Museum in New York has appointed John Mackey as its next director. He succeeds Barbara Morgan, who was dismissed from the post on November 23 after a year and a half. Prior to joining the institution in 2005, Mackey served as director of the Brooklyn-based nonprofit arts space the Groundwork, where he curated seventy-one exhibitions over the course of a decade.“John has been a visionary curator since he began at the Groundwork in 2008, and we are grateful for his years of service to the museum, as we have had the privilege of collaborating with him and on many projects,” said Barbara Morgan. “His curatorial approach has guided our exhibitions and our strategy for the museum, while putting the museum on the cutting edge of art strategy. John brings an already-well-des", "The next Biennial should celebrate the contributions of French and Italian modernists, the work of West African artists, and the importance of indigenous art in the exhibition. The programme would also include three performances of work by artists who are from Africa, the Caribbean, or South America.The Fall Biennial will be held in Lyon, France; Los Angeles, California; and New York City. The year 2020 will be chosen based on the theme “In the Place of the Artists.” The exhibition is named after the artist and poet Jean-Paul Sartre’s final words at the hands of a French court in the city of Lyon: “In the Place of the Artists.” The biennial will have a grand opening on October 5, 2020, at the Louvre, with a retrospective of the work of Brazilian artist Íñigo Bezerra, an exhibition of the work of Italian artist Alessandro Cipolletta, and a presentation of work by Sara and Zoya Al-Khalil.The art of the four artists is featured in an exhibition of the same name by Philippe Boudin, which will open at the Gallery of Modern Art in Paris in January 2021. The exhibition is curated by the French director Did", "The next Biennial should focus on ways in which art and design intersect with contemporary life. The workshop will be held at the same address as the museum. The new venue will be inaugurated by an exhibition of work by the artist and his associates, titled “Art of the Body.” The group will be represented by the Italian firm Mediatrix.The first exhibition of the biennial will open in the autumn of 2020. Conventional views of art and design are undergoing a renaissance, with designers such as Richard Avedon and Istvan Mier emerging as major influencers of contemporary art. For Mier, a curators and art historian, the theme is not “fashion,” but “humanity” and the relationship between man and man, and the body, is central to the narrative of his practice. This year’s event will be Mier’s first in New York City since 1997. “I’m extremely excited to be back in New York,” Mier said. “I’ve spent the last eighteen months building a new career as an artist and a curator, one with an international network, one whose members are active in forty countries", "The next Biennial should also include a special exhibition of work by the Danish artist Harald Sætnig. The event will take place at the Berggruppe Akademie in Karlsruhe on the Potsdamer Straße (Potsdamer Straße is a name given to a group of art-historians who collaborated to create a new edition of the exhibition “Darwin” in 1988). \n\n\nThe 2018 Sundance Film Festival will be held at Camp X, the former headquarters of the American Civil Liberties Union in Los Angeles, on Saturday, January 28, 2020. The Sundance Institute announced that the event will be moved to the Camp X campus from January 29 to February 1, 2020. The announcement followed the announcement that the festival will move to the new $3.3 million Rema Hort Mann Center for the Arts in Santa Monica. The move was expected and was driven by the festival’s move to a new location throughout the year and the need to maintain a direct line to the California Institute of Technology (CalArts) in Pasadena, which has served as the center for the festival since 2007.The festival will now move to the Santa Monica Pier in 2020 and will be held at", "The next Biennial should be held in the spring of 2021.  In a statement, the city said: “The city of Toronto’s commitment to sustainability is strong. We continue to innovate and we’ve done a lot of work to reduce emissions. This year’s biennial will be a big step in that direction.”While the majority of the construction work will be onsite, the museum will also construct a new 300,000-square-foot, expanded public exhibition space at 497 Queen Street West, which will boast a new 250-seat theater, a café, and a rooftop terrace. The project will also include the installation of more than 1,600 new works, including works by the Brazilian Alexandre Althuis, the Chilean Ron Gorchov, and the Nigerian Nuri Bilbao.The new pavilion will serve as the centerpiece of a $125 million overhaul of the city’s waterfront. The $175 million renovation of the Rideau Canal and the $150 million redesign of the Rideau and Lawrence Avenue subway stations will also address Toronto’s air quality. The design also aims to improve the riverfront by adding more public art and public spaces, such as a", "The next Biennial should take place in the spring of 2020.\n\n\nThe Museum of the African Diaspora (MoAD) in Atlanta has appointed Keb Boroubas as its next executive director. Boroubas comes to the institution from the Atlanta-based nonprofit Georgia African Diaspora, which operates two museums in the city: the Diaspora Museum and the African Museum of Art. He succeeds Leslie Hofstede, who retired after more than sixteen years at the helm of the museum in January 2020.“We are thrilled to welcome Keb to MoAD,” said museum director Stacey Hill. “Keb brings decades of experience and a proven track record of achievement in leading major museum organizations across the country, and we believe him to be a person of deep integrity and vision. Keb is a true visionary and accomplished educator, and we are confident he will continue to shape MoAD’s future direction and legacy.”Prior to joining the museum in 2015, Boroubas served as a curator at the Atlanta Museum of Art and as a guest lecturer at the University of Georgia. He also worked as an independent curator at the University of Tulsa and as a freelance curator. Among his curatorial projects are the second solo", "The next Biennial should be called for “Art, Power, and Politics.” The third must be dedicated to history, and the fourth to the artist. The deadline is March 27.\n\n\nThe Gallery of Contemporary Art (GAFA) in Los Angeles is reopening to the public in an attempt to rebalance its exhibition halls with more contemporary art. The institution announced on March 10 that it will create two new curatorial roles. One will work in a contemporary art setting and the other will focus on old-school Americana. The new positions are part of an initiative to draw attention to the legacy of American business in an attempt to give some of the country’s largest corporations more exposure in the city.“This is an invitation from the community to try new things and experiment with new approaches to exhibitions,” said museum director Klaus Biesenbach. “We have to think of the future as more like a museum, and not a museum of the past.”The changes were made in the administration of chair Patricia Kelly. Previously, Kelly served as president of the California Association of Art Museum Directors (CARM), which represents 10,000 museums across the state. During her tenure at the helm of the Pasadena", "The next Biennial should be ready in February 2020. A 2022 event is also being planned.  While the institution is not currently planning to hold an exhibition of the work of the contemporary artist Isabel Allende, a forthcoming retrospective titled Eternal Life will feature the work of artist-activists Carla Álvarez Barba and María Berrío, and will be curated by Eduardo Paolozzi.\n\n\nThe Institute of Contemporary Arts, Miami (ICA), has announced that Mia Ortega, who has been a MacArthur Fellow since 2015, will join its staff in February 2020. Ortega will serve as an associate professor of art and design at the school, which was established in 1966, and will begin her tenure in January 2021.“Mia and her husband, Anton, have been a remarkable team, fostering the potential of the art faculty, the art industry, and the academic community through their vision to create a museum dedicated to modern and contemporary art,” said John Harsha, president of the school. “Their work in supporting this mission demonstrates the university’s commitment to supporting the art and design communities of Miami. We are grateful for their efforts, and are confident that their impact and excellence", "The next Biennial should be held at the Museum of Fine Arts in New York in 2021.\n\n\nThe Walt Disney Company and the Los Angeles County Museum of Art (LACMA) announced that they have reached an agreement to jointly develop digital content for the upcoming two-part exhibition “Between the Sun and the Moon: A Contemporary Art Story,” which will run at the Los Angeles County Museum of Art from September 20 and September 22, 2021. The partnership will allow the Los Angeles County Museum of Art (LACMA) to create a new multimedia experience for the upcoming exhibition.“We’re excited to help LACMA and the city of Los Angeles develop a new digital experience that will engage with the Los Angeles region and the world,” said Jerry A. Disney Jr., the chairman and CEO of Disney. “Each institution will have the opportunity to share their vision for the show across their digital platforms, and we’re confident that LACCA will deliver an engaging experience that engages with the Los Angeles region and the world.”The partnership between the two museums was first announced in 2017, when the two museums began working together on a project to create a new installation for the exhibition. The project, titled ", "The next Biennial should be in 2020. The question of when the exhibition should start again remains open. “The exhibition is an extension of the work and life of the museum,” Lutz Brugge, chair of the Board of Trustees, said in a statement. “It is now our task to focus on the future, with a view to ensuring the exhibition will survive into the next century.” The inaugural exhibition, “The Exhibition of the French in the United States” (2019), staged a remarkable array of artworks, including work by Pierre-Auguste Renoir (1936–1948), which was on display in “The Display of Modern Art in America” (2019); and “Los Angeles’s Contemporary Art Museum” (2019), which featured works by Pierre-Auguste Renoir Jr., Willem de Kooning, Alighiero Modigliani, and Robert Koyim. In addition, a special exhibition of works by American artist Frank Gehry will open at the museum in September 2020. In the December 2018 issue of Artforum, Mark Bittman wrote: “All eyes are on Los Angeles for a", "The next Biennial should take place in the city in 2021 and is currently on track to open in 2021.\n\n\nMiriam A. Baron, the British cultural philanthropist, who established the Sculpture at a Time program to support American artists in the 1950s, died last week at her home in London. She was ninety-four years old.Born in London in 1932, Baron began her career in the United States in the 1940s, working as a printmaker at a British sculptor’s workshop in New York before landing in Los Angeles in 1947. She studied with Paul Graham and Francis Marion, who introduced her to American painter Robert Irwin, and took up the sculptor’s career under the name Sir David Adjay, which she continued in the 1950s. “I never liked the word artist,” she told an interviewer in a 1964 interview with David H. Koch in the New Yorker. “I think of it as an extension of my own life.” The artist maintained a practice in Los Angeles through the 1970s, when, with her husband, she relocated to the California coastal city of Santa Barbara. Her work has been featured in the Whitney Biennial, the International Association of Art Museum Directors (I", "The next Biennial should begin October 22 and conclude in March 2021. The exhibition will be led by Gerhard Richter, the director of the Free Museum in Berlin, and Elisabeth Nilsen, the director of the newly-opened Stedelijk Museum. The festival will be supported with a matching donation of two hundred thousand krona ($133,000). The first tour will be followed by an introduction of the exhibition, which will be on display in the museum until January 9, 2021.After visiting the new museum, the public will be able to experience the first full-scale reconstruction of the museum in several hundred years. The exhibition will also include a game, a virtual reality experience, and an exploration of the history of painters. The Biennial will be staged in conjunction with Art Basel Hong Kong. The exhibition will be accompanied by an ambitious restoration and renovation project that will address the structural problems of the museum and will also include the creation of a new public space for the museum. The installation of the  Selected Works of Gerhard Richter’s “The Tower of Babel”, “Beyond the Origin of Plants,” “Arts,” and", "The next Biennial should include performances by artists who were part of the 2014 and 2020 editions, as well as new artists whose works were selected for the first time this year.The 2020 edition will culminate with a performance by the artist-in-residence Joshua Frank, who currently serves as the Biennial’s artistic director. The work, “On the Body,” will be staged at the Biennial’s new residence in Rio de Janeiro, the artist’s new studio in Rio, the Río de Janeiro State Museum, and the Museu de Arte de Rio.The event will be hosted at the São Paulo Cultural Center in São Paulo and will be broadcast on Canal 9. The 2018 edition was held at the Portuguese Embassy in Washington, DC.\n\n\nThe Museum of Contemporary Art (MoCA) in New York has appointed Brian Eno as its next executive director. Eno has been a museum supporter of the institution since 2014, when he was appointed as senior director of contemporary art and design. He currently serves as vice president of the museum and is the author of several books, including The New Museum (MIT) Design: How Architecture and Design Changed the World (Routledge, 2018) and", "The next Biennial should be held in the United States and will convene in Los Angeles in 2021.<|endoftext|>For the last twelve months, a group of artists, filmmakers, writers, and other cultural professionals have been staging actions to protest the trial of George Floyd, a Black man who was killed by New York City police during a confrontation with a white motorist on a bike in Brooklyn last month. “We are not going to take this case lightly,” Amara Darwish, a cofounder of the #BlackLivesMatter movement, told Artnet. “We are not going to let this case be about money or a car, it’s about something much bigger than that. We are going to show the world that we are Black, that we are resilient, that we are willing to take any kind of action necessary to secure Black lives.”Darwish, who was inspired to organize a protest after seeing a tweet criticizing the police that was signed by more than two hundred people, described the protest as “last minute” and “staged.” She said that organizers had not authorized the protest, which was organized in part by phone, email, and letter. “We are not here", "The next Biennial should take place in January 2021.\n\n\nUS District Court Judge Katherine Forrest has dismissed a lawsuit brought by New York’s Museum of Modern Art (MoMA) against the institution after it declined to move forward with a public art project in the city’s Central Park, citing the court’s “serious concerns about the precedent set by the Court’s prior decisions.” The lawsuit, which was filed in April 2019, had challenged the renovation of the park, which was completed in 1999, as well as the Museum’s planned third exhibition there, “Theatrical Response.”The court dismissed the case, which was filed by the Alliance Defense Fund, on February 3, following a hearing held last week. The museum made the ruling after a lawyer for MoMA argued that the court had established its own “final judgment” in favor of the institution, thereby eroding the transformative powers of the landmark in the process.“We are disappointed with the outcome, but not surprised,” Michael Govan, a lawyer for the Alliance Defense Fund, said. “The court simply concluded that MoMA did not intend to alter the work’s previous location in", "The next Biennial should focus on the history of the festival’s current edition, which will take place in the city of Biart’s Alsace district from September 21 to October 19. The exhibition’s inaugural edition, “Paris: Vintage and Modern,” will be staged at the Museum of the History of Art, New York, in September, and a biennial of an unknown artist will be staged at the Art Gallery of Ontario, London, in September 2020. \n\n\nThe Museum of Fine Arts (MFA) in Boston announced today that it will become the first major American institution to welcome visitors back to its campus in the aftermath of a major disaster. After the November 11, 2012 incident at the Boston Marathon, when two bombs exploded—one at the finish line, and one near the finish line—the museum began a process of reopening its grounds at the intersection of Boylston and Massachusetts avenues. The project, called “Boston Strong,” involved the installation of more than 1,500 green and white ribbons, the reopening of the museum, and the reopening of the Roxbury neighborhood, which serves as a popular stopover for visitors from Boston.The ribbon-cutting ceremony took", "The next Biennial should be held in 2020.\n\n\nThe museum’s board of trustees has decided to hold a special meeting to discuss the future of the soon-to-be-demolished Institute of Contemporary Art (ICA) in Germany. The decision has been made on the recommendation of the board of curators, comprising Fabian Kallmann, Hans Joachim, and Beatrice Blums, and was made in light of the recent events at the ICA, which has been closed since January 24 due to the coronavirus outbreak.“The ICA is at a critical crossroads,” board chair Bernd and Margot Haag told the Art Newspaper. “We need to consider the long-term success of the institution in order to protect its future and, consequently, its staff. We also need to think about the future of the Institute of Contemporary Art (ICA) Berlin, which is currently preparing for its first reopening in twenty years. The ICA Berlin is important for the future of Germany’s art scene. We cannot, however, discuss the upcoming reopening of the ICA in Berlin without first discussing the future of the ICA in Munich.”Museums and cultural", "The next Biennial should be organized by the same talented and dedicated team, but perhaps in a different format. This is the only way to create an open place for experimentation and experimentation.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is preparing to welcome visitors back to its campus in 2020, following a major refurbishment, and is preparing to launch an online-only, free public art museum experience. The futuristic center will also introduce a new kind of ticketed event space, a public art garden, and a new collaboration platform, which will allow visitors the opportunity to create a virtual experience of the museum—by sharing your interest in art and your own unique vision.“The reinstallation project, which was funded by a $1.5 billion gift from philanthropists Guggenheim Family Foundation and Michael Walker, is part of MoCA’s larger plan to engage with the community through new art and new ways of thinking about art. We are thrilled to see so many people excited about the future of MoCA and the work of William Eggleston and his team, and excited to listen to their visions presented in a new context.”Commenting on the project, MoCA director Ming-chi Chen said:"]