["The next Biennial should be held at a location that provides safe and convenient access to the festival, such as the Bodleian Library, or the Broad, or the National Museum of Art. Our list of locations for future editions of the Biennial is growing, and we look forward to welcoming you to the event. \n\n\nIn an attempt to contain the global outbreak of Covid-19, which has caused an unprecedented number of coronavirus infections, the British Museum (BMI) in London is temporarily closing its four galleries in the city. The museum, which has been closed since March 14 and will reopen in the coming weeks, announced on Monday that it will begin phasing out its commercial activity from April 15 through April 20, 2020.Due to Covid-19, the museum has been forced to temporarily close and has had to move the twenty-third edition of the Biennale of London, which was originally scheduled to take place in April, 2020, to April 23. The event was originally scheduled to take place at the city-owned Tate Britain from April 17–April 20.Mike Fries, the chief executive of the museum, told the Art Newspaper that the institution was “working hard to make sure we’re fully compliant", "The next Biennial should be on April 6.The Art Newspaper reports that the next edition of the Biennial will take place from March 8 to March 11, 2020. It will be hosted by the Hirshhorn Museum in Washington, DC, and will be organized by director Ali Emad. The museum will be hosting a series of exhibitions organized by artists and institutions in cooperation with the International Committee for Museums and Collections of Modern Art (ICAM), a network of sixty-five museums and dozens of galleries. The event will be attended by both curators and artists and will be co-organized by the Hirshhorn. The event will be staged in conjunction with the opening of the New York–New Haven Biennial. “When I started this project, I wanted the biennial to be a place where contemporary art could be taken as a whole, and to be able to explore the possibility of how art can reach beyond its own people,” said Emad. “The Hirshhorn Museum is synonymous with contemporary art. I’m looking forward to presenting the Prince of Persia–inspired exhibition through its history as a landmark location for art and a place that will inspire all of us to think and act differently.”The institution", "The next Biennial should be held in Helsinki in 2022 and will be led by the Swedish curator Jo-Lene Nygren. The event will feature more than one thousand works by artists from the two continents.\n\n\nThe San Francisco Museum of Modern Art (SFMoMA) will soon have a new chapter dedicated to the African diaspora, titled “Black Perspectives.” The exhibition will focus on African art from 1966 to 2019 and will feature artwork by thirty-five artists, including Beyoncé, Jennifer Kiye, and Nandi Ndzube. The full list of artists represented in the show is as follows:Bena ZuluYakubuwa Zulu and Hezekiah Mpagi Sepuya (1962)Baba Dia (1966)Baba Dia: The Life and Death of a Black Man (1967)Baba Dia: A Black Man in His Bed (1968)Baba Dia: Avant Garde (1969)Baba Dia: The Life and Death of a Black Woman (1971)Baba Dia: I: The Ami Bawa, or African Woman, (1972)Baba Dia: I: The African Woman (1973)Baba Dia: II", "The next Biennial should be held in 2021.\n\n\nThe governor of California, Jerry Brown, has appointed Martin Wechsler as the state’s next commissioner of public arts and antiquities. Wechsler comes to the agency from the Los Angeles County Museum of Art (LACMA), where he has served as deputy director since 2013. He succeeds Mary Anne Carter, who announced last month that she plans to resign in August 2019 and take up a new position as chair of the board of trustees of the San Francisco Museum of Art.“We are grateful to Governor Jerry Brown for nominating Martin Wechsler to this important and important role as commissioner of public arts and antiquities,” said Governor Brown. “His proven track record as an advocate for our great museums and his positive vision for the future of our public lands and the California Dream are a clear signal that he has the vision, the leadership qualities, and the vision to ensure these great treasures of our state’s history are preserved and reburied in the great state of California.”Wechsler will assume his responsibilities at the San Francisco Museum of Art on August 1. Carter will remain involved with the institution as chair of the trustees until the end", "The next Biennial should take place in the spring or summer of 2021. If the plan holds and the project is completed as suggested, the five-hundred-and-eighty-eighth edition of the ADELPHI-Boston Art Biennial will be held in March 2021. The announcement followed the announcement of a new $5 million grant from the DonorsChoose Foundation to advance the development of a new edition of the Biennial. The grant will also support the creation of a new digital platform that will allow Boston artists to share their experiences and will curate a series of talks, art exhibitions, and events.The new edition will be organized around a theme of the twentieth century, with a particular focus on issues of immigration and politics. The project was inspired by the ADELPHI-Boston Art Biennial, which is slated to open in March 2021 and will feature works by thirty-one artists, including John C. Scott, Anselm Kiefer, Jodi Ralph, and Kyle Lowry, among others. The five-hundred-and-eighth edition of the Biennial will be held at the Dominion, the former site of the Boston Navy Yard, on Boston Common, in March 2021. The", "The next Biennial should be held in the summer of 2022.\n\n\nThe National Museum of Fine Arts (MFA) in Athens, New York, has appointed Lina Esposito as its new curator of medieval sculpture. She will take up the new post in the spring of 2020. Esposito is an American scholar who has taught at the academy in Athens since 2009. She is the author of several books on the art of medieval sculpture and the medieval Near East, and was awarded the Ig Nobel Memorial Prize in 2014.“Lina is a scholar, a scholar of art history and an educator, and she has been a mentor to many students in the museum,” said Matthew Ellis, director of the MFA and chair of the board of trustees of the National Museum of Fine Arts. “A scholar of medieval sculpture, she is committed to the museum’s mission of serving the history of art and the people of the Middle Ages, and has made a distinguished career of her teaching.”In her new post, Esposito will work closely with Sarah Rizzo, the museum’s curator of medieval sculpture, to bring to light works that will be included in the upcoming exhibition “The Late", "The next Biennial should take place in 2020 and the last one in 2024. It will also include a retrospective of the festival, which will run in full from May to November 2020, and will feature the work of twenty artists, including Mario Lippi, Alejandra Banderas, Alejandra Pilar-Castillo, isola, Melissa Oehlen, and Kiki Smith. If the museum’s original goal of hosting five events is met, it will also be able to increase the number of participants from thirteen to twenty-eight, creating a total of sixty-two artists for the inaugural edition.The museum also revealed that it will be giving away fifty-five special exhibition pieces by twenty-five artists, each of whom is known for their exhibitions at various cultural spaces, including the Garbuzzo Gallery in Venice, Art Sa-Sa in New York, and Art Paris. The first prize winner is Lagina Gomes. The artist is known for her series of sculptures, portraits, and animations.In celebration of the prizes, the museum will dedicate an entire floor of its new headquarters to the biennial. The new museum will also take the space of the old Garbuzzo Gallery, which has a permanent collection of over six", "The next Biennial should focus on strengthening the institutions’ pedagogy, on the promotion of creative, social, and political practice, and on the development of its visual arts. After the biennial is over, the Institutions and the public will be able to enjoy a retrospective of the work of the artists featured in the exhibition. The tenth edition of the Berlin Biennale—which will be held in 2021—is currently running, with the show opening on September 28.\n\n\nThe Museum of Contemporary Art (MoCA) in Chicago announced today that it is creating three new positions to support performance-based curatorial work across its two venues, the African American Museum and the African Diaspora Museum. The positions will open in October and will be part-time and internationally recognized. The new roles were established as part of the institution’s $4.5 billion capital campaign, “I See You,” in support of the museum’s work on the legacy of the late Dr. Martin Luther King Jr. Inaugurating the African Diaspora Museum, which will be located near the Chicago River, is a new exhibition that will showcase the work of artists from the African Diaspora. In addition", "The next Biennial should be held in late March or early April. The opening of the exhibition will coincide with the opening of the exhibition 'Sensations Japanese Art: Biennials 2004–2019” at the Hirshhorn Museum in Washington, DC.The exhibition will present a retrospective of the artist Ōnoki Hideyuki’s work, which is currently on display at the Hirshhorn Museum, and will include a selection of works from the artist’s studio. Since the work is typically on paper, it will be divided into three parts: “The Present,” “The Past,” and “The Future.” The first half of the exhibition will focus on Hideyuki’s ethnographic practice: “Kimi no Nara.” The second half will be a ‘postcolonial’ exploration of the works of Hideyuki and his collaborators and will include a selection of works from the artist’s studio.The Hirshhorn Museum’s program director, Kate Barker, said: “The Hirshhorn’s program is dedicated to connecting contemporary art and culture with the visual arts, and we look forward to collaborating with the Hir", "The next Biennial should be held in 2020, and the sub-orbital museum would be the first in New York to host the show. Grand Prize winner Rebecca Watson, who was nominated for a Pulitzer in art, is also working on a new work for the exhibition.\n\n\nLincoln Center, a nonprofit arts arts development organization based in Chicago, has received a gift of three works by artist Laura Owens. The three works, which were donated by Diana and Alan Rich, are at the Whitney Museum of American Art, the artist’s hometown, in New York, and are currently on display in the exhibition “Into the Wilds.”The museum revealed the gift in a release on Thursday, April 3. The works were donated by Diana Rich, Alan Rich’s sister, who is the director and CEO of the Triskelion, and her father, Alan Rich Jr., who has extensive experience in the art world. The museum confirmed that they are the works in question and said that the gifts were made in recognition of the Richs’ generosity. The family donated the works in support of the work of other artists and they are currently digitizing the work of another artist, Elizabeth Peyton, who died in 1992 at age", "The next Biennial should take place in the autumn of 2020. Early next year, the National Art Museum in Athens, the Museum of Modern Art, and the Museum of Fine Arts in San Francisco will hold their next editions. The next edition, which will be held in 2022, will be hosted by the Museum of Modern Art in Los Angeles.\n\n\nThe London-based charity Art Fund has pledged $250,000 to help the UK recover from the economic fallout from the coronavirus pandemic. The UK is currently one of the most vulnerable economies in the world as the number of people infected with the virus continues to rise. The charity said the emergency financial support will help the UK through the challenges posed by the coronavirus, which is spread mainly from person to person, and will provide a range of resources, including direct financial aid and crisis loans, as well as the opportunity to hear from funders and learn from their practices. The initiative, called An Emergency Fund for Art, combines Art Fund and the British Red Cross to provide emergency aid to art-lovers across the United Kingdom, including London, the South East, and parts of Northern Ireland. The British pavilion in the upcoming", "The next Biennial should be held in 2020. The 2020 spot will be inaugurated by a presentation of work by Petra Kamin, whose exhibitions include “Cruel Emotions” (2019), “Shadow Play” (2019), and “Myth & Reality” (2019). The 2019 Biennial will be held in the autumn of 2020.\n\n\nThe British Council has released the list of fourteen artists who will participate in the next iteration of the London Biennial, entitled London 2, which will take place throughout March 2020. Created collaboratively by London-based artist-organizers Baroness Maud Land and Andrew Adonis, the exhibition will debut at the Royal Festival Hall in London on March 22 and will run through March 29. Among the artists who will participate in the London Art Festival are Cécile B. Evans, Joan Miró, Douglas Wheeler, Kayode Mascaro, Kimora Osuna, Jovan Polson, Yinka Shonibare, and John Simpson. During its twenty-fifth edition, the event, which will run from March 15–March 21, will be attended by approximately 3,500 people and feature a roster of thirty artists. ", "The next Biennial should be ready by the end of this year, and the first Exhibition should open in the spring of 2021. The board of trustees of the Contemporary Art Museum San Francisco, which was founded in 1972, said: “The next two years will be critical to the museum’s continued growth and success. We take seriously all challenges posed by the latest pandemic. . . . We recognize that we are not equipped to address the challenges of our times until we are fully equipped to address them. When we were organizing the next Biennial, we were faced with a choice between creating a museum dedicated to art and a museum with an endowment. We chose art. Making the biennial a reality requires a dedicated, dedicated, and unified board of trustees. We are committed to working with our biennial partners, supporting them as they navigate this unprecedented global health crisis, and ensuring that this biennial is a success.”\n\n\nThe Library of Congress announced today that two hundred works by American painters of the twentieth century have been added to its holdings, making room for forty-three newly commissioned works by artists of color. The works were selected from a pool of ten years ago by a committee chaired by Ruth Hunt, the chair of the L", "The next Biennial should be held in the summer of 2022.For the Moment: A Reflection of the Medieval World, Art and Literature, 2017, from the Palais de Tokyo, Paris. The next edition will be held in the spring of 2022. The 2019/20 edition, “The Museum of Modern Art,” was staged at the Palais de Tokyo in Paris on April 15–April 20, and was unveiled by the French architect Christian Prudhomme, who said it will include a “statement of remembrance” of the museum’s founder, Henri Pinault, and the institution’s original mission. The exhibition was curated by Jean-Luc Villefort and will include works by fifty-four artists, including Pierre-Auguste Renoir, Édouard Vuillard, Édouard Feliber, Rainer Maria Rupprecht, and Claude Monet; will feature work by twenty-four contemporary artists; and will be hosted by the Paris Opera House.“In following years, we will have the opportunity to transform the museum into a new center of cultural and intellectual life,” said Olivier Marille, president of the Paris-based organization. “", "The next Biennial should be held in the coming months, and will also include a series of exhibitions dedicated to the Asian influence on modern art and architecture, as well as the history of photography. This year’s exhibition will showcase the work of sixty-seven artists, with the inaugural exhibition curated by Alice A. Drozdahl. \n\n\nThe Saratoga Springs Arts and Culture Center in New York City has received a $50 million donation from the Peter G. Peterson Foundation. The gift was made in recognition of the center’s contributions to the arts during the artist’s lifetime, and was made in conjunction with a $50 million fundraising campaign for the arts, which was launched by the foundation in 2017. The campaign raised more than $44 million for the center.“The Peterson Foundation has been a long-standing supporter of the Saratoga Springs Arts and Culture Center, and the organization’s future is bright,” said Ellen Peterson, the foundation’s president. “I’m thrilled that the Peter G. Peterson Foundation will be a major benefactor to the Saratoga Springs Arts and Culture Center. The gift gives us a new opportunity to add new art and culture to the collection and", "The next Biennial should be in New York, at the New Museum. “The exhibition will be a celebration of the work of women artists in the twentieth century,” David McAllister, director of the Biennial, told Artnet. A tribute to Emily Coray, whose work often involves women artists from the African diaspora in the United States, will be presented at the Biennial in December.\n\n\nThe United Arab Emirates has appointed Nima Nabavi as the country’s new ambassador to the United Kingdom. Nabavi is the first native British-born Emirati to hold the diplomatic post, which was created in 1821 and is managed by the British government. She succeeds Miranda Allou, who retired in June.Born in Birmingham, England, in 1930, Nabavi studied art at the University of Kent before discovering the art world at the Dubai Art Museum. She met with British collector Karl Oostra, who introduced her to American artist Ellsworth Kelly, who invited her to live in New York. After moving back to Britain, she met Kelly’s widow, Rita, and became a close friend. In 1962, she married Javed Khan, who raised her and their four children in Dubai. Khan", "The next Biennial should be an exhibition of works that are currently in the collections of many museums and would make excellent introductions to the works whose exhibition is currently on view. The next event should be a presentation of works that will be at least seventy years old. The next art project should be a retrospective of a piece that is currently on view. “This is a moment of great change for art and we are the first to see it in person,” said Raquel Diarra, president of the Walt Disney Company. “We are ready to embrace this and move forward. We are just looking for your help.”\n\n\nThe Museum of Arts and Design (MAD) in New York has launched a new initiative to support artists and designers in the city through a series of events and projects that will focus on intergenerational collaboration and artistic exchange. The initiative, “Advancements in Creativity,” will allow visitors to the museum to create and explore new works by selected artists and will auction the works in the exhibition. The first project will be “Advancements in Design”, which will be open to the public in August. The second will be “Advancements in Media,”", "The next Biennial should take place in the Spring of 2020, at the Far East Museum in Tokyo, and will be the first collaboration between the two museum. The inaugural exhibition will be a selection of work from the Biennial and an exhibition of the work of Daniel de Crescenzo, who has been featured in several works by the artist in the past, including his first exhibition at the Art Institute of Chicago (2011) and his Biennial at the Museum of Modern Art (2016). The museum will organize a public viewing of the exhibition, “Telling Stories,” at the institution in early 2020.\n\n\nThe Metropolitan Museum of Art in New York has been awarded a $100,000 grant from the Art Fund, a New York–based nonprofit foundation dedicated to supporting artists. In honor of the organization’s 200th anniversary, the museum will receive $75,000. The grant was made in 2018.  “Beauty and the artist is at the heart of our lives and it is inextricably linked to the Met, our community, and our city,” said Brad Adams, the director of the Met. The organization received the grant from the Art Fund", "The next Biennial should be held in Dubai, in 2022. Over the years, MoMA has staged twenty-four exhibitions, including the recent “Hidden Treasures: Art in Motion” (2019), which explored the concept of the “object as a living being” and “Ateliers du drape” (2008), which was staged in the glass-enclosed courtyard of the Museum of Contemporary Art in Paris.The Art of Place is a text first published in Paris in 1927, and has been adapted by the author for the stage in several productions. It is one of the earliest works to address the idea of space, and is considered one of the great twentieth-century masterpieces. The title refers to a piece by the French architect Alexandre Bastien, called “Place des Lettres” (The Land with the Trees), that was awarded the Prix d’Art Contemporain in 1976. The Biennial, which will focus on the “anticipation of the individual” and “the result of the individual” and will present six works from the series, “Amber,” “Barbara,” “Beverly,” and", "The next Biennial should take place in 2020 and will be organized as a “bridge between the visual and the physical worlds.”\n\n\nThe Los Angeles County Museum of Art (LACMA) is planning a major renovation of its historic entrance on Wilshire Boulevard. Construction of the $360 million project is slated to begin in the spring and is expected to be completed in the summer of 2021.The centerpiece of the project will be the creation of an exhibition space that will showcase the work of twenty artists, including Hélio Oiticica, Carlos Puig, John Paul Jones, Richard Meier, and Laura Owens. The museum will also introduce a new public sculpture garden that will include thirty new works by thirty-five contemporary artists.“We are thrilled that this monumental project will mark the opening of our new museum in the heart of Downtown LA,” said LACMA director Eric Rosenfeld. “It is a singular moment for the city of Los Angeles and we are confident in the vision this group and this institution has to present unique worlds that are open to the public.”The renovation of the building, which is currently undergoing an expansion that will deliver a new forty-three-story, will be completed in stages, with the", "The next Biennial should take place in 2023, and the first in 2029. \n\n\n\n\n\nArt in Motion: Stories and Performances, 2018. Courtesy of the artist/Getty. \n       \n\n\n\n\nThe Whitechapel Gallery in London is revamping its exhibition space in an effort to become more welcoming to those from underrepresented groups. Titled Art in Motion: Stories and Performances, the specialty show was founded by artist and curator Alexandre Breton in 1977 to counter the growing influence of white artists on the public art world. The biennial currently organizes six episodes a year and has played host to some of the most celebrated works of the twentieth century. The show will now be presented by Breton in collaboration with Adrian Piper, the director of the Blackfriars Gallery, Blackfriars, and the Solomon R. Guggenheim Museum.The Bristol-born artist is known for his participatory projects such as The Long March and The Laundromat, both 2012 entries in the prestigious London Art Biennale, and The Box, 2009, a series of drawings by Breton and Philip Glass, the director of the Serpentine Galleries, London", "The next Biennial should take place in 2020. The full list of participating artists is as follows:• A. I. Lewis & Clark, The Wonder of Life at Large (1954)• A.I. Lewis & Clark, Huckleberry Finn (1952)• A.I. Lewis & Clark, The Eternal Bird (1954)• A.I. Lewis & Clark, The Delicate Games of Life at the Circus (1953)• A.I. Lewis & Clark, The Water Tower at the Circus (1952)• A.I. Lewis & Clark, The Spaceship, Part I: The Solitary Life of Man (1953)• A.I. Lewis & Clark, The Spaceship, Part II: The Living Life of Man (1954)• A.I. Lewis & Clark, The Spaceship, Part III: Still Life and Sea Around Us (1954)• A.I. Lewis & Clark, The Spaceship, Part IV: Freedom in Space (1954)• A.I. Lewis & Clark,  The Cave, Part I: The Cave of the Sycamore:", "The next Biennial should have a new director, consisting of nine current or former staff members and a board of directors made up of representatives from both the arts and the sciences. The museum also plans to establish a new endowment to help support the cultural development of the museum and to enhance the collection.The announcement of the 2017 edition of the Biennial drew immediate criticism from some who saw the move as an attempt to silence the organizers. However, the museum settled the controversy by appointing Alison Storey, the director of the Centre Pompidou in Paris, as the new executive director. According to The Guardian, the institution has since welcomed more than seventy thousand visitors and has reworked the exhibition format to reflect the changing needs of future generations.The new chairman, Pierre-Yves Peillon, said: “We have managed, through a global network of partners and external experts, to adapt certain themes and collections for our panel art exhibitions and to present them in a way that allows the widest possible audience. In order to achieve this we needed to rearrange the exhibition. The result is a new and interesting catalogue that is as contemporary as possible.”The new exhibition, “In Praise of the Most Beautiful,” will focus on the history of", "The next Biennial should be staged in 2021, the latest by Haus der Kunst, which will also be referred to as the Den Haag Biennale, in 2021. The Den Haag Biennale is a contemporary project, organized in collaboration with the city of Copenhagen, that was originally planned for 2019. The institution said that it will continue to present the show in a variety of ways, including live events, documentaries, and translations. “The Trump administration has made clear its intention to withdraw from the Paris Climate Agreement, and we are concerned by the decision of the European Union to follow through on that pledge,” Katja Schipper, director of the Biennale, told Artnet News. “The Danish government has stated that any climate agreement that does not address climate change must not be ratified.”The Danish People’s Party (Denmark Democrats) and the Danish People’s Party for Climate Action (Denmark People’s Party) also recently announced that they plan to challenge the Copenhagen Accord, which is currently being reviewed by the United Nations. According to an Artforum report published yesterday, the Democrats plan to stage a protest outside the Danish Embassy in Paris on Thursday,", "The next Biennial should be organised as a single entity, with a single director, with a single budget, with a single artist, and will be a joint endeavor between the Böker Museum Berlin, the University of Kassel, and the Museum for Contemporary Art, Shanghai.\n\nSince its founding in 1960, the Böker Museum Berlin has been one of the few cultural institutions in the world dedicated to the collection and preservation of German Expressionist painter, sculptor, photographer, and film director Elisabeth Bünther. Böker Museum Berlin and the Kunsthalle Kunstbau in Frankfurt have partnered to preserve Elisabeth's art, among other works, for posterity. The institution acquired the estate of the late artist in 1999, and it has maintained a partnership with the estate since the mid-1990s. The partnership between the museum and the estate began when Franz Kline, an art historian from the University of Bonn, asked the talented artist to help preserve an early work by her. Her painting Kunsthalle Kunstbau 3, 1965, is currently on display in Kunsthalle Kunstbau’s exhibition “Art of Destruction”", "The next Biennial should be held in 2021. The Biennial of Modern Art, which will be held in the same location as the Museum of Modern Art in New York, will be held in 2021. The Museum of Modern Art and the Metropolitan Museum of Art will hold their next Biennial in 2021 and 2021. The Museum of Contemporary Art San Francisco’s director MoMA chair Monica Iwanami confirmed that the museum’s next exhibition, “Don’t Panic,” will be held in 2021. The 2020 exhibition space, the Art in Motion, will be moved to the seventh floor of the existing building. For the 2019 festival, the museum opened the space to the public.\n\n\nSerious Boston Incorporated (SBI) has announced that Sharon Demir and Peter Wächtler, who have been working together for twenty-five years, will become the next directors of the Boston art museum. Demir is a Boston native and has built a strong reputation in the art world for creating works that reflect her own personal aesthetic outlook. Her recent solo exhibitions at the Museum of Modern Art in New York and the Museum of Modern Art, Boston, are among her best-known works, and she", "The next Biennial should begin in the spring of 2020 and conclude in the summer of 2021, with an exhibition of works by the artist-in-residence, Ko-Man Tse, in the autumn of 2021.“This year’s show has been the largest and most ambitious, integrating more than fifty thousand works, including works from the collection of Vito Acconci, the Italian architect, and many others never showing before in Milan, to create a single exhibition that plays across five continents, with the artist-in-residence as visionary director,” Milan’s director Monir Shah said in a statement. Shah was appointed last year by architect and curator Tilda Swinton, who also serves as director of the Museum of Modern Art in New York.Swinton curated the show “Avant-Garde,” which featured work by eighty-five artists between 1923 and 2009. Swinton, who described the exhibition as a “springboard for future approaches,” received the first prize at the exhibition in 2012 and was chosen as the recipient of the Prix Marcel Duchamp in 2017. Swinton’s husband, Guadalupe Swinton, died last year of cancer, and she is currently", "The next Biennial should be held in Tokyo in 2020 and will feature an exhibition of work by forty-one artists, including Shigeto Nakayama (Kanagawa Pref. 2020), Katsumi Kawasumi (Tokyo Indiegogo, 2018), Shigeto Sakimoto (Tokyo Metropolitan Museum of Art, 2018), and Fumiko Huizumi (Tokyo Science Museum, 2018).\n\n\nThe Italian government is planning to spend more than $1 billion to repair damage caused by floods and wildfires in the country. The Italian government is also facing backlash from some local authorities over its decision to extend the country’s ban on outdoor fires by three years. In March, Italian prime minister Matteo Renzi announced that outdoor fires were now allowed in some areas, including the capital, Florence, and that the ban would be enforced from May 2020 to March 2021.The extension was made possible after Italy enacted emergency legislation in March, which gave the government the power to expand the country’s outdoor fire ban by another ten years. The law also extended the fire-fighting capabilities of the Italian national fire service, which had been severely weakened by the Covid-19 pandemic. The government had declared a state", "The next Biennial should be held at least once every two years, beginning in 2020, and will consist of a selection of contemporary art from Latin America and Central and South America. The exhibition will be organized according to the theme “Por favor: Los mandían opposés” (The Paintings of Salvador Dalí).\n\n\nThe Village Voice, a New York weekly arts publication owned by the Whitney Museum of American Art, has released its list of seventy-two artists who have been selected for this year’s Pulitzer Prize. Selected by a jury comprising Patricia Field, editor of The Village Voice, and Alice Procter, curator of Modern Art at the Museum of Modern Art, and made up of Art Sherman, Marguerite Durand, Omar Sharif, Jenny Holzer, and Evelyn Waugh, the shortlist will be announced on September 23. “The Village Voice focuses on women artists, yet it is not devoid of male artists,” said Field. “Diana Al-Hadid, Mohammad Akram, and Salman Mahmood are outstanding male artists whose work we are eager to see represented in this award. They are not just exceptional but they are essential. They are vital to", "The next Biennial should be held at the Ark-Maḗaʾayām Museum in New York in 2021. A second exhibition, “Theater of Operations: The Gulf Wars” (2019), will open in the exhibition hall at the Museum of Modern Art in a few years. In the meantime, the Museum of Modern Art’s current exhibition, “The Art of Moving Images,” which will be the first to critically address the legacy of the late American painter Robert Irwin, will remain open through March 18, 2020.\n\n\nThe Museum of Fine Arts (MoFA) in Boston has appointed Meghan Hildenhorn as its new associate curator of fine arts. Hildenhorn comes to the institution from the Metropolitan Museum of Art, where she has served as a visiting scholar-in-residence since January. She succeeds Helen Garmon, who was promoted to the role of associate curator of fine arts last month.“Meghan has the potential to be a transformative force in the field of fine art,” said museum director James Cuno. “It’s her passion to bring people together and to create opportunities for them to interact with artists and thinkers in new and exciting ways", "The next Biennial should take place in London in December 2021. The biennial will also include a documentary about art and art history, a play, and an exhibition of work by the artist El-Sayed Ghobash. Ghobash is best known for his work Traveling to New Places: An Exhibition of Early Travel Artists, 1998–2001, a series of exhibitions organized by the British contemporary art historian Richard Avedon and curated by Ghobash.Ghobash’s work has been exhibited at the Museum of Modern Art, London; the Centre Pompidou in Paris; and the Museum of Contemporary Art, London. He is represented by David Garrow Gallery in New York.\n\n\nThe Museum of Contemporary Art (MoCA), London, has appointed John Pant as its next director. He succeeds Caroline Strachan, who led the institution for fifteen years, and will begin his role in January 2020.“John’s background in museums, his provenance, and his professional track record as a curator make him perfectly qualified for this role,” said museum director Maria Balshaw. “His background as a curator and his provenance as the cofounder of the MoCA label", "The next Biennial should be held in 2022. The festival will be located at the Centre Pompidou in Paris (CP).\n\n\nThe Sackler family has announced that it will send $9.5 million to Smithsonian institutions in support of the museum of contemporary art in the Arts (CPA), the Howard Hughes Medical Institute (HHMI), and the Fleischmann-Tropsch Foundation. The donations were made in support of the William Julius Wilson Foundation for the Arts, which is currently working to raise funds to establish a new permanent home for the Sackler Collection and its biennial exhibitions.“The family has been cooperating with Smithsonian museums and foundations for more than sixty years to launch and expand the legacy art of the Wilson family,” said William Julius Wilson Foundation president and CEO Susan Sackler. “The announcement of this major gift comes at a time when the entire world is watching the Sacklers. They are facing numerous lawsuits and investigations, and their holdings are being contested in numerous court cases. The family’s commitment to the legacy of America’s original families and artists is unwavering.”The Sacklers are also working to raise funds for the Museum of Modern Art (MoMA) in New York and for the", "The next Biennial should be a success, but I don’t know. I think we have to adapt in the meantime. We will see.”The first exhibition, titled “Arts of Life,” will open in New York in September and will run through November.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has launched a new digital platform, curated by the artist-run nonprofit the Art Gallery of California (AGCO), that aims to engage with the city’s cultural, educational, and political institutions through an open-ended format that will be guided by the artist.The platform, which will be integrated with MoCA’s existing online museum experience, will allow visitors to explore a range of topics through interactive exhibits, including the contemporary art of color, the history of the arts, and the art of resistance.“Through this platform we hope to create the opportunities for our audience to develop a deeper understanding of the many topics that will be presented to them,” said David Levin, the museum’s director. “The direct connection between the museum and their audiences will allow our artists to engage directly with the communities we serve, and to help local institutions navigate their way through the", "The next Biennial should take place at a venue that considers urbanism and sustainability: a city where people want to live and work. It should be an open platform for discussion and experiments, enabling a comprehensive rethinking of how cities are made. The first exhibition of the new series is slated to open in the autumn.\n\n\nThe end of the 2018 edition of the Frieze London Biennial, held at the Royal Academy of Arts in London, has been pushed back a week due to concerns about the coronavirus. Originally scheduled for March 19–March 21, the event was pushed back a week due to concerns over the spread of Covid-19 and the possibility of a spike in cases.According to reports in the UK, the coronavirus has been contained in at least three localities in the UK, though cases have been confirmed in at least nine others. Among those who have tested positive for the virus are two people who died in the UK and one person who is in quarantine in another country.\n\n\nThe Museum of Contemporary Art (MoCA) in New York has appointed Laura DeSousa as its next executive director. As the museum prepares to reopen to the public in late March, the board of trustees announced that it plans to resign from", "The next Biennial should be held in 2020. The exhibition will be based in the capital of the same name, and will showcase the work of twenty-five artists from thirty-five countries.According to Artnet, the forty-fifth edition of the event, curated by Amelia Peake, will be held in 2021. “The next edition of the Biennial will present a wide range of exhibitions that will reflect the current state of our cultural life during the height of the current global crisis,” said Peake. “The exhibition will also introduce new and exciting topics that will challenge the narrative of the exhibition in a way that will not only reflect the complex issues of our time but will also open up new perspectives and global conversations.”\n\nThe Barcelona Art Council announced today that it has approved the construction of a larger structure for the institution, which is currently housed in a former textile factory in the city of Merida, Spain. It will also create more space for the commissioning of new projects, including a residency program for young artists.The commissioning committee of the Biennial, which has invited eighty artists to Barcelona for the next two weeks, also voted to recognize the initiative as a success. The result is that the construction company,", "The next Biennial should be held in the Czech Republic, in February 2021. The publication of the first edition of the exhibition will take place in the Czech Republic from March 21-March 24, 2021, and the album art of the series will be published in the autumn of 2022. The next edition will be staged at the Prague Castle Museum in March 2021, and the exhibition will run until October 7, 2021.The twenty-third edition of the exhibition will take place at the National Museum of Fine Arts in Vienna from January 20, 2021 to February 19, 2021. The show will be held in both high and low light levels. The first exhibition in the series will be staged at the National Museum of Fine Arts, Vienna, on March 24, 2021. The second exhibition will be staged at the National Museum of Fine Arts, Vienna, on June 12, 2021. The third exhibition will be staged at the National Museum of Fine Art, Vienna, on January 24, 2022, and the fourth exhibition will be staged at the National Museum of Fine Arts, Vienna, on January 25, 2022, for a period of eight weeks.The exhibition of work by Icelandic artist Sigfusdóttir, also known as Álafur Sigfússon,", "The next Biennial should kick off in early spring 2019 and will be led by the Chinese director Zhang Yalai. The exhibition will feature the works of a number of artists, including Peng Li, Xinyi Li, and Xianliang Cai.\n\n\nThe Centre Pompidou in Paris has appointed its new artistic director, Minna Alexandre-Mercier, as director of the sprawling, fifty-five-thousand-work collection. The announcement comes less than a week after the institution revealed that it is planning to open a new twenty-five-thousand-work exhibition concept in 2020. Since the announcement, the Centre Pompidou and the LeMoyne Museum in New York have been working together to organize several shows, including the biennial “The Fairy Tale of the Ancient Land,” which will open at the Centre Pompidou in 2020.The exhibition will be curated by Matt Colligan and will run concurrently with the fifty-fifth and thirty-eighth Summits in the city of Almaty, Kazakhstan, and the newly renovated Centre Pompidou, which will serve as the home for the exhibition. The institution currently has plans to place the show in Almaty’s", "The next Biennial should take place in 2020-21, and the original in 2021. While the twenty-fifth Biennial will follow in 2021, the twenty-eighth will be held in 2022. The twenty-ninth will be held in 2023. The twenty-ninth will be held in 2026. The twenty-ninth will be held in 2029. The twenty-ninth will be held in 2050. The twenty-ninth will be held in 2055. The twenty-ninth will be held in 2067. The twentieth exhibition, “Aarhus Triennale: ΜEksthal,” will be staged at the Artbou Centre until 2022, the Danish National Museum until 2022, and the Danish Art Museum in Copenhagen until 2022. The twenty-seventh Biennial, “Bonhams Contemporary Art,” will be staged at the Svetlana Bahrkina in Frankfurt, Germany until 2021, the British Museum in the UK until 2019, and the National Gallery in London until 2020. The twenty-fifth and twenty-sixth Biennials are being organized by Flædstrup Gallery and Kunsthalle Fre", "The next Biennial should be held in 2020 and will be hosted at the Museu de Arte de São Paulo; the Museu de Arte de São Paulo; the Museu de Arte de São Paulo; and the Museu de Arte de São Paulo. The next biennial will also be housed at the Museu da Arte de São Paulo. The institution has already invited over eighty artists from twenty-six countries and territories to the event, which will be held in the city of São Paulo, Brazil.\n\n\nThe New England Center for the Arts (NEA) in Framingham, Massachusetts, has received a gift of more than eighty works by fifty artists from the collection of the late John Michael Halber and his wife, Nancy, who were previously unknown. The gift includes paintings, drawings, prints, photographs, and installations by artists such as Michael Ondaatje, Barbara Olsz, Sidney and Rosemarie Halber, and Kayode Ojo, as well as a selection of works by artists whose work is currently on display in the Museum of Modern Art (MoMA) in New York.“The collection represents an amazing range of works, from vibrant early work by mid-century contemporary", "The next Biennial should be held in 2021. The next edition of the exhibition will take place at the Museo de Arte Contemporáneo (MAS) in Madrid in 2020. The next edition of the exhibition will take place at the Museum of Contemporary Art, New York (MCA) in 2021.The French pavilion will elect the three finalists for the 2020 prize: Yalea Boussi, Lille, and New Orleans. The 2019 prize was awarded to Tacita Delahanty, Seattle; Patrick Hennigan, New York; and Joel Martensen, Norway.The 2019 prize was awarded to Agnès Varda; Ewa Mendieta, New York; and Julia Soltanova, New York.The 2019 prize was awarded to Mark Borthwick, New York; James Burnham, New York; and Tawanda Ali, New York.The 2019 award ceremony was held in the exhibition, “The Marshes: Landscapes of Dust and Water,” at the Sackler Gallery in New York. The 2018 prize was awarded to David", "The next Biennial should take place in the spring of 2021. \n\n\nThe Carnegie Museum of Art in Pittsburgh has received a gift of twenty-two paintings from the artist-in-residence Stacey Mabie. The works, which were donated by the artist and were on display in “The Tides of the Past: The Paintings of John Henry Newman” (2018), were purchased by the museum in commemoration of the seventy-fifth anniversary of the artist’s death. Mabie was commissioned to create the works by Newman, the first American artist to spend nearly two years in the same building, and was awarded a lifetime achievement award by Carolyn N. Ledbetter, president of the Carnegie Museum of Art.The gift includes a large number of paintings that are from “The Five Wills,” one of the earliest works by Mabie, which was created in 1926, which originally featured two women in a white room, each wearing a different outfit and each holding a different painting. Mabie’s paintings were originally displayed at the Whitney Museum of American Art in New York, but they were moved to the Carnegie Museum of Art in 1971.\n\n\nThe Museum of Contemporary Art Philadelphia has appointed Doris", "The next Biennial should be held in early 2021. \n\n\nThe National Geographic Society has appointed Mary Catherine Imhof as its next president and CEO. Imhof, a history professor and professor of marine biology and the arts at the University of California, Berkeley, will take the helm of the society in February 2021. Imhof will succeed Joachim Duiker, who has led the organization for more than twenty years and will begin his tenure with the National Geographic Society in March.“The board of directors, for more than two decades, has heard from many, many people who are excited about the new leadership and the exciting opportunities ahead,” the society’s founding director David Salle said in a statement. “With her appointment, Mary Catherine Imhof comes to the National Geographic Society with decades of experience in the field of marine biology and an incredible outlook to grow the field and her own career. She is dedicated to growing the entire network of our museum and to connecting it to current scientific knowledge and the future.”Imhof joins the National Geographic Society following a distinguished career in the marine sciences, where she served as a research scientist and research chair at the University of Texas at Austin and worked as a staff writer for a number of publications", "The next Biennial should aim to 'explore contemporary themes through the work of women artists, focusing on their practices and their lives, such as in the exhibition ‘Feminine,’ which is currently on view at the Guggenheim from January 27 to February 7. The exhibition will also unveil the first-ever Biennial of Works of Art by a female artist. The biennial will offer a platform for artists to develop their collective voices and their own perspectives through a series of new performances, biennial projects, and other activities developed with the support of the United States Department of Cultural Affairs and Biennials.\n\n\nThe first major retrospective of works by the New York–based American artist Virginia Kaplan, whose iconic abstract paintings and collages invite viewers to consider the work as an interdisciplinary exploration of the nature of art, was announced this week. The show will open at the Aspen Art Museum in November 2019 and will be presented by Kaplan at the Venice Biennale in May 2020.“I’ve been looking forward to this for years,” said Kaplan, whose extensive career spans from painting to activism and includes works such as her monumental multi-hundred-foot-wide canvases for which she stands between two", "The next Biennial should be in June 2020 and will be presented by the team behind the iconic sculpture Works of Art in the City of London. The first iteration of the exhibition will run May 23–June 20, 2020.The inaugural exhibition, “Works in the City,” was commissioned by the City, and, in collaboration with the National Gallery, conceived of as a “realistic” depiction of the city of London’s streets and alleys. The work, which was built in 1969, will have the works of twenty-four artists, including Damien Hirst, Richard Avedon, Kurt Weiller, and Mark Rothko, and will feature hundreds of works that explore the relationship between art and life. The opening of the exhibition is the culmination of a decade-long project by the Biennial team that involved more than 40,000 men and women from seventy-five countries.The exhibition will also be followed by an exhibition of the work of French artist Alexandre André (2019), which will be presented by the Haus der Kunst, and by the exhibition of the work of Italian artist Paolo Baratta (2019), which will be presented by the J. Paul Getty Museum. The exhibition of the work of", "The next Biennial should be in December 2020 and will run concurrently with the new exhibition “The Future Is Not What It Used To Be.” The 2020 venue is a former Warner Brothers building in a former theater district in the heart of Mumbai. The first biennial, “Live: Live!,” was held in 2012, and the second, “You and I Don't Live on the Same Planet,” was staged in 2019. \n\n\nThe Solomon R. Guggenheim Museum has appointed Jai Naidu as its new curator of contemporary art. Naidu comes to the institution from the Museum of Modern Art, New York, where he has served as associate curator and head curator since 2017, and will assume his responsibilities in May.“We’re thrilled to welcome Jai Naidu to the Guggenheim,” said Mark Regnier, the museum’s director and chief curator. “The curatorial team at the museum has crafted an excellent and critically acclaimed exhibition, ‘Influence,’ that will be a powerful introduction to the work of Jai Naidu and allows the audience to explore his diverse practices and vision behind the medium. Naid", "The next Biennial should be held in the autumn of 2021. The first will be hosted in the city in the summer of 2021. It will feature eighty artist works by thirty-six artists, including Arash Dagher, Sara DiSantiago, Rajan K. Kraus, and Marc-Olivier Petitclaus. The second will be held in the autumn of 2022. The first will be held in the spring of 2022. Sultan Art Museum, DubaiThe future of the museum has yet to be decided, but the museum is expected to welcome visitors in the autumn of 2022. The 2022 event will be hosted by the UAE. \n\n\nThe Museum of Contemporary Art (MoCA) in Atlanta has received a gift of more than one hundred works by forty-four African American artists, including Cynthia Lindley, Kiki Smith, and Lacy Thompson, who are currently on display in the MICA African American Arts Center, which opened in 2010 and is housed in an original Georgian townhouse in the city. The gift includes works by Alton Williams, Albert Camacho, Zahra Covington, Claudia Coleman, Dorian Lewis,", "The next Biennial should take place in 2021. \n\n\nFund for the production of works and exhibitions by international and emerging artists in the United Kingdom is under scrutiny following the shock death of artist Basil Fawcett. Fawcett, who was ninety-four years old and lived in London, was found dead in his home on the morning of August 5, 2017, from complications due to AIDS. The artist had contracted the virus from a close friend and art dealer, Alfred Stieglitz.Fawcett was an avid collector who amassed an impressive collection of works by the likes of Terrence Malick, Mark Rothko, Anaïs Nin, Tala Afif, and Renata Roesler, among others, and became well known for his frequent public appearances at Tate galleries and the Tate. His works have been exhibited at the Venice and the London Biennials, and he was the subject of numerous documentaries, including the 2013 documentary The Art of Basil Fawcett.Fawcett was also a prolific writer. The author of Seven Times a Day, 1983–1986, and Fawcett & Steinbrenner: The Art of Modern Life, 1988–1993, which was among the first", "The next Biennial should begin in May and will be hosted at the Museo de Arte Contemporáneo, Madrid. For all the latest on the exhibition, visit the official site here.Artnews has reached out to the Biennial for comment.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Katie Rinaldi as its new deputy director of exhibitions. Rinaldi joins the museum from the Los Angeles County Museum of Art (LACC); she has served as deputy director of exhibitions at the museum since 2015. Previously, Rinaldi worked as the director of development at the Foster-Arts Museum in Baltimore, Maryland.“Katie brings exceptional curatorial and performance expertise, a proven track record of success, and a proven track record of growth,” said museum director and CEO Sarah Sze. “We’re thrilled to welcome Katie to MoCA, and are confident she will continue our legacy of innovation and creativity in both her new role and her previous one at LACC.”Prior to joining the museum in 2016, Rinaldi was a curatorial fellow at the Los Angeles County Museum of Art. She also worked as a curatorial assistant at the Museum of Contemporary Art", "The next Biennial should be held in 2021. The 2019 exhibition, which was staged at the Institut für Deutsche und Internationale Kunst (DIE KUNST) in Munich, was the first of its kind in the country. It was met with mass protests from cultural figures across the world, who condemned the event for privileging the interests of a handful of wealthy collectors. In a statement, the exhibition said that it had modified the format of the event. In the past, the concept of a biennial had been given a year in which a series of performances and exhibitions would showcase the work of a select group of artists. “The exhibition does not intend to displace the exhibition and its events but to create an opportunity to reexamine and renew the art of the biennial year,” Biennial director Hans-Ulrich Reiter said. The upcoming exhibition will begin on March 22 and will run until March 28.\n\n\nThe Museum of Modern Art in New York has appointed Ravi Bahugoda as curator of contemporary art. Bahugoda will assume his current post on March 3. He succeeds Kathy Fattal, who departed the institution in March 2019 to head the Los Angeles County Museum of Art (LAC", "The next Biennial should be here soon, with the opening of the new exhibition area in 2020. The Centro de Cultura X Portico (Skyscraper Museum) in Madrid will be inaugurated in the spring of 2021. The Centro de Cultura X Portico will be decorated with more than 1,500 photographs and artifacts by more than two hundred artists, including Ricarda, Pilar Corrias, Hetain M. Macha, and Jeannie and Felipe Martin, and will boast a vertical garden where the works of Santiago Calatrava, Alfred Stieglitz, and Franz Kline will be displayed. The Centro de Cultura X Portico will also be home to the Gabriele Caligi’s Conceptual and Color” exhibitions and the 2018 edition of the Biennial of Contemporary Art in Ljubljana.\n\n\nThe National Galleries of Scotland have welcomed Australian artist, curator, and educator Sarah Newton to its staff and board. Following a ten-year terms in 2017, Newton will become the National Galleries’s new chief executive and director, effective immediately. She succeeds Sue Scott, who retired after ten years", "The next Biennial should take place in 2020. \n\n\nThe Parsons Museum of Design in New York has announced that it has appointed Julianna Pape as its next director. Pape comes to the museum from the nonprofit organization the Committee for Public Art, which she founded in 2016. She comes to the institution after graduating from Pace University in New York and serving as the director of the Museum of Modern Art through 2018.“Julianna is a seasoned leader and has built a strong track record of transforming organizations,” said Peter W. Herman, who has helmed the museum since 2016. “Her leadership will be crucial for the museum as it continues to grow and adapt to the needs of the changing world.”In the new role, Pape will oversee the movement of works, exhibitions, and collections between the museum and the city’s public spaces and will develop programming that engages with issues of sustainability. She will also oversee a staff of twenty-eight and will begin her new role in January 2021.Pace’s American Art and Design (A4) program, which was founded in 1989 with a $10,000 grant from the Parsons, is one of the largest and most ambitious institutional initiatives of its kind in the", "The next Biennial should take place in Beijing in 2021. In the meantime, the Museum of Contemporary Art Shanghai, which moved to a new campus in July, will continue to operate as usual, with the exception of a new exhibition, “Avant-Garde and Modern Art” (2019), which will examine the evolution of the avant-garde in Beijing.\n\n\nCanadian curator Becca Curran, who most recently served as director of the CBGB Arts Centre in London, has been appointed curator of contemporary art in the US. Curran, whose curatorial projects include Celeste in Grey (2018) and Born Green (2019), will be responsible for bringing contemporary art to life in Los Angeles and San Francisco. She will work with the Los Angeles–based artist Nari Ward to create a new conceptual exploration of the relationship between the arts and the urban landscape.Curran’s first project will be to present the work of American artist Catherine White, who is currently on display in the exhibition “Postwar: Art in a Neoliberal Age” at the Hammer Museum in Los Angeles. White’s work will be included in “Postwar: Art in a Neoliberal Age”", "The next Biennial should be held in 2021. \n\n\nThe National Museum of Fine Arts in Washington, DC, has received a $25,000 donation from the two individuals who have championed the institution since its founding. Norton Simon & Schuster founder and philanthropist Howard G. Becker and his wife, Anne, are giving $10,000 each to the museum for its 2019 iteration—a $12,000 gift that will enable the museum to create the new exhibition, The Future Is Not What It Used To Be, and will also provide $10,000 to establish the Howard G. Becker Chair in Modern Art. The cataloguing of artifacts that were donated by such luminaries as Louis Vuitton founder François Pinault, Henry Ford, and Robert Mapplethorpe is another gift that will help ensure the museum’s future. The Becker Criterion Paintings exhibition, which debuted at the museum in 1997, attracted nearly three hundred visitors to its inaugural edition. The work of fourteen artists, including Earnest Fears, Paul Gauguin, and Ed Moses, was given the prestigious Hugo Boss Prize in 1999. In 2000, the museum received $50,000 from the Hughes Foundation.In 2003, the", "The next Biennial should be held in 2021, with the production focused on the art of the ancient Roman city of Pompeii. The show will also include a retrospective of works by the Italian artist Francesco Canavaro, and will open on October 27.\n\n\nThe Museum of Fine Arts (MFA) in Boston is working with the Massachusetts General Hospital (MGH) to create a new contemporary art museum that will provide relief and care to vulnerable, medically underserved, and economically disadvantaged communities. The new institution will be named after the popular Boston eatery Faneuil Hall and will share space with the Faneuil House.“We are thrilled to be working with Faneuil Hall to build a new contemporary art museum that will serve as the flagship museum for the Faneuil family,” said museum director Matthew Teitelbaum. “This is a very special moment because Faneuil Hall is now celebrating its sixtieth anniversary. We look forward to furthering its legacy with a new museum that will be a model for museums of the future and a place where the Faneuil family can come together for a meal and a drink.”The Faneuil House is currently undergoing a major", "The next Biennial should take place in 2022. The first was scheduled for March 2022.\n\n\nThe Metropolitan Museum of Art in New York has given the green light to a new exhibition dedicated to the influential American painter and architect Frank Gehry. The exhibition, titled Building a Future with Gehry, will open in September and will run until April 21, 2022.“I’ve been a fan of Gehry for years,” said Sarah McBride, the exhibition’s curator of contemporary art. “His practice is as timeless and relevant today as it was when he began. The exhibition is based on a real-life project that puts Gehry’s work in a very tangible place.”The production, which will be curated by John Lucar, the curator of the Whitney Museum of American Art, was inspired by Gehry’s desire to create a new kind of community, one that would highlight the need for structural and functional alternatives to current cities. His proposal for the show, which will also highlight work by forty-seven other architects and engineers, was for a mini-symposium called the “Gehrtsbau,” which is primarily an art museum and not a textbook. The show will", "The next Biennial should be held in 2021.”The designation of the area as a World Heritage Site, which is in addition to the biennial, was made in recognition of the city’s contribution of more than sixty millennia of architecture, sculpture, and design to the preservation, conservation, and development of New York and the world.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that Michele Carbone, the director of the institute, will be the next director of the Kunsthalle Basel, which was established in 2002 and comprises fifty-five galleries in the city. Carbone succeeds Joachim Lubell, who will remain involved in the institution as the new director of the Kunsthalle Stuttgart.“I’m honored to have been selected as director of Kunsthalle Basel from an outstanding group of directors,” Carbone said. “I’m eager to lead the museum into the future and am confident that my curatorial skills, technical expertise, and enthusiasm for exhibiting contemporary art will prove highly attractive to the museum’s new home.”Carbone will be tasked with bringing the Kunsthalle Basel.’s exhibitions of work by contemporary", "The next Biennial should open in Stockholm in 2021. The Swedish organization is planning to stage more than seventy exhibitions, including the first solo shows of work by Anton Kern and Peter Kropotkin since the duo began working together in the 1920s. The event will be organized by the Swedish Institute of Contemporary Arts (SEKI), the Swedish Museum of Fine Arts, Stockholm, and the New Museum, New York.\n\n\nThe museum in Kassel, the city’s capital, has received a gift of more than thirty thousand photos documenting the history of the Romantic movement. The work, which was donated in recent years by a group of collectors known as the Kassel Family Collection, is the largest collection of photographs taken by the late photographer Carl Osterlind. The collection includes photographs of work by the four founders of the Romantic movement, Carl Friedrich Osterlind, who died in 1975, and his wife, Viola, as well as works by other prominent artists such as Hans Hofmann, Ernst Lubitsch, and Erich Fromm.“The collection is of great significance for a number of reasons,” Martine Trockel, director of the Kassel Museum, told the New York Times. “First of all, it", "The next Biennial should be held in 2021. “The Bechdel Test” is a series of essays and artworks by theoretical artist Barbara Bechdel that were set up in 1972 and were subsequently assigned to a series of artists in order to start a new series. The sixteenth edition of the event, which was held in November 2006, was canceled owing to the coronavirus. The exhibition’s director, Livia Bruguera, said: “All of us are devastated, but we are also acutely aware of the incredible work that Bechdel and her authors have done to advance the field of art history.”\n\n\nThe Guardian, the New York daily newspaper, has appointed Barbara Plett as its new editor in chief. She will succeed Sir Martin Clark, who is retiring from the helm of the newspaper at the end of this month, and will take up the post on September 10.“Sir Martin’s leadership has been the foundation of the Guardian for forty years, and it has been particularly rewarding to have his public commitment and dedication reflected in the breadth and depth of our news coverage,” said Plett. “His vision for our newsroom was ambitious and well-des", "The next Biennial should be held in 2019. The project is being funded by a group of artists and scholars led by Arsht Nesibai, a curator and professor at the Kunsthalle Basel, and Franz Schäfer, a curator and founder of the experimental art space Avant-Garde des Kunstbauhaus. The exhibition, which will be curated by Nils and Hans de Jong, will showcase new works by twenty-four artists, including James Turrell, Yolanda Ulman, Hans Vermeer, and Cheng Hun Wang. The first iteration of the exhibition was held at the Museum of African Art (MoA), Beijing, in 2016.\n\n\nThe Art Newspaper (Artnet) reports that the Hannover Watermark Blockades are now in full swing, with a total of eighty-one watermarking protests taking place across Germany and Austria. The actions were sparked by the reopening of the Hannover Museum of Contemporary Art (HMA), a former Thuringian palace that is currently being renovated by the Kunstverein Berlin, which plans to turn the museum into a cultural center and the institution into a “modern-", "The next Biennial should take place in 2021. The new site for the 2019 event is the National Museum of Sweden; the exhibition will be held from February 20 to February 21, 2020. The Swedish Institute for Contemporary Art (SIK) is planning to move the exhibition from Stockholm to Bergen.The institution has been awarded a $1.5 million grant from the Swedish Ministry of Culture. The institution is also receiving funding from the Swedish State Arts Fund (Swisschumafrikanischer Funden), the Swedish Federal Council for the Arts, and the Swedish Development Fund (Sverige). The deadline for applications is February 2.\n\n\nThe Museum of Fine Arts (MFA) in Boston has received a gift of twenty-six works by twenty-six artists from a group led by artist and philanthropist Jonathan Gold in honor of the Museum’s centenary year. The donation includes works by Nari Ward, Richard Avedon, David C. Driskell, Robert Mapplethorpe, Nicholas Parsons, Takemar Messer, and Yinka Shonibare.“The gift is a great honor for the MFA, especially in the celebration of its seventeenth anniversary,” said MFA director and CEO", "The next Biennial should be in December 2020. The next iteration of the show will be held at the Hauser & Wirth Gallery in New York. Biennial organizers are planning to create permanent work spaces to support the local arts and to exhibit their exhibit-based works in the exhibition. Casey Kaplan, president of the exhibition, said: “This is an unprecedented and exciting year to be a part of the New York–based art scene with large-scale projects such as our first ever Biennial in the Hudson Valley, the 2019 edition of the show being held in December. We are really excited by the possibilities this will mean for our artists, the galleries that will create for Biennial, and the broader community.”\n\n\nOn April 30, 2018, the Museum of Modern Art (MoMA) in New York announced that it will not renew its contract with the controversial French oil company Total, which has been embroiled in a massive legal battle with the United States government over the global warming crisis, reports Artnet. The move effectively ends the firm’s attempts to reduce the greenhouse gas emissions that are responsible for global warming, and gives the federal government the authority to legislate against the fossil fuel industry in the United States.On March", "The next Biennial should take place in the spring of 2020. “The Biennial is a revolutionary method that examines and changes the world through imagination,” said Bradley Taylor, executive director of the museum. The museum is currently planning to relocate the exhibition from its current location in the basement of the museum onto the second floor, where it will be able to offer additional programming. In addition to the unveiling of the exhibition, the museum will conduct a series of public events, including a reception for the public at the museum on March 26, 2020, and will unveil new works by artists such as David H. Koch, Jane Panetta, and John Lasseter at the museum. The new galleries will open in the fall of 2020 and will offer six new exhibitions each year, beginning with the first Biennial Exhibition, which will take place in the summer of 2020. The exhibition will be transformed by the Biennial Architecture program, an initiative of the institution that aims to bring contemporary art to Hong Kong through urban development projects and architecture. The program will include a series of exhibitions that will be organized around themes such as sustainability, energy and water, climate change, and the future of architecture. The first exhibition, titled “The Earth", "The next Biennial should take place in 2021, the same year as the fiveteenth, to be held in Württemberg. [Update: September 25, 2018, 10:40 AM] The 2019 edition of the Berlin Biennale, titled “Expanding the Curiosities,” will also be held in 2021. This year’s event will be held in the city of Kassel.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles’s board of trustees voted unanimously today to lift the city’s 2017 moratorium on new construction, opening the way for the institution to begin construction on the third phase of its expensive, nearly-$2 billion renovation, dubbed “Dangdai 3.0.” The announcement comes on the heels of a $3 billion expansion project, dubbed the Dangdai 2.0, that will be completed this spring and will present an expanded center for contemporary art.“This is a historic day for the city of Los Angeles and for the greater Los Angeles region,” said board chair David Breslin, who was a curator at the museum when it was still run by the same curators who were hired to transform the museum into a", "The next Biennial should be held in 2021.\n\n\nThe LaGuardia Museum in New York has commissioned David H. Dinkins’s monumental work, The Promise of a Life, to open the museum’s new building, the new David H. Dinkins Center for Art and Art History. The center will also house the museum’s new permanent collection, which consists of works from the David H. Dinkins Foundation and other notable donors. The new space will also include a David H. Dinkins Theater, a David H. Dinkins Galleries, an office, and spaces for educational programs.The building will be inaugurated by an exhibition of works by the Chinese artist Liu Xiaochuan, which will also feature works by artists such as Shih Gao, Sun Qiu, and Zhuang Xian. The center will also house a number of special exhibitions, including “The Art of Don” (2019) and “A Study in the Language of Art” (2020).\n\n\nThe Museum of Contemporary Art (MoCA), Chicago, has released the list of twenty-nine artists who will participate in the third edition of the Jacob Javits Convention, “The Future is Present", "The next Biennial should take place in 2020 to coincide with the fifteenth FIFA World Cup. The view from the Biennial will be enhanced with the installation of the Biennial “Rendering of the World: the Contagious Disease, 1918–1939” (2015–16) and the opening of the inaugural edition of the Biennial, which will run for twelve days. \n\n\nThe Museum of Asian Art (MAFA) in New York has received a gift of an additional forty-five artworks by thirty-five artists, including Huang Pang, Ai Weiwei, and Joan Miró, from the National Asian Art Museum in Beijing. The exhibition, titled “Bringing the Land Together: Art and Power in Contemporary China,” will officially open on September 14 and is curated by Kunihiko Hasegawa and curated by MCA director Krista Moll. The show will feature original works by seventy-five Asian artists, three of whom are represented in the exhibition: Yee I-Sung, Yang Jie, and Koki Kuma.The gift includes two works by artist Li Qiang: “Live on the Storm: An Abstract Life,” 2009, a cloud-like", "The next Biennial should be held in the fall of 2022. The list of participating artists is as follows: Evgeny Andriyovych Biennial, UkraineArtists: Alexander Budchenko, UkraineArtists: Lachdan Charakovsky, UkraineArtists: Lukashenko Dzhevolsky, UkraineArtists: Nikola Scherbakov, RussiaArtists: Karen Wong, Hong KongArtists: Fatemeh Abdul Latif, United Arab EmiratesArtists: Ludmila Lesukhova, UzbekistanArtists: David and Nell Doran, United KingdomArtists: Gazda G. K. Kesel, UkraineArtists: Shirina K. Levinson, United KingdomArtists: Markus de Bruijn, BelgiumArtists: Markus Nordenski, GermanyArtists: Markus Speroni, ItalyArtists: Markus Vermeer, GermanyArtists: Aristo Pincus, ItalyArtists: James O. Cupitt, USAArtists: Kayodea Davis, United KingdomAristophoros Konstantinos, GreeceArya Ehrlich", "The next Biennial should be held in 2021. For the first time, the exhibition will be hosted at the Palace of Fine Arts in Bangkok. It will also have joint programming with the Smithsonian American Art Museum in Washington, DC, and the National Museum of China in Beijing. The theme will be the body and the body language. The event will be held as part of a larger plan to redesign the capital with a view to revitalizing it and boosting the city’s cultural offerings. Art historian-turned-politician-turned-designer-in-residence Aitken Fattal will also be responsible for the redesign of the National Gallery of Art and the National Museum of Contemporary Art in Bangkok, which will welcome visitors from August 15 to August 21.\n\n\nAn exhibition dedicated to the life and death of Russian dissident artist Andrey Kolesnikov, who was assassinated in Moscow in May 2018, has been indefinitely closed by the Russian Ministry of Culture. Its organizers argued that the move was made in order to avoid ignoring the ongoing protest movement against President Vladimir Putin.The exhibition, “After ‘Kolesnikov’s Death,” was staged by the museum in cooperation with the Dissidence Memorial Forum, a private organization", "The next Biennial should be held in the year 2022. The event will be inspired by the artist’s life and will focus on the biennial, the artist and its relationship to the larger world, and the theme “spirituality, politics, and the body.”\n\n\nThe Metropolitan Museum of Art (the museum) has announced that it is expanding its partnership with the Chinese artist Jennifer Packer, whose work spans multiple genres and is considered a modern masterwork. The artist was selected by a jury comprising Peter W. Hu, director of the museum; Arnold Quattrone, artistic director of the Shanghai Art Museum; and Hu Jie, director of the Beijing Art Museum, for the 2019 Biennial Exhibition. Hu Jie said: “It’s a real honor to represent China at the MaRS. It’s a huge honor to represent China at the MaRS, which is the highest level of Chinese art. We hope that the Chinese and international art lovers in the UK and US will come to celebrate with us next year.”\n\n\nThe Chicago-based artist who made his first solo exhibition at the Arab Art Museum in Cairo in 1996 is planning to open a branch in London in 2021. The artist", "The next Biennial should open at the New Museum in London sometime next month. \n\n\nSophia Coppola, the Italian ballet producer who championed the theatrical and the photographic and created a body of art that reshaped the cultural landscape, has died at age seventy-seven.Born in Venice in 1928, Coppola moved with her family to Turin as a teenager to study the history of art at the university, where her father, Lucio Coppola, was a professor. She would later marry Carlo Cipolletta, and eventually enrolled in the prestigious Stà di Spina, where she met her future husband, Giacomo Cipollotti, who introduced her to Casa Delft (later renamed the Coppola Studio) and eventually to the Biennale. She married in 1954 and moved to the city of Genoa, where she continued her artmaking and artistic pursuits. But she soon left the city to return to Milan, where she met her future husband, Luigi Coppola, and eventually the two began the production of the celebrated ballet Titos (Titour). Tito was a collaboration between Coppola and Fabio Fusi, the Italian director of the Royal Academy of Arts", "The next Biennial should be held in the same location in 2021. “It is a real pleasure to be able to inaugurate an exhibition dedicated to the history of the art of India, the Asia-Pacific and the Americas,” said TMG director Viswanathan Rajan. The artist will also work with multi-disciplinary artists to bring the exhibition to life in museums and will present one of her works with the intention of reinterpreting the history of art in the exhibition.Commenting on the project, Rajan said: “I want to extend a warm welcome to this exhibition which has shaped and defined my career. The exhibition will present themes of the past and present, both figuratively and literally, and will engage with the history of art in a meaningful way.”\n\n\nThe National Museum of Art in Washington, DC, announced today that it is temporarily closing the museum, which has a long-standing history of showing works by American sculptors such as Robert Irwin and Alfred Stieglitz, for a period of three months to allow the institution to undergo a major renovation. The renovation project, which is currently under way, will include the restoration of the museum’s collection and the construction of new galleries and rooms", "The next Biennial should feature the work of artists who have had significant contributions to the development of contemporary art, Arts Science, Art Museum Research, the Humanities, and the Social Sciences.  “We are excited to invite some of the most visionary artists from around the world to play a central role in shaping the next generation of leaders of the art world,” said John Lehmann, chairman of the museum. “We are confident that together we will find a path toward realizing the vision of the ‘Art of the Future’ and a more inclusive art world that advances the universal.”In a statement, the biennial said: “The biennial is proud to present the work of many of the outstanding artists who will shape the biennial’s next iteration. We are excited to see the work of these artists and to plan a great exhibition with them in the coming months. We are also eager to work with the full range of talent in the United States and around the world.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that Helmut Newton will become the next director of the Los Angeles County Museum of Art (LACMA), which earlier this year celebrated its fift", "The next Biennial should begin in June 2020 and be held in the city of Basel, Switzerland, which will host the first exhibition in the country in May 2021. The theme of the exhibition will be “Post-Feminism” and will be curated by Nicoletta Switzer and Elin Vermeer.The exhibition, dubbed “Postfeminism” after an article by Simone de Beauvoir in a 1961 issue of the magazine Artforum, will take up themes of domesticity and the rise of postmodernism, the role of women in politics, women’s rights, and the sexual revolution. In the months leading up to the event, the exhibition will be organized in collaboration with the feminist bookstore Les Demoiselles Femmes de Paris. The exhibition will take up themes of identity and gender, and will feature artworks by artists such as Barbara Cheney, Janice Bass, Cécile Blanchard, and Yinka Shonibare. The show will also examine the role of women in culture.“The Biennial is an invitation to take up anew our questions about the imagination and what is postmodern,” said artist Joachim Neugroschel, who is cofounder of the", "The next Biennial should be set up as a platform for the institution’s work and will be led by a curator, artist, director, and scholar. Hirshhorn Museum curator Adam D. Weinberg, who has been a member of the museum’s contemporary art advisory committee since 2005, said: “This is an unprecedented year for American art and we are ready to lead the way in reimagining what it means to be an American institution.”\n\n\nThe Carnegie Museum of Art in Pittsburgh has received a gift of eighty rare works by artists such as Mark di Suvero, who created his first abstract painting in the 1960s, and whose work stands in the collection of the Mark di Suvero Foundation, and the Carnegie Museum of Art. The donation includes works by thirty-two artists who were active in the 1950s and 1960s and include work by Charles Atkins, Willem de Kooning, Rainer and Rainerstein, Frank Minuita, and Ursula and Ursula von Rydingsvard, as well as works by the Shiloh School, David Henry, and Helen Frank.The works are currently displayed in the museum’s permanent collection at the Carnegie Museum of Art.", "The next Biennial should be held in 2021. In the meantime, the theme for the 2020 edition of the show, “Theoretical Creativity,” will be the history of the scientific study of life and the universe.\n\n\nThe Richmond Art Museum in Virginia has received a gift of twenty-seven works by thirty-six artists, including Johann Sebastian Bach, Percy Jackson, and Cézanne at a time of major global upheaval, the coronavirus pandemic, and the biennial’s centenary. The works were donated by Max Beck, founder of Beck-IT, and Mark Lehner, the director and chairman of the Greater Richmond Art Museum.“We are very excited to open our new, expanded, and expanded-to-capacity venue to the artists who deserve to have their works exhibited in the first exhibition of the new biennial,” Lehner said. “Max and Mark are dedicated to supporting the outstanding local and regional artists who have inspired them, and to championing the art of the future.”The works were donated by forty-eight artists, including Robert Irwin, Hui-Chun Wong, Hao-Chun Huang, and Chi-Wei Hsu, a group of", "The next Biennial should take place in Algiers, France, in 2022.The decision to pull the plug on the venue was made after the French Ministry of Culture commissioned a review into the exhibition’s future in April 2022, reports French daily Le Monde. The ministry also invited the Moroccan artist Samir Karouan to participate in the event, but he declined the invitation.Commenting on the decision, Lausanne-based artist-producer Philippe Sender said: “This is a real moment. The Italian pavilion and the Moroccan pavilion deserve to be remembered as the crucial stages of the creative process. At a moment when all of contemporary art seems to be breaking from its own traditions, the Italian pavilion and the Moroccan pavilion demonstrate the way forward.” He added that the events of the last week have reminded him that the biennial can’t be stopped and that the next should be held in Algiers.\n\n\nThe British Museum in London announced today that the institution is planning to raise $8.5 million for the construction of its new headquarters building in the city, which will be built in the former Ascot Furniture Works site on the southwest corner of the museum and the Whitechap", "The next Biennial should, perhaps, be “De Guzman” (1962–1964). It will be an undertaking in which the artist will create a new work to celebrate the centenary of the Arte Povera movement\u0097a critical development in Spanish art. “I am taking this as a chance to renew my already ongoing participation in the programme, to continue to engage with the programme and with the program as a whole,” said Biennial president Marta Alvear. “I feel it is important to have a new process with an international dimension.”The next edition of Art Basel will take place in Hong Kong. The Hong Kong pavilion will be led by Yuichiro Nakaya, who will be joined by  as well as Hong Kong-based artists Ming Wang and Chen Guangcheng. The Hong Kong pavilion is an extension of the HK� Participatory Villages Program, which was established in 1964 by the Hong Kong Government to promote the art of Hong Kong to the international art market. The programme was established in response to the rapid movement of people between Hong Kong and mainland China. Artworks created by Hong Kong artists are often used in", "The next Biennial should be held at the Pavilion of Fine Arts, BSF, Tehran, on September 26–September 29. The exhibition will feature work by fifty-five artists and will be organized as follows: 〜The Arab Spring: The Struggle for a New World,” October 3–October 6. The second Biennial will be held at the Ajmer Art Museum, India, on September 23–September 26. The third Biennial will be held at the Faculty of Arts, Shahram Al Qasimi University, Dubai, on September 19–September 22. The fourth Biennial will be held in the United Arab Emirates, at the Taman Fajr Museum, in Abu Dhabi, from September 23–September 26. The fifth Biennial will be held at the Art and Design Museum (ADM), Sydney, from September 23–September 26. The sixth Biennial will be held in the United Arab Emirates, at the Taman Fajr Museum, in Abu Dhabi, from September 20–September 24. The seventh Biennial will be held in the United Arab Emirates, at the Taman Fajr Museum, in Abu Dhabi, from September 24–September 26. The eighth Biennial will", "The next Biennial should take place in Los Angeles in the fall of 2022. It will be led by the Swiss curator Daniel Berger and will center around a group of artists whose work is currently on display at the Museum of Contemporary Art (MoCA); the Brooklyn museum; and the Los Angeles County Museum of Art (LACMA). In a statement, Berger said: “We are delighted that the Los Angeles County Museum of Art will welcome us back to the site of the twentieth Museum of Contemporary Art (MCA), LACMA, and the home of the only museum dedicated to modernism in the United States.”The last edition of the event, “The Future Is Present,” was held in 2018.\n\n\nKathrin Becker, a Hamburg, Germany–based artist whose work explores the relationships between memory and memory art, has won the Month of May's Deutsche Kunstakademie Handelsabend. The honor, which is given annually by the German parliament to a German-born artist, is one of several awards given by the institution in honor of its lifetime achievement award winners. Becker first won the award in 2005, in honor of her participation in the annual exhibition “The Shepherd Years,” which was organized", "The next Biennial should be physically located on the campus, not a museum. We are currently considering the possibility of creating a new venue in the campus, but this would be our first exhibition of the new collection. We would like to see the exhibition run for twelve weeks, and the exhibition should be presented in a coherent way, drawing attention to the different points of view, to the professional and personal journeys of the artists who are represented, in order to further reflect on the legacy of the exhibition and the contemporary art.”\n\n\nArtist-run spaces across the United Kingdom are being targeted by a new wave of anti-union legislation that will give businesses and certain professions the power to reduce staffing and strike if workers don’t sign contracts. According to the Guardian, when industrial action is banned, businesses are now being encouraged to ignore the Official Prohibitions (OGs) and instead work with the government to amend the laws to their advantage.Ministers are also reworking the public sector’s contract laws so that workers can be protected by changing the workplace into a “compassion center” where staff can meet and socialize with friends and family. The Bill in question, which was passed by both the House of Commons and the House", "The next Biennial should be held in 2020 and will incorporate a real-life project that will involve cultural exchange and collaboration between China and the US. \n\n\nThe Herbert Lectures at California State Polytechnic University in Pomona, California, announced today that Lionel Barber has been selected as its next president. Barber succeeds Hernán Díaz, who retired in March after eleven years as president of Mexico’s National Institute of Anthropology, and will take up the post in May. Barber’s term will run for three years and will end in September. Barber, who has served as president since 2015, will continue to serve as a professor at the school as the institution reopens to the public in January 2021.“Lionel Barber is a gifted and thoughtful leader whose thoughtful leadership has shaped the next version of Herbst Lecture, which makes up the bulk of his tenure,” said Herbst Lecture director G. Edward Campbell. “His vision and commitment to a robust public university has been exemplary, and his academic and institutional record of developing and delivering innovative public programs makes him an ideal choice for this unique and challenging time.” Barber was selected as the 2019 James Cuno Award recipient because of his work in working", "The next Biennial should include a new selection of paintings and sculptures and a new performance by an unknown artist. Currently, the fair has three phases, during which it runs from October 5 to 8 and from October 22 to 28.  The exhibition will return in September 2020 for a second edition, which will run from September 28 to September 30 and will draw from the biennial’s collection of works from the last fifteen years. The third edition, to take place at the Art Institute of Chicago (AIC), will draw from the collection of Nam Y. Huh, as well as from the collections of William S. Burroughs and Roscoe Marder.\n\n\nThe Metropolitan Museum of Art in New York has appointed Marc Straus as its next director and CEO. He will be based at the institution, which is currently constructing a massive new headquarters for the museum in the city, from August 24 to August 28. Straus succeeds Kenichi Yamamoto, who took the helm of the museum in October 2015, and will officially become the 12th director and CEO of the museum on August 29.“Marc has been instrumental in the museum’s expansion and its growth while at the Museum of Modern Art, where he has", "The next Biennial should be held at the Chinese Cultural Center in Beijing next month, and the first Art Biennial should be held at the Art Institute of Chicago in November 2021.Artists such as Aaron LeBlanc, Kiki Smith, and Robert Rauschenberg will represent their countries at the 2020 event. Previous editions of the event, which took place in the United States, have featured work by a wide array of artists, including Lucinda Williams, Amy Sherman, Karolina Wojtas, and Michael Chiu.\n\n\nThe National Gallery of England (NGA) in London is planning to open a new regional headquarters in the city of East London. The museum—which is currently operating as part of the National Lottery Heritage Centre—will also be involved in the reopening of the National Portrait Gallery in Stratford-on-Avon, the new headquarters of the Chancery Lane Museum of Art, and the Tate galleries. The plans for the new space were first shared by director Hayley Wainwright in an article published by Artforum in March 2019.The new space will provide a new exhibition space for the NGA, which was founded in 1889 by sculptor Richard Symonds, and will be located in an old factory", "The next Biennial should take place in the spring of 2021. The first iteration of the exhibition, titled After the Fall, was staged by the Centre Pompidou in Paris in 2015, and attracted 1.5 million visitors. The exhibition was then moved to the Museum de l'Art et de l'Architecture in London, and the exhibition was exhibited at the Centre Pompidou in Paris in 2020.\n\n\nThe German government announced today that it is planning to spend more than $3 billion to repair damage caused by the devastating fires that broke out in the forest near the city of Bonn, Germany, in February. The sum is expected to rise to $4 billion once additional funding is secured.The damage to buildings, infrastructure, and wildlife in Bonn is estimated at $5 billion. Chancellor Angela Merkel said that the government will now allocate $1 billion and expects to secure another $500 million once additional funding is secured. The funds will be used to put in place a recovery plan that will take into account the reconstruction of the forest and forested area and will be funded through 2020.“We have set out a comprehensive and ambitious plan, ambitious even by Germany’s standards, to rebuild Bonn,”", "The next Biennial should be on October 15–February 21, 2021. \n\n\nThe Smithsonian’s National Museum of African Art in Washington, DC, announced today that it is expanding its research and educational program to include a new exhibition titled “The Art of Human Rights.” The new program, which will be presented in conjunction with the centennial, will be organized around the theme: “Human Rights Not Just,” and will be based on an original brief, “The Art of Human Rights: The Future of Human Rights,” that will include original works by more than fifty contemporary artists. The exhibit will be curated by Rodger Sarr, the executive director of the Asian Art Museum in Tokyo, and will run for twenty days, from October 14–October 15, 2020.“This is a challenging time for the museums,” said Sarr. “We invite you to join us in celebrating and defending the values that make us unique—values that are central to the democratic way of life, values that are central to our history, values that are central to who we are.”Earlier this year, the National Museum of Women in the Arts (NMVA) in Washington, DC, received a", "The next Biennial should take place at the Museum of Contemporary Art, Los Angeles (MoCA), in 2020. The 2020 iteration of the event will go on location and will include a new exhibition.\n\n\nThe Baltimore Museum of Art (BMA) has added three new artists to its collection: Nari Ward, Landon Paul and Alex Levinson. The group is the first to be added to the museum’s 40,000-piece collection since it opened in 1967.“We are extremely excited to add three new artists to the BMA collection,” said director Christopher Bedford. “These are artists whose practice engages with and explores the themes of our collection, and we are excited to be able to bring them to the museum.”Paul, whose work is currently on display in “Theater of Operations: The Gulf Wars 1991–2011” at the museum, is known for creating works that, in addition to exploring themes of war and conflict, examine the nature of beauty and how it relates to social justice.Levinson, an artist most known for his installation work, was chosen for his work in the upcoming biennial “We Are All in this Together” (2019–2020) by an organization chaired by", "The next Biennial should take place at the Institut für Bildung und Gesetzung und Kunst in Berlin in the winter of 2021–2022. The ten-day event will be followed by the exhibition Biennial 12, which will return to the city of Cologne from March 19–March 22, 2022. Although the full list of participating artists is still being finalized, the exhibition will include work by artists from fourteen countries and will be organized as follows: Articles 1:The Hellenic Academy, founded in Pylos in the north-eastern part of Greece by Friar Viannis Pindaris in 1923;Articles 2:The Thessalonika International School in Greece;Articles 3:The Forum for Contemporary Art in Serbia;Articles 4:The Forum for Contemporary Art in Russia;Articles 5:The Cenotaph Museum in London, which will be inaugurated by artist Alexander Calder;Articles 6:The New Museum in New York, with work by architect and theorist Frank Gehry;Articles 7:The New Museum in New York, with work by artist Gerry James O'Brien;Articles 8:The Solveig Museum, which will be inaugurated by the German photographer Hein", "The next Biennial should take place in the spring of 2020. It is expected that, in the meantime, the museum will begin normal operations. The exhibition will continue with the works of the curators and will be inaugurated with a presentation by Harriet Mayhew and Robert Irwin. The institution will extend the life of its current exhibition space by twenty years. The move comes amid a major reorganization of the museum’s collection. The museum will relinquish its current exhibition space in the former General Anti-Diet Kempton building, a former school for girls in the city of Bürenburg, to the Berlin School for Art and Architecture (Bau) and will construct a new thirty-thousand-square-meter space for the collection. The new museum will be inaugurated with a collection of works by artists whose works were on display at the institution in the 1980s, such as Martin Akermann, Kurt Weiler, and Frank Malina. Organizers have said that the change will allow the museum more time to prepare for its upcoming exhibition “Avant-Garde Contagions” and “Vertical Movement” and will also benefit the museum from the opening of", "The next Biennial should take place in between 12 and 14 October, with the first exhibition, “The Body and its Place: Contemporary Art from the Caribbean,” scheduled to open on 28 January 2020. According to a statement from the Puerto Rico–based organization, the event will recognize the diverse histories and histories of Puerto Rico and the US territories.\n\n\nThe Adelphi Art Museum in the City of Bethlehem, Pennsylvania, has appointed Laura Horne as its next director. Horne comes to the institution from the Adelphi Art Museum, where she has served as director since 2015. Previously, she served as director of the Beresford Art Museum in Derby, England, and as acting director of the Museum of the Fine Arts, Houston. Her new role will include assisting the Adelphi Art Museum in coordinating programming across its three venues and will be commissioned by Adelphi CEO Eldred Gendelman. Horne will assume her new responsibilities on January 31. Horne comes to Adelphi from the Adelphi Art Museum, where she has served as director since 2015. Previously, she served as director of the Adelphi Art Museum, where she helped organize the acquisition of more than 1", "The next Biennial should be in the autumn, and the Exhibition should be up by June. Since it is not practical to undertake both exhibitions simultaneously, I am proposing that the first be held in the fall and the second in the spring. The museum will collaborate with the Institut für Geschichte München (Institut für Geschichte München) and the Changar Museum Frankfurt (Institut fußtangenstadt) in the future with the same success. The fourth Biennial will also focus on original art in an attempt to achieve an ideal balance between criticism and exhibition. We are now at a stage where we know how to create new art and how to present it in a way that is affordable and accessible to everyone. We are committed to continuing to support the artists of South East Asia and are in the process of establishing new funding opportunities in this area. The next exhibition will be a retrospective of the exhibition “Reality in a Box,” which is scheduled to open at the Sittwe Art Museum in Bangkok in May 2020. The exhibition will run concurrently with the first edition of the biennial at the MCA, which will be held in Helsinki in the spring of", "The next Biennial should take place in 2020 and will focus on the beautiful city of Southampton, England, and will have the theme “Culture and the City.” The event will consist of the exhibition of twenty-two individual works by artists, biennial organizers, and other curators. In addition to the Biennial, the event will also feature a seminar on “Life and the City,” the theme of which will be “What if?” The event’s first curator is Will Gurlitz, who will curate the inaugural exhibition in 2020. The gig was created at the invitation of the Southampton Art Gallery (SAM), which was founded in 1849 by Sarah Seward and David Hockney, and will run through March 22.The biennial will feature work by forty-eight artists, from forty-nine countries, in thirty-two cities in the United Kingdom, and in twenty-one countries in the Americas. The full list of participating artists can be found here.\n\n\nAs the number of cases of Covid-19 continues to grow, artists and activists are urging governments and governments-appointed emergency responders to do more to contain the virus in order to prevent the deaths and injuries that the coronav", "The next Biennial should take place at the University of Toronto in 2021. The theme will be “The Science of Life” and will be “New Directions in Life and Science” .\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has received a gift of four of its seventeen works from the collection of Earl and Martha Hutton, the Custis Foundation, and the Free Library of Philadelphia. The donation was made on behalf of the family after they received the works in January 2019 from the exhibition “The House with a View,” which was staged by the Foundation at the Museum of Contemporary Art in Chicago in December 2019.“In recognition of the philanthropic gifts made by the six of us, the Museum has acquired four works by the Earl and Martha Hutton family, which we hope will become a splash of life in the beautiful city of Los Angeles,” said Jim McAllister, the MCA’s executive director. “We are thrilled to have these works on display in the new newly renovated Museum of Contemporary Art, and look forward to the future of these works as a family collection.”The works were donated by the Hutton Foundation for the Arts, which was founded by Earl", "The next Biennial should take place in Santiago, Chile, in October 2021. The exhibition will feature new works by seventy-four artists from thirty-eight countries, including forty-three from Italy, forty-six from Spain, forty-eight from France, and fifty-three from the United Kingdom. The biennial will be hosted on the Museum’s campus, which will be reconfigured into a large exhibition space, and will be organized as a kind of “My First Biennial,” a platform for reflection and collaboration on the contemporary practice.\n\n\nThe Chicago Architecture Center (CAC) has announced its representation of the late Italian designer Confederate Ciro Benedetti, whose work fosters a sense of community and communal purpose in communities across the United States. He was one of the deciders behind the \"2+2+2\" line, a series of prefabricated housing units in the city of Northbrook that were filled with residents from the same immigrant families as Chicago. “Ciro’s work is central to the conception of the Chicago Architecture Center (CAC),” said Barbara Johnson, director of the CAC. “His unmistakable energy and curiosity combined with a", "The next Biennial should be held in 2020.\n\n\n\n\n\n\nThe Bienal Theatre Company of Mexico City has appointed Sinthujan Naidu as artistic director. Naidu joins the production group from the New York theater company, which is currently undergoing a restructuring. The move will allow the company to move from its current space in the Bienal to a new 600,000-square-foot facility that will serve as a permanent home for its international touring artists.The Bienal is currently represented by Atlantic Partners. The company has received support from the Koons Foundation, the Rockefeller Brothers Fund, and the Ford Foundation. The group has also received funding from New York’s Metropolitan Opera, the Metropolitan Museum of Art, the Museum of Modern Art, and the Metropolitan Museum of Art, as well as from the Walton Foundation, the Walton Family Foundation, and the Walton Foundation-Houston.The group will have its first year of operations at the new $350 million venue that will open in 2020. Naidu will oversee the artistic, educational, and commercial aspects of the construction of the new complex, which will also include a theater, a library, and a café. The renovation of the existing Bienal will begin next year", "The next Biennial should be held in 2020.The one-time grant of $500,000 will be administered by the biennial’s Foundation and will be designed by Charlotte Stolzen-Wells. The fifty-ninth iteration is slated to take place in 2021.\n\n\nTokyo Art Museum (TAM) announced today that Hideo Yamada, a Japanese artist who specialized in the making of ethnographic paintings, drawings, prints, and sculptures, was named the twenty-fifth director of its contemporary art section. He succeeds Louis Delors, who departed the institution in February 2019 to become the head of the Hirshhorn Museum. Yamada, who has been based in Tokyo for the last twenty years, joins the museum in his hometown as its chief curator of contemporary art and is responsible for presenting works by artists such as Hidetoshi Kawamura, Riken Takayama, and Masaoka Masaoka. The forty-ninth iteration of the museum’s “Theater of Arts” will be held in Autumn 2020. “We are excited about this new opportunity, and we are confident that Hideo Yamada will name a visionary director to guide our contemporary art research and our", "The next Biennial should take place in 2020.\n\n\nThe US House of Representatives voted yesterday to establish a national museum of the American Latino dedicated to the history and culture of America’s Latinx communities—a move that observers say will finally deliver on a promise made by President Donald Trump in his 2016 campaign to eliminate the Department of the Southern African Museum and activate the National Museum of African Art (NMAA).Introduced in the Senate last year, the bill to create the museum, which would sit on the National Mall, and oversee two centuries of Latino art, history, and culture, passed unanimously yesterday and is now before the Senate. The legislation directs the Secretary of the Smithsonian to establish a strategy for revitalizing America’s Latino heritage through the acquisition, display, research, exhibition, and preservation of historic works and a $50 million appropriation for the plan.The Antiquities Conservation Commission (ACC), which oversees the museum, has released a statement regarding the bill. “The Antiquities Act of 2015 is a critical tool in reopening the Old West, ensuring that America’s Latino communities—who comprise nearly two thirds of the US population—have a dedicated museum dedicated to them,” said Commissioner Mark Selby. “", "The next Biennial should be announced shortly.\n\n\nThe Museum of Fine Arts (MFA) in Boston announced today that it has hired Kelly Suttner as its new senior curator of modern and contemporary art. Suttner comes to the institution from the Smithsonian American Art Museum in Washington, DC, where she has served as curator of works by Dorothea Rockne, Piet Mondrian, and Paul Gauguin. Her curatorial projects include “Over the Rainbow: The European and American Modernists” (2017–18), “Be/longing: A Century of Modern Art” (2016–17), and “Chapter 9: By Richard Avedon.”Suttner will assume her new responsibilities on February 22, 2020. She will assume her current position at the museum during a transition period that will conclude with the museum’s reopening on April 14, 2021.“Kelly’s work is very much in line with what we’ve been looking for on the museum, and I’m excited to be working with her,” said director Matthew Teitelbaum. “Her talent and her enthusiasm for bringing more art and contemporary art to the MFA is infectious.", "The next Biennial should be held in 2019 and will be followed by an exhibition of works by artists from around the world in 2020.  April 24, 2019The fifth edition of the Biennial, which will be held in the city of Guangzhou from March 11 to March 15, 2020, has announced that it will now be held in the city of Nanjing from March 16 to March 22. The exhibition, entitled “Assemblies of the Mind,” will include interviews with numerous artists, including Hiroshi Takahashi, Adam D. Weinberg, and Paul Gauguin. The event will also present the exhibition “Unfinished Business: Art and Chinese Painting” (2019).Artforum has learned that the fifty-fifth edition of the international biennial, “With Love,” will be staged at the Sazhinskiy Museum in Moscow from March 13 to March 15, 2020. The event will offer the first exhibition dedicated to the artist-designed building Vitra, the fourth of its kind. The show will also feature a special exhibition of works by thirty-seven artists from twenty-four countries and will be organized by the Russian Academy of Fine Arts.Artforum has also learned that the opening of", "The next Biennial should be held in 2021, and the tour should follow in 2022. The upcoming edition will be the last, with the last performance taking place in December 2020.\n\n\nThe public school in the Westbank neighborhood of Bethlehem, Pennsylvania, has received a donation of $50,000 from the arts philanthropists Douglas and Holger Schaible. The couple, who have been active in the arts for more than twenty years, first donated the money to the school in 2015, and the school has made it a priority to use their philanthropic gifts to improve the educational needs of underprivileged children. Holger Schaible’s foundation is also giving the school $10,000 for every pupil it educates. This means that every pupil in the district will receive $50,000. Douglas Schaible’s foundation has also committed $50,000 to building a new art center in the city in the next year. The gift was made in recognition of the ecosystem of access to culture in Bethlehem, where the family has owned and operated a gallery for forty years. The gift will also allow the Schaibles to establish a new festival of American Art’s original programming,", "The next Biennial should be held in the spring of 2021. The first edition, which was organized by the Belgian organized art museum Biennale de Lyon in 2020, was held in March 2020 and was mostly attended by collectors.\n\n\nThe South African Museum of Fine Arts (SAMSA) in Pretoria has announced that the privatization of approximately three hundred works by a number of South African artists between 1930 and 1979 has been completed, and that the institution will receive thousands of works from the collection in the coming years.The institution also revealed that it is planning to open a new exhibition dedicated to the late art collector Paul Kruger, whose wealth and influence made him the backbone of the country’s major art museums. Kruger’s son, Paul Kruger, who was recently appointed chairman of SAMSA, was the former chairman of Randwick Gallery in London and the former director of Sotheby’s in New York.“Over the last thirty years, Paul Kruger curated a number of exhibitions that gave audiences a glimpse into the essence of South Africa’s art scene,” said SAMSA director Fotopole Sula. “In the same way as he did with his works, we will", "The next Biennial should take place in the spring of 2021. The theme of the exhibition will be “les sages et l'autres trios”(Children and their relationships with their parents). The total amount of the prize is $4.5 million.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles has appointed Anna-Sophie Cordero as its new curator of modern and contemporary art. She will be responsible for helping to shape the program and organization of the museum and its modern and contemporary art galleries.“We’re thrilled that these two talented women have joined our talented curatorial team, and we’re looking forward to their proving their worth and their ability to work collaboratively, collaboratively, and collaboratively,” said museum director Paul Mpagi Sepka. “Their respective strengths, histories, and insights are essential to our mission to present a wide and deep array of contemporary art, both contemporary and historic, in our current exhibition format and beyond.”Cordero comes to the institution from Solterra Artes, a modern and contemporary art museum in the city of Rio de Janeiro, Brazil, where she is the chief curator of architecture and design. Previously,", "The next Biennial should be held in 2021. \n\n\nThe Museum of Contemporary Art (MoCA) in California, which was awarded the 2020 Turner Prize, has appointed Joachim Neugroschel, a curator of contemporary art at the Max-Planck-Institut für die Auslandsgeschäft, as its new deputy director. Neugroschel comes to the institution after serving as director of the Palazzo della Albitta in Venice for sixteen months.Commenting on his new role, Neugroschel said: “I have long been impressed by the artistic breadth and community spirit of the Turner Prize program, and its talent for cultivating and foregrounding ideas that address the most pressing global challenges. In this modern age, indeed in this changing world, the challenges and opportunities are vast. The question now is not whether the institution will present a compelling exhibition, but what kind of exhibition it will present.”Throughout his tenure at the Max-Planck-Institut, Neugroschel helped shape the commissioning of more than three hundred works by artists, including Michel Le Corbusier, Narsingh Babu, and Angel Matos, among many others, and helped organize exhibitions such as", "The next Biennial should, as a general rule, be held within a local community center. The director of the institution should be an elected official of the local community. The Biennial should be organized around an internationally recognized theme, long-standing themes, and certain popular arts, including architecture, dance, and music. The Biennial should be a celebration of the culture and a celebration of life.”\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has released the list of seventy-five artists who have participated in its Metropolitan Museum of Art: First Annual, which runs through February 29. Among the artists chosen to represent the museum are El Faro, Tania Bruguera, Alberto Cipolletta, Sylvia Rivera, Alyson Donaldson, and Rosalind Franklin.The inaugural event, entitled The Metamorphosis, features artists from twenty-four countries, including Canada, New Zealand, and Mexico City. It is curated by Perrotin, which is based in the French Quarter of New York City, and exhibits works by thirty-five artists in a variety of media. The exhibition marks the Metamorphosis’s second edition,", "The next Biennial should also include a project on how the current temporary structure of the museum can be reconfigured into a building of various historical and contemporary interest\u0097a chance to re-create an urban core of European and North African art in London and explore how the museum might reflect the city in the form of the Barbican.The library will be a public space where visitors can have access to biographical books, periodicals, audio/visual works, and other collections by contemporary artists in the collection of the Barbican, The V&A, and the Royal Academy of Arts, with the aim of developing a better understanding of how the art world worked in the city.Visitors will have a variety of ways to experience the Biennial, including by going behind-the-scenes with artists, visiting the museum from May to October and then traveling to the museum to see works on-site, or by watching the exhibition from home. In addition to the biennial, the library will host a number of other programming that will be targeted at different audiences.“This is a significant moment for London, and the world at large, due to the opening of the Barbican Museum, the V&A, and the Royal Academy of Arts in the fall of 2020", "The next Biennial should be a celebration of the life and art of Louis Vuitton founder and collector Nicolas Ghesquière, who is eighty-five years old and has been battling pancreatic cancer for the last ten months. Ghesquière is survived by his daughter Sherry; his son Laurent; and his grandchildren Nicholas and Hugo.\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Ravi Rajagopalan as its new CEO and chairman. He succeeds Thomas B. Wilson, who led the museum for twenty-four years before being hired to lead the Museum of Modern Art (MoMA) in New York, which opened in 1991.“We are pleased to welcome Ravi to the MFA,” said museum director Christopher Ryan. “Ravi is a star leader at the institution, having served as the chair of its family for twelve years and having led the MFA through one of the most successful expansions in its history. He has the opportunity to continue to shape and extend our creative and artistic programs as we triumpen the biennials in 2020 and beyond.”Ravi reflects a new era for museums around the world as they strive to reconcile their contemporary visions with the ideals", "The next Biennial should focus on how political institutions, and not institutions, can serve as models for sustainable development. It should also address our cultural and physical infrastructure, such as museums and cultural sites and how we integrate art and design in the contemporary city. The Kingfisher, one of the oldest exhibition spaces in the United Kingdom, will be transformed by a new series of video works, “The Art of the Cities.” The theme of the show is “A New Connection: Art and Design in the Age of Black Power” and the first part of the exhibition will focus on the relationship between art and politics.The twenty-third iteration of the Biennial will take place at the Smithsonian American Art Museum (SAAM), Washington, DC. The museum will host the event from April 18 to April 19, 2020. The third part of the exhibition will be available to the public for free on April 16, 2020.\n\n\nThe Metropolitan Museum of Art in New York has appointed Karen DeLong as its next director. DeLong succeeds Alan Vinograd, who retired on May 30 after twenty-five years at the helm of the Met in March 2019. “I’ve been involved in museums for thirty years now, and the", "The next Biennial should be held in Buenos Aires in the spring of 2022. \n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, announced today that it is expanding its programs in support of the pressing issues of our time. It also unveiled the first of a series of new civic engagement projects conceived as part of the organization’s “Our Worlds Together: Art and the Divided World,” a multiyear platform that was created to bring together artists and activists around the United States to address critical issues facing society. The series, which consists of solo exhibitions, residencies, and other educational programs, will run concurrent with the upcoming seventy-fifth edition of the Venice Biennale. \n\nThe Smithsonian’s National Museum of African Art has learned that the institution has hired a senior curator to its staff of fifteen. Julia Sharp, who has served as assistant curator since 2015, will be the first curator to lead the institution’s collection of African art since Zika. During her tenure, she curated the exhibition “James A. Farley: The Untold Story,” which opened on September 28 and runs through October 8.“Julia’s work collaborates with and", "The next Biennial should be held in 2020. If it is to take place in the United States, it must be based on American principles. The biennial must not be complicit in the Trump administration’s policies. The future of the exhibition will therefore depend on the United States Congress and the president making the final decision.\n\n\nThe National Gallery of Scotland has announced that it will begin a two-year “refocus” program to prepare for a possible shutdown in March 2019. The sixteenth edition of the National Biennial, “The End of an Era,” will then conclude with a special exhibition of work by a select group of artists. The twenty-first edition of the National Biennial, “The Future of Art,” will then open to the public in May 2020.The decision to shift to a two-year cycle came after National Gallery director Elizabeth Ann Macgregor and chief executive officer Stewart Regan decided that it would be better for the institution to take a year off to fully reflect on the impact of the coronavirus on its business. “Our internal estimates at the moment are that the exhibition business will be very, very badly affected by March 2019,” said Macgregor. ", "The next Biennial should be held early next year.\n\n\nThe Progressive Arts Center (PACC) in Brooklyn, New York, has welcomed Tia Caruso, the inaugural director of the Brooklyn Museum, to its staff and board, along with a group of other New York–based artists, including Gabriel Garcia Marquez, Joyce Carol Oates, and Laurie Anderson, in a move that moves the institution beyond its original conceptualization as a center for contemporary art.“In the late 1960s, the Progressive embarked on the radical development of a new artistic model, a radical reworking of the museum’s art, the institution, and its programming,” said PACC board chair Joe Papp, who is also the former president of New York’s Museum of Modern Art. “Through a series of community-led initiatives, the museum became an influential center for artistic experimentation and discourse in the city, and continued to evolve as a creative hub for artists.”The museum’s new role will allow PACC to expand the museum’s archival and research ambitions, explore how art history can be reconsidered as a vehicle for social change, and strive to create a permanent home for the collection and display of the", "The next Biennial should take place in 2022–19. \n\n\nThe Contemporary Art Museum Miami (CAMM) has announced the opening of its new destination, Contemporary Art in Miami (CAMM) Miami, as a permanent feature of the institution. The new exhibition will showcase new work by emerging and established artists, organized by regional or national audiences. The first show will launch on October 3 with the installation of the work of Lauren Vaisman, The End of the Line, in conjunction with the 2019 Miami ArtWalk. The show will then move to the Museum of Arts and Design, during which time the museum will have a redesign that will introduce new public programming.CAMM’s new home is accessible by car, and will be situated on the first floor of the museum. The $50 million renovation project, which is being funded by the $2 billion CREATE Miami initiative, includes a new, expanded lobby, lobby and galleries. The new building will also feature a larger courtyard, a garden, and a new building for a new, expanded gallery.CAMM’s original location on South Florida’s fifth largest boulevard, Miami Beach’s FIT Center, was recently acquired by the property developer, G", "The next Biennial should be held in the spring of 2021.” \n\n\nThe Los Angeles County Museum of Art (LACMA) has received a gift from a group of American sculptors who, after years of speculation, had donated their works to the institution. The work, a portrait of the artist Nene H. Beck, was donated by a group of twenty-six artists, including Emily Hall, Joe Haldeman, Rintoul, and Tate Britain, and was on display in a group show “Nene Beck: Surrealist” in the museum’s main exhibition “Art’s Past.”The gift comes a year after the Cooper-Hewitt, Henry Luce, and Elgin John Gallery in New York, which was also tapped to create a new exhibition, “Nene Beck and the Painter” (2019), “Nene Beck: The Painter” (2019), and “Nene Beck and an Embryo.” The show will open on October 20, 2020. The exhibition is a followup to “The Surrealist,” which opened at the gallery in 1985 and served as the foundation for the first Biennial.", "The next Biennial should be held at the New Museum in New York. “We look forward to working with the New Museum to further develop and articulate the history of the term ‘alternative history.’”The Paris-based organization Design Bureau, which has a long history in the art world, also welcomed three new members: the artist and curator Rachel Cloutier, the designer Christophe Augouil, and the author and curator François-Xavier Ghebaly. The group will form the basis for the inaugural exhibition, “Between Two Worlds: Modern Art and Contemporary Art” at the Bourse de Commerce in Paris.Cloutier, the former director of the contemporary art research institute Rashid Johnson, and the Paris-based designer Christophe Augouil will present “The Bishop: A Retrospective,” which will take up the theme of a royal palace in the city of Algiers, in February 2021. Cloutier and Augouil are among several established French artists who have recently found success in the United States. Their work has been exhibited at the Museum of Modern Art, New York; the Museum of Modern Art, London; the Metropolitan Museum of Art, the Museum of Modern", "The next Biennial should focus on “meme,” DiCaprio told the New York Times. “I think we need to start from the premise that art is a universal language and then explore how different genres communicate with each other. The number one mistake we make is we speak the same language, but we don’t talk the same language.” More details about this year’s inaugural exhibition can be found on the Museum of Modern Art’s website.\n\n\nThe Museum of Contemporary Art (MoCA) in Chicago has announced that it plans to make substantial cuts at its two locations, both by mid-March, in order to reduce the museum’s holdings of cultural artifacts that display racist, sexist, and antiscientific practices. The first cut is a half-million square feet at the museum, which sits on the South Side, in an effort to reduce the collection by half. During a March 7 press conference, MoCA director Brian Lynch said the museum is making the changes in order to “reach for the heart of the matter,” which he says will decrease the museum’s “reach toward larger issues of race, culture, and politics.” The news comes on", "The next Biennial should take place in 2022. The Art Newspaper reports that the 2019 exhibition, Dame Angela Rops-Davis’s Gold Rush, won the 2019 Artist Award for Outstanding Art.Rops-Davis, a Harlem-raised artist, was chosen for her installation Artists’ Body in Sculpture, 2016, a sculpture by Jessica Morgan that remains on view in the exhibition’s permanent collection. The work was a part of the Biennial’s “To Kill a Mockingbird” series, which was organized under the leadership of the then-new director, Helen Thomas.\n\n\n\n\n\nArt Basel, the London and New York fairs that are hosted by the British high-tech conglomerate ASG, has announced that it is planning to push back the opening of its first edition, currently slated for March 2021, by at least a year. The April 20 launch of the next edition, slated to take place in London in February 2022, has been postponed to March 2022. “The reopening of the 2020 and 2021 fairs will remain part of the 2020 and 2021 plans, and any subsequent delay will be down to the integrity of the", "The next Biennial should be held in 2021. The next edition will be held at the Art Museum Zurich. The next edition will take place at the Fernseher Kunsthalle. Daniela and Kjetil have teamed up again with the Kunsthalle Basel to present the World Exhibition for Young Artists (WYAGA), an exhibition which will focus on the art of young artists. “We are thrilled to collaborate with the Kunsthalle Basel to present this exhibition, the very first biennial of the Kunsthalle, and to have the opportunity to collaborate with WYAGA, one of the major contemporary art centers in Europe,” Daniela said. She added: “A new collaboration is needed to explore the possibilities of contemporary art and to offer the exhibition the audiences it deserves. The partnership between Kjetil and Daniela is a first in the history of the Kunsthalle. We are already working with the Kunsthalle Basel to present WYAGA, and I believe we will continue to do so with other local and international galleries.”\n\n\nThe Los Angeles County Museum of Art (LACMA) has pledged $9 million to help the Culver Laboratory (CL) establish", "The next Biennial should be held in May 2022. The next edition will focus on the history of art from the 1920s to the present. The theme of the first exhibition was “The Sustainability of Art.” The second will focus on the history of art from the present and will be organized in a “spirit of cooperation” with the theme of the symposium.\n\n\nThe American Ballet Theater (ABC) has appointed Jennifer Schore as its next director and CEO. Schore comes to the organization from the Kansas City, Missouri–based company American Ballet Theatre (ABT) as the company’s first female director. She succeeds John Mulligan, who will remain at the helm of the company as president and CEO, and will begin her position this month.“As a new co-owner of the American Ballet Theater, I’ve enjoyed and driven constantly by the successful leadership of John and Susan, and the collective vision of our artists,” said Jennifer Schore. “I’m eager to take on new challenges with our talented and dedicated team, and to continue to advance the organization’s work in a socially conscious and visually-oriented way.”Schore", "The next Biennial should be held in 2022; however, given the current precarious situation in the world, this has not been ruled out. The decision to postpone the exhibition was made in light of the coronavirus outbreak, a financial crisis caused by the economic collapse and turmoil caused by the pandemic, and the ongoing suspension of the exhibition in many countries. Over the past few days, several art-world exhibitors, including London’s Tate, the Los Angeles County Museum of Art, and the San Francisco Museum of Art have announced they are postponing upcoming events. “We are collaborating with our partners to make sure we have a show for our exhibitors in December,” said Francis Imbib, head of the Hong Kong Contemporary Art Gallery and the Hong Kong Exhibition and the Hong Kong Film Festival.  The Hong Kong Film Festival, which was set to run from December 16 to January 3, will now take place from March 21 to March 28. Last week, Hong Kong’s Art Deco Museum announced that it would cancel the exhibition “1919: The Decadent Century” due to the pandemic. The institution cited the coronavirus as the reason for the cancelation.\n\n\n", "The next Biennial should deliver a creative and experimental program that incorporates the work of an international group of emerging and established artists.”\n\n\nThe B.C. Museum of Anthropology (B.C. MoA) in Vancouver is launching a New Year’s resolution to help combat the coronavirus. Its new initiative, called “This Is Our Year,” will challenge people to envision a better future for the institution and its cultural heritage. The theme of the year is “scarcity,” and the 2020 iteration will feature works by twenty-four artists.The 2019 edition, “This Is Our Year” featured work by six artists, including Jen Hsu, Emily Nussbaum, Nari Ward, and Hsu Mei, as well as the work of thirteen other artists. Only “This Is Our Year”’s second work, “The Meaning of Life” was presented by an international group of artists, including Junya Ishihara, Liu Xiaochuan, and Daisuke Murata. “We are confident that this year’s biennial will encourage people to reimagine the future through work,” said Biennial Director", "The next Biennial should be launched on March 20, 2020. The exhibition will consist of twenty-four works and will be housed in the Museo Nacional Centro de Artes Plásticas de Buenos Aires (BCAC).The exhibition will be curated by Vincenzo Cipolletta and will consist of forty-two works by contemporary artists in the Buenos Aires region. The opening of this exhibition marks the 60th anniversary of the founding of the Argentine Biennial.Since its inception in 1964, the Argentine Biennial has been an award of twenty-four works by artists from all over the world. It is the longest-running exhibition of work in Latin America.  For the artists selected to represent Argentina, the exhibition will celebrate the fifty-ninth anniversary of their exhibition “Quarantine” in New York in the year 1963. The announcement of the artists selected for the exhibition was made on March 9. The twenty-six artists chosen by the BCAC to represent Argentina were Alejandro Jodorowsky, Pedro Alves, Bartolomeo Lopes, and Yinka Shonibare. The artists selected to represent Argentina are:Alfonso Ros", "The next Biennial should be held in 2021. The exhibition, titled “Anthropocene: From Theory to Reality,” will be staged at three locations: the Museum of Fine Arts, Boston, the Museum of Modern Art, New York, and the Museum of Contemporary Art in New York.“We are deeply grateful that the eighteen galleries that participated in the event’s first edition, which brought together twenty-seven international artists, are able to participate again in the 2019 edition,” said Chase Masters, director of the show. “This year’s exhibition ‘Anthropocene’ has been a testament to the transformative power of art and the global context in which we live. The exhibition is an opportunity to spotlight the work of marginalized artists and to enable them to tell a larger, more complex story about their practice, their subjects, and the world.”The 2019 edition featured work by twenty-seven artists, including Adam D. Salter, Rosalind Nash, and Natasha Lacy, among others from twenty-eight countries, and was organized in collaboration with artists in the United States, Europe, Japan, Mexico, and Hong Kong.\n\n\nThe series, which took place in the city of", "The next Biennial should be held in 2022. \nPosted by: Christina Garza at September 22, 2018 09:00 AM\n\n\nThe Museum of Fine Arts (MFA) in Miami Beach, Florida, has appointed Richard M. Walker as the next director of the museum. Walker comes to the institution from the Diller Scofidio + Renfro–designed Museum of Fine Arts (MFA) in New York, which he has led since 2011. He succeeds Peter W. M. Katz, who retired in March 2019 after twenty-three years at the helm of the institution.“In his new role, Richard will assume the role of biennial director for the museum of fine arts in Miami Beach and will serve as a bridge between the institution and the city’s cultural community, helping to shape the next iteration of the museum’s MFA, which will open to the public in 2021, and expanding the museum’s programs and community impact,” said MFA director Robert D. Wilson. Maria D. Moretti—who has helmed the institution for twenty-four years—also praised Walker’s appointment. Walker succeeds Ronald C. Clarke, who will continue", "The next Biennial should take place in the French countryside near the Grand-Duc Jean, in the Seine-Maritime, between May and November 2019.  The event will include a retrospective of the artist’s work, a presentation of Behind the Lenses, an exhibition of photographs showing the artist’s work, and the artist’s Utopia, a trans-Atlantic cultural experiment. The 2020 edition will be staged at the Palais de Tokyo in Paris.\n\n\n\n\n\nOlivierangelo da Vinci, 21, and his family, including his father, Piero da Vinci, have been accused of wealthy tax evasion and money laundering by Italian prosecutors, the Corriere della Sera newspaper reports. In a statement, the da Vinci family said that they “taken all measures necessary to protect the family’s interests and did not try to hide their financial dealings.”The family claims that the investigation revealed that three of the da Vinci brothers were involved in an online auction in June 2019 and that they paid an Italian company Italiano di Finanza, the company that performed the transactions in question, approximately $3.8 million (€2.5 million).", "The next Biennial should be held in 2020 and will consist of twenty artists in twenty-four cities around the world. The project that was selected as it was championed the work of more than 100 artists and was supported by a $10 million grant from the Tate.\n\n\nThe Metropolitan Museum of Art in New York has appointed James Gandea as its next director. Gandea currently serves as director of the Art Institute of Chicago (AI), where he is responsible for the development and implementation of new and existing research and exhibition programs. He succeeds Carol Hamlyn, who retired on December 31 after ten years at the helm of the museum.“James is an accomplished curator, scholar, and educator. He has been a leader in the field of art and the Met for over twenty years and is regarded as a leading scholar of the technical and conceptual aspects of contemporary art and architecture,” said Adrian Warshaw, the museum’s chief curator and director. “With his extensive experience and knowledge, he will be a great addition to the Met’s talented and dedicated curatorial team.”Hamlyn, who was the museum’s executive director for twenty-nine years, will continue to work with AI on curating and exhibition programming,", "The next Biennial should take place in the spring of 2021. \n\nThe Taiwanese artist Ai Weiwei, who died in 1969 at the age of eighty-six, was a disciple of the German avant-garde painter Franz Kline. Together with Friedrich König, Kline made the first pair of works, “Amber and Teal,” in 1973. They “re the first works of A.W. in which the whole body and the sky are combined in a single work.” The next iteration, “Ai Weiwei” (2018), comprised forty images.The exhibition “takes a new perspective on the painting, drawing, painting, sculpture, and sculpture-making,” said Ai Weiwei. “With the exhibition ‘Ai Weiwei’s theme ‘Spirituality and the Body,’ the show is concerned with the opposite of what is internal: the body and its relations with the external world.”\n\n\nNew York’s Whitney Museum of American Art (WMAA) has received a gift of more than two hundred artworks from the late Israeli philanthropist Eyal Weizman, whose vast collection includes more than seven thousand", "The next Biennial should be in the Spring of 2022. It will be hosted by the Museum of Contemporary Art in Minneapolis. “We are excited to further support the work of artists and bring them together with our audiences, partners, and friends in a more permanent, meaningful way,” said Museum director Elizabeth B. Kremer. Acknowledging that she has never been a paid curatorial staff member, the artist was awarded a commission to create a new installation for the upcoming exhibition. Katja Pfeifer, the winner of the fourth Biennial, and Wolfgang Tillmans, the winner of the third, were also nominated for prizes. Commenting on the Biennial’s first edition, Kremer said: “The subject of this exhibition is a critical one for me as I seek to tell stories of the many aspects of our lives that are more easily absorbed or controlled. With my partner Wolfgang Tillmans, this exhibition is about to begin. Together we will create something new and new at the Biennial that will challenge our audiences to think different ways about the world.”\n\n\nThe Metropolitan Museum of Art in New York has received a partial gift of more than three hundred photographs by Pablo Picasso,", "The next Biennial should be held sometime in the second half of 2021, according to the Art Newspaper. “It is a pity that the forty-eighth Venice Biennale will not have a new theme. The theme should be about creativity and exchange, about art as a tool of inquiry, about the visual arts, and about new history.”\n\n\nThe Museum of Fine Arts (MFA) in Boston announced today that it is working with the Windham Museum of Art in Massachusetts to create a new public space for the restoration and exhibition of classical works of art. The partnership, which also involves the restoration of three new works, was established to further enhance the institution’s collection while also expanding its public gathering spaces.“The partnership between the Museum of Fine Arts and the Windham Museum of Art is a wonderful example of how an arts institution can work with a civic, community-based organization to improve the physical environment in both locations,” said museum director Joseph T. Collins. “This partnership truly puts the Windham Museum of Art in a new light.”The relationship between the two organizations began when MFA and the Windham Museum of Art were working together to preserve the collection of the late Charles Rizzo", "The next Biennial should be a celebration of the multidisciplinary art and culture, and humanism, in New York City, and the City of New York. It should also include the first exhibition dedicated to the artist-led nonprofit New Yorkers for Culture, a platform for open dialogue with the city’s art communities.“The city of New York is one of the few large metropolitan areas in the world that has been able to sustain and grow a living art ecosystem for more than a century,” said Mayor Bill de Blasio, who also noted that the city’s investments in arts education and in training for future generations of art workers have made it a prime location for new works by established and emerging artists.The city’s other major works by artists to-do lists include John Mattson’s Prescription for Destruction (2019), which was installed in a Manhattan public space and streamed live on Facebook, and the city’s ongoing renovation of the city’s Public Theater, which opened in the summer of 2012.Earlier this year, de Blasio announced the launch of a $1.2 billion arts and cultural revitalization plan for the city, which will also include the construction of more than 1,000 new affordable", "The next Biennial should be held in 2022.\n\n\nThe Tunis Museum of Art (TMA) has appointed Abdelkrim Ben Hadi as its new deputy director of exhibitions. He will be tasked with leading the institution through a major renovation project, which will also include the opening of several new exhibitions. He succeeds Khaled Esseghaier, who was appointed as the interim director of the TMA in March of 2018 following his resignation due to complications from a brain aneurysm.“With his knowledge of contemporary art, Hadi is well positioned to ensure that the TMA remains an active and vibrant cultural institution during the transition to a new and improved Tunis Museum of Art,” said Tamer El Mahroug, the TMA’s director.Hadi comes to the institution from the Tunis Museum of Art (TMA) in Saada, where he has been a visiting professor. Since joining the museum in 2007, he has established a reputation as a scholar and educator who inspires large crowds to visit his international network of studios. He was awarded the Düsseldorf Prize for academic excellence in 2016 and has also received the Algerian National Award for National Teaching in Literature and the Tunisian Museum of Modern Art’", "The next Biennial should take place in 2020. The first, titled Art and Beauty, is currently on view in Bali.\n\n\nThe Metropolitan Museum of Art announced today that it will reopen as the Met for a third year, from February 27 to March 13, 2020. The event will be hosted at the museum’s new home on the Upper East Side. The first program, titled The Met: A Year of Art, will present works by sixty-five American artists, including Andy Warhol, Robert Irwin, Frank Gehry, Frank Gehry & Partners, and Mark di Suvero, and will run concurrently with the annual Art of the Party, held on Saturday, February 8, at the museum.The third edition of The Metropolitan will take place at the museum in 2020. The museum opened in 1970 and has ever since been a center for the exploration of art in the United States. The fourth edition of The Met, titled The Met: The Year of Art, 2020, will also be on view until January 5, 2021. The fifth edition of The Met, titled The Met: The Year of Art, 2021, will be on view from January 5 to January 16, 2021."]