["The next Biennial should focus on the history of the Pulte Group, which operates the Pulte Palace in Rome and owns the Palazzo Veneto, the Pulte Museum of Art, the Venice Architecture Biennale, and the Pulte Centro de Investimento della Città, which is in the construction phase. The Italian government has committed $1 billion to the project in the first year, and it expects the infrastructure to be completed by 2020.Among the museums that will receive funding are the Pulte Museum, the Pulte Castle, the Pulte Tretta, and the Pulte Museum of Art. The Pulte Group, which also owns the National Museum of Fine Arts in Florence, the Vittorio Emanuele Collection in Milan, and the Pulte Museum of Art in Milan, in addition to its main campus in Rome, has been working for decades to raise funds for the construction of the museum. In 1986, the Pulte Group collaborated with the Italian government to create the Pulte di Rivoli, which will host the museum as it has for the last fifteen years. The Pulte di Rivoli will also house its collections of Artworks", "The next Biennial should include a performance based on an original work commissioned by the artist, and should give the opportunity to the public to discover the work through the artist and visual arts. The presentation of the work should reflect the artist’s aesthetic preferences. The artist will create a work for the exhibition, which will be held in the artist’s studio, and the work will be presented in collaboration with the artist, the museum, and the artist, in collaboration with the artist and the artist’s authorized representatives. The artist will receive a commission fee of $15,000 for the exhibition.Carlos Vigo, president of the Buenos Aires Biennale, said: “We are delighted that the exhibition was renewed for the twenty-fourth edition of the Buenos Aires Biennale, and that this year’s theme 'The New Temple: Converting the Past to the Present' can be applied to the artist’s own life. It will be the artist’s tradition to be there.”\n\n\nThe Los Angeles County Museum of Art (LACMA) is asking the National Association of Theater Companies (NATCO) to create a new model for managing the multimillion-ticket event in an attempt to", "The next Biennial should take place in the USA in 2021.\n\n\nThe United Arab Emirates has appointed Qasim Rashid as its new ambassador to Israel. Rashid will be responsible for promoting and promoting UAE interests in Israel and for organizing events and meetings in Israel with a view to promoting the UAE’s interests in Israel and the UAE. He will be based in Abu Dhabi.The new role was created through an agreement between Israel and the Gulf Arab nation in 2016. Since then, the UAE has been the largest donor to the Israeli arts and has provided around $6 billion to the country.In his new post, Rashid will oversee the development of the UAE’s ties with Israeli institutions and will be responsible for seeking out and promoting the artists and thinkers from the UAE who are committed to fostering a more balanced and diversified international order. He will also focus on interreligious and interfaith dialogue and cooperation.Rashid will take up his post in the UAE on January 13.\n\n\nThe Birmingham-born American artist, curator, and educator, Tanya Bonakdar, has been appointed the next president of the Guggenheim Cultural Foundation. Previously, she served as a curator at the Museum of Modern Art in New York and as", "The next Biennial should be announced in March 2019, so don't miss out on a great selection of works this year.\n\n\nThe right-wing American Family Association (AFA) in New York City has declared that the upcoming edition of the Big Apple’s Yuz Museum as well as the upcoming NIRIN festival are in danger of being shut down by the new anti-terrorism legislation. “The AFA anticipates that the Yuz Museum will remain closed throughout the duration of the legislative fight, and the NIRIN Festival will be postponed),” reads a statement issued by the organization. The statement states that the decision to cancel the three events has nothing to do with safety concerns, but is made in order to allow the Yuz Museum and the NIRIN Festival to continue as planned. The national ACLU chapter in New York City is urging the city council to pass a temporary spending bill that will allow the city’s museums and cultural sites to reopen and to force a shutdown of the city’s government offices during the government shutdown. Amanda Marcotte, the author of The Devil in the Details: The Obama Administration, Slavery, and Slavery Revisited and a regular contributor to Salon", "The next Biennial should be held in Helsinki in 2021. The European city’s cultural heritage organization, the Fondazione Prada, said that the institution would be “guaranteed €3.5 million.”The institution is also planning to build a new museum in the capital of the Finnish archipelago, Helsinki. The new museum, designed by architect Pia Kallio, will open in 2021. The institution’s current exhibition space, the Biennial of Contemporary Art, will remain closed through 2022.\n\n\nThe National Gallery of Art in Washington, DC, has received a gift of forty-six works from the 1939–1945 campaign. The gift includes works by fifty-six artists whose work was featured in the exhibition “Against All Odds: ‘Sidney and the Harlem Renaissance’” (2017) and “Art and Life in the 1930s” (2019). The National Gallery of Art says that it is fully committed to continuing to present performances, exhibitions, and other programs in the collection and that it appreciates the contribution of the war artists.The work that is the most recent to receive a gift from the campaign is a series of photographs by Joan Miró that are", "The next Biennial should be staged in 2021.\n\n\nThe National Geographic Society in Washington, DC, has received a donation of $6.7 million from the Rockefeller Brothers Fund in support of its expansion into a new three-building, five-hundred-year-old museum, after the institution unveiled its new Hudson Yards development, the Hudson Yards Museum of Art. The funds will also help fund the redesign of the site, which will include a new library, a café, and a conference center, and the renovation of the existing museum.The gift includes $3.7 million for the redesign of the existing building, which was completed in 2018 and opened to the public in March 2019. The museum’s current exhibition space, which is located in the Hudson Yards development, will be expanded into a larger space, which will share the museum’s expansive 1,200-foot-long, limestone building. The museum will create 80 percent of the space for the arts and will add four new galleries and galleries, as well as a meeting and social space, a lecture theater, and a rooftop terrace. The remaining 20 percent will be used for education and community activities, and will be dedicated to the collection and research of its more than 1,500", "The next Biennial should be held in May 2021.\n\n\nEbony & Ivy, London and New York, 2019. Credit: Courtesy of the artist and Burning Man. \n        \n\n\n\n\nThe Metropolitan Museum of Art in New York is planning to pull the plug on the Egyptian Museum in Luxor and its Egyptian director, Tal Ben Emad, after he criticized the country’s new constitution, called a new political party, and presided over a coup in April 2019, the New York Times reports.In a statement on Sunday, the museum said: “We are aware that [Ebony & Ivy] is not a museum for everyone, and has a long history of engaging with politically sensitive issues. We deeply regret that this has resulted in disagreement between us. . . . We will continue to explore all options to ensure the Met’s approach is in line with our values and with our mission.”The decision was made after a special meeting of the board of trustees of the museum on April 22, which was attended by staff, members of the board of advisors, and the museum’s executive director, Nick Mitzevich; director Matthew Wilson; senior museum relations officers Beth G", "The next Biennial should be released in 2021.  The biennial will examine interactive art and the role of technology in the contemporary life of northern, central, and southern Turkey. Its theme will be “Art and the Digital Age,” a reference to the new Digital Autonomous Zone (DAA) in Istanbul that will bring together cutting-edge technology and art and will be led by Kültür Umit, the director of the Ankara Art Center.\n\n\nThe Venice architecture biennial has released its list of thirty-eight winners, which showed in the exhibition’s fifth edition at the Venice Architecture Biennale between September 25 and October 28, 2019. The sixty-two artists who were shortlisted for the prestigious honor\u0097which is currently offered by the jury in a prize exhibition at the Venice Architecture Museum every September\u0097were awarded the prestigious prizes Award Grand Prize, MUSEAS de BERMA, Madrid, in April and CASIMET, Milan, in March.The art works featured in the exhibition were chosen by a committee comprising Elvia O’Grady, the director of the museum; María Elena Salerno, the artistic director of the Corriere", "The next Biennial should address the current state of art, history, and ideas in the museum, and will then focus on a collective aesthetic vision created by the member artists, the museum, and the institution. The exhibition will also include a reflection on the Biennial, its history, and the future of the museum.The Biennial’s first iteration, “Fifteen Years of Curating in New York City” (2017–18), included works by artists such as Steve Donoghue, Zina Saro-Wiwa, and Jhumpa Lahiri, and was organized as a “community show.” The institution also exhibited a retrospective of work by artists such as Sarah Frankenthaler, Elin Rankin, Mark Ware, and Joya Dusu, and received curators’ recommendations for the third and sixth editions of the Biennial, “Twenty-Five Years of Curating in New York City” (2015–16 and “Countdown to Infinity” (2019), among other works.In a release announcing the return of the Biennial, Barbara Kastner, chair of the exhibition, said: “The fourth and fifth editions of the Biennial were enormously popular and", "The next Biennial should be held in 2021.\n\n\nThe Museum of Modern Art (MoMA) in New York has released guidelines on how it should engage with the Black Lives Matter (BLM) movement, urging its curators to take a more nuanced approach to engaging with activists and organizing.Following a two-week public workshop in September, the museum is now requiring all new exhibitions and programs to address the import of the movement, which has sparked nationwide protests from civil rights leaders and law enforcement officials. The move follows the September 14 killing of George Floyd by Minneapolis police officer Derek Chauvin, who was cleared of any wrongdoing by a grand jury but remains embroiled in an ongoing investigation by the department. In February, the institution held a public workshop on racial injustice; the themes of the week-long event included the legacy of Martin Luther King Jr., the Black Power movement, and Hurricane Katrina.In order to address the movement, the museum is proposing a new three-part series, “Roots of Protest: Black Radical Thought and Black Struggle” (2019), “Black Radical: Theory, Art, and Protest” (2019), and “Roots of Resistance: Resurgence of Black Consciousness” (2019). The museum", "The next Biennial should be held in the spring of 2020. The 2020 theme is The Path of the Body, and the first Biennial will showcase the work of twenty artists. The 2019 theme was Life and Death, and the 2019 event was The Path of the Body, which is a combination of nine themes.  The biennial will also present the work of Janet Nasher, and Rob Breder, and will commemorate the centenary of the exhibition, Art and the Body, with a series of special exhibitions. The 2019 event was organized by the Biennial Foundation, which is a nonprofit organization that supports the work of artists worldwide and is run by a board of directors comprised of Michael L. Lappin, Ph.D.; Sky Ferreira, M.D.; Bradley Manning, M.D.; and Wangechi Mutu, M.D., and featured work by more than fifty artists. The 2019 event was held on the twenty-fifth floor of the Aichi Museum of the Art of the Pacific (A.M.A.P.) in Nagoya. \n\n\n\n\n\n\n\nKota The Dragon 🐜Touched by", "The next Biennial should culminate in an exhibition of work by twenty-one artists, including Ricardo Campos-Gutierrez, João Figueroa-Silva, and Hélio Oiticica, which will take place on January 7, 2021, at the Ateneo Art Museum, Tokyo.\n\n\nThe Lebanese-born, New York–based artist, architect, and educator, Tarek Atoui, has won the second edition of the Beirut Biennale, which will run from March 25 to March 27 in the city. Atoui, whose work explores issues such as architecture and the future of architecture, landscape, and urbanism, was selected as the winner of the Prix de l'Arles, which was established in 2009 by the French and Lebanese governments to recognize artists who have demonstrated exceptional excellence.Previous winners include Sarit Michael, Tarek Atoui, Elia Salami, and Hisham Ashrafi. The artist and educator was nominated for this year’s Prix de l'Arles and was chosen as the winner of the 2014 Prize for his work “City of Flux,” which was also included in the exhibition “Themes of Cities,", "The next Biennial should take place in the fall of 2020.”The competition, which was established in 2008 to help Biennials secure jobs in the arts, has faced criticism for focusing on positions that are scarce and for excluding those with a disability.  The honor of making the biennial was bestowed by Markus Ruiz, director of the Centre for Contemporary Art at the Universitätsklinikum in Berlin, who said: “I want to thank Rick, Sigrid, and Ann for their candid and sensitive participation in this exhibition, and for their outstanding exhibitions at the exhibition as well as their ongoing leadership in the exhibition field.  Indeed, their exhibitions have provided the platform for this exhibition. They were instrumental in making this exhibition possible and for the exhibition, which has been inspired by art from around the world.”\n\n\nThe SculptureCenter in the City of New York has received a gift of twenty-six works by thirty-four artists, including Ellsworth Kelly, Carleton and Coleridge, John Worden, and Pierre-Auguste Renoir, from the contributions of John La Salle, Eileen Parrish, Wangechi Mutu, and Lewis Waxman", "The next Biennial should take place in May 2020. This year’s event, “Unity,” was founded by artist and curator Ron and Ruth Annenberg and will present a collection of the first exhibitions dedicated to the themes of civil rights and gender equality. The exhibition will cover topics such as slavery, human rights, feminism, and environmental justice.“Our team is deeply inspired by the incredible breadth of cultural knowledge and expertise available in these contemporary times,” said Allen. “We are thrilled to bring our talents and expertise to the sacred Proyectos, to invite and to deliver to the communities of Mexico City and the surrounding region. We are looking forward to working with the artists and curators, the community, and the staff and to connecting with our visitors, the artists and designers of the exhibition, and to to to celebrating our rich heritage and doing our best to serve it.”Commenting on the future of the exhibition, Allen said: “We are excited about the collaboration with the artists and designers of the exhibition and the exhibition’s third edition, which will draw from the collection and will be the first exhibition dedicated to the themes of gender and civil rights in Mexico City. We are also excited by", "The next Biennial should be held in 2021.\n\n\nThe Museum of Contemporary Art (MCA) in Los Angeles has retained the Adams Young Art Museum of Art in New York for its 2021–22 season. The institution announced the decision on its website on Monday, April 19, in an announcement that is dated March 31 and comes courtesy of Los Angeles Magazine.Since its inception, the museum has presented works by artists such as Edward Kienholz, Calvin Harris, and Tobias Knepper. It also has staged the first major reopening of its Los Angeles location in 2017. Inaugurating the museum will be a public celebration of the museum’s centenary, which will take place on April 4, 2021. The event will be led by director Michael W. J. McCarthy and will run through May 21.“The Adams Young’s performance and interpretation of the Adams Family Art, which were primarily created in the 1920s, has been especially rewarding to work with,” McCarthy said in a statement. “Our dedication to them and their legacy has been guided by the fact that the Adams Family Art has an enduring and rich legacy of artists working today. It is our mission to live up to that legacy with our public art", "The next Biennial should take place in 2022.\n\n\nThe Museum of the Jewish People (Museum J-1) in New York has received a gift of seventy-one works, including paintings by the Jewish American artist Laurence Boudin, who was one of the main force behind the challenging and ultimately unsuccessful exhibition “Open Eye” at the Museum of Modern Art in New York in 1967, and its namesake, the late German-born architect Jakob Frank, an important architect of the post–World War II era.The gift, which was made by the SculptureCenter in New York to the museum in honor of its founder and namesake, was made in memory of the museum’s longtime curators, Charles and Erika Frank, who passed away in 2017. Charles Frank, who founded the SculptureCenter in 1971 and died in 2007, was a close friend and mentor of Jakob Frank. In honor of their friendship, the museum gifted Charles Frank’s wife, Erika, the deaccessioned works of Jakob Frank.“Together they have created an exhibition of extraordinary breadth and depth,” museum director Michael Rosenberg told the New York Times. “This gift brings an end to a series of", "The next Biennial should be held at least three years after the expiration of the current contract. The biennial’s selection committee will also be responsible for selecting the sixty-seven artists selected for the final edition, which will be staged in March 2020 and will be held simultaneously with the Hong Kong Art Festival.\n\n\nThe San Francisco Museum of Modern Art (SFMoMA) has hired Jennifer Talbot as its next executive director. Talbot replaces Tina LaBoeuf, who retired in March 2019 after seventeen years at the helm of the museum. In her new role, Talbot will oversee the implementation of the recommendations laid out in SFMoMA’s 2016 budget plan, which were released on January 31.“Jennifer brings a wealth of institutional knowledge and experience to SFMoMA. She has been instrumental in transforming SFMoMA into a world-class contemporary art museum and has helmed the institution through a period of unprecedented change,” said SFMoMA director Angela Ghesquière. “This is a period of great transition for the museum, and I’m confident that Jennifer’s leadership will ensure that SFMoMA continues to thrive under her leadership.”Prior to joining SF", "The next Biennial should be a clear-eyed reflection of this years program, set in a contemporary and international setting.  The next Biennial will be a celebration of the rich and diverse collections of this decade that will engage with the themes set forth in the past. The future of the Biennial is assured.\n\n\nNew York’s Metropolitan Museum of Art (MoMA) has appointed Benjamin Siegel as its next director. Siegel currently serves as the director of the Charles Egan–designed St. Louis Contemporary Art Museum and is a member of MoMA’s board of trustees. He is also the author of “The Metropolitan and the Met: The New Art of the City,” which was published by the Museum of Modern Art in 2017.Siegel’s new role will begin in July and will involve the development of the museum’s collection strategy, institutional architectural design, and financial management, among other aspects of the museum. Prior to joining MoMA, Siegel was director of the Hayden Planetarium in New York and is a member of the board of trustees of the Jerome and Donna Karas Foundation in New York.“Benjamin Siegel is one of the most highly respected and highly regarded art", "The next Biennial should be held in 2030 and will include twelve artists, including Ola Babu, A.P. Baliga, Bojana Baig, and S.S. Malhotra, and will be held at the Kunjuku Museum Nishinoshima in Nagoya.\n\n\nThe Rema Hort Mann Foundation in New York has released the list of thirty-eight artists who will be featured in its second biennial, “The Life and Death of Pablo,” in September 2020. The show will feature works by seventy-five artists who have died since the artist was killed by a man named Daren M. Williams, who was released from prison in 2008 after serving eighteen months for beating his wife and four of his sons to death, was set to open in April. The seventy-three-person jury comprised of art historian Christopher Rynd, curator and artistic historian Jane Panetta, curator and artist Rarry K. R. Allen, filmmaker and artist Bill Griffiths, and the curator Mary Shea selected the thirty-eight artists for the exhibition.The sixty-three-story Whitney Museum of American Art is planning a major renovation of its building, which opened in 1931, which will include the construction of a gallery,", "The next Biennial should be held in 2020. \n\n\nFrieze announced today that it has created three new positions within its international curatorial team. The positions, which were created through a grant program, designate a new artist-in-residence for each of the sixteen corners of the globe. The artist-in-residence will be responsible for contributing to Frieze’s 2019 edition, which was held at Gallery Therapy and will open to the public on November 27.The program, which was launched in 2015 by Gavin Brown, Ed Moses, and Oui Oui, raised more than $100,000 for the project, which is being helmed by Sarah Nolan, the curator of contemporary art at the Hammer Museum in Los Angeles.“The current exhibition is a combination of original conceptual thinking and imaginative experimentation, and the upcoming edition is an exciting opportunity to think about and create a new work for Frieze New York,” said Sarah Weinberg, artistic director of Frieze. “The new roles will allow us to think about and rotate through contemporary artists, as we continue to develop our exhibition program in collaboration with our curators and artists. Our curators and artists have a unique vantage point on the work of all", "The next Biennial should take place in 2020.\n\n\nThe Art Newspaper reports that the New York Department of Cultural Affairs (DCLA) has approved a new $500,000 grant program to support the creative and cultural industries. The program will provide $200,000 to artists who are working in the arts, including theater, film, and print; $100,000 to musicians; and $75,000 to designers. The funds will be distributed through the Arts in Support of the Arts (AIS), a new $250,000 fund established by congressmen James A. Clyburn, Jr., of South Carolina, and James E. Clyburn, Jr., of North Carolina.“This is a moment of great change for the creative and cultural industries,” said Clyburn. “This year’s grant program will provide a critical lifeline to thousands of artists across New York City and beyond—a program that will allow them the financial means to pursue their creative and cultural careers and afford them the financial support needed to make the most of their opportunities.”The grant program was established in 2007 to help small and mid-size New York City arts organizations become financially independent from large arts institutions. The grant program is a combination of", "The next Biennial should take place at the Museum of Modern Art, Boston. A second, titled “Collection between the Worlds,” will be staged at the Museum of Modern Art in New York in 2020. The next iteration of “Jinny Potts: A Century of Photographers” will be staged at the KW Institute for Contemporary Art in Los Angeles in 2022. The next edition of “Feminine” will be staged at the Museum of Contemporary Art, Houston in 2024. The next edition of “Kiss” will be staged at the Museum of Modern Art in New York in 2024.  The next edition of “J. Paul Getty Museum: The Art of Photography” will be staged at the Museum of Modern Art in Los Angeles in 2024.\n\n\n\n\n\nThe National Gallery of Art in Washington, DC, has appointed Mark Fabiani as its next executive director. Fabiani, who has served as director since September 2018, succeeds Mary Ceruti, who departed in April after six years at the helm of the gallery in July. She will assume her responsibilities in the next few weeks and will begin her tenure in January 2021.“As a global leader in contemporary art,", "The next Biennial should be in December 2020. The critical question is whether the exhibition will be able to welcome the new artists and their work within the constraints of its limited time frame.The exhibition will be staged at the Galerie Meret Oppenheim, a former university châteaux in the German city of Essen in the city of Essen-Platz, and will run concurrently with the 2018 and 2020 editions of the exhibition, which were canceled due to the Covid-19 pandemic. The artists participating in this year’s show will be announced soon.\n\n\nNew York’s Metropolitan Museum of Art has named William Goldblatt its next chief curator and director. Goldblatt will assume his post on January 3, 2020.“It is an incredibly exciting time to arrive in New York.” Goldblatt has been the Met’s curator of modern and contemporary art since 1989. He has also served as the museum’s director of visual arts since 2009 and is currently a senior curator at the Brooklyn Museum.Goldblatt’s new role requires him to work closely with director James D. Hutton, who has served as the museum’s director since 1999, and will focus on", "The next Biennial should include a retrospective of the work of the late British artist and theorist Wendy Red Star, a pioneer of the new American design and design-based art of the late twentieth century, as well as a symposium and a special exhibition on the life and work of the late Italian architect Kino Raňtte.The Palazzo Vergina, the Italian capital’s cultural center, will also host an exhibition of work by the late American artist Richard Diebenkorn, whose work is especially well known in the United States. The first show will be staged at the venue on October 22. Previously, the artist’s work has been exhibited at the Museum of Modern Art in New York; the Museum of Modern Art Copenhagen; and the Kunsthalle Basel.A new book, The Art of Design: Where Everything Is, Will Be, will be published by the National Gallery of Art, the Museum of Modern Art, and the Kensington Museum of Art in London. The book will follow the artist’s design projects in his home country, the United Kingdom, and the United States.\n\n\nThe Royal Academy of Arts (RA) in London announced today that the Tate’s new chief executive, Charlotte", "The next Biennial should be staged in the autumn of 2020. This year’s will be hosted at the Pristina Arts Center in central Pristina in the Republic of Serbia.\n\n\nThe CNA Museum of Art in Beijing has received a donation from the Vanguard Foundation for Contemporary Art (Vanguard) of China. In support of the opening of a new Vanguard Foundation Contemporary Art Collection (PFC), the organization paid $50,000 in advance to the museum. “Through a phased program of exhibitions and residencies, the foundation has presented a rich range of contemporary art in China,” said Li Jianhua, the chairman of the foundation. “The last five years have seen a significant expansion of the PFC, as it has become a powerful example for young artists working in many countries around the world. Through the PFC, we want to continue to develop the PFC’s legacy and ensure that it continues to flourish as a major cultural center in Beijing.”The PFC, which will be inaugurated in September 2020, will include twenty-four new works by artists, including Liu Xiaojun, Sara A. Miller, and Jingcheng Yu", "The next Biennial should be held in 2021 and will be organized as follows: The first Biennial will take place in September 2019 and will be closed until March 2020. The second Biennial will be held in March 2021 and will be held in the same location in March 2021.The third Biennial will be held in March 2021 and will be held in the same location in March 2021. The fourth will be held in February 2021 and will be held in the same location in March 2021. The fifth Biennial, which will be held in February 2021, will be held in March 2021 and will be held in the same location in March 2021. The sixth will be in March 2021 and will be held in the same location in March 2021. The seventh and final Biennial will be held in March 2021 and will be hosted by the director of the National Gallery of Art, Washington, DC. The exhibition will feature three new works by emerging American artists in the exhibition of their work as part of the triennial series for the eighteenth through the first years of the twenty-first centuries: Gavin Brown’s MUTURD, which has been exhibiting at the National Gallery of Art since 2014, will be on view", "The next Biennial should focus on the history of the United States and the world through a particularly American lens, and will ensure that every year, an exhibition of equal artistic and historical quality. This year’s edition, titled “For the Old Time,” will feature works by new and established artists that reflect the spirit and spatial possibilities of the exhibition’s inaugural year. Artists from the Pacific Northwest (CalArts, CAArts, CAFA) and California (Vancouver Arts, Brilliant Architecture, Arts, Art, Bowers, Brown, Cinema, Etch, Fashion, Theater, Theater, Drama, Drama, Theater, Theater, Theater, Theater, Theater, Theater, Theater, Theater, Theater, Theater, Theater, Theater, Theater, Theater, Theater, Theater, Theater, Theater, Theater, Theater, Theater, Theater, Acts, Theatre, Acts, Acts, Theater,", "The next Biennial should include a project on the life and work of the Spanish Civil War hero Diego Rivera, examining his revolutionary and influential contributions to popular culture.  \n\n\nThe Solomon R. Guggenheim Museum in New York has appointed Jessica Morgan as its next president and CEO. Morgan comes to the institution from the New York Historical Society (NYHS), where she has served as the director of public relations since 2018.“Jessica is a passionate advocate for research and public engagement in one of the most vibrant and dynamic periods in the history of art,” said Helen Guggenheim, who has helmed the institution for twenty-five years. “Her approach to engagement and leadership has been unique and transformational, and I look forward to her continuing to shape the Guggenheim’s mission and her leadership as a leader for the institution as she continues to build upon the legacy of the Guggenheim’s founding partner, the artist-owned space The Modern in West Harlem.”Morgan, who has previously served as director of curatorial affairs at the Museum of Modern Art in New York and as director of photography at the Museum of Modern Art in New York, succeeds David J. DeForest. Previously", "The next Biennial should be held in December 2019. Their new site will include galleries, restaurants, theaters, and other outdoor spaces and will be situated at the intersection of two of the city’s oldest streets: The William Penn Administration Building and Washington Street. “The proposed redesign of the site, which will create a major new pedestrian and bicycle route between the already-existing Museum of the American American Revolution and the Elizabeth I–designed Museum of the American Revolution, is an exciting addition to Boston’s vibrant arts and culture landscape,” said Joseph Ceccarelli, head of the design team. The new thirty-five-acre site features nine new galleries as well as a redesigned lobby, a new playground, and a theater. The renovation also added ten new works by contemporary artists such as Rachel Whiteread, Tanya Bonakdar, and Elijah Kasdan.Commenting on the work, Alexander Gartenfeld, president and CEO of the Biennial, said: “The renovation of the William Penn Administration Building, which was completed in 1960 and opened in 1969, is a tribute to our city’s rich history, and a celebration of our rich collection of American art. We are deeply committed to working with the community", "The next Biennial should have been held in 2019. However, due to lack of funds and financial difficulties, the festival was moved to 2024. All future editions of the festival will be held in Helsinki, in collaboration with the artist-run festival season. The event will be hosted by the Finnish Contemporary Art Museum (Finnska), which is currently undergoing a major renovation. The organizers are still working out the logistics of the exhibition, which is being organized by the Helsinki international film festival Firkfest in collaboration with the Finnish Media Fund (FPF), and will announce the full lineup of participating artists and their respective affiliations at a later date.Commenting on the decision, Elliott and Maria Häggström, the organizers of the festival, said: “Just a few months ago, we were looking to break new ground with an entirely new festival. But, unfortunately, funding and the project lacked the political will and the financial support we needed to forge ahead with this ambitious project. We are now facing a difficult situation, and regretfully, we had to postpone this year’s edition. However, we are determined to proceed with the festival in 2021, and hope the world will continue to support us in this difficult moment.", "The next Biennial should be held in 2022, and the first in 2021. “We are working to raise funds to organize exhibitions at the same time as the exhibition, and to organize a series of talks by artists in the same exhibition space, so that we can enjoy the same artistic agenda,” said Rosario del Val, president of the Biennales de Lyon and the Venice Biennale. The announcement of the new partnership came a day after the two organizations announced the formation of the located art and culture research center Framed in the City.Dubbed Framed in the City, the nonprofit will partner with urban artists and collectives to produce programming that will engage with topics relevant to the Biennales. Inaugurating the center will be a series of lectures, performances, and other events that will take place across six venues: the Opera House, the Bibliothèque Nationale, the Museo de Arte Contemporanea, the Museo de Arte de Lyon, and the Museo de São Paulo. The program will be curated by François Piquet-Soubirous, who previously served as director of the École des Beaux-", "The next Biennial should be held next year. We are optimistic that the new project, The Future Is Now, will give some hope and inspiration for our time and will determine, for us and for future generations, the shape of the world we live both now and the future.”\n\n\nThe Metropolitan Museum of Art in New York has appointed Lynne Gaston as its new executive director. Gaston comes to the organization from the Museum of Fine Arts in Boston, where she has served as the deputy director and chief curator of twenty-three years. She succeeds Sue Ho, who retired in October 2019 after sixteen years at the museum. The appointment marks an important step in the museum’s transition from a collection focused on modern art to one focused on contemporary art and culture. During her tenure, Gaston has also organized more than thirty exhibitions, including “Live Art: Traces of Life” (2018), “The Audience: Art in Pictures” (2017), “Dead Sea Scrolls: Literary Expression in Cinema” (2017), “The Fate of the World: Art and Human Life in the Transition to Ecological Crisis” (2016), and “The Present: The Contemporary Art of Lynne Gaston�", "The next Biennial should be revealed shortly and will be inaugurated by a series of performances, including an exhibition of new work by the Los Angeles–based artist Chelsea Fox. “No longer a mere reflection of the current world, the exhibition will confront the power of the human experience,” said Adam D. Weinberg, director of the biennial and chief curator.The next iteration of Biennial Los Angeles will take place at the Los Angeles County Museum of Art (LACMA) from March 20 to March 21. For the first time since the biennial was founded in 2009, the event will take place in Southern California. The 2019 edition featured work by seventy-five artists, including Amedeo Modigliani, Alexandra Andropov, Stefan Blom, Abigail and Jonathan Strauss, Antony Hudgens, Anish Kapoor, and David Lichtenstein. The exhibition’s theme this year was “Art and the Body” and featured the work of seventy-three artists, including Andre H. Larsen, Jürgen Mayer, and Matthew McLean.The biennial’s inaugural exhibition, “No More Tears,” will be held at the Halsey Radio and Space in", "The next Biennial should be held at the Museum of Modern Art, which is currently undergoing a $1.4 billion renovation, in 2021. The museum plans to launch the exhibition in 2020 but has not yet determined when it will be able to present the show, or when it will be able to open. For the past thirty years, Milano has hosted the exhibition A Visual History of Art: The Biennial of Peter Paul Rubens, circa 1965–1966. The show is now curated by Miro Dallio, and the twenty-third edition will be held in Milan in 2021. The 2019 edition, A Visual History of Art: The Biennial of Mies Van der Rohe, was held at the Schaerbeek Biennale in Belgium and was curated by Ella Brunner. The exhibition’s director, Perla Bojal, called the show “a collective project in which each of our artists creates a virtual narrative of a past history made visible through a mural or artwork.”\n\n\nThe Chinese artist Liang Zicheng—an early proponent of the new medium of photography, whose works are often included in exhibitions at the Venice Biennale and the Museum of", "The next Biennial should be called off, and the museum should begin the long-overdue transition to a public board of directors, the general manager said. “The current structure that we have right now is not sustainable—it’s not sustainable for future generations,” Hesse said at the time. This year’s event, “Year Zero: Art and Resistance,” will exceed its 2020 goal of 10,000 visitors and featured a retrospective of the work of thirty-seven artists, including Aguilar, Alessandro Nisa, Donatella, Benedetta Ballon, Felicity Hammond, Jeffrey Gibson, Kasmin, and Ariana Mendieta.Artforum has reached out to the next Biennial for comment.\n\n\nYale Union, an art and cultural showcase in Portland, Oregon, has announced that this year’s edition, which would have been held in March, will be held at the University of Washington—Seattle—from March 21 to March 23. The date change was made to help mitigate the risk that a massive dust-related health crisis caused by the coronavirus could disrupt the series’ launch.The move", "The next Biennial should be held in 2020.  “We are excited to announce that the 2019 edition of the Biennial was an amazing success,” said Michael L. Marmor, president and CEO of the Mackie Foundation. “From the first day a group of artists, including Leo Castelli, Carlos Pizju and Pilar Corrias, and Rini Mangano, created works that challenged and captivated audiences on both the local and international level, we knew that we had a winner in Gina Rinehart, and she is the perfect combination of artist and curator.”The four artists who will represent the United States in the 2020 edition of the Biennial are:A.P. Adams, Aaron Cwynar, Dylan Darby, and Kiki Smith. The work of the ten artists chosen for this year’s edition of the Biennial will be curated by artist and Mackie Foundation curator Kali Sher. \n\n\nThe National Poetry Library in Oxford, England, has appointed Ioana Toccarci as its new chief executive and director. She succeeds David Schlesinger, who retired in February 2019 after seventeen years at the helm of the institution.“Ioana is an experienced leader", "The next Biennial should take place in January 2021 and will include twenty-four artists, including eight who are currently participating in the first edition, and will be hosted at the Museum of Modern Art in New York.\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Hanna Dietz as its new director and CEO. She will be responsible for expanding and developing the institution’s collection beyond the original \"Museum of Modern Art\" in the city, and will take the helm for a period of three years.“Hanna’s leadership and passion for the MFA makes her a strong match for the MFA,” said Peter W. Katz, the museum’s current director. “She is highly esteemed by the board as a dedicated supporter of the museum’s work and a great supporter of the MFA’s unique mission. We look forward to working with her to build on her vision and mission to make the MFA an essential cultural destination for Boston and the Greater Boston Area.”Born and raised in Peabody, Massachusetts, Dietz graduated from the University of Massachusetts at Amherst with a degree in visual art. She joined the museum in 2004 as a curatorial assistant", "The next Biennial should be held in January 2021. \n\n\nThe Solomon R. Guggenheim Museum in New York and the Metropolitan Museum of Art in New York have launched initiatives to promote art in the wake of the Manchester bombing in Britain on May 22. The two institutions announced that they are launching museum visits, online programming, and special exhibitions.“The partnership’s first initiative will feature a series of connected exhibitions and tours that will highlight the work of local artists and curators working across different disciplines,” said David Ghenie, the Met’s director. The Panorama Project will provide a day-long tour of the museum through 360 photomontages and will present sculptures on an ongoing basis. The work of four artists and curated by a Japanese curator will be presented on its website. The series will take place in various locations throughout New York, including the Orient Gallery, the Museum of Modern Art, and the Metropolitan Museum of Art, and will run as part of the Guggenheim’s fall tour, which will run as long as twelve weeks. “Working closely with the Guggenheim’s staff, we will utilize each institution’s", "The next Biennial should be held sometime in the spring of 2021. The recommendation came from the committee composed of:\n\nDaisuke Nomoto, assistant director of the Museum of Contemporary Art Tokyo;\n\nYoshitomo Ota, assistant curator of Modern Art at the Washington-DC-based Cartoon Museum; and\n\nThomas Pantz, curator of Modern Art and Design at the Smithsonian American Art Museum.\n\n\nThe Los Angeles County Museum of Art (LACMA) is planning to introduce a new twenty-five-foot-wide, glass-enclosed, glass-enclosed public sculpture garden epitomized by an enormous, sun-drenched, glass-enclosed glass cube. Designed by the Los Angeles–based firm of Sidnevsky, the glass cube—a conceptually ambitious reimagining of the classic glass sculpture park—is slated to open to the public in the summer of 2021. “The glass cube expresses LA’s rich and vibrant history as well as the city’s promise as a global leader in the arts and architecture,” said LACMA director Adrian Wintour. “The project will have a transformative impact on the cultural landscape of Los Angeles, and will be", "The next Biennial should take place in 2021, and the twenty-third next year. \n\n\nThe Royal Academy of Arts (RA) in London announced today that it is planning to move from the site of the former Royal Academy of Arts (RA) to the new venue of the RA1, the National Sculpture Garden, in an attempt to divert attention from its controversial redevelopment plans.The move, which was made in consultation with the local community and will add over five thousand new seats to the existing Royal Academy of Arts (RA), will also include the reopening of the newly renovated Royal Academy of Arts (RA1), which will be inaugurated by a sculptor-in-residence, sculptor-actress, and director-general, Amira Daud, on December 23.“The RA1 has played a significant part in the regeneration of our area, providing a crucial platform for the national and international art of our time, and we are committed to continuing to support the RA1 and its artistic community,” said Rian King, chief executive of the Royal Academy of Arts. Taken as a whole, the plan for the redevelopment of the RA1 is divided into three phases: a) reopening of the museum", "The next Biennial should take place in 2020.”\n\n\nAn artist’s studio in the city of Exarcheia, in central Italy, is being targeted by a group of students from the city’s conservatoire, the CNA, who are demanding the dismantling of the institution in protest of its mishandling of a major fire that broke out on Monday, January 9. According to the Art Newspaper, the fire was caused by a faulty air conditioner in the building’s roof, and the students’ actions appear to be a response to the school’s closure due to the coronavirus epidemic.The students involved in the action, which took place on Tuesday, January 10, are demanding that the CNA institute be closed indefinitely until the fire has been contained. They say that the institution is “resolved to the destruction of the institution and the city of Exarcheia, with all its inhabitants, in order to fulfill the mandate of the institutions.” They are also demanding that the Italian government carry out a thorough investigation into the fire, and that the institution be demolished to make way for a large-scale renovation that would include the dismantling of the building and the surrounding area.The action,", "The next Biennial should mark the centenary of the decriminalization of homosexuality in Italy and the United Kingdom. The event will also feature works by artists such as Meaghan Gordon, Suleiman G. Padgha, and Chitra Bhattacharya, and will take place at the Venetian city hall in Venice, Italy, from May 3 to May 19. A preliminary list of the artists whose works will be presented includes Sara Brien, Hernán Díaz, Jacob Studd, and Juan Pablo González.The inaugural São Paulo Biennial, already up and running, will be held at the Museu de Arte de São Paulo (MASP), from May 27 to May 31. The exhibition will be curated by Sabrina Foa, and will be hosted by the Museu de Arte de São Paulo, the Museu de Oppícia de São Paulo, and the Museu de Minas Gerais. The next edition will be held at the Museu de Arte de São Paulo and will focus on the collection and exhibitions of work by artists from the southern region of São Paulo.\n\n\nAfter the London-based arts nonprofit the London-based arts", "The next Biennial should be held in 2021. The fourth will be held in 2023. “With an eye towards the future, the show will also consider the historical traditions of the exhibition and what they can teach us today,” said Paris-based artist Stefano Poggi.According to the show’s website, the show will aim to “be alive with historical content in order to be informed by the future, as well as content that is accessible to everyone.” “The themes of the exhibition are interlinked, and they are interwoven with the exposition of the exhibition in order to create a dialogue between the two.”\n\n\nThe New York City Department of Cultural Affairs (DCLA) announced today that it is paving the way for more than twenty-five new works by artists and is reviewing the existing restrictions on the sale of work and is drafting new legislation to make it easier for museums and other cultural institutions to exhibit works.The landmark legislation, which was passed by the New York City Council in March 2019 and signed by Mayor Bill de Blasio, will allow museums and other cultural institutions the ability to show works on display in public places and will also give cities the option to ban exhibitions altogether. While", "The next Biennial should be held at the Institute of Contemporary Art Bristol in the autumn of 2019, with the aim of providing a platform for an international community of artists to develop and discuss their work, and of bringing together artists and audiences from all over the world. The project, which is supported with a £7 million grant from the Institute of Arts and the Institution of Arts, was established in partnership with the National Arts Council and will take up art and culture from the Institute.Last year, the Biennial saw the work of hundreds of artists from thirty-six countries and thirty-three cities, including London, New York, Shanghai, Hong Kong, and Seoul. The biennial’s inaugural exhibition, “The Power of the Body,” premiered at the Cannes Film Festival. The Biennial will also stage a new work each year at the Institute of Contemporary Art in London.\n\n\nThe New York–born, Hong Kong–based artist, activist, and educator Vinnie Bagwell has died at age eighty-one.Born in New York City in 1942, Bagwell is remembered by many as a feminist, antiracist, and anti-imperialist activist. Her visual work, which incorporates social constructions such as blackness, colonialism", "The next Biennial should unveil the exhibition on August 28. The exhibition will be curated by Times Square curator Anna D. Newkirk and will exhibit contemporary artworks by artists such as Frank Gehry, Paul Gauguin, and Robert Irwin. The exhibition will also include a virtual reality experience that will allow visitors to experience the exhibition through their virtual reality headsets. The exhibition will be followed by a concert, a film series, and other special events.The organizers say that since the biennial has not been canceled, it will be held at least twice each year. The 2019 edition of the event was held in October and featured works by eighty artists, including Peter Andre, Mark di Suvero, Kiki Smith, and J. M. Barlow. The 2020 version will take place in December and will be hosted by the American Folk art Museum in New York.The full list of participating artists is as follows:ArtistsPolly BarlowArtistsPlease, my name is Polly Barlow and I am a queer, black, and Puerto Rican contemporary artist. I am currently a Fall 2018 Carnegie Mellon University PhD student in art history and curatorial studies. I have also been a writer and curator for a number of years. In addition", "The next Biennial should take place in the Stockholm suburb of Umea, Russia, in 2021. The 2019 edition, “Centro de Artes Plásticas” (Art in the City), was held in Barcelona and featured work by contemporary artists, including William Eggleston, Jaume Gómez, and Miguel de Córdoba.  The 2019 edition, “Art in the Streets” (Art in the Streets), a special project of the Stockholm Biennial Foundation, was curated by Anton Kern, Mira Lanek, and Dieter Hütte, and was held in the city of Märsta, Sweden.\n\n\nThe inaugural edition of the Hong Kong Art Biennale, Hong Kong’s answer to the Art Basel fair in Beijing, has announced that eighteen artists will be featured in the twenty-second edition, which will take place in the city of Hong Kong from March 17 to March 19. Titled “The Eyes of the World,” the event will also feature works by a number of new emerging and established artists, including Sara and Ahma Simber, Daisuke Namikawa, Zhijie Zhang, and ", "The next Biennial should take place in Beijing in 2022, and the first exhibition in London in 2020. The exhibition will stage work by thirty-six artists and will feature work by a selection of local and international artists. The exhibition will be followed by a biennial in Hong Kong in 2021 and the first in New York in 2020.The same concept is being proposed in New York as the 2020 iteration of the Biennial, and in Hong Kong as the next iteration of the Hong Kong Biennial.The show will be hosted by Vincent van Gogh in a collaboration with the Hong Kong Museum of Art and L. Paul Hauser & Paul Hauser in Hamburg and will be organized by the Hong Kong Arts Center (HKCA), which is run by the Hong Kong Foundation for Contemporary Art (HCA). The first round of the exhibition will be held at the HKCA in the evening of March 28–49. The second round will be held at the Hong Kong Museum of Art, which will be closed until at least the end of the month. The Hong Kong Biennial will have the Hong Kong Museum of Art and the Hong Kong Museum of Art as a part of its curriculum.  The Hong Kong Art Museum (HKB)", "The next Biennial should take place in 2021, and the first in 2022.\n\n\nThe Museum of Southern Art (MSA) in Los Angeles has received a gift of eighty-seven works from the Japanese collector Toyoyuki Tsuda, who is also a founding member of the Japanese art dynasty. The works, which date from the mid-nineteenth century to the early twentieth century, were purchased by the collector from the art dealer, Reika Takemoto, in 2008. The gift includes thirteen contemporary works by artists such as Kiyomi Takahashi, Nara Tsuda, and Matsuo Takeda.The works, which were purchased in the latter half of the century from art dealer Yoshitomo Takahashi, are currently on display in a new exhibition, “Japan in the Eighties: Contemporary Art,” at the museum. MSA will unveil the works in a retrospective dedicated to the artist in 2021.\n\n\nAn independent investigation into the disappearance of artist Michael Stipe has found that a series of events surrounding the artist’s death—including a discovery in 2013 that he was institutionalized for mental illness—are to blame for his untimely demise. The study, conducted by the Royal Academy of Arts", "The next Biennial should be held in the spring of 2019. The exhibition will include work by twenty-eight artists and will present a selection of a selection of the artist’s most recent exhibitions. The biennial will also include a group show, a lecture series, and a gallery exhibition.\n\n\nThe American Ballet Theater (ABC) announced today that it will divest $5.5 million from its corporate endowment as part of a deal that will see a $2 billion cut in the organization’s annual salary and expenses. The conservators will receive one-time payments of $2.5 million each.“It has been a great honor to serve as the principal of this remarkable company for more than twenty years, and I’m proud to have raised the funds to create a world-class, world-renowned company,” said choreographer Peter Sellars, who received the organization’s Eternal Pledge, a prestigious award in 2016 that honored his philanthropic efforts, and whose director, Sharon Stone, introduced him to Ballet. “Peter and Sharon made the company possible. . . . As we move into our seventy-fifth year, we are committed to supporting the company’s goals", "The next Biennial should take place in 2021.\n\n\nThe Israeli Museum of Fine Arts (IMFA) has announced that it is planning to open a new museum on its campus in the city of Beersheba, in the northern West Bank, as early as next month. The institution, which received a $3 million gift from philanthropist and businessman Shelly Simons in 2017, will renovate the existing building and organize a new exhibition and event space on its grounds.“We are delighted that the new museum will be built in the city of Beersheba, one of the poorest areas of the country,” said Simons. “The building will offer an exceptional environment for the exhibition and research of the contemporary art of the region, as well as a rich collection of modern and contemporary art.”The project will also include the construction of a new outdoor garden, which will serve as a restoration and education center for visitors to the museum. The garden will include replanted materials from the museum’s collection, as well as the original terraces and garden. According to the museum, the new building will also have a library, a museum, and a café.\n\n\nThe Negev Regional Council in Israel has ordered", "The next Biennial should inaugurate with a lecture on the impact of the 2020 General Election on the Arts and the Arts’s Media. The 2020 Biennial should be organized as follows: The 2019, the first Biennial to be held in the new city-state of Graz, was held at the Museum of Contemporary Art Vienna. Whether the next exhibition will be the Biennial of the Future (2019) or a biennial in which artists and activists from different parts of the world will discuss, organize and collaborate, is yet to be determined.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Michelle O. Robinson as its next executive director. Robinson is the founder and chief curator of the museum, which was established in 1949 by Harold and Paul Howard. She succeeds artist-in-residence and curator Amy Siskind, who will remain at the institution as interim director.“I’m eager to work with Michelle and the talented team at MoCA to ensure that the museum’s vision for the future, both as an institution and as an artist, is realized through an expanded curatorial, conceptual, and educational programming program,” said Paul Rosenberg, chair of the board of trustees of", "The next Biennial should take place at the Turkish Cultural Center in Ankara, which will open in 2022. The venue will host the exhibition in the next two years, after which it will return to the İstanbul Archaeology Museum (MAS).The museum’s director, Rekuşa Büyükükür, said: “The theme of the exhibition ‘Istanbul: Art and History’ is to question and to re-create the city’s history from the nineteenth century. With its large-scale exhibitions of contemporary art from the past, the exhibition will draw attention to the importance of Turkish cultural heritage in the process.”Büyükükür also revealed plans to establish a new special exhibition dedicated to the art of Islam, “Innovations in Art History,” which will take up the theme of the exhibition. The exhibition will be centered around the work of twenty-one Turkish cultural producers living or working in Europe. Among the artists selected are Dr. Nusret Cengiz, Selin Gülkaya, Olga Pestana, Selin Saban, and Süleyman Sımün, who will present the show ", "The next Biennial should focus on how art can be used as a tool for social change, expand our understanding of the role of art in social justice, and promote the institution of art in the form of a museum open to all.”\n\n\nThe Museum of Arts and Design (MAD) in New York has appointed Lenore Stephan as its next executive director. Stephan joined the museum in January 2019. She succeeds Amanda Rose, who became board chairman in June 2020, and will begin her position in January 2021.“We are thrilled to welcome Lenore to MAD,” said board chair Jodi Rondin. “Lenore has the vision and leadership to make MAD an even stronger public voice for art. She has the ability to understand and shape the museum’s architectural and conceptual heritage, and to use her connections and network to advance MAD’s mission. We look forward to her leadership role and to working with her.”\n\n\nThe Kuwait Art Museum (KAM) announced today that it has appointed Najia Al Qasimi as its new deputy director, and curator of modern and contemporary art, to the position of director. Al Qasimi will assume her responsibilities on April 8. She succeeds ", "The next Biennial should take place in the year 2021 and will invite the collaboration of over fifty artists from fourteen countries, including the United States, the Czech Republic, Estonia, Japan, Korea, Norway, and Sweden, along with thirty-eight galleries.“The theme of the upcoming exhibition is Intersection,” the artist told artnet News. “I chose to focus on this question of how art can affect our lives and how it can affect our surroundings.”The exhibition will open at the Borg-Ateliers in Paris on September 22 and run through November 7, and will include work by fifty-two artists from twenty-nine countries, including Australia, France, Germany, Italy, the UK, and the US.The fifty-one artists chosen for the exhibition are: Fotopassa (Ukraine), Laxmi (India), Nesir (New Zealand), Tanya (Russia), Tjeila (Igorova), Tanya Galan (South Africa), and Pilar Gall (Peru).Coinciding with the exhibition, the twenty-third edition of the Venice Biennale will feature work by seventy-three artists and will take place at the Collezione Centro della Scala in Venice from", "The next Biennial should take place in the spring of 2021. The next exhibition should be announced in 2020. The next exhibition should be a mini-symposium featuring art by two artists, Ana Mendieta and Uli Stegl, in the spring of 2021. The next exhibition should be a concept show in the spring of 2021. The next exhibition should take place in the spring of 2021. The next exhibition should be a collaborative project with four artists, one each from the United States, the United Kingdom, France, and Mexico, in the spring of 2021.\n\n\nThe biennial–commissioned exhibition “An Open Letter” was canceled at the San Francisco Museum of Modern Art (SFMoMA) last week, after the institution received more than 1,500 letters signed by distressed or disaffected art-world workers from the Bay Area. The letters, which were delivered to the institution by art-world professionals themselves, accuse the museum of being out of touch with the masses by planning to shutter its doors indefinitely, and demand that it immediately recommence the costly and difficult construction of a new building.The letters are addressed to Marc Straus, the architect who designed the museum’s 45,000-", "The next Biennial should be held at the San Francisco Museum of Modern Art, which is currently undergoing a $1.5 million expansion, or the Museum of Modern Art, which recently opened in the fall of 2019. The decision to hold a biennial, which was made after a British curator sketched out the exhibition for the exhibition space Black Cube in London in 1953, has been criticized by some as opportunistic. The institution originally chose to stage the exhibition in a museum adjacent to the site of the original Black Cube. Following a public outcry from critics and artists, the museum reversed course and traveled to the Black Cube to stage the exhibition. “I cannot overstate how important it is that the Museum of Modern Art, for many years the home of the most important work of American art, not only continue to present the most important art of our time, but also retain its role as a beacon of creativity and progress in the world,” Peter W. Wolf, former director of the museum, said in a statement.    The new exhibition, “Gathering the Pieces: Art and Science” will open on January 22 and run through March 23.\n\n\n\n\n\n\nAustralian artist David Hockney has won the 2018", "The next Biennial should be held in 2022, with the show celebrating the centenary of the founding of the Generalitat de Barcelona. The date has yet to be decided.\n\n\nThe National Galleries of Scotland (NGA) announced today that it is reopening in the Clyde in March 2021. The historic venue, which has a capacity for more than 2.5 million visitors a year, will break ground next month and hopes to break ground later this year.Reopening at the venue will enable the NGA to further develop its international collection of medieval, Renaissance, and Tudor art, which has a capacity for more than 57,000 visitors a year, and will also expand its contemporary art exhibitions. The move was made in order to accommodate the work of the international visiting exhibition schedule. The move is expected to result in a $5 million boost to the NGA’s operating budget. In addition, the NGA will be able to welcome another 1.5 million visitors this year, and expects to welcome around 3.5 million people in 2022.“We are very pleased to announce the reopening of the NGA,” said NGA director Joanna Kavanagh. “Its return to full health will mean that", "The next Biennial should take place at the Hammer Museum in 2020 and is expected to be the largest retrospective to date. \n\n\n\n\n\nThe Eldridge Museum of Art in Massachusetts has appointed Aaron M. Abney as its next executive director. He is the first African American to helm the institution since its founding by Daniel Eldridge and Peter M. Oberlander in 1971. “Aaron arrives in Eldridge as the cofounder and global director of MoMA, a year-round community space and cultural destination in the Chelsea neighborhood of Long Island City, New York, and as the co-creator of the groundbreaking experimental performance platform the Biennial,” said Museum Director John Mulligan. “The museum’s mission is to create and elevate the rich and original works of African American artists. While he has a degree from the university and has lived in New York City for over twenty years, Aaron is deeply committed to the museum’s history and legacy. He is well-versed in the art world and has extensive experience in organizing large-scale events and festivals.”Previously, Abney served as the executive director of the Brooklyn Museum, where he helmed the institution’s programming for four years and", "The next Biennial should decide whether to invite more than twenty-one artists to participate in the exhibition in 2021. The decision has been made in accordance with the Festival’s programmatic constitution, which states that the exhibition should be a “contemporary reflection of contemporary life.”This means that the new show will reflect on contemporary art in a way that is, to a large extent, a rethinking of the history of art and its relation to contemporary society. The 2018 show, “Live from the Pacific Coast,” was organized by the Pacific Standard Time Foundation in conjunction with the California Institute of Technology. The 2020 edition, titled “Plant and Object,” will be curated by filmmaker Laura Poitras, whose documentary series The Power of Objects (2016) was nominated for an Emmy. \n\n\nThe National Gallery of Art in Washington, DC, is trying to sell 30 percent of its assets to private interests for $5.9 billion. The sale includes the historic building, the Kerner, which was the site of several exhibitions, and several thousand works by modern and contemporary artists, including Sol LeWitt, David Crockett, and Ed Moses.“The Kerner’s holdings include P", "The next Biennial should focus on “The Politics of Art,” a selection of paintings by Hal Foster and Lee Ho Tae (1902–1972), with an emphasis on “Psycho-analyses.” The Sundance Film Festival, which has been postponed indefinitely, will resume in January.The Barcelona Art Biennale is anticipating a resumption of programming in January 2020. \n\n\nThe Museum of Modern Art (MoMA) in New York City, which recently announced plans to move the Nova’s permanent collection from its former home in the Hotel Metropolitan, has released the annual ranking of its arts institutions by the nonprofit organization Artnet News. The 2017 list is as follows:1. New York’s Metropolitan Museum of Art2. Philadelphia’s Metropolitan Museum of Art3. Chicago’s Art Institute of Chicago4. New Orleans’s The Gallery at New Orleans’s Art Institute of Design5. New York’s Whitney Museum of American Art6. Boston’s MIT Media Lab7. Chicago’s Museum of Modern Art8. Los Angeles’s Museum of Art and the Los Angeles County Museum of Art9. New Orleans’s", "The next Biennial should be inaugurated by a lecture by an artist whose work has been selected for its involvement with the biennial process. The exhibition should be a reflection of what can happen when a platform is created for art and collaboration between artists and the city.”\n\n\nThe Museum of Tolerance (MTO), the largest museum in the United States devoted exclusively to art and art history in Europe, has appointed Sarah Dessen as its first director. Dessen comes to the institution from the Museum of Contemporary Art (MoCA), where she has served as associate curator since 2015, and will assume her responsibilities on November 22.“Sarah’s work at MoCA demonstrates her extraordinary ability to bring diverse and compelling narratives to light and to build on existing ideas of what art can be and is,” said Steven Barringer, chair of the museum’s board of trustees and a former director of the Museum of Modern Art. “We look forward to working with her and to sharing her enduring vision and energy as we embark on a new chapter as the MTO’s permanent collection.”Dessen’s new role is part of the institution’s new five-yearly strategy. It outlines how the", "The next Biennial should take place in 2022.  Previous editions of the biennial, which were to take place in the city, have been canceled over the last twelve months. \n\n\nThe Institute of Contemporary Arts (ICA) in Berlin has announced that it is issuing a formal apology for its decision to move the exhibition “The Three Faces of Nature: The Three Faces of Architecture,” a presentation of work by Italian architect Armando Biennale director Stefano Cattelan, from the exhibition to a new location in the city, despite Berlin’s request that its pavilion be relocated. The institution informed the Italian architect about the change in plans in early March, but he chose to leave the exhibition indefinitely, citing the ongoing construction of new buildings in the area as the reason for his departure. The exhibition will return to the German city of Nuremberg in May of 2021. Ica Berlin said that it hopes the apology serves as a signal of regret and reconciliation. “We have done everything we could to avoid this unfortunate decision, and have cooperated with the city of Nuremberg as well as other countries in the region,” said biennale director Christian Strassburger.\n\n", "The next Biennial should take place in 2020, with the full support of the city and of the whole of Barcelona. The exhibition will also be organized in the following ways: The exhibition will be conducted by a group of independent arts producers whose projects and activities are inspired by the cultural and artistic richness of Barcelona; it will include a selection of works by professional and emerging artists, with the aim of presenting a new stage of the artist-art; and it will be presented in a chronological order.The 2019 Exhibition “Avant-Garde and the Early Modern Period” was organized by the Avant-Garde Foundation in cooperation with Damascene Contemporary Art, the Damascene Museum of Art, and the Damascene Art Museum. The exhibition will open on September 9. \n For the Samson and the Two Sons exhibition at the Smith Museum of Art, the first show of the inaugural Samson and the Two Sons (S&S) series, curated by Tia Millar, the unique combination of artists and the collection of the museum prompted a question: “What if the very construction of the grave of Isaac Brockman, with its enormous detail, was itself an act of", "The next Biennial should, without hesitation, be the greatest exhibition of modern art in the world, featuring works of the most important artists of our time. We must work together to ensure that this event is a cultural landmark, presenting contemporary art created in the spirit and in the spirit of our times. To create a new context for contemporary art, we must rethink how art should be presented. We must create experiences that are new and enriching. We must make art to live with. This is an unprecedented challenge for our city and state, but it must be undertaken with courage, imagination, and a sense of purpose.”Among the five new commissions that will be presented at the biennial are “Phoebe Anthes” (Dia Art Foundation); “Sydney Punk” (Dia Art Foundation); “Theater of Operations,” a selection of photographs by Elaine and Howard Yellin; and “Theater of Operations: The Inside Story,” a documentary about the Korean War by James A. Farley. The latter film - which was shot on location in China, Taiwan, and Japan and premiered at the 2013 Venice Film Festival - is not scheduled to be released until the spring of 2021.The", "The next Biennial should take place in the spring of 2021. “The history of the biennial is indelibly marked by its connection with the Central Asian People’s Republic,” said Maria Aziz-Byron, chair of the 2017 edition, which included a performance by the group the Doors. Both we and our guests had the opportunity to travel to the Caspian Sea for the exhibition, and to witness the creative spirit and creativity of the peoples from that region in Moscow and in the Caspian Region. We are grateful to the Central Asian People’s Republic for the invitation to present the first Biennial in their territory.” The exhibition, titled The Artist: A Biennial in Moscow, was organized as part of the exhibition “A Biennial in Moscow” that was organized by the Moscow Center for Contemporary Art and the Caspian Sea Cultural Center in the summer of 2017 and was the first film and video exhibition to take place in the Caspian Sea. The exhibition began as a series of three films,” and featured twenty-four artists, including Rin, Günther, Muhamed, and Nuri, and forty-seven works by Russian", "The next Biennial should happen sometime in the 2020s, with a period of at least eighteen months between the first and the second iterations. \n\n\nThe newly created museum is currently in the conceptual stages, and will open this fall. \n\n\nThe Institute of Contemporary Arts (ICA) in London has appointed Damien Chauvin as its new chief executive officer and director. Chauvin comes to the institution from the Metropolitan Museum of Art (the museum’s director of contemporary art), where he has served in a variety of roles, including chief curator and curator. He succeeds Adrian Wyld, who departed the ICA in 2019 to head the Museum of Modern Art, and will assume his responsibilities this fall.“I am delighted to welcome Damien to the ICA, and to have his leadership and vision guide the museum through these challenging times,” said Craig Bennett, chair of the board of trustees. “At this pivotal moment in history, when we face many daunting challenges in our society, it is my firm conviction that this is the right moment to re-examine the history of art, and to re-think the role of art museums in the twenty-first century.”Chennai-based artist, curator, writer, and", "The next Biennial should take place in 2020.  The first was held in the city in January 2019 and was attended by approximately 150 artists, designers, researchers, and other cultural professionals. The second, which was held in the former factory in December 2018, drew approximately 180 artists and researchers from twenty-eight countries.\n\n\nThe Dresden Art Museum (Damm) in Germany, which announced its intention to reduce the museum’s physical footprint by nearly one hundred thousand square feet by 2020, has extended the opening of the museum’s first exhibition by Dario Latour—the first of two planned for the upcoming year. Latour’s show, HELMUT: The World Is Yours, will open on October 26 and feature more than sixty works by ten artists—including Yancey Pindell, Simone Leigh, and John Martin—as well as a selection of works by contemporary artists such as Damien Hirst, Olli-’s Mummy, and David Miro. The show is also slated to highlight the work of the Italian artist Salvatore Romano, who was awarded the Italian Prize for Architecture in 2018, and will feature the work of artists such as Tracey Winsor, Hé", "The next Biennial should be held in the autumn of 2020.\n\n\nThe Amsterdam Museum of Fine Arts (EMKA), which is currently closed until at least March 13 due to Covid-19, has announced that it will re-open in May. The institution said that it will ensure that all necessary measures, including installing barriers to prevent the movement of people and goods, are in place to ensure a \"complete and timely reopening of the museum, with all possible activities, exhibitions, and events.\"The spring opening of the MAMAM Museum of Contemporary Art in Amsterdam was also delayed due to the pandemic. The first exhibition, “The Golden Bough,” was scheduled to open in May but was pushed back to June due to concerns over the virus. In a statement, the museum said that it plans to re-evaluate the reopening of its locations in June.\n\n\nThe Bathhouse Museum of Art (BMA), one of the largest museums in the UK, has appointed three new members to its board of trustees: artist-activists and philanthropists Bonnie Purvis, Simon Calloway, and Max Halperin. The board also elected Anna Atkins as a member in January and now has eighteen members. The appointments were made in", "The next Biennial should focus on “the possibility of a common life, free from violence and economics,” said the artist. “It should not only tell us the stories of its artists; it should be able to tell us the stories of the world. I hope this will become a signal for the rest of us. It is the only way forward.”In the meantime, the biennial, which is currently on view in the exhibition space Biennale d’Arles at the Museum of Contemporary Art, Paris, will continue to host more than thirty-five artists, including Alex Hallet, Oskar Kokkin, Karolina Wojtas, the artist-in-residence Banu Farsi, and the American artists Ralph Spero, Ted Tsang, and Anthony Uka.\n\n\nEarlier this year, the Museum of Modern Art (MoMA) in New York announced that it will start allowing visitors to its prestigious 240-year-old building to purchase works and artifacts from the institution’s collection online in a limited capacity. The move, which was made to mitigate the risk that the institution would be sold to a private buyer, was made in order to prevent the reopening of its", "The next Biennial should be held in the fall of 2021, for which a final selection of artists will be made when the new biennial is inaugurated.The biennial will be curated by an all-female panel of curators, comprising Anna-Marie Nottage, Deborah Riggs, María Berrío, Olivia Bovey, Kemi Olu o Gomis, and Jovan Leonides. The inaugural exhibition will feature works by fifty-eight artists, including Jennifer de Bruijn, Kammie Al-Jurjani, Ronda Mark, and Kiki Smith, as well as works by endemic artists such as Beckar, Rintoul, and Jaroslav Reznik. The 2019 exhibition featured work by thirty-two artists.\n\n\nThe New York institution that pioneered the use of film to communicate with and explore ideas of the film-as-medium and the ethics of film-making, the Museum of Modern Art (MoMA), has named Katherine Copelin its new executive director. In her new position, Copelin will oversee the Museum’s expansion into an urban space, the Museum of Modern Art (MoMA), through a $1 billion gift from the Sargent and Weiss Family, who own the", "The next Biennial should take place in 2021, when the museum will be renamed after the founding member of the new group, the Italian architect Paolo Baratta. The architect is known for creating projects that address the spatial problems of the city.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Nancy K. Edens as its new deputy director for exhibitions and curatorial affairs. Edens comes to the institution from the Los Angeles County Museum of Art, where she has served as deputy director since 2017. She succeeds Miranda March, who left the institution in February to join the Metropolitan Museum of Art in New York, and will assume her responsibilities on February 9.“Nancy has been instrumental in building our exhibition program and curating team, and has fostered a more collaborative and collaborative culture during her tenure at the museum,” said director and CEO Elizabeth Lieberman. “We are grateful for her contributions to the museum and to the city of Los Angeles. She is highly regarded within the art world as a hero to many who have worked with her and supported her. Her contributions will endure as we work to ensure that MoCA is a champion of contemporary art and the arts.”Prior to joining the museum in 2012, Ed", "The next Biennial should take place in 2020, and the first exhibition should be up in 2021.\n\n\nThe Museum of Modern Art (MoMA) in New York has announced the opening of a new scholarship on the history of the American Žaleč Museum in Bálint, Czech Republic. Some sixty thousand documents, artworks, and photographs related to the century-long collection, which has housed the museum since its founding by the German Jewish banker August Bálint in 1928, will be made available online for the first time.The exhibition, titled “The Painted World: Modern Art in the Soviet Union” (Sint-Andrianomu Gorodenský), will examine the role of the Žaleč Museum in the twenty-first century through a selection of seventy-four works, which were donated to the institution by individual collectors and will be publicly available to view for the first time in the museum’s history.“The Painted World’s display of works by some of the most important American artists of the twentieth and twenty-first centuries is an extension of MoMA’s ongoing commitment to the history of American art,” said MoMA director Mary Anne Carter", "The next Biennial should be held at Pier One in 2019 and should be presented by Stone in the form of a five-person team (Berlin, Stuttgart, Munich, and Salt Lake City). The theme will be “Reflections of Nature,” and the exhibition will take place on the Plaza de Mayo, the plaza dedicated to the Mexican national flags. Artforum will release the full list of participants and artists in the next few weeks.\n\n\nThe National Gallery in London has appointed Andrew Robertson as its new director. Robertson comes to the institution from the London-based nonprofit the National Arts Council (NAC). He succeeds Jo Sargeant, who retired last year after twenty-eight years at the helm of the institution.“I’m delighted that Andrew has chosen to bring his proven track record of innovation and creativity to the National Gallery,” said NAC director Katarina Johnson. “I’m thrilled by the prospect of collaborating with Andrew, bringing his expertise, knowledge and enthusiasm to Tate Britain. I’m looking forward to working with him.”Robertson joins the gallery from the NAC, where he has served as the chief executive officer of the National Arts Council since 2007.", "The next Biennial should be held in December 2019. The exhibition will examine life and work in the contemporary art world from the perspectives of the biennial artist, the biennial curator and the artist, and will include the first-ever solo exhibitions of work by the biennial artists.\n\n\nThe National Portrait Gallery in London is planning to open a new twenty-three-story, mixed-use building in the city, designed by the German firm Konrad Fischer, in 2021. The new museum will boast of a new exhibition space, digital hub, and conference rooms, as well as an expanded collection. The reimagined institution is slated to open in the city in the summer of 2021.The museum will also offer eight new opportunities for students from the institution to visit the museum. The new program for university students will be a collaboration between the school and the museum. The students will have access to the National Gallery's collections and programs; the gallery will provide them with access to the exhibition halls; and the museum will host events and celebrations. The new program for young visitors will focus on young artists and their work and will feature performance, photography, and sculpture.Other highlights from the 2020 edition include the publication of a new exhibition of Jakob von Uexk", "The next Biennial should take place at the National Gallery in London in 2021. \n\n\nA group of artists and collectors are suing the National Gallery of Victoria in an attempt to force its hand over the private holdings of Hans Christian Andersen and Jane Austen, among other Victorian authors. The legal action was filed by the heirs of the Victorian-era authors in the United Kingdom on Thursday, October 21, and is the latest in a string of legal challenges to the institution, which was founded in 1854 and has more than 300 million books in its holdings. The publishers of the collections claim that the collection is being sold at a discount and argue that the sale of works by the heirs is a form of intellectual appropriation.The heirs are seeking around $55 million in damages. The organization that organized the sale, the National Association of Art Historians (Nama), has defended the action, stating that the heirs are attempting to sidestep the institution’s strictures against the sale of works in the collection. Nama also claimed that the sale is in line with the National Gallery’s policy against the exhibition of work that has been public property for more than twenty years.The lawyers representing the heirs have called the Nama response “weak” and", "The next Biennial should take place at the Kuru Park in Tokyo, which will be inaugurated in December 2021 and be comprised of eleven exhibitions. Curated by Atsushi Inada and Olivia Bruguera, the exhibition will include the work of over seventy artists and will include a virtual reality work by Yuichiro Toyoda.\n\n\nThe Shanghai Art Museum has received an emergency donation of forty works of art from the collection of Miong Cheng, the Chinese artist who designed and built the institution’s Botanical Gardens and the Edas Museum. The donation includes twenty works by the artist, who was born in Beijing, and twenty works by her students, aged sixteen to twenty-four.“We are extremely grateful to Miong Cheng for the extraordinary gift of forty works of her art, which has enabled the museum to continue its ambitious exhibition program, and to her students for putting together the exhibition program of the Botanical Gardens and the Edas Museum together,” said Daniel H. Weiss, director of the museum. “The museum has a long-term plan for the Botanical Gardens and the Edas Museum that will extend the potential of the museum’s collection. We are now collaborating with Miong Cheng", "The next Biennial should include “Aurora,” a new project that will \"explore all aspects of life, including the beauty of the natural world, and the necessity of life,” with a view to examining the properties of the elements and the biennial as a whole. The exhibition will take place for the first time at the Contemporary Art Museum St. Louis, which is currently undergoing a $250 million expansion.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has announced that it has received a donation of fifty-seven works from the collection of architect John Gilmore, who passed away earlier this year at the age of eighty-nine. One hundred works from the collection are currently on display in the museum’s new museum’s annual exhibition “John Gilmore: The Collection,” which will run from February 3–March 14, 2020. The exhibition will be inaugurated by a new conceptual work by the American architect, which is scheduled to be unveiled on April 19, 2020.“We are thrilled by this gift of works by John Gilmore,” said museum director Mark Scheibel. “These works will enrich the exhibition and the collection, and introduce new perspectives and topics for our", "The next Biennial should be at least a decade in the making, and will include a new exhibition of work by twenty-five artists represented by thirty-two international artists’ residencies. The biennial will also offer a variety of programming, including residencies for under-recognized or under-represented artists. While the US government will fund most of the cost of the event, the exhibit and the artists residencies are budgeted at $7 million. The artists’ residencies have not yet been chosen and will not be selected until March 2020. \n\n\nThe National Geographic Society (and its parent company, private philanthropist John S. and James L. Knight Foundation), which has been plagued by mounting debts and controversies since it was founded in 1967 but is now trying to balance its books through a restructuring of its headquarters, has announced that it will postpone the 2020 celebration of its fiftieth anniversary, Cleveland’s centennial, and its sixtieth anniversary, respectively, by three years. The move follows the announcement on Thursday of the foundation’s plan to sell off more than one hundred of its holdings, including the iconic blueprints of its headquarters in Washington, DC, and to sell", "The next Biennial should be held in the following year, and the calendar should be updated regularly. The exhibition will take place in the Separately-Owned Museum of Modern Art (SMAM), the former home of the modern and contemporary art (and its representative museum) the SF MoMA, in Manhattan’s SoHo neighborhood.\n\n\nThe Firna Institute in Berlin has commissioned artist Laura Owens to create a new work for its annual exhibition “Laura Owens: In the Inside.” The exhibition will be held at the Firna Institute’s Kreuzberg location, in the Kreuzberg district of Berlin, from October 7 to October 10, 2020.The work, titled In the Inside, was created in response to the events of the past few months and will explore the themes of alternative modes of existence in the current climate. The work is based on an existing photograph by Owens that was taken at a time when she was in the process of writing the book Laura Owens: The Best of Her,” currently on view in the museum. The work consists of a series of two photographs, one of which is of Owens sitting in a bathroom with her head on a towel. In a conversation with Firna director Maria El", "The next Biennial should be staged at the Tate’s new site in Kensington, where a new museum has been proposed by the architect, David Peabody, and the Tate will present a selection of work from the first exhibition in the series, “The Dream of a New India” in 2022. The show will consist of twenty-four works by twenty-two artists from Bangladesh, India, Nepal, Sri Lanka, and Thailand.  From the artist-run space, the group was able to select a theme for the 2019 exhibition. The theme of the exhibition was “The Dream of a New Home.”  The artists selected for the exhibition include Nanda Rajagopalan, Rupak Basu, Kamal Dama, Rireesh Dushuk, Zulfiqar Khilji, Mitu Ali, and Nari Ward. The full list of participating artists can be found here. The 2019 Biennial, “Do it,” was organized by the Tate alongside the Dhaka Art Summit and the Dhaka Art Festival. The event was co-organized by the Dhaka Art Foundation and the Dhaka Art Student Association. The final round of the exhibition,", "The next Biennial should be a breakthrough exhibition of the latest art from around the world. It should showcase the first work by a woman to be exhibited in the United States.”The upcoming event will take place at the museum from March 22 to March 24. The exhibition will feature works by artists as diverse as Ana Mendieta, Brigitte Trumpet, Hans Ulrich Obrist, and Seiji Ozawa, among others, in addition to the first work by a woman to be exhibited in the United States, a bronze sculpture by Hal Foster.\n\n\nThe museum has received a $35 million gift from a group of artists and collectors, including the Turner Prize–winning artist Debbie Els and Walter Negri, who jointly donated $50 million in support of the museum’s new center and its collection. The gift includes the acquisition of the Rema Hort Mann Collection, which includes works by the German artist, the Italian designer, and the visionary filmmaker.The Rema Hort Mann Center for the Arts was announced in March 2019. It is located on the second floor of the Contemporary Art Museum Los Angeles, the museum’s newly renovated home since it opened in 2016, and will host a retrospective of the artist’s work The Unseen", "The next Biennial should be held in 2021.“The first three years of the new biennial will be spent in the United States, with a focus on the themes of the previous two years\u0097art and culture in the US, the future of art in the US, and the United States in the world,” said biennial cochair Wendy Teitelbaum. “We will carefully consider the choices that will best reflect the spirit of the new biennial and the themes in its inaugural exhibition.”The exhibition “The Watermark of Transformations” will open in January 2032 and will feature works by thirty-nine artists whose work is currently on display in the first exhibition. The “Becoming of an Urban Landscape” exhibition will take up the theme of a cityscape in the 2020s, and will be staged in collaboration with the new Detroit Institute of Arts (DIA). The show is hosted by artist-in-residence Robert Anton Wilson.A full list of participating artists is as follows:Barry Brackens (NYC)Brianne Blythe (LA)Mia Blythe (CA)Nina Blythe (CA)Luis Barreto (NY", "The next Biennial should be titled “The Body in Anthropology and the Body in Architecture” and will be staged in the Russian city of St. Petersburg from January 20 to February 21, 2020. The exhibition will examine the relationship between the body and architecture, and will celebrate the work of emerging and established artists in an attempt to bring more attention to the body and architecture.The theme of the fifty-fifth edition of the Biennial, “Painting Body and Architecture,” was chosen by a committee chaired by designer Katia Zhukova, whose work explores the metaphysics of the body and architecture in a biennial-wide installation. The artist will create a sculpture that will take the form of a body in order to depict the artist’s process of moving from one body to the next.In the piece, Zoya, who is known for her sculptural works, assembles the bodies of different artists into one single work. In a video installation of the same title, the artist will create a sculpture of a woman, a child, and a baby in order to draw attention to the body’s potential to become a unity. The work will be on view in the exhibition “Settlers of the West,�", "The next Biennial should be held in 2021, and the first under the new agreement. The two sides are still at an impasse over the terms of a new forty-year contract.  “The Board of Trustees and I thank our board members and staff for their work in supporting our trustees and board, and especially our board chairman, Robert C. Martin, and their families, and I wish them the best in their future endeavors,” said Fairbanks Arts and Culture Commissioner Deborah D. Harris. \n\n\nThe Netherlands are planning to introduce long-term national service contracts for Dutch citizens living abroad, following the country’s experience of a sharp increase in the number of people returning from deployments to Iraq and Afghanistan. According to the New York Times, the Dutch parliament has given the government the green light to extend the contracts, which were extended for four years last year, to six months for citizens from the Middle East and North Africa, where more than one hundred people are believed to have died in coalition airstrikes since the conflict began in 2015.The extension of the work permit program, which was championed by Dutch prime minister Mark Rutte, is part of a wider European push to try to stem the country’s rise in COVID", "The next Biennial should be in 2021, the year of the third Dalai Lama, and will be organized by the Chinese government. The event has been canceled in the past, but the Chinese government has shrugged off such setbacks. It is planning to hold another event, this one in 2022, at an undisclosed location in Beijing.The event will also be hosted by the Swedish government in Stockholm. Last year, the Chinese government also canceled the event, citing security reasons. It was the first major Western country to cancel a Chinese cultural event in Beijing in decades. \n\n\nThe Los Angeles County Museum of Art (LACMA) has received a gift of more than 1,500 photographs by photographer Francis Drake’s works at its historic Huntington Library. The donation, made by Barbara Diamond, a longtime collector and arts patron, comes a year after the institution co-sponsored the annual event with the artist and means that the collection will now be accessible to the public for the first time.“The collection is a watershed in its own right,” said Barbara Diamond, who purchased the works from the artist in 1993 for $10,000. “The Huntington Library is a great home for his works and a powerful example for the wider world. Jakob Lich", "The next Biennial should be ready by August 2021.\n\n\nThe Biennial of Contemporary Art (BAC) in New Delhi, which has been under construction since 2017, is nearing completion. The exhibition, which comprises sixty works by artists whose work has not yet been published in an Indian art publication, is scheduled to open in 2022. The biennial’s other major exhibition, “The Life and Death of a Student,” will open in March 2022.The exhibition, which was organized by the Delhi-based artist-run studio Wonder Workshop, will feature the work of thirty-eight artists, including Kannan Lal, Pankaj Mishra, and Arundathi Mukherjee, who were selected by a jury comprising the artist-activists and academics S.M. Paik, Amartya Sen, and M.I.A. At the conclusion of the exhibition, the judges will select fifteen artists for the twenty-third edition of the BAC, which will take place in 2021. Last year, the five-day event drew an audience of around three hundred people.\n\n\nThe London-based nonprofit Tate Modern is planning to raise $10 million in the 2017–18 financial year to repair damage it sustained during", "The next Biennial should see the United States pursue an inclusive, trans-partisan, and trans-religious vision of its history.  This year’s edition promises to be a pivotal step in that direction. “The United States has a history of championing and embodying the universal, of responding to the needs of all of humanity, and of being deeply interlinked with the world we love,” said Jordan Waldron, president and CEO of the biennial.This year’s edition of the biennial, entitled Future Present, will be held at the Renaissance Museum in New York from January 22 to January 29. The biennial will also include a special exhibition of work from the artist’s collection that will be presented by the artist himself. “We are honored to welcome the artists back to the Renaissance to continue their work through this biennial,” said Mark Simonson, the director of the Renaissance. “The biennial is a celebration of a vibrant and globally relevant history, one that reflects the vitality of modern life.”\n\n\nThe National Museum of Fine Arts (NMFA) in Washington, DC, has received a $250,000 donation from the Wayne and Susan", "The next Biennial should take place at the 1600 West Twenty-Second Street address in Manhattan from March 15 to March 18, 2020.  The biennial will be titled “Ascension.” The exhibit will showcase work by twenty-seven artists, including Calum Guarascio, Jules Stamm, and Lászlóvar Jr., and will be organized as a “virtual exhibition” in conjunction with the new exhibition.The \"Ascension\" exhibition will feature artworks created by twenty-six artists in total. The artists participating in the exhibition are:Beatriz,  Los Angeles\n\nCara Barbera, New York\n\nCarol Chiu, New York\n\nTina Colasanti, New York\n\nFernando Claver, New York\n\nEddie Contreras, New York\n\nCarol Dallman, New York\n\nLisa Dallman, New York\n\nChristo Graziani, New York\n\nTara Dallman, New York\n\nJessica Dallman, New York\n\nLinda Dallman, New York\n\nNorie Ballesteros, New York\n\nLiliana Dallman", "The next Biennial should be held in 2021, in the same year that the eighty-sixth edition of the Stedelijk Museum will be held.<|endoftext|>This year’s edition of the Geneva Biennale, curated by an intergenerational group of South American curators led by Ana Paula Carvalho and Renata Graziani, was marred by the unexpected death of the main event, Chilean artist Carlos Eduardo Campos. The show’s artistic director, Brigitte Abate, described the death as a “strange and unexpected thing.” The controversy surrounding the artist, who was killed by a single blow to the head by a policeman on Friday, August 5, has led to a number of intense and wounding debates about the use of lethal force by police and the limits of artistic freedom.The exhibition, which was set to take place at the end of a three-day long celebration of Chilean artists, was shuttered after the death of thirty-seven-year-old Carlos Eduardo Campos, whose body was found in a river in the province of Santiago, Chile, on Wednesday. According to the New York Times, the artist was beaten by the police on July 28, 2015, after he allegedly refused", "The next Biennial should be held in March 2020 and the first in April 2020. For the past thirteen years, the museum has hosted an annual exhibition of works by artists of color. The themes for this year’s event were “Dia Art: From the Pan African to the Latin American.” The exhibition will be held at the museum’s new space in the Georgian Tallinn, the Museum of Contemporary Art Tallinn, and will feature work by forty-two artists, including Anni Gera, Joyce Lok, and Anselm Kiefer.The exhibition’s winner, Simone Hausmann, was chosen for her work Lovers in the Night, 2019, which was inspired by the novel “Amaropa Amara” by Myriam A. Rashid, and will receive a prize of $1,000. \n\n\nThe British artist Robert Mapplethorpe, whose stunningly lifelike compositions often feature space-age cosmography and myth, has died at age seventy-two.Known for his staggering series “Monochrome,” 1961, which deals with the abstract, the surreal, and the occult, Mapplethor", "The next Biennial should take place at the newly renovated Museum of Modern Art (MAA), the Museum of Modern Art (MoMA), the Museum of Modern Art Chicago, and the Museum of Modern Art Los Angeles, and will be centered on Alexander McQueen’s Transformer, a Russian Constructivist’s work that attempts to explain the nature of light and the universe. \n\n\nThe Paris-based collective Tempo Numerique (TNA) has announced that it will be participating in the upcoming edition of the Biennale d’Art Contemporain (BAC), which will take place in the French city of Charleville from April 19 to April 21, 2020. The seventy-two-year-old group formed in 1981 in Paris and has staged various exhibitions and concerts in the city since then, including the 1979 BAC show, “Spiral Line: A Retrospective,” and the 2015 event, “Arts of Art, Art History,” which marked the introduction of the group’s new term, “Arts of Performance.”“All this year has been a dream for us,” said Joël Cooperman, founding director", "The next Biennial should take place at the PanAmérica, in Mexico City, in 2021.On the future of the platform, DeSousa said: “For some years now, we have been showcasing our work in Mexico City, and now it is important to continue to do so. Our projects in the city will continue to be supported by our community and we look forward to partnering with other institutions in the city to continue to present works in Mexico City.”\n\n\nThe Pérez Art Museum Miami (PAMM) has received a $10 million donation from the Philip Johnson Foundation. The gift will allow PAMM to create a new 250-year-old statue of American painter Philip Johnson to commemorate the 200th anniversary of his death.“This memorial honors the memory of Johnson’s life and legacy and celebrates the contributions of his family and friends, and the contribution of his art to the more than four decades of the Pérez Art Museum,” said museum director Claire Johnson. PAMM is currently working on a new sculpture by the artist to commemorate the occasion.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced on Tuesday that João Paulo Sousa, whose landscape", "The next Biennial should be held in 2020 and the first in 2021.The museum will also begin a new series of exhibitions that will bring together contemporary artists who have been featured in the current exhibition program. The first exhibition will be “A Peculiar Portrait,” which will open on October 14. The second will be “The Most Dangerous Game,” which will open on October 25. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Craig Futter, whose curatorial skills and commitment to social justice are well-known, as its new associate director for education and public programs. Futter comes to the institution from the Los Angeles County Museum of Art, where he has served as a curator since 2013. He will assume his responsibilities in May.“I’ve long been committed to empowering marginalized artists through social justice initiatives,” Futter said. “The partnership with the museum makes this a perfect time to introduce new artists to the extraordinary array of artists and artworks that has shaped the history of LA through the central role of black artists in the city’s art history.”Futter’s career has taken him to the US and to Japan, where", "The next Biennial should take place in 2020. [Source: Artforum]\n\n\nCatherine LaBouvier, one of the founders of the Paris-based nonprofit Art Contemporain de Paris, was found dead on Wednesday, September 12, at her home in the 1293 district of the French capital, the Parisian Beaux-Arts. She was seventy-two years old.LaBouvier was a founder of the Paris-based cultural organization Art Contemporain de Paris (ACP), which was founded in 1977 by her sister, Marie, and her brother-in-law. Since its inception, the organization worked to sponsor the residency program in the French capital, which has been held by the Parisian Museum since 1999. Catherine was one of the early organizers of the program, which opened in 1987. She had previously organized events in the Stedelijk Museum in Amsterdam and the Musée d’Art Moderne in Paris, and she was the first to launch a residency program in Paris. Recently, the organization has been associated with the Parisian Museum as it prepares to open an exhibition in the museum’s former location of the Louvre and the Louvre Pantheon in 2020.The", "The next Biennial should commence in December 2022 and will introduce a new kind of exhibition, as well as a new kind of work, called a biennial, in which visitors will come to the museum to have an intimate experience with the works created by the artist in this exhibition. The programme will also include a workshop program, residencies for artists in the city, and other activities.A selection of works, “The BRI”\u0097a collection of biennial works that explore the relationship between art and philosophy\u0097was presented at the Venice Biennale in 2013. In the same year, an exhibition entitled “When Art and Life Were Not Enough” was staged by the university of St. Petersburg, an event that was organized at the invitation of the artist.\n\n\nLos Angeles’s City Museum of Art has announced that Sydney actor, actor, and designer Kevin Spacey is the next recipient of the ASCO—Asia Pacific Foundation’s Award for Emerging Artists. The institution placed the honor on the ambitious artist\u0097who has since been awarded more than $6 million in royalties and diy awards from his appearances in the films The Usual Suspects and Jacky (2016", "The next Biennial should take place at the National Museum in Athens in 2018. The venue is currently being renovated and will introduce new work by the Bulgarian curator Eduarda Gaidarova. Although the exhibition will focus on the art of European modernism, the theme of the show will be “Switzerland after the fall of communism,” and the exhibition’s opening ceremony will be “The Last Days of the Soviet Union.” The 2019 edition of the Biennial will be held at the Museum Venizelos in Kozlín, the capital of the former Yugoslav Republic of Macedonia. The local government of the Greek region of Thrace announced that the exhibition “will be celebrated with the total restoration of the building that houses the exhibition. In order to create an environment of tranquility, resilience, and openness, the exhibition will be relocated to a new space in the city of Thrace.”The Arts and Architecture Foundation (AFA), an independent organization based in the United Kingdom, has launched an award for the most outstanding work in the field of contemporary art. The 2019 awardees include Becca Herlihy’s work for the exhibition “Gestation” at the Museum of", "The next Biennial should take place in the spring of 2021. The exhibition’s first-ever iteration, a retrospective of the work of the Spanish artist Lluís Vidal, will run in Helsinki in the spring of 2022. The event will consist of twenty-one interviews and will feature works by forty-nine artists across twenty-six countries, including Argentina, Brazil, Chile, Germany, Japan, Mexico, Mexico City, and New Mexico.The selection committee consists of Yuki Hagi (Nippon Yoyogi), Hana Häyhänen (Netherlands–South Korea), and Marta  (Spain). The biennial will be organized in a fashion similar to the 1993 and 1995 biennials. The biennial will focus on the legacy of the late artist and curator Pia Camil. She is known for her two-decade-long, interdisciplinary career, which encompassed a number of disciplines, including architecture, sculpture, performance, painting, and sculpture. \n\n\nFollowing the tragedy that took place on September 11, 2001, and the years that followed, the Metropolitan Museum of Art in New York has announced that it is preparing to reopen with a new commitment to nearly two hundred", "The next Biennial should be held in 2020, the conservators said. The institution is currently working on an update to its current programming that will invite the public to experience the exhibition in a new way. The new series of events will be curated by the same group responsible for the exhibition, which will be held at the same location, with the same visitors in 2021, and will have a similar theme. The Biennial will be inaugurated by an exhibition of work by artist-collectors Málila Cernír, José Galindo, and Kirill Nesheev, and will run for twelve weeks.“We are very excited by the prospect of hosting the 2019 World Biennial in Amsterdam and are already preparing for the 2020 edition, ‘Diversity and Art: From the Box’s to the Biennial,” the organizers said. The teams hope to host the exhibition in 2020, but the date has yet to be set. The exhibition will be inaugurated by an exhibition of work by artist-collectors Málila Cernír, José Galindo, and Kirill Nesheev, and will run for twelve weeks.\n\n\nThe National Gallery in London has appointed Dor", "The next Biennial should take place in the spring of 2021. The theme of the exhibition will be “Love and the Art of the Body.”Mikel Palumbi, director of the Contemporary Art Museum of Fortaleza in Brazil, told Artnet that the twenty-fifth edition of the biennial would be focused on “the art of the body,” its “natural material.” The biennial will receive funding from the Brazilian Ministry of Culture and the Museu de Arte de São Paulo, the State of Rio Grande do Sul, and the state of Minas Gerais, Brazil’s Ministry of Health, and will take place at the Museum of Fine Arts (MFA) in Rio de Janeiro.\n\n\nThe museum of modern art (MoMA) in New York has received a gift of more than three hundred works by artists from the private collection of the late Whitney Jewett. The gift includes works by Jane Birkin, Adrienne Atget, William Eggleston, Alice Abernathy, and many others whose works are currently on display in “Patriot” (2018), a public program of events and exhibitions that celebrates the life and work of American", "The next Biennial should take place in 2021.\n\n\nThe Mount Sinai School of Art in New York has been awarded a $50,000 grant from the William and Flora Hewlett Foundation for the Arts (WHAF). The gift was made in recognition of the school’s commitment to supporting the visual arts and the diverse communities that depend on its programs for inspiring and sustaining students. Mitchell Jacobson, the foundation’s president and CEO, said: “This is a very special year and we are thrilled to be able to support artists and the arts at Mount Sinai. The Hewlett Foundation has long supported artists and their work and our board, which includes artists themselves, has long been committed to supporting their careers. It is an honor to know that so many of these artists have chosen to return the favor and donate their art to the school. ”The Hewlett Foundation’s board of trustees also announced a new $150,000 space in the school’s collection for art historian Michael Bradley. Over ten years ago, the foundation gave the artist $10,000 to create a new collection. For this year’s occasion, the Hewlett Foundation will also donate a work by Hewlett as part of", "The next Biennial should be staged in 2020. The Berlin Biennale, a joint venture between the city of Berlin and the state of Berlin, will take place at the Berlin state museum in 2021. The Berlinale will be hosted by the Berlin Art Museum (BAM) and will be scheduled in 2021. The event will also include two films by the artists who won the first prize: art-house director Christian Laib, the European Commission’s candidate for the $10,000 Artistic Prize, and German photographer Wolfgang Lanzmann, which will be presented by the Fabian Funkausch. In the second prize, the museum will present the work of the artist-in-residence, Adriana Varejão-Fernández, and she will be presented with the award in the autumn of 2021.The Berlin Art Show will also launch a digital platform, which will allow visitors to see all works presented by the Berlin 2018 biennale artists in the first half of 2020. “The second half of 2020 is where we already see the most time-sensitive and the most important digital work this year,” said Bernd Lühr, head of the Berlin Art Show.    \n\n", "The next Biennial should be held in 2020. \n\n\nThe Los Angeles County Museum of Art (LACMA), a major cultural institution in Southern California, has received a gift of fifteen works by the American sculptor Emily Mason. The works, which were donated by the Simon Family Foundation, were donated by the Custodian of the Simon Family Collection, which is managed by the Simon family, the founders of the denim company Levi Strauss & Co. As part of the institution’s $50 million campaign to renovate the museum, eleven works by the artist were gifted to the museum in a ceremony held at LACMA on Friday. The pieces, which are part of the collection’s New York–based series, “Tales from the American West,” are part of a larger exhibition that will present the work of ten American sculptors in 2020. The works will be on display in “Tales from the American West” “at the museum’s new outpost, ‘The Watershed,’ which will open in the museum next spring, and will be included in a major exhibition, ‘The American Art, 1960–1985,” organized by the museum.“We are", "The next Biennial should focus on “Intersection of Art and Life,” which will be hosted by the National Gallery in Washington DC, and will then hold an exhibition dedicated to a “humanist” view of the universe. The exhibition will also include a selection of works by artists such as Gerhard Richter, and will be on view until April 7, 2020. More information about the event will be announced in the coming weeks.The festival is cofounded by Petra Walther, who is director of the National Museum Vienna; Robert Sicha, who is director of the Institute for Contemporary Art Vienna; and Wolfgang Suter, who is curator of art.The inaugural event will take place in September in the city of Vienna and will organize a selection of works by 150 artists. The forty-one-hundredth edition will open in March 2020.  Artists participating in the event include Friedrich Rieschke, Edyta Grodzka, Joachim Kremer, Ralph McQuarrie, and Antonio Miro. \n\n\nThe Pérez Art Museum Miami (PAMM) has received an anonymous donation of sixteen works by artists such as Édouard", "The next Biennial should take place in 2020, and the first in 2021.\n\n\nThe Museum of Fine Arts (MFA) in Boston has announced that Jodi Throckmorton has been named curator of contemporary art. Throckmorton joins the museum from the Victor Butler Foundation, where she was director of curatorial affairs between 2012 and 2017. Throckmorton began her career at the museum as a curatorial assistant and later became director of collections and exhibitions in 2016.“Jodi’s curating and exhibition-making skills and her ability to integrate contemporary and experimental art and design are unparalleled,” said museum director Daniel H. Weiss. “Her ability to integrate art and design for a contemporary audience is of paramount importance now more than ever. We look forward to developing new ways for visitors to experience the collection.”Previously, Throckmorton worked as a curatorial assistant at the Museum of Modern Art (MoMA); as a curator at the Pérez Art Museum in Mexico City; and as a curatorial assistant at the Museum of Modern Art in London.\n\n\nThe Delhi-based artist and writer Shilpa Grothe, whose vibrant, point-by-point painted installations evoke both the Greek and", "The next Biennial should be held in 2020. The full list of participating artists is as follows:Annie Bell in the Garden: MESA, Arizona ARTIST AND COOPERATIVE CENTRAL INC. (A.C.G.C.)2016*Kristen Corrigan: Spring Awakening (2015) Nils Dählkvist: Becoming (1958) Robert Eggleston: Waves (2018) Hannah Fraser: The American Dream: From the Diary of a Young Girl (1934) Tara Hafner, Peter Kohn: How to Live Today, Today, Tomorrow, and Tomorrow (1935)*****Willamette Weekender: The Visitor (1940) Miles Hayden: Moving to the City: The Historic Journey (2015) Claudia Hayes: The Naked Sun (1957) Karen Harris: The Skin I Live In: A Collection of Photographs by Mimsy Bishop (1949) Claudia Harris: The Best of Friends (1955) Claudia Harris: Oliver H. Griffin: A Retrospective (1969) Claudia Harris:", "The next Biennial should include an exhibition of original art by women artists, and an oral history of the pioneers, including Simone Leigh, who invented the medium; and an interactive work, entitled The Spirit in Motion (Hekmatova, 2018). The work will be located throughout the museum and will be inspired by the many artists who have made the journey to Poland, most recently György Karysz, whose work will be on display.\n\n\nEuropean commission vice president Jyrki Katainen has announced that the fifty-third edition of the Venice Architecture Biennale will take place in 2020. The event, which will be held in the city of Venice from May 22 to May 31, will showcase around sixty new works, selected from a fifty-six-list, and will introduce more than three hundred new works in addition to the usual thirty-two works.The biennial, which will also include a redesign of the architectural site of the ancient city of Santa Maria del Giglio, and a retrospective of the work of US architect and theorist, John McAllister, will run concurrently with the 2020 Olympic and the 2020 Turin Biennale. The latter, which will take place in Italy from May 23 to May 31, will be", "The next Biennial should include a dialogue between photographer Mike Kelley and Charles Gordon-Levitt, with the exhibition marking the first time the two artists have collaborated on an exhibition.“We are proud to be able to launch the next year with the work of the two greats,” said Vincent van Gogh, the exhibition’s director and chairman. “Mike Kelley’s photographs have had an enormous influence on the course of modern art, and Charles Gordon-Levitt’s drawings are timelessly beautiful. A selection of his drawings is on display in the exhibition ‘The Man in the Middle.” Previously, the exhibition has featured works by twenty-six artists, including Antoine Laplace, Édouard Vuillard, Pierre-Auguste Renoir, and Pierre-Auguste Cousteau, among many others that have had the honor of presenting in the exhibition.\n\n\nThe Metropolitan Museum of Art in New York announced today that it is launching a $500,000 fund for musicians and musicians whose work is currently under copyright and whose works have not yet been assigned to the public. The fund will award $5,000 to one artist and $10,000", "The next Biennial should organize a symposium covering the history of the art, explore the role of the artist in the production of art, and offer opportunities for discussions and consultations. The first event should take place in the early 2020s.\n\n\nNew York’s Metropolitan Museum of Art, the Museum of Modern Art (MoMA), and the Museum of Modern Art (MoMA) in New York have announced that on February 2, they will begin reopening to the public at 6 PM on Saturday, February 20. The reopening of the museums coincides with the opening of the Museum of Modern Art, which will be inaugurated by a dramatic reopening of the Whitney Museum of American Art on Friday, February 17.The announcement follows a month of protests and a petition drive, spearheaded by the museum’s director Daniel H. Weiss, against the construction of a new $1.2 billion Whitney Museum of American Art. Weiss claims that the project would shift the museum’s focus away from its African American and Latinx communities and that the museum would be an “unnecessarily large museum.” He also claimed that the museum would continue to exist as a “microcosm” of the city, as opposed to", "The next Biennial should be held after the summer session. It will focus on the legacy of feminist artist-activists and how they have shaped contemporary practice and will present a selection of works by the group \"Women’s Security\", such as the work “Imagine a World without Violence,” 1979, and “Introduction to San Francisco” (1993). The show will also address issues such as gender equality and the body politic. The 2019 exhibition will feature twenty-five works by forty-four artists, including Dominique Vuillard, Alain Guiraudy, and Aline Nouvel, among others who have been identified as key figures in the feminist movement.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines for the display of works by forty-seven contemporary artists in the city next year. Among the recommendations are expanding the scope of the city’s free general admission museums, including the Metropolitan Museum of Art, the Brooklyn Museum, the Bronx Museum of the Arts, and the Bronx Museum of the Arts; banning the display of works by artists whose practices engage with issues of race, gender, political agendas, and economics; and establishing a unified set of guidelines for all fifty boroughs.", "The next Biennial should take place in the capital city of the state of New York, New York, in 2021.<|endoftext|>John Sze, a lawyer and director who has specialized in copyright and intellectual-property law, was found dead of a presumed heart attack on Tuesday at his home in Philadelphia. He was fifty-three years old.Born in New York City in 1943, Sze studied at the University of Pennsylvania before opening an eponymous practice in Brooklyn. In 1984, at age twenty-one, he and his wife, Patricia, moved to Los Angeles, where he found a new home. His first client was Lucasfilm, which hired him to represent the company at a time when the James Bond film franchise was still in its infancy. He represented a number of clients in subsequent years, including, most recently, UTA Corporation, which owns the rights to the Beatles, and Litton & Mayhew, where he represented a client who purchased a large number of objects through a London auction house in 2008.Sze has also represented clients in the film-world industry, including Richard Attenborough, who purchased a set of photos by the artist Kiki Smith for $100,000, and the Swiss luxury-goods brand Hermes. In addition to his", "The next Biennial should take place in the space of the artist’s permanent residence—and should be accompanied by new exhibitions, lectures, and other events on the contributions of women artists to the field. The biennial should be hosted by the Whittier Art Museum and the Center for Contemporary Art, Los Angeles.  The 2020 edition will be organized as follows: The lecture series will be curated by Ruth Hennessy, curator of modern art at the Museum of Contemporary Art, Los Angeles; Christie Ritson, curator of modern art at the Museum of Modern Art, San Diego; Reynolds New York; and JAMES TYRONE, editor of the monthly magazine Artforum. The exhibition “The Art of the Party,” which will include works by seventy-eight artists, will unveil at the Whittier Art Museum on June 3.\n\n\nThe Institute of Contemporary Arts (ICA) in London announced today that it is preparing to welcome visitors back to the arts on December 22 after a temporary closure due to the Covid-19 pandemic. The ICA’s director, Johanna Drummond, said: “We will start the reopening process by introducing new and exciting programming", "The next Biennial should be held in 2022, with the exhibition scheduled to run from January 2 to January 5, 2019. The venue for the 2022 event will be decided by the City of Milan, with the exhibition organizers and the city working together.The partnership between the two institutions will allow the organizers to apply for a direct grant from the Chamber of Deputies of Milan, to cover the costs of the construction of the exhibition. The grant will be delivered by the Chamber of Deputies for the construction of the Biennial. If the event is successful, the venue will be commissioned by the city and will occupy the historic site of the old Allia Bicentennial in Milan.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it is in the process of revamping two of its buildings, the Fernando Biennial and the Tadao Ando Design Center. The projects will aim to increase the exhibition space for contemporary art, and will address institutional inequities.“We are redesigning the Fernando and the Tadao Ando to reflect contemporary trends and to offer more engaging, global, and local exhibitions that are inspired by local, regional, and national art,” said Deborah Carvalho, director of the Fernando", "The next Biennial should occur on the campus of the Museum of Contemporary Art, Los Angeles (MOCA), in 2020, but the organization’s board of directors told Artnet that it understood the event would not be held in 2021. The decision was made after the museum, which has more than 1,300 works by contemporary artists in its collection, decided not to renew the contract of the artist’s representative, Bojana Stenberg, who represents Jean-Michel Basquiat.\n\n\nThe Little Sisters of Zion, a group of American artists who are dedicated to promoting the work of lesser-known American artists, has filed a lawsuit against the National Gallery of Art in Washington, DC, over a $2 billion contract that expired in 2018. The group claims that the museum failed to renew the artist’s contract after it cited a “lack of progress” as the reason for the lapse.The lawsuit alleges that the museum failed to inform the artist for eighteen months that her contract would be up after only six months. While she was not informed of the working conditions that would result from the work she produced during her contract, the group claims she was never given a chance to present her work for the institution.“Through", "The next Biennial should be held in 2020. At this point in its development, the museum is still working on its plans for the future.  Related: Donovan: I want to be an architect. “I want to create spaces for dialogue between people and the things around me.”\n\n\nEd Moses, the founder of the New Orleans–based nonprofit New Artists for a Better World (N.A.B.W.), has died at age sixty-two. The organization—which Moses founded in 2010 as a way to address the city’s homelessness crisis—was criticized for turning a blind eye to the deaths of at least eighty people, including many within its own organization and its own staff, and for focusing on the institutional over the personal.In a scathing statement released by N.A.B.W. director Kevin Roesler, who also represented the organization in court, he said Moses’ death was a “complete loss of perspective on the many lives he has destroyed.” Roesler also criticized the organization’s silence in the face of mounting evidence of its complicity in the city’s opioid crisis, which culminated in Governor John Bel Edwards�", "The next Biennial should begin in December 2020 and will be hosted by the Palazzo Nazionale d’Arte Contemporanea in Rome.  More information can be found on the festival’s website. \n\n\nThe British Museum in London is planning to invest $1.5 million into the cultural institution in the upcoming edition of the Fifty-Eighth Venice Biennale. The funds will go towards the development of the museum’s new exhibition “Hidden Worlds: Art and Politics in the Shadows,” which will open in 2020.The museum has already allocated $1.4 million for “Hidden Figures: Art and Politics in the Shadows” and will continue to support the project with “Steadfast in the Night: Art and Politics in the Shadows” around December. The full list of participating artists is as follows:Anselm KieferAnselm Kiefer (1905–1986)Art and Politics in the Shadows Amarinder Dutt (1905–1983)Alfred Dezeen (1905–1986)Ariana Zorín (1902–1991)Karl Lagerfeld (1902–1993)P", "The next Biennial should open in 2019.  The 15th Biennial will take place in 2020.\n\n\nEbony & Sargent, London: On Tuesday, August 26, the auction house announced its representation of the work of American artist Patricia Arquette. Held at the Museum of Modern Art in New York, the piece will go on view in the May 22 exhibition “Theaters of Light: Patricia Arquette” in London. The artist’s first solo show at the auction house, which has previously presented pieces by artists like Richard Diebenkorn, Mark Halperin, Sally Mann, and Anthony Das, will be included in “Theaters of Light: Patricia Arquette” alongside works by contemporary artists such as James Turrell, Mark Rylance, and Adam Derr. The show will also present the first solo exhibitions of Arquette’s work in the United States and the United Kingdom. This is the first exhibition of her work in the UK since 1982.Commenting on her work, Arquette said: “Theaters of Light is a process, not a result, as a painting or sculpture. It is an account of my own life, a record", "The next Biennial should be on December 27th.\n\n\nItalian architect, designer, and sculptor Dario Catellani, who designed several monumental works, including the city of Rieti in northern Italy, Lisbon, and the Palazzo Lavanti in Venice, died on December 22 at the age of eighty. Colleagues and contemporaries have described him as an active collaborator and creator whose work embodies an active imagination and a humanistic spirit, an idealism that could be found in the work of his contemporaries and of his successors.Born in Siena, Italy, in 1936, Catellani studied at the prestigious Ponti Institute of Art, the Museo della Francesa and the Guggenheim in Venice. He also studied at the Sorbonne and the University of Milan, where he met Matteo Signori, the latter of whom would become his mentor and collaborator. In the 1950s, Catellani returned to Italy, where he would live and work in Milan until his death.Catellani’s career began in the 1960s at the Milan Academy of Fine Arts (MARA) in the city of Turin, where he received his BA in 1964. He later worked at the G", "The next Biennial should be in 2020, so that we can focus on the future and not on the past.”\n\nLos Angeles’s Black Box Theater—a project of the Los Angeles Alliance of Musicians (LBMA), a group that was formed in 2000 to support the residency program and a newly created museum dedicated to the Black Arts—has announced that it will cease operations immediately.Founder and CEO of the independent nonprofit Black Box Theater, Matthew Boyd, wrote on the organization’s website: “The Black Box Theater has been a community project of the Los Angeles community since its inception in 2000. We created a space for the performing arts in a building adjacent to the Los Angeles County Museum of Art (LACMA) for a total of twenty-three years. We are fortunate to be able to continue to create work in a space that gives back to the community and is financially supported by the county.”In an interview with the Los Angeles Times in 2016, Boyd said that “[the’s relationship with the county] has been symbiotic. We’ve been part of the community for fifty years, and we’re now at the twenty-fifth anniversary of our partnership. We’", "The next Biennial should be ready by the end of the year, and will be hosted at the São Paulo Biennial from July 18 to July 21. It will be organized in the same way as the previous three editions, and will be housed in the same building.“The upcoming platform is an ambitious and necessary step that, together with the ongoing campaign, we are undertaking to present the best work of the world’s most acclaimed artists,” Paulo will say. “I’m very pleased with the way the exhibition has progressed and am convinced that, together with the support of the public, the exhibition will now be able to carry out the exhibition at its full potential.” \n\n\nArtists Michael Saunderson, Paul Gauguin, and Jason Riley—creators of Nine Stories, a series of paintings that explore the concepts of memory, fiction, and fabrication, respectively—have been selected as the recipients of this year’s Peabody-Essex Art Museum (PEAM) fellowships. In addition to receiving $25,000, each artist will have their work featured in a major retrospective at the Peabody-Essex Museum in 2019.“We’re thrilled that the", "The next Biennial should also include a section on the history of the institution’s curatorial practice, with an estimate of its annual budget of $100,000, and the theme of the year: “Re-Designing the Future.”\n\n\nThe New Museum in New York has appointed Sarah Edmonds as its next director and CEO. Since she comes to the institution from the Metropolitan Museum of Art, where she has served as deputy director since 2013, Edmonds will take the helm from director Daniel H. Weiss.“We are thrilled to welcome Sarah to the New Museum,” said Weiss. “Sarah brings a deep understanding of the art world, a global perspective, and an exceptional track record of success. Equally, she is committed to growing our exhibition and education programs and developing our digital presence, and she has the vision and ability to realize this mission.”Weiss added that Edmonds “has the courage and vision to lead as New Museum’s director without compromising the museum’s mission. She has the vision and ability to ensure the museum’s future, both as a great institution of cultural heritage and as an essential stop on the way to work and play.”\n\n\nThe", "The next Biennial should be held at a place that is geographically close to where the work is located: an urban site where the artist can be found. We believe that this choice is a significant step forward in the development of our exhibition program. The exhibition, which will be organized as the artist performs a solo show in the gallery, will highlight the artist’s ongoing exploration of the possibilities of art and will help to advance the artist’s career.”The foundation, which received $3.5 million in support of the $5 million goal and has also committed $1 million of its own funds to the project, said: “The next Biennial will be a transformative experience for the gallery. Each year, we are inspired by the work of the artists who have come before us, and we hope that the gallery will provide a platform for these artists to continue to be celebrated. The genius of the gallery is to present a rich and inspiring collection of works in the museum, in a setting that can accommodate the artist’s practice and personal needs.”The selection of the eight artists for this year’s exhibition is led by Katherine Wilshere, who will represent England at the 2019 Venice Biennale; O", "The next Biennial should be in 2020 and will be free to the public. Artopolis Berlin, the institution responsible for the exhibition at the center of the Berlin Art Week, is also proposing a new event, Art Berlin 2020, which will be free to the public and will take place at the Berlin Art Museum (BAM). The first edition of Art Berlin 2020 will be held in June and will feature a total of ninety works by twenty-six artists, including Marc Chagall, Klaus Nihold, and André Breton, and will be held in conjunction with the German New Year. “The future of our city is at stake,” said Berlin Mayor Klaus Wowereit. “We must work together to establish a new political framework for art in Berlin, with a clear vision of how art can play a role in renewing and strengthening the city, and how the city can be a platform for art.”The city council is currently working on a new agreement with the Nazis, and the building of the Neue Galerie bis nach dem artgalerie Kunstbau now comes under intense scrutiny. The building, which was converted into a concentration camp in 1937, was renovated by the Nazis", "The next Biennial should focus on a new narrative that takes the place of the historical narrative within a new media—a new life experience. This means a creative and collaborative experiment to retell the story of the artist and artist-lover from a different point of view, to a different place. We are scared about the reaction of the museums; we are scared about the museums themselves; we are scared about the government; we are scared about the city; we are scared about the country.”\n\n\nThe Museum of Fine Arts (MFA) in Boston has added two new members to its board of trustees: artist-activist and author Vinnie Bagwell, and photographer and writer Hannah Wilkes.“In addition to overseeing the day-to-day operations of the museum, the board is responsible for overseeing the board of trustees, which is comprised of two trustees: Vinnie and Hannah,” said board chair Matthew Bergin. “They are both passionate about the museum and have been active in its community for years. As trustees we’re in the best position to advise and guide the museum through this challenging moment in its history, and we’re all the more excited for the future of the museum and the MFA", "The next Biennial should be held in 2020, and the exhibition should be inaugurated with a public speech by the author, an author whose work has been selected for the future exhibition, titled “The Body’s Symbolic Presence: Constructivism and the Body in Art” (the main stage will be a temporary installation), in which the author will reflect on multiple works by artists who have made important contributions to the Arts.Vincent van Gogh was the first to use the term “body art” to describe a body that made up art. From the late 1970s onward, van Gogh worked to find the body within the art, always using bodies in his paintings and drawings. Van Gogh has said that the body is a “living structure that consists of two parts: the skeleton and the supporting structure.” In his novel The Pale Horse (1931), van Gogh writes that the skeleton is a “bio-mechanism,” a “living structure that’s ‘brought to life’ by a living spirit.” In his 1947 letter to his son Georg, van Gogh wrote: “I consider painting and sculpture as the most important stages of my career", "The next Biennial should take place in August 2021, before the loss of the Olympics and the Grand Duchy of Monaco. Günther Oertel, president of the German National Association for Culture, told the Art Newspaper: “There are still three years to go. We are not there yet.”In the meantime, the biennial’s organizers are working with the preservation section of the Art Newspaper to create an online platform for the exhibition, which will be carried out in collaboration with an artist-run platform called Solidarität. The exhibition will focus on the work of fifteen artists and will run for ninety days. \n\n\nThe 2018–19 calendar for the Venice Biennale, curated by an esteemed group comprising Jan Kudacki, Sabine Syms, and Agostino Poggio, has been released. Titled “Where Art Explores and Visions Come Back,” the show will be curated by the Italian architect, photographer, and curator Roberto Cicutto, whose exhibition at the Venice Architecture Biennale in 2019 comprised more than seventy works, and will be open to the public from June 3–June 13, 2020.Exhibitions and performances will feature works by forty", "The next Biennial should be held in the spring of 2021. \n\n\nNorth Korea has released a statement saying that an earthquake measuring 6.7 on the Richter scale struck the country on Thursday, January 7, killing at least forty-five people and injuring hundreds more. According to the New York Times, the death toll has risen to at least sixty-five. The country also listed the temblor as a Class 5 earthquake, which would indicate a magnitude 6.6 earthquake.The country also said that twenty-two people were injured in a 6.9 tremor that struck in the county of Wonsan in northeastern North Korea on January 10. The eruption also rocked the capital, Pyongyang, and the surrounding area, triggering major power outages. The earthquake measured at 6.7 on the Richter scale, which is the same as the magnitude 6.6 temblor that occurred in March 2011.The United States Geological Survey (USGS) says that the quake traveled more than 630 miles (1,130 kilometers) and caused at least $50 billion in damage. Among the areas that were damaged were two-thirds of the University of North Korea, the country’s leading arts and culture institution, and the Pyongyang Metropolitan Museum of Art", "The next Biennial should take place in 2020.\n\nThe exhibition will showcase the work of twenty-four artists from the United States, Europe, and Asia. The selections will be based on a theme of the unification of science and society. The theme of the exhibition will be “Becoming Human: From the Philosophy of the Modern World to the Contemporary Situation.” The biennial will be curated by Johannes Gadsden, the Artistic Director of the Center for Contemporary Art in Munich; Klaus Gebhardt, the director of the Museum of Modern Art Frankfurt; and Judith Tung, the director of the National Museum of Natural History in Beijing.The announcement of the twenty-four artists for the exhibition comes amid a global strike that began on March 25 and is expected to last until March 29. The strikes have become a rallying cry for workers in support of workers across the globe. “We are deeply concerned by the strike action in the United States,” said Louella Sitt, executive director of the International Association of Art Collectors (IAC). “And we are also concerned by the strike action in Hong Kong, China, India, and Japan. The IAC is urging everyone who is able to travel to these countries to", "The next Biennial should be held in the fall of 2021. In the meantime, the government is planning to issue a long-term strategic plan to address the challenges posed by climate change in the coming years. The plan will also include the establishment of a $40 million fund to support the rapid deployment of emergency response and recovery capabilities in the event of an emergency situation, and will include recommendations on how to reduce greenhouse gas emissions.\n\n\nThe museum’s longtime director and chief curator, Mary Ellen Mark, has died at age eighty-eight at her home in New York. The cause of death was pneumonia, an illness that has afflicted the institution since its founding by the German Israeli architect Carl Weizenstaedt in 1939. Over the years, the museum has been held in various states of decomposition, including in a number of states of emergency, including in the event of an Ebola outbreak in West Africa in 1976.“Mary Ellen was a remarkable curator and scholar, a virtuoso writer, a tireless advocate for women’s issues, a tireless advocate for the arts, a tireless champion of freedom of expression,” said Mark. “With her immense talent and skill, she shaped the Biennial to become an essential"]