["The next Biennial should focus on revolutionary discussions of and interconnectivity between public art and social movements, as well as the relevance of public art and social movements in contemporary life.”The next edition of the International will be held in January 2021 at the Four Seasons Hotel in Beijing, in conjunction with the Beijing Art Museum.\n\n\nThe City of New York, Massachusetts, is taking a major step toward reopening to the public when it reopens on April 6. Governor Andrew Cuomo announced on Thursday that the city’s public art museums and city-owned parking lots will reopen on April 7, 2020, the same day as the Presidential inauguration of President Donald Trump. The announcement came three days after Cuomo signed a $2 billion transportation bill that restructured New York’s transportation infrastructure and introduced new taxes and spending, including a $200 million boost for transportation.“I thank our governors and mayors for working together to balance the budget and invest in our public transportation system,” Cuomo said at a press conference. “This year’s budget allows us to be more fiscally responsible and more effective in supporting our public transportation system, and I’m confident that once we open on April 7, 2020, we will have a", "The next Biennial should be held in 2020.\n\n\nThe New York artist who designed the iconic Hudson Yards development site and occupied most of the area since 1975 is suing the city for $50 million. The artist is trying to recoup the expenses of restoring his work, which is currently on display in a permanent collection at the Museum of Modern Art, and is demanding that the city compensate him for lost income from the tsunami of visitors and businesses that swarmed the former industrial site during the 2011 pandemic.“Museums have a fundamental role in supporting and preserving the city’s cultural heritage,” said New York state attorney general Eric Adams. “This case presents the greatest opportunity for museums to reclaim lost income and to put in place effective emergency plans to protect the future of their collections and programs.”The case, filed by the defendant, the city of New York, is one of several attempting to hold the city accountable for cleaning up the area around the former site of the World Trade Center site and is being heard by Manhattan federal judge Rudolph Contreras in the Southern District of New York. Contreras is expected to rule in the case by the end of the year. While the exact damages awarded by the plaintiff are still being", "The next Biennial should focus on “searching the horizon,” and on contemporary artistic practices. The 2020 edition will focus on the life and work of Robert Irwin; the work of Andrea Küng, Jana Dimou, Yuki Matsuda, and other major contemporary artists; and the work of the Nigerian artist and activist, Nino Rubaru.\n\n\nArtforum’s March/April 2019 issue previews the seventy-fifth edition of the Chicago Biennial, which will take place at the newly renovated McCormick Place from April 19 to April 21, 2020. The event will offer an engaging look at contemporary art through the eyes of art historians, curators, and artists.“We’ve been dreaming of a Chicago art biennial for some time, and now we’re seeing it realized,” said Craig Peterson, art critic and editor of Artforum. Born and raised in Chicago, Peterson has covered all aspects of the arts for the Chicago Reader, Chicago Magazine, Chicago Sun-Times, Artnet, and Artnet News. He is a cofounder of the photography blog The Black Tie and the graphic novel blog The Strand. “The city’s art scene has been in", "The next Biennial should be in December 2021. The museum will then consider the possibility of an exhibition in January 2022, and a retrospective in March 2022. For the museums, the calendar is crucial. The earliest opening date is December 31st.\n\n\nThe National Gallery of Ireland (NGA) in Dublin has revealed six new works by fourteen new artists who will be included in its inaugural edition, which will be held at the Galleries of Ireland from March 14 to March 16. The exhibition will highlight the work of contemporary artists from the region and beyond and will comprise two intermissions: one representing a contemporary artist whose work is currently on view at the NGA, and another exploring the relationship between art and the landscape. Born and based in Dublin, the exhibition will take a three-day format, with the artists returning to the museum as they represent their respective regions. The day-long program will feature works on display in the galleries and will be accompanied by a series of public programs, which will offer an insight into the cultural life of the area and will include performances, performances, sculptures, photography, installations, performances, photography, installations, photography, photography, photography, photography, photography, photography, photography, photography, photography, photography, photography,", "The next Biennial should take place in the year 2021, said the organizers.   The 2020 edition, titled The Art of the Body, came before the exhibition held by the Japanese artist Takashi Yamanashi. The biennial’s exhibition “The Performance of the Body: Art and Performance” will be supported by the Japanese Foundation for Contemporary Arts and the Tokyo Metropolitan Museum of Art, as well as the Ōkaburō Museum of Art in Fukuoka and the Museo de Arte Contemporáneo de San Martín in Madrid.The 2019 edition, entitled The Body in Separation, was staged by Yuki Kondo at the Jan/Feb/March/April/May/June annual Biennale in Berlin and featured work by artists such as Tamsyn Anhuang, Rindam Ojha, Nandini Prasad, and Tamara Prerna. The event was also attended by artists including Yinka Shonibare, Koki Tanaka, and K. M. Koppelman.  The biennial for the first time will also include works by artists such as Lesli Laudel, Mariya Miro, and David R", "The next Biennial should take place in the spring of 2021. “The whole thing is going to change,” Kanter said. “I’m sure of it. That’s what we wanted. I mean, we always thought we were the ones who needed to change. We were the ones who designed the building, we were the ones who built the buildings, we were the ones who shared the stories with the public. We were the ones who made the art. We were the ones who created the history. And we’re going to make it up again.”\n\n\nThe Contemporary Art Museum Houston has released the list of fifty-six artists whose works will be included in the upcoming exhibition “Day of the Dead” at the institution, which opened in 2009 and has been closed since March 19. The exhibition will include work by seventy-one contemporary artists whose works were collected by the museum in a special exhibition that opened on October 7.“This is a critical time for art museums as museums transition to new models that better reflect the world we want to serve,” said Tiffany Stanley, the museum’s curator of contemporary art. “Art museums have been facing the same", "The next Biennial should assemble a group of artists, artists' groups, and other relevant stakeholders to develop and present a programme for the exhibition space, the building and the surrounding area, which will be inaugurated by the Tunisian artist Salah ElBaradei. The show will then return to the Tunisian capital, Tunis, where it will be presented by Nusrat Ali ElBaradei from May 15–May 21.\n\n\nArtists and art-lovers across the United States are protesting the closure of their local and state-level galleries by the Trump administration. They are demanding that the federal government protect the “open and vibrant” spaces that are integral to their businesses, and that the “close down” of these spaces be recognized as a victory for artists and their supporters.The demonstrations have been sparked by the US president’s recent threats to pull funding from organizations that provide relief to artistic workers affected by the Covid-19 pandemic. “This is a victory for artists and the artists’ families,” said Mark Ruffalo, the founder of the Beat Generation collective. “The fight for workers and for the future of our planet is not a distant memory, it is now", "The next Biennial should be held in 2021. The 2019 event featured work by seventy-nine artists, including Nick Cave, John Paul Jones, Tarek Atoui, Mark di Suvero, and Marina Nevett, in addition to work by a select group of artists that may be included in the 2020 event, which will be held at the Museum of Modern Art, New York, in 2021.  The 2020 event will be hosted by the Museum of Modern Art in New York and will be led by curator Eva Nuzzo.\n\n\nThe University of Chicago announced today that it will dedicate an entire year to revamping its undergraduate degree program to better reflect the diversity of its campus. The move is part of a new initiative it launched in 2019—the first time the institution devoted a year to revamping a degree program—and is being led by Helen Zsigmond, director and CEO of the Chicago-based company International Center for the Arts (ICA), which also provides academic support for students across the United States.“We are really excited to be working with the Chicago student body and getting their insights and perspectives to help us design a new undergraduate degree for our graduate students,” said Zsigmond. “", "The next Biennial should take place in 2020, the organizers said.\n\n\nThe Museums Association (MA), a United Kingdom–based organization representing more than 1,500 museum directors and trustees, has released guidelines for museums planning to break away from the UK government in protest of Brexit. The document, issued by the Association of Directors of Museums (ADAM), outlines a five-point plan that aims to prepare for the possibility that the United Kingdom will leave the European Union—it does not mention the possibility of a second referendum—and outlines how institutions could begin dismantling their collections as early as April 1.According to the guidelines, museums that are considering breaking away from the UK must first consult with the local government. If the government is in favor of keeping the Union, it should consult with the MA before agreeing to the institutions’ proposed breakaway move, which would then trigger a two-week period of closure for museums. The government must also engage with the archaeological and conservation communities to find a solution that protects the cultural and scientific heritage of the United Kingdom and is acceptable to both sides of the debate. If the government is opposed to a second referendum on Brexit, it must also consult with the local and international community.If the institutions are successful in their plans", "The next Biennial should be held at the Museum of Contemporary Art, Miami Beach. Art in America has also released a statement about the new exhibition, which will run until October 7 and will consist of three exhibitions: Art in the Age of Black Power (2018), Self-Portrait (2017), and The Struggle for Civil Rights (2017).The collection is curated by Victoria Miro and includes work by Cynthia Nixon, B. Jocelyn Harris, Otis Geby, Patton Fox, Nari Ward, Sarah Waters, and Yuriy Vasilyev. The exhibition will launch with a special exhibition of works by Hauser & Wirth, Charles A. Birnbaum, Bette Davis, George Segal, and Jean-Luc Moulène in October 2020.MIMAM is also preparing for its opening with a series of programming that will take place across Museum District, including a lecture series with a keynote address by Charles A. Birnbaum and a Q&A session with Ma and Paolo Baratta, founder of Ma Baratta, on October 12.\n\n\nThe Los Angeles County Museum of Art (LACMA) has", "The next Biennial should take place in 2021. The first exhibition, “The Palazzo Reale,” will be in the Four Seasons Hotel, Rome, in January 2021. The second, “Espinizzione Venezia,” will be held at the Reale in March 2021. The third exhibition, “The Truth,” will be held at the Palazzo Reale in June 2021. The fourth, “Sara Cwynar: Life and Art,” will be staged in Rome in March 2022.  The fifth, “Deana Lawson: Searching the Sky for a Radiant City,” will be staged at the Palazzo Reale in May 2022. The sixth, “The Structure of the City,” will be staged at the Palazzo Reale in November 2022. The seventh, “The Bay of Pigs,” will be staged at the Palazzo Reale in September 2022. The seventeenth Venice Biennale, “The Anatomy of an Exhibition,” will be held at the Palazzo Reale in March 2025. The twenty-sixth Venice Architecture Bienn", "The next Biennial should take place in the year 2021 and will aim to produce a new work of art by a single artist. The exhibition will have an original and contemporary collection of work from the collection and will take place in the Museum's personal space, the garden of the Academy of Fine Arts in Berlin.The biennial, which takes place in collaboration with the Museum in the Arts in Berlin, will focus on the biennial movement as a whole and on the artists and their work.The biennial will be organized as follows:Participating artistsSuman Bhandari (India) & Ravi Chaudhari (India)Sonia Cossio (Italy)TIFFO: Almine Rech (France)Jinny-Joyce (China) & Pauline Kounell (France)The Biennial of Books is an initiative of the Museum of Modern Art in Chicago. The event, which was organized as part of the exhibition “Humanities and Their Place” (2017), will feature nearly three hundred books by fifty-six authors selected from around the world, including the authors of China Miéville, Peter Siskind, and C. S. Haldeman. The series will run from September 25 to October 11 and", "The next Biennial should be a reflection of how art is made and what we are able to change. In the meantime, we are proud to support the work of our talented artists, and we hope to see you next year. To thank our donors, we have attached a special gift of $10,000 to the $25,000 mark. We are also very grateful for the support of our Board of Directors and the staff at the Sherwood Sculpture Garden. These are a wonderful and difficult situation to be in. We are all extremely proud of what our staff and volunteers have accomplished, and we thank you, Ola, and the entire Sherwood team for the privilege to work with them. We are committed to working with you again in the coming months, and we will continue to honor your vision and for your creative energy. Sincerely,The Sherwood Sculpture Garden BoardMembers: Andrew Chiu, N/AAndrew Chiu’s sonAndy Chiu’s daughterKatie Fung, N/AKatie Fung’s daughter and son-in-lawKatie Fung’s granddaughter, Rina ForsythFernanda Fusi, N/A", "The next Biennial should be held at least once a year, and should focus on the work of the artists in the exhibition. Inaugurating the exhibition will be a special exhibition of works on paper. “The Biennial has been a great success, and the exhibition has become a source of inspiration for many young artists coming from disadvantaged backgrounds,” said García-Perez. “I congratulate my colleagues and the team of international curators and am proud to be a part of their story, and to continue to work with these artists.”\n\n\nThe Institute for Contemporary Art (ICA) in New York City and the Skowhegan Museum in Maine have formed a new, nonprofit partnership to further explore the art of the American West. The project, called ART in the West, will provide funding, resources, and technical assistance to institutions to foster the development of an American art history that reflects the diversity of cultures, histories, and histories represented in the region.“The partnership will involve the ICA and Skowhegan collaborating to present new, experiential works that reflect the concepts, histories, and histories of the artists and their territories,” said ICA president and CEO Christopher Woolf. “", "The next Biennial should open in September. According to the Arts District, the inaugural edition, held in September of 2019, drew an average of 4,100 visitors to the venue each year. The 2019 edition, entitled “The Limits of the Frame,” featured work by forty-five artists, including Salaam Ali, Nima Nabavi, and Bader and Khawatee.\n\n\nThe Spanish Ministry of Culture has released a roadmap for the reopening of the Palacio de Arte de Madrid (MAS), the historic town located in the city of Madrid, in the months of March and June. The ministry’s statement reads: The Ministry of Culture has published a new cultural plan for Spain. It outlines the activities that will take place in the coming months, and explains how the government will implement the cultural plan to promote tourism, mitigate the impact of the coronavirus on Catalonia, and protect the vital Gran Via region. The program aims to “shape the future of Spain by accelerating the cultural and artistic transformations of the country,” Madrid mayor Ada Colau said. “This program aims to enhance the city’s international reputation and ensure that it remains at the forefront of", "The next Biennial should take place in 2023 and will be organized as follows: Art Modeling: Director: Lina Al-OthmanArt History: Director: Andrei SoldatovArchitecture: Director: Simone de BeauvoirArt History Project: Director: Christopher GregoryBecomea Digital Organizer: Becomea Digital Organizer: Brian McNamaraDesigner: Christopher GregoryBecomea Digital Organizer: Brian McNamaraArt Historian: Director: Peter KramerArt Historian: Director: Peter KramerArt Historian: Director: Peter KramerArt Historian: Director: Peter KramerArt Historian: Director: Peter KramerArt Historian: Director: Peter KramerArt Historian: Director: Peter KramerArt Historian: Director: Peter KramerArt Historian: Director: Peter KramerArt Historian: Director: Peter KramerArt Historian: Director: Peter KramerArt Historian: Director: Peter KramerArt Historian: Director: Peter KramerArt Historian: Director: Peter KramerArt Historian: Director: Peter KramerArt Historian: Director: Peter KramerArt Historian: Director: Peter", "The next Biennial should be held in the first quarter of 2020. \n\n\nAfter a decision by the federal government’s Consumer and Commercial Vehicles Safety Commission (CCVS), nineteen British dealerships are now facing fines of up to $23 million for selling defective airbags that were manufactured by a company in China. The fine is significantly higher than the $9 million that the French government is demanding from the auto industry for violating the country’s ban on large sales by Chinese nationals.James Cook, the CEO of British carmaker Jaguar Land Rover, admitted that the automaker “did not take appropriate action to address the situation,” but argued that the sales of the defective airbags were a “band-aid solution.” In a statement, the company said that the recall was part of an “ongoing review of all aspects of safety,” and that the company “will not tolerate any sales of these types of products in the future.”\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles announced today that it is pushing back the opening of its inaugural season in March, citing the “current uncertainty and disruption caused by the Covid-19 pandemic.” As a result,", "The next Biennial should take place sometime in 2021. \n\n\nThe Museum of Contemporary Art (MoCA) has announced its 2020 graduating class. The seniors hail from twenty-eight states and twenty-nine countries. In addition to the usual classroom assignments, the students will spend time in the studio and in the gallery, participating in the museum’s “Weekend Program,” an annual program that celebrates art and culture in the Bay Area. Their work will be presented in the museum’s newest exhibition, “The Girl in the Drawing Room,” which will be on view from January 14 to April 15, 2020. The show will feature work by twenty-two artists, including Anselm Kiefer, Leonor Carbonell, and Rintoul, and will highlight the weeklong program.“The Weekend Program’s alumni include the following artists:Anna Atkins (New York), Bryan Aycock (New York), Robert Cain (New York), Sarah Connor (New York), and Michael Chiu (New York).” The biennial will also introduce the public to the work of artists such as David H. Goldberg (New York), Anthony A. Nesvani (New York), Pierre", "The next Biennial should take place in 2022. The next edition will be hosted by the University of Cambridge, where the third Biennial will be held in 2021.\n\n\nArts institutions across the United Kingdom are attempting to cope with the coronavirus pandemic by increasing the hours of their staff and instituting rest periods and disability pay. Universities are also requiring employees to wear masks and limiting the number of visitors they will allow to enter their buildings.According to the Art Newspaper, a senior official at one institution told the Art Newspaper that the decision to prevent visitors was made in order to “balance the risk of the virus with the risk of the public not coming to see art.” The institution did not specify whether the decision was made in light of the coronavirus’s outbreak in China.In a letter addressed to students, art workers, and staff from the Royal Academy of Arts (RA), the University of London, in September, the academy claimed that the restorative power of art was being compromised due to the risky travel restrictions introduced by the UK government. The letter also noted the health risks of travelling to and from the United States, which is currently dealing with its own coronavirus outbreak, and stressed the importance of professionals staying", "The next Biennial should be held in 2021. The inaugural exhibition, 'Eyes of a Dog,” will run from January 7 to February 22, 2021. The biennial will include works by forty-two artists, including Paola Marad, Benedict Bostwick, Tomasz Klimczyk, Liz Collins, Sara J. Maas, Kumi Naidoo, Eindre Schlegel, Aurélés Barthélé, Michael C. Munger, Paul Mpagi Sepuya, Wang Wei and Jie Zhu, Wang Wei, and Yimuang Zhang, and will be hosted by the National Museum Beijing.The tenth edition of the exhibition will be held at the National Museum Beijing from March 16 to March 19, 2021. \n\n\nThe Metropolitan Museum of Art (MoMA) in New York has adopted a new policy that allows it to deduct up to $2 million from future donations for the construction of a new expansion and renovation of its Art of the Party building in the Bronx, which is slated to open in 2021. The policy change, which also revises the museum’s existing donation", "The next Biennial should be held in Lisbon in 2021. The festival will be emceed by Tito de Autre, who served as the head of the event from 2003 to 2007. Juliette de la Peña, head of the twentieth century and twenty-first centuries program, will also serve as the first director.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Jay Deavere Smith the new executive director of the Brooklyn-based nonprofit arts incubator the ArtsProject. Smith will lead the organization through the first phase of its redesign, which is expected to take four years, and will take up the post in phase two.“Jay is a visionary leader in the arts who has built his career around cultivating and supporting the next generation of artists, and we are excited to witness his impact on the ArtsProject,” said Mark Ruben, cochair of the organization. “Jay is a singular visionary who has helped shape the museum into a global leader in bringing artists together and experiencing new ideas in a meaningful way. We are indebted to him for his vision and his commitment to helping us transform the role of art in the city, and to him for being a tireless advocate for art in general.�", "The next Biennial should be held at the Museum of Fine Arts, Boston, in 2021. The museum will also re-create a new sculpture garden, a public gathering space, and an open-air amphitheater for artists.Museum director Marisa Johnson said: “Equality is the rule; diversity is the beauty. Artists in our exhibition-making world have always been at the heart of what we did. They are a fixture at our events; they are a source of inspiration for our visitors; and they are essential for our future success.”\n\n\nThe artist-run platform Indiegogo has announced the launch of a new initiative that will give $1 million to institutions who have experienced significant losses as a result of the coronavirus. The grant will be distributed in three waves, beginning with the largest independent arts incubator in the US—the EECS Center in Mountain View, California—and ending with a grant for independent arts professionals in New York City.The initiative was inspired by a proposal made by Sarah Sze, the CEO and artistic director of the nonprofit nonprofit Beyond Blue, for a $1 million fund for independent arts organizations in Los Angeles. Sze received the funding from a group of people and organizations including the ", "The next Biennial should be held at the Museo de Arte Contemporáneo in Barcelona next year. The next edition would be held in April 2020, but it has yet to be determined whether the event will be moved to October or November. The new 2020 edition of the exhibition will feature work by ten artists, including Julien Ghesquière, Jean-Luc Nancy, Anya Picchu, and David Salle. It will also be held at the Barcelona National Museum (BAM), which is currently undergoing a $6.5 million expansion, and at the Institut National des Arts et Lettres (INLA), which is located in the city of Aix-Maritime.The 2018 biennial, which was curated by Alexandre Metter, was held in March and comprised works by twenty-six artists, including Christos Zalkin, Jürgen Todt, Kij Johnson, and Nari Ward. The exhibition concluded with an opening reception for the artists.\n\n\nItalian artist, designer, and educator Piero Manzoni, who would later become a mentor to Andrea Giunta and the late John Baldessari, passed away on Tuesday, February 4, at the age of ninety-two", "The next Biennial should be held in 2021. The next show should be held in 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that Lewis Whitten has been appointed as its next executive director. Whitten will be responsible for improving the museum’s position within the growing global art and culture ecosystem, which is experiencing a resurgence in both physical and cultural form as the global health crisis worsens.Whitten comes to the museum from the Pacific Standard Time Museum in Seattle, where he currently serves as executive director. He succeeds Martin L. Cohen, who retired last year after more than two decades at the helm of the institution.Cohen, who has helmed the Pacific Standard Time in Seattle since 2014, will continue to serve as the interim executive director until a successor is appointed. Whitten, who has helmed the institution since 2012, takes the post in the name of the biennial’s board of directors. He succeeds Mark Hammon, who departed the museum in July 2019 to become director of the Los Angeles County Museum of Art (LACMA).Whitten also serves as vice chair of the board of trustees of the International Council on Contemporary Art (ICCA), the United Kingdom’s international", "The next Biennial should be in 2021, and the exhibition should center on the life and work of Michelangelo Antonioni. The 25th edition of the biennial will take place in Prague in 2022.\n\n\nThe Museum of Modern Art (MoMA) in New York has launched an online hiring platform that will allow artists and organizations to apply for job offers through its network of human resources. The platform, called JobRoster, allows job seekers to upload their résumés and cover letters and is currently available in five languages: Spanish, French, German, Italian, and American Sign Language.The app works by comparing how well applicants have described themselves—such as working remotely, traveling, being creative, or being students—and then matches those descriptions with positions that can be filled by applicants. For the past twelve months, the app has also analyzed user profiles and found that 80 percent of job seekers describe themselves as being between 18 and 34 years old.It recently received $175,000 from MoMA’s $1.2 billion capital campaign to help it meet its goal of hiring 3,600 workers by the end of the year. During the campaign, the museum also revamped its existing campus in Midtown Manhattan, added more than four hundred square", "The next Biennial should be held in 2020.  If all goes according to plan, the film will show in the exhibition “The Yellow Sea,” which will be held at the Museum of Modern Art in New York in 2021. “The Yellow Sea” will be the theme of the upcoming biennial, “Alfred Hitchcock: An Unfinished Life.”  The 2019 edition of the yearlong event, “Scientific Fiction” came to an end after an attempt to move the show to another location after a fire broke out in the building, which housed the Hitchcock Archives and the William Paley Archives. The event will re-enter the public’s imagination as it comes to an end. In 2019, the exhibition made its debut at the Museum of Modern Art in New York and served as the theme of “The Art of Cinema” and “The Art of Photography” (2019) in partnership with Filippa Kerber and Filippa Zegher.\n\nThe Metropolitan Museum of Art in New York has announced the opening of a $1.3 million fund for cultural organizations in the city that have experienced financial difficulties in the past twelve", "The next Biennial should focus on the history of the art of the Americas, with a particular focus on art from the Americas and the Americas in general.  It may also update the current exhibition to incorporate recent scholarship and events, and present new works. Other themes that are currently being considered are the history of political art, the history of art in Hong Kong, and the history of the art of Cameroon. The next installment of the Seven Seas Biennial will take place in 2020.\n\n\nThe Carnegie Museum of Art in Pittsburgh has appointed Ciarán McGuinness as its next director. McGuinness comes to the museum from the Carnegie Art Museum in Newport, Rhode Island, where he assumed the position in February. He succeeds Mark Fergus, who departed in the middle of a six-month hiring freeze due to concerns about the Covid-19 pandemic and will begin in his new role on August 5.Fergus said McGuinness is a \"talented, experienced leader who has the potential to continue to improve Carnegie’s collection by bringing new voices to the helm. McGuinness’s record of success at the Museum of Art in Detroit lends authenticity to this goal, as he has successfully transformed the museum into a leading contemporary art museum.", "The next Biennial should invite more artists to participate; organize more exhibitions, since many of these are on unsteady foundations; and incorporate more local communities, especially in rural areas. The museum has already launched a platform for projects and discussions by biennial artists and is working on developing a tool for teachers or students working in the arts. Since September 11, 2001, the Museum of Modern Art (MoMA) in New York has hosted more than one hundred exhibitions every month. The new redesigned Biennale of Sydney is slated to open on January 18, 2020 and to run through March 27, 2020. The new biennial will consist of twenty-two exhibitions, including a new exhibition of work by the Lebanese artist KTV Marwan; a presentation of work by Filipinos, South Asians and Pakistanis; and a special exhibition of work by artist and activist Gioncarlo, whose work focuses on the political struggles of women and girls in India. An open-call for proposals will run from March 15 to March 17.\n\n\nThe Kunsthalle Basel, Switzerland, has released the list of seventy artists who will participate in the eleventh edition of the Kunsthalle Basel (KBE), to be held in October 2020. Represent", "The next Biennial should be held in the spring of 2021. “In future years we will continue to work together to make the biennial work for all two sides of the exhibition,” said Valentino Sforza, chair of the board of directors and president of the Italian institution. “This is the year to focus on the exhibition’s possibilities for the future and to get the exhibition on the agenda in the coming years.”The exhibition, which will feature work by more than 300 artists from thirty-five countries, will also head to the Palazzo Bernini, to open in the coming weeks. The full list of participating artists is as follows:  Susan Bowen, Kingman, Arizona, March 22–March 26, 2019  Aichi United Kingdom: March 20–March 22, 2019  Michael Beasley, London, March 20–March 22, 2019  Akron Museum of Art: March 19–March 21, 2019  Arts-Lab, New York: March 12–March 18, 2019  Ashdown-on-sea, UK: March 16–March 21, 2019  March 14–March 15, 2019  March 16", "The next Biennial should take place to-morrow. The organizers did not specify when the exhibition would reopen.“We are, however, aware that Disneyland Resort is currently undergoing a major refurbishment, and we are actively working to provide the local community with a wonderful experience as we work towards reopening in the spring of 2020,” said Wolfgang Laursen, chairman of the Biennale and a member of the board of trustees of the Kurzweiler Museum Freie Kunstverein Berlin. \n\nThe Museum of Fine Arts (MFA) in Boston has announced that it will soon plan and launch a series of public events to benefit the Boston Relief Fund, which has been struggling since January to meet its debt obligations. The fund, which was founded by the Northeastern community in 2009 to support those affected by the Covid-19 lockdown, was expecting to receive $8 million from the Museum of Fine Arts’ inaugural year, but it only raised $6 million this year. Since March, the fund has been providing financial assistance to 350 artists and up to sixty organizations. “We are thrilled that the MFA is now able to offer free admission to the first MFA kids’s museum in", "The next Biennial should be held in 2022 and will be led by the artist-in-residence, the French curator Joëlle Marcou, and the director, the Italian architect Giacomo Ricci (M and B), respectively. In 2012, Marcou and Ricci organized the first iteration of the exhibition, titled “Au Revoir,” in front of an audience of ninety thousand people in Paris. The opening of the exhibition was centred around the work of a group of indigenous and African women artists, transformed by the French Revolution into a revered , almost mythical, figure in their own art.“The exhibition is a response to the cultural, spiritual, and moral catastrophe, which unfolded in the historical period of our contemporary French Revolution,” said Marcou in a statement. “To begin with, the exhibition constitutes the first step, that is, the most important step, towards a better understanding, and to the re-examination, of the work of our ancestors and of the past. Secondly, the exhibition constitutes a kind of historical memory, a kind of spiritual reconfiguration, and a kind of spiritual reopening, in the main of which the artists participate. Thirdly, the exhibition constitutes the first", "The next Biennial should be completed in 2021. The first iteration, titled “2000AD,” was held in the former headquarters of the resto-ritual group the Broad, in London from March 16--March 18, 2000. Due to the Covid-19 pandemic, the show was moved to the Mall of America in downtown Detroit.\n\n\nThe French Ministry of Culture has released new guidelines for the exhibition “Bienvenue: Resnée” (2017) at the Grand-Duc Jean in Paris, which will follow the French Revolution to its absurdist conclusion on March 19 and 20, 2020. The exhibition was originally scheduled to run from March 13--March 15, 2019, and will highlight the work and life of Magritte, an important eighteenth-century French feminist theorist, as well as the work of artists such as Marc Chagall, Pierre-Auguste Kamm, and Jean-Luc Godard.The 2017 edition, entitled “Un bienvenue: Un derecher avec l'Édouard Manet” (2017), consisted of one show devoted to the American painter Max Beckmann and two shows dedicated to the existentialist Bertolt Brecht. The show opened on March 10", "The next Biennial should take place in the Netherlands in 2021 and will be hosted by the KW Institute for Contemporary Art, the KU Witten-Kunstverein, and the KW Museum in Ghent.  \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it is preparing to reopen to the public in the city on September 14. The reopening of the museum, which has been closed since March 25, will coincide with the one-year anniversary of the March 11 earthquake and tsunami that devastated the area and killed at least fourteen people and injured hundreds more.Since its restoration, the museum has exhibited more than 1,900 works by more than two hundred artists from twenty-four countries. The opening will mark the opening of a new three-mile, crisscrossing pedestrian walkway across the museum, which would have connected the museum’s main entrance, which is located in a former World War II aircraft factory, with a new outdoor amphitheater and exhibition space that will host more than twenty-five thousand people, as well as a new public courtyard.The institution has also renovated its original home, which was completed in 1950, and has installed more than twenty-five thousand square feet of exhibition", "The next Biennial should take place sometime between the end of the fifth and the end of the seventh week of October. “The next exhibition should be an expression of all of the artistic possibilities of our time,” said archaeologist João Ribas, president of the Museum of Modern Art. Athens’s most recent exhibition, “Theater of Operations,” was staged in March 2019.\n\n\nThe Carnegie Museum of Art in Pittsburgh has added two more members to its board of directors: artist-activist and educator Marc Rich and artist-writer Samantha Power. The institution also named Janet Kuttert, an artist and educator, and Mary Clare, a longtime professor at the University of Pennsylvania, as advisors. Kuttert was hired as a curator of contemporary art and arts and will assume her duties in October. Power will serve as an assistant curator of contemporary art and will assume her responsibilities in October.“Throughout our history, we have strived to create an environment that acknowledges and celebrates the power of art to address important social and political issues,” said museum director Mary Anne Carter. “The addition of these two talented, committed, and dedicated individuals to our board reaffirms this mission.”\n\n\n", "The next Biennial should be held in Paris in 2021, when the museum’s collection will celebrate the exhibition “Between the Sun and the Moon” (2019); the museum will organize a retrospective of the work in 2021 as well.\n\n\nThe twentieth edition of the Biennial of Danish Art was held at the Museum of Modern Art (MoMA) in New York on October 24–30, 2018. The exhibition was curated by Kjetil Magnus Nielsen and featured works by eighty-three artists, including Lars Vilks, Kjetil Magnus Nielsen, and Kjetil Magnus Nielsen’s daughter, and five other siblings. The event was co-organized by MoMA and the Danish Foundation for Contemporary Arts (DFDA).For the past few years, MoMA has been working with a Danish company to develop a site-specific digital experience that would showcase the work of Danish artists. The company revealed its new digital initiative, “Kjetil Magnus Nielsen’s Gallery,” at the end of March. The exhibition, which will include thirty-five works by fifty-eight artists, will air on YouTube on October 7 and will be available for purchase on October 8.Commenting on the initiative, CEO Jeffrey Kessler said:", "The next Biennial should be held sometime in the spring of 2020. The theme of the year will be “Situation,” with the subtitle “Pursuant to Situations.” For the first time, Artadia will invite ten artists to the festival, which will be held at the Museo de Cultura Teología in Madrid in May. The selected finalists will be announced by May 20.\n\n\nDutch artist Maren Kappelhoff, known for creating works that address issues such as power, powerlessness, and the limits of human potential, has died at the age of seventy-nine. Kappelhoff’s family confirmed her death, and she was given a public burial at the Kappelhoff Museum in Amsterdam on October 19.Born in the city of Eindhoven in the Netherlands in 1941, Kappelhoff studied at the Academy of Fine Arts in Antwerp and the Academy of Fine Arts in the Netherlands, both in the 1950s, before moving to the city of Rotterdam and pursuing her career as a painter. In 1964, Kappelhoff began her sculpture career with the tapestry The Seventh Wave, 1987–1988, a monumental installation designed to resemble an", "The next Biennial should be held at the beautiful Aspen Institute of Art, in Colorado Springs, in 2020. In an interview with the Art Newspaper, Giddens said: “The best way to describe what I’ve done is as a continuation of my past. The art of art has never been more relevant, more important, and more personal. I’m excited to continue to shape and expand the exhibition program to represent the entire canon of modern art.”Bassari is now represented by Galerie Bénédicte Savoy in Paris. The work was curated by David Bassari, who is represented by Galerie de Beychule in New York. The next exhibition, “On the Limitations of the Self” will be presented at the Biennale in Madrid in 2021.\n\n\nIn a move that is sure to set a new precedent in the art world, the American Council of Art (AC) in New York has appointed the artist Pamela Anderson as its first executive director. Anderson, who will assume her role in December, has already proven her ability to craft a compelling profile by crafting images that reflect the experience of disability, including a performance for the Whitney Museum of American Art in New York", "The next Biennial should take place at the Museo de Arte Contemporáneo in Madrid in the spring of 2021. “The theme of the Biennial is the evolution of art through a new artistic vocabulary,” Maria Lissoni, chair of the museum’s board of trustees, told Artnet. “The trajectory of the Biennial is a reflection of the years since it began. We are committed to the theme and to the exhibition of the Biennial.”The 2019 edition, titled “Un Espanol Primero,” featured works by seventy-four artists, including Fabiana Noguera, Izabella Hernández, Lidia Ikonomou, Carmen Miranda, María Berrío, Cécile de Lázaro, Juan María Horacio, and Nuria Rocha, along with works by contemporary artists such as Paul Gauguin, Pierre-Auguste Renoir, and Jean-Michel Basquiat.In a statement, the museum said that the work of the artists represented in the Biennial is a “point of departure.” It added that the exhibition will “reflect the richness of", "The next Biennial should be held in 2021. According to a statement on the museum’s website, the exhibition will comprise fifty works and will be curated by an artist from the Biennial’s collection. The artist selected for the theme, the Venezuelan artist Carlos Alÿs, will be presented a selection of works by twenty-six artists from the collection in his first exhibition in Venezuela’s capital, Caracas. The exhibition will include a selection of works by Susana Martinez, Jaime César, and Andrea Bisala, among others.\n\n\nThe National Gallery of Fine Arts in Washington, DC, has awarded $8.5 million to two nonprofits that collaborate with artists to promote and preserve their work: the National Endowment for the Arts (NEA) and the National Endowment for the Humanities (NEH).The organizations, which have received funding from the National Endowment for the Arts (NEA) and the National Science Foundation (NEH), announced their awardees on Tuesday, December 8, and will announce the recipients of their next awards in the coming months. The grants will help support the conservation, preservation, and exhibition of works by Ruth Dini, William Henry", "The next Biennial should be held in November 2022 at the Rome Forum, in the city of Venice, Italy.\n\n\nThe Los Angeles County Museum of Art (LACMA) has announced that it is planning to open a new, expanded public art collection to coincide with the opening of the museum’s new building on Wilshire Boulevard. The new collection will comprise works by artists that have been in storage, including David Salle, Christopher Wool, Julie Mehretu, and Raye Sadeghi, as well as works that have recently been acquired by the institution, such as an exhibition of work by artist Lee Camp, which is currently on display in LACMA’s new building.“This new collection will be an extension of LACMA’s long-standing commitment to public art,” said museum director Michael Govan. “It will draw from a variety of disciplines, reflecting both local and international trends and collecting together from talented artists throughout the city. It will also be a reflection of the rich history of Los Angeles, reflecting both the city’s rich artistic world and its diverse communities, while simultaneously challenging the tradition of the institution as a major cultural center.”Inaugurating the new", "The next Biennial should focus on the legacy of the late director Marta Kauper, who has directed the Contemporary since 2004, and on how the museum intends to return to the canton of Venice, the Veneto. The exhibition will also include a selection of works from the collection of María Berrada, and will inaugurate a new section, “Art in Motion,” which will feature work by artists such as Jason Ataksen, María Berrada, and Ann-Marie Barnes. The exhibition will run until October 29.The competition will be organized by Johanna Para, the director of the Museo di Portuguese Artista, and will take place in the museum’s main building, the Museo delle Farini, in Venice. The exhibition will be organized as follows:Separately, the museum is planning to extend the work of its curators, Anne-Marie Cuno and Francesca Cipolletta, who have been working together at the museum for twenty years, and the institution’s staff, by ten years. In order to do this, the museum will hire the two curators, Cuno and Cipolletta, as assistant curators.Cuno", "The next Biennial should be completed by the end of the year. The announcement was made during a press conference held at the Museum of Contemporary Art, Los Angeles (LACMA), which was attended by the public through a temporary installation, The Painted Palace, which opened in the back room of the museum in June. “I see this year’s upcoming Biennial as one of the last great opportunities for artists to reach incredible new audiences in the United States,” said Mark B. Thompson, the biennial’s chief curator, who also serves as president of the association.Thompson said that the new program, which will be announced in the coming months, will feature work by seventy-five artists, including John Karalis, Lee Camp, Wilson Coleridge, Jack Conte, Andrea Cornejo-Verzier, Mark Giusti, Pierre Huyghe, John Ostrander, Anton Kern, John Moreland, John Paltrow, Hans Neumann, Julia Penzias, and John Simon Guggenheim.\n\n\nThe Museum of Contemporary Art (MoCA) has released new guidelines for the engagement", "The next Biennial should take place in 2021 at the Centre Pompidou in Paris, France, and will draw up to twenty-eight artists from forty-six countries. The twenty-third will take place in 2022 at the Kursk Center for Contemporary Art in Moscow, and the twenty-fourth at the Museum of Contemporary Art Hamburg. The twenty-fifth will take place in 2022 at the museum of fine arts in Beijing, and the twenty-sixth will be held at the Museum of Modern Art (MoMA) in New York in 2021.The 2019 edition of the Biennale held in São Paulo, Brazil, was marred by a fire at the former site of the former Brazilian International Museum in the city. The firemen who extinguished the blaze that broke out on the fifteenth floor of the building, which housed the institution’s former headquarters, found that the building was infested with cockroaches. The fire department had to use water hoses to put out the fire, which was started in a garage, and the museum had to be evacuated. The event was canceled for several weeks and then moved to the Amazonas, where it staged a reopening in March. The exhibition was chosen amid the ongoing controversy surrounding the Brazilian", "The next Biennial should take place in the United States, and the first in the Netherlands. The thirty-second edition of the symposium will focus on the cultural, political, and social impact of the landmark exhibitions of the twentieth century.  The seventy-ninth edition of the exhibition will be dedicated to a new collection of works by and about the same artist or artists as that presented last year, the artist-in-residence Farah Al Qasimi. The seventy-eighth, a brand-new exhibition devoted to the artist-in-residence Hans Kapp, will be announced by the end of August. The visual arts are one of the areas where the Biennial’s program is drawing from its own archives. \n\n\nThe School of the Art Institute of Chicago (SAIC) has appointed Amber Goodson as its next director, effective immediately. Goodson will be responsible for leading the school’s curatorial, research, and exhibition wing and will assume her responsibilities on August 7. “Amber’s vision and energy is inspiring and deeply rooted at the very heart of the School of the Art Institute of Chicago,” said SAIC board chair John Sorensen.", "The next Biennial should take place in 2021. In the meantime, the Museum of Asian Art, the Museum of Fine Arts Tokyo, the Metropolitan Museum of Art, the National Museum of Fine Arts in Beijing, the Inner Mongolia Art Museum, and the Inner Mongolia Science Museum are all still on track to open in 2020.  According to Artnet, the 2020 edition of the exhibition will be titled “From the Left to the Right,” and will focus on the preservation of cultural heritage in the ’Middle East and North Africa. The exhibition will be hosted by the National Museum of Singapore in Singapore and will be coordinated by the Metropolitan Museum of Art. The theme will be “Theoretical Approaches to Preservation.” Both the National Museum of Art in Singapore and the Arts in Asia will collaborate with the National Geographic Society on the exhibition.\n\n\nThe National Gallery in London has been forced to extend the opening of its inaugural exhibition “Heroes,” a documentary about the 2015 suicide of British artist Banksy, by a week and a half. The opening of the exhibition will now take place on July 28. The show will now open on July 25, followed by a special event on July 28. “Heroes�", "The next Biennial should be held at least every two years. Its next edition will be held in the capital city of the Republic of Moldova.\n\n\nThe French government has partially subsidized the museum’s renovation efforts. According to the Art Newspaper (French edition), the project was announced during a meeting of the National Assembly on Thursday, March 25, and will begin in the French city of Nice in May. The French Ministry of Culture said that a total of twenty-four cultural institutions across the country will receive a sum of $126 million in support of the redesign and the conservation of French heritage sites, including the Louvre and the Musée d’Orsay. The sum also covers the costs of remediation and of implementing the cultural program in conjunction with the renovation of the city’s historic city hall, the Musée de l’Amitin, and the Louvre.French cultural minister Franck Riester announced the program, which is part of a larger plan to update and conserve French cultural heritage sites across the country, in December 2019. The ministry estimates that restoration projects will be completed by 2021. The program’s legacy is that of French president Emmanuel Macron, who pledged to donate twenty-four sites", "The next Biennial should be held in 2022. The 2020 edition, which took place in the Far East, was canceled after a fire broke out in a storage area for artworks, and the 2020 edition, which was set to take place in Melbourne, Australia, was postponed.\n\n\nThe Bauhaus Museum of Art in Berlin, which has been closed since the pandemic began in December, is planning to open to the public in January. The institution, which has been closed since it closed in March due to Covid-19, said it expects to be able to sustainably operate the museum for another eighteen months.According to the Art Newspaper, Museums in Germany and Switzerland have been able to continue operating with minimal damage from the novel coronavirus since March 14. However, according to German daily newspaper Frankfurter Allgemeine Zeitung, the odds of the institution returning to pre-covid-19 health are increasing. The Stiftung des Bundes (German Federal Cultural Foundation) has announced that it will begin distributing free face masks and other lifesaving medical supplies, and will extend the medical assistance card it offers to people who would like to use it to visit the institution. It will also be able to begin", "The next Biennial should be held in 2021. \n\n\nOn Saturday, the National Labor Relations Board in Washington state ruled that the National Museum of Fine Arts in Cincinnati, which has been closed since March 13 due to COVID-19, is not required to bargain with or bargain away its employees. “The government’s role is to ensure that workers are treated fairly and that employees are protected from unlawful practices,” Lisa Montalvo, the director of the National Museum of Fine Arts, said in a statement. “In this case, the government sided with the wrong side—it was against employees.”The ruling, which was made on a complaint filed by National Labor Relations Board member Carlotta Calandra, resulted from a three-week strike at the museum, which is located on the campus of Ohio University. According to the Cincinnati Enquirer, the strike halted a planned exhibition when its organizers cited safety concerns for a walkout that lasted for nine hours and 40 minutes. The workers were protesting the exhibition “Monster,” a collaboration between artist A.A. Nadir and artist M.A. Lange. The strike resulted in the ousting of the museum’s board of directors, whose", "The next Biennial should focus on the relationship between art and science and the history of science and the history of art, and explore the relationship between art and technology. The theme should be an extension of the theme of 'Art and Nature:” “The History of Science and the History of Art,” which will reopen at the Museum of Modern Art in September 2020. Following the opening of the new exhibition in September 2020, the commissioning of a new exhibition of work by Lévy Gorvy will be presented in December 2021.Commenting on the commissioning of the exhibition, Yutaka said: “We are thrilled to begin this new chapter with the first exhibition of work by Michelangelo Antonioni that is in chronological order. The sequence of his career is the best preserved in the Museum of Modern Art’s collection, which is why we decided to work with him. We feel that the Biennial’s exhibition will express the themes of this new book, and the way in which we are all connected to the natural world and to the present moment.”\n\n\nThe Museum of Modern Art (MoMA) in New York has released the full list of its seventy-five exhibitors for the upcoming edition of the", "The next Biennial should focus on “Arts and Culture: Art and the Struggle for Democracy” (2019); the artistic project is based on the “Pioneers of Modern Art” exhibition organized by the Biennial of British Artists in 2020.The biennial is also planning a show of work by the Italian artist Dario Catella, which will be presented at the Venice Architecture Biennale in 2021, and is working toward a new interdisciplinary project, “Arts and Culture: Past, Present and Future” (2019), which will highlight the cultural and intellectual contributions of British artists to the history of the United Kingdom. The show will premiere at the Tate in London in 2020.\n\n\nThe Institute of Contemporary Arts (ICA) in London announced the winners of its biennial “Art and the Future: Art and the Future in the Twentieth Century.” The twenty-three-person jury, consisting of Sadao Usui, director of the channel art center Tate Modern, and Rirkrit Tiravanija, curator and head of the contemporary art practice at Tate Modern, concluded the sixteenth edition of the exhibition in March, including the work of Amie Sarr, Kiki Smith,", "The next Biennial should take place in 2022. The first, entitled 'The Sphere of Resistance (Bristol Biennial II)”\u0097which was staged at the British pavilion, in 1937\u0097was held in 2018.\n\n\nThe Metropolitan Museum of Art (MoA) in New York has received a $1 million donation from wealthy collector and philanthropist L. Charles Cooper. The gift was made as part of an initiative to raise funds for the museum\u0097the institution will announce the recipients in the coming weeks.Known for his philanthropy, Cooper has given more than $10 million to MoA during his career. The Metropolitan Museum of Art is one of his major giftmaking efforts. In 2017, the MoA Foundation gave $50 million to help improve its art holdings, including the collection of the late sculptor Sidney and Rosalind Franklin. Twenty-nine years later, the museum received an additional $66 million from the Cooper Charitable Foundation for the collection of works by Thompson and other twentieth-century artists, including Luke Stedman, Robert Irwin, and Vito Acconci.\n\n\nBritish artist and theorist Norman Foster’s conceptual art and aesthetic theory had a major influence on the new wave of", "The next Biennial should take place in the United States in 2021. \n\n\nThe New York City Department of Cultural Affairs (DCLA) has announced its plans to eliminate the Metropolitan Museum of Art in Manhattan and build a new museum in the city’s Greenwich Village. As part of a $1.4 billion expansion and renovation project, the Met will open a new $300 million museum and plaza on the museum’s campus in 2021.The agency also announced its expansion of the city’s Near West Side, which added twenty-four acres of parkland in the city’s Long Island City neighborhood. During the project, the Met added more than five hundred galleries, restaurants, and spaces for student programming. The expansion also included the construction of a new elevated rail line that will connect the museum’s new home with the Hudson Yards development project.“We are building something new, something that will be truly extraordinary,” said Mayor Bill de Blasio, who was recently awarded the Presidential Medal of Honor for his commitment to revitalization during his tenure. The project will also feature expanded public programming and additional public artworks. The renovation is expected to take four years and will include the demolition of the Met’", "The next Biennial should take place in the autumn of 2022 and will aim to present a collection in the form of a series of exhibitions for a single museum. \n\nThe Nürburgring and the Italian Ducale in Venice have announced that they are looking to merge, in order to simplify the transport of works across the two venues, and in order to achieve cost savings as a result of reduced maintenance. The Nürburgring will remain an independent organization, while the Ducale will continue to operate under its current management. Both the Nürburgring and the Ducale will continue to collect works from the same artist, the same dealers, and the same collectors, and will continue to organize exhibitions and presentations to display the works in the two venues, but the proposed merger will only apply to the two entities, and the two organizations will not be able to continue as separate entities.“This strategic decision, which has already been carefully considered and approved by the Nürburgring and the Ducale, has been taken in order to simplify the management of the two organizations, and has been adopted in accordance with the Nürburgring’s and Ducale’s wishes on the question of future exhibitions, exhibitions, and other events in the two", "The next Biennial should be held in December 2020.\n\n\nThe New York City Department of Cultural Affairs (DCLA) announced today that it has awarded more than $3 billion in grants and loans to more than eight hundred arts and cultural organizations in the city. The institutions are eligible for the funds—which come with a maximum of $500,000—and they will be given the funds through its Direct Grant Program, an arm of the city’s Cultural Affairs Department. The grants will be used to provide loans to individuals and organizations that are experiencing financial hardship as a result of the Covid-19 crisis.Among the organizations that have been impacted by the pandemic are the Metropolitan Museum of Art, the Metropolitan Opera House, and the Metropolitan Museum of Art. The Met, which recently laid off around one hundred employees, plans to cancel the remainder of its season, which is due to run July 29–August 2. The Met has also declared a state of emergency because of the threat of the virus.The institutions were selected from a pool of ten organizations that were given $100,000 or less to create new works for the direct Grant Program and were given an additional $250,000 to create new works on a large scale", "The next Biennial should be held in the Springs in 2021.\n\nThe 2019 retrospective was curated by Johanna Halkaert and featured work by seventy-five artists, including Adant Jansen, Michaelangelo Antonioni, and Simon Castles, among others. The exhibition was organized by the Wissenschaft Ludwig in the German city of Heidelberg.About the artist who is best known for his monumental paintings, which combine canvases and sculptures, including the work of women and men in various states of undress, as well as for his concept works, which include media installations and sound installations, the work of the artist has been largely neglected. One theory holds that the work is rooted in the feminist and anti-racist struggles of the 1960s.On the exhibition, Pablo Picasso said: “This is the first exhibition of its kind in the West. We are proud to present Andreas Bayer at the Wissenschaft Ludwig’s initiative of the main work of his life.”\n\n\nThe National Gallery in London has appointed Peter Saunders the new director of its artist-in-residence program. Known for his curatorial projects with the Bangladeshi artist Aishwarya Sen, who was assassinated in", "The next Biennial should be held in February 2020. \n\nThe British Council, the Metropolitan Museum of Art, and the Museum of Modern Art (MoMA) in New York have announced that they are supporting the campaign for the legalization of marijuana in the United Kingdom. The news comes two weeks after British Prime Minister Boris Johnson declared that the drug will be decriminalized by the year 2020 and that the country will likely see a reduction in the number of its prison inmates—its current maximum of eighty-two inmates.According to the Institute for Public Policy Research (IPPR), a London think tank, the UK currently has 848 prisoners in prisons—a decrease of thirty-six prisoners per hundred thousand residents of the UK. The recent shift to a model of reentry that has seen some 3 million people reentering the criminal justice system since 2010 has led to concerns about whether the government is making enough progress towards reducing the UK’s prison population. \n\nThe Museum of Modern Art (MoMA) in New York announced today that it is collaborating with the Museum of Contemporary Art (MoCA) in Chicago to launch a series of public art projects in the city. The collaborative initiative, known as the MOMA Unity, will aim to create", "The next Biennial should be revealed sometime in the 2020s.\n\n\nThe San Antonio Museum of Art (SAMo) has appointed Kate Ehrlich as its new director and CEO. She succeeds Eric Johnson, who retired in March after a decade at the helm of the institution.“Kate’s passion and ability to positively impact the San Antonio Museum of Art is legendary, and she has been instrumental in my career progression for twenty years,” said director Yvonne Alvarado. “While at the helm of the museum, she pushed the boundaries of how we think about art and brought international art to San Antonio. Her leadership and vision for the institution made her the ideal candidate for this extraordinary position.”Ehrlich comes to the institution from the Brooklyn Museum, where she served as assistant director for exhibitions and acquisitions. She also previously served as the director of curatorial affairs at the Getty and as the program director at the Getty Asian Art Museum and the Getty Museum in Los Angeles.Commenting on her new role, Ehrlich said: “The San Antonio Museum of Art is an extraordinary institution, full of unique stories that have made San Antonio special. I’m excited to be a part of this incredible legacy.", "The next Biennial should focus on the death of Soviet Marxist and socialist leader Leon Trotsky, whose legacy was constantly contested by the USSR and the West, and should include performances, lectures, and other events that address recent events in the country. The exhibition will preview the seventy-ninth edition of the Biennial, which will be held in October 2021, with the exhibition marking the anniversary of the death of Leon Trotsky.Prior to joining the Communist Party of the Soviet Union (CPSU), Oleg was a professor at the State University of Art of the State Dushanbe (Sakhalin) from 1967 to 1974. He held various posts at the university, including bureau director and chief curator, from 1976 to 1981, and from 1981 to 1981, he served as a curator at the museum. In 2002, Gennady Zyuganov, the director of the museum, became the first to be killed by the Soviet Union.Backed by the former director of the institution, who was detained in a labor camp for more than two years under Stalinist rule, Oleg returned to Moscow in 2007 to head the museum. During his tenure, he organized numerous exhibitions, including exhibitions of works by N. Katerina, T. S.", "The next Biennial should take place in 2021–18, and the twenty-first in 2022.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has released the list of seventy-five artist-in-residence and interns who are working with or are currently working at MoCA. Of the seventy-six artists on the list, eighty-five are artists whose work is currently on view in the exhibition “Moving Images: Modern Art” at the museum. A handful of the artists featured in the exhibition, which opened on November 23, 2018 and runs through January 18, 2021, are active in the artist-run spaces they frequent.The seventy-six artists working with or at MoCA are:Amanda Conner, Brooklyn, New York: “Abraham Lincoln: ’s Tomb,” 2019Herbert Crooker, New York: “Abraham Lincoln: ” 2019Heather Callaghan, New York: “Ages You Couldn’t Imagine,” 2019 Peter Doig, Los Angeles: “Dreamer,” 2019Zoé Whitley, New York: “Dreaming of an Eclipse,”", "The next Biennial should be announced in 2020, and the last would be in 2022, when the institution will be temporarily closed due to the Covid-19 pandemic. The Biennial of the Arts, a free event held in every September, will also be hosted by the National Gallery of Art in Washington, DC, in 2020, and the Museum of Fine Arts, Houston (MMA) in 2021. The MMA, which was founded in 1902, was also recently awarded a $50 million grant from the National Endowment for the Arts (NEA), the National Endowment for the Humanities (NEH), and the NEH’s Office of the President. The 2020 edition of the Brussels Biennale will be held at the Meret Oppenheim in the city of Antwerp, Belgium; the 2017 edition was held at the Vaudeville in Brussels.\n\n\nThe British Museum announced that, from October 17 to October 18, it will no longer exhibit the work of British artist Adam Clayton in its permanent collection, following a five-month hiatus following a serious injury that resulted from being struck by a vehicle in London on March 19.“It is with great regret and disappointment that we announce the loss of", "The next Biennial should be in 2020. Click here for more information.  New USMCA in Los Angeles is currently on hiatus.  After the Biennial, a USMCA-organized exhibition of works by artists of African and Asian descent (see here for more information) will take place in 2022.  Nelson-Atkins Museum of Art in Kansas City, Missouri, is currently on hiatus.  The Oscar Grant Foundation in Los Angeles has postponed its 2020/21 season. The event will now be held in 2021.  The Metropolitan Museum of Art in New York will now be held in 2021.  The Metropolitan Museum of Art will now be held in 2021. The Metropolitan Museum of Art has unveiled the fifty-ninth edition of the Metropolitan Museum of Art Chicago, which will be held in 2021.  The 2016/17 season of the Met was marred when three-hundred and forty-eight people were displaced by the Covid-19 pandemic and will be reopened in early 2021. The Met has also extended the opening of its new headquarters in New York, the Metropole, to October 10, 2021. The Met has announced the reopening of the museum in", "The next Biennial should be held in 2020, and the first in 2021.The biennial will consist of six phases, beginning with a day-long reception held in the city of Kingston, which is located just outside of Boston, followed by the exhibition of work by eighteen artists, including Salah Abdullay, Christian Quattrone, André Bazuin, and Ashraf Majeed, and concluding with a performance at the Biennial of Modern Art in Coventry, which will take place in the city of the same name in 2021.The biennial was founded by Khalid Shaikh and the late British sculptor Paul Gambaccini in 2005 to highlight the European cultural influence on the United States. The exhibition was paired with the Art of Manliness, a biennial focusing on masculinity, and was awarded the Royal Art of the Arts. The biennial was also selected to represent the United Kingdom at the Venice Biennale in 2008.\n\n\nAfter a string of deadly shootings in California that were carried out by a lone gunman, the long-awaited reopening of the United States’s national parks was reimposed. On Saturday, President Donald Trump signed a five-year bill to reauthorize the Endangered", "The next Biennial should focus on the history of the exhibition, the exhibition, its collection, and the development of the museum’s programs, as well as the organization of the show.“At the center of Biennials is the project of art,” said curator and director Alexander Behe. “Unfortunately, this project, this exhibition, is not over. We have a lot of work to do. The next Biennial will become an opportunity to do that work in a new way.”The biennial, “The Paris Exhibition of Art,” was originally conceived as a triennial, but it quickly shifted to a series. The inaugural edition, “The Paris Demonstration,” was held in March 2019 and featured seven exhibitions, including “Ai Weiwei” (March 23–March 26), “The Gita” (March 27–March 31), and “Marianne Breguiere: The Modern Image” (March 28–March 31). The next edition of the show will be held in September.\n\n\nThe British Museum (BMI) is preparing to welcome visitors back from the brink of climate catastrophe by introducing new curatorial and conservation measures that will", "The next Biennial should be held in 2021.\n\n\nThe Grammy Museum in Detroit has appointed Loredana Boheme as its new executive director and chief curator. Boheme joins the museum from the Contemporary Art Museum of Chicago (CAM), where she most recently served as curator of the 2011 exhibition “Reasonable Doubt: Art and the Meaning of Life” (2014–15). Prior to joining CAM, Boheme was a curator at the Art Gallery of Ontario and held positions at the Museum of Contemporary Art in Beijing and the Smithsonian Design Museum in Washington, DC.“We are thrilled to welcome Loredana to the museum,” said museum director and CEO Michael L. Pfleger. “Her deep experience in and commitment to the art of photography lends herself well to this role as we continue to present and research together in a collaborative fashion.”\n\n\nThe Los Angeles County Museum of Art (LACMA), the Metropolitan Museum of Art, and the Museum of Contemporary Art Los Angeles (MCA) are among the more than 250 institutions that will be affected by the ongoing California wildfires. While the historic areas of Southern California remain uninhabitable due to the ongoing suppression of the fires, the fires have damaged", "The next Biennial should take place in 2020, and the seventy-fifth to be held in 2021.\n\n\nThe Royal Academy of Arts (RA) in London is planning to rename the institution after the late British artist and theorist Ian Watkins, whose body was found in a wooded area in the town of Selby, near Bristol, on October 4, 1916. The biennial, titled Art in Transition, will focus on the notions of art and art history and will include twelve works by Watkins, including The Air in the Walls (1928), The Life of Art (2017), L-13: The Life of the Body in the Time of Troubles, based on a Kip Andersen poem (1941), and The Encyclopedic Work, a collection of photographs that were taken by Watkins over a twelve-year period in the early 1950s.The new name, which was chosen in accordance with the British Royal Proclamation of March 28, 2019, will be unveiled on September 3. The announcement followed the unveiling of the awards show Art in Progress, which celebrates the achievements of thirty-three artists, including Elizabeth Peyton-Lake, Germaine Barlow, and Tanya Burr,", "The next Biennial should be held in 2021.\n\n\nAdvertisement\n\nThe Museum of Contemporary Art (MoCA), Chicago, announced today that it is expanding its curatorial staff to twelve artists with a goal to present more of the works in the collection within five years. The proposal, which is based on the institution’s long-standing philosophy of exhibiting artists in small groups, came from the artist-in-residence program.“Working in concert with curator Trisha Brown, who has been a member of the MCA staff for twenty years, we have developed a vision for how we can present a more diverse collection of works in the future, and have learned tremendously from artists who have kindly agreed to share their stories,” said museum director Christopher Bedford. “Through this new initiative, we hope to create an environment where the MCA’s upcoming exhibitions and performances are able to reflect the breadth and depth of the museum’s collection.”The program will include three exhibitions of work by artists whose work has recently entered the public eye:  ‎Terence Blanchard: We are all here and we are listening” will open on March 25 in the museum’s newest building, the Gether, and", "The next Biennial should be held in 2020.\n\n\nThe Museum of Modern Art (MoMA) in New York City has appointed Laura Aguilar as its next executive director. Aguilar comes to the institution from the Museum of Contemporary Art (MoCA), where she serves as director of international programs. She succeeds Linda Bean, who retired in May after twenty-six years at the helm of the museum, and will take up her new post on February 5.“Laura is a formidable leader, a formidable communicator, and a formidable curator,” said David Scharf, chair of MoMA’s board of trustees. “Her ability to relate to and engage audiences across the globe through art and lively, provocative, and thought-provoking presentations will ensure that MoMA continues to thrive and flourish as a world-class arts institution.”In her new role, Aguilar will lead MoMA’s business and research teams, oversee curatorial and educational initiatives, and develop the museum’s exhibitions and collections, which are overseen by MoMA’s curatorial department. She will also serve as a liaison for MoMA’s international partners, including the Swiss government and the World Health Organization, and will work with", "The next Biennial should take place at the University of Cambridge in the autumn of 2020. The 2020 edition will also feature a selection of new works, on display at the Museum of Contemporary Art (MoCA) in London, the Whitney Museum of American Art, and the Brooklyn Museum.  The 2019 edition included a selection of new works by artists such as Rina Banerjee, Talia Blanchard, Roberto Cicutto, and Anna Konnikova. The 2019 edition featured works by Lionel Amis, David Blandy, Lora Bonada, Julia Bonet, Alexandre Béchard, Marcel Bénétière, and Cécile Béchard. The 2019 edition also featured a retrospective of the work of Charles A. Birnbaum and of the work of Harriet Beecher by Elizabeth Birnbaum. “The exhibition is intended to reflect on the exhibition as a whole, but also to explore whether contemporary art can be both contemporary and pre-modern, and therefore to examine the possibility of a pre-modern art‐historical landscape,” said Anna Bailey, chair of the board of trustees of the Royal Institute of", "The next Biennial should be held in 2021, but the decision to postpone the event has not been made lightly. Hodgson said: “We are aware of the recent events in Catalonia and the uncertainty about the future of the region. We are taking these developments very seriously and continue to monitor developments closely.”She added that the move to give the region a year to prepare for the exhibition, titled “The Future is Spanish,” was not made without the consent of the local authorities in Barcelona. In a statement, the city of Barcelona said: “This is a difficult decision for all of us, but particularly for the mayor of Barcelona, Ada Colau, who has been a champion of the region’s Catalan aspirations since the early 2000s. She has worked tirelessly to make the city a global hotspot for cultural exchange and innovation. We express our solidarity with her, our deep appreciation for the work she has done to help our city continue to thrive under the Catalan Government and her dedication to the Catalan people.”\n\n\nThe National Museum of Fine Arts (NMFA) in Atlanta has received a gift from the city of Savannah. Founded in 1852, the museum houses some seven thousand artifacts from the", "The next Biennial should be held in the fall of 2019. The 2020 edition will be staged in the spring of 2021.In a release, the National Gallery of Art in Washington, DC, said that the decision to postpone the event was not related to the ongoing health crisis in the United States, but was made in order to “address and consider the issues presented by the exhibition and its relationship with the health of the Nation.”The institution said that it has also \"conducted extensive and sustained research in order to understand the implications and possible impacts of our exhibition and our exhibition program in an increasingly connected world,” and the National Gallery of Art in Los Angeles points to a similar and parallel research program that is ongoing.In an open letter to the future theme, which was circulated by the National Arts Center, the National Gallery of Art, and the National Council of the Arts, the organizations wrote: “While we respect your decision to hold a public event in order to address and consider the exhibition and the program, we believe that it is important to stress that the biennial is a partnership between you and the National Gallery of Art. The theme of the 2020 edition is not different from that of the previous two biennials: the theme is the", "The next Biennial should focus on the history of mass migrations into the territories of these countries, and should consider the role of the state in humanitarian efforts to facilitate assimilation. The theme of the 2020 edition will be “The Greater Middle East: The Political and Social Emergence of an Islamic State,” and the construction of an exhibition that will highlight the work of Palestinian artists.The eighth edition of the biennial will take place in Algiers, France, in December 2020. The first edition of the biennial was held in Algiers in 2003. Between 2003 and 2006, the exhibition “Shahrist Ali Al-Amin: The Transformation of a State,” was staged at the Museum of Modern Art (MoMA), in New York; the Museum of Modern Art–New York (MoMA + MoMA), in New York, New York; the Ashmolean Museum, in Oxford, England, and the Museum of Modern Art, in New York, New York, and at the Museum of Modern Art, in London; the Museum of Contemporary Art, in Tokyo; and the Nara Biennial, in Tokyo.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York is planning to", "The next Biennial should take place in 2021. It will also be the tenth year to host TIFF, and will be staged at the San Francisco Museum of Modern Art (SFMoMA), which will re-open in 2021, and at the New Museum in New York.The art is part of the new exhibition “Live and Let Live: Contemporary Art in the Age of Black Power” (2019). The exhibition was commissioned by the San Francisco performing arts nonprofit the Black Alliance for Just Immigration (BALI), which has organized the exhibition for the past ten years. The work, which is part of a series entitled “Follow Your Heart,” is part of an exhibition titled “The Art of Life,” also curated by BALI, “Live and Let Live,” for the National Gay and Lesbian Community Center in Memphis.This year’s event, which also featured work by artists such as Cecilia Bautista, Cécile B. Boone, and Vito Acconci, will be held at the San Francisco Museum of Modern Art. The exhibition will be on view until March 28 and will be accompanied by a book, “My Body, My Rules,” edited by the", "The next Biennial should be held in the spring of 2020. The second will be held in the spring of 2021.The announcement comes amid a global health emergency due to the coronavirus. The United Nations estimates that as many as 90 percent of the world’s population does not have access to basic sanitation. Many countries have also been implementing rationing and food restrictions, and millions are without clean drinking water and sanitation. In the United States, where the number of cases is at its highest level since the novel coronavirus was first discovered in December, the number of cases is at least 5 times higher.\n\n\nThe Museum of Fine Arts (MFA) in Los Angeles is removing two works by artist L. Brian Jean from its permanent collection. The museum has charged the artist with violating California’s Unruhestraße law, which restricts the display of works in the institution’s collection. The museum also faces a civil rights lawsuit by a former employee who alleged that the museum failed to protect her from a sexual harassment accusation.“We took the decision to remove these works off of the exhibition venue in light of the museum’s ongoing efforts to engage with women artists and their work in the field,” said M", "The next Biennial should be held in Trondheim, Norway, in 2025. The show will be themed “On the Other Side of the Sun,” and will feature work by forty artists through the year 2020. The exhibition will also include work by forty other artists in the exhibition “The Future Is Now: Celebrating the Future” in 2019. The cover of the exhibition will feature a rendition of “The Star-Spangled Banner” by American folklorist Lillian Gish. “One hundred percent of the net proceeds will be donated to the families of the victims of the Holocaust’s systematic slaughter,” professor Kirill Gusev, head of the Department of Art History at the State Museum of Fine Arts in Saint Petersburg, told the Art Newspaper. The first exhibition is currently on view at the Museum of Modern Art, St. Petersburg from February 7 to March 14. It is scheduled to return in twenty-six months.\n\n\nThe Museum of Modern Art (MoMA) in New York has been forced to close its doors indefinitely due to the pandemic, and on Saturday it announced that it is suspending all programming and fundraising activities. The announcement followed a week", "The next Biennial should be held at the Centre Pompidou. After the committee made its recommendation to the government, the cultural association issued a statement saying that it agreed and would implement the recommendations contained in the report. In the coming weeks, the museum will hold two formal public meetings, both in French, and will press the government to extend the deadline to December 19. The Royal Academy of Arts, which has an exhibition, Kisarthur, that is currently on view until December 14, also made its recommendation to the government. The institution is working on a plan that will begin by reopening the museum on February 23 and will culminate in an exhibition of works by the artist and activist Cécile Barba, a UNESCO special environment investigator, and will feature works by artists and collectors that are not represented in the museum.\n\n\nThe Los Angeles County Museum of Art (LACMA) has released its 2020 budget, which lays out how it will operate through the 2020 fiscal year, and announced its annual general manager, Kent Beckman. The budget for the museum comes a few weeks after that of the Metropolitan Museum of Art, which will continue to operate in the same capacity through 2021, and is", "The next Biennial should take place in 2021 and is slated to run from October 21 to November 28. The biennial will now include a selection of works by the artists who will participate in the theme “From Hell” and will present work in the form of a virtual reality experience.\n\n\nThe Corcoran Art Gallery in New York has received a gift of fifty-two works from the Corcoran family. The donation, which includes works by artists such as Cara Corcoran, Edward Corcoran, Dietrich Corcoran, and Walter Corcoran, including “Work in a Glass House,” 1972, which is on display in a public viewing room at the gallery, and “Nude with Glass Eyes,” 2017, which is currently on display in the exhibition “Between Two Worlds: Reframing the Art of the Body,” is a significant achievement for the Museum of Modern Art (MoMA) in New York. The works are from the collection of the Corcorans’ family, which is headquartered in New York, and were donated by the heirs of Charles and Martha Corcoran, the founders of the construction and development company Bechtel.“I am thrilled", "The next Biennial should be held before the end of the year. \n\n\nMichael Rosenfeld Gallery in New York has appointed Patricia Arsht as its first director. Arsht will be responsible for developing programming for the gallery, which has locations in New York, Prague, and Munich, and will take up the post on May 4. “I’ve been attending the exhibition program at the gallery for over twenty years and have been impressed by Patricia’s vision and ability to create a dynamic, artist-led space for contemporary art,” said Daniel H. Weiss, chairman of the museum’s board of trustees. “Her work has been featured in major exhibitions at the Metropolitan Museum of Art, the Stedelijk Museum, the Hammer Museum, and the Museum of Modern Art, and she has been a core member of the Biennial team for many years. I look forward to working with Patricia to develop a strategy for future development that is grounded in the values and goals of the artist-led community.” \n\n\nThe twenty-sixth edition of the Berlin Biennale, curated by an intergenerational group of South American curators under the guidance of Oscar Murillo, has announced that the", "The next Biennial should be held at the Museo de Arte Contemporáneo, in Lisbon, in 2021. The next edition will be held in March 2022. For the third consecutive year, more than twenty-five artists and creatives will present works at the prestigious event. The Biennial will receive a total of $2.5 million from the São Paulo-based organization São Paulo de Arte Contemporáneo (SPAC), and will be cofounded by artist and curator María Berrío, who will serve as the inaugural curator and director of the exhibition space, the Preciado, in São Paulo; Fernanda Pérez, director of the Museum of Modern Art, Chicago; and Xaviera Marques, the director of the Museo da Arte Contemporáneo.The Biennial will also receive a modest $500,000 from the São Paulo-based foundation Fondazione Biennial. The inaugural exhibition, “The Funeral Triangle,” will open on October 5 and runs through March 12. The next edition of the Biennial is scheduled for March 20–March 22.\n\n\nThe jury that examined the work of artist and", "The next Biennial should be held in 2020.\n\nEarlier this year, the Chinese government stepped up its crackdown on anti-corruption protests, arresting more than 5,600 people and moving more than 3,000 people from prison to a hospital for treatment. The crackdown has resulted in a five-fold drop in the number of people convicted of corruption-related crimes nationwide. The country’s culture ministry has also slashed the serving sentences of corruption-related crimes by half since 2020, and a new law passed last month will see those imprisoned for up to three years reduced by half.The National People’s Congress, the Chinese parliament, also passed a series of anti-graft bills, which will see those imprisoned for graft and large-scale corruption reduced by half. The National People’s Congress is expected to finalize the Anti-Corruption Law in February.\n\n\nThe State Art Museum (SAC) in Philadelphia has received a gift of forty-eight works by fourteen American painters from the private collection of artist-philanthropist George and Melinda Gates. The artworks were donated by a group that included John Hung, John Galliano, and Marko Kloos, and were acquired through a deal between the philanthrop", "The next Biennial should be a joint work between the two organizations, said festival director Mariaf (Mari) Alemani. The initiative will be led by director and CEO of the Art Gallery of Ontario, Krista Gunnarsen.\n\n\nThe Institute of Contemporary Arts (ICA) in London has released the list of seventy-three artists and collectives represented in the quarter-final round of the 2019 Art Mumbai Triennale. Represented are Arash Atmani, Adrian Piper, Reva Jayakumar, Harriet Finney, Karanjana Gondal, Laurie Mitchell, Olivier Nee, and Rebecca Watson.Among the artists whose works will be presented in the exhibition, titled TIMES, are Andreas Angkor, George Boo, Sara Brewer, Katy Bryant, Tanya Collette, Adrian Crockett, John Dey, Jane Gifford, Melissa Harris, Hannah Horan, David James Gray, Daria Jacobs, Anthea Weigel, and Nina Winn. Additional artists represented in the exhibition will be announced in the", "The next Biennial should take place in France in the spring of 2020. The 2020 edition will include artists from twenty-five countries and will bring together more than 1,600 artists.\n\n\nThe British Council has awarded a British artist a commission to create a new work commemorating the centenary of the passing of General Electric (GE) in London. In the work, entitled General Electric, 2019, Owen Paterson will portray GW's founder Henry Allison—one of the founders of GE—in a way that is both thought-provoking and sensitive.The commission from London-based artist and visionary designer John McAllister was presented to the artist at a special event at the Royal Albert Hall in central London on Thursday, March 3, and was awarded for his work General Electric, 2019. Paterson will create a modern reinterpretation of Allison’s iconic GE coat, which will be made of seven panels and will be illuminated by a single, 24-volt battery. The battery will be powered by a GE LED strip which will be embedded in the canvas. “With this commission, I wanted to create a work that reflected the spirit of Henry Allison as well as the legacy of GE,” said McAllister", "The next Biennial should be held in 2021, with the first event, “The Art of the Body,” to be held in 2020. The show will consist of biennial exhibitions and other programming designed to draw attention to various aspects of the body, including the physical and psychological states of the body. The show will also include a public reading of the next installment of the “Playbook” series.\n\n\nThe Zagreb Art Museum (Zamana) has appointed Monika Bovsák as its new director. Bovsák joins the institution from the Museum of Contemporary Art, Kraków. She succeeds László Pavlák, who has served as president of the institution since 2015, and will take up the post on January 5, 2021.“We are very pleased to welcome Monika to the Zagreb,” said MART Grand-Duke of the Kraków Region, Michal Zivkovic. “We have been working for some time to make the museum in the forest region in the city of Zagreb a reality, and are now at a point where we can say with certainty that it is finally possible.", "The next Biennial should be held at the site of the former Legislative Assembly of Montenegro (MAS), which reopened last May following a $1m restoration project, in June 2019.\n\n\nThe Hirshhorn Museum in Washington, DC, has presented the public with an unprecedented array of works in its acquisition program this year, showing works by artists such as Richard Avedon, John Akomfrah, Scott-Dyckman, Paul Gauguin, and Ed Ruscha, among many others, as part of its major acquisition campaign. The Hirshhorn will present a selection of the works in the exhibition “What is Life?,” which will open on September 20.“As part of our ongoing dedication to supporting the Hirshhorn’s artists, we are introducing new opportunities to support their achievements through the institution’s acquisition program,” said museum director Deborah Jeffries. “We are thrilled to present this exhibition and its accompanying exhibition program, which will bring together works that are part of a growing body of work that celebrates diversity and the potential of art and artmaking,” she said.The exhibition will feature a variety of works, from the contemporary and experimental to the overt and the forthcoming, as", "The next Biennial should take place in 2022 and will be hosted by the Nara National Museum in Tokyo. The biennial will celebrate the centuries of the art in a manner that aims to produce a deeper understanding of Japanese art.An open letter circulated by a group of artists and collectors in collaboration with the museum, which was signed by Hata, Koike, and Hikaru, reads: “The upcoming exhibition will aim to bring to light all the major works in the Biennial (1922), which were produced by artist-in-residence Yoko Ono, and to use the exhibition as a point of departure for the search for a common theme among the Biennial’s works. The exhibition will aim to show the work of the Biennial in a new way and will be different from any previous exhibition.”The letter continues: “The exhibition will be a challenge to accept a new voice in art history and to make a new contribution to the history of Japanese art, and the work of the exhibition will be a chance to hear the artists’ voices in a new light. It will also be a chance to meet the artists and to meet the artists themselves. This exhibition will build on the theme of ‘art in progress", "The next Biennial should take place in 2022 and will showcase the work of approximately seventy artists from twenty-five countries. The twenty finalists will be selected by a panel composed of art historian and curator Ana Mendieta-Moreira, art historian and curator María Berrada, and art historian and curator Hélio Oiticica and will each receive $8,000. The full list of participants can be found on the Biennial’s website.\n\n\nThe Museum of Modern Art (MoMA) in New York has released the full list of those who have been selected to represent Brazil in the forthcoming edition of the Art of the Americas. Titled “From the Sun to the Moon,” the exhibition will feature forty works by twenty-one Brazilians. The selections were made in collaboration with curator Aurel M. Pape, who established the exhibition in collaboration with MoMA in 2007. In addition to the collection, the museum will stage a performance and a children’s museum.“From the Sun to the Moon: Brazil’s Floating Sun,” which will open on January 12, 2020, will feature works by Lenna Almeida (2019), Mina Alves (2019), and Ruth Lock", "The next Biennial should be held in 2022.\n\n\nToday the Museum of Contemporary Art (MoCA) announced the artists who have received awards from the Biennial Design Challenge, which was launched by the Center for Contemporary Art and the National Endowment for the Arts (NEA). Each awardee will receive $10,000. The first round of grants, which were received in March 2018, were awarded to Lacey Ukeles, Tobi Canale, Cara Sennet, Yoko Ono, and Timur Sennet.After a series of multi-part interviews, the artists were chosen for their respective categories: 1. Dietrich Reimer: Artist, Architect, and Architectural Artist 2. Cara Sennet: Artist, Architecturalist, and Architecturalist 3. Timur Sennet: Artist, Architecturalist, and Architecturalist4. Pace Freund: Artist, Architecturalist and Architecturalist5. Anselm Kiefer: Artist, Architecturalist, and Architecturalist6. Olga Mendieta: Artist, Architecturalist and Architecturalist7. Zoé Whit", "The next Biennial should be held in 2020 and the first exhibition should open as soon as possible.”\n\n\nThe Museum of Modern Art (MoMA) in New York has decided to pay $6.5 million to settle a wrongful-death lawsuit brought by relatives of James Byrd, a white, unarmed black man who was killed by the police in Minneapolis in 2015 and was held in a cell for six days before his death was ruled a homicide.“The Museum has been cooperative and has paid out thousands of dollars in settlements to families of people who were unjustly killed by police officers,” said George Pimentel, director of the Metropolitan Museum of Art. “The Museum’s commitment to the truth and integrity of our cases is unwavering. We have reached out to survivors’ families and have offered to meet with them. We will continue to do so in an open and transparent manner.”The settlement, which was reached in the United States District Court for the Northern District of Illinois, allows the family of James Byrd, who was killed by police officer Derek Chauvin hours after he knelt on top of Byrd’s neck in a police car on July 25, 2015, and for two days afterward. The family", "The next Biennial should be held in 2021. The concept of an exhibition space for African art, founded by my mother and my father, was born in the suburb of Port Elizabeth in 1969. My father was an avid collector and had sold artworks on an industrial scale but had always avoided dealing with collectors. In 1980, I moved with him and my mother to Cape Town, where my siblings were raised. We also adopted two children from Ethiopia. The exhibition “Close-Up” marks the first time an African head of an American painting has been exhibited in the United States. Imbika and Sweezy, 2019.\n\nA group of artists, designers, filmmakers, and other cultural professionals announced today that they are launching an initiative that will allow the public to receive free personal care supplies and other humanitarian relief supplies from the Red Cross as part of a massive relief effort in the wake of the devastating hurricane Harvey.The Artists’ Relief Fund, which was established as part of an agreement between the United States and Mexico, will distribute relief supplies to individuals and families in need, including those in Houston, Texas; the Louisiana tri-state region, including New Orleans, LeBeaufort, and Baton Rouge; and Houston’", "The next Biennial should be held in the year 2021. The 2019 Venice Architecture Biennale was held in the spring of 2020, and the fifty-eighth edition of the Biennale in the summer of 2020. “The current exhibition is an extension of the work that was already organized in the past, and that is not new, but it is much more ambitious,” said Domenico Catellani, artistic director of the Grand Palazzo delle Papesse and a former director of the Sesotho Art Gallery, in a statement. The exhibition was organized as a celebration of the seventy-fifth anniversary of the Sesotho Art Gallery and the institution’s founding in 1987. The show was given a contemporary design by Marco Sposito, the architect of the Museum of Contemporary Art in Rome; it was constructed in the same building as the Museum of Modern Art in Los Angeles, which reopened in 2001.The museum, which was founded in 2004 at the historic Veneto di Locatello, is housed in a former ironworks factory on the outskirts of Milan. The institution’s former director, Cheryl Booth, has been nominated for a Pulitzer Prize for", "The next Biennial should be on October 29 and will be hosted by the National Museum of Fine Arts, Boston, alongside the Pavilion for Contemporary Art, Miami Beach, and the Seattle Art Museum. The 2019 edition will be held at the Metropolitan Museum of Art in New York.\n\n\nThe Los Angeles County Museum of Art (LACMA) has received a $50,000 donation from philanthropists David and Lucille Knight. The duo, who were first introduced to the institution by their son George, raised the money following a campaign for their daughter Victoria Knight, who is currently embroiled in a legal battle with the family over the future of her late mother, who was a pioneering photographer, activist, and supporter of contemporary art. David Knight is a professor of art history and museum studies at the University of California, Los Angeles, and Lucille Knight is a professor of art history and senior curator at the Los Angeles County Museum of Art.Born and raised in the Los Angeles area, the couple established the Los Angeles County Museum of Art (LACMA) in 1997 as a creative space for a younger generation of California artists. The institution, which has since expanded into a museum dedicated to the art of photography as well as the arts, hosted several major exhibitions,", "The next Biennial should be held in the spring of 2020, according to a statement from the festival.  The tour, which will take in the lobby of the museum, will be followed by the museum’s annual summertime show, “Biennials,” which will feature works by twenty-eight artists from thirty-five countries. The full list of applicants is as follows:Alfred Starowicz (Switzerland) 2018Alfred Starowicz: Under the CameraTania Bruguera (New Zealand) 2018Alberto Benavidez (Spain) 2018Brittany Delano (Canada) 2018Marlene Devers (New Zealand) 2018Luis Fernando (Mexico) 2019Ivan Guerrin (New York)Bianca Mascota (New Zealand) 2018Daniela Montoya (Spain) 2018Bianca Mascota (Spain) 2018Federico Sanlle (Italy) 2018Fernando Solvang (Mexico) 2018Hannah Wiles (New Zealand) 2018Hannah Wiles (New Zealand) 2018Hannah Wiles (New Zealand)Bianca Mascota (", "The next Biennial should be held sometime in the next two years. The second, scheduled for 2022, will focus on “life after death.”\n\n\nThe Pulitzer Prize in criticism, which was awarded this week, has awarded the Pulitzer Prize–winning author Kate Crawford her fourth Pulitzer Prize. Her first prize for fiction, which honors a widely-published essay by a woman in a male-dominated field, was also presented this week. Crawford’s essay, “The Unmaking of Man and the Making of Women” (1940), was selected for its feminist point of view, as well as its first-person focus on a woman’s body, which features a titillating portrait of a young Crawford walking down a deserted street in Los Angeles.The Pulitzer committee, which previously named Carolyn Benitez and Judy Pincus as finalists for the award, announced the finalists for the third and fourth prizes, which are presented by the Pulitzer Center on Media and Art. For the second prize, which is a report on the life and work of Robert Rauschenberg, the Pulitzer Prize announced that the prize’s winner was Ugo Rondinone, a US National Geographic Society writer.The 2019 prize awarded the", "The next Biennial should open in 2022, and the third will be in 2023. The Biennial of African Art, which will be staged in December 2021, has yet to be organized.  The Biennial of Indian Art, which will be staged in January 2022, has yet to be organized.  The Biennial of Persian Art, which is expected to take place in February 2022, has yet to be organized.  The Art of the South, an event that is currently slated to take place in December 2019, has yet to be organized.  The Art of the North, an event that is currently scheduled to take place in December 2020, has yet to be organized.\n\n\nThe Museum of Fine Arts (MFA) in Boston is working with the Greater Boston Cultural Partnership (GGBC) on a new five-year financial aid grant program that will provide $1.2 million to communities across the city through its annual $4,000 grant. The program, dubbed the Future Fund, was launched as part of the Boston Redevelopment Authority (BRTA), which is implementing a new set of guidelines for local arts funding that will help Brown University, Northeastern University, and Northeastern Massachusetts Institute of", "The next Biennial should take place in 2020 and the first in 2021.\n\n\nThe Museum of Contemporary Art (MoCA), New York, has been given a $3 million boost by the Bill & Melinda Gates Foundation in support of its curatorial staff. The arts philanthropists established the funds in 2012 to support the development and preservation of contemporary art in the US.“We are delighted to support the staff at MoCA who are working hard every day to shape the museum’s future,” said Richard Levy, the foundation’s executive director. “MoCA staff play an important role in bringing you the works of artists of tomorrow and ensuring that the museum has a lasting legacy for future generations. This year’s grantees are honored to join the foundation’s mission to change the world through art.”The grantees are:Anya Arsht, Brooklyn, NY;Theyleen B. Barron, New York, NY;Anissa Barlow, Buffalo, NY;Andrea B. Balsom, New York, NY;Backedzy Balakrishnan, Delhi, India;Lorelai Blouin, New York, NY;Alyson Bonakar, New York", "The next Biennial should examine the creative and social possibilities of the museum as a platform for social and political action. The exhibition will take place in the museum’s exhibition hall across from the Botanic Gardens. The first iteration of the biennial was held in 2012 and concluded in 2019.The institution will unveil its new collection on March 17.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has decided to postpone the upcoming exhibition “Sensate,” which was scheduled to open on March 8, due to concerns around Covid-19. The upcoming event, which will focus on contemporary art and the effects of the pandemic on artmaking, will instead be held in March 2021. It will be \"a combination of exhibitions, residencies, and student projects,\" said curator Roberta Smith, who highlighted the future of the exhibition as a model for future programming.Smith said that the show will be “grounded in a sensibility of the late-twentieth century art, a sensibility of the avant-garde, and a sensibility of the contemporary world.” The exhibition will include work by artists including John Chamberlain, Will Andersson, and Adam Lowery, as well as Sens", "The next Biennial should be held in 2021, the dates of the first meeting being held in 2019. If this year’s edition, which was held in Manhattan, is any indication, the older subjects will remain relevant and central. The Museum of Modern Art has already announced that a new exhibition, “The Solid Gold Years,” will open in December.\n\n\nThe Museum of Modern Art (MoMA) in New York has hired Stephanie Kraus, who has worked at the institution for more than twenty years, as its next director. In her new role, Kraus will oversee the museum’s expansion into an artist’s residence and will oversee the museum’s relationship with its permanent collection, which comprises five hundred works.“Stephanie’s commitment to the museum since her appointment has been outstanding, and we’re excited to see how she will continue to deliver on MoMA’s visionary mission as a cultural destination for generations of New Yorkers to come,” said MoMA board chair Adam D. Weinberg. “I’m sure she’ll bring with her a wealth of knowledge in how to succeed in this challenging environment.”Kraus comes to the", "The next Biennial should be directed by Roland Palm, whose eight-year retrospective of his project, The Watershed, premiered at the Venice Biennale in 2008 and brought together several hundred artists. Palm, who was recruited by Francis to create the exhibition, said: “I was invited to be in a program which would bring together a large group of young artists from the US. In a decade I have been involved in creating a new audience for art. The exhibition was the first time I had the opportunity to assemble a group of young people from the US. The show was also my first collaboration with Art Basel and it was my first collaboration with a public institution in the US.”\n\n\nThe Norfolk and Norwich Museums (Nandorms) in England and Wales have agreed to merge. Nandorms’s board of trustees announced the merger on March 21, and the announcement was made through an online petition. “We are delighted that Nandorms will now be united under one roof with a new set of values, a new mission, and a new set of priorities,” said chairman John Callashaw. The museum will also reorganize its existing building to better embrace", "The next Biennial should be held in 2021.\n\n\nThe Museum of Modern Art, New York, has appointed Nicholas W. Kadish as its next chief curator. He succeeds Sally Kornbluth, who announced on Monday that she had been promoted to deputy director, and will take the helm of the institution when Kornbluth leaves to become the next chair of the Smithsonian’s Arts and Leisure department.“Nick is a scholar of modernism and an astute curator who has been instrumental in advancing the museum’s contemporary collection as a global center of artistic excellence,” Stuart Giles, chair of the museum’s board of trustees, said in a statement. “His appointment reflects the vision and commitment of the Museum of Modern Art, and our vision of the future of the institution. He will be a great addition to the Museum’s collection and to the board of trustees as we embark on this next chapter.”Kadish previously served as director of the Center for Art and Culture at the University of California, Los Angeles (UCLA), whose David Halberstam collection he oversaw from 2014 to 2020. He also worked at the Museum of Modern Art (MoMA", "The next Biennial should be held in the autumn of 2021.” The next edition of the exhibition will take place at the Panorama in London in 2021 and will feature work by twenty-seven artists, including Adrien Brody (Brighton & Hove), David Cenci (New York), Jinya Ando (New Delhi), and Jodi Throckmorton (New York).\n\n\nThe Museum of Contemporary Art (MoCA), the Los Angeles County Museum of Art (LACMA), and the Los Angeles County Art Museum (LACMA) have teamed up to create a new public art project, a $25,000 prize for the best new installation in the history of Los Angeles. Organizers of the event, titled “Mystery of the Century” and curated by American artist David Koehler, announced the partnership in an open letter published by the Los Angeles Times on Friday.“In the image of a harrow and a heart that was both familiar and alien, in the image of a harrow and a heart that was both familiar and alien, in the image of a harrow and a heart that was both familiar and alien, in the image of a harrow and a heart that was both familiar", "The next Biennial should be held in 2020, and the twenty-seventh in 2021.The move means Kwon is returning to Seoul to stage the first edition of the medium-sized exhibition, which will be hosted by the city’s National Museum of Art, on September 24th next year. The exhibition will then return to the city of Seoul for a December exhibition in 2021.“We are thrilled to be working with the National Museum of Art in Seoul, which has been leading the way in terms of creating flexible ways for our artists to express their creative aspirations,” said Kwon. “Our artists were the main drivers behind the reopening of the National Museum of Art and we are proud to have the opportunity to showcase their work at the newly renovated National Museum of Contemporary Art in Seoul.”\n\n\nThe Los Angeles County Museum of Art (LACMA), the Museum of Contemporary Art Los Angeles (MCA), and the Solomon R. Guggenheim Museum in Harlem have announced their participation in the Global Guggenheim Fund, an initiative established by the Guggenheim in 2015 to support the full range of contemporary art—including sculpture, photography, video, dance, and theater. The Los Angeles County Museum of", "The next Biennial should be held in Tokyo in 2020. \n\n\nThe Museum of Fine Arts (MFA) in Boston announced today that it is planning to open a new space for contemporary art and architecture in the city’s historic Public Garden in 2020, in a five-story, 11,400-square-foot former industrial building on Beacon Street. The new institution, which will be located on the fourth floor of a former mansion, will be named after the MFA, and will be built on the site of the former site of the arts and culture complex the Asian Cultural Center.Following a four-year development and design effort, the MFA will unveil the new space, named for the group of artists and designers whose works were purchased by the institution, at an event that will be held at the MFA’s Beijing outpost on August 16.“The MFA’s new space in the city will draw visitors from all over the world, and will offer a broad and engaging array of contemporary art experiences,” said museum director Michael Govan. “The MFA’s new space will focus on the museum’s mission of celebrating the rich and innovative practices of Asian contemporary art, and will engage with", "The next Biennial should be held in 2022. “The Art of Exhibitions,” which was organized under the patronage of Cécile Bregué, and Jean-Jacques Delorme, is a major retrospective,” James E. Hoffmann, director of the Johns Hopkins University Art Museum, told the Art Newspaper. “The Art of Exhibitions was a critical step in the evolution of the museum’s collection, and has served as a blueprint for future exhibitions.”In the next iteration of the museum’s Art of the Exhibition, organizers will introduce 25 new works by artists, including Mariachi Málaga, Pilar Cornejo, and Adriana Mendieta, and will simultaneously stage Timur Sidam, Yayoi Kusama, and Oscar Murillo. The museum will stage three additional exhibitions under the theme “The Art of Storytelling,” a reference to the museum’s collection of such documentaries as MJ: Family Nights, and The Exorcist. The show will open with a lecture by Oscar Murillo and will run through January 5", "The next Biennial should take place in 2020.\n\n\nOn Saturday, the Museum of Contemporary Art (MoCA) in Los Angeles announced that it is planning to begin accepting visitors from September 15 through September 17. The institution is currently closed until at least November 29, when it will reopen with an exhibition of work by artist-run collaborative projects in a larger location.In a statement, the museum said: “In anticipation of the upcoming biennial, MoCA is making the difficult decision to suspend operations and reopening dates. . . . We are deeply grateful to the hundreds of artists, collectors, and supporters who have come together to make this possible, and we are grateful for the work of the staff and volunteers who have made this possible in the first place. We hope that these measures will help the museum avoid the disruption and expense that this may represent.”The institution was forced to make the announcement after the collapse of an attempt by state lawmakers in California to introduce a statewide sales tax holiday in September. The legislation that was introduced by Sen. Mike McGuire, D-Fort Collins, and Rep. Mike Thompson, D-Anchorage, had been drafted and was being debated at the time.\n\n\nThe Museum of Contemporary Art (Mo", "The next Biennial should be on the theme 'The Change of the World, 1920–2020,' with the theme “Future Present” in support of the theme of “The World.” After the biennial, the New York–based arts organization the New York Children’s Museum will present a second iteration of the exhibition, “Future Present II: Art, Design, and the Future of the Body” at the Brooklyn Museum next month. For the first time, the Royal Academy of Arts in London will be hosting a biennial. It will stage this iteration of the city’s biggest art event at London’s St Andrew’s Hall on September 3.Centre Stage in New York will stage a biennial of works by mid-to-late twentieth-century artists at the Metropolitan Museum of Art in January 2021. The show will highlight “The Art of Movement—” a special collection of work by artists including William Eggleston, Sidney Aitken, Ugo Rondinone, and Diane Arbus. The exhibition will also feature a reconstruction of the exhibition “Exhibition of William Eggleston” (1927–1932), a space", "The next Biennial should be in 2021, and the first will be in 2023. The proposal for the first exhibition in the new venue, “Future Present,” was presented at a special workshop held this week by Fondazione Prada, in collaboration with the Museo di Biennale di Storia di Milano, the Museo d’Arte Contemporanea di Milano, and the Museo di Pródi, which will convene the exhibition in the coming months. A commission by the artist Socks, which was due to open this month, was moved to December, and the exhibition was declared a success.Last October, organizers of the biennial, which was organized by the Milan-based nonprofit Foundation in the body and in collaboration with artists and curators Federica Cintio and Elena Cailoni, offered €1.8 million to the seven finalists. A month later, the Milan archdiocese unveiled the award winners. The names of the winners are:Anton Kern, Italy• 2009–present.“The chair was the director of Trisulti Gallery in Milan, and the prize was for his work for the exhibition ‘Tuzla,’ which", "The next Biennial should be held in London, and Artforum will present an exhibition in the city in the autumn of 2020. \n\n\nThe Art Newspaper has announced that the twenty-second edition of Art Basel Hong Kong will be held in September in 2021. The exhibition will showcase 230 works by seventy artists, including sixteen from Asia and one from Africa. The event will be hosted at the Los Angeles County Museum of Art (LACMA), where it was last held in 2009\u0097a year after the series ended.The article describes how the event, which will be held at LACMA, the Los Angeles Art Museum, and the San Diego Museum of Art, is part of a larger plan to develop the region as a hub for mass-produced art. Artforum will be a site of significant exhibitions and events, including the inaugural edition of the Museum of Modern Art (MoMA), which will be held at the Armory for twenty-four hours a day. This will be the first time the museum has been open for more than six months.Commenting on the theme of the show, Artforum editor-in-chief Angela Chiu said that the event will be a “great celebration of the Arts in America.” She", "The next Biennial should also include a section on the importance of the Holocaust as a source of inspiration and a method for reflection. The theme of the exhibition should be “The Influence of the Holocaust on our Lives and on the World.” The 2019 edition of the exhibition will be held in the exhibition hall of the National Museum of Contemporary Art in Paris, which will be inaugurated by French President Emmanuel Macron on March 22.\n\n\nThe 15th edition of the Venice Biennale, curated by Sabine Hoppe, was postponed until January 21. The show was originally scheduled to run from February 16 to February 19, 2019, but was moved to March 22 to accommodate the inauguration of the new government in Brussels. The move caused an outcry in the art world and prompted dozens of exhibitors to cancel their events in protest of the government’s decision to ban them from the fair.The show, curated by a group of artists including Philip Léger, Kader Attia, and Monir Shah, will now be held in April. The reopening of the fair comes after a hiatus of twenty-six months due to the pandemic. The new government’s guidelines for the fair state that the exhibition must be rescheduled.", "The next Biennial should be held at the Arles Museum of Art (Arles) in March 2020 and should showcase the work of thirty-eight artists in the first half of the year. The second should be held at the Neue Kunsthaus in Munich in July 2020 and include fifteen artists in the second half of the year.The event, titled Art:  (New), will be hosted by Professor Peter Wächtler and will feature the work of forty-two artists, including Pierre-Auguste Merz, Wolfgang-Josef Neuer, Joël and Stephan Hoelzel, Antony Hudek, and Oskar Kust, among others, and will have two presentations of the work of the same year. The last exhibition of the year will be presented by the Barcelona-based artist María Berrada at the end of April 2020.\n\n\nAdvertisement\n\nThe British Museum in London has accepted an offer to buy the artworks of the late British artist Graham McConlogue for $4.5 million, making him one of five artists to be given an unrestricted $4.5 million donation. The museum also revealed that it plans to dedicate a new exhibition hall to the artist’s", "The next Biennial should be in October 2020. The date for the second edition, to be staged in January 2021, was also set by Biennial organizers, who noted that it would be the largest retrospective exhibition ever staged in the city. The building of the exhibition has been delayed several times in the past, including once due to the pandemic.\n\n\nThe Joseph and Rosemary Kate Club in New York has announced that it has received a gift of forty-eight artworks from the Brooklyn-based foundation Art in the Community. The gift includes works by artists such as James Turrell, David McAllester, and Pierre-Auguste Renoir, as well as a selection of paintings by contemporary artists including Joan Miró, Jean-Michel Basquiat, Tadao Ando, and Sarah Noland.According to Artnet, the foundation organized the gift as a way to honor the late founder of the nonprofit organization, which was established to advance the work of artists and their causes through cutting edge exhibitions and scholarships. The works were donated in memory of the club’s founder, Joseph Kate, who died in 1997. “The foundation is deeply honored to receive this extraordinary gift,” said Kate. “The organization has been passionate", "The next Biennial should focus on the history of contemporary art in the Marshall Islands, the Maldives, and the Solomon Islands, and should aim to be a three-hour film, featuring interviews with artists, institutions, and art historians, as well as a performance by the Washington, DC–based, artist-run nonprofit A.I.R. Gallery, which will host the final exhibition on September 22. The exhibition will include the work of seventy artists and collectors, including Roberta Smith, Mary Ellen Mark, Michael Olenbacher, and Wolfgang Albers.\n\n\nThe Uffizi Museum in Florence and the Tisch Museum in Vienna have joined forces to present the first event, titled “Italy, 1949–1949—The Experience of an Alternate History,” at the Museo della Sarthe, in Milan, Italy, in March 2020. The special exhibition will feature forty films that examine the history of modernism in Italy, and will be accompanied by a book featuring essays by artists and scholars on Italian movies, radio, television, the cinema, and film preservation.The annual event, which coincides with the Italian–Italian Film Festival, will be held at the historic Tisch-Fashion Design Museum in Milan from March", "The next Biennial should open in 2022.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has received a $100,000 donation from the William Fulbright Foundation to bolster its curatorial staff. The gift follows an announcement by vice chair Linda Alberts, chair of the foundation, that the institution would receive $400,000 from the foundation in support of its future programming and the development of its collection.The donation comes on the heels of the institution’s announcement that it is entering a two-year multiyear partnership with the foundation. In support of programs and initiatives that promote cultural exchange, foster greater understanding, and offer opportunities for students, scholars, and the public to see and engage with works from the collection.The partnership will include a series of exhibitions, residencies, and student educational experiences. The first exhibition will open in January 2020 and will showcase the work of the foundation’s curatorial staff. The second will open in June 2020 and will consist of the curators’ own collections that will be accessible to the public through an interactive, virtual reality experience.“The cultural institution will be a beacon in a time when much of the world is uncertain, and a source of inspiration for those who seek its wisdom", "The next Biennial should focus on the concept of the body within a social context in the form of a collection of works which engage with contemporary issues and issues of bodies and their connection with contemporary life\u0097and to be inclusive of a range of ideas and philosophies.”The fifth edition of the exhibition, which is being organized by the Tate in London, will open on August 25.\n\n\nThe City of New York is planning to create more than three hundred new high-paying, full- and part-time positions in its non-profit arts and cultural organizations, but it will only pay artists making $50,000 or more over the course of two years. The news comes less than a week after the New Yorker published an article about the city’s arts and cultural sector, which felt the brunt of the city’s economic downturn. The article, which outlined the plight of several hundred artists and their supporters, has since prompted a number of institutions to lay off or furlough employees, and has drawn support from more than 2,200 individuals.The city’s culture and arts workers are demanding that the $1.4 billion Tropical New York project, which is currently underway in Downtown Manhattan, change its by", "The next Biennial should be held in 2020.  The opening of the next exhibition will be announced in September. The next one will be staged in 2021, and the next will be staged in 2022. The organisers have also recalled the show “Bina’s’s: Art & Power.”The 2019 edition of the exhibition, which celebrated the 50th anniversary of the British artist’s work, was staged at London’s Barbican Centre and ran from March 7 to March 12. The exhibition featured work by artists such as Eric Nylund, Nelly Arsht, Nima Arkadi, Nia Brescia, David Hockney, Rirkrit Tiravanija, and Janine Gibson.The 2020 edition of the exhibition will take place at Rockefeller Center and will draw from the work of a group of British artists, including Elizabeth Birkin, Symon Ball, Jonathan Davies, and Ada Palmer. The exhibition will follow the theme “Quantity over Quality.” It will also examine issues of visual aesthetics and will focus on the biennial as a vehicle to bring together a group of artists.\n\n\nThe Contemporary Art Museum Chicago (CAMC) has appointed Laura Owens as its new", "The next Biennial should take place at the Anand Gallery in Whitechapel, London, in 2021. The current exhibition “The Presence of Artists in a Nutshell” (2019) will be the last. © Getty Images\n\n\nThe Museum of Modern Art (MoMA) in New York has announced that it plans to extend the lives of the institution’s five-thousand-year-old ceiling fan by more than two years. The extension will see the fan installed in the museum’s basement, where it will function as an on-site air-conditioning system.The extension, which will also involve the installation of two hundred additional square feet of floor space, will be the museum’s largest undertaking to date. The renovation will be a continuation of MoMA’s campaign to present new works by artists in the nineteenth century. “The extension of the fan reflects MoMA’s commitment to the legacy of the original ceiling fan and to creating a more relevant, contemporary, and contemporary-minded museum,” said Joan Marcus, director of the museum. “The extension will also set an example for how we can imagine, envision, and design for the future.”", "The next Biennial should be staged in 2020.<|endoftext|>On Wednesday, the city of Manchester, England, became the latest part of the United Kingdom to banish financial institutions from the city center. According to the New York Times, the British city has banned large commercial sites from being within 1,000 feet of the site of a major New York art event, and has provided a $5 million grant to help mitigate the threat of flooding.On Sunday, the United States Senate passed a $2 trillion stimulus bill to prevent the Great Flood, which will now head to President Donald Trump’s desk for his signature. While the bill is expected to create a massive temporary relief fund for coastal cities, it does not provide an emergency fund for financially distressed local governments. The American Civil Liberties Union (ACLU) of Massachusetts and the ACLU of New York filed a lawsuit against the state on behalf of the city of Boston, which was forced to close its public swimming pools and limit the hours it can be reached by public transportation as a result of rising seas. While the city of Boston was not required to implement the safety measures it took part in before the ban—such as limiting the number of people it can hold in its buildings, limiting outdoor activities, and limiting the", "The next Biennial should be held in 2021 and should consist of a triennial of works that are not currently on view. The next Biennial will also receive funding from the Philharmonic, the Royal Commission for the Preservation of the Arts, and the British Film Institute (BFI). Funding for the 2020 edition was secured through a gift, made in 2017, of some forty works from the collection of the British Museum. The 2019 edition of the biennial, Herbert Spencer’s The Eyes of an Eye, was staged at the BFI in London. The Biennial, which will run from March 13 to March 27, 2020, is part of the BFI’s ambitious plan to present an annual schedule of twenty-three works by contemporary artists. The biannual exhibition will include the first show by the artist, who was born in London and raised in the United States, in his home country. Titled Lemmy and the Drag Girls, the show will be led by the drag queen and singer Lemmy Turner; the first show by a living artist will be the artist’s final show in the UK before he retires. The biennial was established in 1992 by the British Museum in partnership with", "The next Biennial should be held in March 2020. The first will be held in November 2020.\n\n\nThe center at the Art Museum of Chicago (AMC) will welcome visitors back to the institution next week for its sixth edition, “The Art of Bridget Riley,” which is being held at the museum alongside the Museum of Contemporary Art (MoCA) and the Contemporary Art Museum St. Louis. The event, which will run from March 16 to March 18, will feature more than 150 works by sixty-five artists. The exhibition will also include the museum’s first exhibition and residency program, set to open in 2021, as well as an exploration of the history of the American West.“I’m thrilled to announce our new partnership with the AMC. We are eager to bring the most diverse range of artists and contemporary art to Chicago and expand our reach through the AMC’s network of partners,” said Jennifer Keener, director of the AMC. “The AMC’s program will be transformative for the city and region. Last year, AMC and MoCA were able to work collaboratively to present an exhibition of work by twenty-six artists in the AMC’s New York location", "The next Biennial should be up in the spring of 2022. The 2016 event, titled “New Masters” (杜New Masters”), opened on March 28 and ran through April 6. The mission of the biennial was to “strengthen the public’s understanding of the art of the twenty-first century,” according to the organizers.“The new course for art will be a combination of global, local, and national, combining a history-driven approach to exhibition-making with a public engagement with the art of the twenty-first century.”The 2019 exhibition opened on March 24 and ran until March 29. The museum also announced that it is preparing to inaugurate the new exhibition, “Asia Art,” with a new collection of contemporary art from South Korea and Japan. The exhibition will open in May and run until October 24.\n\n\nThe British artist Steve Dickson, who portrayed the fictional avant-garde of the late nineteenth century in his painting The Golden House of Scotland, has died at the age of eighty-three. He was born in Glasgow in 1932 and grew up in a privileged middle-class Christian Pentecostal family in the city. In 1964", "The next Biennial should take place in 2021.\n\n\nThe São Paulo Art Museum (SPAM) in Brazil has received a gift of a 430-year-old Mozambican artworks from former president Luiz Inacio, who was assassinated by his own vice president, Jusuf Kalla. The works were donated by a wealthy businessman who lives in the northern state of Minas Gerais, which has a large Mozambican diaspora.The collection was recently gifted to the museum by an anonymous donor after a three-year legal battle. The businessman, who calls himself the São Paulo Art Museum Foundation, deposited the pieces in the institution in the early 1990s. He was not aware that São Paulo Art Museum staff had collected the works.The man who donated the works, named only as Uganda, had a long history with the museum. He founded the organization in 1994, and the foundation continues to operate today. In 2008, the foundation donated a work by the Portuguese painter Miguel de Cervino to the museum. The donation was made in memory of his father, who was a famous collector. The works, which were part of a series of works that began in the early 13th century, were originally on loan", "The next Biennial should be held in 2020.  Update: February 3, 2020, 2:00 PM. \n\n\nThe fuselage of the Swiss-designed aircraft carrier Constellation, which will head to the Persian Gulf in 2020, was dismantled and the vessel placed in storage at the museum in Geneva on Monday. The dismantling process began on January 20 and involved the removal of twenty-two pieces of equipment, including the propeller, which powers the ship, and the shipboard powerplant.The dismantling of the vessel took place at the shipyard in the port city of Basel as part of a deal that also saw the ship placed into storage for thirty-one days. It will now be stored in a temporary storage facility at the shipyard for a month before heading to the Danish port of Folkensthal. The transport of the aircraft carrier is part of the carrier-building program for the Islamic Republic of Iran, which is currently constructing the fourth ship of the same class.The dismantling process, which lasted for six days, involved the removal of eighteen pieces of equipment and the dismantling of the shipyard itself. The ship will be towed to the port of Kish Island in the Persian Gulf by the Danish shipyard Eriksen Shipyards to", "The next Biennial should take place in 2022, and the ART Biennial in Rio de Janeiro in 2022. Art Basel—which has yet to announce a new theme for its next edition—has yet to set a date for the 2020 edition.  The theme for the twenty-seventh iteration of the Biennale in New York will be \"The Limits of the Self, ” which will feature new works by artists from South America.The full list of participating artists is as follows:António Ciro Resende, BrazilDavid Chiu, Chiapas, MexicoDario Dallimo, BrazilMichel Ghebaly, PeruMonica Jakubowicz, PolandYoshitomo Takashi, JapanLloyd Sattler, New YorkCara Svendsen, SwedenMana Hsu, Hong KongTania Nimro, ChinaAmitav Ghosh, IndiaAnish Kapoor, IndiaJanice de Fer, New YorkLydia Bove, New YorkAlexandra Fitch, New YorkAmiti Sivar, New YorkAmitoglou, BrazilKevin Lee, New YorkCara Cipolletta, BrasilRosamund Gallozzi, Rome, ItalyJa", "The next Biennial should be held in 2022.\n\n\nThe Art of War and Peace, the 2017 Ticonderoga Award for Fiction, and the 2016 Denver Art Museum Artists Award are among the biennial winners announced today. The winners were selected by a jury that included Frank Gehry, Hans-Ulrich Remarque, Hans-Ulrich Zusak, and Thomas Watson. The winners are: David H. McCain, Sylvia Alberts, John Antonu (F), Clint Eastwood, Nathalie Andrews, Octavia E. Evans, Steve Dreiwitz, John Gardner, Kathy Harrison, Philip Hoke, Michael C. Rogers, Bill Simmons, Rick Sterns, Mariko Tamura, Thomas Beck, Lena Fredriksen, Elizabeth Huxtable, Jean-Luc Hauser & Werke, Steven H. Taylor, Vincent van de Wijngaard, Thomas Guggenheim, Gus van de Wegen, Paul Blake, Paul Gauguin, Tim McGraw, Bob Hunter, C", "The next Biennial should be held in the Spring 2021, and the first exhibition should open in the Fall 2020. The pavilion will be located in the San José Museum of Art, which recently completed the renovation of its building, and will include a collection of works that come from the artist’s nine-decade career. “Biennial is an experience, not a collection,” said Daniela María-Ruiz, curator of the exhibition. “The shows will be created in association with local, regional, and international artists, activists, collectors, and collectors’ institutions, and will address topics that manifest in our time. The upcoming exhibition will demonstrate how the world can be a better home for creativity and innovation, fostering a sense of community.”\n\n\nOn Saturday, the National Museum of Australia (NMA) in Canberra, Australia, announced that it will reopen next week following a $55 million expansion designed to improve accessibility, enhance its collection, and increase the museum’s exhibition capacity. The project also added an additional 500 square feet of gallery space, enhanced its library, and expanded its research library. The new spaces will allow the museum to present more exhibitions, more works of art, and more", "The next Biennial should be held in 2020.Click here to see a list of the biennial’s artists.\n\n\nAmerican Ballet Theater (ABC) announced today that it is preparing to reopen to the public in the spring of 2021 following a major $200 million overhaul. During the three-year-long renovation, which has been completed, the nonprofit staged its first all-new production in its seventy-five-year history, The Break of Dawn, in the spring of 2019 as part of the ongoing reopening of the institution. The production, which was inspired by the 2015 devastating fire that broke out at the company’s New York City headquarters, was organized as a collaborative project between ten artists and the company’s artistic director, Alex Epstein.The company’s new leadership and management team also introduced a new term to the institution, which dates back to the 1990s. The company’s current vice chair, Jeffrey Seller, who previously served as head of the Metropolitan Opera and as president of the Metropolitan Opera, announced that the museum will now be called the American Ballet Theater. It will also be known as the American Campus for American Ballet Theater, the American Ballet Theater, or the American Bal", "The next Biennial should take place in 2022.\n\n\nThe Rothschild Museum in New York has appointed Sherry Turkle as its next director. She has been the museum’s acting director since January 2019 and was named its interim director earlier this month.“Sherry is a star curator whose career has been closely intertwined with the institution’s history,” said director Ethan B. Zuckerman. “Her proven ability and commitment to contemporary art sets her apart from the pack, and we are delighted to welcome her to the team.”After working as a curator at the museum for more than twenty years, Turkle most recently served as deputy director and chief curator of contemporary art. She began her current task in January 2019 and will take up the post in February.“We are grateful for Sherry’s remarkable tenure at the museum as we have had the pleasure to work with her for nearly twenty years, and we look forward to working with her to advance the museum’s reputation as a leading international contemporary art museum,” said David Guggenheim Foundation president and CEO Matthew Higgs.\n\n\nThe Museum of Contemporary Art (MoCA) in New York has hired Kale Williams, a Chicago-", "The next Biennial should be held at least twice a year, with a view to reopening in the autumn of 2021.The biennial was prompted by the tragic death of MOS Architects' Gao Yu, who was working on a new residential building in Shanghai. “With great sadness, we heard of his passing,” said Shuangdi Zhang, the founder of the company. “As a family, we are deeply saddened, but also we are determined to continue with our work. We believe that MOS’s vision was to create a new location for the exhibition, a place to welcome visitors in a new way, to make the exhibition more lively, to engage new audiences, and to make the exhibition more accessible.”The exhibition will be relocated to a new building, which will be completed in the spring of 2020. The new venue will be named the Shanghai Museum of Art (SMO), and the exhibition will embark on a multi-year celebration of Chinese art. Previously, the exhibition was housed in the SMO the Paris-based institution of history and culture, which opened a new branch of the museum in the hotel in November 2019.\n\n\nThe Museum of Contemporary Art (MoCA) Los Angeles announced today that it", "The next Biennial should be held at the Museum of Contemporary Art Los Angeles (MCA); in 2020, it will be at the Museum of Modern Art in New York. In a statement, the museum said: “We are excited to continue the work of our talented and dedicated board members and curators in the museum, and to extend the reach of the Biennial. MCA is a truly exceptional institution and we are proud to be a part of its exciting and dynamic history as a civic-minded partner of the city of Los Angeles.”\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, has unveiled three new pieces of art by artists from the Asian Pacific: The Price is Right: Asian Art, Tamara Chiu: Asian Art, and KIRAI, a new exhibition centered on the work of Yinka Shonibare, a Wong-Tang artist whose body of work is layered with tapestries and sculptures.The museum also revealed two new exhibitions: “Art and the Pacific: Contemporary Asian Art in America” and “Art of the Pacific: Contemporary Asian Art in America.” The first exhibition, titled Art of the Pacific, will open on October 20 and run until", "The next Biennial should be held in 2021. “This is a microcosm of the larger cultural landscape and of our world,” Hernández-Rodriguez told the Art Newspaper. “With the retirement of Nina Simone, with its impact on the field of African art, the field of Brazilian art, the field of Mexican art, and the field of Chinese art.”\n\n\nThe Museum of Modern Art (MoMA) and the Detroit Institute of Arts (DIA) have partnered with the German artist Klaus Biesenbach to create a new public work. Titled Klaus Biesenbach: Avant-Garde Volks–Gesellschaft (English: Avant-Garde Volks-Gesellschaft: Avant-Garde Volks–Gesellschaft), the installation will be on view in the exhibition “Klaus Biesenbach: Avant-Garde Volks–Gesellschaft” at the museum until March 28, 2021. The work, which will be made from metallic and stainless steel, will be composed of twenty-eight works that will be connected by a series of apparatuses that will be found in"]