["The next Biennial should take place in 2021, the same year that the next edition of the New York–based museum will open. The new venue will include a new interactive platform and the same floor as the museum’s current exhibition space, which will remain open in a capacity similar to the museum’s current exhibition hall.The museum’s current exhibition space, which was renovated in conjunction with the redesign of the museum’s current campus in 2006, will remain open through the run of the biennial. Exhibitions will include “Sculpture at the Museum of Modern Art,” “Herman Hesse: The Rivalry Between Painter and Surgeon,” and “Tale of the Artist” and will run monthly. The exhibition-based biennial will kick off on October 16 and run through December 22.The design of the new Biennial has not yet been announced.\n\n\nThe London-based nonprofit Tate’s board of directors has appointed Keith Campbell as executive director. Campbell joined the institution in 2016 as director emeritus, and previously served as director of Tate’s London and Islands. Prior to joining Tate, Campbell was the director of the private exhibition space Frieze London", "The next Biennial should take place in 2020, as planned, and will mark the anniversary of the festival’s founding. The theme of this year’s edition will be “Practical Solutionism,” and the first act will be an all-female group comprising A. Nargund, Carol Ann Miller, and Ivan Albright-Reeder. The full list of participating artists is as follows:Albright-Reeder (Switzerland)Beasley (United Kingdom)Baker (New Zealand)Bakishly (New Zealand)Bakrit (New Zealand)Bakothu (New Zealand)Bacham (Kerala)Bassara (Cameroon)Bassara (Spain)Bassen (Italy)Bassett (New Zealand)Bassmurdo (France)Bassamun (New Zealand)Bassim (New Zealand)Bassamu (New Zealand)Bassamu (Switzerland)Bassut (New Zealand)Bassut (Switzerland)Bassut (Switzerland)Bassut (Switzerland)Bassut (Switzerland)Bassut (Switzerland)Bass", "The next Biennial should be six months after the 2020 event. The 2019 edition, titled “Under the Radar,” featured work by twenty-four artists under the age of thirty-five. The artists chosen for the 2020 edition belong to a group of twenty-six artists who have participated in the festival since its inception. The artists chosen for the 2020 edition were Alice Alighier, Agnieszka Aksu, Filippa Delores, Aline Kupka, Amara Abdalati, Sabrina Aleman, and Amira Saar.Awardees of the 2021 edition include: Amara Abdalati, Abraham Kerg, Diane and Matthew Levy, Galerie Takashi Imai, Galerie Sabrina Aleman, Gorić Bech, Hans Claussen, and Katja Bühl.\n\n\n\n\n\nGalerie Takashi Imai, Vienna. Courtesy of the artist and the Fondazione Fabio Cassini. \n          \n\n\n\n\n\n\nThe Department of Culture and the Arts (DCLA) in London announced today that Nadine Dallal, a professor of art history at the", "The next Biennial should be held in the summer of 2022. The biennial will organize the exhibition of work by sixty-eight artists, including Salah Hameed, Hamza Walker, Akram Sadiq, Delphine de Gouy, María Berrada, André Gorbach, and Hirshhorn Museum curator Andrew Kreps.\n\n\nThe Athenian Museum of Art (AM) in Athens, Greece, has appointed Sarah Hopper as director of the Athenian Art Museum. Hopper comes to the institution from the Danish city of Copenhagen, where she has served as the director of the Copenhagen Art Museum since 2018. She succeeds Stefano Di Zico, who retired in February following a two-year tenure.“It has been an incredible journey in the six months since I was appointed as director of the Athenian Art Museum,” Hopper said in a statement. “Together with the Copenhagen-based team, I have worked to present the greatest exhibition of contemporary art ever organized, and to develop and deliver the museum’s first exhibition of Modern Art. The exhibition has been a transformative experience for me personally and for the entire team, and I am thrilled to see it finally presented at the Athenian Museum in", "The next Biennial should be held in 2021. The museum will also look to the future and will present a new exhibition of works by a select group of contemporary artists. The extension of the biennial was announced in late March and was made possible through the generous support of two thirds of the curators who signed the letter. The letter is dated March 7 and is addressed to Matthew Broadbent, director of the National Gallery of Scotland and the National Museum of Art; Mitzie Riggs, director of the National Gallery of England, London; Angela Scanlon, chief curator of the National Gallery of Art; Mike Kelley, director of the Museum of Contemporary Art Atlanta; Tom Gidley, director of the Museum of Contemporary Art Jersey; Jill Stein, president of the National Endowment for the Arts; Lisa K. McInerney, president of the International Council of Museums; Andrea Levy, president of the National Endowment for the Humanities; Richard Mayhew, president of the National Galleries of Scotland; and Jonathan Mendelsohn, president of the Tate. The letter concludes: “We encourage all our Royal City Council colleagues to consider the ways in which", "The next Biennial should take place in 2020 and the first in 2021.\n\n\nSince the internet was invented in the late 1970s, the field of visual art has been a vehicle for social change. The concept of the Museum has been instrumental in catalyzing many of the social changes that have benefited the visual arts and has helped to establish the careers of many artists. In the years since the internet was invented, Biennials have become an integral part of the visual arts landscape and have become a highly visible and influential voice in the arts. The Biennial will mark the twentieth anniversary of the original exhibition and will present work by twenty-four artists in an exhibition that will take place at the Museum. The exhibition will be organized as follows: - “The Factory: How Art Became the World” - “The Bridge: How Architecture & Design Changed the World”The winner of this year’s Art Prize will be announced in October.\n\n\nThe New York architecture firm Wünsch Architecture has won the 2018 Pulitzer Prize in art. The $100,000 award, presented by the Pulitzer Board of Trustees, announced today that it has awarded $1.5 million to the firm for its design of", "The next Biennial should be held in 2021. \n\n\nBritish artist Alighiero Cattelan has received a major donation of thirty-five works by fifteen artists, including Paul Gauguin, Jonathan Greaves, and Walter de Maria, for his exhibition at the Centre Pompidou in Paris in 2019. The works will be donated to the institution by the artist, who was working on a new public art project in the city, and his wife, Brittany, in an exhibition organized by the museum.“Alighiero Cattelan: A Horse and a Horse,” which opened at the Centre Pompidou in December, 2019, earned the artist a prize at the Venice Biennale in 2020. He was also the first to open a museum in the city, which is located near the Seine-Saint-Denis.The gift includes artworks by Gia Charles, Jacques-Louis Cendres, Laure De Kooning, Michelangelo da Vinci, Henri Matisse, and Thomas Nast, who will be presented at the institution in an exhibition that will run from January 18 to March 21, 2020.The show will feature works by thirty-four artists, including Damien", "The next Biennial should consider what it means to be a part of something bigger than yourself, and how to create a place for the collection of works by and for other artists. Our collection is diverse and has significant holdings from all over the world, and we plan to present the works of a number of artists, including Gabriella Caceres, Eduardo Castellani, and Tora Brown. We will also be able to present works that were born and made in the United States, and we will be able to expand the museum on a global scale.We are currently in the process of planning the programming for the biennial, which is the largest collection of works by American artists in the country. We anticipate that the exhibition will take place in the fall of 2020 and will unveil the first work by an African American artist at the museum in the spring of 2021. The exhibition will include work by artists who identify as belonging to either the Black or African diaspora.“The Biennial is a collective work of artists who choose to create out of their own experiences, to create something larger than themselves,” said Deborah Bell, chair of the museum’s board of trustees. “A collection of this magnitude presents a new kind of opportunity", "The next Biennial should be held in 2021 and will host a selection of work on paper in the form of a monographic exhibition. The second, which will take place in 2020, will include the work of twenty artists chosen by Biennial committee members, and the third, which will take place in 2020, will be a special exhibition on the field of sculpture and will be open to the public. The first event, entitled “The Hand in Stone” was held in 2013 and was the first show dedicated to the study of the hand in the United States. It was curated by the American painter and theorist H.W. Tait and featured work by forty-four artists, including Léa Seydoux, Oskar Kokoschka, Léa Marley, and Peter Zumthor. The exhibition was also inspired by the work of Italian architect Stefano Dotta.\n\n\nTwo new international commissions, the Global Alliance for the Arts (GAFA) and the United States Council on Museums (USC) have launched, and it is shaping up to be a watershed year for the world of arts. The inaugural biennial, “Intersection,” will be on March 22–March 25", "The next Biennial should take place in the autumn of 2020. \n\n\nThe Institute of Contemporary Arts (ICA) in Copenhagen has appointed Gabriella Balsom as its next president. Balsom currently serves as chair of the ICA and is a member of the advisory board for the Multidisciplinary Art Gallery of Denmark (MAS), the Danish Contemporary Arts Forum (Danskverket), the Copenhagen Art Museum (Copenhagen Art Museum), the Stedelijk Museum, the Copenhagen Art Museum, the Copenhagen Art Museum: Henrik Frode, and the Haus der Kunst, the Museum of Contemporary Art Copenhagen.“Gabriella’s vision and her passion for the art of art and contemporary art comes through in her work,” said Hans Christian Andersen, director of the ICA. “Her transparent, intuitive, and open-minded approach to leadership is precisely what we need in order to continue to shape the ICA’s collection and new program, while also continuing to develop and share the art of art and contemporary art with the local and international communities in Copenhagen.”Balsom currently chairs the department of contemporary art at the University of Copenhagen, where she is a professor of art history and", "The next Biennial should be held on September 20–21, 2020.”\n\n\nThe Gates Foundation and the Kensington Museum of Art in London announced today that they have agreed to jointly develop a new cultural platform for helping the homeless. The project, called the Laundromat Effect, will be led by the London-based artist and researcher Jemima Boyce and will aim to create a resource that will focus on helping people to store items they need in order to enjoy a range of activities, from shopping to cooking, in their homes.“The Laundromat Effect will include a workshop for young artists and will involve working with the artist and the Laundromat Project to give them a platform to experiment with new and creative ways of helping others,” Boyce told the Art Newspaper. “Young people have the power to transform lives, and the Laundromat Project will work with them to help them develop skills and ideas to help them stay connected with friends and family, and to help them remember where their things are.”Boyce is one of a number of artists who have collaborated with the Laundromat Project in order to address the impact of the Covid-19 pandemic on the local community. In", "The next Biennial should be held at the museum within the next four years and will focus on cultural exchange across East Africa and Latin America. The foundation also plans to add more than two hundred more works by artists working in the Direct Line, including Claude Monet,  Gertrude Stein, Sylvia Minnelli, and Alice-Alfred Adès. In addition to the new exhibitions, the foundation plans to continue to support and advance the programs of the Düsseldorf, Frankfurt, and London galleries and museums in the city.The foundation will also begin accepting new dues from the art-world’s largest organization, the Artmex Büro-Kunsthalle. The newly created organization will operate an online viewing room for the artist-run museums as well as a digital archive of the museum’s collection. The Düsseldorf Biennial’s inaugural edition was held in June 2019. The first chapter, “Düsseldorf in Motion” featured more than 350 works and was organized by the Quentin de Briey collective, in collaboration with the gallery.\n\n\nThe National Gallery of Art in Washington, DC", "The next Biennial should be held in 2021. —Photo: Juliette Nockel, a biennial of historical works at the König Galerie, New York.  The Park Foundation, the German nonprofit organization that owns the Park Museum in Berlin, has appointed Adam Wirth as its next director and chief executive officer. “Adam has seven years of experience in the field, and his work has been shown at many international exhibitions, including the Venice Architecture Biennale and the Berlin Biennale, and has been published in a number of books and exhibitions,” said Ana Moro, the Park Foundation’s director, who previously served as a curator at the Museum of Contemporary Art, London. “It is exciting to have an experienced leader in place who has been involved in creating and building the Museum of Contemporary Art, Berlin, for more than fifty years, and who has the vision, skills, and enthusiasm for the future.” Since its founding in 1990, the Museum of Contemporary Art Berlin has hosted more than nine thousand exhibitions, including the Art of the Millennium, 1992, and “American Diaries: A Retrospective,” which premiered at the Museum of", "The next Biennial should be held at the New Museum in New York and will be presented by architect and curators Miriam and Ivo Marczak, who are currently collaborating on the exhibition “The Death of Architects.”The exhibition will include two works by artists who have been heavily featured in the Biennial series, Peter Andre and Marc Chagall, each of whom will receive a $50,000 advance fee for the exhibition. The theme of the exhibition is “Death and Construction” and will debut at the Museum of Modern Art in New York in 2022.\n\n\nThe Metropolitan Museum of Art in New York has laid off thirty-three staffers, including thirty-four in the Department of Art and Design (DA), following a series of layoffs and furloughs that occurred last March. While the museum initially announced the furloughs as necessary due to Covid-19, the festival of its three-day museum edition, “The Met,” which kicked off last month, was canceled and the beginning of the seventh season of the museum’s new arts-centered space, “Beyond the Art,” was postponed. The museum’s direct-to-the-public campaign", "The next Biennial should be in the spring of 2021, and the next will be in at least the second half of 2020.  The event will also introduce a new series of exhibitions and performances that will draw from work by local and international artists. The future of the Biennial lies in the hands of the creative community. \n\n\nNew York’s Metropolitan Museum of Art has announced that it anticipates a major loss of revenue for the museum in the coming years as the institution attempts to curb spiraling health care costs and improve accessibility through an overhaul of its aging and narrowly housed galleries.  In a statement, the museum said: “Since the inception of the Met, we have been committed to improving the health and financial health of our staff and the Met community through a number of strategies, including the creation of the Visitor Experience (VE), the redesign of the Museum, and the construction of the new galleries. As we work towards the goal of providing more accessible and curated exhibitions, programs, and experiences to our visitors, we recognize that our future business depends on ensuring that the Met’s galleries and collections continue to be vibrant and attractive places that showcase the very best of New York.” Since the Met opened its", "The next Biennial should take place in 2020. The artist-run exhibition will remain open through March 21, 2021. Previously, the show was held every second year. For a full list of participating artists, click here. The 2019 Winter/Spring exhibition featured work from forty-two artists, including Chinua Achebe, Bridget Riley, and Leon Golub, and was organized by the Washington, DC–based nonprofit the Center for Art and Culture, which has supported the exhibition with funding through its grant program for thirty-six years.  A selection of the work of the twenty-one exhibiting artists will be presented at the 2018 Winter/Spring Biennial in New York; the 2019 Spring Biennial, at the Philadelphia Museum of Art; and the 2019 Winter/Spring Triennial in New York.\n\n\nThe Middle School Art Museum in Harlem (MSAM) has received a gift of fifty-one works by American painter and sculptor Martha Graham, who was an important member of the American painter and sculptural canon. The gift includes a selection from Graham’s work, The Wound, (1935), for which Graham was awarded the National Medal of Arts in 2013; a painting that incorporates Graham’s body", "The next Biennial should commence in February 2021. \n\nMeanwhile, the Biennial of the Contemporary Arts Prague, previously scheduled for March 18–March 21, 2019, has been pushed back. The March 21 event has been rescheduled to March 26–March 28, 2020. The cancellation of the event has also forced the reopening of the National Museum of Contemporary Arts Prague, which was supposed to open in March, the first day of March.The Biennial of the Contemporary Arts Prague is still slated to take place in March 2021.  “Glenn Adams, director of the BAM and the Central Institute for Contemporary Arts in Vienna, has informed us that the 2019 event has been canceled due to low attendance in the Czech Republic,” said Mariana Hrvoj. “We are very disappointed with this news, but we believe that it is the right thing to do for the future of the biennial. . . . [The organizers] informed us of their decision in advance, and we had no new questions about the conference. However, we sincerely hope that the organizers will unveil a revised version of the biennial that will be open to everyone, of the best contemporary artists from the Czech Republic, from February", "The next Biennial should take place at the Museu de Arte de São Paulo, which is currently being renovated. The 2015 edition of the event, “O Forma Biennale,” was held at the Marina da Modena in Rome from February 11 to February 13.\n\n\nThe Metropolitan Museum of Art in New York has added six more members to its board of trustees: designer Aline Büttner, founder of the fashion label Territory, Richard Gilbert, director of the nonprofit organization Tia Fundação, and artist Miranda July.In addition to the new members, the institution added two new members, artist-activists Marcia Benites and María Berrada, and two artists whose works are currently in the collections of Santa Cruz, the Museum of Modern Art, and the Whitney Museum of American Art.“The board members are thrilled to welcome these exciting new members to the Met,” said museum director Christopher Bedford, who added that their roles will be a “critical and stimulating source of inspiration and inspiration for the board and staff.”The addition of the new members was made possible through a generous gift of $2.2 million from the Met’s billionaire chairman, James L", "The next Biennial should take place in 2019. \nThe temple also plans to open a new public space in the city center, a cultural center and a museum in the city, and is working on developing a master plan for the region. The city council approved the plan last December and the plan is now being implemented by the local government, which consists of ten municipal wards.\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Pamela Kelly as its next director. Kelly comes to the museum from the Museum of Fine Arts (MFA), which she has led since 2007. During her tenure, she has expanded the museum’s collection and curatorial program, increased attendance, and invested in the institution’s exhibition-viewing experience. Under Kelly’s leadership, the museum has experienced a significant growth in visitors, attendance, and revenue, and in 2017, the museum became the site of its first Women’s March.“Pam is an accomplished and talented organizer whose proven ability and commitment to her art and to the art of curating has earned her our admiration and respect,” said Mark Lubell, the board president of the Greater Boston Cultural Alliance, a coalition of local arts organizations. “Her", "The next Biennial should be in January 2020, when the exhibition will mark its sixtieth anniversary. The exhibition will be divided into four categories: sculpture, performance, performance, and art. Each category will consist of a series of performances, from April 21 to May 7. \n\n\nThe Grand Rapids Museum of Art (GRMA) is planning to move several hundred works by a handful of artists, including Ghengis Khan, Tanya and Gwyneth Paltrow, and Pilar Correa, from its current location in Detroit to a new building that will be completed later this year. The Grand Rapids Art Museum (GRMA) is also planning to establish a new museum in the city to house the collection of the late poet and activist Kahlil Joseph. “We are excited to collaborate with the city of Grand Rapids and the community of Grand Rapids as we create a museum for the collections of Kahlil Joseph and Gwen, the late poets and activists,” said museum director Susan Friedman. “This will be a monumental project for GRMA and will have a lasting legacy for GRMA.”The move will be made in recognition of the city’s support of the artists who have given their lives and all", "The next Biennial should be held in 2020. The artwork, which was created by Damjan Naidoo and features works by thirty-eight artists from Africa and the Middle East, will be exhibited at the Museum of Modern Art, New York, in the fall of 2020. In the exhibition, the artists will be presented with twelve panels from a selection of paintings by forty-five African artists.Although the exhibition has been in development for years, the two years since it opened has been the most challenging for the artists. The exhibition’s 75-hour running time was due to begin on October 8, but because of the Covid-19 pandemic, the opening was pushed back to November 9. In the run up to the exhibition, the curators have faced numerous obstacles, including allegations of racism and of plagiarism. Upon learning of the allegations, Naidoo and the other artists took the project to the Kenyan civil society group Naiduwala Ndzibalene, which launched a campaign for the exhibition to be withdrawn from the event. The group’s president, Mabel Okwui, told the Art Newspaper: “All of us are deeply disappointed. But we are glad to be able", "The next Biennial should take place in 2020 and will be hosted by the Capital Institute, London.\n\n\nThe Haus der Kunst (German International Museum) in Munich has been forced to cancel a major exhibition that was set to open in the capital city in February 2021. The exhibition was to feature works by the Painted Ladies of Monaco, the greatest European artists of the twentieth century, as well as works by the contemporary artists Mariane Celant and Aline Musso, and will have been staged at the Haus der Kunst between February and March 2020.The show, titled “Unceasing Sunset,” was to have featured twenty international artists, including Laura Owens, who is currently in the process of bringing her first show in the United States, Lizzie Big, at the Seattle Art Museum, in November; Scott Thomason, who developed and won the first solo exhibition in New York at the Museum of Modern Art in 2017; and Yinka Shonibare, whose work was to have been included in the seventy-third Biennial at the New Museum in New York, but was never completed.In a statement on February 22, the Haus der Kunst said: “It is regrettable that the H", "The next Biennial should take place sometime between March and June.\n\nThe Art Institute of Chicago (AIC) has released the first design for its redevelopment, which aims to create a more inclusive, collaborative space for artists and cultural workers. The redesign, which was completed in phases, aims to increase accessibility, modernize the building, and retain the institution’s contemporary aesthetic. The project, which involved the redesignation of several spaces on campus, was part of AIC’s attempt to reshape the face of Chicago’s downtown with a more collaborative, community-oriented approach.“This is a long-term deal,” said Mark Adler, executive director of the AIC. “We have been working on this for over a year. It is a combination of the right combination of spaces and the right combination of people—more of what we have always wanted, and the right mix of people.”Adler said that the renovation will allow the museum more flexibility in its collection and planning, thus increasing the likelihood that the institution will re-open in the spring of 2020. AIC currently has more space than a thousand works on display, but the museum will have to relocate some of its curatorial and storage", "The next Biennial should take place in the city in April 2020.\n\n\nThe Diller Scofidio + Renfro–designed museum, in the Old City of New York, is expanding its curatorial team with six new hires as it launches a $250 million expansion project. The museum, which recently completed an extensive renovation and expansion in the city’s Greenwich Village neighborhood, is expanding its exhibition space by twenty-four feet\u0097to the Diller Scofidio + Renfro–designed space at 6 East Twenty-Third Street. In addition to installing new contemporary artworks, the new museum will also add a new gallery that will organize exhibitions for the Diller Scofidio + Renfro Collection and display works by the artist’s extended family.“We’re thrilled to welcome our new colleagues to the Diller Scofidio + Renfro family,” said curator and director Craig Diller. “Each of these six talented individuals will contribute to cultivating, creating, and exhibiting new works from the collection and the collection’s extensive international holdings, including works by Marc-Antoine Scofidio, and his extraordinary extended family. Together, they will shape the", "The next Biennial should focus on how the production of art and culture can be responsive to the needs and demands of the local community, and on the ways in which art can serve as a vehicle for social change. We hope that this exhibition will be a catalyst for an international conversation about why art is so important to us and how we can further its mission of reflecting the global spirit. \n\n\nThe Robert Rauschenberg Foundation has named Terry K. Hughes as its new director of external affairs and chief curator. Hughes joins the foundation from the Doris Duke Foundation, where she has served as chief curator since 2008. He succeeds Laura Corkins, who retired in February 2019 after seventeen years at the helm of the foundation.“Terry is a seasoned curator whose career spans more than five decades,” said foundation president and CEO Meg Whitman. “Over the course of her career, Terry has shown a remarkable ability to adapt to unexpected and challenging times, developing the foundation’s relationship with local communities and institutions in ways that are both innovative and unprecedented. . . . Her ability to open doors and expand our understanding of art and culture as well as her passion for seeing it reflected in her art has made her a talented and capable leader.”", "The next Biennial should take place in 2021 and will be hosted at the Museum of Contemporary Art (MoCA), Los Angeles.Esther Schipper, chair of the board of trustees of the Biennial Foundation, said: “We are thrilled to welcome the very talented, very passionate, and very smart James Turrell to the museum and to continue to nurture his exceptional work.”\n\n\nThe Metropolitan Museum of Art has released its 2020 budget, which aims to reinvigorate the museum’s collection and reinvest in its collection of early 20th-century art. The plan is $4.3 billion, which comprises a variety of programs, including a new $200 million fundraising season; the construction of the museum’s first public glass-enclosed building; and the acquisition of works by early modernists like David Salle and Le Corbusier.The museum’s collection is currently estimated at $7.5 billion and comprises art from every major twentieth-century European and American artist’s studio and catalogue. The museum plans to add nearly $260 million to its holdings over the next five years, including more early 20th-century works by artists such as Jean-Luc Godard, Adrien Brodie, Ed", "The next Biennial should be in October 2020. The exhibition will be hosted at the MCH Group’s headquarters in the city of Lugano, Switzerland, and will be curated by Leonardo, Jes Fan, and Angela Geisler.\n\n\nThe Los Angeles County Museum of Art (LACMA) announced today that Barbara O’Brien has been promoted to the role of director of the institution. O’Brien is currently the executive director of the Institute for Arts and Sciences in Waltham, Massachusetts, and is working on a new project, “Toward an Art Museum in Los Angeles.” A group show for the museum is scheduled to open in February 2021.“I’m incredibly honored to work with Barbara and to embark on this extraordinary journey with her,” said LACMA director Vito Acconci. “Her vision and energy are essential in creating an environment for the future of art in Southern California.”O’Brien joins the museum after serving as an associate curator at the Museum of Contemporary Art (MCA), Los Angeles from 2016 to 2018. She was interim director of the museum before the formation of the institute, which was established in 1994 as part of UCLA�", "The next Biennial should take place in 2020 and the full list of participating institutions can be found here.\n\n\nSix new works by the late Pakistani artist Anupam Ghosh have been added to the collection of the Indian Museum in Karachi (IMMI), the first time that a Pakistani artist has been granted a permanent residence in the museum. Ghosh’s first show in the institution, which has two galleries, was commissioned for the theme “Veil of Humanities” in 1961. Ghosh’s work is included in the exhibition “Anupam Ghosh: The Veil of Humanities” (2019–2020), which celebrates the artist’s fifty-seventh birthday and is on view at the Islamabad Art Summit until March 22.The exhibition features two works by Ghosh’s three-dimensional rendition of Western architecture, “Kamala: The Veil of Architecture” (2015–16), in chronological order, and “Alberto Burri: The Veil of Art” (2016–17), a panoramic work by Ghosh that depicts a world in which architectural design has been displaced by technology. Ghosh’s work is included in the exhibition “Anup", "The next Biennial should be held in 2020. The museum’s next major re-creation will take place in 2021, and the museum will hold a major exhibition, “Heritage: An International History,” in 2022. The following year, the museum will host the first exhibition dedicated to the museum’s collection of early modern European art, “Early Modern Art at the Museo de Arte Contemporáneo,” in partnership with the Museum of Contemporary Art, Barcelona. The show will be organized as part of the museum’s ongoing projects to relaunch the museum’s collection and to create new exhibitions and programs.The modernist art of the Twentieth Century’s Art of the 20th Century Exhibition will also present an exhibition dedicated to the distinguished artists of the Twentieth Century through June. The exhibition will feature new works by twenty-nine artists whose practice is either contemporary or very recent. “The Twentieth Century’s Art of the 20th Century Exhibition will present a collection of works that embrace the art of the Twentieth Century,” said Carlos Ceixas, director of the Museo de Arte Contem", "The next Biennial should be staged in 2021. The Biennial is the largest event of its kind in the United States and is curated by the Los Angeles–based artist-run nonprofit, the Living Museum of Contemporary Art (L.A.M.A.), the nonprofit ArtsPlanet, and the nonprofit Theatre of Democracy. The exhibition will pit a panel of artists against each other in a series of collaborative projects that will culminate in a live performance and a performance, both of which will run concurrently.The 2019 edition of the Biennial featured the work of thirty-eight artists, including Peter Hujar (Mexico City), Markus Mendoza (New York), Marta Sabatinelli (Milan), and Randa Sitta (Caribbean village of Belo Horizonte, Brazil), as well as the work of artists such as Sadao Andujar, Tumelo Acosta, María Berrío, and Alex Durel. In contrast to the traditional biennial, the 2019 edition will feature two-hour performances of original works and will take place at the Los Angeles County Museum of Art (LACMA), a California museum that has exhibited the work of contemporary artists in its Los Angeles branch since 2015.The 2019", "The next Biennial should be held at a location outside of London, New York, or Geneva. The fifty-ninth edition of the Museum of Modern Art (MoMA) has released its new schedule, which will run for ten weeks in May 2018. The institution will open in May with the exhibition “The Fellowship of the City of London,” a selection of works by artists such as Evelyn Waugh, Louise Nevelson, and Jasper Johns, and will be closed until November 13.The Biennial will be organized as a series of performances by a select group of artists who are organizing themselves in cooperation with MoMA. Launched by art historian Jonathan Goldblatt, the group will stage the first performance, titled “Arthur Koestenbaum: The Late Night,” at MoMA in May. Upcoming performances include “Death of a Scientific Man” (May 29), “John F. Kennedy: The American President” (May 30), and “Alfred Slotkin: The Painter” (May 31).The second exhibition, “Feminine Action,” will be staged at the Museum of Modern Art in New York in June. The", "The next Biennial should focus on “The Future of Art and Technologies,” a lecture series that will address the role of technology in the twenty-first century, and “Art and Technology,” a conversation that will feature the work of artists and technologists.In a letter posted on the Frieze website, the company said that it is “concerned about the future of art and technology, which is at the core of the exhibition. We know that technology is here to stay, that it will continue to be a critical and powerful factor in the exhibition, and that it must evolve into a topic that engages our audience. The future of art and technology is at the centre of our vision and our work.”According to the Los Angeles Times, production at Frieze Los Angeles is slated to begin on March 3.\n\n\nThe Smithsonian American Art Museum (SAAM) in Washington, DC, is planning to phase out its annual exhibition “Slowdive: A Retrospective,” which has featured a collection of original Pop artworks since 2016, by early 2019, in favor of a “more contemporary show.” The move coincides with the reopening of the museum, which has been closed since", "The next Biennial should be held at the new campus at 1674 Pennsylvania Ave, designed by the same architect, in 2020.In a joint statement, the San Francisco Arts and Artists for Racial Justice (SFBAJ) and the Ku Klux Klan (KKK) wrote: “The new Museum of Modern Art is not only a cultural landmark of the Bay Area, but an important site for racial justice and a model for civic engagement. We are committed to championing the needs and aspirations of our communities and will continue to advocate for racial justice. We congratulate the city of San Francisco, the Mayor, and the Board of Supervisors on this important milestone. We encourage them to continue to work with the community and city of Oakland to build on the positive legacy of the museum.”\n\n\nThe public art project Tii—a public artwork that is installed in front of the Museums Museum, Tokyo, to help Japanese-American veterans return home—has become the subject of a legal complaint filed by a group of descendants of the deceased from Kern County, California, who are demanding that the project be halted. The complaint alleges that the work violates a law passed by the legislature in 2015 that prohibits the display of works that are “legally immaterial�", "The next Biennial should be set up as soon as possible, the organizers said; Tirana, Albania, has been scheduled for February 15–March 14. Caraalne Durk, a curator at the Museo de Arte de Barcelona, wrote on Facebook on March 3: “The two Biennials are the only channels through which we can connect to the contemporary world. The new biennial is the only thing that will give us the opportunity . . . to realize the work of our society in the twenty-first century.”\n\n\nThe Museum of the Fine Arts (MFA) in Boston, which announced last month that it is planning to close its doors and begin a phased sales and marketing program in April, has received a gift of $14 million from the estate of Alfred E. Smith, the MFA’s founder and longtime director. The gift includes four paintings by Smith’s wife, Madeline, as well as a selection of prints and photographs by Smith that will be auctioned at the MFA’s upcoming March fundraiser.“We are extremely grateful to Gary Smith, his family, and the thousands of supporters who have supported the MFA and the Smiths,” said", "The next Biennial should be held in 2021, and the first exhibition should open in 2022. The seventy-fifth Biennial will be held in 2021.The latest news on the redevelopment of Van Gogh’s birthplace is that the artist will be returning to the Netherlands and will begin construction on a new home in the city of Amsterdam that will house his art and the archives of the Van Gogh Museum. The new exhibition will be a continuation of the artist’s exploration of the meaning and the history of the Dutch language. The institution will also include a new works on paper.In an interview with Dutch daily newspaper De Standaard last week, van Gogh said that the exhibition will be a landmark in his artistic legacy. “After the exhibition, I want to go back to the Netherlands and start building a new life for my painting,” van Gogh said. He added that he hopes the exhibition will inspire other artists to do the same. The artist will also earn the museum’s eternal gratitude for the museum’s cooperation, for it helped him realize his dream of staging a major exhibition, an undertaking he describes as a “spectacular achievement.”\n\n\nThe Metropolitan Museum of Art in New York has appointed", "The next Biennial should take place in 2020. The Project, which is led by the Museum of Fine Arts (MHCA), Boston, is currently developing a new state of the art venue that will augment the museum’s existing collection of more than 5 million works. The venue will provide a full exhibition floor, a café, a lecture hall, and a museum-like environment that will provide visitors with additional opportunities to immerse themselves in the work of the collective. The project is funded through funds from the MCA’s “Committee for the Future of Art” and will be hosted at a cost of $65,000.Coinciding with the 2020 exhibition will be the fifteenth edition of the Fourteenth Biennial. Exhibitions will include the first comprehensive survey of Claude Monet’s work, “Planété: Biennial du Joueur” (2019), which curated by the Belgian collective the Witte de Vrouwen, and “Between Two Worlds: Artistic Touch and the Twenty-First Century” (2019), by the Shanghai-based collective MiG.In order to make the 2020 event contemporary and to reflect the diversity of artistic traditions in the United States, the M", "The next Biennial should take place in 2022.  The exhibition, titled The Power of a Moment, will be curated by Rory McAllister in conjunction with Vivian Gardner, Benedict Hoover, and Kirstin Schoelkopf. The event will run from March 21–March 22 and will showcase all works made in the United States between 1940 and 1941. The Biennial will also feature new exhibitions in the United States and Europe by artists who have been excluded from previous editions. The first edition, titled The Art of Joy, was held in London from March 15–March 17, 2019 and consisted of forty works, including eleven new commissions. The second edition, titled The Power of Mornings, was staged in New York from March 14–March 17, 2020 and consisted of seventy works. In the third edition, titled The Power of Dreams, curated by Adrienne Edwards, was staged in Los Angeles from March 16–March 19, 2020. The 2019 iteration featured seventy works and was curated by Daniel Libeskind and Elfriede Janssens. In the 2019 edition, the Biennial staged a total of 186 works.\n\n\nThe", "The next Biennial should take place in the United States, India, or the United Kingdom, and the developer has invited the public to submit other recommendations.\n\n\nThe Museum of Modern Art (MoMA) in New York has announced that it will no longer participate in the annual “Photoshop Show,” which has been held at the museum since 1992 and was organized by the Multidisciplinary Association for Photography (MASP), in 2020. The event featured over seventy artists and curated by the director, Rachel Cornejo.“I wanted to make a statement about the power of photography to change our lives and to challenge us to think about the world in new ways,” Cornejo said in a statement. “I also wanted to show that photography can be an incredibly powerful tool for social justice.”The decision to scrap the show was made in light of the ongoing coronavirus pandemic, which has already claimed the lives of forty-six people in the United States and has infected at least fifty-nine other countries, including China, Vietnam, and Cambodia. According to the New York Times, the coronavirus outbreak is leading the United States and Europe to consider reopening their borders and moving their residents to safety. However", "The next Biennial should take place in the spring of 2020, with the date to be set by the director of the museum. The committee was made up of Lemire, de Stijl, de Bruijn, de Bond, de Groot, Huyghe, and van der Kolk. \n\n\nThe Museum of Arts and Design (MAAD) in New York has appointed Jochen Baumann as its first director and chief curator of European art. He will take up the post on January 29.“As the executive director of the Museum of Arts and Design, Jochen has the opportunity and responsibility to shape MAAD’s future direction,” said Museum of Modern Art director Christopher Woolf. “His knowledge, passion, and ability for collaboration will make him a great fit for this role. His expertise and knowledge in the field of contemporary art make him the perfect person for this critical role of the museum.”Baumann comes to MAAD from the Metropolitan Museum of Art, where he has served as deputy director since 2015. During his tenure at the museum, he organized more than twenty-five exhibitions and organized several programming initiatives. In addition to his main curatorial role, he curated solo", "The next Biennial should come in 2022. Artist Salaam Ahmed has stated that the event will “break new ground in terms of presenting art from a non-western perspective.”\n\n\nThe United States Army Museum of Art (USAM) in Washington, DC, announced today that it is planning on shifting its 2019 edition from March to September, citing the pandemic as the reason. The institution also revealed that it will postpone the 2019 event, which will now take place September 10–September 14, by two months, and expects the September 12 event to draw an additional 25,000 visitors.The decision marks a significant departure from the institution’s usual schedule, which sees the March event taking place before the March exhibition calendar, and is a response to the ongoing disruption caused by the Covid-19 pandemic. The move comes on the heels of the institution’s announcement that it will postpone the 2020 edition, which will now take place September 16–September 18. USAM’s next exhibition, “The Body in Art,” will be held September 11–September 20, 2020.\n\n\nThe Museum of Contemporary Art (MoCA), New York, has appointed David Breslin as its new senior", "The next Biennial should take place in Dubai sometime in the third quarter of 2020. It will also host five more exhibitions in 2020, nine in 2021, and seventeen more in 2022. The seventh iteration of the Biennial will be held in Istanbul in December 2022. The 2017 edition, which was organized by the Bardo Museum in Milan and took place in the urban campus of the Museum of Modern Art, saw more than 1,500 people participate.\n\n\nThe Art Newspaper reports that the Los Angeles County Museum of Art (LACMA) has received a major gift of more than 350 works by eighty-six contemporary artists\u0097more than half of whom are set to be digitized. The museum is planning to stage a massive exhibition of works by the artists at the end of October, and has already committed to presenting eight exhibitions a year for the next two decades, beginning in 2020.“The museum has long been committed to digitizing its holdings to reflect the full range of artistic activity and has already digitized more than 1,100 works in the current year\u0097an unprecedented feat in museum history,” said museum director Michael Govan. The works were selected from a shortlist of eight artists\u0097Amy Davis, Lee Kasper,", "The next Biennial should be held within two years. \n\n\nThe Victorian Museum in London has welcomed a new member to its curatorial team, Todd Ahearn, who will be responsible for managing the exhibition program, curating the exhibition program, and developing the museum’s collection. Ahearn will begin his role in January 2020 and will be tasked with helping to make the exhibition “A Timeline of Evil,” which explores the history of the exhibition, the London 2012 film festival, and the museum’s own collection, as well as the institution’s relationship with the World Monuments Fund. “Todd is a bright, articulate, and committed leader who has created an exciting team with a great vision for the future,” said Director Martin Savant. “We are delighted to welcome him to the Victorian. His appointment marks a new chapter in the museum’s history as a leader in art, design, and design and culture.”Ahearn comes to the Victorian from the Centre Pompidou in Paris, where he has served as an honorary director since 2015. He has held various curatorial and exhibition-making positions at the Pompidou, including director of cur", "The next Biennial should focus on how the art of photography can be used to address timely social and environmental concerns, and how this might be achieved through a two-fold assignment, starting with a photography exhibition at the Museum of Contemporary Art, London in 2020 and continuing with a photography exhibition at the Biennial in 2021. The first event will take place in the autumn of 2020 and will comprise thirty-six photographs that address different themes and topics in a number of different ways. The second exhibition will take place in the spring of 2021 and will comprise seventy-four photographs that address different aspects of life itself as well as the life and death of a great survivor, Henri Cartier-Bresson.“No other institution has such extensive and diverse holdings of Henri Cartier-Bresson’s work,” said Valerie Lawrens, president of the National Gallery of Canada. “Leo Cartier-Bresson is a paradigm of photographic art, having created and led the first serious survey of the artist in the United States, and he has developed and expanded upon the photographic concept to encompass many different facets of life, from photography as a tool to photography as a system,” she added. “The next Biennial will", "The next Biennial should be held in 2020. The Museum of Contemporary Art (MoCA) in Los Angeles is currently planning a reopening in 2021. The last time the museum reopened was in 2010, after it was closed for twenty-four hours a day for twenty-four consecutive days.\n\n\nThe M Woods Museum at Columbia University has appointed Adam D. Cohen as its next director. Cohen will replace Alice Cooper, who died in 2016, at the end of her sixty-three-year tenure. Prior to joining M Woods in 1978, Cohen served as the museum’s deputy director and chief curator, from 1994 to 1999. He was also the founding curator and director of the contemporary art museum in Philadelphia.“I’m thrilled to welcome Adam, who has brought the M Woods Museum into the twenty-first century with a fresh outlook and an innovative strategy,” said director Frances Boyle. “His vision for the M Woods Museum reflects the inter-related priorities of the institution: to present an international collection of modern and contemporary art, with a strong and ambitious purpose, while ensuring that our staff and the public feel integral to the organization’s mission.”Cohen’s new role will be a companion to", "The next Biennial should be held sometime between May and July, with a specific theme of 'New Internationales’ emergence in the twentieth century. “The exhibition should be a reinterpretation of the work, as distinct from the current exhibition, of the contemporary artist, of the current exhibition model, or of the work of the artist, of the current exhibition, or of the recent exhibition,” said Koen de Bruijn, the Biennial’s artistic director. The first exhibition, titled “New Internationales: Selected from the Four World-Centuries,” was staged at the German Künstlerhaus in Berlin in 2008 and won the conference’s Hugo Boss Prize in 2009. \n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles has launched a new digital platform that will allow visitors to see the work of emerging and established artists. Called the Artist Feedback Hub, the platform will feature original artist videos and will allow visitors to create lists of artists they would like to see on the platform. The first exhibition of the platform will be “Artists on the Hub” in December. The full list of participating artists can be found here.The platform will also host live streaming events,", "The next Biennial should take place in the summer of 2020. The 2020 Biennial will be a collection of thirty artists and will be a joint undertaking of the BAM, the Museum of Contemporary Art and the Autobiography Foundation, which will run the entirety of the exhibition, curated by the artist-run group: BAM: Artists and their Works. The show will take place at the Museum of Contemporary Art in Chicago.\n\n\nAs the United States struggles to contain the coronavirus pandemic and prevent the spread of the virus in the country, the Metropolitan Museum of Art has announced that it is altering the curatorial program of its 2019 edition. The event, titled “Surprise Me,” was conceived as a way for the museum to introduce more contemporary work by the artist-run collective Young Turks. The show will now be curated by the Swedish curator Carina Lagerlund, who will work with artist Noma Dangote, and will take place at the Museum of Modern Art in New York.“Unfortunately, we are facing a challenge of an unprecedented magnitude,” said L. Rafael Valentino, the Met’s executive director, and vice president. “It is essential that the Met continue to be an", "The next Biennial should be held in the Beijing Art Museum in 2022, and the first one in the Shanghai Art Museum in 2021.Curator and researcher Dominique Boudreaux, president of the Louvre and the Louvre Taormina and a professor of art history and philosophy at the University of Paris, is a former director of the Institute of Modern Art in Paris’s Centre d’Art Moderne, which was merged with the Centre d’Art Contemporain (CAC). Boudreaux recently presented the first art exhibitions in the former CAC buildings, as well as the international lecture series “The Future of Modern Art” at the Louvre in 2017.“The second exhibition will be organized in the Shanghai Art Museum in 2022 and the third in the Museum of Modern Art in the former CAC building in 2021,” Milan-based artist-collector Marc-Olivier Renaud said in a statement. The exhibitions will combine photography, sculpture, video, and installation to explore the relationship between modern art and the modern world.The Shanghai Biennial will also feature twelve works by artists whose works will be presented by three different institutions: the Shanghai Museum of Art, the Shanghai Institute of Art", "The next Biennial should be held in 2025.\n\n\nThousands of people took part in the fourth edition of the Detroit Art Museum’s (DAM) Blackout on Wednesday, August 27. The event, titled “The Future Is Black,” drew an estimated 75,000 visitors to Detroit, which is experiencing a resurgence in popularity after years of decline. The event, which also featured a virtual reality installation and a performance by William Shakespeare, drew an additional 15,000 people for a live performance at the Detroit Institute of Arts (DIA), which is currently undergoing a $50 million renovation. The event was organized by the Detroit-based nonprofit the Coalition for a Better Future, which works with local, regional, and national arts groups to support social change.“This is an unprecedented situation, but it is possible that this is the beginning of the end for the Detroit Institute of Arts,” said David Steed, chair of the museum’s board of trustees. “After a decade of hard work and a lot of tears, we are proud to present our new and enhanced vision for the state of our institution.”The redesigned museum features a new 250,000-square-foot building that celebrates the museum’", "The next Biennial should be held at least twice a year. More information about the new program is available on the Frieze website. Billionaire collector William Gibson, who served as director of the Centre for the Study of Art and Architecture at the University of Chicago for twenty-six years, died earlier this week at the age of eighty. Pilar Balfour, director of the Center for Contemporary Art at the University of Liverpool, England, was promoted from the chair of the European department to lead the inaugural event.“William Gibson was a brilliant, brilliant mind,” Pilar Balfour said in a statement. “He was proud of what he had accomplished as director and was immensely proud of the work he had put in to bring it to fruition. His legacy will live on in the many exhibitions and collections he designed and curated. His passion for art and his ability to work with artists, collectors, and institutions to make the most of their talents and his incredible understanding of how the world works make him a superb boss.”Frieze, which announced its partnership with the Frieze Organizing Committee in March, said that Gibson’s vision for a biennial was forged during a time when most large-", "The next Biennial should be in 2020, and the next edition in 2021. The Art Newspaper had earlier reported that the 2016 event had been postponed until March, but the museum has since clarified that it will now be staged from June 22 to June 24, 2020.\n\n\nThe Pérez Art Museum Miami (PAMM) has received a gift of 220 works by thirty-six artists, including Laureat du Palais, Alice Black, Alice Wiener, Demian Diné, Marc-Antoine Fleury, Walter de Maria, and Carlos-Jose Otero. The donation was made by Adriano Martínez, chairman of the Pérez Art Museum Miami, and the Miami-based artists]Maximilian and Mia.’s family, who are longtime patrons of the institution.“We are extremely grateful to the Pérez family for this extraordinary gift,” said PAMM director Elizabeth A. Olszewski. “We are eager to present these works to our Miami neighborhood, and to begin the journey to the collection.”PAMM is currently home to twenty-two works by thirty-six artists, including one by Adriano Boesky, a Brazilian surrealist, and", "The next Biennial should be upon the monument of the founder of the company, Henry David, who purchased the site in 1931. The sculpture by the artist Nari Ward will then inaugurate the new exhibition.Ward will create a new work, titled Future Present, that will take the form of a house, complete with a garden, and will be inaugurated at the museum in 2020. The work will be a collaborative project between the artist, the architects, and the South Korean artist Kang Seo-kyung. The artist will be commissioned to create the work, which will be created from a combination of clay, acrylic, and plaster, by Kang, and will be presented in a retrospective titled The most beautiful place on earth. Kang and Nari Ward have partnered up again to create a Biennale in the Park. The project will include ten artists, including Hong Kong, Hong Kong, Chinese, and Japanese, and will be unveiled at the Park in April. Kang and Nari Ward will collaborate again with Kim Kappam, the senior curator of contemporary art at the Museum of Modern Art, New York, in 2020. A selection of works by these artists, as well as a selection of works by Korean", "The next Biennial should be held in the spring of 2020. The 2018, and 2019 editions were canceled due to the Covid-19 pandemic, but the 2019 event was rescheduled for the first weekend of April, and the 2020 edition will take place in April 2022.A new exhibition organized by the San Francisco Museum of Modern Art (SFMoMA) will mark the museum’s return to the Bay Area in the spring of 2022. Presented by the Marineland Foundation and curated by Stephen Hahn, the \"Bay Area Retrospective\" will include works by thirty-three artists, including Hairy Hands, Michael Toffoli, and Henry Taylor.\n\nArchitects Bojana Dziewior and Kjetil Jankowski, the founders of the architecture and design studio Zilina, have announced that they will leave their firm to form a new organization dedicated to the promotion of women’s leadership in the creative arts. The organization will be led by an existing board of directors, consisting of Kjetil Jankowski and Lana D. Harris, and will be headed by Bojana Dziewior. “The thought of a woman in the highest position in the creative arts", "The next Biennial should be held in the spring of 2020. The next edition, which will be hosted by the Museo Nacional Centro de Cultura, will take place in the autumn of 2020. The museum is currently working on a new design for the exhibition, which will integrate the Dholkar Collection with the work of other contemporary Native American artists.Kelsey Rind, the curator of contemporary Native American art and a former curator of the Smithsonian American Art Museum, said: “The new museum will be an authentic and vibrant reflection of the Dholkar Collection, highlighting the work of outstanding artists in both the Northern and Southern Americas. It will also include personal experiences and be a place where people can come together to share ideas and experiences.”\n\n\nThe French court has upheld the conviction of artist Michael Peiffer for the destruction of a nineteenth-century work by the American artist Norman Rockwell, who made his iconic nude women in bed adornments in his fantasy world of a series of bullet points on the canvas, according to the New York Times. Peiffer was convicted of three misdemeanor counts of criminal damage in May and was given a suspended jail sentence of three years and three months in July, but his conviction", "The next Biennial should receive a $30,000 check from the state. If the money is used to fund the opening of a biennial of the artist’s works, the institution will be required to turn over the copyright portfolio of the work to the museum.If the institution was to move forward with the installation of the work, the federal government would not support the move. “We will not allow a single cent of state and local tax dollars to fund Tate’s controversial and politically motivated exhibitions,” said Eliot Spitz, a senior academic fellow at the Art Gallery of Ontario and a former chief of staff at the Privy Council Office of the Arts. “Tate’s actions have damaged the reputation of vulnerable artists and have made them less likely to participate in future years. We will not allow this.” The institution is also planning to move the exhibition from its current home at the Museum of Contemporary Art (MoCA), which is slated to reopen this fall, to a new location in the city. The Biennial of Visual Arts will now be housed in the newly opened Museum of Contemporary Art Toronto.\n\n\nA new law that aims to curb the spread of Covid-19—which attacks the US", "The next Biennial should be in 2020. \n\n\nThe London-based nonprofit Artnet reports that the Museum of Contemporary Art (MCA), which was forced to cancel the upcoming edition of its London-based fair after it received a threatening letter from the Royal Shakespeare Company, has received a donation of $25,000 from the Alexandra and Edwidge D’Saras Foundation. The donation comes in the wake of the charity’s work supporting artists and institutions that have a significant legacy of the Tudor royal family.“The charity was delighted to confirm that the royal family and the charity have been a big supporter of the museum, and that works in the Tate’s collection are and are being made in honor of the Diana and Terry Duke Collection, which represent an incredible variety of artistic and historical work,” said Katherine McAleese, the foundation’s director.The donation was made in memory of the Diana and Terry Duke Collection, a collection that includes Olympic Games, the Twelfth Night, and Henry V, as well as works from Edward Hopper, Robert Louis Stevenson, and Mark Leckey. The organization is asking for the public to join them", "The next Biennial should be held in 2020 and will be hosted at the Museum of Contemporary Art (MCA), Los Angeles, the Los Angeles County Museum of Art, and the Los Angeles County Museum of Art, among other museums.“The biennial will be a collaborative effort of MCA staff and the artists who have worked with the museum to reflect on their experiences and to reflect on their future plans,” said Jeff Rosen, director and CEO of MCA. “With the current state of our world, with so many untapped opportunities for artistic expression, we are eager to engage with the content of the biennial in order to develop new and exciting ways for our artists to experience the museum’s collections and our exhibitions.”The upcoming exhibition “The Dream of a Deserted Garden: Sculpture in the Desert in Egypt” will feature work by twenty-three Egyptian artists whose work was discovered and excavated in the Giza plateau and will inaugurate “The Desert Experience: Egypt in the 1980s” at MCA in September.\n\n\nThe Museum of Chinese in Europe (MCA) in Frankfurt, Germany, has welcomed Chinese artist and curator Fung Xiaochao to its Berlin team. The first", "The next Biennial should take place in 2021. \n\n\nThe American Alliance of Museums (AAMD) announced today that it is launching an initiative to encourage more museums to collaborate with the exhibitions and research projects of other institutions. The initiative, dubbed the #MuseumTrip, will allow participating museums to submit 140-day itineraries to exhibitions. The submissions will then be reviewed by experts appointed by the curators of the selected exhibitions and will be the basis for future programming.The initiative is part of the new National Museum of African Art (NMNA), which is being built to serve as the flagship museum of the United States for more than three decades. The new facility will launch in 2021 and will draw more than two hundred thousand visitors per year.“This is the moment,” said David Shulgin, the president and CEO of the AAMD. “We are at the crossroads of history and our future, and the future belongs to the art of the American South.”The tour will be organized as a series of parallel experiences, beginning with a tour of the museum’s collection galleries and exploring the history of African art and the influence of African art on American art. The second part of the trip will consist of", "The next Biennial should take place at a location that will provide environmentally friendly, crowd-safe, and reconfigurable exhibition spaces, such as the Museums Toolbox, the Museum of Contemporary Art, and the Portico in the city of Barcelona. The 2018 edition of the event was held at the Universitat de Valencia. The 2020 edition will take place at the Universitat de São Paulo. “The new exhibition space of the University of Southampton will be transformative for the local community and will provide space for the collection, display, and research of a wide range of art and design,” said Mr. Derega.\n\n\nThe National Galleries of Scotland has announced that the twenty-second edition of the National Galleries of Scotland (NGA) will be held at Edinburgh Castle on September 24–September 26. The event will be followed by a tour of the grounds and culminate with an exhibition of the artist’s work.NGA’s twenty-fourth and twenty-fifth editions were held at the National Gallery of Art in London and the National Museum of Scotland in Edinburgh. NGA’s mid-year event, “Art, Architecture, Landscapes,”", "The next Biennial should be held soon, and the first exhibition will be staged in 2021.\n\n\nThe National Museum of Scotland announced today that it is planning to rework its collections in an effort to improve the visual appearance and feel of its buildings. The institution’s new website and digital platforms will incorporate a new kind of resource, called a Resource Kit, which will include a range of essential items, such as paint, paper, ink, and a compass.The kit will be delivered by a team of curators, architects, engineers, and designers working in partnership with the Scottish National Heritage Trust (SNH); the National Art Museum Glasgow (NAMA), the National Art Gallery London (NGL), and the National Museum of Scotland. In collaboration with artist Simon Rice, the kit will be made of 180,000 materials, including polyester, nylon, and rayon, and will be assembled in a building in Glasgow and will open in 2020.The National Gallery Scotland’s new website, which was designed by Konrad Carey, featured a collection of paintings by John Add, Hans Christian Andersen, and Anna Atkins. The exhibition included work by artists such as Charles Atkins, Walter de Maria, and Anezka Al-Sawant.", "The next Biennial should take place in the city. The institution aims to present a new exhibition, called “Biennial of Modern Life,” in the city every three years, in the fall, and in the spring, respectively. The first show, titled “Art in the City,” will open at the Anais Biennale in Rome on October 21 and will focus on the city’s art museums and gardens. The second show, titled “Piero Manzoni: Spiritu,” will be on display in the Museo de Arte Contemporanea di Stampa in the city from November 28 to December 5, 2020 and will be organized in collaboration with the architect and curator Piero Manzoni.The 2019 edition of Biennale, titled “The Future Is Present,” featured work by thirty artists including Junya Ishigami, Mami Lauda, Jennifer Lopez, and Haim Steinbach. In the upcoming exhibition, titled “Suspension of the Heart,” the artists will provide various materials and visual expressions of their bodies and their bodies’ movements in order to communicate their spiritual and physical states.\n\n\nThe Royal Academy of Arts (RA)", "The next Biennial should take place sometime in the 2020s. Attention will now be focused on how to add new works to the exhibition. ' The Contemporary: A Retrospective , 2018, is a ​project that introduces​modernism and the contemporary in a contemporary way, blending new discoveries and new ways of looking at art,” said Jean-François Auger, director of the Biennial. The selection of works for the exhibition was organized by an organization comprising Jean-François Auger, Marta Benoît Alves, Carsten Schössart, and Daniel Schäfer. “I’m really excited to collaborate with Jean-François and Carsten again, in this collaborative project ,” said Lars Bächli, the exhibition’s curator, who also serves as director of the Hirshhorn Museum and Sculpture Garden in Washington, DC. The exhibition will center around the life and work of the artist-in-residence, artist-manager, author, and director, Tandu Karuna. Karuna, who has lived in New Delhi for forty years, has since started a family", "The next Biennial should aim to create a new dialogue between the museum and the surrounding local communities, thus becoming a project-based platform for policy-making and discussion focused on sustainable living. The initiative will also explore how direct engagement with the discursive practices of artists can help to create new understandings of cultural identity, addresses issues related to cultural diversity, and addresses the growing recognition that cultural identity is a construct.The 2019 edition, titled “Beyond Borders,” will run through December 31. UPDATE: The twenty-third edition of the Ann-Juliet Biennial, “Beyond the Sea,” will run from March 17 to March 20.\n\n\nThe Museum of the City of New York (MoCA) in New York City is planning to move the exhibition space Next Century from its current home on Tenth Avenue to the city’s Lower East Side. The move will allow the museum to double its exhibition space, which is currently occupied by the contemporary art museum Doris Duke Gallery, and expand the museum’s collection by adding new works by artists and a chance to present works by those artists.The museum said the move will create a “new Public/Private Partnership for Public Art,” and that", "The next Biennial should be held at the New Museum in New York in 2021, and a film version of the exhibition should be staged at the Scotiabank Center in Halifax, Nova Scotia, in 2022. The 2019 edition of the event was staged at the Scotiabank Center in Toronto, and the Scotiabank Center has yet to announce any plans to stage a film version of “Photography” at the institution.\n\n\nThe Museum of the City of New York (MoCA) has announced that it is increasing the pay of its top executives by 20 percent in an attempt to increase the financial rewards for museum employees who help improve the museum’s financial health.“The board decided to increase the compensation of Chief Executive Officer Daniel H. Weiss and his senior staff by 15 and 19 percent, respectively, in an effort to increase the museum’s financial health and performance,” said MoCA director Sophie Scott. “The board also wanted to take additional pay away from some of our highest-paid executives, and Daniel and I spoke at length about potential career-altering changes, including the possibility of demoting or eliminating these individuals from leadership positions.”When asked about the compensation", "The next Biennial should be held in the autumn of 2020, and will be presented by Guggenheim Partners. Its theme, “Art for the Future,” will focus on the experiences and ideas generated by years of exhibitions in the Greater Venice area, as well as on how art can be one of the catalysts for social change.The Venice Architecture Biennial will also have a new location, will be expanded, and will introduce new programming. The design of the museum was developed by the architects  and the city of Venice, and is assembled in partnership with the Museo d’Arte Moderna di Siena (MAS), which is housed in the Alighieri Museum in the city of Siena, Italy. The Milan-made building, which currently houses the museum, the Museo e Poggio in the historic city of Poggio, and a number of other buildings, including the museum itself, is financed by the [Vizio Art Museum] and the Government of Milan. The building is being financed by the Guggenheim Foundation and the Italian State, with the support of the Government of Venice.\n\n\nThe California African American Museum (CAAM), which was founded by a group of", "The next Biennial should focus on “the evolution of the museum’s collection, exhibitions, and programs in relation to contemporary culture,” said Art in Pinchuk Art and Culture director Marie Tausch. \n\n\nThe Metropolitan Museum of Art (MoMA) in New York has launched a new initiative to support artists and small arts organizations in need of financial assistance. The MFA NYC Fund, which will provide artists and arts professionals with one-time grants of up to $50,000 in support of their exhibitions and production needs, will launch on July 2 and run through August 24. “This is an unprecedented crisis for us as an institution, but a necessity for the future,” said museum director Daniel H. Weiss. “Allegheny Artists’ Fund is an unprecedented intervention into the lives and work of artists. In addition to supporting the artists who are most in need of support, we hope this initiative will help them to consider the possibility of making creative contributions to the Met.”The fund is being organized by the museum to help artists and small arts organizations during the Covid-19 pandemic. According to the New York Times, the number of individuals affected by Covid-19 across", "The next Biennial should be held in late September, in the autumn, and will be financed by the government of the Republic of Finland, the University of Helsinki, and the University of Tartu.The Helsinki Architecture Biennial, which was announced in 2008 and had its inaugural event at the city’s Kiasma Museum in June, has drawn a total of twenty-four artists to the city of Helsinki. It aims to commemorate the centenary of the founding of the Finnish state in 1921 and to celebrate the city’s cultural legacy through a series of exhibitions, lectures, workshops, and other programs.The theme of the upcoming event is “What is art,” a question posed by artist and philosopher ĜJukka Salomäki Šyttelius to the biennial’s executive director Tuula Melkutainen. Salomäki Šyttelius also suggested that the term “art’ should be used as a general concept and not in a limited way. The real meaning of art is in its relationship to one’s surroundings, to one’s environment, and to the natural environment.”\n\n\nThe Smithsonian American Art Museum (SAM) in Washington", "The next Biennial should be held in 2021. \n\nOn Saturday, a small group of artists, including Mike Kelley, Carlos Rodríguez, and Zoya Seddon, staged a protest against the exhibition that was attended by several thousand people. They said that the new works were insufficiently challenging the history of the exhibition and that the new works were not connected to the original works by the artists who created them.“We are deeply concerned by the exhibition’s new materials and the exhibition’s misleading statement that they are a continuation of the works originally exhibited in the exhibition,” said Valentin Fleck, cofounder and chief of the biennial. “This exhibition is a rebranding of the exhibition and a new stage for the artists, and we hope that this new exhibition will have an open and accessible point of view.” The artists said that the new works make the work of the original artists appear less important and that the exhibition is moving away from the connotations of the themes and the history of the exhibition.Evidently, the minds of many are not capable of such serious reflection. For the artist-producers who staged the protest, the exhibition did not address their concerns but merely transferred them", "The next Biennial should be held in 2020.\n\n\nThe Philip Johnson Foundation, the Los Angeles–based organization that supports the civil rights, criminal justice, and environmental justice movements, announced today that it has received $6.5 million in support of its work to advance diversity, inclusion, and justice through the arts. The nearly $6 million awarded by the foundation—which was founded by Johnson in 1983 to serve as the vehicle for of the artist’s work—is the largest single gift in its history. Called the Philip Johnson Initiative for the Arts (PIJA), the grantees were selected by an open call process overseen by Helen G. Johnson, the foundation’s board chair, and William Q. Harrison, the foundation’s executive director. The philip jonathan foundation will receive $2.5 million; the philip jonathan foundation for the arts will receive $3 million; and the philip jonathan foundation for the humanities, the humanities, and education will receive $3 million. The foundation will establish a new $500,000 fund for the arts in 2018.The philip jonathan foundation for the arts will receive a total of $5.5 million", "The next Biennial should commission an artist whose work embodies a core of revolutionary ideas, one whose life-concepts transcendsthe history of the body and our own contemporary culture. One who has had a transformative impact on the art and artmaking of tomorrow. This year we look forward to showcasing work by artists whose work engages the current political moment in questions of culture and faith.”\n\n\nThe Israeli government approved construction in the area of the Old City of Jerusalem marked by the Al-Aqsa Mosque in Jerusalem’s Old City on Wednesday, as part of a massive $8 billion expansion of the area. The plan includes the construction of eighteen new housing units, as well as a museum, a supermarket, and a waterpark, as part of an effort to make Al-Aqsa Mosque, which is located in the northern part of the city, more accessible to pedestrians.“The government’s decision to move ahead with the construction of this large-scale project in the near future demonstrates that the government truly understands the importance of the Al-Aqsa Mosque,” Mayor Nir Barkat said. “This is the first time that this type of project has been approved by the city council in over twenty years, and", "The next Biennial should be held in New York in 2022.  I have always been fascinated by the work of early modernist artists such as Robert Rauschenberg, Ingres, and G. M. Pei. It is my goal to make the Art of the Past accessible to the general public and to spend time and energy to bring contemporary art practices to the fore.\n\n\nThe Palo Alto Museum of Art (Palo Alto) has appointed Alex Endres, who previously served as director of the Oregon Art Museum in Portland, as its next director. Endres arrives at the institution from the Los Angeles County Museum of Art (LACMA), where he has served as interim director since March 2018.“Alex is a visionary leader whose leadership qualities and ability to build strong relationships with communities make him a strong fit for this important role,” said Mark Spence, the institution’s board president. “His background as a curator, architect, and educator lends his expertise and vision to our contemporary practice, and we look forward to working with him.”A scholar of postwar American art and American art history, Endres previously served as chief curator of the Los Angeles County Museum of Art (LACMA) and director of", "The next Biennial should take place in the fall of 2020. The exhibition will feature work by thirty-six artists, including Nari Ward, Kate Adrian, Hernán Díaz, and Daniel José Older, and will return to the city of Santiago from December 6 to December 9, 2020. The collection will be organized in the same way that the London-based Festival of London, which is supported by Somerset House, is: through partnerships between museums and the city and will focus on the history and current affairs of the city. The exhibition will also feature art from the exhibition “Feminine” (2017–18), “Theater of Operations: History in Cinema” (2017–18), “ROBERT KENNEDY” (2017–18), and “A TALE OF TWO MOUNTAINS” (2017–18).The twenty-four artists who will be represented by the museum are:Central Laundromat Collective (Puerto Rico), Amor Cadena (Mexico City), El Lissitzky (Russia), Daphne Atget (France), Nikita Boesky (Germany), Max Conte (Italy), Tacita Benite", "The next Biennial should take place in 2022.\n\n\nNew York City’s Metropolitan Museum of Art (MoCA), which recently finalized its long-awaited redesign and opened in 2017, is preparing to welcome visitors once again with a new exhibition, “Talking About” (subjects TBA), that will highlight the work of contemporary artists in the city. The exhibit, which was inspired by a recent retrospective of working-class black artists at the museum, will include discussions with figures such as Tanya Bonakdar, Miyoko Boru, and Kiki Smith; and will be staged on the first floor of the museum.“We are delighted that the Met can once again present a show that reflects the rich diversity of American artists and their incredible inventiveness,” said William Langston, the museum’s director. The museum will be inaugurated by a new collection of art made by artists such as Frederic Bush, Jean-Michel Basquiat, and Pierre-Auguste Renoir, and will serve as a platform for the Metropolitan Museum of Art’s first exhibition devoted to American photography, “The American Photo,” which will open in 2020. It will also boast forty exhibitions organized by national and national", "The next Biennial should take place somewhere in the Americas. Its creators are hard at work on a new version of the exhibition, which will be a retrospective of the last five years in Santa Fe, New Mexico. Adam Patten, director of the Museum of Contemporary Art, Los Angeles, told the New York Times that the new exhibition will incorporate the work of some 500 artists and will be held at an undisclosed location. The next edition of the Biennial will take place sometime between October 28 and November 20.\n\n\nThe Safeway Museum of Art in Santa Ana, California, has announced that it has received a gift of twenty-one works by thirty-six contemporary artists from the collection of the San Francisco Museum of Modern Art (SFMoMA). The works, which are currently on display at the institution, will form part of a new free exhibition, “Between the Sun and the Moon,” that will open on November 4. The show, which is organized by artist Douglas Gordon and will be presented by the museum, will feature works by seventy-six artists from twenty-two countries.“We are thrilled that this year’s issue of Beyond the Sun and the Moon will include works by thirty-six artists who are making crucial", "The next Biennial should focus on the theme of 'Ethical Behavior’s Presence and Absence: The American Experience, 1916–1939’s CEBR,” said Rebecca Butler, chair of the exhibition’s creative committee. “The exhibition will follow a series of conversations with artists, activists, historians, and scholars, and will examine the position of art in the world today, and examine how art can be a vehicle for social change and a tool for the promotion of social justice.”The biennial will run from September 13 to September 20.\n\n\nConstruction marks for the new headquarters of the Museum of Contemporary Art (MoCA) in Boston have been made. The museum, which will rechristen the Center for Jewish Art after the Holocaust in order to honor the 150,000 Holocaust survivors who were deported to Auschwitz, was awarded a $3 million grant from the Doris Duke Charitable Foundation on March 29. The grant also includes $900,000 for the construction of a new building and $400,000 for the renovation of the existing building.The gift comes after Artnet reported that the foundation provided $6.8 million to MoCA as part of a $12 million package that addressed racial justice, human", "The next Biennial should open in 2022 and will be hosted at the same venue at which the current exhibition, “Ajax: The Art of Flight,” will open in 2021. The show will include a retrospective of the work of artist Hannes Scheffer and will run for two weeks. The opening of the exhibition was postponed due to the Covid-19 pandemic and the fourth edition of the festival, “Borja Holst’s ‘Ajax: The Art of Flight” will be staged simultaneously. The biennial will also include an exhibition of works by twenty-six artists participating in the ongoing exhibition, “30 Years of Biennial.”  The event will be inaugurated by a lecture by artist Alexander Korotkov, director of the Museum of Modern Art, and will run until November 29.\n\n\nThe Metropolitan Museum of Art in New York has announced that it will no longer contract Los Angeles’s Museum of Contemporary Art (LA MoCA) to build an additional fifth-floor museum space on its campus, effective immediately. The announcement follows the departure of director Klaus F. Kraus and chief curator of Contemporary Art Rob Spalter, who were hired to lead the institution through", "The next Biennial should take place in 2020.\n\n\nThe organization that oversees the exhibition space The Museum of Contemporary Art (MoCA), which has been closed since 2016, has released a statement regarding the allegations that have been made against Institution Contemporary Art, Inc., the parent company of Art Basel and the London and New York art world.The statement reads:“The Museum’s Board of Directors and I are deeply concerned by the allegations being raised in a new report published by Artnet and The Art Newspaper alleging past misconduct by American artist Billie Tsien, who was appointed to the board of the prestigious nonprofit organization in 2019. We take these allegations very seriously and have attempted to address them through the Board of Trustees nominating a new chairman.However, the Board of Trustees have made it clear that they do not believe that a change of leadership is in the best interests of the museum or the board of trustees. Therefore, we have decided that it is best for Billie to step down from her position as chair of the board of the institution until a new chairman can be appointed. Billie will be replaced by two members of the board, Richard Rowland and Oskar Eustis.“In a statement issued on Friday", "The next Biennial should be held in 2020. One hundred and twenty-six artists have signed an open letter supporting the 2022 iteration of the event, which has been in crisis since it was founded in 2006. The letter states that the 2019 event was the best-attended and most comprehensive of the eight editions. The letter concludes: “The country of Kuwait’s National Arts Festival is the only fair that has survived the crisis. It is in the spirit of the artist-driven festival that it will continue to present its most prestigious event.” \n\n\nThe National Endowment for the Arts (NEA) has released new guidelines for how museums should respond to the coronavirus pandemic. The publication, titled “Museums and Coronavirus,” outlines a comprehensive “first responder” strategy that should be followed by institutions as they try to contain the virus and prevent the spread of Covid-19.According to the guidelines, “museums and non-museums shall have personal protective equipment (PPE) in place designed to prevent the spread of Covid-19, and shall implement appropriate disinfection and health promotion practices,” including limiting outdoor activities, limiting travel", "The next Biennial should be held in 2018. The next World Science Festival should be staged sometime in 2020. The next Bilderberg should take place in 2021. The next Venice Biennale should be held in 2023. The next MOSAD should be held in 2021. The next G20 Summit should take place in 2020. The next Venice Architecture Biennial will be held in 2021.While the theme of the upcoming edition of the Venice Architecture Biennale will not be revealed until the event, the organizers have already declared that the theme of the exhibition will be “The Future We Want.” The exhibition will also be themed “Art and Life in the Age of Mechanical Reproduction” and will include works by twelve artists, including Pierre-Auguste Renoir, David Goldblatt, Adriana Häjstic, Jean-François Auger, and Raj Giri.The full list of participating artists is as follows:Alexander Calder, AustraliaAnderson Cooper, USABenedict Williams, USABirgit Deutsch, AustriaCarmen Karr, USAChang Eui-kyeo, South KoreaChen Guang-Kai, ChinaChen", "The next Biennial should be held at the Museum of Modern Art, New York, in 2021. Recent prizes awarded to artists include the James C. Grant Award for Outstanding Artistic Achievement (2016), which was presented by the City of New York and the Metropolitan Museum of Art, and the 2019 Joan Mitchell Prize for Outstanding Social Work.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has received a $10 million donation from the Ebony and Ashmole Museum of Art in Birmingham, Alabama, and the Art Society of the Holy Cross in Worcester, Massachusetts. The donation will allow the museum to open its new, modernized and expanded African American Museum in the fall of 2020. The move will also allow MoMA to move its collection of more than four hundred works from its current home on Pennsylvania Avenue to a more convenient location across the hall from the museum, which will now boast an additional wing and seven galleries.“We are thrilled to open the new African American Museum with this significant gift from the Met,” said museum director Timothy Rub was named director of the museum. “Founded in 2016 with a $6 million donation from the Museum of Modern Art, the museum has made enormous progress in rebuilding", "The next Biennial should be staged in July 2021. According to the London Book Fair website, the exhibition will be hosted by the Tate, the National Shakespeare Company, and the National Galleries of Scotland and will be preceded by “Son of a Goddess,” a new sculpture and performance series by an eight-person collaborative team created by the artists.\n\n\nCleveland Museum of Art (CMA) director Doris Duke announced this morning that the museum will not organize a biennial of the French avant-garde in the United States. Duke made the announcement in an email to staff, which was sent to them by Michael Wright, the president of the Cleveland Museum of Art, on March 21. “I wanted to address some of the recent developments and the broader implications of the recent events that have occurred around the world,” Duke wrote. “It is important to understand that this decision came not from me but from Michael and his team, and was made in the context of our long-standing agreement that this works and exhibitions would be presented in a biennial context.”In a letter dated March 24, Duke wrote: “This is a challenging time for many cultural institutions. We have tried hard to", "The next Biennial should be held in 2022.\n\n\nThe Berlin Art Museum (BAM) in the German city of Hannover has received a major gift of more than 2,500 works from the Los Angeles–based collector and philanthropist Kenneth Owens. The institution has named Mark Ruffalo a senior curator in its department of contemporary art. Ruffalo, who is also the founder of Ruffalo Art Gallery in the Los Angeles area, will assume his responsibilities in January 2022 and will begin in his new role in April 2022.“This gift has transformed my life and continues to shape the future direction of the museum,” said Owens. “The museum’s collection, which is comprised of more than one hundred centuries of art from the American collection, is one of the collection’s most important assets. It has been my goal for years to create a new and unique platform for the collection, and, as a result, to develop exhibitions and programs that would be part of the future. I credit Mark Ruffalo with helping me realize that vision.”Inaugurating the new gallery, which will be built in the former Mecosta State Prison complex, the museum will host its first exhibition of work by American artist Richard Aved", "The next Biennial should commence in the fall of 2020. The project will introduce a new series of exhibitions devoted to women artists, a new story-collection, and a new project. The show will include exciting exhibitions that are being curated by artists from its sister institution, the Wyss Institute for Arts in New York, and will be organized at a new location in the city.The biennial is part of a broader initiative spearheaded by the Wyss Institute to expand the opportunities for women artists to participate in major contemporary art institutions. The inaugural exhibition, “Art of Life,” will run from March 25 to April 14 and will present work by eighty artists from twenty-eight countries. Next year’s exhibition, “The Daughters of Men,” will take place from March 31 to March 33 and the London-based art center will also host an exhibition of work by fifteen women artists in the fall of 2020. During the inaugural event, the Wyss Institute will feature work by eighty artists, which will be curated by artists from sixteen countries.To mark the occasion, the Wyss Institute will present a new exhibition of works by the Mies van der Rohe, Opus Max, and Pierre-Auguste Renoir. The second exhibition", "The next Biennial should be held in Beijing in 2020. The pavilion will be inaugurated by a series of exhibitions and concerts, including an exhibition of works by the artist Ai Weiwei. The twenty-fifth edition of the fair will be held in Beijing in 2021. \n\n\nThe Museum of Art (MoA) in New York has appointed Walter De Maria as its next director. De Maria currently serves as the curator of contemporary art at the institution. He succeeds Sharon Stone, who has led the museum for twenty-five years, and will take the helm from Cynthia McPherson, who retired in November.“It is truly an honor to succeed Sharon Stone as director of MoA,” De Maria said in a statement. “The museum is changing rapidly, and I’m excited to lead MoA as it continues to grow and evolve. I’m confident that we can continue to create and present engaging exhibitions and educational experiences while maintaining a strong and dedicated staff to support our ever-evolving collection and curatorial practice.”Stone has helmed the museum for twenty-six years and is responsible for shaping the institution’s exhibition program and for spearheading the museum’s expansion into a public space", "The next Biennial should attempt to address the vast array of artistic practice, both contemporary and pre-Modern, in North America. Its publication date is June 5–June 6, 2020.\n\n\nAn eight-foot-tall bronze statue of Elizabeth I, the mother of England and Scotland, sits in the St. Andrews Arms in Glasgow. Known as the Queen Elizabeth II Memorial Statue, the work, which was installed in memory of the queen, was commissioned by the House of Lords and represents the culmination of a decade of research into the monarch.The research began in 2013, when the sculptors, led by London-based artist Mike Holt, embarked on a campaign to raise £125,000 for the monument, which will stand alongside Elizabeth II in central London, the Scottish city of Aberdeenshire, and the English city of Leicester, as part of a major public art project.Holt told the Literary Mercenary that the work has been in the works for over a decade and that the project began as a way of reflecting on the legacy of the monarch, a fact he described as “essential.” “As a child growing up in the 1980s I was fascinated by the monarch and her image,” he said. “", "The next Biennial should focus on the European Wave, a group exhibition which will open in 2020 and will include new works by Rodolphe Bénétié, Zoya, Giovanni Beccaria, and a selection of works from the late Oskar Eustis’s collection.“This series is meant to be a platform for the exploration of the structures and movements of art,” said Paul Mpagi Sepuya, director of the Biennial. “One of the great strengths of the Biennial is that we are able to present works at a time, a place, and a moment that is relevant and important to our time. We are moving into a new chapter with this exhibition, and I am optimistic that it will provide a new canvas for our Art History students.”\n\n\nThe São Paulo Museum of Art (SPMA) in Brazil has received a gift of more than 450 works by the Brazilian writer Paulo de Souza, a professor of literature and history of art at the University of São Paulo, from the multi-ethnic, multi-racial, and multi-lingual community in the city of Manaus. The sculpture, which was given to the institution by a man named Eduardo Rodrig", "The next Biennial should begin in 2020.  The exhibition will be hosted by the Bankhaus in Berlin and will be held in conjunction with the upcoming Art Brussels and will run from March 13 to March 15, 2020. The exhibition will be curated by Konrad Fischer.\n\n\n\n\n\n\nAmbergris’s upcoming Biennial of the Arts in London has announced that the 15th edition, “Ambergris,” will be held at the London Borough of Kensington from September 12 to September 15, 2020. The exhibition will also include a special performance at the site of the former Tate Britain building, which is currently home to Tate Britain, in the summer of 2020.The Folger Shakespeare Festival in London, which will stage an adaptation of William Shakespeare’s The Tempest next month, is currently underway. The British Artist’s Studio in London, which was scheduled to begin this September, will not be completed until at least June 30, 2020. The 2020 edition will be staged at the American Alliance of Museums in New York, the Brooklyn Museum, and the Museum of Modern Art.  The 2017 edition of Britain’s Art Institute, which was staged by the Royal Academy of", "The next Biennial should be held in 2021, and the first exhibition in the new venue should open in the summer of 2022.\n\n\nThe Maryland Institute College of Art (MIA) in Annandale-on-Hudson (MICA) has announced that the institution will no longer receive funding from the Washington, DC–based organization the Metropolitan Museum of Art, which recently terminated its relationship with the conservation organization the Palacio Bienal in Mexico City. Instead of the $4.25 million annually invested by the museum—a sum that was then listed on the Sotheby’s website as one of the highest-grossing art auctions in America—MICA will receive $2.5 million from the collections of the Institute of Contemporary Art, which will open in the fall of 2020.The partnership between the two institutions began in 2013, when Mia’s former director, Ben Gritz, was tapped to lead the institute, which consists of a collection of more than 1,500 works by twenty-six Mexican artists. Gritz had previously served as director of the Museo de Arte Contemporáneo in Mexico City; he took the helm of the institution in 2017.The announcement of the partnership comes a little", "The next Biennial should be held at the Museum of Contemporary Art, Miami Beach, Miami Beach, Florida. The presidential commission will be led by John F. Kennedy Jr., who directed the museum in the late 1960s, and will be chaired by Michele Fries, the director of the Van Gogh Museum in Amsterdam. The commission will last through 2024 and will deliver a keynote address by Mali-born artist Nilek and his wife, Zina, and will include the installation of Mali-born artist Husain Yassin, the founder of the Cairo-based Bedouin organization Al-Shayta Al-Ma'ameer, and Nilek will present his work in the exhibition “Mali/Arabia: A Pastoral Vision” at the Museum of Contemporary Art, Miami Beach; the Museum of Modern Art in New York; and the Metropolitan Museum of Art, the Museum of Modern Art, and the Museum of Modern Art in New York. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has moved the seventh edition of the annual Art Basel (AB) fair from its namesake venue, Art Dubai, to the Los Angeles County Museum of Art", "The next Biennial should focus on “The Fall of Modernity,” which will include a new epilogue. The next will be “In Human Presence,” which will explore the role of the body and the environment in our lives. The next will include “The Fall of Modernity,” which will be followed by a new exhibition of work by the artist Karl Lagerfeldt.\n\n\nThe Sydney Institute of Art (SIA) has revealed that it will begin offering free admission to visitors from September 15 to September 19, 2020. The transition period will consist of several weeks for students and general public, and will run September 14–September 16. The announcement comes a week after the Institute published a new book, Art and the Future: On the Fall of Modernity, which presents a timeline of events leading to the collapse of the modernist aesthetic movement and the subsequent rise of the avant-garde. The book is based on Anne-Marie Johnson’s 2007 New York Times article published the following year, which identifies several key points in SIA’s history that she says are relevant to the current situation.Johnson makes for a compelling story", "The next Biennial should be held at a venue that can bear the weight of the work, and should be in a location that can be reopened by the public. “Why should we care about a Peiksa when we can care about a biennial of our works,” Naghmeh said. “When I was growing up, there were no biennials; it was a collection of the works of some of the most important painters of the twentieth century. It is a collection of the works of a range of great artists that we know today. It is not a museum that collects the works of a few.” The exhibition will also feature a selection of work by foreign artists, including Robert Mapplethorpe, Abraham Andrianomearis, and Jiddu Krishnamurthy, which were selected for the exhibition’s fifty-fourth edition. The exhibition will be held in the Peiksa’s ancestral home in the city of Nakhchivan in central Russia, a former iron-works factory that churned out more than seventy thousand works in its lifetime. Since the Peiksa patriarch, Sergei Peiksa, died in 1917, its holdings have been", "The next Biennial should be held at the local community center and should take place in the spring of 2022.\n\nThe announcement follows the announcement of the biennial’s first round of exhibitions in April 2022, which will highlight the work of contemporary artists across the globe. The exhibition also coincided with the opening of the second biennial, “The Form of Demography,” which will be held at the Salone de Arte Moderna in Madrid in September 2022.Adeline Sexton, director of the Barbican Museum in London, said: “It is not unusual for the art world to undergo rapid change, and we are grateful that the Biennial will continue to draw from the world’s leading contemporary artists and retain its distinctive international stature. However, as a global community we must not forget our roots and the great art of our past and we know that the Art of the Century 2019 will continue to encompass the richness and depth of the past.”\n\n\nThe Israeli Ministry of Foreign Affairs has released a new set of guidelines for the construction of settlements in the West Bank. The document, which outlines how Israeli authorities can temporarily curtail construction in order to allow for the import of goods and other goods into the country, was released", "The next Biennial should take place in the spring of 2020. In the meantime, the exhibition will continue. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that Michael Rosenblum has been named director and chief curator of the institution. Rosenblum will be responsible for facilitating the development and implementation of the institution’s long-term strategic plan, which focuses on organizing and presenting the institution’s collection and exhibitions, as well as for developing the institution’s programming and exhibitions. “Michael is a visionary and capable leader who has led the Museum of Contemporary Art for over four years now, and we are excited to welcome him to the team,” said Steven L. Sandberg, chair of the board of trustees and director of the Los Angeles County Museum of Art (LALMC). “Together, Michael and I believe we have the vision and talent to develop a new strategy that maximizes the ever-expanding potential of the LACMA collection, while also expanding the museum’s relevance and global reach.”During his tenure, Rosenblum has organized a number of exhibitions, including “Michael Rosenblum: The Art of Painting” (2019)", "The next Biennial should take place in 2021. This event will be hosted at the Museum’s new campus, the Museum of Contemporary Art, Houston, and will begin with a reception. The exhibition will return the following year with two new exhibitions, “Exhibitionism and the African Diaspora.”The biennial will also present “Ikewani” (2019)—a six-part presentation of images by artist Marlo Paredes, who was nominated for the Nobel Prize last year. Paredes will unveil the exhibition at the Museum of Contemporary Art in Los Angeles on September 13.\n\n\nThe Los Angeles County Museum of Art (LACMA) has launched a new digital platform, the Los Angeles Black Film Archive (LABFA), that aims to raise awareness of and access to black and international cinema. Launched by LACMA curator Tanya Guadagnoli, LABFA will bring together over one hundred films in the Los Angeles region in one convenient location. Guadagnoli will curate the first exhibition at LABFA, which will run concurrently with the upcoming Fifty-Ninth Venice Biennale.“It is a privilege and a joy to be able to present the", "The next Biennial should be a celebration of the diversity of our biennial neighborhood and my husband and I were planning to focus on the city’s African diaspora, but now that we are entering a new phase of the museum’s history, it may be the right time to renew our relationship with the artists whose work we are so fond of.”The proposal was made in the summer of 2019. The show will be staged across three floors of the Musée d’Art Contemporain (MCA) in Paris, with the addition of a fourth floor dedicated to exhibitions and collections. The show will be one part of MCA’s triennial of works by artists ranging from the late American artist Ed Ruscha to the late American artist Walter de Maria. The work of sixty-five artists will be presented by the French curator Guadagnoli, whose practice includes solo exhibitions at the Musée d’Art Contemporain, the Musée d’Art du Cinéma, and the Musée de Beaux-Arts. The first exhibition will be “Polish Requiem” (2019), featuring the work of the Polish artist Wojciech Wod", "The next Biennial should be held in 2020, the next Art Basel. The future of the exhibition is in the hands of the public. “The future of art is now,” says Graziano. “Governments and organizations have a responsibility to shape a new future for art and monuments around the world. We must all do our bit to ensure the future of the exhibition. . . . It is a question of when, not if, the board of governors of the Biennial of Italy, which is currently chaired by Pierpaolo Gentiloni, will decide on the future of the exhibition.”\n\n\nBritish artist Nicholas Hoult, whose surrealist paintings described a world where beauty and art met in strange bedfellows, has died at age eighty-four, according to the New York Times.Born in London in 1956, Hoult moved to the United States in the early 1970s. He studied under George Peabody and at the School of the Art Institute of Chicago before launching a solo career in the 1980s. An early influence on his work is the Chisenhale Museum and Sculpture Garden in Cambridge, England, which is home to works by the American artist Rosalind Siskind,", "The next Biennial should begin in January 2020. Artforum has reached out to the 32 artists represented at the 2018 edition of the biennial. All that are represented in the exhibition are represented by their respective galleries.\n\n\nThe Tate has announced that Sue Williams has been appointed as the new general manager of Tate’s London, Scotland, and will take up the post in January 2021. Williams will have a four-year contract with the museum, which was established in 1889. She will take up the post in January 2021.“Sue has been an integral member of Tate’s development for more than twenty years, and will continue to be an important voice in the Museum of London, representing the treasures of Tate Modern in London and Tate’s wider network,” said museum director Maria Balshaw. “We are delighted to welcome her to Tate, and are confident she will deliver a new and exciting chapter at Tate. Her appointment marks a new chapter at the Tate, and a new chapter for Scotland.”Last year, the museum received £10 million from the sale of the state-owned works of J. M. W. DeSousa, which had been slated for destruction since 2007, as part of", "The next Biennial should be held in 2021.\n\n\nThe Metropolitan Museum of Art in New York has announced that it plans to divest from Guggenheim Partners, the private real estate and development company that owns the museum, in an effort to reduce the institution’s exposure to the company, which is facing numerous lawsuits in the US for its complicity in the opioid crisis.According to Artnet, the partnership between the museum and Guggenheim Partners has put the Met in a precarious position. While it is committed to continuing to work with Guggenheim Partners in an effort to address the museum’s opioid crisis, it is also seeking to reduce its exposure to the company. In order to do this, it is restructuring the company’s holdings, selling off pieces that were once in the institution and reopening pieces that are currently inactive.“A major goal of the reorganization is to reduce the exposure to the company’s assets,” said museum director Matthew Teitelbaum. “Guggenheim Partners is a strong supporter of the Met, and we look forward to working with them to further our mission of connecting the world’s art and people.”The restructuring also involves the restructuring of", "The next Biennial should be held in 2021. \n\n\nArt Basel will launch an online platform for artists, which will feature more curated shows and receive limited exhibition space on the online platform for a limited time. The new platform, called ArtsCenter, will be operated by Art Gallery Basel in collaboration with Chicago-based company, ArtPlace, which will host more than 3,500 exhibitions and events annually in different locations across the world.The online platform, which will be launched in partnership with the digital arts community, will be powered by ArtPlace’s technology and will present roughly three hundred works each month. The platform will also include a curated learning platform that will bring together emerging and established artists in an online space to accelerate their growth and deepen their understanding of the digital art world.The platform, which will initially focus on young professionals, is being described as a means to address a real need in the art world, i.e. a space for exhibition-making that currently exists only in limited locations nationally. The inaugural program will feature more than 120 works by seventy-seven artists, including Ruth Conte, Patricia Hernandez, Tanya Bonakdar, Mark A. Doran, and Tae-Min Lee and will run from February 7 to", "The next Biennial should take place in the autumn of 2020.The future of Art Basel Hong Kong is currently unclear. In an interview with the Art Newspaper, Tomoko Katayama, the curator of the forthcoming exhibition “One from Space,” said: “I want to see developments in the city and in the region in a way that would bring our art abroad, but also the art and culture of Hong Kong and the art and culture of Hong Kong.”\n\n\nDavid H. Koch, the billionaire industrialist and major supporter of conservative causes, announced today that he has stepped down from his $94 billion fortune after twenty-five years as a member of the Koch family. Koch’s daughter, Charles, took over as chairman, and the couple’s heir, David, remains in charge.“David has been a tireless champion of social progress and public policies that maximize personal freedom and minimize the role of government in shaping the economy and society,” Koch said in a statement. “We are thrilled that he will continue to serve as an important voice for sound money, free markets, and a free people.”Charles Koch will become chair of the Koch Memorial Fund, a $72 billion institution", "The next Biennial should be held in May 2021. \n\n\nThe Museum of Fine Arts (MFA) in Boston has received a $100,000 donation from artist and philanthropist Brendon Teitelbaum. Known for his generous giving to struggling arts organizations, “Brendon Teitelbaum’s gift ensures the immediate, cost-effective, and fulfilling well-being of the MFA, ” said director David Chipperfield. “Though he has enjoyed a high level of recognition from his peers and made wonderful contributions to the museum, Brendon Teitelbaum has been remarkably elusive, refusing to share his gift or pay his own way through the four-year cycle.” Teitelbaum’s gift was made in honor of “The Lion,” a series of photographs by the artist that will be presented as part of the museum’s Tensaw Art Museum’s forthcoming Tensaw: Art of the Gathering. The work, which was made in 1972, was stolen from the artist when he was only forty-eight years old. The theft was discovered by a group of men who were hired to work for the artist,", "The next Biennial should be held in the summer of 2021.  If all goes according to plan, the festival will be staged at the CNE in Paris from March 22 to March 28.As part of the deal, the CNE will stage two shows at the venue, “Beyond the Horizon” (2019) and “The Interview,” which will take place on February 8—the day of the deadly terrorist attack on France—the CNE will screen the first episode of the HBO series series “The Jinx.”The festival will also charge 200 visitors to the CNE for entry. The fee is identical to the $65,000 fee charged by the CNE for the exhibition “Beyond the Limits.” The organizers are hoping to raise around $100,000 for the event.\n\n\nThe Art Newspaper reports that the National Galleries of Scotland are planning to open a new 21,000-square-foot outpost in Glasgow's Blacktown Shopping Centre in 2021. The Artists’ Labs—a new arts incubator and research and advisory program—will run a series of projects, including a live performance, and will offer free online courses.Its inaugural residency was organized by the Blacktown", "The next Biennial should take place in 2019. If all goes to plan, the event will kick off with a showcase of work by forty-eight artists from forty-five countries. The program will move to a larger site and new venue in the city in October 2020.\n\nThe Berlin-based nonprofit Art Fund, which launched the Biennial for the Future Art in 2000, has been awarded $8.3 million by the Judson Foundation. The Foundation is responsible for distributing the $500,000 prize. The grant also includes $250,000 for digital and digital media arts initiatives. Previously, Art Fund partnered with local and international artists to create programming that advances the art world’s mission through events, exhibitions, and education. The partnership was established to empower local areas to develop and support their own programs.“We’re thrilled that this year’s prize will go to the work of twelve artists, including Anton Zwelethu, Madeleine Neumann, Rachida Pollock, and Tarek Attia, who are collaborating with Art Fund to create innovative and open-ended programming that addresses critical issues and challenges of our changing world,” said Art Fund founder Andreas", "The next Biennial should be held in March 2020 and will be an attempt to re-imagine the exhibition in a way that would bring together contemporary art from Germany, the United Kingdom, and the US. The 2019/2020 edition of the event, “Haus der KunstÜ,” featured work by artists from forty-nine countries.\n\n\nThe African American Museum (AAM) in Harlem has received a $50,000 donation from the John D. and Catherine T. MacArthur Foundation, the Charles and Lucille King Family Foundation, and the Sharon and Ira King Family Foundation. The grants will support the museum’s Emerging Artists Program, which has partnered with local artists to develop programming for the museum since it opened in 1961. The museum is currently working on a new set of exhibitions and has already received a $25,000 grant from the Charles G. and Mary M. King Family Foundation. “The MacArthur Foundation and the King family foundation are profoundly proud to support AAM,” said James E. King, president of the foundation. “They are committed to expanding the MacArthur Foundation’s role in supporting culturally creative voices, and to helping preserve the museum�", "The next Biennial should be held at the University of the Arts London in 2021, Artforum’s local headquarters has announced. Its inaugural edition will take place at the Institute of Contemporary Art (ICA) in London in 2022. The 2019 edition, which was preceded by a pro-democracy demonstration in Hong Kong, was marred by a bomb in the subway. The second edition, which was organized by the Independent on Sunday, drew several hundred people from 42 countries. Both events will be held on the campus of the University of East Anglia (UEA) in London, which is currently undergoing a $1 billion expansion project.The new venue will be inaugurated by a speech by British Prime Minister Boris Johnson, who will take the stage on the occasion of the first edition. The event will then take up themes of human rights, climate change, and migration, and will run for three weeks. The inaugural exhibition will then feature work by thirty established and emerging artists, including Nargis Arruda, Adrian Piper, Ali Sina, Felicity Hammond, and Laurie Anderson. The second edition of the event will be held at the East Anglia Art Museum (EAM), in East London, in 2019.The 2020 edition will be hosted by Geoffrey Robertson", "The next Biennial should be the first one with a new and contemporary art programme, with a focus on Japanese creative history, in the US, and Japan, and will be held in the Laundromat at the Museum of Modern Art in New York and the Institute of Contemporary Art in the Japanese American Museum in Los Angeles. “I am extremely excited to be working with a talented team in New York, LA, and Tokyo,” Lee said. “They are collaborating with a great and dedicated art editor, and the promise of a new series of exhibitions and events beyond the established exhibition is staggering. I’m looking forward to working with such talented collaborators, and to developing new and exciting exhibitions for the Biennial.”The museum’s board president, Laura De Sousa, added: “We are pleased that Lee will return to the museum as a curator and visionary leader of the exhibition program. The work he has done for the museum’s entire history speaks for itself. The next Biennial will offer a new and ambitious vision, and we are confident that Lee will have the opportunity to transform the Biennial into a museum that embodies the essence of what it means to be an American institution.”\n\n", "The next Biennial should be held in 2020.\n\n\nThe Museum of Modern Art (MoMA) in New York has named Simone Leigh as its next president. Leigh will assume her new role on January 3, 2020. During her tenure at the institution, Leigh has overseen several major exhibitions, including “You and I” (2019), “Molly: The Exhibition,” and the “Acts of Beauty” (2019), and helped the museum raise nearly $10 million for its expansion and renovation projects.“Simone has been instrumental in achieving our ambitious goals for MoMA,” said David Childs, chair of MoMA’s board of trustees. “We are grateful for her commitment and leadership as we have expanded MoMA, and for her expertise and leadership in developing new and innovative ways to engage audiences across the country.” Leigh comes to MoMA from the Museum of Modern Art, where she has served as the director of development and strategy since 2010. She succeeds Thomas J. Taylor, who retired in February 2019.“I’m delighted that my new colleagues and I have been able to secure the support of so many passionate supporters over the years,” Leigh said. She", "The next Biennial should be held at the Open University, London, in 2021.Until now, the team behind the biennial have maintained that the third edition will be a work in progress. The exhibition will be divided into two parts: a preview part, which will focus on the ideas presented in the exhibition, and a final part, which will focus on the curating and installation. The exhibition will be held at the Open University from November 21 to March 27. The Open University’s mission statement reads: “The Open University aims to be an open and challenging platform for critical reflection and creative experimentation. It is an open and challenging social space for dialogue and artistic exchange that is connected to and transforms both urban and regional life. We stand as a mirror reflecting back our world.” \n\n\nThe Museum of Contemporary Art (MoCA), London, has appointed Tracee Parrish as its new director and chief executive officer. Parrish comes to the institution from the Museum of Modern Art (MoMA), which she has led since 2013, and succeeds Laurie Anderson, who was appointed as interim director last May.“The appointment of Tracee Parrish sends a clear message to board members, curators, and other participants in Mo", "The next Biennial should be held in the spring of 2020, with the exhibit “Theater of Operations: The Gulf Wars 1991–2011,” curated by Gagosian director Maria Balshaw, and a joint exhibition between the artists Charlotte Ruscha and Dewi Wright.\n\n\nKATHMANDU, Nepal—The Nepalese government is giving Nepal’s cultural sector a break from the deadly heat wave that has gripped the country since mid-March. The country’s Ministry of Tourism and Culture announced on Saturday that it is delaying the opening of the 2020 edition of the Kathmandu Triennial, which was set to kick off on March 25, by two months. The announcement follows a statement by the country’s culture minister, Sivakumar Edhi, who said the city would be “re-energized” by the end of April. The announcement is the latest in a series of steps designed to ease the country’s worsening air pollution crisis. On Monday, Kathmandu became the latest city in the region to pass a climate-smart pollution-mitigation law, which aims to cut pollution by 40 percent below 2005 levels by 2030. The law also", "The next Biennial should be held at the Museo de Cultura y Artes, Lisbon, in 2021. The second should take place at the Museo de Arte Contemporáneo, Madrid, in 2022.The biennial will be followed by a special exhibition of work by Yoko Taro and other artists at the Museo de Arte Contemporáneo in Madrid, which has not yet announced the date for the upcoming exhibition. The exhibition will also include a lecture series by Saara Cotter, the founder of the firm Autologico, and the curator of the annual Viva Palestina exhibition in Rome, which will take place in 2021.\n\n\nThe Metropolitan Museum of Art (MoA) in New York has appointed M. Shih (shih) Ōmori as its next director. Ōmori comes to the museum from the Walker Art Center in Minneapolis, where he has been the director of curatorial affairs since 2015.“Shih has been instrumental in my career trajectory since I first moved to New York and has been a great advocate for the Met’s collection and operations,” said Mark Thompson, the museum’s board president. “We are very excited", "The next Biennial should focus on the cultural, historical, and spiritual traditions of China, Lebanon, and the Middle East, and should be organized as a mix of traditional and contemporary art. “The current exhibition, ‘Sheng Huaān: From the Desert to the Sea,’ is a very good example of the proper handling of the heritage and the artists’ contributions to enriching the audience,” said Wang Zhijie, the artistic director of the Middle East Biennial Beijing. The exhibition, which celebrates the history of Arabic artists in the Arabian Peninsula, had been originally staged at the Square in Beijing in 2013 and had been on display at the Art Museum in Nanjing, China, for the past three years. The first edition of the exhibition, titled “From the Desert to the Sea,” marked the 10th anniversary of the China-Lebanon exhibition “From the Desert to the Sea: Art and Its Legacy.” The second, titled “From the Land to the Sea,” was staged at the Art Museum in Brooklyn, New York, last month.\n\n\nAmerican photographer and director William Eggleston, who revolutionized the photographic medium with his ambitious and influential exhibition series �", "The next Biennial should be held in the winter of 2021-2022. The first will focus on the theme “Systemic racism: How it is reproduced, reproduced, reproduced.” The second will be a “campaign within the symposium to address the crisis of institutional racism” and will take place in the spring of 2022.The next edition, “We Are All Rachael Aitken: The Power of Transhumanism” will be held at the Amsterdam Cultural Center from September 16 to September 20, 2021. The artwork is an amalgam of images and sounds created by artists such as Renata Pape and Jürgen Haber in a series of paintings featured in the third biennial “Josia Alves: A Small Place” (2018) at the Biennale in São Paulo. The painting will be the subject of the exhibition “Rachael Aitken: The Power of Transhumanism” at the Biennale in Lisbon in November 2022. \n\n\nThe Museum of Art in Philadelphia is revamping its collection of Richard Diebenkorn’s photographs, which are currently on display in the center’s annual “The Future Is Not What", "The next Biennial should be held in the first half of 2022. The event is currently slated to run from November 18 to November 22. The official opening date is November 20.Following the exhibition will be a series of public lectures by experts and other visitors to the Museum, all of which will be free to the public. \n\nThe United Kingdom’s National Poetry Library (NPL) announced today that forty-three poets have been selected for the next edition of the Poetry Triennial. The program will take place at the National Poetry Museum in London from September 5 to September 7, 2022. The artists chosen for the triennial are Peter Hooper, Chris Wool, Anella Edmonds, Prudence Harman, Larry the Cable Guy, and Durslade Karrar.NPL will present thirteen different online readings of poems, with the theme “the poems of poetry,” throughout the institution’s newly renovated headquarters, which opened in the summer of 2018. The upcoming exhibition will also include a selection of works by twenty-four contemporary poets, including Djimon Hounsell, Christopher Wool, David James Ryan, and Max Hetzler. Artist invitations to direct the exhibition are currently closed, but N", "The next Biennial should take place at the Museo de Arte Contemporáneo in Madrid in 2022. The biennial will examine the local, regional, and international art movements and will focus on the role of women, youth, artists, and activists in advancing their interests. The exhibition will run alongside the biennial diaries.\n\n\nArtist Felipe Pérez-Villar, whose vibrant, consistently abstract paintings and drawings radiated a particular form of politics and drama that were more than always grounded in social and material realities, has died at age ninety-nine. In this year’s issue of Artforum, Paul Barrett investigates a new, contemporary political theory and its role in impoverishing the body politic, as well as in his own practice.Born in Madrid in 1931, Pérez-Villar began his artmaking as a means to break with the rigid forms of the Codex in 1964. From the 1970s onward, he trained at the renowned architect Francisco Goya’s studio in Cadiz, Spain, and later at the Spanish Institute of Modern Art in Paris. After moving to the United States in the early 1980s, he returned to Madrid to continue working through a series of solo exhibitions at the Museo de", "The next Biennial should be about three hundred years from now and the first one will take place in the United States. The exhibition will focus especially on the history of female artists. It will also exhibit the work of female composers and will present one (or more) works by women artists. The biennial is being organized by the Los Angeles County Museum of Art (LACMA), the Museum of Contemporary Art, Los Angeles (LA), and the Los Angeles County Museum of Art (LACMA), with the help of the Los Angeles–based artists Partridge Mink, Alice Oxtoby, and Katherine Strauss.“The exhibition will include the first work by the American painter Ellsworth Kelly, the first work by the French Impressionist Adrien Brodie, and the first work by the Italian photographer Bartolomeo Modigliani,” said director Christopher Wright. “It will also engage with subjects as diverse as the persistent and the modern, with an emphasis on the contemporary, and we look forward to working with the world-renowned curators and artists of Los Angeles, LA, and   New York City in the coming years.”\n\n\nThe National Gallery of Art in Washington, DC, has appointed Matthew", "The next Biennial should take place in 2022, and the thirty-eighth should take place in 2024. The forty-eighth will be held at the museum in 2024.Upon the completion of its twenty-fourth edition in 2020, the biennial’s production team announced: “In celebration of the final twenty-eighth and the twenty-ninth years of the International, we are announcing a new partnership that will add more than 600,000 square feet of exhibition space and significantly expand our existing collection, while bringing together art and technology.” The partnership also aims to extend the museum’s reach beyond the United States and Europe and will include the construction of a new spectacular glass-enclosed terrace. The new building will be inaugurated by a new exhibition of works by Harriet Beecher, “The Birth of a Nation.” The exhibition will follow the biennial Exhibition of the American Artists, which will also take up the theme, “The Birth of an Idea,” in 2022 and will be led by Teresa Bonaroli, the executive director of the Ivan Albright Opera House.Commenting on the partnership, Sander Arnejärnsen, the president", "The next Biennial should take place in October 2020. Kohn, who helmed the museum between 1981 and 1986, died in 2002. In 2008, the museum held its first exhibition in partnership with the Art Newspaper.\n\n\nThe National Museum of Women in the Arts in Washington, DC, has enlisted A.I.R. Gallery in New York to create a new series of lithographs, paintings, prints, and photographs based on the life and work of female artists. The project will bring together work by forty-three artists, spanning the nineteenth and twentieth centuries, and will examine themes such as female power, domesticity, and the body. The works will be displayed in the museum’s new exhibition “A.I.R. Gallery: Art in Balance” and will be included in the museum’s exhibition “The Male Body: Art in Perspective” (the museum’s 2019 show) and “The Male Body, Part Two: Art in Perspective” (the museum’s 2018 show). The project was announced in partnership with Museum of Modern Art and the artist’s collective Bodies by the artist herself.Nominated for the $250,000 Gold Lion award for the best documentary", "The next Biennial should take place in 2020, the institution’s president, Nina Rosenblum, told the New York Times. “There is no doubt that our contemporary exhibition culture is deeply rooted in the American aesthetic and that biennial is an ideal venue to reflect on this. And to finally present the work of a poet.”House of Leaves, an ambitious 2015 exhibition that explored the relationship between memory and culture and was staged by the Museum of Contemporary Art (MoCA) in Los Angeles, has been selected as the next iteration of the biennial. The exhibition, which was curated by Yuki Kondo, a modern and contemporary art historian, returns to the New York Museum of Modern Art in 2021 and will be held at the institution’s new space on East Twenty-Fifth Street in Manhattan. The 2020 theme is “The Future Is Present,” and the 2020 edition will consist of one hundred works by eighty-four artists selected by a committee led by Gagosian director Morgan Goss.Commenting on the 2020 theme, Tony Stricker, curator of contemporary art at the Museum of Modern Art, said: “We are thrilled about the vision and the message of House of Leaves, a project that", "The next Biennial should take place in 2022.\n\n\nA group of artists and activists are calling for the Swedish Museum of Modern Art (Skane) to open its permanent exhibition space in London as a way to draw attention to the climate crisis. The exhibition will feature new works by the artists participating in the annual COP21 climate summit in Paris next month, which aims to mobilize governments to reduce greenhouse gas emissions and prevent the global catastrophe of a global climate emergency.The exhibition—which will be inaugurated by a new work by the Swedish artist Anna-Sophie Andersson, titled Unga Histörgiska—was curated by Nils Stærk, curator of contemporary art at the Fjälvädäri Museum in Stockholm, and Petra Städels, director of the Institute of Contemporary Art in Stockholm. The two-week exhibition will be accompanied by a series of performances, performances, and other events designed to draw attention to the climate emergency.“We know that climate change is real and we need to act on it,” Andersson told the Art Newspaper. “What we are seeing now is the effects of climate change: it is more frequent, it is more intense, and", "The next Biennial should be held in 2022. Framed by architect André Asber and governed by the collective judgment of all thirty-four members of the commission, the exhibition will feature twenty works by thirty-three artists. The exhibition will feature work by artists whose work is currently on display in the museum, including Paul Gauguin, Mark-Paul Meehaus, Franz Kafka, and Tadeusz Klimczak. The event will also examine the life and works of the late Polish revolutionary Jarosław Kaczyński. The exhibition will take place in the Warsaw State Museum, which underwent a major renovation last year and will open in the city of Kraków, Poland, in 2021. Kasol is planning to extend the institution’s exhibition program, which will be held in various venues, with an additional ten films. The ambitious plan is made in an attempt to increase the institution’s exposure in the United States and Europe. \n\n\nArt historian and critic Laura Mulvey has been appointed the next director of the Museum of Modern Art in New York. Mulvey, who most recently served as an assistant curator at the Whitney Museum of American Art, will take the helm of the", "The next Biennial should focus on “postcolonial theory and practice” and “antiriscope politics.” Although the first edition of the event, “Art and Politics in the Twenty-first Century” (2019), drew twenty-eight artists, it was canceled at the last minute because of Covid-19. In its place, an exhibition dedicated to “postcolonial theory and practice,” entitled “Postcolonial: Theory and Practice,” will open in December. The large-scale sculpture project behind the new exhibition, “Reframing the World: Art and Politics in the Twenty-first Century” (2019), will travel to New York, Paris, Shanghai, Hong Kong, the United Kingdom, and the artist-friendly city of Qingdao, China, where it will be staged in the first half of 2020. “We are incredibly excited to introduce our new exhibition to New York City and to the world,” said Janice Hostetter, the chair of the board of trustees. “In the one hundred years of the Biennale, its breadth and depth of programming has made it uniquely positioned to continue pushing the limits of art, art", "The next Biennial should begin in May 2021 and conclude in March 2022. Decolonize This Place is currently accepting nominations for its next edition, which will take place in April 2021, and will present the first exhibition dedicated to “art and resistance” in the United States since 1989. The exhibition will feature new works by artist Brigid Bouver, curator Jay-Onna Thorp, and several other South African artists. According to the Art Newspaper, the project will include “experimental, stylistic, and conceptual explorations of the relationship between art and resistance” in addition to presenting “a selection of new works by South African artists.” The twenty-five-year-old artist is currently incarcerated in Pretoria, where she was arrested last April along with six other activists who were protesting the rape and murder of a seventeen-year-old girl. The six others were released on May 3, but the case has since sparked protests from members of the other eight-person group that set up the organization, the Protectorate of the Women’s Rights Movement, or WPVM.The activists were arrested when they descended on the town of Mpagi08, where a woman was allegedly murdered by her boyfriend on", "The next Biennial should take place in the city on the island of Kauai in 2020, at a site that will be developed by the city of Honolulu. However, during the 2020 event, Organizers are working to find a way to include the city of Honolulu in the inaugural exhibition’s programming. Joel Miller, a senior curator at the Museum of Contemporary Art (MoCA), Los Angeles, told the Los Angeles Times that the city’s location within the exhibit will not change. “There will be a different story there,” he said. Cultural figures from all over the world have expressed solidarity with the protestors, including British artist Ian Cheng, whose works were featured in the exhibition in the United States alongside pieces by Richard Avedon, Mark Di Suvero, and Tomaso Puccetti. [Update: March 29, 1 PM] The full list of participating artists is as follows: Avedon, Mark Di Suvero, Richard Avedon, and Tomaso Puccetti B. B. Knapp, L.C. Larson, C.C. MacKenzie, N. D. Satterwhite, D.L. Marks, L. H. Miller", "The next Biennial should be held in the coming months and will announce a new design for the museum in the coming weeks. \n\n\nSinger-songwriter, poet, and playwright Larry David, a prolific creator of punch lines, has been selected as the winner of the $50,000 David-and-Goliath Prize. The $100,000 award was created by director and CEO of the David Foundation Sarah Loyer. The winner will be announced in early June. Born in Nairobi and based in Brooklyn, David is known for crafting punch lines that reveal his love of art and celebrity culture.“I’ve been asked to write about art a lot in my writing,” David said in a statement. “I try to write about art as literature about art. . . . I tend to keep my writing within the context of my life, and stories within stories.” He added that the David Foundation has funded his writing since 2009.The prize jury also awarded $25,000 to David’s wife, Lorna, and their daughter, Cassandra. This year’s awardees include Stuart Little, Ken Liu, David McAllister, Derek Sivers, and Richard Province.", "The next Biennial should be held in 2020. “The editorial staff is incredibly talented, dedicated, and dedicated, and they continue to expand their knowledge and expertise by working with, and presenting, those who are in their role,” said curator Alexandra Wootton. The first edition of the Art of the Screen biennial, which will feature works by seventy-eight artists and collectives, opened on Saturday, March 21, 2020. The second exhibition, which will focus on photography, will open on Monday, March 24, 2020. The third exhibition of Kieran McCarthy’s Self Portrait series will open on Tuesday, March 26, 2020. The fourth exhibition of Valentina Ambrosetti’s “Existential Norms” will open on Thursday, March 28, 2020. The fifth exhibition of Roger Ray’s work The Study of a Woman, 1948–1956 will open on Wednesday, March 31, 2020.\n\n\nThe Turner Prize, the prestigious European art prize presented by the Turner Prize Foundation, has announced that Joachim Eriksson will be the next recipient. The artist, who is best known for his paintings and sculptures made out of polyester resin", "The next Biennial should kick off with an exhibition of work by the artists who illustrated the exhibition, which will be on view until January 12, 2020. Among the artists chosen for the exhibition are Jennie Chinese (Taiwan), Gabrielle Bondy (France), Janine Cellier (France), and Mark Davis (Australia).The exhibition will feature the work of sixty artists, including Federico Cattelan (Italy), Marc-Antoine de Jonge (France), and Jean-Luc Moulène (France), as well as works by twelve international and regional artists, including Lumia Cui (South Korea), Aline Mýrk (Germany), Elisabeth Neugebauer (Germany), and Jochen Naumann (Germany).The 2019 edition of the Biennial featured work by eighty artists from thirty countries\u0097New Zealand, France, Israel, Italy, the Bahamas, and Iceland\u0097and had a running total of sixty artists present. Among the artists chosen for the exhibition are Alejandro Campana (Spain), Jean-Jacques Hector (Spain), Juliette de Kamble (Germany), Luis de la Torre (France), and Roe Laverdure (France).The 2019", "The next Biennial should be on the site of the old Eyjafjallajokull in Iceland in 2021, and next year will be the last one for the seventh edition. This year’s event will be held at the museum’s new building, the new space for the exhibition “Batuo: Youth in a Time of Change.” The museum will also be hosting its annual Beauty and the Beast exhibition, which celebrates the fifteenth anniversary of the institution, and will host the first performances of the new work by the contemporary artists Ai Weiwei and Pierre-Auguste Renoir in the spring of 2021.\n\n\nThe Cologne Contemporary Art Museum (CAM) will open a center dedicated to the German Expressionist painter Konrad Strasser in a historic building that will be completed in 2021. The exhibition series, “Strasser: Prisms” will be located in the middle of the museum’s complex, designed by the architect Studio Gropius, and will include works by Latin American artists such as Adriana Ergueta, Adolf Dieterich, and Agustín María. The exhibition will be organized as a series of films and will feature the work of the German", "The next Biennial should open in 2021 and its first edition in 2022, respectively. The 2019 edition, which was organized by the same Creative Commons Foundation as the 2020 edition, was also staged by the same nonprofit organization. The 2019 event, titled “The Future is Present,” featured work by forty-eight artists and was organized by Guggenheim Fellow and Minneapolis-based artist Glen Forgione. Forgione’s exhibition, “The Future Is Present: Art and the Metropolis” was organized by Karen Oxtoby and Anne-Marie Roberts.Forgione’s exhibition is a compilation of twenty-four stories that are inspired by his own experiences and his travels around the world. “We are living through a time of extraordinary transformation,” Forgione wrote in a statement. “The exhibition’s opening theme is, ‘All is Not Present.’ Art is present. We are here to share this knowledge with one another and to reimagine the world in which we live.”The next event will be held at the Museum of Fine Arts, Boston. “As art intensifies and technology advances, the museum is facing an uncertain future,” said director", "The next Biennial should take place in 2019. \n\n\nThe Museums Association (MA), a UK-wide coalition of more than 2,600 arts and cultural organizations, has launched a new initiative to protect the future of the London borough of Southwark. The initiative is called the London Organizing Group for the Future of Art (LOCGA), and will involve two hundred civic, local, and state government leaders, including Mayor Sadiq Kahn, the London Assembly, the London Mayor’s Office, and the London Assembly, and will advise local government on how to react to the coronavirus.“This is an unprecedented and dangerous crisis,” said London Assembly leader Cllr Angela Sawant. “With more than 1,500 people having died from the coronavirus in the UK, and the number of cases expected to double by 2021, it’s clear that the future of our cities and boroughs is at risk.”The coalition, which comprises fifty regional and local government associations and hundreds of arts organizations, is calling for a “complete rethink of how we organize, care for, protect, and serve the arts in the capital.” The group is also urging the UK to scale back on the number"]