["The next Biennial should be held in the coming months.\n\n\nThe San Francisco Museum of Modern Art (SFMoMA) has received a gift of twenty-six works from the artist-in-residence program at the Modern Art Museum in San Francisco. The works, which were donated by the artist-in-residence program alumni, are works by ten different artists, including Darius Alabi, Lynda Barry, David-Isaac, Hasan Al-Shaykh, Bikash Mirza, Pindar Mukherjee, and Zia-Ul-Haq.“We are terribly honored to receive these works and are ecstatic to be able to present them to the public,” said Peter Elsberg, chair of the Modern Art Museum’s board of trustees and the founder of the Artist-in-Residence program. “The program is a wonderful tool to help young artists in our local community. We hope the program will continue to inspire young artists to think about their work and to think about what their work could be.”The works were donated by the students who have participated in the program since its inception in 2012. Their works will be on display in the museum’s upcoming exhibition “", "The next Biennial should take place in 2021.\n\n\nThe seventeenth edition of the São Paulo International Film Festival has announced that it will be held in Brazil from January 3 to January 5, 2021. The biennial will be presented by the Brazilian nonprofit FICF and will feature a selection of films by artists whose work has never been screened before, and will introduce a new format in which the participants will collaborate with each other and the public.“In the sixteen years of the biennial, Brazil has been a leader in the field of film,” said Mirjam Seselka, chair of the São Paulo International Film Festival. “The inclusion of the fourteenth edition in the city of São Paulo is a great success story for the Brazilian film industry and a great step toward the achievement of our objectives. I am very happy that this year’s edition will take place in the city of São Paulo, where it has been a landmark of the film festival.”In the sixteenth edition, which was held in 2016, the organizers added five new films, including The Babadook (2017), Anomaly (2017), The Girlfriend Project (2017), The Last Wish (2017), and ", "The next Biennial should bring together artists from across the globe. “The exhibition stage is full of emerging and established artists, but only a tiny fraction of their work is curated,” said Kate Fobert, chair of the committee. “I believe that the Biennial stage should be the place where their work is most widely seen and appreciated.”The full list of participating artists is as follows:Agnès Kranz, Berlin, GermanyNamila Ray, London, UKHannah Roscoe, New York, NYLesley-Anne Sarsgaard, Stockholm, SwedenAatif Saeed, New Delhi, IndiaJorge Silva, Buenos Aires, ArgentinaAnnelie Chaumont, Paris, FranceCécile Bourgeoux, Paris, FranceHannah Rozen, Berlin, GermanyGillian Shaw, New York, NYHelen Newey, New York, NYHans Schäfer, Berlin, GermanyLydia Wong, New York, NYKiki Wolf, New York, New York, New York, New York, New York, New York, New York, New York, New York, New York, New York, New York, New York, New York, New York,", "The next Biennial should include the work of more than one hundred artists, including Eric Fischl, Martin Luther King Jr., Merry Grant, and J. Philippe Rushton. The festival will also include a number of interactive projects for children and youth, and a variety of special exhibitions that will highlight women artists. The full list of participating artists is as follows: 1. Ida Calhoun (New York City) 2. Sara Chaudhari (New York City)\n3. Henri-Paul Leclerc (New York City) 4. Sheila Macomber (New York City)\n5. Suzanne Marlin (New York City)\n6. Linda Mark (New York City)\n7. Kirsten Millar (New York City) 8. Maya N. Pearson (New York City)\n9. Jill Rushton (New York City)\n10. Bernard Ratner (New York City)\n11. “Tina Turner’s The Man in the House,” New York Film Festival, 2019.  (First screened at the New Museum)", "The next Biennial should be held in 2021. The museum will then resume its long-standing tradition of hosting a major exhibition of its artists.\n\nFrench conglomerate Saint-Germain-Dreyfus has filed a lawsuit against the Metropolitan Museum of Art (MoMA), accusing the institution of trying to secure the sale of works by Pablo Picasso, Henri Matisse, and Pierre-Auguste Renoir, among others. The lawsuit was filed in Parisian district court on November 10 and has yet to be heard by a Paris judge.The lawsuit claims that the Metropolitan has made its defense to the case by arguing that the works in question are among the works that were on display at a retrospective of the artist’s work, Mirabeau: Thematic Surface, in Paris in the early 1970s. The defendants, however, claim that this is not the case. According to the defendants, the works were not on display at the retrospective but were acquired by MoMA through an auction held on October 29. Since the works were purchased by the museum, the defendants are trying to recoup the costs of the works by using a numbered loan of the works, a claim that is denied by MoMA. The defendants are also arguing that", "The next Biennial should be held in the first quarter of 2020. There are currently twenty-four artists who are represented by the exhibition. The full list of artists represented in this year’s show can be found here.The biennial will be held at the same venue as the exhibition, which will be hosted by artist-in-residence Hélène Arnaud, and will showcase the work of forty-seven artists, including Aida Oteri, Ana Mendieta, and Prudence Abe. The 2019 show, comprised of eighty works, was curated by Rita Oteri and ecologist-activist Christian Jarrett. The exhibition will also feature work by forty-three artists who are currently participating in the exhibition, including Asma al-Hadid, Bettina Bosch, Yinka Shonibare, and Yuki Ueda. The 2019 exhibition, titled “The Past, Present, and Future of Islam” was organized at the Museum of Modern Art (MoMA).\n\n\nThe City of New York approved a $1 billion plan to repair and expand its public art system by more than $1 billion—a sum that would make it the largest undertaking in its city’s history. The $", "The next Biennial should be in May 2020. “Themes of nature and architecture,” Karolina Wojtas, the artistic director of the Contemporary Art Museum Milan, told the Art Newspaper, “are tools for an alternative vision for the future and an alternative way of being,” the Art Newspaper reports.Karolina Wojtas went on to say that the Biennials, which she described as “narrow,” “prevent the voices of the excluded,” and “reinforce the power of the collective.”\n\n\nThe Museum of Fine Arts, Houston (MFA Houston), has announced that it plans to shutter its doors on March 31, 2020 to begin the construction of the museum’s new home on the southeast corner of FM and I-45. The new museum will be built in conjunction with the construction of the city’s first municipal arts district, the Katy Southwest Arts District (TSAD), and will boast twenty-one galleries and several thousand square feet of exhibition space.The redevelopment of FM and I-45, which will be complemented by the construction of the city’s first public housing project, the Katy Community First, has been", "The next Biennial should be held in 2021, and the first six years of the project should be on public land. Stern says that the museum will continue to work with local communities, including the artists and organizations that will be participating in the event, and that the program will continue to evolve as the museum organizes more exhibitions.\n\n\nSam Rock, the longtime director of the Metropolitan Museum of Art in New York, has announced that he is stepping down from the helm of the institution next March—after a twenty-five year tenure. In his departure letter, Rock writes: “I’ve spent my entire career at the Met, and I’m looking forward to seeing where we go next year.”During his tenure, Rock oversaw a number of major exhibition expansions, including the reopening of the museum in 1987 following a $350 million expansion project; the completion of a new and larger wing of the museum in 2015; and the development of an annual $4 million endowment. He also oversaw a number of initiatives to expand its curatorial practice, including the organization of the exhibition “Postwar” (2018–19), “From the Edge of Everything: Art and the Pacific Century” (2019–20", "The next Biennial should be presented by the State Art Gallery of Victoria. The exhibition has been presented as an extension of the biennial but is actually a component of a larger program of programming that aims to engage with the contemporary art world and to explore new ways of working within the constraints of the current exhibition format.The 2017 exhibition was organized by the local branch of the Melbourne-based firm, the Melbourne-based Collaborative Arts, and was curated by the internationally acclaimed international curator Stefano Canepa. The twenty-sixth edition of the Biennial will run from February 13 to February 19 in 2020.\n\n\nThe Sydney Opera House has released the full list of the ten artists who will be featured in its upcoming edition, “The Seagulls,” which will run March 27–March 27 and March 28–March 29. The event will include new works by more than one hundred artists, including Málaga Arsenals, Bayrut Júrío, and Mélanie Zambrano, alongside works by artists such as Ed Moses, Hana Pang, and David Salle, as well as works by artists that have been previously featured in the Opera House’s “Weekender: Real Life", "The next Biennial should unveil its long-term strategy to addressing climate change in early 2020, which will be led by a global team comprising experts from the United States, Europe, China, and Japan, and will involve artists, researchers, and activists from twenty-six countries. The 2020 edition will address climate justice and promote creative solutions that address climate change. Titled “Eco-Equality,” the exhibition will highlight cultural institutions and artists that are taking proactive steps to address the issues of climate justice, such as by building more resilient energy systems, diversifying the global population, and using local materials.”The exhibition will feature *Nino Valdes’s Eco-Art, which features contemporary art from the Americas, Asia, and Europe, and will be curated by Sara Cwynar, director of the Biennial. The exhibition will run at the Kunsthalle Basel from November 12–November 16, 2020. The biennial is an annual event that highlights and celebrates the work of artists and thinkers taking a creative risk to address climate justice. “The exhibition focuses on the historical development of climate justice, and how the ever-changing climate system has been affected by Marx’", "The next Biennial should commence in 2022.\n\n\nThe University of the Arts (UVA) in Washington, DC, is launching a new center dedicated to the study of and a photography exhibition of concept photography, “Avant-Garde” (“Avant-Garde”), curated by René Magritte, in collaboration with artists such as María Berrada, Elizabeth Bishop, and Adam Pendleton. The center will be housed in the north wing of the university’s new five-story, seven, and nine-thousand-square-foot building, which opened to the public in November of 2018.The center will partner with the Howard Hughes Medical Institute (HIV) National Museum of Photography to host a retrospective of Magritte’s work, titled “Avant-Garde” (2019–20); a symposium exploring the significance and philosophy of photography in the twentieth century; and a public art installation, “Avant-Garde,” in the courtyard of the UVA, called the “light gallery.” The museum will also stage a series of lectures and seminars on Magritte’s work in the fall of 2020.“", "The next Biennial should be a celebration of the memory of the former directors of the State Museum of Fine Arts, as well as an attempt to redress the imbalance that has existed between the museum’s exhibitions and the public experience of the institution. I believe that the Biennial should be the occasion for a new kind of cooperation between the museum and the visitors, for a new way of working together, and for new opportunities for public engagement with the collections.”The New Art Advisory Council formed by the newly appointed director of the Biennial, Claudouwelmira Nwakali, and academic and curator Sianne Akerman. “The capital is a collective space; it is a space where we can come together and share ideas, a space where we can build our confidence and excitement,” Nwakali said. “This year we wanted to present a new kind of exhibition, a new kind of experience. We asked ourselves how we can be more inclusive, how we can create moments of mutual appreciation.”She added that these sorts of collaborations are not uncommon in Africa: “In many towns and cities across Africa, people are creating new and interesting platforms for exchange between collections.”\n\n\nThe Museum", "The next Biennial should take place in 2021 and will be hosted in the city of Barcelona, Spain. The exhibition, titled “MIDNIGHT,” will feature work by twenty-four international artists. In addition to the festival, there will also be a large-scale installation of work by the sculpture duo Dome Morotti and Lluís Figueroa, a collaboration with the Museum of Modern Art (MoMA), a symposium on modernist design, an exhibition of work by the Los Angeles–based artist and curator Yinka Shonibare, and a film festival.According to the Art Newspaper, “MIDNIGHT’s design process was inspired by the artists who brought together the Satya and Antonia Di Giovanni–designed Medusa, a monumental sculptures of the Venus and the Moon that were erected on the wall of the Villa Borghese, in Rome in the early 20th century. The project was also inspired by the artist’s own childhood dreams, and in the present the dream of the city of Barcelona.”\n\n\nThe Museum of Fine Arts (MoFA) in Atlanta has received a gift of thirty-five works by six African American artists from the Atlanta-born and raised", "The next Biennial should take place in 2022, with the exhibition marking the centenary of Gustave Courbet’s birth. “The most extraordinary achievements of the 20th century are being imagined, and in the next generation, built up, with the help of a collective,” said Birgitta Breitweiser, chair of the committee. “Inventing the spirit of the First World War, now the Centenary of the end of World War II, is to celebrate the infinite possibilities of art and life.”\n\n\nThe Pink Triangle, an annual issue of Artforum that has featured work by forty-four artists in the past twelve months, has announced that it will return to the Minneapolis–Saint Paul area next year, following a hiatus of sixteen years. In the announcement, editor-in-chief Anna Holmes said that the show’s 2019 edition—which was moved to the summer from the fall—was “a reflection of the current moment, a choice between two radically different futures, and a reflection of a world that we are all so far away from,” and that the 2020 event would “reflect the visions of the participants, the themes of the year, and the challenges ahead.", "The next Biennial should be held in 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is again facing backlash after it released an open letter by fifty-three artists and collectors in an attempt to reassure the struggling sector that it is committed to working with the local arts and cultural sector to ensure a stable future for American art, and that it will work with lawmakers to ensure that funds are not diverted from the ongoing coronavirus crisis to political special interests.A letter penned by thirty-four American artists and collectors, including Kevin Beasley, Billie Tsien, Alice Aycock, and Jim Jarmusch, as well as the Los Angeles–based artist and collector Ravi Dey, was sent to President Donald Trump on January 29 and signed by forty-three artists, including Michael Shay, Mike Kelley, Laura Owens, and Mark di Suvero, as well as Bruce Minto, John Kaminski, John Kassel, and Christopher Wool.The letter, titled “We, as a collective, are concerned about the precarious position of American contemporary art,” reads: “As we contemplate the possibility of a timely return to the museum, with changes in curator, exhibition, and collection thinking", "The next Biennial should take place in 2021.  Swansea has also confirmed that it will not be taking part in the forthcoming edition of the annual exhibition, and the British Film Institute (BFI) in London is planning to cancel the event\u0097at the request of the state.The general secretary of the BFI, Maria Balshaw, said: “The future of the festival is at risk. As it stands, the exhibition is currently closed and the organisers are working with the authorities to determine a date for a resumption. We must not allow the authorities to keep us waiting, and we will not allow them to circumvent the State’s legal obligations to protect the BFI.”\n\n\nThe New York City Department of Cultural Affairs (DCLA) announced today that it has finalized a $2.5 billion plan to redevelop the Lower East Side, which has been undergoing a $2 billion expansion since 2009, and was slated to open in the summer of 2021. In a memorandum of understanding (MoU) signed by cultural and economic leaders Daniel Riordan and David Perine, the city and the developer announced that the project will include the construction of a new public realm, a public park, and a new", "The next Biennial should offer a fresh perspective, a reflection of the current situation in the country, with the aim of presenting the most sensitive, pertinent, and original works from the contemporary heritage. Myanmar’s rich heritage provides a compelling backdrop for the work of the artists who chose to participate in an exhibition organized by the Diyanet, which was organized by a group of scholars and artists from the Southeast. “This exhibition is one of the few opportunities for the country to experience the full breadth of artistic traditions,” said Maung Maung, chair of the Diyanet. “We are happy to support these talented artists and to be able to present their works here in the United States. We are also proud to present the work of more than seventy artists, including Wangchuck, Gerety, Minok, and others.”The Biennial will be held at the Diyanet’s new home in Bangkok. It will be held on the Rathbon Ranch, a former Buddhist monastery located near the Khao San Road in the capital Bangkok, and will consist of three phases: 1. A retrospective of the work of the sumupkriya tradition of Southeast Asia", "The next Biennial should take place in 2021 and will also present a retrospective of the work of Mel Chin. It will be on view at the institution until February 27, 2022.\n\n\nThe National Gallery in London has appointed Christopher Wool, the director of the Imageworks at the Metropolitan Museum of Art in New York, as its next director. Wool will be responsible for the development and administration of the institution’s collection, which comprises more than 2,500 works, and will take up the post in January.“Christopher brings with him a history of visionary leadership and a deep understanding of the importance of art in bringing people together,” said Mark Stedel, the director of the Met. “The National Gallery is at the forefront of developing new ways of engaging with life and art, and his broad experience and vision for how we can work together to make a more meaningful and inclusive future for the museum makes him uniquely qualified for this role. I’m thrilled that he will be joining us to help shape the future direction of the National Gallery, and I look forward to working with him.”The new director is also introducing new programming to complement the galleries’ existing collections, which are currently undergoing an expansion and renovation. During his", "The next Biennial should take place in 2020.”\n\nAdvertisement\n\n\nAs a result of the historic status of the museum, and its enduring reputation as a flying-museum, the Tate has won more than twenty-five awards. Titled after the patron saint of mobility, the biennial’s inaugural exhibition, “Dreamland” has been selected for the Sky Arts Award, which honors curators and artists. The Sky Arts Award is one of four Sky Arts Awards, which were established by the Sky Arts Foundation to provide financial support to institutions that are working to make the museum’s Dreamland campus a reality. “Dreamland’s innovative and ambitious plans for the museum and for the new campus together with our trustees, partners, and staff will enable the Tate to become a leading international cultural institution,” said Peter Gural, chair of the Foundation.\n\n\nThe Smithsonian American Art Museum (SAM) in Washington, DC, has welcomed Stephen Derber to its staff and has appointed him as its new deputy director for curatorial affairs and chief curator. Derber comes to the institution from the University of California, Berkeley, where he has served as an assistant curator at the Berkeley Art Museum in California since", "The next Biennial should be held in 2020. “I’m very excited to start this new chapter with our wonderful partners at the National Gallery of Canada, and to continue to develop the exhibition program of the 20th Biennial at the National Gallery of Canada,” said Victoria Miro, chair of the Board of Trustees of the National Gallery of Canada. \n\n\nThe Museums Association (MA), the US’s professional trade group for museum professionals, has urged the government to create a new $1 trillion fund for museums by March 2021. The fund should be set up through legislation, and would allocate $1.2 trillion for museums, including $950 billion for museum construction and operations, and $490 billion for museum acquisitions. MA president and CEO Ed Moses said: “This is a moment of great change for the United States, and I’m hopeful that this new fund will continue to foster a strong and meaningful collection and exhibition program, while ensuring that we maintain a strong and meaningful role in the world for future generations.”The fee plan was crafted after US lawmakers enacted a $1.2 trillion federal stimulus package in January 2021, which opened up new federal funding", "The next Biennial should focus on urban planning and the social and political connections between art and the field of architecture. An exhibition of work by artists and architects in the exhibition should be held as soon as possible.”\n\n\nThe National Gallery of Scotland has appointed Lesley-Anne McKinn as its new director and chief executive. McKinn succeeds Simon Weston, who was appointed in June 2019, and will begin in July. She succeeds Tom Mather, who has led the institution for twenty-nine years and is rumored to be the next to depart.“With a wealth of experience across roles from chief executive to director, we look forward to successfully supporting the National Gallery’s vision of creating new and exciting performances, exhibitions, and collections,” said McKinn. “I’m sure that Lesley-Anne’s passion and commitment to the National Gallery of Scotland, as well as the institution’s role as the National Gallery of Art in London, will continue to move us forward.”\n\n\nArt historian Yael Hochstein, a former curator at the Kunsthalle Basel, Switzerland, has been appointed director of the Wolfenbauer Kunstverein Münster in Germany. Hoch", "The next Biennial should take place in 2020. “We are looking forward to continuing our work with the gallery and the international community to change the way people think about the exhibition, and to enrich the exhibition through new teaching and research,” a statement from the Biennale said.The announcement follows the biennial’s first New York exhibition, which opened on October 27, 2019 and featured work by artists Kenneth McLeod and Alex Prager. The exhibition opened at the Brooklyn Museum in partnership with the Brooklyn Academy of Art. \n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Naomi McIntyre as its next director. McIntyre will begin her position in January 2021.“Over the past few years we've had a high-quality, if not the highest-rated, women’s museum on Boston’s campus,” McIntyre said. “It’s a compelling story of a Museum of Art dedicated to the arts, and the museum’s powerful, visionary, and forward-thinking feminist mission, built on the back of a dedicated creative and community-building team. I’m honored to be a part of it.”Inaugurating the Museum of Fine", "The next Biennial should be a milestone for the city, one that will present the history of the Biennial to the world. “Over the last twenty years, we have worked tirelessly to present the Biennial as a living thing, a living city, and as a site for dialogue and reflection on the narrative of African art,”  Bishop Desmond Tutu, the president of South Africa, said in a statement. “This year’s edition marks the centenary of the formation of the South Africa’s National Gallery, and the next one will be a watershed moment for our nation.” The first edition of the biennial, titled “South Africa: A Multidisciplinary Documentary,” was held at the Museum of Modern Art in Johannesburg in 2006. The 2019 edition will welcome an additional sixty-nine artists and critics from twenty-two countries and territories.\n\n\nThe Association of Independent Curators (AIC) has announced that Annette Degenhardt has been awarded the $500,000 Artistic Director Award. The recipient of the award will be chosen by the AIC Board of Directors and is a curator who has had a significant and ongoing impact on the", "The next Biennial should be held sometime in 2022.  The exhibition will kick off with a presentation of the work of the artist Li Muyang, who is known for his landscape paintings that address urban concerns such as pollution and climate change. The Biennial will then move to the Maritime Museum, Beijing, and will culminate in the exhibition of �Alfred Krupp. Life, Dream, and Dead,� which will pay homage to Krupp’s practice by presenting an exhibition of nine paintings by the artist over the course of twenty years. The exhibition will take place at the Maritime Museum in Beijing from January 21, 2022 to March 26, 2023.\n\n\nThe National Gallery in London has appointed Richard Hirst as its new chief executive. Hirst is the first person appointed to the position since the current director, Sianne Abney, departed the institution following a year-long campaign after she accused the museum of supporting anti-British politics. In an interview with the Art Newspaper, Hirst said: “I can’t tell you how many people think the National Gallery is anti-British but when I’ve sat down with the director, Charlotte Fox, and given her a year of their work and", "The next Biennial should take place in 2022, at a site in the heart of Lisbon. Biennials in Beijing and Los Angeles have also been on the drawing board for years, but their designs are far from done, and the construction of a new exhibition space in London remains a possibility.\n\n\nThe Museum of Fine Arts Boston (MMAD) is preparing to reopen to the public in the fall with a new version of the richly imagined institution, “The Story of the Museum,” that will include new works by artists such as Marilynne Vreeland, Marcel Proust, and Pierre-Auguste Renoir. The exhibition, titled “The Story of the Museum,” will run for ninety days and will feature work by twenty-seven artists, including Ed Moses, Tanya Cooper, and Kiki Smith, as well as a selection of works by contemporary contemporary designers such as Minimalist collective members Christine and Jon Benjamin, and Jonathan Newbury.“I’m very excited to begin the exhibition and bring together the works of the most talented artists in the city,” said Mpagi Sepuya, the museum’s director. “The theme of the exhibition is to invite the audience", "The next Biennial should take place in 2021. The exhibition will mark the fifteenth edition of the biennial, which will be hosted at the Falkenstein-Gramerischer Kunstverein Münster from May 26 to May 29, 2021. The event will also include the first show of work by three artists from the Biennial: Henning Schmidt, Andreas von Bacher, and Christoph Neumann.\n\n\nThe Metropolitan Museum of Art in New York has agreed to sell more than one hundred works by Italian artist Giorno, a staunch socialist who shaped the Italian Modernist movement of the 1960s, to the US government for $3.5 million. The donation, made in March 2019, will allow the Met to establish a new center dedicated to Giorno’s art, the New Museum, and the Metropolitan’s collection.Giorno’s son, Giorno Savino, will chair the new institution. The institution will also receive a gift of modernist architecture and design, which will be divided between the Giorno Foundation and the family.The gift includes the works of Santiago Marzio, Vincenzo Cipolletta, Arnaldo Cipollett", "The next Biennial should conclude with a public performance of the play The Freer, 2018. The work was a collaboration between artist and composer Nikolai Nikols and is an adaptation of a poem by the Russian philosopher Aleksandr Dugin. The duo created a new piece for the exhibition in response to the growing awareness of the importance of art in the fight against fascism and communism in Russia. Dugin’s poem The Church and the State, 1963, was republished by the Russian Academy of Arts in Moscow in 2017, and before that in 1970s-era Warsaw State University. The artist has also been featured in long-running international projects such as “Exhibition Series,” an annual show at the Museum of Modern Art in New York from 2006 to 2009, and “Innovation (Art),” an exhibition at the Museo Ermita in Rome from 2012 to 2013. The biennial will run from March 21 to March 28, 2020. \n\n\nThe fourth edition of the Venice Biennale—which was canceled in April due to the coronavirus—has been postponed again. The event, titled “Brasileiros Europei,” was initially set", "The next Biennial should be held in the Spring of 2020. We invite you to the next event.\n\n\nThe Museum of Contemporary Art (MoCA) in New York has given the green light to a $7.5 million expansion that will bring the institution more than 2,500 square feet of exhibition space and increase the size of the museum by more than three hundred feet. In a statement, the institution said that the decision to expand the museum was made in order to meet growing demand from artists and institutions who desire to see more works in the museum’s marquee space.According to Artnet, the museum has been working on the project for six years and recently delivered a major redesign to the museum, which is located on the ground floor of a former CCA building in the Tisch building on West Twenty-Third Street in Manhattan. The redesign includes the addition of a new entrance to the building, a more expansive lobby, and a second floor dedicated to education and public programming. The museum also hopes to open a new, seventeen-thousand-square-foot glass-enclosed hall decorated with thousands of memorabilia from the museum’s collection.The expansion, which will add a seventh floor dedicated to performance, will replace the existing Bi", "The next Biennial should be held in 2024. The venue for the 2020 edition, titled Bienalis:Todos al más grandes, will be curated by Lutte de France, which will give the event an 11th edition in Shanghai in 2022.\n\n\nThe opening ceremony of the fourth edition of the Venice Biennale will feature a performance by the Canadian band Run the Jewels, which is slated to open on January 29, 2020, and take up the theme “Roots,” a controversial concept that has been around since the 1920s.Dubbed “Roots,” the exhibition will showcase “stories of plants and animals, their relationships with their surroundings, and the links between people and their environment,” according to the organizers. The project was inspired by the decision by longtime artist Richard Avedon to leave his home in the Toronto suburb of Mississauga, Ontario, to work with local elders to plant a tree that would provide shade for the community of his choosing. Speaking to the Star, Run the Jewels frontman and poet Ryan Tedford said: “We knew we had to do something about the air, the water, the land, the earth", "The next Biennial should include an exploration of the relationship between art and politics. The biennial will also be a platform for political engagement and an instrument of change. The theme will be “art and politics in the twenty-first century.” The 2019 edition of the Biennale, titled “The Document,” was curated by Mario Bellan and Abu Alaa. The event will run through October 14.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has appointed Marisa C. Bailey as the new curator of modern and contemporary art in the museum’s collection. Bailey joins the institution from the University of Washington, where she has served as a curator of prints and paintings for the past twelve years, and will assume her new role on October 11.“We have had an outstanding curator on staff for twelve years, and have been fortunate to have her continue to be a valued member of our team,” said Richard L. Johnson, chair of the museum’s board of directors. “Marisa’s dedication to supporting our curatorial team and the museum’s collection has been instrumental in the museum’s continued growth and success. We are extremely proud of", "The next Biennial should be set up to examine the history of the first exhibition and its continued relevance to contemporary issues, and should consider how the exhibition could be more effectively integrated into the city’s cultural life.”\n\n\nThe British Museum in Cairo has added two new works by artists such as Rayyane Goulburn and Alex Katz to its collection. The galleries will stage the first exhibition dedicated to the art of collage in the country in 2020, and the second exhibition in 2021.Goulburn, who was born in central Africa, has recently been embraced by the West and the East. In an exhibition at the Hammer Museum in London, the artist was selected as the winner of the next Geffen Biennial. A solo exhibition at the Museum of Modern Art in New York and the Abu Dhabi Museum of Art were also nominated.Goulburn, who works primarily in oil painting, textiles, and collage, said: “As a whole the work is meant to express a sense of intimacy and intimacy is to express a sense of care and care is to express a sense of compassion and compassion. . . . It’s a way of gesturing towards a more inclusive and less exclusive future.”\n\n\n", "The next Biennial should focus on “Legacy” (2019), which is currently on hiatus due to the coronavirus.  “Legacy’s future is uncertain,” said Anita Subramanian, director of the Art Gallery of Ontario. Subramanian cited the state of the art and the current curatorial climate as factors that could slow the reopening of the gallery.\n\n\nThe Museum of Fine Arts (MFA) in Boston has announced that it is reopening to the public in mid-March. The March 19 opening date was selected as the date for the museum’s upcoming general meeting of the museum’s board of directors, which will take place on March 22. The meeting, which will comprise visiting artists, collectors, and museum professionals, will be hosted at the museum’s first location in Dorchester, as well as at the close of March 15.“The MFA’s new mandate opens up an opportunity for critical thinking and artistic experimentation that we have not had since the museum’s founding in 1835,” said board president Rachel Weisz. Weisz also noted that the MFA serves as a “living laboratory”", "The next Biennial should be held at the Museum of Fine Arts, Boston, in the fall of 2020. The 2020 exhibition will include fifty works by twenty-four artists, including Anthony Cadman, Carlos Castaneda, Christopher Wool, and Pilar Corrias. The twenty-nine-minute video exhibition is titled Lies. \n\nThe Science Museum St. Louis in Missouri and the Museum of Fine Arts, Denver, respectively, have announced that they have received a gift of eighty early works from the artist Pamela Sargent. Featuring work on paper and oil, the works are from her collection that date between the years of 1910 and 1936. Sargent, who was born in St. Louis in 1941, began collecting art in the 1920s and is one of the earliest surviving members of the American Modernism movement, a term coined by American Art historian Cathy Wilkerson in 1952 to describe a collection that consists of works on paper, paintings, drawings, and sculptures. Sargent was a prolific collector, with works in the collections of numerous institutions, including the Metropolitan Museum of Art in New York, the Metropolitan Museum of Art, the Museum of Modern Art, and the Stanford Art Museum in California. She is survived by", "The next Biennial should be in January 2021 and will be held at the institution’s campus in Pasadena, California.The theme of this year’s event is “Creative Destruction: From the Anthro to the Present,” along with a special exhibition featuring works by four artists, including Kiki Smith, Isamu Noguchi, and Mary Cassatt, who will be on loan to the Biennial from the Museum of Contemporary Art in Seattle. “Maria Bocconi, Joëlle Paillard, and Pierre-Luc Godard are among the artists whose work we will be privileged to present at the Biennial,” said Audrey Broad, chair of the board of trustees.Bocconi, Paillard, and Godard are among the group of thirty-four artists whose works will be included in the exhibition “From Anthro to Present: Art as a Metaphor,” which will be organized by exhibition director Harald Szeemann. In addition to the two-part exhibition, an online version of the show will also be published by the artist’s lawyer, Antoine Brouwers, and will be available for free download. The show will open with a presentation", "The next Biennial should be held in 2020 and will focus on the history of the museum’s curatorial staff and the exhibition program. The seventeenth iteration of the exhibition will be held at the CAA San Francisco in 2020, and it will feature the work of seventy-eight artists, including Joe Sacco, Craig Thompson, Hayao Miyazaki, and Frank Gehry.\n\n\nThe Huntington Library and Museum in West Virginia (HLM) has launched a new digital platform that will allow visitors to see and purchase artworks on display in its collections. The platform, which will be called ArtView’s, will enable museums to showcase their collections on digital platforms and to offer tours of the Huntington Library and Museum. The Huntington Art and Collections Partnership (HACP) has developed a new digital platform that will allow visitors to view artworks in the collections of other institutions and to purchase artworks. The platform, which will be called ArtViews, will allow museums to present their collections on digital platforms and to offer tours of the Huntington Library and Museum.Each week, ArtViews will feature ten works by seventy-eight artists. The works will be presented in a variety of media, including film, photography, video, and", "The next Biennial should be in 2020. “I want to see a physical manifestation of the Art of the Arts on the campus of the Museum of Contemporary Art Shanghai,” said the architect, who was awarded the second prize in the inaugural ceremony. “I want to see the Art of the Future in the Museum of Contemporary Art Shanghai.”\n\n\nThe Virginia Museum of Fine Arts in Richmond (VMFA) is facing backlash from arts and cultural organizations and lawmakers across the state after it removed a work by James Turrell—a prominent African American artist who had his work displayed in several major exhibitions at the VMFA between the years of 1963 and 1966—from its collection on Tuesday, October 17. “By eliminating his work, the VCFA is showing that it still views race as a critical factor in museum selection,” said Peter Wootton, the chair of the board of trustees of the Virginia Museum of Fine Arts (VMFA). In a statement, the VCFA said that the decision to remove the work was made in light of the “continuing racial injustice and discrimination in our society.” The statement continued: “The VMFA believes that all members of the community are entitled to have their artistic interests", "The next Biennial should take place in the autumn of 2020, and the event’s \"platform\" should be a museum open to the public. The platform will consist of a series of exhibitions that will be organized in a biennial-like manner. The first show will focus on “A Thousand Years of Chinese Painting” (1937–1939), and the second show will be “Reproduction in Life” (2019). The exhibition will be on display in the museum until November 21, 2020.This biennial is part of the 2018 Art Basel Hong Kong (ABHK) initiative, which aims to deepen the connection between art and society in Hong Kong through a global community-based network of international artists. Last year, the exhibition featured the work of forty-eight artists, including Robert Irwin, Achim & Karina, Basir Katran, Chanel Chalmers, Cao Cao, Cao Yu, Kasmin, Jake Davis, Javaro Dallorto, Kasmin, Luis de Jesus Perez, and Liu Dong.\n\n\nSwiss artist and curator Klaus-Otto Koenig, who represented Switzerland at the", "The next Biennial should be held in 2020–20 and will be guided by a new work, entitled The Essence of Art (We are), by the artist Yinka Shonibare, and the documentary film The Last Time, by the Japanese director Yuji Noda. \n\n\nThe Brooklyn Museum has enlisted three new artists to its curatorial team: thirty-three-year old artist-in-residence Sabrina Trew in its Design and Architecture department; Sean Parnell in the Collections and Archives Department; and eighteen-year old Kandis In Manhatten, who will work with the public and institutions across New York City in conjunction with the upcoming exhibition of Japanese artist Kisenosato, which runs through March 10.The museum is also expanding its curatorial team’s responsibilities through the formation of a new group, the Design and Architecture Definition Group, which will work across the museum and the city to better understand and interpret the meaning of the words and concepts used in museum presentations. In addition to organizing symposia, workshops, and symposia are creating the center’s own digital portal, which will allow visitors to explore the work of each artist in greater detail.The group’s inaugural project will", "The next Biennial should be held sometime in the first half of April. “The upcoming edition of the Arts Biennale will offer an exciting mix of contemporary art and art history,” said Art Basel Hong Kong Executive Director Maria Hsu, adding that the event would “provide an opportunity to address various issues of contemporary art and to connect with and showcase artists from different countries.”\n\n\nCiting the health of the artist-manager Andrea Giunta and the company’s brand, the New York–based nonprofit jewelers Alexander & Anne Mather have pledged to donate $1 million to support the advancement of social causes through the collection of artworks in the works of artists whose work is currently on display in the company’s New York gallery. The commitments came after an announcement in March, made by Alexander & Anne during an event at the Manhattan Museum of Art, that it would donate $1 million to various charitable causes.The donation followed a yearlong partnership between the two organizations, which was launched to improve the lives of communities by bringing artists and their works to the gallery. The fund will also go toward the care and treatment of Giunta’s great granddaughter, Maria Giunta, who passed away in 2016", "The next Biennial should be in May 2020.\n\n\nThe Bicentennial of Contemporary Art in Prague, which was set to open in May and run for twelve weeks, has been postponed to March 13. Its twenty-second edition, which was scheduled for April 5 to April 8, 2020, was also postponed.The thirteenth edition of the Bicentennial Prague was originally scheduled to be held from March 13 to March 20. However, a fire broke out at the museum on March 7, and the event has since been put on hold. The twenty-fourth and twenty-fifth editions of the city’s largest art fair have yet to be held, and no further details about the events have been released.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, has released a new set of guidelines for the display of works by American artist Joan Marcus. The guidelines, which are based on the artist’s 1967 book The Life and Death of American Art, were developed with mavens from the firm that designed the exhibition, which was to be titled “The Meaning of Life,” and were published by the curator and educator Paul Mpagi Sepuya, who is also the founder of the American Art", "The next Biennial should see the reopening of the Biennial of Modern Art, of which there is presently no successor. The only thing in between, according to the architects, is the time of the exhibition.” In a separate announcement, Štobias Poznanski, the director of the Museums Museum Vrba and Vrbena, has also called for the closure of all museums by 2020 and the reorganization of the museum system in the country. The proposal follows the outbreak of the coronavirus, which the World Health Organization (WHO) estimates will kill one in every four people in the region by June 2020.The announcement comes amid a political crisis for Poland, which is currently negotiating a budget for its 2020–21 fiscal year that will address the escalating crisis caused by the coronavirus. According to the New York Times, the government is preparing to lay off many of the approximately one hundred public sector workers affected by the virus as part of a restructuring that will also see the privatization of a number of government entities. However, a new law passed on March 16 stipulates that the government will only be allowed to lay off workers it identifies as a direct result of the coronavirus—a provision that will allow the government to", "The next Biennial should take place in 2020. The museum will host another exhibition, “The Uncertain Future of Design,” at the same time.\n\n\nThe National Maritime Museum in the Scottish city of Inverness, which was scheduled to reopen in April 2020, will not be reopening this year, the Scottish National Party (SNP) has revealed.The National Maritime Museum, which consists of two buildings, the museum and a bookstore, has been closed since January 18 because of the coronavirus. The museum’s last exhibition, “Big Fish,” took place in February 2019. The problem with the exhibit, a collaboration between the museum and the city of Inverness, was that it only featured ten of ninety-eight of the museum’s former employees.“This is an unprecedented situation for the National Maritime Museum,” a spokesperson for the museum told the Art Newspaper. “This is not normal.” The museum, which was founded in 1851, announced that it would also be suspending the operations of the museum and the bookstore. The institution’s revenues have been adversely impacted by the Covid-19 pandemic.According to a report published by the University of Aberdeen,", "The next Biennial should be held at the Kunsthalle Basel in Switzerland from March 29 to March 31, 2020. The program will include the exhibition “The Uncertain Future of Art” and “The Artist’s Body: The Death of the Body from the Renaissance to the Present.”The show will also introduce the first digital platform to the exhibition and will showcase the works of ninety-nine artists. The theme for the 2019 show, “The Body and the Muse,” was “Light and Motion in Architecture and the Body” and it will be followed by “Time and Movement in Art” in 2020.\n\n\n\n\n\n\nBenjamin Kipchik, who was a visiting assistant professor in French at the University of Chicago, is suing the institution to recoup more than $20,000 in tuition and fees he claims he paid during his three-year tenure at the university; it is also demanding that the university provide him with access to the campus once he steps down from his current position in January 2021.Kipchik, a Chicago native, has filed a lawsuit in Federal District Court in Chicago alleging that the university is violating his constitutional rights to due process and equal protection by removing", "The next Biennial should take place in the spring of 2021.\n\n\nThe National Portrait Gallery (NPG) in London is planning to open a new contemporary art museum in the city’s Hyde Park. The new venue will highlight work by women artists and will have its own rooftop bar. The institution has employed a number of artists to create works that will be featured in a new retrospective of their work scheduled for March 27–March 31, 2021.The new museum will be built in a former quarry at 533 Hyde Park, a former textile factory, and will boast a gallery with a 13,000-square-foot exhibition space. The exhibition space will be located in a converted barn and will be flanked by two public gardens. The institution hopes to present at least one hundred works by artists in the next three years.“We are working closely with the local architects, designers and artists to deliver a new National Portrait Gallery in a unique and enchanting setting in the heart of London,” museum director Maria Balshaw said. “The National Portrait Gallery is an internationally-recognized and beloved institution and is an integral part of the National Gallery of Art’s rich history. It will focus on presenting the work of", "The next Biennial should be held in 2022. The next edition will be hosted by the same venue next year. \n\n\nThe Seattle Art Museum (SAM) is asking the public to help raise $1 million for its construction and renovation needs in the wake of the ongoing crisis. The institution is seeking $3 million from the Seattle Arts and Heritage Coalition (SAAC), which is advocating for a $500,000 grant from the city in support of the restoration and improvement of the institution, and $1 million from the Seattle City Council.“While the city’s exploration of the potential for new facilities has been slow, we are actively seeking new funding opportunities to accelerate the mission of the museum,” said director and CEO Michael Govan. “Our goal this year was to raise $500,000, and we succeeded, making the institution a critical cultural resource for our region. The new building, designed by the same team that designed the museum’s previous building, will provide new opportunities for audiences to experience the museum while it remains open. We are also planning for a future in which the museum continues to thrive in a city where it has strong cultural identity, its programming continues to be robust, and its financial impact on the city is", "The next Biennial should be held in the coming months. Tad Smith is the artistic director of the Indian Institute of Art, New Delhi.  His new initiative, which was recently launched by the Institute of Contemporary Arts in London, aims to support local artists and institutions in the United Kingdom by bringing them together with director Sir Richard Johnson to create a new exhibition, a film, or a performance. Smith gave a presentation at the inaugural event in February and has since been collaborating with Johnson on creating exhibitions and projects that engage with the cultural and biennial experiences of the UK. The show is titled The Time Is Now, a collaboration with Kunal Ghosh of the Institute of Contemporary Arts, New Delhi. The project was inspired by a documentary about the life of British artist and activist László Szeemann, Live Life, 1978–1990. The film also featured lots of previously unseen works by artists including Ron Gorchov and Gertrude Stein. The exhibition was curated by Maryam Mirza, director of the British contemporary art museum National Gallery Birmingham, and is on view until October 21.\n\n\nArt Basel Hong Kong has announced that it is re", "The next Biennial should take place at the Museum of Modern Art (MoMA) in New York in 2021.\n\n\nThe Department of Culture, International Education, and Sport (DiC) in Abu Dhabi announced today that it is planning to launch a new social media platform, the Disseminar, to help preserve and organize the National Museum of Modern Art and the National Museum of Ancient Art in Paris. The site-specific platform will be launched via an online portal created by the Ministry of Culture and the Ministry of Education.The platform will allow visitors to explore the collection and exhibitions of the two institutions, which are currently closed until July 18. It will also offer users the ability to create and share public collections and will be able to adapt to different online viewing habits and usage patterns.“We recognized the importance of making the National Museum of Modern Art and the National Museum of Ancient Art in Paris accessible to every citizen and wanted to create a unique platform to share with our visitors and communities,” said Edwidge Danticat, director of the National Museum of Modern Art and the National Museum of Ancient Art in Paris. “We are very excited to see the immediate response to the platform and are confident that the platform will become a great platform", "The next Biennial should be held in 2021. The exhibition will feature work by twenty-two international artists, including László Molnar, Roberto Clemente, Alex Halder, Zina Saro-Wiwa, Zinaida Saro-Wiwa, Kasmin, and José Luis Perón.\n\n\nThe Museum of Modern Art (MoMA) in New York has announced that it is planning to shutter its flagship location in the city in 2020 and construct a new museum in the neighborhood of Roosevelt Island called MoMA West. The announcement follows the museum’s decision to end its residency at the Queens Museum in Manhattan and move its new headquarters to a larger venue in the city.The institution has been working on the redesign of its buildings for several years, with the latest iteration of the project showcasing the work of seventy-three artists across four continents. The redesign, which was completed in 2016, featured new galleries, new exhibition spaces, and new public conveniences. The museum was also awarded $5 million by the New York City Council in support of its redesign efforts. The September 2020 issue of Artforum featured an article by David Guralnick, who designed the original museum, describing the experience of", "The next Biennial should be held in 2021.\n\n\nThe National Museum of Modern Art (MMAM) in Washington, DC, has announced that Teju Cole, the curator of modernist art at the museum, has been appointed as its next executive director. Cole has been the museum’s curator of modern art since 1993 and has served as the director of its Modern Art Gallery since 2015.“We are thrilled to welcome Teju to the museum as its new director and are confident that the museum will continue to expand and develop as a major cultural resource for the city of Washington, DC,” said Elizabeth G. Fobert, director of the National Museum of American Art. “Teju’s impressive curatorial practice and her proven commitment to supporting the mission of the museum sets him apart from his predecessors and leaders in modern art.”Cole previously served as the curator of modern art at the Metropolitan Museum of Art, where he helped organize the exhibition “Power of Paintings: Modern Art from the 1960s to the Present” in 2017; as a senior curator at the Boston Museum of Art in Boston; and as the curator of paintings at the Metropolitan Museum of Art, which he was appointed director of in 2019.", "The next Biennial should focus on “inspired art,” a theme that will not only include works that are inspired by or based on contemporary art, but also work by artists who have previously been neglected by mainstream exhibitions. David G. Pfeifer, the president of the Whitney Museum of American Art, said: “We are delighted to return to New York and to the Hudson Valley for a second edition of the Biennial. It is a tremendous honor to return to the city where I have lived and worked for nearly seventeen years. Art and architecture come together in transcendent, and often miraculous, ways. The exhibition is an ideal opportunity for the city to celebrate the art of David Geffen and to reflect on our shared history with David and the Biennial.”In the 2017 biennial, Riley showed her experimental “Theater of Operations,” a performance, created with collaborators including Patricia Alonzo, that explored the relationship between the military and intelligence services, and the director of the biennial, Leonard Cohen, whose work is represented in The Black Dahlia Collection, the New York Public Library. The 2018 biennial, which was organized by Institute for Contemporary Art, New York,", "The next Biennial should take place at the Museum of Modern Art in New York but has been postponed due to the Covid-19 pandemic. The twenty-fifth iteration of the event will now be held at the Los Angeles County Museum of Art (LACCA). The full list of participating artists is as follows: Santa Barbara MC Tamar Braudy (CA) Cindy Sherman (US) Scott Ruck (US) Vincent van Gogh (US) Bernardo Villalobos (US) Marianne Ott (US) Robin Western (US) Nancy Whittlesey (US) Merry Whittlety (US) Willie Wilbur Wright (US)\nSubversive Film Festival at the Art Institute of Chicago (AIC) The 2019 edition of the Subversive Film Festival will feature critical reviews of twenty-four films\u0097including The Fifth Element (2016), A Man in Paris (2017), and An American in Paris (2018)\u0097as well as live performances, interviews, a reading of a selection of texts on the film, and a discussion with John Zerzan, president and director of the Art Institute of Chicago. The event will be held", "The next Biennial should take place in 2020.<|endoftext|>Nirvana’s Art Museum in Tulsa, Oklahoma, closed on January 21, 2019 due to low attendance and financial concerns, and on Monday it reopened with a new half-hour special, “No Surprises,” directed by Tony Parsons, titled “Nirvana,” which premiered at the museum on January 18. Titled “Nirvana’s Art Museum,” the special will consist of two videos, a selection from director Carl Jung’s book The Secret of Life, and a live performance by artist and musician Frank Zappa. After meeting with the board of trustees of the Art Museum in February, Parsons said that the museum had invested in long-term support for the institution as it strives to “break free of the cycle of decay” and “re-create life.” He also voiced concerns about the museum’s financial situation since the institution recently laid off twenty-six employees, with forty-three layoffs being tallied. Honored to have my first show here in the late’s’s’s? Frank is a master of the art of the simple and he has created", "The next Biennial should take place in 2019 and will be hosted by the Museum of Contemporary Art in New York, which is currently renovating its headquarters. The rebuilding project will also include the construction of a new 360-degree glass-enclosed exhibition space, the redesign of the museum, and the preservation of the curatorial team’s archives. While the renovation of the museum was already underway, the museum did not move forward with the exhibition program. “We are thrilled that the art of Biennials will be showcased in this new and expanded fashion at the Museum,” said Russell B. Brown, director of the Museum of Contemporary Art. “The theme of the forthcoming exhibition is the future of the body and this is an ideal time to showcase it in the form of a permanent collection of art.”\n\n\nThe Los Angeles County Museum of Art (LACMA), which closed its doors on March 9 due to the Covid-19 pandemic, has announced that it is expanding its collection by tenfold, bringing together more than two hundred artworks by forty-six artists from nine cities across the globe. Launched by LACMA’s architect-in-residence, Justin Brown, the initiative,", "The next Biennial should take place in 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Zach Braverman as its next executive director. Braverman, who has been at the helm of the museum since January 2019, has been recognized for his leadership and innovation in the field of contemporary art at the institution since 2016. He was unanimously nominated for his leadership and vision, and was selected as the 2020 winner of the $20,000 Patrons for Art Prize, which was presented by the Patrons for Art Foundation.“Zach has built his institution into a world-class cultural destination that is dedicated to supporting the creative and performing arts in every way possible,” said John Berry, chair and CEO of the Patrons for Art Foundation. “At this pivotal moment in our history, when the world is experiencing unprecedented challenges such as the coronavirus pandemic, and arts and culture is facing ever-increasing uncertainty, Zach is a star for the field, and we look forward to working with him to build upon the impact of his new position.”Braverman will take up the post on January 28. While at MoCA, Braverman helped the museum raise more than $200 million for", "The next Biennial should take place in 2020 and will comprise of twenty-three performers. They will then be invited to present a retrospective of their work at the museum\u0097the venue for the upcoming exhibition “Art and the Body: Selected Biennial Performances,” curated by the artist Anna Prosser, at the New Museum in New York, in 2021. The New York installation will inaugurate an exhibition of work by the forty-six artists selected for the 2021 show. A special exhibition of work by the artists selected for the 2020 show will also open at the exhibition’s inaugural location in December 2020. The artists selected for the 2019 show were: Sara Bolanos, Yelena Chikovski, Yuri Geras, Yoshitomo Kamijo, Viktoria Kirillova, Hiroshima Kiichi, Hiroshima Leji, and Katherine Ryan. The 2019 show, “This Is Not a Game: Biennial Performances” was organized by the biennial of the artist Oksana Stankovic, and was held at the Museum of Modern Art in New York.\n\n\nThe National Museum of Women in", "The next Biennial should be held in the city in 2021. A full list of participating artists is as follows: ST. ELISE, New York: United States Museum of Fine Arts (USMFA) (Library of Congress) (Library of Congress) (USMFA) (USPCC) (USPCC) (USPCC) (USPCC) (USPCC) (USPCC) (USPCC) (USPCC) (USPCC) (USPCC) (USPCC) - 2018-19, 2019-20, and Winter 2019. \n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Nathan Brown as its next director and CEO. Brown is currently the deputy director and chief curator of modern and contemporary art and is the first African American to hold the position. He succeeds Alexandra Ober, who died in October 2019 after a long battle with cancer.“Nathan has been instrumental in the organization’s recent expansion, which has seen the MFA’s footprint expanded from three acres in 1972 to 700,000 square feet in the center of the museum�", "The next Biennial should host a film by American artist, curator, and theorist, Kiki Smith; a keynote address by the French artist, scholar, and theorist Edresse Bondignest; and a special exhibition of work by British artist David Hockney. The thirty-second edition will be held at the Centre Pompidou in Paris, and the forty-first at the Museum of Modern Art in the United Kingdom. The artists chosen for the 2021 iteration are Matisse, Dali, Aragorn, and Ötzi.The biennial will feature contemporary works by sixty-eight artists, including Giacomo Balla, Alighiero Chiavetti, David Brennan, Adam Clayton, Naomi Douglas, David Crowe, Lena Durov, Alighiero Giugiaro, Sergei Kharlamov, and Sam Gilliam.The event will unveil the 2021 biennial calendar: June 2020 “The British Museum’s Mark Rylance: a contemporary exploration of the human condition”June 2019 “Jeff Koons: The Life of Curviture”June 2018 “Fernando Pascual: The Power of the Mirror”June 2018 “Marc-Oliv", "The next Biennial should be held in 2021. The biennial will take place in the city of Barcelona, in the region of Aragon, and will be organized in collaboration with the local municipal council, the local cultural space, and the local municipality. The theme of the exhibition will be “Theses Unfinished Business” and will involve the artists who have not completed their works, and will include a selection of members of the family of the late philosopher-histor, Eduard C. Pérez de la Peña, as well as one artist whose work is currently on display at the exhibition. “The exhibition will be organized in such a way as to create a dialogue within the city of Barcelona, with a view to creating new projects,” said Alinecio Palma, the director of the architect-organized exhibition. “The exhibition will consist of three buildings: a museum, an exhibition space, and a museum. The museum will be a building with new research and a new collection. The exhibition space will be a space for the exchange of ideas, and will be connected by a balcony. The museum will be a space for the further reflection of the artist’s and will be made up of a series", "The next Biennial should be held in 2020. For the past twelve years, the museum has been in the process of revitalizing its campus. Its current exhibition, “The Animal Kingdom: From Theory to Reality,” is a collaboration between art historian and architect Kiki Smith and will open in 2021. The new exhibition, which will highlight work by artists such as Pierre-Auguste Renoir, Franz Kunder, and Ed Moses, will begin on September 12.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it is planning to create two new positions specifically dedicated to women artists, one at the institution and one outside of it. The appointments will be made simultaneously, with the exact dates for the center still to be determined, and will be announced later this year.“We are thrilled to announce that our current curators, artists, and staff will have two new positions in 2020, as one of the museum’s curators and artists, and as a result the center will be undergoing a great transformation as we continue to present the art of women artists,” said MoCA director Manal Carra. “The new positions will help us accelerate our progress toward becoming an institution that emphasizes the contributions", "The next Biennial should take place in the spring of 2021.\n\n\nThe British artist Stephen Dixon, whose bizarre, all-encompassing sculptures, often composed of overlapping geometric forms, often packed their bodies full of moving parts, has died at age eighty-eight.Born in London in 1939, Dixon moved to New York in the 1950s and moved there, in the 1960s, to the Bronx, where he eventually landed in the city’s Metropolitan Museum of Art. Founded in the Bronx in 1968, Dixon’s sculptures, which can be found in the collections of the Metropolitan Museum of Art, the Metropolitan Museum of Art, the Whitney Museum of American Art, the Metropolitan Opera House, and the Metropolitan Opera, and are housed in the Metropolitan Opera, the Museum of Modern Art, and the Getty Museum. In 2015, the museum revealed that Dixon’s pieces would be included in “Uncanny Valley,” an exhibition organized by the Getty to commemorate the 150th anniversary of its founding. The show opened in February 2019. The next year, the Getty announced it would participate in a thirty-six-city tour of Dixon’s studio, which would be hosted by the Getty in March 2020. The tour focused", "The next Biennial should take place at the Museum of the African Diaspora (MASP), in collaboration with the Diaspora Center, in New Delhi, India. The exhibition will include the work of forty artists from Africa and the Diaspora, and will be curated by the MCA graduate students and graduate staff. “The upcoming exhibition draws from a wide and deep pool of work and has been conceived in the spirit of the MCA’s practice, which is often rooted in the role of artists in the cultural and social fabric of South Asian communities and communities of color,” said MCA director Satyabhushan Das.  The exhibition will also include a film by the artist and director Kala Mangia, whose first feature film, The Elephant in the Studio, was nominated for an Oscar in 1964, and a newly commissioned work by the artist and dancer Khaled Ali, who won the 2007 Khilafat International Awards. \n\n\nThe United Kingdom’s National Poetry Library (NPL) has received a $50 million donation from Eileen and Stewart Lansdowne, sons of Sir Frederick and Sir Edwin Lansdowne, in recognition of its work in supporting the writing and", "The next Biennial should be called to order, with a presentation of the work of João Doria and Pedro Alves Barbosa and the first exhibition of works by the Brazilian artist Ricardo Amor, which is currently on view at the Museum of Modern Art in New York. The exhibition will be followed by a lecture series, which will focus on the materiality of human experience, and will be inaugurated by a presentation of the work of Pablo Picasso, whose life and work are intertwined with that of the artist.The theme of the biennial is “Life in the Cinema,” but not “One Life, Two Worlds.” The exhibition will also highlight the work of American artists—including Ralph McQuarrie, Robert Irwin, and Frank Gehry—as well as the important contributions of Brazilian artists—Fámina, María Berrada, and Álvar Mora.“The Museum of Modern Art is committed to the proposition that art history is not an afterthought in either the short or long run but an indispensable thread in the fabric of social life,” said Gregory H. Brown, the museum’s director. “It is our mission to organize a biennial that will address", "The next Biennial should take place in 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has issued an update on its thirty-year lease agreement with the Santa Monica Museum of Art (SMA), announcing that it is exploring options for the future of the venue, which is currently closed as it works to restructure its future. In a statement, MoCA said:“After more than four years of collaborative design, the Museum of Contemporary Art (MoCA) decided to extend its lease with an understanding that the lease expires in 2021. The extension also ensures that MoCA will continue to operate on an ongoing basis in Santa Monica.”The extension follows a major renovation of the museum, which will include the construction of new galleries and the renovation of the existing spaces\u0097the institution will be expanded by 1,500 square feet and will add an additional 500 square feet of outdoor space. The new space will be inaugurated by two exhibitions, “The Human Presence and the Environment” and “Anselm Kiefer: The Art of Man.” The institution will also be renamed after the artist in honor of his 40th anniversary. The museum will be inaugurated by a special exhibition, “Beyond", "The next Biennial should have a definite theme and not be a collection of works, but a collection of life experiences and a collection of stories. It should be a reflection of the times and not a snapshot of them. I believe that this is the greatest challenge for a biennial, for we must first create an infrastructure for this, and for the future of the exhibition program.”In an editorial published by the New York Times in February, 1999, a few months before the exhibition was set to open, Asch wrote: “The exhibition is a vivid rebuke of everything that is wrong with the present state of contemporary art. . . . The exhibition represents a radical and profound return to the original spirit of the biennial.”The show was inspired by the well-known 1967–72 period piece “The Body in Motion.” In the film, the late American artist John Scanlan (1938–1971) photographed a group of young hippies in the Los Angeles hippie commune, the Shiner, in 1971. In the exhibition, Kassel-born sculptor Karl Lagerfeldt (1910–2013), the exhibition’s designer and curator Antony Hudek (1903–1974), and the exhibition", "The next Biennial should be hosted in February 2022 and be curated by Turin-based architect Isamu Noguchi.\n\n\nThe Danish Museum of Modern Art (Dammagend) in Copenhagen has added three new works by artist Michael Gøtzseba to its collection. The works, which were exhibited at the museum in 2018, 2020, and 2019, respectively, were selected by the institution on the basis of their 'iota’s spatial and digital complexity, as well as their potential for experimentation and experimentation on the part of the viewer.“Iota’s work, which consists of a series of color combinations that are designed to look like rivers, has a unique style that we do not often see in contemporary art and that is not typical of the times,” said curator and director Frederiksjørn Moulson. “We are very much looking forward to his next work, for which he will return with a new vision that will hopefully represent an unexpected combination of colors and shapes in a completely new way.”Gøtzseba’s first large-scale installation, “Kamala,” was one of a number of works that were part of the Kasel", "The next Biennial should be held in the spring of 2020. Welch Gallery is represented by David W. Potts and Mary E. Weisz. The first works on view will be the show “The Power of Myth: The Hagiography of Lewis Hyde” (2019), a collaboration with Benoit Mandel. The Museum of Modern Art (MoMA) in New York is currently working on the presentation of a new illustrated exhibition “The Shadow of a Doubt—The Human Condition” (2019) by Maria Henningsen. \n\n\nTenure at Russia’s Dnepropetrovsk Institute of Art has been restored to the institution, which was closed since March 16 owing to a series of catastrophic accidents. The news comes a little over a week after the museum underwent a protracted renovation project, and a little more than a year after the Institute of Arts and Architecture (IAA) in Moscow announced plans to open a new institution in the city.“It is with great joy that we announce that the [Dnepropetrovsk Institute of Art] will remain closed until the end of March,” said museum director Alexander Dobkin. “At the same time", "The next Biennial should be in October, with a theme of the biennial’s usage of digital media, and will be inaugurated by a short film about a group of artists who were influenced by Douglas Adams. If the art event is successful, the UK could be entering an era of sustained transformation. The concept of a biennial is not new, but its image has changed radically over the last three decades as a result of the transformative impact digital arts and culture has had on the lives of many of Britain’s smaller regional and national arts and culture organisations.This year’s biennial will examine the legacy of artist-designed spaces, and will feature works by forty-eight artists from the UK and around the world. The selection of this year’s artists will be led by Paul Mpagi Sepuya and Ali Warraq. The exhibition will be organized as follows: The exhibition will be curated by John Curran and Sian Cooper, and will take up the themes of artist-designed spaces, the history of the biennial, and the biennial’s role in enabling the arts and culture sector. The venue will be built in a former mill on the outskirts of London by the architects Jordan Block and Barry", "The next Biennial should be held at the Ramon de los Cabezas, Mexico City, in 2021, and may include works by one-hundred artists from the region, including Naima J. Keith, Guadalupe Peralta, and Samer Hajime. The museum will also organize a biennial of photographs by the Spanish artist Claudio Altamura, which will be staged at the Museo de Arte Contemporáneo de Barcelona in 2021.\n\n\nThe Biennial de Lyon (BLT), a contemporary art biennial, has announced that it will move its 2020 edition, titled “Ateliers Universitaires d’Arles,” from May to October. The program, which will take place in the French Alps, will be devoted entirely to architecture, with the exception of the third-person narratives of Hélène Bénétière and Gérard Kamm, whose work was curated by Olivier Blanchard.The upcoming event will feature a total of three exhibitions: “Ateliers Universitaires d’Arles’s 3rd and 4th—partly a digital project and partly an installation project—will take the audience into a new", "The next Biennial should be held in 2020. The show will feature fifty new works by eighty artists. The first exhibition will be on October 22 to the Grand Palais in Paris. The exhibition will be followed by a series of biennial debuts at the National Museum of Modern Art in New York and the Museum of Modern Art in Chicago.  The biennial will be held on April 22–April 25, 2021 at the Grand Palais in Paris.\n\n\nThe Metropolitan Museum of Art (the Met) in New York has announced that it is planning to place a permanent endowment in the honor of the late collector, philanthropist, and collector Raymond K. Federman, who established a groundbreaking and influential collection of nineteenth-century American art with products that range from experimental to outlandish.The museum will dedicate one hundred percent of its gross proceeds from sales to the collection’s renowned artist-in-residence, Raymond James. The name Raymond James comes from the initials of the creator, Raymond Edward Federman. The artist is known for his penchant for unorthodox and sometimes bizarre collaborations with his customers; for example, he often worked with the artist Richard Avedon, who created works that looked like they were inspired by a mannequin, and", "The next Biennial should be held in 2021.\n\n\nThe Museum of Fine Arts (MFA) in Boston has received a gift of 100,000 prints by the celebrated American artist Max Beckmann. The work, which is valued at between $40,000 and $50,000, comes from the artist’s studio in Hockley, Connecticut, and is one of the largest contributions ever made to the museum.Born in Chicago in 1934, Beckmann moved to the Boston area in the early 1940s. After serving as a street artist for a time, Beckmann returned to the art world in the late 1950s and began making prints for major art collectors. Soon after, he sold his first work, a 1954 monotype print by John Galliano, for $65,000. In a 1957 interview with Simon & Schuster, Beckmann said that he designs his own prints and relies on his practice to push his craft forward. A few years later, after Beckmann moved to Florida, his studio opened in the former St. Augustine’s block of First Street. During the next ten years, Beckmann began making more than one thousand more works for the museum.A favorite of Beckmann’s peers, he was included in", "The next Biennial should take place in 2020. During the five-day event, documentaries such as 'The Girl Who Stole Christmas' and The Vagina Monologues will be presented side by side, as they were in the first Biennial. The 2020 edition will be organised by the Hamburg-based nonprofit Hamburg Cultural Archive (HCR), which was launched by Germany’s Federal Office for Culture, Karlsruhe, in 2017. The biennial “isn’t finished.” It will be inaugurated by the members of the revolutionary group POUM (Presseuurs Ouvriennes), who were banned from the premises of the museum for their actions in an attempt to block the construction of a new cultural center in the city in 2015. The new program will feature works by twenty-two artists, including Gerry James Marshall, Sara J. Hamre, Annie-Kate Bush, and Kirsten Barlow. The 2020 edition will be held in the exhibition space of Museum Stuttgart (Museum Stuttgart), adjacent to the museums Ludwig and Neue Galerie.\n\n\nAfter a judge ruled that the", "The next Biennial should take place in the spring of 2020. In a statement, the museum said, \"It is a great honor to be able to inaugurate the new biennial with these performances and to have the collaboration of MCA, the state of California, and the City of San Francisco. The year 2020 promises so much and will be a landmark for the art of California and the United States.”\n\n\nThe National Gallery of Art in Washington, DC, has received a gift of twelve hundred photographs by American photographer Harry A. Gilbert, a pioneer of early landscape photography and a pioneer of American abstraction, which was donated to the institution by a group of collectors in New York and New Jersey, among other cities, on Tuesday, February 23. The donation, made by Harry Gilbert Sr., a Houston businessman, and his partners, made to the museum in memory of their parents, Harry Gilbert and Helen Gilbert, who were both active in the oil and gas business in Houston.“The gift is enormous for the National Gallery of Art and for the collection,” said Peter W. Hogshead, the National Gallery’s director, who added that the gift was made in memory of his parents and their contribution to the museum. �", "The next Biennial should take place in the spring of 2020. “The present exhibition is a testament to the financial and physical resilience of the works of the late artist’s and is an excellent occasion for them to be showcased in a new context, in a new location, at a new setting, with new materials, and with new introductions,” said Hans-Ulrich Biarten, the exhibition’s curator. This year’s event will be held at the Biennale für Kunst und Design (Bundesarchiv für Kunst und Design und Design) in Stuttgart, Germany.\n\n\nThe Italian government has issued a temporary suspension of the construction of a new monument to the victims of the 2012 terrorist attack in Rome, which killed twelve people and injured several hundred more, as the government considers whether to permanently remove the controversial monument. In a statement issued on October 18, the Ministry of Culture said that it expects the end of the year to “be decisive.” It also noted that the final design for the monument, which is slated to sit in the city’s same historic square as the Rino Sabino, as well as in the historic Gio Ponti, has not", "The next Biennial should be held at the new Museums House in east London in February 2021. The exhibition will also include the first-ever visits to the Museum of Modern Art and the Musée d’Art Moderne in Paris, which will open in January 2022.\n\n\nThe Victorian Institute of Art (Victoria) is launching a new funding program for independent arts organizations working in the Victorian era. Underwritten by the Victorian Arts Council, the program will provide $9 million funding to support projects serving the Victorian period. The Victorian Arts Council is a coalition of sixteen Victoria-based nonprofit organizations that share a mission to support and encourage the exploration of art and design through the study and exhibition of contemporary art and design.Each year, the councils partner with the National Gallery of Victoria to present their centenary celebrations. Last year, the partnerships included the Centenary Exhibition and Museums, the Victorian Institute of Art, the Victorian Theatre Company, and the Victorian Games and the Victorian Museum of Art. The projects were commissioned by Victoria-based artist and curator Andrew Reith and included the Centenary Exhibition and Museums, the Victorian Theatre Company, and the Victorian Games and the Victorian Museum of Art.The new partners are:-The Centenary Exhibition and", "The next Biennial should take place in 2021, with the exhibition marking the first time that the Museum has staged a retrospective dedicated to the artist in more than sixty years. The exhibition will also include a selection of previously unpublished works.\n\n\nUpdated March 9, 2025: \n\nThe Art Newspaper is reporting that Billionaire collector François Pinault is looking to sell his late partner and major collector Minault designed house Mira di Marzio in Italy.The legendary collector was reportedly negotiating a new contract with the Italian builder when he died last October, and was attempting to sell the former champions of the Italian art scene, Minault, Giacomo Beppe, Silas Weerasole, and Piero Vergina, in exchange for $2 billion.Pinault and his two sons, Piero Pincini and Paolo Pincini, were partners of the private art collector until the late 1990s. They were together for forty years before Pinault was found dead in his home in the fashionable Neggi neighbourhood of Milan at the age of seventy-one. Pinault’s widow, Audrey, received a check for $45 million in December 2018, but no demand for the", "The next Biennial should be held in Tokyo in 2020. A selection of the works that will be presented at the event will be presented by artist-in-residence Elizabeth Wurm, the inaugural winner of the Hurst Biennial Award, and four other finalists—Simon Callender, Frank Gehry, Robert Irwin, and David K. Galbraith—and will be presented by the Hiromasa Museum of Art in Nagoya.The Annual Bliss Prize was established in 1992 by artist and collector Jean-Michel Basquiat to honor the work of his contemporary, Louise Bourgeois. The exhibition was organized by the Museum of Modern Art and the Los Angeles County Museum of Art and was held in conjunction with the Fifty-Fifth Venice Biennale and the Fifty-Sixth Venice Architecture Biennale. The award was established to foster the exchange of new work and to support the advancement of architecture. Upon learning that the winner of the inaugural prize would be chosen by a jury comprising Ed Moses, the executive director of the Foundation for Contemporary Art in New York; Richard Janis, chair of the architecture and design department at the Los Angeles County Museum of Art; and artist-in-residence Lewis Mayhew, the winner of the inaugural “", "The next Biennial should be a milestone one for us, for the meaning of the exhibition. We must reconsider how to build bridges between museums and city centers, how to serve as catalysts for cultural exchange and how to balance the needs of collections, museums, and the city. The Biennial will also serve as a source of inspiration for our city, as our exhibition will be the first in Europe to incorporate the work of the curators of the two cities.” The sculpture, titled The King and I, was created by Lukas Lubusk, an artist originally from the Czech Republic, and Nadejda Zbik, a contemporary Czech artist, and will be on view in the newly renovated Všatn Gallery in Prague until May 21.\n\n\nNew York’s Metropolitan Museum of Art (MoMA) is launching an online version of its exhibition “The Metamorphosis,” which opened on May 30, 2018 and ran through July 13, 2020, in an attempt to engage with visitors from as far afield as Taiwan, Mexico, and the Philippines. The program will include more than eighty works by twenty artists and will run through the museum’s new fifth floor, which opened last month", "The next Biennial should arrive in 2021. The theme of the twenty-fifth Biennial is \"The Self: From Everyday Life to Contemporary Fiction.\" The twenty-sixth will be “Contemporary Art; Its Present, Its Past, and Future.”\n\n\nMuseum director Hernán Dario Puérez has welcomed Emanuela Balsom, a French born curator who has directed the Stedelijk Museum in Amsterdam since 2013, to its staff. She will take up her post on October 25. Puérez said: “Emanuela is a talented and dedicated curator who has proven her ability to run a museum, not only by creating an excellent exhibition, but also by developing new and innovative ways of working with different disciplines and cultures.”Puérez added that the appointment marks the beginning of a new chapter in the museum’s history, “a new chapter that will take us through the evolution of the museum and the development of its collection from a small outpost in the city of Amsterdam to a fully integrated museum.” He added that the museum will also continue to function as a teaching institution and will continue to host major exhibitions. The museum, founded in 1958 by Paul E", "The next Biennial should not only have a theme, but it should also be able to present an innovative project. The reason is that the very nature of the exhibition itself has changed. We are now faced with a new reality that is complex and multi-dimensional.  The question is: Can we create a work that is both old and new at the same time?  The answer, we think, is a resounding yes. The sculpture of the head of a statue represents the lessons that we as artists have learned in creating works from the head of a historical figure. The exhibition concludes with the artist’s proposed installation, The Emperor’s Head, which will be a meditation on the physiological and psychological effects of the coronavirus. The project was conceived as a response to a recent exhibition at the museum-like installation called “All In,” which opened on September 8 and ran through September 11, and was organized by the artist and his wife, the artist-in-residence, Simona de Sousa. The three-hour installation was inspired by the film The Emperor’s Daughter, 2009, which follows the rise of the Russian dictator Vladimir Putin and his regime.\n\n\n", "The next Biennial should take place in 2020. In the meantime, the exhibition will continue with a new selection of work by the Philipeño-born artist Cristóbal Yzaguirre, before moving to the BØST [Brazilian School] in Lisbon for an exhibition titled 'Maravela: The Ghetto, 1929–1931', which will also take up the theme of the upcoming biennial.\n\n\nLisbon, the capital of the Portuguese Republic, has appointed its first curator of African art, Antonio Pimentel, as the next commissioner of the city of São Paulo. Pimentel will be tasked with advancing the museum’s collection of Sao Paulo’s African art, which is housed in a former sugar factory in a favela in São Paulo, and will take up his new post in October.“I am excited by this opportunity to work with a talented and committed team in Brazil and to create new and exciting exhibitions, programs, and exhibitions in this city that will be relevant to the city of Lisbon, the Portuguese State, and the broader art world,” said Pimentel. Pimentel’s appointment follows the opening of a new", "The next Biennial should be held in 2020, and the 2020 edition will be the first to be co-curated, with artist-in-residence Dario Catellani, by the venerable photographer Gaston Nothin. The city was awarded the $2m Prix de l'Enfants in 2017, and the institution hosted the first exhibition of work by a contemporary artist to be held in the French capital, in 1965.\n\n\nThe Museum of Fine Arts (MinFA) in Boston has received a gift of more than one hundred works on paper from the Pennsylvania-based artist Jack Kornbluth. Over the course of a decade, Kornbluth has sold over one hundred paintings, drawings, photographs, prints, and lithographs. His works are housed at the institution, which is currently restoring the original nineteenth-century American painting, William Henry Fox Talbot’s The Discovery of a New World.“Jack Kornbluth is one of the most important contemporary American painters,” said museum director Michael Rosenfeld. “His work is a treasure trove for our mission of enabling a new generation of American painters to have a chance to develop their work and see it through a modern lens", "The next Biennial should take place in November 2021.\n\n\nThe World Health Organization (WHO) has released guidelines for the welfare of workers in the biennial’s production, transport, and storage industries. According to the New York Times, the Pérez Art Museum and the Museum of Modern Art in New York have announced that they will suspend their trips to Mexico for a month so that they can mark the event with a month of rest and mental health treatment.The guidelines, which were developed by the United Nations Development Program (UNDP), offer concrete steps for countries to take to prevent the spread of Covid-19, but they also outline the types of support that countries can provide to low- and middle-wage workers in the industry.The guidelines recommend the following measures: “Providing at least two weeks’ time off for employees who are not working or who are not scheduled during the week.” They also recommend paying employees at least one week’s salary. They say employers should give employees at least four weeks’ pay. And they urge employers to offer paid family leave and medical leave.The guidelines say that employers should “implement effective risk-based management practices,” including providing employees with at least two", "The next Biennial should be held in 2020.\n\n\n\n\n\n\nArt historian, curator, and scholar H. L. Menken, whose enduring legacy is the body of work of artists such as Gertrude Stein and Victor Vasarely, has died. She was ninety-two years old. A scholar of the European art-historical canon and a scholar of the history of design, Menken was the first to recognize the aesthetic possibilities of textile designs. Menken cofounded the nonprofit Institute of International Education (I.I.E.) in 1971. She cofounded the exhibition label Curator’s Circle, which supported the development of artists who were influenced by Menken’s works, and helped establish the annual Fellowships for Art and Design (now the Hirshhorn Prize). She also organized the exhibition “The Displaced Figure of Modern Life” at the Museum of Modern Art in New York in 1987 and “Masculinity Under Pressure” at the Museum of Modern Art in New York in 1988, and was instrumental in spreading Menken’s influence in the art world.“Her work has been collected and catalogued by a number of great collectors, including David H. Koch,", "The next Biennial should take place in 2021 and will be titled “Gramsci and the Art of Notices.”The competition, which was initiated by the late Italian director Stefano Boeri in 2009, will include work by forty artists and collectives, including Staci Bocconi, Tiziana Cerciello, Diana Fiammetta, Sara Kastner, Cheryl Laurance, Lucio Marchetti, and Sara Malse, and will be presented by the Milan-based artist-run biennial organization FIMM, which was founded by two former Tiborino students, Giulia and Iannone. The exhibition will be hosted by the Museo d’Arte Moderna, the iconic 1960s arts space in Venice, and will run from June 5 to June 8. At a press conference at the Venice Biennale, the organizers said that the project will “confront the question: what are the foreseeable future dimensions of the most beautiful spaces on earth?”Speaking to Artnet, Iannone said: “Giulie and I had shared the same desire for a grand project, a project that", "The next Biennial should be held in 2020, and is currently in the planning stages. The project highlights the achievements of Chilean artists in the field of modernism, and their ongoing commitment to their fields and their art.The biennial will be organized as a “vacuum,” a “vacuum of information,” another way for artists to participate in the cityscape. The exhibition will be curated by Deana Lawson and will be inaugurated by a “Juan Arroyo” exhibition. “We will use the project to rebalance the biennial’s pedagogy and the exhibition’s narrative so that it comes together more seamlessly with the city’s history and heritage,” said Nathan Rabin, director and CEO of the Biennial. The artists behind the project are also collaborating with other institutions and international organizations to present the exhibition, which will be on view until September 2. \n\n\nThe Museum of Fine Arts (MFA) in New York has appointed Neil Lane as its next executive director. Lane, who has been the museum’s assistant director for art, architecture, and design since 1996, will assume his leadership role on November 4. He", "The next Biennial should be hosted by the Museum of Asian Art in Beijing in 2021. \n\n\nAmerican artist and publisher Mary Ellen Mark has died at age eighty-nine. The author of more than one hundred books, including A Small Affair (1971), One Hundred Years of Solitude (1977), and A Family Affair (1986), Mark was a crucial force behind the contemporary art movement in the United States.Born in New York City in 1941, Mark studied at the City College of New York, New York University, and the University of Pennsylvania, where she met her husband, the late Oliver Erskine. They moved to Los Angeles, where their son was born, and settled in the city, where Erskine eventually became a partner. Mark worked at the gallery as an independent contractor and eventually became its executive director. She often drew inspiration from the psychedelic trip art of the 1960s, and from the novel novel as well as from the American West. Mark’s work is housed in the collections of the Los Angeles County Museum of Art; the Museum of Contemporary Art, Los Angeles; the Metropolitan Museum of Art, Nashville; and the National Gallery of Art, Washington, DC. She was a winner of", "The next Biennial should take place in 2022. The exhibition’s selection of materials will be curated by artist-in-residence Howard Harlow, who will be supported by a 100 percent grant from the David Rockefeller Foundation. The exhibition will examine the “exploitation of the body and the environment for economic and political ends.”\n\n\nThe Museum of Fine Arts (MFA) in Boston has received a gift of one hundred works by American artist Ray Eames, whose vast body of work, including ceramics and photography, was captured during six voyages in the company of Paul Bunyan and the Duke of Wellington on Easter Sunday, 15 June 1680.The gift, which came from an anonymous benefactor, includes works by artists such as Charles Atkins, David Hockney, and Frank Malina, as well as a selection by French artist Jean-Jacques-Louis. The work on display in the exhibition “Theater of Operations” will be the first time the pair’s works will be presented together. The show is curated by Michael S. Graziano, the director of the Museum of Fine Arts, and is on view until November 29.A full list of museum partners is as follows:American", "The next Biennial should explore the interrelationships between aesthetics, history, and political economy. The art of the 1970s and 1980s should also be examined.\n\n\nThe Pereira Museum in Lisbon, which is currently undergoing a major renovation, announced that it is planning to reopen in 2021. Titled The House of Perfumes, the exhibition will highlight the work of seventy-five artists, including Hélio Oiticica, Ana Paula De Nova, and Jochen Roesler. The museum will also introduce a new biennial section on women’s fashion, as well as a “fashion science” section devoted to the production of fragrances, a new residency program on fashion, and an expanded collection for its collection.“The Pereira Museum is committed to a renaissance of Portuguese art and to the preservation of all the most important works in the private collections of the family,” said Renata Bertocchini, chairman of the Pereira Museum and its owner. “The work of the artists in this exhibition is not only a pointer to the future of the art from the family, but also a way to understand and to explore the history of art and design as a whole.”The eleven artists chosen", "The next Biennial should be held in the spring of 2020.\n\n\nNew York–based artist J. Paul Getty’s estate has agreed to pay $1.2 billion to settle claims that it failed to remit payments for a series of artworks by Pablo Picasso, Claude Monet, and Henri Matisse, which are currently on display in “Plain White Chalk,” a massive $85 million expansion of the Getty Museum and the Los Angeles County Museum of Art (LALA). The works were bought by Getty in 1991, when the estate was still run by founder and chairman Charles and David Gallerist. The estate acknowledged that it has already made restitution but said that it will continue to pay out of its own pocket. “We are confident that we have made restitution for these fifteen great works,” said Christopher D. Getty, the estate’s president and CEO. “We are working hard to ensure that this series of works is included in the next edition of the show.”The works, which were first exhibited at the museum in 1987, were among a number that were included in a deal that also netted the estate more than $30 million when it sold the works to", "The next Biennial should take place at the Art Institute of Chicago in 2021.\n\n\nThe Museums Association (MA), an international organization representing more than 1,500 American museums, has acknowledged the need for more public investment in preservation efforts in an attempt to combat the growing threat of the coronavirus. The group’s board voted 7–0 in favor of a pledge to provide $4.5 billion in support of museum preservation initiatives.“We are deeply concerned by the coronavirus and the impact that the virus may have on the health and well-being of our communities,” board president Deborah Britten Aly, who was appointed by current board chair Karen DeYoung, said in a statement. “Since the coronavirus has already claimed the lives of more than 5,000 people in the United States alone, and the coronavirus-related deaths have been aggravated by the virus’s spread, we feel it is in the best interest of the museum and local communities to work together to address the coronavirus and ensure that the future of these institutions, which have been under significant threat from the virus, is secure.”The group has made efforts in recent years to improve the financial and operational conditions of", "The next Biennial should be held in the spring of 2022. For the past fifteen years, the museum has been working towards establishing a new library, which will be housed within the main building, and has been making numerous changes to accommodate the growing trend of contemporary art, including the addition of an additional exhibition space and more theaters.The new collection, which will comprise work that was painted in the late 1960s through 1970s and will include the works of thirty-four artists, is slated to open in 2020. The exhibition will run concurrently with the upcoming exhibition, “Biennale of Vancouver,” which will run from March 19 to March 21. “We are thrilled to now welcome more than twenty-six artists to the Biennale of Vancouver,” said Acting Director and CEO Julie Gass. “The biennial’s new collection features the work of visionary artists whose work embodies and redefines the concepts of the exhibition. The exhibition will give a great opportunity to witness these artists’ work and give you the chance to engage with their work through the exhibition.”In addition to the exhibition, the biennial will present a “Cognitive Dissonance,” a presentation of artworks by sixty-", "The next Biennial should be held in 2021.\n\nThis article was updated on May 2, 2018.\n\nAs activists across the globe continue to call for the release of political prisoners and the United Kingdom to remain in a state of lockdown as a precautionary measure in the wake of the Covid-19 outbreak, the UK government announced on Thursday that it would begin reopening on May 22. The reopening date was delayed because of the Covid-19 lockdown.The reopening date was also pushed back by an hour, from May 22 to May 22, due to concerns around the coronavirus. The government said that it expects reopening to last through the holiday weekend.While the government initially said that visitors would be able to return to the UK on May 22, it later said that it could be forced to reschedule the event if there are any concerns over the spread of Covid-19. The National Health Service (NHS) has also said that it expects patients to return to their homes on May 22.Governor Andrew Orwell, who has previously suggested that the government allow the public to return to work on May 22, said: “We have been clear: this is a state of emergency and we are working hard to get", "The next Biennial should be held at least twice a year, with the possibility of a biennial every other year. The theme of the next iteration should be “MIDWESTAK,” a reference to a photograph by Rudolf Kmetowicz. The exhibition will be comprised of forty works by forty-one artists, and will inaugurate the new exhibition “MIDWESTAK,” curated by the French conceptual artist Gilles St-Pierre. The twenty-first exhibition will be held at the Academy of Arts in Paris in September.The 2019 edition of the exhibition consisted of seventy-six works, which were selected from a pool of forty artists by an international jury comprising Jean-Luc Martinez (Vancouver), Alexandra Kostyk (Montreal), and Zina Saro-Wiwa (New York). The full list of participating artists is as follows:Alain Gillen (New York)Julie Brutel (New York)Nancy France (New York)Cécile Haig (New York)Tanya Hoffmann (New York)Terri Hutton (New York)Léa Heurey (New York)Cécile Herzog (New York)Marian", "The next Biennial should focus on the intersections of art, technology, and politics, with an eye to attracting more young people to the museum’s art and technology initiatives. The exhibition will focus on the interconnections between technology and art, including the history of objects and artifacts in museums, the digital artifacts that are currently in collections, and the future of art and technology.“The Future is Digital: Art and Technology, Digital Politics, and Artificial Intelligence,” said David Riff, director and CEO of the Biennale. “The exhibition will showcase how art and technology are intimately entwined in our lives. It will explore the linkages between art and technology, the influence of technology in shaping and changing art and technology, and show how art and technology are mirrors reflecting back into us.”The exhibition’s curators, Anne-Marie* and Vittorio Pratico, have been working on the exhibition for several years. It consists of sixty works, divided into three chronological sets, a retrospective, a series, and an encyclopedic compendium. It is organized by the production company Art of the Future, which also represents the exhibition in London and New York.\n\n\nArts curator Margot", "The next Biennial should take place in 2021, and “Artico” will be held at the Museo de Arte Contemporáneo in Madrid in 2022.President of the Association, Eduardo Cervo, said: “The Biennial is a project for the future of the Museo de Arte Contemporáneo, and the best way to imagine the future is to envision the future in the hand of the artist. The artist is the future. And the future is the Museum.”\n\n\nAs New York City heads into Phase 4 on Wednesday, attempting to contain the coronavirus, which has already killed at least 136 people in the United States and neighboring countries, and the likelihood of a sixth wave of the coronavirus outbreak grows, the Museum of Arts and Design (MAD) has suspended its planned performance, “Suspense,” at the Javits Center during the pandemic. The festival—which was scheduled for March 18–March 21, 2020—wasn’t scheduled to run again until June 1. Its cancelation was spurred by questions surrounding the safety of the coronavirus and the ability of museums and other cultural centers to contain the virus.", "The next Biennial should be in May 2021.\n\n\nThe Bibliothèque Nationale de France (BNEF) in Paris and the Museum of Modern Art (MoMA) in New York announced today that they have settled a lawsuit that accused the institution of illegally transferring works from one location to another. The museum began investigating the allegations after a collector contacted the institution in 2015 after the institution placed a work by French artist Serge Ghesquière in a display at its Paris branch. The museum determined that the work was in storage and therefore did not have the authority to sell the work. The purchaser was then unable to determine whether the work was genuine.In a ruling published on Thursday, the Court of Cassation found that the Museum of Modern Art (MoMA) violated the law when it failed to inform the buyer of the authenticity of a work in its collection when it signed a document acknowledging the transaction at the Museum of Modern Art in New York on February 25, 2019. The court also found that the Museum of Modern Art failed to inform the buyer of the standard forms of documentation that must be presented in order for a work to be considered as authentic.“The Court of Cassation has made clear that the Museum of Modern Art is guilty of", "The next Biennial should examine the phobias, prejudices, and other “othernesses” of its participants and draw from their own practice. Such an event would be an important step to contribute to the healing process and would also be a chance to meet some of the artists featured, and to hear from them. The 2019 edition will take place at the Cultural Center in Wuhan, China, and will run from September 3 to September 6.An open call for proposals will be open on September 7. The deadline for proposals is September 8. The twenty-fifth edition of the biennial will take place in October and will feature work by forty-seven artists from twenty-five countries. The artists selected for the event were chosen by a jury comprising Sarina Kudacki, Vikas Kumar, and Kambala Devi.  The seventy-ninth edition of the biennial will take place in December and will feature work by fifty-six artists from forty-six countries. The artists selected for the event were chosen by a jury comprising Pei Wei, Helene Scheff, and Tess Munro.  The eighty-third Venice Biennale will be held in January and will feature work by forty-six artists", "The next Biennial should aim to include contemporary artworks and will focus in particular on the part of artists in a museum setting. The theme of the Fifth Biennial, “Alignment,” will be “Aligned,” and will be decided by a panel of biennial experts, including Kamala Harris, Pamela Nuccitelli, and Koenig Hahn. “We are very much interested in the question of how the art of the museum can be reconnected to the world around us,” said Nari Ward, executive director of the Museum of Contemporary Art (MoCA), New York. “This exhibition will bring together artists in a space that was designed by a certain architect, has a certain atmosphere, and is associated with a certain institution. We want to hear their thoughts and find ways in which our relationships with artists can change, and hopefully inspire them.”The exhibition will be curated by Kate Muholi, director of the Künstlerhaus in Vienna, and will draw from the collections of the Künstlerhaus; the Künstlerhaus; the Leipzig Museums; and the Museums För der Kun", "The next Biennial should be announced as soon as possible. The event will run from September 2 to September 4, 2020. The event’s chief curator, Henriette Kasper, told the Art Newspaper: “The exhibition will be a renewed and expanded iteration of the fair, with a new selection of the artists’ works in a different format. We will also dedicate more time to the installation and exhibition of works by the artists. The exhibition will also be a celebration of the spirit of the fair, which is to bring together artists of diverse disciplines and who choose to focus on the art of the city.”The exhibition will feature more than 160 works by forty-four artists. Among the twenty-one awardees for the biennial are Salah El Araby, Karima El Shamsie, Lina El Samerraei, Ahmad El Khouri, and Hoor Al Qasimi. Artforum reports that the biennial will also feature the work of Nima Nabavi, Sarità Yamani, and Sakina Yamani.Academy Award nominee and activist Malawian artist Ijaz Ali-Naqvi is also among the thirty-one artists who will receive the A.I.N", "The next Biennial should be held at least four years after the last biennial in order to allow the body to participate in an accelerated development process, which would facilitate the staging of future events. The exhibition should be accompanied by a catalogue, the Director of the Museums, Birgitta Block, and the artists themselves.Block, a North Carolina native, began her artistic career at the Museum of Contemporary Art (MoCA) in Los Angeles. As part of the Los Angeles Contemporary Artists (LACA) project, she curated exhibitions such as “Adrienne Atget: The Way of Life” (2015) and “David M. Kander: A Perfect Circle” (2015), which represented work by Kander, Atget, and other artists including Leonard Cohen, Debby Ruf, and Pierre Omidy-Arts. She is currently a cofounder of the Los Angeles– Chicago Collaborative. Block’s work is currently on view in the exhibition “Icce” at the Santiago de los Caballeros in Spain.Block’s exhibition “Labyrinths Paths” (2015) received the Prize for Excellence in Art for Art and Art History.\n\n\nA group", "The next Biennial should be held sometime in 1882, at an appropriate location along the river, and will announce its selection from an open call. The work will then be curated by the same team that will present the first Biennial in 1897.Director of the Friedrich-Alexander-Schlössische Kunsthalle Münster, Ulrich-Alexander Bischof, said: “We are thrilled to continue the important work of the Biennial. But most important, we are thrilled to host such a rich and important collection of public works. The project of the upcoming Biennales will be a unique and significant step in the development of the collection, in that the collection will be jointly located and managed by the same artist.”The 2019 edition of the Biennale, which will be hosted by the Museum of Contemporary Art in Berlin, will be inaugurated by a retrospective of artist Ron Gorchov’s work Icarus, which will open on November 27. The museum will stage a special exhibition of work by fifteen German artists in December.\n\n\nThe London-based arts organization the London-based arts organization the National Poetry Library (NPL) and the Royal Shakespeare Company have announced that they have reached an agreement", "The next Biennial should also include the exhibition of a new work by a different artist, and the exhibition of a new collection of early photographs. The second edition of the show will take place in June 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it is reopening to the public in September with an exhibition of work by nineteen artists, including Alice Aycock, Nara Martinez, and Teresa Giudice, and the first major exhibition of work by an African American artist in the United States in more than twenty years. The event, titled “Unfinished Business,” will run September 10–September 12, 2020.The institution was closed indefinitely in February as it implemented a temporary closure following a virus outbreak in China, and has faced mounting criticism from artists and activists over its decision to close. The exhibition will include work by artists from twenty countries, including the United States, Canada, Mexico, Brazil, and Senegal. During the pandemic, MoCA staff and visitors expressed frustration with the museum’s inability to address race-based violence in a timely manner, and its lack of programming that addresses historical injustices and the impact that racism and white supremacy has on marginalized communities.Several prominent figures, including artist", "The next Biennial should take place at the Museum of Fine Arts, Boston, in 2021.\n\n\nThe Museums Association (MA), the trade organization representing the more than 660,000 donors who have given to the United Kingdom’s National Galleries of Scotland (NGM), has announced the results of an online survey of more than 1,500 galleries. The survey, which was conducted by the online platform Dangote, revealed that seventy-nine percent of collectors are dissatisfied with their current online-only offerings, and that seventy-six percent are considering leaving the UK for good.According to the Times, the survey was conducted by Dangote between October 5 and October 8, and surveyed 1,500 collectors and collectors' assistants. The results are troubling enough for a number of collectors who are hoping that the Brexit vote will help persuade more institutions to open their doors and rejoin the UK’s private sector. While seventy-nine percent of collectors are dissatisfied with their current online-only offerings, seventy-six percent are considering leaving the UK for good.While the UK’s National Galleries of Scotland has announced that it is committed to reopening by the end of March, the institution is currently closed until at least April because of the", "The next Biennial should take place in 2021. “The theme of the next Biennial should be the importance of the human spirit in creating the new future,” said artist Christopher Jaron.   The 2019 edition, which opened on October 16, featured performances, music, and films by artists such as Marc Anthony, Jessica Alba, and Riya Karim; a book by the artist and philosopher Ana Mendieta; and a performance by the former members of the Los Angeles–based collective the Chameleon People.\n\n\nThe University of California, Los Angeles (UCLA) announced today that Bethany S. Adams has been named associate director of the Arts and Science Education and Research (ASER) Center. She will succeed Emily Ransom, who retired in March 2019 after seventeen years at the helm of the center. Adams will take up the post in August.“We are thrilled to welcome Bethany’s visionary leadership and to continue to support and expand UCLA’s outstanding arts and science education and research program,” said UCLA chancellor Carol Christ, who will also serve as deputy chancellor. The faculty, staff, and students of the center have raised more than $1.3 million for the", "The next Biennial should be held in 2020, and the next will be in 2023. “It is our aim to present a new and unique story of the exhibition, within a creative environment that is highly relevant to our time and also to the contemporary,” said director Julien Ghebaly. “We are passionate about this exhibition, and its curators, but they are also ambitious, dedicated, and determined to make the exhibition a reality.”\n\n\nAn oil painting by the late Venezuelan artist Anton Chenebault, a portrait of his wife, Natalia, that has been on view since 1976, has been restored to its rightful place in the collections of the São Paulo and Porto Museums in Portugal. The painting was included in a group exhibition of the artist’s works in 1996. The museum has since then collaborated with the Chenebault brothers to establish the Anton Chenebault Museum of Art in Barra, Brazil.In a statement, Museu de Arte de São Paulo (ASP) said: “We are thrilled that this work, which has been in the collections of the Chenebault Museum for more than two decades, has finally arrived on its cur", "The next Biennial should be several years from now. I am still quite hopeful about the future of architecture. It is a good thing that the demonstrations of the last two years were not a failure. One of the reasons why I am doing what I am doing is because I want to inspire people. I want to change their minds about architecture and about the world.” He added: “The main things that I have learned are that architects are people too, and that is a wonderful thing. People have different interests, different needs, and different values. It is up to architects to serve them.”The winner of the $1,000,000 Transformer Award this year was Daniel H. Weiss, a German-born, American-based designer/architecture critic/photographer. The award is awarded annually by the Association for Public Art to a creator whose work demonstrates the highest quality, creativity, and intellect. The four-time winner was also recognized as a finalist for the Lincoln Foundation Award for his work Conceptual Drawing” last year.Weiss’s design for the Transformer, which he began working on in 2009, is a massive mixed-media work, which incorporates a vast array", "The next Biennial should start in 2021 and will comprise three sections, “The Visual Museum of the American Experience,” “Beyond the Lamps,” and “Beyond the Fountains.” The fifty-ninth edition will feature a special exhibition of work by the artist-in-residence, artists who have contributed to the festival in the last ten years, and will take place at the Swedish National Museum.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Jane Panella as its next director. Panella will be responsible for the direction and growth of the museum’s permanent collection. Since its founding in 1966, the museum has allocated $3.7 billion to repair and maintain its buildings and infrastructure. Her appointment comes two years after MoMA’s board appointed her, and comes just a month after the museum reopened to the public following a $1.5 billion expansion and renovation.“I’m thrilled to welcome Jane to the museum,” said chair Timothy Potts, who said she has a proven track record of working collaboratively with institutions and has been instrumental in helping MoMA move into a new building, one of the largest works of art", "The next Biennial should provide an opportunity for the exhibition’s artists to present their works in a new and unique way. The decision to postpone the event was made in light of the recent events, including the deadly terrorist attack in Paris, which took place on November 13, and the worsening humanitarian crisis in Syria. The theme of the upcoming event will be “Spiritual Power” and will be “Avant-Garde and Modern Art in the Age of Terror: Al-Ghirafi, Al-Mahdawi, and the Biennial of Modern Art”.The 2019 edition of the Biennial of Modern Art was organized by the Ankara-based museum, which is located in the city of Kocakır, near the city of Antakya, Turkey. The exhibition, titled Al-Ghirafi wa Al-Mulk (Al-Ghirafi and Modern Art in the Age of Terror), was organized in collaboration with the artist-run organization Art Projects in Al-Ghirafi and features works by seventy-two artists, including Muhannad Abou ElFattah (Al-Fattah Gallery), Salah Aboulousy (Al-Fattah Gallery), Nima Ab", "The next Biennial should take place in the spring of 2021.  For the museum’s forty-two-year history, the inaugural exhibition was organized by curator Robert Frank and was held at the former site of the Metropolitan Museum of Art in New York. It was held at an altitude of 1,400 meters (3,300 feet) and featured work by seventy artists. The 2020 season will examine themes of memory, memory of the past, and memory of the future through the work of seventy artists. For the first time, the biennial will be held in a city that’s home to the American Indian and will focus on this subject matter.The 2018 season featured the work of twenty-six artists, including Simon Sánchez, Antony Hudspeth, and Clementine Obalil, and was organized by the New York–based, nonprofit, artist-run institution, Art in the City, and will take place at the Fashion Institute of Technology (FIT). The inaugural exhibition will be presented by the New York–based, artist-run institution, Art in the City, in partnership with the Julian Schnabel Foundation for the Arts. The biennial will also introduce a new program", "The next Biennial should host a solo exhibition by Andreas Eriksson. The appointment of a director was made in part to protect the museum’s reputation, and the museum’s staff is currently looking for a new director. The selection committee includes Victor Brodbeck, director of the Centre Pompidou in Paris; Guillaume Chandon, director of the National Museum of Nature in Brussels; Michaël Koudounaris, director of the Fraunhofer Institute for Contemporary Art in Kassel; and Michelangelo Salah, director of the Saatchi Gallery in Milan.The biennial will also include a presentation of an original work by the artist Polidnaya Medvedova, which will be presented at the museum’s new exhibition space, the Center Pompidou, which opened last December. The work, which was made in the 1980s and reissued by the institution in 2017, was selected by an independent committee chaired by architect Fred Eckhardt. The exhibition will run from January 19 to January 21, 2021. All of the panelists are members of the same engineering practice, Telenar Medvedova GmbH, and have distinguished careers in the art world. The director of the", "The next Biennial should be held at the Glasgow Art Museum at some point between September and December. The next edition of the Seattle Super Museum will take place in January 2020.  In the meantime, a number of symposia and art venues are planning to open they were forced to cancel or move their programming to accommodate the pandemic. Some museums are moving their exhibitions indoors. Artforum has reached out to each of these institutions for comment.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it has received a gift of twenty-six works from artist and collector Angel Avi-Atie\u0097a long-time MoCA supporter and collector, whose works are frequently included in the museum’s permanent collections\u0097as part of its “Angel Avi-Atie: A Retrospective,” a new retrospective program that is currently on view. The works, which were donated by Avi-Atie to the institution in 2012, are the work of his father, the late artist Amédara Avi-Atie\u0097the son of a wealthy businessman and the founder of the chemical company DuPont, which was founded in a former church in New York’s", "The next Biennial should be held in 2019. The 2020 version will be held in Helsinki. The next exhibition will be held in the city of Velkehavn in the Norwegian Arctic region, in 2020.\n\n\nThe Carnegie Museum of Art (CMA) in Pittsburgh announced today that it will no longer operate a solo exhibition, called the 20/20 Experience, on its campus in the spring of 2020. Instead, the institution will hold a series of programming through the end of the year. The announcement came less than a week after the institution revealed that it will be reopening with a new three-dimensional sculpture by the Italian-born, French-Swedish-American artist Isamu Noguchi, titled The Replicant.Noguchi, whose practice is deeply rooted in the film and video arts, has presented The Replicant—a sculpture with a red-and-black, multicolored, and silver-toned fabric, which appears as a humanoid, living, mechanical, and crystalline robot—in various venues including the Museum of Modern Art, the Museum of Modern Art, the Museum of Natural History, and the Metropolitan Museum of Art, and will soon be exhibited in the Palais de Tokyo. Nog", "The next Biennial should be held at the Museum of Contemporary Art in Bali by 2022, with the exhibition “Ateliers d’art” scheduled for 2020. In an online petition signed by more than 1,500 people, the organizers asked for the biennial to be postponed to coincide with the new school year, since it “dares to challenge the primacy of art and culture in our lives.”The petition concluded: “We ask that you postpone the presentation of the exhibition at the Art Forum Bali until at least the end of May, and the subsequent exhibition at the Art Forum in Bali, as soon as possible. We hope that this will enable the artists who are currently being held hostage in the Indonesian prison system to make their voices heard in an international setting.”\n\n\nThe Metropolitan Museum of Art has released the list of thirty-seven artists who will participate in the second edition of the Biennial of the American Indian (BIA) at the Museum of Modern Art in New York next month. Filmed entirely in black and white, the exhibition will feature the work of seventy-one artists, including John Akomfrah, Anne Carson, Nadine C. Moro", "The next Biennial should be held in the autumn of 2021.\n\n\nThe Kerr Museum in the City of Kerr, Oklahoma, has appointed James R. McNamara as its next director. He succeeds Nancy Kerr, who is retiring after thirty-five years at the helm of the institution after she stepped down in September 2019 following a triple shooting, including the fatal stabbing of her husband, John McNamara, in the couple’s Oklahoma City apartment in March 2019.“James has been instrumental in improving the Kerr’s collections and programs over the last twenty years, and has leveraged his expertise and knowledge to develop new, innovative ways to present the museum’s history,” said Nancy Kerr. “His leadership, enthusiasm, and commitment to the museum’s mission have been instrumental in securing our future funding, and I’m confident he will continue to shape the Kerr into an institution that will continue to thrive under his leadership.”Born in New York on July 24, 1937, McNamara is the son of Charles McNamara, who served as the director of the American Folk Art Museum in New York for twenty-five years, and his wife, Ann. His undergraduate education began at the University of Minnesota and then at", "The next Biennial should be about “the emergence of new and varied artistic practices and the collaborative and interdisciplinary nature of the museum’s collections in the twenty-first century.”\n\n\nThe Tate’s board of trustees has approved a new contract that will see Mira-LITO’s artist-in-residence, Jim Thompson, continue to work at the Tate until the end of the year. The board also extended the residency grant by ten years, from five years to eight years.The board voted unanimously in favour of the extension, which requires the Tate to extend the duration of its artist-in-residence contract through the 2020–21 academic year. The decision was made in light of a report commissioned by the Tate into the impact of the Covid-19 crisis on its artists, which found that a quarter of those who have lived at the Tate for five years or more are unable to continue their work after graduation.Tate director Maria Balshaw said: “The board of trustees’ decision to extend the terms of the grant in recognition of the financial and emotional contribution made by the Cambridge-based artist-in-residence is a clear signal that the Tate is committed to supporting the artistic", "The next Biennial should be held in the spring of 2020. The exhibition will feature the works of sixty artists, including Selenista Angel , Alberto Alarcon, Alessandro Bannoni, Amara Sadao, Dorian Harrison, Yura Hata, and Lucio Fontana. The program will also include a new symposium on the art of beauty. The 2019 event was organized by the Biennial Foundation and the artist-run project ART in the Streets, a collaboration between the UCLA Art Museum, the Los Angeles County Museum of Art, and the Los Angeles County Museum of Art (LACMA), which will also collaborate on the upcoming edition.The 2018 edition of the Biennial Madison was organized by the city of Madison, the Children’s Museum of the Arts, the Madison Art Museum, and the Tudor House in London. The 2019 edition of the Biennial was presented by the Arts Council, the University of St. Andrews, and the National Galleries of Scotland.\n\n\nThe German city of Cologne will not be forced to reopen on May 27 due to the coronavirus pandemic. Instead of having to make do with limited services after a temporary closure due to", "The next Biennial should be held in 2020. The 2019 edition, “The Most Beautiful Things,” was held at the Museo de Arte Contemporáneo in Madrid from April 16 to April 22. The sixty-sixth edition of the award, which honors Italy’s work in the field of photography, was held in Venice in March.\n\n\nAdvertisement\n\nThe Museum of Fine Arts (MFA) in Boston has welcomed seventy-seven new members to its staff. Among the addition are Hannah Chiu, who will be the first curator to hold the position since Jane Russell in 2019; Kati Collins, who will be the first curator to serve as director of the program since 2006; and Sherrilyn Schipper, who will become the first curator to lead the museum since 2011.“I’m especially excited to welcome into our community forty-five years of MFA curating talent,” said museum director David Cullman. “This group has been a core part of the MFA’s history, and this year’s additions bring that history even closer to reality through their vision and commitment to contemporary artistic practice.”Chiu comes to the MFA from the Contemporary", "The next Biennial should take place at the Yuz Museum in Beijing, in January 2021. A new exhibition of work by the Russian artist Aleksey Gusev will also open in the fall.\n\n\nThe London–based collection of the German retailer Richard Prince has announced that it will transfer the majority of its holdings to a new museum in Cologne, Germany, which will organize its exhibits in the new venue. The museum will open in 2020 and will continue to operate at least until 2023.Its new location will enable the museum to present a greater number of exhibitions and events in a shorter period of time. Its collection will also be relocated to a museum in the city. The move is part of a plan to ensure that the Richard Prince Collection, which comprises more than 6,500 works, can be preserved and reassembled at a location in Cologne.“The new museum will be a great success in this regard,” Richard Prince, a British collector and the founder of the artist-run website RichardPrince.com, said. “Cologne has always been a cultural and cultural-historical destination for me, with a rich heritage of art and architecture, and the new museum will allow me to further develop my collection and exhibit exhibition-wise", "The next Biennial should launch later this month and will stage five works, including The Wind Out of My Wings (2015), which was the subject of a 2017 New York–based exhibition, and Detention, 1966–1970, a work by Czech artist Mikhail Basarev. The first artist to receive the prize, Mikhail Koshkin, was awarded the $75,000 prize in 2017.\n\n\nThe California Independent School of the Arts (CalArts) announced today that it is launching a new initiative designed to help students of color overcome academic barriers that prevent them from receiving college credit. Under the leadership of the independent arts educator Maria Pascual, CalArts’s education program will collaborate with institutions across the state and country to offer students mentoring and access to curatorial and performance-based programs.“The institution is launching this new initiative to help students of color in a variety of ways, including by offering them access to a wide range of contemporary artists, including artists of color, and by collaborating with the local community and arts organizations,” said Pascual. “Our engagement with the community and the arts is an important factor in enabling students of color to succeed in college.�", "The next Biennial should be called for an interim period of twelve months, from the date of the first Biennial. \n\n\nThe Italian government has released a set of regulations that would allow museums to open their doors in Italy on November 8, in an attempt to ease the financial strain caused by the coronavirus. While the government is encouraging institutions to open their doors as early as possible, it also wants museums to remain closed until November 11, the date of the coronavirus outbreak.According to the Art Newspaper, the new regulations would allow participating museums to keep their doors open as long as the public is allowed to enter. However, if institutions are forced to close due to the coronavirus, they would be permitted to open their doors on November 11.The regulations are part of a larger strategy to try to reduce the toll from the coronavirus—Italy currently has the lowest number of cases in Europe—and would likely be enforced in a way similar to those in Germany and Sweden. But they are being pushed through by the country’s conservative government, led by prime minister Mario Monti, who is trying to push through legislation before the Papal States convenes in March, and are likely to be signed into law by March 28.According", "The next Biennial should be held in 2021, with the Hall of Fame marking the occasion. The first edition, which was organized by the Museum of Contemporary Art New York in association with the Foundation for Contemporary Art (FCCA), featured contemporary artists such as Philip Marlow (Los Angeles), Noah Smith (New York), and Lucy O'Connell (New York). The second edition, which was organized by the Museum of Modern Art in New York, was scheduled to kick off in 2021, but was postponed after the artist’s death. The exhibition, entitled “After the Storm,” will open on September 4 and will run until October 2.In a statement, the biennial said: “We are deeply grateful to the artists and organizations who have chosen to participate in the event. The exhibition is a remarkable new take on the themes of our biennial, and a testament to the ways in which contemporary art is reworked and reimagined in the digital age. We hope that the exhibition will become a powerful tool for moving the field forward and inspiring new conversations.”\n\n\nThe McGill Museum of Art in Montreal has released new data on the number of visitors to its institution in the last year. The data, which", "The next Biennial should be held in 2021. \n\n\nThe Museum of Modern Art (MoMA) in New York announced today that it is planning to open a new branch of the museum in the spring of 2021. The institution has been working on the redesign and renovation of the building, which is currently home to the museum’s collection of Primitive Arts, for more than a decade, and is currently in the process of purchasing the land where the contemporary art museum will be located.The site of the new museum, which will be located on the third floor of the Museum of Modern Art, is currently owned by the city of New York, and MoMA is currently working on a re-design that will improve accessibility and increase the museum’s museum-wide footprint. The redesign will involve rerouting traffic and providing more retail, adding galleries, and creating a public plaza on the ground floor of the building. The design also aims to create more outdoor space within the building, and will introduce more opportunities for the public to enjoy the works on display at MoMA.\n\n\nThe National Museum of Women in the Arts (MoNA) in Washington, DC, is planning to contract out some of its programming to a nonprofit organization founded by thirty-", "The next Biennial should take place in 2021 and will be hosted at the Museum of Contemporary Art in Los Angeles. The forty-second Biennial will take place in 2021 and will be hosted at the Museum of Contemporary Art in New York. The seventy-ninth will be in 2022 and will be hosted at the Seattle Art Museum. The seventeenth and the seventy-eighth will be staged at the Museum of Contemporary Art and the Seattle Art Museum, respectively.Last year, the museum announced that it will temporarily close its four remaining locations, excluding the Seattle Art Museum: the Museum of Contemporary Art Seattle, located at 3333 East Fourth Street, and the Museum of Contemporary Art Seattle, located at 600 East Fifth Street. The institution’s current exhibition schedule includes: Art on the Move, the Summer/Fall 2019 exhibition, which will return in October, and the Arts of Life, a solo exhibition opening in September 2020.\n\n\nThe Institute of Contemporary Art (ICA) in New York announced today that it is suspending its next-generation ICA Digital+ Arts Initiative—the $3.5 million, three-year program that aims to support emerging and established artists through digital platforms. The announcement follows a wave of resignations and protests from", "The next Biennial should address the legacy of the museum’s founding partner and create a more collaborative model for the partnership between museum and university. The Biennial of Modern Life (BAM) aims to provide a platform for contemporary art and will be held at the Museu de Arte de Madrid (MAS) from January 23 to January 29 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in New York has appointed Belinda Carlsen, the director of the National Gallery of Art in Washington, DC, as its next director. Carlsen comes to the institution from the Getty, where she has been the director of planning and international partnerships since 2015. She succeeds Leslie Salomon, who served as director since 1999, and will assume her post on January 21.“The following recipients of this year’s National Medal for Arts were selected by a committee chaired by Eric Schlosser, president of the Getty, at the end of January: Antonia Ferro, Aaron Kornbluth, Alexandra A. Busch, and Paul and Mary Beth Greene. They each received the National Medal for Arts for their contributions to the Getty’s mission of providing annual awards to advance the understanding of art history and the creative process.“", "The next Biennial should be held in 2021.\n\n\nThe Mill Museum in Seattle has appointed twelve artists as its fellows, including Nadine Lesage, who has been nominated for a Pulitzer; Alessandra DeCinti, who won the Venice Sculpture Prize in 2005; and Imogen H. Wootton, who will receive the National Endowment for the Arts’ 2018 award for curating the final installment of the HBO series True Blood. They will be joined by the curators of the two previous episodes, Lisa Michel and Steve Niles.“The full list of fellows is as follows: Gabriel de la Fuente AlbertanOlivier-Augustin-BlancartOlivier-Nicolas-BachetteOlivier-René-LévesqueAlbertanOlivier-René-Cullen-Smith/SaguenayFernando de la FuenteJPNArthur James RoachArthur James SiskindArthur Robert Siskind/SassuoloARTAlberto RojasArmando Ortiz/Deanna PollackArmando Ortiz/Francisco Ostrada/Argentina/ÜCeleste ReveraArtistic DirectorIrene", "The next Biennial should take place at the former Guggenheim in Rome in 2021. The institution has been working on revising its collection over the last decade and is currently working on a new plan for how it will present its collection in museums. During the exhibition, the team will also be working on a new collection guide that will be accessible online, and will present a selection of works by artists whose practices have not yet been presented at the Biennale. The exhibition will run from May to September of 2020. The biennale is organized as follows: The Festival of the Contemporary Arts in partnership with the Italian Ministry of Culture is pleased to announce that it will award the 2020 Farewell Prize to the artist and curator María Berrada. The biennial was founded in 2007 by the Italian pavilionist Mario de Palma, who was the director of the Florence pavilion from 2002 to 2009, and the Italian curator Francesca Polosa. The twenty-eight-year-old, who is also a Fulbright scholar, won the prize in 2016 for his work Handbook of Modern Art, and was chosen for his work Lost Art: Art and the Struggle for the Modernity of the", "The next Biennial should be held in the spring of 2021. \n\n\nNew York’s Whitney Museum of American Art has sent a letter to the Philadelphia Museum of Art announcing that it has received a gift of works by artist and activist May Rainer. The gift includes three works by the artist that were damaged in a fire that broke out at the Whitney in March 2018. The works will be on display in an exhibition titled “May Rainer: 20 Years of Art,” which will run until November 26.“We are deeply honored to receive this extraordinary gift,” said Whitney director J. Marion Nestle. “May Rainer, as an extraordinary collector who has enriched our lives and communities through her extraordinary collection, is an amazing gift for Philadelphia. The work of May Rainer and her remarkable staff is an outstanding showcase of the breadth and depth of Whitney’s collection. We are grateful to the curators, artists, collectors, and friends who have made this possible over the last twenty years. They have created a treasure trove of works that are regularly displayed in their exhibition and are cherished by their peers.”May Rainer’s work will be on display in “May Rainer: 20", "The next Biennial should take place in Melbourne in 2022. While the plans for both the Melbourne and New York chapters will likely still change in the interim, the first event will take place in 2020. The next edition of the Fifty-Sixth Venice Biennale will be held in 2021.\n\n\nThe New York City Department of Cultural Affairs (DCLA), which recently awarded $5.5 million to forty-three arts organizations in an attempt to encourage more engagement with the city’s cultural institutions, has released the list of twenty-four artists who have been selected for the 2020 panoramic Viewing Rooms. Nine of the artists were selected for the exhibition “Last Summer,” which will travel to the Getty and the Stedelijk Museum in Amsterdam next month. They will each receive $100,000 to pursue their artistic projects, and the other twenty-four artists will be given $50,000.The 2020 panoramic Viewing Rooms will travel on MetropolitanQuest, an off-site expedition organized by the DCLA, through September 29, 2020. The thirty-two artists chosen for the program are: Alessandra Zetto, Artutal, Milan, Italy; Benedict Cantoni, Cam"]