["The next Biennial should take place in 2020. The first, entitled Lunch, began at the Art Institute of Chicago in September of 2014 and ran until March of 2020.The second, entitled Noon, which was staged at the Museum of Chicago from January 17 to January 20, 2021, was presented by the same team with a different premise—that of a series of forty sculptures that would unfold over twenty-four weeks. The third and fourth editions of Lunch will take place over two days, and the fifth and sixth editions will take place over three days. In 2020, the exhibition will be held as part of the city’s 10-year celebration of the biennial.\n\n\nThe Grainger Collection in Los Angeles has announced that it is moving fourteen works by American painter Frank Stella, who in his later years often drew from his homeland, the Midwest, to New York City. The work, titled The Empty House, is currently on display in the lobby of the Contemporary Art Museum, which is slated to reopen in the spring of 2021. Stella’s work is currently housed at the Museum of Modern Art (MoMA), in New York, alongside works by Saul Kripke, David Sal", "The next Biennial should take place in the city of Barcelona in 2021. The next edition will be the seventh in the city and will include works by over sixty artists. The inaugural edition, held in 1993, featured works from twelve artists, including Ulrich Kamer, Alighiero Pilar, and Vladimir Solodov. The next exhibition will be held at the same venue in 2021.\n\n\nThe Dresden Art Museum (DAWM) in Germany has received a gift of five paintings by the late artist Rudolf Nurey. The works were donated by Nurey’s son, Dieter Nurey, in solidarity with a fellow patron of the museum who was also a former guest of the museum.Nurey’s son, Steven, first became interested in the collection when he bought two works by Nurey’s collaborator Haus der Kunst, Klaus Nurey’s Sex Demon from the garage of the late art dealer Herbert Wein, in the March of 1988. The dealer had given Nurey a loan of two works in 1986, but he never received them. The gift of the Nurey family’s collection of the painter’s work is the latest example", "The next Biennial should be held in 2021. The 2016 edition was held at the architecture museum in London as part of an exhibition “The Future Is Present,” and was the first of a new fifty-year-long project, the Future Matters, that will run concurrently with the annual exhibition.Commenting on the project, Stierli said: “The Future Matters project is part of a larger, worldwide project of thinking about how architecture will change and live differently in the future. The project not only examines the ways in which architecture will evolve in the twenty-first century, but also the disruption and destruction that this might bring about.”\n\n\nThe Museum of the City of New York (MoCA) has received a $40 million donation from the Diyarbakır Foundation, the newly renamed organization established by Prime Minister Recep Tayyip Erdogan to fund environmental preservation projects in the Turkish city. The funding was announced in a statement by Diyarbakır Foundation president and CEO Karim Kemal.The donation includes $20 million for conservation and restoration, which is part of a $100 million package that also includes the construction of two new conservation buildings; the restoration of an existing archaeological site, the Tadmur Museum of", "The next Biennial should be held in the spring of 2022.\n\n\nA group of artists, designers, and writers have petitioned the Italian government to establish an international platform to address climate change through the arts. The letter, penned by the artists Adrian Londis, Elisa Farinotti, and Fleur Delacroix, and signed by more than 1,500 academics, scientists, and human-rights activists, calls for the creation of a nonprofit organization that would organize exhibitions, train staff, and present educational programs.“While I welcome the initiative, we urge the government to take this step in the interest of the environment, the economy, and the public,” the letter reads. “The climate emergency is not over and it is getting worse. Climate events are becoming more frequent and severe, and climate refugees are on the move. The situation is not going to change any time soon without urgent action.”The letter, which was spearheaded by the environmental NGO Group 4 Climate Action, argues that the government should fund organizations that were active in combating climate change before it entered into force in December 2017, to avoid the “opportunity to repeat the mistakes of the past.” The group also argues that the government should", "The next Biennial should take place in 2020.\n\n\nRight now, the Ontario Institute for the Arts (OI) in Toronto is allowing artworks on display in its annual exhibition, “A Place of Sacred Vision,” to remain intact despite a major renovation project that will dramatically alter the exhibition. The proposed rebuild—which was approved by the Ontario government and approved by the province—is estimated to cost $133 million.The dismantling of the “Duluth Wind Power Station”—a forty-ton, sixty-foot-long, metal sculpture by artist Victor Boccardo—is not expected to start until late summer or early fall. Although the exhibition will be moved to a new venue, the works will remain on display, and the installation will be restored. The dismantling of the show will continue through at least the end of June.The refurbishment of the ICA’s current building—which was completed in 1981 and opened in 1993—has faced pushback from arts organizations, including the Toronto District School Board, which argued that the renovation of the museum was a waste of money. The ICA, which is affiliated with the university, wishes to keep the renovation project as simple as possible, and the school board", "The next Biennial should be held in 2021. \n\n\nThe Joseph and Edna Newhouse Museum in North Little Rock, Arkansas, has announced that it is working with the New York–based artist and educator Rebecca Watson to create a new program for the museum that will showcase work by innovative contemporary artists in an effort to further the museum’s commitment to LGBTQ+ history and visibility.Watson first created the space-based work The Painted City: A Retrospective in 2017, a series of over seventy paintings that reimagined traditional notions of landscape and created a meta-commentary on how art can be—and should be—about more than the natural world, but also the past and the future. The Painted City: A Retrospective will be on view until November 29.\n\n\nThe Friedrich-Alexander-Bickel Collection in Dresden is planning to open a digital space in the city in the next three years, following the example set by the Kunsthalle Basel in Switzerland and the Kunstverein Stuttgart in Germany. In a statement, the museum said: “The work of Francis Alexander-Bickel and the collection consists of a mixture of traditional and modern techniques. The digital platform will help to advance the", "The next Biennial should be entitled “Imagination and the Present: Art and Fantasy” and should be held in 2019. The first edition, “The Artist’s Body: From Memory to Reality” (2019), will be presented by Sabrina Schnabel in the exhibition space of the Berlin Art Museum (BAM).Schneider, whose body of work includes the artworks “The Devil and the Picture: Painting in the Dark,” 1994–2004, and “Trace and Influence: Painting and the Modern World” (2007–2008), was awarded the Golden Lion at the Venice Biennale in 2009.Schneider also has works at the Württembergischer Kunstverein (German Cities) exhibition in Stuttgart, the Hamburger Banhof, and the Hamburger Heimische Kunstverein. The artist’s body exhibition at the Museum for Modern Art will open in the exhibition space of the Museum on August 23.\n\n\nA group of artists and curators have sued the Museum of Modern Art (MoMA) in New York City over its decision to remove an exhibition by artist Frank Gehry from its collection in January 2019. The lawsuit,", "The next Biennial should take place in the fall of 2020. The closing date of this year’s event will be July 21. \n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Bethany Hall as its next director. Hall took the helm at MoMA in January 2019 after serving as the museum’s senior director of curatorial affairs for the past three years. During her tenure, Hall has organized more than 130 exhibitions and has added more than 700 works to its collection. She was previously the head of the Metropolitan Museum of Art’s art conservation and preservation department.“I’m thrilled to welcome Bethany to the museum,” said museum director Matthew Teitelbaum. “Her leadership, enthusiasm, and commitment to MoMA’s curatorial and conservation efforts are inspiring and commendable, and she is a strong leader for future generations of curators.”Hall’s appointment marks the culmination of a six-year journey that began at the Met with the development of MoMA’s new location on Forty-Sixth Street in 2007 and has since involved the restructuring of the museum’s collection, its expansion into a new building on East Twenty-Third", "The next Biennial should take place in 2020.\n\n\nAs the president of the Royal Academy of Arts in London, Prince Charles has appointed artist Vicki Beck as its next director. Known for her large-scale installations and multimedia works, Beck, who is ninety-four, is the author of the books My Body, My Art, and Art in the Age of Intersection (The Art House and Tate Modern) and Away from the Sun (The Art Gallery, London and the Serpentine Gallery, London). She is also known for her installations of translucent polyester resin and glass works, the former of which were included in the 2020 biennial. The latter exhibition, Away from the Sun, was staged at the Serpentine Gallery in London in 2020 and will run until March 23, 2021. Beck’s installation The Bathhouse, 2018, will open the new exhibition “The Color of Light: An Exhibition of Art,” which will include ten works by thirty-three artists. The museum will present “The Bathhouse” in a new exhibition on January 29.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Debbie Loveless as its next director. She succeeds Mark", "The next Biennial should employ up to five artists, who will collaborate across multiple sites, such as the Museum of Contemporary Art, New York, the Brooklyn Museum, and the Museum of Modern Art.  This year’s event, dubbed “The Spring/Fall Collection,” will focus on the connections between art and the broader social and cultural landscape. The exhibition will be open from March 8 to March 10 and will feature work by forty-eight artists. The theme is “Diverse Worlds: Art and the American Experience.” The inaugural exhibition will be held at the museum every February. The museum will also present the biennial biennial at its new space, the Boston Art Museum (BAM), next month. The fifteenth edition of the biennial will be held at the Museum of Contemporary Art, Boston (MoCA). The biennial will highlight the work of forty-five artists and will run from March 13 through March 27.\n\n\nThe Tate’s board of trustees has decided to suspend all performances and events at Tate Modern for twenty-four hours on February 11. The move comes after the museum received a string of casualties last month, including the seventy-four people who lost their lives when a massive", "The next Biennial should focus on “the art, production, and reception of contemporary Islam” and will be held at Clos Haute-Dalai in Paris. The 2019 edition will take place on October 14–October 16.The Art of Tomorrow, the first museum to screen the “Art of Man” exhibition, is seeking partners for its next iteration, which will be held at the Museo de Arte Contemporáneo in Madrid from March 18–March 19. In order to deliver a new exhibition dedicated to the work of contemporary artists, the event will also feature new projects with the diverse artistic and cultural sectors in the city. The new twenty-year mission of the institution is to promote the works and ideas of the artists who have influenced the revitalization of the city, and to build on the many innovations in European art that have shaped Central and South American art. \n\n\nThe National Gallery in London has appointed Dr. Joëlle Gifford as its new director. In her new role, Gifford will oversee the development of the National Gallery’s collection, exhibitions, education, research, and outreach programs, and is responsible for assembling a team", "The next Biennial should focus on “peer production,” Sotiris, whose research focuses on the theory of art and artmaking, told Artnet. “I want to do a retrospective that will bring together contemporary artists who embrace the full panoply of emergent possibilities,” he said. The Biennial will stage seventeen exhibitions and will close on Saturday, March 22, at 8 p.m. EDT. The biennial’s inaugural edition, titled “March of the Living,” was held at the Gallery of Modern Art in New York in 2008 and consisted of twenty-five works that met the theme of a “loving and harmonious relationship between life and the natural world.”\n\n\nThe British artist and filmmaker Damien Hirst has died at the age of ninety-nine. The British Foundation (BFI) has named him as its Victoria Medal Laureate. Hirst’s prior award, which came in 1980, was for his best-known work, 1967’s The Wind Rises, an abstract, multi-layered canvases that bridges the abstract and the physical and bridges the physical and the physical and the physical and the physical and the physical and the physical and", "The next Biennial should be held in the city of Marseille in April 2020.\n\n\nThe National Museum of Art (NMA) in Washington, DC, has hired Chase Butler as its next director. Butler joins the institution from the Metropolitan Museum of Art in New York, where he has served as deputy director of curatorial affairs since 2016. He succeeds Michael L. Quinn, who retired in May after seventeen years at the museum.“While I have always admired Chase’s talent and vision, I have had the opportunity to work with him for only a short time, so I’m eager to learn more from him and his team as we embark on our new direction,” said NMA director Joseph C. Catlett. “During this transition we have had the opportunity to further support his work as a curator and educator and I’m confident that he has the tools necessary to make an ambitious exhibition program and a robust collection that will continue the extraordinary work of his predecessors.”John Sargent, who has served on the board of trustees of the museum since 2004, said: “Chase’s twenty-two years at the Museum has been a source of inspiration and inspiration for me and countless others through", "The next Biennial should be done by February 2020. It is not yet clear whether the funding will be renewed. 'The Art of the Future', a symposium presented by the museum for the first time in 2019, will be staged at the Fondazione Museo Biennale in September. The festival’s inaugural edition, which took place at the Museo di Cimagine in Milan in January 2019, attracted some twenty-five thousand people to Rome in March of 2020. The exhibition will remain on view through October 26. “The Art of Life” is a collaboration between artist and museum and is part of the upcoming ‘Love. Life. Life: The Art of Life’s’ Future, which is organized by the Fondazione Museo CIMAM (the Museo Plenzia in Rome), in association with Fairpointe, the contemporary art center in London, and will be held at the Fondazione Museo di Cimagine in Milan until March 26, 2020.\n\n\nThe Pérez Museum of Art in Madrid has received a gift of seventy-six works by the legendary architect Huálio Pérez, including a painted sarcophagus,", "The next Biennial should be announced in 2020. \n\n\nThe Künstlerhaus in Cologne is planning to close its doors indefinitely in an attempt to reduce the carbon footprint of its buildings. The decision was made after an ambitious expansion, launched in 2016, that transformed the institution into a cultural hub.The Künstlerhaus was founded in 1844 by Friedrich Künstler, a German Jew who immigrated to the United States in 1897. Since its inception, the Künstlerhaus has hosted more than seventy thousand visitors. Its newest addition, the Künstler Museum of Fine Arts (Künstler Museums) in 2016, was inaugurated by a group exhibition of paintings by the artist Johannes Georges Stumpf, which was staged in collaboration with the Künstlerhaus.In order to reduce its footprint, the Künstlerhaus will temporarily move some of its exhibitions and programming from its current space in the Kreuzberg district of Cologne to an outdoor space on the outskirts of the city, known as the Künstlerhaus-Villenheir, in 2020. The move will also extend the Künstlerhaus’s current", "The next Biennial should be on October 6–20, 2020. Logo is still on loan to the museum, and the institution will continue to serve as the public face of the brand, although it has since closed its doors.“We will continue to experiment with new ways of looking at the museum as we continue to present exhibitions that reflect the breadth and depth of the collection,” Zak Kambayashi, the director of the Hong Kong Museum of Art, said.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines for when and how museums may reopen following the coronavirus pandemic. While the guidelines are meant to prevent overcrowding, mitigate traffic congestion, and promote health, they do not address how institutions should reopen or how long it will take them to reopen. The department has since received more than 1,000 comments on the guidelines, which were released on September 28.The guidelines outline three scenarios for institutions that are trying to keep their doors closed as much as possible: 1) when the risk of an outbreak increases; 2) when the public health situation deteriorates further; and 3) when the number of cases in the city is at an all-time low. While institutions", "The next Biennial should be held next year, and the first exhibition will be staged in 2020. New works created by twenty-six artists are currently on view before the Museum of Contemporary Art in San Francisco. The 2018 edition featured work by nineteen artists, including Tara Donovan, Thomas Dolby, Patricia Harrison, and Nari Ward.\n\n\nThe Museum of the City of New York (MOK) has named Kathy Blum, a curator, writer, and educator based in Austin, Texas, as its next executive director. Blum will be responsible for leading the institution through a transition that will include the transition of leadership and operations and will assume her responsibilities on January 5, 2021.“Kathy has been instrumental in revitalizing the MOK through an ambitious fundraising campaign, and has led MOK through a series of important exhibitions that have catapulted our program and our community to new heights of artistic and educational excellence,” said Museum director Christopher Woolf. “Her expertise and passion for New York City and art is inspiring, and we are counting on her to continue to shape MOK’s trajectory as a leading cultural institution in America.”Blum succeeds Kim Stanley, who was hired as executive director in March 2019", "The next Biennial should focus on “the inexorable link between science and politics,” said Sydney’s architectural and design historian, Lyle Martin. The retrospective will focus on “The Structure of Work and its Impact on Society,” inaugurated by a new series of exhibitions that will highlight the work of Australian artists in the years to come.Gavin Brown, director of the Queensland Museum of Art, has also called for the exhibition to be relocated. “The exhibition is in a vulnerable position because it cannot move to a new location, without damaging the biennial, as it already suffers damage from the dismantling of its current exhibition space,” he wrote in a letter to the museum’s board. The move would also disrupt the biennial’s programming. “We are currently working with a third party to determine the best possible site for the exhibition, but we are hopeful that a venue that best reflects the vibrant and elusive spirit of Australia will be found,” Brown wrote.While the de-artillery of the city of Brisbane—the largest such undertaking in the world—has been taking place for more than two centuries, the biennial’s installation was completed in 1980", "The next Biennial should be selected by a group of artists whose works will be included in the exhibition, which is currently on view until November 22, 2020. Marked by its experimentation with and focus on indigenous art, the twenty-third edition of the event will focus on the body politic\u0097community, politics, and the environment\u0097as well as reflect on the contemporary condition in Hawaiʻi.\n\n\nThe Psychthu Jee Foundation in New Delhi, which works with and trains children in India, has announced its support of the PrayerBridge Campaign; a multi-national movement of artists, creatives and activists working to raise awareness and funds for the PrayerMakers’ plight in the wake of the devastating earthquake and fire in India’s northern states last week. The foundation announced the organization’s pledge to match $1 million raised by the campaign, which was founded by artist and fan Deepak Gupta in 2016, on March 28. Foundation president and CEO B. Raja Mishra said: “PrayerMakers is a very powerful tool for raising awareness of the devastating fires in India and it’s a tool that can have a real impact on changing", "The next Biennial should take up the questions: Why does a work of art endure? And What can become of an art? Over the course of the show, Willem de Kooning will open a space for the exhibition of art in the future for the exhibition “art, not objects”.Previously organized as part of the Biennale de Lyon in 1967, the event was moved to Zurich in 1976 and then to New York in 1981. Willem de Kooning’s vision for the event was to premiere a new work every year in an attempt to avoid the exhibition of works that had already been exhibited. He stated that the “heart of the exhibition is to be found in the public gallery, where the exhibition is connected by a common point of view.”\n\n\nThe Richard Avedon Foundation has awarded CNA the 2019 Richard Avedon Award for its Renewal Project, a $100,000 grant that honors independent New York artists in the twentieth year. The honor comes with a $150,000 cash prize and a lifetime achievement award. The first prize winner is Mario Tama, who will be presented with a $50,000 prize in the year 2021. The Philip Johnson Foundation has also named the 2019", "The next Biennial should take place in the spring of 2021. The show will then focus on themes of interconnectivity, the collective, and the biennial process. In an interview with Paris-based art critic Bernard Maréchal, the director-general of the Diller Scofidio + Renfro Foundation, Guido Janz, said: “The next Biennial will be an academic event with the same ambition as the previous two, only better as we continue to organize and plan.”\n\n\nThe rehabilitation of a masterwork by the Italian painter Raffaello Cattelan, The Projection of Light, will be shown at the Venice Biennale in 2021. The exhibition’s first exhibition devoted wholly to a painting by Cattelan, The Curator’s Intervention, opened at the Art Institute of Chicago last September. The work, a collaboration between Italian and Romanian artist Giuseppe Negri, is an exercise in futurism, a result of Cattelan’s frontal vision of a television set. The juxtaposition of light and painting achieves the dual effect of creating a sculpture that simultaneously embodies the digital image and the abstract thought processes of the viewer.", "The next Biennial should focus on the concept of storytelling, the relationship between public and private art, the role of cinema, and the relationship between motion pictures and the visual arts. The theme should be “Theater, Cinema, and the Body.” The exhibition will be curated by artist Sam Gosselin and will take up themes such as the body, the physical, and the body parts. The first edition of the biennial was held in 1995.\n\n\nThe Shanghai Biennale, which has been suspended since March due to the coronavirus pandemic, has announced that it plans to start back up this week. The exhibition, which was originally scheduled to run from March 21 to March 23, will resume on April 8. The announcement came ahead of the twenty-fifth edition of the exhibition, which will focus on the work of female contemporary artists, which will be held at the Museum of Contemporary Art Beijing and will be hosted by the Botanical Gardens of the Chinese Academy of Fine Art and the Four Seasons Hotel.Since March the exhibition has been heavily disrupted by the coronavirus, which has infected more than 1,700 people in China and has caused at least 300 deaths. The coronavirus has also affected the art world, causing major", "The next Biennial should focus on an exploration of new and contemporary artistic practices, specifically selected from a diverse, yet interconnected, array of arts and humanities. After the Biennial, the next Exhibition should encompass a consideration of the creative and social conditions of a large‐scale public exhibition.  It should then include a biannual Exhibition of the Work of the Last Five Years, for which the current biennial biennial should have been the theme. The path taken by the members of the Committee for the Arts and the International will provide an important insight into the development of the Biennial program.  The biennial is supported by a grant from the John and Elizabeth King Family Foundation.\n\n\nThe Solomon R. Guggenheim Museum in New York has appointed Laura Rosa Costa as its new conservation curator. Costa will be responsible for developing exhibitions and education programs for the museum and will assume her post in January 2020.“Laura is an accomplished curator and educator who brings an innovative perspective to the art collections and collections programs at the Guggenheim,” said James Bell, the museum’s director. “Her work will be of great value to our visitors and patrons as we continue to present works by contemporary artists. I", "The next Biennial should take place in October 2020.\n\n\nSandra Eisenegger, the curator and director of the groundbreaking exhibition “Feminine Solidarity” (2017–18), has died at age seventy-nine from breast cancer. She is survived by her husband, Peter Eisenegger, and their daughter, Laura.Born in Berlin in 1939, Eisenegger moved to the United States to study painting and to become a fashion designer. She eventually landed in New York in 1957, where she met her husband, Peter Eisenegger, and their daughter, Laura. The couple relocated to Los Angeles in 1962, where Eisenegger continued her studies; in New York in 1967, where she met her first husband, George Michael; and eventually, in 1977, in New York, where she met her second husband, Mark Rothko.In the late 1980s, Eisenegger took up the post of curator and author of  “20 years of feminist art”; a 2015 retrospective at the Guggenheim in London included paintings by thirty-six artists, including the French-born and Norwegian-born artist Oumalu Afuna. Her current exhibition, “20 Years of Women” (2019), is", "The next Biennial should begin in November 2020. The museum will be inaugurated by a new group exhibition of works by the Indian classical painter Sapna Galli, which will be followed by an exhibition of works by the late Pakistani architect Faizabad architect Hoor Al-Jawwali, and will also experience a period of restoration in the form of a new facsimile of the 1962 disaster.\n\n\nThe National Geographic Society in Washington, DC, has appointed Ellen Brown as its new associate director. Brown joins the institution from the Smithsonian American Art Museum (SAAM), where she has served as deputy director for the past twelve years. She succeeds Tina Brown, who has served as chief curator at the institution for ten years and will take up the post in January 2020.“Ellen brings exceptional breadth, depth, and vision to the National Geographic Society, and we’re excited to see what she does next as director,” said Carl Sargent, the institution’s current director. “She is both talented and determined, and the National Geographic Society’s board of directors knows that she is the right person for the job. We look forward to working with Ellen and we hope that she will continue to shape the", "The next Biennial should be a celebration of the highly inventive and inclusive spirit of our city and state. We must continue to create exciting and moving ways to connect with each other and with the world around us. \n\n\nNew York’s Metropolitan Museum of Art has announced that it will replace the controversial David Rockefeller–designed David Chipper Art Museum with a new museum that will be dedicated to African American art. In a move that is expected to significantly reduce the museum’s footprint, the museum will move from its current location in the former General Motors assembly plant in Warren to its new headquarters on East Seventy-Third Street in Manhattan.The announcement follows the museum’s recent transaction with the estate of the late financier David Rockefeller, who ordained that the museum’s current location—which sits in the former GM plant on West Twenty-Third Street—would remain in operation. The move has allowed the museum to shift from its current programming to focus on the history of Black art and the legacy of David Chipper. “This is a moment of great change for the museum,” museum director Daniel H. Weiss told the New York Times. “Chipper created a new kind of institution that unites", "The next Biennial should be held in 2022, and the next in 2021. The 2019 exhibition was the first to feature a new movement of sculpture and installation to be called “Africa” and was attended by more than fifty thousand people. Art historian Tarek Atoui, who curated the exhibition, said: “The first opportunity we had to see an African artist from the region was the exhibition ‘National Gallery of Art’s ‘African Art’ in 1989. Obviously, this was the first time we got to see an artist from a region not controlled by Britain. But we have had many opportunities to see artists from the region in the past. And with the installation of new works, we are very much excited to be able to present the first exhibition of its kind on the continent.”The exhibition, titled “Africa: A Past Present,” will be staged at the British Museum in London, the National Gallery of Art in Washington, DC, and the McKnight Museum in Bristol. Set to open in the spring of 2021, the Biennial is funded by a £30,000 grant from the National Lottery Heritage Fund and will run for twelve months. “As art", "The next Biennial should be held at Punta de Solea in Lisbon in 2021.  Heres what Anindito Banerjee, the director of the Biennial, had to say about the project. Bender, who is also the founder of the Art Gallery of New South Wales, has been a longtime supporter of the show. He told the Sydney Morning Herald that the institution has given him a total of $4 million to fund the biennial. He plans to open up a new exhibition center at the museum.“It is a worthy project,” Bender said. “And it will be a challenge and an honor to create a new exhibition that will reflect many of his most significant works,” such as the Druid’s grave in the centre of the exhibition. He also added that the biennial will offer a chance for the exhibitionists to see the work of the curators from the gallery of their choice.The opening of the exhibition will be timed to coincide with the centenary of the artist’s birth, which is currently being held at the Museo de Arte Contemporáneo da Barcelona. The exhibition was initially announced as part of a project to create a ", "The next Biennial should be held in 2021. The Francis Crick Science Museum in London has proposed holding a twenty-eighth, twenty-ninth, and twenty-twelfth edition, which will take place in 2023.In an editorial published by the Art Newspaper, the exhibition organisers said: “As our scientific endeavours progress and we gain a better understanding of the universe, so does our capacity for awe and wonder. . . . We feel it our duty to honor the achievements of both the present and future by celebrating the past. We hope that the new biennial, which will take place in 2019, will continue to represent the spirit and creativity of this year.”\n\n\nThe B.I.G. Museum in Cleveland has received a gift of more than five thousand photographs by the late British photographer Carlie Boehm. The museum announced on Monday that it had donated the works to the biennial’s collection. The donation includes fourteen images of the artist performing a woman’s style object, a women’s bathing suit, and thirteen portraits of the artist’s own children, the artist’s grandchildren, and her great-grandchildren.The works were acquired by the biennial through a joint venture", "The next Biennial should be held in 2022 and the first in 2024. \n\n\nThe OMA’s collection of more than two thousand works on paper, collage, photography, video, sculpture, installation, and performance has undergone a major renovation, which will include the building of a new, state–of-the–art exhibition space and the reopening of two of the arts’ most popular exhibitions, “Live and Let Die” (2015) and “Gideon R. Upchurch: The Art of Performance” (2015), which opened last year but has yet to reopen. The renovation is part of the organization’s ongoing effort to develop new ways to engage with the art of paper and to improve accessibility and accessibility solutions for the collection.“Over the course of the last twenty years, OMA has been working hard to transform the collection into a powerful platform for the continued growth of the modern art movement and for furthering the vision of its founder, Robert Reich,” said Michael A. Wagner, chair of the board of trustees. “We are excited to be using the new facilities to build on the OMA legacy as a leading art museum in the world.”Alongside the", "The next Biennial should be held in the quarter-century following the date of the exhibition, which would be conducted at the new Museum of Modern Art, curated by Julian Nagy. The theme of this year’s event would be “Forms and Fragments,” and the exhibition would feature work by eighteen artists and twenty-four other groups. Organizers said the theme of the exhibition was not meant to imply that the works in the exhibition were “made by some group of artists.” Instead, the organizers said, the aim of the exhibition was to “underscore the power of form in creating the work in question.”Nancy Spector, the president and CEO of the National Association of Theater Owners (N.A.T.O.), said: “In an age of political gridlock and declining revenues, the combination of the full range of American visual art with the American concept of art is a powerful antidote to the politics of the spectacle and the glamour of the avant-garde. I look forward to continuing this tradition of innovation and experimentation at the new N.A.T.O. – a museum that will continue to engage with and expand upon the American experience through an art", "The next Biennial should be held in 2021-20 and will be organized as follows:\n\n\nThe National Gallery of Art, Washington, DC, has announced that it will reopen in the spring of 2021. The complex’s new $450 million replanning of the museum will open in the summer of 2022. The museum will continue to operate as usual in April, landing in April for two weeks of events and exhibitions.The redesign, which was developed by the Washington-based firm WIDGE, consists of four reconfigured levels and a new lobby, plus a redesigned interior, elevators, and galleries.“It is truly an honor to introduce the innovative, up-to-date, modern-day National Gallery of Art,” said National Geographic CEO Scott Feuerstein. The redesigned museum will also feature a new exhibition on the life and work of the late artist Philip Larkin and a new digital platform, which will be announced in the spring. A new, expanded, and revised public art program, the Larkin Center, will launch in May 2021.\n\n\nThe United Kingdom’s House of Commons Science and Technology Committee has approved a draft bill that would require the country’s major tech companies to make more transparent information", "The next Biennial should be called the 'year of design', and a new exhibition should be organized developed by Douglas Adams. The high cost of exhibiting works by these three artists has led to a decline in the sales of their works in recent years.Art historian and critic William Eggleston of the New York Times writes that the exhibition “will be a landmark for America’s design, one of the most important exhibitions since the turn of the twentieth century.”\n\n\nThe Greening Museum in New York has received a gift that will mark the first time that the institution has ever hosted a major retrospective of a living artist. The work, which was created in the late artist’s native Nigeria and comes with a $40,000 donation from the artist’s family, was created in collaboration with the artist’s daughter, Jumana, and her husband, Yawm Suleman, and has recently been gifted to the museum.The works, which are titled The Eggplant (Nigeria), and The Egg (Late), respectively, and were created in collaboration with artist-artist Vicky Cheatham, and are on display in the exhibition “A Place For the Eggplant”", "The next Biennial should take place in the spring of 2021. The exhibition should include a selection of works by artists whose practices are central to the ongoing work of their respective disciplines, and should be centered around a theme of the body and the body's relationship to art. It should also include a selection of works by women artists. Devotees and art historians have called for the exhibition to be held in the spring, and Suharto and Panneko Petronas, the organizers of the forthcoming Biennial of African Design, stated that it will be held between late March and early April.  The exhibition is being organized by the Laboratoire des Arts et Lettres (LAC), a Paris–based nonprofit conceived in 1982 and headquartered in the city of Lyon. In recent years, the organization has organized more than seventy exhibitions of work by women artists in France.The organizers announced the theme for the 2020 edition of the event in March. They chose  “Chronology: a chronological narrative of the body” as the theme of the event. The work, which was created with the assistance of twenty-two artists, was inspired by the work of French artist Catherine Diller. The exhibition was organized by the Gilles", "The next Biennial should focus on “Soul of a Nation: Women’s Liberation and the West,” which will honor feminist artist and activist Doris Duke. The exhibition will also be more ambitious, incorporating more exhibition space and more cultural institutions, and will open in 2022.Ivan Albright’s first solo show in the US since the late 1990s will open at the Brooklyn Museum in 2016, and the first exhibition in the US devoted to women’s liberation will open at the Museum of Modern Art in 2020. The biennial will also introduce a new biennial section devoted to women’s studies, a new section dedicated to the theater, and a new program of exhibitions and residencies.“We are fortunate to be able to present the first exhibitions focused on women’s rights and liberation in the US in twenty-four years at the Museum of Modern Art,” said Jayda Collins, director of the museum. “The future of these exhibitions and of our program lies not only in the biennial but also in the exhibition and the biennial’s architecture. We need to design a future for most exhibitions to reflect what our future will look like. We need diversity of interests and approaches,", "The next Biennial should be ready in the third quarter of the year, with a new entry in June 2020. It has been estimated that the costs for the first and second iterations of the exhibition would total $3.6 billion, and the 2020 edition would be completed by June 2021. Organizers expressed excitement about the collaboration with the National Geographic Society as well as the support of museum professionals, including David Geffen, the president of the National Geographic Society.The Museum of Fine Arts (MFA) in Boston is also working with the Smithsonian Institution to create a new monument that will honor John Kenneth Townley, a prominent Boston architect who was the first American to win the Nobel Prize in architecture in 1931. The monument will be located at Main and Warren Streets in the heart of the city, and will include a collection of more than 2,500 photographs documenting his career and will be composed of five major elements: a chair, a table, a fountain, an altar, and a fountain. It will be created in his honor and will be surrounded by landscaping, public art, and historic monuments.Museum director Susan H. Smith said: “John Kenneth Townley has created a profound legacy for Boston, and his work is well worth celebrating. I�", "The next Biennial should be held at the Museum of Contemporary Art, Los Angeles, in 2021. \n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, has released the list of artists who will be featured in its next edition, titled “The Real Story,” that will open on June 3. Titled “The Real Story,” the exhibition will also feature performances, installations, audio and video works, and other works that have not yet been exhibited in an annual exhibition.“The Real Story’s ‘Guest Artists’ project, which has been in development since 2015, is a way for the artist group Nari Ward to engage with the theme of the exhibition,” said Katia Pape, the director of MoCA. “Nari Ward’s works engage with themes of memory, resilience, and the power of the self through a series of interrelated performances that are inspired by her own experiences.”The artists nominated for The Real Story’s “Guest Artists” are, as follows:Alberto E. Rodriguez-Alberto Rosales - The Shape of a Man (Spain)Front of the Museum of Contemporary Art, Los Angeles Alberto", "The next Biennial should take place in 2020.\n\n\nThe Cyprus Museum of Art (MY) in Nicosia has announced that it will postpone the nineteen-year-old exhibition “Cyprus: The Cultures,” which was scheduled for the spring of 2019, until May 2020.The exhibition, which was commissioned by the Finances’ Museum of Art in Athens, was scheduled to open on February 25, 2020. The museum said that the postponement was made in order to “use unnecessary risks and to make possible the reopening of the exhibition in late May or early June.”The exhibition, which was set to include thirty-five works by forty-one artists, including three from Cyprus, was originally supposed to open on March 21, 2020. It has since been moved to April 21, 2020, and will now open on April 24, 2020, with the opening ceremony taking place on April 20.The fifty-eighth edition of the IMAGED NYE Fashion Festival, which will take place at the Javits Center in New York on May 2, 2020, has also been pushed back. The event will now run May 4–May 6, 2020.\n\n\nThe Los Angeles County Museum of Art (", "The next Biennial should be held in 2021, the Arts Council says. The Royal Commission for the Conservation of Architecture will also be hosted in 2021.From October 2021 to March 2022, the Biennales in Paris, Brussels, and London will be held. The 2020 edition will take place at the Grand Palais in Paris, which opened in 2017 and closed in 2018. “The golden age of the art world is upon us, and we are going to be the best stewards of it,” said Jill and Tom Witheridge, the Witheridge Gallery Foundation’s trustees. “The Witheridge Gallery Foundation is a center of excellence in contemporary art. It is the ideal platform to engage with the challenges and opportunities of contemporary art, and to witness the work of artists whose work we admire.” The consortium currently comprises Automattic (New York), Blackrock (New York), BlueVista Gallery (New York), Blue Ribbon Gallery (New York), BlueTip Gallery (New York), BlueWave Gallery (New York), BlueWall Gallery (New York), the BlueWall Museum (New York), BlueWall Studio (New York), BlueZone Gallery (New York), BlueZone Studio (New York", "The next Biennial should be on the theme “Dangerous Ideas,” which is currently being developed by the HRA and will open in October 2021.\n\n\nThe second edition of the Dusseldorf-based Dusseldorf Art Triennale, titled “Dusseldorf Art Treffen (Dusseldorf),” will run from September 26 to October 29 in the city of Dusseldorf from September 24 to 27. The event will take place at the V. Deutschplatz, bisected by the Brandenburg Gate in Berlin. The event’s ticketed event will be the first triennial event hosted by the Dusseldorf-based organization since the construction of a new museum in the city in 2004. The event’s theme, “Dangerous Ideas,” will focus on issues of the mind and body, with a particular attention to the psychological, physical, emotional, and spiritual dimensions of art. The event will feature work by forty-four artists that will be presented through an immersive experience at the brand new Günther Kunsthalle in Dusseldorf.The project of the annual event, which was founded by", "The next Biennial should be staged in 2021 and will be curated by Sir David Attenborough and will be curated by a select group of international experts, including Sir Simon Peake, Sir John King, and Sir David Osborn.  The 2019 event, entitled the Future Life of Art, drew the highest number of visitors of all the Biennials, with 153,907 people taking part. \n\n\nThe National Galleries of Scotland (NGA) announced that it will create two new funding streams through its sales of arts and culture, technology, and other items, which totaled $3.7 billion in 2021, and will begin to divert sales proceeds from its headquarters in Edinburgh to support arts and culture in Scotland.The announcement comes on the heels of the Scottish government’s decision to transfer more than $1 billion from the NGA’s current operating budget to the arts and culture budget to help encourage the development of local, community-driven, and international arts and culture. “The NGA is preparing for a world where the arts and culture sector is increasingly integrated into the fabric of society,” Scottish minister Murdo Fraser said at the time. “Our borrowing for cultural enterprises will be a critical", "The next Biennial should take place in the near future.  The first exhibition is scheduled to be held in the coming years. \n\nThe Museum of Contemporary Art (MoCA), Los Angeles, has announced that it is planning to shut down its five-story, 150-year-old institution, which comprises four buildings and is located at 1300 S. Santa Fe Avenue, in 2020 and to move the show, “City of the Arts,” to Santa Monica. The move follows the acquisition of the building by the nonprofit arts organization LA Architecture & Design, which plans to turn the space into a 400,000-square-foot public space.“This is an extraordinary time for architects and designers, and a pivotal moment for our city,” said MoCA director and CEO Adrian Wojnar. The museum often showcased work by established and emerging artists in exhibitions that took place on the third floor of the museum. The new exhibition, which is scheduled to open in 2021, will feature a selection of works by twenty-one artists, including Yuri Gagarin, Louise Bourgeois, Urs Fischer, and Warren Kanders, and will also include a virtual reality installation by artist Alexis Santiago.Museum director Yvonne Lutz noted", "The next Biennial should have a new actor-in-residence, a prize committee comprising the artist and director Nari Ward, the curator of contemporary art Nicknamed the Grinch, and the director of the experimental studio Yuz Museum, the former director of the ambitious film program at the National Film and Television Archive in the US. According to Garth, the exhibition will also include a new program that will focus on the African diaspora and will feature a new interactive installation by artist and educator Mariko and Khadeer Khan, a New Orleans native and the founder of the nonprofit Museum of African Diaspor.''The Biennial’s legacy is long and diverse, and it’s increasingly evident that its vision and impact are deeply felt by millions around the world,” said Takashi Tezuka, president of the National Museum of Japan. The museum is planning to stage a retrospective of the artist’s work in the spring of 2021, but the exact date and venue have yet to be determined.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles announced today the opening of a new retrospective devoted to the avant-garde and experimental New York instrumental music scene, which has produced some of the most influential", "The next Biennial should be held in 2020.\n\n\nNew York–based nonprofit the Metropolitan Museum of Art (the museum) is facing a legal complaint from homeowners who live near the institution due to the building’s construction, according to the New York Times. The complaint, filed by two women who lived on the building’s sixth-floor unit, asserts that the museum breached its lease by capping the building’s annual rent at $3 million and by pushing for the museum’s acquisition of the building’s historic furniture.The Met is currently renovating the museum’s building, which was completed in 1937 and recently underwent a $30 million facelift, and one of the first steps in the process is the demolition of the tenant’s seventy-three-year-old kitchen, which is located on the second floor of the museum. The museum is also currently working on removing the last remaining twenty-five-foot-long piece of the historic building, which is known as the Gallery, as part of a larger renovation of the museum.The lawsuit alleges that the museum breached its lease by holding off on tearing down the entire building for several years and by pressuring tenants to accept paying a higher rent rate", "The next Biennial should focus on contemporary art history through the lens of the French Mid-Century Modern, which celebrates its century-long history through a collection of paintings that are spread across twenty-one exhibition spaces in a museum complex designed by architect Pierre-Auguste Sesel, the founder of the Périgord Foundation. Such an exhibition would include works by artists whose work has not yet been presented in the United States. \n\n\nThe Chelsea Museum of Art has appointed Jennifer Delancey as its new deputy director for curatorial affairs and chief curator. In her new role, which is funded by the museum and the David and Lucille Jewels, the institution will create an exhibition of work by artists whose work was previously on display in the museum but has not yet experienced a major reorganization.Delancey comes to the museum after serving as a curatorial assistant at the David and Lucille Jewels from 2009 to 2014, leading over fifty exhibitions. During her tenure, she organized several initiatives designed to advance the careers of female artists such as “Gender: New Art 2007–2008” (2016–17) and “Sherry Tompkins” (2015–16). During her tenure at the museum, she also published", "The next Biennial should aim to “add value to the public experience’s of the exhibition space, the walls, the floors, the ceilings, and the gardens,” the organisers wrote.The exhibition will be held at the Haus der Kunst in Berlin from January 24 to March 3, 2020.\n\n\nThe United Kingdom voted to leave the European Union on June 24, and Prime Minister Boris Johnson announced that the UK will begin its formal Brexit negotiations on July 1. While the process is expected to take two years, the UK’s withdrawal will not be complete for another two years. After leaving the EU in March 2022, the UK will return to the international body’s single market in March 2020. In a statement, Johnson said: “There will be a period of six months during which we will fully expect Britain to depart the European Union.”He continued: “The process of leaving the EU will not be smooth and it will not be cheap, but it will be an exit that delivers for the many, for the many, for the many.” In a meeting with fellow EU leaders on Wednesday, Johnson said that the UK is committed to continuing membership of the bloc and remains committed to remaining in", "The next Biennial should be held sometime in 2020 and is already planning to expand its existing programming.\n\n\nThe Museum of Fine Arts (MFA) in Boston is planning to open a new wing in the museum in 2021. The Museum of Fine Arts (MFA) was already working on the redesign of its current building at 1000 First Street, which it has occupied since 2007, but the move was made in order to open a new research center. The new space will be named for the MFA and will be designed by Steiger Contemporary, a New York–based firm responsible for major renovations inside of the former Metropolitan Council building, which houses the museum.The new museum will seat approximately 1,200 people and will be built on a first-floor platform designed by architect John D. and Catherine Taveras, who shared the design of the museum with the MFA for twenty-five years. The museum will also boast a cinema theater, an open-concept cafe, and a public green space on the ground floor. The MFA will be relocated from its current home on Beacon Street and will occupy the first floor of an industrial building on the northeast corner of the museum.“The MFA is a long-standing member of the art", "The next Biennial should also include a presentation of works on display in the exhibition “Toward a Feminist History: Feminist Art from the Twentieth Century” and “Spanish Modernism and Feminist Painting” and will run from March 21 to March 24.While the full list of participating artists is as follows:Akonadio Arquette, Punta de Cultura Cerveza, Madrid: From the  N.B.S.C. to the ATAM-ATAM: A Retrospective of the Making of the 20th Century Agnieszka Cieślak, Budapest: From the N.B.S.C. to the Museum of Modern Art , New York: From the Museum of Modern Art, New York: From the Museum of Modern Art, New York: From the Museum of Modern Art, New York: From the Museum of Modern Art, New York: From the Museum of Modern Art, New York: From the Museum of Modern Art, New York: From the Museum of Modern Art, New York: From the Museum of Modern Art, New York: From the Museum of Modern Art, New York: From the", "The next Biennial should take place in the spring of 2022, and organizers say an exhibition of the works in the exhibition should be held in the spring of 2023. In an interview with the Art Newspaper, Lisa Silber, director of the Biennial, said: “We are very excited to be working with the artist-run studios and to continue to present contemporary art in the United Kingdom, and especially London, in a way that honors his legacy. He created a new kind of public space in which contemporary art could flourish, and his legacy lives on in the biennial.  ”\n\n\nThe Modern Art Museum St. Louis (MoMA) has appointed Stephanie Pappas as its next executive director. In the position created through a merger between the institution and the City of St. Louis, Pappas will be responsible for moving MoMA forward in a new and exciting way. In her new role, she will work closely with board president Michael Govan and director Karen DeSalvo, and spearhead MoMA’s new institutional strategy.“The move will be a game changer for the museum and for the city of St. Louis,” Pappas said in a statement. “Michael, Karen", "The next Biennial should be held in 2022.\n\n\nThe London-based cultural organization Artspace has welcomed Icelandic artist Garður Jónsson to its roster as its next artist-in-residence in Iceland. Jónsson will be based in London for two years and will begin hosting at least twenty exhibitions annually in the UK. He will also receive funding from the Icelandic government.“We are delighted with the outcome of our open call and appreciate the contribution Garður has made to making the Icelandic arts environment a model for sustainable practice,” said Aivarsson. “As we move into the second year of our artist-in-residence programme, we look forward to seeing how his travels and curating will enrich the lives of young Icelanders and to supporting his work for the next two years.”Jónsson’s first show in London will be “Theater of Operations: The Gulf Wars” at the Back Bay and the East Midlands Architecture and Design Centre. The show will highlight the work of artists working in the field of military and security architecture and will take place at a site in Wood Green, London, in 2020. The exhibition will be followed by “Ascension Now: The", "The next Biennial should include more work by emerging and established artists and should include a show by a younger, less established artist. “We are still in the process of developing the programme, which will include a number of events that will be interactive and will collaborate with local and international artists,” Lahiri said. The original vision was to create a “multifaceted exhibition which would develop an international profile and a more global perspective on the exhibition,” Lahiri continued, “and this will include the development of a program which is responsive to the local needs and needs of the city of Buenos Aires and the city as a whole.” However, the bid committee ruled out the possibility of a “multifaceted” exhibition in 2017, and the exhibition was put on hold in 2018.Bianchi is looking to the future. “We are moving forward in a way that will enable us to re-imagine the future in the twenty-first century,” Lahiri said. “I want to resolve to create a more expansive experience for visitors, as well as a programme that will enable the museum to reach new audiences.”The new institute will also be a “more interactive�", "The next Biennial should be held in 2021, following the completion of the renovations to the museum.\n\n\nThe museum here has been closed since June 12, 2017—the first day of the coronavirus pandemic—due to concerns about the virus. The institution currently has two hundred and seventy-nine photographs documenting the coronavirus outbreak; this exhibition marks the end of the exhibition “Viruses.” The closing of the exhibition follows its making available in digital form, which will go on sale on August 5. The show also revealed that the exhibition will be open to the public for thirty days only, from August 5 to August 6, 2020.The thirty-one-thousand-piece exhibition is organized around a series of two hundred photographs, each on its own, that depict the coronavirus outbreak in Sierra Leone. The exhibition will feature full-length biennial films, documentaries, and archival materials in addition to biennial photographs. The exhibition will be held in the museum’s current location, located in the former Sierra Leonean Embassy, the country’s Embassy of the United States of America at the United Nations. The exhibition will be inaugurated with “Yilevu Mpagi Sepuya,�", "The next Biennial should be open for ten days and will draw twenty-two artists from forty-five countries and forty-six regions. The event is also planning to intensify its museum-wide programming with a series of exhibitions, performances, and events in various cities across Australia.  The first show, titled “Art in Transition: Contemporary Art in the Age of the Internet,” is scheduled to open in September 2020 and will feature twenty-three works by twenty-four artists.The second show, titled “Art in Transition: A Retrospective,” will open in October 2020 and will feature twenty-three works by twenty-five artists. The exhibition will run until March 2021. The third show, titled “Art in Transition, A and the Future,” will be held in November 2020 and will feature thirty-six works by thirty-six artists. The show will run until March 2021. “This is an unprecedented and exceptionally challenging time for everyone, and it is vital that we continue to engage with our artists and institutions in the UK and around the world,” said Peter Schäfer, director of the San Francisco Museum of Modern Art. “Our artists have been especially affected by this downturn", "The next Biennial should focus on the visual arts and will include a selection of works by key artists working in the fields of architecture and design. The program will also include a discussion of the current state of contemporary art and the role of the biennial in the city’s evolving urban landscape and the biennial’s relationship with the City of San Diego.  The 2020 edition will be at the new 16,500-square-foot location in the city’s Old Town from January 18 to January 19. The biennial will feature approximately 160 exhibitions and will feature works by thirty-three artists. The 2020 edition will also host more than 1,000 concerts and will be hosted by a select group of Quebec artists.\n\n\nThe Solomon R. Guggenheim Museum and the Metropolitan Museum of Art in New York have reached agreements that will see the two institutions open a new $1.3 billion extension, dubbed the Solomon R. Guggenheim Museum and the Met, in the fall of 2022. The extension will also include the construction and renovation of the museum’s new headquarters, which will be located in the former Bauhaus factory building in Manhattan, and will be completed in 2021. The extension will also include", "The next Biennial should be held in Shanghai in the Autumn 2019, and the twenty-third in Berlin in the Fall 2020. \n\n\nThe Board of Trustees of the Museum of Contemporary Art (MoCA), Los Angeles, has appointed Angelica Gryi as its next executive director. Gryi comes to the museum from the Los Angeles County Museum of Art (LACMA), where she is the director of public relations. She succeeds Susan Corrigan, who departed in the summer of 2019 to become director of the Chicago Architecture Center, and will assume her responsibilities in January 2021.“While Angelica is an accomplished leader in her field, we believe she will bring exceptional leadership skills and an international approach to curating and presenting an inspiring collection of works for the museum to highlight the rich and diverse histories of American artists,” said board chair Alex Nyerges. Gryi will begin her position at the museum on January 20, 2020. She succeeds Susie DeMarco, who departed the institution in March 2019 to become director of the New York Academy of Art. \n\n\nThe Institute of Contemporary Art (ICA) in London announced today that it is planning to close its doors indefinitely, effective March 13. The institute has faced mounting pressure to", "The next Biennial should take place in 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed John Katzenbach as its new chief curator and director. He succeeds Marian Wright Edelman, who retired in March after twenty-five years at the institution. Katzenbach joins the MoCA in January 2019 after twenty-three years at the institution. During his nine-year tenure, he helped shape the museum’s collection strategy, oversaw the collection transition from a foundation to a nonprofit, and guided the program of exhibitions, residencies, and educational programming.“John Katzenbach is an experienced curator and scholar who has been instrumental in bringing MoCA to where it is today as curator of contemporary art,” said MoCA founder and board chair Thomas J. Tenenbaum. “His decades of curating experience, combined with his knowledge of and passion for Los Angeles, make him an ideal leader in the transition to a new museum.”Previously, Katzenbach served as chief curator at the Museum of Contemporary Art (MCA) in New York. During his tenure, he curated “The Rise and Fall of Pablo Picasso” (2012), “The Luchita Hurtado", "The next Biennial should take place in 2021. The wing will be inaugurated by a presentation of the first exhibition of new works by the artist-in-residence, the personal representative of the late British designer, Ronnie Goodfellow. The exhibition will also include an assemblage workshop and a performance, a film, and an installation by the artist-in-residence.Inaugurating the exhibition will be a selection of biennial works by the artists who have participated in the Biennial: David Hockney, H. M. Berman, and Mary Cassatt; a selection of work by the late British film critic Roger Ebert; and a selection of works by the late British playwright William Shakespeare. The performance, titled The Golden Voyage, will be staged at a venue that will be inaugurated by the artist-in-residence, the late British playwright Jimmy Stewart. The exhibition will also include a retrospective of the work of the late British designer Agnes Martin and a selection of works by twenty-three artists in the exhibition “Polarities.”The opening of the exhibition is marked by an exhibition of biennial work by fifty-eight artists. The first show will be held at the Museo del Pl", "The next Biennial should focus on the history of the art, including the evolution of museum exhibition design and the museum’s relationship with the contemporary art world, and may include innovative demonstrations of the museum’s collection and exhibition program. “This is an exciting time for the Tate, as we look forward to unveiling the new collection, exhibitions, and program, and to continuing to work with the world as a whole,” said James Curran, director and CEO of Tate Britain.  David Lewis, director of the Biennial, added: “In this very challenging moment, it is with great regret and disappointment that I speak to the decision not to proceed with the exhibition, exhibition, or program, as planned. These are difficult decisions, and there is only one successful exhibition program. The decision not to proceed with the exhibition, exhibition, or program is a real and painful blow, but I know we have a duty to our staff, our clients, and the public to carry on. I passionately hope that we will now be able to proceed with the rest of the programme.”The exhibition’s organizers said they were “deeply concerned” about the future of the show, and said that they", "The next Biennial should have been held in 2019, but because of the Covid-19 pandemic, the event was pushed back. The 2019 edition of the exhibition comprises eighteen works by forty-eight artists, including Lars-Erik Ellingsen, Viktoria Feltrinelli, and Shizuka Kihara, among others from the former Soviet Union. Though the show is still scheduled to open in the United States next month, the artists have refused to move the show to coincide with the pandemic and have instead been working on new works.According to Artnet, the upcoming show will feature approximately 800 works by a select group of twenty-six artists, including David McKnight (New York), Nanda Naidu (New Delhi), Joël & Olivier (New Delhi), and Hannah Arends (New York). The exhibition will also feature new works by artists such as Thomas Esperance (New York), Jasper Johns (New York), and Rodolphe Lavigne (New York).“We are incredibly hopeful that, once the biennial is complete, there will be a new chapter in the history of the art of the world,” said Monica De Cardas, chair", "The next Biennial should be held in 2021 and will have a selection of works from the collection that were organized and presented by the artist and will be organized in a biennial format. The exhibition will involve the development of a new way to look at art by exhibiting work in a different way.\n\n\n\n\n\nAwards:\n\n2017–18: Sofia Bruguera (Thurs., Sat., Sun.), Singapore (Thurs., Sun.), Hong Kong (Sat., Sun.), and Zurich (Thurs., Sun.).The artist was awarded the Prix de l'Art Contemporain (the European Organization of Art) Honor in 2017. The award was given to the artist for his work The Blind Visitor, 2017, which was nominated for an International Art Award.The prize presentation ceremony took place on November 3 at the Hotel Montreux in Brussels. For its inaugural edition, the organization selected seven works by the artist and their respective teams and invited participating artists to participate. The biennial will take place at more than sixty venues throughout the Netherlands from March 21 to March 25, 2020. Considered one of the landmark works of the twentieth century, the work, which was created in the artist’s hometown of Sü", "The next Biennial should be held at the Panzhina National Museum in ADZ in the Tsetse district of Beijing, in the autumn of 2021. The institution will then partner with the National Museum of China’s art and architecture to present a new exhibition on its history and contemporary art.\n\n\nThe Wikimedia Foundation in West Virginia has announced that it is launching a new grant program that will provide $500,000 in support of creative projects and scholarships through the Wikimedia’s massive Family Library. The pilot program is part of Wikimedia’s #SeeYouComes grant initiative—a series of grants that move paintings and other works of art between museums and provide mentorship and education for young curators. The grant program will establish a new fund for fellowships that will provide $1 million in support of the 2020–21 academic year. The fellowships will be awarded in installments and will begin in April 2020.About the grant program: The grant program (APG) was established in 2008 to support the collection, preservation, and research of the family album of the late Italian architect Gian Luigi Cipolletta. The program has launched several awards, including the Cinéma Biennial (2011), the Giacomo Sign", "The next Biennial should take place in the city in 2022. “Sharon Engel—the director of the Diadem Center and a curator at the Institute for Contemporary Art in New York—has created an ambitious new program that addresses the world in her own way, as a curator, curator, curator, curator, curator, and curator,” said Catherine Brett, chair of the board of trustees. “We are thrilled with the direction of the Biennial and are confident that the next edition will provide a new level of understanding and appreciation for the work of CCA. We are also grateful to the city of New York and to the Diadem Center for the opportunities and support this organization has provided to the city of New York and to the Diadem Center as a whole. The Diadem Center has been a pivotal institution in the formation of the city’s arts and cultural heritage. I’m also looking forward to working with the artists and the staff at CI. Their commitment to transforming their local community through teaching and mentoring will be a great foundation for our future programs.”The Diadem Center is also the home of the Diadem Gallery of Art, a traveling exhibition space that has exhibited work by artists such as", "The next Biennial should focus on how art can serve as a vehicle for social change and how art can move us, both physically and spiritually, as well as shape our own futures. \n\n\nFrieze announced today that it will introduce new measures in response to the coronavirus that will allow it to keep track of the number of artistic works entering its marketplace each week. The service will also analyze customer feedback to better understand how art works in the marketplace and how art works are currently being sold.The new system will first analyze the market data collected by over five thousand participating artists, galleries, and trade shows in order to understand what works are in high demand and what artists are most likely to be absent from the market. It will then use that information to develop a product that will allow the public to see how the market is performing across the United States.The revised analytics tool is called the Market Insight Report. The report will analyze customer feedback on a given day and will present a user interface that will allow the user to see how the market is performing across the US. The report will then be made publicly available on a website that will allow the public to submit their own insights into the market. The data will then be analyzed by a team of industry experts who", "The next Biennial should take place in 2022. “The theme of the third Biennial is ‘Flood of Creation.” This is an important step in bringing together the various brands of the exhibition, as the artworks, the architecture and the concept are all connected.\n\nFollowing an outcry from fellow museum directors and activists, the San Francisco Museum of Modern Art (SFMoMA), which has been working to hold a public forum on the topic of climate change\u0097a platform for artists to share their stories and have their works displayed\u0097and the California Academy of the Arts (CAFA), which withdrew from the event over the weekend, are now officially collaborating. The announcement coincides with the United Nations Climate Action Summit in Bonn and coincides with the Paris Climate Action Summit, which was slated to take place in December. The collaboration between the two institutions was first reported by the Art Newspaper. The decision to collaborate was made after CAFA director Catherine Rampell called for the fair to take place in March. The announcement follows the decision by the World Health Organization (WHO) to extend the deadline for countries to reduce greenhouse gas emissions by an additional two-thirds to try and avert the threat of a global catastrophe. CA", "The next Biennial should be held in 2022. By then, the work will have undergone a major re-creation, with most of the original abstract pieces reworked into a smaller, more intimate setting. “I’m trying to be very realistic about this process, and as a young curator who moved to New York City from Germany two years ago, I’m not naïve enough to think that the pressures that are given will go away,” artist-director Christoph Merriam told the New York Times. “The National Museum of Art is trying to do something similar. We want to recreate the museum as it was in the late nineteen-sixties, when the Biennial was founded. We want to create a new narrative around the subject.”Simon Lütke, a curator and art historian based in Berlin and a professor at the University of Kiel, wrote in the New York Times that the Biennial’s new programming — which is currently being implemented throughout the museum, including in the exhibition “The Art of Body and Society” (2019) and the collection’s new exhibition “The Crisis of the Body” (2019) — closely aligns with the institution�", "The next Biennial should be held in 2022. For the years 2020 and 2021, the Paris-based nonprofit will commission paintings by artists whose work is explicitly or implicitly on display at the event, but will not be able to show them until 2022. The exhibition of the first work by the artist Nan Goldin will take place in 2022. \n\n\nThe $5.3 million Art Institute of Chicago (Artie) has received a gift of $400,000 from the William and Flora Hewitt Foundation. The donation was made on behalf of Hewitt and the Hewitt Foundation in support of the Art Institute’s Art of the Party. The gift includes $100,000 for political advocacy and advocacy campaigns, including a new report card on the institute’s work. “We are eager to support this year’s Art of the Party and encourage the next generation of visionary leaders in the art world,” said Jim Thompson, president and CEO of the Hewitt Foundation. The Hewitt Foundation also pledged to pay a special tribute to Konrad Zuse, who died last year at age eighty-eight. The foundation was unaware of his passing until the Art Institute of Chicago bestowed its award, which honors lifetime achievement, on him", "The next Biennial should drag out its opening session until December 25, 2020 and then gradually reopen in February 2021. The 2019 edition of the event, which featured work by forty-three artists, was set to return to the Mall on February 11, 2020, but was canceled owing to the Covid-19 pandemic. The tenth edition of the Biennial will be staged at the University of Washington in February 2021. In its place, the Biennial will be organized as a series of rare public exhibitions that will be staged in a way that will allow the public to experience the full range of the institution’s collection. The exhibition will feature art from the Muse’s collection in a back-to-basics” fashion, focusing on avant-garde, experimental, and experimental art from the mid-twentieth century. The exhibition will follow a tour of the museum, which will be inaugurated by an exhibition of the artist’s work on display in the ’60s.\n\n\n\n\n\nIgwe, Nere, and Shikha. Courtesy of the artist. \n       \n\n\n\n\n\n\nThree hundred artists have signed an open letter urging the German government", "The next Biennial should take place in 2021.\n\nThe museum will hold its next edition, titled “Beyond the Frame” (2019) at the Museum of Modern Art in New York on November 10, 2020. The exhibition will also include a presentation of works by artists such as Joan Miró and Ursula von Rydholm.It will also continue to exhibit works by artists such as David Hockney, Mark di Suvero, and Robert Irwin.\n\n\nThe Los Angeles County Museum of Art (LACMA), the City of Los Angeles, and the City of San Diego in California have agreed to jointly develop a new way for arts and cultural institutions to share data and collaborate in an attempt to reduce traffic and pollution.The partnership, announced on Wednesday, May 26, follows the announcement in November that LACMA will begin sharing environmental data with the city of Los Angeles and the county. According to the Los Angeles Times, the move represents a new step in LACMA’s ongoing efforts to reduce its traffic and pollution—the new data will only be used to build on the city’s existing environmental monitoring and enforcement efforts.“The partnership is vital to reducing traffic and pollution while ensuring LACMA’s", "The next Biennial should be October 2022. The event will be hosted by the Institute for Contemporary Art (ICA) in Prague, the National Museum of Czech Art, the Museum of Modern Art, the National Museum of the History of Science, and the National Museum of Contemporary Art. The inaugural event, entitled Biennale 2000, was held at the National Museum of Modern Art, Prague, and closed to the public in September. The nineteen-hundred and fiftieth edition of the event will take place at the National Museum of Art, Prague, in April 2020.The biennial will explore the history of performance and will address various themes. It will include the experiences of contemporary artists, including Elena Moshakova, V. S. Gornik, and Rora Radloff, and will take place in two formats: a retrospective and a performance biennial. “The museum will be a destination for every visitor, an extension of the city and region, with an exciting exhibition programme, abundant gallery shows, and an accomplished curatorial team, which will be able to present a new generation of works,” said Lukashenko.The Biennale will also feature original works by artists such as Ed Ruscha, N", "The next Biennial should take place in 2020. . . . The first edition, “The Artist’s Brain,” will be held at the Museum of Modern Art in 2021. The next event will be Biennial One, which will take place in 2022. The next exhibition will be “The Power of Words.”“It’s not enough to have a collection of artworks, it’s also about having a real interest in art,” said Coppola. “This is a very special form of art, and it’s a form that people can identify with.”\n\n\nThe German city of Kassel, which has been fighting to keep the historic Neue Abbeidenhistorisches Kunst (NAH) museum open despite the coronavirus pandemic, has unveiled plans to rebuild the museum in stages, beginning with the Neue Abbeidenhistorisches Museum (NAH+Kunst) in Kassel.The city will build the cultural center, which was founded in 1929 by architect Karl Haushofer, in phases, with the first stage, “NAH+Kunst 1,” slated to open in 2030. The second", "The next Biennial should take place in 2020 and will be hosted at the Hirshhorn Museum in Washington, DC, and the Public Theater in New York City. The 2019 exhibition, “The Last of Us,” was presented by Metro Pictures and premiered at the Los Angeles County Museum of Art (LACMA); the Los Angeles County Museum of Art and the Los Angeles County Museum of Art (LACMA) respectively.The 2020 edition of the Biennial will be curated by David Kao and will be held at the Southbank Centre, London; the National Portrait Gallery, Edinburgh; and the National Galleries of Scotland.“We are thrilled to be supporting this vital work of art by working with Nottingham Art Gallery in the UK, the National Portrait Gallery in the US, and the National Gallery of Art in London,” said Matthew Booth, curator of arts and culture at the National Gallery of England. “The National Portrait Gallery is especially well placed to play a crucial role in the exhibition’s publication and exhibition as it has developed from a small contemporary art gallery into one of the most important institutions in the United Kingdom. We are also delighted that the National Portrait Gallery will be hosting the twenty-fifth edition", "The next Biennial should be held in 2020. The reopening of the exhibition will be the theme for “The Fourth World,” a program of exhibitions and seminars that will be organized in collaboration with local and international artists and institutions. The project will also encompass a number of other programs, including a workshop series, a digital exhibition, and a special musical program. The opening of the inaugural exhibition will take place on November 29.The exhibition will begin with the American painter Jay-Z, whose collage works are often used to represent moments of cultural and social change. He will present his final work, “Last Song,” at the Museum of Modern Art in New York on December 22. The exhibition will be followed by a series of performances that examine American art from the 1940s to the present. The first performance will be a performance organized by the Museum of Modern Art, New York, on January 7. The first theme for the new exhibition will be “Rousseau” (2019). The show will be on view until March 9.The second show will be “Vincent van Gogh: Never Make a Picture” (2019) and “Karel Adame: The Flood of Tears�", "The next Biennial should consider a new strategy for exhibition design drawing from contemporary progress and reflecting the current state of the art,” the exhibition’s organizers wrote on Facebook. “The theme of the biennial should be ‘the future of art and the crisis of the art produced in the current era.”The reopening of the exhibition is also seen as a signal of the international movement of artists. The upcoming exhibition “Art on Paper” will be the first time the paper-covered works will be seen in the United States since 1973.\n\n\nThe Museum of Contemporary Art (MCA) in Los Angeles is planning to close its doors for an indefinite period of time in 2022 as part of a $5.7 billion restructuring led by CEO John Lasseter that aims to improve the museum’s financial position and attract new revenue. The news comes a few weeks after the museum, which has a portfolio of more than 150,000 works, announced it would be closed until at least March 25, 2021. An open-ended closure would also likely result in a significant reduction in the museum’s annual general fund draw.“This is a difficult decision for us and a difficult one for everyone, but the", "The next Biennial should be held in December 2021. The theme of the upcoming edition will be “Life and Art.”A statement published by the Museum of Contemporary Art in New York said the new event will give the public a new perspective on the exhibition “between the art world and the physical world.” The museum also plans to create a new platform for artists and will introduce new digital initiatives that will connect with people in a way that will be “immersive, social, and collaborative.”The Art Newspaper reports that the next iteration of Art Basel will be in Hong Kong. The Hong Kong pavilion will be curated by Anne-Marie Wong, the founder of the online platform Artforum. Wong will work closely with the Hong Kong-based curator Clementine Lam to develop the theme and will be charged with organizing the event. In addition, a new exhibition, “On the Making of the Biennials” will be presented at the Hong Kong Biennials, which will go on view in January 2021. The exhibit will feature more than 150 works by twenty-six artists, including Jin Min Lee, Natalie Parker, Sophie Prejean, and Frank Ori", "The next Biennial should also include a discussion of the human rights situation in Togo and the African continent, the relevance of art and culture in contemporary life, the critical experiences and the challenges which art and culture bring to the lives of individuals living in the former colonies of France and Belgium in the Americas.”As part of the newly launched ten-year plan, the Biennials will focus on “intersection of art and culture and contemporary life,” and will invite more than three thousand artists and collectives to take part, beginning in 2022. Commenting on the new partnership, Arnautoff said: “The Biennials are a new kind of platform, a new kind of initiative, a new kind of place, and they are already informing the future of art and culture in an imaginative and thought-provoking way. It is our vision for the next two years to promote art and culture and young creatives from Africa and the Americas through an intergenerational dialogue.” \n\n\nPhotojournalist and activist Gloria Steinem, a fierce advocate for social justice who was known for championing issues such as racial justice and women’s rights, has died at age eighty-eight at her home in Los Angeles. Ste", "The next Biennial should be held in 2022. “The Museum of Modern Art and the Los Angeles County Museum of Art are among the institutions committed to expanding the visual arts in Los Angeles County,” said Mark Ruben, head of the Los Angeles County Museum of Art. “We are actively working to establish a new Los Angeles Museum of Art and hope to open the first museum on the west coast by the end of the decade. We are also planning to build a new community center, which will enhance and expand the existing Arts and Culture in Los Angeles, and will continue to invest in public arts, education, and culture in order to create a museum that will spark innovation and creativity in local communities.” The institution also stated that it plans to continue developing programs that have been in place since 2003, including the Open Book, a platform for contemporary art, and the biennial series Being and Works, which began in 1998. “This is a moment of great change for Los Angeles,” said MCA director and CEO Michael Govan. “With the completion of the museum’s reopening in 2020, we will begin to welcome visitors again, and we will understand how important it is for our", "The next Biennial should be held in 2021. \n\n\nMuseum professionals in China have won the right to create new exhibitions focused on China’s history in a landmark ruling by the National People’s Congress in Beijing. Although the move is likely to spark anger from critics who fear the government is attempting to rewrite the history of the country, the move will open up new areas of research and discussion about the country’s rich interplay of art, politics, architecture and literature.“The National People’s Congress has shown that there is a significant demand in the country for exhibitions that are able to present Chinese art in a contemporary context,” Li Kai, a professor of art history at the Xiamen Art Museum and chief curator of the exhibition “Between the Sea and the Sky: Chinese Painting from the First Eighteenth Century to 1950,” told the Art Newspaper. Li, who is also cofounder of the Beijing-based exhibition-making biennial Art in Brief, told the Art Newspaper that the new exhibition, which will be presented by the Shanghai Art Museum in March, will focus on “the innovative and the unorthodox methods of painting in China’s west and will seek to convey the importance of", "The next Biennial should take place in 2021, with the first exhibition, “From the Daughters of Mary to the Daughters of Mary Henry,” to open in 2021. The exhibition will gather work by eighty-eight artists, including Antony Gormley, Robert Morrison, Gerald King, Evelyn White, and Haus de der Kunst, to examine the legacy of the female figure. Its second edition, titled “From the Daughters of Mary to the Daughters of Mary Henry: Women Artists in the Making of Modernity” will open in 2022. The third Biennial, titled “From the Daughters of Mary to the Daughters of Mary Henry: Women’s Futurism” will open in 2021. The final edition, “From the Daughters of Mary to the Daughters of Mary Henry: Women’s Fiction” will open in 2022.\n\n\nThe Museum of Modern Art (MoMA) in New York has deleted a poem by sculptor Susan McAllister that called for the overthrow of the institution’s longtime board chair and the reinstallation of a female-only space in the museum. The statement issued by the museum reads: “McAllister", "The next Biennial should take place at the original location in 2021. Founded in 2010 by Sam Joseph, Frank Gehry, and Pierre Ouvrijk, the museum has been undergoing a $150 million overhaul, inaugurated in 2017, with the aim of making the museum more accessible to the public. The renovation of the museum, which is in a former railroad yard, is complete and the building is slated to undergo a $10 million facelift in 2020. The new design will increase the museum’s viewing gallery capacity by twenty-five percent, introduce more than four hundred new works by local and international artists, and add more than sixty new rooms to the museum. The renovations will include the construction of additional galleries for the collection, exhibitions, and public spaces; the renovation of the hotel; the construction of a new entrance on the Main Building, which will be located on the third floor; and the addition of a landscaped courtyard.\n\n\nThe Medieval Society in London is pushing back the opening of its next major exhibition by a year, saying it needs to re-examine how it will approach the exhibition. The reworking of the Leonardo da Vinci exhibition, titled The Renaissance—Avantgarde’", "The next Biennial should be held in the spring of 2020.\n\n\nThe National Geographic Society announced today that it is expanding its role as an advocate and supporter of the visual arts through the acquisition of cultural heritage and artifacts. The announcement marks the first time the museum will own or have ownership of cultural heritage and artifacts acquired from the former colonies of Great Britain and the Netherlands. Cultural Heritage Action, a new initiative that the Smithsonian created in September 2019, will work with National Geographic on spreading awareness of conservation efforts and conservation methods, and will partner with local communities to protect and advocate for cultural heritage sites through the acquisition of art and artifacts.In addition, National Geographic Education, the museum’s endowment organization, will invest more than $30 million in the acquisition of modern and contemporary art and art history. According to the institution, this investment will help ensure that National Geographic Education graduates and future generations have access to the vast collections of the museum. “Our mission at National Geographic is to share the world’s treasures with you, educating the world on the history and importance of these objects,” said Richard Armstrong, president of the Smithsonian. “National Geographic Education will give you a real-life example of how to think about, collect", "The next Biennial should take place in 2021 and the venue of the exhibition should be decided by the city of Lisbon.[Update: September 15, 10:55 a.m.: The 2019 edition of the exhibition, which was held at the Palace Museum in Lisbon, was canceled due to the Covid-19 pandemic. The 2020 edition, which was to be held at the Museu de Arte de Lisbon, was supposed to begin on September 21 but was postponed due to the Covid-19 pandemic.  The biennial will be held at the Museu de Arte de Lisbon until November 20. The 2018 edition of the show, which was curated by Paulo Ferrer, was also canceled. The 2020 edition will be curated by Simon Jones and will begin on September 14. Artists and curators include Vittorio Pincus, Mozart, Franz Kapan, Johannes Klint, and Alexandra Sheehan.The 2019 edition of the show, titled The Web of Life, was held at the Parque de Arte Moderno in Venice. The show premiered at the Venice Biennale on October 18 and featured work by twenty-six artists and was chosen for the 2019 Golden Lion by the Venice and Venice Architecture", "The next Biennial should take place at the Museum of Modern Art, New York, in 2021. \n\n\n\n\n\nA new exhibition has opened at the National Museum of Scotland in Glasgow. Called “Scotland,” the major new exhibition will examine the historical and cultural link between Scotland and Scotland. It will be led by historian and curator Paul Maffi, and will run for two years.The show will include essays by scholars from the disciplines of architecture, film, film and television, travel, and politics. The exhibition will take place in the Museum of Fine Arts, Glasgow, and will run until March 21.“The show is not only an attempt to present a full range of the subjects and the art of the Sixteenth Biennial, but also to present them in a way which is not only a record of them but also of their development as subjects of study in the museum,” Maffi said in a statement.The first part of the show will examine the relationship between Scotland and the UK, focusing on the region’s role in the European Union. It will then turn to the art world, featuring the work of twenty-six artists from twenty-nine countries, including Australia, Austria, Brazil, Canada", "The next Biennial should take place in the spring of 2021. The exhibition will be themed “Intersections of the Body and the Environment” and will aim to reflect the themes and the characters of the various collections within the art museum. The theme of the year 2020 will be “Plastic Politics” and will be “Imageless Politics”\u0097a comment on the current political situation and the politics of plasticity. In addition to the themes of the year 2020, the exhibition will include works by artists such as Maria Aparicio, Rodrigo Borges, Julio César García, María Pilar, and Jodi Throckmorton. The next edition of the Biennial will mark the centenary of the opening of the first biennial in Mexico City and will be held at the Museo de Bellas Artes, from March 21 to March 23. The next edition of the exhibition will consist of eighty works by forty-eight artists and will feature work by twenty-three artists.\n\n\nThe Journal of the Society of Architectural Historians (SAAG) has appointed Daniela Sola as its first president and CEO. Sola succeeds Jennifer Kallmann, who retired in March after four decades at", "The next Biennial should take place in 2020. In the meantime, the museum will continue to make valuable contributions to the academic and cultural life of Oman. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has come under fire for removing a controversial painting by the Italian-born, Hendrik Hertz, that would have depicted the destruction of the Twin Towers, the Pentagon, and the World Trade Center, in a demonstration of its commitment to environmental justice.In an email sent to staff on August 29, director Michael Govan and chief curator Bill Rosenberg wrote that the exhibition “remained within the museum’s remit and was not in opposition with the mission of our institution.” They added that the “clear signal” that the painting was removed was “a gesture of respect.”A statement issued by Govan and Rosenberg reads: “The painting Hendrik Hertz (1971) was removed from our exhibition ‘In Defense of the Earth.’ It was replaced by a different work by a different artist.”While the museum initially attributed the removal to a “nervous breakdown” of the artist, Hertz told the New York Times that the decision to remove his work", "The next Biennial should be a combination of new work and documentaries, which will introduce young people to the works of contemporary artists. The festival is planning to launch a new platform, Artforum, in September.  The first programme will focus on the work of American artists of African descent; the second on the work of South-American artists. Gillian Wearing, director of the Twelfth Biennial, which is currently underway, said: “Our mission at the Twelfth is to build on the work of our first year, to develop new and original works by emerging and established artists, and to develop a platform for the exchange of ideas and expertise. ‘Themes.cultures.nation-states.country-states.’ We are currently planning to highlight the works of artists such as Joshua Helmer, James Turrell, and Pia Camil. We are also planning to explore themes of memory and nostalgia, the construction of nation-states, and the historical record.”\n\n\nThe Pulitzer Prize–winning artist Russell Simmons has been selected as the recipient of the $50,000 National Medal of Arts. The honor comes with a $25,000 cash prize and is one of a number of awards given to", "The next Biennial should be held in 2021, and the fourth in 2022. The studio will also expand its gallery, which is currently home to artist installations by artist groups such as the Afrika Bembry-Buić Pavilion, the Bembry-Buić Exhibition, and the exhibition of work by Jean-Michel Basquiat in its museum. It will serve as a platform to create works that are exhibited in the museum and on view in the Gallery. The project was funded by the museum’s gift to the city of Amsterdam. \n\n\nKathrin Becker, the head curator and founder of the Dresden art fair, was given a lifetime achievement award by the German city of Dresden on Wednesday, February 16. Becker made history in 2017 when she became the first woman to helm the fair. She was succeeded by Alice A. Schäfer, who took over the role in 2018, and has since overseen the fair through its thirteen editions, which have been held in Dresden since 1993.“This year’s Dresden Art Fair is a platform for a more detailed reflection of the past fifteen years,” Becker said in a statement. “I will continue to work with artists, sculptors, architects,", "The next Biennial should be held at least once a year, and will focus on the interrelationships between art, life, and art. The 5th edition of the Biennial—delivered at the Venice Biennale in March 2019—compiled a triptych of paintings by the French Galerie Stéphane Brize and featured work by twenty-four artists. The biennial will culminate with the exhibition “Up to the Sun of the Sun” on February 23.The exhibition was inspired by a question posed by Maud Kapp, a curator and art historian, at the end of a lecture—asked by the late French artist Ursula and first presented by the Museum of Modern Art in New York in 2004—as to whether a painting can be a “living thing.” Kapp asked the artist to imagine a world where the sun came up every day, as if in a dream, and the world around him reflected his own thoughts. “I almost had a vision of the sun coming up through my paintings—I opened my paintings, I was so close to them,” Kapp said. “The sun was the perfect medium for my dream.”The show will be hosted", "The next Biennial should take place in 2020. \n\n\nEleanor Roosevelt Biennial\n\nThe Eleanor Roosevelt Biennial, which was originally proposed as a major exhibition to commemorate the centenary of the president’s birth, has been postponed for a third year due to the novel coronavirus. It will now return in 2022.The 2019 event, titled The End of an Era, was supposed to showcase the work of around seventy artists and include a virtual reality workspace and a performance by composer and artist Rene Magritte. The theme was \"The Past and Future in the Art of Eleanor Roosevelt’s Art of the Century, 1932–1948,” a statement by president Larry Wilmore.The 2020 edition will feature twenty-four artists from the likes of Wangechi Mutu, Peng Gong, Ming Wong, Nina Lux, Gabriel Rodriguez-Delgado, Angel Rinaldi, and Natalie Star.The 2019 iteration of the biennial, titled “Elaine & George,” was curated by Giovanni Brugnaro and featured forty-eight artists and seventy-two works by sixty-four others. The 2020 event will be hosted", "The next Biennial should take place in 2021. “Art is for everyone, but how?” said Joseph and Catherine. “We are thrilled that we were selected as the architect and organizers of the next Biennial, and we look forward to working with the next generation of artists. We begin by developing the idea, which we believe will appeal to the most diverse audiences, and then we create the exhibition space that will create a contemporary art experience for the biennial.\n\nThe Galleria d’Arte Moderna in Milan, which was founded by a group of Italian artists in 1973, is moving into the former Vittorio Cattelan’s home in the seventeenth century village of Prada.The organization, which is located near the town of Fratelli di Scala and the town of Genoa on the Via Roma, plans to leave the historic building in the city’s capital and head to a new location in the hills of the town. The new seven-thousand-square-meter space will be inaugurated by a solo exhibition of work by the new cohort of Italian artists, including Adrian Tomina, Alessandro Nuzzo, and Enrico Battista. “Today", "The next Biennial should take place in 2022. The 2019 edition, “The Gift of Jesus,” featured works by forty-three artists, including Mira D. O’Leary, Joan Jonas, Mark Rothko, and Paul Gauguin.\n\n\nArt historian and curator Richard Prince has been appointed the next director of the Whitechapel Gallery in London, where he will oversee the museum’s expansion. Prince will assume his post in his new role on September 5.“Richard is a leading authority on the art of the late nineteenth century, having amassed a world-class roster of contemporary artworks spanning more than thirty-five centuries,” director Maria Balshaw said in a statement. “A leading curator of twentieth-century and contemporary art, his breadth of experience and ability to engage with the art of the present make him a strong and capable leader for 2019.”Prince will assume his post at the gallery in March 2020. He succeeds David Chipperfield, who will step down in March 2021 after eighteen years at the helm of the institution.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has announced that it is expanding its cultural-impact grants program. The agency will", "The next Biennial should take place in the late spring of 2020. The theme of the 2019 edition was “Time and the Future,” and the exhibition will focus on the intersection of science, art, and technology. “The Great Synod of Science will invite all scientists to engage with everyday life,” Li said. The theme of the upcoming edition is “The Future of Art and Technology,” and the show will focus on how art and technology are being used to reshape the future of human society and how these technologies will shape our lives and future prospects.Li and Tung, who are originally from Beijing, came to the United States in 1989 to study at the University of Michigan. They received their undergraduate degrees from Michigan in 1997 and their masters at the school in 2002. Li went on to study at the University of Chicago in the same year and, from 2001 to 2011, served as a professor at the University of Chicago’s Art Institute of Technology. Li also cofounded and served as a cofounder of the California-based nonprofit organization Artadia. The pair returned to Beijing in 2011 to work on a multimedia installation for the Chinese pavilion at the 2020 Venice Biennale.\n\n\nThe Christie’", "The next Biennial should take place in the spring of 2020.The 2019 edition attracted twenty-one thousand visitors. This year’s edition, which is being organized by the same organization, is a collaboration between the two cities and will be comprised of a series of exhibitions and activities that will generate worldwide awareness of the importance of the last century’s issues.The theme of the twenty-first century is “the future of work.” The exhibition will include performances, artworks, presentations, screenings, and other events that address issues facing modernity and the impact of technology and innovation on work. The works will be created by internationally acclaimed artists and will be based on concepts that were presented in the past and will take the form of a multi-dimensional journey that will connect to the themes of the exhibition.The works will be curated by Christopher Woolf, director of the Biennial, and will be installed in the Kunsthalle Basel in Switzerland. The exhibition will first open in the Kunsthalle in Berlin on September 4 and close in the famous gallery in Eindhoven in November. As part of the exhibition’s 2020 edition, the Kunsthalle will serve as the primary venue, with the exhibition taking place in the art", "The next Biennial should be held in 2021. The 2019 edition was the largest-grossing exhibition of Italian design to date.\n\n\nThe Museum of the American West in Los Angeles (LACMA) has appointed Laura Lee as its next director. Lee comes to the institution from the Los Angeles County Museum of Art (LACMA), where she serves as interim director and chief curator. Previously, Lee was a member of the LACMA staff. During her tenure, she helped the museum raise more than $100 million for the construction of its new headquarters and oversaw the renovation of the former Summerhouse Theatre in Stratford, England.“Laura’s leadership, curatorial, and development of LACMA’s collection and exhibitions program has been a major inspiration for me as I work to build the museum’s collection and exhibitions program into the greatest institution in Los Angeles,” said Sarah Sze. “I’m excited to see how she will advance LACMA’s mission to bring artists together, develop new perspectives, and present exhibitions that challenge the conventions of museum presentation, and reimagine the ways we engage with the art world.”Lee joins the museum from the Diller Scofidio", "The next Biennial should be held at the Museum of Contemporary ArtLos Angeles, which opened in September 2019. The 2019 iteration of the event drew 10,000 visitors. The museum’s new director, Kent Jones, described the event as “a major step forward for the museum, reopening its doors for a third time.”The museum will also unveil a new board of trustees, a new director of education, and a new president.\n\n\nThe Richard and Mary Higgins Gallery in New York has received a new five-year $1 million gift from Whitney Biennial funds. It will now use the funds to establish its first endowed chair. The gift was made in recognition of the biennial’s history of supporting artists and instituting new types of fellowships. The Higgins Gallery was established by the Higgins family in 1971 to provide artistic and educational opportunities in the Bronx.In 2018, the Higgins Gallery received a grant from the Richard and Mary Higgins foundation to establish a new Higgins Fellowship through a biennial award of $500,000. The Higgins foundation also endowed Stephen Friedman, a MacArthur fellow, with a Higgins Fellowship for his work \"When Art Is Not Enough.\" Friedman has since become a central figure in the biennial’s artistic and", "The next Biennial should be held in 2020, in the city of All Africa. \n\n\nThe New York–based nonprofit the Museum of Modern Art (MoMA) has announced that it is partnering with the Queer Art Museum in Chicago to commission new works by the queer and trans-identified artists whose work will be included in the upcoming exhibition “Feminine(s).” Titled “The Transhuman: A Future to Believe In,” the exhibition will be centered around the ideas of the feminist movement and its inclusion of lesbian, gay, bisexual, transgender, and queer artists.“We’re thrilled that this exhibition will be a celebration of the voices and work of the artists whose work we’ve never had the opportunity to witness, and of the impact their representations have on our contemporary world,” said curator of the exhibition, Laura Owens. “This is a time of extraordinary change, and we hope that this exhibition will open our eyes and spark our imagination. We are also grateful that MoMA and Queer Art Museum are committed to recognizing and honoring the contributions of those artists whose work we have never had the opportunity to witness and celebrate.”The partnership’s organizers noted that the queer", "The next Biennial should take place in 2021 and will be announced later. \n\n\nThe Italian cultural ministry is planning to build a new museum in the capital, Rome, to house the works of the more than 1,000 artists who have been nominated for the 2020 laureates and will announce the next president of the institution, Gian Francesco Cicutto, on Wednesday, December 8. While the institution will be housed in a former military barracks, the museum will feature eight galleries of the same type that have previously been kept in a storage area at the National Museum of Fine Arts in Florence.The Ministry of Culture has since led Italy to its first Artistic Award, which recognizes up-and-coming artists, and has been awarded the $25,000 Giarducci Ligure Prize, which honors an arts and culture professional who is in the second year of its award. The award comes with a $50,000 prize.The ceremony in Rome will mark the 50th anniversary of the Giarducci Ligure Prize and will also include an artist reception, an artist exhibition and a performance by Giancarlo Mercator, and an epilogue by Pushkin studio Alexander Calder, which was originally published in the early 1900s.The current.1,", "The next Biennial should take place in 2021.\n\n\nThe Museum Victoria in Melbourne has announced that it is preparing to welcome visitors back to the institution as early as September 6. Victoria’s director Elizabeth Ann Macgregor said: “At a time when it is vital for cultural institutions to have a vibrant and inclusive programming slate, the current exhibition season is the most challenging.”\n\n\nThe Saatchi Gallery in New York has canceled a series of exhibitions that were set to open in December, citing the current global health crisis as the reason. Titled “Treats,” “Hamas,” and “Guns,” the events were meant to address issues of mental health and mental health workers’ concerns regarding the use of guns in the conflict in Syria. In a statement issued by the museum, organizers said that they decided to cancel the shows due to the current crisis because of concerns regarding the safety of staff and visitors.The announcement marks the latest in a string of missteps made by cultural institutions in the United States in the course of the conflict in Syria. As the conflict there escalates, more and more institutions are closing their doors and moving their programming online. The Chicago-based nonprofit group", "The next Biennial should be held in 2020. The inaugural event, entitled “Art in the Age of Resistance” in November 2019, was attended by over 130,000 people.\n\n\nPeru’s Centre for Contemporary Art (CAA) will move from its original site in Lima to a new facility in the capital of Peru, Guaranias, in an effort to create a more sustainable space for contemporary art exhibitions. The Centre for Contemporary Art (CAA) will relocate to the new building, where it will continue to operate as an educational and cultural space, and will host an annual exhibition of contemporary art from the Bárbara community.“The Centre for Contemporary Art (CAA) Lima is a living entity whose activities provide the foundation of the people’s daily lives, and whose exhibitions and programs are a source of inspiration for the entire community,” said CAA president Lili Ip. “We are delighted to welcome this project to Guaranias, and to have this new building to be the Centre on a large scale.”The Centre will dedicate one third of its space in the building to modern and contemporary art, with the remaining third devoted to historical and contemporary art. The", "The next Biennial should be held in 2020.\n\n\nThe Museum of Contemporary Art (MoCA), New York, has appointed Adam D. Weinberg as its new senior curator of modern and contemporary art. Weinberg is currently director of the Museum of Modern Art in New York. He succeeds Heidi Packer, who was promoted to director of curatorial affairs last month.“With several decades of curating experience and an eye for design, Adam brings exceptional insight and vision to our curatorial practice,” said museum director Daniel H. Weiss. After graduating from the school of the same name in 1977, Weinberg joined the Lower East Side’s Museum of Modern Art in Manhattan, where he has served as a curator since 2013. The museum has recently undergone a major expansion, adding a new section devoted to contemporary art and a few hundred square feet of exhibition space on the ground floor. The museum’s current exhibition, “Forbidden to Touch: Modern Art” opens in January.Commenting on his new role, Weinberg said: “The modern museum has undergone a remarkable transformation over the last twenty years. It is a museum of the very spirit, a museum of the very heart and a museum of the very soul", "The next Biennial should be held in June 2020.\n\n\nFrance’s Ministry of Culture has released a statement regarding the upcoming reopening of French museums following a delay due to the Covid-19 pandemic. Following the Middle East and North Africa (MENA) region, where the Covid-19 outbreak began, the ministry said that the country is currently working to reopen all eighty-three of its museums by March 29 and expects the remaining twenty-six to be able to open by the end of the week.“France’s cultural institutions are facing challenges of an unprecedented nature,” reads a statement from the ministry. “In order to ensure a stable and full co-ordination of cultural activity in the country, the ministry has deployed 25,000 personnel across its different departments. It is also working with the private and public sectors to reorganize the collection and display of cultural artifacts. The ministry also plans to strengthen the role of the CNRS in the government’s care of the cultural heritage and the preservation of the places where cultural artifacts are stored. The CNRS will soon hold a special exhibition dedicated to the design and design of the great cities of Ancient Italy.”The opening of French museums is still in", "The next Biennial should take place in 2020, presumably at a site that will be selected through an open call for proposals, and will be hosted by the Los Angeles County Museum of Art, the Los Angeles County Museum of Art Architecture, and the Filippa Brown Museum of Art in New York.The Venice Architecture Biennale is currently taking place at the Solveig Palazzo Ferrucci in Venice. The event, which will run for three weeks, has been dubbed the Venice of the Future. The theme this year is 'Temporality, Migration, and the City,” and will take place in an attempt to address the current global health crisis. “This is an unprecedented and unprecedented year,” said Cindy Duarte, director of the Los Angeles County Museum of Art. “We are all excited to work with artists, architects, and other cultural producers to see how we can create new ways to connect people, places, and the world.”\n\n\nConsultant and curator John Kanders was sentenced to three months in prison for violating the terms of a plea deal reached with the Southern District of New York on Wednesday, reports the New York Times.Kanders, who was found guilty of", "The next Biennial should be held in 2021, with the first exhibition taking place in the Design District in 2020. \n\nThe twenty-first issue of Dazed, which will be published by New Dimensions on November 21, will feature Anish Kapoor’s first solo exhibition at the gallery, which is located at 25 Jackson Street, since its opening in January 2019. It will be followed by a retrospective of work by Narendra Mani in the exhibition “New Perspectives on Art and Design” in the December issue of Artforum.Following the first show of works by newly commissioned artists Alex Miro and Kirsten Johnson, the gallery will present a series of exhibitions in the spring of 2020. Curated by Rajkumar Swamy, director of the New York–based nonprofit Collective Memory, the thirty-fifth edition of the DT Show will be held at the DT Place in New York in the spring of 2021. \n\n\nRepresentatives of the Children’s Museum Pittsburgh (CMP) and the Pittsburgh Art Museum (PMA) are in negotiations over a deal that would see the two institutions become the new partners in the $300 million landmark Art Deco Grand Salon. The tentative deal", "The next Biennial should be held in 2020, Art and Architecture, for a new generation of audiences. I look forward to working with the International Community to shape and develop contemporary art through the efforts of a team of curators, architects, and researchers.” \n\n\nThe Museum of Modern Art (MoMA) and the French architect Tadao Ando have announced that they are collaborating on a museum dedicated to the history of postwar architecture, with a view to memorializing the architects who shaped the city of New York. The museum will be located in the former factory district of Chelsea, and will draw inspiration from the Museum of Modern Art (MoMA) in Boston and the Whitney Museum of American Art in New York.A design book by artist Frank Gehry and his son, Pierre, titled The Making of Modern Architecture, spoke of the postwar era, and a conceptual art-historical study by architect Beholden, titled The Architecture of Happiness, is slated to open at the museum in 2021. The works will be presented by artists who are best known for challenging the notion of architecture as such and exploring the relationship between the body and the environment, including Pierre Gehry, Cézanne, Rembrandt, and ", "The next Biennial should be held at the Centre d’Art Moderne in Paris, and it will be hosted by the University of the Arts Paris (UAP). The event will culminate with the display of a selection of the works from the exhibition “Away from the Hearth: Selected Essays from the Biennial of the Arts” by Mina Corrigan, Hannah Dorsen, Tania de Abreuz, Marc-Antoine Huyghe, Andre Flösche, and Claude Marais.\n\n\nThe San Francisco Museum of Modern Art (SFMoMA) has appointed Eli Lilly as its next executive director. Lilly will be responsible for managing a team of around twenty people, including Miranda March and Bruce Nauman, and will be paid $130,000. He succeeds Mary Anne Atkins, who departed the institution in March 2019 to head the Seattle Art Museum, and will assume his responsibilities in October.“The board and I are thrilled to welcome Eli and Bruce to SFMoMA,” said board chair Michael Kohn. “They come to SFMoMA from the same company that brought you the original prize, the Eli Lilly Prize, and have", "The next Biennial should take place in 2021, according to a statement issued by the institution. “We are looking forward to future cooperation with the National Museum of Women in the Arts (NMA) and the National Galleries of Canada, and to continuing to work in collaboration with the museum’s Board of Directors and staff, as we strive to present a history of the Pacific Northwest in a way that best reflects the richness, diversity, and harmony of our region,” said Malcolm Boyer, the board president. “We are also delighted to present the first annual Pacific Northwest Art Biennial, which will take place at the NMA and will showcase the work of twenty-six Pacific Northwest artists. We are grateful to the National Gallery of Canada and the Pacific Northwest for inspiring us with their exhibitions, and to the many Pacific Northwest artists who have made such valuable contributions to our collection over the years.”The biennial will include the first exhibition dedicated to the Pacific Northwest artist Anna Atkins, who was selected for her work The Area, in 1970; Mary Jo McHugh, whose work was included in the 1972 exhibition “Pacific Northwest Art,” and will run through September 4, 2022.\n\n\n", "The next Biennial should focus on the history of the art-world and the exhibition of works by leading artists in the biennial. It should also present the work of contemporary artists, usually artists whose practices are not generally recognized. \n\n\nThe Hartford Museum of Art (HMA) in Connecticut announced that it has received a gift of eighteen works by Juan Carlos Pérez-Villar, a Cuban American artist who was one of the most important members of the Cuban artist-diaspora. The gift includes works by artists such as Antony Gormley, Elías Salas, and Josef Alberts, as well as a selection of contemporary works by Cuban-born artists such as Agustín Barranes, Rodolfo Betancourt, and Leila Salas.Pérez-Villar, known for his paintings depicting a Latin American family, was born in the Cuban city of Cienfuegos in the United States in 1936. After graduating from the University of Miami in 1963, Pérez-Villar returned to Miami to study at the Art Institute of Chicago. In 1964, he moved with his wife to the Cuban city of Santa Clara, where they eventually settled after they began a family. In", "The next Biennial should be focused on the art of the sea. With an end to the climate emergency, and with the aid of the ocean, we might begin to change our planet for the better. \n\nThe nineteenth edition of the Biennale di Odio was held in the Italian city of Venice from March 13 to March 16 and ran for just over three weeks. The event—which was organized by the Venice-based, New York–based nonprofit, the Venice Architecture Biennale Foundation (SABF), and the Italian city of Venice—takes place every seven years and aims to show new works by twenty-one artists, including Antonello Cattelan, Lisa Lanata, and Henrique Medeiros—the last of which is currently on display in Art Basel in Japan. The exhibition is curated by Paolo Baratta, director of the Mariner Squier–designed site in Venice. Baratta will be producing a special edition of the show that will be presented by the central history museum in Venice, the Museo d’Arte Contemporanea, in the autumn of 2020.“In the twenty-first century, the future of the sea is at stake,” said Barbieri", "The next Biennial should be held in 2020. \n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles has appointed Sophie Lester as its next executive director. Lester comes to the institution from the California Museum of Art, where she has served as interim director since December 2017. She succeeds Carolyn Brown, who announced on April 28 that she will resign after eighteen months at the helm of the museum following a restructuring that will involve the division of the museum into two divisions, the Contemporary Art Museum and Pacific Palazzo, and the Pacific Palazzo.“We are deeply honored to be working with Sophie, and have been following her leadership for some time,” said Brown. “Her deep experience in the modern art world and demonstrated commitment to the museum’s mission makes her a strong fit for the role of director.”Prior to joining the museum in March 2020, Lester served as a curator at the Museum of Contemporary Art (MoCA), San Diego, where she focused on selling works by contemporary artists and was responsible for the exhibition “Beyond Sculpture” (2015–16) and “Sharon Ritchie: Modernist Icon” (2019–20).\n\n\nThe Sculpture Center at Duke University", "The next Biennial should be held in 2021. The next ArtCentre may be staged in London, in 2020. The next edition of Art Basel Hong Kong will be held in 2021. The next edition of Art Dubai will be held in 2022. The next edition of Art Shanghai will be held in 2024. The next edition of Art India will be held in 2021. The next edition of Art Beijing will be held in 2019. The next Art Dubai will be staged in 2022.\n\n\nThe political leader of the United Arab Emirates, Hamdan Saadi, announced that all political and administrative offices are to be abolished in an attempt to reduce the country’s soaring unemployment rate. Saadi, who was appointed on March 1, 2018, has called for the dissolution of the National Coalition for Democracy and Justice (NCDJ), which has governed the UAE since 2015, and replaced it with a new coalition government.“There are only a handful of issues in life that unite and unite us and nobody cares about them,” Saadi said in an interview with Artforum. “I call for dissolution of the NCDJ and the next elections will be a clear statement of our rejection of the UAE government and", "The next Biennial should be held in the city and will be held in 2020.\n\n\nBiennial for Māori Art and Architecture, New Zealand, 2019. Courtesy of the artist and the Hamilton Museum of Art. \n      \n\n\nThe National Gallery of Canada will close to the public in March 2019 following a two-year renovation project, following a $140 million expansion of the institution in 2016. The renovation included the addition of an exhibition space, new collections, and new programs. The closure marks a significant milestone for the National Gallery of Canada, which has been closed since March 12, 2019, due to Covid-19. The National Gallery of Art in Washington, DC, is currently closed until October 3, 2019.The National Gallery of Canada has announced the artists whose works will be featured in the 2019 exhibition “The Future Is Present: Art in Motion” and the Museum’s next edition, which will open in March 2020. The gallery has yet to announce the next exhibition for the museum. Each exhibition will be themed around a specific symbol—for example, “movement” will be “The Future Is Present: Art in Motion” and “illusion” will be �", "The next Biennial should be held in May 2020 at the Montparnasse in Paris. “The new status of the museum is a milestone for me, having been appointed director of the Belgian Museum of Contemporary Art (BMA),” Schubert told the Art Newspaper. “The new museum is very important for the development of my artist practice, for the deepening of my knowledge of European, American, and Japanese art, and for the development of my own aesthetic goals. I am particularly proud to have been chosen to lead the Biennial in Paris in the past three decades, and to have been chosen by the BMA in such a way.”Full list of participating artists: Hermitage, New York; Gallery Bières, Paris; Jorge López, Madrid; BMA, Brussels; Cinéma, Lyon; Haus am Walde, Berlin; MAXXI, Milan; Art Gallery of California, Los Angeles; Art Paris, Paris; Juergen Teller, Berlin; Kunsthalle Basel, Berlin; Anselm Kiefer, Cologne; Aachen Art Museum, Switzerland; Contemporary Art Museum Stuttgart; Karolinska Gallery, Stockholm; The Museum of Fine Arts", "The next Biennial should take place in 2021, and the forty-eighth Biennial will take place in 2022. The final Exhibition will be held at the Brooklyn Museum in 2021.\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Rachael Baca as its next associate curator. Baca, who has worked for the museum for more than twenty years and is the director of its Bicentennial Series, will begin her new position in January 2021.“We are thrilled to welcome Rachael to our team and to the MFA,” said director Christopher Jordan. “Her passion and passion for art has been inspiring, and we look forward to furthering her understanding of the import of art in America through her passion, creativity, and energy.”Baca has previously worked at the museum as a curatorial assistant in the MFA’s Department of Prints and Drawings, and as a curatorial assistant at the Brooklyn Museum for nearly six years from 2006 to 2008. She also worked at the Peabody Essex Museum in Salem, Massachusetts, as a curatorial assistant for thirteen years, and as a full-time assistant curator at the Metropolitan Museum of Art in New York.Commenting on her", "The next Biennial should take place in 2020. The next iteration of the Berlin Biennale, which is being hosted by the city of Berlin since 1966, will take place in 2022. Last year, Berlin Mayor Klaus Wowereit announced that the next iteration of the event would be held in 2021.\n\n\nThe New York Public Library in New York, which added more than nine thousand books last year and reported a surplus of more than twenty thousand more this year, is working to attract more visitors from the digital realm with a series of exhibitions and free public programs that will launch in the coming months.The inaugural exhibition, “American Gods,” will showcase works by forty-four artists, including Ai Weiwei, Philip Larkin, Laura Owens, Maria Baratta, and John Vincent Price, and will run through March 31.The second show, “Digital Life and the Digital Body” will focus on the role of digital technologies in the body in 2020 and March 2021, and will run through March 29. The third show, “The Future of Photography: Digital and Photorealism” will present work by forty-nine artists and will run through March 29. The fourth and final show, “Watercolor and its Futures", "The next Biennial should be held in 2020, and the first in 2021. The other two Biennials, the first at the Tel Aviv Museum of Art in 2018 and the second at the Museum of Modern Art in New York in 2019, were canceled over the conflict in Ukraine. In a statement, the city of Jerusalem said that the construction of the new monument would be completed by December 2021. It will be located in the Old City of Jerusalem and will be made of red granite.Inaugurating the memorial are photographs by artists such as Robert Irwin, Ellsworth Kelly, and T.S. Eliot, who are buried in the city in a  separate, but connected, memorial. The first photographs were made in 1958, the year of Israel’s founding. An additional twenty-six works of art will also be added to the museum’s collection, which includes works by both ancient and modern artists. According to a release, the exhibition will also introduce new works by Łukasz Klimczyk, Haim Steinberg, and Wolfgang Anton Merz, as well as works by Oliver Goldsmith, Anton Kern, and Konrad Adenauer.\n\n\nPresident Donald Trump signed an executive order on Monday that temporarily", "The next Biennial should take place in six years. For the past two decades, the museum has been renovating the former St. Louis Cathedral, which opened in 1921. The museum also recently completed the restoration of the former Horticultural Office of the Missouri Department of Agriculture. In 2018, the museum reopened to the public, and in 2020, it was awarded a $25 million grant from the St. Louis Foundation for the Arts. The foundation will determine how much funding to award next year, and the grant will fund the construction of the Biennial. The $50 million donation was made by former St. Louis mayor Jack Youngerman and recently departed Museum of Contemporary Art CEO Maria Balshaw. The Biennial is a partnership between the Museum of Contemporary Art (MCA), and the city of St. Louis. Each year, the institutions partner with local retailers to present micro- and macro-level exhibitions in a city-owned building in a historic Saint Louis public space. The partnership also extends to the creation of a new permanent collection collection, which will join the existing collection and will expand the museum’s collection by eleven new exhibitions during the biennial.“We’re thrilled to be collaborating", "The next Biennial should be held in January 2021. More information about the event will be made available at the venue.\n\n\nThe Uffizi Museum in Florence has been told to remove thirteen works by two dozen artists from its collection by March 21. The institution has temporarily shuttered its seven-story, 225-piece museum in order to conserve the building, which hosts full-scale exhibitions of work by artists such as Giacomo Balla, Donatella Versace, and Andrea Gherardini, but has left behind forty-two works by forty-four artists.The works, which were purchased by the institution from a private collector in 2010, including an early work by Andre Perrotin, a collaboration with Giacomo Balla, a piece for Perrotin, a commission for Giacomo Balla, a portrait by Guede Perenne, and a work by Barbara Glimcher, were on display in “Empress of the Sun,” a series that opened at the Uffizi in 1986 and ran through 1997. Its sister exhibition “Nessunto,” organized by Italian contemporary artist Marcella Lippi, was also temporarily closed.The decision to temporarily close", "The next Biennial should be announced later this year. On the same day that the exhibition opened, the French Cultural Centre, the Louvre, the Palais de Tokyo, and the Centre Pompidou in Paris, among other venues, announced plans to close down for a period of six weeks. The Parisian Botanical Gardens (Pangaea) also announced that it would be closed from January 26 to March 9, 2019. France’s Minister of Culture, Emmanuel Macron, declared that the closure would be “to protect the health and well-being of the visitors and to prevent the spread of Covid-19.” The French government set a six-month deadline for businesses to close their doors on January 29, but companies have until now been exempt from the regulation, and many are reopening their doors and re-examining their contingency plans. Macron has also suspended the basic income, which was one of the main points of contention between the French and UK governments over the last few months. According to The Guardian, the government will now be able to take away the cash of those working in \"exceptional\" jobs and redistribute it among education, health, and", "The next Biennial should be released in 2021. \n\n\nThe Museum of Modern Art (MoMA) has released the list of fifty artists who will participate in the twenty-fifth edition of the Venice Biennale, which will take place at the former site of the Vatican in the summer of 2021. Titled “The Architecture of Light,” the exhibition will be curated by designer and architect Grant Kirkpatrick and will draw from a variety of disciplines including architecture and installation, film, music, and sculpture, and will take place at the Venetian old port in Venice, Venezia Venice, from July 16 to July 19, 2020.“The Venice,” said Kirkpatrick, “is an ephemeral place. When we think about what it means to be a museum, it has an immediacy and a beauty that we can’t put into words, and that we’re not bound by the constraints of geography, that’s the kind of strangeness that we’re after.”Kirkpatrick’s work is being represented by the artist’s group, the Partnership for Contemporary Art (PACE), and the Los Angeles–based artist-run space Î", "The next Biennial should be in October 2020. The next Art Basel show should take place in February 2021. The next New York City Museum of Art show should be held in March 2022. And the next Berlin Biennale will be held in March 2021. The Berlin Artmuseum will open in March 2022. \"I have been working on this project for over a year and I believe strongly in the possibility of the biennial to become a real living artifact, with the future of the collection and exhibitions in mind, while promoting the collection and exhibitions both as a whole and within the city of Berlin, a city that is growing highly and rapidly. We need to think of the future now and not later, in this instance, but further into the future, and of the library, which belongs to no one but to the city itself. The architects and the curators are a team of seven, composed of architect Katerina Kosteniuk, architect Olga Tezuz, architect Valentina Ullrich, and a curator of modern art, Bart Dietz; and they will be responsible for organizing the exhibition “HELMUT & HANSEN. 1946–1975” (H&H, 2019)", "The next Biennial should be held a little more than a year from now. It must also reckon with the anxieties raised by the continued contingency of terrorist attacks on cultural sites in the United States and Europe. I call for a new biennial—one that can respond to the current challenges and not just a few more recent ones.”The invitation, which was issued by MFA Boston, directed the biennial’s artistic director, Kate Biver, to think about how the event could engage with the themes of the year. \"A new biennial must be a renewed and revitalized biennial, forging new connections between the art of the past and the art of the present,” Biver wrote in the invitation. “We must think creatively and collectively about how the art of our time is reflected in the art of the future.”The deadline for entries in the upcoming opening is September 5.\n\n\nThe National Gallery of Scotland announced today that the institution will move the exhibition “Beyond the Gates: Art and the Modern World” to London’s Barbican Centre from June 3 to June 5, 2020. The event, which is slated to run for four weeks, will be staged in conjunction with the unveiling of", "The next Biennial should take place in the spring of 2020, at a date yet to be determined. The highlights of this year’s show include Rebecca DeAngelo’s concept piece The Body Taps, a three-dimensional installation that assembles various metals and materials to produce a tapestry portraying human interactions with art; a work by artist David Hockney, whose photographs often feature disembodied voices, and The Dance, an installation that unfolds as a dance performance, with a soundtrack by the musician Merce Cunningham.The next edition, which will be staged at a venue that will be chosen by the public, will be organized in such a way that the first Biennial will take place in the autumn of 2020 and the last in the spring of 2021. The exhibition will be held at the Kassel Town Hall, the Kassel Museum of Art, and the Kassel Kunsthalle.\n\n\nThe Los Angeles County Museum of Art (LACMA) has updated its long-term sustainability plan, which outlines how it intends to adapt to the needs of the Los Angeles City government and the region’s growing economy, and has approved a $500,000 grant from the City of Los Angeles. The $1", "The next Biennial should be held at New York University in late February 2019. The exhibition will be on the theme “the spirit,” and will include work by seventy-three artists. The exhibition is a continuation of the Biennial’s recent exhibitions, “Tnhn…” (July), “Avant-Garde Painting” (September), and “The Museum of Art’s Art of the Party” (September), among others.\n\n\nIn a decisive rebuke of the city of San Francisco, the California Public Utilities Commission (CPUC) has voted 3–2 to end a contract with the city’s Department of Public Works, which provides water, sewer, and energy services to roughly twenty-four cities and thirty-five counties in the Bay Area. The decision means that water and sewer service will be terminated in Berkeley, the Castro, San Francisco, and the North Hills of San Francisco; Emeryville, San Francisco, and the North Hills of San Francisco; Emeryville, the North Hills, and the South Bay; and Berkeley, the Contra Costa, San Francisco, and the San Joaquin Valley.The PCWC, which runs the city’s water, sewer", "The next Biennial should be held in 2020, but the current biennial, “The Essence of a Circle,” was only the first in a series of exhibitions, workshops, and presentations that would culminate with “The Fundamentals of Cinematography,” which launched at the Biennale in 1976. In 1976, the show was born, and in 1978, “The Fundamentals of Film” was born, and in 1982, “The Fundamentals of Television” was born.The new exhibition is curated by Ondine Abou El-Khalili, director of the Beirut Film Festival; Anwar Al-Shara, director of the Beirut Art Center and the American Film Institute in Beirut; and Wassalla al-Arabi, the director and CEO of the National Arts and Culture Foundation in Baghdad. The exhibition is supported with a total of $21 million from the United Kingdom, the United States, and Kuwait, and is curated by Hisham Alayman, the director of the Bekka Biennale, and Hassan Nasrallah, the director of the National Art Museum in Baghdad, and is scheduled to run from March 12 to March 15, 2020", "The next Biennial should be held in 2022, the same year that the first edition of the exhibition will take place.  “The Biennial is a journey,” said Ewa Jarosz, the director of the Biennial. “It is a journey of a network of artists who are based and have lived in the same place for more than twenty years\u0097that is to say, of artists whose works are currently on display. I want to take this opportunity to thank the artists who participated in the exhibition as well as the organizers for their great work in making the programme possible.”In addition to the international and national art fairs, the Biennial also hosts exhibitions and residencies in the form of collaborative projects between artists and local organizers. The inaugural exhibition “The Secret History of Science” (2019) was organized as a collaboration between the artists and scientists Teodoro Medvedyński, Andrea Cuno, and María Corina Gomes, and was co-organized by Radu Zlobin, the director of the Academy of Fine Arts in Venice, and Pilar Astudino, the head of the Museum of Modern Art in Rome.\n\n\nSinger-songwriter, activist,", "The next Biennial should be held in 2020. The organizers said that when it reopens it will include the first large-scale public exhibition in the country of Kenya, and will collaborate with the city of Makassar in order to facilitate social disaffection.The institution also said that it intends to create more opportunities for artists to collaborate with local communities, collaborate with schools and universities, and to provide grants for cultural programming.The Biennial of Arts and Culture will be hosted by the Museum of Modern Art and the Museum of Modern Art (MoMA) in New York. The Makassar Biennial will be organized by the Museum of Modern Art and the Museum of Modern Art in Tokyo.\n\n\nThe Los Angeles County Museum of Art (LACMA) has received a $10 million donation from art collector and philanthropist Brad Streb. The gift was announced today in honor of the institution’s 150th anniversary. The donation comes in addition to a $5 million contribution made by Streb in 2016.“Brad Streb has been instrumental in LACMA’s continued growth and development during his nearly four decades of involvement,” said Mark Rubin, LACMA’s executive director and cochair. “His", "The next Biennial should be held in Spring 2019. The race will consist of three stages: Stage 1, which will take place in Riga, and Stage 2, which will take place in Helsinki. Stage 3 will be held in August, with the first part currently on view at the Museum of Modern Art in New York. The exhibition, titled After the Fall, will feature new works by thirty-two artists, including Isamu Noguchi, Tadao Ando, and Tunga, among others that were on display at the 2017 show in New York. The exhibition, which was organized by the museum in partnership with the Rotterdam-based artist Elissa Brätschneider, was organized by David Kordansky, who also curated the An exhibition of work by Tunga and other artists will open at the Biennial in January 2020. The biennial will also have a new collection of eighty works\u0097the first show dedicated to Noguchi\u0097and will organize classes, workshops, and other programming, as well as a new edition of Biennial Film. The biennial’s total budget is estimated at $75 million.\n\n\nThe Carnegie Museum of Art", "The next Biennial should be held in the fall of 2022 and “will take into account the current public mood and the current State of the art,” said the museum’s director, Maria Bocherez. The announcement follows the announcement of a retrospective of the artist’s work in the fall of 2019. The institution is currently working on a new twenty-year plan, which will also incorporate the Biennale’s theme, “The Churches of the City,” and will present the first edition of the show in the spring of 2020. The redesigned exhibition halls, which will be nestled in the city, will welcome twenty-one artists, including Adam D. Weinberg, Ewa Michalek, and Sinthujan G. Sivapat, among others from the Caucasus, and will feature work by Alfred Kruger, Leon Kornbluh, and Guadalcanal artist Willem de Kooning.The redesigned Biennial will be built in partnership with the newly opened Cultural Village in the capital, Barcelona, and is on track to be completed by the spring of 2021. The new exhibition halls will measure sixty by ninety feet, and", "The next Biennial should be held in 2021.\n\n\nA plan to turn the River Thames into a park has been devised that would involve the construction of a new bridge and the reopening in 2021 of part of the original Thames Embankment. The reopening would coincide with the UK’s European Union withdrawal date of March 29, 2021.The reorganization plan was drawn up in conjunction with the UK’s request for $14.7 billion for the 2019–20 financial year, a cut from the £16.7 billion requested for 2020. It would also see some of the riverfront land converted into artist’s studios and other spaces that could be restored to their original state with further restoration work set to begin in the spring of 2021.“This is a moment of great change for the UK and we are working hard to make the most of it,” said Culture Secretary Justine Greening. “This is a project for all of us and I am proud that I have been able to work with the British Institute and Peter to develop and deliver such a wonderful project for Londoners.”\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines for the display of artworks by twenty"]