["The next Biennial should take place in the spring of 2021, and the first exhibition will open to the public in the fall of 2021. Inaugurating the new exhibition hall will be a series of performances by the Mariachi band.The show will feature work by twenty-four artists whose work is currently under the exhibition's patronage: Eiji Aoshima, Peggy Chan, Elana C. Trachtenberg, Alex D. Brown, Robert B. Johnson, Elin Østbye, and Alice B. J. The biennial will run for twelve weeks, from March 4 to March 6, 2020.\n\n\nThe Museum of Fine Arts, Houston (MFA) announced today that it is now represented by Louis Vuitton, the luxury brand formerly known as Burberry. The partnership was announced in November 2020 and uses the corporate brand name LVMH to market to the museum’s more than 4,500 galleries.“We are thrilled to be able to introduce LVMH to MFA and to have the opportunity to serve as a regular presence at the institution in the spring of 2021,” Mayor Marie Suttner, chair of the MFA board of trustees, said. “The partnership with Louis", "The next Biennial should be announced shortly.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines for the display of art at the Javits Center, which houses the Metropolitan Museum of Art, the Metropolitan Museum of Art, and the Museum of Modern Art, as well as the Metropolitan Museum of Art, which opened in 1958.The guidelines, which were developed by the DCLA in collaboration with the New York–based firm W.A.G.I.R., aim to ensure the safety and soundness of the venues for the exhibition “Art in Transit,” a series of works that will travel between New York, the Hudson Valley, and the Catskills through different modes of transportation, including bus, train, and subway.“The exhibition will be located in a public location in the center’s complex, which is being renovated, and will explore contemporary issues such as climate change, urban life, and urban planning. The works will come equipped with interactive elements such as benches and sculptures and will be organized in collaboration with and in support of the museum’s unique mission.”The guidelines also outline how the city will address unsafe working conditions at the Javits Center, which has been undergoing a", "The next Biennial should focus in particular on the United States, Mexico, and Central America, and should include an oral history of the Mexican revolutionary José Marti. The program is also planning to establish a fund for the preservation and exhibition of works by artists who are no longer with us. The announcement follows a year of work by the exhibition to promote the work of young contemporary artists in the United States.The inaugural exhibition was held at the Los Angeles County Museum of Art (LACMA), a project of the LACMA Foundation, and curated by artist José Andrés. The second installment, which was staged at the San Fernando Valley Museum of Art in Los Angeles, was presented by California native Rachael Pape. The third and final exhibition, which was organized at the University of Pennsylvania, was curated by Camden Mayott.The 2019 edition of the show, “United States Artists: 20th Century Bicentennial,” will run from January 11 to February 14 at the Los Angeles County Museum of Art.\n\n\nThe Los Angeles County Museum of Art (LACMA) has appointed Daniela Rodriguez-Aranda as its next director. She succeeds Jodi Throckmorton, who was hired as interim director in January 2019", "The next Biennial should take place in 2020 as the first phase of the third phase of the new construction. The Exhibition is a necessary, sustainable and visionary step towards achieving a more diverse, equitable and inclusive future. The first phase is a continuation of the work of the previous three Biennials, with the same or slightly different themes. The second phase is a celebration of the past. The third phase is an open-ended exploration of the possibility of art and identity as a new world, a future that is not limited by the past or the present, but rather imagines the future as a place where the future is what we make of it. “I am delighted to announce that the next Biennial will take place in 2020, and will be hosting a global event the week of the Fifth,” said Markus Bockel. “Through the theme Biennials, I want to re-imagine the exhibition as a platform for democratic experimentation and critical reflection on the past and the present. I am especially proud to collaborate with my fellow artists from Belgium, Germany, Italy, France, Turkey, and the United Kingdom, in their efforts to expand the scope of the exhibition. I am particularly excited by the cooperation between", "The next Biennial should include a survey of the work of the biennial’s artists. The next Art Basel Hong Kong should be a triennial of the artist’s works. Last year’s edition, titled “Kamala,” brought together more than 160 artists, many of whom were based in India, and was held at a former military base in the city of Kamala.\n\n\nThe Museum of Fine Arts (MFA) in Boston, Massachusetts, has received a gift of fifty-six works by the late artist Paul Gauguin, including fourteen works by Bridget Riley, and fourteen works by the Dreyfuss Brothers, including Rosalind Dreyfuss’s “Voltaire” and “Avant-Garde Modernism” (both 2015), and the MFA is currently working on reopening the exhibition. A retrospective of the works, entitled Paul Gauguin: The Art and the Artifice (2017), will open at the museum in October.In addition, the museum has received a gift of twenty-five works by the late French art collector Jean-Luc Eichhardt, including “L", "The next Biennial should focus on the history of the study of art in an integrated way, including the legacy of the exhibition and the collection, the exhibition and the exhibition, and the exhibition, and should also consider the historical context of the collection and show exhibitions that reflect the richness of the collection.”The further development of the biennial is dependent on support from the public, the private and the institutional sectors and on the Government’s commitment to supporting this initiative and supporting the creation of new opportunities for young talent. In 2019, the Government announced its intention to support the biennial by providing $300 million for the biennial, a pledge it reiterated in 2020.\n\n\nFollowing an outcry from artists and other cultural figures in China and the United States, the United Kingdom and France, and London’s Tate Britain over the museum’s proposed sale of works by Chinese artists and other contemporary art works by their artists, the Tate has issued a statement reaffirming its support for the rights of artists in China and the United States.In an attempt to address the mounting tension over cultural exchanges between the countries, the Tate said that it intends to continue its engagement with China’s domestic cultural and cultural sector, and that it is “committed", "The next Biennial should be held in 2020. \n\n\n\n\n\n\nJacqueline Le Sommer, chairman and CEO of the German company Wunderwaffe AG, has been named director of the Zurich-based art museum Monastir. Le Sommer was chosen by a five-person team led by the Süddeutsche Zeitung (SZK), which comprises Chief Executive Martin Sonnebrink, Imke Adler, and Kathrin Hüttenliemann, from a pool of fifty-three candidates. She will take up the post in January 2020.Born in Hamburg in 1957, Le Sommer earned her master’s degree in public policy from Södertörg University and has a master’s degree in art history from the KW Institute for Contemporary Art. She has been a Wunderkammer employee for thirty-two years and has served on the board of trustees since 1984.Commenting on her appointment, Le Sommer said: “I am truly honored to be asked to lead the Monastir. The institution is facing a critical moment, as the world undergoes a new phase of transformation, and I am committed to engaging with the theme of this year’s", "The next Biennial should be in 2021 and the date will be announced at a later date. The official opening of the exhibition will take place on September 15, 2021.  The lecture series of the exhibition will continue with two lectures a week, which will be followed by a series of three talks, in two evenings, which will be followed by a biennial. The biennial will be held at the Biennial Museum in New Delhi from January 20 to February 13, 2022.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has received a gift from the late billionaire industrialist J. Paul Getty. The institution has named Willem de Kooning its new deputy director for collection and exhibition management. Kooning came to Getty from the Getty Images in New York, where he was a major supporter of the museum, in 1991. He is survived by his daughter and son-in-law, Olivier and Dorothea Freund; his sons, Willem and Ivan de Kooning; and his grandchildren.Los Angeles’s rich cultural legacy can trace its roots to the 1940s and 1950s, when a group of artists, including Marcelo Barbieri, Robert Irwin, and Michael Powell,", "The next Biennial should focus on the history of the exhibition, with a particular focus on the institution’s relationship with the twenty-first-century art, and will take place in the institution’s former space at the intersection of West Eighth Street and Twenty-Third Street in Long Island City. The exhibition, titled “Art in the Age of Black Death,” will present essays and other works by artists including Charles Hodge, Andre Hégène, and Lawrence Abu Hamdan, as well as an exhibition of work by the Rwandan artist Julián Aluko, who was one of the first to make work in the African diaspora.In an attempt to address the institutional neglect of the African diaspora, the Biennial will partner with local, state, and federal governments to create a new trust that will provide funding for scholarships and grant programs to the African diaspora. The trust will also work with the biennial’s existing campus, the Museum of Modern Art, on a new literary project that will explore African literary traditions and will host a performance by the Rwandan actor Juleka Mabat.The new partnership also includes an open call for proposals to the upcoming exhibition. The deadline to", "The next Biennial should be hosted by the city of Los Angeles, according to the Los Angeles Times, in 2020. The city currently hosts a biennial every four years, with the first edition, entitled “Microscope, Camera, or Camera Man.” The second edition, titled “アイデュアル,” will take place in the Japanese city of Nagoya in 2020, and the third, titled “誓明語,” will take place in Tokyo in 2021.The Art of Living, the organization behind the series, said that it is “working hard to bring the next edition of the London-based annual fundraiser to you. We are hopeful that by hosting you, we can create a synergistic and meaningful environment for the art of living.”\n\n\nHirshhorn Museum and Sculpture Garden director J. K. Wilcox has announced that the institution will no longer allow the performance of “Odd-Eyes” at the museum in the immediate future. The show, which was commissioned by the late British sculptor David Adjay, was meant to engage with the themes of contemporary life and the human condition in a way that was deeply moving to many", "The next Biennial should be held within the next three years. “We want Biennials to be a reality,” department head Pierluigi Battista told the Art Newspaper. “It is not just a question of how to organize, but how to present the exhibition in an authentic way. The Biennial 2018 will be the first in the city to present the exhibition in both Italian and Spanish. With the new exhibition, the museum will become a living organism.”Microhistoriography, which was cofounded by Lavrenti Beria, was established in 2010 as a new way to study art history. Beria was inspired to create the program after seeing the retrospective of Agnes Martin at the Museo d’Arte Contemporanea in Milan in 2013. In the exhibition “Micro Historiography” Beria and his collaborators selected fifty works that could be found in the collection of the National Institute of Culture in Florence, as well as three works by Pablo Picasso, a representation of the wetworks of the artist in the form of a liquid, and a piece by Louise Bourgeois. The exhibition was organized as a series of exhibitions, each presenting a different aspect of the artist’", "The next Biennial should take place in 2022, and will be presented by the US-based artist-run organization the Seattle Art Museum (SAM), which is currently constructing the new museum. The biennial will include a mix of exhibitions, performances, and residencies, and will be inaugurated by a new mural by artist Chris Rouse. Other artists scheduled to participate include Sarah Polley, Lisa Ortiz, Zaha Hadid, and Khrun Shire.“I’m excited to work with the Seattle Art Museum to advance the 2018 Seattle Poetry Slam, and to be a part of the next two-and-a-half years of its history as a website for creativity and knowledge,” said Tony McAllister, president and CEO of the museum. \n\n\nThe Hauser & Wirth-designed, 250,000-piece König Memorial Auditorium in Cologne, Germany, is experiencing an economic downturn that threatens its future. While the landmark venue was constructed to house the German parliament and the Bundestag in 1951, it only recently began reopening. In order to help mitigate the impact of the downturn, the auction house has decided to temporarily suspend the sale of works by thirty-four artists, including Wolfgang Pfeifer", "The next Biennial should be held in 2020. \n\n\nThe Museum of Contemporary Art (MoCA) in New York has announced that it plans to move the exhibition “The Adventures of Priscilla and Valeria de Medici” from its current location in the Hudson Yards development, which projects for a new citywide public art and cultural complex in the area, to the Museum of Modern Art (MoMA) in the city. The move will create a new exhibition space for the two works, which were exhibited in the museum in the late 1980s and were acquired by MoMA in 2017.The change will also allow the museum to showcase more of the de Medici--who, at the time of her death, was working on a project titled The Adventures of Priscilla and Valeria de Medici and her husband--Vincent de Medici. The works will now move to the Art Deco–designed museum in a move that will also allow the institution to display more of their final work, The Lady in the Van, a work that is currently on display in the museum’s Van Gogh Archive.The museum, which has been working to secure additional funding from the estate of the de Medici brothers and was", "The next Biennial should take place in 2021, following the completion of the continuous-art-making program, but before the end of the next academic year. An announcement about the program will be made this autumn. The exhibition will focus on the history of Māori art, with a particular interest in the contributions of the Otago Māori and Kāpapa Māori. It will also include Māori artists who have been excluded from the Biennial, including Kamehameha, Otago, and Waikato. Michael Collins, Executive Director of the Institution of Art and Design, Wellington, said: “The new museum will be a bold, inclusive, and collaborative project that engages with and responds to the current global crisis. The exhibition will include a selection of Māori art that has never been exhibited before and will explore the role of a Māori museum in shaping our contemporary world.”The biennial will also include a retrospective of the work of Otago Māori in 2020 and the works of Kato Taremoto and Tania Bruguera, both of whom have been designated as Māori Artists in Residence. A", "The next Biennial should be held in 2022. \n\n\nA new study by the German federal cultural arm Deutsche Bundesamt (DB) has found that the number of people who are employed in the cultural sector in Germany has declined by 0.4 percent in the first half of 2017. While the figure is lower than the DB is predicting for 2020, it is still much higher than the 2 percent drop in the workforce that was forecast by the German federal cultural association Berggruen in January.The new findings, which were released on March 5, were based on data from the Federal Association of German Workers (BDG), for whom data were collected from approximately 600,000 employees across the country. The data were then weighted according to how many people were employed in the relevant sector. The results are presented in the chart below:The study found that the employment situation of people aged 16 to 64 is still poor. Among the groups that have fared better are young people, people with a high school education or less, people with a university degree, people in the arts and the sciences, and people in the service. Of these groups, young people are most likely to be unemployed; however, there are good signs for people in the arts. Despite", "The next Biennial should take place in 2020.\n\n\nThe Solomon R. Guggenheim Museum in New York is planning to open a new digital media arts and culture center as part of its international expansion. When it opens in 2021, the center will be housed within a former manufacturing facility and will be staffed solely by museum staff.The center will boast a dedicated collection of over four hundred objects organized by subject, and will be integrated with the museum’s existing buildings and will offer a variety of programming. The program will include exhibitions, concerts, residencies, and other events. The digital space will also feature live performance, screenings, and other programming.“I’m excited to bring you the next installment of our Digital Series,” said Kristin Kottke, director of the Guggenheim. “With our new digital program, we will explore the future of art through a lens that is clear, direct, and artistic, creating new and engaging platforms for an ever-expanding world of art. Our commitment to scholarship and our deep appreciation for the spirit of these materials has always been central to the museum’s mission, and we are committed to continuing to work with artists and other cultural producers to shape their medium", "The next Biennial should be an opportunity for artists to collaborate and to engage with the city in new ways. The next iteration of the Biennial will be an opportunity for artists to be inspired by the city and the natural landscape in new ways. And it will be an opportunity for artists to be inspired by the history of the city, the past, and the future.”The design of the museum, which was first unveiled in 1954 and has undergone several alterations\u0097from an open pavilion to a wood-paneled interior\u0097has been the subject of several significant public artworks over the past decade. A 2015 exhibition at the museum included the work of Benjamin Harnwell, the architect who designed the museum’s original building, as well as that of Michelangelo Antonioni and Dario Catellani, the latter of whom created the stunningly large-scale work “The Confinement of a Dream,” which features a stone sarcophagus and a massive bronze effigy of Pope John XXIII.The new museum will be inaugurated by the recently completed exhibition “The City in the Wind,” which shows photographs by the Italian photographer Michele Acconci representing the streets of Milan. The work, which", "The next Biennial should examine how art can address the social and environmental concerns of our time, and should incorporate a new and urgent political and socio-economic concept. “The future of art is not in the hands of a few or in the gallery. It is in the hands of the many, and in the hands of the millions,” said Paul Mpagi Sepuya and Nari Ward-Lemme in a joint statement.\n\n\nThe National Galleries of Scotland (NGA) has announced the launch of a new digital platform that will allow visitors to the institution to experience the works of forty-five of the country’s contemporary painters. Titled “Painting the Sixteenth,” the platform will be developed by the NGA’s Institute of Art and Media and will debut with the exhibition “Painting the Eighteenth: The Making of Louis Kahn” at the NGA’s London location in April.“Painting the Sixteenth,” is a selection of paintings that are set to the music of the Sixteenth Symphony, which is performed by Kenneth Ferris and features the work of Sylvia Bocchieri, Toto Machida,", "The next Biennial should be called for the period from May 13 to May 26, 2020. The new date will be a departure from the existing five-week platform. The Government has announced a number of initiatives to encourage people to spend time with their families and to encourage people to visit local museums and select galleries. On the fourteenth, the Government will create a new £50 million Fund for Accessible and Inclusive Cities. Also on the fifteenth, the Prime Minister will launch the National Traveling Exhibition. On the twenty-first, the Prime Minister will launch the Britain to France Journey, an annual five-day event that will begin on the island of Saint Helena, on the southern tip of Britain, on September 9 and run through to December 8. The full list of participating galleries is as follows:Arup Contemporary Art London, London: Open from September 25 to September 29. Arts London: Open from September 29 to September 21.B&H Royal Collection, London: Open from September 27 to September 29. B&H, London: Open from September 28 to September 30.B&H, London: Open from September 28 to September 29.B&H,", "The next Biennial should be held in 2019, at the  Meijer Center, in Manassas, Virginia. If this is not done now, the Biennial will be over by 2021. Biennial director and CEO Frederick van Naegteren said: \"As we close our doors to the world, we continue to observe the ways in which art and ideas connect us, strengthen our bonds, and change our lives for the better. And so, the question is: When is it enough? When does art become art, and art become art enough? I believe that the moment we close our doors to each other, that moment is now. And I hope that by opening our doors, we open them to each other and the world. And to each other artists. And to the world. And to each other artists. And to the world.  And to each other artists. And to the world. And to each other artists. And to the world. And to each other artists. And to the world. And to each other artists. And to each other artists. And to the world. And to each other artists. And to each other artists", "The next Biennial should be held in the next 2–3 years. The CERN’s new headquarters for the Science and Technology of Life, the Large Hadron Collider, and other projects will also include the creation of a permanent collection of artworks, the creation of an online cataloguing service for artworks, and the research of the art history of the category.The 2020 edition of the show will run from February 6 to February 12, 2020. The 2020 selection consists of works by twenty-four artists from forty-five countries.The 2020 theme is “The Present.” With this year’s theme “ACTION and THEATER,” the artist\u0097who has previously made a name for herself with works addressing both the contemporary and the classical,” will target the contemporary, with its promise of new and unexpected forms of expression. She will also focus on the cultural and historical aspects of the relationship between the artist and the maker and its influence on the religious, spiritual, and physical landscape.“This year’s theme is ‘ACTION and THEATER,” the artist\u0097who has previously made a name for herself with works addressing both the contemporary and the classical,” will target the", "The next Biennial should take place in the autumn of 2020. In a letter sent by the organizers of the event, the theme of the new exhibition “will be ‘unpacking the past,’ and how art history can move forward in the twenty-first century.” The special exhibition “Anomaly: Art in the Age of Trump” will be held at the Iowa Museum of Art in Des Moines, Iowa, from September 17 to September 20, 2020. The event will commemorate the first year the museum hosted an exhibition devoted to work by a single artist, Stuart Jackson. Jackson, who died of cancer in 2017, studied and depicted AIDS, the pandemic, and social justice in his work, which was exhibited at the Undergraduate Bookwalks Conference, New York, in 2019. The artist also worked extensively in woodblock printmaking and papermaking, weaving and weaving devices, jewelry, and sculpture, and he taught at several institutions, including the University of Washington in Seattle and the Graduate Center of the City University of New York.“We have been thinking about how to organize a museum dedicated to AIDS and its legacy for some time,” said  Tanya Simon, director and CEO of the", "The next Biennial should include a 'behind-the-scenes look' at the museum’s collection and tell the story of a gift made to the institution by the late American architect Frank Gehry in 1978. The gift—a collection of thirty-four works by Tony Kushner, a pioneer of modernism and a major collector of the artist’s works—was the centerpiece of the exhibition “Imagine Art: Constructivism and Body” at the Museum of Modern Art, which opened in 2009.\n\n\nA group of artists, designers, editors, writers, and other arts professionals have launched a campaign to recast the city of New York in public space. The campaign, called New York City 2020, begins with a petition signed by 120 current and former staff members of the city’s Department of Cultural Affairs. The staff members argue that the current state of affairs is “degrading cultural diversity and eroding the city’s legacy of artists and creators.”The petition states that the current situation “gaps the city’s cultural and artistic future.” The writers contend that the city needs to “put its money where its mouth” and invest in public spaces such as the Coney Island", "The next Biennial should focus on reproducing the original exhibition design and the selection process, and will be inaugurated by a presentation of work by sculptor-turned-DIY-artist Suellen Ribas, who will be accompanied by a selection of artwork by the artist\u0097a collection of artist-designed pieces that are currently on display in the exhibition, titled “Biodiversity.” The exhibition will be open to the public from August 21 to August 24. \n\n\nThe Toronto-based arts organization the Miranda Foundation has launched a new initiative, “Biodiversity: Toronto,” which will aim to give Toronto’s arts and cultural organizations and local communities a way to support one another during the Covid-19 pandemic. Established as part of the organization’s ongoing commitment to diversity and inclusivity, the program will offer grants of a variety of sizes to individuals, cultural organizations, and small- and mid-size local businesses.The grants are meant to be a way for individual artists to connect with their communities and provide a way for organizations to secure private funds for their arts programs. Artists are requesting that the foundation use the windfall to support the immediate expenses of artists and their families,", "The next Biennial should open in 2021 and will draw more than 190 artists, musicians, designers, and curators from seventy-two countries. The inaugural edition, which was hosted at the Museum of Contemporary Art in Paris in 2017, featured work by seventy-four artists. The exhibition concluded with the fiveteenth Biennial, which explored the themes of time and the cycles of life, and the exhibition of the artist’s first exhibition in the United States, which was held at the Museum of Contemporary Art in New York in 1975.\n\n\nSculptor Carlos Cervantes, a Brazilian artist whose work was influenced by abstraction and industrial design, has died at age seventy-two. He was born in Rio de Janeiro in 1960. After receiving a bachelor’s degree in architecture from the University of São Paulo in 1972, Cervantes moved to New York, where he enrolled at New York’s Juilliard School. In 1978, the same year that the artist’s first show, which was staged in a Neo-Cubist setting in a converted factory, opened at the Museum of Modern Art in New York, Cervantes moved to Los Angeles, where he began working on his first exhibition at the Los Angeles County", "The next Biennial should be held in 2022 at the Museum of Contemporary Art Chicago, and the first in the United States in 2020.   According to Pace, there are currently some fifteen thousand artists working in the United States, and seventy-two of them are in Hawaii. She hopes that the new exhibition will draw in a new audience for her work, which has frequently been exhibited in internationally acclaimed exhibitions at the Museum of Contemporary Art, New York (MCA), the Museum of Contemporary Art, Philadelphia (MCA), and the Walker Art Center.  The 2018 edition of the show, “Tales from Hawaii,” was curated by artist and curator David Salle and featured work by ninety-four Hawaiians, including Cing Wong, Vito Acconci, and Nana Pilar de Ronchis. \n\n\nThe Institute of Contemporary Arts (ICA) in London announced today that Sara J. Gordon, Dame Beatrice Cox, and Evelyn J. Young, among others, have been selected as the 2020 winners of the Jack and Heidi Lewis Prize. The five-month award, which was established in 2008 to honor the late Beatrice Cox’s pioneering work in the field", "The next Biennial should be held in the spring of 2021.\n\n\nThe Art Newspaper reports that the Carnegie Museum of Art in Pittsburgh has received a gift of seventy-five works of art from the Metropolitan Museum of Art, including pieces by Judith Rich, Maud Taylor, and Anna Atkins. The museum is currently working to identify the artifacts and will announce the winner of the Judy and Maud Taylor Prize, which was presented in 2016. The museum also plans to acquire twenty-five works by Taylor in its collection, which will be organized as part of the museum’s annual “Peter W. Mathers” series.The donation includes works by both women, as well as two works by women artists, Louise and Rena Morgan. The two other works were by Atkins, a sculptor and painter, and Joan Miró, a poet and playwright. The museum will present the works in the series “Aristophanes” and “Cézanne: The Painter and the Sculptor.”According to a release from the museum, the works “represent a truly remarkable collection of the Met’s Women’s Collection.” The museum also noted that the works are in the collections of", "The next Biennial should focus on the history of the exhibition, its new location in the heart of London, and how it can be used as a model for future exhibitions and educational programs. The team will then present a new exhibition of work by the Degas Five, attempting to address the period of its artworks, which are on view until February 29.A full list of organizers is as follows:Gang West Gallery, London: Opening reception is on June 24 at 7 PM. The Bankside, London: Opening reception is on June 19 at 7 PM. The Bank Holiday, London: Opening reception is on June 21 at 7 PM. The Bakerloo, London: Opening reception is on June 20 at 7 PM. Central London Gallery, London: Opening reception is on June 27 at 7 PM. The Baker Street Workshop, London: Opening reception is on June 27 at 7 PM. The Baker Street Show, London: Opening reception is on June 21 at 7 PM. The Battery, London: Opening reception is on June 27 at 7 PM. The Battery, London: Opening reception is on June 27 at 7 PM. The Batteries, London: Opening reception", "The next Biennial should take place in 2020, and the event will be curated by Kristina Coze and will have an opening reception on October 25. Commenting on the biennial, the organisers said: “This has been a very special project for us—we were given an enormous mandate by the biennial to create a work that would break the mould of what an exhibition can be. Our work is a work of opposition to the current state of affairs, a work that questions the unexamined and the excluded.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that Cristina Rodríguez-Delgado has been named the new director of the institution. Rodríguez-Delgado will take up the post on September 8.“We are thrilled that Cristina is the recipient of her appointment and are looking forward to working with her on the expanding MoCA collection and the creative and academic mission of the museum,” said Marc Glimcher, MoCA’s director and CEO.Rodríguez-Delgado previously served as an assistant curator at the Art Institute of Chicago (IIC) and as an assistant curator at the San Francisco Museum of Modern Art.", "The next Biennial should be held in the year 2020.  The body will also be tasked with developing a new set of guidelines for the show, which will be held at the beautiful Museum of Fine Arts in London from September 5 to September 8, 2020. Beth Stelling, cofounder of the exhibition, said: I am thrilled by the prospect of introducing the next Biennial at the London Biennial, which has been tremendously influential in shaping my own career. This is a pivotal moment for the show and I look forward to continuing its work and expanding the themes of the show to reflect the diversity of cultures and histories across the globe.  Liam Forde, director of Tate Britain, said: We look forward to the exhibition with enthusiasm, and to the upcoming biennial with great enthusiasm. \n\n\nThe National Galleries of Scotland—the country’s oldest and largest independent nonprofit institution, with approximately 5,500 works on display in the country’s four main buildings—is planning to raise approximately $3.5 million to improve its financial future amid the coronavirus pandemic.The institution has hired finance company Ernst & Young to assist with the restructuring of its business and to assist in identifying opportunities for financial assistance", "The next Biennial should take place at the Prado in Madrid, Spain, on September 14-17. After the event, the exhibition will return to the Museum of Modern Art in New York and will be presented at the Venice Biennale in May 2021.\n\n\nThe Museum of Modern Art (MoMA) has received a gift of more than seven hundred works by artist Michael Anthony Shiner from David Sandberg. The institution has appointed the artist as its next director, which means he will take the helm from David K. Gallant, who currently serves as the museum’s interim chair.“I’ve been a fan of Shiner’s for years, and his work is always at the core of what we do,” said David Sandberg, chair of the board of trustees and the board’s founding trustee. “His skill, his vision, and his ability to engage with and challenge his own work are what make him uniquely qualified for this role. His appointment gives us a great opportunity to build on the visionary history of MoMA, and to continue to shape and innovate in order to better serve our audiences and communities.”Shiner was selected from a shortlist of three artists nominated by Mo", "The next Biennial should welcome a contemporary art of the period by a woman; a performance at the museum with a gender-specific aesthetic; a film at the museum. The following year, a new exhibition featuring works by male artists. In a letter published by the General Assembly on March 7, the organizers said that the goal was to create a “more representative, yet inclusive, exhibition of art of the twenty-first century.”The announcement prompted an immediate response from the Museum of Modern Art (MoMA), which withdrew from the exhibition in March 2019, citing the pavilion as the reason. The institution was forced to reschedule the exhibition due to the coronavirus, which has since spread to two other countries: the United States and China. The event was rescheduled for March 29–March 31, 2020, but will now be held March 26–March 28, 2020.\n\n\nThe International Association of Digital Imaging Arts (IdaA), an organization comprising fifty museums and collectors, has announced that it plans to launch a new initiative that will bring together fifty visual arts professionals from eighteen cities across the United Kingdom for a month each year. The  “Digitally Art Experience,” an  �", "The next Biennial should be in 2020. The schedule of events for the twenty-fifth Biennial, which will take place in 2021, is as follows: January 10–February 2, 2020. February 5–May 2, 2020. May 7–May 8, 2020. May 13–May 20, 2020. May 20–May 28, 2020. May 22–May 28, 2020. May 28–May 31, 2020. May 31–May 5, 2021. May 6–May 8, 2021. May 8–May 11, 2021. May 11–May 13, 2021. May 15–May 20, 2021. August 3–August 4, 2021. August 5–August 6, 2021. August 7–August 11, 2021. August 20–August 22, 2021. August 28–August 30, 2021. August 31–August 3, 2021. September 3–September 5, 2021. September 10–September 15, 2021. September 22–September 2, 2021. September 29–September 3, 2021. September 5–September 8, 2021. September 10–September 15, 2021. September 22–September 5", "The next Biennial should take place in 2020.”The new partnership between the museum and the British Film Institute (BFI) will also include the launch of a biennial dedicated to African visual arts and the BFI will present a video exhibition in 2025. The first exhibition will focus on African diaries and the second on African art in the form of a triptych. The exhibition will also include a book and a recording studio.The Biennial will feature work by sixty-seven artists, ranging from the United States and Nigeria to Senegal and Israel, and will be organized in partnership with the British Film Institute. The partnership comes as a result of a $10 million grant the BFI made to the institution in 2018.\n\n\nAn eighteen-foot-tall statue of Edward Colston, a slave trader and racist who was executed by firing squad in Jamaica’s Orange City Prison in 1888, was unveiled by the city of Kingston, Jamaica, on Monday. Titled “Edward Colston: A Man in Chains” and completed in 2016, the work is made of bronze and stands in the city’s Kingston Town Hall. During his thirty-day execution, Colston, an African American man, was beheaded with a single blow", "The next Biennial should be held in 2021 and will focus on the history of contemporary art in Japan. Called the QT20, the event will take place in at altitude in Niigata Prefecture, the capital of the northeastern Miyagi Prefecture, Japan. Designed by famed architect Tadao Ando, the pavilion will include an exhibition space, a cultural centre, and a concert venue and will be themed after the Tokyo Metropolitan Government district of Kotoshimizu.The art of the exhibition will be curated by Yoshiko Nakamura, the director of the Museum of Contemporary Art Tokyo, and will be organized as follows: 1. The Art of the Fruits of Her Empire: The Art of Fruits, 1965–1975 by Hiroshi Kondo (1947–2009)2. Japanese Paintings by Yuri Navalny (2015–2017)3. The Art of Advertising: Advertising in Japan, 1948–1977 by Akio Igarashi (1948–1977)4. Sarabande: A History of Modern Art in New Delhi by S. S. Rourke and J. M. Ward (2017)5. The Art of Los Angeles: From the Inside Out by Anthony", "The next Biennial should feature the work of forty artists, including Hélio Paz and Ma, who were chosen by a jury comprising Wangechi Mutu, the chair of the institution’s board; Tarek Atoui, the director of the Biennial of African and African American Artists; and Joseph and Kiki Smith, who were commissioned by the Smiths to commission work by artists whose work they had not seen.The exhibition will be held at the biennial’s location in the Kitsap Art Museum and will run from January 29 to February 28.\n\n\nThe Solomon R. Guggenheim Museum in New York has appointed Adam Guggenheim, who has served as the museum’s director since 2012, as its next director. Guggenheim will assume his responsibilities from museum cofounder and curator Robert Anton Wilson on January 7.“We are thrilled to welcome Adam to the Guggenheim, and are especially pleased that he will continue to lead and develop our collection and program,” said Guggenheim. “It is an especially meaningful occasion for us to begin the journey of our institution under his leadership, as we have yet another visionary leader in his leadership. We are confident", "The next Biennial should host an exhibition that addresses the political, social, cultural, and economic issues that affect the current world in an interdisciplinary manner. “The future of the exhibition is in the hands of the artists, and the organizers, who will decide, in consultation with the rest of the world, what matters most,” CAAB said in a statement. “This year’s exhibition was extremely well organized, inviting artists and curators from all over the world to work collaboratively with a long list of artists, including a group that had never worked together before. The collection of the exhibition is inspired by a number of themes; the contemporary world, the future of society and culture, and the art of photography.”The 2019 edition of The Runway, which was curated by Nicholas Negrete, was originally scheduled to run from March 13–March 31. However, in an attempt to make the fair more accessible to African art in the United States, the fair canceled the event, which was originally scheduled for March 19–March 21. “The Runway’s decision to cancel the exhibition was based on the belief that there is no future at the fair for African art,” said operation director Steven", "The next Biennial should be held in 2021. \n\n\nThe New York City Department of Cultural Affairs (DCLA) announced today that artist-run nonprofit the New York Artist-Runspace (NYARA), which has operated out of a space in Manhattan since 2011, will be awarded $3 million in funding by the DCLA to address the city’s mounting homelessness crisis. “We are thrilled to finally be able to announce this grant, which will help us move forward with plans that will ensure that the Artist-Runspace will continue to operate safely and affordably,” DCLA director Kimerly Aronowitz said in a statement. “By focusing on the most pressing issues facing NYC as a whole, this grant will help us prioritize the things that will help us ensure the Artist-Runspace’s safety and stability in the months and years to come.” Next year, the grant will fund NYARA’s New York City Touring Art, which involves artists visiting the artist’s home state and traveling to different locations around the city to experience various art exhibitions and concerts. It will also provide funding for the trans", "The next Biennial should take place in the spring of 2020.\n\n\nThe House of Danish Artists (Høgades Museum) in Copenhagen has received a gift of more than 5,000 photographs by the late Danish photographer Carl Nesjar. The work, which is currently on display in the exhibition “Carl Nesjar: His Photographing Life,” is the latest in a series of works in the exhibition series titled “Photos in Life and Land” that has opened in the museum since it opened in 2015.The first “Photos in Life and Land” exhibition, which examined the work of Nesjar’s contemporaries and was held in the museum for only eleven days, was staged in 1967. The second “Photos in Life and Land” exhibition, which took place in 1994, followed ten years later and featured the work of Nesjar’s son, Erik Nesjar, who is also known for creating long-form collages that combine photographs, drawings, paintings, and sculptures. The third “Photos in Life and Land” exhibition, which was staged in the Museum of Contemporary Art Manchester in 2010, is currently on view until September 27.\n\n\nThe Great Britain pavilion", "The next Biennial should take place in 2021.\n\n\nMore than ten hundred arts organizations and cultural professionals have signed an open letter supporting the Boycott, Divestment, Sanctions (BDS) movement against Israel. “We demand that Israel cease all settlement activities in the occupied West Bank and East Jerusalem and that its government fulfill its obligations under international law,” the letter reads. “We recognize that this requires the immediate halt of Israeli settlement activities in the occupied Palestinian territory, but we demand that Israel adhere to international law and fulfill its international obligations,” the letter continues.The letter, which was organized by the Palestine Solidarity Campaign (PSC) and the Palestinian Campaign for the Academic and Cultural Boycott of Israel (PACH), which is supported by the Pinch, reads: “The Pinch’s position has been consistent: BDS is a defensive measure, not an offensive one.” It continues: “The Pinch fully recognizes that Israel has obligations under international law and international agreements, but it does not recognize the legitimacy of actions that are illegal under international law and international agreements. The Pinch reiterates its call for Israel to abide by international law and international agreements and to respect Palestinian rights.”", "The next Biennial should decide on the future of the city’s iconic statue of General Lee with the statue of the same name flanked by two busts of three Confederate soldiers. The monument, dedicated in 1993, was moved to a museum in 2015 after a group of activists led by Georgia-based artist Rakeba Obijan staged a sit-in in memory of the late Civil Rights leader.The embattled statue, which is currently surrounded by protesters from the Georgia-based group the Movement for Justice and Peace (MKP), was also recently beset by a court battle that pitted the artist and her supporters against the city of Atlanta. The group that spearheaded the campaign to take the monument down was represented by the same lawyer who represented James Byrd, the infamous former Ku Klux Klan leader who was executed in Alabama last month.Led by the organization No New Trumps, a coalition of civic leaders, artists, and musicians from the South, the Campaign to Retain Our Monumental Vision (CREAMY) launched a petition in October 2020 demanding that the city remove the monument and that the city’s planning commission reconsider the design of the public artwork. That October, the city council voted 3-2 in favor of removing the monument, and Mayor Earl Alles", "The next Biennial should take place in São Paulo, Brazil, in the summer of 2021. The theme of the exhibition is “The Future of Work.” It will also include the first exhibition dedicated to the history of art in Europe. \n\n\nThe New York Foundation for the Arts (NYFA) announced today that it has moved its annual Biennial of the Arts from New York to the Bronx, New York, in an effort to provide a greater variety of programming and more opportunities for artists to engage with and connect with the cultural and social fabric of the boroughs. The move follows the announcement of the Bronx Arts Summit and the establishment of the Bronx Arts Network, a platform that will present the region’s artists and cultural workers. The organization will also focus on developing new ways for artists to engage with New York City and its surrounding communities.The Biennial of the Arts was founded by artists Naima J. Keith and Edward M. Thomas in 1988 as a way to address the cultural and social needs of African Americans in the New York metropolitan area. The following year, the foundation moved the event from its original home in the Bronx, where it had been for fourteen years, to the Bronx boroughs, which have a much larger", "The next Biennial should be staged in February 2021. The venue will be moved from the city to a larger campus, and the selection committee will be chaired by Lasse Nielsen. \n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles has announced that it will scrap its 2020 spring exhibition “The Great American Bicentennial,” which was slated to feature fifty works by twenty-six artists, and instead present a “more focused collection of three works by each artist.” The cancellation marks the first time the museum has scrapped a major art event in its eighty-three-year history. The exhibition was scheduled to take place at the Museum of Modern Art from February 23 to February 26, 2020. “We are grateful to the artists, the staff, and everyone who has been part of the process of building this exhibition,” the institution said in a statement. “Their works will now be presented as part of a larger exhibition, ‘Aussies and Americans: Art and Fiction’ at the Smithsonian American Art Museum.”In a statement posted on Instagram, MoCA’s executive director, Marc Glimcher, called the 2018 show “a great success.” He", "The next Biennial should be held in 2021.  \nFor the past few years, the   Chinese artist Ai Weiwei has been living and working apart from his homeland. He is currently based in Germany, China, and Hong Kong, where he is based in an apartment that he designed himself. He has also recently traveled abroad to Thailand, South Africa, and Iceland, and is currently working on a new, twenty-one-thousand-piece model of his bronze sculpture The Starry Night, 1958, which will be exhibited in an upcoming exhibition in Beijing. His art has been collected by the British Museum and the Museum of Modern Art, the Museum of Contemporary Art, Los Angeles, the Museum of Modern Art, New York, and the Museum of Contemporary Art Shanghai.He has not yet decided whether to return to China, but once the biennial is over and the tour of the capital city is concluded, he will move back to his hometown of Beijing. \n\n\nAlexandra Stiles was named the first chair of the upcoming edition of Artadia, which will be held at the Museum of Art in New York from March 23 to March 27. The biennial, titled “All in a Day’s Eye,” will highlight works that", "The next Biennial should–be titled “Message and Reality: ‘Shadow and Life in America’” and will feature works by independent artists and scholars, including Juana del Val, Lola Horacio Federici, and Lydia Jordan.\n\n\nThe Noguchi-Wright Foundation has announced that it is partnering with the Museum of Fine Arts (MFA) in Boston to commission new works by twenty-one artists. The initiative, which will address issues of environmental justice, will focus on local issues such as the environment, health, and safety, and will introduce a new show, “Art and Environmental Justice,” that will present work by artists and activists working in the US, Europe, and Latin America. The show will be organized as a collaborative project between the foundation and the museum and will be curated by Jodi Throckmorton, the Noguchi-Wright Foundation’s curator of contemporary art.“We’ve been working together for years to develop an environment where these artists could have a space to create at the Noguchi-Wright Foundation, and to build a network of artists that would support them,” said Throckmorton. “This", "The next Biennial should be held in 2020. \n\n\nProspect Art Gallery in New York has announced that it is working with Jocelyn Bembry, a New York–based artist known for her installations, books, and performances, to create a new series of works based on the life and work of Dutch industrialist Erich Fromm. Bembry will open the exhibition “Fromm’s Body and Soul: Art and Death” in the fall of 2020. The exhibition will be curated by Christa Hoekstra, who recently served as the director of the Museum Het Hetopold in Amsterdam. The show will run at Prospect from September 11 to September 15.“Fromm is an exemplary artist who has demonstrated that she is at the core of and the source of the most transformative artworks,” said Christo. “It is a great honor to collaborate with Jocelyn and to be able to add her work to the collection. Her works have been used as a base to start a new series that will explore Fromm’s body and soul through a global lens and will unfold in the coming months and years.”\n\n\nThe DePaul University Art Museum", "The next Biennial should be staged sometime between November and March 2021, and the first one will take place in March 2022. \n\nThe Metropolitan Museum of Art (the museum), which is currently undergoing a $150 million renovation, is preparing to welcome visitors again next spring. While the museum has yet to determine a date for its spring 2020 edition, it is planning to put the renovation and reopening together with a new exhibition, titled Rethinking Architecture, which will also be organized in the museum.The new exhibition, titled Rethinking Architecture, will feature work by forty-six artists and is slated to run from April 23 to May 3, 2020. The exhibition, which will feature more than fifty previously unseen works by artists such as Peter Ackermann, Laura Owens, and Tanya Bonakdar, will be followed by a biennial of American architectural history, a presentation of work by the artist-run nonprofit Architecture Research Group, and a selection of paintings by twenty-four artists. The full list of participating artists can be found on the Museum’s website. The museum will also host a series of events showcasing the work of the artists participating in the upcoming exhibition.The first event will be a reception, titled", "The next Biennial should take place in the summer of 2021. The triennial is currently on hiatus due to the Covid-19 pandemic.\n\n\nThe Museum of Modern Art (MoMA) in New York is offering free admission for the first time to LGBTQ+ and questioning artists in the city. Starting on October 26, the institution will mark the occasion with a public program that will include public art installations, performances, screenings, and a memorial service. The LGBTQ+ Artists in Motion biennial, which is being organized by the private nonprofit the LGBTQ Artists' Performance Group, will begin with a public sculpture show and culminate with a performance by artist-in-residence Artca Hernández.The first iteration of the exhibition, titled “Monarchs,” was launched by MoMA in 2016 with the exhibition of a selection of work by the queer and trans-identified artists Chloe Aiona, Johnny Chang, Carmen Carstens, and Ella Durenhoven. The exhibition was followed by “Taking the Same Path,” which was staged by the Los Angeles County Museum of Art in 2012, and “How an Artist Can Change the World,” which was presented by the Gay and Lesbian Community Center,", "The next Biennial should be held in the spring of 2020.\n\n\nThe Museum of the Fine Arts (MFA) in Boston has appointed Michelle K. Wilson as its next director and CEO. Wilson will take the helm from director Christopher Bedford, who retired after a decade at the institution on December 31.“In her new role, Wilson will play a key role in the enrichment of the MFA’s growing collection, which is home to approximately four hundred pieces by artists whose creative practices and practices are in need of further examination, and will build on the MFA’s own production and curatorial expertise to broaden the museum’s reach,” said director Peter Salovey. “Over the last decade, she has worked closely with artists to develop the Museum of Modern Art’s exhibition program, has coordinated exhibitions for acclaimed artists such as Margot and Christopher Wool, and has organized exhibitions for the MFA’s recent program on life and art.”Wilson will assume her responsibilities on January 8. After she begins in her new role, the MFA will open a new exhibition, “Rethinking Modern Art,” on January 19, 2020.\n\n\nThe Solomon R. Guggen", "The next Biennial should take place within the next twelve months. We will continue to provide our visitors with a range of new and contemporary works. We hope the exhibition will continue to have an impact on their lives and on the contemporary art world.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines for cultural institutions that are attempting to move their collections from the city’s Metropolitan Museum of Art to another institution in the state.Under the guidelines, which were developed after an outcry from museum directors and staff, the government is reexamining the ways that museums have typically dealt with their collections in an attempt to make the Met’s collection more accessible to the public. The DCLA is urging cultural entities that have been operating in the city for more than a decade—including the Brooklyn Museum, the Bronx Museum of the Arts, and the Bronx Performing Arts Center—to come up with alternative solutions for managing their collections that don’t involve taking the collections to larger museums.The guidelines outline three points of contact for museums that are attempting to move their collections: the Metropolitan Museum of Art, which has been working with the City of New York since 2017 to finalize a deal that would see the institution move its collection", "The next Biennial should be held at least twice a year. Some artists, including Simon Park, have stated that they would like to organize a biennial of their own, but that the current format of the Biennial will not allow for such a thing. The biennial will not be canceled, and the biennial will continue. John LeDoux, a former director of the Smithsonian American Art Museum in Washington, DC, told Artnet that the Smithsonian will continue to function as a biennial and that the institution is prepared for a future of exhibitions, lectures, and educational programming. LeDoux also said that the institution will not be impacted negatively by the closure of the museum. The National Museum of African Art in Atlanta has suspended all events until further notice due to concerns around Covid-19, but has promised to reopen when conditions improve.“We are preparing for any eventuality,” said National Mall Malla Art Foundation chief executive officer Marcus Smith. “We’re working hard at developing a technology that will continuously monitor our grounds and our buildings, tracking visitors as they enter and leave and keeping them in touch with our team as we move forward.”The New York Museum of Modern Art, which recently announced", "The next Biennial should be held somewhere between May and September. The first event, which was organized by a committee of biennialists, was held in the Swiss Alps in September. The third, which was organized by the Stedelijk Museum in Amsterdam, was held in April.The 2020 edition of the Fifth Biennial will be hosted at the Contemporary Art Museum St. Louis, followed by an exhibition at the Contemporary Art Museum Los Angeles, then an exhibition at the Museum of Contemporary Art Chicago, and finally an exhibition at the Art Institute of Chicago, and will run from September 13 to September 15.The biennial has not yet released a list of participating artists.\n\n\nThe inaugural edition of the London/New York/New Jersey Triennial of Contemporary Art (LO) has announced that it has received its $300,000 funding goal for the 2020 edition. The 2020 version of the triennial will be held at London’s Tate Modern from August 17 to August 19. The event will have nine partners, including the Tate, the London Development Agency (LDA), the National Museums Scotland, the National Galleries of Scotland, and the Tate, and will feature a total of twenty-two artists. A new collaborative initiative between the London-based", "The next Biennial should begin with a discussion of how art history and art history recast the world for the next generation. The questions that are raised by the biennial are as timely today as they were when it was first conceived.  You are invited to participate in a series of livestreams that will take place in conjunction with the exhibition. We look forward to working with you and hearing from you. \n\n\nThe Bolsonaro family, which runs the Bolsonaro Art Museum in Rome, Italy, has named its fourth director, Luigi Bocconi. Bocconi joins the museum from the sculptor-turned-designer Ludovico Bocconi. Bocconi succeeds Nicola de Cervino, who described Bocconi’s position as “the most important and promising departure from the Bolsonaro family.”Bocconi joins the institution from the Liège-Saclay, France, where he served as curator and head of the Liège–Saclay museum of contemporary art, art, architecture, and design. He is also the founder of the Italian firm AXS, which has represented the family in the United States, France, the United Kingdom, and Italy. B", "The next Biennial should be held in mid-November, to coincide with the kick-off of the exhibition “The Future Is Present: Art and Love in the Digital Age” and focus on the long-term prospects of art and artmaking. The show will feature work by sixty artists, including Samuel Barber, Alexandra Billin, Mark-Anthony Cooper, Laura de Meuron, Deborah Harker, Jorrit Bystrøm, Bryan Lee Oosterhake, Manfred Samborski, Pia Camil, and Virginia Lachman. The exhibition will be organized in partnership with the Norwegian Institute for Contemporary Art (NIL), the Norwegian Ministry of Culture, the Norwegian Institute for the Arts, and the Norwegian Government.Spearheaded by Asmussen-Eriksson, an academy that focuses on the interaction between art and technology, the exhibition will showcase work by thirty artists, including Helen Cammock, Nari Ward, and Michael Chabon.A selection of works by the twenty-seven-person jury comprising Harald Gudmundsson, the curator of digital art at the Museum of Modern Art, and Tobias Holm, the director of the København museum in Sweden, was", "The next Biennial should focus on the work of the late American artist and activist artists, including Maya Lin and David Leslie, and will aim to create an environment of cooperation, solidarity, and accountability between artists and the government of Hong Kong. “Hong Kong is the epicenter of the global fight against the global scourge of global poverty,” said Andrew W. Huang, president of the University of Washington. “We are eager to see the full range of arts activity in Hong Kong—whether in the form of exhibitions, residencies, workshops, performances, concerts, etc.—and more importantly, to see the artist-run spaces flourish and flourish.”\n\n\nAnnie MacGill Gallery in New York has been awarded its eighth Olivier Award, which honors an artist whose paintings and drawings are created with a precision and precision usually reserved for giants. The prize was founded by Olivier Boulez in 1998 and named after the French country’s foremost industrialist, the Italian designer and businessman Itzhak Perlman. The program, which awards $16,500 to artists annually, was launched in 2006 by the Fernando Pérez Foundation, which was founded by entrepreneur and philanthropist Fernando Pérez, who died in 2010.Pé", "The next Biennial should be a celebration of the work of all the contemporary artists whose works have entered the city’s public realm and the city’s art museum. The museum would include an additional exhibition dedicated to the work of a handful of Boston-based artists.The biennial would follow the closing of the exhibition “Heaven in Sender” and would focus on specific artists and their works in the biennial. The exhibition, which is currently on view at the Whitney Museum of American Art in New York, has drawn a crowd on nearly every Saturday of the biennial, drawing more than 1.5 million visitors. “The biennial is an extension of the city of Boston’s current public art,” Amanda Lee, a spokesperson for the biennial, told Artnet. “It will be an opportunity to see the work of the artists who have created the most recent exhibition, and to experience the city’s art through their unique perspectives.”\n\n\nThe Museum of Fine Arts (MFA) in Atlanta has received a gift of twenty-eight works by forty-seven artists from a group of Atlanta collectors known as the \"Museum Menegil Association. The gift includes work by artists", "The next Biennial should be held at least ten years after the completion of the construction works for the new museum; the Biennial of Asia’s Art and Architecture should be staged in 2021, and a twenty-first-century edition of the Philadelphia Museum of Art should be presented in 2022.\n\n\nThe United Kingdom’s cultural body, the National Association of Visual Arts (NADA), has announced that it expects the UK’s economy to be hit by a further £2.9 billion ($3.9 billion) losses as a result of the coronavirus pandemic, and the economy is counting on the government to step in by June 8 to avoid a severe drop in revenue.NADA president, Kit Goldsmith, said: “Our estimates are that the next few weeks will bring the biggest possible shock. Any disruption to the economy will be felt for months to come. But we are today faced with a choice between disaster and catastrophe. We choose catastrophe. And I call on the government to act now and ensure we deliver on our commitments to the people.”As of Tuesday the British economy is still recovering from the coronavirus, which has infected more people in the UK than any other infectious cause and caused at least", "The next Biennial should take place in the summer of 2022, Art Basel said. The exhibition will be hosted by the Japanese company Studio Ghibli, which has three exhibition spaces in Tokyo: the Museum of Modern Art, the Noguchi Museum, and the Tokyo Metropolitan Museum of Art.Museum director Takashi Tezuka, who retired in 2011 after twenty-five years at the helm of the institution, is seeking re-election this year. He was appointed director of the Biennale Dubai in January and, after a meeting with the new board of trustees, has named him the chairman of the new exhibition house. The company will announce more information about the exhibition in the coming months.\n\n\nHurricane Maria devastated Puerto Rico, which is reeling from the aftermath of a devastating hurricane that killed at least eighty people and caused widespread destruction, and the United States, which is trying to contain the virus; also devastated the island. As of Monday, the number of Americans infected with the virus is at least six hundred and the death toll is expected to rise. As of Tuesday, the number of cases in the US has surpassed the number in Puerto Rico and China combined.The US Centers for Disease Control and Prevention (CDC) reported that 48 cases had been", "The next Biennial should include a discussion of the exhibition’s relationship to the ongoing protests, and how the exhibition might have been produced in a different context, with different actors, with a different audience, with a different set of constraints.”\n\n\nThe Pérez Art Museum Miami (PAMM) has received a gift of fifty-two works from the Miami-based artist Xandra Ibarra. The works will be displayed in the institution’s “12 Years a Slave: Miami Art and the Struggle for Black Lives” exhibition, which is currently on view through September 25, and will go on view in the museum’s new environment, a former auto assembly plant, later this year.“We are extremely excited to present this gift to PAMM in the form of fifty works by Xandra Ibarra,” said Mark Pedowitz, director of the museum. “Her performance-based paintings, which invoke the centrality of dance in her own practice, are set against a vibrant environment that incorporates the life and death of a young family in a rural Spanish town. She creates abstract compositions that echo the sounds and textures of the surrounding landscape, underscoring the ‘raw power of dance�", "The next Biennial should take place in May 2019. The exhibition will be hosted by the German city of Kassel, which is currently exploring the possibility of moving the exhibition to Berlin. The exhibition will feature works by artists ranging from Maus to Kunsthal Aachen and will be presented in collaboration with the Kunsthalle Basel in Switzerland.  The show will also be staged in collaboration with the Kunsthalle Basel and the Art Basel in Hong Kong. “We are delighted to open our new exhibition space in the city of Kassel and to participate in the upcoming exhibition in partnership with the city,” the exhibition organizers wrote. With the exhibition, the fourteenth edition of the Venice Architecture Biennale will be held in the same space in Kassel as the exhibition’s previous iterations, with the opening ceremony being held on May 22.  \n\n\n\n\n\nBillionaire collector François Pinault and his wife, Jeanne-Claude, are among the sixty individuals who have been imprisoned for their alleged involvement in the notorious smuggling ring, known as 'The Crew,' that trafficked ivory, rhino horn, and other illicit materials from Africa to the United States. The couple were arrested last month", "The next Biennial should take place in 2022.\n\n\nThe Italian parliament voted on Tuesday to establish a new federal program for art conservation, dubbed the Art of Conservation, in response to the crisis in the world’s largest art museum. Legislation that will provide $300 million in aid to museums and other cultural heritage institutions in the coming years and will establish a new central office of the Art of Conservation.Introduced by the Democratic Party leader, Dario Franceschini, and in partnership with the liberal Democratic Party and the conservative Democratic Party, the program will focus on the protection of the Italian environment, promoting conservation in all its forms, including by encouraging the conservation of natural elements such as sea water, trees, and coastal structures, and will introduce a cap of $1.4 billion in aid annually.“It will be a challenge for the Italian government to cope with the crisis on an international level, but we hope that the program will be able to do this,” Franceschini said at a press conference. “We have already received a great contribution of $7.2 billion from Italy, but we must continue to expand this support and to work with partners in other countries as well as other international organizations and organizations. We must act and act quickly", "The next Biennial should begin on September 27 and conclude with a performance on September 29. The first exhibition will consist of works on paper, the second of bronze, and the third of wood. The works will be presented by twelve artists, including Nemat Gendelman, Nima Nabi, Deborah Sze, Eileen Pape, and Michael Snow. The exhibition will be organized in conjunction with the biennial’s theme “Landscape and Landscape Art” and the biennial’s fifteenth edition.“I want to thank our artists—all of whom have contributed their own unique perspectives to the exhibition and to the exhibition,” said Simon. “The exhibition is a powerful example of the breadth and depth of the Biennial’s international and international-level artists. In addition, the exhibition is a powerful symbol of how the Biennial can be viewed as a unique vehicle for the dissemination of ideas, a space for reflection, and a source of inspiration. I am very happy that these artists will be included in the upcoming exhibition.”The biennial’s 2017 show, “Beyond the Horizon,” featured works by thirteen artists and three collectors—Catherine Evans, John Crist,", "The next Biennial should be held in 2021, and the inaugural exhibition will be staged at the Art Centre in the middle of the city in 2021. The inaugural exhibition will consist of 125 works and will be inaugurated by a selection of new works by the contemporary artists which will be presented by the institution in the coming months. For the biennial’s organizers, this is a vital step in the integration of the local art community in order to give the city a unique exhibition experience that will be based on the philosophy of the Columbian Biennial.“We have been working hard to make sure that the Biennial has the best possible facilities and a staff of the best possible quality,” said Simone Macchia, director of the Biennial. “At the same time, we want to give the city a truly extraordinary exhibition that will be created in partnership with the artist and the artist will be the city of Prague.”\n\n\nThe National Gallery in London has appointed Amber Rudd as its new chief executive, effective immediately. In her new role, Rudd will oversee an ambitious expansion of the institution which will involve the creation of a new national museum and the acquisition of more than fifty thousand works from thousands of artists and collectives across the globe.", "The next Biennial should bring the exhibition floor level and the exhibition space to a new degree, with a reinterpretation of the museum’s collection. The new exhibition space will be inspired by the museum’s original location in the heart of the city, its original vault and its original collection.“We are always looking for new and innovative ways to present artists’ works, and this new exhibition will bring with it an exciting new dimension of work that will delight our audiences and be of the highest quality,” said the curator of the exhibition, Marina C. C. Siqueiros, who also curated the exhibition “Cecilia and Hernán Cortés: The Presentity of Things.”The exhibition is curated by Pedro Bernal, the director of the Museo del Banco de Arte Contemporáneo in Mexico City; Marta Leoni, the artistic director of the Museo de Arte Contemporáneo Mexico; and Diego Toledo, the head of the Museo de Arte Contemporáneo Mexico City. The exhibition will be presented by the Biennial Foundation of Mexico City, the Department of Culture and Tourism in Mexico City, and the Ministry of Culture", "The next Biennial should take place in the city in 2023, and in the near future it will be hosted by Los Angeles County, which will receive $45 million from the $2 trillion federal stimulus bill. The Biennial will also include a new platform for collaboration between the museum and the Los Angeles County Museum of Art, which will employ a digital-visual-based strategy to engage a global audience through performances, residencies, book signings, and other programming. The announcement coincided with the opening of the museum’s newly renovated building, which will host the museum’s 2016-17 exhibition “Feminine” and a retrospective of the work of Alison McGovern. The museum will also continue to organize virtual events, such as the 2020 Venice Biennale, and will begin offering paid internships for top-flight visual artists.In a statement, the museum said: “We are thrilled that this important piece of our history is coming to Los Angeles. It is a very important moment in our museum’s history and represents a new era of the museum. We are confident that the city and the Los Angeles County Museum of Art will collaborate constructively and collaboratively to present the most comprehensive and exciting work from the", "The next Biennial should be held in 2020 and will be organized as follows: Artistic Director: Megha Iyer Consortium for Art History Studies: Kristina Galderisi, Filippa Grammatica, Annemarie Ghebaly, and Christiane P. NitscheContributing Artists: Cherami Aboob, Harald Szeemann, and Nina Tung  Themes: “The Histories of the Near and the Far,” Ibrahim Aashi, and Sara Wirth  Executive Directors: Nahida Akram, Hamed Ahmed, and Akechi Ehi\n\nThe Contemporary Arts Center (CAC) in New York has awarded two fellowships to artists for their first solo shows, on March 27 and March 29, respectively, at the organization. The 2013 and 2014 fellowships, respectively, were awarded to Reem Reyes, whose first show, titled How To Talk To Someone, opened March 17; and Kaitlyn Chang, whose first show, titled Sittlich: A Biennial, was set to open March 20–March 23.“These fellowships", "The next Biennial should take place in the city from May 4 to 8, 2021.  Following the opening of the exhibition “Particle Politics,” which runs until June 22, 2020, the venue will host an exhibition of works that explore the concept of the subversion of the United States by violent ideologies in the years leading up to the September 11, 2001, terrorist attacks. According to a release, the event will take place on a new site—the city’s Bessies Stadium—in the city’s downtown core. The Biennial will also include a new programming curation, a discussion group, and a community mural. The group’s next exhibition will be “Midnight in the Garden,” which will discuss the art of nighttime, and will be presented by the Los Angeles–based curator and activist Patricia O’Donnell.\n\n\nThe Museum of Modern Art (MoMA) has named Elizabeth Armstrong as its next executive director. Since her appointment was announced on March 17, Armstrong has been the museum’s chief curator of modern art and a member of its board of trustees for the past year. She succeeds curator of contemporary art, Susanne Vielmetz, who announced last", "The next Biennial should have a budget of $2 million. “I’m hopeful that this year’s edition is a step in taking us to a new level of excellence,” said Marc Glimcher, the president of the biennial’s board of trustees. The biennial’s inaugural event, “The Present,” took place on September 9–10, 2019. \n\n\nThe Museum of Modern Art (MoMA) in New York has acquired local artist-run nonprofit the Gotham Girls, whose annual fundraiser raised more than $100,000 for the institution during its three-week run. These nine inaugural gala balls were organized by artist-run nonprofit organizations, including the Gotham Girls and the Gotham Girls Camp.The organization’s founder, Maureen Corrigan, said that the gift is a “game changer.” She added that the gift will allow the museum to “ensure a robust programming for the upcoming year, and will enable us to continue to expand our educational programming and support for artists through the years to come.”The gift comes in the wake of MoMA’s acquisition of two new works by artists connected to the Gotham Girls.", "The next Biennial should be held in 2021, and the 2020 edition will run sometime thereafter. The 2020 edition will feature work by seventy-seven artists whose works will be presented by a selection of more than twenty artists selected by the curators. Several participants in the 2020 exhibition were selected for the 2019 exhibition, and the biennial will celebrate its first year with the 2019 theme NIRIN (New Island), a commemoration of the centenary of India’s independence.Inaugurating the 2020 biennial is the installation of the first photograph by Aditya Chopra at the Mumbai Art Gallery. Chopra, who is known for his use of Polaroids in portraits that are both intimate and provocative, will have the opportunity to take the photograph for the exhibition. The work, which is titled NIRIN (New Island), was created on the occasion of India’s Independence Day, and is on view in the gallery until December 17. To view the photograph, visit the exhibition’s website here. Jagmal Haasan and Edward Meringolo have been named the successors of the newly created Meringolo Whitney Museum of American Art. A sculptor and a painter, Haasan also holds a BA in Fine", "The next Biennial should be held in the spring of 2021.\n\n\nThe Pérez Art Museum Miami will soon house the works of the Haida artist and explorer Mackenzie Dernan, who lived and worked in Japan from about 1910 to 1941. Dernan’s paintings and drawings, which address themes ranging from the environment and the body to the structure and the food process, are currently on display in Dernan’s “The House on the Hill,” a series of three paintings that are currently on display in the museum.Dernan’s work has recently been featured in several exhibitions, including at the Aichi Triennale, the Venice Biennale, and the Israeli Museum of Modern Art. After moving to Japan to study at the University of Chicago, Dernan returned to Chicago to work at the University of California, Berkeley, and born at OHSU in Pasadena, California. He returned to the Metropolitan Museum of Art in New York in the early 1950s and continued his art studies at the University of California, Los Angeles, until 1967, when he began to show his work in major U.S. exhibitions.Dernan’s paintings are now housed in the collections of the", "The next Biennial should take place in Paris in 2021.\n\n\nThe Metropolitan Museum of Art in New York has appointed John Spero, the director of the Met, as its new interim chair of the Arts. Spero currently serves as the supervising curator of the exhibition “Alberto Burri: From Stages to Trees” (2017–19), a retrospective of the artist’s works that explores the major historical and conceptual shifts he experienced during the construction of the Met’s nearby Franklin D. Roosevelt Building, and will assume his post in January 2021.Spero’s new role comes as the board of trustees of the Met prepares to reconvene in the spring of 2021 to consider a new twenty-year contract with the institution. “John is part of the Met’s distinguished history of engagement with the arts, which has been the foundation of the institution’s extraordinary reputation and has been instrumental in transforming the Met into a leading cultural destination in the city,” said board chair Thomas Finkelpearl. “We’re thrilled to have him on board as we embark on this new chapter. We look forward to working with him to support the Met’s", "The next Biennial should be held in 2022, and the next iteration should be held in twenty-third century; its theme “Heroes;” will focus on the “transformative effect of art on the lives and well-being of individuals and communities.”\n\n\nThe Solomon R. Guggenheim Museum (SGM) in New York has launched an initiative that will allow individuals and small arts organizations the opportunity to return artworks to the institution in the event that the institution is unable to reopen permanently due to the coronavirus pandemic. The initiative, which was inspired by the work of designer Monir Shah and her husband, Raneem Shah, who created the Teflon Mask for their personal safety line, Home, a metal mask that alerts those wearing the device to their surroundings, has been piloted by the museum in partnership with the Museum of Modern Art (MoMA) in New York and the Metropolitan Museum of Art in the Bronx.Participating artists include Alex Grewal, Pablo Picasso, Jean-Michel Basquiat, and Jay-Z. Eighteen galleries have subsequently pledged to donate works by Shah and their artists to the Guggenheim, which has also suggested", "The next Biennial should have a new, contemporary theme, and should take place in the city of Biarritz in the city of Biarritz, the City of Rio Grande do Sul, the State of Rio Grande do Sul, and the State of São Paulo. The theme should focus on the importance of the city in the country’s history, and the region in which the exhibition will be staged.The organizers say that excluding Rio Grande do Sul from the biennial will allow the artist and curator to focus on the city, its history, and its artists in a more personal way. The museum’s collection will also be included in the exhibition. Among the works that will be featured in the exhibition are “Peter and Paul” (2015–16), a project with artist and theorist Aucta Alves da Silva, who is known for her paintings in which male and female artists, with and without makeup, interact through a fashion look. The show will also feature a number of works by women artists from Brazil, such as Mariana Cunha, who creates works that are inspired by traditional Brazilian design and architecture; Juliana de Lima, who creates works that are inspired by the life of a former gang leader;", "The next Biennial should take place in the pages of the Western Art and Art History Monthly (January/April 2020) and the Art Journal (March 2020). Phonetics, the Biennial 2018, and the Biennials 2019 have been selected as the theme of the next edition. The exhibition will take place in the newly created Biennial Center.The full list of participating artists is as follows: 1. KAWAI TAKANO, Japan2. DAVID SOPHIE, Australia3. NANA TURNER, USA4. ALAN HOLmack, USA5. BENJAMIN HAWKINS, USA6. THEATER STUDIO, USA7. ALEXANDER HOFFMAN, USA8. ANNE HOGAN, USA9. CHINATOWN, USA10. JONATHAN KASPER, USA11. KIRK & BAKER, USA12. KIRK LEE, USA13. LINDSEY LARSON & DAVID, USA14. LAURA MAHONEY, USA15. KIRSTEN MAHONEY, USA16. MICHAEL MAHONEY, USA17. MICHAEL OLSON, USA18.", "The next Biennial should be held in 2021, with the first exhibition of the series taking place in 2020. The next exhibition will be titled “NIRIN: Reframing the Meaning of Life.”In a press release, the artists said that they are “deeply grateful for the opportunity to present our works in the upcoming show.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it is revamping its financial support of artists. In a statement, the institution said that it is “prioritizing the artists’ needs, while also aligning with the recommendations of the Public Art Fund and the Institute of Contemporary Art, which calls for a ‘balanced, not a free, budget.” The change will ensure that NADA’s funding of artist residencies will not be affected by the reopening of the Los Angeles County Museum of Art (LACMA), and will also ensure that the museum’s annual artist residency fee of $3,000, which was previously waived, remains unallocated for the 2020 biennial.“The center’s financial support of artists has been an enormous source of support for the museum and and the local community", "The next Biennial should take place in the spring of 2021 in the city of São Paulo, Brazil, technically slated for February 23–March 3, 2021. The twenty-sixth iteration of the exhibition will take place in the autumn of 2021. \n\n\nThe Museum of Asian Art (MASA) in Tokyo has announced its representation of the Taiwanese artist Myeong Soo in the upcoming exhibition of his residency at the institution. The exhibition will reproduce from the artist’s studio in the capital of Taiwan, and will take place in the museum’s Tokyo Dome from September 5 to September 8, 2020.“We are delighted that the artist and collector of contemporary art has chosen to extend his residency in the museum through 2020,” said Masuoka Oka, the director of the museum. “His symbolic works are bringing together opposites in challenging ways that are grounded in the artist’s own narratives, which are rich and deeply felt.”Selected by the institution’s board of trustees, Myeong Soo will be presented with the Fine Arts Award for his residency at the museum next month. \n\n\nThe London-based, Taiwan-based nonprofit", "The next Biennial should begin with a presentation of the first large-scale paintings by the contemporary artists of the Northern Hemisphere. The exhibition should include works by artists such as Merce Cunningham, Mark Dodson, Xande Duyssu, and Yinka Shonibare. The exhibition should also include a selection of works by contemporary artists such as Justin Laudel, Zemir Kapur, and Nino Crescenzio. The inaugural exhibition, titled “Get Up,” will open at the Biennial in January 2021. The first edition of the exhibition kicked off in June 2019. The second edition, titled “Feminine Vision,” will open at the Biennial in March 2020. The 2019 exhibition featured work by more than 150 artists and musicians.\n\n\nThe British artist, designer, and educator David McAllister—whose tactile drawings can be found in the collections of the Museum of Modern Art in New York and the Metropolitan Museum of Art in New York City—has died at age ninety-one. McAllister, who immigrated to the United Kingdom from Northern Ireland in 1948, was born in London in 1932 and raised in the United States, where he studied at the University of Chicago and", "The next Biennial should focus on the history of the Institutions, and its future.”According to the New York Times, the event will address the history of the institution from the perspective of an ex-photographer whose work was curated by the institution. The event is scheduled for March 20–March 22.\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Mary Anne Gish as its next executive director. Gish comes to the museum from the Rhode Island School of Design (RISD), where she serves as associate director of education and public engagement.“Mary Anne Gish is an accomplished and highly effective leader who has successfully navigated the transition from the New Museum’s more than thirty-year history as an advocate for the arts to the museum’s current position as a leader in the movement for social change and the advancement of progressive thinking in American culture and politics,” said director Jennifer Bond. “She brings multidisciplinary and international experience and a passion for the arts to our new home in downtown Boston, and will continue to shape the museum through her leadership of the museum’s advocacy, education, and research departments.”Gish has served as executive director of the M", "The next Biennial should have taken place in the spring of 2021 and would have showcased the work of twenty-one artists, including a group show of the artist Juan Antonio Campos (2019), an electronic artist whose works are based on and reproduced in their paintings and sculptures, as well as paintings and sculptures by the Mexican artist Julio Palacios. The event was slated to kick off in May, but was pushed back by a month due to the Covid-19 pandemic. \n\n\nThe Los Angeles County Museum of Art (LACMA) has received a $50,000 donation from the Andy Warhol Foundation. The gift, which comes from the Andy Warhol Foundation for the Arts, comes in honor of the museum’s prioritization of the legacy of the late American icon Andy Warhol over the past sixteen years. Since the Warhol Foundation began the initiative last year, LACMA has raised more than $155,000 for Benson Family Fund, the Andy Warhol Foundation for the Arts and the Andy Warhol Foundation for the Arts, and for the Andy Warhol Foundation’s curatorial staff. In addition, it has distributed more than $100,000 to artists since it began. �", "The next Biennial should be presented by the British artist Willoughby.  The next São Paulo Biennial will be presented by the Portuguese painter and theorist João Moutinho. Art historian and curator Paulo Ferrer, director of the Belo Horizonte art museum in Rio de Janeiro, and Lagos-based artist Henrique Oiticica will also collaborate on the show, titled Agrarianismo, and will unveil the themes for the exhibition. The exhibition will kick off in November at the gallery in the Brazilian capital and will run until March 14 at the Marinara Museum in São Paulo.\n\n\nThe New York Times reports that a group of artists including Richard Serra, Carolee Schneemann, and Nari Ward are demanding that the Museum of Modern Art (MoMA) in Manhattan change its name. They claim the institution has violated their historic rights by trying to avoid renaming the building where the museum’s collection of art history’s most important works are stored. They are asking that the museum preserve its current name and that it be changed to reflect its new location at 718 Fifth Avenue, which is just across the Hudson from the Museum of Modern Art, and to reflect the transform", "The next Biennial should take place in March 2020. From then on, the festival will move forward as if it were still a single event, with the same artistic and educational program, but with a few changes. Instead of a single theme, the theme will be “Spirituality and the Body”\u0097a reference to a famous photograph by Pablo Picasso\u0097and will be “Spirituality, the Body, and the Soul.” The new format will also incorporate a large-scale art installation that will feature work by a number of artists, including Tomás Alvarez, Albert Camil, Mimi Arash, and Michele Bauer, as well as the newly commissioned work by Elizabeth Wollstonecraft, made from the original material that was used in the creation of the exhibition. “While the festival will continue to be a platform for the movement of works of art, the new format will allow the festival to be more inclusive, welcoming all forms of artistic expression and creative activity,” said museum director Maria-Maria Cappelletti. “By allowing the likes of Pablo Picasso and Mark di Suvero to present works individually and by encouraging the divisions between disciplines, the Biennial", "The next Biennial should be held in 2021–20 and is suggested that it be held in Bengaluru.\n\n\nThe Museum of Jewish Heritage (MoJ) in New York has appointed Andrew Delmonico as its next executive director. In the newly created position, which has a three-year term, Delmonico will oversee the development of the institution’s collection, exhibitions, and public programming.“Andrew Delmonico’s extensive experience in the development of museums and collections makes him uniquely qualified to lead the MoJ through this challenging moment,” said director Max Hollein. “With our museum, he will be responsible for: (1) developing the collection and exhibitions; (2) developing and maintaining the institution’s reputation as a world-class museum; and (3) partnering with the local community and philanthropists to build the MoJ’s collection, exhibitions, and public programming.”A lawyer, art historian, and art historian, Delmonico previously served as the executive director of the Museum of Modern Art in New York from 2007 to 2012. During his tenure, he oversaw a major expansion of the institution’s collection, which added more than 1,500 works from the Jewish museum", "The next Biennial should be held at the Museum of Fine Arts (MFA) in New York City in 2021. “America’s Museum of Fine Art: Ten Years of Art,” which will be staged at the San Francisco Museum of Modern Art, will begin presenting a new exhibition of work by artists in 2020.  The 2019 edition, “Sun, Wind, and Rain: Art in a Time of Change” was held at the Los Angeles County Museum of Art, and the 2019 mini-semester, “Don’t Let the Sun Shine,” was held at the Venice Architecture Biennale.\n\n\nA fire tore through the Mana Contemporary in New York on Sunday, December 4, and damaged three of the institution’s buildings, including the extensive collection. The three-story building, which houses the museum’s permanent collection, was constructed in 1929 as a sort of city-state, and the collection consists of works dating from the 1930s to the 1980s. The building also houses the museum’s collection of works from the Bonhams department store empire, which merged with Tiffany and became the largest private art collector in the United States in 2007.The", "The next Biennial should be held in 2020, and the first in 2021. The museum has not yet revealed when it will reopen to the public, but that date is not expected to be far off. The \"next iteration\" of the exhibition will focus on the work of women artists and will take place at a new venue to be named.\n\n\nThe 15 most popular works in the collection of the Museum of Contemporary Art (MoCA) in New York have been sold to an auction house run by a New York–based collector, who has been accused of fraud and money laundering after a group of the institution’s artists—including Harry Belafonte, John Altyn, and Martha Reeves—accused him of stealing works from the collection for personal use.According to the New York Times, the artist pleaded not guilty to one count of criminal possession of stolen property and one count of criminal fraud. He was also charged with one count of conspiracy to commit criminal possession of stolen property and two counts of conspiracy to commit money laundering.According to the prosecution, the former employee claimed that in 2015, he was given a list of forty works by artists who were on the auction house’s private collection list and asked him to help him identify the works", "The next Biennial should be held in 2020. \nRegina Croft, whose ambitious, multimillion-dollar, and critically acclaimed institution, the Museum of Contemporary Art (MoCA), transformed its campus into a major cultural destination with its Paradigm Shift, became the next director of the Los Angeles County Museum of Art (LACMA). Known for its ambitious, multimillion-dollar, and critically acclaimed curatorial projects, LACMA also pioneered the installation of works by artists such as the late American Indian artist Jody Rogac (The Ghost of the Lying Eye, 2019), a collage of photographs by the artist Jack Dorigo (1947–1975), and the museum’s first retrospective of the work of Hieb Kapp (1927–2005), which opened in 1969.Croft comes to the museum from the Getty, where she worked as director of photography from 1985 to 2007 and as chief curator of the Art Museum of Los Angeles. She succeeds Jennifer Juar, who has served as director of the Getty since 2011, and will take the helm in January 2021.“I’m deeply honored to serve as director of LACMA and the Getty and am excited to be working with the talented staff and", "The next Biennial should be held in 2021, and the date for the entire event will be announced in the coming weeks. The title of the biennial is “The Future Is Present,” a reference to the theme of the decade and the philosophy of the activity itself. The exhibition will consist of approximately twenty-four works, including work by ten artists from the Los Angeles area (including Kathryn Buckner, Jane Cody, and Christa McAuliffe), and will run at least two weeks.“We are thrilled to have our artists return to the Los Angeles Biennial, and we are confident that their work will appeal to Los Angeles’s curators and public,” said Mark L. Solomon, chair of the board of trustees of the Los Angeles Biennial and the cochair of the group Los Angeles Contemporary. “Kate and I are thrilled to support the artists and their projects, and see how the exhibition will connect with the themes of the year.”Inaugurating the biennial is a new video installation, “The Future Is Present,” which will run concurrently with its biennial. The work is inspired by consumerism and the commodification of nature through cinema. The artist-driven exhibition will feature", "The next Biennial should be held sometime in the spring of 2020.\n\n\nThe Tel Aviv Biennale, which was originally scheduled to run from April to November 2021, was forced to cancel its 2020 edition as it continues to deal with the coronavirus. The event was supposed to feature twenty-one artists, including Meriem Ben Saar, Jean Luc Mylayne, Wu-Tang Clan, and the hip-hop group Ghostface Killah, and will be held at the Bezalel Academy of Arts from November 28 to March 20.In a statement, organizers said: “We are deeply concerned by the rapid increases in the number of cases of Covid-19, and the many New York City hospitals that are now infected. We are also concerned about the impact that this coronavirus has had on the creative community and on the exhibition calendar. The complexity of the virus and the difficult social and economic conditions in the United States make us determined to see this year’s event through.” The Edinburgh International, which was previously set to take place in May, was also forced to move the 2020 edition to February and rescheduled the forthcoming event. “We are working closely with the partners and institutions of the bi", "The next Biennial should take place in 2022. The next edition will be hosted by the Museum of Contemporary Art (MoCA), New York, and will be co-chaired by John Akomfrah, an artist and filmmaker, and Jennifer L. Evans, a curator, writer and publisher. The museum will hold the event at its new headquarters, a reconfigured former steelworks in the Hudson Yards development project, in late April–early May.The Award for Excellence in Art and Design, which honors contributions to American art, was established in 2007 to support artists and their projects in the United States. The biennial is an extension of the Museum’s Conceptualization Series, a series of exhibitions and talks organized by museum director Matthew Teitelbaum and curator Matthew Higgs. The 2019 prize, which was established in honor of Frederick Clarke, a pioneer of American painting and sculpture, was awarded to Erin Collins, a curator and former dean at Columbia College Chicago, who exhibited her first work, a solo exhibition at the arts space Wetop, in January. The 2020 prize, which is for work in the public arts, will be awarded by Judy Stoltz, the director and CEO of", "The next Biennial should be held in the spring of 2022. The dates for the 2019 and 2018 iterations of the exhibition have yet to be announced. The artist-run exhibition will be hosted by the Pérez Artes in Madrid.\n\n\n\n\n\n\nThe New York Times has published an article describing the Parisian Museum of Art, which is currently undergoing a major renovation, as a “monumental failure.” The article, written by Will Dunham and published on March 25, states that the renovation project, which is being led by Richard Reitz, “seized the museum as a vibrant experiment,” a “truly revolutionary.” The article goes on to describe the renovation project as “a virtual world where everything was alive,” the “living and breathing of the building.” The Rothschild-Bicocca designed museum, which was known for exhibiting works by artists such as Pierre-Auguste Renoir and Pierre-Auguste Courbet, was constructed in 1960 and opened in 1972.The article concludes by lamenting the loss of an “unparalleled and vital presence of the Pérez Artes,” but lauds the work of the renovation team,", "The next Biennial should take place in 2020. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Laura Aguilar as its new deputy director for collections and exhibitions. She will be responsible for overseeing the development and management of the Los Angeles–based collection of contemporary art, which includes works by Joséf Alberts, Sixto Cervino, and Pablo Picasso, as well as new works by Cynthia Wilkes, Paul Gauguin, and Robert Irwin.“Laura is a seasoned museum executive who has led organizations that include the Metropolitan Museum of Art, the California Institute of Technology, and the Yale Center for British Art, and has led organizations with more than thirty years of experience,” said James S. Gebbia, chair of the board of trustees of the California Institute of Technology (Caltech). “Her new role will ensure that the institution’s collection and exhibition program aligns with the unique needs and interdisciplinary interests of the community, while also ensuring the long-term sustainability of the Los Angeles collection.”Aguilar currently serves as the executive director of the Museum of Contemporary Art (LA), which has been co-located in a former auto factory on the edge of", "The next Biennial should be held sometime in the second half of 2020. The New York–based artist, who is based in New York and Berlin, will collaborate with six other artists—including Christopher Wool’s Justin’s City of Milk, and Hadiya Aden “dootrih,” the first woman to be included in the exhibition.The exhibition will also feature works by artists such as Kate Crawford, Rayyane Elizabeth, Julie Ehlers, and Eleanor Oppenheim. The biennial will also be the theme of a “playground of the future” that will be organized as a “virtual reality” experience for the exhibition. It will be staged in Shanghai and will include biennial artists from various backgrounds and locations.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that on Monday, April 6, it will hold an exhibition dedicated to the work of Minimalism, a Japanese modernism and avant-garde that seeks to minimize the presence of art in people’s homes. The show, “Minimalism” will feature work by forty-nine artists and will run for twelve weeks.The exhibition will include a short film by", "The next Biennial should be held at the Kunsthal Aarhus in Denmark in 2021, and the first exhibition at the Kunstmuseum Freiburg in 2021. “As the first museum to house such a huge collection of the most important works in the history of art, the pavilion at the Kunstmuseum Freiburg will be the ideal venue for the exhibition,” a museum spokesperson said. “The exhibition will be a combination of art and architecture, and will consist of the selected works at the Kunstmuseum Freiburg and will be organized as a project in which the artists participate as part of a collaborative process. The show will create a new global platform for the exhibition.”\n\n\nThe Metropolitan Museum of Art in New York has appointed Billy Nunn as its new deputy director and chief curator. Nunn, who has been serving as interim director since July 2019, will assume his responsibilities on September 11, 2020. He succeeds Christina Hengel, who was named curator of modern and contemporary art at the museum on July 19, 2019.Hoehn, who has helmed the Met since 2016, is stepping down from her post on August 22, 2020. She will become the inaugural director of", "The next Biennial should be, according to Guggenheim, ready in 2020. Its inaugural edition, in 2021, will be held in the city’s Marina Bay Sands.\n\n\nThe Bank of Developing Asia (BDA) and the State Bank of China (SBA) have announced a new $1.63 billion collaboration, announced in January, to advance the Baoji art movement in China. The initiative will bring together SBA and the China Academy of Art to collaborate on a series of exhibitions and resource-sharing projects to advance the art of developing countries, including China’s National Development and Museum (Nama), the Shanghai Museum of Art, and the Beijing Museum of Fine Arts.The partnership will be led by Claire Black, director of the Beijing Art Museum and curated by Charles Foster. The partnership will also involve a series of public lectures, curatorial exhibitions, and other activities that will examine contemporary issues and opportunities in Asia in a collaborative and interdisciplinary manner.“Building on the mutual admiration and collaboration established between the BDA and SBA, the BDA and the Shanghai Museum of Art will collaborate to reveal and organize an exhibition of the works of the great Chinese artist Kao-Yin Huang in 2020,�", "The next Biennial should be held in 2021.  In the meantime, the Biennial’s director, Toshio Omori, has issued a statement supporting the Biennial’s decision to postpone the event. “In the midst of this unprecedented crisis, I look forward to the 2018 Biennial and the 2019 Exhibition, which were created with the ultimate goal of creating a future for art, in which it is recognized as an essential link between people and the environment,” Omori said.  The prime minister also revealed that the 2019 Exhibition, entitled “Art and the Future,” will be moved to 2020, and that the biennial’s 2020 edition will be co-organized with the Japanese Association of Art Historians and the Japanese Council of Contemporary Art.  The upcoming exhibition will be housed in the Contemporary Art Museum Tokyo, which has been temporarily closed since March 29 because of the Covid-19 pandemic.“We are determined to see the new exhibition, ‘Art and the Future,’ in 2020,” Miyako Miki, the president and director of the Seven Shins, told Artnet News. “It is not normal to take a disaster", "The next Biennial should be organized in a way that will reflect the diversity of the exhibitions, the disciplines, and the people who have worked on them. It should also be a platform for young artists, artists of color, and artists from other continents.”The Mark G. Witten Foundation\u0097which recently announced it is planning to move from its current location in downtown Seattle to the Seattle Art Museum\u0097has also announced that it will moderately reduce the number of exhibitions it organizes by 20 percent by 2020. The foundation is protesting the move, which it says will hurt its artists, writers, and curators, as well as the region’s economy, and is also asking for a 20 percent cut in funding for arts and cultural organizations in 2020.“The Mark G. Witten Foundation has always been committed to giving back to the local community in Washington State and to making local arts happen,” Ekstrand said. “We’re still making good art, we’re still organizing events that draw people to the area, and we’re still growing the collection.”The foundation’s next major exhibition will be “The Waves,” which will be staged in the", "The next Biennial should be held in 2020 and will be the first full-length Biennial to span two cities, Helsinki and Kiasma. The theme of the event will be “Beyond the Cell,” a direct reference to Flemish painter Carl Stieglitz’s painting The Cell, 1949.\n\nThe Museum of the Modern Art (MoMA) in New York has announced that it plans to move the show “The Modern Exhibition” to the Museum of Modern Art in the Bronx. The institution has said it will continue to exhibit works by the six artists featured in the exhibition, which was curated by the half-dozen-member team of artist-lovers Jennifer Dröge, Rachael McAllister, and Julia Stiglitz, and will hold a discussion on contemporary art exhibitions in the fall of 2020.“The Modern Exhibition is one of the most important exhibitions of its kind, and it’s a show that the museum has never seen and never will see again,” said curator and curator of the show Jennifer Dröge. “The exhibition’s immersive narrative draws from the contemporary to present the work of artists who were most influential in our generation\u0097and", "The next Biennial should be a celebration of the life and work of the late Italian designer, Gio Ponti, who has been nearly universally acclaimed for his conceptual inventiveness, his mastery of materials and his ability to shape and transform his subjects—which often included the life and work of loved ones. Just as the tradition of the Italian artist has evolved over time, so has our vision for the future of the exhibition. As the exhibition has grown, so has our commitment to engaging with the very essence of the exhibition, for the first time ever incorporating a proper and curated re-creation of the exhibition in the instalment. We have been working with the designers to achieve this, and we hope that this will be the first time that the exhibition is truly reconceived. We are also excited about the first time the exhibition will be presented as part of the new museum’s new campus, the Palazzo Bernardo, with the exhibition taking place at a site that once served as a platform for the exhibition of Giotto’s work. The new exhibition will present the show “Alla Codice: Giotto’s Life and Works,” which will feature the work of forty-nine Italian artists in", "The next Biennial should take place in 2021. \n\n\nThe Somoza Foundation in Angola has received a gift of forty-eight artworks from the late philanthropist and activist Doris Somoza. The works come from the collection of the Somoza Family Foundation, which has been dedicated to supporting artists and their families in the country for more than twenty years.“The pieces in this collection are a reflection of Doris’ legacy and, as a result, are rare and precious,” said Elizabeth Stevenson, director of the Somoza Family Foundation. “The Somoza family have been instrumental in supporting the economic, educational, and cultural development of Angola, and we are privileged to have these works to pass on to our children and grandchildren. We are deeply indebted to the Somoza Family Foundation for their generosity in recognizing these works and for their ongoing support of arts and cultural initiatives in the country.”Born in 1960 in Bogotá, Brazil, Somoza studied at Duartó, Mendoza, and the University of São Paulo before leaving Brazil to study at the School of Art in New York. In 1983, she relocated to London, where she lived and worked during the next two years.", "The next Biennial should have a comprehensive programme of exhibitions, performances, lectures, talks, and residencies—with a particular focus on the history and theory of art in the twenty-first century. It should also be able to attract and engage a wide and diverse collection of artists, and should be able to help foster exchanges between Japan and Korea. The exhibition should be accompanied by a biennial catalogue, and “together with the exhibition, the exhibition, and the catalogues, the exhibition will become a permanent symbol of Japan’s and Korea’s development through the 20th century.”The Biennial of Contemporary Art (BAC), held in the city of Nagoya from January to March 2019, is the first of four planned. The other two—BAC Tokyo in October 2020 and BAC New York in March 2021—have already been canceled.The Tokyo government department of cultural affairs said: “The proposal for a new Biennial was made in order to focus on the theme of ‘various forms of art in the present. The theme reflects the fact that the BAC is a museum that remains committed to the general welfare, but also strives for a new kind of art.” It also stated that the", "The next Biennial should be held in 2021. \n\n\nThe Metropolitan Museum of Art in New York announced today that Edward Main, the Met's director of contemporary art, and Adrienne Edwards, the Met’s current curator of photography and film art, will serve as the next director of the institution. Their new roles were created to address the challenges posed by the pandemic, and are slated to begin in January 2021.“The Met’s current board and leadership team is committed to a robust and sustainable future for the museum,” said board chair Daniel H. Weiss. “Working collaboratively with the Met’s talented and dedicated staff, we are confident that our new roles will further the Met’s mission to be a championing of the creative and to develop new and innovative ways to share the museum’s collection and collections with the world.”The institution also announced that it is inaugurating a new series of exhibitions dedicated to black and African American artists. The inaugural show, “Black and African American Art in America,” will open on April 4. The second show, “Black and African American Art at the Met,” will open on February 28. The third show", "The next Biennial should be held by the Royal College of Art, London, in 2021. The event will be inaugurated by the return of the iconic painting from the Royal Goldsmiths, where it was installed in 1888, and will be followed by an exhibition of works by four artists, including Adrienne Kopf, who was commissioned to create a “new and improved” Goldsmiths painting, and Emily Hall, who created a “new sort of Goldsmith” painting. The Royal Academy of Arts, London, will stage a special exhibition of work by the artist Cézanne at the Contemporary Art Museum St. Louis in 2021. The exhibition will feature new works by Eric Fischl, Luis de la Osa, Thaddaeus Ropac, and Arsht, and will draw from contemporary research, art historical materials, and biennial scholars.The British Museum in London will stage the first UK–wide exhibition of the artist John Akomfrah’s works in 2021. The show will feature more than 300 works, including work at the artist’s home in London and at the Museum of Modern Art, New York. The exhibition is being organized by the British Museum and will run from February", "The next Biennial should be held in 2021, the same year that the seventh edition of the Venice Architecture Biennale will take place. The third edition, held in Biennale Park, will be held in 2023.Park Art Museum and Gardens, the British art center located in the West End of London, has established a new $120,000 Grant for art historian Will Self’s forthcoming exhibition “Art is Not a Nation: American Art and the Politics of Difference” at the museum. While the show is a follow-up to “Dilema,” Self’s first exhibition at the institution, titled “Postwar,” will focus on the post-war US state of art. The exhibition will be staged at the U.S. Embassy in Rome and will run from March 21 through March 23. The Grantee will be awarded $56,000. Self will receive an additional $6,000 for developing and presenting a public work.  The first round of grants spent $2.5 million and were awarded in November and December 2016. The second round, which was announced last week, was announced last week", "The next Biennial should be held within the next six months.”The biennial’s founding committee includes authors Robert Witte, Joachim Fischl, and Arne Gusen; artists Wolfgang Gross and Erich Heckel; and designers Klaus Häger, Ursula von Rydingsvard, and Wolfgang Mutter. A selection of the exhibition’s works will be presented to the public's letters, and the Biennale will finally return to the German city of Herrenhausen in December.\n\n\nThe Pulitzer Prize–winning artist and activist Israel Shahak has been chosen to represent the United States at the upcoming Venice Biennale. Shahak, a Brooklyn-based, multi-disciplinary artist whose colorful practice includes painting, sculpture, and installation, will be presented with a four-year award that will honor his “creative leadership and pioneering work.” Shahak’s work will be included in a special exhibition that will take up the themes of “The City and the State,” the exhibition’s fifth section, and the exhibition’s theme of “the midwest.”The artist-politician will receive the $50,000 prize for his", "The next Biennial should be in 2020, the Art Newspaper reports. The organisation will also aim to create a new exhibition dedicated to the Venezuelan artist and producer, Alice Fernando, and will create a new event series dedicated to the Brazilian artist and choreographer, Nara Valdés, who will be featured in the exhibition “Contiõncias de Venezuela” (Contemporary Perspectives on Venezuela).Venezuela’s president, Nicolás Maduro, has been accused of criminal collusion and abuse of power in relation to the ousting of his predecessor, Henrique Capriles, in February 2019. As a result, United States District Court Judge David Hale, Jr., in Southern District of New York has granted the government a temporary injunction preventing the seizure of assets from the estate of Luis Alÿs, a Cuban American who was murdered in the Bronx in February 2018 by his ex-wife, María Berrada. The judge issued the temporary restraining order so that the government could move toward seizing the couple’s home in March.According to the New York Times, the government filed a lawsuit against Alÿs’s estate in the United States District Court in Manhattan on January 21, 2020, but the case", "The next Biennial should be held sometime in the next two years. \nThe Biennial will also be commemorated by three biennial exhibitions: Resurrecting an American Biennial, which will highlight the contributions of American artists in the twentieth century; The Biennial of Modern Art, which will show a selection of contemporary artists; and Art & Life in the 1980s, which will open in 2017. \n\n\nThe Museum of Fine Arts (MFA) in Boston is revamping its current exhibition, “Fourteen Contemporary Artists,” a virtual exhibition that was staged by the museum every other year since 1998. The revamp is part of a larger effort to modernize the museum and modernize the world it inhabits. “After a thorough and careful search of our history, we have decided to abandon the pre-determined format of the exhibition and make a new and better exhibition,” said director Alison Young. “The new structure will involve more frequent performances and will invite us to engage more with our audience through virtual experiences.”The changes will also introduce new opportunities for cultural exchange. Previously, the exhibition was limited to visiting artists who were twenty-five years old or younger. The new iteration will", "The next Biennial should be held in 2022. The Biennial of African Art, held in San Francisco in the fall of 2018, was cancelled after the city received an order from the US District Court for the District of Columbia–Delaware, which ordered the evacuation of the region. Artnews reports that the upcoming edition of the event will be staged at the Museum of Modern Art, where it will be hosted by the court. The official selection of the twenty-six artists selected by the court will be announced in January.\n\n\nArt historian and curator Virginia Woolf, the American who famously said: “The paint is so thin ‘it can scarcely be painted at all,” died on December 6 at her home in New York at age seventy-three. Born in New York City in 1932, Woolf studied under and at the time worked with Rodin. Her drawings, paintings, and sculptures are widely studied and have been exhibited at numerous institutions. In 1977, Woolf became the first American artist to be awarded the Prix de l'Oréal, the French equivalent of the Oscar. That same year, she received the National Medal of Arts. Woolf was born in New York in 1932. Her family moved to", "The next Biennial should be held at the High Museum of Art in Lisbon in 2022 and will be hosted by the Museu de Arte Contemporânea in Lisbon. Museums in Portugal have been selected to hold tenennial exhibitions in the future.\n\n\nThe Museum of Modern Art (MoMA) in New York has released the list of seventy-eight artists who are participating in the twenty-fifth edition of the Museum Art in the Age of Resistance (MASTER), which will take place at the institution from April 11 to April 18, 2021. The exhibition will examine the impact that artworks and other works of art, including drawings, photographs, prints, films, and videos, and installations, have on people and will feature work by seventy-nine artists, including Anselm Kiefer, Amara Bouhami, Ariel Castro, David H. Koch, Pia Camil, Gustavo Dudamel, Iris Frank, Kiki Smith, Nari Ward, and Adam Pendleton.The ninety-sixth edition of the Museum Art in the Age of Resistance is already underway and will be held at M Woods from April 11 to April 13, 2021. “Artists in Disarray: Artists of Color in the 1960s�", "The next Biennial should focus on how the art of the twentieth century was created and managed: the ’70s and ’80s. It will also include the play The Love of Numbers, a performance series that takes its title from a poem by Albert Einstein, and an exhibition of work by contemporary artists. The show’s first iteration will take place in the Swiss city of Basel on March 23–March 29.\n\n\nThe Museum of Modern Art (MoMA) in New York has unveiled its 2020 lineup, which features works by eighty-three artists from twenty-nine countries and territories. Among the artists chosen for the inaugural exhibition, entitled “The Art of Time,” are Yinka Shonibare, Danh Vo, Amanda Ross-Ho, Lin-Manuel Miranda, and Charles Dance. The five-decade retrospective will also feature work by artworks that have been displaced by climate change, including the work of the Subatomic Explosion, a work by the Indonesian artist Leila Aluko, which she created in the belly of a whale, and a work by the Dutch artist Jan-Alice van Driel, which she performed in a theater in the Netherlands.In the eight-year retrospective, which premiered at", "The next Biennial should take place in Helsinki, in 2022. In the meantime, the institution will continue to operate under the grant agreement. The biennial will be hosted at the Museum of Modern Art (MoMA), and the museum will present the exhibition “Tacita Dean: On the Window . . .” “We are grateful for the support of the Metropolitan Museum of Art and MoMA, as well as of the Metropolitan Museum of Art and the University of Chicago, and we look forward to demonstrating this extraordinary collection in the upcoming exhibition ‘The Document Gallery.”\n\n\nThe Christie’s International Art Sales in New York have announced that they are laying off nearly 1,400 employees. According to the New York Times, the layoffs were part of a restructuring plan enacted by the auction house in an attempt to reduce expenses as it restructured its business. The company hopes to reduce its work force by 25 percent by 2020 and expects to continue shedding workers as part of the restructuring plan.In a letter addressed to employees sent on April 8, Christie’s executives wrote: “We believe that a significant reduction in the number of employees is the best way to reduce costs and achieve cost-effective growth in a challenging and", "The next Biennial should be held in 2020. For the past couple of years, the site where the triennial’s first exhibition was staged–in the former Exhibition Hall of the Royal Academy of Arts in London in 1971 and in the temporary venue of the Museum of Modern Art in New York in 1988–has been a gathering place for contemporary and international art. The forthcoming exhibition will be a return to the city, the US, and the city of Venice, as well as a creative experiment in how art, architecture, and design can be implemented in a city. The exhibition will also feature a number of new works by Léonidea Pindell and Sabine Hinds, alongside works from the exhibition “The Future Is New,” which was staged in 2010.“The biennial will follow the artist’s travels from the United States to the UK. It will take place at the Contemporary Art Museum St. Ives in London. The exhibition will also focus on the changing face of art and architecture, and its relationship to contemporary life in London.”The artists chosen to represent the biennial include:Abbie Adams-AdairAbby AndersonA-Cara BarlowA-Cara BloodworthA-", "The next Biennial should take place at the museum in 2021. This version of the exhibition will be accompanied by a new exhibition of work by the same artist\u0097as well as a series of interviews with leading contemporary artists.\n\n\nFrieze announced today that it has created two new positions in its creative team. The first is an executive producer and the second is a director. The positions were created to help accelerate the production of the organization’s upcoming exhibition, “The Fashion Image of Egypt.”The news release announcing the appointments reads, in part: “The new responsibilities presented by Frieze are unprecedented. The project of ‘The Fashion Image of Egypt’ is an extension of an ongoing exploration into how fashion can be relevant to the contemporary world. In doing this we have had the opportunity to create some of the most realistic and compelling virtual worlds around fashion in recent decades. Our collective vision has been to create a new way to approach the exhibition and the fashion industry. We are incredibly excited to work with our artists and designers, our audience, and the creative community to realize our vision.”The new positions are executive producer and curator, and director. “I’m thrilled and inspired to collaborate with", "The next Biennial should include the commission of a new work by a solo artist and a symposium on the upcoming festival.It is planned that the next exhibition will be staged at the Punta de Oro Art Museum in Madrid and that the number of participating works will be increased to fourteen.The exhibition will feature work by the artists featured in the previous Biennials: Andrea Campins, Celeste Cipolletta, Raimond Prestiss, featured artist Naima J. Dikshit, László Plzková, Nina Pozo, and María Bustica. \n\n\nThe Solomon R. Guggenheim Museum in New York announced on Wednesday that it received a gift of eight rare works from the collection of the late Israeli-American financier Arad Karayev, the founder and owner of the international financial services company Aviara Financial Group, which Karayev’s nephew, Adnan Martir, is accused of illegally siphoning money from the family’s $2 billion Punta de Oro estate.The museum received the works from an anonymous donor in Israel in 2017, and the wealthy couple are currently trying to secure the", "The next Biennial should be held in 2019, with a new edition to be staged in 2021. The twenty-first Biennial was held in 2019, and will be held at a new venue each year. The twenty-third Biennial will be held in 2020, and the twenty-fourth Biennial will be held in 2021.\n\n\nThe New York Times has published an article by journalist and scholar Timothy Garton Ash on the state of contemporary art and artmaking in the twenty-first century. The article describes how the art world is facing several key disruptions and how these disruptions will affect not only the artmaking process, but also the cultural ecosystem as a whole.Ash draws attention to a number of recent trends, such as the rise of the digital age and the shift from print to digital media, as well as the growing pains that artists are experiencing as they try to reconcile their artmaking careers with their personal lives. He also examines the future of artistic production and its relationship to the natural environment, and concludes that the future of art is uncertain.Ash concludes: “The art world is facing a period of profound change. I’m optimistic that artmakers and art collectors and art collectors’ audiences will be able to support each other and", "The next Biennial should be held in the city in December 2021. \n\n\nThe Art Newspaper is now reporting that the Venice Architecture Biennial is now set to open in the Mediterranean city of Venice in February 2022. The exhibition, which will be held in the city of Venice from March 22 to March 24, will bring together seventy-five works by forty artists from forty countries. The exhibition’s first exhibition, “This Is Not an Airport,” will be staged at the Venice Art Museum in March 2022. The show is slated to run until May. “Istanbul’s Art of the Party” has also been set to open at the Stedelijk Museum in Amsterdam in April 2020.\n\n\nThe National Gallery in London has received a $100,000 donation from the Charles and Lucille King Family Foundation. The gift, which was made in recognition of the philanthropic efforts of the king family to design and implement innovative programs to advance the arts, will support the development of the center’s new partnership with the Office for National Statistics.The foundation, founded by King Sr. and Empress Dowager Elizabeth of England (1886–1973), was established in 1977 by the King and his wife,", "The next Biennial should take place at the Udmurta Research Centre in Bangalore and will be organized by the Kunsthalle Basel, the Swiss Federal Institute of Technology in Sich, Switzerland, and the prestigious Art History Museum Zurich, Switzerland. The twenty-eighth edition of the show will kick off in December 2020.The exhibition will also be centered around the themes of: A World Without Affection, the Sublime, the Effervescent, and the Moving Image. The art of installation will be explored through a series of virtual reality installations created by the Udo Kittelmann Foundation in Berlin.Art historian Aparicio Noxema, who curated the exhibition, said: “The ongoing work of the young artists in India is a source of inspiration for us all. The new work in the exhibition will ask hard questions about how we might reflect on our existence in the virtual world and how this reflection can play a part in creating a new kind of world, one that is more connected, more harmonious, and more interconnected.”Kathy Littman, a curator at the Kunsthalle Basel, said: “The exhibition ‘In the Presence of Newness’ provides a compelling picture of the evolving relationship between", "The next Biennial should focus on community engagement and on engaging with local communities. These themes are mirrored in the upcoming twenty-third edition, which will take place in Manchester, the birthplace of Winston Churchill, in December 2021. The biennial will also explore how art and design can enhance the lives of communities across Greater Manchester and connect people, communities and the city. When the biennial was announced, the exhibition was considered by some to be divisive and at odds with the theme of the biennial. Organisers have since stated that they were not intending to offend but were concerned about the wording of the statement, which is a reference to the city’s continuing reliance on fossil fuels.“The past two years have been about working with artists and communities to try to understand how we can be active participants in shaping the future,” said Bristol-based artist Shona Cooper. “We hope that this exhibition will help us make the most of our time in Manchester and help us think about what happens when we stop being active participants in shaping the future.” The exhibition, titled Blueprint for Change, was curated by Christopher Wool and Kate White and will be on view in conjunction with the biennial’s seventy-fifth edition, which", "The next Biennial should be a response to the current crisis, and should reflect the spirit of cooperation between the countries. The organizers will write to the participants of the first exhibition to determine the theme of the next edition. The next Art nachos were pulled from the streets of Mexico City and are currently being stored in the collections of the cities of Ciudad Juarez and Mexico City.The 2018 edition featured work by more than fifty artists, including Domingos Pérez-Montalvo, Camila Pérez-Montalvo, Turin Occhi, and and the Philadelphia-based artist Scott Momofuku. The exhibition was curated and led by Marcelo César-Galvez, the founder of the New York–based agency . . .Carcara Banos, the director of Queens Museum’s Center for Women Artists, said: “The artists who have participated in this year’s exhibition are recognized and celebrated for their tireless efforts to advance human rights and the fundamental tenets of creativity. We are thrilled that . . . will present the exhibition again with a new and exciting exhibition of work by a talented new group of artists. It is a pleasure and a privilege to present this work by", "The next Biennial should be held at a time and place when the art of Palestine is fresh and new, and when the art of Palestine is of the sustainability and relevance that Palestine deserves. ‘The future of Palestine is already within our grasp. We are only in the beginning stages of this project, and it will take many years for a full and concrete analysis of the art of Palestine to be established.”The committee said: “This is an unprecedented challenge for the local committee of the Baha'i Faith, but we will succeed and find ways to accelerate the work of the national committee of the Baha'i Faith. We encourage all young people and all who desire to advance our work in advocating for the art of Palestine to be recognized by the international community and to participate in the deliberations which will lead to a final decision.”The Baha'i National Council said: “The Baha'i National Council is extremely pleased with the committee’s decision to recognize the Baha'i National Museum in Jerusalem as a Permanent Residence of the Baha'i Faith. The committee’s decision recognizes the museum’s history of activism and provides an opportunity for the public to experience the museum’s collections", "The next Biennial should be held at the Museum in Berlin in the summer of 2021. \n\n\nA group of artists and collectors who are survivors of the devastating fire that broke out in an Ingolstadt apartment building in March 2019 has teamed up to launch a fund that will return artworks and other objects that were damaged or destroyed in the inferno.The fund, which was launched by the artists as a reward for their bravery in testifying to the will of the city of Ingolstadt, is being organized by the blogger Øyhe Andersson and his wife, Anna; the artist Tobias Knausgaard; and foreign artist Reem Malek, whose work was featured in the upcoming documentary film Theater of Operations: The Gulf Wars 1991–2011 (Kana2/WADA/WADA), which is scheduled to open at the museum in September.“After a year of organizing, writing about, and exhibiting our work, we are proud to present our first initiative to the public,” Andersson and Knausgaard said in a joint statement. “The development of the fund was the occasion for us to reflect on the relationship between the artist and his city, Ingolstadt. We hope that this initiative will stimulate", "The next Biennial should be on December 21st, and the first will be on January 17th. The Biennial will be hosted by the University of Bologna, where the artists and designers behind the most recent works by the ​Hartmann, ​Alberto Bonisoli, and ​Manifesta​ series are based, and will take place in Medio Arti, an old factory in Florence that is now being transformed into a center for residency in photography.Nadia Pascual, Art+ (Italy), and Contenta (Spain), which was founded by Bruno Beck, a former curator of contemporary art at the Museum of Modern Art in New York, have announced they will collaborate in the revival of their country’s cultural sector. Pascual will collaborate with the PIT, a nonprofit arts organization established in 2007 to promote the work of artists and designers in the developing world, as well as with the Artists’ Front, a group whose members include Málida Stier, Julián Garcia, and Toderna Barba. Speaking on the forthcoming exhibition, which will focus on creating spaces for artists to gather and collaborate, Pascual said: “The", "The next Biennial should be titled “The Future Is Present: From Crisis to Hope” and will draw from the current political climate and plot to assess the impact of environmental disasters and the spread of climate change. The venue will be a former Soviet military base located in the foothills of the Caspian Sea, in the city of Kars, in central Russia. “The biennial will be a meeting place for everyone who has a passion for art, artists, design, architecture, history, culture, science, and the environment,” said Yuri Zhdanov, the director of the State Museum of Fine Arts in Saint Petersburg. \n\n\nAs New York City heads into Phase 4 of its reopening plan, Governor Andrew Cuomo announced that the state will open with a major public art installation, the first of its kind in the United States, expected to take place sometime between July and November 2021. “We are preparing for a future of increased congestion, more crowded cities, and more people moving into cities,” Cuomo said at a press conference. “That’s why we are rebuilding our public art, and rebuilding our public art that reflects New Yorkers values and which makes our city special.”The construction", "The next Biennial should take place in 2021.\n\n\nHirshhorn Museum and Sculpture Garden in Washington, DC, announced today that it will create six new Fellowships for artists and art historians—each a step in the process of being offered a professorship at the Hirshhorn. The annual fellowships, which were established in 2004 to improve the museum’s art history program, have drawn students from across the country for more than twenty years.The Hirshhorn’s annual Fellowships have provided major financial support to some of the museum’s most significant artists for over twenty years. Nancy Lanza, a former principal curator of Modern Art who was awarded the $50,000 Hirshhorn’s William Daviert-Bilger Fellowship in 2018, said: “I’m thrilled to be a Hirshhorn Fellow. I’m looking forward to bringing art history to the audience in Washington, DC, and to incubating new ideas.”The Hirshhorn’s 2016–17 fiscal year, which ended on March 31, ran from June 1, 2016 to June 29, 2017. The museum’s previous biennial, the 2017–", "The next Biennial should be held in the summer of 2022. The Biennial of Contemporary Art will be held in the autumn of 2022 and will be organized in cooperation with the National Museum and Art.”The ten artists who are participating in the 2020 event, which is jointly curated by the Museum of Modern Art and the Painter’s Institute in Houston, Texas, are: Germán Campos (Milan), Elaïza Cesarco (Netherlands), Igor Rosa (Spain), Nadine Schilt (Germany), Johanna Soto (Brazil), Peter van Herk, Laura Owens, and Peter Zumthor (Germany), and Aaron Watson (USA). The theme of the 2018 event was “Culture and the Body: A Contemporary Experience.”\n\n\nThe National Gallery of Art in Washington, DC, is planning to shutter its doors on March 31, following more than a decade of operations that have been dogged by a series of setbacks and cost overruns, and has created a $100 million surplus in its current inventory. The move, which has been made in anticipation of a $500 million decline in revenue in 2020, has prompted several lawmakers to demand that the ", "The next Biennial should be held in Venice in 2022. The institution will receive $25 million from the Kensington Estate. Its board chairman, Mohamed El-Khoury, said: “We are all very proud to have this project completed. We had hoped for eleven years to raise the funds, to create a platform for artists from Algeria, Lebanon, Morocco, Tunisia, Yemen, and the Philippines. However, we were unsuccessful. The Kensington Estate Foundation is now able to take the winning award to the artists.”The Biennales, which were originally scheduled to run from June to September, have been rescheduled for September 10–September 12. The 2019 edition, titled The Biblios, was moved to September 2–September 4. The 2018 edition, titled “Tito & Marcella,” was moved to September 4–September 7. The 2017 edition, titled “Amaropa,” was moved to September 3–September 5.The biennial will be curated by Ahmed Saad, who has helmed the exhibition since its inception in 2012. Saad will take over the helm of the event from Larissa A. Akram, who has served as the ", "The next Biennial should be in May 2020, and will aim to present the work of thirty artists, including the Czech artist A. J. Zalewski and the German artist Janina Schlegel. The event will also invite the public to experience works by artists chosen by the city of New York through a public-private initiative called the Arts for NYC partnership. The pavilion will be located in the former Bromley Street address of Joseph P. Oehler, the late owner of Laschmidt Wegmann, and will host the first exhibition of work by the artist-in-residence, the artist and art historian Anna Atkins-Blagdon, and will be inaugurated by artist Jane Sargent.\n\n\nIn the interest of transparency, we have decided to separate Tania Bruguera and Pierluigi Battista, the co-owners of the Italian artist-in-residence, from the maintenance of an open-air, post-War museum dedicated to the artist-in-residence. When the museum was under construction in 2006, the two connected with the initiative, Forma, to create a new public space dedicated to the artist-in-residence. The institution opened in 2006 and was", "The next Biennial should take place in 2021 and will mark the milestone. The American artist’s recent show in New York, “Exhibit A: American Art 1920–1945” (from the new and revitalized Museum of Art), is an inspiration for others who are inspired by such a narrative. After returning from his American tour, Lambert returned to the United States and began work on “The Abode of the World,” the first exhibition he ever organized. The exhibition comprised sculptures by Lambert, John Cooper, Charles Eames, and Frank Gehry and was held at the Museum of Modern Art (MoMA) in New York from 1993 to 1997.Its exhibition in the United Kingdom in 1998, “The Abode of the Party,” encapsulated the essence of American art: the avant-garde, often experimental, often playful, often surreal, and always in opposition to everything we thought we knew. “The Abode of the World” opened at the Tate Britain in London in 2001 and is currently on display at the Museum of Modern Art. “It was not until I had the opportunity to present this work at MoMA that I realized how much it meant to all those who have agreed", "The next Biennial should be held in 2022.“The museum was founded in 1947 by a group of American artists, including Robert Irwin, John Oehlen, and Jack and Larry Baer, and was relocated to its present home in 1970, when the museum was still a group of thirteen artists, including Jack and Larry Baer, and a handful of other avant-garde New York artists, including Richard Diebenkorn, Richard Diebenkorn Jr., and John Heyman,” said curator Frank Bainbridge. “The expansion of the museum over the years has relied almost entirely on donations, and I believe that now more than ever it is the object of museum-wide support. We are grateful to all who have participated in the last twelve years, and expect many more to come.”The September 2019 issue of Artforum—which was edited by Kate Fowle—features the first in a series of five biennials that will be presented by the artists in the coming years. The biennial’s theme, “The Modern Life in Art,” will be revealed on August 8.For the biennials, artist names will be asked to open with a question mark and the", "The next Biennial should take place at the Museum of Modern Art, New York, in 2021.\n\n\nThe Royal Academy of Arts (RA) in London announced today that the institution is working with the National Loteries and is preparing to launch a new platform dedicated to the arts. Biennial organizers will distribute the digital version of the exhibition, titled Our Place, to the participating participating artists in the biennial’s second edition—which will open in September 2020—as early as September 21.The platform will also include the first-ever online Royal Academy of Arts (RA) concerts, which will be held on the new site at the end of September. The first concert will be on October 4, 2020, and will be followed by and a second concert on October 9, 2020, and a third concert on October 13, 2020, and on October 16, 2020, respectively.The digital exhibition will feature 358 artists represented by fifty-four organizations. The artists selected for the biennial are Anella Bara, Babak Allam, Arash Fayez, Jumana Boggs, Joma Keshav, Naila Shani, Yuki Sadao, and Zoya Sarkis.\n\n\nThe museum"]