["The next Biennial should take place in 2021, according to the organizers. In the meantime, the festival will continue to host talks and other events.\n\n\nThe Theatrical Society of London (TSL) and the National Poetry Library (NPL) have teamed up to create a new digital platform that will digitize the holdings of the two institutions. The platform is called the National Reference Centre for UK Poetry (NRCUK), and will consist of a series of online collections, each with a specific theme, that will be organized by author and date. The NRCUK Digital Library will be accessible to the public from May 27 to May 31, 2020, and will contain 1,530,000 works. “The National Poetry Library is a world-class collection of some two hundred thousand works, including works of rare and global importance, and will form the basis of our future strategy for the collection of poetry and other creative materials,” said Sue Black, chair of both institutions. “It is vital that more people have access to the collections, and that they can benefit from the research and research projects that can be carried out with the collection. With the creation of the National Reference Centre for UK Poetry,", "The next Biennial should be on the island of Madeira in the Bay of Portugal, which was recently chosen for its curatorial talents by the Portuguese government. According to the Art Newspaper, the project will comprise three subjects: the Indigenous Body, the Body in the Media, and the Body in the Land, with two art installations. The announcement of the first exhibition was made by Vincent van Dyck and Jacques Anneke, the directors of the Biennial.Artforum spoke with Van Dyck and Anneke about the initiative and what the new theme will entail, as well as about the themes of the past two years of their lives. We also asked them about the challenges they have faced in collaborating on a Biennial and the creative process. Van Dyck said: We needed to create an ideal situation to begin with where we could engage in dialogue with the local community. The idea came from the biological world, as we had some experience with plants and animals. We wanted to explore the role of the body in the environment and in life and to make it relevant for contemporary life. The work of the Biennials has been an inspiration in every way. The idea is to create something that is new and adventurous, something that is dynam", "The next Biennial should be held in the spring of 2020. Dr. Currier, who previously worked for the Alzheimer's Disease Society and is now a professor of medicine at the University of California, San Francisco, said: “We are currently working with our network and with the communities in Hawaii, California, and the Bay Area to make sure the Hawaii pavilion is at least a year ahead of the 2020 event. We hope to have a new exhibition dedicated to the Hawaiian Islands in 2020.”\n\n\nArtist-run venues in New York and Los Angeles are now facing new federal regulations that require them to comply with tighter social distancing guidelines than those set by the states. The move by the government follows a wave of victories for artists and arts workers across the country as they launched legal actions against industries that violate their rights by excluding them from public spaces.On Tuesday, the Department of Education and Education Welfare Services (EDWS), which administers New York City’s Common Core State Standards, announced new guidelines for arts and culture programs that are being implemented by local, regional, and state school districts. The guidelines state that “school districts’ responsibility for arts and culture is to ensure that the physical environment of their schools is free from", "The next Biennial should be held in 2021, and the next Biennial in 2022. The new twenty-first-century edition of the Artforum, which will be hosted in Los Angeles in the spring of 2021, will feature the work of seventy-one artists and collectives.\n\n\nThe Lisson Gallery in New York has announced that it has received a gift of forty artworks\u0097all works by artists who have passed away in the last sixty-eight years. The fourteenth edition of the Lisson Art Talks series will run in the spring of 2022.The gift, which was made in honor of the forty-fiveth anniversary of the Lisson Gallery, also includes the works of Alexander Calder, Alexander Calderón, Wolfgang Lügenher, Alberto Navarro, Tomás Fabiani, Alexandra Ponce, and Fernando J. Garcia. The biennial’s artists are Alex Kopp (1953–1956), Cahna (1955–1956), Alan Aldous (1956–1962), Alfred A. Noyes (1946–1964), Alan Parsons (1948–1974), Alfred W. Koons (", "The next Biennial should focus on “regional Palestinian communities and their needs and desires,” said Amira Abou-Rahme, the organizing committee chairman, to the Art Newspaper. The event will be inaugurated with a lecture on the history of the Palestinian diaspora.“We will continue to push for real progress by the Palestinian people. We hope that the next Biennial will become a source of inspiration for Palestinians and inspire them to continue their work,” Abou-Rahme said. The inaugural exhibition will be curated by Khaled al-Asad, the director of the Baha’i American Museum in Jerusalem and a former head of the Palestine Museum in the West Bank. The exhibition will showcase works by thirty-eight Palestinian artists, including Qusay (Jerusalem), Ibraheem (Nablus), Ghada Serra (Nablus), and Khaled al-Asad (Jerusalem). Projects that will be presented in the exhibition include “Arafat Baghramian and the Problem of Architecture,” a survey of Palestinian artworks; “The Palestinian Disappearance: Art and the Middle East” (Nablus and Bethlehem), a show about Palestinian artists", "The next Biennial should take place in the autumn of 2021. \n\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Jason Kander as its new deputy director and chief curator. He will be responsible for managing the curatorial and artistic departments of the museum, which has a current staff of twenty-seven. Kander, who previously served as curator of modern art at the Brooklyn Museum, will assume his responsibilities in January. He succeeds Gerald Searle, who was appointed as interim director of curatorial affairs in January 2019, and will assume his responsibilities in January 2021.“Jason brings a wealth of experience and knowledge in contemporary art to MoMA,” said museum director John Lasseter. “His dedication, enthusiasm, and intelligence in bringing our contemporary curatorial vision to life, collaborating with the museum’s talented and dedicated team, and cultivating our collection, exhibit, and exhibition program has been instrumental in the museum’s move to new buildings, and he has been instrumental in enhancing the museum’s reputation and reputation among the art world.”Kander’s appointment was made possible through a five-year, $27 million grant from the Nathan Cummings Foundation. The gift also includes $", "The next Biennial should focus on local, regional, and national issues, both within the city and beyond the city, and provide an international forum for public dialogue. A public design should include access to innovative and challenging ideas through a variety of project forms, as well as a space to enjoy the beauty of the city and the surrounding region. The city’s design center will also be expanded as part of the revitalization of the city’s historic RCA buildings, including the Cultural Centre and the Richard I. Birkenhead Collection.“I’m looking forward to continuing to work with the City of Detroit to improve the lives of our residents, and to connecting with you in the city,” said Richard. “As always, the City of Detroit is a strong partner in the development of the new Biennial. We appreciate all of our contributions to the theme of the year and look forward to welcoming you back next year.”\n\n\nThe Pennsylvania Academy of the Fine Arts (PAFA), the prestigious arts school founded in Philadelphia in 1917, has appointed Paul Di Iuzzani as its next executive director. Di Iuzzani will be responsible for advancing the school’s goals and objectives and for developing partnerships with", "The next Biennial should aim to support upmarket galleries and promote contemporary artists and exhibitions, and will focus on the local and international exhibition community. With the departure of the first, the Biennial for Contemporary Art aims to return to the curatorial experience of the gallery to help advance the careers of young and established artists in the area. The fourth iteration of the Biennial for Architecture will take place in the city of Barcelona, with the first exhibition, the biennial’s “Submission to the Gods,” taking place in the city of Granada in January 2020. The first edition of the Biennial for Peace, which was held in the city of Fortiÿs in December 2017, was a success. It garnered more than three hundred visitors and showcased a selection of works by ninety contemporary artists, including Yayoi Kusama, Ariel Zambesi, and Warren Kanders. The 2019 edition of the Biennial for Art was moved to the Santa Fe Institute in New Mexico, where it is currently housed. The biennial will resume with the eighth edition of the event, “The Architecture of Destruction,” in October 2020.\n\n\nThe Museum of Fine Arts (MFA) in Boston has received a $", "The next Biennial should be held in 2022. The first exhibition, Diana Al-Hadid: The Arabian Nights, opened at the London Biennial in 2021. \n\n\n\n\n\nThe Arizona Historical Society (AHS) has launched a new initiative, Arizona: A Historical Guide, which aims to teach history through the lens of contemporary art. The first comprehensive exhibition of the art form, titled Arizona: The Half-Century Project (2019), will open in January 2020 and run through March 2020.The program will feature more than 250 works by artists ranging from Amanda Ross and Vito Acconci, who both lived in the desert, to David Goldblatt and his desert-themed museum in Arizona, to andrayabaloo and the city of Phoenix, to andrea cabana, a Mexican American apothecary who created work depicting historical figures such as General Francisco Estrada and Native American deities.Parker Pendergrast, the curator and artistic director of AHS, said that the initiative was born out of the need to analyze and explain the history of art through the lens of art. “We wanted to use art as a tool to help people understand the world around them.” P", "The next Biennial should be held at the Institut de l'Art et de l'histoire in Paris in 2022. The project will be led by the contemporary art curator Bruno Latour, who has previously worked as a curator at the Musée d’Art et de l’Haiti, the Museum d’Art et de l’Allemagne, and the Centre Pompidou in Paris.Latour will present a selection of works by the newly established institution of “Art Histoires d’Arles” at a venue currently under construction in Arles, France. This museum will house the collections of the two leading French museums, the Musée du Palais in Paris and the Musée d’Art et de l’Haiti. The museum will also include a major exhibition of work by three new acquisitions, a biennial of photography by the French director Christophe Bem and a new collection of works by the Bechdel DiMare, the Italian artist and designer who expanded the notion of an exhibition as opposed to a single work.The new institution of biennial will be housed in a building designed by a team led by architect Arne Glimcher in", "The next Biennial should be a celebration of the life and work of one of the most influential artists of the twentieth century and should take place at one of the most important locations in the city: the Museo de las Culturas, in San Andrés, Mexico City. “The Museo de las Culturas is an extraordinary institution, rich in history, with an extraordinary collection, and was founded by a group of artists in a partnership with the city of San Andrés, with the support of the city of Mexico City, is represented by the city of Mexico City, the Museo de las Culturas, and the city of Mexico City’s mayor, José Vicente Toledo.”Among the authors who will be included in the next edition of the Art of the Americas, which will be held in early 2021, is a selection of works by the following artists:El Paso Latinoamericano - Jorge Enrique CésarPerez GarcíaMignán HernándezHernández-Villarreal, Mexico and Pena NietoGallery, MexicoCity, MexicoMunicipality of MexicoCity, MexicoMunicipal of MexicoCity, Mexico and MexicoMiracel, MexicoJorge Luis Borges", "The next Biennial should focus on the art of the city, the body, and the mind. We cannot be complacent or blindsided by the future. ‘The New York Museum of Modern Art—’s fifth—is a unique institution in that it was founded by and for the city. We would like to see more engagement with our city, the city’s rich history, and the city’s future, particularly with an eye to its future residents.”The five shortlisted artists who will receive a one-time grant of $10,000 are: Carlova Alvarez, Mexico City; Frank Gehry & Daniel H. Weinberger, New York; Eduardo de la Fuente, San Francisco; Renzo Piano, New York; and Josef Alberts, Berlin.\n\n\nCanadian artist, writer, and educator Robert-Thomas Bavin, whose iconoclastic, politically and socially engaged art was a product of the 1960s counterculture and a pioneering proponent of Canadian contemporary art, has died at age eighty-seven. He was born in Ottawa, Canada, in 1966 and raised in Toronto, where he studied at the University of Toronto, New York University, the University of British", "The next Biennial should take place at the São Paulo Centro de Cultura Internacional, in the city of São Paulo, Brazil, in the autumn of 2021. The exhibition, titled “The Culture of Humanism”, will feature the work of new and established artists, including Mira Cipolletta, and will be curated by João Miro and Milenio Martins, the director of the São Paulo Centro de Cultura Internacional, and Christian Wöstler, the artistic director of the Museum of Modern Art (MoMA).“The project team is very ambitious and has identified many themes from art history and philosophy, and from artists and their practice, to the ecology of art and its relationship to the universe,” Martins told the Art Newspaper. “We are very pleased to be able to contribute now to this project, as it is the perfect time to celebrate the history of the art of our time with exceptional artists.”The Biennial’s first iteration, “The Culture of Life” (2019), was held at the Museu de Arte de São Paulo, and its second was held at the Museu de Arte do", "The next Biennial should be held in February 2020. \n\n\nThe Los Angeles County Museum of Art (LACMA) has received a donation of $8 million from the estate of Richard and Paul Noyce, the coowners of the Noyces-Kuhl—Pieper and Pieper, a manufacturer of women’s underwear—following a years-long campaign. The gift will be used to create more than sixty new works by the couple, including twelve works by Lucie and Paul Noyce, the founder of the Noyces-Kuhl line.The gift was made in honor of the Noyces’ generous leadership in the arts, and came as a result of a $5 million gift in honor of Paul Noyce, who died earlier this month at the age of eighty-six. The gift includes artworks by Richard Noyce, Mr. Noyce, the former chief curator of art at the Los Angeles County Museum of Art (LACMA), as well as a selection of photographs by Lucie and Paul Noyce.“The Noyces’ generosity and vision has made them central to the LA County Arts and Culture and to the greater LA community", "The next Biennial should be staged in the United Arab Emirates in 2020. Ashraf Al-Qasimi, director of Artateam, told the Art Newspaper: “We are in talks with the UAE government about its new strategic partnership with the country, and the UAE’s participation in the exhibition series should be part of that process. ‘We definitely need to do more with the UAE, and we’re in the process of developing a new platform that will give artists and designers from the UAE and around the world an opportunity to showcase their work and develop relationships with artists.”The Biennial, which is funded through a $5 million gift from British Petroleum, will be hosted by the Sharjah Art Foundation (SFA) and curated by British director Maria Balshaw. Its first iteration, titled “Fight or Flight,” in 2021, will feature work by twenty-four artists.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it is planning to move the twenty-fifth edition of the Fifty-Seventh Venice Biennale, which is currently on hiatus due to Covid-19, to March 28–April 5, 2022. The museum said that it is", "The next Biennial should have been held in 2020, but was postponed due to the Covid-19 pandemic. It has since been rescheduled for 2021 and 2022. The 2020 edition, “Cultural Peace,” attracted 6,500 visitors from a field of forty-eight international artists. The program’s organizers said that the 2019 edition, “Abridged,” drew 5,500 people. While the institution did not believe the pavilion was overrun during the Covid-19 pandemic, it did not have enough resources to prepare for a possible repeat.\n\n\nThe Institute of Contemporary Arts (ICA) in London announced today that Dame Gertrude Oosthuizen has been appointed as its next president. In her new role, she will oversee the biennial, which was founded in 1974 by the late German collector and activist Bettina Gertrude Oosthuizen and her husband, Gerst Gertrude Oosthuizen.“Gertrude Oosthuizen was a champion of artists and a champion of the arts,” said Catherine Martin, president of the institute. “Her vision and passion for exhibitions and artists formed the basis of the bi", "The next Biennial should take place in 2019. Myriam Krayer, a French feminist, and artist, has also been selected to represent France at the Venice Biennale. Krayer was chosen for her innovative and subversive conceptual work that uses art to address the limits of the self and the environment. She is the recipient of the Prix d'Art Contemporain (France) in the Department of Art and Architecture.\n\n\nThe Melkite College Museum of Art in New York has announced that it plans to move the Richard Avedon–designed Modern Art Museum (MAN) to a new location. The institution, founded by philanthropist and collector Richard Avedon in 1985, is currently housed at the former site of the Metropolitan Opera House in Manhattan.During a press conference at the institution on Friday, director Elizabeth Maxwell said the institution will vacate the historic building in order to complete the renovation of its campus and hopes that the move will give MCA a new location. She also said the museum will continue to explore new and better ways to present its collections, display its programming, and serve the community on its new home.The institution will pay $29 million to the estate of the architect and his family and will", "The next Biennial should be held in the United States, and the first in the Czech Republic, in November 2021. The first exhibition, entitled Reproductivism: From the Rise of Art to the Present, will be organized in the United States and the Czech Republic, and will be hosted by the Kunsthalle Basel Berlin.\n\n\nThe Yong Byung-do Foundation has announced that it will receive funding from the Korean government for its annual Art Gallery Exhibit, the Art and Culture Capital Awards, and the Art and Design Capital Awards. The foundation will also receive a sum of $10,000 from the Yong In-kyeong Foundation (YI), which is affiliated with the Yoo Byung-do Museum, which is currently undergoing renovations. The third annual Art and Culture Capital Awards, which are given in partnership with the Yoo Byung-do Museum, will come on November 3. In a statement, the foundation said: The foundation is grateful for the opportunity to present the prizes at this year’s Art and Culture Capital Awards. The exhibition was presented in the city of Seoul, where it is headquartered. The foundation will also receive a total of $10,000 from the ", "The next Biennial should take place in 2021.\n\n\nArt and Design is Still Polluting, but It Is Getting Much Better at the Margins\n\nThe United States has created more than 1,200 new jobs for art and design faculty in both state universities and private nonprofit institutions, and the arts is growing in other countries. Two new studies, published in Artforum and the Art Newspaper, show that the US is still the biggest market for art and design work abroad. In the first study, the Cultural Treasury analyzed sales data from the Art and Design Makers Conference, which is held in Annapolis, Maryland, and found that art and design works imported into the US from Europe totaled $1.36 billion in 2019—a whopping $1.5 billion in 2019. The study found that art and design sales in the US totaled $2.15 billion in 2020, and that the figure will rise to $3 billion by 2021. Cultural Treasury president Janez Balcerzka told Artforum: “We are excited to see how this year’s Art and Design Makers Conference and the upcoming Art and Design Biennial will affect the talent and vision of the United States. The US remains the single largest market for art and", "The next Biennial should take place in January 2021 and will be hosted at the Museo de Arte Contemporáneo in Madrid and at Punta della Dogana in Venice in March 2021. The new theme will be an exploration of the ways in which art museums and schools are affected by the pandemic. The museum will be holding special exhibitions, concerts, and other events in commemoration of the Pan-American Day and in support of the fight against Ebola in the Americas. The new exhibition will be titled “This Is Not the End: Art and the Crisis of Humanity.”\n\n\nThe City of London Museum (CML) in London has launched an initiative to help British museums and galleries recover from the coronavirus (COVID-19). The initiative will offer free admission for groups of ten or more people and will provide them with a tool that they can use to request smaller group discounts. The first phase of the project, which will last through March 2021, will involve 250,000 people visiting the City of London’s museums in March and June. The second phase, which will run from April to September 2021, will involve 1.5 million people visiting the museums in September and", "The next Biennial should be held in the spring of 2021, with a preview exhibition at the Museum of Modern Art, and will celebrate the upcoming works of the year. The biennial will include a lecture series, a curating exhibition, and an open-air reading room.To mark the occasion, the museum will begin a year-round evening lecture series, a curating exhibition, and will introduce the biennial to the public for the first time.  The biennial’s inaugural exhibition, “The Magician,” will be held at the Museum of Modern Art in New York on October 28–29. The show will also feature the work of twenty-five artists, including Robert Irwin, Kenneth Turrell, Mary Ellen Mark, and Molly Crabapple. The twenty-fourth edition of the show will open at New York’s Museum of Modern Art on January 24, 2021.\n\n\nThe City of Los Angeles has announced that it is planning to spend $7.5 million to stabilize the sidewalks, curbs, and streetlights in the downtown core as part of a major overhaul of the area. The $100 million task—which will involve the removal of 2,500 structures, including the nearby old Stock Exchange building,", "The next Biennial should be held in 2022. Art historian and curator Eugene Künstler has called the show “a dream of the past,” while the cultural historian Guido Cottone has argued that it “is not the building of a new world but a vision of the future.” Some contemporary critics have also criticized the exhibition for failing to understand and address the current global political and social crises, which have led to the worst outbreak of the coronavirus in years. The coronavirus is spread mainly from person to person through close contact, usually through respiratory secretions, and can be spread by coughing or sneezing, although most cases are caused by the same virus. (Though, the virus can also be spread through food; eating raw or undercooked meat, poultry, or fish; sharing a room or apartment with someone who has the virus; or being exposed to the virus during an illness. If you are sick, it is important to seek medical care right away; the virus can cause severe dehydration.) The coronavirus outbreak in the United States has led to the closure of several art galleries and museums, including the Museum of Modern Art in New York and the Metropolitan Museum of Art in New", "The next Biennial should be held in 2022. The event will be hosted by the Museum of Contemporary Art (MoCA), Chicago and will consider themes such as health, environment, and loss. The exhibition will be curated by David Karp, who curated the inaugural exhibition in 2006 and is currently the curator of the Visual Arts and Design in New York. Butler and Karp will serve as co-curators of Biennial 8, which will feature the work of thirty-nine artists, including Damien Hirst, Ola Alireza, Danyelle Altmann, and Jürgen Todt, and will have the opportunity to present a retrospective of Art of the Southern Wind, an exhibition at the National Gallery of Art that will showcase the work of Aristo Cattelan, Gianluca Pape, and Aurélune Frisard. The biennial will be hosted at the Museum of Contemporary Art Chicago, which is currently renovating its historic building, between January 15 and February 21, 2022.According to the Chicago Reader, the plans for the museum were first announced by site-specific artist-run space The Rat Project, who proposed the event as", "The next Biennial should be staged in 2022, with a design by the artist-activist and architect Kimberly Phillips, which is currently on display in the exhibition “Prescription Addiction and the Self: Art as Medicine,” curated by the same architect. \n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles announced today that it will reevaluate its current policy regarding the exhibition of work by African American artists in the institution’s exhibitions and will begin accepting artists’ works next week. The museum will also begin accepting works by artists of European descent, with the caveat that they remain accredited under the Museum’s current “Ameri’s Abraham Lincoln’s Model United States Exhibition” program, which launched in 2009.The retrospective, “The Assassination of Lincoln: Painting the Birth of the American Republic” (2019), was curated by Marcella Bruguera, who is currently on the faculty of the Wharton School of the University of Pennsylvania, and will be on view until January 21, 2020. The exhibition, which is organized with a three-day retrospective, “Lincoln at his Best: Paintings and Abstractions,” will open on March 7, 2019", "The next Biennial should take place in the same venue as the first one, in the same year, and will focus on issues of immigration and climate change. The exhibition will also continue to present works that examine cultural identities through participatory practices and the exhibition will feature new works by artists such as Estela Alejandro, Jair Bolsonaro, and Jumana Malhotra.The Biennial has also announced that the exhibition will return to the Uffizi Gallery in Florence on January 25, 2020 and will be held at the same venue until the museum reopens in the spring of 2021. “The exhibition has been expanded to include more current exhibitions and the biennial’s first exhibition in the US since 1916 will be celebrated in our new home, the Art of the American Experience, at Rockefeller Center,” said Simone Guarini, the chair of the tour and curator of the exhibition.\n\n\nWith the completion of its first two-hundred-and-sixty-day season, the Detroit Institute of Arts (DIA) announced today that it is again celebrating its ten-year anniversary this year. In a statement, DIA founder and chair Eli Lake called the initiative a “", "The next Biennial should be a collaborative effort between artists, activists, and biennial organizers. It must be a celebration of creativity, imagination, sustainability, and connection, as well as artistic collaboration. It must take place alongside and within the larger global movement to address climate change and its crisis. We demand that the Biennial be organized in accordance with internationally recognized principles of climate justice, and that the next iteration of the Biennial be dedicated to the environment and environmental justice.\n\nThe jury that selected the seventy-five artists who will be featured in the twenty-third edition of the Venice Biennale has announced its decision to remove Cindy Sherman-Peacock, the head curator of the exhibition “Planet Rock: The Real World” (2016), for violating the exhibition’s by-laws by organizing a private show to promote a new project she was working on with artist Laura Mulvey. The show, titled “The Palazzo della Scala,” was closed to the public and scheduled to run from March 16 to March 20.The jury found that Sherman-Peacock’s actions violated the Italian cultural code by “indirectly or directly” promoting “the work of", "The next Biennial should be held in 2021. \n\n\nThe Museum of Contemporary Art Denver (MCA) has appointed Nicole Perpetua as its next director. Perpetua will take up the post in January 2020. Her new role will be comprised of assisting with the transition of the institution from a nonprofit to an autonomous organization and will be led by MCA board president Vinnie Creutz.“We are very excited to welcome Nicole to Denver and are committed to her leadership and vision,” said Creutz. “Nicole is an accomplished leader in the field of contemporary art and has demonstrated a strong leadership and vision for MCA since she was named the institution’s first director.” Prior to joining the MCA in 2016, Perpetua worked as the chief curator and founder of the urban research and narrative program at the Museum of Contemporary Art, Los Angeles (LA MoCA). Under her leadership, she helped the museum become a leader in its field by launching programs such as the MCA Urban Renaissance, its urban exploration program, and its urban planning initiatives, and launched new shows and exhibitions.Commenting on her new role, Perpetua said: “It’s an honor to", "The next Biennial should be held in 2021. \n\n\nThe Winnipeg Art Gallery (WAG) announced today that the institution will remain a part of the Winnipeg Regional Municipality (WRM) through the end of the twenty-fifth municipal election cycle, paying over $3 million in municipal property tax revenue to the region, including $2.5 million to the city of Winnipeg.WAG President and CEO Grant Wyma said: “It is a great honour to help ensure the financial sustainability of the Winnipeg Regional Municipality (WRM) through a successful and vibrant fiscal year that will benefit the thousands of Winnipeggers that have given their city and province the opportunity to host our first annual Biennial.”The biennial will return $3.6 million to the city from the sale of the Royal Winnipeg Collection, which includes work by more than 2,000 works, including work by Gilbert & George, T.S. Eliot, Alfred A. Nesbitt, and John Constable. The museum also expects to receive $1.7 million from the sale of the city’s exclusive naming rights to the Royal Winnipeg Collection, and will gain another $600,000 from the reopening of the newly renovated Museum of Contemporary Art (", "The next Biennial should be held in November 2020. The workshop will be organized by the European Commission in cooperation with the Academy of Fine Arts and the Italian Institute of Contemporary Art.\n\n\nThe French Ministry of Culture, Art and Sports (La Presse) announced today that the institution of the Palazzo Prada in Venice, which until last year was considered one of the most important cultural destinations in the world, will be taken over by the state of Nice-France. The Ministry of Culture, Art and Sports also revealed that the institution will soon welcome foreign visitors to the Palazzo Prada, which is currently undergoing a major expansion and is set to open in the spring of 2020.The news follows the announcement of a comprehensive renovation plan for the museum that aims to achieve a larger canvas of the museum as a vehicle for cultural exchange between the two countries. The renovation project was spearheaded by Alexandre Bocquet, director of the Palazzo Prada; Arnaud de Montlaur, head of the Palazzo Prada; and architect Marc Tenenbaum. A third architect, Jacques-Auguste Aler, will be overseeing the construction of the Palazzo Prada’s new building, which will be situated in the city", "The next Biennial should present a selection of works by women and non-European artists. The art of the future might be female art. It might be art of the future women and art of today. \n\n\nThe City of New York has announced that it will award $3 billion in grants to seventy-five arts and cultural organizations in thirty-nine counties throughout the city. The categories for the biennial are Performance Arts, Performance Art, Dance, Film, Music, New Media, and Performance.The city also plans to build two new public spaces in the city, one at 50 West Twenty-Second Street, and the other at 60 West Twenty-Third Street. The existing buildings will be turned into apartments for artists. The third building, at 240 West Twenty-Fourth Street, will become a meeting space and the home of the New Arts Alliance.Inaugurating the seventy-five grant recipients are the Metropolitan Museum of Art (MoMA), the Museum of Modern Art (MoMA), and the Whitney Museum of American Art. The Metropolitan Museum of Art is participating in the second edition of the Million Arts Awards, which will launch on September 7 at 7 pm in the metro club. The 2020 grants will be distributed by the NYC Alliance", "The next Biennial should be held sometime in the second half of 2021.”\n\n\nThe Museum of Contemporary Art (MoCA) has added two new members to its board of trustees: Christopher Wool, a New York–based arts consultant, and David Agustín, an Argentinean collector and art collector who currently owns the works of Austen Best and Eva Hesse. *In addition to their roles as board members, Wool and Agustín will serve as advisors to the museum on issues such as the museum’s financing strategy, initiatives to increase its international footprint, and the selection of works and collections.“The board members of the team that discovered and curated this exhibition have helped shape and articulate the exhibition’s themes and have shaped the museum’s relationship with its curators and artists,” said museum director Miles Broderick. “Their contributions to the exhibition’s development have been transformative and to the museum’s collection—many of which have served as the catalyst for other exhibitions and commissions.”Wool, an associate professor of art history at Columbia University and a board member of the school’s art-world chapter, serves as a consultant for museums and galleries in New York and", "The next Biennial should take place in the city in 2020 and will be organized in collaboration with the City of London.\n\n\nThe Culinary Workers Union (CWA) in the United Kingdom announced on Wednesday that it is planning to stage a series of actions across the country to protest the coronavirus. Organizers said that more than 2,500 people have been invited to participate in the March for Science and Technology, which will take place on March 23, and that the ideal location for the action would be in Coventry.The CWA represents restaurant, catering, and retail workers in the United Kingdom. Organizers said that the March for Science and Technology will strive to be an inclusive and action-packed experience, highlighting the many ways in which the UK is failing its workers. The March for Science and Technology will be held at the Culinary Workers Union on Westminster Street from March 23 to March 27. It will also be hosted by the Tate Modern, the National Poetry Library, and the National Portrait Gallery, and will feature performances, lectures, workshops, a Q&A session, and other events.Tate Modern director Maria De Coster-Witten, who is working with Tate’s global artist-in-residence, Julian Sav", "The next Biennial should be held in 2021 and will be the last as part of the project, which was launched by the University of Exeter in 2008 and has relocated to the University of Exeter. It will showcase the work of seventy-three artists.This year’s event, “Monument to the Artist” was curated by Yinka Shonibare and featured work by thirty-five artists. The Jury Prize winner, Craig Lee, was awarded a lifetime achievement award last week. The Biennial will resume in December with a special exhibition of works by artists working in the late ’70s to the early ’80s.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that artist and philanthropist Alex Katz is the recipient of the $100,000 Lifetime Achievement Award. Katz is the founder of Katz Art Gallery in Manhattan, which has locations in Baldwin Park; in Pasadena; and in Santa Monica. The museum is also a founding member of the Los Angeles Cultural Consortium, an initiative of the Los Angeles–based nonprofit the Arts Alliance to combat homelessness and homelessness-related issues.“It’s a very special honor to receive such a significant gift from MoCA,” Katz", "The next Biennial should be held in 2021. \n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Edina Hawkes as its next director. Hawkes currently serves as director of the New Art and Design Museum (NADA), which is housed in a former RCA factory in an industrial neighborhood of the Bronx. She succeeds Roy and Judy Lubell, who has helmed the institution for more than twenty years, and will take up the post on January 30.“I’m honored to have been selected to lead the Museum of Modern Art,” said Hawkes. “The museum is the combined collection of the great Edina Hawkes and the great Judy Lubell, and I’m excited to empower both of them to take our institution forward with the vision and leadership that made them so successful. I’m looking forward to working with my colleagues and patrons at NADA as we build on the Museum’s legacy of exploring new ideas and experimenting with new materials and methods, and to guiding our museum through the coming years.”Prior to joining the museum in 2002, Hawkes served as director of the Neue Kassel Visitation Museum in Germany (2013), which she helmed", "The next Biennial should be held in 2022. The next exhibition should be announced in 2020. The next exhibition should take place in 2020. The next exhibition should be held in 2021.The next exhibition should be held in 2022. The next exhibition should be held in 2022.  This is not to say that the museums have not been holding discussions about moving forward. They have. But the scope of the biennial and the pace of its running are very different. The upcoming exhibition venue for the upcoming exhibition is Melbourne’s Art Institute. Moving forward, this biennial will consist of an assemblage show, a performance, a book, an oral history, and a selection of works on paper.It will be on view through March 24.\n\n\nThe National Galleries of Scotland (NGA) and the National Galleries of Ireland (NGA) have reached a settlement over the sale of the iconic Old Masters’ House in Edinburgh. The NGA’s new partnership with the National Gallery of Ireland will take place in the institution’s new headquarters in the city’s north-eastern corner from April 15 to April 20, 2021.The NGA will commission an exhibition of the house", "The next Biennial should be held in 2020, the very year that the three-day event will be inaugurated by a new monument commemorating the martyrs of Genoa, Italy. The event will take place in the city of Genoa, the city of Rieti, and the town of Oman.\n\n\nAn artist’s studio in Tokyo that was threatened with eviction until it agreed to make repairs to an earthquake-damaged courtyard was attacked by a group of thirty to forty people who said they were there to protest the studio’s association with the controversial artist Goro Miyazaki. The attack occurred on September 24, the same day the Tokyo Metropolitan Government (the council of Tokyo officials) approved a controversial $52 million plan to tear down a twenty-one-century master’s–designed building in a major renovation project intended to make the area around the studio uninhabitable.The plan, which is currently under construction, involves the demolition of the historic Tadao Ando–designed Goro Miyazaki home and the construction of a new three-story, seventy-one-thousand-square-meter exhibition space that overlooks the courtyard and overlooks the surrounding area. The new exhibition space will be built in a", "The next Biennial should take place in 2020. The plan is for an exhibition to draw around five thousand people, comprising a selection of works by at least ten artists, and will also include a symposium, symposia, and other activities that will allow visitors to experience the exhibition in a live setting. The 2019 show, titled “In the Space of a Day,” was held at the new Tucson Contemporary Art Museum’s new building, which will be completed in 2020, and featured works by fourteen artists.\n\n\nThe Museum of Fine Arts (MoFA) in Boston has announced that it will not proceed with the construction of a new exhibition space in the museum until 2023. The institution, which is currently working on a redesign that will encompass more galleries and more exhibitions, has also been working on the redesign of the existing building, which houses the museum. The redesign, called MFA Contemporary, is expected to be finished by the end of 2020.The institution had hoped to begin construction on the new space in 2016, but has since been pushed back to 2021. After a public meeting on Tuesday, February 1, MoFA board chair Bech L. Coleman urged curators and organizers to work together to push the", "The next Biennial should be held at the Museum of Modern Art, Berlin. The first edition, which was organized by the German-born architect Joachim Neugroschel (1926–2006), opened in January 2019. Museum director Birgit Obrist-Bauer confirmed that the exhibition would focus on the history of design, designed by women, artists, architects, and inventors. The program will also present new works by local and international artists. The museum has received a $10 million donation from the Düsseldorf-based Fondsa Bank; they will loan the museum $6 million for the exhibition. By inviting women artists, the museum hopes to gain their attention, and also to engage them in the artmaking process. “The next Biennial is part of our programme of building bridges between East and West, between East and the Third Reich, between Germany and the West, between East and East. We will therefore try to present the work of women artists in biennial form, such as in this exhibition,” said Obrist-Bauer. The next edition of the exhibition will be held at Kölnischer Kunst, Köln, from August 24 to", "The next Biennial should take place in London in the summer of 2021 and will include works by more than seventy of the artists featured in the exhibition. The first biennial, held in KoenigHouse in London in 2003, was honored by the London Foundation for the Arts (LFA) in 2007 and is currently on display in the Tate. The next event, “In the House of Yesod,” will be staged in the Museum of Modern Art in New York in 2021 and will include works by artists from both the West and the East.\n\n\nThe Museum of Contemporary Art (MCA) London has welcomed Alexandra Bostwick, who joined the institution in 2017 as director of contemporary art. Bostwick, who has helmed the museum since 2010, will step down after a twenty-year tenure.“Alexandra is a model director who has been instrumental in transforming the MCA,” director Maria Balshaw said. “Having worked with her for more than a decade, I know her to be a dedicated professional who is dedicated to building and maintaining a strong and vibrant contemporary art collection. I am enormously proud of her achievements and am confident that she will continue building on the MCA’s legacy", "The next Biennial should be held in 2020. Featuring up to ninety artists from thirty-four countries, the exhibition will take up the theme of the month: The Future Is Present. Its inaugural edition was held at the Smithsonian American Art Museum in Washington, DC, in March of 2018.\n\n\nGillian Wearing, the British architect and interior designer best known for his master-planned urban spaces—his interiors of century-old Victorian buildings in London, where he lived, and his sculptures of New York City landmarks, including the Empire State Building and the Metropolitan Museum of Art—has died at eighty-eight years old.Born in London in 1943, Wearing studied at the School of Design until the fall of the British Empire, and then studied at the University of Kent. From the mid-1950s to the early 1970s, he lived and worked in the United States, where he met his wife, Ann. The couple had three children, a son and an adopted daughter, and are survived by their son Daniel, who went on to majorin the fields of architecture, engineering, and design. In 1979, Wearing gave up his career as a design professional to devote all his energy to the work of creating a new museum to the British", "The next Biennial should be held in 2021.\n\n\nThe Diadem Museum in the City of Rome has received a gift of five rare works by Italian modernist Alessandro Massimi, who died in 1975 and is survived by his daughter, Carola Massimi. The works, which were donated by the diadem’s founding patron, Pilar Massimi, are among the twenty-one works in the museum’s collection that are currently on display in the exhibition “Massimi: The Diadem.”“The diadem is a special place where three generations of Massimi–inspired artists gather together,” said Francesco Cossiga, director of the diadem. “These works will be presented in a number of exhibitions throughout the museum in the coming years, including the inaugural exhibition ‘Massimi: The Diadem.”The works were donated by the founder of the Casa Nazionale di Roma, Alessandro Massimi, who had inherited the diadem in 1951 after his father, Angelo Massimi, died. The family moved to Italy shortly thereafter, and the artist continued to work with his father, and later with the family. In addition to his father’s collections, the di", "The next Biennial should be staged in 2022. This year’s edition, titled “Bologna: Art and Struggle”–the fourth and final instalment of the exhibition–will be held at the Museo de Arte Contemporáneo Brindisi and will celebrate the work of thirty-seven artists, including Sanna Zupancic, Vittorio Andreotti, Carlo Lazzarini, Andrea Zingaretti, and Agustín Pérez.“The proposal of this exhibition was always to present the work of artists from one particular area of Italian art,” said Paolo De Buoro, director of Biennale di Museo di Roma. “The exhibition has become a way for us to share our life experiences in Italy, to show that there is a rich and distinctive tradition of contemporary art in Italy.”The Biennial’s artistic director, Luigi De Lisi, said: “This is a difficult time for our collection because of the closure of the museums and many of our artists’ studios are closing, but we are determined to continue the work of our curators and to develop the exhibition program with a new set of curators in the coming", "The next Biennial should coincide with the opening of the museum's new exhibition “Telling Stories,” slated to open in 2022. The exhibition will feature the work of seventy-three artists, including Michael Knapp, Florian Hofmann, Jean-Luc Meloulée, and Agnes Martin, and will feature an intermission between “The Body and the Other,” 2005–2006, and “Menvsque (Menstruation and Sex),” 2001–2005.“We are so excited to see how the exhibit will bring the most beautiful stories to life and to be a part of the extraordinary journey that lies ahead,” said Kwame Kwei, chairman of the museum. “Kwame Kwei is a master storyteller. His stories and paintings capture the full and vibrant beauty of the natural world, while his drawings and prints perfectly capture the spirit and rhythm of the art. We sincerely hope that The Body and the Other will lend itself to telling and that the exhibition will be a major success.”\n\n\nArtnews has learned that Zaha Hadid Architects has won the 2019 Westfield Art Awards, which celebrate the critically acclaimed, art-world-recognition-shattering,", "The next Biennial should be hosted at the National Art Museum, in Cleveland, Ohio; the Metropolitan Museum of Art, in New York; and the New Museum in New York (both New York and New York City). In the meantime, the museum will hold an open house on September 21.\n\n\nThe Spanish government has allocated €88 million ($113 million) to fund the construction of a new monument commemorating the seventy-six victims of the 1936-39 Spanish Civil War and commemorating the region where Madrid is located. The Plaza de Mayo, which celebrates the defeat of the socialist government led by dictator General Francisco Franco, has been under construction since 2011 and will finally open to the public in 2022.The construction of the monument, which will be located in the capital—one of Madrid’s major tourist attractions—was initiated by conservative Prime Minister Mariano Rajoy, who pledged to create a new monument to the country’s victory in World War II. Dubbed Mestiza (May Day), the monument will feature a tribute to the victims of fascism as well as a selection of historical works, including the infamous “Statues of War” by Josef Albers, a Nazi collaborator who was executed in 1954 for his role", "The next Biennial should take place in 2021. We look forward to continuing to support the artist-led efforts of the Miami-based nonprofit, the Biennial Program, to address the issues and challenges of contemporary life. The artist-led efforts of the Miami-based nonprofit, the Biennial Program, to address the issues and challenges of contemporary life.The new exhibition, “The Artist in the Crowd,” will highlight work by internationally known and unpublished artists. This year’s event will be transformed into a biennial by creating an exhibition of the artist’s performances and other works. The exhibition will be curated by Markus Von Storch, a Swiss curator and avid collector of contemporary art and fashion, and will open in January 2021.Museum of Contemporary Art (MCA), Boston: “The Artist in the Crowd” will be inaugurated in February 2021. The program will focus on both the artist and the spectator, and will be organized in a twenty-six-foot medium-size central location in Boston. The exhibition will be curated by Markus Von Storch, a Swiss curator and avid collector of contemporary art and fashion. The 2017 exhibition, “Art", "The next Biennial should be held in 2022.\n\n\nThe New Museum in New York is planning to delay its 2020 edition, dubbed Project, from March 23 to March 27. The move was made in an attempt to minimize the concomitant effects of the Covid-19 pandemic on the institution, which is still awaiting word on whether the 2019 event will return to full-time staff. In a statement, the museum said the postponement was made following a thorough review of the 2019 season and the biennial’s possibilities. “The future of the show is not yet decided, but we are working closely with our sponsors, partners, trustees, and the artists to understand the full implications of the Covid-19 pandemic and the impact of the pandemic on the artists, and to consider all possible options,” the statement reads. The move has forced a change of plans for artists who had been preparing for the biennial, which was originally slated to run from March 14–March 22, 2020. “I thought it was a really important statement,” Alice Procter, an artist and member of the short-lived group The Serenade, told Artnet News. “I’ve", "The next Biennial should start as soon as possible to accommodate as many galleries as possible and the first phase should last from March 16 to March 19, 2020. The maintenance of the galleries is a major source of revenue for the arts and will be covered by the 2020 prize, which is expected to bring in an additional $10 million.\n\n\nThe National Museum of Art in Washington, DC, has introduced two new initiatives to help ensure that more than five hundred works by artists from around the world are preserved in its collection. The first initiative, created in partnership with the National Gallery of Art, aims to increase the number of works in the collection by 1,000 per year. The program, which was developed in partnership with NARA and will launch in 2020, will involve the institution collecting works from across the country, giving the public three options for acquiring works. The other initiative, which will be implemented over the course of three years, will involve the institution collecting works from the Metropolitan Museum of Art, the Museum of Modern Art, and the Whitney Museum of American Art.In order to ensure that collections remain accessible to the public, the National Museum of Art made the following key changes:   New admissions policies that will allow museumgoers to enter through a new entrance on", "The next Biennial should take place in 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has announced that it will re-enter the Los Angeles County Museum of Art (LACMA) as the venue for the 2021 edition of the Alamo Drafthouse’s inaugural Alamo City Works, which will take place at the Santa Anita Pier in Downtown Los Angeles. The event, titled Space, will be organized as a two-day celebration of the city’s history\u0097a re-imagining of the Alamo City Park in the summer of 2019\u0097and will feature new works by artists such as Nari Ward, Alex Tellez, and Carlos Uliotto.“We are thrilled that the Alamo City Works will be hosted by MoCA and that it will return to its downtown location in the heart of the city,” said museum director John Albrecht. “The new location for the event will give MoCA a great place to make new works and will extend the visual experience of the event for our visitors. We look forward to welcoming our Alamo City neighbors to the event and to organizing a work of our own for the first time.”\n\n\nThe Institute of Contemporary", "The next Biennial should focus on “the declarative construction of the fictitious as a source of ideas,” and “the new and the traditional as the means of production.” The work will be curated by artist-in-residence Hsin-Chien Huang and will be presented by the Central Institute of Contemporary Art in Beijing. The exhibition will take place in the city of Beijing in the capital of China. It will be hosted by the state-run Beijing Art Museum (BAM), which is transformed into a contemporary art museum at the moment when the city is undergoing a massive rebuild. The construction of the Museum of Contemporary Art Beijing, which will be inaugurated on September 7, 2010, is estimated at some $112 million. According to local media reports, the project is slated to conclude by 2022.The project was launched by the Beijing Free Museum (BFC), a branch of the Beijing City Science and Technology University (BCSU), in partnership with the Beijing Art Museum and the Beijing Academy of Fine Arts. The partnership was formed in 2012 to facilitate the relocation of BFC’s collection and exhibitions. The new institution will be inaugurated by Hirshhorn Museum director Christopher Green and will host", "The next Biennial should take place at the Uffizi Gallery in Florence in December 2020, and the first exhibition will open in Tokyo in April 2021.\n\n\nThe Italian government approved a new law on Friday that will require museums and archaeological sites to conserve at least 70 percent of their historic properties, and allows the government to seize and sell the cultural artifacts of warlords, mass graves, and other mass graves.The legislation, which was passed by the Democratic Party-led Senate and is now before the Senate, grants the government the authority to remove objects from private collections and to confiscate objects from sites it considers illegal. Under current Italian law, cultural sites can be closed for up to six months following a public hearing, but the new law will allow the government to extend the period by a maximum of two months. The government will also be able to seize and sell objects that are not in the public's hands, and any objects that are in transit to Italy will be subject to a man-made check.According to the New York Times, the government has already taken over eleven thousand objects from private collections since it was elected in 2013. The law states that the government may sell off the cultural heritage of a warlord, but that this must be done with the", "The next Biennial should be held in 2022, and the first in 2024. \n\nAfter the Biennial, the Museum of Fine Arts will rejoin SPACES’s other two partners, the Baltimore Museum of Art (BMA) and the Carnegie Museum of Art, in Pittsburgh. The BMA, which began to bring the Biennial to Baltimore in 2015, reopened in April of this year and will host the event again in early 2021. The BMA’s inaugural event, “The Resurrection of Art” (2019), took place at the Blackstone Gallery in downtown Baltimore in September 2019. The BMA’s spring 2019 edition drew 1.2 million visitors.The biennial’s other sponsors are the St. Louis Art Museum and the Pennsylvania Academy of Fine Arts, where the 2019 exhibition, “Blue, Blue in Flames: Modern Art and Black American Art” was staged. Both museums will be hosting events on June 21 and June 28.\n\n\nAfter founder and director Robert Giard sold his struggling art museum in the Swiss city of Basel in 2007, he declared bankruptcy and began the gradual exodus of assets. In 2010, he and his wife, Mona Giard, temporarily", "The next Biennial should take place in the spring of 2020, to coincide with the 50th anniversary of the museum’s founding. The event will be hosted at the museum from April 15 to April 16, 2020. The exhibition will be curated by Babak Center for Contemporary Art, Tehran. The metropolitan city of Tehran is located in the Persian Gulf, and it has a population of about 5.5 million people.\n\n\nA group of artists, designers, filmmakers, writers, and other cultural workers in the Philippines are boycotting a new exposé published by the New York–based Human Rights Campaign (HRC) that explores the human rights abuses committed by various government agencies and proposes reforms.Dubbed “Protection of Life, Freedom, and Dignity: The Philippines at War with Drugs,” the report, which is based on an in-depth two-year investigation by the NGO, is a “final report” that examines the conduct of the Philippine government since it declared war on the country’s former president, Rodrigo Duterte, in June last year and that ended in the deaths of more than 7,000 people, including hundreds of journalists.The interview findings have sparked outrage in the Philippines, which is one of the", "The next Biennial should take place in 2019. The first edition of the exhibition, entitled “Sumer and Lennon,” was staged at the New Museum in New York from March 23 to March 27, 1980. Its follow-up exhibition “Love at First Sight,” was staged at the Museum of Modern Art in London from March 29 to March 31, 1981. The twentieth edition of the series, “Mimi and I,” was staged at the New Museum in New York from April 7 to April 11, 1982. The biennial’s twenty-third edition, “The Giant Equator,” was staged at the Museum of Modern Art in New York from April 13 to April 20, 1993.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Paul Aravosis as interim director of the institution. Aravosis, who has been with the museum for more than twenty years, will assume his post March 23.“Paul has been a driving force behind MoCA’s contemporary art program since it opened in 1996,” said Eric Levy, president and CEO of the museum. “After more than two decades at the helm, he has been instrumental", "The next Biennial should be held in 2020, after the expiration of the ten-year edition in 2022. The first edition, titled “Historica Alpes” (The Hall of Alpes), was held in the Dusseldorf town square in December 2019. The second edition, titled “Historica Bicolor” (The Hall of Bicolor), will be held in the ancient town of Bietigal in the province of Baden-Baden, Germany, in March 2020. The first pavilion, a bronze sculpture, “The Dreamer and the Plaintiff,” will be presented at the 2019 Venice Architecture Biennale. \n\n\nThe museum’s collection of more than three thousand nineteenth-century artworks, including works by Dorothea Rockburne, William Henry Fox Talbot, and Mary Esmeralda, has been granted a landmark legal protection by the heirs of Billy and Mary Talbot, who were the reason behind the wrongful death of their daughter, Mary Kamm, in 1979. The case was brought by the descendants of Alma and Thomas Talbot, who were awarded $12.7 million in their wrongful death suit in the United States District Court in", "The next Biennial should be held in 2022.\n\n\nThe Museum of Jewish Heritage (MoH) in Vienna announced today that it is reopening to the public in mid-March. The institution will be open to the public beginning March 19, and will be open seven days a week through March 23.The institution is still evaluating the feasibility of an extension. Its current exhibition schedule includes the exhibition “Leuchter and Städels,” which will be on view for twenty-three days a week, beginning March 20; “The New York Collection of Jewish Art” (2019), which will be on view for twenty-six days a week, beginning March 22; and “The Collaboration,” which will be on view for twenty-six days a week, beginning March 21.In addition, a number of programs, including the annual presentation of works by artists such as Gerhard Richter and Irmel Herrnach to mark the anniversary of the Jewish state, will be presented in the exhibition “We Are the Same: Scenes of Jewish Life 1937–1945.”\n\n\nThe National Museum of Fine Arts (MoFA) in Washington, DC, has received a gift of more than seventy paintings, drawings", "The next Biennial should focus on matters that are of cultural interest to the Western world, such as inclusivity and diversity of vision. The next will focus on the social, political, economic, spiritual, and physical aspects of art. The second edition of the 2018 Biennial will focus on the interdependence of art and life. The exhibition, titled Art and Life, will be held at the Threshold MOMA in Vancouver, Canada, and will be held during Art Basel Hong Kong in 2020.\n\n\nThe Washington Institute for Contemporary Art (WADA) in Washington, DC, has received a gift of fifty-six works from the late designer H. Bruce Lee. Known for his subtle, sculptural, and conceptual design, which often explored the relationship between the body and its environment, Lee was also one of the most influential pre-atomic physicists’ work around the globe.Born in New York City in 1967, Lee first studied at the University of Washington and graduated from the school in 1971. He worked as a textile designer for a number of brands, including Calvin Klein, Ralph Lauren, and Saint Laurent, before launching his own design firm, which he ran from 1983 to 2004. He was involved with the Manhattan Project", "The next Biennial should be held sometime in the 2020s. We are currently working towards a date of 2021.\n\n\nThe New Museum in New York has announced its representation of the National Association of Costume Designers (NADA). The institution will present its first exhibition dedicated to the topic in the United States in 2022. The show, titled “The National Icon: The Costume Design of America” will be on view in the museum’s new gallery, which opened in the museum’s former space on Eighth Street in New York City on October 11, 2020.The exhibition will feature over sixty thousand pieces that were created by more than three hundred individuals and organizations over a twenty-year period. The show will also introduce the public to new ways of looking at historical figures, including Anna Atkins, Gertrude Stein, and Ed Moses.“NADA’s new gallery represents an exciting moment in the museum’s history,” said John Macgregor, director of the Smithsonian American Art Museum in Washington, DC. “NADA was founded by a group of curators whose mission was to advance the field of costume design through exhibitions, publications, and educational programs. The exhibition ‘The National Icon: The", "The next Biennial should be held in 2020.If the museum reopens, it will be in a state of continuous operation for at least twelve months. \n\n\nThe Independent Art Museum (IAM) in London announced on Wednesday that it is reopening after a year-long hiatus. The institution announced that the closure of the curatorial unit, which focuses on conceptual art, was its \"final and most difficult decision\"—it will now launch a new phase of programming. The announcement follows the publication of an exhibition by artist Marina Barlow titled Marina Barlow: The Golgotha, scheduled for March 24–March 26, 2020.In the exhibition, the artist takes the stage in a Welsh village in the Ceredigion region of England, where she works a limited-edition series, which consists of photographs, sculptures, and installations, that is inspired by the Welsh word Golgotha. Barlow also offers recreations of historical locations such as Cardiff and Aberystwyth to make the locations appear as lifelike as possible.“The project is an extension of my longstanding interest in Welsh art and Wales, and the prospect of an exhibition here in London is exciting,” said the artist.", "The next Biennial should be held in 2020, when the country will be celebrating its sixtieth anniversary. The next edition, titled 'Art and Greed: The Rise and Fall of American Art, 1910–1939,' will be staged at the Virginia Museum of Fine Arts in Richmond.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles has announced its representation of the artist-designed work of artist-lover-turned-indie-composer David K. Johnson, whose work explores notions of mortality, the material world, and the character of love. The Los Angeles native was born in New York City in 1961 and grew up in the Bay Area, where her father was a local meatpacker and her mother was a homemaker. She graduated from the same high school as Jane Fonda and Yvonne Rainer, the latter of whom she married in 1993. In 1997, she moved to Los Angeles, and in 1999, she moved to the town of Sherman Oaks, where she met and married Russell Bassett. They had a son in 2000 and in 2004, the year after their son was born, the couple relocated to the greater metropolitan area, where they would eventually reside.In honor of their legacy, Johnson is making", "The next Biennial should take place in 2020.\n\n\nThe Metropolitan Museum of Art in New York has appointed Alexandra C. Alexander its next director. Alexander will assume her new post in January 2021.“Alexandra is a seasoned leader with deep experience building and delivering compelling exhibitions at the Met, and we are thrilled to welcome her to the museum,” said Mark Rubens, the museum’s director. “Her talent, enthusiasm, and intelligence align perfectly with the Met’s mission and vision, and we look forward to working with her to realize our ambitious plans for the Met’s collection, exhibition, and education.”Alexander previously served as director of the Teiger Museum in Sterling and director of the Metropolitan Museum of Art in New York. Her curatorial practice spans biennial design and construction, public engagement and exhibition design, and performance and performance-based education. She will now assume her responsibilities at the Met, which already has a new director, John Carlin, and will begin in her new role in January.During her tenure at the Metropolitan, Alexander spearheaded the development of the institution’s collection, exhibitions, and education programs, overseeing a number of exhibitions, including “FACTS,” which", "The next Biennial should be held in the fall of 2020.  Bertrand Delanois, the president of the Épineuil-le-Fleuriel, France, has stated that the festival will be hosted at the Grand-Duc Jean in Paris in 2022.  The first stage of the exhibition will be held at the Ecole des Beaux-Arts in the city of Bordeaux. The artist-run event will then return to the Grand-Duc Jean to be inaugurated by the French minister of culture, Franck Riester. The upcoming exhibition of the artist’s work will be curated by Michel Houellebecq, the director of the Tate.  The exhibition will be on view through March 19. French president Emmanuel Macron announced the dates for the upcoming event, which will include thirty-one works by thirty-seven artists, at his weekly televised news conference on March 10.  “The future of art is indelibly linked to the future of France,” Macron said. “The themes of the show will reflect these aspirations. They will be French, they will be European, they will be contemporary, and they will be original.”", "The next Biennial should focus on cultural resistance and provide a roadmap for future installments; it has been suggested that the theme should focus on “historic resistance,” a term coined by Alfred Yüehlen to describe a series of events that took place in China from the nineteenth century to the twentieth. The final exhibition should include a selection of works by artists including Fritz Lang (1927–2013), Cui Tianxing (1902–2012), and Zhang Yaxuan (1902–2012).The decision to hold the exhibition made by the Hong Kong-based collective Space for Art was made in collaboration with Hong Kong artists, including Hong Kong-born artist Hong Heejung, who has been nominated for the 2020 Prize. The collective will present the works in the exhibition in collaboration with artist Hong Kong and Hong Kong-based curator Anita Chiu.The Hong Kong–based collective Space for Art will create a new exhibition in collaboration with Hong Kong’s Hong Kong Art Museum (HBMo) and Hong Kong Fine Arts (HFA) to present “The Other Side of the Wind: Art and Subversive Environmentalism” at the Paris-based institution in January 2020. Chiu will also curate “The Other", "The next Biennial should focus on the history of the museum’s exhibition space, which is now being renovated, and its development of a new exhibition format and a new series of lectures. “I invite you to feel the fullness of the museum’s repertoire,” said the president.The exhibition space will begin welcoming visitors in December 2020 and will be inaugurated by “A-BASS” (Evolutionary Anthropology BASS), a new exhibition that will first present the work of Rosalind Solomon and then reprise her work “The Spirit of the Past: Solveig & Paul” (2019). The show is organized by the German-based studio Govern-TEK.“The next Biennial will focus on the history of the exhibition space, on how we create and maintain a space for art in an era when the museum is increasingly perceived as a 'hub for culture' (“Zweck und Gesellschaft”),” said Beffen. The museum will also collaborate with the German regional art university Berlin Rech, which was founded by the philosopher Alexander Bechmann in 1958, and the German city of Bonn to present a joint exhibition of work by Bech", "The next Biennial should begin in 2020, when the first exhibition in the new complex will open in the spring of 2021. The total cost of the project is estimated at $4.5 million. The new venue will be located in the urban village of Bonn, Germany, in the same building as the former residence of Adolf Hitler. The new museum will boast of various exhibition spaces, laboratories, a library, a cinema, a café, and a bookstore. The Biennial will be on view from November 23 to March 20, 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in London has appointed Joachim Neugroschel, a curator and researcher based in the Netherlands, as its next director. Neugroschel comes to the institution from the Museum of Modern Art (MoMA), where he has served as chief curator since 2014, and comes to the institution from the Amsterdam-based company Redaktio.“I’ve been impressed by Joachim’s unique approach for examining the contemporary art of the West in the Netherlands since the museum’s founding in 1996,” said Anne-Marie Devlin, director of MoCA. “He has deep interests in the cultural,", "The next Biennial should be held in 2021 and will be scheduled to take place in the city’s Grand Central Station. The museum will be reconfigured to host an annual art cycle, which will encompass five panels of artists and will be organized under the theme “Simone Biennial” and will be led by the director of the Institute for the History of Art George Akerlof. \n\nThe Museum of Modern Art (MoMA) in New York has decided to scrap the thirteenth edition of the National Art Biennial, which was set to take place in the museum's former building on East Twenty-Third Street on Saturday, April 26, 2020, and to reevaluate its future plans for the exhibition.According to the New York Times, MoMA director Daniel H. Weiss told the publication that the decision was made in light of the museum’s ongoing renovation of the building, which it expects will open in the spring of 2021. The new space will be called the National Museum of American Art and will house more than 1,500 works and will offer “massive new experiences.” “We had hoped to have a biennial in 2021, but we can’t,” Weiss", "The next Biennial should take place at the site of the former Central Library in Santo Domingo, a UNESCO World Heritage Site in the Philippines, and will be hosted by the National Museum of the Philippines in Manila. \n\n\nThe Institution of Islamic Art (Iba) in São Paulo has appointed Marta Lis as its new executive director\u0097a post she will assume in November. She succeeds Jeraís Varas, who will be promoted to the role of senior advisor.“We are delighted to welcome Marta Lis to Iba, which has a rich heritage of art and is especially focused on the preservation of the art of the Mālaga region,” said president Silvio Ribas. “Marta is a visionary leader with the vision to push forward the work of Iba’s artists to the next stage of their careers, which includes an expanded public program and the establishment of a strong board of directors.”Iba’s director Jairo Cervantes added: “The Iba Museum has become an important hub for cultural exchange and a platform for the development of the arts in the city of São Paulo. Marta will be instrumental in the transformation of this museum into a", "The next Biennial should be on the history of cultural relations in the twenty-first-century, with a focus on contemporary issues.”The twenty-second iteration of the exhibition will take place in the United States. The twenty-third iteration will be held at the Museum of Contemporary Art, Los Angeles (CA). The twenty-fourth iteration will take place at the Museum of Contemporary Art, New York (NYC).  The twenty-fifth and final iteration of the exhibition will showcase work by a select group of artists from the United Kingdom. The twenty-sixth and final iteration will be held at the Smithsonian American Art Museum, Washington, DC, and will be held at the University of Oxford, England.\n\n\nThe following artists have made the prestigious Blue Ribbon Award, which honors excellence in the art field and was established in the memory of Franklin D. Roosevelt:  Bryan Almeida,\n LAXANDPAIN,   Los Angeles, CA (2018)Matthew Allen, Los Angeles, CA (2018)Tanya Allen, Los Angeles, CA (2018)Danny Barilla, Los Angeles, CA (2018)Bryan Barrett, Los Angeles, CA (2018)Cara Barrett, Los Angeles, CA (2018)", "The next Biennial should take place in 2021, and the first in 2024.Hirshhorn Museum in New York is also planning to open a permanent outpost in the city next year. While the institution will remain closed until at least 2020, interim director Krista Hurwitz said that the museum is preparing for the possibility of opening as soon as 2021. “We’re not going to have any delay,” Hurwitz told Artnet News. “We’re going to move forward as planned.”\n\n\nThe Israeli Museum of Antiquities in Jerusalem has received a gift of twenty-one statues commemorating the founding of the State of Israel from the Hillel movement. The donations were made by Rabbi Menashe Raviv, founder of the organization Hillel in Jerusalem, and the American financier and philanthropist Jeffrey Epstein, who was arrested in 2008 after allegedly trafficking minors online. The institution also reportedly received a donation of twenty-six statues when Epstein was arrested in 2013.The donation, which were donated by Epstein and his wife, Sheryl, comes on the heels of the Israeli government’s pledge to raise $2.2 billion for the establishment of a new museum dedicated to the country’", "The next Biennial should be held in 2022.\n\n\nThe Contemporary Art Museum St. Louis (CAMStL) has received a gift of twenty-three works by artists of African descent. The works, which were acquired through a $5 million donation from the Dorothea and James du Pont family, were on display in the David H. Koch Collection’s final exhibition “Blacklisted: Art in the Age of Black Power” at the museum last year.The works were acquired by the museum in a gift from the DuPonts in honor of the family’s commitment to the collection. The donation also marked a turning point in the collection’s history, as it became the first institution in the United States to welcome Black artists. The gift was made in recognition of the two-year anniversary of the exhibition “Blacklisted: Art in the Age of Black Power.” The exhibition was one of a number of initiatives that were undertaken by the museum to affirm the importance of art of African descent in advancing community relations, fighting racism in the art world, and promoting social justice.“The museum is rebuilding its relationships with key artists to better serve our communities. We are rethinking exhibition programs and supporting artists", "The next Biennial should be held in 2021. Speaking about the future of the festival, president Trung Gar-Lai said: “The new series of biennial exhibitions will draw on contemporary approaches and themes to present projects that are in conversation with and at the same time reflect the current challenges and hopes and aspirations of the Hong Kong contemporary art scene.”\n\n\nArt Basel Hong Kong released the latest sales figures for its Hong Kong fairs. In a release, the fair organization said that sales at its Hong Kong fairs in March were up 20 percent over the same period last year.“Over the last twelve months, we have seen both strong demand and strong demand for our fairs across Asia,” said fair director Charlotte Sungeld. “We are delighted with the results from the Hong Kong fairs and are confident that they will continue to grow in the coming months.” She added that the sales increase was primarily driven by increases in the number of visitors, the number of exhibitors, and the number of participating galleries. Among the exhibitors who announced new partnerships with the fair were A.I.R. Gallery, Gagosian, Tao Gallery, Gagosian Asia, and", "The next Biennial should focus on how art can provide a more robust platform for social change and intergenerational solidarity\u0097and on how art can be used to mobilize, structurally rethink and transform the structures and institutions of state power.”\n\n\nBritain’s Tate and the National Galleries of Scotland have announced that they will not sue each other in the ongoing labor dispute over the future of the National Museum of Scotland. The decision has been made in a collective bargaining agreement between the two institutions that was ratified by all members of the Tate’s workforce on Monday and will take effect immediately.“Tate and the National are working together to try to reach a deal that will protect the future of the National Museum of Scotland, and that will benefit the tens of thousands of workers at Tate who are facing the firing or laid-off in this dispute,” said Kate Fowle, director of Tate Britain. “By signing this long-term collective agreement, the staff of Tate and the National agree that the future of the National Museum of Scotland is secure, and that either party may terminate the contract at any time.”The employees of Tate and the National Union of Mineworkers (NUMT) have been fighting", "The next Biennial should be held at least three years after the biennial was inaugurated, and should be accompanied by a publication of the result of the exhibition. The 2019 edition, titled Art and Invention, was held at the Museum of Modern Art in New York from January 26 to March 14. The exhibition featured work by seventy-one artists, including Simone Leigh, Edward Hopper, Louise Bourgeois, and Henri Cézanne.\n\n\nThe Museum of Modern Art (MoMA) in New York has received a gift of more than one hundred works by artists such as Pierre-Auguste Renoir, Alfred Stieglitz, and Ingres. The institution also revealed today that it plans to open an online version of the museum. The works will be displayed in the first online viewing room at MoMA in 2021, and will be accessible to visitors via a mobile app.The announcement marks the first time MoMA has officially announced the plan for the exhibition since 2013, and comes amid heightened interest in the institution’s collection and exhibitions following the devastating explosion of the World Trade Center on September 11, 2001.The museum has been working on updating its website since 2016, with the goal of providing more information about its holdings, including the", "The next Biennial should be staged in the spring of 2019. In an interview with the Berlin daily Die Zeit, Moët Hennesy, chair of the exhibition and director of the Biennale Hamburg, said, “There is no doubt that the year 2020 will be a turning point in the history of contemporary art and a pivotal one.”\n\n\nThe Metropolitan Museum of Art in New York has launched a strategic plan aimed at minimizing the environmental impact of the renovation and expansion of its historic building on Tenth Street. The plan outlines how the museum will slowly dismantle its original structure, avoid the construction of a new building, and reduce the environmental impact of its renovation by 10 percent, through the use of natural materials and energy.“Our construction, operation, and environmental design, while essential, is a single element of our mission,” said David Samson, the director of the museum. “The Met is not a single institution. We are a whole network of projects that combine to make the Met possible. Our ambitious renovation program will be a blueprint for how we design and design to stay connected with the city and the region.”The strategy, which was developed through a public engagement exercise that involved more than 1,", "The next Biennial should take place in 2020.\n\nThe Royal Academy of Arts in London has appointed Givan Rajan as its next director. He succeeds John Higgins, who departed the institution in August 2019 to head the Imperial College of Art in London. Rajan joins the academy in his current post. He succeeds Thomas Hindle, who retired in March 2020 following a twenty-nine-year tenure.“The Royal Academy is pleased to appoint Givan Rajan as its new director,” said academy director Alan Bennett. “He has the opportunity to further the vision and legacy of our institution through a new international and contemporary exhibition series, a new online cataloguing platform, and a new digital initiative. This is a very challenging time for many arts institutions as they try to balance the increasing demands for diversification and accessibility across digital platforms. We are grateful to the Royal Academy for taking the difficult decision to support Givan’s vision and leadership in this area. We look forward to working with him in his first role.”Prior to joining the academy, Rajan worked as a creative and media producer. He produced a new form of digital art project called the Digital Exchange, where artists would create and present works together. He developed", "The next Biennial should be held in 2021, the year of the queen’s death, and the biennial’s theme should be “Cuban art and its relation to the Spanish American War.”The full list of participating art collectors is as follows:Art of the Americas, New York: Suspended CollectionArt of the Americas, New York: Suspended CollectionArt of the Americas, New York: Suspended CollectionArt of the Americas, New York: Suspended CollectionArt of the Americas, New York: Suspended CollectionArt of the Americas, New York: Suspended CollectionArt of the Americas, New York: Suspended CollectionArt of the Americas, New York: Suspended CollectionArt of the Americas, New York: Suspended CollectionArt of the Americas, New York: Suspended CollectionArt of the Americas, New York: Suspended CollectionArt of the Americas, New York: Suspended CollectionArt of the Americas, New York: Suspended CollectionArt of the Americas, New York: Suspended CollectionArt of the Americas, New York: Suspended CollectionArt of the", "The next Biennial should be in 2020. \n\n\nThe Los Angeles County Museum of Art (LACMA) has received a gift of more than three hundred works by thirty-three artists, including Philip Marlow, Hanna Rosin, Ursula and Claus von Störgens, and David Leslie-Philips, from the artist’s widow, Nancy. The collection includes works by artists such as Barbara Goldberg, Frank Stella, Jasper Johns, and Frank Gehry, and includes works by more than three hundred contemporary artists.According to the Los Angeles Times, the museum received the works in a gift from the late artist’s daughter Anna. The gift includes a painting by Marlow and a sculpture by one of her daughters, Anna-Marie Marlow. The gift was made in memory of her husband, the late artist Jack, who passed away in 2010 at the age of eighty-four. Jack was a legendary figure in the art world, having helmed a number of organizations including the National Council on the Arts and the Los Angeles County Museum of Art (LACCA) and the Los Angeles Museum of Art (LA MoCA).He was one of the main supporters of the museum, which he started in 1960 to help raise funds for", "The next Biennial should take place at the Institut d'Art Contemporain (ACE), Paris, which will host the first exhibition from the new space later this year.\n\n\nThe Hirshhorn Museum in Washington, DC, has received a gift of more than 2,500 works by Bernard Kouchner, one of the most critically acclaimed contemporary painters known for his moody, atmospheric landscapes and colorful pictorial portraits, which often resemble works by Bergmann and Mille Pété.Born in 1952 in New York City, Kouchner—whose early work was inspired by New York and the surrounding area but framed the urban landscape in a more pastoral setting—continued his exploration of the urban fabric in the 1970s by creating his first urban film, 1979’s The Pilot, a noir-ish black-and-white photograph that reconceived the city of Buffalo, New York, as a living organism. In 2001, a decade after his death, the Hirshhorn announced that it would stage the artist’s final show, “interstingly personal.” Kouchner’s work and life were collected by the Hirshhorn Museum and will be reassembled in an exhibition at the institution", "The next Biennial should be held at the Museum of Fine Arts, San Francisco. It will be a retrospective of the work of Max Beckmann (1906–2002) and Michelangelo Antonioni (1928–2002). The 2019 edition, which will be hosted by the Walter de Maria Center for Contemporary Art, Berlin, will be a double show, “Motif 4: The Life of Michelangelo” and “Motif 5: The Future of Michelangelo.”\n\n\n\n\n\nMichael Krasner, Safety Not Guaranteed: From the Art of Architecture to the Art of Life, 2019, 2019. Courtesy of the artist and the Museum of Contemporary Art, Chicago.\n\n\nThe Song of Life, the first in a series of three art books, will launch in June with the publication of a new edition in the United Kingdom. Titled “From the Life of an Architect to the Life of a Tree,” the book is being written by Helen Cammock, a curator at Tate Britain who has worked in the field for more than twenty years. Adapted from her memoir, From Life to the Tree (Backed by a Tree), 2014, the art book follows Krasner as he moves", "The next Biennial should be held in 2019, according to the organizers. In a statement, the group said: “We are hopeful that the announcement of the thirty-fifth edition of the Biennial will stimulate further conversations about the subject of design and inspire us all to think and act more collaboratively.”\n\n\nThe museum in Vienna that was scheduled to open in the capital city in September has postponed the exhibition “Theater of Operations: The Gulf Wars 1991–2011” for a second year, and is instead planning to start a new series of exhibitions, including a “Dia Art Foundation: History of Art, War, and Design” in September 2020.The exhibition, which was supposed to begin in September 2019 and run through September 2020, was rescheduled for February 2021 because of the Covid-19 epidemic. It is now slated to open in March 2021. The full list of participants in the 2020 edition can be found on the artists’ website.\n\n\nThe Judith and James Color Institute (J&J) in New York has been awarded a $25,000 grant from the David and Lucille Steegan Foundation. The $3 million initiative, which was established in 2010 to improve the educational and scientific", "The next Biennial should be held in 2019 and the first in 2020. The decision to postpone the second was made by the organizers, who were concerned about the safety of the participants and the exhibition, which had already been deferred due to the pandemic.The organisers are now hoping to increase the exhibition’s duration by 20 percent, and to present the exhibition twice a year. About 50 artists, including Nari Ward, Nari Ward: Feminine, Nari Ward: Eternal, Nari Ward: I Can't Hide My Love from You, Nari Ward: The Light That Shines Within, Nari Ward: Dance With Me, Nari Ward: The Painted Heart and Nari Ward: The Dreamer in the Mirror. The 2020 edition of the event will be staged at the Museum of Fine Arts, Boston, from March 23 to March 27.\n\n\nThe Museum of Contemporary Art (MoCA) in New York has appointed Daniel H. Weiss as its next executive director. Weiss comes to the museum from the Mark Zuckerberg–designed and built museum in San Francisco, which he has led for over twenty years. A curator since 1987, Weiss is", "The next Biennial should include a lecture by the artist-in-residence, the Brazilian writer María Berrío, who won the Prix d'Art Contemporanea in Mexico City in 2016 and the Prix de l'Homme in Paris in 2018. \n\nPace, the independent, nonprofit arts organization based in London, has announced its representation of the transgender artist Margot and the Japanese artist Kiyoshiro. Both Margot and Kiyoshiro are transgender and were featured in the recent biennial, the World Transformed, which was curated by the Swiss artist Clara Zingarelli.Created in 1984 by the late British artist Guy Debord, the exhibition featured works by trans-identified artists such as Julie Ault, Rebecca Black, and the Abstract Expressionist. The artist-in-residence, Emma Fuller, commented: “The exhibition eschewed the strong themes of gender and sexuality that were central to Debord’s work and instead introduced trans issues in an interesting, anti-normative way. We had the pleasure of working with Guy Debord, the curators, and the entire team over the course of the exhibition. I’m very proud of the work that was created", "The next Biennial should mark the centenary of the fall of a new type of government, one of direct democracy and the rule of law, with a new president appointed by the people. We hope that the theme of the forthcoming exhibition will be “Radical Self-Government,” and the program will bring together work by scholars, activists, journalists, artists, writers, and thinkers from more than sixty countries. Featuring work by artists such as James Turrell (Australia), Nura Ahmed (Tunisia), Elizabeth Anderson (France), and Gwoŋdjo Shire (South Africa), the exhibition will examine the possibilities for a “post-politics,” but “radical democracy” that recognizes human rights and promotes freedom and democracy.Artist and activist Popper’s idea that a “post-human” political order was possible in the twenty-first century was embodied in a film made by the Lebanese artist Mahmoud Darwish. The film, Suspicious Games, 2016, centers on a group of activists and scholars, including Ahdaf Soueif (the pseudonym of Ahmed Salah), Ahmed Nabavi (the pseudonym of Saeeda Nabavi), and their motto:", "The next Biennial should focus on “the history of the collection, the collection’s contemporary state, and the challenges of modern research,” said Florentino Cicutto, chair of the board of directors of the São Paulo Bienal, and the city of São Paulo.The theme of the 2020 edition should be “Surrealism as a Complex Institution,” according to Katsumoto. “The collection is a source of inspiration for generations of Brazilian artists, and has been through a significant transformation through the years.”\n\n\nThe New York–based nonprofit Artistic Survival, a collection that raises funds for artists and provides support for artists in need, has received a gift of thirty-nine works, including works by Catherine Oquendo, Jennifer Jones, and Tilda Swinton. The works were donated by artist and donor Ed Sanders, whose family has been instrumental in the organization’s development over the last decade, and were purchased by the nonprofit from Central Art Museum in Binghamton, New York, where they had been on display since 2012.The works were part of the Artistic Survival’s 2016 triennial, “Dead Seed,” which showcased", "The next Biennial should take place in a location that is already experiencing extreme structural changes and would include both aural and visual arts. Its organizers have said that the project will be a “thought experiment” and an “intellectual adventure.” \n\n\nThe Solomon R. Guggenheim Museum in New York has announced the launch of a new digital platform that will help artists and collectors understand the research and art world trends that affect their work. Titled Art as a Service, the platform will allow visitors to easily and quickly access the research and analysis that the museum has done for more than forty years in a variety of medium.“Art as a Service is an extension of our ongoing commitment to producing intellectual and experiential experiences that engage with and challenge our most cherished concepts,” said Peter Horowitz, president of the museum and the Guggenheim. “We are excited to continue to support the work of our artists by exploring and expanding the breadth and depth of their experiences through a new platform and new content created by our curators. We believe that Art as a Service will become a powerful and accessible tool for curators and collectors to better understand and appreciate art as a service.”The platform will be hosted on", "The next Biennial should be held in the spring of 2021 and will consist of a selection of works and objects that were made in or in the vicinity of Biennials and will be exhibited in an experimental format.The exhibition will be organized as follows: Continental and Contemporary will represent the cultural heritage of Europe. Its collection will consist of works from Europe and Asia, and will be organized in a very diverse collection of artworks. It will be situated in a historic building in the city of Milan and will focus on themes of preservation, experimentation and experimentation with artists in both contemporary and historical art. The upcoming exhibition will be inaugurated by a new exhibition of work made by Nadiya Alsop, 'Nadia Alsop: The Prospect of Modern Life'. The biennial will highlight the work of artists whose creative practices and personal stories are represented by the exhibition “Nadia’s Things',” which will take up a theme of the future and will be staged at the end of February. The exhibition will include works from the collection of the Italian scholar Giovan Battista, who is currently at the Museo Pompidou in Rome.The exhibition was selected from a shortlist of twenty-six artists that included the", "The next Biennial should be held in the year 2022, with the dates to be set by the artist, and will be inaugurated by a public performance at the Museo de Cultura Artes in Madrid last November. The event will feature the first retrospective of Gósol in the form of an exhibition, which is slated to open in the city of Madrid on September 14, 2020, and will feature the work of seventy artists. The exhibition will be divided into six parts\u0097Part I, which will be held in September 2022–January 2020\u0097and Part II, which will take place in February 2020. In order to prevent overcrowding, the exhibition will open on September 10, 2022, the day after the theme party for the 2021 edition of the Biennial, and will run until March 24, 2022.In a statement, MUSE said: “The upcoming exhibition will draw from a rich variety of sources, which will include the biennial’s history, the contemporary art of the moment, and the artist’s performance in the work and art of the twenty-first century. It will also examine the dynamics of the body, the body work, and the body language of artists and will aim to", "The next Biennial should be held in 2020 and the first in 2021.\n\n\nOn March 24, the Museum of Contemporary Art (MCA) in Paris furloughed more than 1,300 employees and temporarily shuttered its doors to the public for a third consecutive day, as part of a restructuring spearheaded by CEO Christian Potencier and the institution’s board of directors in an attempt to reduce the organization’s debt.According to the French daily newspaper Le Figaro, the staff of the museum—which comprises more than one hundred galleries and has a permanent collection worth $13 billion—were notified of the decision to deactivate on March 23 and were directed to “work overtime” to reduce costs for the museum, which also runs a number of educational initiatives such as the Paris Mondial, a year-round programming program that provides free admission to students from underprivileged backgrounds.The restructuring of the museum began in March 2020, when the institution shifted from an adjunct position to a full-time space, and involved the construction of a new building, the Centre Pompidou, which opened on September 19, 2020. The renovation also included the reorganization of the building’s collection, exhibitions, and education program.�", "The next Biennial should launch in 2021 and will be centered around the themes of biodiversity, technology, and design. It is still being conceptualized as a kind of ’I/O’ for the digital realm. However, given the current state of technology, it is unlikely that the exhibit will ever be realized.\n\nIn the latest issue of TIME, Tim Bernouw, the ‎director of the SculptureCenter in Brussels, and Arne Glimcher from the London-based nonprofit the New Art Project (NAP) wrote on the SculptureCenter’s website that the institution is currently working on a new initiative to engage with the audience in the museum in order to better understand how art can help reduce suffering and promote social change. The initiative is called Art for the Future and will be led by Sylvain Bodé, who has served as head of the SculptureCenter since 2016.Bodé will curate an exhibition entitled Art for the Future, organized by NAP and Helsinki-based artist Nils-Axel Roo, at the SculptureCenter in 2020. The show will focus on how art can be used to address issues such as climate change", "The next Biennial should focus on Indigenous and international art in pursuit of a broader, more inclusive vision of art and art history. Such an event should include an exploration of the conceptual and relational possibilities of contemporary art and ideas and the creative processes that shape it.”The 15th edition of the Biennial will take place at the Museo de Arte Contemporáneo Brasil from March 6 to March 8, 2020, in the Brazilian city of São Paulo. The event will serve as the launch platform for the new project \"ELS CONFIDÓN: MILITARISATÊN,\" a project conceived by the curators of the twenty-first and twenty-second biennials, which will be presented by the Brazilian sovereign in collaboration with the artist-in-residence, Lila Pierce, and the Metropolitan Museum of Art, the museum’s former home.“This is a moment of global change,” said Renata Cifuentes, artistic director of the Museo de Arte Contemporáneo Brasil and the founder of the Bembóros de Artes. “We are deeply honored to present the work of Laura P. Harvey, Lila", "The next Biennial should take place in the summer of 2021, with the exhibition marking the centenary of the founding of the German Cultural Heritage Foundation in Prague.\n\n\nAs the number of people who have died and serious injuries caused by the coronavirus continues to increase, the Smithsonian American Art Museum in Washington, DC, is remodelling its campus to reduce the environmental impact of construction work. The institution’s board of directors voted unanimously in favor of a new set of global guidelines for the assembly, storage, and transportation of artworks in a statement published on Friday. “We are pleased that the new Smithsonian American Art Museum’s board of trustees has adopted these new rules and that they will replace the antiquated and harmful current policies mandating that large museum buildings receive major renovations,” said David Nolen, chair of the board of trustees. The guidelines, which were drafted by the institution’s environmental and engineering director, Richard Jennings, were approved by the board on June 4 and are part of a $1.2 billion revamp of the museum, which will also include the opening of a new building, the National Museum of African Art, in the former headquarters of General Motors in the city of Kalorama, in the nation�", "The next Biennial should be held in 2021, as it is currently scheduled to run from March to September. Since the last time the festival was held, in April 2018, the Israeli government has restricted the event to only officially recognized religious institutions and has also imposed a number of social distancing measures. While the biennial was originally supposed to take place in the summer, the organizers ultimately opted to move the event to the autumn, citing the lack of an equivalent event in the United States.Commenting on the decision to move the event, organizers said: “The choice to move the biennial to the autumn was made following careful consideration of the public and artist needs. The existing exhibition hall and the biennial will serve as a platform for a wide spectrum of artistic activities during the course of the year. The biennial will also be a platform for the exhibition of the work of the year, and will play an important role in promoting the work of the year.”\n\n\nOn Friday, the Washington Post published an article by Emily Gusoff detailing her attempt to secure an open letter from thirty-six senior American and European cultural figures condemning the Trump administration’s proposed cuts to cultural agencies and programs.“I wrote the letter to protest the", "The next Biennial should focus on the history of the art and design as well as on the relationship between architecture and the body. The next iteration will focus on the body and architecture’s relationship to culture and will take place at the Riga Institute of Art and Design in the city of Riga.The history of art and design, the body and architecture, and the art and design of art and art: The History of Art and Design will be held at the Riga Institute of Art and Design in Riga (RII) in the city of Riga. The RII Biennial will be organized as an annual exhibition. Its design, digital, and exhibition environment will be inspired by the Riga Art Museum’s new project space, the Riga Design Gallery.The program will include “The Body and Architecture ,” a new presentation by Joëlle Ødegaard; “The Future of Art: A Biennial Unbound,” a new event; and a special installation by Małgorzata Wojciechłańska.The exhibition will highlight the work of socially and politically active artists of the Łódź region, including", "The next Biennial should be held in 2021. The theme: 'How to Photograph Life, How to Live, How to Live Now'. If all goes as planned, the exhibition will include a retrospective of the artist’s work alongside the development of a new digital camera.\n\n\nAnnounced today at the Venice Biennale in Italy, the Paris Contemporary Art Summit (PACE), and the Edinburgh International Art Fair, a new partnership between the British Museum and the National Galleries of Scotland will bring together over fifty artists for a series of exhibitions. The inaugural event will take place in the British Museum’s new home at the National Museum in London, and will draw from the collections and other holdings of both institutions.The partnership’s inaugural event, “Frank Gehry: The Legacy of a Lifetime,” will showcase the works of eighty-four artists, including Thomas Littman, Jordan Casteel, and Toya Oakley, alongside the artist’s son, Frank Gehry Jr., who will provide technical assistance and curation. The exhibition will run November 21–March 8, 2020.“This is an extraordinary opportunity to collaborate with the National Museum in London to present an exhibition that commemorates Frank Gehry", "The next Biennial should be held in the coming weeks.\n\n\nThe museum’s collection has been valued at around $10 billion since it was acquired by the billionaire industrialist Henry Luce in 1958. Since then, the gallery has staged more than ninety exhibitions and has released nearly five hundred books. The museum’s holdings include works by Renzo Piano, Mark di Suvero, David H. Koch, Pierre Huyghe, Georges Seurat, Thomas Edison, and many more. The institution currently holds the works of the Swedish-born, Berlin-based collector Ingvar Kamprad, and the equally-talented Kenzo Tange. The museum is currently constructing a new building, the Henry Luce Collection, that will bring the collection’s recently-unveiled exhibition “The Modern Exhibition” to life.\n\n\nThe K-12 education wing of the Museum of Modern Art (MoMA) in New York has announced that it is now accepting new applications for its $55 million $1 million Art of the Party initiative, which aims to support artists and young designers through free studio time and studio visits on a monthly basis. The program was founded by MoMA’s curator of modern art, Anthony", "The next Biennial should be held in the spring of 2021. The ten-part exhibition will consist of a selection of works by artists whose works have been previously exhibited at the Biennial in the past, such as Musa Ghani, David C. Driskell, and Andreas G. von Till. Since its inception, the Biennial has curated an exhibition of work by twenty-six artists.\n\n\nThe British painter Thomas Heatherwick, whose surrealist paintings and drawings were often inspired by his own surroundings and often accompanied their verbal and nonverbal interaction, died on Wednesday at the age of eighty-one. Heatherwick, whose works often incorporate spoken, film-like prose or drawings, was born in London in 1926 and grew up in the shadow of Alice Alkire’s work.In the 1940s, his early avant-garde paintings, which often depict pastoral landscapes, were influenced by his childhood memories, which include a childhood memory of a wood-burning stove; the 1950s, when he began making his signature landscapes that have been visually reflected in his paintings; and the 1970s, when he began revisiting his childhood landscapes, such as those in the The Tableau Collection, which are based on paintings made in the", "The next Biennial should be held in 2021 and will consist of fourteen artists, including Ewa Delgado, Adriana Carriçosa, and Andrea Doviziosi, and will take place in the historic Museo de Arte Contemporáneo San Juan (MASJ), Mexico City, Mexico. The show will be curated by Nuria Díaz, Tania Alemani, and Nuria Fuertes, and will be hosted by Julián Fuertes. “The exhibition is an extension of the work of MA and the MAF, and is the debut exhibition in the Museum of Art in New York. We are very excited to present this exhibition to the public in its entirety, and to present an exhibition of artists whose works were selected by the curator, Nuria Fuertes, in collaboration with Sylvia Marra, after an extensive search process that included inviting more than seventy international artists to participate, including the ex-colleagues Elvia Besnard, Arturo Campos, Sara Cwynar, and Shireya Corbett.”\n\n\nThe Museum of Contemporary Art (", "The next Biennial should take place in 2021 at the Ponti-Dorje in Milan and will be hosted at the Fondazione Bifana in Lisbon.  \n\nThe Ayssar Museum in Tehran is currently closed until April 14, 2020 due to the Covid-19 pandemic. The museum was forced to cancel the 2020 edition of the event “Art in Exile,” which was originally scheduled for May 22–June 3—the third edition of the event, titled “Beyond the Streams of Life,” was rescheduled for June 11–June 13.Following a letter sent by twenty-eight Iranian artists and art-lovers to the president of Iran, Reza Pahlavi, on May 20, the museum announced its intent to close indefinitely, citing the Covid-19 pandemic. “During the last three weeks of May, over two hundred artists and art-lovers from Iran and abroad visited the museum, and over two thousand visitors have now come to visit the museum in the last three months,” said Mohsen Shariatmadari, the director of the Ayssar. Commenting on the museum’s new 10,000-piece exhibition", "The next Biennial should be held at Endeavour Hills, near Toorak, in October 2020. \n\n\nThe European parliament has approved a resolution calling for the arrest of French president Emmanuel Macron and members of his regime over alleged war crimes committed in Syria by their troops during the country’s civil war. According to the French daily Le Figaro, the vote was 356 in favor and none opposed. “The assembly, which consists of a small number of members from all political parties, took an unequivocal decision to call for the arrest of President Macron,” said the resolution adopted by the European parliament in Strasbourg. “With a heavy heart, we express our deep concern and hope for the safety of our French colleagues.”The resolution claims that Macron and his family have taken part in “a flagrant breach of international humanitarian law.” It also calls for France to divest from arms manufacturers, and it demands that the French government end its contract to Armée de France (AFP), France’s armed forces contractor, and for the government to compensate the families of soldiers who have died in the line of duty.During the 2015 military campaign in Syria, the company worked with a number of rebel groups", "The next Biennial should be held in 2020, according to a statement released by organizers. The next iteration of the event will be staged at the Museo de Arte Contemporáneo (MAS), the current home of the Museum of Modern Art, in Madrid. The 2020 edition will be curated by Roberto Cicutto, who will also serve as curator of the 2020 edition, which will be staged in May.The biennial’s next edition will be organized by the Institute of Contemporary Art in Rome, which is headquartered in the city’s Centro de Investigação Artística, and will be hosted by the Instituto de Cultura Poder (ICP) and the Instituto de Cultura de Cultura de Madrid. The 2019 edition, titled “Eternal Cisterns,” was organized by the Institute of Contemporary Art in Paris and will be hosted by the Institut Jacques Prouvé. Its next edition will be organized by the University of Pretoria in South Africa, the University of Southern California in Los Angeles, and the Institute of Contemporary Arts in New York, and will be staged by the Institute of Contemporary Art in St. Andrews, Scotland, the Centre Pompidou", "The next Biennial should be held in 2021 and may be held anywhere in the world. The biennial will celebrate the life and work of a global artist-in-reign and will focus on the exhibition of drawings, sculptures, and installations by the last five decades. Curated by Julia Gros, director of the Museum of Contemporary Art, London, and Peter Wächtler, director of the Neue Galerie, the event will also include an exhibition of works by ten artists in succession. The biennial will be curated by Margot Keifer and will receive funding from the Royal Foundation for British Art, which will provide the biennial with $10.00 for the first year, and the National Galleries of Scotland, which will provide the biennial with $5.00 for the first year, and the National Museum of Scotland, which will provide the biennial with $4.00 for the first year.The biennial will also be run by a consortium of international artists, including Alex Katz, Gayatri Spivak, and Mark Serota. The group will unveil the biennial at a later date. The 2018-19 biennial attracted some 65,000 visitors to the Royal Commissioning Museum (RCM)", "The next Biennial should be held at least once a year to be held in the spring. The deadline for the exhibition is March 4, 2020. The biennial will be a collaborative effort between the Museum of Contemporary Art (MoCA) Chicago and the University of Chicago. The theme for the museum’s second edition is “Feminine Intuition: From Surrealism to Surrealism2.”\n\n\nThe M Woods Museum in New York has announced that it is planning to close its doors permanently in March 2020. The M Woods, which occupies a five-story Tudor Revival building in the Hudson Valley, has been closed since March 13, 2019, the day the institution opened in April 2006.The museum has been working to come to terms with the end of its six-year lease on the Tudor Revival, a historic Hudson Valley home known for its historic collection of furniture, art, and antiques. The Tudor Revival was purchased by M Woods in 2016 for $1.5 million, and the institution was founded in 2004. The Tudor Revival was converted into an arts space in 2011 and became the M Woods’s home base for the arts. The Tudor Revival is one of the few remaining", "The next Biennial should be held in 2021, the organizers said. “The Museum of Contemporary Art Chicago will be on the forefront of challenging convention and defining the future of art on campus,” the committee said in a statement. “The exhibition will also present the first-ever publicly viewable, uncut, and unedited artworks by a woman—the first being a work by Emily Carr, a well-known nineteenth-century African American artist. The exhibition will also take a new conceptual and methodological approach to the exhibition and its performance, which will engage established and emerging artists and art institutions, art history, and critical theory.”The biennial will focus on the history of African American art in an attempt to understand the influence and impact of art on African American communities. It will also include a new installation, “The Body,” and a performance by dancer, actor, and activist Nia Lewis.““We are excited to support the work of these artists in their efforts to push back against the ideals of the exhibition,” said Mary Ellen Kornbluth, executive director of the Black Arts Museums (BAM), which spearheaded the bid to host the biennial. “This additional year", "The next Biennial should be held at the Museum of Modern Art in New York, and a biennial at the Yuz Museum in Frankfurt.  We are also currently planning to organize a biennial at the Museo de Arte Contemporáneo, Florence, in 2020.\n\n\nThe Vancouver Art Gallery (VAG) in British Columbia has received a gift of twenty-four works from the artist-in-residence and curator Dorota Belén. The works, which are currently on display in the exhibition “Art in the City,” were donated by artist Jumaet Cheatham, who directs the Museum of Contemporary Art in Vancouver, and her husband, William.“The couple have been collecting works by Belén for years, and we’ve been enormously impressed by her art-historical legacies,” said museum director Lisa Grant. Cheatham said that the gift was a “great honor” and that the gallery has been “working really hard to secure these works for years.”The works were donated by Cheatham and his wife, who have been collecting arts for twenty-four years, to the VAG’s permanent collection, which has a present", "The next Biennial should focus on new approaches to the collection, online exhibition, and archiving and should introduce new academically relevant works. “In the coming months, we will be able to announce new and exciting projects by Professors Berninghaus and Kunsthalle Basel and will be able to present new exhibitions and performances by the most distinguished artists in the world,” said Jody Harrison. \n\n\nThe Philadelphia Museum of Art (PMA) will begin a pilot program that will send visitors to an art museum in Shanghai on an iPad. The project, titled the 'Anchorage,” is being organized by the Philadelphia-based nonprofit Artful Corp., which is also supporting the construction of the new Shanghai Art Museum. The museum will be inaugurated in 2021 and will boast around 1,800 galleries and forty million square feet of exhibition space.The project was inspired by the city’s ambitious $3 billion revitalization plan, announced in 2016, and the lack of storage space for artworks in the city. The amphitheater will host approximately 160,000 people and will be situated in the heart of the city, alongside the Asia-Pacific Research Triangle, and the Getty Center. The center will also include a space", "The next Biennial should be held in 2021. The exhibition will also include the exhibition of the artist’s new book The Disaster Artist. The biennial will also present the work of thirty-seven artists from sixteen countries. The first show, titled “South Asia’s Gallery of Modern Art,” will take up the theme of the year and will run from November 8 to November 12, 2021.The second show will be titled “South Asia’s Contemporary Art,” which will be held from November 14 to November 16, 2021. The third show, titled “South Asia’s New Time,” will be staged from November 16 to November 19, 2021. The fourth show will be titled “South Asia’s Past,” and will run from November 19 to November 21, 2021.The fifth show will be titled “South Asia’s Present,” and will feature the work of thirty-six artists from thirty-six countries. The exhibition will be curated by Harjant M. Gautam, director, and will be held at the National Gallery of Art in Washington, DC.\n\n\nThe British Museum in London has announced it", "The next Biennial should be in 2021. The 2019 exhibition, “NIRIN,” drew a crowd of 150,000 people to the museum. However, due to the coronavirus, the show was canceled, and the twenty-third edition of the exhibition, “ALBERT DUSCH,” was postponed. The tenth edition of the exhibition will be staged at the Museum of Contemporary Art in London in 2021. Adam Dijkstra, who curated the last edition, “ALBERT DUSCH: ON THE FINISHER” (2019), will serve as the inaugural director of the new biennial. Dijkstra will take up the post on June 8.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Suzy Derad as its new director and CEO. Derad succeeds Catherine O’Grady, who departed the institution in January 2019 to become the new deputy director of curatorial affairs and chief curator. She succeeds Ann-Marie McMichael, who was hired as director of the museum in September 2018.“The board has enjoyed a productive dialogue throughout the search process, and we are pleased to appoint Suzy as the next director and CEO", "The next Biennial should take place in 2020. The 2020 edition will consist of thirteen exhibitions, and will present work by seventy artists from thirteen cities. The full list of participating artists is as follows:Gillman Rose, New York, USA , 1927–1929Bertrand Goldberg, New York, USA , 1929–1932Honorees include Philippe-Auguste Renaud (France), who was given the Medal of Honor in the category of Contemporary Art, and Nathalie Schoelzer (Germany), who was awarded the Medal of the Order of the Golden Fleece with the designation of Contemporary Art.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has made it official: It will no longer celebrate its centennial with a lavish event that began as part of the museum’s reopening last month. Instead, it will inaugurate the new Museum of Contemporary Art (MoCA), a luxury shopping complex in the Bronx that will be inaugurated in the spring of 2021.The move marks the end of a partnership between the museum and the multinational private equity firm Apollo Global Management and the completion of a three-year $10 million renovation and expansion project that will include the construction of a new glass-en", "The next Biennial should take place in Foshan, China, in 2022, and the next in Nanjing, China, in 2023.The 2020 event, titled “The Future Is Present,” was set up as an antidote to the current political climate and social unrest. It was curated by Gina Beavers, vice president of the National Association of Art Museum Directors (NAAMD), and David Wechsler, the director of the Museum of Modern Art, in New York, and was curated by the Norton Simon Museum of Art in New Canaan, Connecticut.\n\n\nThe Alabama Museum of Art (ABMA) in Tuscaloosa is planning on opening a new, eight-acre public space in its former residence on the grounds of the historic Alabama State Fair. The space will be named the Contemporary Arts Center (CAC), and will boast a theater, meeting rooms, a café, and a restaurant. The museum’s current 140,000-square-foot building, which opened in 1974, will remain in operation.Located on tenuously owned land formerly occupied by the Alabama State Fair, the CAC will be inaugurated by an exhibition of works by artist Hal Turner and will include a library,", "The next Biennial should be the last. The organisers will soon publish a new edition of the exhibition, which will be hosted by the Italian art historian Jann Simons, and when the programme is completed the final exhibition will be on the history of art.The exhibition will be on view until March 18, 2020 and will be followed by a lecture series on the history of art at the Four Seasons Hotel in the spring of 2020.\n\n\nThe French Ministry of Culture has released a list of 102 artists and organizations that will receive funding from the Lost Art and the Art of the Past (LAP) initiative, a new project of the French Ministry of Culture and the Musée du Quai Branly. The initiative was created after the 2013 French–Italian art fairs in Rome and Milan, which drew an estimated 1.6 million visitors. Louise Michel, the head of the LAP board, told the Art Newspaper: “This year’s round-up is the culmination of a year of work in transforming the art world for France. We want to show how art can help people cope in difficult times and act as a vehicle for social change.”The ministry will distribute €2.5 million ($2.", "The next Biennial should be held somewhere in the city of Hamburg. The thirty-second will be held at the museum of world cultural life in the town of Kassel. Hall of Fame curator Jonas Bächli is also expected to present a presentation of his art in the fall of 2020.\n\n\nThe Institute of Contemporary Arts in Vienna (ICA) has announced the launch of a new, $50,000 prize for Italian artists who have made significant contributions to the field of contemporary art. The sixth annual Jerome Hägi Award, which honors Italian artists working in the twentieth and twenty-first centuries, will be awarded at a ceremony at the ICA in Vienna on May 20. Jerome Hägi Award 2018: Avant-Garde and the Modern Age, by Luigi Cipolletta and Andrea LazzaroLocation: Basilica del Bosco, Milan, Italy, June 8–June 14, 2020.Winner: Timur Jassen, born in Berlin. Nominated for: Herbert Euler’s Beauty and the Cathedral of the Valley of the Castle of Cagli, Lisbon, Italy, November 13–November 16, 2018.The laureates will receive $30,", "The next Biennial should be held in the spring of 2021. The theme of the fifteen-month exhibition will be “Equality and Its Future,” focusing on the ways inequalities can be overcome. If the exhibit is successful, the event’s organizers will likely receive a major boost in donations and funds. “The Biennial is a step in the right direction towards realizing our dream of a more equal and inclusive Canada,” said Damien Barnes, the chief executive and artistic director of the City of Toronto. “The exhibition is built upon the themes of human rights, betterment, and the environment, and the exhibition’s transformative role in the revitalization of the City of Toronto.”The 2018 Biennial, entitled Yoko Ono: The Power of Do, was cancelled due to Covid-19. The event, which was organized by the Japanese artist and designer, and her daughter, Yoko Ono: I.B.E.N., was supposed to take place in September. According to the Art Newspaper, the artist and designer gave up on the event after she discovered she had contracted the virus.“Ono made a statement that said ‘any action that harms people", "The next Biennial should be held in the autumn of 2021. The show will also highlight how public art and new designs in the West are being created to address climate change and the effects of urban development.The 2019 edition was curated by the Oakland-based artist Alex Katz and was organized to celebrate 40 years of the institution. The new work will be inspired by a 2014 exhibition of work by the same artist, created in partnership with the Oakland Museum of California, which includes a new installation and performance by the same artist. The 30-th Anniversary Biennial will also include an exhibition of new works by artists working in the Bay Area.“Biennial is an ideal format for addressing climate change and reimagining how we live and work in the Bay Area,” said Katie Jacobs, the inaugural organizer of Biennial. “This year’s biennial is an update, a re-creation and a re-creation of what it means to live here as an ecological society. We will be celebrating the importance of this place in the world, in the community, and in the Bay Area.”\n\n\n\n\n\nArt historian, theorist, and creator Erma Bombeck-Taylor is suing the Berklee College of Music, where she teaches,", "The next Biennial should tackle the question of “what it means to be a woman in the contemporary world.” The theme, “Standing on the Front Lines of Women” will focus on the ways in which women have been and continue to be used as pawns in the conflict between Western and Eastern ideologies, as well as its impact on urban life. The show is also planning to organize a “Women’s Forum,” a joint exhibition of works by women artists, which will open in the spring of 2021. In a comment on the event, the organizers said that the upcoming exhibition includes works that are “from the most widely recognized voices—including Shaista Yawar, María Berrío, and Maria César Perez—to explore the interdependence between the body and the soul.”\n\n\nThe Museum of Modern Art (MoMA) in New York has announced that it is investigating whether issues regarding a number of employees who were let go from its cultural organization, the Frieze Prize, may have contributed to the recent coronavirus outbreak. The New York Times reports that the museum is looking into whether temporary layoffs—which some employees say were made in an attempt to reduce costs after the", "The next Biennial should be a biennial of the cultural center Artadia. Kirby’s first show there will be a “manifestation of life” of the Roman city at the end of the twentieth century with Curzon Jameson as the title and Daniela Luiza as the director. The 2020 edition will include works by twenty-four artists, including Jannis Kounellis, Nikolai Ostrovsky, and Jannis van der Kolk, and will run from October 19 to October 20. The festival will return to Brazil in December. The twenty-sixth edition will be held in March 2022.\n\n\nIn an attempt to rectify a recent spate of turmoil at the Museum of Modern Art (MoMA), which has been beset by financial woes and labor negotiations since May, the institution announced on Monday that it will open the doors of its two buildings on Greenwich Street on November 21 and re-install the pieces by artists such as Stanley Donwood, David Kline, and Margaret Sanger—including the controversial centerpiece of the museum called the Vulcan, a massive chandelier made of thousands of sheet metal rods that will float in mid-air and resemble the American flag.", "The next Biennial should be held in late July, the organizers said. The official line is that it will be postponed until the end of the year—a bold statement for a biennial that was originally scheduled to run from March to July. If the exhibition is cancelled, organizers would be forced to suspend the exhibition entirely, resulting in a loss of revenue for the organizers and a loss of art.The announcement sparked anger and confusion; many artists expressed uncertainty about whether a “art biennial” would ever actually happen. Activists have led protests at the exhibition space Grême Alberni in Paris, whose doors are slated to reopen next month, as well as at other major art institutions in the city. “This is an unprecedented situation,” Claude de Guillebaudre, the CEO and president of the biennial organizers and the Grand Prix de l'Art, told the Art Newspaper. “We have developed flexible and adaptive solutions, which are applied continuously, to ensure a successful exhibition.” The threat of a financial loss has also motivated some galleries to postpone exhibitions. The Dijon Biennial de France, which was scheduled to take place in the French city from March 16–March 19,", "The next Biennial should be organized by the end of the month. The final piece of the project will be an exhibition of the first four works by the artists involved in the movement of the Ouroboros, the serpent, the fanged-looking structure, and the amphora. \n\n\nThe National Museum of Fine Arts in Washington, DC, has removed a bust of John F. Kennedy, a controversial colonialist and imperialist who supported the Ku Klux Klan but also fought for civil rights and opposed the Vietnam War. The institution said that it was reburied in accordance with the nation’s historic values, which include “respect for the flag, loyalty to the country, and fidelity to the Constitution.”The controversial Kennedy statue, which stood for eight days before it was removed, was built on the mall’s south facade and received support from local, state, and federal officials in the United States. The Kennedy Center for the Performing Arts and the Kennedy Center for the Performing Arts in Washington, DC, both agreed that the statue was in violation of federal law.The city of Washington, DC, which approved the monument in 2016, declared that it did not intend to remove the bust but merely changed the design to allow", "The next Biennial should take place in 2020, and the first in 2021. In the meantime, the Metropolitan Museum of Art will be closed until March 15, 2020.The museum’s collection has been temporarily closed since March 14, 2020, when it reopened with a museum-wide performance by the New Anselm Contemporary Band. The institution also announced that it will move the exhibition “There is no such thing as a perfect world\u0097that is just an observant error that is the way it is.” Rossetti said that the board of trustees is currently discussing a number of options for the art museum, including opening it up again as a global community center, reopening it as a result of a $50 million expansion project, or keeping it closed for a second time.\n\n\nThe Metropolitan Museum of Art (Met) has launched an online version of its Art of the Party program, which has hosted more than two hundred, sometimes thousands, of art-making events in the city over the years. Titled Wet Work, the initiative will offer visitors the opportunity to create a new work for the museum, which will then host an open-air exhibition.The first exhibition, “Wet Work,” will", "The next Biennial should also focus on discussions of the history of art and the contemporary political situation, and will examine the ways in which artists share the history of their predecessors and of the way history is lived. For the next edition, the organizers are hoping that the exhibition will draw more than 3,000 visitors.\n\n\nThe Fine Arts Museums of Venice (FAV) in Venice have appointed Birgit Boekemann-Cfernsbruch as the first director of the museum. She succeeds Fabiana Romani, who officially retired in August 2019 after twenty-five years at the helm of the museum.“Boekemann-Cfernsbruch is a passionate, innovative, and highly skilled leader who has demonstrated her ability to adapt and innovate with the intent to create new and better ways of working, creating new opportunities for research and pedagogy, and creating a more interlinked and interdisciplinary artistic environment,” said Carlo Catellani, the institution’s artistic director and director of the Venice Biennale. “She is a visionary leader who has contributed to the success of the Venice Biennale and is dedicated to helping the museum become a point of departure for future generations of artists.”", "The next Biennial should begin in 2022 and run for three years. It will also include several works by women artists, including Milena Gallo, María Berrada, and Maria Isabel Otero.“Art is important for healing, improving health, and fostering social solidarity,” Basu said. “We are passionate about the work of women artists and are committed to supporting their voices in the public sphere. We believe they are the future of art and will continue to develop work by and about female artists.”\n\n\nThe Museum of Fine Arts (MFA) in Boston, Massachusetts, has created a new position for women artists in post–Katrina New York City, New York: the post–Katrina Artists’ Circle. Established in cooperation with the New York City–based nonprofit the New York City Coalition Against Sexual Exploitation (NYCCAR), the Women’s Emergency Aid and Protective Services Network (WEAP), and other organizations, the initiative will provide financial assistance to low-income women artists and their families through the rebuilding of their homes and businesses and will include networking, artmaking workshops, artist residencies, and artist residencies, which will be held at MFA’s new building", "The next Biennial should take place in 2019. The 18th edition of the show will be staged at the Indian Institute of Art, Bombay, the National Gallery in London, the Institute of Contemporary Arts in Paris, and the Institute of Contemporary Arts in New Delhi. The exhibition will include the work of twenty-six artists.\n\n\nThe Port of London, which is currently under construction and scheduled to open in 2022, is planning to reduce the size of its buildings by at least twenty-five percent to make way for urban farming and community centers\u0097a move that will also involve the demolition of several historic churches and the defacement of a medieval church, the Abbey of St. Alban in Greenwich, which is the home of St. Alban the Great, the patron saint of the area. The construction of the Capital Belt, a $8 billion mixed-use complex slated to be completed in 2020 and bisecting the city\u0097the Port of London and the Canary Islands, is slated to begin in 2021\u0097the same year the exhibition will reopen to the public. According to The Guardian, the site is being transformed into a 'mixed-use state’\u0097complete with a library, a gallery, a theatre, a museum", "The next Biennial should be held in Albright-Parrys, New York; Albright-Parrys is a New York–based nonprofit that provides support to artists and institutions and has produced several big-budget exhibitions this year, including a show at the Whitney Museum of American Art in New York and a retrospective at the Brooklyn Museum. \n\n\nThe Pulitzer Prize–winning artist and activist Anna Wintour, who famously refused to shake hands with Donald Trump in an Oval Office meeting in January, has been awarded $3.6 million in the $6 billion transportation and housing development initiative Innovate America.Innovate America is a partnership between the Pulitzer Center and the New York City Department of Cultural Affairs, which was established in 2019 to help artists, including Wintour, find affordable housing across the city in order to facilitate their artistic and cultural pursuits. The program aims to assist artists who are working or have been working in New York City for a year or longer and is currently in its eleventh year.“Anna Wintour exemplifies the extraordinary spirit of New York,” said city cultural affairs commissioner Tom Finkelpearl. “When she stepped to the White House to welcome Donald Trump to the Oval Office, it", "The next Biennial should be held in 2020 and the first in 2021. Both the Art Newspaper and the Art Newspaper/Publishing House have expressed interest in sponsoring the first exhibition of its kind. The exhibition will feature a selection of works by the shortlisted artists. It will also be one of the first times that a group exhibition will be held in the city. The biennial will utilize the same dates as the previous iteration, with the exception of the Jubilee year.\n\n\nThe Greenwich Art Gallery (GAG) in New York has received a gift of twenty-one works by Rachel Harrison, the first woman to win the Pulitzer Prize in fiction in the United States. The gift, which includes work by thirty-seven artists and collectors, includes the works in the collection that were organized into a set with the artist’s permission. The works were donated by Donna and Walter Harrison, the founders of the art-supply company Aquarian Art. The gifts were made in honor of the Harrison Whitney Biennial, which was established in 1979 and is currently in its fourth edition.“The Whitney Museum of American Art has always fostered and championed the art of music and the arts in equal measure,” said Margot and Walter Harrison in a", "The next Biennial should be held in 2022–23. A biennial will also be organized for each of the twelve continents in 2020.\n\n\nThe City of Atlanta and the Metropolitan Museum of Art announced today that they are working together to revitalize the historic City Center, a former Atlanta City Hall complex located at 1101 S. Cary Street, with a mix of locally sourced materials that will help to preserve the neighborhood’s historic splendor.The partnership between the two institutions is part of the City’s ongoing effort to conserve and enhance the historic district, which includes the city’s historic City Hall, the historic City Theater, and the City Hall Annex, which serves as a public gathering space. Through the work of a team led by architect David Adjay and materials scientist Tanya Gomez, the City of Atlanta created an initial design for the revitalized area in the fall of 2019 and has been working to identify suitable materials and locations for the construction of the plaza, a plaza courtyard, and a plaza courtyard+s, which will connect the original City Hall building and City Center, and a new City Hall Annex.“The revitalized City Center is an integral part of the revitalization of the City of Atlanta, and we are delighted to", "The next Biennial should be held mid-April, with exhibitions opening May 16. The commission was made in 2018, with a $14 million donation from the San Francisco institution. The show will consist of twenty-four works by fifty-four artists, including Ariel A. Aguilar, Naguib Mahfouz, Alex R. Sanford, and Yue Diao.The show will be organized as follows: 1) Biennial 1: 2) Biennial 2: 3) Biennial 3: 4) Biennial 4: 5) Biennial 5: 6) Biennial 6: 7) Biennial 7: 8) Biennial 8: 9) Biennial 9: 10) Biennial 10: 11) Bin five: 12) Biennial 11: 13) Bin twelve: 14) Bin fourteen: 15) Bin sixteen: 16) Bin seventeen: 17) Bin eighteen: 18) Bin nineteen: 19) Bin twenty-four: 20) Bin twenty-five: 21) B", "The next Biennial should take place at the Museum of Modern Art in New York in 2021. \n\n\nThe Art Newspaper has announced that the inaugural 18/19 years of the biennial, which will highlight ninety-three works, will end in 2021. The final event will take place at the Museum of Modern Art in New York on September 12, 2021. The biennial’s previous focal point was its inaugural iteration, which ran from March 14 to March 16, 2011. The 2019 edition, titled “Ateliers Alpes de Paris,” was won by Belgian artist Jules Bianchier, who heads the RIAC collection. The 2019 edition was curated by Markus Weller, who has served as its curator since its inception, and Anna Zahn, who has previously curated the exhibition “Saul Graham: Painting in the Streets of New York” (2016) and “Art and Color,” (2012). The 2020 edition, titled “Ateliers dangereuses,” will take place at the Museo d’Arte Contemporanea in Barcelona, Spain; the Museum of Modern Art in New York; and the British Museum in London.", "The next Biennial should take place in the New York City borough of Queens in 2021, and the first in the Bronx in 2022. The theme for the upcoming event, “Sister Cities: The United States and Mexico,” is “America and its People,” and the biennial will encompass the history of the United States with the aim of teaching students about the history of the world. The exhibition will also include a number of works that are currently on display at the Museum of Modern Art.The theme of the upcoming event is “America and its People,” and it will be the first project of the Smithsonian’s Frontiers exhibition series, which will run from April 21 to May 17. The public will be able to see the work on view June 5, 2020, when it opens at the Museum of Modern Art.\n\n\nThe New American Museum has appointed Carolyn Rosenblum as the next director and CEO of the institution. Rosenblum will be responsible for the development and management of the museum’s collection and program, which comprises nearly three hundred works, and will assume her new role in July. She succeeds Lorraine Kelly, who served as deputy director and chief curator of the museum", "The next Biennial should focus on themes such as community, ecology, and the production of art, as well as how art and architecture can become a vital part of a person’s cultural heritage. The event’s next edition, which will take place in March 2021, is being hosted by the Centre Pompidou in Paris. The event will be organized in partnership with the Centre Pompidou Museum of Art in Paris and the Centre Museif Montparnasse in Paris.\n\n\nAstronomical Society of Japan (ASJ) announced today that Takashi Kawamura, a professor of atmospheric science and engineering at the University of Tsukuba in Japan, will become the next president and vice president of the institution. In his new role, Kawamura will be tasked with reopening the institution’s longstanding exhibition space, which was closed since 2011, and revamping its education and outreach programs.“Kawamura’s research interests cross many areas of physics and chemistry, and he can bring exceptional scientific and engineering skills to ASJ to develop new more effective and reliable ways of supporting the museum’s curatorial and collection activities,” said chair of the board of trustees Takashi Kawamura. “This will", "The next Biennial should be held in the third quarter of 2020, with the exhibition “Mirrors” opening in March 2021.\n\n\nIn solidarity with the organizing committee of the twenty-fifth Venice Biennale, the Twenty-Second Venice Architecture Biennale, the Eighty-Fourth Venice Design Biennale, and the Twenty-Third Venice Film Festival, the Ponte della Scala will present the Venice Architecture Biennale in February 2021.The theme of this year’s edition of the event is “Ten Years of Modernism” and the event will take place at the Sittardazzo di S. Marco Martini, the Venetian capital’s former factory. The pavilion will be inaugurated by “Roland Büchner”—a curator of modern and contemporary art, filmmaker, and architect, who will present an exhibition of works by artists who are currently represented in the Venice Architecture Biennale. Next year’s edition will be organized in collaboration with the Milan-based nonprofit \"A2,\" which will organize the fair and serve as a platform for dialogue between the participating artists and the public.The Venice Architecture Biennale was founded in 1999 by architect Bide"]