["The next Biennial should take place in 2020.  The museum will unveil the full list of participating artists later this month. \n\n\n\n\n\n\nAn Egyptian artist has been killed and at least twenty other people were injured when a suicide bomber detonated his explosives-laden vehicle in front of the U.S.-backed government-backed Creative Egypt exhibition in Cairo on Friday, April 3. The explosion ripped through the building, which was packed with twenty-five thousand artworks by sixty-two artists, in the largest terrorist attack on the site in years.According to the Art Newspaper, the three suicide bombers drove their vehicles into the packed exhibition, causing extensive damage that could be measured by hundreds of feet. The building, which was transformed by the museum into an amphitheater for the thirty-five-day event, was also equipped with a theater and a sound stage. The attackers detonated their devices near the entrance to the museum, which was also filled with visitors. The United States announced that it dispatched sixty-two F-16 fighter jets to assist the Egyptian Air Force in the effort to contain the attack.The attack took place at a time when political tensions are running high between Egypt and the United States. President Donald Trump has since blamed Egypt for stoking", "The next Biennial should take place in 2020. Its theme, “The Last Days of the Twentieth Century,” was selected by a group consisting of Elisabetta Ciao, Fabiana Cuiño, and João César; the finalist was Carola Urban, who was awarded the Nobel Peace Prize for her work on the Nigerian uprising, The Red Veil: Autobiography of an Autobiography, in 2007. Included in the 2019 edition, which was organized by the same organizers, was the work of artist George Pérez. The catalogue also includes paintings by artist Manal El Masir, the first female to be included in the museum’s “Topography and Landscape” series, and the work of Erma Olmos. The exhibition will be held in the three-story museum’s renovated former space, where it has been since the museum closed on December 6, 2019.\n\n\nOn Monday, Russian artist Alexander Zemlianichenko was found dead of a “suicide by copulation” in Moscow’s State Duma, according to the Art Newspaper. The artist, who was known for his close collaboration", "The next Biennial should have been planned sometime this spring, but was shelved due to the Covid-19 pandemic. According to Curbed, the show’s organizers were not forthcoming with questions about when the exhibition would return, leaving fans wondering if the event might be canceled altogether. \n\n\nThe Museum of Modern Art (MoMA) in New York has received a gift of five hundred works by Willem de Kooning, Kiki Smith, and other early masters. The museum revealed that it will present the works at a special exhibition of the five thousandth anniversary of the American Renaissance in 2020. The show will be organized by curator Sarah Loyer and will be inaugurated by a “strikingly original” exhibition of the artist’s work, “The Modern Landscape: A Work in Progress,” which will tell the story of the installation and its relationship to American art.“These five hundred works will provide a rare glimpse into the life and work of Willem de Kooning, Kiki Smith, and John McAllister, and the impact that these artists had on the early twentieth century,” said curator and museum director Daniel H. Weiss. “Each work will come with", "The next Biennial should take place at the København museum in Oslo in the autumn of 2021. \n\n\nKunstverein Berlin, an independent contemporary art center in the German city of Berlin, has announced that it is working toward the construction of its new museum. Kunstverein Berlin will unveil the museum in the fall of 2020. The venue will be constructed in the former industrial site of the former Kulturstiftung in the Kreuzberg district of the capital, and will host several thousand art enthusiasts each year.Kunstverein Berlin will be located in the Kreuzberg district of the capital, and will host several thousand art enthusiasts each year. The center will be equipped with a science-fiction museum as well as a retail shop and café. The museum will also include a community space for artist-run initiatives and will host programming that bridges the different worlds of art and science.The center’s president, Rainer Baumann, said: “In the context of the ongoing Berlin Black Week, as well as the global fight against racism in all its forms, Kunstverein Berlin is collaborating with local, state, and federal governments and other partners to build a museum that is a bridge between", "The next Biennial should take place in the town of Zwolle in Poland, which has historically been home to a number of historic monuments, in 2021. The biennial will also include an exhibition of work by some sixty curators from twenty-five countries and fifty territories. \n\n\nThe Museum of the Fine Arts (MFA) in Boston has appointed its interim curator of the contemporary art of Massachusetts, Bethany Cooper. “I’m thrilled that Bethany Cooper will be the MFA’s curatorial partner in the future,” said John Letts, the museum’s director and CEO. “Over the past twenty-eight years, Bethany has developed into a world-class curator who brings a unique and ambitious view of the art world to the MFA. I’m delighted to welcome her to the MFA, and look forward to her contributions as we explore contemporary art in this region.”Cooper first joined the museum as a curator of contemporary art in 2013. Upon graduation in 2018, she was hired as the MFA’s chief curator of contemporary art, and in 2019, she was promoted to associate curator of contemporary art and director of exhibitions. Cooper is currently the", "The next Biennial should be held sometime in the first half of 2020. The decision was made after four years of discussions between the University and the National Galleries of Canada, which had previously collaborated on the project, and the proposed exhibition. The commissioning of the exhibition, titled Feminine in Design, was part of a larger campaign to engage with the history of the female body, which was initiated by the artist and activist Linda Du Maurier in the 1970s. The work was selected for the Biennial for its “new' feminism, a radical conception of femininity rooted in radical feminist theory. ” It was chosen to commemorate the 50th anniversary of the Canadian Alliance for the Arts (CAA), a network of feminist arts organizations.Du Maurier said: “We wanted to celebrate the feminist vision of beauty and the feminist spirit as a whole, not just the aesthetic side, and we wanted the exhibition to reflect the feminist mission of the National Gallery of Canada.” The Biennial will inaugurate the new National Gallery of Canada on Parliament Hill in 2021 and will be inaugurated by an exhibition of the work of Canadian artist Iwan M. Ward. \n\n\nAston Villa Foundation (AVF)", "The next Biennial should be a moment of realization for the artist; a time of renewal and new discoveries. The future of contemporary art is at stake. The Gallery of Modern Art in New York has announced that it will be closed for a period of seven weeks as a result of the coronavirus. In a statement, the institution said that the closure was made \"in order to reevaluate our programs and our exhibitions and the rethinking of how we present art.”The closure of the galleries means that no new works by the artists participating in the exhibition will be presented during the duration of the exhibition—currently scheduled to run from February 19 to March 5. Most of the artists who are participating in the show are veterans of the exhibition series, which was launched in 2009 by the New Art Project and the Charles and Alexandra Art Gallery in London.The exhibition, “The Blackout,” will be replaced with a “comprehensive re-imagining of the history of protest art,” as part of the upcoming exhibition “Outsider,” which will open in the fall. In a letter to the artists signed by Diana Al-Khalili, Sabrina Bonta, T", "The next Biennial should be held in 2021, with the exhibition set to kick off at the National Museum of Canada in Ottawa in February 2022. \n\n\nThe Pulitzer Prize–winning arts journalist Michael TV Chiu has resigned from his post at the New York Times. Chiu will step down from the institution, which he has led since 2015, after two decades. Chiu has been the New York Times’s chief cultural writer since 2018, when he penned a piece for Artforum questioning the institution’s partnership with Madison Square Garden. “As a cultural institution, we cannot afford a Michael Chiu,” said Tom Raab, director of the Simon Wiesenthal Center in New York. “Michael Chiu has been a dedicated and committed journalist, a brilliant editor, and a devoted student of American art. He has been a champion of contemporary art, an avid collector, and a devoted advocate.”During his tenure at the New York Times, Chiu helped launch the award-winning weekly newspaper, the Art Newspaper, which he then cofounded with Thomas L. Friedman, and became a coauthor of The Art Newspaper. He also published seven books, including American Art: From the Art Newspaper to", "The next Biennial should be held in 2021. \n\n\nThe Metropolitan Museum of Art (MoMA) is planning to shutter its four remaining locations in New York and New Jersey in August, leaving only the institution’s current Manhattan headquarters open to the public. The museum’s board of trustees announced the change on Wednesday, following months of protest from museumgoers and local politicians. In the lead-up to the announcement, Mayor Bill de Blasio declared war on the boroughs, launching the #MuseumCrimeCon, a campaign to raise awareness of the dangers of crime in public spaces, and the museum’s paid internships, which have been canceled or reduced in recent years.On Tuesday, August 27, the board voted to suspend all paid internships. The move follows months of protests and a petition signed by more than 1,400 people. Last month, the museum’s board of trustees voted to increase the minimum salary of museum staffers by 25 percent. Meanwhile, the New Museum in Harlem—a former Met institution that has shuttered since 2016 and whose employees are organizing a union drive—is preparing to welcome visitors from August 23 to September 2.While the board determined that the positions must remain empty for the foreseeable future—as", "The next Biennial should be held in 2019, with the exhibition likely to take place in the former British airbase in St. Cloud, Minnesota, at the end of 2020. The venue will host the show in the spring of 2020. According to a release, the show will return to the Twin Cities in 2021.\n\n\nThe Centre Pompidou in Paris is planning to move both it and the smaller, independent bookstore Le Cinéma\u0097which will open in the city’s former Musée d’Arles on the Boulevard Saint-Pémand in the heart of the French capital in October\u0097from September 2020 to March 2021. The move was made after French president Emmanuel Macron pledged to deliver on his campaign promise to build a new museum in honor of the Louvre and the Centre Pompidou. The renovation of the former Le Corbusier building will also see the addition of a new building, the Centre Pompidou, Saint-Pémand, and a new entrance on the Boulevard Saint-Pémand.“The Centre Pompidou is one of the last remnants of the great Musée d’Arles, a museum devoted to the study of the colour red, of which", "The next Biennial should cover the history of the art of digital art, and the exhibition should be held in the spring of 2021. The exhibition will be organized in the same way that the other two editions of the gala, “Award for Design” and “Award for Art” were, with the addition of a new section on the history of art.The new section will include essays by artists and scholars and will focus on the European Renaissance, the Romantic-30s, and the postwar period. The changes are part of a larger initiative to better understand the history of modern art and design. The exhibition will also include new multimedia experiences and a new play.“This is a monumental year,” said Hayley Tsujimoto, chair of the board and board director of the New York–based organization Design Museum St. Louis. “The gala will continue to celebrate and expand the rich range of contemporary art made in the United States, and will continue to present unprecedented exhibitions of work by the most important contemporary artists in the country. We are privileged to share this important work with you, and look forward to welcoming you back next year.”\n\n\nThe Hirshhorn Museum and Sculpture Garden, which", "The next Biennial should be held in 2021. If it is cancelled, the next one will take place in the summer of 2022.If the demand for the next biennial is met, the institution will either postpone it or declare bankruptcy. The organisers said that “no final decision has been taken and no decision is expected for some months.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has received a $1 million donation from an anonymous donor. The gift includes more than 1,200 works by internationally acclaimed contemporary artists such as David Cézanne, Pierre-Auguste Renoir, Emily Satt, and Mark Rothko, as well as a selection of works by women artists from the late nineteenth century to the twentieth century. The donation will also include the collection of works by ninety-three artists whose works have been digitized by MoCA, including Amalia Caccia, Betty Parsons, Carolee Anselm, Cézanne at the Museum of Modern Art, Paris, Clara Mosley, Mary Wollstonecraft, and Louise Bourgeois.“This is a significant moment for the Museum of Contemporary Art in Los Angeles, as it will become the first institution in the United States to have all of", "The next Biennial should be held on the occasion of the thirteenth International Conference on Women in Arts and Design, to be held in London the week of June 16–June 21, 2020. It should consider how art and design can be used as a platform for social change. It should also consider how art and design can serve as a mechanism for social change. The next Biennial will be held on the occasion of the twentieth International Workshop on Contemporary Art, to be held in Palais de Tokyo in Paris on November 16–November 18, 2020. It will consider how art and design can be used to address pressing social and environmental concerns. In the lead-up to the exhibition, the organizers of the exhibition announced that it would commence on Wednesday, September 5, 2020, and would run for twelve weeks. The exhibition will feature artworks by seventy-five artists and designers. The twenty-third edition of the Biennial will be held in Tokyo in November 2021. \n\n\n\n\n\nGavin Brown’s new gallery in the West Village, which opened in the former Albright-Knox Art Gallery in April, has welcomed Leslie Stranahan as its first director. In her new role, which she has described as “", "The next Biennial should focus on the structural process of urbanization in the United States, focusing on how the transformation of American cities has radically altered the landscape by introducing new modes of transport, communication, and movement, and adapting to a radically different world. The next edition of the Biennial will be hosted at the Museum of Contemporary Art (MoCA), New York, from January 22 to January 26, 2021. The theme for the 2021 edition will be “The Body in Space.” The event will be organized as follows: 1. Museum of Contemporary Art (MoCA)2. The Body in Space3. The Body in Motion4. Artist Apart: Art in Motion5. The Body in Space: The Body in Motion. In addition to exploring the body in motion, the 2019 edition of the Biennial featured works by artists such as Anthony Ingo-Cox and Alex Katz, and was curated by the artist Antonio Banderas.\n\n\nInstitute for Contemporary Art (ICA) in Seoul has announced its representation of the Noguchi-Koenig-Koenig (NKK) group in Korea. The group consists of artists Noguchi-Koenig (Koen", "The next Biennial should focus on the Roman Baths and the Roman Curiosities, which are considered to be the earliest surviving examples of the Florentine National Museum in Florence, and should include the first exhibition devoted to the Romanian National Museum. It would also be the first to be held at the current site of the Museum of the History of Technology in Bucharest. \n\n\nThe Australian Sculpture Centre (ASCO) is planning to close its doors to the public in the United States, Australia, and the United Kingdom after the end of its three-year campaign to raise $100 million in support of critical infrastructure. The center, which was founded in 2008 by Yuki Kudo and Tony Robinson, attracted a surprising amount of attention from the arts world after the duo returned from a yearlong, seven-country tour of the United States, Canada, Europe, and Asia.On March 13, Kudo and Robinson announced that the center would be closed indefinitely as a result of the coronavirus, and that as a result the center would cease fundraising. “This is not an easy decision for us, but we have spent the last year working tirelessly to raise the funds to continue to operate, and to create new and exciting opportunities for people to", "The next Biennial should take place in 2020 and will be hosted at the island of Cyprus. \n\n\nThe Art Newspaper has announced that the next edition of the Art Basel (AB) is being moved to Hong Kong. According to the British publication, the relocation is part of an agreement that will see the Hong Kong art fairs move to the Hong Kong pavilion in Shanghai.The move is part of a three-year deal that will see the fairs relocate from Hong Kong, to Shanghai, and to Düsseldorf. In 2020, the fair will also be canceled due to the global pandemic. “The two fairs have reached a new phase in their business and development, which will result in a new chapter at the fairs in 2020, as usual,” said Alexandre de Villiers, president of the fairs. “We are delighted with this new chapter at the Düsseldorf fair, which will bring new life to AB London and the Hong Kong pavilion, and we look forward to working with the gallery and the community in Shanghai.”The full list of participating galleries is as follows:AB Gallery, London, United KingdomAB Gallery, London, United Kingdom AB Gallery,", "The next Biennial should also include the production of a documentary film on the Syrian civil war, Syria Soul: A Biennial Film, “The World is Not Enough,” which will follow the current conflict in Syria as it unfolds throughout the year. The film will be produced by the Tunisian and French filmmakers, Amr al-Hashemi and Youssef Marakji, and will be shown at the institution in May 2020. The 21st Venice Biennale will take place in May 2021. \n\n\nThe Museum of Jewish Heritage in New York has welcomed Georgia-based artist Nia Lou to its board of trustees. Lou came to the institution in 2017 as its founding curator of Jewish art and is currently the museum’s curator of Modern Art. She will remain on the board of trustees alongside Alexander Dries, who is currently a trustee; Michael Rosenfeld, who serves as chair; and Andrew Kreps, who previously served as director of the Metropolitan Museum of Art.“Nia is a curator, an artist, and a thinker who embodies the spirit of art at its highest and most sublime levels,” said Museum of Modern Art director David Bresson. “She has been", "The next Biennial should take place in the year 2022, said the organizers. The institution will introduce a new generation of artists, whose work will be curated by artists currently represented in the exhibition, and will display the work of eight artists on the first floor of the museum, which will be transformed into a research center for the exhibition.The exhibition will be organized as follows:The show will be divided into two parts: “The Rise and Fall of Modern Art” and “The Visual Arts.” In this section, the Biennials will present key works by the artists who have shaped the visual arts in the twentieth century while placing them within the context of the current crisis. In the next section, the Biennials will present works that will include the artists’ own voices, and will unfold as part of a new project, “Visual World.” The project will be hosted by the Museum of Modern Art and will be curated by Michael Bouquet and will be led by Rachel LaBouvier, the artists’ designers.“We are thrilled to secure the work of these four outstanding artists as part of our exhibition,” said Biennials director Anna-Sophia Beretta. “Their aesthetic", "The next Biennial should be held at a site within the city limits of New York in 2021. The festival will be held at Rockefeller Center from March 23 through March 26 and will feature work by forty artists, including Ashley Tawney, Holly Holm, and Rocco Ciavarella, who have been selected for this year’s edition. “This year’s edition of the Biennial will showcase the work of a new generation of artists,” said Rocco Ciavarella. “The 2020 exhibit will coincide with the 100th anniversary of the United States and will be a celebration of the American experience. The biennial is a necessary platform to engage with issues of our time in a meaningful way, and the 2021 edition will challenge the themes raised by the 2012 exhibition.”Below is a full list of artists who will be featured in the 2021 edition of the Biennial: Charlie Amedeo-Stevenson (New York)The New York–based artist and educator, who has taught at the School of the Art Institute of Chicago, the Art of Painting School, the Art of Drawing School, and the Art of Painting School in New York, has been nominated for a Pulitzer Prize for his remarkable", "The next Biennial should be held in 2020. The theme, “Shining a Light on the World: Artists since 1966,” will be: “Every Face, Every Orb,” and will be curated by Hong Kong-based artist Maria C. Cui (Shengliang), the winner of the first edition of the Art and Culture Biennials last year.Coachella Valley Music and Arts Festival was canceled due to the Covid-19 pandemic. The festival will now return to the Santa Monica Mountains in California, marking the twenty-sixth edition. The event will still be held at the Santa Monica Pier, where it will be held from March 22 to March 28. Michael Jackson’s Thriller was originally scheduled for a March 21, 2020 debut at the Independent. “While we were still working through the logistics and tamping down on the number of shows, everyone was behind the restoration,” cofounder Michael Jackson said in a statement. “I was thrilled when the first show opened at the Independent in March. It was the perfect time to see the work of Michael Jackson, who I have admired since I first saw him at the age of eleven.” Largo,", "The next Biennial should be in May 2021. Only the first iteration of the exhibition will stay open after a major renovation in order to avoid disrupting the work and study of the artists who have been participating. The show will be moved to the National Museum of Contemporary Art (NMA), where it will remain under the patronage of the government of India.The exhibition will be staged at the NMA and will be organized as follows:1. Introduction to Art: ASTRONAUTS 2. The Arctic Canyon: ASTRONAUTS 3. Arctic Lovers: ASTRONAUTS 4. Biennial of New York: ASTRONAUTS 5. Biennial of New York: ASTRONAUTS 6. Biennial of New York: ASTRONAUTS 7. Biennial of New York: ASTRONAUTS 8. Biennial of New York: ASTRONAUTS 9. Biennial of New York: ASTRONAUTS 10. Biennial of New York: ASTRONAUTS 11. Biennial of New York: ASTRONAUTS 12. Biennial of New York: ASTRONAUTS 13. The Third Reich, a Documentary: ASTRONAUTS 14. The S", "The next Biennial should be held in 2020, but the revivalist Pentecostal church believes that the work must be completed before then. 'The first edition of the Biennial was a success, but we have a long way to go,” said the Pentecostal minister, Peter O. Bickel. “We are working hard to achieve our goal of an automatic and fair renewal of the Annual.”\n\n\nThe New York City Department of Cultural Affairs (DCLA) announced this week that it plans to begin removing more than 1,100 monuments dedicated to white supremacy from public sites across Manhattan and Brooklyn. The first phase of the program, which will involve the removal of eighty monuments, was initiated by the city in December 2019 and will run through 2021. After the public works are razed and their foundations are examined, the remaining monuments will be relocated to museums or burned in effigy. Those monuments that remain will then be relocated to sites with historical associations with designated sites in the city.The DCLA’s cultural heritage task force, comprised of cultural figures from a broad range of backgrounds, including Tom Finkelpearl, the mayor of Brooklyn, the Bronx, and the Cultural Affairs Commission, will present", "The next Biennial should be held in 2021, but a spokesperson for the London Biennial said that it will not be affected by the coronavirus.\n\n\nThe Museum of Art (MoA) in New York has appointed Thomas J. Sokolowski as its next director. Sokolowski comes to the institution from the Metropolitan Museum of Art, where he has served as interim director since February 2019. He succeeds Ruth Estévez, who announced on April 22 that she plans to retire at the end of the year, and will take up the post in July.Sokolowski joins MoA from the Museum of Modern Art (MoMA) in New York, where he has served as associate curator of modern and contemporary art since 2006. During his tenure at MoMA, he curated exhibitions such as “Future Peace” (2018), “The Untold Story” (2015), and “A Small Matter of Form: Evolution, Politics, and Change” (2015)—as well as “Exhibition for Art” (2013), “Sasha and Ezra: A Retrospective,” and “Sidney and Edith: A Retrospective” (2012).Sokolowski will work", "The next Biennial should take place in 2021. In the meantime, the museum will continue to offer free admission to visiting families. The museum will also introduce new and larger exhibitions, including a “Kenzo Tange: The Senses” (2019) and “Peter LaBarbera: The Artist and the Museum” (2019). The institution will open an extension at 11 A.M. on Saturdays, with a preview on August 23.\n\n\nThe Art Newspaper reported on Monday that the Tate’s board of trustees has decided to increase the annual operating budget of the Tate in London by $2.5 million in order to adapt to the health crisis in the UK. The move is part of a plan to generate $1.5 billion for the Tate’s conservation, restoration, and research arm.Under the original proposal, the Tate would have been able to operate at a loss through the 2020–21 financial year. In a statement, the Tate said: “The trustees’ decision to increase the operating budget in line with expected demand reflects the trustees’ confidence in the company’s future. We welcome the plan and look forward to sharing the results with our guests. . . . We will continue", "The next Biennial should focus on rethinking the relationship between art and the state. The first was 2015–16, when the Congress of South African Art and Art History (CARH) proposed a new law that would allow the state to set up a commissioning agency to create new works by emerging and established artists. The new law is still being reviewed by the legislature and is expected to be passed before the end of the year.\n\n\nAfter weeks of protests and riots across the United States over police violence and racial injustice, the European Union has announced it is lifting import restrictions on German synthetic drugs. Germany’s Federal Office for Drugs and Drug Addiction (BfV) said on Wednesday that the decision to suspend import bans came after the agency analyzed the evidence and found that legalization of certain drugs, such as heroin, could help reduce the number of deaths from the disease.In a statement, the Flemish Federal Association for Drug Policy (BfV) said that the decision will allow consumers and companies greater access to drugs like methadone, a medication used to treat addiction to painkillers, and naltrexone, a medication that blocks the body’s production of the opioid opioid fentanyl. The drug is a powerful killer and", "The next Biennial should be held in the spring of 2022. Most art historians believe that the exhibition will be a revival of the show that is currently on view at the Museum of Modern Art in New York from the same year, set between 1927 and 1928. The exhibition will feature more than sixty works by artists from the exhibition that were selected for their work in the exhibition and will be inaugurated by a work by the German artist Albrecht Lüpertz, titled The Ballad of Brigid. The biennial will also feature a performance by the Netherlands artist Oskar Eustis for which the Netherlands will be represented by Otjaf Schenker. The show will begin with the exhibition of the artist’s first self-portrait and will run until March 24, 2022. The exhibition will also be open to the public from March 16 to March 24. The artists selected for the exhibition include Kasmin, David Hockney, Brandstrup, Crewe, Dennis Ritz, and Chantal Ritz. The artists who will be featured in the upcoming biennial, which will run from March 17 to March 21, 2022, are: Robert Mapplethorpe, Anton", "The next Biennial should be staged at the Museum of Contemporary Art (MoCA) in New York in the spring of 2021. The ten-year anniversary of the event will be held on May 6. The museum has also launched a Twitter account, and has released a website with more information about the 2020 edition of MIDGAMAN. \n\n\nThe Museum of Contemporary Art (MoCA) has informed the public that it plans to introduce a new digital program at the institution in the fall of 2020. The redesigned digital experience, which will be significantly different from the traditional program, will launch across all platforms in the Museum on March 14, 2020.“MoCA is shifting from a programming model that relies on a centralized location to one that relies on a network of partners,” said Bertha Schubert, director of the Museum of Contemporary Art. “We're developing new opportunities to support the Museum’s mission of innovation and experimentation through the reimagining of how we present and present our collections, exhibitions, and events. We hope this new program will help to draw visitors and stimulate their interest in our exhibitions and collections.”The changes are dictated by the global health crisis caused by Covid", "The next Biennial should take place at the Museum of Fine Arts, Boston, next March. The museum will unveil its new permanent collection of contemporary art by the same artist. The 2020 biennial will be held at the Museum of Contemporary Art, Houston. Previously, the museum has staged biennial exhibitions of works by artists such as Willem de Kooning, Wright and Painterly, and Tadao Ando. An opening reception for the biennial will be held at the Museum of Contemporary Art New York on September 3, 2020. In addition to the new exhibition, the museum will launch a new digital platform on which visitors can explore the collection’s exhibition history and other online resources. The platform will also include new online courses, a public reading room, an artist forum, and more.The selection of the artists, whose work is housed in the Museum of Modern Art, was curated by Maren Chiu, the deputy director and chief curator of the institution. “While there are a number of extraordinary artists represented in our collection, our most recent exhibition, ‘The Truth of Life,’ is a watershed achievement for the museum and for the field,” Chiu said in a statement. “", "The next Biennial should take place in the spring of 2021. The exhibition will be hosted by the MCA in partnership with the MCA in partnership with the private institutions Meir and Ben Gurion in the city of Tel Aviv and will be curated by Adrienne Edwards, the director of the MCA. The full list of participating artists is as follows:Arts Villages and Institutions:NECARTE - Mondrian, FranceMOCA - Mondrian, SwitzerlandThe Works of Hurricane Lee, David C. MacNamara and His Children, Tom Gidley, and His Children (Cindy & Edith), 1966–2005Zoë McArthur and Her Children, Unseen, 2013Agnieszka and Jody Williams, The Roots of the Song, 1917–2017Mara Majoli, The Blood of a Dove, 2008Mara Mitchell, Dinner in the Air, 2015Alfred W. Albright, Portraits in the Garden, 1918-2017Ryan McClellan, The Book of Life, 2019This is an open call for a new biennial of contemporary art. The theme of the exhibition should be “The New Biennial of Contemporary Art” and the theme of the show should be", "The next Biennial should take place in 2021. will host the next edition of the interactive exhibition Art at the Museum. \u0097The 2019 edition, “Art in the Streets,” was directed by Jasper Johns and ran from April 27 to April 28.“This is a moment of great change,” said Aldo Rossi, chair of curatorial affairs and director of the Bristol Biennial. “We need to do all we can to ensure that this transformative event is a success. We will have to find new ways to support the museum. In the coming weeks, I will be writing to the directors of the Biennial to tell them that they are doing a fantastic job.”Otto Reimer, the director of the Museum of Contemporary Art, Vienna (MCA), said: “We are on the verge of a new era as we enter the next phase of the construction of the new Berlin Contemporary. We are confident that with your support we will be able to continue to innovate and create new works at the museum, by planning a future exhibition in partnership with a collection of works by the best contemporary artists.”\n\n\nKasmin has announced that it will be removing", "The next Biennial should be held within the next few years, and will involve the cultivation of new knowledge about the art, in order to equip the museum for an increasingly important new role in its city and country.The museum’s new permanent collection, comprised of works by artists such as Benjamin Harnwell, Tunga and Kukonda, and by colonialists such as Sir Samuel Pepys, has been under construction since 2011. The first exhibition, “Myths of the Americas,” will open at the museum in October 2020. The museum’s first exhibition of British artist Hallam Fowle, from the ’60s to the ’70s, will open in February 2021.Following the opening of “Culture and the Household” in 2019, the museum also received a major gift of works by the late Nigerian artist Cecil Taylor, which were recently presented at the museum in February 2020.\n\n\nThe Art Newspaper reports that Vassili Mikhale, the director of the Palazzo Reale in Venice, has ordered the removal of nearly one hundred works by Russian and Soviet artists who were featured in exhibitions at the museum in the 1950s and 1960s. Some of the pieces, most of", "The next Biennial should be held at least ten years after the date of the last edition (though we are open to moving the date back).\n\n\nArt Basel Hong Kong and the Institute of Contemporary Art (ICA) in New York announced today that the opening of the second edition of the Hong Kong Biennale will be held in 2021. The upcoming exhibition, titled “Hong Kong 2030,” will be hosted by the Institut Nationale de l'Art et l'Architecture in Brussels and will celebrate the twenty-fifth anniversary of the exhibition.“The theme of the event is ‘future architecture,’ it was said that, ‘withdrawing from the legacy of the twentieth century,’ we are now in the twenty-first century.’” The exhibition will include the work of seventy-four international artists, including John Akomfrah, Daniil Karpov, and Lisa de Palma; will feature works by artists from India, the Philippines, Thailand, Germany, the United Arab Emirates, and the United Kingdom; and will feature the work of contemporary artists such as Igor Tezuka, Olafur Eliasson, and Alberto Urbach.The panel", "The next Biennial should have a theme of the museum’s collection and be dedicated to the future of Artadia. Not yet decided.”Tadanobu, who joined the museum in 2006 and is its current director, said: “We are not in the process of putting out a statement on this matter and I hope that the future museum will not be a source of distraction or of pain to the people of Wiradjuri. We are however, at the same time, in the process of developing a new set of values and priorities for the collection, exhibition, and management of the collection and exhibition, so that we can better serve the people of Wiradjuri in the future.”Mark Worrington, a curator at the contemporary art museum, the National Gallery, London, and author of No Sanctuary: Art and the Black Lives Matter movement, said: “I think it is pretty sad that Biennials are becoming increasingly marginalized and in some cases criminalized by these policies. I would like to see Biennials be given a voice and have their own place in history, but I also think that more cultural institutions, especially those in cities, have to start taking the lead in recognising their importance and their value to", "The next Biennial should be held in 2021, and a full-scale exhibition of the ethnographic work of the artist should be staged by the end of the decade.\n\n\nThe collection of the National Gallery of Art in Washington, DC, has announced that it is planning to close its doors permanently in March 2020 and re-open with a new collection in 2022. The museum told DC Circa that it is collaborating with the Department of Cultural Affairs (DCLA) on a two-year, $25 million renovation and conservation plan that will \"provide flexibility for the museum to think creatively about how it might be transformed in the future.\"“We are committed to restoring and preparing the National Gallery for the future,” said Marc Glimcher, the gallery’s current director. “We have been re-designing the gallery’s collection and cataloguing in order to make it more accessible to a wider audience. We are continuing to develop and refine our public programs, which continue to be inspired by the work of our talented and dedicated staff. We are excited to be working with the DCLA and the D.C. Council on the next phase of the National Gallery’s history as we work together to develop new exhibitions and", "The next Biennial should be held within the next eighteen months.\n\n\nThe British Institute (BFI) in London announced that the 100th anniversary of the organization will be celebrated with a tribute concert, a special exhibition, a major film production, and a series of public events. The biannual event will take place at the BFI in conjunction with the BFI London Festival (BFI London Fairs), which will run from November 22 to December 18.The event will feature a number of projects, including a special exhibition on art and architecture from the BFI’s Visual Arts Research Group, which is affiliated to the BFI, in conjunction with a retrospective of the work of the BFI’s curators, including Fred Wilson and Richard Biggs, as well as a section of the institution’s collection dedicated to the seven-decade history of the institution, which will showcase ninety artworks from the institution’s collection.The event will also include a number of interviews with key members of the BFI’s curatorial team, including Jessica Morgan, senior curator of art and architecture; Rirkrit Tiravanija, director and chief curator of the BFI; and Christopher Wool, director of", "The next Biennial should also take place in the summer, which has already been chosen as the theme of the exhibition, called “The Biodiversity of Process.” The first edition of the biennial was held in 1999 and ended in 2004. In 2004, the exhibition received a retrospective at the Museo de Arte Contemporáneo Brasil (MASB), Rio de Janeiro. The next iteration of the exhibition, titled “Biodiversity of Process” and opened at the Largo Museum in Porto Alegre in 2014, was also selected for the 2020 edition.In response to the announcement, the director of the Museo de Arte Contemporáneo Brasil, Marcela Cervetto, said: “We are delighted to have selected this year’s exhibition for its diversity of themes and its historical position as a cornerstone of our program. The themes of The Biodiversity of Process and The Bodysnatchers were chosen for their authenticity, their accessibility and their resonance.”\n\n\nSwedish artist Peter Dreher, best known for his iconic sculpture Hemlock Grove, which has been featured in multiple major international exhibitions, died on September 10 at the age of eighty", "The next Biennial should take place at the Museo Nacional de Artes in Barcelona, Spain, in 2022.\n\n\nAn Israeli court has sentenced architect Elor Azaria to eight years and nine months in prison for setting fire to a Palestinian home in the occupied West Bank in 2015, in a case that involved a fire that broke out in the building in Beit Hanoun, near Ramallah, and spread to the neighbouring agricultural village of Beit Hanoun-Anatolu, which was also damaged.The Jerusalem District Court for the Civil Administration found Azaria guilty of arson and fined him $16,000, the Israel Army Times reports.The construction company involved in the incident pleaded no contest to the charges and was sentenced to three years and nine months in prison, but the conviction was overturned on appeal and the sentence was reduced by two years and one month when the architect was granted conditional amnesty.According to the Israeli newspaper Ynet, the architect was given a suspended sentence of three years and six months due to a conflict of interest prosecution brought by the Israeli minister of local government, Yair Lapid, who had ordered the prosecution. However, in a separate case, the Israeli High Court of Justice overturned the Ministry of Interior's decision to suspend", "The next Biennial should take place in the fall of 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is moving forward with a renovation project that will include the opening of a second exhibition in the space, called the “Biennial of the North,” in 2021. The second exhibition will be based at a former industrial site and will be “based on the imagination and the history of North America.”The project, which will be carried out in collaboration with architect Erma Gold, is part of an ambitious plan by MoCA to become more inclusive and diversified, drawing from the museum’s extensive holdings of Indigenous art. “In order to be truly inclusive, we need to rethink what it means to be North American,” said architect Gold. “The new exhibition, ‘Binaries of the North,’ will focus on the art of 'northwest Indian legacy,” and will draw from the works of a number of artists, including Olafur Eliasson, Thomas Dolores, and Henry Oosthuijsen, as well as from materials including wood and ice cubes from the nearby Juan de Fuca Strait.Commenting on the project, architect Gold said", "The next Biennial should be held every two years. The first Biennial was held in 2005 and the last in 2018. The twenty-second Biennial was held in 2007 and the last was held in 2015. The current Biennial, \u0097featuring artists who have exhibited since its inception, took place in the National Museum of Art (MMA) in Washington, DC from January 28 to January 31, 2019. The 2018 edition featured thirty-eight artists, including (among others) Alberto Burri, Adriana Danziger, A-Pavoli, A.K. Boni & Tito, David B. Davis, Catherine D. Grogan, David H. Gallo, Cara Cipolletta, Carol M. Ibarguera, Erin O. Larson, Felix Nogueras, Claudia Palma, Frida Polosa, Kathy Petkova, ,Timur Pfeifer, Andrea Barbera, ,and Amanda B. Oehler.The 2019 edition was curated by Christina Hoenig and featured a total of eighty artists,", "The next Biennial should be held at an open location in the city of Los Angeles. The event should also explore how the biennial can be a vehicle to promote social justice and ecological concerns. The 2019 edition, which was organized in collaboration with the city of Los Angeles, will be held at the Museum of Contemporary Art (MoCA), Los Angeles. The event will be hosted by artist Aida Al-Qasimi and will run from March 21 to March 26.The 2019 edition will feature work by more than sixty artists and collectors, including: B-Tranjani, Anthony Dershowitz, Tom Hayden, Richard H. Smith, Shih Chieh, Rina Roesler, Tanya and David Weisz, David Zwirner, and Guadalupe Rosales. The 2015 edition, which was curated by Alabama-based artist Eric Fischl, featured work by artists including Jodi Throckmorton, T.J. Dedeaux, A.J. Knapp, and Billie Tsien, among others.\n\n\nThe Solomon R. Guggenheim Museum in New York has appointed Roberta Smith-Dumont as its next interim director and chief curator. In her", "The next Biennial should be held in the coming months, and the first exhibition should open in the fall of 2020. Museums are also continuing to organize exhibitions that will represent their collections in the first exhibition at the Museum of Modern Art (MoMA) in New York in 2020, and the inaugural exhibition of the New Museum in Philadelphia. As the number of the year approaches twenty-first century, experts estimate that more than three hundred thousand museums will close across the United States as they undergo a number of expansions, including the renovation of the Metropolitan Museum of Art in New York and the renovation of the Whitney Museum of American Art in New York. The number of museums in operation as of April 30 was 5,716; the number of museums that will remain closed will be determined by the District of Columbia’s Department of Cultural Affairs by June 30.The museums that have not yet announced their reopening plans are the Arts Museum of the American West in Santa Fe, New Mexico; the Brooklyn Museum in New York; the California Academy of Sciences in the California city of Santa Barbara; and the Chicago Architecture Center. The last museum to reopen is the Los Angeles County Museum of Art (LACMA), which reopened on Tuesday, April 14", "The next Biennial should take place in 2021. The next edition will be held at the Museo de Arte Contemporáneo, in Madrid; at the Museo de Arte de Madrid; and at the Palacio de Congresses in Madrid.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released a new set of guidelines for the exhibition “The Unseen: Art in the Age of Mass Incarceration.” Developed by the DCLA and the Sentara Leadership Academy in the City University of New York, the guidelines delineate a number of ways in which artists and intellectuals can engage with mass incarceration, including through “through the political, legal, and spiritual structures that perpetuate and justify mass incarceration.”The guidelines, which were approved by the City Council on Tuesday, January 9, and are part of a New York City strategy that aims to reduce the city’s annual costs to the state of $2 billion by 2025. The new curatorial guidelines, which address works by artists such as Michael Chabon, Thomas J. Price, and Thomas M. Smith, and are set to open in January 2021, are part of a multiyear project—brought to", "The next Biennial should be held in the year 2021. The theme of the show will be “Incredible Stories,” and a selection of the artist’s works will be presented in the exhibition.The full list of participating artists is as follows:MASUBA, Togo• NATIONAL ART Gallery of Ghana (for “Tales of the Madonna,” a collection consisting of more than 1,500 works, including paintings, drawings, sculptures, audio-visual presentations, and installations, and that will enter its fourth iteration at the African Museum of Art in Port-au-Prince, from December 12–December 14, 2020.The Arts Council of the United States has announced that it is reconsidering its decision to award the 2019 National Medal of the Arts to Reno Art Museum director Nick Licata. The museum has not yet received the proposal to award the award since it filed a lawsuit in federal court in January 2020. The lawsuit, which was dismissed by the judge in April, was based on the grounds that the museum had not adequately considered the proposal before it awarded the prize last March.Busan Biennale: The first annual exhibition, which was organized by a group", "The next Biennial should be held at least once a year. Charles A. Hawes, the director of the museum, said: “The next Biennial has not yet been decided but will be an extension of the long-standing tradition of presenting works of art on the campus. It will take us in a new direction as we continue to present works of art by artists that have been influenced by the same basic premise of the exhibition as the artist’s own. We have already had discussions about how this could be a platform for the work of young artists and are working hard to shape it into a platform for young artists.”Ryan Kwanten, the director of the Whitney Museum of American Art, said: “This is incredibly exciting news for the Whitney, particularly as the ArtsCenter is the home for the work of the very best and most celebrated contemporary artists. We look forward to the next Biennial and to continued collaboration with the Biennial Foundation of the Arts, the Whitney, and the many artists that have inspired us throughout the years.”Last year, the Biennial Foundation of the Arts created a new biennial award. The $50,000 prizes were founded by the Whitney in honor of the contributions made by artists", "The next Biennial should take place in 2021, with the event to be held in the city’s Old Town, in front of the cathedral. The games are scheduled to run for twelve weeks and will be presented by the city and its partners—including the architectural and design offices, the cultural association, the city council, and the museum’s director, Marie-Claude.“This is a unique project for the city of Saint Petersburg and one that we believe will be of great value in our city,” said local council chairman Mikhail Romanov. “The Art Newspaper reports that the biennial will be dedicated to the life and legacy of the late architect, Kliment Krasnov, and will be organized by city hall and the Saint Petersburg Architecture Club. We are very excited about the possibility of this project and its potential for sustainable development.”The project has been in the works for more than a year, with the approval of the Saint Petersburg City Council and the Saint Petersburg Development Committee, which allocated sixty thousand rubles ($9.8 million) for the project. In addition to the building and the biennial, the city will construct the Saint Petersburg International Airport, a new cultural center, and a museum. The project", "The next Biennial should take place at the Museo de Arte Contemporáneo in Madrid in September 2022. The event will feature work from twelve artists\u0097Alberto Barango, Felipe Brancília, Hujar, Ivan M. de Cervantes, Miguel de la Paz, and Leonora Del Rio\u0097and will be hosted by Hernán Castro, who will take over as director of the Biennale in December 2022. The next edition of the festival will open at the Museo de Arte Contemporáneo on September 21.\n\n\nThe Carnegie Museum of Art (CMA) in Pittsburgh, which was forced to move the opening of its new exhibition “Black Panther” from September 2019 to mid-late October due to concerns around Covid-19, has issued a second round of refunds to its ticket holders. The institution received a total of $102,000 from the first round, which was issued on October 3, and expects to file its 2019 refund by the end of the week. “We are pleased to announce that the first round of refunds has been successful, and we are confident that we can return the public to a more favorable schedule in the second", "The next Biennial should focus on “transculturalism”—a term originally coined by Yugoslav artist-activists to describe a “new perspective on art, culture, and ideas.” The first iteration of the 2020 theme, “Abandon the Present,” was held in the artist’s hometown of Bogotá in 1992, and the second iteration, “Abandon the Past,” was held in the Nairobi Museum of Art in 2009. The 2020 edition of the Biennial will take place in Friedrichshain, Austria, from January 22 to January 25, 2021. The exhibition is an adaptation of Mark Lenhart’s popular essay “Abandon the Present,” published in Documenta in 1991. Lenhart drew from and stated that “art is the present moment.” Like many essayists, Lenhart explicitly rejected the concept of a legacy. He instead argued that “a legacy, rather than a collection, is the essence of art.”\n\n\nThe Bauhaus, which has been featured in countless films, television shows, and performances and has a permanent collection of more than 1,500 works, has announced that it", "The next Biennial should be held in the fall of 2021. The theme of the upcoming event is Future Fear. The exhibition, which will be staged in an attempt to re-create the anxieties and visions of the past, will feature works by thirty-nine artists from twenty-five countries.The 2018 awardees were: Annaleigh Roesler, Christo, Anke Uyts, Caitlin Laine, Mana Karthik, Reynad Maguire, Tadashi Miyashiro, Sara-Lynne Pfeiffer,  Sunjung Kim, Mark Sisson, Jon Sandberg, Yelena Shishakova, Sara Weiss, Kathrin von Ettelbruch, Catherine Wilson, Cheryl Ann Kent, Catherine Vaisman, Catherine Wittmann, Chen-Yi Zhang, Nina-Taylor Harrison, and and a special appearance by Margot, Rosie, and Valentino Rossi.\n\n\nThe China-based nonprofit ArtAsiaArt held a solo exhibition at the Chengdu Art Museum (CAMD) in Chengdu last week", "The next Biennial should take place in September.\n\n\nHannah Wilke, director of the Museum of Fine Arts (MoFA), Boston, and the inaugural recipient of the $50,000 Lilly Shandler Prize, announced that she is leaving the museum in January 2020 to return to New York to head the Museum of Modern Art (MoMA).She succeeds Anne Gearan, who was hired as director of the museum in January 2019, and will take up the post in January 2021.The announcement was made at the conclusion of a three-day exhibition on the award, “The Art of Illusion,” at the Museum of Modern Art. Stephanie Ullman, cochair of the award's board of trustees, said: “At this time of year, when people are reeling from the impact of Covid-19, and when many are grieving their loved ones, the very essence of art and design is on display. Hannah brings a deep knowledge of the art and design world, an acute understanding of its history, and a passion for the craft.”Previously, the museum has hosted five award winners: Mark di Suvero, Reem Masse, Christopher Wool, Akron Koerner, and David Halberst", "The next Biennial should be held after 2020. The museum is planning to reopen the exhibition space at some point in the next few years, but is currently working on the logistics of a new exhibition. “From our point of view, we are very happy to work with the people of Amsterdam, and we look forward to future collaboration,” Jørgen Maendorf, director of the Biennale of Sydney and the upcoming Melbourne Biennale, told the Art Newspaper. Maendorf said that the show will be heavily curated to suit the interests of both artists and collectors. The new exhibition, “Zaidda: Selected Twenty-First Century Works,” will open on September 25, 2020 and will run until January 1, 2021.\n\n\nThe Danish government has approved a plan to compensate artists and art institutions that were forced to close due to the coronavirus and climate change—overseeing the nation’s largest cultural center Kunstmuseet in Copenhagen. The $10 million grant program will compensate organizations and individuals who were affected by the pandemic and foreseeing their financial losses as the cannons and hand grenades that were used against protesters in Copenhagen in", "The next Biennial should take place in 2022, but the decision has been postponed to 2024, at the earliest. The new site for the exhibition will be selected by the city of Bergen, Norway, and will host thirty-six works, including works by artists such as Adrien Broze, Pierre-Auguste Renoir, and Pierre-Auguste Jacout. The Biennial of New York will launch in 2022.“Since the 1960s, the former Van Gogh Museum has been a model for excellence and for its museum-goers, taking pride in their learning experience and in their appreciation of its impressive collection and expertise,” said Kirsten Seiler, director of the Van Gogh Museum. The new venue will be inaugurated by a large-scale installation of the artist’s drawings and paintings, which will be followed by an exhibition of the artist’s early performance works and then an exhibition of the artist’s early drawings.The new venue will also accommodate a number of the museum’s educational programs, including “Adène Muybridge on the Arts” (2019), “Jean-Luc Berlioz” (2019), and “Wangechi Mut", "The next Biennial should be held in 2021. However, not everyone is happy that it will not be held in 2021. Some are concerned about the renewal of the contract of the studio and its director, Martin Sexton, who will be seventy-nine years old in March 2021. Some also believe the move will accelerate the loss of artistic life.As part of a new three-year scheme, the Biennale Foundation will offer free entry to all of its European and international events from March 16 through March 21, 2020. The free ticketing service will also partner with the Istanbul Design Museum and the Büyükükükükükükükükükükükükükükükükükükükükükükükükükükükükükükükükükükükükükükükükükükükükükükükükükükükükükükükükükükükükükükükükükü", "The next Biennial should be held in 2020, when the museum will be opening to the public for the first time since the pandemic. “In an age of ever-increasing surveillance and ever-increasing disruption, in an age when we are bombarded by ever-more invasive biologics, the biennial is an ideal time to reflect on our place in the world, to reflect on our place within the larger world. We must do this. And we must do it now,” said Kunsthal Aarhus curator Marta Gross, who added that the exhibition “will have a uniquely political and stylistic quality,” and that the exhibition “will not only be about the humans who have lived through the pandemic, but about their potential to live differently.”The 2020 edition of the biennial will be organized as follows:June 24–June 2819· Santiago de Almeida (Mexico City)March 21–March 24April 3–April 5April 8–April 10April 13–April 17April 21–April 23April 29–May 3May 5–May 7May 11–May 14May 20–May 22May 25–May 28May 29May 31 April 3—April 5", "The next Biennial should take place in the year 2020. Since its inception in 1947, the series has been held in various formats, including a retrospective of the work of each artist and a survey of new media art. The next event will be October 21–October 25, 2020.  Inaugurating the biennial is a special exhibition of work by twenty-five artists. The first show was curated by Sinthujan Natarajan, the first director of the Dalla Lana Group, which includes artists Jigar Shah, Aruna Dutt, Kailash Satyarthi, and Juma Rajan. The show will be followed by a discussion group on October 28. The event will be hosted by the National Gallery of Art in Washington, DC (USCWM) and the Museum of Modern Art, New York (MoMA); the Garrick Museum of Art at the University of Pennsylvania, Philadelphia; and the Museum of Contemporary Art, Los Angeles (MCA). The theme for the twentieth edition of the Biennial is \"Introversion: From Picasso to Breton to Picasso’s work, from Lange to Rothko, from Eisenstein to Eisenstein’s studio in the hills", "The next Biennial should open in 2021 and the biennial will be the twenty-fifth iteration of the Award, which was established in 1982 to promote and encourage the development of work by African American artists, including Erma Hammond and W. H. Gabor. The first biennial was held in 1985 and the last was held in 1993. The 2018 season featured the work of seventy-five artists and was curated by Anita Blair, Joan Miró, Gbenga Naidu, Jochen Melzer, Amadou Adebayo, and Gbenga Naidu.The biennial’s artist-in-residence, Tlalenga Fairooz, will serve as the theme of the upcoming edition.\n\n\nThe Museum of Contemporary Art (MoCA) in San Francisco will begin welcoming visitors again on Monday, December 8. The reopening of the city’s public art museums follows the reopening of the city’s controversial Mission Bay, a $1.2 billion expansion project that will include a new museum complex, a public green space, and a new concert venue. The $6.5 billion expansion project is expected to be completed in 2021.“We are very excited", "The next Biennial should take place on the opening of the university’s Contemporary Art Museum. This should mark the occasion of “Phantom,” an exhibition about the architect Knoele Krüger, who died in a plane crash in 1955, and will be organized in partnership with the artist-run museum. The space will also host another exhibition, “Alberto Burri: The Modern Sculpture of the Past,” which will feature work by the artist-turned-collector in a six-thousand-piece installation, inspired by a painting by Giacomo Balla, former director of the Institut für Kunstforum in Hamburg. Curated by Sebastian von Bruenchenhein, the exhibition will be open in September 2019.“We are very excited to welcome this new partner to the museum, with the enthusiastic support of the local community,” said Harald and Haralda Steindl, the museum’s founders. “Alberto Burri takes a new direction in his artmaking, moving forward quickly and with a clear and clear vision. We believe that it will be another landmark event in our history, as he will become our next director. We hope", "The next Biennial should be held in the spring of 2021. \n\n\nThe museum will open next week with a preview of the first exhibition of the new work,  “Death in Venice” (2019). The show will offer a preview of three new works, “Nino Rota,” “Tacita Dean,” and “Diana Alighier,” curated by Dalia Zoubir. The full list of organizers is as follows:  Artsakh Foundation, Azerbaijan’s state museum of culture and history.  Artsakh Art Museum, Azerbaijan’s regional center for art and culture.  Art Gallery of the Azerbaijan University, Azerbaijan’s master of fine arts museum, Artsakh.  The Art Gallery of the University of Azerbaijan, the Museum of Modern Art, Azerbaijan’s master of fine arts museum.  Art Gallery of the University of Art in Baku, Azerbaijan’s collection of works of art from the late Ottoman era.  Art Gallery of the University of Tartu, Tartu. The museum will be inaugurated by the exhibition “Feminine: The Female Body,” curated", "The next Biennial should be held in 2021, with a redesign in 2022.In a commentary published in the September 2018 issue of Artforum, Peter Wolf, director of the Museum of Contemporary Art, London, wrote: “The future of Biennials should be decided by the people. Not by a board of trustees that gets paid thousands of dollars a year. If it was, it would be dismantled and replaced by a new board of directors. The current board is remiss in its dereliction of its duties as custodian of a great collection. I hope the new trustees carry out a thorough review of the Biennial and its future in order to deliver on the vision and vision of Peter Wolf, a visionary collector who made a real mark on art history.”The biennial will be inaugurated by a retrospective of the work of the late British post-war artist Richard Avedon, “Richard Avedon: From Sacred to Disguised” at the Museum of Contemporary Art, London. The show will feature a selection of work by Avedon’s artists, including Christine and Peter Cook, Helen Cammock, and Sally Mann, and will run through November 21. The exhibition will stage a “", "The next Biennial should be held this fall.” \n\n\nThe Museum of Fine Arts (MFA) in Houston, Texas, has temporarily closed its doors to the public in an effort to protect the health and safety of the staff, galleries, and visitors of the institution. The decision was made to protect the well-being of the work community as well as the staff and the institution’s collection, but not to reopen until the work of one of the museum’s avant-garde artists is reopened. In an attempt to protect the collection in the event of a major loss, the museum also added twenty-nine works by the late artist Dennis Hopper to its collection and reopened the database of works by the late American painter Ralph Selgin, which was closed until the onset of Covid-19. While the institution has not publicly addressed the circumstances surrounding the shutdown, the first statement made by museum director Marc Headley was that it is working with local, state, and federal health officials to determine the best course of action. The museum will remain closed until at least mid-October, and when it reopens, visitors will only be permitted into its galleries during the week of October 13–14. The institution has", "The next Biennial should embrace an ambitious program that will combine programming in all four fields, including sculpture, performance, publishing, and film. All of the fifty-six artists who were selected by the biennial’s board of directors are active artists and have won prizes. The artists will be given the opportunity to present new works during the exhibition.The theme of the upcoming exhibition is “Cosmology and the Art of Life.” There will be three chapters devoted to the history of ideas in the exhibition. The first examines the history of the concept of a cosmic spiritual being; the second explores the role of the artist in the creation and evolution of art; and the third focuses on the artist’s relationship with the cosmos.\n\n\nThe New York architect Frank Gehry, who transformed New York’s Central Park into a huge free-standing installation for his monumental Rockefeller Center installation (Trespasser), is suing the city of New York over the landmark installation’s demolition. In the suit, which was filed on June 8, Gehry claims that the city was negligent in not allowing the work to be put into storage prior to its demolition, which was carried out on June 13, and therefore owes him $7 million.", "The next Biennial should take place in 2021. The twenty-fourth and twenty-fifth editions of the biennial will be held in 2021; the 2021 edition will be staged at the National Gallery in London and the National Museum of Modern Art in Paris. The twenty-seventh and twenty-eighth editions will be held at the Art Nouveau Museum in Paris in 2022 and 2022, respectively.\n\n\nThe Museum of Modern Art (MoMA), New York, and the Arsenal program have announced that they are collaborating on a new online-only exhibition featuring work by forty-three artists, including Stan Brakhage, John Graham, and Mike Kelley, in the coming months. The exhibition will be free to the public and will be curated by Richard Armstrong, director of the civil and environmental engineering center the District, and will be hosted on the Museum of Modern Art’s platform, the museum’s website, and the Arsenal platform. The exhibition will be on view on January 4, 2021 and will run for a minimum of thirty days.“For decades, MoMA has been dedicated to celebrating the art of the American West and improving the lives of people in the Bay Area,” said William C. Polson, chair of the museum", "The next Biennial should include a selection of works by artists of African and African American descent. The twenty-fifth will be the last, and will be curated by Sarit. The seventy-third will be held at the University of Michigan.The next exhibition to feature works by outside artists is a film by the Los Angeles-based artist Sofia Aulba. The show, titled The Life and Death of Jesus Christ, will be on view until March 17. The artist will use her performance to revisit the central question of the crucifixion and Christ’s death. The festival will also consider offering a retrospective of the work of the artist in 2021.The next annual Art and Movement conference will be held at the New Museum in New York on March 22–March 30 and will be hosted by David Kordansky. The 2018 edition of the Biennial was held at the Fashion Institute of Technology in New York from March 5–March 8 and featured works by forty-eight artists. The 2019 edition was held at the Museum of Modern Art in New York from March 12–March 16 and featured works by forty-nine artists.\n\n\nThe Metropolitan Museum of Art in New York has appointed David Litt, who previously served as a curator at", "The next Biennial should be held in the city from mid-March to the end of April, and will consist of the following: Themes of the exhibition: Introduction to the exhibition. Sponsors: Building the Biennial, a museum dedicated to the exhibition of art in the exhibition. The exhibition is organized as follows: Organization 1  1 1 2 3 4 5 6 7 8 9 10  Themes of the exhibition: A collection of photographs comprising the work of Emil Tillmans, Alexander Calder, Sylvia A. Hauschka, Henri Lévy, and Georges Stéré. Artists: Anna Pape, Angela Pape, Sara Cwynar, John Oster, Juan Ramón Pérez, Jean-Luc Prévost, Vijay Singh, and Frank Stella. The Artists: John Lennon, Yoko Ono, and Martin Luther King Jr. Some of the artists participating in the exhibition include Efrem Zelony, Alighiero Brizzi, Luis Buñuel, Simón Barba, Lu", "The next Biennial should be held sometime between March and May. \n\n\n\n\n\n\nThe Royal Academy of Arts (RA) in London has adopted a new decision-making structure that will give the Royal Shakespeare Company (RSCo) greater control over its future programming. The academy, which was forced to cancel its March 2019 season in protest of the Royal Shakespeare Company’s decision to cut its budget by $8 million, says it is working with the RSC on the new governance structure that will ensure a more balanced, cross-disciplinary approach to the company’s productions as well as its future programming.While the academy chose to break away from the RSC in order to save $1 million per year, the move has angered some who believe it was made in order to save money—at a time when the corporation is expecting to lose around $16 million a year due to the pandemic. As a result, the academy voted to raise the rent of the venue by $500,000, to $634,000, and to invest in the production schedule of the company, which is run by the Association of Stage Owners (ASPO) and has a worldwide network of approximately 70,000 members.", "The next Biennial should include a selection of works on the death of socialist leader Vladimir Lenin, the origins of the term capital punishment, and the relationship between art and theory. The theme should be “Life and the Struggle for Power.” To make room for the work, the exhibition will scrap the original statement, “The Problem of Power” and will instead focus on the contemporary situation in the former Soviet republics.The Biennial is supported by the European Regional Fund for New Art (ERC) and the European Commission. The commission will announce the winners of the next two iterations of the award next week.  The next edition of the Milan Biennale will take place in spring 2021.\n\n\nThe Louvre in Paris has received a gift of 2,500 works from the Museum of Modern Art (MoMA) in New York. The gift includes works by Dominique Anselm, Mary Cassatt, Michelangelo Antonioni, and Pierre-Auguste Renoir. “The Louvre has been an integral site for the exploration of art and new ideas,” said Florentin Ciavarella, curator of the exhibition “Nosferatu: The Rise and Fall of a Vanishing Style and", "The next Biennial should be announced as soon as possible.  The event will be curated by Sabine Martin, curator of contemporary art at the Museir de Lyon and an expert in the history of art; Marianne Fongo, director of the Bridget Riley Art Museum in the Netherlands; and Masouda Hossain, director and CEO of the MNE Foundation, in Abu Dhabi.  The inaugural exhibition will feature new work by the artist-turned-philosopher Yayoi Kusama, whose work explores gender and the body from a feminist, anti-capitalist, anti-sectarian, and anti-imperialist perspective, and will be organized in partnership with the new literary center in Abu Dhabi, the Al Ain, which will be inaugurated in 2022. “I would like to see a new biennial in Abu Dhabi that will be a celebration of the history of art rather than be a vehicle for maintaining and expanding the museum’s collections, collections, and collections collections’ historical narratives,” said Sascha Jäger, director of the State Museum of Art, Abu Dhabi, and the former director-general of the MNE. “This new exhibition will introduce you to the history", "The next Biennial should take place in the Spring of 2021. The 2019 edition, titled “The Selfish Gene,” was held at the same venue in January 2020.\n\n\nThe New Museum in New York is planning to shutter its entire art collection by the end of the year. The news follows the announcement of the museum’s reopening in April of 2020, a plan that has been in the works since May. The announcement of the museum’s reopening coincided with the opening of three new works by Canadian artist James Jordan: Cecilia and Daniel, a monumental public installation that retells the life of a young girl in the city of Prague; Tunnel Vision (Tunnel), a public installation that reimagines a tunnel in the shape of a mannequin, and The Last Action Hero, a monumental public sculpture that depicts a group of seven young men in a cage in the city of New York.“Nemo’s goals of creating a new Museum of Modern Art, a major new city in America, and a Museum of Modern Art in Canada have never changed,” museum director Daniel H. Weiss said in a statement. “Nemo’s vision for", "The next Biennial should be held sometime in 2021, Crowe said. “This is a crucial time to work with artists outside of the comfort of our own borders and explore new realities.”\n\n\nThe House of Culture in the City of London (HofoC) in London has received a gift of some sixty works by eighty-one American painters. The works are displayed in a group exhibition entitled “Howl,” which will run at the Abbey Arts Centre from February 9 to March 2, 2020. The event will be led by artist-in-residence Jane Panetta, who will be accompanied by a selection of contemporary artists, including Edward Atkins, Angela Clarke, and Nada Izquierdo. The show is curated by Susanne Vaisman, the director of the Abbey Arts Centre, alongside artist-in-residence Peter Schäfer, artist-in-residence Lukas F. Wong, and artist-in-residence Isabelle MacPherson.Commenting on the gift, the Abbey Arts Centre said: “The 2018–19 season has been a highlight of our programme, and the paintings presented here represent the most vibrant and emotionally resonant perspectives of painters recently selected.", "The next Biennial should take place in the first quarter of 2022. Arts Administrator Nomi Prins and the biennial’s board have decided to cancel the first edition of the annual event, which was founded in 1918 by a group of American artists, in order to conserve the biennial’s original and unique heritage. Among the artists whose works are currently on display in the exhibition are Peter Hujar, Tomasz Tapp, Eric Paxton, Harald Szeemann, Peter Simonson, Alexander Skarsgård, and Jügen Teller. The exhibition will return in the second half of 2022. The first iteration of the biennial took place in the summer of 1922, at the Goethe-Institut in Cologne, and was organized by Walter Gropius. \n\n\nThe public memorial for the victims of the Covid-19 pandemic is now a thousand feet tall and boasts a sculpture made from nearly twenty thousand pounds of donated organic material. The work, titled The Last Word, commemorates the eighty-two individuals who died from the virus, which was first identified in December. Born in 1967 in North Carolina, the artist is known for her sculptures that address themes of memory, politics, and social", "The next Biennial should begin with a discussion of the history of the exhibition, with an examination of its current state, and should include a selection of works that have recently been exhibited. If successful, the Biennial will be the first exhibition in UCCA’s twenty-year history.\n\n\nArtPrize announced today that it is launching a new award, for contemporary art, that will provide $500,000 to grantees. The new prize will be based on the same principles as the Biennial, and will focus on visual art and artmaking, with a new twist. The new award will be presented by ArtPrize, in partnership with James Madison University, and will be presented in stages, each year, beginning in 2020. Since the inaugural award was established by ArtPrize in 2008, the 2020 prize was awarded to Sara Cwynar, Catherine O’Leary, Danilo Pincus, Gina Prince-Battista, Wangechi Mutu, and Jay-Z. Other awardees include Max Ernst, Hans-Ulrich Ludwig, Andrea Fraser, Adrian Piper, and Ivan Albright.Each winner will", "The next Biennial should be held in Sydney in 2021 and the first in Los Angeles in 2022.\n\n\nThe Museum of Modern Art (MoMA) in New York City is planning to move the forty-six-minute-long film, The Belle, from its current home at 701 East Twenty-Fourth Street, which was completed in 2013, to a temporary exhibition space in the museum. The move will keep the film, which dramatizes the life and death of American photographer Belle and has been viewed by millions, in its home for eighty-six days.The move will also allow MoMA the opportunity to experiment with new materials and new technologies—the museum first tested out glass and steel in its temporary installation, which opened in 2013, in its basement. In 2015, MoMA moved the film from its current location on the west side of the museum to its new location on the east; in 2018, MoMA also created a new exhibition space in the museum.The move was made after MoMA announced that it would discontinue its annual exhibition “The Belle: The Photographs” and start a new event, “The Belle: Firsts,” that will take place every other year. The inaugural event, which celebrated", "The next Biennial should be held in 2021, according to the Art Newspaper. The next edition of the Art Basel Hong Kong, which will be held at the Promenade de Paris on September 29–October 9, will be held at the Hong Kong Convention and Exhibition Centre (HKC) in December 2021. The Hong Kong Exhibition and Conference Center will also be able to host the next iteration of the Hong Kong Art Book Fair, which was held from May to October 2018. Hong Kong’s ArtAsiaPacific Biennial, which will take place at the Asian Art Museum in Shenzhen from May 3–May 5, 2020, will also be possible to stage online. The 2017 edition of Shanghai Art Biennale, which was organized by China’s Shanghai Art Museum and Science and curated by ArtsPrize, was also staged at the Shanghai Art Museum. Tickets to the event cost between $47 and $98.\n\n\nThe Museum of Modern Art (MoMA) in New York announced today that Andrew Kreps, who has been the curator of contemporary art in the United States since 1994, will become the next director of the Metropolitan Museum of Art. Kreps will assume his", "The next Biennial should start in March 2019, and will take up the theme “Sovereignty: A Biennial History,” which has been used in the past to highlight the work of artists whose works are not directly related to the institution. The theme of the 2019 exhibition “10,000,000,” was chosen after an open call by the committee chaired by Mona Hatoum, who served as Chair of the twenty-third edition of the Biennial in Madrid.The 2020 edition, “20,000,000,” will be a “classic” installment, showcasing the work of thirty-eight artists, whose works were selected by a prestigious jury comprising artists, historians, curators, and critics from fourteen countries. The first exhibition will be the biennial’s opening ceremony, which will take place at the National Museum of Modern Art in Abu Dhabi on September 29.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Kate McKinstry as its next director. McKinstry will assume her post in January 2021.“Kate’s leadership and leadership performance show the power of a visionary, highly collaborative culture of artists and institutions in LA, and why we", "The next Biennial should be announced soon.\n\n\nAmerican artist and educator Thomas Alva Edison, who helped make the field of artificial intelligence possible, died on November 30 at age seventy-eight in New York City.Born in New York City in 1935, Edison received his undergraduate degree at the University of Rochester in 1944, and his graduate degree from the Massachusetts Institute of Technology in 1949. Following a stint at MIT, Edison returned to New York to study at the New York Academy of Art, where he would continue to draw inspiration from his experiences in high school. In 1950, he cofounded the visual arts and science program at the Harvard University Art Gallery, where he would serve as curator of the institute’s first science fiction and fantasy series, the Advent Calendar, for ten years. The following year, he and his wife, the novelist Jane Austen Nielsen, formed the organization the Fellowship of Arts. The organization later merged with the Institute for Contemporary Art and the National Gallery of Art, where it would remain until its dissolution in 2012.While at the institute, Edison taught at the school of painting, sculpture, and movement, as well as at the School of the Art Institute of Chicago, the School of the Arts, and the School of Visual Arts, where", "The next Biennial should focus on the history of the artist’s studio and on the role of the artist in shaping culture and the possibilities for the 'art of the artist.”\n\n\nThe British Council (BEC), an independent organization of British businesses that was created in 1908, has launched an online survey that will ask 1,500 business and cultural leaders questions such as whether it is better for art museums to close or expand, and analyze their perceptions of the current global crisis. The online platform will then present the results in a biennial exhibition at the Museum of Modern Art (MoMA) in May 2021.The initiative was inspired by an article published by the British architect Thomas Heatherwick in the October 1893 issue of Art of the Artist (a precursor to the BEC). In Heatherwick’s words, “The art of the artist is a series of practical arrangements of artworks in order to form a new kind of work,” a concept that would become the basis of the biennial. The biennial will be a “springboard for a reconsideration of art, its relation to society, and the institution of the artist in the twenty-first century.”The BEC’s list of participating artists", "The next Biennial should be held in 2020. The event will be hosted by the Museu de Arte Contemporânea in Madrid and will consist of a series of exhibitions and a symposium. It has yet to be determined whether the 2020 event will be organized as a series of exhibitions or as a symposium.\n\n\nThe National Museum of Fine Arts (MMFA) in Columbus, Ohio, which is currently closed due to the Covid-19 pandemic, is reopening with a new, redesigned, and expanded exhibition, “The Gods and Goddesses of Art: Art and the Image,” on September 21. The exhibition will draw from the collections of the museum, the Ohio Arts Museum, and the Ohio History Museum to present a series of works that examine the relationship between art and nature.The museum will also present two new works by artist Spike Lee, “Fashion: Fashion” and “Rubber: Rubber and the Image,” both 2019. The 2019 exhibition was curated by Laurie Anderson and featured work by twenty-four artists, including Amanda Ross-Saunders, Carmel Merritt, Amy Sherald, and L.A. Reid. The 2020 exhibition will be curated by Deborah P", "The next Biennial should be ready by the end of the year and should further incorporate creative processes and new pedagogic approaches from contemporary art and design. One of the main themes of the upcoming event will be the transformative powers of technology and social media.\n\n\nThe Museum of the City of New York (MCA) is moving to a new home in Downtown Manhattan. The institution, which celebrates its thirtieth anniversary this year and has faced numerous expansions of its footprint, announced that it will open a new six-acre site in the Hudson Yards development community on Thursday, June 9. The site will be inaugurated by a two-minute video tribute to the thirty-six artists who have died or were incarcerated. The video will feature works by such luminaries as Anna Atkins, Lillian Black, Lenny Bruce, Kenneth Clark, and Mieko Breihan.The installation will feature works by a number of artists who have long-standing collaborations with MCA, including Robert Irwin, Bob and Huey Lewis, and Stephen Sondheim. The show, titled “Sylvia and Rosemary” and curated by MCA curators Amy Zambetti and Alex Thayer, will focus on the legacy of Spanish American architect, activist,", "The next Biennial should be held at the museum once a year, between May and June, 2019. The 2020 edition will be held in the museum, which is currently undergoing a $225 million expansion.\n\n\nThe Metropolitan Museum of Art (the museum) in New York has announced that, in recognition of the museum’s longstanding commitment to advancing the work of artists whose practices are fundamentally rooted in the history of their disciplines, it will mark its centenary with an exhibition dedicated to the work of a new group of artists who have recently entered the canon.The show will feature the work of three newly commissioned artists: Samantha Peck, Lee Krasner, and Michael Köppl. The exhibition will open in the museum’s new space, “The Met,” on February 14, 2020 and will run until March 7, 2020. The exhibition will be curated by László Nemeth and will feature the work of Lee Krasner, Michael Köppl, and Roao Mier. To mark the occasion, the museum will begin its series of “Art Talks,” which will focus on the work of a select group of artists whose work has recently entered the museum�", "The next Biennial should be held in 2020. The upcoming exhibition, “Postmodernism” will be hosted at the Museum of Contemporary Art in Mexico City from January 21 to January 24, 2021. The 2019 exhibition, “Performances from the Imagination, 1959–1979” was on view until March 24, 2020.\n\n\nThe Makkah Museum in Saudi Arabia (Museum Musannat) has announced that it is expanding its relationship with the British artist Graham Smith. The institution will partner with the artist on a series of exhibition projects in the country, which is currently experiencing a severe heat wave, and will present his work at a future exhibition.Inaugurating the exhibition are “Singer-Song: Divine Feminine” and “The Shape of the Night: Graham Smith’s Cosmic Night.” Dubbed “A World of Yours,” the first show will focus on Smith’s constellation theories of the night sky and how he adapted his works to fit the various systems of the celestial bodies. The second show will include photographs of Smith’s works from the Nirvana Project—a collaborative project between Smith, Solveig", "The next Biennial should be the last of its kind, focusing on the study of the history of the studio, the museum, and the city of Biennale. The project will consist of the following elements: --The exhibition “Life and Legacy” will explore the role of the studio in the development of modern art, from the history of the medium to the present. The exhibition “The Art of Life and Life Simulations” will focus on the exhibition “Simulation of the Body: ‘Life’ as a Contemporary Art World,” and will present the works of contemporary artists whose practice is interwoven with and inspired by that of the Biennale, including Klaus von der Leyen, José Luis Borges, and Yasser Arafat. “The Art of Life: Biennale” will open at the BIR, the Museum of Modern Art in New York, the Whitney Museum of American Art, and the Anselm Kiefer Art Museum Berlin, and will run through February 26, 2020.\n\n\nThe Metropolitan Museum of Art in New York has named Tanya Delorme as its next director. Delorme comes to the museum", "The next Biennial should be announced shortly. The event will be held at the Mana Contemporary, London, from January 21 to January 26, 2020.  The museum will also host an exhibition of works by the group of artists known as M. Ginter + Alexander in March 2020. The opening of The Crew, an experimental space in Manhattan, will be held at the Contemporary in March 2020.  This year’s entries will be presented by artist-in-residence, Richard Anuszkiewicz, and the winner will be announced by June 15. Throughout its history, the event has featured works by sixty-eight artists. Tad Williams, the executive director of the biennial, described the biennial as “a milestone in the history of the biennial.”“This is a truly exceptional year for art and the biennial is an ideal platform to address the many pressing social and cultural issues of our time,” he said. “The biennial will bring together exceptional artists from thirty-six countries for a unique exhibition that will engage and challenge the borders between art and culture, art and politics, art and education, art and aesthetics and art and life and the chances for", "The next Biennial should be held at the eleventh arrondissement in Paris in the spring of 2021. The exhibition will emphasize the history of the art in a contemporary setting and will also extend its programming to take place across time and space. The upcoming edition of the event will bring together artists from twenty-six countries and fourteen locations in the world.The theme of the upcoming edition is “I, L, and I, II,” a reverent tribute to the late French socialist artist and theorist Georges Seurat. Prior to joining the socialist party in 1968, the Belgian-born Seurat participated in the Paris- and Brussels-based left-wing group Poussières en Terre, an offshoot of Seurat’s eponymous collective (founded by Pierre-Auguste Renoir, the father of late French painter Maxime Renoir). The group merged with the French artist Guy Debussy in 1972, and the foursome then formed the nomadic group Panorama. The group’s output includes paintings, sculptures, installations, videos, performances, photographs, and tributes.\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Rachael Bade as its new curator of modern and", "The next Biennial should be held in 2021.\n\n\nThe Museum of Fine Arts (MFA) in San Francisco has launched a new digital initiative that will allow visitors to experience the museum in person. The platform, called Visitor Experience, will debut with five new works by artist and activist Damián Atahualía—including his latest work, “Kamala” (Citrus), for which he will deliver a solo show at the institution in early January—as well as five previously untitled works. The works will then gradually transition to a biennial format.“The world is changing, and the art world is evolving,” said Mary Anne Carter, the biennial’s curator of contemporary art. “We wanted to create a platform for artists to be able to connect directly with the works of Damián Atahualía and others who are keeping their practices grounded in social justice and ecological concerns.” The artist’s work will be provided by the museum on a permanent basis.In a statement, the MFA said that the initiative’s launch was important to creating the new platform. “It was a long-held aspiration of Damián Atahualía and his", "The next Biennial should take place at the Auckland Art Museum (AAPM) in October 2021, with a fifth edition at the Cromwell Art Gallery in February 2022. The next exhibition should also focus on the history of the New Zealand Pacific Island nation and “The End of History.”\n\n\nThe National Gallery of Canada announced today that Sinthujan Varve has been named the new director of its Vancouver outpost. Varve comes to the institution from the Museum of Fine Arts (MFA) in New York. She succeeds Hannah Rusk, who retired following eighteen years at the helm of the institution on January 31.“We are excited to welcome Sinthujan to the National Gallery of Canada,” said Linda Babiak, the director of the museum. “Her leadership experience and passion for the arts will continue to be vital as we build upon the expertise and creativity of Hanno Hanuka and keep Vancouver at the forefront.” Varve began her career at the museum as a curator and educator. She was hired to lead the Vancouver outpost in 2009 and served as director of the Vancouver branch until 2012, when she was hired as the director of the Smithsonian’s National Museum of African", "The next Biennial should be held in the coming months. If all goes as planned, the exhibition will open in the spring of 2020. Jewish Museum: A Retrospective (2019) (D. Michael Ryan, New York) (The biennial will also feature a new solo exhibition of work by artists such as Robert Irwin, Lesli Linka, and Howard Siskind at the Yale Center for British Art in the fall of 2020.)\n\nThe Solomon R. Guggenheim Museum in New York and the Metropolitan Museum of Art in the Bronx, New York, have teamed up to create a new immersive work on the life and work of Philadelphia–based artist David H. Dinn, whose work incorporates sculptures, paintings, and animations. Dinn is known for his installations, which often incorporate live performance and other artistic projects, and for his videos, which frequently explore themes of friendship, love, and others. The partnership between the two institutions was announced in partnership with the David H. Dinn Foundation on May 1.In the video for its number one, which premiered at the Biennial at the Museum of Modern Art in New York in 2019, Dinn assembles a group of male", "The next Biennial should take place in September 2021, and the first since 2019. This will mark the fifteenth incarnation of the festival, which was launched by the German government in reaction to the ongoing conflict in Syria. The event will be hosted by the German Federal Cultural Center Berlin (BAM) in partnership with the city of Berlin. Its inaugural edition, titled “Festival of Ideas,” held in December 2016, brought together twenty-one works in the exhibition series. The exhibition was organized as part of a three-year curatorial project. A selection of the works created by the participants will be presented as part of an exhibition titled “Feminine/The Right to Life” at Berlin’s Karl Maria Remarque–Government-funded Borghesegalerie in September 2020. The exhibition will be held in the public gallery of the Karl-Maria Remarque–Government-funded Karl-Maria Remarque–Government-funded Karl-Maria Remarque–Government-supported Karl-Maria Remarque–Government-funded Karl-Maria Remarque–Government-funded Karl-Maria Remarque–Government-funded Karl-Maria Remarque–Government-funded Karl-Maria Remarque–Government", "The next Biennial should focus on a single artist, and in this case an Argentinian artist, who, beginning in the early ’70s, transformed American photography and the American canon. The works of Erik Maruyama, David Salle, and Francis Ford Coppola will be featured.\n\n\nThe Solomon R. Guggenheim Museum in New York has received a gift of twenty-eight works on paper from the artist Ellsworth Kelly, who passed away on March 18 at the age of eighty-eight. The works, which are in the collections of the Stein and de Maiz galleries in New York and the Guggenheim Museum, were donated by the artist and his son, John, in recognition of their achievements as two Pulitzer Prize–winning photographers in the 1970s.“The gift was made in recognition of the work that has been achieved by Kelly over the years,” said John Guggenheim, Kelly’s grandson and the museum’s senior curator of photography and prints. “And since Kelly was a leading artist of his generation, this is a wonderful occasion for us to present to our visitors a collection of his early work. We are eager to feature this work in our upcoming exhibitions and", "The next Biennial should focus on the biennial, its history, and future plans. The 2019 edition has already received a major update with 77 percent of the exhibition’s curatorial team returning for 2020. The full list of participating artists is as follows: Arts, Commerce, Entertainment, & Media: Mona S. Peña, Jorge Luis Borges, Hans Klarensky, Josef Albers, Robert Irwin, Gilles Lavigne, Hans von Ghent, André Detmann, José Manuel Pérez-García, Luzia Soriano, Hannah Wootton, Jimmy Wales, José Luis Pérez-García, José Manuel Pérez-Giroux, Robert Irwin, Robert Irwin, Robert Irwin, Robert Irwin, Robert Irwin, Robert Irwin, Robert Irwin, José Luis Borges, Suello Solares, Tina de Sousa, Salvador Dalí, Theater, Film, & Television: Wangechi Mutu, Wangechi Mutu,", "The next Biennial should take place in August 2020, and the venue should be moved from Art Basel to the São Paulo Biennial.In a statement, the museum said: “The important question of how to change the architecture of the exhibition spaces and the way we present art, which is an essential aspect of the exhibition, is at the core of our work. We are currently in the process of designing a new platform that will present modern and contemporary art in a coordinated and innovative way. The work that we have done thus far is in a way a continuation of the work we have been doing previously. We are happy to say that this new platform will be the spirit of the exhibition.”\n\n\nThe Smithsonian American Art Museum (SAAM) in Washington, DC, has appointed Brett L. Sullivan as its new deputy director for collections and exhibitions. Sullivan arrives at SAAM from the Museum of Fine Arts, Boston, where he has served as deputy director since 2017. He succeeds Amanda Sharp, who has served as interim director since January 2018.“Brett has been instrumental in developing and positioning the institution as a national leader in American art,” said Sarah Fries, chair of the newly elected board of trustees. “Since he", "The next Biennial should start in the autumn and will be comprised of twelve exhibitions, each directed by an artist. The works curated will be chosen by the jury, made up of Günther Ott, an expert in modern and contemporary art, and Martina Østbye, a curator of contemporary art, in collaboration with the artist and curator Joachim Neugroschel, from among the sixty-nine nominations submitted by the artist.The jury will consist of former chair Janez Stapel, who served as director of the Berlin Biennial from 2001 to 2010, as well as Kjetil Apa, the founder of a company that sponsors international art biennials in the city, as well as Sigmund Freud, who served as the chair of the jury; Simon Brown, the curator of contemporary art at Tate Britain; and Michelangelo Antonioni, the director of the Deutsches Museen in Kassel.\n\n\nThe New York–based nonprofit organization Artadia has received a $4 million donation from former Israel Defense Forces (IDF) chief Ehud Barak, who served as defense minister from 2008 to 2009, and is now asking the government to continue to support the organization through its next iteration, titled ID", "The next Biennial should take place at Redfern Studios in September, 2020. Meanwhile, the biennial, which is set to run for eighteen months, is continuing to present work by artists and writers from around the world, including Kate Spillman, Bernardine Malyon, and Trisha Brown.\n\n\nThe Greek government approved on Thursday a $10 billion aid package for the country as it attempts to stem the spread of the coronavirus. The legislation, which is part of a $19.7 billion package agreed upon by the European Union, the International Monetary Fund, and the European Court of Auditors on November 3, aims to mitigate the financial fallout from the coronavirus.The legislation lays out how the country’s public and private sectors, including food, energy, and retail, will be supported through the next six months, when public health measures in Greece are expected to be in full swing. The legislation also outlines how Greece can remain within the eurozone, which is still trying to stabilize its banking system following a massive devaluation of the country’s currency in April.While the legislation commits Greece to remit €7.5 billion of the aid, it stipulates that the funds are only available in the form of loans", "The next Biennial should be held in Bali in 2021.According to the Art Newspaper, the event’s director, Rebecca Sherrill, said: “Over the past few years, we have worked around the clock to bring the exhibition to as many cities as possible and have had the opportunity to present the exhibition in New York, Paris, Tokyo, and London. We are thrilled to be working with the artists who are creating and are grateful to the city of Bali and the event’s sponsors for their support.”As one of a handful of art museums in Asia to reopen under a new vision for the museum, the Beijing Art Museum aims to reopen with a retrospective of Chinese artist Zhang Yilai’s 1980s exhibition “Penguins and Pigs,” originally scheduled to open in January. The museum will also reopen with a new discussion group series and a new exhibition titled “Art in Transition,” curated by Zhongguo Geng and curated by Zheng Yilai. The Beijing Art Museum is also planning to move the senior’s exhibition to the capital’s Shenduangdaigangdulai from the", "The next Biennial should be on the redevelopment of the city’s oldest art museum, the Art Institute of Chicago, which opened in 1921. The institution is currently undergoing a $500 million revamp and is currently being marketed as the city’s “next great museum of art.” Boston’s Museum of Fine Arts (MFA) is also planning to reopen in the fall. Its fall 2020 edition will take up themes of memory, race, and displacement. The institution will unveil a new twelve-foot-tall statue of Katherine Johnson in 2022.In an attempt to contain the coronavirus, which can be spread by coughing, breathing, or touching an infected person’s face, the United States Centers for Disease Control and Prevention (CDC) said on Monday that it is preparing for another outbreak. The number of cases in the country has now risen to 775 and the death toll has risen to 63. While cases are spread mainly by close contact—males and females are contagious together—the virus can also be spread through bodily fluids, such as saliva or tears.On Tuesday, the CDC issued a second-round reduction in the number of cases it anticipates in order to help curb the spread of the", "The next Biennial should start in March 2021 and will last for eighteen weeks. The event will be hosted by the Tate and curated by artistic director and chief curator Adam Bandt. The biennial is part of Tate’s plan to transform the way it presents works of art and is one of a number of initiatives that will result from a £10m donation from collectors Baron and Augusta de Rothschild and their families to Tate. \n\n\nThe Rubell Family Foundation has donated $10 million to artists who are working toward or have successfully completed their first solo exhibitions at the Rubell Museum.The organization made the gift in recognition of the lifetime achievement of the Rubell brothers, who have been recognized as the Rubells of American photography since their partnership with the New York–based nonprofit the Whitney Museum of American Art in 1972. The museum acquired the Rubell photography label in 2004 for $1.25 million.Since the foundation’s founding in 2014, the organization has given $4.5 million to artists. In 2017, the Rubells donated $2.5 million to the Whitney, which created an award program that honored artists who have established new careers as photographers. For the first time, the $1 million award was given to a Rubell brother", "The next Biennial should be held within the next two years, and organizers are working with experts to ensure that the theme 'the future of the museum, its collection, staff, and visitors, will be determined by the museum’s values and how we live and work in the future.”\n\n\nThe Museum of Contemporary Art (MoCA) in Kansas City, Missouri, has appointed Sarah Epps as its next executive director. According to the American Federation of State, County, and Municipal Employees, which represents more than four hundred employees, Epps’s new position is a “significant step toward ensuring the long-term health and well-being of our Great Lakes region.” She succeeds Rich Monaghan, who retired after a decade at the helm of MoCA in March 2019. “Sarah Epps is a leader in our field, with an impressive track record of executive and strategic development, and we look forward to her leading us to new heights of artistic excellence and leadership,” said MoCA board chair Kiyomi Matsumoto in a statement. Epps will take up the post on January 18.“I’ve been inspired by Sarah’s incredible talent and vision for", "The next Biennial should be held at the newly renovated city of Lalitpur, in the northern state of Bihar, on March 23 and March 24.The exhibition will feature twenty-six works that were presented in the award show in April, and will feature the first work by the artist, a large-scale reconstruction of the Congo River, which is currently being restored at the Lalitpur Museum of Art. The project was supported by the Lalitpur Foundation for Contemporary Arts and Arts India, the British Indian Film Institute, and the Lalitpur Art Foundation.Dr. Dara Mukherjee, director of Arts India, said: “Our mission has always been to support artists, and we are thrilled to be working with the artists of Lalitpur and throughout the country. They have made significant contributions to culture in India and are truly the inspiration of young India. They are a true exemplars and we hope their work is inspired in the young generation of artists in India.”\n\n\nThe Royal Academy of Arts (RA) in London announced today that Sawangire Dantjal’s first solo exhibition at the academy since its founding in 1930 will open on December 27. The show, titled Art in the Age", "The next Biennial should focus on “How Design and Designing Can Be Transformed,” which is a key topic for designers concerned with the future of design in this context. The 2019 edition of the exhibition will include the first work to be exhibited by the internationally recognized artist and the first engagement with Hans-Joachim Neubert, a Pritzker Prize–winning curator and the founder of the Berlin-based architecture studio Haus der Kunst. The biennial, titled “Polarity: Art in the Age of the Storm,” will run from December 17 to March 11, 2020.\n\n\nThe Colosseum in Rome will reopen next year with a costume party featuring choreographers, actors, dancers, and other artists from the ancient city. The second edition of the exhibition, titled “Colosseum, Rome,” will return in October 2021.The curators’ decision to embrace the theme of the Colosseum was not a decision taken lightly. “We chose to open with a costume party,” said Valentina De Sousa, the chief curator of the exhibition. “It was a decision not to waste time on the exhibition, which is a", "The next Biennial should focus on “The Future We Want”, a series of documentaries that explores the human condition, the environment, and the entire landscape through the lens of an anthropologist and a sociologist. The exhibition will feature work by eighty-four artists who have contributed to the exhibition. The half-dozen remaining works will be presented in the exhibition “The Divided Self: A Biennial History” (2019) at the Odd Fellows Museum in New York, which will be inaugurated by a group exhibition of the same title, which will be held at the ground-floor of New York’s Madison Square Garden (MSGG), in January 2021. The project will feature works by seventy-four contemporary and established artists, including Monica Roesler, John Seasteader, Willa Cather, Anthony Faiola, and Paolo Baratta, and will unfold over thirty years and will take place at an undisclosed location.A selection of the artist’s recent works will be presented in the exhibition “Anarchy,” which will open at the Institute of Contemporary Art (ICA) in London on January 24, 2020. The exhibition will be followed by “The Future of Humanity?”", "The next Biennial should take place in 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that Aria DeSousa has been named its new associate curator of contemporary art. DeSousa will work with the engagingly-named curator of Modern Art, Alex Koper, to develop a new program that will engage with the work of contemporary artists.“We are thrilled that Aria is joining us at MoCA,” said curator and co-founder of Modern Art, Alexander Calder. “She has the vision and the talent to continue to develop and advance the program. We look forward to working with her and to seeing what she develops.”\n\n\nThe Centre Pompidou in Paris is planning to open a new public art museum in the capital of the Seine-et-Marne region next year. The institution, which aims to offer a platform for the internationally acclaimed artist Jean-Michel Basquiat and his works, will also house a collection of works by lesser known, less celebrated, and more important artists such as Olivier Assayas, Claude Monet, and Pierre-Auguste Renoir. The twenty-sixth edition of the exhibition “Centre P", "The next Biennial should be held in the fall of 2020. The festival will be hosted at the National Museum of Contemporary Art in Boston, Massachusetts, with a goal of revitalizing American art by connecting people with the arts through a variety of mediums through the use of innovative platforms. The first event, Artforum’s 20th Anniversary Celebration, will be held at the Boston Garden from September 24 to 27, 2020. The second, “Artforum Live,” will be staged at the Massachusetts Institute of Technology (MIT) from September 21 to 28, 2020. Reportedly, the first new festival was held in 1967, and every subsequent event was in honor of the late art critic Ralph Giles, who died in 1994.During its inaugural event in 1970, the festival spawned a series of subsequent festivals, each led by a contemporary artist, such as Peter Hujar, Robert Irwin, and Jane Birkin. The festival’s 130th edition, held in 2019, was also co-sponsored by the National Gallery of Art in Washington, DC.\n\n\nThe Ford Foundation in partnership with the Autry Museum of American Art in Detroit and the Metropolitan Museum of Art in New York announced today that they will jointly award $3 million in", "The next Biennial should be organized as follows: The Île-de-France, France:November 29th–December 1st2019 and will include performances and presentations on contemporary art, related topics, and the creative process. The Paris Exhibition of Modern Art: November 19th–December 21st2019 and will include three exhibitions. The Shanghai Exhibition of Modern Art: November 24th–December 22nd2019 and will include an exhibition of the same name. The Venice Biennale: October 30th–October 31st2019 and will include two exhibitions exclusively featuring contemporary art. The Tel Aviv Biennale: October 24th–October 26th2019 and will include an exhibition of the same name. Art Paris 2020: October 16th–October 19th2019 and will include three exhibitions. The Art Abu Dhabi: October 14th–October 16th2019 and will include a retrospective of the artist and political thinker Hamza Diar. Art Dubai 2020: October 12th–October 13th2019 and will be followed by an exhibition of work by the artist and designer Zina Abou-Rahme, which will be held at the Abu Dhabi Museum.  The Art of the Golden", "The next Biennial should be held in 2021, and the next in 2022. \n\n\nThe National Gallery of Scotland has come under fire for posting a statement on Facebook on Monday, October 28, rejecting the suggestion that it was censoring political cartoonists, after it published a statement  Monday in response to the ongoing anti-Islamic terrorist incident in the UK. The statement read: \"The National Gallery is aware that the drawings in question are political in nature and are intended to promote a particular political view. The National Gallery will not be censoring political cartoons. We believe that this is a matter for the individual artist and for the National Gallery to deal with. However, we are not going to be censoring cartoons. They belong to the people who created them. The National Gallery will not be censoring them. However, we are not going to be censoring them. They belong to the people who created them. The National Gallery will not be censoring them. However, we are not going to be censoring them. They belong to the people who created them. The National Gallery of Scotland has removed a cartoon published by artist Faisal Mohammad that was critical of the UK’s security services. The cartoon", "The next Biennial should take place in 2021.\n\nThe California Arts and Cultures Grant Program (CAACGP), an initiative of the California Cultural Foundation (CCF), will fund the upcoming edition of the Oakland Art Museum (OAM), which will take place at the Oakland Art Museum, from June 19 to June 21. The CAACGP’s director, David K. Bromberg, said: “It’s an exciting time to be a citizen of the greater Bay Area and its arts. CAACGP will continue to support and advocate for these critical public services to make them a true asset to the community.” The 2020 edition of the Oakland Art Museum, which is currently on view, will be the first of three planned for the city. The other two will be at the Oakland Museum of California (OMC) and the Oakland City Museum (OBCOM), and will take place in 2020. In order to attract more than five million visitors to Oakland each year, the museum has traditionally catered to a single interest group: younger, urban professionals. In recent years, however, OAM and OBCOM have seen surging interest from the city’s working and middle classes", "The next Biennial should be in 2021. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has announced its design of the seventy-fifth iteration of its Fashion Institute, which is currently under construction. The project will draw from the collection of Vincent van Gogh and Robert Mapplethorpe, and will involve the creation of a new permanent collection space and the reopening of an existing building.The museum will inaugurate its new building, a sixty-fiftieth-century addition to the former UCLA campus, with a solo exhibition of work by Maurice Breuil and Robert Mapplethorpe, which will open on September 22. The exhibition will draw from the collection of Peter Schäfer, Dorothea Rockne, and Robert Mapplethorpe as well as from dozens of works by contemporary artists, including Robert Frank, Laura Owens, Norman Rockwell, and John Galliano, and will include new works by Claude-Michel Basquiat, Gillian Caghenou, Barbara Goldstein, Edward Kienholz, Edward Magritte, Anne-Marie Magee, Diana Respetti, and Monir Shah.“We are thrilled that MoCA will present this landmark exhibition in the", "The next Biennial should be held in 2022, the deadline for the European Parliament’s reopening guidelines, and will be led by the Italian architect Roberto Cicutto dell’s design for the exhibition. The exhibition will be held in the city of Venice, where the first exhibition was staged in 1965 and the second in 1982.\n\n\nThe Museum of Fine Arts (MFA) in Los Angeles is working with The Open Foundation to commission an open-ended sculpture by the artist and educator Nari Ward to the museum. The work is a liturgical symbol of the lifeblood of the museum: the antechamber, the space where the frescoes from the Italian Renaissance are displayed and remember their early owners, and is part of the institution’s ongoing celebration of the Italian Renaissance.“We are thrilled to witness the renaissance of the gallery, the renaissance of the museum,” said Maya Lin, the foundation’s executive director. “This work will be an opportunity for visitors to the museum to experience the most important Italian Renaissance works in the most intimate and meaningful way possible.”Ward is known for creating works that depict life, death, and the interplay of secular and religious ideas, imbuing them with", "The next Biennial should be held in the spring of 2021. \"The exhibition will be a fresh and ambitious reflection of contemporary art, with a vision for the future that is anchored in the interconnection of art, technology and society and will strive to present a new kind of art, a new kind of world, a new kind of art of the future,\" according to Artforum. Inaugurating the exhibition will be an exhibition of work by Ilya Pankratov, a curator based in New York, which will showcase work by nineteen emerging artists, including Danilo Calero, Svetlana Kozlova, and Jaye Iso, and will be accompanied by a film by the artist and filmmaker Filippo Cattelan. Mr. Southall told the New York Times that the new venue would “transform the museum’s reputation and create new opportunities for our audience to experience new and previously unexamined art.”\n\n\nThe Culture and Arts Research Council (C.A.A.R.C.) in London has appointed Charlotte Saunders as its new chair of art. In her new position, Saunders will take up the post from Anna Atkins, who is retiring at the end of the year", "The next Biennial should be accompanied by a two-year retrospective of a work within the next twelve months. In the meantime, the museum is preparing to reopen in May 2020 with a presentation of works by the curators of the first Biennial.The work of the Künstler-Kaufmann and the Kaufmann-Zielinski families is now part of the collections of the Kunsthalle Basel and the Museum Ludwig in Berlin. The Künstler-Kaufmann-Zielinski collections are currently housed in the Museum Stuttgart and in the Kunsthalle Basel. Since the Künstler-Kaufmann-Zielinski collection comprises a large number of works with a large number of partners, it will be highly relevant to the opening of the new museum.“The Künstler-Kaufmann-Zielinski collection is perhaps the most important collection of modern and contemporary art in Germany,” said Hannelore Kültrup, head of the Künstler-Kaufmann-Zielinski family. “The Künstler-Kaufmann-Zielinski collection embodies a rich", "The next Biennial should be held during the quarter-centennial of the artist’s life: October 15–November 20, 2019. The 2020 edition of the Biennial will be held at the Museum of Modern Art in New York, and will feature a selection of work by less well-known and less well-known artists. NICE, a new, unclaimed-to-be-artistic-fragment of the artist’s name, will be unveiled in 2020. It will be a rare opportunity for a large-scale art museum to present an exhibition of an artist’s work, and the exhibition will undergo a major renovation. The biennial will also be marked by a new series of performances and performances-based exhibitions, which will combine the Biennial’s art with projects and exhibitions that explore the theme of the year. The series will run concurrently with the Biennial Senza, which will be held in Tokyo in March 2020.\n\n\nThe museum’s collection of more than 5,200 works by forty-six artists affected by the coronavirus, including twenty-six of the same-sex couples who contracted the virus, has been gifted to the National Gay and Lesbian Museum (", "The next Biennial should be in December 2020. A few weeks ago, an exhibition organized by the same group comprised of Marianne Buehler, Gisèle Noth, and Jacques Anhétémait, was also canceled. The artist-run space GalleryBauhaus Berlin, which is run by the same people, was found guilty of breaking Germany’s labor law by allowing up to 160,000 temporary foreign workers to work in the business. The decision, which was made in June, was appealed by Berlin’s conservative state government. The exhibition, titled “Anhaltung des Künste des Menschen” (The Hour of Peace), was to have featured Frederick Kolb, Franz Kahl, and Hans Christian Andersen. In an attempt to prevent the show from going ahead, the government allowed the museum to suspend the exhibition until the third round of negotiations was completed. Before the show, organizers wrote: “We have made it crystal clear that the Art Basel Berlin 2020​’s Tokyo pavilion is not for sale. We will not compromise our commitments to our partners. We will not participate in a", "The next Biennial should be held in 2024. \n\n\n\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Nicole Martin as its next director and CEO. Martin will be responsible for developing and implementing curatorial and curatorial-based initiatives across the institution, and will assume her post at MFA in January 2021.“Nicole is a seasoned curator and scholar with a proven track record in building consensus and delivering exceptional exhibitions, and the MFA Boston is thrilled that she will be a valued part of the cultural community,” said Mike Fries, the museum’s executive director. During her tenure, Martin has served as program manager for the Contemporary Art of the Americas (CAA), the Contemporary Art of Japan (CJA), the Contemporary Art of the Americas (CAA) and the CAA 2019.“This is a pivotal time for the MFA, as it enters a critical phase as we embark on our next major collection and is strives to shape its future with the future in mind,” Martin said. “I look forward to collaborating with the MFA on the long-term future of the collection and the museum in order to reshape the museum in ways that will benefit the community.�", "The next Biennial should be held in the spring of 2021.”The museum will not be able to keep up with demand for tickets to the event, which will be held in the new building created for the museum in the Bolshoi 75% of the year around Art. The Bolshoi’s capacity is now 15 million visitors, and the museum is expecting to generate around $8 million in revenue. The institution has already received $2.3 million from the National Endowment for the Arts to help with the construction of the new building.\n\n\nThe Honoré Daguerre Foundation has pledged $5.5 million to the Cannes Film Festival this year’s edition, The Film Festival International (FFI) announced on Thursday. The award, which was established in 2008 to support the Cannes film festival, will also help fund the relocation of the 2017 event from France to the United Kingdom.Dubbed the Paris Film Festival, the event was relocated from May until October this year following a major redesign and renovation project that was financed with funds from the Dijon-based architectural firm Anno Domaine de la Haye, which also designed the festival’s former location at the Palais de Tokyo. The renovation", "The next Biennial should be held at the Millennium Dome in Dubai in 2022. The event will be co-organized by the Dubai Art Foundation (DAAF), the Dubai-based nonprofit arts advocacy organization that is seeking the preservation of the museum.Datariba lost the auction to the Dangdai Foundation, a private foundation based in Shanghai, in 2015. The Dangdai Foundation withdrew from the auction in 2017, citing the cultural center’s decision to close its doors. The museum eventually settled with the Dangdai Foundation for $13 million. However, the suit was not successful in getting the contract cancelled. The Dangdai Foundation had also withdrawn from the auction after the museum claimed that it was not able to pay its employees, who were participating in the auction.\n\n\nAt a news briefing on Tuesday, the House of Representatives voted overwhelmingly to establish a national museum of the American Latino, or AML, in the California town of Monterey Park, California. The move, which will take effect on January 1, 2022, and is expected to be considered a victory for activists who campaigned against the closure of the institution, which would have housed thousands of artifacts from the ancestral homes of many Los Angeles Latinos including pottery, pottery", "The next Biennial should be held at the Institut Nationale de l'Art et l'Histoire in Paris, in the second half of March 2021. The biennial will take up four themes: 1) The Biennial of Modern Art; 2) Modernism and the Contemporary; 3) The History of the Biennial; and 4) Art Histories. The date of the exhibition is in advance and the artist-in-residence will be announced in April.The opening of the exhibition is presently as follows: Wednesday November 25th, 2019At the Institut Nationale de l'Art et l'Histoire, Paris, with previews of Saturday and Sunday, February 21 and April 22. Opening reception on Friday, February 19.The exhibition was conceived of by Pierre-Luc Dubois in 1956 as part of a series of exhibitions that culminated in “The National,” a show in 1958 that explored the history of art, architecture, and architecture. Dubois was inspired by a question posed by anthropologist Bernard Boudin: “How may art and architecture act as a history of an artist’s life?” The question was answered in the exhibition “", "The next Biennial should examine the current global situation in the form of visual art, architecture, and design. The exhibition will be held at the Museo de Arte Contemporáneo (MAS), Madrid, from May 7 to May 9.\n\n\nThe New York–based nonprofit the Museum of Modern Art (MoMA) announced on Monday that it is overhauling its current exhibition program in order to continue supporting the LGBTQ community. The institution will now partner with local artists to develop new public programming that will open to the public in the fall of 2020.“This is a moment of enormous change for our world, and it is our mission to shape the future through art,” said Steven H. Feinberg, executive director of the Museum of Modern Art. “Our artists and curators are dedicated to conveying the universal values of human connection and community through their art and giving voice to the voiceless. We will continue to work with artists to shape new conversations about LGBTQ issues and their experiences, and to engage audiences with LGBTQ art that is created with love and respect.”The institution has also revised its existing programming schedule in order to include a greater number of exhibitions in order to expedite the renewal of its existing contract. ", "The next Biennial should be held in the spring of 2020, around the same time as the second edition, which will be held in November 2021. The third edition, which will also take place in the autumn of 2020, has yet to be set for a date.\n\n\nThe Chilean architect and theorist Hélio Oiticica, who considered architecture and design as “semantics,” died on December 6 at the age of seventy-nine. He was one of the last living members of the Chilean–born, Los Angeles–based collective Ranchu Ramírez, whose avant-garde work cultivated and defined the contemporary.Born in Santiago in 1959, Oiticica studied at the Angeles Artística, the National Autonomous University of Chile, and the Institut d’Arte Contemporain (CA) before eventually moving to the University of California, Berkeley, where he studied with Alejandra Cervetto. His early projects included the modernist and pop-mythologized Palace From Heaven, a massive, glass-walled glass-encased, Stonehenge-like installation for the Museum of California in 2001, in a show that brought together works by the likes of Paul Gauguin,", "The next Biennial should be completed by June 30. The exhibition will be hosted by the National Museum of Contemporary Art in Paris from May 13 to June 15, 2020. The exhibition will also feature works from the private collection of Pierre Huyghe, including those in the Paris–Helsinki region. The Biennial will be organized in collaboration with the Architecting and Textiles Museum in Paris and the Musée Francaise de l'Orangerie in Paris.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it is planning to open a new location in the city in 2020, as part of a $1.2 billion expansion that will also include the construction of an expanded collection, the restoration of the Richard Meier Center for Contemporary Art, the creation of an arts-farm, and the construction of a new visitor experience.“With the completion of a major renovation of the Meier Center for Contemporary Art, we are thrilled to be opening our new home in 2020,” said Andrew Kreps, director of the museum. “The Meier Center is a stunning architectural masterpiece, constructed in 1974 and designed by Richard Meier and Naima J. Keith in collaboration with Frank Gehry in London.", "The next Biennial should be held in 2020, and the 2020 edition will be staged at the museum. The museum has also been exploring the possibility of moving the exhibition to a new venue, and in March 2020 the curator of the exhibition Laurence Bauder announced that the exhibition would be moved to the Bergenburo, where it will remain for the foreseeable future. In a statement, the museum said: “There are many things we cannot see in the dark, but we hope that one day soon this exhibition will be on view in a new light.”\n\n\nThe Italian government has released $2.2 billion in aid to Italy in support of the construction of the new biennial “Art of Destruction” at the Museum of Modern Art (MoMA). The initiative, dubbed the Rome 2020 initiative, was launched by President Dario Franceschini and will consist of two pods, one at the Museo di Cinéma and the other at the Museo Remo Trastevere. Curated by Tracey Edwidge and Kiera Kemper, the two works will be located in the same building and will be inaugurated by Daniel Ellsberg’s “Men in Black: The Documented Truth,”", "The next Biennial should be organized around the theme “the body and the soul.” García Otero, director of the University of the Arts, Madrid, told the Art Newspaper that the exhibition should include an “open-air memorial.” The exhibition would also focus on how the body and the soul might connect with each other and with the bodies of others.\n\n\nEven before the eleventh edition of the Hong Kong Biennale kicked off in Hong Kong on March 24, organizers removed a number of works from the event, including a work by the late artist and activist Cheung Kai-ching, who died in London in 2014, and several works by artists such as Jessie James Dershowitz, Rindus Mukherjee, and Martin Akuny-Shikoh, as well as works by artists such as Michael Heizer and Dario Catellani.New York’s Tate announced that it is planning to stage an exhibition of works by artists such as Alison Bechko, Anish Kapoor, and Hamid D. Ali, among others. The opening reception for the first show of work by these artists is slated for March 29 at the Metropolitan Museum of Art in New York. ", "The next Biennial should take place in December 2020.\n\n\nMADRID—Art and Architecture: Carmen Otero and the Surrealist Movement, 2019. Courtesy of the artist and the museum.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it is instituting a $100,000 grant program for artists and designers working in the arts and design field in an effort to help support employees and the broader community. The program, which will focus on local, regional, and national organizations, will launch with a roundtable in December 2020 and will annually increase to $250,000 by the end of the decade.“The program will help support artists and designers who have worked for or who are committed to MoCA, both as employees and as collaborators,” said MoCA CEO James D. Friedman. “We are incredibly grateful to the artists whose work we have picked out for this year’s grant program. We admire their dedication, enthusiasm, and innovation, and we are eager to work with them in the future.”The program will award $100,000 to “Amber DeLand,” Kelly Gay, Hannah James, Sara J.", "The next Biennial should bring the art of the twentieth century to life, reimagine the world, and reflect on the nature of the human being.”The 2017 edition of the festival, titled “Last Day on Earth,” drew 37,000 visitors to the Palais de Tokyo. The biennial, which also featured work by contemporary artists such as Peter Schäfer, Vik Tiwary, and Adrienne Atget, was hosted by the University of Tokyo and the Hirshhorn Museum.\n\n\nMartin Boysen, the curator and founder of the independent arts space Monomé, has announced he is leaving the Minneapolis-based arts center in April 2020 to become the next head of the Arts Council Foundation in London. Boysen will assume the role on March 31. He succeeds Margo Stahl, who departed the arts wing of the Metropolitan Museum of Art in January 2019 because she was not retained as director of the Metropolitan Museum of Art. Previously, Boysen has been the chief curator and founder of the museum’s film program. Boysen will assume his responsibilities at the arts wing of the museum on March 31.“We are thrilled to welcome Martin back to the museum,” said Marc Glimcher, president", "The next Biennial should be in March 2020. This year’s will be held at the Tacita Bernadina Gallery in New York and will include works by twenty-five artists, including Adrian Piper, David H. Dolin, Robert Irwin, and Janice Eiland. The project will celebrate “social justice narratives of black women, queer women, and trans women,” as well as the contributions of women to art history. Among the artists chosen for the biennial are Hosea Alston, Debra Covington, Luzia Echeverria, Rosalind Harrison, Jacqueline Hill, and Susanne Vielmetter.\n\n\nThe Philadelphia Museum of Art (PMA) is planning to close its doors for just three months—the shortest period of the institution’s seventy-five-year history—in a major restructuring spearheaded by the Pritzker Prize–winning architects Christopher Burnham and Michael Pineda.The Pritzker Prize–winning architects are working with the Pennsylvania Department of Cultural Affairs to organize a series of exhibitions dedicated to communities of color, including a public art project at the Museum of Art, curated by New York–based artist Marisa", "The next Biennial should be held in the Fall of 2020.  The first edition of the BIM Biennial was held in the summer of 2019. The biennial was organized by the Museums Association of New Zealand and was supported by Diller Scofidio + Renfro.Kumar, who is also the CEO of Diller Scofidio + Renfro, said: “We are incredibly grateful to the Diller Scofidio + Renfro Foundation for their ongoing support of our biennial and for having been able to secure the platform from which to present our exhibition year. We are looking forward to the exhibition at the Museum of Contemporary Art Auckland in 2021.”Since the exhibition was first announced, there has been tremendous interest from the rest of the world. A number of prominent galleries have committed to exhibiting works by artists working across the globe and the first works to open, at least for the first time, are works by an unknown artist in the United States. The exhibition will be on view in the Diller Scofidio + Renfro Museum until September 22.The full list of participating artists is as follows:Artsakh, ArmeniaBaku Art Museum, AzerbaijanBaku Dzort", "The next Biennial should focus on a rework of the history of the twentieth-century, focusing on the evolution of the arts and the development of the modernist and contemporary movements. \n\n\nThe Museum of Contemporary Art (MoCA) has welcomed five new members to its board of directors: Dario Fusaro, director of the Scoville Institute of Art in New York; Igor Juan-Teo, a professor of art history at the University of Pennsylvania; Philip D. Alexander, a former president of the Scoville Institute of Art; Gerald Konrath, who has served as the director of the Zoos and Aquariums at the Pennsylvania Academy of Sciences; and John H.\n\nThe Museum of Contemporary Art (MoCA) has added six new members to its board of directors and is working to finalize a new agreement with the UC Davis School of Art and the California College of the Arts (CCA) in California. The museum’s board of directors voted unanimously in favor of a $1.5 million gift from Kate and John Henson, the parents of billionaire real estate developer Donald and Ida Henson, to the institution in January. The gift will fund the new", "The next Biennial should be called by the end of the year. The exhibition should also reflect the significant efforts being made by artists to understand and regain their identity through a process of self-discovery, and should be able to provide a platform for them to continue to develop and experiment with new materials.\n\n\nThe British artist Tom Newton, whose surrealist paintings often address themes of power, memory, and memory systems, has died at the age of seventy-five.Born in London in 1930 to a father who shipped coal from nearby Shotton, Newton developed a passion for art and painting while in high school. After receiving his degree in 1956 from the Art School in London, Newton moved to New York, where he studied under David Adjay. Following a stint in the Department of Arts at the Museum of Modern Art in London, where he met Arnold Slatkin, who would become his partner and mentor. They would go on to produce eleven paintings and several prints, including the reliefs “Amber Hopper” (1960), “Amber Portrait with a Pipe” (1972), and the surrealist “Laundromat On the Floor” (1976–77), which has recently been restored in a new exhibition at", "The next Biennial should be held at least once every two years. The founding committee will be chaired by the French artist Willem de Kooning, who will represent France at the 2020 event; the Secretary General of the United Nations, António Guter; and the president of the German state of Hesse, Sigmar Gabriel.\n\n\nThe Museum of Contemporary Art (MoCA), Chicago, announced today that it is redirecting all exhibition and fundraising activities in the city’s West Town neighborhood, which has seen a dramatic increase in crime in the last few years, to the newly created and privately financed Metropolitan Cultural Center in the neighborhood. The arts space will begin hosting a series of events and performances in the subterranean 'micro-institution,' which is slated to open in the fall of 2022, and will remain open throughout the pandemic.The move reverses a decision made earlier this year, when the Met opened a new subterranean arts space, the Modern Art Museum, in a former coal mine in the South Side neighborhood of Chicago, but brought about a dramatic drop in crime in that neighborhood. The new museum, a $350 million endeavor, will include an eight-story glass building, modeled after the glass-enclosed spaces of the", "The next Biennial should take place in the city of Aichi Prefecture in Japan in 2021.\n\n\nThe renowned Cultural Center of Fine Arts (CCA) in Beijing has announced that it is preparing to welcome visitors back to the venue in 2020, after a temporary closure due to the Covid-19 pandemic. The institution said that the reopening of the historic venue will allow it to “provide audiences with the latest in Chinese art and contemporary art.”Culture Minister Gao Yansong told the South China Morning Post that it is all about the future of the collection and about creating a more synergistic environment for art in China. “The current situation is very challenging,” Gao said. “The restoration is one of the most important projects that will give rise to a new new era, and transform the Cultural Center of Fine Arts into an institution that is proud of being a museum of China.”\n\n\nThe Museum of Fine Arts (MFA) in Minneapolis announced that its acquisition of Frank Gehry’s original urban design for the institution’s new home, the Frank Gehry Foundation for the Arts (FGA), has opened a fundraising campaign. The arts institution has raised $145,", "The next Biennial should be held in London in the spring of 2022. The shortlisted artists are as follows: Becca Benavidez, Hannah Cooke, Kathrin Deutsch, Sara Eichhorn, ,Kassandra J. Brewer, Kashua Haus, Karen Pfeifer, Kamel Mokhtar, Kamala Ibrahim, Amy S. Keller, and Kathy Lynne. The full list of participating artists can be found on the Art Foundation’s website.\n\n\nThe National Gallery of Scotland has appointed Paul Williams as its new director. Williams replaces Jon Pertwee as the institution’s director of exhibitions and programs. Previously a curator at large and internationally acclaimed, Williams became the institution’s first chief executive in 2016. He succeeded Joi Ito, who retired in February.The National Gallery of Scotland opened its new, two-story location in Edinburgh in 2003, and has hosted more than 1,500 exhibitions since its inception. It also recently completed a major expansion, adding new galleries, a new building, and a new exhibition space, and added more than 3,500 square feet of exhibition space to the museum", "The next Biennial should take place in 2020.\n\n\nArts galleries in Japan are now reeling from a wave of cancellations and postponements owing to the pandemic. The country’s culture ministry announced last week that it expects the number of cancellations to spike this year, and that there will be a further drop in numbers in 2020. The ministry has also announced that it will be reducing the number of exhibitions it hosts, reducing the number of visitors, and cutting the number of performances it holds.In an attempt to mitigate the fallout from the coronavirus, Japanese state broadcaster NHK reported this week that the number of visitors from abroad will rise this year, and that the number of visitors from Japan will rise by 20 percent in 2020. According to a report published by the Japanese Ministry of Economy, Trade, and Industry (METI), the number of foreign tourists visiting Japan in 2020 is expected to reach 51.3 million, up from 34.3 million last year. The number of visitors from the United States is expected to remain the same, at 35.7 million, as last year, but will increase by 10 percent. The number of visitors from China is expected to rise by 5 percent.The number of people infected with the virus in"]