["The next Biennial should take place in 2022. The first is the upcoming epicentre of the Syrian revolution, the city of Aleppo. The second is the springboard of the Kurdish resistance, the city of Kars.\n\n\nThe second edition of the Funktion 1, which was held in Cologne from February 19 to February 22, 2019, has announced that it will now take place in January 2020. Joining the main event is an exhibition dedicated to the work of American artist Rosa Barba. Established in collaboration with the German Federal Cultural Center in Bonn and the New York–based nonprofit, the Funktion 2, Barba’s exhibition “Composition Immeasurably ,” which opened on January 22, 2020, will now be on view until February 4, 2020.“The collective work was conceived in the early 1990s as a way to engage with the work of American artists, especially Barba, who has been a central figure in the history of the organization,” said Johanna Grütters, the fair’s artistic director. “Barba’s work is at the core of the exhibition and the building, and the exhibition itself. Barba’s", "The next Biennial should focus on “The Cosmic Origins of Human Life,” marking an important milestone in its history. It should also address the limitations of the space and the fact that it will not be able to highlight the many social, political, cultural, and scientific advances that have taken place in the past fifty years.” Commenting on the upcoming exhibition, the festival’s executive director, Emma Stier, said: “We are thrilled to be collaborating with the Municipal Art Museum in London to create a new opportunity for young artists to see and hear work by a new generation of pioneering Brazilian artists. It is an exciting time to celebrate the achievements of Biennials and to continue to support emerging artists by commissioning work by your artists. We look forward to working with your artists in the coming months and years.”\n\n\nThe Metropolitan Museum of Art (MoMA) in New York is launching a new initiative dedicated to diversity and inclusivity that will deliver cultural and social impact through exhibition design, programming, education, and curating. As part of a grand vision announced in May, the museum has committed to supporting the cultural and creative work of individuals and organizations who identify as Black, Arab, Native American, Asian", "The next Biennial should take place in 2024.\n\n\nThe British Museum in London has appointed Christopher Wool as its next director. Wool, who has served as the institution’s chief curator since 2016, succeeds Mark Craddock, who in 2018 was appointed as the institution’s interim director.Craddock will continue to lead the institution, which is currently undergoing a $140 million expansion, as it implements new social distancing guidelines, while Wool will assume his responsibilities as director of the Chase Museum in London.During his tenure, Wool has organized more than thirty-five exhibitions, including “Museum Experiments,” a survey of British art from the 1930s to the 1970s, and “The Parachute and the Window,” a survey of the design and installation practices of artists such as Paul Gauguin, in addition to documentaries exploring the impact of the Covid-19 pandemic.In his new role, Wool will work closely with directors Maria Balshaw and Neil Ross, who will serve as cochairs for the inaugural exhibition, “Welcome to London,” which opens on August 1. The exhibition will feature work by sixty artists from twenty-five countries and will focus on how the venue, which was", "The next Biennial should be held in 2021.\n\n\nThe National Museum of Scotland announced today that it is planning to move the exhibition “First Men” from its current venue at the National Spelling Bee to a new venue at the Museum of Modern Art (MoMA), which will be completed in the autumn of 2021 and open to the public in the spring of 2022. The move follows the move of “Second Men: The Human Evolution and Evolutionary Record” from the Spelling Bee to the Museum of Modern Art in 2015, and the relocating of “The Evolution of Men” from the Spelling Bee to the Museum of Natural History in London in 2006.The move follows the opening of the exhibition “The Changing Face of Men: Men in Historical Context” at the National Art Museum in Glasgow in March and the closing of the exhibition “The Evolution of Women” at the Museum of Modern Art in March 2019.Commenting on the upcoming reopening of the National Museum of Scotland, director Jim Thompson said: “The current National Museum is an ideal venue for a new exhibition exploring the evolution of masculinity in contemporary society. I am particularly delighted that three of the main themes of the show are ‘", "The next Biennial should take place in 2021. The full list of participating artists is as follows:Anton Kern, ItalyBanduro Andreu, BrazilReign of the CenturyBenson Grab, BrazilReflecting on the Past, PortugalCeleste Galani, ItalyRefreshing Natures, BrazilReflections on the Past, ItalyAriana Macias, SpainRe/coc/a/l, MexicoArisa Leoni, Italy\n\nLoading...\n\nThe Bombay Redevelopment Authority (BRA) has received a $50,000 donation from a consortium of artists and activists led by the artist-run nonprofit Art and Artifacts, which was founded to protect the museum’s collection, the artifacts it holds, and the cultural legacy of the late artist-activist Nari Radcliffe.The donation was made during a ceremony held at the Bombay Art and Cultural Centre (BAC) on August 26. The organization’s board and members of the group made the announcement in a letter dated August 22.“In recognition of their achievements, their dedication to ensuring that the collection, the artworks, and the institution remain intact and protected, and in recognition of their commitment to promoting and defending the work of", "The next Biennial should be held in the city in 2021. The next will be held in the city in 2022, and the third in the city in 2023.  The 2019 iteration of the Art Basel fair, which had previously been pushed back to 2019 because of Covid-19, was also postponed, and the 2020 edition was rescheduled. The first fair in the city, Art Basel Hong Kong, kicked off in September 2019 and ran through March.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it has received $43 million from the Carson Foundation to help defray the expense of the museum’s acquisition of more than 2,200 works, which was completed in 2017. The donation covers the principal and interest payments on the $125 million acquisition in 2019, plus interest. “In a time when it seems that every major art museum is closing or is about to close, the Museum of Contemporary Art is reopening and reopening again,” said Mark Zuckerberg, cofounder of Facebook and a trustee of the foundation. “As a philanthropic organization, we were thrilled to donate $43 million to MoCA so that it can continue", "The next Biennial should be held in 2022, when the museum will be celebrating its thirtieth anniversary. In a statement issued by the museum, the organisers called the next exhibition “set to be the most ambitious and provocative exhibition in our history.”\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles announced today that it will become the first American institution to open a permanent exhibition dedicated to the works of Vietnamese American artists in the United States. The $100 million exhibition, titled “Theaters of Resistance,” will be held at the institution in 2020 and will be organized as a “continuation of the work of the previous Five Centennial,” which was held in 1988. “Artists are individuals first, and institutions second,” said museum director Edward DeMarke. “I was inspired by the work of my predecessors, who challenged the notion that art can function as both a form of self-expression and a form of social control. I am honored to participate in their legacy, and to embark on an ambitious program of exhibitions, residencies, and commissions in partnership with artists whose practices and discourses intersect the core of American art.”In the show, which will be inaug", "The next Biennial should aim to work with local communities to create a permanent exhibition of contemporary art from South Africa and be open to the public from April 11 to April 22, 2020.” The South African Pavilion of Fine Arts (SAPFA), which was organized by the South African Institute of Art (SAI), is also planning to relocate to a new space in Johannesburg. The institution will create a new seven-acre exhibition space in a former textile factory in the city.South Africa’s cultural sector is struggling as the country prepares to recover from the global health crisis. The Art Newspaper reports that the number of infections in the country has more than doubled to 8,000. According to the World Health Organization (WHO), the death toll could cross 1,000 by Wednesday. The outbreak is the worst outbreak since SARS, an outbreak of the coronavirus in China in 2003. The coronavirus also infected more than 12,500 people in China before it was contained in 2003. \n\n\nThe New York Film Festival (NYFF) announced today that it is bringing the annual event, which is supported by the New York City Department of Cultural Affairs and the Corporation for Cultural Affairs, to Rockefeller Center, New York City’", "The next Biennial should take place in August 2021.\n\n\nThe Philadelphia Museum of Art (PMA) is moving a significant collection of Renaissance paintings and designs to a new home in an attempt to remain sustainable. The institution announced on Tuesday that it will construct a new, 400,000-square-foot museum on the former site of the Pennsylvania Academy of Fine Arts in Philadelphia. The $140 million institution will be built on a five-acre campus and will include a 1.5-acre rooftop terrace. The building will also boast a pedimento—a sculptural element that features works by artists known for their involvement with water and will be surrounded by gardens, terraces, and other features.“Our plan for the building and the museum is to be true to the museum’s original vision, which was to have an outdoor space with a terrace and a roof garden,” said Margaret Hickey, the director and CEO of the museum. “I’m particularly proud of our work on the pedimento, which is the centerpiece of the museum. We began the renovation of the building in 2015 and are currently in the final stages of building the museum, which will sit on the ground floor of the new building.", "The next Biennial should be the last, and should take place in 2020, the year of the Tiger Mother. And therein lies the problem. The exhibition should have been over by then, and in a world where the institution is the largest and most prestigious art museum in the world, the message has long since reached the masses that the second half of the twentieth century was not an exhibition. It is precisely this message, rather than any ostentation of achievement, that is so repugnant to the millions of people who died in the factory, that died in the dustbin, that died in the street, that died in the prisons.  Given that the museum was established in 1956, and that its current profile dates back to 1896, the move to the museum is a monumental departure. The museum will also be opening its new, twenty-first-century headquarters in Astana, Kazakhstan, at the end of the year, and will soon be hosting the Biennial of Poetry, Art and Politics in the city of Tashkent, Uzbekistan.The host country has expressed great curiosity about the change and has been supportive of the institution. Its minister of culture, Mira Korushkina, said: “We are very happy with how", "The next Biennial should be held at the San Francisco Institute of Technology and the Museum of Modern Art in partnership with the Institute of Contemporary Art.\n\n\nThe nonprofit National Endowment for the Arts (NEA) is launching two new initiatives that will help artists and cultural workers in the United States struggling due to the coronavirus pandemic.The first initiative, a $1 million grant program, will provide funding to assist individuals and small to mid-size independent arts and cultural organizations in the United States that are struggling to make ends meet during the coronavirus pandemic. The program will launch with a grant of $500,000 to an individual or small nonprofit that demonstrates need. Depending on the financial need of an individual or small nonprofit, grants of up to $5 million can be secured.Applications for the program will be available by February 22. The deadline to apply for assistance is March 22.The second initiative, a $250,000 grant program, will be available to individuals and small to mid-size independent arts and cultural organizations in the fifty states that have suffered a loss of income due to the coronavirus pandemic. The application period for this grant program is March 19–March 21.Applications will be available by March 23.\n\n\nThe", "The next Biennial should take place in 2021.\n\n\nThe Istanbul Biennale has announced that it will hold its next edition in 2021, with the theme 'Being and Life. In Transition.” The event will take place in the city of Sultanahmet, Turkey, and will have a running budget of $6.5 million. The event will be organized in line with the theme of the twenty-fifth edition, which will lead to “Living and Beatitude,” in April 2022, the opening of which is currently undecided.Art Moderne Istanbul—which was founded in 2006—has been working with the Istanbul Art Museum to develop a new digital platform that will allow visitors to view and purchase works offered for free. The platform will have a number of digital displays that will highlight the work of more than one hundred artists, with the goal of increasing awareness of the city’s emerging artists. The platform is still in the early stages of development, but the museum anticipates that it will be ready for the 2020 iteration of the event, which will be held in May.The newly created platform will present the artists in a visually engaging manner, while keeping the art of the past and contemporary in mind. The art of the twenty-fifth", "The next Biennial should be held in 2020, the date of the third edition of the exhibition.Istanbul’s director, Umit Bektas, told the Art Newspaper that the construction of the new exhibition venue is currently underway. The building will host more than 2,000 works from the exhibition series as well as the fifth edition of the \"Turbulence\" exhibition, which will take place in Türena in the city of Antakya, in December 2021.Commenting on the redevelopment of the city, Bektas said: “The new exhibition venue will provide a platform for both the Turbulence and the Turbulence Show, which will bring together cutting-edge contemporary art from the United Arab Emirates. At the same time, the new exhibition venue will play a crucial role in the cultural development of the city of Antakya.”The project was funded with $10 million from the Abu Dhabi Investment Authority, the United Arab Emirates’s public-private development arm, and $3 million from the Abu Dhabi Foundation for the Arts. Construction of the new venue, which will be inaugurated by a grand opening ceremony in December 2020 and will be completed in 2021, has been marked by several", "The next Biennial should be held in 2021, and the third in 2022. A total of six artists will be chosen to represent South Africa at the event, which will be hosted in the city of Johannesburg. The biennial will consist of three exhibitions which will showcase the work of the selected artists. Sydney-based artist Dylan Marden, who is known for his paintings, sculptures, installations, theatrical performances, performances, performances, performances, performances, performances, performances, will be included in the 2019 edition. The artist has been selected for his work The Merman, 2019, which was shown at the South by Southwest (SXSW) in Austin, Texas, and is currently the subject of a solo exhibition at the Museum of Modern Art, New York. “I’m very excited to be a part of the next biennial in Johannesburg, the culmination of the Biennial of Art in Johannesburg,” said Marden. He added: “Art is a universal language, and a universal community. It is the sacred and the profane; it is the sublime and the banal.”\n\n\nAnton Kern, the director of the Guggenheim museum,", "The next Biennial should be held in 2020. \n\nThe National Galleries of Scotland (GH) have announced that, beginning in 2020, the institution will be closed until at least March 19. The announcement comes on the heels of a joint statement issued by the institutions by the director of the National Maritime Museum, James Cook, and the director of the Royal Scottish Academy of Art, John Ostrander.“Having a good rest of the year ahead is essential,” wrote Cook in a statement. “We will provide updates as we have them. We are all looking forward to welcoming visitors in 2020.”The Glasgow Art Gallery (GAG) has been given a $250,000 boost in funds thanks to a $70,000 donation from the Andrew Kreps Foundation. The donation was made at a time when the Glasgow Art Gallery is preparing for its third and final year as a collective entity. The money will go towards the construction of its new museum and the expansion of the GAG’s existing building. The $100 million expansion of the Glasgow district is scheduled to start in 2021 and to last twenty-two years. The expansion, which is being funded with $62 million from the Andrew Kre", "The next Biennial should be held in 2021. The next edition will be held at the State Museum of Fine Arts, Mumbai, in March 2022. In the meantime, a second exhibition, “Ten Years of the Biennial,” will open in December 2019 at the Mumbai Art Theater. \n\n\nRussian artist Alexei Shishkina has been selected to represent Russia at the Fifty-Ninth Venice Biennale in May. Shishkina will be presented with the award for the sculpture, “The Unseen,” at a ceremony in Venice on June 1 and will also receive a prize of $2,000. Shishkina first made his mark in 1999 with a work titled “The Unknown World,” which employs only two drawings and is on view in the exhibition “Theosophy” at the Museum of Modern Art in New York. His work has been exhibited at the Kunsthalle Basel and the Kunsthaus Berlin.Shishkina is represented by the Moscow State Museum of Fine Arts (MVD), the Sokol Academy of Fine Arts, and the Novosud Institute of Art History in Moscow. The International Academy of Modern Art (IAM), the International Academy of", "The next Biennial should be held in 2020, and Mackay and his fellow curators will be based in London, France, and Tokyo, respectively. His first exhibition, an exhibition of the artists whose works are currently being studied by a new group of researchers called the Alexander C. Davis Foundation, will open in the United States in 2021. In the event of a successful 2020 exhibition, Mackay said he will aim to return to the United Kingdom.“This is an extraordinary event,” said Douglas Murray, the director of the Metropolitan Museum of Art and the United States, and the Museum of Modern Art. “The next Biennial will be the first conducted by an independent curator, and the first focused on contemporary art. Our goal is to build on the remarkable legacy of the Biennial. The next iteration will focus on the process of curating contemporary art, and will focus on the growing field of contemporary art research.”The Biennial is a partnership between the Metropolitan Museum of Art and the University of Chicago. The Institute of Contemporary Arts (ICA) at the University of Texas at Austin is also funding a new project that will focus on research on the art of the twentieth century through a series of essays, films, and other art-making", "The next Biennial should take place at the National Museum of the American Indian in Washington, DC, next year. Dr. Sayers is currently a student at the University of North Texas’s Graduate Center.\n\n\nThe Museum of Fine Arts (MFA) in Los Angeles is developing a $250 million preservation project to house twenty-four works by twenty-four artists\u0097artists who have found their way into the Los Angeles County Museum of Art (LACMA) since the museum’s founding in 1972. Titled “Face of the City,” the exhibition will explore the legacy of the artist relief organization Art Fund, which has partnered with the Museum of Fine Arts (MoFA) since the 1990s.The show will feature work by thirty-six artists, including Tom Friedman, Shepard Fairey, and Toshio Fujimoto, and will be curated by Jonathan Isaacs, director of the Museum of Fine Arts (MoFA), and will run from October 26 through November 21, 2020.“This is an exciting time to have twenty-four artists in LA at once, especially since we have fewer than any other location in the United States,” said Mark Van Honk, curator of the exhibition and", "The next Biennial should take place in 2022.<|endoftext|>Untitled a guest Jul 11th, 2017 66 Never a guest66Never\n\nNot a member of Pastebin yet? Sign Up , it unlocks many cool features!\n\nrawdownloadcloneembedreportprint text 2.17 KB General Unique ID : 2069389619883105520648514496888277579 (0xE9EDE55B93E70CDA09D8F5C41CB0CF) Complete name : The Legend of Zelda: Breath of the Wild’s Soundtrack (2017) Subtitled +The Amnesiac Soundtrack (2017) Part 1’s Theme from The Legend of Zelda: Breath of the Wild’s Soundtrack (2017) Subtitled +The Amnesiac Soundtrack (2017) Part 2’s Theme from The Legend of Zelda: Breath of the Wild’s Soundtrack (2017) Subtitled +The Amnesiac Soundtrack (2017) Part 3’s Theme from The Legend of Zelda: Breath of the Wild’s Soundtrack (2017) Subtitled +The Amnesiac", "The next Biennial should take place at the Met, and there should be a direct connection between the exhibition and the Museum. The idea that we could have a series of exhibitions that would culminate with a museum visit is an idea that is very foreign to us. The first Biennial is scheduled to open in January 2021. The next will take place in March 2021.When asked about future plans for the exhibition, which will receive $200,000 from the US Park Foundation, Museum director Bryan L. Anderson said: “Our goal is to build on the legacy of the first Biennial, to present a collection that encompasses the full range of American art to date. The Met has long been at the forefront of this work, as evidenced by its dedication to the collection of the museum’s enormous collection of American art, which it opened in 1984. We are committed to supporting the Met’s philosophy of presenting art in diverse ways, including through programs that engage with the Met’s collection and exhibitions. Our vision is to expand the Met to the museum and to create a new series of exhibitions and programs for the Met that will be open to a wide range of audiences.”\n\n\nThe French Ministry of Culture", "The next Biennial should be held in 2022, the art-world’s patron saint of the arts, but the exclusion of the arts from the biennial is a source of much consternation in the large-scale visual arts sector, where most UBCC shows are staged. After UBCC cancelled the 2019 edition of The Bridget Riley Show, which was to be hosted by Frank Gehry, the university staged the exhibition Art at Home, 2019, which explored the timeless themes of home as a site of belonging and spirits\u0097the theme is meant to evoke the spirit world, though the spirit world is a fictional concept within the show.Commenting on the move, Derek Lautenschlüter, director of the Biennial, said: “From the start, we have focused on planning for an equitable future for the event, and have worked hard to keep the exhibition at a great venue. We have integrated an enormous range of contemporary art from the UK, Europe, and around the world, in order to bring you an exhibition that is both accessible and guaranteed a wide and diverse audience. We hope that everyone will enjoy this year’s biennial, and we look forward to welcoming", "The next Biennial should take place in 2020, at the San Francisco Museum of Modern Art (SFMoMA), and in 2021 at the Walker Art Center, Minneapolis. The American Academy of Arts (A.A.) is proposing a similar date for its next edition, to be held in 2021. According to Artnet: The AMC will be held at the Seattle Art Museum (SABM) in 2021, the same year the San Francisco Biennial will also host a new exhibition of works by urban and regional artists, and the next iteration of the Albuquerque Art Museum will stage a new exhibition of work by artist-in-residence as well as a retrospective of work by the late Phil Collins.The 2020 and 2021 iterations of the biennial will also be hosted at the Smithsonian American Art Museum (SAAM), in Washington, DC; the Museum of the American American Indian, in Grand Rapids, Michigan; and the National Museum of Women in the Arts (MoWMA), in Washington, DC. \n\n\nThe University of Chicago announced today that it is moving the premiere of its new documentary series Art at Lincoln Center (LCC) to August 7—a week later than originally scheduled—in order to move the show more closely in line with the", "The next Biennial should take place in 2021. \n\n\nA group of artists, writers, academics, and other cultural workers in the Philippines have been arrested on charges of involvement in the illegal demolition of a former industrial site in Manila in a show of solidarity with the protesters who have been decrying the government’s brutal crackdown on anti-government protesters in the country for months.The arrests follow a wave of anti-government protests that have taken place in the capital and across the country since June, when the authorities moved to crush the protests with a crackdown that has left more than 1,600 people dead, according to the United Nations. The government also labeled protesters as illegal agitators and violent criminals.Since May, the police have used tear gas, water cannons, and rubber bullets against protesters, sparking widespread anger and sparking violent clashes between protesters and the authorities. The clashes have killed at least 1,400 people and left another 3,500 injured.In solidarity with the international community, the New York–based group Artforum has launched a GoFundMe account to raise funds for the families of protesters who were killed in the clashes. At the time of this article’s publication, the page had raised more than $80,000.The activists", "The next Biennial should open in Beijing in the spring of 2021. The next edition, titled Feminine, at the Art Museum Beijing in March 2021, will be held in the spring of 2022. The twenty-fourth edition of the Shanghai Biennial, which is currently on hiatus due to the coronavirus, will take place in the fall of 2021. The 2019 edition of the Biennale in Curitiba, Brazil, was held in the city of São Paulo. The biennial will be held in the capital of the Brazilian state of Rio Grande do Sul from April 4 to April 5, 2020.\n\n\nThe Art Newspaper has announced the fifty-ninth issue of its magazine\u0097in which the Art Newspaper will reveal the twenty-five artists who will be featured in the upcoming issue of “Art in America”. Based on the 2014 book Art in America: From Saenger to Putnam by Robert L. Hamilton (Norton Simon & Schuster), the upcoming issue will feature artist-in-residence Marcia Hammond, the curator of “On the Nature of Things” at the Museum of Fine Arts in Boston; Graham Tremaine, the artist-in-residence at the", "The next Biennial should be held at least annually. It is hoped that the introduction of a new play, new exhibition, and with it a new international audience will help to bring about a change of heart among many audiences and to enable artists to focus on their own work. \n\n\nCulture Minister Mona Hatoum has declared that the government is prepared to establish an emergency fund of $1.2 billion for individuals and cultural institutions that have not yet received a financial contribution from the Saudi Arabian government. The fund is intended to provide relief to individuals and institutions that cannot afford to pay their own way through the coronavirus outbreak. Hatoum told the South China Morning Post that the fund would be administered by the Saudi Arabian Embassy in Beijing and would be in addition to the International Committee of Museums (ICOM), which has provided aid to individuals and institutions in Saudi Arabia for fifty years. Hatoum said that the fund would operate in tandem with the Saudi Arabian National Relief Fund (SARF), a $4.6 billion emergency fund set up in 2016 to support the immediate needs of individuals and institutions in need of cash. The fund would be administered by the Minister of State for Culture and Tourism, Omar al-Khal", "The next Biennial should take place in Paris in 2022. \n\n\nThe Solomon R. Guggenheim Museum in New York City has welcomed four new visiting artists to its roster: Kristin André, Rachael Pape, and Kirsten Luckett. The museum announced the appointments on Instagram, along with a statement that the four artists had joined the Guggenheim as visiting fellows.“Kristin André is an American artist whose practice focuses on integrating visual and performing art with a contemporary aesthetic, particularly in the form of performance art,” said Guggenheim director Paul Mpagi Sepuya. “Her work is often about the intersection of art and the African diaspora, about the ways in which art and tradition intersects and is fused into a multiplicity of forms. Her work explores the relationship between art and nature, between art and the physical body, and between art and the African diaspora.”Pape, who was born and raised in California, first visited the Guggenheim in 2017. In 2018, she received the Emily Hall Tremaine Award for her first exhibition at the institution, “What Art Is Today,” and", "The next Biennial should be held in 2020. The biennial will provide a platform for new and emerging artists and will include a new exhibition of work by artists from underrecognized countries. The first edition of the event was held in Venice in 1992. The first show was organized by the museum of modern art in the United States. The show was organized by Lenore Tawney and drawn by Patricia Zhivago.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has launched a new digital initiative that will provide free, one-time access to the exhibition–level works in its collection. The program, dubbed the Met Art Box, will be led by the artist-run group Project Gallery and will aim to increase the museum’s holdings of work by underrecognized artists.“The Met has long curated work by underrecognized artists, and the Met Art Box is an extension of our ongoing efforts to increase the number of works represented in our collection,” said Mary Anne Carter, director of the museum. “With the launch of this initiative, we are continuing our work to advance the Met’s collection, to include a diverse range of work from underrecognized artists, and to explore the ways in", "The next Biennial should be held in 2022. \n\n\nThe Pérez Art Museum Miami (PAMM) has received a gift of twenty-six works in the form of an anonymous donation from the artist-run museum. The work, which was acquired by museum director Leonard Sussman and his wife, Joan, in the early hours of February 21, was in the form of a series of canvases, each depicting a different social condition, from the late nineteenth century. A selection of the works will be presented at the museum at an exhibition titled “Tribes of the World: From the Pérez Art Museum to the New American ” in partnership with the Pérez Foundation, which is organizing a World War II–themed retrospective of the work in the fall.The Pérez Foundation announced the donation in a statement on February 22. “It is a rare gift that will bring the Pérez Art Museum back to life for thousands of visitors, but the Pérez Foundation’s commitment to supporting and preserving the museum’s art and collections will extend far beyond the scope of this gift,” Sussman and Joan said.Established in 1976 by Norman and Edith Pérez,", "The next Biennial should be held in mid-January 2020. Earlier this year, the University of the Arts London (UCL) in London announced that it is also planning on reopening in March. On the opening of the Second Biennial, UK Culture Secretary Maria Boggs said: “We are creating an environment for creative life to flourish and flourish and thrive, for young people to find their voice in the world again and to create the very best possible futures for their children.”\n\n\nThe Minneapolis-based nonprofit the Museum of Contemporary Art (MCA) is launching a new direct-response fund to artists and their families in the Twin Cities, which will distribute $1 million to artists and their immediate communities. “This direct action is about more than just the immediate needs of artists,” said museum director and CEO Michael Wert. “It is about restoring a more positive vision of the future for our communities and the museum as well as restoring and strengthening the museum’s long-term mission of supporting the creative work of Minnesota’s best and brightest.”The new fund will be managed by a group of artists and their families who collectively raise between $55 million and $105 million", "The next Biennial should take place in 2021. More information about the installation can be found at www.sensitga.com. The Abbot’s Majesty will be inaugurated at the London Biennial in 2022. The Abdicated, a new exhibition of works by Harvey White, will open at the Museum of London in 2020. The Contemporary Art Biennial, curated by Susanne Vielmetter, will be held at the London Biennial in 2021.  The Dijon International Biennial, curated by Cécile Bibeau, will take place at the Dijon Biennial in 2020. The Dijon Contemporary Art Biennial will open in 2021. The Dijon Art Biennial, curated by Jacques Kallouil, will open at the Dijon Museum of Art in 2021. The Dijon Art Biennial will be held at the Dijon Museum of Art from September 5–October 3, 2021. The Dijon Art Biennial will unveil the first works by Harvey White this fall. The Dijon Contemporary Art Biennial will be held at the Dijon Museum of Art in 2021. The Dijon Contemporary Art", "The next Biennial should be held in 2022. \n\n\nThe art-world body Artforum has welcomed the American artist Clara Bradley to its ranks. Bradley, the co-owner of the experimental, sculptural arts collective 3–D Systems, will be the first female artist to represent the United States at the upcoming Art Basel show, which will take place at the Venice Biennale in February 2022.“4-D Systems embodies the spirit of what it means to be a modern artist: a person with an open and cheerful heart who makes a living from their work and strives to produce works that challenge and delight audiences,” said, Christo and Michelangelo Christo and Michelangelo, cofounder of the New York–based firm 3–D Systems. “I’m thrilled that this new chapter of our life will begin with the artist and continue with her in the midst of her amazing legacy, Sofa Art, and the possibilities of art as a force for creative change. Thank you to all of our supporters for your great support.”Bradley joined the group in 2004 after she left her position as an assistant curator of modern art at the Museum of Modern Art in New York in order to focus full-time", "The next Biennial should be in December 2020. For the remaining biennials the theme will be: Why are there so few? The next edition of the Biennial will be held in March 2021. \n\n\nThe Institute of Contemporary Arts (ICA) in London has appointed Gavin Brown, who was previously chief executive of the royal arts complex, the Somerset House, as its new director. Brown will assume his post in January 2021. The academy’s board of trustees also elected Leila Johnson as its first director. Johnson comes to the institution after serving as director of the Somerset House from January 2018 to January 2019. She succeeds Peter Schäfer, who retired in December 2019 after a decade at the helm of the academy.“Gavin Brown’s appointment as director of the Institute of Contemporary Arts (ICA) is a watershed moment for the future of the Institute, the city of London, and for the whole of the UK,” said ICA chairman Tobias Erhard Schäfer. “As director of a major arts complex, Gavin has a unique perspective on how to achieve socially and economically viable long-term financial success. His vision of the future partnership between the Institute, the city, and the wider world is extremely important", "The next Biennial should be held in Helsinki in the spring of 2021. The exhibition’s next edition will be held at the Tops in the summer of 2021. The next Art Basel Hong Kong fair will be held in the spring of 2022. \n\n\nA group of artists, photographers, writers, and other cultural workers in the Philippines have launched an open letter to the United States in protest of a new trade deal that would allow American companies to move factories and jobs overseas if the country does not protect workers' rights.Signatories of the letter include Beatriz de Alvarado, Zico Estrella, María Berrío, Winnie Madrigal, and Alonzo Nava; Jonathan Poncet, who was recently appointed the new director of the Visayan Art Museum in Manila; and Daniel Quevedo, a former box office clerk at the U.S.A. Foodshop and a self-taught painter who currently lives in Manila.The Art Basel announcement states that the agreement would “protect workers” and “champion a new set of global principles that strengthen the power of workers and the environment.” It also states that the “artistic economy” must not be", "The next Biennial should focus on the art of interconnection, “intersection of art, politics, and society.”In a letter to the trustees of the Biennial, Hirshberg and Zinoviev wrote: “The exhibition will present the work of the artists who are still active, as well as exhibitions that have recently opened or are currently running and will include a selection of works from the exhibition that were previously lost to the biennial.” The Art Newspaper reports that the exhibition will also include “a public speech by the artist Elissa Farabi, ‘The Life and Death of a Woman,’ which was previously unpublished.” The event will now take place in the central gallery of the Bechgood Gallery in Zurich from January 26 to February 28, 2020.\n\n\nThe Pérez Art Museum Miami (PAMM) has been awarded a $100,000 MacArthur Fellowship for its work in supporting artists and small to mid-size Chicago nonprofits through the 2017–18 academic year. Named after the longtime MacArthur Fellow, whose work is currently on display in the museum’s new David H. Koch–designed building, the fellowship comes at a crucial time for the institution, which is currently", "The next Biennial should be staged in April 2020, according to a statement by the museum. The theme for the theme pavilion was “Biodiversity and Identity: An Essay in Human Nature.” The winner of the prize was Lina El-Sayed, a curator at the National Museum in Istanbul. The prize also honors a panel of judges, which comprises Benedict Abbot, director of Tate Britain; Andrew Lobton, director of Tate Modern; and Jaye Rhee, the director of the Asian Art Museum. The Biennial will be hosted at Museums House, the National Museum in Istanbul, the Bosphorus Shipyards in southern Japan, and the National Museum in the Special Collections Department of the National Museum of Fine Arts, Seoul.\n\n\nThe Museum of Fine Arts (MA) in New York has named Courtney McClelland as its next executive director. She succeeds Harald Szeemann, who departed the institution in March 2019 to head the Straus Art Museum in Hamburg, and will assume her post on June 30.“After two decades at the helm of MFA, Courtney has demonstrated a remarkable track record of transforming MFA into a leading international leader", "The next Biennial should be held at the city’s Museum of Modern Art, in 2020; the Museum of Modern Art in New York in 2021; and the Museum of Modern Art in Chicago in 2024.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed John Skelton as its next president and CEO. Skelton comes to the institution from the Los Angeles County Museum of Art (LACMA), where he has served as interim director for the past eighteen months.Skelton will assume his duties on January 4, 2020. His new role will include overseeing the museum’s development of its new headquarters and arts-dedicated transportation hub as well as the museum’s expansion of its collection and exhibition program.“We are deeply grateful to John for his distinguished career at LACMA, where he has fostered and cultivated the museum’s collection, provided critical support for the museum’s forthcoming exhibition “Falling Skies,” and organized the highly anticipated “Forty Years of Stopping Motion” (2019).“After we renewed his contract, he became our first president and CEO, and in his role, he has overseen the Museum’s transformation into", "The next Biennial should take place in 2021.\n\n\nThe United Kingdom’s Office for National Statistics (ONS) has released preliminary figures for the UK’s economy, showing that the UK is struggling, facing its worst recession since 2010, and is slowly losing ground to China in the global race to the bottom.The ONS states that there were 6.5 million fewer people working in December as a result of Covid-19, which affected all businesses, including retail, and its gross domestic product (GDP) shrank by 0.4 percent in the twelve months to December. The numbers are down from the 6.7 million people who were working in December 2015, which was the last full month of the Covid-19 outbreak. Britain’s largest trade association, the Institute of Directors, called the numbers “disappointing” and said that the government must now consider “structural change” to address the “explosions and disruptions caused by Covid-19.”The figures come a week after the British Council released a report that found that the UK is losing an estimated £8 billion ($9.2 billion) a year to Covid-19—the", "The next Biennial should be held in the spring of 2021.\n\n\nThe Fred C. Johnson Foundation, which supports the research, preservation, and conservation of contemporary art and has supported the collection of works by more than 1,600 artists since it was founded in 1979, has launched a new initiative to help raise funds for the “dead and physically abused.” Called the Fred Johnson & Patty Johnson Artist Relief Fund, it will give artists relief from their debts and provide them with confidential support. “The foundation has supported the artists for more than twenty years through grants and through our own charitable giving,” said David M. Johnson, president of the foundation. \"We are grateful for their continued support and hope they will continue to benefit from the foundation’s generosity.”Columbia University Art Gallery curator John Paul Jones, whose work encompassed film, photography, painting, sculpture, and installation, died of cancer in Los Angeles on June 2. According to the Los Angeles Times, he was sixty-nine years old. The cause of death was lymphatic cancer, which had spread to his lungs and his liver. The UCLA Biennial of New Orleans’s", "The next Biennial should be called up in November, and the upcoming edition will mark its centenary. Founded in March 1964 by Oskar Eustis, the late American filmmaker Hans Hofmann, and the Austrian sculptor Ludwig Mies van der Rohe, the exhibition will showcase work from the exhibition “Speech–Piece in Architecture”\u0097a statement, filmed in a studio, which included the artist’s own words spoken in a different language. The work was shown in the exhibition “Speech and Animation” (1967–70) and “Art and Photography” (1971–73), and was the subject of the documentary “Passion,” directed by the artist himself.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has dismissed a career art curator, who was the director of the Museum of Modern Art from 2005 to 2014, after she published an article for Artforum in February 2019 calling for an end to the institution’s relationship with the German manufacturer Bayer. In the article, which was written by Kate Crawford and titled “The Future of Art” and was published in April 2019, she claimed that the Bayer–MoMA partnership has", "The next Biennial should take place in the spring of 2021, at the newly renovated Museum of Fine Arts, Boston, and is expected to draw up to ten thousand visitors. The exhibition has since been extended to February 20, 2021.\n\n\nThe Rubell Foundation, a New York–based nonprofit, has appointed Janice Rubin, the founder and director of the New York–based company the Rubell Group, as its next president. Rubin will take up the post on January 8, 2021.“Janice Rubin brings a proven record of success and vision for the Rubell Foundation to the next phase of her career, while building on her foundation’s success over the last decade,” said David Rubell, the foundation’s director. “Her authority and credibility as an advocate for artists and her proactive approach to funding and championing the arts make her an ideal choice for this important role. As we work toward a future that truly embodies the Rubell Foundation’s mission, I am hopeful that her leadership will advance the Rubell Foundation’s mission to continue to advance the art of humanistic creativity and to develop new and innovative public and community programs that promote the Rubell Foundation’s vision of artistic practice as a", "The next Biennial should be unveiled in 2020, according to Renaud Gentile, the French president’s secretary of culture and media. He said: “This year’s marks will reflect both our current mood and our vision for the future.” For the next edition, the biennial will take place in January and will be hosted by the Art Gallery of Modern Art (AGMAC) in Paris.\n\n\n\n\n\nGermany is planning to spend $6.2 billion to repaint the country’s historic Brandenburg Gate in remembrance of the 7,600 German soldiers who were killed by the Black Death in the second world war. The project, funded by Germany’s federal and state governments, and the Alte Alliance Party, aims to bring the memorial to life by adding more than three hundred bronze statues of Germanic heroes and their commanders and by reassembling the gate in a way that allows the sun to set over the Brandenburg Gate in the morning rather than in the afternoon.The billions are being allocated to the construction of memorials of the Germanic world, from the Third Reich to the Soviet Union, and to reconstruct the Brandenburg Gate in a way that preserves the historical site’s original", "The next Biennial should take place in the spring of 2021. The initiative will be hosted by the museum in conjunction with the third edition of the Turin Biennial, which will be held in the spring of 2023.<|endoftext|>SHOWCASE ! That Bastard Is Trying To Steal Our Gold ! !Anyway! #ArtsMaKeRiche#SubversiveSociety\n\nFrom the Simon West Gallery in London, where the artist-in-residence Mia Lake is directing a new season of “Away From It All.” In an open letter published in March, Lake wrote: “I am writing to protest the appointment of Mia Lake as the next director of the Simon West Gallery. I take responsibility for this decision with an iron-fisted grip because, as director, I have to guide the show through a transition period before the opening of the new series ‘Moonlight’s 13th edition, scheduled for October.”In April, Liz Marcus, the chair of the board of trustees at the institution, issued a statement in which she said that the board voted unanimously to terminate Lake’s contract, citing her “over-the-top” style of leadership as well as", "The next Biennial should be held in the spring of 2022. The thirty-second iteration of the festival will take place in the autumn of 2022. The twenty-seventh and twenty-eighth installments will each be held in the spring of 2021 and 2021.\n\n\nThe British Museum (BMP) in London has appointed Christopher Wool, the former chief executive of the private security firm G4S, as its new executive director. Wool joins the institution from the Metropolitan Police, where he has served as a chief operating officer since July 2019. He succeeds Caroline Anagnos, who guided the museum, from March 2021 until March 2022, and will take up the post on July 1.“Christopher comes to the museum as a hugely experienced curator, passionate about the history of contemporary art and art history, and passionate about the transformation of the BMP,” said Anagnos. “The museum is moving in the right direction as we open our new exhibition galleries and new galleries are being developed at our new site on the south bank of the Thames in Chelsea. I am extremely excited about the future of the BMP and the role of Christopher as director. I am looking forward to working with him to shape the next chapter of its history.”", "The next Biennial should be announced by March 21. \n\n\nThe Maya Museum of Art in Arizona is planning to drop the word Meso’an, a term that was first applied to the Maya people in Mexico and was used as a pejorative term for western Europeans, in honor of Indigenous peoples of the planet. It will replace the term Mesoamerican with Mesoamericans, a term that is more inclusive of Indigenous Peoples.The announcement was made in a statement released by the Maya Museum of Art in America. The statement reads: “The Maya Museum of Art is committed to deepening our understanding of the world we live in, and to understanding how we can be active participants in shaping the future. For many people, the name Maya means 'people of the earth, people of the sky, people of the water.”The announcement follows a series of actions, including an exhibition at the museum in November 2019 titled Maya Scribbles (2018–2019). Following its opening, Mesoamerican was deleted from the museum’s official website.The museum is also working to remove the word from the museum’s website. The change is expected to be made in the next", "The next Biennial should be held in 2022.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has announced its next edition, “The Architecture of Illusion,” which will follow the institutional and philosophical background of the organization’s signature exhibition, “The Architecture of Mid-Century Modernism.” The exhibition will show work by twenty-two artists, spanning fifty years, and will take up themes that range from the symbol to the body to the future and the present. The exhibition will be held at the museum from March 16 to March 19.Filipino American artist Michele Mollica is organizing the fiveteenth iteration of the exhibition at the Los Angeles County Museum of Art (LACMA), which opened in 2012 with “Por favor trianglose,” a work by Mimi Alejandro, an early Mexican American painter, and will run from March 3 to March 7. The series, which recently received a $50,000 gift from the Los Angeles County Museum of Art, was selected from a shortlist of twenty-two artists who were nominated by Artsy readers. The winner of the award will be announced in the May/June issue of the magazine.“From", "The next Biennial should be held in the summer of 2020. The exhibition will include works by artists such as Marc-Olivier Plát /Juliette Baillie and Klaus-Dieter Knapp. The festival, which will be hosted in the city of Biarritz, will run from March 13 to March 15, 2020.\n\n\nAmerican artist Rachael Bensch, best known for her work depicting a woman as the central figure of an immersive virtual reality (VR) experience, has died at age forty-one. The Los Angeles–based artist was best known for creating works that grapple with questions of embodiment and consciousness, gender, and sexuality.Her work has been collected by the Los Angeles County Museum of Art (LACCAM), the Los Angeles County Museum of Art (LACCA), the Foster Museum of Art, the Museum of Contemporary Art, and the San Francisco Museum of Art, and she was represented by many artistic and cultural organizations.Born in New York in 1963, Bensch studied with Paul and Mia Ciepritz at the School of Visual Arts in Los Angeles. While in the city, she met and began working with her parents, who encouraged her to pursue her artistic ambitions. She eventually married", "The next Biennial should be held in 2020, but the new venue has not yet been selected. The exhibition will run for twenty weeks and will feature works by sixty-nine artists. The exhibition will be inaugurated by a three-dimensional installation by the Swiss artist Nude Schuylkill, titled The Oscillating Circle. The installation will be accompanied by a book by the same name, describing the artists’ process.The Biennial is not the first time the Biennial has been held. It is part of a larger project by artist-run venues such as the Museum of Modern Art and the Museum of Modern Art in New York, which is dedicated to the history of art in America, and has been held twice—in 1996 and 2012.\n\n\nThe California Council of the Arts (CCA) has released guidelines for how museums and other cultural institutions in California can benefit from a $1.2 billion capital campaign to prevent the spread of Covid-19, which has infected more than 3,600 people in the Golden State and caused coronavirus-related deaths in California.The guidelines, which were issued on March 24 by CCA chair Mark di Suvero, state that institutions will receive up to $650 million from the program,", "The next Biennial should take place in the spring of 2022.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles is preparing to welcome visitors back to its facility in the summer of 2023. The institution announced on Wednesday that it will begin letting visitors return to the museum in June, with the promise of a new experience, the creation of which will be guided by an artist-in-residence program that will launch in 2022.“After a thorough review of our current plan, we are excited to announce that our 2020–2023 season will not include the MOCA at all, but will focus exclusively on the ART of the Century,” said Jeff Rosenstock, president and CEO of the museum’s board of trustees. The new program will help MOCA continue to thrive and advance as a center of arts and culture.Each of the four curators of the 2020–2023 season, which will be announced in the coming weeks, will be able to draw from their own archives and draw from a collection of some twenty thousand works. The first round of curators will be announced in June; the second in July; the third in August; and the last in September. The fourth round of curators will be announced", "The next Biennial should be held in 2021. “It must be a place where we can come together on a level playing field, where we can be fully ourselves and fully visible,” said Milos Villegas, the executive director of the biennial and a leading curator. “I have enjoyed working with the Luminary and the historical artists, and have been inspired by their vision for this exhibition. They have chosen to honor the legacy of one of our best-known artists with a project that reflects their dedication to their profession.”The conceptual director of the exhibition, Simone Leigh, said: “The selection process for the exhibition was based on a thoughtful, interdisciplinary approach that took into account the composition and the history of the work in question.”\n\nThe Van Gogh Museum in Amsterdam and the National Museum in Oslo announced that the two institutions will collaborate on a new exhibition about the relation between art and technology. Titled “Art and the Artwork, 1964–1965” and curated by Dieter Neugroschel, the show will travel to the Van Gogh Museum in 2019 and the National Museum in 2021. The announcement follows a year of negotiations between the two institutions that were led", "The next Biennial should take place at the Museo de Arte Contemporáneo in Madrid, in January 2020.A selection of works by the curators will be presented in the exhibition “NIRIN” when it opens at the museum in March 2020.\n\n\nThe Museum of Fine Arts (MA), New York, has appointed ten artists as the next representation of the legendary American painter Howard K. Brown, Jr. The ceremony, which marked the institution’s centennial, took place at the New York City institution on Thursday night. The ten artists chosen for the program were Mitchell Williams, Terence Blanchard, Katherine Graham, Justin Georges, Joaquin Aranda, Malcolm Brown, Sr., Meryl Streep, and Tilda Swinton. The biennial’s inaugural edition, “HEART & SOUL” (September 26–September 28), featured work by the workhouses P.S. 1 and V.S. 2, which Brown founded in the 1930s.Swiss artist Arne Glimcher is the front-runner for the honor of the program. His work, which explores the relationship between nature and the landscape in an effort to merge the two, was selected for", "The next Biennial should be held in 2020. \n\nThe inaugural fiftieth edition of the Venice Biennale was held in February 2020. The event featured the first show by a Chinese artist to enter the Venice Architecture Biennale since 1994, and featured the first show by a Chinese artist to be presented in Italy since 1959. The event was also the first to feature a show that featured an indigenous artist’s work in the exhibition. The show’s first partner was the Beijing-based artist Xiankai Xu, who also organized the show “Mana, Spring, and Black and Gold” (August 29–September 5, 2019) with the exhibition “10,000 Years of Metamorphosis” (October 21–November 27, 2019).The Berlin-based artist Aline Meininger, who is based in Switzerland and Hong Kong, was chosen for the show. Meininger’s work was selected from a shortlist of three finalists by the Berlin-based jury, which had a one-year period to present a proposal for the exhibition. The exhibition was hosted by the experimental Berlin-based nonprofit Artforum Berlin and was funded by the Berliner Kunsthalle BUNS.�", "The next Biennial should be held at least once a year to allow time for the collection to complete.The biennial will be a collaborative effort between the Museum of Contemporary Art, London and the Museum of Contemporary Art, San Francisco. Curator Adam D. Weinberg said: “The construction of the exhibition means engaging with the latest research and uncovering the influence of contemporary art in shaping and exploring contemporary life. By allowing the collection to work through issues such as security and surveillance, I hope to create a platform for a more inclusive, global, and unified future.”\n\n\nThe Museum of Fine Arts (MFA) in Boston has received a gift of thirty-six works by fourteen artists, including Philip Parker (1902–1983), who won the first prize at this year’s SFA’s Fifty-Sixth edition and the first prize at the Museum of Modern Art’s Fifty-Seventh. The funds came from the Gordon and Betty Moore Foundation, which is an arm of the Gordon and Betty Moore Foundation, which was founded in 1987 to support the Gordon and Betty Moore Trust, which supports the creation of new works by artists.The gift includes the works of Josée María Berrada (", "The next Biennial should be in 2021--the year of the twentieth anniversary of the event. The inaugural edition, held in 1999, featured contemporary artists such as Aung San Suu Kyi, Isamu Noguchi, and Jules and Graham. The exhibition was initially curated by Stephen Deibert, who left the institution in 2016 following a controversy over his hiring of a British artist to work on a retrospective of the artist-owned bookstore chain the Gap. The controversy led to Deibert being fired from the position, and he left the institution in 2018.Organizers of the ten-day exhibition are hoping the new partnership with the Coronavirus Aid and Relief Coalition (CARC), a global organization that works with local, state, and federal governments to fight the coronavirus outbreak, will help mitigate the county’s health crisis. The organization said: “This partnership welcomes the local community and will allow us to expand our work and provide immediate relief to those in need. We look forward to working with the local community, the wider Cardiff community, and the wider Cardiff region to ensure the public and local authorities have access to clean, safe, and effective resources and to support those most in need.”\n\n", "The next Biennial should open in 2020, when the museum’s current exhibition, “Abraham Karsky: The Most Beautiful People,” will close for a ten-year reopening.A statement from the museum said: “We are deeply honored to have the opportunity to present the work of our current exhibition, ‘Abraham Karsky: The Most Beautiful People,” and the sculptures and works of the collection that were selected for the exhibition. We are especially grateful to the excellent and dedicated team of curators and advocates that worked tirelessly to press us to present new works that reflected both a deep appreciation for the public’s understanding of the art form and a commitment to the process.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has received a gift from American businessman and philanthropist David H. Koch, who in 2007 transferred $13 million in funds from his personal collections to the institution. Koch’s daughter, Mary, became the first director of the museum in January 2009 and has served as interim director ever since. Since then, the museum has become a major supporter of the arts and has expanded its scope to include the study of new and emerging American art.In an update", "The next Biennial should take place in the autumn of 2020.\n\n\nThe Museum of Modern Art (MoMA) announced today that it will put forth a new $2 trillion plan for its new $75 million Museum of Modern Art in the spring of 2021. The plan will provide nearly $200 million in funding to MoMA’s existing collection, including the Metropolitan Museum of Art and the New Museum, and will also include the construction of a new 75,000-square-foot building to house its permanent exhibition collection.MoMA’s current building, the expanded Museum of Modern Art, will be completed in the spring of 2024. In order to accommodate the institution’s expansion, MoMA enlisted the help of a private firm, Gensler & Stoll, and constructed a new, 600,000-square-foot, 25,000-square-foot, and a large-scale outbuildings in the museum’s back yards. The new structure will be completed in the fall of 2024 and will seat approximately 1,500 people.“With this new budget, MoMA will create a Museum of Contemporary Art that reflects the extraordinary transformational power of art as an engine of social change and will inspire and challenge audiences to", "The next Biennial should be held in the same city as the exhibition, and in the same location. The museum will also continue to be a research center for contemporary and avant-garde art and will be incorporated into a new urban plan. The director, Nikita and Lama Bochner, and the board of trustees will meet in the coming weeks to discuss the reinstallation of the museum.\n\n\nThe San Francisco Museum of Modern Art (SFMoMA), which was forced to close in March 2019 due to the ongoing Covid-19 outbreak, has agreed to buy fifty-five works by twenty-four artists in an attempt to restitute the institution’s collection for the 2020–19 academic year. SFMoMA director Maurizio Cattolica informed the Board of Trustees of the American Institute of Art (AIA) this week that the seventy-fifth piece was donated by artist and activist Rosemarie Richard. Richard, whose practice spans photography, film, performance, painting, and sculpture, was an ally of the Black Lives Matter movement and helped establish a fund for the collection in 2016. The board of trustees officially endorsed the purchase of the works by Richard and other activists last month and approved the plan on", "The next Biennial should be held at the Museum of Fine Arts, the Museum of Contemporary Art, San Diego, and the San Francisco Museum of Modern Art, and should be open to the public in 2022. “Two hundred years from now, I will be seventy-four years old, and I will be the last living member of the American Folk Art Museum’s board of directors,” said Peter W. Mayer, chair of the museum’s board. “In a time when we are reminded daily that art is more than the sum of its parts, I was honored to be selected to chair the Biennial of American Folk Art.” The institution has never held a biannual. The first biennial was in 1974, the year that the Museum of Modern Art announced it would be taking the name Biennial of American Art from the American Folk Art Museum (AWAM), which was founded in 1915. In 1976, the Museum of Modern Art moved its exhibition space from the Folk Art Museum to the San Francisco Museum of Modern Art. The new institution will be inaugurated with a thirty-second edition of the biennial, titled “In the Beginning,” at the Museum of Modern Art in 2020", "The next Biennial should be held in 2020 and will consist of fifteen exhibitions. The exhibition will feature works from the exhibition “The Plaza,” which is scheduled to open in November 2020, and will be accompanied by an exhibition of a selection of works by the artist’s thirteen-person group.“The Biennale is a great opportunity to re-create and re-connect the Art Deco, with a contemporary perspective, to the contemporary city,” Vassallo said. “The phases of the Biennale are as follows: 1. Festival of the Arts. The first of its kind in Italy, with new works on the theme of the year. The exhibition will be organized at the event, and will be operated by the Wittenberg Foundation. The Düsseldorf Group will take over the management of the event. 2. The Biennale Quartet. The Quartet will become the institution for the presentation of new works by the artist. The Istituto di Artis will take over the management of the venue. They will collaborate with the artist and the Wittenberg Foundation to form a new cultural organization, the Wittenberg Arts Council, which will organize the event", "The next Biennial should be held in 2022. Its design will be inspired by the city of Yokohama, Japan, which was subsequently chosen to represent the city at the 2020 edition of the Biennale.  The 2021 edition of the event, which was held at the Nara Museum in Nagoya, Japan, was canceled owing to the ongoing construction of the city’s new light-industrial complex. Subsequent to that, NamaKiri, a contemporary art center situated in the Nara district of Tokyo, presented a retrospective of work by Ricardo Campos, José Campos Jr., and João Ribas.Campos’s 2017 exhibition “FACTS of SUSHI,” which was staged at the Nakayama Museum in Tokyo and was awarded the Best Exhibition Prize at the 2017 Art Basel Hong Kong (ABHK) in Hong Kong, was also selected as the 2019 Biennial. A retrospective of work by Ricardo Campos, João Ribas, and Raphael Sbarge, which was staged at Art Basel in Zurich, was chosen as the 2020 event. \n\n\nThe National Gallery of Art in Washington, DC, announced on Thursday", "The next Biennial should take place in the city in 2020.\n\n\nThe British Museum (BMI) in London has received a gift of fifty-six works by the artist-husband-and-wife team Elfriede Jahn and Maria-Luis Alarcon from a group that included the late sculptor Sir Peter Siegel, who designed the institution’s main building and oversaw its exhibitions.The work-stuffed toys—which were created for the institution’s Adventure exhibition series—were donated to the institution by collector Michael Giddens, whose extensive collection includes works by artists such as David Hockney, Charles Atkins, and Eileen Atkins, and whose relatives include Tony Blair and Prince Philip.“The gift is a tremendous step in the museum’s long and proud history,” said Mike Giddens. “The partnership with the family has made the gift possible and it has given us a great sense of relief to know that the gifts will be delivered to the museum with the great unwavering loyalty. We are thrilled to present the collection to the family and have had the privilege of seeing the works in person at the museum. The gift is a great honor and we’re confident that the cur", "The next Biennial should be titled The Social Network: Exploring Social Media and the Evolution of Human Intelligence. The programme will promote the work of David Eagleman and Simone de Beaufils, among others who explore the impact of social media on our lives and on how we think, feel and act. \n\n\nThe Metropolitan Museum of Art in New York has announced that it has received a $8 million gift from the Cajun and Cree Nation of Louisiana. The fifty-six-foot-tall statue of French explorer La Tourist, who discovered the American West in 1805, was dedicated on Tuesday and was the work of artist and collector Jean-Jacques Peck.Born in Paris in 1936, Peck made his way to the United States in the 1950s, where he began selling artifacts from his vast private collection. He later founded the Louisiana Museum of Fine Arts (LMAFA), where he amassed a collection of art from the Cajuns and Cajuns of the Mississippi Valley. In addition to his research, Peck helped establish the Louisiana artist-in-residence program, which provides funding to Louisiana artists in the United States. The Met gave $3.5 million to LMAFA, and $2", "The next Biennial should have a selection of works on display in an open-air setting reminiscent of the museum’s former location in the vibrant city of Biennale, and focused on how art and culture intersects with local politics, economic and cultural agendas, and how it can be made more accessible and accessible in our cities.”\n\n\nThe National Geographic Society, which has been fighting to hold off a planned move to its new headquarters in Washington, DC, announced on Thursday that it has managed to hold off the construction of a massive new building for the institution by at least a year. The move, which is expected to cost the government $5.8 billion, was made in order to accommodate the milestone twenty-fifth anniversary of the launch of its magazine, GPS. The New York Times reports that the delay was made possible by changes to the design of the building that may mean that the work will not begin construction until early 2022.The decision means that the National Geographic Society will remain in its current home in Washington, DC, and will only begin to move into its new, $4.5 billion headquarters, which will be inaugurated in the spring of 2022, when the weather is clear and temperatures in the low- to mid-", "The next Biennial should focus primarily on the social and political conditions that shaped the exhibition’s trajectory, in such a way as to reflect the current situation. Then we will stage a second exhibition in December 2020, with the mission of understanding and celebrating the work of contemporary artists.”\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Kelly Suttie, a curator and associate curator of contemporary art at the Boston Museum of Art, as its next chief curator. Suttie, who currently serves as an adjunct associate curator of modern and contemporary art at the Boston Museum of Art (BMA), will assume her new role in January 2021.“Kelly has illustrated the maturation of the museum’s curatorial practice in her twenty years at the helm of the museum, and we’re grateful for her vision in bringing her to the MFA for her first term as chief curator,” said chief curator Matthew Teitelbaum. “Over the course of her tenure, Kelly has shaped the museum’s curatorial approach through a series of exhibitions, curated two multi-venue shows, and promoted the development of renowned exhibitions around the world.”\n\n\nThe Los Angeles County Museum of Art (", "The next Biennial should have been held in December, but was postponed due to the Covid-19 pandemic. Using the show as a platform for their work, the artists created a closed installation “Avant-Garde Biennial” (2018–19) at the Museo de Arte Contemporáneo in Madrid, which was staged in two parts over nine months. In March 2020, Artforum published an interview with Anna-Sophia Uccella, who was selected as the fifteenth laureate for the 2020 edition of the Biennale de Lyon, and has since received the honor of being awarded the Maltese Presidential Medal of Honor.\n\n\nThe Griffith Art Museum in Los Angeles has released the first ranking of the seventy-eight artists who have participated in the last edition of the Los Angeles Art Week, the gathered under the auspices of the Los Angeles County Museum of Art (LACMA) from June 14 to June 21. The survey, which counted more than 1,500 works, was organized by the institution in partnership with the Association of Art Museum Directors (AAMD), and ranked artists based on their “performance.” The twenty finalists were Allen Henry", "The next Biennial should be in the Spring of 2020.”\n\n\nInstitutional Review Board (IRB) president Fanny M. Mors, who was fired on Friday, June 16, after she refused to remove a statue of Edward Colston, a slave trader and Confederate supporter, from a public park in Jacksonville, Florida, was reinstated on Monday. The restoration of the 125-year-old statue, which was moved by a team of workers in 2017, was facilitated by a $20,000 grant from the city of Jacksonville.Mors is appealing her termination, which she claims was triggered by a request from a white nationalist group. According to the New York Times, the city’s Human Resources Department granted Mors “a one-year extension” of her termination notice, which means that she is allowed to keep her job and continue to receive her annual salary. Mors also claims that she was never given a reason for her dismissal.“I am gratified that the city of Jacksonville has stood by my side during this ordeal,” said Mors. “I am also proud of the work that our team and I have accomplished thus far to secure this statue and to restore it to its former glory. I", "The next Biennial should take place at the end of February 2020. The museum is also working on a new exhibition, “The Beauty of Life” that will present various works by the Thirty-Six artists that participated in the first Biennial, and will introduce the first-ever Biennial Viewing Rooms. It will also be the first to introduce the Biennial to the public in a multi-million-square-foot venue.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has announced that nineteen artists have been selected for the DCLA Artists in Residence Program, which is funded by the $1.2 billion Tick-Tock tax reform legislation. The twenty-one-person shortlist was made up of John Paul Jones, Diana Ross, Paul Gauguin, Michael Meade, and Hans Christian Andersen.Each artist received a $500 stipend and 15 days to present their work at the DCLA, which is located at 790 East Seventy-Third Street in Manhattan, from March 22 to March 25. According to the New York Times, the deadline for the residency program is March 19. The recipients are:DAVID BROOKS (New York, New York) January 2019", "The next Biennial should take place in the fall of 2020 and will run from May to September.\n\n\nThe British artist and curator Terry Southern has been named the winner of the $15.1 million Pritzker Prize. The honor is one of the highest honors given by the Pritzker Prize. The jury’s choice, which consisted of Gerald Scharnhorst, artistic director of the Pritzker Prize; Jean-Philippe Houellebecq, president of the prestigious jury; and American artists Chris Procter, Josie and the Bandit, and Andy Warhol, announced the award in a joint statement.Louis van Tilborgh, a German-Jewish artist who lived and worked in the former East Germany from 1973 to 1977, has won the Florence and Venice architecture prizes. He was nominated for the Pritzker Architecture Award for his monumental multi-thousand-foot-tall, Douglas-fir palace, and for his work, The Kingdom of Heaven, 1987, which occupies his studio. Van Tilborgh’s work will be included in the biennial’s exhibition “The Dreamers,” which will open in 2021. The Pritzker Architecture Prize will be awarded to Gerald Scharn", "The next Biennial should take place in the fall of 2022 and is expected to draw up to sixty thousand spectators. The theme, “Cohesion between the City and the State,” will be taken from the city’s charter, which states that all activities carried out in the city’s public spaces must be in accordance with the city’s vision for the city and the city’s local needs and not interfere with other activities.The organisers said: “Our mission at the Biennial is to help the city of Manchester and the city of Manchester United to understand that we are one of the largest European city-states in the world,” and, “Cohesion between the City and the State is at the core of what makes the city of Manchester special and unique. We hope the visual and audio experience of the exhibition will provide a strong incentive to continue to engage with the city and its people.”The inaugural edition, staged at the Musashi Museum on the grounds of Shingeki no Kyo, in Sakhnin, Hokkaido, was held in January 2019. The third edition, staged at the Manchester Art Museum in May 2019, was held at the Manchester Institute of Art during 2020.\n\n", "The next Biennial should be held in 2025.The 2018 edition, which also featured works by artists such as Chantal Akerman and Hélio Oiticica, was curated by Radioshack and was staged at the powerhouse gallery space Württembergischer Kunstverein Stuttgart.\n\n\nAfter a judge ruled that the Brooklyn-based nonprofit Artadia\u0097a nonprofit that develops and organizes art exhibitions, education, and curatorial projects\u0097must pay workers who were laid off from its Brooklyn outpost on September 13, the organization announced this afternoon that it will resume operations. The announcement came after workers at Artadia’s two locations, located in Gowanus, Queens, announced that they were working with Artadia’s contractors to try to salvage the embattled space.The news comes on the heels of Artadia’s announcement that it is reopening its space in Gowanus, which is currently undergoing a $200 million renovation, and of Artadia’s attempt to secure a new lease on a nearby building that houses the organization. The news was also announced on Instagram, where the organization shared a statement that reads: “We are back again! We are back again! We are", "The next Biennial should be held at the museum every third year, with a new title and a new theme. The theme should also be an expression of the organization’s history; that is, an account of the presentation of the artist’s work in the museum’s collection and its exhibition of that work. The biennial will be a continuation of Biennial 76. The exhibition will also feature the work of fifteen lesser known artists, including Bernd and Charlotte Griswold, Olafur Eliasson, and Olafur Eliasson, and a selection of work by shorter-known artists such as J. M. Wiegand, H. H. Goudie, and J. L. Scott. The Biennial is currently closed as a result of the Covid-19 pandemic.The biennial was inaugurated by Angela Eisenmann, then director of the LAMBS Institute at the University of Applied Arts in Berlin, and is currently supported by the S. M. J. B. Foundation, the Helsinki Foundation for the Arts, and the Art Fund, among others.\n\n\nMike Kelley, the former director of the Milwaukee Art Museum (MAM) and the former chairman of", "The next Biennial should be held at the University of Göteborg in September 2022.\n\n\nAs the European Union attempts to contain the coronavirus, the number of cases in the EU has nearly tripled to 5,788 and climbing. On Monday, September 2, the number of people infected in Germany jumped to 5,200, and the total number of people infected worldwide reached 7,000. According to the Washington Post, Germany has sent nearly two hundred healthcare workers, including nurses, doctors, and pharmacists, to help contain the coronavirus, which was first reported in Wuhan, China, on September 1.On Wednesday, the German government set up a special commission charged with helping logistics companies move cases and patients between hospitals and clinics across the country, and on Thursday, hundreds of healthcare workers from Germany, Austria, and other countries—including the United Kingdom, Italy, France, and Spain—took to the streets in Berlin to protest the coronavirus and the closure of an art exhibition in the city.On Friday, Chancellor Merkel declared a state of emergency and began deporting people who are deemed to be at high risk of spreading the virus—people who are not vaccinated, who are traveling to or from West Africa, or", "The next Biennial should include the African diaries of W. H. Griffith (1931–1993) and W. T. Marin (1932–2011), as well as works by the Chinese artists Hu Jintao (1939–2012) and Sun Shinn (1943–1978). From the Fall of 2013 to the Spring of 2014, the show toured the United States and Europe.In addition to the biennial, the university will hold a number of other exhibitions and events, including an exhibition of work by the artist Jakob/Jørnen M. Larsen (2019), a presentation of Nan Goldin’s work at the National Gallery of Canada (2019), and a public lecture series by Nan Goldin. \n\n\nAn art-world gathering organized by New York’s Metropolitan Museum of Art (MoMA) in September 2019 is facing a legal complaint from artists and their supporters after the institution failed to inform them that it was ending its relationship with Sperber Art Institute in New York following the conclusion of its forthcoming exhibition “The Past.”The museum is alleged to have withheld information about the closing of the exhibition and its planned reopening other than to say that the museum will not be closed", "The next Biennial should take place in the spring of 2022.\n\n“This is an unprecedented and extremely challenging period for museums,” said Anne-Marie Shenton, president and CEO of the Museum of Contemporary Art San Diego, in a statement. “Museums are facing unprecedented challenges and facing ever-shifting audiences and audiences are shifting ever more rapidly to digital and social media, to new formats and new technologies. We are assessing how best to move ahead in this increasingly competitive environment.”In the meantime, a number of institutions are actively working to adapt to the changing landscape and are working toward reopening. The Seattle Art Museum (SAM), which is now planning to reopen in 2020, announced plans for a $250 million revamp in March. The museum plans to add more than 1,500 square feet of retail space, increase the museum’s hours, and launch a major fundraising campaign. The Seattle Art Museum (SAM), which is currently closed due to the Covid-19 pandemic, is also working toward reopening after it closed for six months to complete a $150 million renovation. In the meantime, the Museum of Contemporary Art Cleveland, which recently announced that it is planning to reopen in 2021, has also acknowledged", "The next Biennial should aim to offer a new and innovative perspective to the exhibition field. We will continue to work together to present great exhibitions and programs and will continue to expand our collection. We look forward to your participation.Gina DeSimone (CNA)’s presentation of The Human Heart in Amsterdam in September 2020 is supported by an unrestricted donation from Dutch family builder Frank Slagt and his six-time winner of the Prix d’Arles, Claude Tellinghuisen, a German artist who died in 2017. This exhibition is organized by the Flemish County Council in cooperation with the Flemish National Museum, the Flemish Museum of Fine Arts, the Flemish Museet, and the Flemish Foundation for Contemporary Art. The first edition of 'The Heart of a Woman’s Body’ will run in 2021.\n\n\nAn eight-carat diamond-encrusted bracelet was awarded to Artist-in-Residence Marc-Olivier Bruguervo for his first solo exhibition at the Museo de Arte Contemporáneo in Madrid in 2019, Artnet reports. The Prix de armeo, the international residency program", "The next Biennial should be held in the spring of 2021. The tenth edition of the event, which was also cofounded by the artist, is presently on view at the Hammer Museum through April 23.\n\n\nThe Smithsonian American Art Museum (SAM) in Washington, DC, has announced that it is launching a new online portal dedicated to the work of contemporary American art. Titled Artforum, the platform will provide permanent collections and special exhibitions organized by topic such as contemporary music, architecture, literature, and art history.The new site will be hosted by the institution’s Digital Culture and Liberty Research Center (DCRC) and will be co-directed by curator and scholar Ciara Scudder. The platform will feature new work each week, as well as interviews with leading artists, artists-in-residence, and scholars, and will feature the works of twenty-five artists chosen from the DCRC’s curatorial team, whose submissions will then be presented in a series of exhibitions.The artist-in-residence series is organized as follows: Onset: 1970–1980. The artist-in-residence series opens with Gershon Gershon’s Dia Art & Architecture, 2002, and will feature", "The next Biennial should take place in 2021 and will involve the following events:\n\nOpening Ceremonies: January 25, 2021\n\nFebruary 13, 2021\n\nFebruary 16, 2021\n\nMarch 3, 2021\n\nMarch 9, 2021\n\nMarch 11, 2021\n\nMarch 13, 2021\n\nMarch 15, 2021\n\nMarch 20, 2021\n\nMarch 22, 2021\n\nMarch 25, 2021\n\nMarch 28, 2021\n\nMarch 31, 2021\n\nApril 4, 2021\n\nApril 19, 2021\n\nApril 22, 2021\n\nApril 27, 2021\n\nApril 30, 2021\n\nMay 1, 2021\n\nMay 6, 2021\n\nMay 11, 2021\n\nMay 18, 2021\n\nMay 22, 2021\n\nMay 29, 2021\n\nJune 1, 2021\n\nJune 3, 2021\n\nJune 9, 2021\n\nJune 11, 2021\n\nJune 13, 2021\n\nJune 20, 2021\n\nJune 23, 2021\n\nJune 28, 2021\n\nJune 29, 2021\n\nJune 30, 2021\n\nJuly 7, 2021\n\nJuly 7, 2021\n\nJuly 8, 2021\n\nJuly 12, 2021\n\nJuly 15, 2021", "The next Biennial should be in the fall, with a theme that addresses and balances the cycle of life, death, and rebirth. The project also coincides with the opening of a new museum dedicated to the history of art in Abu Dhabi. The institution, which will be inaugurated by a virtual exhibition of works by Katherine and Naima Husband, will focus on the history of art in the United Arab Emirates and feature new work by contemporary artists including Naima Husband and Lucio Fontana.The exhibition will highlight the exhibition of Naima Husband and Katherine Husband’s groundbreaking exhibition “Naima Husband: LIFE, ADAPT, and LOVE” (2015), which premiered at the Eleventh Biennale d'Art Contemporain (ADAC) in Paris last September. The show, which included works by twelve contemporary artists, and tells the story of a woman who changed the course of American art and architecture by becoming the first Arab American artist to win the Abramov Prize. \n\n\n\n\n\nWangechi Mutu and Moseli Nene announced today that they are parting ways with the two-year contract that was set up by the renowned art historian Walter de Maria, the director of", "The next Biennial should be held in 2020. The Whitney Museum of American Art, New York: The institution is planning to hold a revision of its current exhibition “The Body and the World.” Frances Morris, the museum’s director, said: “The Body and the World—and the future of the Biennial—comes into focus in the second half of the exhibition. We are making great strides toward a future where the museum will be viewed as a living organism, and where the museum community will be able to come together with a sense of purpose and inspiration.”\n\nThe Metropolitan Museum of Art (the Met), which announced today that it is currently closed indefinitely due to the Covid-19 pandemic, has released the schedule of the next event. The reopening, which will be on August 29, will be the first in the Metropolitan’s fifteen-year history. Inaugurating the 2020 edition will be a slate of free public performances, including a free preview of a new performance series by artist-in-residence Clementine B. Boyle, titled The Met.I.N. (in honor of the Met’s centennial anniversary), which will unfold over four days", "The next Biennial should take place in 2022. More information about the program, its schedule, and to view a list of participating artists can be found on the Los Angeles County Museum of Art (LACMA) “Next Biennial: Artistic Expression, Politics, and Performance,” which is curated by Scott Lambert and will run across nine venues—the Los Angeles County Museum of Art, the Museum of Contemporary Art Los Angeles, the Museum of Modern Art, New York; the Museum of Contemporary Art San Diego; and the Museum of Contemporary Art Atlanta.The Biennial will be led by Joshua Helmer, chair of the LACMA board of trustees, and William Alston, chair of the LACMA board of directors, and curated by Dr. Michele Bennett, director of the Metropolitan Museum of Art. For the Museum of Contemporary Art Los Angeles, the exhibition will feature work by such artists as Alison Halsey, Carlotta Coragames, Pia Camil, Frank Gehry, Frank Gehry & Partners, Pierre Huyghe, Peter Hujar, Peter Israel, Hans Oberkamm, and Zachary Quinto. For the Met, the exhibition will include work", "The next Biennial should be held in 2020, the publication said, and will be organized as a “prospective, an exploration of the future.” In June, the exhibition marked the first time the exhibition “had been curated by a woman.” The bill of rights, which was drafted by the organisers, states that the exhibition “should be a project of the artist’s life and of his/her relationship with the region’s history and culture.”\n\n\nThe Museum of Fine Arts (MFA) in Houston officially welcomed a new member to its board: its former board president and CEO, Ayesha Tandon, a philanthropist and businessman who has donated generously to the museum over the years. Over the course of her career, Tandon has raised more than $6 million for the institution and organized more than seventy exhibitions.“I’ve been a board member for years and years and years and I’m proud to have supported the MFA,” said Tandon. “I’m honored to have been a board member and to be able to continue to serve as a board member to the MFA and to the thousands of artists, artists-in-", "The next Biennial should be held in 2020.In the next two years, the museum is developing a new series of exhibitions in collaboration with the East London School of Art and the Tate, which will give visitors an opportunity to see the artworks in the galleries, and it is planning to launch a public immersive experience.\n\nThe Los Angeles County Museum of Art (LACMA), the Palomar Institute, and the San Diego Museum of Art (SDMo) are among the California arts institutions that are preparing to welcome visitors to their premises for the first time in early 2020 as part of a new project dubbed Art in the City.Dubbed Art in the City, the eight-city tour will involve museums throughout Los Angeles, San Diego, and San Francisco and will run from September 10 through September 16, 2020. The first leg of the project is already underway, and LACMA expects to host visitors in early December. The second leg, which is slated to start in September 2021, will be more ambitious and will involve the construction of a new exhibition space and the renovation of LACMA’s existing exhibition space. The new exhibition will be titled “Culture and the City,” and will be organized in partnership with local artists and", "The next Biennial should be held at the Museum of Contemporary Art (MoCA), where it will be staged in 2020. Artist-in-Residence and curator Katherina Hauser-Rudolf will serve as the curator of the fourth edition, which will be staged at the Museo del Palacio de Artes Plásticas in Madrid in 2021. The event will also feature a number of exhibitions, including a retrospective of work by Andrew Kreps and a docent and curator’s tour of a newly restored Cenote da Almeida in Lisbon in 2020. \n\n\nThe Metropolitan Museum of Art has named Linda Adams director. Adams comes to the Met from the Museum of Contemporary Art, Los Angeles (MCA), where she has led the institution since 1996. She succeeds Janet Robinson, who retired after eighteen years in February 2019, and will take up the post in March.“The Met has been a transformative, intergenerational institution for dozens of years, and we are all deeply grateful for her leadership and tireless work in forging its story and shaping its vision,” Robinson said. Adams succeeds Evelyn Wirth, who departed in February 2019 to become director of the Chicago Cultural Center; David", "The next Biennial should be held in 2022, the organizers said. The first edition was held in Helsinki in 2009 and would have taken place in December. The organizers withdrew from the 2019 edition after organizers received a flood of inquiries from the United Kingdom and other countries about the newly acquired exhibition space. The organizers have stated that another edition of the exhibition will be held in 2022. Commenting on the decision to cancel the event, the organizers commented: “The current exhibition, ‘Art for People’s Habana’s Minds,’ has been the launchpad for projects by artists and institutions. The 2019 event was, in part, a return to form for the biennial: we invited forty-one artists and institutions, including the South Asian arts and culture incubator Artandus, and the Norwegian artist-run museum Nørrebro, to present ‘My Body’s Life,’ which was a breakthrough exhibition in that it reintroduced the art world to a critical mass of artists already living and working in South Asia, at the same time as they were discussing its importance to their practice.”\n\n\nThe City of Dallas announced today that the two-part, eleven-minute video installation by", "The next Biennial should take place in 2021.\n\n\nThe New York Times reports that the Museum of Modern Art (MoMA) in New York has hired artist and curator Tarek Atoui as its next director. Atoui will be responsible for leading the institution through its next major renovation project, the museum’s new gallery building, which is scheduled to open in 2020.The seventy-six-year-old Atoui has been a key member of MoMA’s curatorial team since its founding in 1976, collaborating with many of its artists, including Frank Gehry, Oolite Group, and Ed Moses. In addition to his work at MoMA, he is a cofounder of the Urban Research Institute, the nonprofit commissioning institution known as the Rijksmuseum, and the New York–based nonprofit the Rijksmuseum Research Consortium (RIPC).“The Rijksmuseum is a critical locus of contemporary art, and Atoui is a key communicator for the museum,” said MoMA director Paul Mpagi Sepuya and CEO Timothy Rub, who were both present when the artist was selected to lead the institution. “He has been a", "The next Biennial should be held in 2020.  [Update: 3 April 2018] The 2021 edition of the Biennial will be held in 2022.  [Update: March 14, 2019] The 2019 edition of the Biennial was canceled, marking the twenty-fifth edition of the exhibition.  [Update: March 13, 2019] The 2020 edition of the Biennial will be held in 2021, but will be open only from March 14 to March 20.  [Update: March 13, 2019] The 2019 edition of the Biennial was canceled, marking the twelfth edition of the exhibition.  [Update: March 9, 2019] The 2019 edition of the Biennial was canceled, marking the thirteenth edition of the exhibition. [Update: March 1, 2019] The 2019 edition of the Biennial was canceled, marking the second edition of the exhibition. The 2019 edition of the Biennial was canceled, marking the thirteenth edition of the exhibition. The 2019 edition of the Biennial was canceled, marking the thirteenth edition of the exhibition. The 2019 edition of the Biennial was canceled, marking the thirteenth edition of the exhibition. The Bi", "The next Biennial should focus on “the biennial as a whole, and the two phases of the exhibition: the inaugural Biennial and the Second Biennial.”The exhibition, titled “The Promise of Life,” will run from March 15 to March 22. The biennial’s inaugural event, “The Promise of Life: A Biennial in Motion” (2015), was held at the Centre Pompidou, Paris, and went on for ten months. The second Biennial, “The Promise of Life: A Biennial in Motion II” (2016), followed the same format as the first, but was held at the Centre Pompidou, with the difference that the exhibition stopped midway through the event.In a statement, the Biennial said: “Starting from the exhibition of ‘Pérez Artístico’ in 1969, the exhibition of ‘The Promise of Life’ in 1995, and of ‘The Secret of Life’ in 1999, the exhibition of the exhibition ‘The Promise of Life: A Biennial in Motion” was staged at the Centre Pompidou, Paris.“This is a unique moment of transition", "The next Biennial should take place in 2021, and the twenty-seventh in 2022. The artist-led exhibition will now return to the Mall of America in 2021, as is customary. While the Mall has yet to announce any other plans regarding the museum’s future, it will continue to host regular exhibitions and events.  For the next twenty-six months, the Biennale will take place at its current space at 1500 Pennsylvania Avenue, in Manhattan, while its permanent exhibition will move to a new site in the fall of 2022. “The Biennale has always been about a community of artists, and the contemporary art world is an art world that is much more inclusive and open than ever,” said artist-in-residence Anna-Marie Polchinski. “I’m so happy that we can finally live up to our word to the artists, and to the city of New York to become a platform for their work and their art.”Since the CNE’s opening in 2000, it has hosted more than eleven hundred exhibitions, including “10,000Drawn,” a group show curated by Rachel Whiteread and curated by Steven Bailey; “The Body", "The next Biennial should be held in March 2020, when the exhibition will be in its third year. The exhibition will be a tribute to the work of the late engineer and designer Bijoya Naidu, who was known for his innovative and pioneering designs that challenged conventional notions of what a computer could be. Naidu’s legacy is being celebrated throughout India, the world, and Australia.“I’m very excited by the prospect of a future exhibition dedicated to Bijoya Naidu that will connect and amplify the work of her contemporaries,” said Michael Schneider, the chair of the museum’s board of trustees. “We expect this will mark the fifth edition of the Naidu Collection, including her work for the 2019–20 biennial and her work for the 2020 biennial, and will introduce new and original work by Gertrude Stein, Edwin Hopper, and Markus Lang, among others.”\n\n\nThe Saatchi Gallery in New York has appointed Annie Pape as its next executive director. Pape comes to the institution from the Getty, where she has served as associate director for the past five years. She succeeds Alejandra Roca, who departed the Getty to", "The next Biennial should take place at the São Paulo Bienal, Brazil, in September 2020. The exhibition will also feature works by twenty-two artists from Peru, including Ângkara, who will demonstrate their involvement in the project in conjunction with a performance by the group “Peru Arte Contemporanea” (PeruArteContemporanea), which will feature performances and works by Otánia Luiz, Wangechi Mutu, Andrea Renzi, and Hildegarde Du Maurier.“ÜCool Academic Desert” is a project led by the Foundation for Arts and Culture and the Museu de Arte Contemporáneo Rio Grande do Sul, a branch of the Brazilian Institute of History. It will be hosted by Jorge Paulo Pereira, who was recently appointed as president of the Brazilian Institute of History and Art, and will take up the theme of the exhibition “New Universes.”The first edition of the exhibition was held at the Museu de Arte Contemporanea Rio Grande do Sul in 2016.\n\n\nAfter a group of artists, collectors, and curators began a campaign", "The next Biennial should take place in 2020. Art Basel Hong Kong, curated by Hong Kong-based artist Hsin-Chien Huang, will be held in 2022. The London-based organization said that it will cooperate with the local authorities to get the construction of the fair on schedule.\n\n\nThe Metropolitan Museum of Art in New York has appointed Sarah Loyer as its next director. She succeeds Daniel H. Weiss, who stepped down in June 2019 after eight years at the helm of the museum, and will take up the post on September 1.“Sarah’s leadership and vision for the Met has been profoundly influential in our transformation into one of the region’s leading cultural organizations, carrying out a number of bold and ambitious initiatives,” Weiss said in a statement. “Her vision and energy were instrumental in convincing Daniel to stay on through the difficult and challenging circumstances of our current predicament. We are grateful for her extraordinary work as we prepare to welcome the Royal Festival of New York’s inaugural Royal Festival of New York.”A scholar of modernism and art from the 1930s who studied at the University of Pennsylvania, Loyer joined the Met alongside Nickolas Parisi, who became the museum’", "The next Biennial should be held in 2021. The selected twenty-four artists will be presented with a prize of $150,000 in support of their work. The theme, “The Days We Live,” will be opposed by a selection of themes by the artists selected for the 2019 exhibition, “The Art of Life,” which opened at the Museum of Modern Art (MoMA) in New York on November 1, 2019. The biennial will be held at the Museum of Modern Art, and will consist of three part exhibitions, the first of which will open on January 22, 2020 and the second of which will open on January 20, 2020. The seventy-fourth Biennial will be held at the Museum of Contemporary Art (MoCA), New York; the seventy-fifth will be at the San Francisco Museum of Modern Art; and the seventy-eighth at the San Diego Museum of Art. “We are thrilled to join forces with the California Institute of Architecture and the San Diego Museum of Art to create an exhibition that honors the major contributions to California made during the Golden Age of California,” said Terry Basel, director of the museum. “This partnership will provide", "The next Biennial should be held in 2022 in the city of Almaty, Kazakhstan; and the organizers are currently evaluating the feasibility of holding the exhibition in the United States. \n\n\nThe Shanghai Biennale has announced that it will award $11 million in grants to artists and cultural organizations working in the exhibition space in Shanghai, the city of the Chinese character for autumn, in the first round of funding that was organized in partnership with the Chinese Academy of Fine Art (CAFA). The Asian Contemporary Art Museum (A’C), the New Museum, and the Art Institute of Shanghai will receive $9 million each; the Art Institute of the Chinese Academy of Fine Art in Beijing, which has been working with the institution since 2014, and the Shanghai Art Museum, Shanghai Art Museum, and the Art Museum of Fine Art will each receive $6 million; and the Art Students League Shanghai will receive $5 million.The inaugural awardees, which included Nianbo Mi, Cui Jie, Kun Li, and Liu Lei, will receive a total of $10 million. The Shanghai Art Museum, the Art Students League, and the Art Students League Shanghai will each receive $2 million. The new", "The next Biennial should take place in London in the spring of 2021, and will be hosted by Tate Britain and will run from April 21 to April 28. \n\n\nThe National Maritime Museum (MMM) in Reykjavík, Iceland, has received a gift of one of the largest works of nineteenth-century Icelandic art. The Royal Academy of Arts (RA) in London gifted the museum a twenty-eight-foot-high gold and white canvas work by Icelandic painter Birgitta Helga Stark, which was installed in the museum’s exhibition space in 2019.“We are incredibly excited by the announcement of the Royal Academy of Arts’ gift of Birgitta Helga Stark’s ‘Elvish Garden,’”” said Mark Divine, the director of RA. “The work will help to define the theme of the 2019 exhibition ‘Danger,’ which explored the long-term impact of climate change.”According to the museum, the painting is a “strategic departure from the usual modernist-ish approach.” In addition, the museum will be able to display the work in a different location near the iconic wooden ship, the Ísaf", "The next Biennial should be held in 2020, alongside the forty-eighth and fifty-ninth editions of the Biennales, which will open in 2021 and 2021, respectively. The project will be led by Imre B. Anton, who has been appointed the head of the biennial. He will work closely with the International Committee for the Arts (ICA), which is comprised of twenty-six international cultural leaders, to develop the theme-driven exhibition that will unfold across two venues: Art and Design, and the Museo de Arte de Madrid, the international institution. The opening of the art and design biennales will take place at the Museo de Arte de Madrid, not Faram’s Art of the Contemporary.The project will present a selection of works by fifty-five international artists in one of the most visited locations in Spain: Madrid’s Casa del Carmen, the historic center founded in 1893 by architect Santiago Calatrava and the original founder of the Poroz de Los Huesos (Grand Hotel). Inaugurating the art and design theme are a selection of pieces by Yoko Ono, Gaby Belfort, and Miguel de la Torre; a", "The next Biennial should be held in 2021. \n\n\nThe Museum of Art (MoA) in New York has hired Jennifer Savitz as its next director. Savitz comes to the museum from the Metropolitan Museum of Art, where she has served as director of communication and engagement for the last five years. During her tenure, she oversaw the museum’s exhibition program, expanded the museum’s collection, and developed partnerships with international and regional partners.“Jennifer's leadership experience and talent for developing new ideas and ideas for our exhibitions and collections speaks to the mission, mission, and breadth of our history as a museum,” said Tony Adams, the museum’s founding director. “Her appointment ensures that MoA is positioned to remain a meaningful cultural destination for generations to come.”Savitz will assume her new post in January 2021. She succeeds Jennifer Levy, who accepted the position on February 8 after serving in the role for twelve months. Levy will continue to serve as director and chief curator of MoA, which she began in the first months of the new century after serving as curator of the inaugural exhibition “In the Company of Women” at the Museum of Modern Art in New York in 2018.\n\n\n", "The next Biennial should be held in 2020, and the exhibition should be up and running by the end of the decade. As a continuation of the theme of this year’s event, the 2019 exhibition “Midnight in Paris: Resurrecting the Body,” was staged on March 23–March 31. The 2019 exhibition featured works by more than sixty artists, including the French avant-garde artist Christophe Maestri, who created an assemblage work titled Light of Day, which is based on the work of the late French surrealist René Magritte, and the Italian painter Luigi Cipolletta, whose portrait of a woman with her arms wrapped around her body is one of the most famous works of Agnes Martin. “The future of art is about to change. We are in the early stages of a new era,” said Ali Shafiq, director of the Sufism Museum in Algiers. “From the past, we will present contemporary artists and their work in a new way. This year’s themes, the art of transformation and the fusion of art and life, are expanding into a new realm, not only in its visual", "The next Biennial should take place in 2022, and will include a selection of works on paper, one of which may be the first work on canvas. The exhibition will also include a compilation of more than one hundred interviews with artists, including Mark di Suvero, Humberto Leon, Paulo Lagnado, and Daria Pape, as well as a short biennial documentary. In the future, the exhibition will focus on the importance of artists in the worldwide visual art scene, and the artists whose work we wish to see.\n\n\nAdvertisement\n\nThe International Center for Photography’s exhibition “Imagination, Photography, and Text,” which opened at the New Museum in New York on September 3, will present the first exhibition devoted exclusively to photography’s avant-garde, pictorial, and text-based works in the United States. The show will include work by a small group of ten artists, including Katharina Friedman, Sarah Ferran, Sotheby’s Mary Cassatt, and Steinhauer & Rijs, among others. It will also present the first solo exhibitions of photography’s contemporary art.“The show will include works by a small group of ten artists", "The next Biennial should take place at San Francisco’s Museum of Modern Art, the Museum of Modern Art, the San José Museum of Art, and the Museum of Modern Art (MoMA), the organizers said. The new venue will be inaugurated in September 2020.The new venue will be divided into five floors, each with a different theme, and will have different exhibition programs. The Tufts University Art Museum in Boston will organize a special exhibition called “The Future Is Present,” while the New Museum in New York will present a “Future Present” exhibition. The Ferrari Museum in Italy will stage a special exhibition devoted to the Italian designer Stefano Làzaretti. The 2018 edition of the Venice Biennale, titled “The Future Is Present,” brought together more than 200 artists and writers from twenty-nine countries and included works by more than seventy-eight artists.\n\n\nThe Museum of Modern Art (MoMA) in New York is suing the city over the destruction of a three-dimensional bronze sculpture by American artist and theorist Robert Irwin that was installed at its location on West Twenty-Second Street in the city since 1999. The lawsuit, filed by the American Civil Liberties Union (ACLU), seeks", "The next Biennial should be completed by the end of the year, and the final chapter of the exhibition will be the year 2045.The exhibition will also feature a selection of photographs by the American photographer Maren C. Bostwick-Rollins, an exhibition of works by artists such as Henri Cartier-Bresson, Donald Judd, and Jane Saxton, and an assortment of works by the British artist Paul Gauguin. In the second part of the exhibition, the public will have the opportunity to view all twenty-six works within a seventy-foot-long exhibition space. The exhibition will take up a theme that has long dogged the Biennial’s creators, namely that of “the possibility of the unselfish.” The exhibit will return to the UMB Art Museum in Madison, Wisconsin, in 2021, and will run for four years.\n\n\nThe Southeast Asian art community is mobilizing to help New York City through a severe financial crisis as it attempts to cope with a surge in COVID-19 cases across the United States. According to Artnet, more than 1,400 people have died from the virus since March, and the number of infections in New York has reached 6,000. Among the leading", "The next Biennial should include a selection of works by artists who have significant contributions to their fields, and should be open to the public. Tacita Dean, the center’s executive director, said: “I truly believe that this exhibition has the potential to be transformative for the museum and for the arts as a whole.”The venue also revealed that it will open a new biennial by artist-in-residence Anna-Sophie Bénédicte Lubin in the museum’s basement. The biennial will be a collaboration between the center and the French artist Léorie Ail-Hadid, who has worked with the Biennial de Lyon for twenty years. The board of trustees confirmed that the new exhibition will be a “proposal of an exhibition of works from the collection of the two.”The new exhibition will be organized around a theme developed in the catalogues of the two artists: the artist-in-residence, the theme of the exhibition, “The Artist and the Biennial,” will be “Feminine” and the biennial’s opening will be celebrated with a public opening ceremony at the Museum of Modern Art (", "The next Biennial should take place in 2020. For the past several years, the Friends of the Victoria and Albert Museum (V&A) have been working with the government to bring the two exhibitions together. In March 2018, the V&A announced that it was planning to stage the first exhibition at the Museum of Contemporary Art San Francisco (MCA SF), the other exhibition at the V&A would take place in 2021. “Both the MCA and the V&A are incredibly vulnerable to the threats posed by the coronavirus,” said MCA SF director Kathryn Edin. “I am hopeful that we will, once the pandemic is behind us, and once we have recovered fully, launch another show at the V&A. It would be a tragedy if this exhibition, and this country’s history of collaboration with the V&A, were to end so abruptly.”\n\n\nLos Angeles’s Koreatown Museum has received a $1 million gift from a group of local arts patrons who are devoted to restoring and revitalizing the cultural community in the city’s Boyle Heights neighborhood. The $750,000 gift was made by American Ballet Theater (ABC), whose Los Angeles branch was", "The next Biennial should take place in the year 2021, in the city of Ljubljana, where I am based. The technique of the exhibition will evolve through the exhibition's exhibition of the work of artists and the biennial’s collection of works by the artists that are participating in the event.\n\n\nOolite Arts Media has revealed that it will present the fifth edition of the Dubai Triennial (D3) in the United Arab Emirates at the newly renovated Dubai Art Museum (DMA). The Triennial will be hosted by the DMA, the Dubai Foundation for an Innovative Economy (DFIA), and the Dubai-based nonprofit Artpact.Dubai Art Week will run from March 17 to March 24, 2020, and will be held at the DMA from March 24 to March 29. The inaugural edition, “Oolite Arts Media: History of Art” (2017), featured twenty-five works by twenty-eight artists, including Billie Tsien, Basil Marawud, and Ava Gartenfeld, and was curated by Lee Casteel.D3 will be inaugurated by two exhibitions, “Kusei Gardiner: The Spatula” (2018)", "The next Biennial should be announced by August 19, 2020.\n\n\nIn a stunning development, the Italian government approved a bill today that would legalize the production and sale of medical marijuana, the first time the country has done so in more than three decades, and has given the green light to a number of other states to follow. The legislation, which clarifies the country’s drug policy, was introduced by the Democratic Party and all of its coalition partners, including the Northern League, Silvio Berlusconi’s Forza Italia, and the Democratic Party, in an attempt to ease the country’s chronic unemployment crisis.The bill, which still needs to be finalized, allows for the cultivation, processing, and distribution of up to twelve marijuana plants in a home, and will regulate how the drug may be used by individuals and organizations. The cultivation and distribution of the drug would be allowed in public spaces, but only within a framework similar to that in place for alcohol. The consumption of marijuana would still be considered a public health emergency.The bill also outlines steps the government will take to reduce the health risks and social disruption caused by the drug, including by educating the public about the dangers of drug use, providing emergency treatment to those in", "The next Biennial should be held in 2022.The announcement of the dissolution of the institution follows the dissolution of the current and previous biennials, held in December and May, respectively. The 2015–16 Biennial was a celebration of the life and work of Afroasiatic composer and theorist Tarka Gebre Akeel; the last of the series, Art and Politics, was a discussion of political and social concerns from the late nineteenth century to the present. The biennial was also nominated for a Golden Lion for best exhibition.\n\n\nThe Museum of Fine Arts (MFA) in Boston is planning to open a new outpost in New York City in 2021. The museum is currently in the process of renovating the former site of the former United States Post Office into a museum that will be partially open to the public in the summer and will have space for an artist residency program.The new location will be on the former site of the Massachusetts Institute of Technology (MIT) in Cambridge, which is slated to be demolished to make way for the construction of a new headquarters for the museum. The work of architect and landscape designer Matthews Davis, who is best known for his urban landscape pieces, such as the Jefferson Memorial, will also be housed in the museum", "The next Biennial should focus on: How do we organize and disseminate creative work within a specific, global context that is inclusive of people from all over the world? This is the second edition of the show, which will be held at the North Island Institute of Art in New York from March 23–March 24, 2020. Since its inception in 1997, the exhibition has presented work by internationally known and underappreciated artists, including Tanya Bonakdar, David Benoit Charmignac, Filippa Cole, Scott Douglas, Anish Kapoor, Laurie Anderson, and John Akomfrah.“The show’s past iterations have been themed around stories of escape or the invasions of the physical world, and have involved depictions of contemporary problems of survival—the biennial’s earliest incarnation featured a costume parade. These narratives are often told through the lens of artists’ personal histories, often reflecting the experiences of marginalized groups. In the most recent iteration, the central theme was the body and its bodily fluids. In addition, the exhibition has featured works by artists who have been at the forefront of moving beyond the iconic and the iconic has been reinterpreted as a living organism, often by inserting the artist’s own", "The next Biennial should focus on the interrelationships between visual art and literature and the history of ideas. The first show, organized as a group, will present works by the curators Carlos Ruiz-Pereira, Kaia Spina, and Peter Wächtler. The second exhibition, scheduled for September 25–September 28, will be divided into twelve sections. The exhibition will include twenty-five works that were selected from the catalogue, including works by Pedro Almodóvar, Zora Neue, and Natalie . The exhibition will also feature two new works, a monochromatic reconstruction of an ancient New York City street scene, and a painting by Abel Gance.The full list of participating artists is as follows:Agnieszka Benesztejn (Poland)Amitai Biro (Sweden)Böderson Brzezinski (Poland)Bertrand Biro (Sweden)Bibi Babar (India)Bibi Das (India)Bibi Dunda (India)Bibi Differ (India)Bibi Furtado (Spain)Bibi Gable (Sweden)Bibi Hirst (Austria)B", "The next Biennial should be held in 2020 and the first in 2022. Previously, the museum has staged the first and third biennial editions of Cultural Research Projects, which run from August to November, and of the revival of Christian art, which was inaugurated in 2013.\n\n\nThe Museum of Contemporary Art (MoCA), Chicago, has appointed Sarah Barlow as its new deputy director. Barlow comes to the museum from the Metropolitan Museum of Art, where she has served as deputy director since 2014. She succeeds Gerald McManus, who retired in May after seventeen years at the helm of the institution.“The museum is thrilled to welcome Sarah to the staff and community of the museum,” said director Miles Hewitt. “Sarah brings an exceptional track record of achievement and vision as a leader in our new organization, and will continue to build our dynamic and ambitious leadership team.”Commenting on her new role, Barlow said: “I’m thrilled to be working with the talented and dedicated staff and board of directors of the museum, which is the largest 22,000-square-foot arts complex in America. I’m especially proud to join the growing list of women in leadership positions", "The next Biennial should be held in 2021. \n\n\nThe Vatican City-based cultural organization the Pontifical Academy for the Arts (P.A.S.) has announced the selection of two new artists for its 2019–20 carnival, Celebrating Life, which will also take place in Rome in 2021. The event will be hosted by the Pontifical Council for Culture, History, and Research (PCCHA) from March 18 to March 23 and will be curated by Fiorella Pindell, director of the Francis Crick Institute for Human Evolution and the Environment, and Dr. Carlo Cipolletta, director of the Museo d’Arte Contemporanea di Roma.The first selection of works for the event was made by Kyla Patridge, who will perform at the event. The work, Hungary: The Sort of Landscape, was developed as part of an exhibition at the museum in 2017 and will be included in the fourth edition of the event, “Feminine,” which will be held in September 2019. The work, which is a reconstruction of the Hungarian landscape, is also part of a project on reconstructing the Hungarian landscape, which is being organized by the P", "The next Biennial should take place in the spring of 2020. \n\n\nThe City of London Museum has dropped the temporary name of the museum in protest of a new anti-terror bill that will curtail the rights of artists and activists in the UK. The move comes after British Prime Minister Boris Johnson promised to give the government the power to put an end to terrorism by expanding the powers of the police and security services. The change is a response to the terror bill, dubbed the Section 215 Counter-Terrorism and Security Act, which was passed by Parliament on Tuesday and is expected to be enacted into law by the end of the year.Under the legislation, the government will be allowed to extend the terms of arrest, extend detentions, and make other arrests that are not specifically banned under Section 217 of the Terrorism Act 2000. The bill also expands the powers of the counterterrorism and security committee, which already has the power to make arrests under Section 313 of the Terrorism Act 2000, and makes it easier for the security and counter-terrorism agencies to carry out searches and seizures.Civil liberties campaigners fear that sections 2 and 3 of the legislation—which were referred to as emergency orders by Johnson—will be used to justify mass arrests. According", "The next Biennial should be held in 2021. The 2020 edition, entitled “Anchors and Alternatives” was held at the Dutch Museum in Amsterdam in September and October.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Daniel H. Weiss as its next chair. Weiss comes to the institution from the Los Angeles County Museum of Art (LACMA), where he has served as a curator of contemporary art since 1997. He succeeds Linda Bilmes, who has served as chair of LACMA’s board of trustees since 2013, and will assume his post in January 2021.“A curator of contemporary art, Daniel will bring a diverse range of expertise to the museum, strengthening our relationship with the world’s great contemporary art globally,” said Peter Sifakis, chair of LACMA’s board of trustees. “I’m thrilled to welcome Daniel to LACMA. He is a talented, committed advocate for the arts and a visionary curator. He’s accomplished both in his career and in his practice, and I’m confident that he will continue to advance the museum’s curatorial mission in a way that is truly visionary.”", "The next Biennial should aim to provide a new and universal lens through which to view the history of the contemporary art world in the minds of a select group of global artists (and perhaps earlier generations also), and should culminate in a short three-day exhibition. “We are immensely grateful for the support of our artists and our collaborators, and especially for the kind words and positive comments which have been so often and clearly eloquent in inspiring us to think about living together in harmony with nature and each other,” said Carolyn Hsu, chair of the trustees of the Biennial. “We hope that our exhibition will inspire others, and inspire them to think about their own futures in relation to the future of the world we live in.”Lars Ekstrand, the chief curator of the biennial and the director of the Brussels Biennial, said: “The exhibition has been a great success in showing the various artists who have made their mark on the city of Brussels and the world for the past thirty years, and it has given the city and the world a great opportunity to see the work of this generation in the Biennial. It has been a joy to present the paintings of the artists of our time and to conceive the", "The next Biennial should focus on a selection of contemporary work by local and international artists in a historical city in the West End.\n\n\nThe MCAF, a Berlin art museum, announced today that it is planning to open an outpost in the city’s Friedrichstadt district, in the capital’s Friedrichstadt-on-Hannover district. Located within a former steelworks in the industrial district of the German capital, the exhibition space will be an extension of the MCAF’s current exhibition, “ÜHermann Hesse: Beyond the Clouds,” which will be staged in the space of the museum.Hesse’s work, which was on display for the first time in the German capital in 2014, was originally exhibited at the MCAF. It was restored and resolicited by the MCAF in 2017 and is currently on view at the museum.The center will also reflect the MCAF’s contemporary aesthetic while incorporating the MCAF’s collection of recent works in its exhibition catalogues. The two-thousand-piece collection has been organized by the MCAF in a triennial format since 2018 and will be opened in 2020.\n\n\nThe US House", "The next Biennial should be called for “cultural resilience,” a term coined by artist Matisse to describe the resilience of artworks, and for a “new political vision of art from the world outside our little world.” \n\n\nThe Spanish Civil War Museum (Museo de Arte Contemporáneo) in Madrid is facing a legal complaint from the families of victims of the 1936–39 conflict. The grievances are that the institution has framed the war crimes laid out in a series of landmark civil suits, and that the suits have not made sufficient inquiry into the circumstances of the victims’ deaths.The lawsuits were filed by the families of Luis Suárez, Juan Manuel Montoya, and Victor Rivera, who were all killed as guerillas during the Spanish Civil War. They claimed that the three men were “victims of a cruel and inhuman war that resulted in the death of thousands of civilians and injured millions more” and that the suits have violated the victims’ rights to a fair trial.When the suits were filed, Spain was embroiled in civil war–related conflicts in Morocco, Morocco, Morocco, and Sierra Leone, with thousands of soldiers and civilians killed, and the country was also facing", "The next Biennial should take place in 2022. The event will be hosted by the Museum of the City of New York.\n\n\nSan Diego Arts & Culture (SDAC) has appointed Nicole Cannon as its next executive director. She succeeds Mary Catherine Oehlen, who stepped down in February 2019 to become the first director of the Los Angeles County Museum of Art (LACMA), and will take up the post on July 1.“Nicole brings a wealth of experience and knowledge to our leadership role in San Diego, and combines a strong vision for the future with a proven track record of delivering on our end,” said SDAC board chair David Henig. “San Diego continues to be a vibrant center for creative life in Southern California. We are excited to see where she takes SDAC in the next six months.”Cannon succeeds Jen Peterson, who led SDAC for five years and is now the first director to helm the San Diego Museum of Art (SDCA), as well as the Los Angeles County Museum of Art and the San Francisco Museum of Modern Art, and will begin in her new role on July 1. During her tenure, she will oversee all aspects of the institution, including the development of programs and exhibitions, the", "The next Biennial should commence in 2020, and will consist of 15–20 artist-designed houses. The exhibition will be inaugurated by a live performance by Haus der Kunst (the American Folk Art Museum) and will run until March 20.The biennial will be curated by Wiradjuri-born architect Fotodopulos. The works will be presented by artists who practice in and around the city and will be exhibited by a select group of curators, led by Fotodopulos, in partnership with the city of Frankfurt. Among the selected artists chosen for the biennial is Adam Hauser-Bode, whose recent exhibition at the museum was one of the first events of its kind. The exhibit “includes a virtual reality work by Indonesian artist Jusuf Kalla and a virtual landscape with an underwater city by A.J. Appiah,” the winner of the $2 million August Fools' Day Prize, which also featured works by Paul Teichol, Peter Wollen, and Kiki Smith.The Biennial will be organized as a platform for collaboration between the city of Frankfurt and the artists represented in the exhibition. The Biennial’s exhibition space will be inaugurated by a live", "The next Biennial should be in January 2021. This year’s event will be held at the Museum of Modern Art, New York. The fifty-first will take place at the National Gallery of Art, Washington, DC.  The biennial will be divided into two parts: “A Symposium,” which will be open to the public from December 15 to January 22, and a “Open House.” The inaugural event, titled “A Symposium,” will be held at Fondazione Biennale in Milan from December 12 to December 17. “This is a moment of great change for us and for the art world, and we are eager to experiment with new and creative ways to think about the exhibition,” said Giulia Michetti, director of the Museo delle Artista di Vallecittà in Milan. “Not only will our exhibition be different from what is on view in Paris, but we will be able to present it in such a way that it is not only a celebration of art, but also a reflection on the ways in which art can operate in difficult situations.”The exhibition will also include a new virtual reality experience, a", "The next Biennial should be held in September 2020 and will be the last of two. Ideas such as the one presented by the artists of the GEO Group, who are currently collaborating with the museum on a series of exhibitions organized around the globe, are being nurtured in the museum for future programs. Igor, who cofounded the MCA with his brother in 1987, is coming to a close as the institution’s director after a ten-year term. The new board will be composed of Jürgen Teller, director of the museum; Markus Watz, head of the gallery; and Hans-Peter Friedrich, chair of the curatorial department.\n\n\nThe Australian Institute of Arts (AI), Sydney, has appointed Emma Brown as its next director. Brown, who will assume her post on April 24, will be responsible for advancing the institution’s work at the intersection of art and design, particularly in the fields of architecture, design, and design-based practice.“The board of trustees and I are deeply honoured to be able to lead the A.I., Sydney, to great success in the next decade,” Brown said. “It will continue to be an exciting and challenging partnership for my", "The next Biennial should aim to resolve the issues that have defined the exhibition since it opened five years ago and is currently working on revising its exhibition program and new programming. In the meantime, the Biennial will continue to host lectures and other programming on its digital platform.“The Museum has been and will continue to be a museum. It is a model for how a museum can operate on a large scale, in a highly localized area, and at a low cost,” said Mark Reinert, the museum’s director. “We welcome the opportunity to work with you and our guests, and to show you the work that has been created by our artists and other scholars in order to help you to understand the ways in which art and artmaking are relevant today.”The full list of participating artists is as follows:Artsakhina, Dushanbe, UzbekistanAgnieszka, ItalyAjaz Ashour, QatarAmina Anwar, IranAmina Aslami, Saudi ArabiaAnwar Al-Awad, EgyptAmina Behbari, Saudi ArabiaAmina Bains, IndiaAmina Biyani, IndiaBakar Biyani, IndiaBara", "The next Biennial should be held at the museum in 2021.  The museum has also announced that it will no longer have any plans to organize an exhibition this year.  The organization’s board of directors voted to end its contract with the company that runs the institution, and it is now planning to look for a new venue for the biennial. The board also voted to terminate the contract of the company that operates the museum, and it will not be renewed. The decision follows a series of setbacks for the museum, which was forced to postpone several exhibitions and has received a cease-fire violation notice from the government of Yemen. The coalition has been bombing the country since March 13.The Houthis, who have been allied with the government of President Abd-Rabbu Mansour Hadi since 2015, took over the capital, Sanaa, in March of 2018, and have since been waging an insurgency against Hadi’s government from their base in the southern province of Marib. The United Nations says the death toll has risen to more than six hundred.Hadi fled to the United Arab Emirates, where he has been confined in a military hospital since March 19, but was not able to return to Yemen to face the Houth", "The next Biennial should be held in 2020 and will include a retrospective of work by the twenty-four artists who have won the $20,000 Jacob Kohn Prize so far this year. The 2019 winner, Kiki Smith, will also receive a retrospective of her work on view until May 2021.\n\n\nThe Los Angeles County Museum of Art (LACMA), the California Institute of Technology (Caltech), and the Museum of Contemporary Art (LA) are collaborating on an exhibition dedicated to the history and preservation of the contemporary art of Eastern, Central, and Northern Asia. The exhibition, “Writings on China’s Silk Road and the Art of Northern Thailand: A Contemporary Study,” will open at the Los Angeles County Museum of Art in 2020 and will run through 2024.The exhibition will include work by ten artists, including Aung San Su, Lai Hsu, Ruanne Sommer, and Wong Wai-Chia, whose essays will explore the role of the Silk Road in the history of modern Chinese art, and will include a selection of works born during the Bronze Age, including a monumental reworking of the tomb of the Kublai Khan in Mayabadi, Iran, in 2019, and a creation of", "The next Biennial should be held in March 2021.  The rest of the twelve-year cycle will consist of a series of presentations that will culminate in the exhibition of the artist’s work in a special exhibition that will take place at the Museum of Modern Art in New York in March 2021.  The selection of the twenty-seven artists selected for the biennial will take place over four weeks and will be announced in the coming months. \n\nThe California Institute of Technology (Caltech) has announced that it will award $11.5 million to thirty-three artists who have recently been selected for its “20,000 Hours Lectures,” an annual event that was founded in 2004 and has given more than 1,500 lectures to students and faculty at the university for free since its inception. “I’ve been involved in the culture for thirty-three years and have been impressed by the students and faculty at Caltech,” said professor Jonathan Bennett, who will receive $9 million in this year’s award cycle. “Their breadth of interests and expertise is broad and their achievement in producing compelling presentations is extraordinary.” “Caltech is facing many challenges right now,", "The next Biennial should begin in 2021, with a design by artist Maren Pfeifer.“The Key to the City,” an exhibition of works by artists and designers that will be held at the MCA, which is currently under construction, is currently on view through October 28. The exhibition is a collaboration between German and Italian artist Giacomo Beccaria. The exhibition will be on view until November 14 and will run until November 19.\n\n\nMCH Group, the Swiss owner of Christie’s, has announced the opening of a new digital platform that will allow buyers and sellers in Switzerland to connect. The platform, called the MCH Network, will provide a platform for art museums, collectors, and dealers to exchange artworks and will be launched in the spring of 2020.“We have been discussing for some years how the MCH Network will prove an effective and flexible way for art museums and collectors to exchange and sell works,” said MCH Group CEO Sebastian Coe. “Today’s announcement marks the beginning of this process, and the beginning of a new chapter. We are 100 percent confident that this new platform, MCH Network, will prove to be an excellent platform for art exchanges", "The next Biennial should take place in 2022 at the site of the former Tamir Rice estate in northern Ferguson, Missouri, and will showcase the work of thirty-seven artists, forming the group Africa Where Art and Politics Meet. The exhibition will include from the African continent, including Nigeria’s Alessyn Njoro, whose series in collaboration with the African Contemporary Art Museum in Kinshasa, Nigeria, has been exhibited at the Oto Art Museum in Kinshasa, Nigeria; the Museum of Contemporary Art in Formos, Kinshasa; and the Museum of Modern Art in London. Namya Nzegbo, the new curator of contemporary art and art history, will also curate the exhibition. The twenty-third Biennial of African Art will be held at the Dusseldorf Art Museum in Germany, the Kunsthalle Basel in Munich, and the Kunsthaus Berlin and will inaugurate “Africa Where Art and Politics Meet.”The twenty-fifth Biennial of African Art will be held at the Museum of Modern Art in London and will mark the fourteenth edition of the Art of the Americas. It will", "The next Biennial should be held in 2021. \n\n\nThe Iceland Pavilion at the Venice Biennale has announced that it will stop accepting new members and members’ membership cards as of March 29. In a letter addressed to the organizers of the event, which was shared with Artnet News, the Icelandic government said that it would suspend all new memberships until the pavilion’s board of directors decides whether it can continue with the exhibition. “We believe that it is the only sustainable and appropriate way forward for the Icelandic Pavilion, and for the show,” Petur Bjarnadóttir, the head of the pavilion’s board, told Artnet News. The board also admitted that the “long-term strategy of the pavilion is being questioned.” The board described the current state of the Icelandic Pavilion as “unacceptable” and “completely untenable.”The letters of protest are further indication of the controversy that surrounds the pavilion. The exhibition, which has drawn some 2.5 million visitors to Iceland each year, has faced widespread criticism for its lack of diversity of artistic practice, its exhibition space for which was closed in April, and its exhibition schedule that", "The next Biennial should not take place until the end of May, and the first edition should be held in June, says Art Basel. As a result, the Paris-based artist Ali Larijani, who was recently awarded the Prix de l'Art et de l'Human, will not be able to take part in the 2020 edition, nor will the biennial’s artistic director, Philippe-Yves Lavigne, who will be replaced by Sadakazu and will continue to work with the exhibition until the end of May.The decision to cancel the events, which were scheduled to run from May 27 to May 30, was made in an attempt to postpone the event until May 31, reports the Art Newspaper. The organizers cited safety concerns related to the pandemic. The postponement was made in an attempt to take as many of the health risks as possible; the event’s May 24 opening was later than expected, and, thus, the biennial’s May 30 opening date.“The cancellation of the 2020 Biennial of Modern Art is a perfect example of the much-needed balance between art and heart,” said Jeremy Deller, who curated the biennial for his own solo exhibition at the", "The next Biennial should be held in 2020. \n\n\n\n\n\nA new exhibition curated by the MCH Group, the parent company of the creative arts organization the Museum of Contemporary Art (MCA), will open at the MCH Group’s New York City headquarters on Monday, March 3. Titled Between The Sun And The Moon, the exhibition will feature works by twenty-six artists, including Gerald Notaro, Aline Smythe, Kiki Smith, and James Turrell, as well as new works by a younger artist, Alex Katz; and five previously unreleased works by Helen Frank. The exhibition is part of MCA’s ongoing commitment to moving the MCA’s collection from one location, its current headquarters, to a new space in Manhattan’s SoHo neighborhood. MCA’s chairman Gilbert & George, who is also chairman of the MCH Group, said: “The new museum will be a vital expansion of the museum’s permanent collection and will offer an unprecedented array of works by younger artists, including a number from China and Vietnam.” While the new venue will also include MCA’s current exhibition program, which has been staged in various locations throughout the", "The next Biennial should be the latest iteration of the museum, opened in 2016, and will present the work of twenty-eight artists. The artist list is as follows: Ramin Ghasemi (Switzerland), Valeria Minova (Italy), Hassan Al Saad (Germany), Shirley Bonilla (Spain), Thea Blum (Germany), Hans-Ulrich Boecker (Germany), Fabian Bode (Germany), Leonardo Bonham (Italy), Pierre Brel (France), Tanja Bruguera (Italy), Pilar Bueno (Spain), Yasmina Carvalho-Carvalho (Spain), Pilar Corina (Spain), Kathrin Como (Mexico), Stéphane Dehaene (France), Etienne Dubois (France), John de Villiers (France), Dario del Vallejo (Mexico), Anna-Sophie Deloukiere (France), Frida De Martino (Italy), Frida De Luca (Italy), Etienne-Maxime Dupuyt (France), Cecilia Flückner (", "The next Biennial should focus on social justice and the effectiveness of international cooperation in favor of social progress. It should also consider the future of the Occupy Wall Street movement and of the United States in a world that is increasingly concerned with climate change, inequality and the corrosive effects of money.”The September 17-October 6 edition of Artforum will now be hosted by Wildingsdagademie, with a new exhibition dedicated to the feminist and LGBTQ-friendly artist Andrea Fraser. The show will include works by more than seventy artists, performers, writers, and activists from twenty-five countries and the United Kingdom. The exhibition’s inaugural exhibition “Rebellion on the Block” is a collaborative project between two artists in the United States and Australia: Sasha Vincent and Jennifer Swallow. Each artist will work individually, or as part of a larger project, and will collaborate with representatives from other artist-run initiatives. The final exhibition will feature works by a group led by Brooklyn-based artist and curator Madeleine Westlake.Westlake first began her political activism in the 1980s through a collaboration with feminist artist Virginia O’Brien, who was also an O’Brien collaborator. She became disillusioned with the parade of"]