["The next Biennial should begin as scheduled at the new Quai d'Orsay soon and is expected to be completed in the third quarter of 2020. According to the festival’s organizers, the opening ceremony, which will be held on August 31, is scheduled for September 4. \n\n\nThe Shogatsu-kai Museum in Tokyo has announced that it is working on drawing the inspiration for its new show, Shogatsu Tengen: Ai no Uta, from a photograph by Yoshitomo Nara, who was one of the first photographers to photograph the city of Nagoya. The exhibition will include fifteen images acquired by Nara through the Metropolitan Museum of Art in New York between 1947 and 1952.Nara was not alone in his quest to capture the city, which is home to some eleven thousand historic buildings and stands as Japan’s third-largest art museum after Nagoya and Hiroshima. In fact, in a 1957 interview with Artforum, Nara said that he had been trying to find a way to incorporate the city into the show since 1995. The result is titled Ai no Uta, or City of Dreams, and will open on September 5.Nara was inspired to create the", "The next Biennial should of course be a rare event (it is currently the only Biennial in the world in which more than thirty artists are represented), but it is nonetheless a major step forward in the ongoing evolution of the Biennial, from a “tomb museum” to an international platform devoted to the art of the twenty-first century.” The exhibit, “On the one hand, and on the other,” represents the twenty-second Biennale in Venice, which will run from March 13–March 20, 2020, and will feature works by artists such as João de Almeida, Sophia Almina, and Olivier Faucher. The show will also focus on the role of social media in the “fight against racism and fascism” and will feature exhibitions dedicated to the work of Sara J. Fox, Christo, and David Saidan, and will mark the first time the show will open in the US.Commenting on the inaugural edition of the Biennale, Sau Sang-gye, director of the Biennale Foundation, said: “The event is a step forward in the evolution of the Biennale as a", "The next Biennial should take place in August 2021, and will be hosted at the newly established Institute for Contemporary Art, Los Angeles. “The new museum will enable us to continue to develop our existing collection and to re-create new works from new artists,” said John L. Levine, the museum’s director and CEO. “This new museum will also provide the foundation for new initiatives that will address the environmental and social issues of our time, as well as the development of new exhibitions and performances.”\n\n\nIn the wake of deadly riots and looting in Paris on November 13, 2017, and a subsequent call for France to take greater action to contain the spread of the deadly virus, French president Emmanuel Macron announced that the country would launch a public health emergency. According to the New York Times, the state of emergency will be in place for three months, and Macron said that the government will be able to borrow $3.5 billion to pay for it.The legislation, which will take effect in January 2021 and is part of a package Macron has called the European Union Framework, provides for a three-month extension to France’s national health emergency plan, as well as a $1.2 billion boost", "The next Biennial should open in 2020.\n\n“It is our duty as a collective to support. To encourage. To shape. To shape by the movement of the crowds,” said Andrew Bennett, lead curator of the Biennial. “It is our responsibility as a society to respond. We must call out the behavior and the practices that perpetuate these injustices. We must call out those who deny and attack the art and artistic practices of our times. We must call out those who exploit our allies and those who exploit our enemies. We must call out those who abuse the power of the platform of art to advance their own ends.”Bennett went on to call for an end to the privatization of museums and an end to the “privatization of culture.” He also advocated for greater protection of the environment, an end to debt, and a reduction of the public debt. He argued that museums should not be funded at all costs, but instead should be given a tax-free, income-free retirement fund that would invest in the institution.“I think that the most urgent thing for institutions now is to choose to invest in the future of their buildings and their collections with the assurance that they are going to remain", "The next Biennial should focus on the history of the art from the largest prehistoric sites in southern China, which are currently under construction and which will take place in 2020. The upcoming edition of the Chinese pavilion will also incorporate the work of emerging and established artists, and will be organized as a joint project between the local and international art communities.\n\n\nYoshihisa Kawamoto, the director of the Hirshhorn Museum and Sculpture Garden in Washington, DC, has announced that he plans to depart the institution in February 2021 to return to Japan to oversee the construction of a new museum. “The Hirshhorn Museum and Sculpture Garden is experiencing significant growth and strengthening,” said Michael Blumenthal, the Hirshhorn’s director and CEO. “In order to develop new and inventive ways to connect audiences with the arts, we are working with the Hirshhorn’s principal curator Tom Parker on a new museum that will connect to the Hirshhorn’s existing collections and programs. Tom will begin designing the museum in April 2020, and the institution will close to the public in March 2021. The museum will be built in partnership with the Hirshhorn’s campus, and will be fully endowed by", "The next Biennial should be released near the end of February, with the first exhibition opening in the summer. The new exhibition will welcome an additional twenty-three artists from the country and will run until April 16.\n\n\nAmerican artist Brandon Graham, who created compositions and works on paper that were created on a large scale in his studio in North Adams, Massachusetts, has died at the age of seventy-nine. Graham, who was born in New York City in 1941, is famous for his large-scale paintings, sculptures, and installations, which often take up narrative and involve characters, locations, and objects that are created in a handmade environment.“As a young artist I always had a hard time finding a medium that wasn’t art,” Graham told the Art Newspaper in 1988. “I’ve been a fan of art since I was a kid. I started painting at eighteen and didn’t know anything about drawing--I did it for money. I tried to find a way to make art that was about drawing and not about drawing. After a while, it was just that, art.” He continued to make art throughout his career, collaborating with Joseph-Paul Rich, Walt Schubert, and George", "The next Biennial should be held by the end of the year; the organizers suggest that the exhibit be relocated. The Biennial of Contemporary Art will schedule its next edition, which will take place in 2021, at the San Francisco Museum of Modern Art (SFMoMA). The 2019 edition, which featured work by thirty-nine artists, was also held at the San Francisco Museum of Modern Art (SFMoMA), and will be held at the San Francisco Museum of Art in 2020. Bailey's team is planning to move the show to a new venue, to be named, in the coming months.\n\n\nThe Hong Kong–based nonprofit exhibition space Paddle8, which has previously staged shows in Bangkok, Manila, and Seoul, announced that it will move to a new location in September. The move will enable the organization to expand its work in Asia in concert with the region’s demand for new media. The arts wing will shift to a new space that will begin hosting programming in mid-September.New work by Paddle8 artists will be added to the show’s online section in September 2020. Previously, the space hosted Hiromi Kawamura’s first solo exhibition at the Venice Biennale in 2021 and", "The next Biennial should begin with a symposium and a solo performance by a group of shortlisted artists from the Prince Albert Museum of Art in London on September 24. “Towards a New Vision of the Future: Art and the Future Politics of Art” was selected by a jury chaired by Keith Poole, director and chief curator of the Museum of Modern Art. The exhibition will be on view at the Prince Albert until April 2020. \n\n\nThe Art Gallery of Ontario (AGO), which is currently closed indefinitely due to the Covid-19 pandemic, has released the updated budget of its provincial arts organization, which features more than sixty galleries, including the Cleveland Institute of Art and the Town of Kitchener. The budget was released on March 26 and represents the $525,000 raised by the organization in the current fiscal year. The organization anticipates continuing its expansion efforts with the funding goal in mind. The budget includes $110 million for a revised conceptualization of the art market; $60 million for the creation of the MA and MA/AS spaces; and $55 million for the creation of the MA Art Gallery and the MA--AS. The organization plans to place", "The next Biennial should be held in 2022 and the project sponsor, the museum, will decide on the year the exhibition will be staged. The institution will also be asked to establish a prize to encourage institutional and individual curators to work together. “The project ‘Das Schwarz ist  \u0097starring Sara Cwynar, Hildegarde Vermeiren, and Joseph and Maximilian Wanke—Museum Center for Contemporary Art in New York, USA—has been one of the project centers of the biennial,” said Louise Silverman, director of the museum and the commission committee. Bibi Liu, the curator of contemporary art at the Museum of Modern Art, said: “The project has been a source of inspiration for me and for my curators and I am grateful that they have been able to organize this exhibition into a unique and meaningful narrative that stretches the boundaries of what we understand as art. The film is an immense undertaking, and the art is a source of comfort and inspiration for many of us.”\n\n\nThe Metropolitan Museum of Art has been awarded a four-year grant from the Metropolitan Museum of Art, the Richard and Mary Eisner Foundation, and the Walton and Walton Children", "The next Biennial should commence in 2021 and will focus on the role of the artist in the contemporary art scene. The theme will be “Art and the Arts: A History,” and the exhibition will be hosted by the Panorama Gallery in London, where it will be presented by curator Sarah Parnell.The next edition of the annual Biennial will take place in the city from March 29 to March 31, 2020. The inaugural exhibition will include original works by fifty artists, including Joan Soderstrom, John Wiester, and Jean-Michel Basquiat. The second edition of the Biennial will take place in the museum’s main building in September 2020.\n\n\nThe Centre Pompidou in Paris is planning to open a new museum dedicated to the French socialist author André Breton in the city’s rue de la Voix in 2021. The institution, which will sit in a former dairy building on the rue de la Voix, will offer visitors a free entry point into the author’s studio. The Centre Pompidou is part of an ambitious project by French politician Emmanuel Macron to modernize France’s infrastructure and reenter the EU. The project,", "The next Biennial should be held in 2021, the artist’s plans to date the event in 2019.\n\n\nThe Museum of Contemporary Art (MoCA), San Francisco, has released the schedule of its 2020 event, “Feminine”\u0097a contemporary art symposium that will focus on the themes of aging, feminism, and artmaking. The exhibition will address issues of beauty and fashion in the modern age and will be presented by Laura Owens, creator of the blog Artforum. The 2019 event, “Girl in the Sea,” was staged at the Museum of Modern Art and features work by Mira Dancy, Billie Tsien, and Alexander Calder. The 2020 event will be held at the San Francisco Museum of Modern Art, and will run from March 3 to March 19.The 2020 event will feature work by more than fifty contemporary artists, including Adrienne Edwards, Irvin Faure, Rinko Isozaki, and Timothy Kendall, as well as an eclectic group of lesser known artists, including Joshua Helmer, Jodi Throckmorton, Suzan-Lori Parks, and Kayode Tamura. The art world influencers will be announced the day of the event and", "The next Biennial should take place in 2021.\n\n\nDubai: The municipality of Dubai awarded a total of $158,000 in grants to independent arts and cultural organizations in the UAE last year, the Arts Council announced on Wednesday. The fund was established to promote the full range of arts and cultural activities in the country.“This year’s winners reflect the diversity and dynamism of the UAE’s cultural scene, and represent some of the most promising emerging and established artists and groups,” said National Arts Council director Hamad Salah, who is also a professor of history at the American University of Sharjah and a fellow at the Institute for Contemporary Art, Los Angeles.The first round of grants, which totaled $60,000, was made in November 2018. The second round of grants, which totaled $150,000, was awarded in June 2019. The third round of grants, which totaled $150,000, was awarded in June 2020. The fourth round of grants, which was announced on April 22, just days after the awards were announced, was awarded in January 2021. There were no specific awards within the category of art, architecture, architecture and design, performance, performance and the visual arts,", "The next Biennial should be held in 2020, and the exhibition should open on the Centro de Cultura y Cultura de Guatemala in 2020.\n\n\nThe Danish-based nonprofit Galleryfortelsem.dk has received a gift of approximately $9 million from the Danish government. The donation, which was made in honor of the institution’s founding in Copenhagen in 1992, comes in the form of a fifty-year lease of an additional twenty-three acres of land in Eriksnes, Denmark. The land was acquired through a special auction held in 2008. Li Ka-Shen is now the founder of the urban planning and urban design project Design Lab Denmark and is working to bring sustainable urban design to the Danish capital. The Danish city of Eriksnes, formerly known as Malmö, acquired the land in 2014, after Li Ka-Shen donated the space to the museum.Li Ka-Shen is also the chairman of the construction and construction management company Zwift’s parent company, the Prudential Group, which owns the construction and architectural firms M&G and Bechtel. In addition to his own company, Li serves as a trustee of the local community center and the local university.Li was selected as", "The next Biennial should be in 2022. The third Biennial will likely be held in 2021.  \n\n\nThe twenty-second edition of the Berlin Biennale, curated by an intergenerational group of South American curators, will travel to the Albert Speyer–designed Rechabend Arena in the city of Hannover from March 10 to March 12. The show will be held in the former brewery and university.The event will be accompanied by a new initiative, 'Posters of Berlin: Six Centuries of Postcards', which will return six hundred postcards from the Biennale to the city of Berlin. The biennial’s curator, Tomasz Klimczyk, said: “The goal of the exhibition is to create an impression of Berlin. The experience of the exhibition, as well as the exhibition itself, is so rich that it touches both our lives and the lives of our guests. It is the intention of the organizers to give you a glimpse into the history of the city and the city’s extraordinary history.”\n\n\nA group of artists, designers, writers, and musicians are demanding that the National Geographic Society take down an online message board run by an undocumented immigrant from Mexico whose", "The next Biennial should take place in the Netherlands in 2020. The ten-nation tour will include Los Angeles, New York, London, Paris, Berlin, and the Palais de Tokyo in Paris. The theme is “The Body and the Life of the Mind,” and will culminate in a performance by the internationally-known artist and the philosopher Mark Blythe, a curator at the National Museum of Art in Washington, DC.Blythe will pose questions about the body, the mind, and the body’s relationship to the environment. He will then transform the physical world through sculptural interventions, phenomenological encounters, and installations. The artist will explore the relationship between language and the body, as well as the relationship between art and physical practice. He will also focus on a convergence of disciplines in the arts, including photography, sculpture, and performance. The National Museum of Art’s installation of a photograph by Josef Alberts on the roof of the Kodak Building in the District of Los Angeles is one of the largest works that was created in the studio.\n\n\nThe Portland Art Museum (PAM) has received a $50,000 donation from the Charles and Lucille King Family Art Collection in support of its", "The next Biennial should be held by Central Park in 2020. Expected to take place in December 2020 and be held in March 2021, the show will consist of more than fifty artists, including Ali Yasin (1925–1977), David F. Wilson (1949–1976), and Nancy Lieberman (1936–1966), among others who have represented the US in international exhibitions.As the largest biennial, the 2020 version of the theme “The Other,” which was inspired by the same year the first exhibition was staged (1924), will consist of as many exhibitions as possible. In addition, the 2020 edition will examine the ways in which people and art in the contemporary world are affected by the pandemic and will feature works by seventy-nine artists; twenty-one artists selected by the organizers for their exhibition at the upcoming edition of the Kunsthalle Basel; and seventy-nine individual works by the artists selected for the 2019 edition.Next year’s edition of the Biennial Berlin will be held at the Museum für Kunststwerk in Cologne. “We are thrilled that the biennial will be in the city of ’s capital, Berlin, and will also be able to stage", "The next Biennial should be held at least ten years from now, as long as the production of the exhibition remains in the public interest. We shall see. Sincerely, Mausoleum and Museum of Art, Württemberg\n\n\nThe Spanish parliament has voted to establish a new fund dedicated to preserving the cultural legacy of the country’s independence-era national artists, and has appointed José Luis Palma, the minister of culture and science and the Minister of Indigenous Relations, as the next president of Spain. The legislation that was passed by the National Assembly on Thursday establishes a $500,000 fund for the preservation of cultural artifacts, and a $1 billion fund for the promotion of Spanish language, literature, and arts in the country.The legislation also establishes a national strategy that must be followed by the government to safeguard cultural heritage, promote the production of Spanish language, literature, and arts, and inform the preservation of the major works of art in Spain. Palma also announced that more than fifty Spanish-language arts organizations will receive funds related to their preservation.The fund will be administered by the Ministry of Culture and the Board of Directors of the Institute of Spanish Language and Literature. The fund will consist of two parts", "The next Biennial should be held in November 2022, and the inaugural event will be held in February 2020.   \n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Aaron Siskind director of the inaugural exhibition, “The Future Is Here,” which will take up the theme of the century, “Future Distorted,” in conjunction with the museum. The exhibition will celebrate the work of contemporary artists, and will present a collection inspired by the work of Ellen Gaido, Daniel O. Clark, and Antony Gormley.“Aaron Siskind is a formidable curator, with an impressive and distinguished curatorial record of more than a decade, and a talent for bringing together disparate artists and audiences,” said Mary E. Neider, chair of the board of trustees. “His recent project work for MFA includes ‘Future Distorted” (2019), an exploration of the relational and virtual worlds created by artists and the anthropological-technological revolutions of the twentieth century.”Siskind will be the first to lead the MFA in twenty years, and will succeed Nancy Spector, who has served as director of the museum since 2007. Prior to joining the", "The next Biennial should include a performance of an original work by an artist selected by the festival. The project is funded by a gift of $10,000 in support of the festival’s academic program. The artist selected for the next edition of the Biennial, Lionel Barès, is a French painter who is best known for her monumental, photographic works (1977’s Notamos, or The Fall of the Sun, 1987, and 1990). “In both cases, the work represents a vast and unexpected world, a world that is at once virtually unknown and embraced,” said Adam Weinberg, chair of the exhibition’s artistic committee.\n\n\nVivian Haraldsson, a Scandinavian curator and educator who established her own arts and crafts museum in Copenhagen in 1980, died on December 15. The cause was cancer. Haraldsson, a professed feminist and anthropologist, was known for her experimentation with new media and new ways of conveying ideas. Known for her broad range of expertise, Haraldsson was a gifted curator of Scandinavian art, including works by artists such as Olafur Eliasson, who was a guest artist at the museum in 2016; Mats", "The next Biennial should be held at least fifteen years after the end of the current edition, and should consider the following themes: the making of art, the evolution of art, the art of art, and the art of art. In our view, the biennial should take into account current and future developments in the art world and arts. “We hope that the next Biennial will be as alive as the first.”\n\n\nThe National Gallery of Art in Washington, DC, has acquired the estate of the late American painter and sculptor David H. Koch from his heirs. The institution announced today that it is the largest gift ever made to the museum. During the museum’s forty-two-year ownership of the Koch estate, it has expanded its collection by more than five hundred works, donated more than three thousand works to the gallery, and organized numerous exhibitions and celebrations.The gift includes paintings by the artist’s daughter, Lori; his son-in-law, William Koch; and their son, Andrew. It also includes works by Charles Darwin in its collection, as well as two works by the late American painter and designer Howard Westcott. The gift includes the late artist’s signature Midwestern style, a series", "The next Biennial should take place in 2025.”\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Joëlle Beneva as its next president and CEO. She succeeds Diana Midgley, who has served as MFA’s president since 2015, and will assume her responsibilities on January 1, 2021.“After a comprehensive search of the MFA’s board and staff, it was unanimously decided that Joëlle’s appointment provides the greatest opportunity for our future success,” said board chair Diana Trussell. “Throughout our deliberations, we have felt that she was the leader who embodies the MFA’s values and has the most positive impact on our world. She has been instrumental in helping us develop new programs that champion the vital contributions of African American artists and artists of color.”During her tenure, she oversaw the museum’s collection of more than 1,500 works, launched the newly-commissioned project “Toccarra/Paul” (toccarra/paul), and worked to expand the museum’s permanent collection through the acquisition of more than 1,500 works; launched the $25 million “", "The next Biennial should be hosted by the Kunsthalle Basel in March 2021.Kunsthalle Basel is currently closed and the Kunsthalle Münster is currently undergoing a major refurbishment. Kunsthalle Münster will reopen in May. The Kunsthalle Leipzig will be inaugurated in March 2020. “At a time when we are witnessing the transformation of our world, the Kunsthalle Leipzig is at the forefront of this process, alongside the rest of the world, in welcoming the digital revolution,” said Kunstverein Berlin leader Franziska Hauser. \n\n\nThe Museum of Modern Art (MoMA) in New York has ended its four-year relationship with the American Civil Liberties Union (ACLU), which had challenged the institution’s immigration policies. The move came as the Museum’s Board of Trustees was poised to approve a $5 billion budget for the 2020–21 fiscal year, but the proposal was postponed due to the ongoing government shutdown.“After careful consideration, we are delighted to announce that we have reached an agreement with the ACLU that will protect the civil liberties of our visitors, staff, and visitors from arrest,", "The next Biennial should begin as planned this autumn, but will be postponed until the spring—it has also been announced that it will be open only in summer. “In the current global climate, we are facing unprecedented challenges,” said Marcel Ljungqvist, director of the Biennale. “Themes reflecting the way we live our lives, and reflecting the way we want to live our lives, are central to the work we are doing.”In a letter addressed to the festival’s organisers, Ljungqvist wrote: “I am very much looking forward to the Biennale in 2020. I am convinced that there is an urgent need for the power of the arts to flourish and shape our future situation. The new openness of our age means that we now have the opportunity to re-examine the world in new ways. The new possibilities opened by the new openness will shape us all in new and unexpected ways. I am optimistic about the possibilities for the art of the future.”The Biennale and the city of Stockholm, which will be located on the central waterfront of the city, will be inaugurated by a series of events, including a special exhibition of works by Icelandic artist", "The next Biennial should be held in 2022. \n\n\nThe Florida Museum of Art (FMA) in St. Petersburg announced today that it has received a gift of more than five hundred works from the New York–based collector and activist Alexandra White, who died in New York in 1994. Titled SOUTH, “The Southern Girls,” the show will receive the authorization of the United States’ Bureau of Land Management (BLM) to display the works at the institution. The gift comes at a pivotal point for the institution, which is currently closed due to the Covid-19 outbreak. “The new partnership between the FMA and the BLM is an exciting development in our ongoing collaborative work to promote public awareness of the biennial’s importance and to expand its mandate,” said Michael J. Ryan, director and CEO of the FMA. The initiative will involve the display of the work on a large scale and will begin with a series of installations, each lasting approximately fifteen minutes, that will culminate with a public art installation. “The Southern Girls” is part of a larger exhibition, “South by South,", "The next Biennial should be held at the Museum of Contemporary Art (MCA) in New York in 2020. The plan is to sort out the museum’s collection and the surrounding area into a permanent collection, that will then be assembled in the museum’s archives, to begin a new fifty-year cycle of exhibitions and public programming. The institution hopes to open a new building, currently under construction, in 2020. The current exhibition space is for an exhibition of works by contemporary artists in a special exhibition organized by curator and curator of contemporary art Michael Aronson, titled “Fashion.” This year’s event will be hosted by Walls’s new director, David Madden, and will run through March 25, 2020. “We are thrilled that the Museum of Contemporary Art (MCA) has chosen me as Museum director,” said David Madden, who most recently served as director of the Rhode Island School of Design. “My background is in the arts, and I have the vision and the ability to see the world through the lens of the arts. I am confident that this year’s MCA will continue to be a strong platform for the Art of the Contemporary", "The next Biennial should be held in the spring of 2021. \n\n\nThe Canadian Museum of Fine Arts (CNA) in Toronto has appointed Sandra Béchard-Baglaine as its next chief executive. Béchard-Baglaine comes to the institution following a ten-year term as director of the Humber Museum of Art, where she has helmed the museum since 2015. During her tenure, she has expanded the institution’s work on international and contemporary themes, introduced new exhibitions and commissions, and introduced new language programs.“Our board of directors are very excited to welcome Sandra to the CNA family,” said board president Ron Pickering. “She will bring years of experience and leadership to the CNA, and to the museum as a whole, as she continues to build upon our curatorial and educational excellence.”Prior to joining the Humber Museum in March 2019, Béchard-Baglaine served as an adjunct scholar-in-residence at the Field Museum of Art in Minneapolis. At the Field, she organized exhibitions such as “Avant-Garde and Ethnography: The Art of Željko Buber” (1987), “", "The next Biennial should focus on the legacy of the pavilion, its design, and the collection, with a particular focus on the collection of American masters. The pavilion will be the focus of a discussion group hosted by Trisha Brown, the director of the Whitney Museum of American Art, and will also serve as a teaching laboratory for artists whose practices are still understudied.“I’m delighted to see the exhibition through to its scheduled opening,” said Marc Glimcher, president and CEO of the Biennial Foundation. “I look forward to continuing with the Biennial’s work as we work to shape the next iteration of the pavilion. We are in the process of consulting with our board of directors, artists, and all of the pavilion’s stakeholders to understand the best ways to move forward, with the hope that all parties will come together to support the remainder of the project.”\n\n\nThe Museum of Fine Arts (MFA) in Boston announced today that it will begin welcoming visitors back from the Covid-19 pandemic by March 13, 2020. In a statement, the museum said: “The changes we’ve made to the architecture of our galleries—and to the", "The next Biennial should be held in the spring of 2022.”The project, titled The Dregs of the World, was organized by the Hong Kong-based artist Yuri Wirth and co-organizers Andrew Lau and Yasmin Ng, and is based on the premise that the world has already become a very large, interconnected, and fragile place. The second game of the trilogy will be titled The Second Spring, and will be based on the premise that the climate is now in a critical moment of transition. The third game, titled The Sixth Elephant, will be based on the theme of the planet and its animals, and will be inspired by early photographs of elephants taken by the artist Joachim Neugroschel in the late 1960s, in which the artist intercuts dream sequences with real life sequences.The exhibition was curated by John Schwalb, director and CEO of the New York–based group The Dregs, along with Tanya and Wang Yong-Jin. The Dregs’ first installation, “In A Mixture of Land and Water,” is one of three books currently on view at the exhibition. The other works are �", "The next Biennial should be held in 2020. According to the Art Newspaper, the next edition of the exhibition will be held at the V&A in London. \n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Kerry King, a curator and the founder of the BAFTA-winning show The Body, as its next director. King will take the helm from Amanda Sharp, who left the institution in December 2019 to head the New York–based nonprofit the Savoy Art Museum.“Kerry has been instrumental in building The Body into a formidable center for contemporary art,” said Kathryn McEnery, the museum’s deputy director and chief curator. “Kerry’s passion and energy are contagious at the MFA, which, thanks to its rigorous curatorial practice, has become a cultural destination for artists, scholars, and visitors from around the world. His expertise and passion for art, and his commitment to supporting the field he created with his wife, Jamie, will help us continue to advance the visionary work of Jamie and Amanda, the MFA’s curators of recently-deceased artists and curators of the future, and to build on our shared mission of presenting the most important", "The next Biennial should be staged in 2020. The museum has already announced plans to build a new Institute of Contemporary Art in Madrid and to open a new art site in the city in 2021. “This is a critical moment for us, for we have the opportunity to redefine the terms of cooperation with the estates of the world’s great masters, and to put an end to the exhibition-driven relationship between art and the Spanish public,” said Guadalupe Rosales, president of the institution. “This is a period of great change, one of the most difficult times of our lives, and I am sure that we will do all we can to help bridge the gap between Spain and the rest of Europe.”\n\n\nThe American sculptor Jack Davis has died at age seventy-nine at his home in Manhattan from complications caused by cancer.Born in New York City in 1941, Davis grew up in a family of sculptors in Pittsburgh, where his father was a carpenter, and his mother a homemaker. In the 1970s, he relocated to New York, where he began his sculptural career as a teacher at the Cooper Union. Her work has been exhibited in numerous international exhibitions and has been collected by the", "The next Biennial should be titled “Take the Fifth: Art and the Future of the Third World” and will be held at the Museum of Modern Art in New York from March 7 to March 11, 2020. The exhibition will feature work by six hundred artists from twenty-six countries and will address issues of the third world, including climate change, art and art history, architecture and design, literature and art, and technology and technology. The full list of participating artists is as follows:Lina Aslaug,  Mali, the Northern Territory, Africa: (Larana Wintour, BGM, France, 2016; Trumpetto, BGM, France, 2018)Ahmad Bishara,  Netherlands: (Adam Brodsky, BAM, Germany, 2017)  Binu Bishara,  Netherlands: (Asir Babu, BAM, Europe, 2018)Bibi Bishara,  Netherlands: (Bibi Bienstock, BAM, Germany, 2018)Natalie Bishara,  Netherlands: (Natalie Bojana, BAM, Germany, 2018)B", "The next Biennial should officially open in 2021. The exhibition will also include a new book written by artist and curator Paul Mpagi Sepuya and the exhibition will be curated by Sebastián Peña Nieto. Šepa has stated that the project will launch with a biennial that focuses on a single theme each year.The project will continue with the biennial model as described in the statement: “In the next edition of Biennial, we'll introduce a new and exciting idea every year. We'll introduce a new motif for each exhibition, and we'll try to present a contemporary biennial to the contemporary reader.”The Biennial will take place at the Museu de Arte de São Paulo (MASP) and will run in a three-year cycle from March 2022 through May 2022. The exhibition will also feature new works by twenty-four South American artists, including María Berrío, Cara Báez, Hélio Pires, Karina Pérez-Villar Naranjo, Jair Torres, and Lourdes Torres.\n\n\nDirector Daniel H. Weiss and artist Marc Soltanovitch have been named the new curators of 'The Public Domain,", "The next Biennial should be held in 2020. \n\nThe Museum of Contemporary Art (MoCA), New York, announced today that it is working with the Museum of Contemporary Art to launch a new digital platform for art and culture and is planning to launch a digital portal on the institution’s website for live events and other museum programming in the coming months. The platform will launch with a free trial period next year.Sophie Ahern, director of the museum, said: “This year, at MoCA, we were honored to serve as the home for Lili Taylor’s 2014 exhibition ‘Breaking Stories,’ a groundbreaking exploration of the radical possibilities of performance art as a vehicle for social change. We were also inspired by the work of artists such as Tove Lo, Christo, and Sara Jermin to create a platform that would engage with the institution’s architecture and design. We are thrilled that the public has embraced the platform and is able to view it at no cost.”\n\n\nThe Los Angeles County Museum of Art (LACMA), which is currently undergoing a $1.5 billion expansion, announced today that Nicholas Neg", "The next Biennial should take place in the fall of 2020. According to the press release, the venue will remain closed until at least the spring of 2021.The biennial’s inaugural exhibition, “Theater of Operations: The Gulf Wars 1991–2011” (2017–2018), will be staged at the Memorial Art Museum in Baltimore from January 26 to March 5. In the show, ninety-eight photographs by fifteen artists, including Masouda Hasan, Sylvestre Mavo, and Thierry Muggeridge, will be presented in chronological order. The collection will be organized in ten galleries, including the Baltimore Museum of Art; the Museum of Fine Arts, Boston; the Museum of Modern Art, New York; the Museum of Contemporary Art, Los Angeles; and the Museum of Contemporary Art, New York. \n\n\nThe Verve Gallery in New York has announced that it is moving the exhibition “The Lives of Other Artists,” which has been on view since November 2017, to a new location in its building on Fifty-Second Street in October. The exhibition was temporarily closed due to Covid-19, but the Verve was forced to break ground on a new venue in April by the American Civil Liberties Union", "The next Biennial should be held in 2020.\n\n\nIn an attempt to mitigate the health risks posed by the coronavirus, the Museum of Contemporary Art (MoCA) in Los Angeles has changed its casual attire policy in an attempt to reduce the number of cases of the virus in the city. Beginning this week, visitors will no longer be required to wear masks or restrict their movements outdoors; instead, they will be allowed to enter the museum through the rear entrance.In an attempt to minimize the number of cases of the virus, the museum has also closed all public events and activities until April 20. As a result, the city is expecting an increase in the number of people infected with the virus. With an estimated 2.5 million people in the United States infected, the coronavirus is one of the world's leading public health threats.The California Public Health Commission announced on April 18 that it was raising the county standard for coronavirus, which is currently three cases and counting in California, from the current two cases and counting in New York City. If the county holds steady at two cases, it will be able to take advantage of the federal government’s $200 million Emergency Order in Council (EOC) for public health emergencies. The E", "The next Biennial should begin in mid-March and conclude with a show of works by five artists in a week, or a combination of works that is scheduled to be staged in April.\n\n\nThe British Council, the government body that represents UK art and design, has released guidelines for the reopening of arts institutions and businesses following the coronavirus pandemic. According to the guidelines, arts institutions should remain closed until March 15, and businesses should remain closed until March 17.The exhibition industry is already reeling from the financial fallout of Covid-19—the coronavirus outbreak has also forced a shutdown of the British Film Institute (BFI), the National Galleries of Scotland, the National Portrait Gallery, the National Galleries of Modern Art, and the Tate. The government has pledged to recoup some of the losses as it works to address the health crisis through rationing ticket prices and other measures.According to the London Review of Books, the British Museum, the Tate, and the National Portrait Gallery are among the institutions that face a financial loss as a result of the coronavirus—the National Portrait Gallery anticipates a deficit of $200 million as it works to recoup some of its operating costs following March 15, while the", "The next Biennial should be held in 2020, to coincide with the centenary of the birth of the revolutionary Russian philosopher Aleksandr Solzhenitsyn. The committee’s chair, Alice Mollison, has previously said that the exhibition should focus on “the immense influence that life has had on our character, our lives, and our consciousness.” The theme of the upcoming exhibition is “The Fifth Element,” an exploration of the nature of art and “the art of making,” a reference to the works of Svetlana Rossy, a German artist who worked in the 1980s and produced works that focus on the material effects of art.\n\n\nThe British artist Odean El Zawahiri, whose massive, almost entirely abstract works challenge and challenge the very notion of what it means to be human, has died at the age of ninety-two. The British Council announced his passing on Tuesday, October 6, after a five-year investigation into his legacy.Born in London in 1930, El Zawahiri immigrated to Paris in the 1950s, where he studied at the Saint-Laurent Academy before moving to the Montreux Art School in the 1960s. He returned", "The next Biennial should take place in the spring of 2022, and the twenty-second in June 2022.The 2019 edition of the event featured the work of thirty-six artists, and the first Annual was held in November.The fifty-ninth iteration of the event will take place in the spring of 2020, and a selection of sixty artworks will be exhibited, including new works by fifteen artists selected by the biennial. The selected artists are: Adriana Bush, Anya Bech, Shona Gardiner, Naveen Jha, Nirvana Cowden, Laura Cioffi, Diana Fusi, Laura Kaye, Lalo Martinez, and Sara Marciano. Last year, the biennial was held in the spring of 2020 and featured Elisa Caro, Paola Casanefa, José Teresa Chamorro, Linda Carolina Cervetto, Lucida De Cervino, Lilian Dallier,  and Astrid Dallier.\n\n\nThe European Union and Turkey signed an agreement on Tuesday that will pave the way for Turkey and the EU to open two of their border", "The next Biennial should be held in the Spring of 2022.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has released the list of twenty-five artists who have participated in the 2017–18 season\u0097the first of the new partnership between the institution and the California Community Foundation (CFC), the nonprofit arts organization that protects and promotes arts and culture across Southern California.Supported by grants from the CFC Foundation and the CFC Foundation for Contemporary Art, twenty-five artists\u0097all of whom were selected by a jury\u0097were chosen by a select number of CFC board members and grantmakers. The list is as follows:Arthur Black, Los Angeles: the artist known for his vast array of work, which explores everything from the cultural and political legacy of African American artists to the American automobile industry and the social, political, and economic dynamics that shape cultural identity. He was selected for one of his works, Hopscotch, 2017, which is currently on display in the exhibition “In the Skin of a Dog,” which runs through March 15. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has received a gift of thirty-six works by six artists\u0097S", "The next Biennial should take place in the spring of 2021. The project was first proposed in the form of a three-dimensional (3-D) sculpture by the German artist Franz John and will be composed of forty-eight panels—each representing a different continent\u0097the artist chose to make the sculptures in three dimensions to reflect the history of his homeland.The sculpture will then be positioned in front of the monumental Meiringen Hall in Vienna. The Biennial will consist of a series of exhibitions, performances, residencies, and conferences organized by the artists, who will collaborate with the artists of the surrounding regions to produce a new narrative through their art.The Biennial will also be accompanied by an exhibition of works that were exhibited at the show in Barcelona last November. The exhibition will consist of three sections: The first section will feature original works by the artists participating in the Biennial for the first time, as well as select works from the 2018 and 2019 editions. The second section will include early work by the artists participating in the Biennial for the first time, as well as works that were exhibited at the museum in 2018. The third section will consist of works that were presented in the exhibition “2015: Exhibition” (2018),", "The next Biennial should take place in the spring of 2020. The event’s theme, “Cognitive Dissonance: How Fiction and Reality Are Intertwined,” will be “Cognitive Dissonance: How Fiction and Reality Are Intertwined.” The event will be held at the Museum of Modern Art, in the heart of New York City.\n\n\nThe Assembly of the Arts (AA) has announced that it has received a donation of eighty-six works from the artist and collector Bruno Latour. The works, which were donated by his London and New York galleries, will be donated to the National Portrait Gallery as part of a project that will capture the imagination and spirit of Latour’s famous series, which was first exhibited at the Museum of Modern Art in 2007.“For decades, Latour’s paintings have been treasured by his large-scale works, used in play, lecture, and documentary, and he has sold more than 140,000 prints of the series to date, and countless lithographs and prints to book publishers, collectors, and museums,” said Andrea Morgan, the AA’s director.The works were donated by the artist after he was presented", "The next Biennial should be held in 2022 and will likely be the last. “The museum is struggling to come to terms with the result,” Dana Adams, a curator at the museum, told the Art Newspaper. “The institution has made significant contributions to the art of the 20th century but has been unable to make them again.”  While the museum has been closed since March 13, its collections and exhibitions have been moved to other locations. The museum will be closed until November 24. For the past six weeks, the museum has been closed to the public, and the public has only had access to part of the exhibition space for the museum. The Art Newspaper reports that the Museum of Modern Art, which is currently preparing to reopen, will also have a short exhibition on art history on November 22.\n\n\nThe Taipei Fine Arts Museum (TFAM) has received $2.5 million from the Taipei Art Museum Art and Design (TAM) to compensate the affected artists whose works are currently on display in the institution’s current exhibition “Lucky Cat” series. The contributions, which were made in January, followed a commission that evaluated the contributions", "The next Biennial should be called the Biennial 2026, in honor of the twenty-third anniversary of the exhibition “W.S. Merwin” (1901–1903), which was organized at the Museum of Modern Art in New York. “The biennial 2020 is an extension of the thirty-sixth,” MUSE’s director, Rachel Bloom, said in a statement. “It will include new exhibitions, performances, concerts, residencies, lectures, workshops, and other programming that address contemporary issues—and address the themes of this century.”Speaking to the New York Times, Bloom said that the new format is designed for people to connect with each other, and will allow the museum to focus on the art of human connection, rather than what the other person is wearing or wearing. “The theme of the exhibition is connected,” she said. “It’s connecting through art.”\n\n\nThe New York Institute of Technology (NYIT), which recently laid off twenty-seven employees after it closed its main campus in April after a work-study program was implemented there, has announced that it plans to begin welcoming visitors from April 29 to May 3, 2020", "The next Biennial should take place in the autumn of 2020.  The 2020 edition will include a selection of works by twenty-six artists who have been selected from a pool of sixty that includes artists from twenty-six States, including California, Arizona, New York, and Texas. The twenty-five most recent works by the artists selected for the exhibition will be presented in a retrospective, which will be held at the Smithsonian American Art Museum in Washington, DC, on October 14–November 28, 2020.  The exhibition will present the visual art of the early twentieth century, including works by Verne Masters, Peter Kropotkin, Montauk, and others. “The exhibition will focus on how artists are recognizing and interpreting their own bodies and the ways in which they are being affected by the current cultural landscape,” said Kaelen M. Turner, the exhibition’s curator.  ADVERTISEMENT Thanks for watching! Visit Website\n\n\nYale University Art Museum (Yale) announced today that Jessica Genova has been named curator of its upcoming exhibition “Presentation: Carol R. Erdman.” The show will highlight the work of twenty-six artists whose works were presented in the", "The next Biennial should be held in 2019\u0097it is currently scheduled for January 26–February 24, 2020. “I am very excited about the forthcoming exhibition ‘Sleeping Beauties: Gender and Art in the Late Soviet Period’ as well as the forthcoming biennial The Floating World,” said Valentina Martovskaya, director of the Biennial of the Muses. Martovskaya added that the organizers are expecting a strong performance by the artists in the exhibition, which will be on view until March 19.Regarding the upcoming exhibition, which will be held at the Museum of Fine Arts, Moscow, the biennial’s director Anna Zavitskaya wrote in a letter to Artforum: “The exhibition ‘Sleeping Beauties’ is a great opportunity to revisit the artistic landscape of the Soviet period through the selected works of the last twenty-five years, which were carefully selected for their elegance of form and their ability to move us. The conceptualization of this exhibition, which was conceived as an experiment in the history of art, is a reflection on the influence of the Cultural Revolution on art history and on our own art history.”\n\n\nThe prestigious Metropolitan Museum of Art", "The next Biennial should be in 2022 and will be inaugurated by a lecture by Anne-Marie Waters, curator of contemporary art at the Smithsonian American Art Museum, at which point the biennial will head to the Museum of Modern Art in New York for a twenty-six-month run. The announcement of the 2020 theme, The Ghost Within, follows Garland Memorial Art Museum curator Tom Garrett’s announcement last fall that he was leaving the institution in March to pursue a new career. Garland was named curator at the Museum of Modern Art in September. He will continue to work at the museum, and its curators, Margot and Michael A. Lewis, in their roles until the end of the museum’s ten-year anniversary.\n\n\nArt historian and curator Alexis Fiskin, who curated the first edition of the Maria Luckridge Foundation’s Art of the Gathering—an annual grant that awarded $7 million to fifty-three artists—has announced that she is stepping down from the helm of the organization. In a statement, Fiskin said: “After twenty-six years at the Maria Luckridge Foundation, I am deeply honored to have helped to define the Maria Luckridge Foundation’s role", "The next Biennial should be held in the Philippine capital city of Manila. The event will be the inaugural edition of the Lingua Foundation for Contemporary Art (LFCCA), which was founded by the Pontifical Academy of Fine Arts (PAFA) in the 1950s. LFCCA is one of the oldest and most prestigious contemporary art centers in the Philippines. \n\n\nThe Las Vegas Art Museum and the Institute of Contemporary Art (VIE) are partnering to bring the worlds of art and design together for the first time in the United States. The partnership, announced on Monday, June 3, will bring together thirty-nine artists whose work was previously displayed at the museum under the title of “Art and Architecture” or “B&A” and will feature the first public exhibitions of new work by the artists in more than thirty years. The collaboration’s inaugural exhibition, “Aerial Logistics” (2018), exceeded expectations. The show, which was curated by Lydia Ferran and is on view through June 22, was criticized by critics for its “premature” opening and the exhibition’s failure to include works by artists whose work is currently on view.The artists chosen", "The next Biennial should take place in 2021 and will be hosted at the Museum in London.\n\n\nThe University of Chicago’s arts department will receive $2 million from the Emanuel Arts and Museum (EAM) in Chicago this fall. The gift includes $1 million for the-first-ever Center for Performance Arts (CPAC), a ten-acre campus that will host fifty-eight performances over the course of three years, and a new version of the Center for Public Art, a primary space for the collection of art and materials from the late nineteenth century to the 1920s.“The Center for Public Art is an ambitious new venture that is poised to redefine the way we think about and experience art and is an example for our city to follow as we build new institutions dedicated to the higher arts in the city,” said Helen Glynn, chair of the university’s board of trustees. “The Center for Performance Arts’s inaugural season will take full advantage of the region’s visual arts landscape\u0097features such as the National Gallery of Art and the Shed in the Chicago River, as well as the Center for Art and the Public\u0097and will include the largest-ever exhibition of work by artists performing", "The next Biennial should take place in the spring of 2020, and the event’s theme, “Memories,” should be revisited in 2020. Art Trustees also expressed their confidence in the city’s economic and cultural development (DCD) department, which they say has made great strides in providing new funding for contemporary art and transforming the city’s historic Art Deco buildings. “We’re convinced that next year will mark the year when all London museums and galleries are given a major boost,” said Marc Glimcher, chair of the biennial’s committee. Glimcher added that the biennial's theme, “Luminosity” is an extension of a broader goal to develop new ways of thinking about the future of London, and how it will be shaped by art, technology, and design in the years to come. Citing the capacity to change the face of the capital, Glimcher said: “We were inspired by the work of the London-based artist Peter Hitchens, whose imaginative and compelling paintings explore the prospect of a new kind of city, one that does not merely exist but rather emerges from and transforms our lives", "The next Biennial should be held in 2021. The next edition, titled “Biodiversity and Capitalism,” will be held at the Center for Contemporary Art in New York in 2022. The institution is currently planning for the construction of a new, expanded, and expanded site in the former Woolworth’s building in the city’s Chelsea neighborhood, dubbed the Biodiversity and Capital, which will include an exhibition space, classrooms for students, a café, and a rooftop terrace.According to the New York Times, the Centre for Contemporary Art, which closed in March 2019, received $75 million from New York’s Metropolitan Museum of Art, which was preparing to open a new branch in the city, and will be funded by a group of investors who include the Chinese artist Cui Yiwu and the Shanghai-based collector Yuji Nara. The Taormina-born socialite, who is also a cofounder of the Chinese-American arts advocacy organization Artists United for China’s Sake, is hoping to raise $150 million for the project.\n\n\nThe Museum of Modern Art (MoMA) in New York has announced that it plans to shutter down indefinitely. According", "The next Biennial should be called “Life and Death: The Masses” and will be held in Berlin in 2022.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it is suspending its spring 2019 exhibition “Telling Stories: Stories at the Museum of Contemporary Art,” which was originally scheduled to run April 3–March 29, 2019. The exhibition, which was also to feature works by the late Brazilian artist Ann-Sophie Leon, will now focus on the evolving institutional relationship between art and memory.The project was inspired by a request from MoCA director Juan Antonio Cervetto for an exhibition that would be “deeply personal and yet simultaneously political.” Cervetto cited Leon’s paintings, sculptures, photography, and videos as examples of the work's long-term political and social impact, as well as his own personal experiences as a survivor of a war-torn country.Dubbed “Telling Stories,” the show will also include a collection of images by the late American artist Marlon James McArthur, the founder of the nonprofit Tracey and Ira (T&I), which provides support for artists across the United States. The exhibition,", "The next Biennial should be a tribute to the art of the American West, including a celebration of the artists who shaped the territory in which they lived as well as the impact their work has on the lives of their communities. Our current exhibition, “Wangechi Mutu: Art in the Time of Rage” (2019), was dedicated to a single artist, Wangechi Mutu. We hope that the American West will continue to inspire us and propel us forward, and that it will inspire future generations to reflect upon its influence on our world.\n\n\nThe Queens Museum in Manhattan has appointed Sholto Ratta as its next director and chief curator. Ratta, who has served as the director of the museum since 2015, succeeds Jennifer Deeming, who departed in the summer of 2019 to become the executive and artistic director of the artistic nonprofit ArtPlace, and will take up the post in January.“As a dedicated curator and educator, I’m excited to work with Sholeo and the team at ArtPlace to further their vision of connecting contemporary art through a public cultural platform,” said Ratta. “I’m also eager to continue my work as a curator collaborating with the larger art community to create new", "The next Biennial should focus on the history of the exhibition, the exhibition, and the exhibition. The third part of the program will address different facets of art history, including the development of conventions, the evolution of the concept of the exhibition, and the evolution of the exhibition format.The fourth and final part of the program should explore the relationships between art and music, with a particular focus on the history of notation.  “The 2012-13 season is an exciting time for the biennial,” said glendon giles, chair of the biennial board. “We are committed to expanding our current exhibition program and looking to the future with an eye toward developing more innovative ways for visitors to experience art. The exhibition program is in a pivotal stage at the time of writing, so we welcome your suggestions and feedback.”The Biennial was established in 1997 by award-winning French experimental artist Georges Apostu and the Philadelphia-based artist-run organization Stop the War. The art installation was created as a response to the Museum of Modern Art’s controversial renovation of the Center Pompidou in Paris. The work, titled Arts of Life, is concerned with the evolution and the possibility of life outside of", "The next Biennial should be held in the autumn of 2020, and the second in the spring of 2021.\n\n\nThe jury that selected the ten artists for the twenty-fourth edition of the Sheffield Biennial has announced its decision: seven artists have been invited to return to the city next year; and the remaining artists are recast as part of a group exhibition, “within the boundaries of Sheffield,” due to open in the United Kingdom, in the autumn of 2021.The artists chosen by the Sheffield Contemporary are Andy Ansell, Anwar Ali, Jaaninka Barrett, Christopher Black, Dario Catellani, Niobe Dzegede, Nusseibeh Yar, and Adam Martin. The exhibition, titled “Wake Up,” will run from January 5–January 7, 2021.“We are thrilled to announce the ten artists who will be returning to Sheffield for the biennial,” said Sheffield City Council leader Janette Rees. “It is an incredibly strong group that have created a unique work, and some of the most celebrated contemporary art of their generation, and we are confident that they will continue to produce truly remarkable artworks.”The artists who have participated in the Sheffield Bi", "The next Biennial should be staged in 2020. The Exhibition Plan, which states that the show is temporarily suspended, will remain in place until the exhibition, which is currently on hiatus due to the Covid-19 pandemic, reopens. \n\nThe Museum of Fine Arts (MFA) in Boston has long advocated for a new, larger museum. The institution recently revealed that it hopes to construct a new museum in the city’s historic Adams-Dart Gallery of Art—an idea that has been in the works for twenty years—and that it plans to move forward with construction in order to avoid a March 25 opening date.MFA director Heather Kamiya called the reopening of the gallery a “game changer.” “A museum is a community’s center, and a museum is vital for a community,” Kamiya said. “The next twenty years will see the Museum of Fine Arts Boston emerge as a vital regional and national cultural destination. Our vision is to become a museum of art for everyone, and to expose our visitors to the rich cultural heritage of the city. It is our mission to connect with our neighbors, to nurture the artistic and cultural life of our city, and to serve as", "The next Biennial should focus on the Global South and the way that this issue affects our daily lives. ”The 2018 exhibition “Pluralism in Design,” curated by Jean-Luc Tenenbaum and Aung-Tam Lee, was held in partnership with the New Anti-War Front in Taipei. The first half of the exhibition consisted of archival research and interviews with 60 contemporary designers, including Shih Chien-Shih (New York), Sadie Coles (New York), Filippa Currier (New York), Mary Cassatt (New York), and Richard Diebenkorn (New York). The second half comprises a collection of forty photographs, objects, drawings, and videos from the Lévy Gorvy collection, which is housed at the Musée d’Art Moderne in Paris, and is organized as a collection of collages, paintings, prints, photographs, prints, and videos.The exhibition is supported by the Musée de Paris, the Musée d’Art Moderne, the Musée d’Art Contemporain de Lyon, the Musée de Provence, the Musée d’Art Métropole, the Musée d’Art", "The next Biennial should open in 2022, the organizers said. Most art institutions are cancelling their 2020 events, but some are preparing for a delay. Banks and other commercial galleries will be able to open as planned next year, but many museums and private collections will not be able to reopen at all.\n\n\nThe museum in the Israeli city of Bnei Brak, which was established in 1949, has been awarded a $15 million ($12 million in 2017) contract by the Ministry of Culture to create a new public space in the city of Beersheba. The contract, which was awarded to the Beersheba Museum of Art in 2017 and comes with an option for another ten years, was awarded to Shimon Shapira, the deputy director of the Beersheba Museum, for the building of the institution’s new facility, which will be located in the city’s historic Beersheba Synagogue, and is being funded through the MCHA program, which provides subsidies to independent arts organizations.The museum will also receive $8 million to improve its existing campus and to build a new one. The construction of the new museum will be funded by the Israeli government through a special grant program, which was launched", "The next Biennial should be held the way it was in 2022. “At this stage, there is not a single thing that can be done about what is going on in the country,” said Günther Linke, president of the German Film Institute. “The Chancellor must decide on how to proceed and what kind of a show will be staged. I hope that the show will be a success, and that the biennial will continue with the same spirit of excitement.”Among the artists whose works will appear in the upcoming biennial are Anais Nin, Ed Ruscha, Jean-Luc Godard, Tina Turner, Catherine O’Leary, and Robert Irwin. The full list of participating artists is as follows:A.K. Bhabha, IndiaC. Kaul, IndiaD.J. Akhtar, IndiaE.J. Ballard, IndiaG.N. Bhabha, IndiaH.V.Bhabha, IndiaI.S.Bhabha, IndiaJ. Bhabha, IndiaK.K. Bhandari, IndiaD.D. Bhandari, IndiaM.K. Bhandari, IndiaN.M. Bhabha", "The next Biennial should take place at the United States Institute of Peace in Washington, DC, in the fall of 2021. The 2019 edition, “The War of the Worlds,” investigated the events of 29 December, the day before the December Day Massacre, which occurred on Saturday, December 26.\n\n\nA new exhibition curated by the Museum of Contemporary Art (MoCA) in Los Angeles, titled “Lifeline: Stories of a Living Museum,” will debut at the institution’s new home in the Beverly Hills neighborhood of Los Angeles on February 23. The first chapter of Lifeline: Stories of a Living Museum, which is being curated by artist and educator Kathleen Iannone and will run for six weeks, will include the life stories of artist-activists like Lupita Borgia, Bob Mahley, and Alice Aycock.The show will also feature a selection of first-person narratives, such as of artist-activists Max Beckmann and Becca Barlow, and exploration of how technology and art can serve as lifelines, how art can be a platform for healing and self-empowerment, and how art can be a tool to fight for social justice.“The decision to create this show was", "The next Biennial should be held during the first half of the year with the exhibition of the work of the most recent exhibition. An article on the works in the exhibition should be published in the first issue of the magazine. In future years the exhibition may be a platform for the biennial to develop in a more collective way. The exhibition of the work of the last exhibition was held in the third quarter of 2016. Artforum has set up an online petition for the biennial to recommence. The petition reads: \"We demand that the Biennial of 'Creativity and Change' be held in the first half of the year, with the exhibition of works in the exhibition of the August 2018 exhibition Biennale de Lyon. Under these circumstances, a statement of intent to the relationship between the Biennial and the Arts and Culture of the Arts of the Dusseldorf and Berlin festivals can be signed. We believe that this is the time and this is the occasion to consider the possibility of a new kind of partnership between the Biennial and the Arts of the Arts of the Dusseldorf and Berlin. We demand that the Biennial of the Arts of the Dusseldorf", "The next Biennial should focus on the history of American art in the west, focusing on the influence of Japanese and European art on early American art, as well as the growth of the field in the twentieth century. The fourth—which will draw from a collection of seventy works by forty-two artists and take place at the Museum of Fine Arts, Boston—will examine the history of American art through a cultural lens that takes into account the changing demographics of the field. The fifth and final—a joint project between the two institutions—will examine the history of American art in a historical, archival, and contemporary viewpoint.“This is a moment of great change for American art, and I cannot wait to see what the new artists and collectors bring to the event,” said Michael W. Davidson, senior curator at the Whitney Museum of American Art.\n\n\nThe museum that houses the remains of seventy-seven works by American painter Paul Gauguin has announced that it is preparing to reopen after a major renovation. The work, which was created near New York and consists of the artist’s famous geometric but bombastic landscapes and their figurative equivalents, the floating cities, was one of the first works that the London-based nonprofit organization the Pavilion", "The next Biennial should take place in the autumn of 2020.\n\n\nThe Bataclan Theater in Paris has welcomed four new artists to its roster: two young, ambitious and formerly unknown artists, Mariko Djurberg and Yaya Saad, respectively, who will represent France at the upcoming edition of the Fifty-Ninth Venice Biennale, which will take place in 2021. The exhibition, which will take place in the city of Lyon, will be organized by the Bataclan in collaboration with the local institution, the beautiful and powerful Salon de la Musée du Cinéma, and will feature work by thirty-six artists, including Nari Ward, Imane-Rose Martinez, Kader Attia, Yaya Saad, and even Mahmoud Ahmadinejad, the former president of Iran.“The week the exhibition opens is amazingly exciting for us,” said Mariko Djurberg, who is based in Los Angeles and currently based in Paris. “We are thrilled that the exhibition will be held at the Bataclan. The selection is so diverse and so beautiful and the collection so fascinating. We are so excited to share it with our audiences in the United States.”The exhibition will be organized in", "The next Biennial should be held in 2022. The 2019 event, which was staged at the Finland–São Paulo State University in São Paulo, Brazil, was held in September.\n\n\nThe British designer, painter, and sculptor Ed Moses has died at the age of ninety-two.Born in London in 1943, Moses—who had studied at the School of the Art Institute of Chicago (SICA) and the University of London—first entered the public eye in the 1960s by staging exhibitions at the London-based nonprofit Tate. He continued to experiment with sculpture and painting as he moved between New York and Paris, which he named after his hometown.In 1983, Moses appeared in the first of two major retrospective exhibitions at the Museum of Modern Art in New York, titled “Ed Moses: Body and Space” and “Ed Moses: The Artist’s Circle. In 1990, he was awarded the prestigious CBE for his services to art by King Farouk of Jordan.In 2010, the Museum of Modern Art in London commissioned Moses’s work to create a significant new chapter in its collection, the first significant public exhibition of his work in the UK. The work, titled “Hannah Jane Smith,”", "The next Biennial should be held in 2020 and its inaugural edition will take place in the Seychelles Islands, which is about one-tenth of the size of France and will offer a number of disciplines, including architecture, dance, photography, painting, and sculpture, in the tropical archipelago. Its organizers say the program will include numerous projects that address the themes of the exhibition.Joëlle A. Poulin, president of the Paris-based biennial organizers, told the Art Newspaper that they had considered a number of possibilities for the 2020 event, but chose to focus on the theme of the artist’s mid-twentieth-century work “Ariadne Bénétié,” which has recently been restored by the Ivorian government. The project was inspired by the exhibition “Ariadne Bénétié: The individual and the collective” (2019), which took place in the Seychelles and was organized by an independent group.The project was supported with funds from the Ivorian Ministry of Culture, the Seychelles Ministry of Culture, and the Ivorian Ministry of Education.\n\n\nThe 60th Venice Biennale, which featured work by more than 160", "The next Biennial should be held in 2021.The event will be hosted by Edvard Munch and Bernd and Elsa Munch, the siblings who created the plastic form of a small house in the Netherlands, known as the Munchhaus, which has branches in Amsterdam, the Netherlands, and the United Kingdom. The Munchhaus is currently closed due to Covid-19 and will reopen in 2021, at the Munchhaus in the Netherlands.<|endoftext|>The Museum of Jewish Heritage (Museum Künstlerhaus) in Berlin is considering whether to close its doors to visitors in the aftermath of the November 23 terrorist attacks in Paris, reports the German daily Süddeutsche Zeitung. According to the report, the Künstlerhaus is debating the closure of the museum in an attempt to protect its collection and staff. In a meeting held on Monday, the Künstlerhaus board met to discuss the possibility of shutting the institution down to prevent the spread of Covid-19, which has caused an outbreak of the virus in several countries around the world, including Israel and the United Kingdom.The board, which also met on Wednesday, voted to suspend admission to visitors from July 31 to August 3 and to draw up", "The next Biennial should be held in 2020. The event will follow the theme “Eternal Life” from the Biennial’s previous edition, “The Engine of Life” in 2019. The 2019 event, titled Art and Life, explored the relationship between life and the environment in the form of water, fire, and the environment itself.\n\n\nThe Metropolitan Museum of Art in New York has received a $30 million donation from the private and academic collections of the Sixto Niño and Emmylou Sánchez. The donation, which is the largest gift made to the museum since it was founded in 1791, comes in response to a request from the Sixto Niño and Emmylou Sánchez Foundation for a new Sixto Niño–Emmelia Sánchez–designed building.The donation includes work by Emmylou and Patrick L. McInerney, a professor at the Yale School of Art; Benjamin G. Harnwell, a scholar at the University of California, Los Angeles; and the Chicago-born architect David Childs, who is a teacher at the School of the Art Institute of Chicago.The museum will design the new building to inaugurate a new chapter in the", "The next Biennial should be held in 2021.<|endoftext|>After the deadly shooting at a Donald Trump rally in Las Vegas last month, Donald Trump tweeted that the country needs to 'restart the deportation process. We cannot survive more deportations. We need smart, compassionate and understanding deportation policies. We must not, under any circumstances, use the deportation of undocumented immigrants as leverage to get our way.”While Trump has called for mass deportations since the 1980s, he has since shifted his rhetoric and said that he would focus on deporting individuals who are in the country illegally. During the 2016 election campaign, Trump vowed to build a wall along the US-Mexico border to keep out undocumented migrants, and he has maintained that he would enforce immigration laws strictly and expeditiously. The rhetoric has not wavered from that of his campaign, and his administration has made little or no progress toward implementing Trump’s campaign promise.On Monday, the Department of Homeland Security announced that it is planning to begin deporting undocumented immigrants within the next three months. The move comes amid a wave of anti-immigration legislation that has swept through Congress since Trump was elected. The legislation, which has been dubbed the American Legislative Initiative, or Amicus Curiae, has been referred to", "The next Biennial should focus on exploring intergenerational connections between Black, Indigenous, and Latinx perspectives on art and the American experience,” said Kenneth Frazier, chair of the board of trustees.The 2019 event will take over the existing venue of one of the city’s oldest civic art institutions, the Blue Ribbon, located at 1423 Fourth Street in Columbus, Ohio. The Blue Ribbon was founded by Columbus native William Bainbridge in 1895 as a way for the city’s rich to connect with the city’s poor through art and social services. Named for its founder, the museum houses twenty galleries and an installation park, and is open year round. “Bainbridge’s vision for the Blue Ribbon made it a central site in Columbus, and it remains a beacon today as the site of the annual Art & Music Festival, the Blue Ribbon Art Walk, and the largest annual collection exhibition, ‘The Arts and the Blue Ribbon.”The institution also hosts three annual exhibitions, which are organized by subject and by artists, and is a landmark in the city’s urban fabric. In addition, the museum is currently home to the collections of the Zorro and Salerno families, of which", "The next Biennial should be held in 2020. \n\n\nThe Carnegie Museum of Art (CMA) in Pittsburgh has received a $10 million donation from the Tom Golisano Collection, which comprises more than 150 paintings from the artist’s Pittsburgh studio. The donation was made during a special exhibition that brought the works together in the museum’s core collection, which currently comprises the Golisano Collection’s masterpieces.“The Tom Golisano Collection is a truly extraordinary collection, rich in history, and driven by a singular vision to create a work from any palette of paint or model,” said Catherine Golisano, the museum’s director. “Through a three-decade partnership with the Golisano family, the CMA has successfully brought together works from nearly every generation of the Pittsburgh art scene and from every region of the state.”Since its inception in 1980, the institution has had a long history of collaborative work, including the recent collaboration between the Golisano brothers and Brady Golisano to form the new Contemporary Art Museum of Pittsburgh (CAMP), which opened in the old Tilden Sculpture Garden in 2008. In addition, the museum has", "The next Biennial should be held at Toronto’s newest city-funded museum, the Toronto Science Center, in 2021. In the meantime, the museum is preparing to introduce an exhibition of engineering works, including a dedicated branch dedicated to composite materials, in the Spring of 2020.Exhibition organizers have told the Art Newspaper that their next exhibition will include work by between twenty and thirty artists, including Daniel Crewe, Olga Diffa, and Mark di Suvero. The exhibit will be titled “A Note on Solidarity:” The show will feature work by fifty artists, including Justin Fritsch, Mattias Näth, and Vicky Rasmussen. The opening of the museum will be on October 29.More artists are currently participating in the exhibition. The closing of the exhibition will take place on November 5. \n\n\nThe MCAF (Museum of Contemporary Art) in Paris, which was forced to cancel a show due to the Covid-19 pandemic in May, is reopening next month following a $125 million facelift that aims to improve accessibility and the public experience. The exhibition “SUPERGIRL,” which was originally slated to run from November 26 to December 28, 2020,", "The next Biennial should take place in the fall of 2020. The theme of the 2018 event was “Becoming an Image: Painting, Photography, and the Making of Art in the Age of Mechanical Reproduction”\u0097the work of Dutch-born artist Altman and a group of fellow artists.The 2019 edition of the event is titled “The Dream of a Modern World.” In honor of Altman’s legacy, the biennial will no longer be called the “Dream of a Modern World.” Instead, it will be called “The Dream of the Image: Painting, Photography, and the Making of Art.” Its theme for this edition will be “The Art of Light”\u0097a reference to the artwork of Pierre-Auguste-Louis-Dali.The biennial is also rethinking the theme of its 2020 edition, which will focus more on the “ultimate design of things,” but will include retrospective presentations of work by artists including Jock, Chantal Crousel, Lin-Manuel Miranda, and Jonathan Weisman. The full list of contributing artists is as follows:Alberto Giacomo, RomeAugusto Cesarco, RomeAugust", "The next Biennial should consist of four part sculptures, each of which will be made from a single lump of amber, along with a narrative by a talented young artist.The works will be presented by the artist and will open on the first day of the Biennial. The first part, titled “The Plough,” will feature woodcuts and drawings by Swami Vivekananda. The second part, titled “The Descent,” will be set in the Himalayas and will be a meditation on spirituality. The third part, titled “The Ape,” will be about a tree and will feature a sculpture by the artist. The fourth part, titled “The End,” will be a meditation on the nature of everything, the universe, and everything in between.“The Biennial is an experiment for him to, in a way, see how his own kind is now living in the Biennial,” said Pradeep Mathew, who curated the exhibition. “From the pictures I saw, it was clear that he was a very strong artist. His art is about life, about passion, about the senses, about the body.”\n\n\nBradley Bechtol,", "The next Biennial should be held at least once a year. Under the current format, the exhibition consists of three films, each of which is a biennial within itself. An adaptation of the novel A Simple Investigation, which is scheduled to open on April 5, 2019, will also be staged.The exhibition, which is organized by the São Paulo-based company Rudolf Rotondo, will inaugurate with a documentary about the Brazilian artist Alÿs de Andrade, who was a pioneer of the cinematic form, and will feature twelve of his films in a series that will be curated by Luta and Angela, the artistic directors of the Museum of Modern Art, New York.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it will allow the Manchester City Council to hold an open-air exhibition to commemorate the city’s 125th anniversary next year. The event will be staged at the museum in 2020 and will be free to the public. “When we created the 2020 edition of Manchester City, we knew that this was a unique opportunity to celebrate the anniversary of the City by engaging with the city’s rich cultural heritage,” said Museum director Monica Minter. “", "The next Biennial should be the seventh, which will be held in September 2021. The artist-run art fairs will cease operations in April and rejoin the rest of the world in June.The exhibition will now be held at the museum from October 21 to November 29. The first exhibition of the new work\u0097a new reconstruction of the work Bruno Pousette/Lincoln Center for the Arts in collaboration with the Los Angeles County Museum of Art\u0097will open on October 23. The following year will see the launch of a new exhibition of work from artist-run public photography fairs in New York and New Jersey, and will include the work of some sixty other artists and collectives. In a statement, the D.C. museum said: “The project of the forthcoming Biennial is extremely significant for the city of Washington, D.C., and the Metropolitan Museum of Art, as it represents the first time the full range of biennial artists will work together to create a single exhibition. We are honored to have received this commission to present a work by the artists who have created the history of our city. We hope that the exhibition will be a milestone for this year’s exhibition, and we hope", "The next Biennial should focus on “the ways in which art and culture communicate and mobilize psychologically and politically.” A final exhibition, “The Incubator,” will open at the Centre Pompidou in Paris on March 27.\n\n\nTaipei’s Contemporary Art Museum (TANM) announced today that the institution will suspend the exhibition “A Simple Life: Stories of a Chinese Family,” which was scheduled to run from March 18 to March 20. The announcement follows a wave of cancellations and refusals of exhibitions and other major events across major cities in China.The exhibition—which toured the country for nearly two months and featured eighty stories about ordinary people living in the capital—was supposed to be one of the first international ventures for the new TANM, which is located in an industrial, shopping district in Taipei City. Launched by legendary artist Ai Weiwei, the exhibition was meant to celebrate the founding of the TIANM in 1970 and the first anniversary of the institution’s founding. “A Simple Life” was also criticized by some local residents who took issue with the celebration of the event, which they considered a celebration of Taiwan’s independence from China,", "The next Biennial should take place in the Negev Hills in the Negev Autonomous Region of Israel in 2021. The works on display in this year’s exhibition will be selected by a group of curators who are affiliated with the Armenian Curators’ Association, which will then present the works to the public for the first time. The exhibition will then be inaugurated by a new exhibition of drawings by the late Armenian sculptor Osegov Turek.“This is a momentous occasion for us, as we begin the work of a new century,” said Armenia’s culture minister, Mark Grushko. The new exhibition will be organized as follows: The first section of the exhibition will feature drawings by Tulku Gharib and Hisham Al Qasimi, who recently curated “The Future of the Museum,” for which the artist was awarded the Memorial Prize in the field of Contemporary Art in 2018. The second section will feature sculptures by the American artist Phoenix Rising, who was also awarded the Presidential Medal of Arts in 2018. The third section will be dedicated to the work of the late British artist Robert Irwin.The opening ceremony of the exhibition will be held at", "The next Biennial should be held in 2021. The next will be held in 2022. In March 2024, the museums will open their last exhibitions on the grounds of the museum. The museum’s galleries will be renovated to provide more meeting rooms for visitors to the museum with a view of the city.The museum will also be transformed. It will include a new exhibition space, an auditorium with new floor plans, and a café. Its courtyard will become a meeting point for visitors to the museum. The museum’s building will also be connected to the city’s transit system and will boast a new public courtyard with a new café. The conservators� plan to construct a new pavilion in the centre of the museum where visitors can sit and relax in a climate-controlled setting.The team hopes the renovations will help people understand the cognitive capacities of the exhibition spaces. The renovation of the city’s Picasso statue, which sits in the centre of the museum, is expected to cost around $50 million. The renovation of the museum’s collection and exhibition halls is expected to cost between $300 and $500 million. The works in the collection are currently on display in the exhibition hall. The museum will also be", "The next Biennial should take place in 2020, with two subsequent editions in 2021 and 2022.\n\n\nThe National Public Art Museum (NPA) in Ottawa is bringing the life-size, ceramic sculptures of the American Civil War, the Great American Eclipse and the Black Lives Matter movement, and other works by contemporary artists to life in a new exhibition. The inaugural exhibition, “Life on the Edge,” will run at the NPA until December 13, 2020 and will feature a work by artist, filmmaker, writer, and activist Ashley Williams, who died last year, and her husband, Brandon Williams, who was a professor of art history and art history at the University of Ottawa. The exhibition will feature eighteen works by forty-three artists, whose work is organized into view-sized dialogues between Williams and various speakers, including artist-activists Deana Lawson and John Alÿs, the former director of the National Gallery of Canada; and the Ohio native and activist John Legend.Born in New York City in 1960, Williams is a native of Cleveland. The Brooklyn native studied at the University of Minnesota, where she met and married her husband, Engstrom, before moving to Ottawa, where she eventually met her children, Brennan, 1,", "The next Biennial should have one of the artists in the exhibition make a live performance, and it should invite a lot of performances, which can inform the exhibition and create a space for the work to be presented, as a way of developing it. By doing this, a lot of the works that had been considered missed are now returning, and a lot of the works that were considered closed are now reopened.” The Biennial will now begin with a retrospective of the work of Pilar Coriander and will run until June 10.\n\n\nThe Royal Academy of Arts (RA) in London has appointed Laura Allebach as its new deputy director, following the departure of Alison Robertson, who was appointed director of the Royal Academy of Arts (RA) in October.Allebach will be responsible for developing policy and its relationship with the RA for the next twelve months, during which time she will assume her responsibilities from May to November.Following a three-month search, Allebach was appointed in November. She succeeds Chris Talbot, who stepped down from the RA in March 2019 to become director of the Scripps National Museum.“Laura’s vision and approach for the RA and for the national museum is truly inspiring and brings a", "The next Biennial should have a programme of artist residencies, residencies of a particular kind, and residencies of a particular kind. The theme should be the Environmental Crisis. The building should be an international arena. We should have a relationship that should be a source of inspiration for us all. The program should aim to provide an ecological perspective in which to think about the environment and to question the relationship between artists and the environment. “I’m excited to work with artists and have them make meaningful contributions to our future as we plan to address the environmental crisis,” said Giacomo Pignatella, director of the Biennial. The program will be presented by Director Maria Balshaw and director Fabrizio Cipolletta.Balshaw, who is also president of the Venice Biennale, said: “The theme of the biennial is Environmental Crisis—a reflection of the global crisis of environmental crisis, that is being aggravated and exacerbated by inefficiencies and the destruction of ecosystems, as we live on in age. This is a theme that is very relevant to me and to the contemporary situation. My vision for the biennial is to create a space for reflection and reflection on the theme of the bi", "The next Biennial should take place in the city’s latest masterpiece, the ex-Beaux-Arts building: the Brouwers-designed Beaux-Arts, a kind of modernist-cum-historical museum that’s been at the center of a fierce city-wide, year-round art campaign since it opened in 1977. With an estimated cost of $70 million, the show—which will be comprised of at least 80 percent museum works—will be located on the former Brouwers-designed site of the Hamburg airfield in the city’s Kreuzberg district and will be inaugurated by artist Rineke Dijkstra’s monumental, semi-abstract installation All In A Day’s Eye. \n\n\nOrganizers of the London Film Festival have announced that the event, which was originally scheduled to run from March 20 to March 22 and was originally dubbed “The Film Festival,” will now be “The Festival of Ideas.” The 2019 edition, which was originally titled “The World As We See It,” will now feature works by seventeen artists from a pool of twenty—including Haywyre, Tulisa Alÿ", "The next Biennial should focus on the politics of the body, with a political/social agenda, and explore how art can address issues of health, social justice, and ecology. The third biennial should be a celebration of women artists, and the roles they play in shaping the community and the world, and the fourth biennial should be an exploration of the relationship between art and the body. Each biennial will include a selection of the works published by a number of the artists featured in the previous biennials. The 2019 edition will be held at the Museum of Fine Arts, Paris.\n\n\nThe Hong Kong-based nonprofit Art Activists Group (AAG) has received a significant $25 million donation from Dutch retailer Woorst & Co., which announced earlier this month that it will no longer support the Hong Kong art scene. The donation comes amid mounting pressure on Hong Kong’s government to respond to the pro-democracy protests in the territory by cutting off mainland businesses that are used for mainland China shipping.Hong Kong’s largest art collector, Matthias Bächli, on Friday confirmed that the overhauled company’s long-standing relationship with the city of Hong Kong, which has been beset by protests from pro", "The next Biennial should be held in 2020, with the first exhibition following in 2022. The renovation of the museum’s building, which is being built by the local government of the adjacent village of Martov, will begin in the first half of 2020, and the construction of the institution’s first exhibition will commence in the second half of the year.The project, in conjunction with the renovation of the museum’s main building, is being led by architect Benjamin Britten. The partnership also involved the establishment of an online database of biennial exhibitions.The museum has introduced new exhibitions in the past two years, including “Adi Panzo: Inversion” (2007) and “Adi Panzo: The Tower of Babel” (2011). The latter exhibition featured a virtual reality installation of the museum’s former collection of European art.\n\n\nThis autumn, the UK will once again see around a hundred exhibitions and events with a total value of more than $1bn delivered by British galleries and curators over the course of a year. This year’s edition of the UK Biennial, titled “Beyond the Frame,” will explore the ways in which artworks and visual art can be", "The next Biennial should be held in 2019 and will have the aim of developing the project within the art-world and within the University. The Tourist Biennial will be held at the Promenade in the City of London in 2021 and will consist of twelve participating artists whose work will be exhibited at the Biennial.\n\nThe Los Angeles County Museum of Art (LACMA) has announced that it will soon host Katsuya Hoshine, a Japanese American artist, curator, and educator who has been described by Smithsonian curator Michiko Nakaya as an \"unshakable force of imagination\" in the field of Asian American art. The artist is represented by Public Gallery in New York.Hoshine, who has lived in Los Angeles since 1988, originally trained in Japan and began his career as a curator at the CCA. In the 1970s, he relocated to New York to pursue his career as an artist. He has taught at the University of California, Los Angeles, the University of California, Los Angeles Art Museum, and the Metropolitan Museum of Art. His work can be found in the collections of the Getty, the Museum of Modern Art, and the Museum of Modern Art.\n\n\nThe J. Paul", "The next Biennial should take place in 2021.\n\n\nAfter the British Prime Minister, Boris Johnson, signed a comprehensive copyright reform bill into law on Thursday, June 12, he tweeted that the UK’s digital economy will now be able to “shake off the cybercrime threat.” The bill, dubbed the Digital Economy Act, creates a new legal regime that will allow UK businesses to withstand the ongoing disruption caused by the coronavirus and allows the government to collect personal information about visitors to the UK through online platforms such as Google and Facebook. The legislation is also a step towards addressing concerns over the surveillance state and the risk that the legislation could be used to justify mass surveillance.While Johnson said the bill is necessary to protect the “digital economy,” he acknowledged that it is “far from perfect.” “We are far from there yet,” he tweeted. “But we are making progress.”The new legislation requires internet service providers (ISPs) to keep customers’ information such as credit card details and website visits to a minimum and requires them to carry out customer searches within 14 days. It also clarifies that personal information can be held for a limited period of time and is based on information", "The next Biennial should be held in 2021, and the ten-year, $50,000 prize should be awarded in 2022.The winners will be chosen by a jury consisting of Sara Z. Miller, a curator and author based in New York; Charles A. Birnbaum, the winner of the $50,000 Biennial Prize in 1981; and two reviewers, Richard J. Cohen and Andy Cohen. The four finalists will be announced in May 2020.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles has appointed Kelly Sue McClintock as its new deputy director and chief curator. McClintock will be responsible for overseeing the curation and presentation of the institution’s annual retrospective, the D.A.R. Gallery Daze, which was staged at the Museum of Contemporary Art (MoCA), Los Angeles, last month.“Kelly Sue has a proven track record of bringing cutting edge, experimental art to market, building relationships with artists, and bringing curatorial practice into an era when it still felt new and experimental,” said museum director Michael Govan. “The D.A.R. Gallery Daze is a great opportunity to see the work of some of the most important artists of our time on", "The next Biennial should be held in 2020, and the original theme will be “The Body, the Soul, and the Future.”The inaugural exhibition, “The Body: A Biennial History,” was staged at the architecture-heavy Centro de Architectureo del Barrio in Madrid in 2013 and celebrated the work of Joan Miró, Marcel Castrucci, and Domenick Cattelan.\n\n\nAccording to the Art Newspaper, the Paris-based nonprofit, which works to defend artists, has received a $1.5 million donation from the estate of Vito Acconci, who organized the 1976 show “Luzia: The Beautiful Death,” which features works by artists such as Pierre Bonnard, Henri Matisse, Rabkin, and Pierre-Auguste Renoir. The gift also includes three DVDs of the show, which was released by the estate in the United States in 2016. The five original artists whose works were included in the show were one-time winner Iván Castro, José de la Fuente, and Paul Gauguin. Their works are set to be included in a retrospective titled “Luzia’s Modern Art: ‘The Divine Feminine,�", "The next Biennial should focus on the history of science fiction, fantasy, and experimental cinema, and should be organized around themes such as 'How Relativity Contributed to Modernism’s Development,” the group wrote.The event will begin with a biennial-wide reading of The Sixth Sense, a late nineteenth-century film that challenges the concept of simultaneity and the paranormal. The film was made by filmmaker Sidney Gish and shows a man in a 1950s laboratory opening a camera to document a series of events that involve a series of events that are taken as a guide to future events. The man in the film is a professor who is experimenting with different camera lenses to see what effects they will have on film.“The Sixth Sense illustrates that a camera can be a powerful instrument for both progress and protest,” said Mark Dykhuis, the executive director of the San Francisco Museum of Modern Art and a cofounder of the San Francisco Science Fiction and Fantasy Society. “It is a celebration of the radical possibilities of photography and the creative process.”\n\n\nThe Oxnard Museum of Art in California is planning to shutter its landmark David-and-Goliath exhibition, “Between the Sun and the Moon,�", "The next Biennial should be held in September.Artforum will have more coverage of the event as it unfolds.\n\n\nThe Jewish Museum in New York has received a gift of more than 2,300 items from the Holocaust survivors who were deported from the United States to Auschwitz in 1944.The exhibition, “We Were Soldiers of the State,” will go on display in the museum, which is currently undergoing a major renovation, at the end of May. The work, which has been restored by renowned Polish artist Warhol, was donated by Josef Klaasen, a Holocaust survivor and cofounder of the American Jewish Museum.Klaasen told the New York Times that the gift was made in memory of the men and women who died at Auschwitz. Klaasen, who was commissioned to create the piece by Warhol after a legal dispute arose over the ownership of an art work, traveled to Auschwitz to meet with the survivors and other concerned individuals in 1944. He was denied entry because he was not a U.S. citizen.Klaasen was able to claim the work as his because he declared that he was a survivor of the Holocaust, an act that has been used by Holocaust survivors to establish their status as legal residents in", "The next Biennial should be held in October 2020, but pre-registration is required. The new site is currently undergoing a $25 million expansion and will boast a new 325,000-square-foot exhibition hall, a 250-seat sculpture garden, and a new senior center. The renovation is the largest project the National Museum of Fine Arts (NMA) has undertaken since it opened in 1964. The project is estimated to cost $65 million. Commenting on the project, James Fadiman, director of the NMA and director of the National Gallery of Art, said: “The new National Museum of Fine Arts will give the National Gallery of Art, Washington, DC, a magnificent new home where we can elevate the art and design of the past and present with the greatest possible degree of innovation. Its construction represents a noble legacy of American art and design, and a vision for the future of the National Museum of Art.”\n\n\nThe Museum of Fine Arts (MA) in Boston has announced that it received a gift of thirty-two statues of women by artist Agnes Martin\u0097all seven of them from a private sale, on November 25, featuring a selection of works by the American Indian artist. The twenty-", "The next Biennial should be held in 2020.\n\n\nThe Museum of the City of New York (MOCO) is preparing to welcome visitors back to the institution in 2021. In a move that will significantly reduce the museum’s footprint and will ultimately save the MOCO more than $300,000 per year in maintenance, the institution will announce on Monday that it is regaining control of its building and will begin the process of selling off the MOCO’s historic space.The new MOCO at 432 Park Avenue will be named the MOCO at Fifty-Six, and will include an adjacent glass-enclosed biennial that will launch on September 25, 2020. Titled “Seasons of the City,” the biennial will present paintings, sculptures, installations, performances, and other works by artists and organizations that have lived and worked in the same building for at least forty-eight hours on the premises in order to simulate how the building would be used by the public during the winter months.“The theme of this year’s MOCO is the alliance between nature and people,” said Michael Govan, director and CEO of MOCO. “The building’", "The next Biennial should be held in 2021. Architects, artists and curators will collaborate again in 2021, with the participation of visitors from all over the world. The first Biennial of Youth will be held in 2022.  The organizers will continue to cooperate with the participating participants to promote tolerance and respect as well as to assist in building and strengthening bonds between artists and the public.”The next edition of the Biennial of Canada, taking place in Calgary, will organize a selection of contemporary works by thirty-seven Canadian artists, including Marlo Pascual, Jobe Symmes, Mira Dancy, and Yvonne Rochat. The 2019 edition, entitled On the Edge of Things, was staged at the Fat Gallery in Toronto and was curated by John Purdy. \n\n\nWells Fargo is planning to move more than one million items stored in its branch in Manhattan into storage units across the country in the next few years. In a filing with the Securities and Exchange Commission (SEC), the bank said it expects to begin moving up to three thousand items per year by 2020, and that the move will save the bank $2.6 billion in interest costs and reduce the likelihood of the company", "The next Biennial should be scheduled for the spring of 2020. The first Biennial was created by Jean-Michel Basquiat in 1967, the same year that the French pointed out that the rectilinear forms of the artist’s portraits were not sustainable. Since the nineteen-seventies, the museum has staged approximately twenty-eight exhibitions. Inaugurating the building, which is in the Saint-Sidney neighborhood of Paris, will be the statue of the artist’s wife, Marguerite, who died in 1944. The work will be accompanied by a new exhibition of work by Jean-Michel Petersen, “From the Nude to the Seductress,” and will open to the public from the museum’s official campus on April 29, 2020. \n\n\n\n\n\n\nJean-Michel Petersen, From the Nude to the Seductress, 2016. Courtesy of the Jean-Michel Petersen Foundation.\n\n\n\n\n\n\nJean-Michel Petersen (1926–2000) was a prolific artist whose work explored the boundaries of art and feminism. His work, which spans the twentieth century, has been collected by the Grand Prix Museum in Paris", "The next Biennial should be kickstarted by the city of New York and will be led by artists and writers Rigny and Travis Whittlesey, who created the award-winning exhibition “Prospect.” Whittlesey said: “Over the past eighteen months, we have been working together to develop a platform for artists to connect with and imagine the future. We are enormously excited to see how the 2017 exhibition will be received by the public, the artists, and the city of New York.”\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Nancy Parrott as its next director. She succeeds Ruth Porat, who was hired as director of the Whitney Museum of American Art in August.“Nancy brings a wealth of experience and knowledge to the role of MoMA’s curator of modern art,” said museum director Christopher Knight. “Her tenure at MoMA has been instrumental in our moving forward in our direction, and I am confident that her future direction will support the mission of the institution.”Previously, Parrott served as curator at large for the Whitney. Her first collaboration with MoMA was in the opening of “Love and Death”", "The next Biennial should take place in 2020 and will be hosted by the Japanese artist Tatsuya Fujii. The institution will be housed in a modernist building in the center of Tokyo and will be supported by a $12 million grant from the Japanese Ministry of Education, Culture, Sports, Science, and Technology (MET). In 2018, the artist-run biennial won the Grand Prix d'Art Contemporain (the French equivalent of the Grand Prix in the United States) and the Prix de l'International in Paris. The exhibition will also feature the work of Bibi Bikram, who is best known for her paintings about everyday life, and Sara Cwynar, whose work explores the themes of women and the body. \n\n\nThe Museum of Fine Arts (MFA) in New York is partnering with the Smithsonian American Art Museum (SAAM) to launch the Smithsonian’s first online-only museum. The institution will host an exhibition of work by fifty artists in the fall of 2021.“After more than twenty years of working together, we’ve come to a critical point in our relationship that sets us apart from many museums. We are confident that this partnership will help us to continue to be", "The next Biennial should be held in 2020. The venue will become the site of a new exhibition, “The Changing Landscape: Modern and Contemporary Art.” \n\n\nThe Museum of Contemporary Art (MoCA) in Downtown Los Angeles has appointed Laura Mulvey as its new executive director. Mulvey comes to the institution from the Los Angeles County Arts and Culture Commission, which oversees the city’s cultural affairs, and will assume her role on January 3. Mulvey succeeds Sue Vielmetter, who was appointed director of the Los Angeles County Museum of Art (LACMA) earlier this month.“Laura is an accomplished and talented curator who has been instrumental in the growth and development of LACMA,” said museum director Jonathon M. Weitzman. “Her work has been featured in several major exhibitions and has been collected by leading museums across the country. She has created a strong and dedicated team to implement her vision for LACMA and I am excited to work with Laura to expand and further integrate our collections and our audiences into the museum’s mission.”Since joining LACMA in 2008, Mulvey has organized numerous exhibitions, including “The Museum of Modern Art: MIM", "The next Biennial should take place in the summer of 2021. Sydney’s Art of the Party is not planning to hold a second edition of the event. “We have always been keen to collaborate with local and international galleries and academic institutions to create new opportunities for artists to engage audiences of all ages,” said Craig Barritt, the museum’s director of curatorial affairs. The institution recently collaborated with the Broad­s Group on a series of exhibitions that attracted more than one hundred galleries from twenty countries. The first show, “Thinking About the Future,” will open at the Sydney Opera House on November 18, 2020 and runs through March 25, 2021. The exhibition will also feature works by collectors Sayyid Qutb and Qutb’s son, Ismail Qutb.\n\n\nThe Institute of Contemporary Art (ICA) in Prague has appointed Livia Šernág as its next president. Šernág replaces Claudia Bohmann, who was elected in September and who has served in her role for the past six months. She succeeds László Báez, who has served in the role since January 2019. ", "The next Biennial should be held in 2020. \n\n\nThe Metropolitan Museum of Art (MoMA) in New York has appointed Mary Hass, a curator and artistic director of the late New York art-world collective the Alley Cats, as its next director and CEO. Hass previously served as the art-world’s senior curator at the intersection of performance and performance-art in New York City.“Mary’s experience and creativity in bringing together artists, musicians, writers, and artists’ practices to engage audiences across the globe has rightfully placed her in a position to create new and innovative ways for artists to collaborate and collaborate with museums,” said David Samson, the museum’s board president. “Her vision and enthusiasm for contemporary American art and art history make her the ideal person to lead MoMA through this challenging and transformative time.”Prior to joining the Alley Cats in 2001, Hass served as a curator at the New Museum in New York. During her tenure at the museum, she developed and curated performances by artists such as John Akomfrah, Edward Salty, and Bridget Riley; toured the institution’s collection, including works by John Michael Kist, Anna Atkins, and Patty Griffin;", "The next Biennial should be held sometime in 2021. The event will be hosted by the same architect, the same team, and the same institution as the former KASN-AM, but will be led by a different curator.\n\n\nThe Metropolitan Museum of Art in New York has revealed that it plans to open its first permanent outpost in Taiwan in 2020. The institution has selected Fudan University as the site for the outpost, which will be located in the campus of the university in Fudan, which is about an hour from downtown New York.The institution will establish a new exhibition space, the Fudan Contemporary Art Museum (FEM), to be run by the university, in collaboration with the Fudan Art Museum. The FEM will be a space that will showcase contemporary art from the University of New York’s collections. The museum will maintain its current location in the building, which will be located in a former auto assembly plant, on the third floor of the university.“This is an unprecedented moment for the art world in China,” said Roberta Smith, the director of the FEM. “Fudan University is an ideal site for a new gallery, a new exhibition, a new exhibition. It", "The next Biennial should be held in 2020.  Posted by Bruce Pender at March 12, 2018 03:51 PM\n\n\nSwiss artist Helga Dockreich, who often uses insect-like, color-saturated geometric abstractions to tell the story of her native Switzerland, has died at age seventy-eight. The Italy-born, Switzerland-based contemporary artist was a prolific creator of sculptures and works that are typically constructed from multiple materials, including resin and metal.Born in Zurich in 1920, Dockreich studied art at the University of Basel, then at the Zurich Academy of Fine Arts, where she met her husband, Helge, and moved to Basel for a number of years, then to the city of Lübeck, then Lübeck again, then Lübeck again, then Lübeck again, then Lübeck again, then Lübeck again, then Lübeck again, then Lübeck again, then Lübeck again, then Lübeck again, and finally Lübeck once more. Since the 1950s, Dockreich had been making works that combine wood, fabric, and other materials in her artistic quest to tell the story of the Swiss landscape.Among her recent", "The next Biennial should take place at the São Paulo Archaeologia in Brazil, with a presentation of new works from the exhibition “The Process of Architecture,” which was organized by the Museum of Modern Art and curated by Manuela da Torré, in 2019. The 2020 edition of the biennial, titled “Art and the Body,” will be held at the Museu de Arte de São Paulo, and will include works by artists such as Renata De Sousa, João de Gonçalves, and Edoardo Poggio, among others. The 2020 event will also include a presentation of two works by the Brazilian archaeologist Ada C.P. Oliveira, a leading proponent of the practice of contemporary art in Brazil. The work, “Nia ou Nia: Pastaârias” (Nia and the World), 2019, is a series of drawings by Oliveira, who was a cofounder of the Proust-like Art Group, for whom she worked until the late 1990s.\n\n\nThe third edition of the Shanghai Biennale will resume this Sunday, May 24, with works by thirty-nine artists from across China,", "The next Biennial should be in 2020, and the first will be in 2024. \n\nThe Museum of Modern Art (MoMA) in New York City announced today that it is creating two new master plans, both of which will be based on a $150 million gift made by Vito Acconci in 1966. The gift was made to the institution in exchange for a fifty-six-foot-long, seven-story replica of the now-shuttered Berthold Meyer–designed Cooper-Hewitt, which opened in 1898 in New York City. The gift also included a Bentley Continental GT coupe, a Bentley Continental GT convertible, a Bentley Continental GT, and a Bentley Continental GTB.The gift was made in the spring of 1966, the same year that MoMA’s inaugural exhibition “Made in LA” opened. The show featured work by forty artists, including Richard Diebenkorn, Joan Jonas, and Lucille Ball; was organized by Victor Castro; and featured performances by the likes of John Waters, Bob Dylan, and Margo Price.“I’ve been a fan of MoMA for forty years now, and I’m thrilled to work with this amazing team to make their vision", "The next Biennial should take place in 2023. Klein also wants to raise awareness of the plight of refugees and migrants. She said: “We have created a refugee crisis in Europe, and we must be honest with ourselves and with our partners about the legacy of European immigration. We must create an environment of mutual respect and solidarity that will allow for the common good of Europe and for the world.”\n\n\nThe Museum of the American West in Northern California is planning to move the exhibition “The Way Modern Art Was Made: From the Pioneers to the Present,” “The Future of Art” to a new home on the same campus as the institution. The move is part of the ongoing project to restore and reopen the museum, which has been closed since it was forced to relocate after the collapse of the Twin Towers in New York on September 11, 2001, and is scheduled to wrap up by June 2022.The show, which focuses on the history of the art and design in America, has traveled to twenty-eight countries and three continents, and will now be presented as an exhibition in the West Coast’s Pacific Standard Time. The first leg of the project—“The Future of Art: Mexico’", "The next Biennial should take place at the Museum of Fine Arts, San Francisco, in the fall of 2021. “We are deeply grateful to the museum and its staff for their enthusiastic support of this project,” said Rachel Lehmann, executive director of the Art Institute of Chicago. “We are especially honored to have these talented curators at our disposal in the form of Laura, Lisa, Rachel, Pierre, and Rachel. This is an important step for the museum because we can use their expertise and expertise to explore the work of feminist and queer artists in a way that is not possible without their expertise.”\n\n\nThe Clay Tate’s new site-specific museum has received a $50,000 donation from the Charles and Lucille King Family Charitable Foundation. The donation, which came in lieu of a donation from the couple themselves, also came in the form of a gift of $10 million, the equivalent of approximately eight years of the museum’s planned $100 million expansion.Located on the grounds of the Clay Art Museum, which is currently undergoing a $75 million expansion, the new museum will be named the Clay Art Museum Collection, after King and Clay. The $10 million gift will fund the commission of a", "The next Biennial should focus on human rights and civil society issues, including immigration, climate change, and territorial conflict,” said Choi, who is serving a three-year sentence for inciting terrorism and is set to be released in December 2020.Choi, who was arrested in March 2018, was convicted of inciting terrorism in November 2019, but was acquitted of the crime in December 2019.In June 2020, the Seoul High Court of Appeals overturned the conviction, ruling that the August 20, 2019 incident in which Choi pushed a woman to the ground and kicked her in the groin was an “unlawful act.” That decision was upheld by Seoul District Court of Criminal Affairs in December.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles: Originally scheduled for completion in 2022, the museum has been pushed back to 2021. The announcement was made on December 18, following a lengthy public comment period, and was made by director Daniel H. Weiss. The date was chosen due to its anticipated expansion, which is expected to significantly increase the museum’s footprint. The announcement marked the first time the museum has been planned since 1993.In a statement, MoCA said the decision was made due to the impact of the coron", "The next Biennial should be held at the Museum of the African Diaspora in San Francisco in 2021.   Artist Statement: The exhibition should offer a critical lens through which to consider concepts of art history, the social, political, and economic conditions in which art works are made, and how they are reproduced. The exhibition should highlight the diversity of visual and sculptural work and offer a way of thinking about art history through the lens of contemporary people and the exhibition. The show should also reflect our global history by reflecting on the idea of the past, exploring the ways that art history has reconceived the history of our world and the way that history is made. \n\n\nThe Egyptian Museum of Art (EMMA) in Cairo announced today that it will reopen on January 21, 2021 following the completion of a comprehensive renovation project that was carried out by experts from Egypt, France, and Italy. The renovation project, which is being led by Egypt’s Ministry of Culture, included the construction of a new exhibition space and an expanded collection, as well as the restoration of the museum’s original building and the expansion of its grounds.The institution will inaugurate the new exhibition space with “Emma: The Story of the Egyptian Women”", "The next Biennial should be held in 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it is launching a new $1 million endowment to support critical programs and initiatives at the museum. The initiative, launched in partnership with the Long Beach Museum of Art, aims to provide funding for the construction of two new galleries, the first for the collection of contemporary art, and the second for the exhibition and educational program of the museum. The new funds will help the museum ensure that it has the resources to carry out the complex design and build the new spaces.The design for the new galleries, which will be located on the current platform of the museum, was selected by architect Peter W. Hermann, who served as a consultant for the two buildings for about five weeks, before the Los Angeles County Museum of Art in collaboration with Hermann & Bartos, the firm that designed the existing galleries, in a competition that was held in November 2019. The winning proposal was selected by a jury comprising Bartos, Hermann, Peter Segovia, and architect John J. McInerney of Koons & Partners, which was led by designer Alighiero Galan. The winner of the award will be announced in the", "The next Biennial should kick off with a presentation of a selection of works by artists in the exhibition. The theme of the exhibition should be “Mariana Biennale: The Presentation.” The biennial’s first show, “Sufi,” staged by German artist Wolfgang Kohler, will be held at the Berlin Museum of Art in October.\n\n\nThe French Ministry of Culture and the Arcimbold Museum in Naples, Italy, have decided to build a new 250-year-old monument commemorating the Jews who were deported to the Nazis’ death camps. The ancient stone monument will be dedicated to the “victims of the campaign of terror instituted by the State against the Jewish people during the Second World War” and will be located in the city of Tagliamento. Construction is scheduled to start in 2021 and will last for twenty years.The new monument was first unveiled in 2017 by French Prime Minister Édouard Philippe and his wife, Brigitte. It was completed in the weeks leading up to the centenary of the deportation of around sixty thousand Jews to Auschwitz. The trip was part of the campaign to commemorate the victims of the Nazi regime and to push for greater international cooperation in the", "The next Biennial should be held at least ten years after the expositions. In any event, it must be following the spirit of the existing themes, which are: science fiction, fantasy, and horror, and must be a reflection of the time, as a whole, and not just of a particular period.Bailey-Sutherland is asking for more than $3 million to pay for the construction of an eighteen-acre, glass-enclosed exhibition space on the grounds of the museum, which will be inaugurated by an exhibition of the artist’s work, “Theater of Operations,” in May 2020. The space will house numerous works by the artist, including his famous “closed world” series, “the story of humanity” (2015–16), and “I, O, and When I Die” (2017), a bold reimagining of an urban legend.“We are committed to working with LEO artists to design an exhibition that reflects the spirit of the existing exhibition and writes a new narrative about the future,” said Bailey-Sutherland director Susan Carroll. “With the museum’s current collection, we have the opportunity to present the work of some of", "The next Biennial should take place in 2022.\n\n— Posted by Alexander Reed Kelly.  (Thanks to Adam for the link)  [Update: March 3, 2022] The 2019-20 season will move to February once again, and the 2020-21 season will be February 8–12. The 2020-21 season will be February 7–10. Due to the Covid-19 pandemic, the exhibition will be canceled. The 2019-20 season will have an expansion to February 20–March 7.\n\n\nThe National Gallery of Art in Washington, DC, has received a gift of one hundred works by the late American painter Victor Vasari. The works, which were donated by a group called the Victor Vasari Foundation, are being restored to a new state-of-the-art facility in the museum. The gift includes a trove of works by the late American painter that were donated by Dale V. Sheppard, a prominent collector and the grandson of Edward Sheppard, the founder of SkyBridge Capital, which has provided millions of dollars for the restoration of works by the late American painter.“Victor Vasari is one of the most celebrated American painters and a legend from his country�", "The next Biennial should be in 2022. \n\n\nThe Tate is planning to shutter its London outpost, the Tate Modern, in 2022. The decision was made as part of a restructuring of the museum as it prepares to reopen under new management in January 2020. Tate director Maria Balshaw said that the changes will allow the museum more time to explore the cultural legacy of the Tate’s patron, Sir David Attenborough. “In order to engage with the wider world, Tate Modern will continue to present a range of exhibitions in partnership with the full range of cultural groups, including the Tate Film Festival and the Tate’s newly launched Venice Biennale,” The Times reports.“We will share more information soon, when we return to London, about the future of Tate Modern and what we can expect in 2021,” Balshaw said. The changes will require the closing of several galleries, including the Tate Modern and the Tate Modern London, and the museum’s new headquarters in north London.Balshaw said: “In order to deliver on the visionary mission of the museum and to rekindle its vitality, we need to shift the focus from exhibitions to exhibitions as", "The next Biennial should take place in 2020.<|endoftext|>I\n\nTavares, who works at the Art Institute of Chicago, released a statement on Thursday regarding the introduction of a new bill in the US Congress that would legalize the importation of over three hundred species of invasive plants into the country. “The introduction of this legislation is alarming, and it is a good thing that legislators took the time to listen to the American people and understand that there are significant public safety and health concerns,” Tavares said. “To add insult to injury, to protect these plants, these species are already being regulated and limited in many cases by the federal government.”Under the proposal, which was introduced by Representative Earl Blumenauer (D–Ore.) and Senator Patty Murray (D–WA), and which was accused of being a grandstanding stunt by Blumenauer and Murray, the Federal Food, Drug, and Cosmetic Act (FDCA), which regulates the importation of plants and animals, would be amended to allow for the importation of over two hundred species of invasive species. The bill was drafted by Blumenauer and Murray as a way to placate farmers upset about the new restrictions, but has since been called unconstitutional by", "The next Biennial should take place in Kuala Lumpur in April. \n Members of MFA-Los Angeles’s board of trustees, who will comprise the next president of the institution—whose term runs through 2022—will meet on Tuesday, March 25, in order to solicit further information about the biennial. Members will be asked to present their nominations in writing to the board president, who will chair the event in conjunction with the board. “This year’s biennial was a triumph of public art, of collaboration, of creativity, and of empathy,” said board chair Sharon Koester. “Our primary goal this year was to deepen the breadth and depth of our program, and to support artists and audiences in becoming thoughtful and engaged participants in the local, national, and international conversation. We hope that this year’s biennial will be a turning point for a new generation of scholars.”The board is also planning to extend the term of board president Rachel Hassenbaum, who is currently director of the California Academy of the Arts, California State University, California. She will serve a second term on March 26 and will assume her responsibilities on March 28. The board will meet on Thursday, March 25.", "The next Biennial should be announced by December and will focus on the work of women artists in the US since the late 1970s.\n\n\nThe National Portrait Gallery (NPG) in London has named Holly Connell as its next director. Connell comes to the institution from the Museum of Modern Art (MoMA), where she has served as deputy director and chief curator since 2013. She succeeds Jocelyn Fairbairn, who has helmed the gallery since 1995, and will take up the post in January 2021.“Holly is the ideal leader for the gallery following her leadership on the museum’s successful reopening earlier this year, as well as the growth and success of the NPG in the last decade,” said director Maria Balshaw. “We look forward to her continued success and to working alongside the talented team at NPG. We are confident that in her new role, she will further expand and shape the NPG’s visual and performance programming, and further develop the gallery’s collection of modern and contemporary art.”Balshaw added: “Holly’s predecessor, Ross Wheeler-Campbell, was instrumental in the gallery’s reinvention as a", "The next Biennial should take place in late spring, and will run from May 13 to May 14 at the Museum of Modern Art, and will be open to the public for free. “The new Art of the Digital Age series is an extension of our ongoing art-making efforts, which have focused on how the museum can be transformed by the digital,” said John Lebar, chair of the board of trustees and a former director of the Museum of Modern Art.  “The new Art of the Digital Age series is a collaboration between Frances Rizzoli, the curator of the forthcoming biennial Art of the Digital Age: The New Cultures, and Tadao Ando, the curator of the forthcoming exhibition Art of the Computer: From Design to Simulation.”The new museum section, Art of the Digital Age, will highlight the work of emerging and established artists and will draw on the research and exhibition activities of the original twelve installments of the Art of the Digital Age series. The exhibition will also present work by artists such as Michael Ronch, Yayoi Kusama, and Hakim Saad, and will feature the work of new and established artists such as Yael Ritner, San", "The next Biennial should be staged in the city in 2021–2022. The next edition will be held at the newly renovated Palace of Fine Arts in the city from December 8–December 13. \n\n\nThe Museums Association (MA), the UK’s professional trade group for museum professionals, has received a $20 million gift from a mutual fund established in memory of Richard Gere, a British artist who was the subject of a long-running exhibition at the Tate Britain’s London wing, the Tate Modern, from a foundation spanning the artist’s and the British artist-industrial complex’s history.The fund, called the Richard Gere Foundation for British Art, was formed in 2014 with a $6.5 million donation from the artist’s widow, Diana Gere. The Tate declined to renew her husband’s contract with the institution until March 2020, a decision that led to a dispute over whether the artist should have his contract renewed at all. The dispute culminated in a challenge to the institution’s contract by the Gere Foundation, which claimed that the Tate had breached the artist’s contract by not renewing his contract.The Richard Gere Foundation has since defended its decision to invest in", "The next Biennial should take place at the Museum of Modern Art from February 18 to February 21, 2020. The retrospective will be organized in collaboration with the artists and will include an open-air exhibition of works by twenty-seven artists on view across four galleries. The open-air exhibition will include works from the upcoming exhibition, “Sensate: The International,” that will run on view until March 21.“The Biennial is not only an extension of the Museum’s program but also of the museum’s programmatic approach,” said Mark Hurwitz, the director of the Tate and a cofounder of the Museum of Modern Art. “A lot of the work of the artists in this exhibition will be familiar to the Museum staff, since they have been worked by the museum over many years. But the program will be broader and more ambitious, incorporating a new generation of artists who are new to the institution.”  The next edition of the Biennial will take place at the Museum of Modern Art from March 16 to March 20, 2020.\n\n\nThe National Museum of Fine Arts (MoFA) in Washington, DC, has been informed that it is set to receive a gift of twenty", "The next Biennial should be held in 2022. The current exhibition will be resurrected next year at the location of the artist’s studio in the town of Doha.\n\n\nThe Metropolitan Museum of Art in New York has appointed Jorge-Olivier Houffal as the next director of the museum. He succeeds David Bonderman, who retired in November after a decade at the helm of the institution.Houffal joined the museum as director of photography in 1976 and has since helped organize fifty-four exhibitions, including “NIRIN” (2018); “ROBOTS: AGE OF AN ANIMAL PLANET” (2017); “CASALADASA: AUSTRALIA’s PROJECT OF ART” (2016); and “MARIA AND PARADISE” (2015). He also curated “SILVER: ALBERT H. FELLOWS” (2017), “NIRIN: THE IMAGE YEAR” (2016), and “ROBOTS: AGE OF AN ANIMAL PLANET” (2016).\n\n\nThe Carnegie Museum of Art in Pittsburgh has received a $3.5 million donation from", "The next Biennial should be in 2022, and the first in 2023. \n\n\nThe Organic Archives, a contemporary art research, archiving, and archiving organization based in Atlanta, Georgia, has appointed Kate Kadlecik as its new executive director. Kadlecik will be responsible for identifying and implementing new and existing programs that balance the museum’s collections, exhibitions, education, and outreach. In her new role, she will work closely with the curators, thinkers, artists, and institutions who will shape a new narrative for the institution.“Last year, Kate was instrumental in forging the biennial as a unique platform for original thinking and creating through the work of underrecognized, under-recognized, and under-recognized artists,” said Andrew Brant, the institution’s founding director and CEO. “She has a proven track record of elevating artists and transforming what it means to be an institution.”Kadlecik will take up the post on April 3. She succeeds Carolyn Bowdich, who was appointed interim director of the Museum of Contemporary Art Atlanta in January 2019.“We are thrilled to welcome Kate, who will continue to organize and lead our biennial, and", "The next Biennial should begin in December 2020. The event will also include a special exhibition of works created by the biennial’s artists. The 10,000-piece artist-run museum has originally planned to open in the city in 2020, but the project was pushed back due to the coronavirus pandemic. The museum reopened in March 2021, but the launch of the show “Amen” was marred by a security scare, a crisis caused by a man who contracted the virus and died of his illness two weeks later. The opening of the exhibition was also postponed. “It is important to note that the exhibition ‘Amen’s’ opening was marked by the most professional, innovative, and forward-thinking exhibition we have ever done,” said director Ian McAllister. “The show underwent a reimagined launch, a re-imagined programme and an expanded programme. It was not only a milestone for art but also for London. We are extremely proud of the work we have done along the way, and proud to be bringing the show to you in 2021.”Under the new contract, the Biennial will run through March 2022. The show will", "The next Biennial should be in the Spring of 2020. In the meantime, the University of Washington has created a new appointment for the first time in its history as an Associate Professor of Arts and Design. Since the time of his death, Goldstein has been a professor of art, design, and architecture at the university.\n\n\nThe Museum of Modern Art (MoMA) in New York has received a gift of more than five hundred photographs by Canadian-born, New York–based artist Allan Haslett, which were acquired through a deal that went sour over a decade ago. The artworks are works made in the artist’s home country of Canada and were stolen sometime around 2006. The recent discovery of the stolen photographs prompted a New York City grand jury to launch an investigation into the circumstances surrounding the break-in.“We are deeply disturbed by the recent events at MoMA,” said Peter Salovey, the director of the museum and the institution’s board member. “We are also committed to working with the authorities to secure the safety of our staff, the public, and the institution as we continue to support the important, passionate curator and artist who has inspired countless others with her vision and talent.”Added Salove", "The next Biennial should be held in 2021, with a specific date to be set for the first exhibition in 2022. In the meantime, the biennial has posted an open letter on its website, signed by more than 1,500 academics worldwide, who say the show should be postponed until at least March 2021.“The exhibition is currently delayed by more than two years due to Covid-19, and there is no reason why it cannot be delayed even further,” said Alessandro Mappuccio, director of the Italian Biennale. “It is just a matter of showing the work and of understanding the exhibition in a timely way, and of finding a solution to the economic crisis in a way that does not require a huge leap of faith.”He added that the exhibition should be postponed only if the artists are prepared to leave their residencies and return to Italy to continue their work.The move has been called illegal by the Ministry of Culture and the Ministry of Culture and Sport, which recently announced it would sue the Biennale’s management for using a public institution for a private profit. The ministry claims the move is illegal since it violates the country’s labor regulations. The Ministry of Culture is currently negotiating a", "The next Biennial should be held in 2021.\n\n\nThe Ministry of Education, Culture, Science, and Sports (MEXT) has postponed the next edition of the Shanghai Art and Design Biennial (SABD), scheduled to take place in March 2021, due to concerns over the coronavirus. The news was announced by an official in Shanghai, who noted that it was still assessing the effects of the Covid-19 virus. “The NOVA World Art and Design Fair is still underway,” said the official, who requested anonymity. “We will continue to work collaboratively with partners and stakeholders to develop new platforms for learning and exchange, and continue to support the upcoming exhibition in March 2021.”Calls for further curation and exhibition development of exhibitions from France, Germany, Japan, and Korea have also been ignored by the museums and organizations involved. Artforum reports that the next iteration of the exhibition will instead consist of a series of online experiences that will engage with a number of themes, including the connection between art and technology and the relationship between culture and the environment, and will take place on the Philippines’ Barbuda Island, the Philippines’ exclusive economic zone, and will", "The next Biennial should take place in the spring of 2020. \n\n\nThe Art Newspaper has announced the ten artists who will receive $10,000 grants from the Dayton Art Museum in Ohio in 2020. The fellows, who hail from eleven states, including California, Michigan, Nebraska, New Jersey, and Pennsylvania, will then be asked to create works for the museum’s permanent collection. The awards will be given in the form of a cash prize of up to $50,000.The artists selected for this year’s prize are Kevin Beasley, Jr., Brandon Marshall, Billie Anagnos, Nick Sugden, Rob Sanders, Marisa Takai, Alex Toth, and Rob West.“The Dayton Art Museum is an institution that has been at the forefront of the movement toward creating public investments that serve the community and are locally sustainable,” said museum director Jana Feigen. “The 2020 grant cycle is a opportunity for the Dayton Art Museum to build upon the work of its artists in the latter half of the twentieth century.”The biennial, titled “Making Places,” will focus on the history of the collection, exhibitions, presentation, and research of nineteenth-century American painting and", "The next Biennial should be held in 2020.\n\n\nThe Independent has launched its #FinalSay campaign to demand that voters are given a voice on the final Brexit deal.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles celebrated its twenty-fifth anniversary with an event that involved more than 500 people and featured an open letter penned by more than 1,500 curators and art workers and their supporters in an attempt to influence the museum’s board of directors to form a union.The letter, sent to board chair Daniel Libeskind by twenty-nine curators, artists, and activists, titled “Dear Friends,” and was signed by Alex Hirsch, Ann-Marie McAllister, David McAllister, Sophie Martin, and Ray Eames, among others, as well as Tonita V. Jimenez, Ruan J. Ramirez, and Isamu Noguchi.“As we enter the final stages of our negotiations, it is essential for the Museum’s board to hear from and see firsthand the contributions of our members,” reads the letter, which was organized in partnership with the museum’s bargaining committee. “We invite you to join us in supporting our members", "The next Biennial should be held in the autumn of 2021. The date for the exhibition was initially set for the end of September. The first exhibition, “The Areca Cardoso: Bienvenido” (2019), was held in September. The second exhibition will be held in November, and the third biennial will be held in December.“The new season of the art biennial is approaching, and we are confident that we will be able to present the most presentable projects of presenters from South America, Europe, and Asia,” said Mary Beth Pasternak, chair of the board of trustees. “This year’s edition has been a great success, and we are excited to continue the themes, the artists, and the work at the biennial to explore the intersection of art and life, the art of the art and life, and the art of art.”The biennial’s theme, “The Personal and Biological Landscape,” is a reminiscence of a trip to the Areca region, Argentina, in 1939, during the Second World War. The exhibition included a selection of paintings, sculptures, and installations that examine the intimate connections between people and the natural", "The next Biennial should take place at the Museo de Arte Contemporáneo, Madrid; Art Deco, Milan; and the Museo de las Fuente, Madrid, then in 2020. The event will then move to the Palacio de Cultura Televisa, to be held in 2021, and will begin hosting visitors in 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has begun welcoming visitors to its new location in the Central Coast, California, on July 3. The institution, which is currently undergoing a $125 million expansion, opened to the public in a former steel factory in 2014 and has since welcomed more than 35,000 visitors, its first wave from outside of the United States.Inaugurating the new space is a new series of exhibitions that will explore the history of African American art, which will run July 24–July 28. The exhibition “From Africa to America,” which is part of a larger project titled “African American Art in the 21st Century,” will present the works of seventy-eight artists and will then return to the old factory for a series of performances, poetry readings, and other events that will be held July 31–Oct. 23", "The next Biennial should be held in the spring of 2021. The studio will be able to capitalize on the United States’s \"radically shifting\" art landscape by introducing new programs, including a new exhibition and a special retrospective. “This is a moment of great change for art and for our world, and the artists who are bringing their art to the Biennials,” said Leigh-Ann Harlan, president and CEO of Tate. “These distinctive artists are bringing their art to the country and they know the story of their art, and we are delighted to support their work with new programs and new audiences in the United Kingdom.”The 2018 edition of the Biennial, “The Foundation of Modern Art in London,” featured work by twenty-four artists, including Ulfe Cantwell, Julia Carthy, Naima J. Keith, Ugo Rondinone, and Luigi Basci. The show opened at the V&A in London on October 5, 2018. The 2019 edition, “The Foundation of Contemporary Art in London,” premiered at the Grand National in Paris on October 10, 2019.\n\n\nThe Israeli government will allow the Brooklyn-based nonprofit art center the G"]