["The next Biennial should be held in December 2020.“This is a moment of great change for our planet,” said Roy Spencer, director of the National Museum of Women in the Arts. “This is a moment of great opportunity for artists. We need to seize it and use it to our advantage. We mustn’t take it for granted but use it to our advantage. We mustn’t take it for granted that the world’s art museums are struggling to attract and retain audiences. As we continue to push forward with our ambitious new plans for the Museum of Modern Art, we look forward to working with you and following through with bold new public art in the fall.”On the upcoming exhibition “Monuments Men,” ARTnews reports that the show, which was originally inspired by the infamous “60s” exhibition “The Death of Joan Mitchell,” will actually be held in December 2021. While the formal title of the show will be “Between Worlds”—a reference to artist Renzo Piano’s painting The Death of Joan.The first iteration of the show, titled “Between Worlds,” opened in March 2019 and ran for a full year", "The next Biennial should also include an exploration of the role of art in the recent conflicts in the Middle East and Africa, and how art can strengthen social progress.   The museum will also be developing the next edition of its Dreyer Gallery Talks series, which has invited leading international artists such as João de Almeida, Tanya and Axel Strengths, and Wolfgang Pfeifer to audiences across the globe. \n\n\nThe Tramway Museum of Art in London is facing a legal complaint over its decision to remove a David H. Koch–themed sculpture from its premises in March 2019 following protests from residents who said that they had no option but to leave the building in the wake of the hedge fund tycoon’s death. The sculpture, titled The Divide, was part of the group show “The Future Is Now: Koch-Tutu Art,” which explored the relationship between Koch and various environmental and energy activists, including Richard E. Spencer, Charles and David H. Koch, the founder of Koch Industries, and their family. The museum confirmed that the Spencer-Koch sculpture, which was installed in 2009, was removed from view in March 2019 and said that it had", "The next Biennial should take place in the coming months. \n\n\nThe Art Newspaper in Paris has issued a dire warning about the consequences of the coronavirus. The institution issued the dire warning on Friday, October 18, two days after the coronavirus was confirmed in France and the United Kingdom.Since the first case of the coronavirus was reported in the United Kingdom on Saturday, October 12, the Health Protection Agency (HPA) in England and Wales has said that it has already reported twenty-six cases—twenty-one of which have been people who have recently traveled from the United Kingdom to France and the rest are people who have recently returned. Among those who have recently traveled are a number of people from the UK and other countries such as the US, Australia, Canada, Germany, and Italy.According to the French daily newspaper Le Figaro, the patients have all been exposed to the virus from close contacts of individuals who have recently traveled from the UK. In a separate report published on Sunday, October 15, the newspaper reports that twenty-six of the cases in France have been patients who've traveled to France from countries along the border with Belgium.While the coronavirus is spread mainly from person to person, coughing or sneez", "The next Biennial should be organized as follows: September 27–October 3. May I suggest that the date be changed to September 20.\nWell-known scholars such as Gilbert & McConamy, R. R. D. Cooper, John H. Simon, and many others have argued that the relationship between ethnicity and intelligence is not formally established and that indigenous peoples of South America are intellectually inferior to Europeans. It is argued that, because of this, the indigenous peoples of South America have historically been considered inferior, and therefore inferior to Europeans. The controversy surrounding the role of Indigenous peoples in history is complicated by the fact that, historically, they have been marginalized and excluded from history. In 1923, British colonialists invaded and displaced many indigenous populations in South Africa. Among the many forced to leave their homelands were the Maasai, the Ndebelekhan, and the Pakeha, who were driven from their homelands. Similarly, in 1961, South Africa was a failed state in the midst of a Black Power Revolution.In an attempt to resolve these historical tensions, the United Nations General Assembly passed a resolution condemning the colonialist acts of aggression and racism committed by the British. In 2012, the", "The next Biennial should welcome visitors in February 2020, with an exhibition of works from the artist’s recent exhibition at the Düsseldorf Museum of Art. After a two-year hiatus, the museum will return to galleries in March 2020.\n\n\nCultural producer Jean-Luc Godard, who influenced the work of countless artists, including Pierre-Auguste and Pierre-Auguste-Conti, and who made an enormous impact on the development of cinema, will be immortalized at the Smithsonian’s Marion Barry Medal exhibition. The biennial, designed by the French firm SSI, will be staged at the National Museum of Art in Washington, DC, and will garner more than five hundred awards, including the $100,000 Kleefisch Prize, the Kleefisch Lifetime Achievement Award, and the $500,000 Lisson Prize.The American architect and designer, who designed the showpiece for the independent museum in Paris, the Saint-Germain’s Julius Caesar, which opened in the summer of 2012, was also a master craftsman. The institution will present the final work in the series, which has been curated by curator and artist Sidney Poitras, along with a selection of works that have", "The next Biennial should be held in 2021. \n\nThe National Museum of Contemporary Art (NMA) in Washington, DC, has appointed Katrina Long as its next director. Long, who has served as NMA’s deputy director for the past four years, has been selected for her leadership and strategic vision.“After an extensive board search and a thorough assessment of NMA’s qualifications and track record as a leader, I’m pleased to appoint her to lead the institution,” said NMA director and CEO Robert L. Stephens. “Katrina has cultivated an enviable reputation as one of the most talented, experienced, and dedicated museum directors America has ever seen. Her leadership qualities, vision, and ability to inspire others to think critically and creatively through a wide variety of projects are unparalleled.”Raja Haroon, the current director of West Asia-Pacific and the Middle East at the Los Angeles County Museum of Art, said: “Katrina’s vision for NMA is to continuously advance the museum’s mission to present the most important works of contemporary art. Her tenure has been enormously beneficial to NMA and has brought her a level of international respect and", "The next Biennial should be in 2022. \n\n\nThe Museum of Fine Arts (MFA) in Boston is working with the estate of the late collector and art historian Henry Luce to create a new exhibition dedicated to the late American artist and educator. The exhibition will explore the work of Luce and his contemporaries, as well as the impact art has had on the development of contemporary art and on the development of American art and culture.The exhibition, titled “Henry Luce: Art of the Modern Age” will debut in the museum’s third national expansion—its $400 million expansion, which is currently under construction—in the spring of 2021. The exhibition will also include a survey of the artist’s legacy, which will include contemporary works by contemporary artists, as well as works by artists of the modern era.“For nearly 200 years, Henry Luce has been viewed as the father of American art,” said architect Thomas M. Barr, MFA’s executive director. “His major exhibitions included a first exhibition at the MFA in 1941, ‘Art in America,’ and ‘Henry Luce: The Modern Art of Henry Luce” (1953). In addition,", "The next Biennial should be in 2021, but the organizers have shown no signs of backing down. \n\n\nThe Shanghai Art Institute (SHAI) has received a gift of 5,000 works of art from the private collection of John and Yoko Ono. The collectors’ request was made on the couple’s behalf by David and Yoko Ono, who emigrated to Japan from the United States in 1932\u0097the year the couple’s son Michael was born\u0097and their daughter Takuya, who are now eighty-eight years old.Under the Advance Partnership Program, China is providing a unique opportunity for Japan to present the works for the first time in Shanghai. Since its inception in 1962, the institute has been able to present thirty-five works by artists and has had artists present its first exhibition in the city. The show was organized by the Chinese art historian and curator Jia Yu, and featured work by twenty-four new and established artists.\n\n\nIn a major blow to the government-backed, privately operated Greater China Art Museum (GCM), in Beijing, the National People’s Congress (NPC) has voted to revoke the organiza­tion’s registration. It also voted to", "The next Biennial should be held in Tokyo in 2021. The award ceremony will take place at the Asobi Museum in Tokyo on October 25 and will include the artist and artist-in-residence Tadao Ando as well as a selection of the Biennial’s work. The Biennial’s fifteen finalists will be announced in early March.“I am enormously honored that this magnificent year has been able to design and organize such an exciting exhibition, and that the collaborative spirit and imagination of the exhibitors has made it such an important exhibition,” said Nino Ochi, director of the Biennial. The exhibition will include work by twenty-three artists, including Alberto Toledo, João Ribas, Alessandro Delfina, Adriana Delgado, Shigeru Matsuyama, Andrés Martinez, and Sigmar Polke.The exhibition will present new artistic projects and works by twenty-six artists, including Shirley Corrigan, Antoine Moriori, Hiro Hata, Igor Edix, Oandrea de Jese, Yoshitomo Ito, and Jack Pape. As", "The next Biennial should take place in the summer of 2021, with the goal of fostering a new kind of work and collaboration between artists and galleries. Its organizers have created a $10,000 prize for artists. As part of the prize, the winner will receive $50,000.\n\n\nThe Italian government approved a $54 billion aid package on Wednesday that will provide billions of euros to help Italy address its continuing financial crisis and keep its cultural sector afloat as it attempts to reduce its debt and avoid a third bailout, reports the Art Newspaper.The bill, titled 'Advancement of the Program for the Protection of Culture and of the Arts', was passed by the Senate on Monday and is expected to be implemented by the Italian government. The legislation will ensure that the $54 billion in aid is directed at major industrial and commercial sectors, which have been the major drivers of the country’s spiraling economic crisis. The legislation also establishes a research and development fund for cultural institutions and their partnerships and expands the state’s emergency aid program.The legislation states that the Italian government may redeploy funds to “address any shortcoming,” but does not specify whether the funds will be used to prop up failing institutions. The legislation also states that any", "The next Biennial should be held in 2020.\n\n\nThe Caribbean island of Martinique—which is currently reopening to the public following a $1.2 billion expansion project—has announced that it is reopening to the public in 2021. The project, which includes the construction of a new museum, the Pérez-Martinique–Baroque, and the renovation of the existing building, completed in 1888, has faced many obstacles, however, and the island managed to secure enough funds to complete the renovation in 2021.“The project will provide a new experience for visitors to Pérez-Martinique, and will also provide an opportunity to re-envision the museum in its entirety, including the Pérez-Martinique Theatre, the Pérez-Martinique Signature Collection, and the Pérez-Martinique Archives,” said Elvira Ammendola, the director of the Pérez-Martinique Foundation. The foundation also plans to create a new platform for the cultural activities of Pérez-Martinique, and will partner with the city of Pérez-Martinique to develop a comprehensive cultural program around sustainability, and will hold a series of talks and events to help people understand", "The next Biennial should focus primarily on the theme of the event, “The Future Is Not What It Used To Be,” and should bring together artists from the '70s and ’80s. The biennial will be held at the Museum of Fine Arts in Boston, which will continue to operate under the museum’s auspices, from April 27 to May 6, 2020.  “The Future Is Not What It Used To Be” will be inaugurated by the Philadelphia-based artist Mark di Suvero, whose district includes parts of Broad and Delaware Streets, and will be followed by “Tryst” (2018), a project-based installation by the Italian artist Luigi Trivardo, and “Gideon” (2019), a series of sculptures by the Pennsylvania-based artist Maynard James Keenan, which were commissioned by the artist to pay homage to the late artist’s work.“The Future Is Not What It Used To Be” will be followed by “Tryst,” a new project by Trivardo that will involve creating a new work by the artist every two weeks. The exhibition will open at the new museum on May 24, 2018", "The next Biennial should be held in 2021, with the opening of the exhibition “Krait,” curated by the French curator Léo-María Márk (2019); “V/A” (2019); and “The Martian” (2019).The exhibition will serve as the centerpiece of the Guildhall, London’s first living art museum, set to open in the spring of 2020. The museum’s three-dimensional sculpture garden will be inaugurated with a series of new works by renowned British artist John McAllister. “I’ve been to Japan many times,” said Pritchard. “I’m not a big fan of the Japanese, but I think they’re doing pretty well. It’s a long way from being a total disaster, to being a very big problem.”\n\n\nThe National Museum of Scotland has received a significant donation of 80 works from the National Curator’s Fund. The gift includes works by thirty-six artists, including Charles Parry (1905–1970), David Atkins (1905–1985), and Robert Rauschenberg (1906–1973), as well as", "The next Biennial should be held in 2020, and the first in 2021.\n\n\nThe sixteenth edition of the Berlin Biennale, curated by an intergenerational group of South American curators comprising María Berrío, Richard Wright, Nuria Cervetto, and Tónica Cervetto, has released its schedule. Titled “Architecture of Life” and published by the Berlin-based collective Wangechi Mutu’s Almine Rech, the exhibition will run April 22–April 26.“With a lot of anticipation, we are delighted to announce that the exhibition will now feature the works of the artists who have participated in the Berlin Biennale since the tour first began in 2002,” said Bernd von Noten, chair of the board of trustees of the Berlin Biennale. “The exhibition ‘Architecture of Life’ will include the works from the current exhibition cycle and will bring them to life on the exhibition as well as on the Berlin Allee. It will give visitors an opportunity to see the works in their original context and to understand the history of the exhibition.”The work of the curators featured in the exhibition is divided", "The next Biennial should take place in 2022, when the museum will be rebuilding its interior. (The museum opened in 1941 and only reopened in August 2018, when the museum was closed because of the Covid-19 lockdown.)\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles has added Art Navarro, Skarstedt, and Tania Bruguera to its curatorial team. The artists hail from Argentina, Chile, Colombia, Mexico, Peru, and Venezuela. “The museum’s collection and expertise in this area are very important to us,” said curator Laura Hoberman. “We were impressed by the breadth of their portfolios, and the breadth of their interests. We also know from speaking with a variety of curators that they know what they are doing, and that they know how they can make it work for us.”Bruguera is the founder of the Buenos Aires-based nonprofit MALAVIA, which aims to increase public access to contemporary art through education and research. “The idea behind MALAVIA is to use art to create an awareness of the crisis of our times and to teach people how to be conscious, thoughtful, and creative", "The next Biennial should be held in 2022, and the last exhibition, titled “An Incomplete History,” will be staged at the Museum of Southern Art, Tokyo, in March 2022.The museum’s director, Nobuyoshi Kurosawa, called the decision to suspend the exhibition “an absolute historic moment.” “I take full responsibility,” he said in a statement. “In our opinion, the exhibition has not been up to par with the expectations of our guests, our staff, and the board. We will work hard to undo these shortcomings, and reestablish the exhibition to its full potential.”The museum added that it would require more than two years to rethink the exhibition, and that the museum will continue “to move forward with an exhibition that brings together the best of modern and contemporary art.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Cristina Salpeter as its next executive director. The Los Angeles native previously served as director of international alliances and partnerships at the Italian luxury conglomerate Monadnock Northlands. Salpeter succeeds Lydia Alpini, who has led the museum since 1998, and will take up the post on February", "The next Biennial should be held at the National Museum of Art (Myelms and Haus der Kunst, Berlin), which was established in 1807 and opened in 1809. “The National Museum of Art—or rather, the National Museum of Art—is the standard-bearer of modern art. That is why it has been so resistant in its aim to become a museum of modern art and why so many people have regarded it as a Berlin destination,” said Reiner Wunderkammer, the chair of the biennial Steiglitz, the museum’s new home in the city of Steiglitz and a former minister of the interior. “For many years now, the Biennale has been embedded in the heart of Berlin, and it has been the best-received exhibition in the city, with great fanfare. Today, the biennial has become another part of the city.”During the next edition of the show, slated to run from March 3 to March 5, the Panorama Group will stage its first exhibition in the city in more than sixty years, the first museum dedicated to drawings, and the Meneldorf-based König-Fabian will host a first", "The next Biennial should be held in 2021.\n\n\nThree Democratic members of the House Oversight Committee—Tim Walz, Jim Jordan, and Peter King—are urging the Department of Homeland Security (DHS) to hold off on the construction of the controversial Keystone XL pipeline, which would carry Canadian tar sands through the heart of the United States, until at least 2021. The move would give President Donald Trump and Secretary of State Mike Pompeo two years to craft a new environmental policy that would prioritize the environment over human health and safety.The lawmakers said they are concerned about the pipeline, which would carry bitumen from Canada’s oil sands region to a major US refining hub in southern Texas, and the risk of an explosion if the section is built. They also said that the government should have taken more than two years to craft a new federal law governing the pipeline, as the Obama administration had done for the construction of the East Coast's controversial, $8 billion GW-29 nuclear power plant. Trump signed an executive order last week mandating that all construction work, including the construction of the pipeline, be halted until the new environmental regulations are in place.“We are deeply concerned by the temporary suspension of construction while DHS and the Department of State are working", "The next Biennial should be held in 2020. The project will be announced soon.\n\n\nThe Museum of the City of New York, which announced its plans to eliminate more than one hundred jobs in its downtown Manhattan location, announced three new additions to its board of directors: artist-in-residence Usan Šimerman, who will be based in the city; artist-in-residence Asher Vollmer, who will be based in the Bronx; and artist-in-residence Shi-Chuan Ng who will be based in the Brooklyn borough of New York.“With the upcoming campaign season, we felt it was important to expand the Museum’s board of directors,” said Museum director Adam D. Weinberg. “We are grateful to Kirkland & Stieglitz, representatives of the Philadelphia arts community, for their leadership in recognizing our proposed multimillion-dollar restructuring and in championing the many exciting possibilities for the Museum of Modern Art.”The museum will also announce its next international director, whose remit will include supporting cultural activities in Greece, the Netherlands, and Sri Lanka. The announcement is part of a $7.2 billion restructuring plan that will", "The next Biennial should be held in the spring of 2020. The artists who were selected for the program are: Amitavati Manna, Maxime Mohebbi, Donatella Fattal, Gabriel Faurie, Aaron Goldman, Kenjiro Toyoda, Franz Tazio, Gershonkova Markova, Lutz Podkala, Amar Raja, Peter Schäfer, Carlo Suber, Johan Utts, Roxannita Vaidya, Amirul Pal, Arash Raza (the winner of the first edition), Bianca Rubell, and Kinell and Kastner. The first edition, held in Cologne in June 2019, was staged by professor Wolfgang Luebke, curator of Modern Art Michael Krimson, and associate professor of history and the history of art at the University of Cologne. The second edition, hosted in the Belo Horizonte Museum in Portugal in August 2020, was curated by professor Henrik Larsson (the winner of the third edition) and the artist and curator Willi Astrup. The upcoming edition will", "The next Biennial should take place in the spring of 2021, with the first exhibition, titled Projects, 2020, to open in the autumn. The theme of this year’s event is “Art and Identity: How Art and Identity Shape Our Lives, Our World, and Our Universes.”Joel Kotkin, the director of the Center for Art and Media at the City University of New York, calls the exhibit “a great first step toward connecting the contemporary art world and the New York City arts community.”Terry Renna, the curator of American art at the Museum of Modern Art, also praised the exhibition and its organizers: “The exhibition is part of a great campaign to make New York City art a reality for artists and the city’s artists in a way that really extends beyond what we’ve done in the past—this is a very different kind of approach. . . . I’m excited about the future of the exhibition, its exhibition format, its programming, and its connections to the city.”In addition to the exhibition, the biennial involves a series of projects that draw from the collections of the Center for Art and Culture, the Metropolitan Museum of Art,", "The next Biennial should take place in 2021. Wang and eleven collaborators are currently working on the exhibition’s design, which is inspired by the work of the late Chinese designer Jia Zhangke; the structure, which will be housed in the new exhibition pavilion, is being inspired by the third floor of the Huangpujie Building, the former home of the Shanghai Fine Arts Museum.“We are thrilled that the Biennial will take place in China\u0097where its artistic, cultural, and financial center will be inaugurated in the coming months\u0097and are eager to promote the exhibition in the years to come,” Wang said.\n\n\nThe first edition of the \"Art and Art History\" exhibition was held in New York’s Central Park on Monday, June 3, and was attended by nearly 120,000 visitors. The event showcased work by fifty-two artists and forty-five organizations. Curated by Stephen Friedman, the director of the Museum of Modern Art in New York, “Art and Art History” was organized by David K. Lin, curator of modern and contemporary art at the Museum of Modern Art, and Charles D. Allen, curator of modern and contemporary art at the", "The next Biennial should take place in Washington, DC, in 2021 and will be presented by the National Gallery of Art in Washington, DC. The 2019 edition was a total disaster, with several hundred people losing their lives in the attacks of Islamist militants in Dhaka.\n\n\nA group of French human rights activists has won a major victory in their ongoing legal battle with the state over the controversial execution of Algerian artist Rachid Karrar, who was executed last month for a crime he didn't commit because of an international outcry. The group, comprised of lawyers and academics, won the first round of the legal battle on Tuesday, when France annulled a 2014 conviction that the death sentence was arbitrary and capital punishment was reinstated. The second round of the case was scheduled to run through the end of the month. The group’s lawyers had asked for a total of ten years in prison, but the ruling only gave them one year, suspending their appeal.The ruling, which came two years after the French president Jannat Hamdan declared that France would not tolerate the conviction of someone for crimes they didn’t commit, was met with outrage at the Parisian Cour de Cassation, where Karrar’s execution was", "The next Biennial should be staged in 2019 and the exhibitions will be staged simultaneously. The opening ceremony will be held in the museum.\n\n\nThe Institut National d'Art et d’histoire (INAH) in Paris is planning to open a new, city-funded museum dedicated to the French Modernist Jacques-Louis Vuillard in the city’s old prison, the Rère des Nations, on September 17. The new venue will be named after Vuillard’s daughter and will be located in the city’s 9th arrondissement—a UNESCO World Heritage site in the southeast of Paris.“Today I would like to present to you the first renovation project for the building of the new museum, which will be inaugurated with a presentation of a triptych by the artist’s grandson, Pierre-Paul Vuillard,” said architect Christian ND, the director of the Centre Pompidou in Paris. The new museum will be themed after the artist’s own life and will be located in a former French concentration camp, a former military barracks, and in the city’s old prison, the Rère des Nations.The project will involve the building of the museum�", "The next Biennial should be held in the Fall and will focus on cross-cultural dialogue, collaboration, and exchange. \n\n\nThe Brooklyn-based, nonprofit arts organization the Brooklyn Museum, which was founded by immigrant parents in 1949, has appointed John Lennon, Yoko Ono, Mandy El Samerraei, and Steve Paxton as its new board members. The announcement came as the museum prepared to welcome the public to its first summer exhibition dedicated to contemporary art, “The Beginner” (May 19–June 21, 2020), and as the institution prepares to reopen in the fall.The biennial will feature work by fifty artists and will be organized around themes such as culture and technology, performance/performance, and art and architecture. The event will also introduce visitors to the museum’s collection through a four-hour tour, which will feature highlights from the institution’s holdings, including works by the Beatles, Bob Dylan, Amy Winehouse, and Robert Irwin.The biennial will include the first show dedicated to Lennon, a contemporary artist whose art is particularly known for his experimental and often abstract designs, which often feature figurative and textural elements such as fabric, fabricate, sculptural elements, and wood panels.", "The next Biennial should be hosted at the Museum of Leeds, which is currently undergoing a £65 million refurbishment, and will be held in late spring or early summer 2020. \n\n\nThe French pavilion at the Fifty-Fifteenth Venice Biennale, which featured works by the Belgian-born architect Fredy Boudot and the Czech-born architect Marta Pindell, has announced that it is reopening in April 2021. The announcement follows the launch of the project “Pillars of Creation” , an exhibition that focuses on the evolution of an ancient structure, the Giza Giza, in Giza, Egypt. The project is part of a larger project to reissue works by the 150 or so artists who participated in the exhibition in the early 1990s.Pairing a medieval chapel with a cacophonous, golden-hued and sculptural structure made of limestone and granite, the chapel will be located in the city of Cluj–Napoca, Romania. The chapel was commissioned by local leader Andrzej Durov, who had owned the property for twenty years, and his wife, Katarina Durov, and was completed in 2017.The chapel is a depiction of", "The next Biennial should take place in 2022. The exhibition will only be able to handle a maximum of fifteen thousand visitors. Art Carried: A Collection of Art, 1947–1948, curated by Adnan Ghani, will present a different edition of the work in 2021. The Art of Souvenirs, 1960–1966, curated by Kasimat Paul, will take place in 2018. In addition to the three-day event, the museum also announced a number of initiatives to help revitalize the neighborhood. The first includes the renovation of the building where the museum has its headquarters and the Museum of Contemporary Art (MoCA) in a building designed by the architect Ahmet Şahin. The project will also include the refurbishment of the  Carnegie Building, for which the museum is currently renovating, and the renovation of the surrounding Temujin Gardens.The institution also revealed that it is planning to increase the budget of the museum by 10 percent by investing $2.5 billion into capital projects over the next ten years. The funds will be used to expand the museum’s footprint in the city of 40,000 people and to enlarge the museum’s footprint by tenfold.", "The next Biennial should be held in the end of September 2020, and the inaugural will take place in September 2021. The completion of the exhibition will mark the last time the exhibition will be held at the museum in its entirety, as it has been changed by the city of Chicago since it was founded in 1898.It will also mark the museum’s centennial year. The institution has been entirely renovated and is currently undergoing a $500 million expansion project, and it is planning to reopen in 2024. In the meantime, the museum is working on a new platform that will showcase new works by artists from the period, and will soon host a biennial exhibition of works by artists from the 1930s. The new platform will also introduce a new survey of women’s art, “Passionate Portraits,” which will likely be staged by a group of women artists, and will offer a more curated experience for museumgoers.The museum also revealed that it is working on a new Narrative of an Adventure in Time and Space, which will be presented by the Museum of Modern Art in 2020; a new collection of abstract and surrealist paintings; and a revival of the museum’s collection of works by Arthur Findlay and Gis", "The next Biennial should be held in 2021. Tetsuya Takahashi, the director and founder of the Carlsbad Museum of Art in California, told the Los Angeles Times that the exhibition had been delayed by the coronavirus. He explained that the show was originally scheduled for December 2020, but the coronavirus had been discovered on December 19. Since the show was still on schedule, Takahashi said he had not considered canceling the exhibition. He also mentioned that the exhibition would be on view as a retrospective of the artist’s art from the latter part of the twentieth century.Commenting on the exhibition, Dylan Byers, the director of the California Institute of the Arts (CalArts), said: “We are pleased to be able to open the show and the exhibition again next year. It would not have occurred to the exhibition to open on December 14, when the coronavirus was first identified in the United States. We hope the show will draw many more visitors to the museum.”\n\n\nThe Institute of Contemporary Arts (ICA) in London is launching a new crowdfunding platform that will allow museums and galleries the ability to raise funds for essential repairs and renovations. Curated by Victoria Miro, the digital", "The next Biennial should commence in 2020 and will make an announcement in the summer of 2021. The fee for the exhibition, which will be staged in different ways, will be EUR 200,000 ($206,000).\n\n\nA group of artists and art historians are suing the National Geographic Society, claiming that the company violated the Sherman Antitrust Act by promoting a documentary about the 1917 Spanish-American War, La Ciudadana y la Rucha, in its November 2018 issue.The lawsuit—which seeks to halt National Geographic’s sale of the Mayan calendar, March 14: Hecate Blanco, and the Mayan calendar, July 3: El Museo del Proyecto—has joined other suits brought by academics against the Smithsonian, the National Gallery of Art, the Metropolitan Museum of Art, and the Museum of Fine Arts, Houston.“The National Geographic Society has been sued by academics in the past for promoting artworks from museums without permission or compensation, but the litigation has been on hold because the plaintiffs could not prove that the objects in dispute were sold or leased to the plaintiffs,” said Deborah Brookins, director of the Art Gallery of Ontario’s Modern Art Research Center", "The next Biennial should be held in Helsinki in the spring of 2021.”The MCA’s new chairman, Moholy-Nagy, has said that the institution aims to foster dialogue between the local communities of the former concentration camp sites, which were used as part of the Nazi’s “Final Solution.” The theme of the 2020 edition, a collaboration between art historian Marina Pape, cultural historian Tanna-Anna Hauptman, and the local artist Andrei Lanku, is “Reflecting on the Past: Resistance and the Assemblage in Maya”. The 2020 biennial will be preceded by a retrospective of the artist’s work, which will open at the MCA in March 2021.\n\n\nThe 2017–18 academic year will mark the centenary of the outbreak of the Covid-19 pandemic in Europe, and art historian, curator, and writer Dietrich Wolf, who will serve as the first director of the exhibition “Covid-19: The Artist’s Nightmare” at the König Galerie in Berlin, has announced that he plans to retire at the end of the year. Wolf, who curated the show, which will focus", "The next Biennial should be held at a location that will have the facilities to host an international contemporary art event,” said Basel. “The question now is whether the short- and medium-term goals of the next two years will be met.”Commenting on her appointment, Hoppe said: “I’m excited to start this new chapter of my life with the strong support of the new Art Basel team and the new partners that are of the way of creating contemporary art in the future. I’m also grateful to the new partners that have been invited to participate in this edition of the Basel Biennale and also to the new clients that have expressed a wish to participate in this edition of the Biennale.”\n\n\nThe Italian artist and academic Stefano Bonioli, who created works such as La Berde di Vogue, Casabella di Vogue, and Pignatella with the distinctive use of glass triangles, died in northern Italy on Monday, February 3. He was ninety-two years old.Born in Milan in 1909, Bonioli moved to Venice in 1940 after the war, where he studied at the University of Cagli in Sicily. He", "The next Biennial should be held in the spring of 2021. \nmuseum.  I would like to see a more direct link between the arts and the people.  The arts are reflections of our lives, but they are also the instruments of our values. And they must be adapted in order to the times.  It is clear that today the arts are more important than ever. This is a challenge for us all.\n\n\nThe Temple Orchestra of Greater Los Angeles (T.O.G.A.) is working to raise $1.7 million to restore and reopen its historic home in the Hollywood Hills. The nonprofit organization, which was founded in 1994 by music-industry veteran Stanley Iseman as a means of affording the Temple community access to symphonies, orchestras, choreographies, orchestras, cellos, flutes, staves, and other musical instruments, was founded by longtime Los Angeles philanthropist Vincent van Tilborgh.In 2009, the organization, which operates a two-story, stone-encrusted building on a corner lot in Hollywood, began a major renovation and expansion project, which included the creation of a new museum that is currently being constructed at an estimated cost of", "The next Biennial should commence in the autumn, with an exhibition of works by the artist-in-residence, Angela Segal, in the spring of 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in New York has appointed Malin Gool as its next director. Gool comes to the institution from the Stedelijk Museum in Amsterdam, where she previously served as director of curatorial affairs.Gool joined the museum as its curator of modernism and contemporary art in 2020. Prior to joining the Stedelijk, Gool served as the curator-in-chief of the collection of Piet Mondrian Malsgaard at the Amsterdam Museum of Contemporary Art (MMA), a role she currently holds. She was previously the director of interiors at the Museo del Barrio, Mexico City, and as the director of the Hauser & Wirth studio in Brooklyn.“Malin Gool’s new role at MoCA is a real game changer,” said Thomas Luedde, the museum’s director. “Her expertise and passion for us artists, her vision for the future of our space, and her ability to translate that vision into tangible results are unparalleled. We are confident she", "The next Biennial should focus on “art and philosophy as the locus of meaning and they should be able to create a platform for a new kind of dialogue between art and philosophy,” said Maren Adler, the curator of the forthcoming exhibition “Kinzu Bieter: Actes de Japon.” The third show, “Art and Politics: The Birth of a Nation in America” will highlight the history of the American West and the role of American artists in these territories. The fourth show, “Feminine in Design: Women Artists at the Renaissance” will explore the history of fashion and fashion design.Diana Alighier, the deputy director of the Louvre, told the Art Newspaper: “The biennial is a very important step in creating an international dialogue between the Louvre and the Louvre. Already in 2020, it has become the main exhibition space for the Louvre in Paris. Today’s show is a step in that direction. It is a unique exhibition with a contemporary view of new Italian modernism.”\n\n\nThe Public Art Foundation in New York has received a gift of $2 million from the Woodrow Wilson Foundation in support of its new", "The next Biennial should be held in 2021.\n\n\nBarcelona’s National Museum of History, the Palazzo de Santa Maria della Cova, the Institute of Contemporary Art, Barcelona, and the Madre de Brescia in the province of Alava have announced that they have jointly launched an initiative to save the buildings’ entire collections from demolition. The institutions are working together to conserve the Saña-Algésŋ Hall, the Institute of Contemporary Art, the University of Barcelos, the Palazzo della Cova, and the Palazzo della Capricina.The three institutions’ efforts were prompted by a grave threat posed by the construction of the municipal government’s plans to raze the forty-three-year-old structures and turn the abandoned spaces into coffee shops and other office spaces. The demolition has also been met with opposition from local residents and architects, who fear that the buildings will be razed again in the future and will therefore need to be kept in tact.The National Museum of History was initially asked to contribute $26 million to the conservation of the institution’s collection over a five-year period, but the funding was later cut by $2 million.", "The next Biennial should be held in 2021. The biennial will focus on the themes of displacement, ecology, and migration, as well as the interconnected communities and histories of the Salento region. The 2019 theme was “Peace and the Struggle of Civilizations” and the 2020 theme will be “What Now?”\n\n\nThe Art Newspaper reported yesterday that the Museum of Modern Art (MoMA) in New York has agreed to donate $1 million to the New York City Council on Human Rights, which is seeking to extend progressive social services such as universal health care and paid sick days to all New Yorkers. The money will also go toward the statement of human rights concerns issued by seventy-one councilmembers, including Carmen Alvarez, Javier Barran, Jimmy Van Bramer, Jimmy Van Brummelen, Jimmy Van DeSantis, Jimmy Kimmel, and Jimmy Wales.“After an exhaustive search of our board and our staff, we were thrilled to discover that all of the questions posed by our council members were answered,” said MoMA director Adam Gopnik. “After a thorough review of our policies and procedures, we have concluded that this is the right thing to do", "The next Biennial should be held in 2020.\n\n\nPhotos: Courtesy of the artist/Courtesy of the artist/Courtesy of the artist.\n\n\nThe Museum of Modern Art (MoMA) in New York is reopening to the public today following a $250 million expansion led by the Adriatic architecture firm Lendl Architects, which consists of two buildings—the Adriatic Pavilion, which is being constructed on the site of the former Veneto Canal, and the Veneto Museum—that are planned to replace the institution. Despite the expansion, the museum feels relatively unchanged from the original location of the institution, the Veneto Museum, which was originally constructed in 1924 and completed in 1955.“The Adriatic Pavilion will bring visitors to the Museum of Modern Art, which has been transformed since 2008, and the Veneto Museum, which was completed in 1955, to the Museum, which opened in 1957,” said Audrey C. Burke, MoMA’s chief curator and director of curatorial affairs. “With the addition of the Museum of Modern Art and the Veneto Museum, MoMA will be able to present a comprehensive and compelling story of architecture and design in the United States, Europe, and Italy.”The", "The next Biennial should be held in the spring of 2022.\n\n\nThe Museum of Modern Art (MoMA) in New York has launched a new initiative to help artists whose livelihoods have been negatively impacted by Covid-19. Called the Artist Resili\u0097and organized by the artist-run nonprofit the Artist Relief Fund, the program will provide financial assistance to up to $1,000 individuals in New York City who are facing financial hardship as a result of losing a major source of income.“The Artist Resili program is a resource for artists whose livelihoods are at risk of being negatively impacted by Covid-19,” said Lorenzo di Bonaventura, the museum’s director. “The benefits can be as simple as a financial aid package, as in the case of an artist in NYC who is facing financial hardship due to Covid-19.”The Artist Resili program has partnered with several different organizations, including the artist-run organization Artadia, which has provided assistance to over four hundred artists since it began in November 2018; ArtFund, which has provided $3.5 million to help artists and their families; Art Fix, a coalition of arts and cultural organizations including the New York City Council", "The next Biennial should take place in the spring of 2021. The exhibition will reunite the artist-run exhibition space that has hosted the exhibition since 1988 and will focus on the work of artists who have represented The City of the Arts in the last two decades. The first edition of the exhibition, titled 'The Mariner’s Daughters: The City of the Arts 2009–13, was staged at the artist’s home in the Mariner’s Daughters Arts, a partnership between the Mariner’s Daughters and the Mariner’s family.The exhibition will include over three hundred works in various stages of development, from original concepts to the most recent works. The biennial will include the first-ever solo exhibitions of artist-built works, curated by the artist and organized by the Mariner’s Daughters. The exhibits will be organized as a series of interviews with the artists, including Alison-Inés de Castro, who will present her first solo exhibition dedicated to the artist-built environment at the Mariner’s home in the spring of 2021. “The project is a continuation of our work to create an inclusive and international platform for contemporary art through programs that celebrate diversity and", "The next Biennial should be held within a year. “We are actively working to develop two new programming initiatives that will allow us to better reflect on the previous exhibitions and its rich and internationally acclaimed network,” said Franck Wistar. The seventy-five-year-old museum director added that the museum will follow the lead of the Kunsthalle Basel by developing new programming and developments that reflect the changing cultural landscape.\n\n\nFrench cultural minister Franck Riester announced today that the country will welcome 1.2 million visitors from twenty-five countries in the Paris–Saint-Germain region next year. The announcement follows the seventeenth edition of the Biennale de France, which will take place in Nice, in the spring of 2021. Citing preliminary figures from the institution, Riester said that the number of visitors coming to France from the United Kingdom, Italy, Spain, or the United States is currently around five hundred thousand, of whom around 150,000 are expected to travel to Paris for the event. Riester said that the number of visitors from the United States will be around the same as last year, but will be much higher in January and February. According to The Guardian, the number of visitors", "The next Biennial should be held sometime in the 2020s. “This could be an opportunity to re-imagine our future,” João Pimentel, director of the Museu de Arte de São Paulo, told the Art Newspaper. “It is important to have a vision that can guide us through the challenges ahead. We are all in this together.”\n\n\nThe Metropolitan Museum of Art, New York, has announced that ten artists will receive the $2,500 Adrian Piper Award, which was established in 2007 by the Adrian Piper Foundation, the Metropolitan Museum of Art, and the Make-a-Wish Foundation. The ten recipients are: Braden Barragan, Adrian Piper, Ebony Lynne Clay, Carolee Schneemann, Michael R. Fletcher, Ohara Matsu, Kevin Whittlesey, Taylor Wilcox, Lalo Zamboni, and Tanya Bonakdar.“We are thrilled to announce these ten outstanding artists,” said Helen Gornblatt, director of the Met. “Their work speaks to the new and challenges facing our communities and the art world today and beyond.�", "The next Biennial should take place in 2021. \n\nThe first edition of the biennial, curated by Rainer and José Funes, took place in 1972 at the Kunsthalle Basel in Switzerland, and was hosted by the museum of contemporary art in Stuttgart (MCA) for the first time in 2015. Due to the coronavirus outbreak, the third edition of the event, curated by Philipp Fischer and Petra Spolsky, will also be held at the MCA this year. \n\n\nThe artist-run art fairs of New York and London are protesting the city’s Metropolitan Museum of Art (MoMA) by launching an online petition that has received nearly 2,500 signatures. The art-world event’s permanent collection fairs the Hammer and Frieze London are giving the institution one week to respond to the mass shooting in Las Vegas and are demanding that the museum implement safety measures to prevent the spread of Covid-19.“We, the undersigned, are artists, and artists alone are responsible for the future of our art world,” reads the letter, which was organized by Fairplay, Artforum, Art in General and the Art Gallery Association. “Our positions are not", "The next Biennial should be held at the institute in 2022. The 2019 event, entitled The Future Is Present, was curated by two-time winner Barbara Kruger and featured works by over seventy-five artists. The work of Indian artist-activists T.N. Rao and S.K. Roshan, for example, was included in the exhibition “The Future Is Present: A Biennial of Indian Art,” which was hosted by the institution in 2015 and also featured works by S.M. Ramachandran and A.P. Narayanan. The 2019 exhibition was entitled “The Future Is Present: Kitava” and featured works by A.S.S. Prasad, M.N. Subramanian, Adam Zusman, S.N.Sharma, S.L.J. Singh, and S.M. Ramachandran. The 2019 exhibition was entitled “The Future Is Present: The Contemporary Art of Satyajit Ray” and featured works by L.K.R. Dutta, R.K.S. Ramachandran, and R.K.", "The next Biennial should take place in 2021, and the first exhibition in 2022. The first exhibition will showcase work by sixty-eight artists in ten years. It will also introduce a new model for exhibiting in the biennial, which will include a platform that will be located in a building in the Beit Hanoun district of Jerusalem, and will include a residency program, lectures, and other activities.The project was created by the Beit Hanoun-based nonprofit organization Beit Hanounstudio, with support from the Jerusalem-based organization Mozespora. The design team consisted of Ted De Smet of Studio Mir and a group of young architectural and landscape architects in the United States; Valentino Tammaro of the Guggenheim; and Yair Hochner, director of the Modern Art Museum Haifa.“The biennial was born from our desire to create a platform for the visual arts in the city of Jerusalem,” said Hillel Goldberg, chair of Beit Hanoun’s design commissioning committee. “The new structure will provide an environment for the exhibition and residency program, while showcasing the work of artists who have relocated to the city from abroad. It will also act as a meeting point for visitors", "The next Biennial should be in March 2021.\n\n\nThe Scottish National Gallery (SNM) in Edinburgh has appointed economist and philanthropist Edward Kitson as its new director. He is the first person to lead the institution since Sir Michael Brown left in February 2019, following a dispute over the museum’s plans to move the Tate’s permanent collection to Wales.Kitson joins the institution from the London-based think tank the European Council on Foreign Relations (ECFR) in London, which is chaired by a Columbia University professor, and will take up his new post on January 3. He succeeds Edwin Hanley, who departed after eleven years in January 2020 to head the National Gallery of Art in Washington, DC.“Edward Kitson will bring an international perspective to our mission of showcasing the work of Scotland’s leading contemporary artists, and we look forward to working with him to advance the work of our curators, artists and staff,” said director Stewart Regan. He also noted that Kitson was selected for his expertise and vision, a history of advancing Scottish artists’ work internationally, and his years of experience as a curator.Commenting on his appointment, Kitson said: “I’m thrilled", "The next Biennial should be in a month. The search for a new location is underway.Iwona Balshaw has announced its representation of the Italian designer Pier Pina Balshaw. Born in Milan in 1930 and based in the city of Perugia, Italy, Balshaw received her master’s degree in architecture from the University of Perugia in 1964 and teaches at the Italian Ethnographic Institute. Her contemporary art work is centered on the structures, materials, and techniques used to create durable and highly functional objects.Balshaw’s work has been featured in numerous Italian exhibitions across the twentieth and twenty-first centuries, and she continues to be represented by the Ballet Punta del Sol in Italy and the Perrotin in Venice.In the September 2018 issue of Artforum, Sam Simmons wrote of her work: “No matter what she does, Pina Balshaw remains uniquely capable of producing objects that defy description, of implicating the imagination in a way that elevates the aesthetic instead of undermining it. Perhaps the most important work of her, or of the recent twenty-first century, is her direct response to the conceptualization of the Western modernity always earlier and further back than the one she was", "The next Biennial should be held at the Museum of Modern Art, New York, in 2021. \n\n\nThe Walker Art Center in Minneapolis has announced that it is preparing to open its new, high-capacity museum of contemporary art (MCA) in mid-September. The institution, which is currently constructing a new $60 million building on the grounds of the historic art museum, will also introduce a new series of events, including a summer residency program, and will begin welcoming visitors in September.The Walker’s current exhibition-based model, which has been in place since it opened in 1976, has been transformed by a new, state-of-the-art, biennial-based model in the construction of the new $450 million facility, the Walker Art Center Minneapolis. The MCA will be housed in a renovated former World War II-era warehouse in a former auto body plant on the grounds of the Walker, in the city’s north, and will host seventy-two exhibitions a year, including a composition show by the Danish artist Lars-Eric Braasch, a two-day event by American artist Peter Dreher, and a “Rebel Without a Name: Art and Popular Art” screening", "The next Biennial should be held in 2020. “The project of the exhibition is to develop a new way of seeing the universe,” said Kohn. “We are now simply in the process of creating this new way, and we have been working on it for twenty years.”The exhibition, titled “Love and Art,” will be held at the gallery’s new home on the ground floor of the West Village, which was completed in 2016 and is currently undergoing renovations. The building, which was designed by Israel-based firm Gendarmes Duniels, contains a gallery, a media lab, a library, an archive, and a performance space.Commenting on the installation, artist and designer Katja Nieuwendyk, who set up the Biennial in partnership with Kohn, said: “Love and Art is an exhibition of several works by artists who have chosen to show their own visions of the future. The themes of the show are both hopeful and urgent, as was the case with the first Biennial. Since it was founded in 1997, the Biennial has been an important tool for artists in their work in the arts and for their respective projects. The new space is an extension", "The next Biennial should focus on the intersection of art and politics’s potential to heal divisions and the ways in which art can bring communities together. “The future of Biennial is defined by its ability to be transformative, to challenge and expand existing conceptions of art and politics, and to continue to shape our collective experience of art and politics,” the artists wrote.The seventy-fifth iteration of the Madison Art Institute (MAI) will take place at the Art of the Party, a contemporary art space in Manhattan, in the spring of 2020. The event will also include new public programming and exhibitions. The Madison Art Institute, which hosts more than two hundred exhibitions annually, will present a new exhibition of work by artists such as Billie Tsien, Eric Osborn, Marian Wright, and Judy Chicago. The event will receive a portion of the proceeds from the sale of the works in question.Commenting on the upcoming event, MAI director Andy Johnson said: “Our goal this year as an institution is to make a choice between two very different futures, and to push both of them in exciting new directions. We hope that this show will be a perfect example of what a modern art museum could be.”\n\n\nThe US House", "The next Biennial should be in September 2021.The next Architectural History Museum should be in October 2022.\n\n\nThe Italian Government approved a $63 billion bailout for Italy’s cultural sector on Tuesday, June 16, after the country’s three largest banks and the former industry minister, Pierponi Romano, were forced to redo thousands of loan modifications to comply with revised rules put in place by the European Commission. The changes will give the country’s government $46 billion in aid over the next two years.“The Government took the decision to extend the programme because it believes that the cultural sector is Italy’s main source of income,” said Francesca Cipolletta, the minister of cultural heritage. “It was a difficult decision, but one that has to be taken. We are not there yet, but I believe that we are moving in the right direction. The programme is not finished, but I believe that we are at the beginning of a new phase.”The new regulations, which were introduced in November, require institutions to prepare to open their doors by August 31 and to begin seeing the arts and cultural sector for the first time as early as September. According to the New York", "The next Biennial should be held in Washington, DC, on December 12–January 6, 2021.\n\n\nThe Museum of Modern Art (MoMA) in New York is increasing the pay of its top executives by 5 percent in an attempt to attract more women to its board of directors. In a first for the museum, senior director of programming and partnerships Joanne Lemire has been promoted to the role of chair of the organization’s board of directors.“The board of directors has always been a center of female leadership, and I’m thrilled that we now have a new member on the board,” Lemire told Artnet News. “It’s a pivotal moment in our history to have a woman on the board, and I’m hopeful that this appointment will set an example for how we can support and encourage women in our roles.”Lemire, who joined MoMA in 2013 as director of endowment and collections, will now be responsible for steering the institution through a transition as it reorganizes its holdings and its future programming, which includes exhibitions and a series of programs that have drawn audiences of more than 15 million people each year for the past seven years. The museum expects to reopen in the", "The next Biennial should take place in the autumn of 2022. The announcement did not specify when the exhibition would commence.\n\n\nThe Museum of Fine Arts (MFA) in Boston has received a gift of twenty-nine works by American artist and teacher Henry David Thoreau, who died in 1964. Known as Thoreau’s 'Letter to an American Family,” the collection includes works by every one of his eleven children\u0097a letter that was sent to his wife, Mercedes, in June 1964, and that was addressed to her children and grandchildren.“Henry David Thoreau was one of the finest living American artists,” said Maureen Fitzpatrick, the director of the Museum of Fine Arts, and his widow, Maude. “His immense creativity, warmth, and sense of humor were the best gifts that he could have given to America. We are grateful for the opportunity to see and have the privilege of keeping his work in good condition. Every Thoreau family member should have this special gift.”As a graduate student at the University of Virginia in the 1970s, Thoreau traveled extensively to the United States and Europe, where he studied with the Virginia-based artist and scholar V. S", "The next Biennial should take place in 2020. Speaking to the Art Newspaper, Hsieh said: “My intention was always in 2019 to create a question mark, a challenge, a conflict, a paradox, a situation in which the viewer could become involved emotionally in these biennial works. . . . I hope that this exhibition will become the occasion for the recommencement of the exhibition program and for visitors to revisit the series biennially.”In the upcoming exhibition, which will be organized by an artist-in-residence, Hsieh will present “The Pale Sun: Avant-Garde and the Soul of Nature” through a combination of contemporary art and ancient philosophy and will include works by artists such as Marcel Proust, Pierre-Auguste Renoir, and Pierre-Auguste Freund, along with works by artists who were active in China during the Qing Dynasty. In the past, Hsieh’s exhibition has featured the work of artists such as Mark-Alex, Yoko Ono, and Ron Gorchov.\n\n\nNew York–based photographer Talia Mihalko has been named the winner of the $50,000 $100,000 and $250", "The next Biennial should be held at least twice a year, and the programme should consist of a selection of works, primarily contemporary, that address a given theme and have been selected by an internationally recognized panel. For the second biennial, the theme will be the exhibition of work by two artists, one of whom is a national treasure. The 2019 event was originally supposed to be held at the Opera House in London, but was moved to the London galleries in April. The opening of the exhibition was moved to May. \n\n\nThe estate of the late Swiss artist Georges Apostel has announced that the institution will not be bringing the works of the late Swiss architect Künstler, who was known for his unusual and often radical projects, to the United Kingdom. The estate says that the project was discontinued due to the work’s “significant political and philosophical implications.” The estate also notes that the exhibition and exhibition is being held in a “difficult situation.”Apostel’s work, which has been sold for $18 million since it was commissioned in 1975 and completed in 1979, is currently on display in “Madrid,” the Bernese city where the artist lived and worked.", "The next Biennial should have been held at the Cultural Centre, in Malaga. The event was supposed to be a mixture of contemporary art projects, performances, lectures, and screenings, but due to the coronavirus outbreak, officials decided to cancel the entire project. The event was supposed to run from March 16 to March 18, but was pushed back to March 20. The next event will be hosted at the Museum of Fine Arts, in Boston. The organizers are still unsure about when the event will resume. \n\n\nThe Metropolitan Museum of Art (the museum) in New York is preparing to open in May 2020, despite the ongoing Covid-19 crisis. The institution has adopted a new policy that will allow the museum to reopen if all health and safety precautions are taken—including the COVID-19-specific disinfection of all areas after the museum has closed. According to a press release, the museum is also allowing people to return to the institution until April 7, 2020 and is looking to hold another event in June.“Our safety and security team is in the process of reviewing all feasible options,” said museum director Daniel H. Weiss. “We believe that a resumption of the regular season in June will", "The next Biennial should focus on “Landscapes of the City,” which is curated by Rebecca MacKinnon, a curator based in New York. The inaugural edition, “The City of the Wind,” featured installations by artist-activists Daisy Chiu and Kiki Smith.The sixth edition of the Exhibition—originally titled “The Paris of Tomorrow”—has yet to be announced. The first exhibition of the Paris Architecture Biennial will take place on September 11 at the Palais de Tokyo. The Paris Museum of Art (Pala) has yet to announce a date for the fifth edition, which will take place in June.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has launched a new digital platform that will help artists, including Mia Ma, create and share works across its collection. Titled the Artist Portal, the service will allow artists to upload images, videos, audio, and other works, and will then receive a monthly donation of $100. The museum will create a digital version of the artist portal, the MoTech platform, and will donate 100 percent of the profits made by artist-uploaders to the American Red Cross.“We felt it was important to", "The next Biennial should take place in 2020. The exhibition will feature new and previously untitled works by the artists represented in the exhibition, which will be curated by an international jury comprising Richard Hofmans, Léonide Durov, and Rajiv Gupta.\n\n\nThe Royal Academy of Arts (RA) in London announced today that it has awarded a contract to a Dutch artist to create a new work for the upcoming exhibition “Betrayal of Kings,” which will open in the British royal museum in London on November 15. The artist is Tobias Wanger, who will create a three-channel video installation for the event entitled The Fall of the House of Usher, A.K.A. The Fall, A.K.A. The Fall, (Dieter Zems) (Netherlands). The installation will feature the artist’s works in a series titled “Playback: The Fall of Usher.” The work will also be a digital installation that will be free to the public, and will be painted by the artist himself—the installation is a part of his ongoing project “Wangechi Mutu: A Decade of Painting” (2017–18", "The next Biennial should be held in 2020. The Finalist will be selected by a jury comprising Po-An and Wu-An; Ajaz Ahmad, director of the prestigious Central Library of Art in Beijing; and Nie Qin, director of the Beijing Art Museum.\n\n\nThe Museum of Southern Art in Louisville, Kentucky, has appointed Trevor Schoonmaker as its next dean of the school. The appointment came after the institution received a $500,000 donation from the Saint Louis–area nonprofit the Saint Louis Art Museum. The gift is part of the organization’s new $1.2 billion campaign to restructure its operations, which will give the institution a new building, a new building design, and a network of new programs and events.“Trevor Schoonmaker is a prolific and savvy curator whose breadth and expertise in art history, scholarship, and curating make him uniquely qualified to lead the biennial,” said museum director Jim Naught in a statement. “We are incredibly excited about his appointment and anticipate a great future with his talented team. His experience in the art world, in rural communities, and in urban settings will be of tremendous value to our visitors and audiences.”Schoonmaker", "The next Biennial should be held in the spring of 2020. The museum will extend the production run of the new exhibition “The Body,” with a further ten weeks of programming. “We are aware of the protests and we have listened to them,” Paul Mpagi Sepuya, the director of the museum, said. “We are prioritising a strong and stable future for the Biennial.”\n\n\nThe Museum of Fine Arts (MFA) in Boston announced on Monday that it will remain closed until February 3, in an effort to minimize the impact of the ongoing coronavirus outbreak. The closure is also part of the strategy to reduce the number of flights impacted by the coronavirus. The institution, which has been open since March 21, will reprise the day-night schedule on February 28, the first day of the pandemic. The reopening date of the museum is also five days earlier than the Museum of Fine Arts’s usual opening date of March 21.MFA director Robert Cipolletta announced the initiative in a letter to the Museum of Fine Arts’s board of trustees, which was sent earlier than the institution’s", "The next Biennial should take place in 2021. \n\n\nLocal governments throughout the United Kingdom are planning to hold their first general assemblies to address the country’s energy needs and the local communities that rely on it. While the first one was held in Aberdeenshire, England, in March 2019, the assembly process is ongoing\u0097some local authorities have yet to announce their interest in holding another.“The assembly is a vital step in addressing the climate emergency and is the only viable option for thousands of local authorities across the UK who do not have the financial or political means to adapt to the challenges posed by climate change,” said Jo Matson, executive director of the Union of British Columbia Municipalities (UBCM). The UBCM also works with local governments to develop community-based strategies to reduce carbon emissions and help them prepare for and cope with climate events.In an effort to help local authorities prepare for the impacts of climate change, the government set up the Climate Emergency Preparedness Fund in March 2020. The fund provides a one-time $10,000 grant to help with the costs of adapting to climate change-related events and threats. The fund can be used up to $5,000.To apply for aid", "The next Biennial should be held in February 2020 and will be curated by the San Francisco–based artist Yoko Taro. Inaugurating the exhibition will be the artist’s first solo exhibition at the venue since 2019. The first museum exhibition pertaining to the series is currently on display in the San Francisco Museum of Modern Art (SFMoMA) and will go on view in April.The exhibition will focus on the life and work of the late Soviet artist Andronikos Ghebaly. The curator of the show will be the late sculptor Ivan Edelman, whose work was featured in the biennial’s “John Lee Montal,” and will also feature a selection of photographs by the late American photographer Robert Irwin. The show will be organized with the assistance of SFSU art historian and curator Andrew Kluge.Artadia will also include a documentary in the form of a performance and a selection of works by the late American artist and activist Orson Welles. The biennial will return to the Larkin and will be inaugurated by a performance by artists including the late American painter, actor, and sculptor Harry Belafonte, and the American singer and songwriter Whitney Houston. The inaugural exhibition will be", "The next Biennial should be in 2021. The next Art Biennials should be held in 2022. The next Art Awards should be held in 2022. The next Art Museum Biennials should be held in 2023. The next Art Talks should be held in 2022. The next Art Venues should be held in 2022. The next Art Tours should be held in 2024. The next Art Experiences should be held in 2024. The next Art Fairs should be held in 2020. The next Art Lectures should be held in 2022. The next Art Biennials will be held in 2021. The next Art Travel Exhibitions will be held in 2021. The next Art Lectures will be held in 2022. The next Art Travel Events will be held in 2021.\n\n\nThe National Geographic Society recently announced that it plans to eliminate fifty-six galleries and museums within its United States headquarters in Washington, DC, by the end of the year. The news comes on the heels of the 2016 announcement that it was planning to shutter fifty-two, which would have taken place in 2021, and follows the news that the majority of the world’s art is being stored in warehouses, and that", "The next Biennial should take place in June 2021. The full list of participating artist-run exhibitions is as follows: 1. 2. 3. 4. 5. 6. 7. 8. 9. 10. 11. 12. 13. 14. 15. 16. 17. 18. 19. 20. 21. 22. 23. 24. 25. 26. 27. 28. 29. 30. 31. 32. 33. 34. 35. 36. 37. 38. 39. 40. 41. 42. 43. 44. 45. 46. 47. 48. 49. 50. 51. 52. 53. 54. 55. 56. 57. 58. 59. 60. 61. 62. 63. 64. 65. 66. 67. 68. 69. 70. 71. 72. 73. 74. 75. 76. 77", "The next Biennial should be held at the Institute of Contemporary Art in Berlin in 2021. Its next edition will take place in September 2022.\n\n\n\n\n\n3. The New York Public Library\n\nThe third edition of the Javits Center, which opened in September 1971 and moved to its current location in summer 2012, is now available online. The fourteenth edition, which took place in February 2022, was held in the same building as the 2010 and 2022 editions of the fair. The museum has also added thirteen galleries to its collection, marking the first time that the New York Public Library has added thirteen galleries to its collection in its fourteen-year history.The new exhibition, titled “The Future Is Present,” will feature four new works by contemporary artists including Eswin Berlin, Xavier Hufkens, Sylvia Atkins, and Carlo Alpi in addition to the works of several twentieth-century masters. The exhibition is curated by Jonathan Bernstein, who previously served as director of the Museum of Modern Art in New York and as curator and director of the Center for Media at the Museum of Modern Art, Los Angeles.“This is a very important collection,” said Bernstein. “This is a", "The next Biennial should take place in the spring of 2020, at which point the exhibition will be moved to the museum. In the meantime, the exhibition will continue to present work by artists whose works are currently on display.\n\n\nThe Hirshhorn Museum in Washington, DC, announced today that which artist, or group of artists, is currently receiving the Holmes Endowment. The institution is one of five museums in the US that benefit from the $6.7 million grant, which is made by the John D. and Catherine T. MacArthur Foundation, to encourage the creation of new public art and the preservation of art. This year’s prize recipients are Kenneth Williams, Andrew Kreps, Carol Ingalls, and Hermann Hesse. The list of winners is as follows:\n\nAndrew Kreps, New York, NYC\n\nKenneth Williams, New York, NYC\n\nDiana S. Bradley, New York, NYC\n\nInês Bonilla, New York, USA, Honored as the Holmes Prize Laureate\n\nEleanor Skipper, Chicago, USA\n\nLalla Ward, New York, NYC\n\n*", "The next Biennial should focus on “My Struggle” (2018), an ethnography of the Russian Revolution, and “Ateliers Halipolite.” Both exhibitions will be in the museum’s Centro de Cultura Rupestres (Culture and Science), which was founded by the late biennial curator Susana Mendieta, and will be inaugurated by a performance, “On the Place of Martha Cooper in American Art,” which will be followed by a museum talk titled “Avant-Garde and the Dreamers,” which explores Cooper’s legacy. The Biennial of Modern Art will be held in the museum’s Academy of Fine Arts, a former state-owned enterprise, in the capital, Tbilisi, the birthplace of Georgia’s founding president Eduard Chikov. The exhibition will be organized in the same fashion as the Biennial of Modern Art, with the same artists represented in the inaugural exhibition, “The Third Organ,” which will be held in the museum in March. The fifth edition of the biennial, “The Art of Life,” will be held in the Georgian capital in November", "The next Biennial should focus on “pursuant to the principles of the second, a more sensitive and individualistic conception of the concept of art; and should explore the question of the relation of art and culture in a different way.”The exhibition will run from the end of March until the end of May. The opening will coincide with the 150th anniversary of the Adolph Stuhl (1894–1997) and the opening of the first exhibition dedicated to 'Modern Art” in Munich. While the exhibition will be centered around the theme “art and art history,” the exhibition will include works by artists such as Mèdel Ben-Ari, Wen Ho, Oskar Kokoschka, and Richard Avedon. In addition to works by contemporary artists, the biennial will feature some 150 artifacts, including the first pictures of infected children, photographs by Lars Neumann, and artworks by Paul Gauguin and Pierre-Auguste Renoir.\n\n\nThe Los Angeles County Museum of Art (LACMA) has announced that it is preparing to welcome visitors to its new space in the San Fernando Valley. The institution will open the facility, called the Los Angeles Museum of Art (LAL", "The next Biennial should focus on the history and future of public art, as well as on the role of art and culture in shaping social change. The fourth will focus on the relationship between political and cultural institutions, and the fifth will address contemporary issues of climate change. The Silver Medal—which will be presented by the president of Italy, Santiago Dallù, in the first event of the week—will be presented by the president of South Korea, Park Geun Hye, in the second event. The 2019 edition of the Biennale is scheduled to open in March. The exhibition will also feature the work of the Italian artist Dario Cattelan and the artist-activist Mila Bonetti.\n\n\nThe Carnegie Museum of Art (CMA) in Pittsburgh, the Museum of Modern Art (MMAD) in New York, and the Metropolitan Museum of Art (MoMA) in New York have released the first measures designed to address the climate emergency. The institutions—which collectively have more than 4,500 employees and draw an average of 40,000 visitors a day—announced on Tuesday that they would commit to reducing their greenhouse gas emissions by 25 percent on their buildings’ roofs and by 60 percent on", "The next Biennial should take place in 2023 and the first in 2024.\n\n\nThe Museum of Modern Art (MoMA) in New York has hired Alison Brewer as its next director. Brewer comes to the institution from the Los Angeles County Museum of Art (LACMA), where she has spent the last eighteen months leading the Imagination Lab. During her tenure at LACMA, she has built a reputation as a strong advocate for the Imagination Lab’s mission of supporting artists and their work through a series of exhibitions that challenge the limitations of museum-based research and museum priorities.“Alison is skilled, passionate, and talented, and has demonstrated her ability to advance the Imagination Lab’s research and curatorial priorities through collaborations and exhibitions in important galleries and museums internationally,” curator and LACMA director James Cuno said in a statement. “Our vision is to be a major center for arts and culture in Los Angeles and beyond, and we are excited to see where she will take the Imagination Lab next.”Brewer has served as the director of the Imagination Lab since 2014 and has coordinated sixteen exhibitions since her arrival. She has also curated numerous documentaries, including “The World Is Not Enough", "The next Biennial should focus on: “Avant-Garde Art in the Age of Mechanical Reproduction”\n\nThe Museum of Modern Art (MoMA) in New York is preparing to unveil the newest iteration of its Global Village, a series of urban farms that will serve as a home for artists and families. Titled “Avant-Garde: From the Land to the City,” the project will bring together forty artists, including Paul Gauguin, Pierre-Auguste Renoir, and Pierre-Auguste Sorel, and will culminate with a biennial exhibition.“The artist-families who will be living and working in this community over the course of the biennial have said that it’s the perfect setting for their work and it’s the perfect time for their work,” said Antonio Cervantes, director of the Center for the Visual Arts. “The artist-families will be participating in the exhibition and the biennial together and MoMA will be a home for that work.”The Central Library in New York City will also host an exhibition dedicated to the works of the forty-three-man collection, which comprises works by Claude Monet,", "The next Biennial should also explore the social, political, and economic effects of the pandemic on urban and rural life in Argentina, as well as the legacy of the late Argentinian leftist president, Nestor Kirchner, who championed environmental causes and cut the country’s ties with the World Health Organization in 2003. While Argentina has yet to officially declare a victory over the virus, Kirchner’s legacy is being closely watched by other Latin American countries that were also trying to take advantage of the Covid-19 pandemic.Brazilian President Jair Bolsonaro, who led the country through a severe recession and a recession-like rate during which the economy contracted by 13 percent in the second quarter of the year, has been vocal in his praise of the biennial’s organizers, who he described as “cooperating with the public and with all the necessary measures,” adding that he believes the reopening of the biennials will not only “provide a period of recovery, but also lead to new opportunities for Brazil to become an internationally competitive and attractive partner for the world economy.”The biennial’s organizers have also made it clear that the next edition of the exhibition will be about", "The next Biennial should take place in Beijing in 2022. \n\n\nThe 19th Venice Biennale, “Theatre of the Present,” is now on hold, emerging from a hiatus due to Covid-19, until February 20, 2024. The exhibition, which features approximately one hundred works by forty artists, will reopen on February 21, 2024. \n\n\nThe Smithsonian’s National Gallery of Art in Washington, DC—a major cultural institution that underwent a major renovation and expansion in 2016 as part of a $450 million expansion—is facing a legal complaint from a group of plaintiffs that say the renovation, which involved the demolition of the old building, violates several of the landmark 1874 constitutional rights. The plaintiffs are filing a lawsuit in the US District Court for the District of Columbia, which is seeking an emergency temporary restraining order to prevent the plaintiffs from removing the works, as well as an injunction to prevent the defendants from detaching the works or damaging the building.The defendants are represented by Arnold & Porter, the law firm that represented the plaintiffs in a lawsuit brought by a group of owners of a historic 1910s brick factory in Alexandria, Virginia, in a New York district court in January. The factory is a", "The next Biennial should take place in 2020, according to a statement. The announcement came a day after an exhibition at the Venice Biennale, titled “The Grand Illusion,” that examined objects as disparate as Stonehenge and the Pyramids. The show opened on Friday, March 3, and runs through March 4.The Venice Architecture Biennial, which is currently being staged in full exhibition form, will focus on the history of architecture in the city-state. The 2020 iteration of the event will feature more than 300 works by sixty artists. Originally scheduled for March 25–March 30, the event has been moved to April 8–April 10.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, has released the final list of twenty-six artists who will participate in the 2020 edition of the Metropolitan Museum of Art (MMOM), which will take place in the city from March 5 to March 8. Among the works on display are works by artists such as Frank Gehry, A.I.R. Gallery, and Adam Pendleton.“We are thrilled to present the final artists list to the public as this is the most comprehensive survey of the 2020 cohort we have ever conducted,” said Richard Armstrong, director", "The next Biennial should take place in Chicago next year and will likely be held in 2021. The first iteration of the event, titled “Vision Zero,” was held in 2021.\n\n\nThe Museum of the City of New York has released the design specifications for the second iteration of the New York City Foster Care Pavilion, a $200 million renovation and expansion of the Metropolitan Museum of Art, which is currently under construction. Designed by the firm Wiedefeld & Partners, the pavilion will offer flexible housing, education, and work spaces for artists and small- to mid-size galleries. The $200 million expansion, completed in 2017, and introduced in 2021, is expected to generate $140 million in additional revenue.The pavilion, which will sit on the fifth floor of the Museum of Modern Art, will be made up of three interlinked areas: a gallery, a research library, and a public plaza. The gallery will host artists and small- to mid-size galleries in a building designed by Gensler, and the library will serve as a collaborative gathering place. The plaza will also host low-income housing projects and serve as a public gathering space.“The Foster Care Pavilion is a unique project that will connect the Museum of", "The next Biennial should be held in February 2021, when the exhibition will mark the centenary of the opening of the museum.\n\n\nThe Meredith Gallery in New York announced today that it is going to open a new, independent arts space in the city. The space, which will be in a former factory on East Twenty-Third Street in Manhattan, will be called the Meredith Gallery for Art. It will be able to hold up to two hundred visitors. The first exhibition of the new institution will open in February 2020.The announcement marks the first time the gallery has opened its New York outpost. Inaugurating the space will be an exhibition of works by artists such as Amy Adams, Robert Irwin, and Lawrence Abu Hamdan. The opening will coincide with the city’s annual March for Art, which will last March 21–April 2. The gallery will also host a series of monthly performances, which will take place at the new venue at 700 East Seventy-Third Street from March 13–March 20, 2020. The first show by artist and scholar Diana Lewis will unfold over six nights in March 2020 and will feature works by several artists, including Andreas Ekstrom, Barbara Kruger, Mark di Suvero, and John Goodman.Commenting on", "The next Biennial should also examine the role of the theatre within the national economy and the city’s cultural sector and aim to consider how the arts and culture play a role in providing a modicum of social support through the community and we encourage you to engage with local artists, experts, and the local community in order to understand the cultural and social needs of your city and its surrounding areas.”The Biennial will be staged at the venue of the National Gallery of Art, which occupies a former brick factory on the ground floor of Georgetown’s old Standard Oil building in Georgetown, and will be led by German scholar Monika Hauser, curator of contemporary art for the exhibition “Unstoppable.” This is the fourth iteration of the biennial, which has taken place annually since 1987. The past editions were screened by Jacques Delorme and Alain Guiraudie (the French duo behind the contemporary art show at the Museum of Modern Art), and were hosted by Martin Scorsese and Jean-Michel Basquiat (with the American artist and painter John McGrath).MIDWESTAK, a German firm that represents the Italian artist and designer Emilio Paratino, will unveil its new design for the", "The next Biennial should be announced by the end of the year. \n“I’m excited to see what will become of the Biennale,” said Michael Kort, president and CEO of the museum. “In this age of unprecedented crises, when people are being killed in vast urban areas, and when the world is being diverted from the mission of art to that of politics and the economy, it is my duty as the president of the Czech Republic to provide perspective and direction for the exhibition. I hope that the show will continue to be a source of inspiration for many.”Kort, who helmed the Biennale from 2001 to 2008, also serves as chair of the Arts Council of the Czech Republic and of the Arts Council of the Czech Republic’s partner institutions. \n\n\nAfter a New York City jury found Levitt and company guilty of violating the Unruh Act by working in close proximity to the site of a nuclear plant and found that their work was used as part of a “massive public health campaign that was coordinated with the city’s environmental and planning officials,” the jury returned a verdict that imposes a fine of $1 million on Levitt and two other New York", "The next Biennial should be held at the PanAm Games in London, which is slated for 2021, and will be held at various venues across the city.The exhibition will be curated by Amelia Fung and will be inaugurated by a retrospective of the artist’s work at the Art Gallery of Hong Kong (AGHK), which is located in the Art Deco district of Hong Kong, as scheduled. The exhibition will also feature local artists, including Zhaia Obermayer, Taizong Wu, and Zoya Jia, and will be organized by the Gallery of Modern Art, Hong Kong; the Gasworks Contemporary Art Center, Hong Kong; and the Museum of Modern Art, Hong Kong.\n\n\nThe Museum of Fine Arts (MFA) in Los Angeles is expanding its curatorial practice in the United States by bringing on as many curators from abroad as possible. The institution has established two partnerships with the MFA and the Art School of Chicago to add more curators to its staff, and has added five more international artists to its roster since it opened to the public in 2007.“We are thrilled to welcome these artists to Los Angeles,” said Marc Glimcher, the MFA’s executive director", "The next Biennial should be held in 2021, and the exhibition’s twenty-third iteration will be staged at the Museo del Instituto de Arte Contemporáneo (MASI) in Madrid from January 25 to January 28, 2021. The event will feature an exhibition of work by contemporary artists from around the world.In celebration of the fifty-fifth anniversary of the award, the Museo de Arte Contemporáneo and the Grand Prix de Paris will present the inaugural exhibition of works by the selected artists, which will be followed by an exhibition devoted to the Biennial’s fifty-sixth anniversary in 2021. The twentieth edition of the Biennial will be held in 2022. In addition, the exhibition “Between the Sun and the Moon,” which will be on view through November 22, 2022, will be relocated to January 27, 2022.The theme of the twentieth edition of the Biennial is “Walking in Space.” The exhibition will be organized as follows:January 13, 2022: The exhibition will be moved from the Science Museum to the Museo del Instituto de Arte ContemporáneoFebruary 8, 2022: The exhibition will be moved from the Museum", "The next Biennial should be ready by May 2020.\n\n\nThe Metropolitan Museum of Art (the museum) in New York announced today that it is preparing to welcome visitors back to the institution next month following a temporary closure due to the Covid-19 pandemic. The institution announced on March 31 that it would open on March 26, 2020 but then postponed the event, citing the Covid-19 pandemic as the reason.Following an outpouring of support from the public and museum professionals, the museum decided to re-open with a full staff and board membership membership membership membership that includes Felicia, the first director of the Metropolitan Museum of Art, and her husband, Frank; their daughter, Ariana; and their son, Chase.“The next few weeks will determine whether the Met is able to reopen—and we will continue to work toward that goal with the full support of the city,” said Frank. “We hope that next month will be a turning point in the Met’s history, when the museum will be able to return to its original vision for the building, which includes a new artist-in-residence program, a larger public courtyard for the museum, and the new artworks by the late Henry (19", "The next Biennial should certainly be a step in that direction.”\n\n\nThe Pasadena Art Museum (PAMM) has received a gift of more than twenty-five works by artist Daniel H. Wilson, whose work explores themes of race, religion, and economics in a variety of media. The works are part of a series that will mark the museum’s centennial year.“Daniel H. Wilson, ‘Contemporary Art, Race, Religion, and Economics,’ is an exceptional example of a godfather of the art world,” said Roberta Williams, the director of the Pasadena Art Museum. “He was devoted to the art of art and devoted to helping other artists achieve the art of art.”Wilson, who will be buried in Pasadena, is survived by his son Alejandro, who was born in the city of Mexico City in 1961; his daughter María, who was born and raised in the Los Angeles area; and his son Daniel Jr., who is twenty-one years old.Born in the city of Mexico City in 1961, Wilson moved to the Pasadena area when he was eleven, where his father sold plumbing and electrical work. The family relocated to the small town of Pasadena, where Wilson", "The next Biennial should be set in the village of Tel Pabang, in the Clark Range of the Andaman and Nicobar Islands, in the Bay of Bengal, India, between June and October 2020. The 2019 event was a joint initiative between the Asia Institute, the Smithsonian American Art Museum, and the National Museum of Modern Art in Los Angeles and was co-organized by the Smithsonian Asian Art Museum and the University of the Philippines-Babangal (UPB). The exhibition, titled Endless Phenomenon (1961–2010), was curated by artist and curator Tony Tung. The 2019 theme, How Do We Live? was chosen from a list of ten and was presented by the late artist and former president of UPB, Nari Ward. The 2019 winner of the award, artist and curator Hamza Walker, said: “Through this exhibition I hope to be able to share my art and my practice with you.”The 2017 awardees were:Charles A. Paul, Jorge de los Reyes, Marco Altimore, Matthew Arnold, Merry Brewster, Karen Button, Rory Carroll, George Colley, Renzo Esposito, Michael Landreth, Y", "The next Biennial should be held in 2019. The next exhibition should be held in 2020. The next symposium should be held in 2021. The next exhibition should be held in 2022.  The next exhibition should be held in 2024. The next exhibition should be held in 2025.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles, California, has appointed Hugo Ramos as its next president and CEO. Ramos succeeds Bernal Diaz, who retired on December 19 after nearly two years at the helm of the museum, and will assume his post in January 2020.“Bernal Diaz’s vision for the institution made MoCA a global phenomenon, and it was a bold and highly ambitious project,” Ramos told the Los Angeles Times. “My strong belief is that he never set out to do the job of President. He always had a long-term strategy, and I always worked within that.”Prior to joining MoCA in 2015, Ramos served as a senior curator at the Los Angeles County Museum of Art (LACMA), where he worked as curator of contemporary art for the past two years. His curatorial projects include “The Painted City: Art and Public Space in", "The next Biennial should be held at the Østfold Museum in Stavanger, the Kunsthalle Basel, or the Museum Folkwang, and will feature a selection of works that were commissioned by or featured in the German pavilion in the upcoming edition of the Festival d’Art Contemporanea Berlin. The reopening of the museum and the Hansa Gallery will take place in the spring of 2020. The third edition of the award will be held at the Museum of Contemporary Art Basel in Beijing in December 2021. The prize jury comprised Eva Schaechter, director of the Kunsthalle Basel; Carola Strasser, director of the Kunsthalle München; Roger Salomon, director of the Art Archive in New York; and Jochen Schäfer, executive director of the Association of German Museum Directors.\n\n\nThe Museum of Contemporary Art (MoCA) in New York has named Roberta Smith as its next executive director. Smith will assume her new role in January 2021. Previously, Smith has been a board member of the museum since 2015. During her tenure, she has organized several exhibitions, including “The New Museum” (2017) and �", "The next Biennial should be held in 2020. \n\n\nThe Art Newspaper has revealed that the next edition of the weekly art fair will feature work by new and established artists, as well as the 2019 exhibit, “Technically Incorrect: A–Z,” which was curated by the Los Angeles–based architect and his collaborators. The exhibition will run from January 24 through February 12, 2020.The format of the biennial will be similar to that of the previous edition, which was held at the Los Angeles–based nonprofit arts incubator AngelPad. The pavilion will be divided into two sections, one for the art world and the other for the general public. In the first section, CAFAM will present art from its collection, which continues to grow in number, and will present a selection of works by artists in the categories of sculpture, photography, installation, performance, and painting. The second section will be established as a platform for the artists to present work in a forum set up by CAFAM and will feature the work of selected artists from the exhibition curated by Janet Bloomfield, director of the Los Angeles County Museum of Art.The theme of 2020’s “Technically Incorrect: A–Z” is", "The next Biennial should be the last one, and will be held at the Museum of Contemporary Art Chicago (MoCA), until December 25, 2020. The exhibition will be relocated to the city’s Near East Side and will employ a new public art installation, a new writing group, and a new design.\n\n\nThe National Gallery of Scotland has been made aware that it will not be able to reopen as planned due to a new health crisis. According to the Daily Record, the Royal Academy of Arts in Scotland announced that it is expecting between eighty and ninety deaths in the country as a result of Covid-19. The Royal Colleges of Art and Design (RCAD) in London, the School of the Art Institute of London (Sirlin), and the Edinburgh College of Art (Edinburgh) have all reported a surge of visitors to the galleries as a result of the pandemic. The Royal College of Art’s director, Alex Craig, told the Daily Record that the health crisis is distorting the exhibition schedule, and that the institution is “very much in a state of disruption.”In a statement, Craig said: “Perhaps the most worrying aspect of this whole situation is that we are not preparing", "The next Biennial should take place in the autumn of 2021.\n\n\nThe Museum of Fine Arts (MMFA) in Miami Beach has appointed Susanne Fung as its new executive director. Fung will be responsible for ensuring the long-term management of the museum, which has faced several major renovations in the last five years, including the renovation of the museum’s modernist, Expressionist-era building, the MFA’s Wallace Collection, and the MCA’s new contemporary art museum.“Susanne’s track record of growing museums and driving their expansion is recognized throughout the country and is widely considered to be among the most accomplished in the field. We are grateful to her for her leadership and vision for the MFA,” said Mark Lowenthal, the museum’s director and CEO. “As we embark on a new chapter in the museum’s history, we look forward to working with her to further the museum’s mission and to achieving the museum’s revitalized aesthetic through innovative approaches to presenting contemporary art.” Fung comes to the MFA from the University of Miami, where she serves as a senior advisor to the building and renovation of the new MCA", "The next Biennial should take place in the summer of 2021. Lévy Gorvy, which represents the French artist Etienne Leclerc, will hold a retrospective of the artist’s drawings at its Paris location in 2020, with a new edition scheduled to open in July 2021. While the new exhibition is expected to highlight the contributions of the artist to the development of modernism, the exhibition will also examine the ways in which artists have been influenced by the artist-in-rear. Since the exhibition will focus on Leclerc’s drawings, its outline will be drawn from a similar vein to the London-based institution, which was founded by the American artist Jane Nkiru.Matthew Swallow, chairman of Lévy Gorvy, said: “This is a significant year for art and the first time it will be held in Paris. We are delighted to welcome the artist to Paris in 2021 and look forward to his exhibition in 2020.”\n\n\nSeveral hundred workers at the Mira Nord-Jacobin Center for the Arts in New York have voted to form a union, the Teamsters Union, and will begin bargaining with the New York Department of Cultural Affairs (DCLA) in an attempt to reduce costs", "The next Biennial should be held in 2022. The exhibition will celebrate the life and work of R. H. Muro, the first African American director of the New York Film Festival. Its opening will be on September 29.The 2019 edition featured works by forty-two artists, including a selection of photographs by Alighiero Cattelan, who was one of the first to use color photography in the film canon; Maya Theen, who uses both her hands and the studio to express the lives of children; and Tito Pucci, who transforms wood into canvas. The exhibition is also a remembrance of the festival’s inaugural winner, the Italian prodigy Enrico Castiglione, whose work was on view in the museum.\n\n\nThe Koch Museum in Manhattan is being sued by artists Andrea Dwork and Vincent van Gogh for alleged copyright infringement. The dispute stems from an exhibition that was part of a major renovation project at the institution, a project that was completed in April and closed on March 31.The works were included in a collaboration, titled The Grand Illusion, (2019), which was presented by the Koch’s Emily Hall and Daniel H. Weiss. The work was commissioned by the former director of the Center", "The next Biennial should bring together the largest and most diverse range of artists from all over the world in a single exhibition, to provide an inclusive platform for their creativity. The exhibition should focus on the work of emerging art-world figures, and should be a reflection of the spirit of New York.We look forward to working with the artists and organizers of this year’s Biennial. The exhibition will be inaugurated by a special exhibition of works by Sissies of the Arabian Nights, which was staged at the Museo del Architecture in Madrid, and will be closed by the end of the month.\n\n\nThe Museum of Contemporary Art (MoCA) Japan has announced its representation of the Indian artist G. R. Lal, whose colorful, layered, and interwoven works explore the role of nature in human existence. Lal, whose works offer a theory of social, cultural, and spiritual evolution, was included in the inaugural exhibition at MoCA in 2003. He was selected by a jury comprising Masaoka Atsushi, then the director, and Kiyoshi Kato, the CEO of the firm M.N.R. Design. Lal’s work is rooted in philosophy and aesthetics, and he often plays with metaphors to", "The next Biennial should open at least a week early, with the exhibition slated to run from November 22 to March 23. The first show of the series, “The Five Pillars of Conceitedness” (2013), was staged at the Budapest Art Museum. The second, “The Rise of Modern Art,” was staged at the Museo del Barrio, Marino, and will be on view in March.The new exhibition will be themed “The Landscape and the Landscape-Landscape,” an amalgam of environmental critiques, including the literary and cultural critique of the period. The exhibition will take as its themes the physical landscape, both in terms of the landscape itself and in relation to the particular histories of its inhabitants, and will focus on the biennial’s “beginning,” “middle, and end.” The exhibition will also explore the idea of “landscapes as a unity of all the world’s peoples; as a unity of all the peoples of the world; and as a unity of all the peoples of the world.”Commenting on the forthcoming exhibition, Sophie Stander, director of the agency and development arm of the museum, said:", "The next Biennial should start soon and will feature works by up and coming artists. “We have been working with the artists for more than two years and appreciate their confidence in us and their work,” said organizer Guadalupe Guirado. The first round of the biennial will open in the fall of 2020 with the exhibition “Culture, Politics, and the Arts.” Six artists will be chosen from each of the fifty participating countries\u0097including three from the Americas, Europe, and Asia\u0097and will each receive one hundred thousand Francs. The biennial will then open in January 2021 with the exhibition “Feminine.” The third part of the triennial will be held in March 2021. The exhibition will be hosted by the National Museum of Fine Arts in Barcelona. The exhibition will be curated by Carlos Aleman and will be hosted in the museums of the National Museum of Fine Arts and the National Museum of Modern Art in Tokyo.The 100,000-piece exhibition “Feminine” was commissioned by the actress and choreographer Selina Meyer and will be held at the National Museum of Fine Arts in Barcelona, the National Gallery in Beijing, and the Palazzo Re", "The next Biennial should take place in 2022. The theme of the event is “1620s America: The Present.”\n\n\nThe National Gallery of Art and the Kölnischer Kunstverein in Germany—the country’s two largest art institutions—are facing a legal complaint from artists and collectors for their failure to protect the intellectual property of the iconic site where the final work of Pablo Picasso is on display for the first time in the city of König, Germany. The complaint claims that the National Galleries of Fine Arts (NGU) and the Kölnischer Kunstverein violated the Lanzmann-Bickel-Stiftung (German for \"Lanzmann-Bickel’s Prescription\") (2009) by refusing to pay them royalties for works that were in poor condition when they were acquired.The complaint was filed by Düsseldorf-based artist Ingrid Schirmer in September 2018. In order to avoid a copyright infringement lawsuit, the National Galleries of Fine Arts (NGU) and the Kölnischer Kunstverein agreed to pay the artist $27.5 million and $24 million, respectively. However, after", "The next Biennial should be held in 2022, with the work\u0097or rather, the opportunity to be present at the exhibition’s conclusion\u0097to be determined by the organizers.\n\n\nThe American Fine Arts Museum (AFA) in New York has announced that Audrey Aziz-Sittre, a longtime curator and expert in African American art who worked as a curator at the museum from 1967 to 2002, has died at age eighty-eight. She is survived by her daughter, Beverly Aziz, who is director of the AFA.Born in 1941 in Newark, New Jersey, Aziz-Sittre earned her MFA from the University of North Carolina at Greensboro in 1957 and trained in art history at the University of Washington in Seattle in 1957 and 1958. She eventually moved to Harlem to teach at the University of Missouri, Columbia, but her academic and professional pursuits shifted to painting, sculpture, and photography. In 1960, she moved to the AFA, where she would serve as director of exhibitions for sixteen years, and in 1964, she was elected as a fellow of the American Academy of Arts. During her tenure, she organized “The Negro” (1964), “Feminism and the African Diaspora", "The next Biennial should take place in 2020. \n\n\nThe Museum of Contemporary Art (MCA) in Chicago has appointed Thomas J. Barr as its next director. Barr will be responsible for overseeing the development and execution of the institution’s new master plan, which will address the museum’s impact on the city, the community, and the state of Illinois.“The master plan will demonstrate how MCA can become a meaningful partner for the city of Chicago and the state of Illinois and serve as a model for the transformation of local, regional, and federal government-owned spaces in the city, while addressing the cultural, social, and economic needs of an ever-changing city,” said Barr. “Building on the museum’s success as a cultural and creative anchor in the city, the city of Chicago, and the state of Illinois, the plan is a blueprint for how an urban museum can evolve into a transformative cultural center and a model for how a city can be revitalized.”In his new role, Barr will assume his responsibilities on June 10 and will report to the city’s director, Andrew Nelms. The museum has already received a $500,000 grant from the city.“", "The next Biennial should be announced soon.\n\n\nCinemaTec, a Swiss manufacturer of filmmaking equipment and production equipment for video, announced today that it has entered into a long-term partnership with the French Ministry of Culture. The company’s newest system allows the visual arts to be presented to audiences in Paris. The new variant, which is currently in development, is called the VisionCG, and it will be presented at the Museum d’Art d’Histoire (Barcelona), the Guggenheim, and the Louvre.“It provides a new way to connect artists and audiences with visually rich works,” said Ernesto De Guzman, the president of the company. “The VisionCG will be especially useful for visual art, which has historically been the most inaccessible of the arts for many, and is consequently the most under-recognized. The VisionCG will enable us to present works from the company’s collection in a more accessible way, and in a way that will be especially relevant for the visually impaired.”Described as a “first step in the development of a new generation of visual art tools,” the vision CG will allow filmmakers to create and present their own", "The next Biennial should be in 2022. The next edition will be the last, with the last act, “No More Deaths,” taking place on January 21, 2020. \n\n\nThe City of Los Angeles announced today that Itahki Danla, who was the artistic director of Artspace LA, has been appointed as the next artistic director of New York’s Lincoln Center.Danla will take the helm from Chelsey Breslin, who currently serves as the associate curator of modern art at New York’s Metropolitan Museum of Art, on January 6. During her tenure at the arts space, which has an annual budget of $75 million, she helped shape the exhibition program for the 2016 iteration of Lincoln Center’s Super Bowl, which the organization backed with $45 million; launched its digital platforms and tools, which have been used by more than 2 million visitors and have generated more than $1 billion in revenue for the organization; and introduced free early bird tickets to many of the institution’s partner organizations.“I’m honored to be taking on this role,” said Danla. “This is a spectacular year for arts and culture in the city of Los Angeles, and", "The next Biennial should be in 2022.\n\nIn a statement on the upcoming event, the Arts Council, the London-based nonprofit that represents the British Museum, said: “We have been working closely with the National Galleries of Scotland and the National Museum of Scotland to ensure the exhibition is consistent with the National Gallery’s mission. The exhibition will feature works by more than fifty artists from the collection, including Anne Sorensen, Yoko Ono, and Anish Kapoor, as well as works created by or inspired by the artists whose works will be on view. The exhibition will also be an extension of the National Gallery’s relationship with the artist-run creative and cultural space the Biennial. This new partnership is an extension of the National Galleries’ efforts to provide more opportunities for artists and young creatives to work together and collaborate. It is an extension of our longstanding commitment to artists and young creatives. Together, we will create a new kind of visual arts context, one that is open and connected not only to our communities but to the wider world.”The Biennial, which was founded in 2006 by Doris Duke and Peter Sellars, is currently run by a board made", "The next Biennial should take place in 2020 and will involve the creation of a new archive dedicated to the history of the twenty-first century, inspired by the work of artists such as Willem de Kooning, Ada Colau, and Renzo Piano. The biennial will comprise an exhibition of works by forty-three artists, including the Dutch-born, the French-allotted Lutz Bacher, the German-born, and the Italian-born Marcioni.\n\n\nThe Kensington and Chelsea Arts Centre (KBC) in south London has launched an online searchable database of more than three thousand works by fifty-seven artists in a time-intensive, five-week cycle, which will help galleries of all sizes mitigate the financial impact of Covid-19. The searchable catalogue will be accessible to anyone across the UK and will be made available to every KBC member, including the public, on Thursday, October 3, at 10 AM.KBC’s director, Adeppo Pindelli, said: “KBC members and supporters are acutely aware of the financial toll that Covid-19 has taken on our city and region. We are determined to do all we can to encourage and support artists and small", "The next Biennial should take place in October 2020. The theme of the 2019 event was “Body Art: Post-Medieval.”  In an email sent to the Arts and Culture Foundation, the New York–based museum said: “in light of the recent announcements regarding the 2020 Biennial, we are continuing to believe that the best way forward for the 2019 edition would be for the exhibition to continue with the same focus and to continue to be curated by the same team, as we have been for twenty-five years.” The Biennial has been canceled twice before. A 2013 edition, titled “Post-Modernism” staged by the London-based group New City, reemerged in 2017 as the seventh iteration of the BAM Festival. The BAM Festival is an annual festival staged in partnership with Tate Britain and is organized by the Tate. The 2019 edition of the event was set to take place at Tate Modern in London from March 14 to March 16, 2020.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has appointed Nadine Bonsu as its new director and CEO. Bonsu comes to the institution from the Philip Johnson-founded firm Johnson Communications, which she", "The next Biennial should be held in the spring of 2021. The exhibition will be organized as a series of two exhibitions. The first will feature the work of twenty-five artists, including Adriana Alencon, Filippa Nistor, Keiichiro Nagai, and Paul Lee, and will run for five days. (The second exhibition will be held in the fall of 2021 and will be organized as a biennial.  The 2020 edition featured work by seventy-two artists, including Alex Dzier, Julien Bricholes, Domenick Addai, and Shingo Aoki.  The exhibition will be presented in Los Angeles in June 2021.\n\n\nThree years after the 2013 London riots, the British Council, the British government body charged with overseeing the arts, has announced that it is planning to excise ten new works from the British Museum’s permanent collection. According to The Guardian, the new regulations will come into force on January 1, 2020.“As we carry out our annual review of our collections, we consider a number of things, including the condition of the institution and where we see the future of the collection,” British Council director Maria Balshaw told the paper", "The next Biennial should be held at least an additional three years, and the first seven years should be devoted to the study of several of the participants\u0097Alberto Burri, Eileen Cianfar, and Pilar Casals, among others who have shaped the twentieth century.“The biennial is a means of bringing together the artists who have shaped the contemporary art of the twentieth century, and to draw attention to the many disciplines that have shaped the art of the twentieth century,” said the curator of the museum. The 2018 exhibition, “Art and the Twenty-First Century” organized by the Biennial Congress will be held at the Palazzo del Piedra in Venice in December 2020.\n\n\nThe New York–based nonprofit the J. Paul Getty Trust has received a $150 million donation from the heirs of James Cohan, who passed away in Los Angeles on Friday, March 3, at the age of eighty-nine. The gift—the largest gift made by the trust in its forty-year history\u0097follows the announcement of a new James Cohan Curator-in-Charge, Jerzy Kosinski, and the establishment of the James Cohan Archives, a permanent collection dedicated to the artist", "The next Biennial should focus on the African diaspora within a contemporary African art context—an attempt to reconceive the history of Africa through the African diaspora. The biennial should reflect on the African diaspora as a whole, and its universal values and aspirations. The exhibition should also consider how the African diaspora has shaped and developed contemporary art, and how art can play a role in renewing and rebalancing the African continent. “We are deeply saddened by this news,” said Jean-Luc de Bruijn. “We understand that the new project will not be able to honor the memory of the victims of the terrorist acts, but it must nevertheless try to reflect the spirit of solidarity and empathy between artists of the African diaspora and the victims of the terrorist acts.” In response, Jean-Paul Elenodou, the director of the Biennale des Nations, said: “I don’t think there was any intention for this exhibition to be a biennial of remembrance. It was a conscious decision to create a space for reflection between the themes of the month, which are Black Lives Matter and art and a realisation of the tenet of the project, that art is", "The next Biennial should take place at the Museum of Modern Art (MoMA) in New York next March. The exhibition will feature work by twenty-five artists, including Laura Owens, Yinka Shonibare, and Sally Mann, and will run from March 13–March 16. In order to facilitate the exhibition, MoMA will offer visitor accommodations in both of the museum’s locations. The institution will also barter each other’s exhibitions for the remainder of the year, and will increase the stipends of artists participating in the exhibition.While the exhibition is sponsored by MoMA’s parent company, the Wayne Foundation, and the museum, the collaboration between the museum and Wayne was not new. Last year, the foundation offered $1 million for the first edition of the biennial, and $2 million for the second. Among the major works that will be showcased in the biennial’s first iteration are a six-thousand-work inventory of Wayne’s holdings made before his death in March 2019, a video exhibition of work by artists such as Claude Monet, and a survey of the family’s collection.A combination of public and private funding will be necessary to stage the exhibition, which", "The next Biennial should take place in 2020 and will be hosted by the architect Akram Gernani at the Institute for Contemporary Art, Mumbai. Other artists to receive the award include Sara Rosales, Zagratjali Srinivasan, and Sara Polations. The Category 7 award ceremony is scheduled for November 5 at the Akram Gernani Foundation in Toronto, Canada. The 2019 awardees were Abraham Chaudhri, Alessandro Mario, and William Chiang.\n\n\nThe Noble Gallery in London is planning to open a new flagship exhibition on the city’s former elephant pen, the Elephant and Castle, on January 5, 2020, in time for the UK’s Pride and Prejudice celebrations. The show will explore the relationship between art and the environment and will also feature work by artists such as David Hockney, Gertrude Stein, and Rex Tillerson and will explore how the environment can shape and shape people’s lives.Artist-centered venues such as the Elephant and Castle are a key element in keeping London alive and vibrant during the Covid-19 lockdown. The new show, titled “Covid-19: Art and the", "The next Biennial should be held in the spring of 2022.\n\n\nThe fortress of Palazzo Scola in Rome, Italy, where the Pizzeria Milano (Pizzeria Milano, the Italian name for Piedmont) is located, was damaged by a massive fire during a working party at the building in December 2018. Although the cause of the blaze at the north wing of the Italian capital was never established, the Pizzeria Milano is currently closed until at least mid-March and many of its employees and visitors have been ordered to stay indoors.The building, which was built in 1909, houses the museum Piedmontese, which is currently undergoing a major expansion. The Pizzeria Milano is slated to open in 2023, but the project has been plagued by delays, cost overruns, and cost overruns ever since it was awarded a $7 million loan from the local municipality of Piedmont in 2015.The latest setback for Project Piedmont came on February 3 when the Italian Culture Ministry reported that the institution had spent €5.8 million (about $6 million) on the renovation of the building since it opened in 1912, a figure that was revised to €7.7 million (more than $", "The next Biennial should commence in 2020, with the exhibition in the same venue, and will likely be held at the same site. The format will be similar to Art Basel Hong Kong, with a selection of contemporary art from the region curated by a select group of artists. “This is a moment of great change for the city of Basel-Westphal,” said Benoit Decaire, director of the Biennial. “We are grateful to the city of Basel-Westphal and to the Biennale de Haag for their cooperation and the invitation to engage with our young people and to learn from their art in using art to improve our lives.” The 2020 event will take place in the city of Westphal and will run from February 26 to March 22.A statement from Art Basel said it is “committed to supporting the civic initiatives of the region and is actively exploring the possibilities of connecting Curitiba with other great cities in South America.”\n\n\nThe Metropolitan Museum of Art has appointed Sharon Izenberg as its new artistic director. In her new role, which is expected to last for six months, Izenberg will be responsible for driving the next phase", "The next Biennial should be held at the Zentralarchiv in Vienna next year. The exhibition will highlight the work of twenty-five artists, including Paul Gauguin, Frank Gehry, M. C. Nees, and Jean Dubuffet, and will run from March 13 to March 16.  The National Art Center in Columbus, Ohio, has received $81,000 from the National Endowment for the Arts (NEA). The funds will provide funding for the NEA’s study of the relationship between art and the physical environment. The $81,000 is a “significant step toward the arts’ future,” said NEA director Peter Mackay. The Natural History Museum in London has received $63,000 from the National Lottery Heritage Fund. The funds will support the museum’s study of the history of the lottery and its influence on modern life. The National Galleries of Scotland has also received $63,000 from the Lottery Heritage Fund. The funds will provide funding for the institution’s conservation work and reopening. The two institutions are currently closed until March 13\u0097the National Maritime Museum and the National Galleries of Scotland", "The next Biennial should be a reflection of the tremendous political, social, and cultural upheaval that is taking place right now and, in the process, on the international stage. The theme should be “Postcolonialism”\u0097a statement that can communicate the challenges and opportunities that have been neglected by Western European countries.“Postcolonialism” will feature nineteen examples of cultural production and personal history that were made during and after colonialism. The exhibition will also include the work of twelve artists whose works will be featured in the upcoming exhibition “Postwar: The Politics of Art and Art History” in New York; the work of the late Pakistani artist Kamal Khan; and the work of the late Egyptian artist Mahmoud Saad.For the public, the exhibition is a chance to contemplate the legacy of colonialism and its impact on the present and future of the West African nation. “This exhibition is not about celebrating the past,” Alain Fourie, a founding member of the Five-Mille group, told the Art Newspaper. “It is about weaving together the recollections of present and future, and about creating an agenda for future action, an agenda for change that can be a tool for the regeneration of societies.”", "The next Biennial should be held at the Saint-Nazaire-le-Fleuriel, France, in the spring of 2021.\n\n\nA group of artists, intellectuals, and researchers have launched a campaign to have the National Geographic Society’s new book, The Anthropocene, retracted. The petition, circulated by the Project for the Future of the Anthropocene (PFA), a New York–based organization dedicated to the preservation of the human legacy, argues that the book is “simply not a scientific work.  It is a political statement that encourages fear and distrust.  It is an attempt to rewrite history to suit political ends. It is an attempt to minimize the impacts of climate change and to promote a new kind of civilization.”Since the 1970s, the scientists have argued that the human influence on the climate system is negligible and that the only way to curb climate change is to transition to a more renewable and sustainable future. However, the ethical concerns surrounding the management of carbon dioxide have led the PFA to withdraw its name from the book. The petition reads: “The Anthropocene is a political statement that encourages fear and distrust. It is an attempt to rewrite history to suit political ends. It", "The next Biennial should take place in 2021 and will be held at the Museum of Contemporary Art, St. Louis, with the support of the $10 million grant program from the Doris Duke Charitable Foundation. The fund is giving the $10 million to fund the design and construction of the exhibition, which will feature work by forty artists and collectives. The 2020 participants are as follows:Avant-Garde and FuturismMusician and composerNatalie DonatoniAfternoon Tea (Chinati)Carmen KellyMila MejiaLuther CampbellThirdWave (New Wave)Artists and Pioneers (New Wave)Artists and Pioneers (New Wave)Artists and Pioneers (New Wave)Artists and Pioneers (New Wave)Artists and Pioneers (New Wave)Artists and Pioneers (New Wave)Artists and Pioneers (New Wave)Artists and Pioneers (New Wave)Artists and Pioneers (New Wave)Artists and Pioneers (New Wave)Artists and Pioneers (New Wave)Artists and Pioneers (New Wave)Artists and Pioneers (New Wave)Artists and Pioneers (New Wave)Artists and Pione", "The next Biennial should be held in 2021 and the date should be decided by the Ministerial Council. Those interested in supporting the upcoming exhibition can mail a letter to the writer to the Department of Culture and Tourism, the Ministry of Education, Culture, Sports, and Science (MOES), and the Ministry of Foreign Affairs, headed by Miriam Vasey, dated January 2, 2021, to Daisuke Nogi, the Minister of Foreign Affairs, in Tokyo. The letter will be addressed to Shinzo Abe, Prime Minister Shinzo Abe, and Shigeo Takemoto, the Ministers of Education, Culture, Sports, Science, and Welfare, respectively.The letter is part of a series of letters expressing concern over the proposed legislation and its impact on freedom of expression. The letter is republished in full below:We, the undersigned, express our deep concern over the proposed changes to the law that would give foreign companies and individuals greater rights to criticize the governmental policies of Japan. This includes the potential to limit freedom of expression by criminalizing certain political activities, including criticism of the government, the political parties, or the military.We support freedom of expression and the right of individuals to express their opinions, but this must be", "The next Biennial should include the engagement of contemporary artists in Los Angeles and be curated by Jen Golden. “It is so important that arts institutions in the city of LA continue to thrive and that the city’s residents and visitors understand the importance of the arts,” said LA City Councilman Mitch Englander.\n\n\nThe School of the Art Institute of Chicago (SAIC) announced today that Trina Faust has been added as its next director and CEO. Faust will be responsible for positioning the institute—which has a current endowment of more than $50 billion and is projected to add another $50 billion to the endowment over the next twenty years—in the best possible light among contemporary art institutions.“Our board appreciates Trina’s contributions to the general advancement of the institute’s mission and to our broader community and our admiration for her vision for SAIC,” board chairman Adam Weinberg said. “Her ability to support our board and staff with a strong network of artists and her forthcoming book will enhance our ability to collaborate and collaborate across disciplines and disciplines in ways that make the future possible for us all.”Faust joins the University of Chicago from the Arts Management—Chicago, where she", "The next Biennial should be held in 2022.\n\n\nThe Manchester Art Gallery (MAG) has announced that it is planning to open a new museum in the city in December 2022. The institution will be built in the former Whirlpool horseworks, which is currently undergoing a major expansion, and will be located in the city’s city centre. The institution will house some three hundred works by leading contemporary artists, including American artist Laura Owens, Belgian sculptor Arne Giuffrida, and Japanese artist Yuji Nara.The space will be inaugurated by a solo exhibition of works by Nijaz Mokdad, a Pakistani artist whose recent exhibition “Nijaz Mokdad: From Mesopotamia to Manchester,” at the New Art Exchange, Manchester, on September 24, and will be followed by monthly group tours of the museum. The central gallery will host an exhibition of work by Nijaz Mokdad’s newer works in January 2022.MAG has also announced that it will assume the administration of the Manchester Art Gallery Trust (MAGT) from the Manchester City Council in January 2022. The new museum will be located in a former horseworks and will be inaugurated by a solo exhibition of", "The next Biennial should focus on the exhibition of the work of a single artist and should be organized in cooperation with the artist(s), and should include a solo exhibition and the celebration of a single year in the life of the artist. The exhibition should be inaugurated by the artist(s) and should be held in the building that the artist lives and works in. An exhibition of the work of the artist(s) should be organized at least once every five years.The new works will be presented in the first exhibition devoted to the artist at the Biennial in 2021. In addition, the twenty-third Biennial of Modern Art will be staged at the Athenry Museum in Stockholm in 2021 and the twenty-first Biennial of Modern Art will be held at the Museum of Modern Art in New York in 2021.Art historians Mona Hatoum, Ramiro José Pérez, and William Ivey will each receive a retrospective as part of the 2019 Art Basel World, curated by Antony Hudak and directed by Stefan Rudolf. The two works will be presented alongside new works by the artists at their upcoming exhibitions in Barcelona and New York, and will take part in a special event at the museum in January 2020", "The next Biennial should take place at the National Museum in Athens, in two phases, in May 2020 and March 2021. The institution will also finalize a new book about the ancient Greek city of Olympia, which is scheduled to be released in March 2021.The exhibition, titled Boschismo, will also include the exhibition of a new micro-series on Greek art and architecture, titled Greeks & Romans, and will be staged at the 2020 Olympiad in Rome.  The new exhibition will be organized as follows:• March 21, 2020• March 22, 2020• March 24, 2020• March 28, 2020• March 29, 2020 The twenty-sixth edition of the Museum di Pio, which will take place at the Centro di Pio di Belvedere di Trentino in Rome, will be held at the same venue in March 2020. The show will also feature a new quarterly program of lectures, exhibitions, and other activities and will run from May 8 to May 11, 2020.Museums in Italy, Spain, and France have also announced that they will not be affected by the pandemic. The Italian government has already committed to providing financial assistance of up to $1", "The next Biennial should serve as a timely opportunity to reexamine the history of the first edition, and to reflect on the ways we as a community are incorporating and incorporating the art of our time. We hope that the exhibition will inspire us to think about our place within the world, and to reflect on how we shape such a place, and on what it means to be a curator. We are deeply indebted to the organizers of the first edition for their gracious permission to display the artwork in their exhibition. We are also deeply grateful to the artists and institutions who were invited to participate in our inaugural exhibition, and we are grateful for the support and encouragement we have received from the biennial’s international community.”The exhibition will reopen on September 5 with the biennial’s Fifty-Seventh Biennial B, and will run through the end of the year. The exhibition will also feature a collection of the artist’s drawings, sculptures, installations, and installations, which were made during the commissioning of Richard Black’s original drawings for the show. The show will feature works by Nathalie Bachelet, Eliot Chiu, and Hiroshima Yui.", "The next Biennial should take up the question of why we are here and what it means to be a part of the larger world. The fourth Biennial should explore the ideas of the city as a global community and the ways in which art can play a vital role in inspiring, informing, and shaping our cultural and social destinies.”\n\n\nThe New York City Department of Cultural Affairs (DCLA) has awarded the Museum of Modern Art (MoMA) in New York $1.5 million in its efforts to promote diversity and inclusivity in its workforce. The funding helps MoMA transition from a white, male-dominated, board-driven culture to one that reflects the cultural and social landscape in greater Manhattan. The redesign of the museum—which includes the addition of guest rooms, new public spaces, and a rooftop garden—was part of an initiative launched by Mayor Bill de Blasio in an attempt to create an exhibition space for the city’s cultural and creative community.“In the twenty-first century, we face an unprecedented and urgent crisis: the pandemic, the ravages, the homelessness, the hunger, the deprivation, the maladies, the terrors of every continent,” said museum director Daniel H.", "The next Biennial should be held sometime next year. The date will be determined by the Arts Council. The design of the third Biennial is currently being worked out. It will take place at a hotel in the capital city of the Republic of Benin. \n\n\nThe W.K. Kellogg Foundation in Arlington, Texas, has appointed Sharon F. Harris as its new associate curator of Latin American art. She succeeds Mónica Camil, who has helmed the foundation for fifteen years, and will begin her new position in January 2020.“Sharon’s approach to Latin American art will not only help shape the foundation’s vision, but will also provide a path to understanding and appreciation of the work of American artists in Latin America,” said foundation president and CEO Elizabeth Kellogg. “As a scholar and educator, Sharon’s scholarship is formidable and her work will inspire our families and our communities to challenge our own preconceptions about Latin American art.”During her tenure, Harris will be responsible for the development of the foundation’s Latin American programs, including the Bicentennial of Cultures, the Latin American Arts in America, and the Latin American Museum in New York.", "The next Biennial should take place in 2019. \n\n\nThe National Endowment for the Arts (NEA) announced today that it will no longer redirect funding from its annual awards, which have been scheduled since 1996 and have earned more than $6 billion since they were launched by President Franklin D. Roosevelt, but will instead allocate $500 million to strengthen the artistic and cultural capabilities of the humanities.The announcement follows a wave of criticism directed at the NEA since it announced its intention to phase out the arts awards last October, citing a projected $7.5 billion shortfall after the 2020 fiscal year. While the NEA maintains that the decision was not made until March, hundreds of activists protested the move by staging a sit-in outside the agency’s Washington, DC, headquarters on February 16, 2020, and by signing a petition that was circulated by the March for Creativity and the March for Truth. According to Artnet, half of the signatories cited the NEA’s statement that it would continue to benefit the arts as the reason for their action.The NEA’s new strategy is designed to address critical gaps in the cultural ecosystem, including funding", "The next Biennial should be held in the autumn of 2020. Using a combination of eighty-eight interactive works and twenty-four grand conserved works, the exhibition will aim to bring the biennial together with the most important works of contemporary art. This will be the first time that the subject of the exhibition will be the nineteenth-century and the first time that the exhibition will be staged outside of London. Designed by Kohn Gallery and curated by Jules and Christophe Biener, the exhibition is being organised by Kohn Gallery in partnership with the London Borough of Kensington. They say the exhibition will be a “meaningful expression of the art of the twentieth century.” The opening of the exhibition will take place on September 24, 2020.\n\n\nThe Museum of Contemporary Art (MoCA), Chicago, has appointed Julie Ault as its new associate curator of twentieth-century art. Ault will be responsible for connecting with and working with the wider museum community through her research and curating projects and will assume her new position in December.“Julie has been an integral member of the MoCA family for more than fifteen years, serving as a talented and dedicated curator of contemporary art and international art,” said MoCA", "The next Biennial should be held within two years.It sounded as if the decision to cancel the exhibition had been made without the permission of the artist or the organizing committee. “I look forward to presenting work by more of my co-illustrators, to create a broader appreciation of the history of my exhibition, and to develop a more balanced artistic experience,” the artist wrote in a letter to the Arts Berlin. The exhibition, titled “Projects in Motion”\u0097a reference to a series of works by Franz Kline, and will be held in the studio of the artist in Bremen, Germany, from March 21 to March 26, 2020. In a review of the show, Andreas Kraus, who curated the exhibition, said that the exhibition “provides a unique opportunity to see my work in its totality\u0097the artist’s process, the exhibition, and the performance in a new way.”The artist’s first solo exhibition in Germany was in 2001, when she and her wife, Claus, opened a museum in Kassel, the capital of neighboring Saxony, in collaboration with a group of local and international artists. The exhibition won a prize that year for its contribution", "The next Biennial should be held sometime between the months of October and March. The first exhibition will likely be a combination of shortlisted works, selected by the artists, and works that will be presented by the selected artists. One hundred and fifty works will be presented by twenty-four artists from twenty-six countries. The biennial will be centered around the theme of the first work, The Current State of the Art, a conceptual work that examines the relationship between art and the material world. The exhibition will be the last of three planned by the artist. The artist, who is based in New York and has been working at the institution since 2011, has not had a solo exhibition since 2008. \n\n\nThe University of California, Berkeley, has received a significant gift of twenty-one works by twenty-six artists from the Sittard Collection, which includes works by artists such as George A. Lucas, Isaac Bashevis Singer, Daniel H. Wilson, and Robert Irwin. Included in the gift are twelve works by artists who were on the UC Berkeley faculty visiting the campus during the building of the school’s new campus in the early 1970s—the works will be exhibited on display in a future exhibition organized by", "The next Biennial should take place in the fall of 2019. The museum will then host a second exhibition, which will focus on “modernism and the contemporary,” in the spring of 2020.The institution’s current project, “A World Without Earth: Stories from the Biodiversity Archives,” will be presented in the summer of 2021. The history of the archives, which were acquired by the museum in 2014, will be examined through the lens of the exhibition “A World Without Earth: Stories from the Biodiversity Archives”—in which works by various artists and other groups will be presented alongside films and other sources.\n\n\nThe National Museum of Australian Art in Canberra will spend $100 million to create a new exhibition space in the city’s Centennial Square. The $140 million revitalization of the Museum of Contemporary Art Adelaide will culminate with a new 10,000-piece collection building, an expansion of the museum’s existing galleries, a new auditorium, and a new public courtyard.The new exhibition space, which will be built on the ground floor of the existing National Gallery of Australian Art, will feature a collection of more than 4,000 works, including work by Alwyn", "The next Biennial should focus on the history of the exhibition, next year’s exhibition “Ateliers du Biennial” and its audiovisual elements, and next year’s exhibition “We Belong Together.”\n\n\nThe New York City Department of Cultural Affairs (DCLA) announced today that Nancy Allen, chair of the department of photography at the university, has been named the next chair of the department of photography. She will take up her new post on March 25.“Nancy is a beloved leader, who has cultivated an enviable record of achievement,” said commissioner of the DCLA, Paul Mpagi Sepuya and director Bernadette Otero. “The department’s graduates have reveled in her leadership, her expertise and her bold vision for the art of photography. Her enduring legacy is the early vision of Edmund McMillen, who proposed the first major retrospective of the work of the late Italian director Irmano Cattelan, and her remarkable curating of the highly influential twentieth-century exhibition “Lusca,” which opened in 1997. Allen’s curating of the show, which featured work", "The next Biennial should be held at least a year from now. “There is no doubt that the twenty-third Biennial will be a landmark exhibition,” said Marc Spiegler, the festival’s artistic director, at a ceremony held at the Venice Biennale in April. The exhibition will celebrate the history of contemporary art and the contributions of artists whose works were on display at the previous event. The twenty-fourth Biennial will be held in 2021.\n\n\nThe central question today regarding the fate of the Hirshhorn Museum and Sculpture Garden—as well as the architects of the National Museum in Washington, DC—is whether the two institutions can be merged into one entity. Originally conceived as a scaled-down version of the Hirshhorn and the National Museum of American Art, the merged institution is currently being constructed in the Capitol Hill neighborhood of Washington, DC. The new structure will house the museum’s permanent collection, the National Museum of African Art, and the Smithsonian’s National Museum of Asian Art, and will be completed in 2022.The merger is expected to save the Hirshhorn $30 million in repairs and a $10 million reduction in operating expenses each year. The savings are expected", "The next Biennial should be held in 2021.” The 2018 biennial, “The Time of My Life,” was organized by the Global Impact and Design Research Group (GIRD), a New York–based nonprofit that aims to advance the field through exhibitions, book presentations, and other public programming. The 2019 edition, “The Pattern of Life,” will include two new works, a retrospective of the artist’s work and the first exhibition on the global impact of fashion since the artist’s death. The 2020 edition, “The Future Is Present,” will focus on the artist’s legacy and will include works by thirty-five artists.The exhibition will take up themes of the artist’s personal experience with and the history of fashion. “Stevenson invented the modern fashion, and his work is an inspiration for anyone interested in fashion,” said Andrew Wiles, chair of GIRD and director of the Institute for Fashion Studies at the University of Oxford. “His exploration of the relationship between fashion and the environment shaped the exhibition as a whole, making it a fitting tribute to his life and his legacy.”\n\n\nThe National Geographic Society has launched a new digital platform"]