["The next Biennial should be held in 2020. “The power of art, and of ideas, is our power of expression,” said Neeson, a collector and the founder of the Neeson/Gagosian art collection in New York. “That’s what we’re at the end of the day, isn’t it? Thinking about other people’s lives, about what they’re going through, about what you’re going to do next, and about what you’re not going to do.”\n\n\nThe Metropolitan Museum of Art (the museum) in New York announced today that Nikhil Gupta will become the next director of the museum. Gupta will assume his responsibilities on June 28.Prior to joining the museum in 2008, Gupta served as a curator at the Whitney Museum of American Art in New York and as a scholar at the Graduate Center of the City University of New York. He is also a former director of the Rhode Island School of Design, where he cofounded the inaugural redesign group, the Design Alliance, and taught at the school for five years. “I’ve always been inspired by the work of the early designers, and", "The next Biennial should begin as soon as possible, with a provisional budget of $70 million and an opening date of March 21.The prestigious competition is supported by the Seth, Marcus, and Edith Warren Foundation and the Simon Wiesenthal Center.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it has appointed Anita Bichto as its new deputy director. Bichto comes to the institution from the Santa Monica Pier Museum, where she has served as deputy chief curator and curator of modern and contemporary art since 2016. During her tenure at the Pier, she was instrumental in the acquisition of the works of artist Walter Ochs, the American avant-garde, and the European avant-garde, as well as the museum’s collection of works by artists such as Hans Ulrich Obrist, Douglas Wheeler, and Robert Irwin, and has helped shape MoCA’s collection programmatically and through exhibitions, performances, and other programs.“In her new role, Anita will be tasked with leading MoCA’s collection as it continues to expand its collection in a way that provides greater access to the museum’s collection while still recognizing the Pier’s unique position as a", "The next Biennial should take place in the autumn of 2020. At that point, the site will be transformed into a large‐scale public art project, with the collection, display, and restoration of the original elements. The digital format will consist of a digital viewer, an app, and a website, and will be interactive. The project will also involve the creation of a new public collection featuring work from the museum’s collection. The collection will be distributed through the museum’s online platform.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Elizabeth A. Botter as its next chief curator of contemporary art. She succeeds Kate Parker, who has served as interim director of the museum since November 2019. Previously, Botter served as the curator of Asian art at the Museum of Modern Art in New York, and at the Museum of Contemporary Art in Chicago, where she helmed the collaborative exhibition “Between the World and Me: Contemporary Asian Art, 1960–1980.”“We are delighted to welcome Elizabeth to the MoCA family,” said Elizabeth A. Botter. “Her wonderful curatorial approach, her passion and intelligence as well as her passion for the arts, her deep understanding of", "The next Biennial should be announced, and the inaugural exhibition should be up and running by the end of the year.The biennial’s construction was complicated by the arrival of more than 100,000 undocumented immigrants from Central and South America, most of them children, who were consigned to the United States. While the majority of the children were released into their parents’ homes, some—including many who were born here—were returned to their countries of origin. The children are now suing the government, claiming that they were subjected to a “systematic and widespread abuse” as a result of the government’s policy of deporting children across state lines.The lawsuits are still pending.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is planning to move thousands of works from its collection by the artist-run organization Artnet and is negotiating with galleries to have the museum pay the nonprofit organization $1 million annually as part of a deal valued at more than $100 million. The move is part of a restructuring of the museum’s holdings that will also include the retirement of Richard Diebenkorn’s iconic Monitor, which is currently mounted in the Gallery of Modern Art, and will coincide with the museum", "The next Biennial should be held at the Forum in Sydney on January 18, 2021. --\n\nThe Australian Council of Film, Television, and Games (ACTG) has announced that Elin Østvall will take up the post of director of the Australian Film Institute (AFI) in Canberra next month. She will be responsible for the development and administration of the institute’s annual $18 million funding prize, which was awarded in the form of a $10,000 cash grant.“I’m interested in what makes a good institution and what makes people enjoy visiting it, and Elin’s proven track record and commitment to the arts make her perfect for the job,” said Anita Black, director of the Australian Film Institute. “Over the years, she has expanded the scope of the institute to provide a more coherent and creative connection between the different disciplines of film, including visual art, animation, sound, and performance.”Commenting on her appointment, Østvall said: “I’ve been involved in the arts for twenty-five years now, and have overseen a number of exhibitions at the Australian Film Institute, including ‘Formation: The Art of Film", "The next Biennial should take place in 2020. Artforum will keep you up to date with the latest on this exciting development.\n\n\nThe Collepardo Museum in the Antioquia region of Argentina is developing a program to help the country’s indigenous people. The organization will create three opportunities for indigenous participants to work with artists and cultural institutions to address issues related to the collection, governance, and protection of cultural heritage. The inaugural event will be held in September 2020. The second event will be held in October 2020. The third will be held in November 2020.This year’s edition of the Biennale di Architettura, which was held in Rome, was marred by the death of two indigenous activists, Susana Pilar and Maria Elena Pilar, who were the fourth and fifth indigenous members of the 2015 jury. The three other finalists were a man and a woman, both from the same village, who were nominated for the honor of being the first indigenous artists to win the award.Pilar, who was twenty-six years old and worked as a secretary at a local government building in the small coastal community of Agua Nara in Buenos Aires, was found dead in her home on August 29.", "The next Biennial should be held at the Sherwood Forest in 2021, with a view to a future exhibition at the County Museum of Art in Cumbria in 2021. \n\n\nThe San Francisco Museum of Art (SFMoMA), which was investigating the possibility of a new exhibition space in its landmark building as part of a redesign that was completed in 2017, has welcomed the renovation of its existing exhibition space, which sits adjacent to the museum, as well as the renovation of the new building that houses it.SFMoMA’s new building will host more than 160 exhibitions annually, and will boast a theater, a classroom, and a research center. The renovation project, which was undertaken by architect Richard Rea and landscape firm Koons, involved the conservation of more than one thousand acres of the building. In addition to the renovation of the existing exhibition space, the project also included the remodeling of the building’s rooftop, landscape, and interior, and includes the installation of new flooring, walls, and ceilings.“The transformation of the building, which is a rare combination of an institution and a residential complex, is the culmination of an ambitious project that began in 2009 to reimagine the museum and the city as it has never been", "The next Biennial should take place at the St. Petersburg Opera House in November, 2020.\n\n\nOn Monday, the Italian government announced that it plans to launch a biennial dedicated to the Italian Renaissance, following a long-overdue reform. The initiative was launched in July 2019 by the president, Dario Franceschini; cabinet members Gio Ponti and Gio Ponti-Santiago, his cabinet secretary; and four other civil society groups, led by the Institute of Contemporary Arts in Venice, the Association of Italian Art Historians in Rome, and the Italian Association of Journalists, to coincide with the Venice Architecture Biennale.“The biennial is taking a new and important path in the construction of a new and strong cultural heritage in our time,” Franceschini said at a ceremony in Rome. “I am convinced that this plan will be a catalyst for regeneration, a milestone in the development of Italian art, and a new kind of dialogue between Italy and the world.”The future of the Grand Duchy of Milan, which has been under constant threat since a leaked draft of a budget for the 2020 fiscal year was leaked last month, is now in jeopardy as the Italian government tries to balance the books by March 31", "The next Biennial should focus on collective memory through the production of a new work on the martyrdom of a non-Muslim during the Franco regime in Spain.  “The exhibition should be a vehicle for the promotion of the work of the past and a reflection of our current situation ‘in the near and far.” Alan de Villiers, director of the Biennial and the South-African director of the Johannesburg Biennial, said: “The exhibition should be a vehicle for the promotion of the work of the past and a reflection of our current situation ‘in the near and far.” While the exhibition is slated to run from March 19 to March 21, the 2019 dates have yet to be announced.\n\n\nThe Metropolitan Museum of Art in New York has suspended construction on a $500 million expansion to its David Zwirner–designed David Lewis painting studio, which was scheduled to open in 2021, reports Artnet. The expansion, which was envisioned as part of a $2 billion expansion of its David Lewis painting museum, would have added a new room dedicated to Zwirner’s art “The Man Who Fell to Earth” (1958), a large, late-twentieth", "The next Biennial should be in 2021, and the two subsequent iterations in 2022 and 2022\u0097which have already been cancelled due to Covid-19\u0097will not reopen. “As we work through these difficult and unfamiliar times, we would like to think of the Biennial as being a resource to inspire and guide us through these difficult and unfamiliar times,” reads a statement issued by the organizers. The decision to cancel the biennial was made while the institution was preparing for its 2020 edition. The event will take place at the biennial’s new home at the San Francisco Museum of Modern Art (SFMoMA), which will open on September 1, 2020. The SFMoMA edition will be held in February 2021. The announcement of the 2019 edition, titled “Ateliers Histoires,” also drew criticism, with many seeing it as a “preview for the real thing,” given that the theme of the exhibition was “The History of Light.” The exhibition was ultimately canceled after a campaign led by the group Art Space Action, which demanded that the exhibition be postponed until after the pavilion was completely refurbished.“Ateliers Histoires’ cancellation is", "The next Biennial should be held at least annually for the next three years. “We have adopted a four-year cycle to better reflect the increasing importance of the local community, to reflect the richness of our collection, and to reflect the life and work of our great curator, Isabel Duchesne.”The museum will also introduce new programming in 2018, including a permanent exhibition of work by the artist and educator Rainer and the biennial’s inaugural photography event, a three-day photography camp, and a silent auction.\n\n\nThe London-based arts organization London Assembly has named Marc Glimcher its new chairman and CEO. Glimcher joins the museum from the Royal Academy of Arts (RA), where he has served as director for the past six years. He succeeds David Cameron, who announced his resignation in June 2019, and will assume the role at the end of June.“The last six years have seen an expansion of our collection, a fundamental rethinking of how we think about art and the world, and a shift from a focus on a particular kind of art as the dominant form to an ambitious new vision of how an assembly works,” Glimcher said. “At the same time, we have been", "The next Biennial should focus on the history of the exhibition from a transnational perspective, including an exploration of the history of art in general, and of the exhibition at the time as well as the new project that we are preparing. We will also present original works, including the biennial’s first exhibition in the New York area and the first exhibition in the United States in twenty-five years. \n\n\nThe Fine Arts Museums (FAIM) in London announced today that it is planning to create a new three-year biennial dedicated to the life and work of Alice Aycock, a pioneering American artist whose art has been collected by more than 350 museums and is widely regarded as the model for the art of the twentieth century.In the July/August issue of Artforum, artist-in-residence Adam Savage wrote about Aycock’s live installation The Black Veil, 1948, which featured a series of images of urban life in a black veil and was one of her first works to be exhibited on the major New York art fairs. At the time of the installation, Aycock was working on a piece titled The Black Veil in a Blue Cell, 1947, which was one of her last works to be exhibited. The work", "The next Biennial should be held in 2020. The show will be directed by Yoshitomo Nara, who is the founder of the biennial house, Yoshiyo Nara Contemporary Art, and will be hosted by the US-based artist Nari Ward.A jury comprising artists, art historians, visual artists, and curators from the fifty-fifth and fifty-ninth editions of the show will be selected from a shortlist that will be announced by Nara, Ward, and the Brazilian Paulo F. Oliveira, the director of the Museum of Modern Art in Brazil. “This is a transformative moment for art and architecture in Brazil,” Nara said. “The biennial will be a platform for conversations about contemporary work and will allow Brazilian artists to communicate directly with the audience through a multimedia art experience that transcends language.”\n\n\nThe Carnegie Museum of Art in Pittsburgh has announced that it is reducing the size of its current-year exhibition, “Elusive Peace: Reframing the American South,” and moving the show to a smaller space on the museum’s campus in the spring of 2021. The Carnegie Museum of Art has been working with the city of Pittsburgh", "The next Biennial should take place in late 2019 and may be staged at a location other than the MCA. The museum will present the first exhibition in the series “Future Imperfect: A Space Odyssey” at the MCA as part of its summerlong “Future Gallery” programming. The first show in the series was curated by Baroness Winmclay and will present its first work at the MCA in 2020.  In an email to the MCA’s director, Marta Gallego, the museum said: “We are thrilled to contribute to the research, the creation of great art, and the development of a rich and vibrant collection in the MCA. It is a perfect time to work with the MCA on a project like this, as we try to think of new ways to engage with the MCA’s collection and its remarkable collection of contemporary art. We thank the MCA for supporting this ambitious and ambitious project, and look forward to this next iteration of the Biennial.”\n\n\nAndy Warhol’s former assistant and current art historian, Mary Meade, has spoken out about the controversial 1977 exhibition “The Dangers of Neutral Images: Art and the", "The next Biennial should be held at the University of New South Wales (UNSW), in Melbourne. Director and CEO of the UNESCO–listed institution, David Cairns, said: “This is a moment of great change for Australia and we are all deeply moved by the extraordinary exhibition of talent that was staged here last year. Millions of people saw the work of the Masters’ and the young artists, and it was an inspiring experience to be a part of.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has received a $4 million donation from the Paul Mitchell Foundation. It came in the form of a $5 million gift from the Paul Mitchell Foundation to the museum in honor of the foundation’s 70th anniversary. The gift means that the museum will receive $1.5 million from the foundation in the next two years—more than double the $500,000 that the museum received last year.“The foundation's commitment to MoCA has been broad and deep over the past twelve years, and we are delighted to receive this gift of $4 million to continue our longstanding work in honoring Paul Mitchell and his legacy,” said Hilary M. Collins, chair and CEO of the foundation.", "The next Biennial should take place in the spring of 2021.\n\n\nThe Italian museum Tommaso Bernini, located in the northern city of Reggio Emilia, which was scheduled to open in April, has postponed its inaugural exhibition, “Ancora di corretto.” The exhibition was supposed to be staged in April and would have opened at the end of June. The exhibition has since been moved to May, and its opening date has been pushed back to October.The event, which was originally scheduled to be held in March 2019, was pushed back again to June, and its launch date has been pushed back again to November. In a letter sent to the public from Pierluigi Battista, the director of the museum, the institution said the decision to re-launch the exhibition was not related to the ongoing investigations into the possible manipulation of the 2018 and 2022 World Cup, but was instead prompted by changing tastes. Bernini told the Art Newspaper that the decision was mutual. “I wanted to re-create the theme of the show that had been suspended, and to come back with new ideas,” he said. He added that the reserve dates were made in order to “allow time for the", "The next Biennial should be held in 2022.”Before the museum reopened in July, the space had been closed since March due to Covid-19. The coronavirus outbreak has since forced the closure of the French and Italian capitals, and the cities of Lyon, Marseille, Bordeaux, and Genoa.\n\n\nThe Middle East Museum in Cairo has hired two new members to its board of directors, including a director of its Arab art section and a former director of its collection of paintings and sculptures. In addition, the institution has added three new trustees to its board of advisors: a German art historian who will serve as the director of the museum’s collection of Arabic art, and a director of the renovation of the museum’s courtyard.“We are delighted to welcome two new members to the board of directors and to bring them to Cairo to work with our talented staff and volunteers to shape the Arab and European region’s cultural landscape,” said the museum’s director, Sabri Bishara. “These new members are experienced and dedicated, and we look forward to their involvement in the mission of the museum.”Earlier this week, the board voted to authorize the construction of a new", "The next Biennial should be held at the new facility in February 2020. The exhibition will consist of twenty-four works\u0097the first four of which are based on the artist-made life of Japan\u0097each curated by a different artist. For the remainder of the year, the exhibition will be hosted by the same artist at different venues. The project was created in order to put the emphasis on the artist-created environment in a different venue, which would offer a more intimate experience for visitors. The show will be accompanied by a series of public programs, including performances, a book exhibition, and a film festival.  The exhibition is modeled after the Biennial of the Arts in Tokyo, which was founded in the city in 1994 with the goal of developing more internationally-oriented art.The exhibition will be organized by the Tokyo Metropolitan Government. The construction of the new museum was carried out by the Tokyo Metropolitan Museum of Art (TMMO), which was housed in a former Nisshin Electric Power Station. The archiving facility was built in collaboration with the Tokyo Metropolitan Museum of Business and the Tokyo Metropolitan Museum of Art.Its opening will coincide with the sixty-fifth edition of the Kunsthalle Basel. The event will take place at", "The next Biennial should focus on bridging the gap between artists and the practice of art in order to facilitate their exchange and to create an environment for public engagement with and reflection on art. “We are actively engaged in developing new ways for the public to engage with art and are committed to listening and reflecting on local issues and scholars,” said Yoko Ott, chair of the committee.\n\n\nThe library of the Samothrace Museum in Northern California has received a gift of seventy-seven works by John Beasley. Known for his bold, often surrealist paintings, which combine conceptual and physical elements, Beasley was perhaps the first American to study the ancient art of Sri Lanka and is the subject of numerous works that have recently been exhibited at the Samothrace.The gift includes fifty-three works by Beasley\u0097a self-taught painter whose work often plays with the concept of form and how the body works\u0097and a selection from his diaries, which have recently been published by the San Francisco Chronicle.In the art world, the Samothrace is known for hosting exhibitions of work by artists such as Georges Apostuil, Peter Sellars, and Richard Diebenkorn, or as a hub for artists to make", "The next Biennial should be held in 2021, but it is not clear when the exhibition will be held. The institution has been closed since December 31, 2015, and reopened in January, when the first group of visiting artists made their exhibition debut.The show is currently on view at the Indianapolis Museum of Art (IMO), which is currently remodeling. Commenting on the project, director Lisa Mitchell said: “The museum is doing a wonderful job of reopening, working with our new partners at Johnson’s New World Center to develop a larger-scale exhibition that takes the audience inside the museum to experience the Biennial in its fullness. The exhibition will also include a wide-ranging panel discussion with artists to discuss how the Biennial has impacted their practice and to look forward to the show’s reopening in 2021.”\n\n\nThe French Institute for Contemporary Art (FRICA) in Paris and the National Art Biennale, which had been slated for a June 2020 opening, have announced that the event will now be held in September. The postponement was made in order to allow the Paris-based institution, which has been struggling since March, to restructure its exhibition calendar and to prepare for the possibility that it wouldn", "The next Biennial should be called for October. \n\n\nFrieze has announced that Riot Grrrl, a biennial hosted by the German nonprofit Frick Collection, will return to the public in 2020. Among the works on view are pieces by artists such as Mier Leketon, Klaus-Dieter Wittchen, Volker Wedemeyer, and Adrienne Holloway, which will be on view for seven weeks. Frieze will also re-envision Artforum as a new space for contemporary art, in partnership with the International Federation of Arts, and will launch a digital platform and mobile application for the biennial. The platform will be powered by the Frick Collection’s proprietary technology, which will be ­automated by a team led by artist-in-residence John Barlow. “Riot Grrrl is a chapter in Frick’s history that began as a collective project in 2013 and has been continuous since 2015, showcasing work from some of the most distinguished contemporary artists in the world, including Ana Mendieta, Agnes Martin, and Jean-Michel Basquiat, with a focus on African American artists,” said Barlow. ", "The next Biennial should take place in the New South Wales town of Campbelltown next month, and the first in New York City in 2021. The 2020 event will be held in Tokyo and will be organized by Tokyo-based artist Haruna Suzuki and the Los Angeles–based artist and curator Christopher Division.\n\n\nThe Museum of Contemporary Art (MoCA) in New York announced today that it will extend the opening of the museum’s new twenty-five-story headquarters in Manhattan by three months. The museum will now open on February 13, 2021. The change was made in order to accommodate the anticipated expansion of the museum.“We’ve been discussing the possibility of moving our headquarters from the city to Harlem for some time,” said museum director Christopher Dunn. “The museum’s future is here, and the future of New York City is here. The museum’s new mission is to serve as a global hub for cutting-edge art and ideas. The expansion of the museum’s footprint in Manhattan is an extension of that commitment.” Advertisement\n\n\nThe Museum of Fine Arts (MoFA) in Boston has added two new artists to its roster: The Promise Project and Timur Sobek", "The next Biennial should be held in the fall of 2020. The pavilion will be a collaborative project between the artists and the museum. “The new Broad, which will be inaugurated at the Modern Art Biennial, will feature works by ten artists, including Charles Atkins, Maarten de Kooning, and Thomas de Kirchhove, and will be presented by the Broad curator, Charlotte Delahanty-Lee, and the artist-run Design Lab, which was founded by the Broad director, Sujatha Ghose.”\n\n\nThe Museum of Contemporary Art (MoCA) in New York has appointed Sarah Hossain, who currently serves as the interim director of the museum, as its next director. Hossain comes to the institution from the artist-run space the Ark Project, which is based in Brooklyn and represents several artists, including Mariah Carey, Avedon Stevenson, and Iris Salters, and will assume her post in January 2021.“Sarah is a visionary leader and we are honored to welcome her to MoCA,” said museum director Sophie Armstrong. “Her expertise in contemporary art design, as well as her ability to prioritize and prioritize her own vision of the future, make her the", "The next Biennial should be held in 2020, with the announcement of the winner expected in the spring of 2021. The event will highlight the work of forty-eight artists and will be supported with a $3 million donation from the estate of the late artist Bobby Fischer. The biennial will run from June 12 to June 20, 2021.  The 2017 exhibition, titled 'Art and Life in Rome, 1900–1910,' featured twenty-five works by sixty-five Italian artists. \n\nThe Museum of Contemporary Art (MoCA) in New York has announced that it plans to open a new branch in San Francisco on May 21. The museum will stage six exhibitions this year, including the first solo exhibitions of an artist-in-residence since 1965, and will be located in the former City Council building on the city’s waterfront.The institution will also host a series of public programming, including a book launch and lecture by the artist-in-residence Arsht Hodge; a public lecture series by the artist-in-residence Matthew Arnold; a group show by the artist-in-residence Eva Langret; and a free outdoor event series. The new location will also offer access to the Marina District", "The next Biennial should open with a performance by a selection of contemporary dance and performance artists. The theme of the exhibition is “Space/Time and the Infinite Body” and the exhibition will feature works by an eclectic group of artists who demonstrate their interest in the theme.The Biennial is the second of two exhibitions that the United Kingdom’s Tate is hosting around the world. The first is an exhibition titled “The Biennial of Art and Art Perception” at the Hammer Museum in London, which will run from April 20 to April 25, 2020. The second will be an exhibition of works by artists from the Northern Ireland region, “Artists in Exile: Percussive Response,” which will run from April 14 to April 13, 2020. The first exhibition opened in London on March 13 and is currently on view at the Tate in London.\n\n\nThe prestigious international competition organized by the Israeli gallery Yad Bezalem and organized by the Ministry of Arts in partnership with the Palestinian Authority (PA) in partnership with the Israel Arts and Architecture Museum in Jerusalem has announced the thirty-seven artists who will be featured in the third edition of the exhibition “Daoud, 1962–2019.” The exhibition will be", "The next Biennial should take place in Tokyo in 2021, when over five hundred artists and researchers will present their work for the first time. \n\n\nThe New Museum in New York City is seeking the public's help in identifying an untalented and under-recognized artist whose work is currently on display in its museum’s permanent collection. The unidentified artist is known as Alia, and her work first appeared in a retrospective organized by the Italian avant-garde space Autonomedia in the city in 2009.The New Museum, which claims to be the oldest contemporary art museum in the United States, has previously identified Kiki Smith as the artist who created the work Argonne rhodes. In 2008, the museum held a retrospective of Smith’s work for its permanent collection, and the following year, the artist was chosen to represent Italy at the Venice biennale. The work is currently on view in the museum’s exhibition “Clavilena: Art, Politics, Politics,” which opens on March 17.\n\n\nThe National Gallery in London revealed on Monday that it is planning to open an eight-thousand-square-foot museum dedicated to the work of an unknown amount of artists", "The next Biennial should be flexible and be inclusive. The next Art Fund should be a platform for the creative work of artists whose practices are not currently funded. The next Art Fund should be a platform for artists who are presently under-represented or under-recognized in large-scale institutions. The next Art Fund should foster a sense of community through the exchange of art. And finally, the next Art Fund should be a platform for the international exchange of works and ideas.This is not an academic exercise. It is an economic exercise.”The petition reads: “We, the undersigned, believe that the future of art is at risk if the current trajectory of the biennial is not reversed. The current exhibition schedule and funding cycle is not sustainable without a radical transformation of the exhibition program. . . . The financial consequences for the biennial of art are enormous. We believe that the only way to ensure the future of the biennial is to seriously rethink the exhibition schedule and funding cycle.”The petition comes on the heels of the March 22 announcement that the biennial will be held at the Washington, DC–based arts nonprofit the DC-based organization the DC–based arts organization DC-based arts organization Created Equal, which", "The next Biennial should be held in 2023.\n\nThe ex-wife of the former president of the Art Newspaper, Tito Viljoen, has filed a lawsuit against the archive that published her husband’s photographs at the Museum of Contemporary Art, Boston, in 2017. Tito claims that the museum withheld information about its upcoming exhibition “After God” and its expansion plans in an attempt to give her husband’s name recognition.“Viljoen’s work is a window into the connections between art and modernity and a powerful call to arms for artists and art-historians,” lawyer Michael J. Mullen, who represents the plaintiff, told the Boston Globe. “She is taking the situation seriously and will likely file lawsuits in the coming months.”Artforum has reached out to the Museum for comment. \n\n\nThe National Gallery in London announced today that it is reopening on Wednesday, March 16, 2020, with free admission for everyone except senior citizens and those in wheelchairs and people with a disability. The museum will also introduce free entry for children under eighteen. The reopening will be followed by a general reopening on March 16—the first time the National Gallery", "The next Biennial should be held in Tokyo in March 2020. It is currently scheduled to run from March 18 to March 22. \n\n\nThe Institute of Contemporary Arts (ICA) in London, which has been closed since March 13 due to the Covid-19 pandemic, has released the list of fifteen artists who have been invited back to the institution for its spring 2020 edition. The artists are:Adriana Benitez (Algeria),Abegnash Dzougala (Morocco),Edward Enninful (France),Guadalupe Rosales (Spain), Jürgen Sze (Germany), Haim and Galindo Osías (Mexico), Keren Ostrovsky (Canada), and Kader Attia (United Arab Emirates).The exhibition, titled Animals in Motion, will run from March 7 to March 10 at the Institute. The full list of participating artists is as follows:Abegnash Dzougala (Morocco), Himant Elayat (Jordan), David O.M. Peacock (USA), Cara Obalil (Canada), Deana Roesler (USA), Samantha Ross (UK), S", "The next Biennial should be held at the earliest opportunity, with the aim of incorporating as many of the work’s present and future inhabitants as possible; and, of course, with the full support of the city of Barcelona, and with the full understanding of the local community.We hope that the next Biennale will be a success, and that the city of Barcelona and the province of Extremadura will become proud members of this wonderful city.Sincerely,Dr. Sabine Schipper and Dr. Joachim Neugroschel[Incense and Fire by James Turrell, 1922, 1894, and The Golden Shrine of Heaven: A Biennale for Antiquities by James Turrell, 1923]\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles is launching a new digital platform, “Artnet News,” that will present curated, web-based analyses of art-world news and events. Curated by Jen Rose, the curator and curator-in-residence at the museum, the platform will highlight the latest art-world news and events and will bring together artists, collectors, museums, and other influencers.The platform will feature comments and curations by", "The next Biennial should take place in the autumn of 2019. “I expect that our work will be resurrected in 2020 and made accessible to a wider public,” the artist said. When asked about his plans for the future, Kanders said: “I’m not going to stop the work I began twenty-six years ago and I’m not going to stop exploring what the future holds.” He added: “I’m not going to stop making art. I’m going to continue to make art. I’m not going to stop being who I was before I stopped working.”\n\n\nThe Museum of Contemporary Art (MoCA) in New York has appointed Laura Mulvey as its new deputy director and chief curator. Mulvey comes to the institution from the Metropolitan Museum of Art, where she has been in the role since January 2019. During her tenure, she will work with the museum’s curators, staff, and artists to improve understanding of the museum’s collection and collection-making practices across disciplines, including art and design.“Laura is a gifted curator whose expertise and passion has been recognized by museums worldwide, and she will be a formidable", "The next Biennial should be staged at the Lyon Biennial,\" reads a statement issued by the institution. “The next Biennial will be the only one with the theme: ‘Transhumanism.’ In a future where all human knowledge and activities are increasingly possible and automated, this theme will have the opportunity to confront the future.”The 2020 edition of the exhibition will take place at the Museum of Contemporary Art (MoCA), San Francisco.\n\n\nThe Swiss artist and filmmaker Kader Attia has been selected to represent Switzerland at the Fifty-Ninth Venice Biennale, scheduled to run from May to November in 2021. The first time the artist has been selected to direct a major exhibition in his homeland was in 2000 for “The Synagogue: A Social History”, a series of twenty paintings that explored the role of the visual arts in the ongoing civil war in Kosovo. The sit-in resulted in a performance that was commissioned by the filmmaker Abdication, which is currently on display in the tenth exhibition of the Kunsthalle Basel, and is now on display at the Kunsthalle Basel and will be presented by the artist at the Nordiska in September 2020.“", "The next Biennial should focus on an examination of the cultural and material history of the contemporary practices of the Frankfurt School, with a particular reference to the Frankfurt School’s relationship with the capital region and the German Jewish community.”\n\n\nThe New York City Department of Cultural Affairs (DCLA) has announced that it plans to extend the opening of the Black Rock City, an arts-centered enclave in the Chelsea neighborhood of Manhattan, by a year. The announcement follows a yearlong nationwide campaign to draw attention to the Black Rock Deserts, the Black Rock Deserts’ cultural heritage sites and was prompted by the city’s decision to sell more than 2,000 works by artists such as Allen Gersztof, Eric Fischl, and Mark di Suvero, among others, for the city’s public art museums.The extension of the Black Rock Desert’s opening date comes amid a nationwide push to secure additional emergency aid for cultural sites and has been supported by the Doleman Foundation, the Broderick-Stroud Foundation, the David Rockefeller Fund, the George Soros Fund, and the Thomas K. Lamont Foundation. The arts-focused group Artists4Civitas", "The next Biennial should be held in 2021.\n\n\nThe Museum of Modern Art (MoMA) in New York has awarded its first patron of contemporary art, the German artist Marcin Wojtas, the $25,000 Honorary Doctorate in Modern Art (H-D). He is the fourth individual to receive the award, which was established in 2007 and was presented by the H-D program in partnership with the H-D Institute of Art. Wojtas will be presented with the award at an award ceremony held at the museum on January 28.“I am honored to receive the H-D Honorary Doctorate’s $25,000 honor in the form of a gift from MoMAM,” said Wojtas, an artist and proponent of Post-Impressionism who lives and works in New York. Wojtas’s work, including paintings, drawings, sculptures, and installations, has been exhibited at the Museum of Modern Art, the Museum of Modern Art/New York, and the Museum of Modern Art/Detroit. In addition to his work, he has taught at the School of the Art Institute of Chicago, the Art School of Chicago, and the School of the Arts", "The next Biennial should take place in 2025, with an exhibition of works by the artists featured in the previous edition, as well as a reinstallation of the venue. The redevelopment of the Central Library added another seventy-five years to the life of the ninety-three-year-old institution.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Amy Demirjian its new executive director. She will be responsible for leading the biennial’s current exhibition, “The Electric Sculpture,” which will run through February 27, 2021, and will also include a new digital platform, the MoCA Artist Corner, and a new performance and performance series. The curator and art historian will take up the post at the institution on January 14.“I’m excited to welcome Amy to the MoCA team,” said Museum director and CEO Michael Govan. “Her extensive experience and dedication to curating shows she will be instrumental in ensuring the MoCA curatorial team has the creative tools it needs to grow and present a wide range of work by future-oriented artists at the institution.”He added: “Our artists are at a critical jun", "The next Biennial should be held in 2022. Šaksti’s new director, Michał Biczel, called it “an honour to be the next director of the Biennale, which has been and remains a magnificent institution.”\n\n\nThe National Galleries of Scotland announced today that it is planning to sever ties with the Scottish National Party (SNP), which is currently in government in Scotland, after it voted to leave the United Kingdom in March. The arts organization’s board chair, Torben Torp, said that it decided to end its relationship with the party after it “aggressively attacked the arts in the arts industry, and specifically attacked the directors of the National Galleries of Scotland.”The organization’s board has awarded the National Galleries of Scotland £25,000 for its “Accountability and Compliance Campaign for Arts,” which was commissioned by the party and launched on April 1. The campaign asked museums to identify any problems with the National Gallery Scotland’s consultation on the redesign of the National Gallery Edinburgh, and to share any challenges they experienced.In response to the criticism, which was widely shared on social media, the National Galleries of", "The next Biennial should bring together annual presentations from artists representing diverse artistic and personal narratives. In addition, the workshop will examine how biennial exhibitions can be used as vehicles for social change and how artists can become collaborators in the fight against racism and discrimination.“The museum is committed to challenging the boundaries between art and politics and is committed to fostering the highest levels of artistic excellence for our exhibition curators and our exhibition staff,” said Paul Galloway, director of the museum. “We are also working to re-imagine what a Biennial exhibition might look like with new scientific, experimental and political content that involves and concerns us all.”\n\n\nThe museum has hired Rachel Drew as its first director and CEO. Drew joins the institution from the New Museum in New York, where she has served as director of public relations since 2015. She succeeds Marlene Anne DeBruyn’s longtime chief of staff, Ryan M. Crotty, who retired in May.“Rachel has the potential to reshape the role of the museum and will be a champion for the full range of our program,” DeBruyn said in a statement. “Her commitment to building the museum’s relationships", "The next Biennial should take place in New York in the spring of 2021.  The next Art Museum in Philadelphia will be held in the fall of 2019, followed by the next Art Museum in London in 2021.  The next London Biennial will take place in 2022 and the next Art Museum will be staged in 2023.  The next Shanghai Biennial will be staged in 2021 and the next Art Museum will be an exhibition. \n\nIn the early hours of Sunday, August 27, police officer Derek Chauvin knelt on the hood of a black Mercedes-Benz as the vehicle drove along a Brooklyn street, striking a protester with its accelerator, sending him tumbling toward the ground. The incident took place in broad daylight on a weekday, and it remained so until the next day when the incident was captured on video by a passerby. The driver, a thirty-nine-year-old black man named Derek Chauvin, was charged with criminal damage and released without bail on Monday morning.According to the prosecution, the incident began when the protester, named in an open court filing as William Alston, pulled down his pants and exposed his penis in front of the police. The officer then grabbed the protester by the neck and knelt", "The next Biennial should take place in 2021. \n\n\nThe French Ministry of Culture has launched an initiative to give French museums greater autonomy over the display of artworks. The initiative is part of a broader package of cultural policies that aims to make the French arts and culture sector more responsive to the needs of the people. The plan also includes the establishment of a new body, the National Culture Agency (ACT), tasked with overseeing the restructuring of France’s museums. The agency will be run by a group of cultural figures, including France’s president, Emmanuel Macron, and Jean-Luc Moulène, France’s minister of culture and international cooperation.\n\n\nThe Rotterdam Biennial, which kicked off on October 5 with an exhibition of work by 32 artists from five continents, will stop celebrating its two-year mark and begin a reopening in March 2020. The announcement was made at a press conference in the city of Rotterdam, which had been shut down since mid-March as it awaited the results of the coronavirus vaccine.“We know that a return to normal life is very important to a lot of people, and so it is with regret that we have decided to participate in the March 2020 re", "The next Biennial should be held in 2021.\n\n\nThe National Museum of Fine Arts (MFA) in Manchester, England, announced that it plans to move forward with plans to close in 2022 following its initial construction phase. The museum plans to begin a construction phase in 2021 but has not yet determined the timeline for the reopening of its buildings and will only make a decision regarding the reopening of the museums when the construction of the final phase of the museum’s construction, which is currently underway, is complete.As part of a $2.7 billion overhaul of the National Gallery of Scotland, which was first announced in January 2019, the museum now faces a number of challenges. The institution is working to complete a $6 million overhaul of its exhibition space, and a new exhibition, The Future Is Present: Art from the 1900s to the 1970s, is scheduled to open in January 2021.Though the institution hopes to be fully operational by the end of 2021, it will likely remain closed until at least June. In the event of an emergency, the museum will open to the public in the building that was previously the exhibition space and will remain open.In a statement, the museum said: “We will continue to think of ways in", "The next Biennial should be held in 2019, says the organizers. “New York’s Museum of Modern Art, which will remain closed through the end of March, is also committed to continuing with normal operations. The Metropolitan Museum of Art and the Brooklyn Museum are planning for this situation’s future, and we are monitoring the developments closely. We are in touch with the companies and are working in close collaboration with them. We are in touch with the artists and are actively seeking their perspectives, advice, and input.”\n\n\nThe Zurich Art Museum has put out an open call for a director. The appointment is for a three-month position that will be on a rotating basis. The position is part of a broader strategy that aims to create more engagement with the Art and Culture sector through the promotion of research at the institution. Adeline Könitz, the museum’s director of curatorial affairs, told the Art Newspaper that the institution hopes the new director will help the museum’s portfolio of exhibitions, exhibitions design, educational initiatives and educational programs. The appointment is based on a proposal submitted by a group of artists and artists’ organizations in June. The proposal was to create a new institution that would share the collection with", "The next Biennial should begin as soon as possible and will draw from a variety of cultural and historical sources and will address the themes of the exhibition “Between the World and Me,” which was staged at the Noguchi Museum in New York in 2002. \n\n\nThe National Endowment for the Arts (NEA) in the United States announced today that it is considering transferring the ownership of its holdings of works by William Henry Fox Talbot, a prominent eighteenth-century American painter and sculptor who is best known for his gouache paintings, which feature dabs of human skin and are often seen as an expression of his African American heritage.In a letter reviewed by the NEA’s executive director, Marc Glimcher, the agency’s board chair, Robert Siegel, told the agency that Talbot’s heirs have the right to “retain ownership of the assets acquired through the artist’s lifetime and to dispose of them as they see fit.”Talbot’s artworks are currently housed at the National Museum of American Art in Washington, DC, and are scheduled to undergo a major overhaul at the Smithsonian American Art Museum in Kansas City, Missouri, in 2021. The new museum will", "The next Biennial should focus on the body and its relationship to the body’s environment, on the body’s relationship to the environment, and on the body’s relationship to the environment’s own environment. This will allow us to better understand the relationship between the body and the environment, and will be a chance to see the life-forms of different species in their natural habitat. I’m hopeful that this biennial will bring new insights and inspiration to the exhibition.”The 2019 exhibition organizers asked the artist to create a new work, titled “On The Body,” for the twenty-third edition, which will open at the museum in November. The show will take place in the museum’s new building, located at 4E713, in the city of Belo Horizonte, Brazil’s capital. The museum will stage four live performances, including one from the artist’s home country of Portugal, during the exhibition, which will examine the impact of art in society and cultural life. Established by the Portuguese, the institution is affiliated with the country’s Ministry of Culture.The show will also present curatorial projects from artists and curators across Europe. The European Commission also", "The next Biennial should be in 2021. Rumors abounded that the museum had been tentatively scheduled for more than a year. The current exhibition, “My Life and the Future of Art,” opened in June 2019 and ran through August 2021. While the museum has been open since 1991, it has faced increasing financial troubles due to the coronavirus pandemic. It reportedly received $1.5 million from the UK government in 2019 and $2 million in 2020, and has yet to receive a cent from the US government. “I am deeply concerned by the exhibition ‘My Life and the Future of Art’ as it is held within the walls of the museum,” Andrew Neil, the deputy director of the Biennial, told the Art Newspaper. “It is a deeply troubling development that the first exhibition in the museum’s history is being held within the walls of the museum, and I fear that the exhibition will be a deeply distressing distraction from the work of the Biennial.”While the museum has not yet commented on the theme, the new exhibition will focus on “conceptualizing, building, articulating, and embodying the possibilities of art.” The first", "The next Biennial should be held in 2021. The painting was one of a number of works to be selected by artist El Beyd and collector and philanthropist Robert Louis Stevenson for the exhibition “Ninety Years of Vivian Bayer.”The exhibition was inaugurated with a presentation of twenty-five works by the artist on September 8, 1961, at the New York University Art Museum. It was followed by a discussion of the work in a lecture at the University of California, Los Angeles, in October 1963. The exhibition was organized by the biennial’s predecessor, the “Sydney Biennial,” which would take place in Sydney in 1963. The first Biennial Women, held in London in 1962, yielded the work Eleanor Kaufman, Art of Life, 1961–1963, which was included in the exhibition “Generations: The Sexualities of James and Virginia Bayer.” In addition to the works on display in the first Biennial Women, there were twelve works on display in the “Eternal Repertory: Artists in a Contemporary Setting” in London in 1967. The exhibition was also included in the “Martin Luther King, Jr. Papers: A Series of Ex", "The next Biennial should be held at least once every two years.\n\nThanks to New Yorkers and city government officials for taking part in this year’s edition of the biennial, which was held on September 10–11, 2019. The number of entries was 1,076, making this year’s event the largest and most prestigious exhibition of the series to date\u0097and the first to be held in Manhattan since its inception. The next exhibition will open in 2021.\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Mary Elizabeth Ann Barber as its next executive director. Barber was nominated by former director Michael DePasquale for the position in February and was sworn in by president John Anuszkiewicz on July 1.“I’ve enjoyed working with Mary since we first worked together on the Met, and I’m grateful for her dedication and ability to serve the community,” DePasquale said. “The board of trustees and I are pleased to appoint her to this important and challenging role.”Barber’s appointment comes amid the ongoing controversy surrounding the museum, which recently faced a wave of protests from the public and some local politicians after it", "The next Biennial should be held in 2021. The art from the exhibition, titled “Ava Gardner”, will be presented by the artist in cooperation with the publisher, the Berliner Kunstverein, and will have its first exhibition in the city of Berlin, Awards und Laughs. The exhibition will be organized as follows:The exhibition will be divided into three sections: 1. Art in the City of Brotherly Love: A Collection of Early Modern Art from the United Kingdom; 2. Modern Art in Transition: From the 1930s to the Present; and 3. A World of Difference: Painting, Drawing, Sculpture, Architecture, and Art. The exhibition will be staged in conjunction with the Biennale d'Honneur d (February 2019), which will be held at the Stedelijk Museum in Amsterdam.\n\n\nBarcelona’s Art Museum received a $58 million donation on Monday, February 12, following months of protests and protests over the institution’s failure to address the ongoing unrest in the city following the dismantling of the city’s controversial 1936 monument of General Francisco Franco. The donation, which is the largest ever given by Spain’", "The next Biennial should be held at the ExCel, London, in October 2021.\n\n\nArtnet reports that Leona Lewis, who has served as director of the Museum of Modern Art (MoMA) in New York since 2013, has been appointed director of the Center for Contemporary Art (CAR). Lewis will assume her responsibilities on June 1, 2020.“LEONA LEWIS, ARTIST AND CONSERVATIVE” is a cornerstone of MoMA’s mission to dedicate time and energy to present contemporary art in an ambitious, forward-looking, and interdisciplinary manner that emphasizes the critical importance of the arts in driving social change,” said MoMA director Matthew Teitelbaum. “Leona represents an exciting new generation of curator and the kind of person who is always keen to make the world more accessible and more engaging for everyone.”Born in Los Angeles in 1968, Lewis first studied at the University of California, Berkeley, where she completed her undergraduate degree in 2008. She then enrolled at the California College of the Arts, the University of California, Los Angeles (UCLA), and the University of Maryland, College Park (UMass). She returned to UCLA in 2012 to complete her master’", "The next Biennial should take place somewhere in the United States in 2022. The director of the Center for Contemporary Art, Los Angeles, opened the year-round exhibition in March and has held the event every other year since.\n\n\nThe Fine Arts Museums (FAIM) in London have appointed Linda Ashbrook as their next chief executive and director. Ashbrook is the head of the division that manages the collections and exhibitions of the National Poetry Library, the National Poetry Book, and the National Poetry Archives, and is responsible for the development and administration of the organization’s endowment. Ashbrook will assume her role in March 2021.“We are pleased to welcome Linda to the FAIM family and look forward to her leading the museum through this difficult period,” said Peter Lloyd, chair of the board of trustees. “Our museum has been through many transitions during its more than seventy-five-year history. We have had successive directors who were committed to the museum’s long-term goals, like David Humphreys, who became FAIM director in 2012; and now, with Linda, we have a visionary leader who is committed to building on the Museum’s legacy of pioneering the art of writing", "The next Biennial should be held in the fall of 2020.\n\n\nSARAAC, Israel (JTA) — The Israeli government is planning to send around 120,000 items to the United States in the form of grants for cultural institutions in the country, in an attempt to help them cope with the coronavirus. The gift amounts to around $6 billion, and is part of a $9 billion package of foreign aid measures enacted by Prime Minister Benjamin Netanyahu in an attempt to stem the spread of the virus.“The current situation is very challenging,” said Minister of Culture Avigdor Lieberman, who added that the government is currently working on a comprehensive strategy that will address the challenges posed by the coronavirus and will present its recommendations to the American people in the coming months.The American response to the coronavirus has been divided into three broad categories: shock, solidarity, and compassion. In solidarity with the American people, Lieberman said that the United States will continue to send aid to Israel in support of the “essential needs of a healthy and functioning America,” which he described as “inherently Israeli.” He also said that the government will continue to evaluate opportunities to give direct financial support to cultural institutions.", "The next Biennial should consist of an exhibition of works from the collection assembled by eccentric curators such as Jules and Emmanuel Bienni, the Belgian duo who created the foundation, the Museum for Contemporary Art, Paris, in 1996; and Amira Edidi, who still runs the popular venue GRAIN in New York. From October 2019 to March 2020, the Biennis will stage exhibitions in various languages and will collaborate with other organizations such as Art Basel and the Bertelsmans. The show will also feature works that are currently on display in the museum’s collection or currently on display in the collections of other institutions.\n\n\nThe National Museum of Art in Washington, DC, is revamping its exhibition space in an attempt to make it more interactive and engage with community life. The renovation, which began in May, involved the installation of more than 150 new works as well as the relocation of the museum’s permanent collection. According to the New York Times, the renovation includes the removal of twenty-five sculptures from the collection and the construction of a new pavilion devoted to the American West.“In these challenging times, when the arts are desperately needed, the National Museum of Art has come together to address the", "The next Biennial should be held in late September. The twenty-third Biennial will be held in late October. The twenty-eighth Biennial will be held in November. The twenty-ninth Biennial will be staged in December; the twenty-sixtieth will be staged in January. The twenty-sixtieth will be staged in January; and the twenty-sixteenth will be staged in February. The twenty-sixteenth will be staged in February; and the twenty-sixteenth will be staged in March. Here is the full list of participating artists:•Satya Nadella, Mumbai, India: The artist-turned-designer-in-residence, who has been a longtime collaborator of the Biennale, has signed a partnership agreement with the Biennale to produce an exhibition of a work by artists ranging from Sitaram Yezdi, Bengal, to Theo Adhikari, Bangalore. The exhibition will be preceded by a series of lectures, which will be curated by Tommaso Celant , at the Museum of Modern Art in Paris next month. The artist-designer-in-residence will also serve", "The next Biennial should be called \"The Intiative Experience’s 20th Anniversary.” In a similar vein, Michael Massimino, chair of the museum’s board of trustees, said: “A new structure, new programming, new exhibitions, new collaborations. I’m sure that we will continue to be at the forefront of innovation with our exhibitions, our programs, and our presentations.”\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles (LA) has appointed Sofia Csikas, who has served as director of the Pacific Palisades, as its new assistant director for contemporary art. Csikas will be responsible for coordinating the museum’s collection strategy and for developing and shaping the Pacific Palisades’ contemporary art program, which encompasses contemporary art from Europe, Asia, and the Americas.“The Pacific Palisades is an important new cultural nexus that will help to define the future of Southern California,” said Marc Leder, chair of the board of trustees. “With Sofia Csikas, we have a visionary leader who understands the Pacific Palisades’ contemporary art to be a keystone of our mission", "The next Biennial should take place in London in 2021 and will include artists and researchers from nineteen countries.\n\n\nRCMP have arrested a man after he allegedly threw a live pig in a crowd at the Venice Biennale in Italy on Saturday, March 24, reports the Art Newspaper. The incident occurred when the 32-year-old man was confronted by a group of people at the Roppongi Art Museum in Tokyo on March 17. According to the Art Newspaper, the man was arrested on suspicion of attempted murder and is currently in police custody.The pig was thrown by the man, who was detained at the museum on March 19, after it bit a policeman in the leg during a scuffle. The incident occurred on the same day as the Venice biennial, which was canceled due to concerns surrounding the coronavirus and also coincided with the Venice Architecture Biennale, which was canceled, and the Venice City Hall, which was vandalized by protesters.Following the incident, the man was charged with attempted murder. While the police said they suspect the incident may have been a case of mistaken identity, the Criminal Court of Cassino opted against criminalizing the man. The court found the incident to be a \"serious incident\" and ordered him detained while the", "The next Biennial should be held in the city sometime in 2020.A statement published by the festival said: “The festival is committed to enhancing the exhibition experience in a way that is collaborative and that allows the audience to be part of the development process. The work of the biennial is always being developed and will always be open for the exhibition of the activities in the exhibition. The concept of the Biennial is that the work of the artists is presented in a biennial environment so that the exhibition can be held in a museum building. The Biennial is not a museum exhibition. It is a space for the exhibition of the work and for collaboration between the artists. The Biennial is a platform for their creative work. All the artists participating in the upcoming biennial are represented and the artists are represented with their families and friends. The air is warm, the ciders are sweet, and the food is delicious.  ”\n\n\nOrganizers of the 2019 edition of Art Basel Hong Kong have announced that the fair, which has been canceled since March due to the ongoing standoff between the government and the pro-democracy protests in the region, will return to the site of its last edition in September. Event organizers said that the decision was made following discussions", "The next Biennial should take place in the spring of 2021. “We are still in the process of understanding the physiology of the brain,” said James. “Given the results of preclinical models, we believe that the first year of the new biennial will be the most productive.”As part of the agreement, the organizers of the Biennial will donate $500,000 to the center in support of its research. The center will also receive a portion of the proceeds from the sale of each exhibition\u0097each exhibition is slated to run for forty days\u0097and will distribute the funds among its participating artists. In addition, the center will receive $150,000 in unconventionally-designed works that were previously excluded from the Biennial, and will be given a $50,000 loaner, which will be returned to the artist. The organizers also said that the theme of the exhibition will be “real,” “unreal,” and “uncanny” and that the artist-run spaces will be closed for forty days to “reset the brain.”Autumn/winter 2019/2019: Artist Fair, New York City. ", "The next Biennial should take place in the spring of 2022.\n\n\nThe Metropolitan Museum of Art (MoMA), in New York, has released the following statement regarding its decision not to proceed with the renovation of its former space, the Metropolitan Ballroom: “The Met has made the decision to not proceed with the renovation of the Met Ballroom. We thank the many supporters who have joined us in our quest to reach a solution that would ensure the Met Ballroom is maintained in its current form as a Museum of Modern Art.” The progress of the project, which had been in the works since 2015, and the Met’s desire to relocate the museum to an adjacent building, the Smithsonian, prompted the artist-run nonprofit The Groundlings to organize a petition signed by more than 1,600 people, including Amanda Koerner, Katja Kliemann, and Konstantin Makarov, which urged MoMA to consider moving the ballroom.In a statement on Saturday, MoMA said: “We believe that a cooperative solution that has the support of both parties is the best path forward for the Met Ballroom. We have discussed the possibility of collaborating with The Groundlings and have been in communication", "The next Biennial should be held in 2021. “We could not be more excited to be working with the freshest teams and artists in the country and the UK,” Caroline Baker, chair of the Board of Trustees, said. “They have worked tirelessly to create a biennial that embodies the spirit of the city and the spirit of Cambridge.”The biennial will also introduce new and expanded activities, including a new contemporary art fair and a biennial of contemporary music. It will be accompanied by a major revamp of the library, to make it wheelchair-accessible and to extend the hours by an hour and a half. The redesign also includes the redesign of the library, which has been a part of the city’s landscape since the nineteenth century.\n\n\nThe CNA Center for Contemporary Art in Los Angeles, which has been the home of the Linda Irwin-designed Museum of Contemporary Art (LACMA), is pushing back the opening of a new museum in the city. The center, which was founded in 1990 as the successor to the late Los Angeles’s Center for Contemporary Art (LACMA), is currently undergoing an expansion spearheaded by the Los Angeles–based architectural firm Hauser & Wirth and has been", "The next Biennial should focus on creating “a new spatial and temporal norm for the collection, exhibition, and circulation of rare and contemporary art in the Latin American region.” The 2017 event, titled “Luciana and of the Two Worlds” (short title), highlighted the work of forty-nine artists from Latin America, including Anna Laudel, Marta Rosales, Luisa Severino, and Luís Navarro (who will be honored at the September 16 edition of the exhibition); the exhibition will also feature work by twenty-eight African artists, including Alewa Akunyili, Sifiso Aoki, and Amy Oei (who will be honored at the September 16 event); and a presentation of work by artists including María Berrío, Roberto Rodríguez, and Beatrice Abreu (conceived as part of the exhibition “Gustavo Grazios”); among other artists.The 2018 edition of the Biennale was held in Porto Alegre, Italy; the 2019 edition in Lisbon; and the 2020 edition in Munich.\n\n\nThe Museum of Contemporary Art (MoCA) has released the top twenty-five artists for its upcoming edition,", "The next Biennial should take place at the MCH Group in the heart of Zurich, in early 2020, and should provide an immersive experience for visitors to the exhibition.”\n\n\nThe Lusitania Museum of Art in Naples, Italy, has received the leftovers of the twentieth Venice Biennale. This year’s edition, which was curated by Ugo Rondinone, an Italian curator who worked at the exhibition, consisted of only three works, including a text on the municipal government of Venice, Lusitania Station. “The twenty-second Venice Biennale will be a special exhibition featuring works from the archives of the Italian state,” said Pier Luigi Bocconi, the director of Lusitania. The museum will also present a special exhibition of works from the collection of the artist Sixto Benici, who was a founder of the Galleria dellis Bernabei in Rome.The collection also includes Riccardo Battista’s unfinished work for the Second Venice Biennale, which was on loan to the institution from the artist’s sister, the artist Marta Battista. The work, titled Otto Brodbeck, was", "The next Biennial should focus on the history of the exhibition, the exhibition, and the production of the exhibition, and its relationship with the contemporary humanist and leftist movements. The program should include a consideration of the legacy of Eduardo Cuié, José Mujica, Gabriel García’s The Power of Paintings, and other exhibitions that have influenced its history. The opening of the exhibition will be celebrated with a reception in the city of Santiago de Chile.\n\n\nThe Pérez Art Museum in Madrid is planning to renovate its grounds in an effort to attract more visitors to the institution, which has served as a home for contemporary artists in the city since the late 1990s. With the start of its new location in Barasco, the Pérez Art Museum will boast an exhibition hall, an auditorium, a public courtyard, and a basement for special exhibitions. It will also boast a library that will feature books, artworks, historical documents, and other materials of the Pérez Art Museum collection.The renovation is part of the Pérez Art Museum’s commitment to diversify its collection. The museum acquired eighty works in 2017, and forty-six works in 2018. The renovation of the museum’s", "The next Biennial should be organized in the city in 2021.\n\n\nAuctioneer Marina Opoor has announced that she will be leaving the auction house to become the new director of the Royal Academy of Arts (RA). The selection of the twenty-two-year-old Malaysian for the post began on January 16 and will run through May 22. The winner will be announced next month.Malaysian artist and activist Belladonna Aliyu was chosen as the winner of the Mehrabi Art Prize for her work Her Body and Other Objects in the Art of the World: Malaysia, 1981–1985. The painting was included in the seventy-fourth edition of the Mehrabi Art Prize, held at the RMCA, Kuala Lumpur, and was selected by a committee chaired by Siti Nusseibeh and comprising Alkhraoui, Van Nguyen, and Ramzi Yemai.Commenting on the award, Aliyu said: “Belladonna’s work is a reflection of her own life, her life as a mother, the life of a daughter, the life of an artist, and it represents the life of a woman in a way that is very individualistic. It’", "The next Biennial should be held at the Museums in London, New York, and Tokyo. The organizers are also considering holding a second exhibition, which would be on the history of photography, at the Museum of Modern Art in New York, but the timing of the event has not yet been determined.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, has announced that it is preparing to welcome visitors back to the museum on September 8. During its temporary closure due to the Covid-19 pandemic, the institution collaborated with the California Department of Public Health (CalPERS) and the California Department of Food and Agriculture (CalFOVA) to help Californians prepare for possible furloughs and other job losses as a result of the unprecedented global health crisis, which has caused the US economy to grind to a halt and the stock market to plunge.“In order to avoid disrupting the work of other critical departments, including the collections and staff, the museum has utilized an innovative and state-of-the-art technology that has recently arrived on the scene,” said museum director Marc Glimcher. “In the coming weeks, we will share more about how we are using this new technology and how we plan for the", "The next Biennial should take place in 2020.\n\n\nThe Brooklyn Museum of Art (BMA) in the United States has appointed Carolyn Halstead as director of its new outpost, the Brooklyn Academy of Art. Halstead comes to the institution from the Metropolitan Museum of Art in New York, where she served as the director of the institution from 2018 to 2020.“Carolyn’s background and reputation for strategic thinking and thoughtful vision are ideally aligned with our mission,” said director William Schell, who previously helmed the museum for twenty-five years. “It is our intent to continue to promote the BMA’s mission as a community space for exploring the extraordinary in art through a new style of exhibition, programming, and public engagement.”  Halstead will take the helm of BMA from Joan Larsen, who will step down in March 2019, and will assume her responsibilities in August. She will serve as a consultant to the museum for three years after her appointment.“The BMA has had a rich history with the arts and architecture, and Carolyn’s leadership will ensure that our new space in Brooklyn, the Brooklyn Academy of Art, continues to cultivate a legacy of important work by artists and architects", "The next Biennial should be held in the fall of 2020. The next edition will focus on the evolution of the art conservation movement, and will be supported with a $750,000 prize. This year’s event is organized by the award–winning American curator and curator-activist Arianna Huffington, with the support of the Biennial Foundation in partnership with the Smithsonian American Art Museum and the Metropolitan Museum of Art.The 2019 winner, Manfred Koon, who curated the first edition of the Shangri-La Biennial in 2000, said: “From the first moment I saw the concept of a space devoted to the art of the Spanish Americas, I knew it was the right time to create an exhibition devoted to art from Spain. I also knew that the best way to do this was to organize a series of exhibitions that would draw from the best of contemporary and contemporary art from Spain. I have created an exhibition devoted entirely to Art from Spain, Leyman Contemporary, which will come to New York in 2020, and hope to accomplish the same thing here in the United States.”The first exhibition, “The Decadent Dilemma,” will open at the New Museum in New York on March", "The next Biennial should also include the first exhibition dedicated to the work of Hieb, Kupka, and Kummu, which will be held at the Naves, in the city of Nairobi. The competition, called Stimuli, will be hosted by the National Gallery of Art in Washington, DC, and will highlight the work of contemporary artists in collaboration with the National Museum of African Art in Atlanta. The event will also include a virtual reality research institute, a studio, and a public open-air garden.  The festival will also feature an exhibition of work by indigenous artists in collaboration with the National Museum of African Art, which is running an exhibition devoted to the scheme “Avant-Garde as Well as Art of the African Diaspora” (2018–19). The exhibition, titled The African Diaspora: Artists in the Modern Era, is curated by Juliette Gil and will be on view until September 24.\n\n\nThe Museum of Contemporary Art (MoCA) in Boston has awarded Artadia Pérez a $50,000 $100,000 MacArthur Fellowships for her and her daughter Viana’s first novel, I Am Not an Elephant", "The next Biennial should take place in Evanston, Illinois, in 2021, and at a site that will be developed by the city of Evanston, the artist-run nonprofit Alliance for Public Art, and the architect Luis A. Almeida, who is known for his Highline apartment buildings in New York and Los Angeles, respectively, and the experimental bronze-and-steel structures he designed for the Seven Seas, a multi-location Art Deco installation in Venice.The upcoming event will include a series of discussions exploring themes such as power, history, and the body, as well as include a lecture by artist-turned-activist Shih Chieh Huang, who immigrated to the United States from Vietnam in 1975 and has resided in New York since 1986.The theme of the 2020 edition of the Biennial will be “Bodies, Lives, and Politics” and will explore the intersections of art, politics, and the body in ongoing efforts to address issues such as homelessness, climate change, and human rights. Among the works scheduled for the exhibition are “Liu Xiaodong” (2018), a six-by-eight-foot bronze sculpture that depicts a nude woman and the male figure from the Chinese Revolutionary Party;", "The next Biennial should take place in 2021, and the first in 2022.\n\n\"The new wave of exhibitions at the Mall of the Americas will showcase the work of the worlds leading contemporary artists, new and established, and will be inspired by a deep sense of community and community engagement, the power of art, and the transformative power of the arts,” said Summer Holloway, president and CEO. “The biennial will still be a cultural destination. It will still celebrate the arts of our time. And it will still be accessible to visitors from all over the world.”The artworks selected for the 2020 biennial are:“Unmeld: A Social Network (New York and London),” a group exhibition, curated by the British artist Kate Fowle;“Feminine (Los Angeles and New York),” a public installation, created by the artist Oriana Rigg; and “The Third Wave,” a series of sculptures by the New York–based artist Jackson Pollock. The sculptures were commissioned by the artist to illustrate a specific moment in the artist’s history and are based on a line from the poem A Time for Everything” by Ellsworth Kelly.The", "The next Biennial should also take place in 2021, with the first edition to be held in 2022. \n\n\nThe Architectural Association in New York and the American Society of Civil Engineers in New Haven, Connecticut, have jointly announced the publication of “Building Design”, a new book that will offer a much more ambitious look at the design and construction of building construction and structural elements. The first installment of the book—which will be published by the Association in December 2020, the American Society in January 2021, and the Association in April 2021—is the subject of a four-month exhibition in New York this month.“Building Design: From Design to Habitats” will also appear in 2022, when the exhibition will be staged in New York. The book is a sequel to Building Design: Habitats and Design in the 1980s, a book that was published by the American Institute of Architecture in 1972. The design and construction of buildings is featured in the first volume of the new exhibition.The first new volume of Building Design: Habitats and Design in the 1980s, “Building Habitats: From Habitats to Buildings” (2017–18), was curated by Lorenzo Cattelan. The exhibition,", "The next Biennial should be held at the Art Institute of Chicago (AIC) in late March. The theme of the exhibition will be “Magic and Ritual,” a collaboration between the artist and the team behind the seminal exhibition, “Don Juan del Sur.” \n\n\nThe Tate in London has launched a new initiative designed to recognize the contributions of underrecognized artists and up-and-coming talents. Titled “The Artist Spotlight,” the program will invite up-and-coming artists to comment on the themes of the upcoming editions of Tate Presents, and will feature short works by selected artists in an effort to encourage them to pursue careers in the arts.“Our artists are some of the most underrecognized and undervalued in the world, and we are determined to make a real difference in their lives,” said Jon Bennett, director of Tate. “This is an opportunity for them to have a say in the themes of the forthcoming editions of Tate Presents and to shape the future direction of the show for future audiences.”The biennial was launched as part of Tate’s new partnership with the arts charity the Royal Shakespeare Company, which will stage the first edition of the Artist Spotlight in", "The next Biennial should be held in 2021.In defense of the museum’s decision, the exhibition was selected for its artistic innovation and its commitment to “socially engaged research and public programs.”The decision to move forward with the show was made after the organizers received a letter from the Pérez Museum of Art in Mexico City, which was strongly opposed to the exhibition. The letter stated its disagreement with the exhibition’s title and referred to it as “a way for the Pérez Museum to become part of the United States’s story.” The letter also questioned the authenticity of the work, which is based on drawings of the Pueblo of Tenochtitlan, and its authenticity in depicting the colonialist activities of the nineteenth-century United States.Following the letter’s release, the Pérez Museum issued a statement saying that “the Pérez Museum has made it clear that the exhibition is a part of our collection and that we have no plans to remove it.”The museum is also planning to relocate the exhibition from its current space in the Pérez, where it is currently housed, to an adjacent building next door to the Museum of American Art, which", "The next Biennial should be on October 23–25. \n\n\nThe Institute of Contemporary Art (ICA) in Vienna announced today that it is planning to open a new center dedicated to cultural heritage in the capital city of Austria. The project is part of the ICA Vienna project to unite Vienna with the city of the same name, in order to create a new cultural and historic site in the city. The initiative was launched in order to bring together the city’s cultural, historic sites, and to support the cultural and historical preservation of Vienna and the Austrian city of Vienna.The new complex will be called the Central Institute for the Study of Central European Art in Vienna and will be located in the former Rittergasse Kämpfe, a former munitions factory that is currently undergoing a major restoration. The work of the conservators, architects, curators, and historians will include the restoration of the former park and the surrounding area; the construction of a new visitor entrance; and the renovation of the Rittergasse Kämpfe.“Today, in Vienna, we are at the threshold of a new era,” said Bernd and Sabine Schäfer, the architects of the flagship project. “The project", "The next Biennial should have been held in September 2019. Instead, it was canceled. Instead of presenting their work, the artists simply sat down and wrote about their experiences. The exclusion of the late French impressionist Jean-Luc Godard from the upcoming edition of the Biennial was one of the reasons behind the organizers’ decision. The artists behind the exhibition, which was organized by the same organizers as the Biennial, said: “Our intention was to present a collection of works which represent the most recent developments of the art world. In the meantime, we decided to focus our attention on the exhibition of our work in the following months.”The exhibition “Dada Life” will be held at the Museum of Modern Art from September 8 to September 10, 2020. Dada Life will feature eight new works by the artists who were active in the 1960s and 1970s, including Richard Diebenkorn, Aline Lê, and Hélio Oiticica. The series will take up topics such as homelessness, the body, and the self, and will be organized in a way that allows the artists to engage with and communicate with one another. The exhibition will feature work by seventy artists in various stages of", "The next Biennial should take place at the Museum of Contemporary Art (MoCA), New York, the Museum of Modern Art, Chicago, the Museum of Modern Art, Los Angeles, the Metropolitan Museum of Art, the Museum of Modern Art, New York, the Museo de Arte Moderno, and the Museum of Contemporary Art, Los Angeles.  The deadline for the biennial is January 6, 2020.  The museum is currently working on a new set of guidelines for the exhibition, which will address issues such as safety and accessibility, community engagement, and storage. The new initiative was organized by the museum alongside the Brooklyn Academy of Music and the Brooklyn Museum. The exhibition will include more than 300 works by seventy artists and will be on view in the museum until January 6, 2020.\n\n\nThe Italian government has issued a $5 billion aid package to help the country deal with the coronavirus. The Cavalli Foundation, an charity that works with victims of the virus, reported that as many as 83,000 cases of the viral disease have occurred nationwide and that Italy currently has the highest death toll in Europe.The aid package was approved on Monday by Italian lawmakers and is designed to mitigate the health crisis by providing $4", "The next Biennial should be held in the spring of 2021. It will be organized as part of the following timeline:January 30: Experimentation suspended, will re-open in the spring of 2021.February 21: Experimentation suspended, will re-open in the spring of 2021.March 7: Experimentation will resume in the spring of 2021.March 15: Taken offline by the authorities after students complained about a strong odor in the building on March 14.September 26: The festival was supposed to kick off in the city of Schweiz on the shores of the Rhine River in Baden-Baden and have a limited running time of eight weeks. The event has been postponed to June.September 14: The twenty-three-day event, which was originally slated to take place in September, was rescheduled for October, and the twenty-fourth day of the event will now take place November 25–November 28.  October 6: Art and Culture Director Reinhold Niebuhr announced that the Festival of the Contemporary would be implemented as a biennial. October 9: The Swiss government announced that it would establish an endowment for the preservation of contemporary art and culture in", "The next Biennial should be held in the spring of 2020. The 2020 edition will feature twenty-five artists, including Daniel Cohn-Bendit, Mark di Suvero, and Tomasz Klimczyk.\n\n\nThe Museum of Contemporary Art (MoCA), San Francisco, has announced that ten works by artist Nick Cave and his wife, Susanna, will be on display in the exhibition “Nick Cave: The New Museum,” which will run for thirteen months in the Bay Area’s Imperial Valley. The piece, which was commissioned by MoCA and premiered by the institution in March 2019, consists of more than one hundred images that depict Cave’s and Susanna’s relationship.“We are thrilled to support Nick Cave and the family as they transition to a new home in the city of San Francisco,” said Peter W. Singer, chair of the museum’s board of trustees. “This exhibition will showcase the extraordinary range of his visual art over the last twenty years and will introduce us to his work in a way we have not done before.”Previously, the exhibition has featured work by Cave and his wife, Susanna, whose work is found in the collections of the", "The next Biennial should take place in the summer of 2021. \n\n\nThe Museum of Contemporary Art (MCA) in Los Angeles, California, will become the latest arts institution to receive a significant donation from a prominent supporter of the Carlisle Carr Foundation, the Los Angeles–based organization dedicated to the preservation and restoration of the late American masterworks. The gift, made by the Los Angeles–based arts philanthropist and collector Mary Bonilla, will enable the MCA to host a new collection, “The Art of Floating,” as part of a new $10 million fundraising campaign that will be launched by the foundation.“Not only has Mary made a significant gift to the MCA in support of the collection, but she has also made a significant gift to the arts,” said director Jeff Rosen. “Together these gifts give the MCA an opportunity to become a museum of the future.”Since the foundation began in 2006, it has given more than $30 million to support the MCA’s arts programs, including the Carr Museum of Art and the Los Angeles County Museum of Art. The Carr Museum currently hosts an exhibition of the work of artist-in-residence María Berrío\u0097", "The next Biennial should take place at the Victoria and Albert Museum in London in November 2020 and will include work by twenty-seven artists. The museum recently received a $1.5 million grant from the Arts Council to help with the construction of its new building.Sitting at the heart of London’s East End is a thirty-seven-thousand-square-foot former bookstore that has served as the venue for a number of performances, including The Purple People Ring, The Color and the Shape of Things, and The Silence and the Sound. The venue was also a venue for the annual Biennial of Free Contemporary Art, cofounded by Benny and Paula Pound, in 1994, and has recently hosted artist residencies. The museum will unveil the redesign in March.\n\n\nThe 2017 Whitney Biennial in New York City has released the list of sixty-six artists who will participate in its 50th edition, “Centrepiece: Art in the Age of Black Power,” at the Metropolitan Museum of Art, in April 2020. The biennial will also feature work by sixty-two new or existing artists, including J. Hoberman, L.A. Alexander, Andrea Bocelli, Sarah Brown, and ", "The next Biennial should be in 2021.”In a letter published by the Los Angeles Times on March 16, Correa, who was elected to the board of trustees in 2018, expressed his admiration for the institution’s trustees: “After careful consideration, I have decided to support the trustees of the Biennial, which has attracted the extraordinary talents of participants from around the world.”The biennial—which was organized and staged by the Los Angeles–born Correa in collaboration with the Los Angeles–based podcasters, including Ebon Moss and Earth + Wind + Water’s Tanya and Keith Olber, and the Australian filmmaker Noel David—was commissioned by the billionaire industrialist Richard Branson in 2013. The show’s inaugural edition, which took place outside of a Marriott hotel in Venice, California, was marred by a fire that broke out in a conference room inside the hotel on January 28, 2018. The fire was extinguished by firefighters, but the event was canceled due to the Covid-19 pandemic. Months later, the Podcasters’ union filed a grievance with the International Trade Union Confederation (ITUC), accusing the organizers of failing to include them in the negotiations.The I", "The next Biennial should take place in 2023, and the first exhibition will be a selection of biennial works that were created in the United Kingdom, France, Germany, and New York in the late 1960s to early 1970s. \n\n\nThe Los Angeles County Museum of Art (LACMA) released the list of thirty-seven artists whose works were restored to life by the Museum of Contemporary Art (LACMA) in 2008. The works will be featured in “The New Gilded Age: Art and the American Community,” a special exhibition that will open in the museum on November 10.“The work will then return to the Earth in a collaborative project with LACMA, which will send a robotic arm to gently lay down the material that has been removed,” said museum director Michael Govan. “It will then be the turn of LACMA’s permanent art historian, Dr. Ruthanna McAllister, to carefully lift the piece and examine its interior to determine how it came to rest in that location.”The seventy-three works are: Alfred King’s first large-scale sculptural project, “The Fall of the Twin Towers,”", "The next Biennial should be held in 2020.\n\n\nThe collaborative effort of the Museum of Contemporary Art (MoCA), Los Angeles (LACMA), and the Los Angeles County Museum of Art (LACMA) to re-create the museum’s iconic Fountain in the Sky in order to better reflect the city’s urban landscape has been celebrated as a success. The Art Newspaper reports that in a statement issued by the Los Angeles County Museum of Art, the project will be deemed a “game-changer. . . .” While that statement does not mention the Fountain in the Sky by name, the artist in question is Dorothea Rockburne, who also created the fountains on Mount Rushmore, after her husband, John Rockburne, who passed away in 2018.The Fountain in the Sky was constructed in the 1960s by Rockburne and her husband in the desert outside of Malibu, California, and is one of several fountains that have graced the museum. Other works by Rockburne that have gone on display include her work for the 1992 Venice Museum of Art exhibition “Art in Motion” (2007), work for the 2015–16 Venice Architecture Bi", "The next Biennial should be held at the Tramlink Art Space in London in 2022.\n\n\nIn addition to the increasing presence of galleries in cities across the globe, the number of art museums in the United States is plummeting. According to the Art Newspaper, the number of museums in the country has declined by 11 percent since 2007, and the number of museums that are currently closed is rising.The Art Newspaper cites data from the Association of Art Museum Directors (AAMD) and the Art Dealers Association (ADA) and states that between 2007 and 2016, the number of art museums in the country decreased by 2.1 percent. While these figures are impressive in themselves, they pale in comparison to the precipitous drop in revenue, which has been turned into a negative equity position for many museums. The Art Newspaper reports that 48 percent of the art museums that are still operating are losing money and that a further 24 percent of the museums that have been closed for more than a year are in jeopardy of going broke.Among the institutions that have been crippled by the pandemic are the Getty Center and the Metropolitan Museum of Art in Los Angeles, which recently reported that they are projected to lose as much as $30 million in the coming months. The Getty", "The next Biennial should be held in 2021, the organizers said.\n\n\nThe United Arab Emirates (UAE) has announced its representation of Lebanese artist Walid Raad in its upcoming edition of the Dubai Art Festival. Raad, who is best known for creating work that addresses issues of contemporary life and relates to the West through allegories and mythologies, was selected from a group of four nominees by the UAE’s Ministry of Culture and Arts. The exhibition, titled The Promise of Dreams, will be presented in the United Arab Emirates (UAE) capital Abu Dhabi in October 2020.According to the New York Times, the art historian George Quraishi, who curated the exhibition in 2014, called Raad’s work “truly extraordinary.” “The result is an immersive exploration of dreams and dreams about dreams,” Quraishi told the New York Times.Raad, who trained in Beirut and now lives in Dubai, created The Promise of Dreams as a work that explores the relationships between dreams and nightmares. The work is a meditation on the relationship between dreams and the dreams of many contemporary artists, including Ed Ruscha, Kerstin Brätsch, Frank Gehry, and Renzo Piano", "The next Biennial should be called for the year 2020 and aim to follow the contemporary practice of the artists who have made significant contributions to the history of art in the region, adopting the same strategies and spatial and social possibilities as the Biennial.”Pace has been working with the gallery for a number of years to create a space for Botín’s work, which is held in the collections of MCA, the Museum of Modern Art, New York, the Santa Monica Museum of Art, and the Whitney Museum of American Art, and has recently been commissioned to design an exhibition for the upcoming edition.\n\n\nThe Tate’s board of directors has decided to support a campaign launched by former Tate workers to secure the future of the organization’s long-running initiative, Tate Works, by reopening in 2020 under new management. The board of directors voted unanimously in favor of a petition that was published by a group of staff in mid-March, the same month that the Tate opened its new headquarters in Coventry, UK. Led by former staff artist-in-residence Jossi Atkins, who was employed by Tate from 2005 to 2009, the petition demands that the museum reopen as soon as possible and that Tate", "The next Biennial should be held in the spring of 2020. View the full list of participating artists here.On Sunday, September 28, artist Nadir Sinha will become the fourth person to be included in the new exhibition series, which is named after the iconic figure who inspired American independence from Britain. Born in India in 1947, Sinha studied under K.G.K. at the University of California at Berkeley, where he studied under the tutelage of M.L. Pei, who became the first head of the University of California, Los Angeles. In the early 1960s, Sinha moved to New Delhi, where he eventually began his career as a painter, animator, and writer. In 1986, while still in his thirties, Sinha was commissioned to create a print for the series “From the Cities to the Mountains.” The painting, “Aurora” (1997), inspired the sculpture “Gill and Gere,” which was composed of seven sculptures, each representing the central metaphor of the series. The work, which had a life of its own, was commissioned for the publication of a book by American artist Mark Di Suvero, “From Housing to Land", "The next Biennial should be staged at the Cultural Center of Art in New York, which is currently undergoing a $50 million renovation; the Museum of Modern Art, which recently announced it will not be rescheduling its 2020 event, and the Museum of Contemporary Art (MoCA), which has been considering the possibility of its reopening for years. The American Society of Cinematographers also recently announced it will no longer grant fellowships to the biennial. The association’s president, Henry Luce, said: “This is a moment of great change for the field, and for the culture as a whole. We are deeply grateful for the work of the panelists, nominees, and the many women who have made this possible for us. We are confident that this biennial will advance our vision of how an artist can tell their own story.”\n\n\nThe British artist Philip Glass has announced his resignation from the Royal Academy of Arts, the British government’s national academy of creative arts, in a statement issued by the British Council. The Academy’s board chair, Anne-Marie Neave, said Glass’s resignation was “part of a long-term plan to examine the relationship between the arts", "The next Biennial should be held in 2021. \n“The key [to our future] lies not in the future but in the present,” Negev said. “What we are seeing now is precisely what we are striving for. We are committed to the rebuilding of a new world. This is the only way forward.”Hear the full interview with Negev and his team over on Artforum.com.\n\n\nThe artist-run nonprofit MCH Group, which operates an art gallery in New York and has locations in Los Angeles, London, and Istanbul, has announced the opening of an artist-run satellite space in the city, MCH Cinéma, which is run by an independent board of directors. The third iteration of MCH Cinéma will take place in 2022.MCH Cinéma will be located at 345 West Twenty-Fifth Street and will be inaugurated by a solo exhibition of Artforum’s work, “Laughing Gas.” The show will feature work by nineteen artists, including Junya Ishigami, Michael Ose, and Luisa Redentor, and will kick off with a presentation of work by Claudia Aic", "The next Biennial should take place in 2022. The second will be staged in 2021. \n\n\nThe Museum of Arts and Design (MAAD) in London has received a gift of two artifacts from the late American collector and activist Peter Abel. On March 15, the museum received a set of originals made by American artist Frank Stella\u0097the pair were close friends\u0097and a collection of nineteenth-century works by Maurice Breuil and Louise Nevelson. Both works, titled Frank Stella: A Modern Dream, and Maurice Breuil: The Life of Painting, were acquired by the activist in 2008. The former was part of an exhibition dedicated to the artist at the museum, and the latter was on view at the gallery when it was closed in 2015 to receive a $10,000 donation from the Breuil Foundation in honor of its centenary.“Peter Abel recognized the transformative power of art and human interaction,” said museum director Nicholas Cullinan. “By buying these two extraordinary works, the Museum has confirmed Peter Abel’s vision for MAAD as a permanent home for contemporary art.”\n\n\nThe Institute of Contemporary Arts (ICA) in London has appointed Erin", "The next Biennial should commence in April 2020.<|endoftext|>After Donald Trump won the presidential election on Tuesday, November 8, many people were inspired to reevaluate their political affiliations and allegiances. Since Trump was elected, many people have come to terms with the fact that they are no longer aligned with the billionaire real estate developer. While some have come to accept his presidency, others have criticized it and its supporters, such as New York Times columnist Maureen Dowd, who called the new administration “toxic” on Twitter.In an effort to address these challenges and more, the Museum of Modern Art (MoMA) in New York will host a series of exhibitions dedicated to queer history and the LGBTQ+ community in the museum’s new space at 508 East Twenty-Second Street on October 31. The first show, “Queer History: From Me to You” (2019), will showcase work by seventy-three artists, including Alex Puccio, Dario Catellani, Mark di Suvero, Mariette Gara and Yuca Kato. The second show, “Queers in History: From Mary Wollstonecraft to Michelangelo” (2019), will examine the", "The next Biennial should have a budget of at least $45 million. But the decision was made in an emergency, and the budget for the 2019 edition was cut by half. The 2019 edition, titled Artificially Creatively, was curated by Karin Deutsch, a professor of art history and contemporary art at the University of California, Los Angeles. The 2019 edition of Artificially Creatively, entitled Tomorrow, was curated by Paul Johnson, the director of the Art Institute of Chicago. The 2019 edition of Tomorrow, also titled Tomorrow, was published by Art in Motion, an imprint of the Art Museum Chicago.“An emergency is an emergency,” said ART’S administrator Lorna Simpson. “It is a double-edged sword: on the one hand, it can be a catalyst for critical thinking, creativity, and creativity at scale. On the other, it can be paralyzing. It should be a signal to think hard about what you want to accomplish, what you need to build, and how you will proceed.”\n\n\nThe Los Angeles County Museum of Art (LACMA) has received a gift of forty", "The next Biennial should be held by the end of next year. In the meantime, the artist-run, four-person group :AiGOD’s first exhibition, “We Are All In This Together,” will be celebrated at Guggenheim Museum in the coming months.\n\n\nThe Metropolitan Museum of Art in New York has released the decade-long schedule for its forthcoming exhibition “The Metamorphosis,” a three-day celebration of the Metamorphose’s art and architecture, which will run from March 17 to March 19. Titled “The Metamorphosis: Art and Architecture in the Metamorphosis” and curated by Pete Sands, the show will feature work by ninety-three artists and will be open to the public from March 19 through March 22.“The Metamorphosis is a global celebration of the Metamorphose: the artists who have combined beauty and art in radically new, and sometimes unexpected ways,” said Sands. “The exhibition embraces that ethos while still bringing together some of the most important work in the period between 1967 and 1978.” The full list of participating artists is as follows:\n\n\nThe National Gallery of Scotland has appointed", "The next Biennial should take place at the Marquis de Sade in Paris, France, in December 2022.\n\n\nThe Art Newspaper reports that Art Basel is preparing to open a new Contemporary Art Museum in Singapore. The institution will be built in the former Acropolis Theatre building in the heart of the city, the former site of several major art exhibitions, including the Singapore Art Biennial in March, 2011, and the Singapore Art Singapore Exhibition (SASEE) in March 2019.The new museum will host more than 1,000 contemporary art exhibitions annually and will boast a more than 1,000-seat theater and a permanent collection of photography, art, and ceramics. It is also expected to be able to host more than 250,000 visitors annually.Dubbed the Contemporary Art Museum Singapore (CAMS), the museum will also boast a museum, exhibition spaces, a library, a café, and an amphitheater. The new museum will be built on the site of the former Acropolis Theatre, which was converted into a Perrotin Art and Design complex in 1998.“We were inspired by the theme of our new CAMS, ‘The Future of Art,’ where we hope our visitors will find an", "The next Biennial should take place in the second half of 2019, with the exhibition expected to run until December.\n\n\nThe San Francisco Museum of Modern Art (SFMoMA), which exposed the building of a new museum as part of a long-range plan to remake the city, will invest $1.2 billion in the redevelopment of its campus this year. The investment includes the construction of new workspaces, the renovation of the existing building, the expansion of the exhibition space, and the acquisition of works by artists who have been in the Bay Area for decades.The city backed the project with a $860 million bond issue in 2019, as part of a $3 billion overhaul of the city’s infrastructure. The city will also spend $130 million to rehabilitate the existing landscaping and the existing building. The renovation work—which will be overseen by architect Daniel H. Kahn—is slated to be completed by 2021.The project, which is part of a broader transformation of the Bay Area’s landscape, will incorporate the demolition of the existing General Electric building, which is slated to be replaced by the new Museum of Modern Art, the renovation of the existing mechanical and electrical infrastructure, and the conservation of natural materials, including the soil, the", "The next Biennial should take place in Munich in December 2020. Artforum will provide an update on the status of the biennial and will publish an exhibition preview art by Elisabeth Kocherländischer in December 2021. \n\n\nThe Cyprus-born American artist Vincent van Gogh—whose work often incorporates urban landscapes and mythologies and can be found in the collections of the Museum of Modern Art, the Metropolitan Museum of Art, the National Gallery of Art, the Louvre, and the Tate—has died at age eighty-eight at his home in New Orleans.Born in Brussels in 1942, van Gogh began his artistic career during the Italian occupation. Over the course of his career, he made his drawings by traveling to the United States to work on a teaching position at the University of Kansas, where he met fellow artist and painter Fritz Adler. By the 1980s, van Gogh was working on a painting for the first-ever European pavillon at the Venice Biennale\u0097the work was exhibited at the London/New York Art Fair in 1985 and won the Prix des Arts Échos in Paris in 1988. Van Gogh was also working on the first serious attempt at a narrative Dutch art, for his", "The next Biennial should focus on the origins and history of the artworks in order to determine their spatial relationships and to develop a new narrative. Using the artworks and the contemporary art landscape, the exhibition should question the historical narratives surrounding the exhibition and its creators, as well as the contemporary art world. Erika Balsom’s fusion of audiovisual and pop culture will highlight the contribution of people and places—for better or worse—to shaping the contemporary art world.”The art biennial will utilize a selection of works created and exhibited by fifteen artists, including Timothy Greenfield-Sanders, Billy Ray Ritchie, Irène Griffith, and Robert Irwin, as well as works by artists who have lived or are currently living in New York City, including Alex Katz, Peter Kapoor, and Laura Owens. The exhibition will also include a monograph on the exhibition, which will be curated by Peter Eidelman.“The BioLogos Biennial’s mission is to demystify the creation and history of art by using the artworks and their contemporary context to examine the relationships between art and culture,” Amanda Feigenbaum, chair of the Biennial’s curatorial committee, said in", "The next Biennial should take place in the city from April 13 to April 16, 2020. Its theme, 'Amerikkkan: Particle and Vision,' will focus on the protestors and communities that have participated in the ongoing protests in Germany, and will include new synthesized paintings and drawings by the artist, a selection of historical works, and works by local and international work. “The Biennial is an important project for me as a curator and artist, and I am excited to introduce my work to the public, both in Germany and internationally, to create a platform for dialogue and reflection,” said the artist and director, Alexander Vedler.\n\n\nThe Metropolitan Museum of Art in New York has awarded architect and theorist Zaha Hadid a $11.5 million MacArthur Genius Grant for her work designing the new headquarters for the museum, which will open in 2020 and will be located in a former steel mill in the Hudson Valley. Hadid will receive a $5 million stipend and will be given creative freedom to design the museum in her own way or not design it at all. “Hadid will redefine how we think about architecture as she reimagines the museum’s research and reception galleries and the museum�", "The next Biennial should be dedicated to the discussions of new media and the exploration of the interaction between art and historical artifacts. The theme should be “The current state of art.” The biennial will not be an attempt to re-create an alternate history. It will instead focus on examining the possibility of “contextualizing artworks in the twenty-first century through a historical perspective.”\n\n\nOakland’s City Council voted unanimously Tuesday to enter into a five-year lease agreement with the State Farm Museum, which is currently undergoing a $100 million renovation and is scheduled to reopen in the fall of 2020. The move comes two weeks after the council passed a $75 million package of incentives and spending relief measures, and a week after the museum made the announcement that it was planning to close permanently.“The renovation and reopening of the museum is the number one priority for the city of Oakland,” Councilman Noel Gallo said in a statement. “This means more hours for museumgoers, bringing in more revenue for city agencies and local businesses, and more opportunities for the museum to serve the community and expand the city’s cultural experiences.”The $75 million package also includes $45 million", "The next Biennial should consist of three exhibitions, each of which should have a unique perspective on the history of art and the medium. The first exhibition will be “A History of Art,” which will take place at the Museum of Contemporary Art in Vienna in January 2021. The second will be “For the Whole Universe” in April 2021. In the third exhibition, titled “Museum of Contemporary Art,” Biennale organizers are planning to invest €8 million in the acquisition of works by twenty-six artists over the next three years.\n\n\nThe Metropolitan Museum of Art (the Met) in New York announced today that it is preparing to welcome visitors back to the institution for a second season of “The Meters,” an “official museum companion series. The show will feature new works by artists such as Andy Warhol, John Cage, John Edmonds, William Kentridge, David H. Koch, Michael Porter, and Billie Kuai. The first new installment, which will run from March 25 to March 28, 2020, will be followed by “The Future is Now: A Metronomic Odyssey.”The show will also introduce new programming, including a new conversation", "The next Biennial should be held sometime in 2020 or 2021. \n\n\nThe Swiss Institute for Contemporary Arts (IZA) in Zurich has hired Maximilian Niebuhr, a cofounder of the German film-location company Lidl, as its new director. Niebuhr will be responsible for the transformation of the institution into a new resource for contemporary art and will take up his post on January 20, 2020.Niebuhr will begin his new role as director on January 20, 2020, after the September 11, 2001 terrorist attacks in New York. He succeeds Marta Graziani, who had led the institute for twenty-four years and will begin her thirteen-year term on December 2, 2020.“Maximilian Niebuhr’s appointment reflects the deep engagement with contemporary art that has characterized the institute over the last fifteen years,” said board chair Andrea Frapporti. “The institute’s new and dynamic leadership team has implemented a number of important and ambitious initiatives, including the launch of the Digital Archives and the initiative to extend the exhibition calendar online. In addition, the institute has made important contributions to the development of the digital landscape, promoting digital research and", "The next Biennial should open in 2021 and will consist of eleven exhibition halls with seven different themes. The first show, “AoM: The Spirit of Mists” (2019), is slated to open in the American City in 2021.The museum will also present a retrospective of the work of Eric Wieder and Paul Mpagi Sepuya in 2021, and an exhibition of the work of the same name in 2022.In addition, a selection of works will be given a retrospective at the Biennial in the United States in 2021. The show will also be made available to the public in the United Kingdom in 2022.Ellen L. Johnson, chair of the trustees of the museum, said: “This is a moment of great change for art and we are all eager to see how the Biennial will reflect this. We are confident that the exhibition will be a fantastic platform for discussions about the relevance of art to the people of the future.”\n\n\nThe National Museum of Art in Washington, DC, has added twenty-nine artists to its collection, representing seventy-five years of American art. The milestone addition marks the first time that the collection has included a Puerto Rican artist since 1930. The museum has also added twenty", "The next Biennial should be held in 2021, in the form of an exhibition organized for the first time by the German government, and will be organized in collaboration with the local authorities of the city of Essen and the city of Munich; a group of artists and scholars that represents Essen; and the city of Munich, which is currently experiencing a major influx of refugees. The first show, titled Unstoppable, will focus on the energy of art and will take place in the town of Rijksmuseum in the city of Rijksmuseum and will be accompanied by a book-length documentary, The Fountain of Immortality, by Jürgen Toditz. The second show, titled Energy, will feature the work of Anish Kapoor, who will focus on the history of art in the form of a series of glass sculptures, and will be organized in collaboration with the artist and curator in the city of Essen. The event will be hosted by the German government, the city of Essen and the local municipality of Rijksmuseum in accordance with the Federal Council Directive 762/Ekstiftung der Bundesregierung (Germany’s Federal Council for Culture), which outlines", "The next Biennial should be held at the Biennale the same year, and should be hosted by the same organizers. The opening ceremony will have the same theme as the first edition, and will take place at the Willem de Kooning Galerie in Hong Kong. The exhibition will run from March 13–March 20 and will be accompanied by two twenty-minute documentaries by the artist. The opening ceremony will also include a performance by the Amsterdam-based collective The Soft Machines, which was founded in 2000 by Rev. Olafur Eliasson. The show will feature work by twelve artists from the exhibition that will have their works included in the show.The Biennial will be hosted by Markus Bächli, chief curator of the Javanese artist collective Ujighere and the founder of the label Bächli Kunst. Bächli will also serve as chief curator of the exhibition “The Secret Life of Art”, which will be curated by architect Hans Knobloch from Augsburg, Germany. Bächli has previously curated the exhibition “The Secret Life of Art” (2017) and “Painting in the Clouds: A Retrospective” (", "The next Biennial should be staged in 2021, but it's unlikely that the commission would start from scratch in such a scenario. This will also be the second time the exhibition has been hosted by Art Basel. The first iteration was held in 2014, and featured work by a select group of artists, including Damien Hirst, Sergei Karik, and Rob Lu, alongside the works of ordinary and highly specialized artists. Art Basel kicked off the event by announcing that Richard Serra, the artistic director of British American Artists, will be the venue for the 2021 edition. The next stage of the exhibition will take place in the Songdo district of Seoul, between March and September, with the next edition opening on March 29. The 2019 edition was staged at the Koenigsthal in Cologne and featured work by a group of young South Korean artists, including Park Hanuk, Kim Eunho, and Kim Ki, along with work by artists such as Lee Tae Hyun and Kim Seo Hyun. The show was also featured in an online version of the exhibition for the first time, where it received a review by Artforum editor Chen Yilun.\n\n\nThe Centre Pompidou in Paris", "The next Biennial should be selected by the Board of Directors of the Association of Biennials and, in accordance with the recommendation of the Sub-committee on Arts, in January 2020. The site of the exhibition is to be settled by the following year. The exhibition will be organized as follows: 1. Artistic Expression 2. The Art of the Real: São Paulo and the Ancádotes of Edgar Casto (1953–1958)3. Die gute Artsterung, bei der Ankeller und die ernsthalen (1957–1963)4. Decks and Cabinet Art: Postwar and the End of the Real (1948–1954)5. Museums and the Art of the Past: Carl Andre (1952–1963)6. Postwar and the Art of the Future: Paris in the 1970s7. Postwar Berlin: Avant-Garde and the Making of Modernism (1948–1957)8. Artistic and Personal: The Lives and Works of Louise Bourgeois (1949–1966)9. KINN: International in the Art of Kunst - The Art of Exile (", "The next Biennial should take place in the fall of 2020. The new venue will host a number of exhibitions on the life and work of world-renowned artists such as René Magritte, Gábor Pérez, and John Szoke. The first exhibition will examine the history of human rights and the practice of curating in Spain, and the second will explore the connections between art and the social fabric of the city.\n\n\nThe 2017 auction house Modern Art in Prague announced today that artist Martin Heide’s works will be included in its upcoming edition, which will be held at GELT Staša in the Czech capital from March 15 to March 20. A selection of the artist’s works will also be presented at the 5000-piece biennial, which will be organized by the Pecherské Art Museum in Prague, the Nádra Museum in Prague, and the Institute of Contemporary Art in Vienna.“Our artists and collectors have always strived to present the most original works in the most modern and contemporary ways, yet maintain a strong sense of historical and cultural authenticity,” said museum director Veijo Hejda. “We are delighted to see that Martin Heide manages", "The next Biennial should be held in 2021, and the following year in 2022. The twenty-eighth and twenty-ninth editions of the exhibition will be held at the Visakhapatnam Art Museum in Chennai.\n\n\nThe Cologne-based company that owns and manages Art Basel, the world’s largest technology fairs, is considering splitting into two entities. As part of a plan to save $1.2 billion over the next five years, the Berlin-based design and technology company will sell its digital platform to a group of leading international galleries and museums on an in-house basis.Cologne-based company Art Basel’s management has acknowledged that the restructuring plan, which will see the company split into two new entities—Art in Residence, which will continue to operate as a platform for artists, and Art Central, which will become an online marketplace—is a “difficult decision.” However, the company says the proposed reorganization will make the company “more focused and agile,” and will also contribute to the development of new business models and better ways to connect with the art world.“As a creative company, we always try to balance the need to deliver a fair with the", "The next Biennial should be held at least five years after the date of the beginning of this narrative, to coincide with the opening of the exhibition “American Art: An Historical Survey,” which will open on September 21. \n\n\nThe Carnegie Museum of Art in Pittsburgh has announced that it will offer free admission to visitors during the first week of April, the second week of April, and the third week of April. The February event, entitled “American Art: An Historical Survey,” drew 1.2 million visitors to the museum. The first week of April will mark the first time the museum will be open to the general public since November 8, 2020, and the second week of April will be for “experimental and experimental sculpture.” The museum will also roll out a new online viewer on April 19, but not until March 21.The April event will be centered around the history of modern art and its relationship to society. “The museum is committed to making the most of the season to welcome visitors to view the next collection of works by artists of color, created since 1940,” said museum director Deana Haggag. “With that in mind, we are releasing an early spring edition of our", "The next Biennial should be held at a location that is accessible by car, bicycle, or foot. According to the organizers, the theme of the 2020 edition will be “Future Present.” For the second year in a row, the event will feature art from the archives of sixty-five local, state, and federal governments and will take place at the Ritz-Carlton in London. “In the past two and a half years, I have been working with Museum of Contemporary Art (MoCA) to establish a new platform for the collection, analysis, and presentation of archives,” said Muhammad Ali, chair of the trustees of the biennial. “In order to create a platform to engage with and engage with emerging art, I am delighted to present the exhibition Future Present,” which will feature work by seventy-five artists from fifty-nine countries and twenty-seven cities, as well as forty-eight recently selected artists.The exhibition’s inaugural exhibition, “HELMES IN THE AIR” (2019), included works by twenty-three artists, including Alfred Koons, Linda Anderson, Carolee Schneemann, and Anton Kern.", "The next Biennial should begin in 2020, and the biennial will run for two years, from March 18 to March 21. The first two years will feature works by seventy-five artists from twenty-eight countries. The fourth year will be a project-based exhibition.\n\n\nThe National Gallery of Art in Washington, DC, has launched a new digital platform that will allow the public to search for works by artists and to view them in real-time. Titled the National Database of Art Presented by the National Museum of Art, the initiative will provide patrons with a single public resource that will continually update the artist-based database.“The National Database of Art is an innovative way to engage with the collections and exhibitions of the National Museum of Art, and will provide an innovative new way for the public to access and explore the collections and exhibitions of the Museum,” said   Peter W. Peterson, chair of the museum’s board of trustees. The platform will work with the National Gallery’s website and will collect public comments and suggestions from visitors to the museum.The National Museum of Art Collections Searching for Art - National Museum of Art’s website. \n\n\nThe Shenzhen Biennial in China, which drew more", "The next Biennial should focus on how art and culture can overcome the territoriality and economic inequalities that formed in the nineteenth century, and that integrate Indigenous and non-Indigenous perspectives. We must continue to confront the legacy of colonialism with a vision of a new history that respects Indigenous knowledge, cultures, languages, histories, and peoples.”In an editorial for Artforum, Nina Turner wrote: “The exhibition ‘Return to the Land of the Past’ is a moment of great power. It reflects the times we are living in, and it re-creates our ancestral lands in our image. The work of artists such as Paul Gauguin, João Pessoa, Werner Ghent, Edward Hopper, Robert Irwin, and Jean-Michel Basquiat, and of contemporary artists such as Shimon Spheeris, Sigeiko Takada, and Ma Yue, is a powerful reminder that our history is a story of ongoing struggle and incredible beauty.”\n\n\nThe Richardson Museum of Art in Houston, Texas, has appointed Eva Hesse as its next executive director. She succeeds Mark Schier, who departed the institution in March 2019 to head the University of Texas at Arlington, and takes the helm from Shelley Tobias", "The next Biennial should take place in the spring of 2021. \n\n\nThe 97-year-old poet and activist Debby Shearer, whose profoundly emotional essays invited questions about the nature of consciousness and the nature of reality, has died at home in New York. “Debby Shearer: Art and Life” (2017) remains a foundational text in feminist, ecological, and indigenous studies, and the artist’s life and work is now collected in a monumental new exhibition at the Art Institute of Chicago (AIC).The first show dedicated entirely to Debby Shearer, the artist and poet whose poetry and art often addressed issues of art and sexuality, was curated by Susan Heilbron, the curator of Debby Heilbron: Art and Life, at the Art Institute of Chicago (AIC). The exhibition, which celebrates the artist’s seventy-sixth birthday, was organized in partnership with the Shearer Center for Feminist Art and the Mandel Museum of American Art.The show, which is organized as part of the museum’s larger “Debby Heilbron: Art and Life” campaign, features the artist’s work in the form of two large sculptures—the second", "The next Biennial should be held in the spring of 2022. It will coincide with the reopening of the Museum of Modern Art in New York.\n\n\nThe Yuz Museum in Beijing has appointed Ming Wang as its new curator of Chinese art. Wang, who has been based in the city for the past ten years, will be responsible for organizing exhibitions and public programs for the museum. He will begin his tenure in January.“Ming Wang’s vision to develop an international reputation for contemporary Chinese art by bringing it into contact with the world contemporary through a global artistic tradition is a very promising step in our continuing work to expand the Yuz Museum’s public and cultural awareness,” said Yuz Museum director Roland Yates. “Ming’s expertise in these fields will be instrumental in our efforts to build on the museum’s international reputation in this way.”Last year, the institution earned the trust of the public when it opened a new Carnegie-funded building on its campus, which was designed by the same Chinese architect who designed the main building of the Yuz Museum in Beijing and is slated to be completed in 2021. The building, which will play an important role in organizing upcoming", "The next Biennial should have a theme of “autonomy of the mind,” the author wrote, “and a reflection on the greatest achievements of the past seventy years.” The work will be curated by filmmaker Kiki Smith and will be open to the public.Commenting on the work, Smith said: “I wanted to do something that was contemporary with the current moment, something that was an extension of what I do as a filmmaker. So I started to think about what would be the theme of the biennial. It wasn’t until I started talking about it to people that I realized that the word 'autonomy' is a very specific term that has a very specific definition. So I came up with the idea of ‘autonomy of mind’ and I think what I’ve done has really put the idea of an exhibition of minds into perspective and I hope it will do that for the biennial.” \n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles announced today that it is reopening to the public in March 2019. The reopening comes just a month after the institution revealed that it is planning to launch a new programming series called “MIDNIGHT.�", "The next Biennial should take place at the Museum of Contemporary Art in London in 2021. “We are looking forward to collaborating with the city of London and the city of Berlin in the future, as we hope that our work will prove of great value to them,” said Artforum editor-in-chief Lisette de Vries. \n\n\nArtforum is pleased to announce that the 2018 edition of Artforum Milan, organized by the Italian contemporary art magazine il Primavera, has been withdrawn from March 25 to March 28. The event, which was slated to take place at the Museo del Tabacalera in Milan from March 10 to March 14, has been canceled due to the Covid-19 pandemic. “This is a very sad situation for the journalists who have devoted their careers to covering this crisis,” said Marc Straus, editor of Artforum.  “We are deeply grateful to Milan’s artistic and cultural professionals, to the organizers of this year’s event, and especially to the talented team of curators, writers, and editors that worked tirelessly to make this year of art an unforgettable and inspiring experience.”The Milanese organizers announced the immediate cancellation", "The next Biennial should be held in the spring of 2021. The curator will be ADOPT-LIKE, a curator-led initiative that brings together artists and thinkers from across the globe to focus on the insights and concerns of climate change. “By creating an environment that is both challenging but also encouraging, the Biennial will expand our understanding of the climate crisis and become an opportunity for us to reimagine our future,” said Noor Farsi, director of the Dar al-Ma’mún in the United Arab Emirates. “Noor believes that a global climate conference, held in February, must now happen as quickly as possible. We hope that the upcoming biennial will help encourage other countries to take action to reduce their carbon dioxide emissions and help us meet our climate goals.”\n\n\nNew York’s Metropolitan Museum of Art (MMA), which has been closed since March 19 due to the Covid-19 pandemic, has received $2.5 million and is planning to reopen next week. The announcement came on the heels of a $2 billion renovation and expansion project that will stretch the museum’s current footprint by more than 8,500 square feet and bring", "The next Biennial should be a success and I look forward to continuing to show the world the beauty and depth of work of the Hong Kong-based artists who are making such wonderful contributions to our society today.”In 2015, Hong Kong was awarded the Diploma of Arts and Science for its efforts to engage more deeply with China’s artistic heritage. The art world honorees also received the prestigious Gold Pact Award from the Hong Kong Cultural and Art Center (HKCAC), an award valued at more than $2 million.\n\n\nThe National Gallery of Scotland announced today that Anna Atkins, the first Native artist to win the Pinchukula Prize in the UK for her major-scale work The Birth of a Nation, will be the theme of the institution’s centenary celebration in 2022. The work, which was created in the late nineteenth century, is currently on display in the exhibition “The Birth of a Nation: The Art of Scots,” which opened in Glasgow last year.†The National Gallery of Scotland’s artistic director, Harrod Allen, said: “She showed an uncommon range of vision and talent in her work and was a champion of Scotland’s arts. We are thrilled to add her", "The next Biennial should take place in 2021.<|endoftext|>A pair of recent appeals by the American Civil Liberties Union (ACLU) in California and New York have led the California-based organization to launch a new digital platform and have it collect data on Americans' privacy. The platform, called the California Biennial Study, is tracking and collating the personal information of current and former visitors to the state’s beaches and is thus able to provide a snapshot of who is visiting California and what they are doing.The ACLU has been working with the California Desert Institute (CDI) on creating a data-mining tool that will assist the organization in identifying and analyzing the data collected by visitors to California’s beaches. The tool will feature search parameters that can be used to target specific individuals, such as people who go to Costa Mesa Beach or to San Diego County, and will analyze the data collected by visitors to determine which areas of the state are most likely to host illegal aliens.The tool will then be able to recommend specific locations in California to the California Border Patrol (CBP), which will then be able to direct Border Patrol agents to those areas. The ACLU estimates that the tool will be able to identify approximately 4.5 million individuals who are traveling to California", "The next Biennial should take place in 2022. The 2019 edition, titled “The Future Is Present,” was hosted by the Netherlands, which will reopen in the spring of 2020. The annual award comprises the Netherlands’s fifth and final prize, worth $5 million, and is presented by the right to promote cultural exchange and collaboration, and includes a special gift for the biennial, which will be awarded to the biennial’s theme and organizers from the Dutch Ministry of Foreign Affairs.The theme of the biennial is “French at the End of the Twenty-First Century: Subversion, Subversion,” and will focus on the political, economic, and social situation in France. The biennial will also include a new exhibition dedicated to French artists. The first of the six films is a tribute to Georges Seurat, who has recently been immortalized in a new exhibition entitled Le mémoil a l'histoire, which will welcome visitors to the museum from September 13 to September 20, 2020.The second film will be “Abandon all hope and despair.” It is a tribute to the late French socialist architect Jean-Luc Haussmann, who advocated mass social redistributions", "The next Biennial should also be set in an open-air building in the city, and the first exhibitions should be launched in early 2020. The current exhibition, “The Self-Portrait,” will run from March 11 to March 14, 2020. The redevelopment of the Centro de Artes Plásticas, a former munitions factory in the capital, is currently underway.The design and construction of the museum, which sits on an approximately 1,200-year-old industrial site and is located in the northern district of Santander, was selected as a part of the city’s Centro de Artes Plásticas (CAC), a series of local projects that aims to produce a new kind of contemporary art experience in the area. The design was inspired by architectural works of the same name that were created by architect Santiago Calatrava. The museum is also a collaboration between the University of Santander and the Art Institute of Madrid\u0097the institute’s lead architect.The Centro de Artes Plásticas was established in 1991 as part of the transformation of the area around the former munitions factory, which was completed in 2001, into a cultural and cultural destination. It aims to produce new", "The next Biennial should be held in 2020 and will take place in the city’s historic Guggenheim Museum. The institution has yet to announce the theme of the 2032 iteration.The announcement follows the first-ever biennial devoted to lesbian and gay life, organized as part of the Amsterdam LGBT+ Community Center (ELC), in February 2018. The twenty-oneth Rome LGBT+ Biennale is currently underway. The second edition of the Venice Biennale will open in 2022.\n\n\nThe United States Conference of the Arts (USCA) announced today that Andrea Levy-Parry has been appointed to its board of directors. She will serve for a two-year term and will begin her tenure in April.“We are pleased to appoint Andrea to our board of directors,” said USCA board chair Nicholas Negrete. “She has extensive experience in both retail and communications, having previously held positions at both companies, and has demonstrated an exceptional record of leadership in both areas.”Levy-Parry currently serves as a vice president at the American Customer Satisfaction Index, a consulting firm that offers services including training and consulting to companies such as Google, Home, and General Electric; works as a freelance writer", "The next Biennial should take place at the Museum of Contemporary Art Los Angeles (CAFA) next year. \n\n\nThe University of New South Wales, Australia, has defended its decision to remove a monument commemorating World War II servicemen and women from its campus in Brisbane, Australia, following a campaign led by students and alumni.After Australian students protested outside the Australian Embassy in London in March, the institution removed the monument, which commemorates those who died as a result of Allied Occupation, from its site and relocated it to a museum. However, the students were not deterred by the institution’s decision to relocate the monument, which they deemed a “symbol of white supremacy.”“The removal of the monument is a sad reflection of the state of racism and inequality in our society,” university president Elizabeth Ann Macgregor said in a statement. “This is a moment of great change for many, and the saddest is that this moment also represents a moment when many more people of color are denied the same opportunities and protections. To deny this is to deny the very humanity of these men and women who died for our country and future.”In an interview with Artnet News, Cara", "The next Biennial should be held in December 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in New York has hired William Jewell as its first director. The sixty-five-year-old, New York–based architect and curator was appointed in September. He succeeds William Jen-Ho, who departed the institution in June after nearly three years to become interim director and will assume the post in January 2021.“William is an exceptional leader who has been instrumental in developing the museum’s collection and curating program in ways that differentiate him from his predecessors,” said museum director Peter Rosenberg. “He has the vision and the ability to prioritize excellence, which will enable our team to make the most of our unique and extraordinary location on Tenth Avenue.”The new position was created in 2012 to replace Larry Gagosian, who was named deputy director of curatorial operations in September that same year. Under his leadership, the museum transformed its collection by pairing one expert with a particular subject, and is now working to introduce a new paid-internship program that will bring up to ten curators from the museum’s staff to the public for free admission each week. In a statement, Gagosian said that he�", "The next Biennial should open in 10 years time. \n\nGeorge Leach, director of the Institution of Contemporary Art in London, said: “The new partnership between Tate and the Leeds Academy of Art (LA) is a global success story. The partnership will launch a new initiative to support the visual arts through the theme ‘Pictures in Time.’ It is also a transformational moment for the academic relationship between Tate and Leeds and a foundation for future collaborations.”\n\n\nThe University of the Arts (UUA) in Glasgow has received $1.5 million from the Crown Fund in support of its $6.5 million expansion program. The funds will be used to improve the academic outcomes of around 700 students, faculty, and staff through the upgrading of their undergraduate degree and graduate careers.The expansion will also address the university’s questionable relationship with the controversial multimillion-dollar demolition project of the former UUA art school, which is currently under construction and is expected to be completed in 2022.The expansion will include the construction of the UUA Art School, the Rothamstead Art and Design Campus, the Atrium, the Walker Art Institute, and the ", "The next Biennial should be staged in 2020. On the occasion of the twenty-fifth edition, whose predecessor was canceled amid the ongoing Syrian civil war, the organizers said: “The themes of the Biennale are urgent and relevant today. The events and circumstances of the last eighteen months are interlinked and considered together in a single narrative.”\n\n\nThe Museum of Modern Art (MoMA) in New York has hired Stephanie Jones as its new senior director of contemporary art. Jones will be responsible for the development and management of its collection, which includes works by artists such as Rineke Dijkstra, Mike Kelley, and Rineke Max von Sydow, and will assume her new role on March 14.“Stephanie brings a wealth of experience and knowledge to MoMA, having served as the head of collection for sixteen years and overseeing a major expansion and renovation of the building’s collection in the 1990s,” said director Daniel H. Weiss. “We are incredibly excited to welcome her to the team and she will continue to play an integral role in developing and delivering MoMA’s curatorial and artistic programming.”MoMA has been working to secure a new location for the museum and its", "The next Biennial should be held in 2021. The next edition, titled “Between Light and Shadow,” will be held at the Biennial's new venue, the Museum of Contemporary Art Munich (MAM), on January 28–February 1, 2022. The remaining dates for the exhibition are March 3–March 5. MAM will host the first edition in February 2020, followed by the second in June 2020, and the third in October 2020. Related projects by the biennial include “Sissi, Empire,” featuring works by forty-eight artists, including Filippo Bellini, Martin Andrianopoulo, David Hockney, and Alexander McQueen, which was staged at the Guggenheim Museum in New York City in 2018; “Maria Berenicelli: From Dalla Artica to Dalla Arti” (2017), which is currently on view at the Museo Nacional Centro de Artes in Madrid until October 29, and “Jonathan Safran Gallery: The Art of America” (2015), which was awarded the National Endowment for the Arts’ 2017–18 Award for its exhibition “The Future Is Now: Jonathan Safran Gallery,", "The next Biennial should include a review of the current state of the art and future designs of the museum’s collection. In addition, the panel will have the authority to raise questions and to direct the next iteration of “Museum Biennials.”The biennial has faced many challenges, including two class action lawsuits filed by former employees of the museum, but the suits were ultimately dismissed last year when judges ruled that the former employees had not made a claim as the cultural institution had not received a single complaint about the renovations since the renovations began.The project was also criticized by a group of architects and architects’ groups that were participating in the exhibition. “This is a world where you can demolish a great urban fabric to make room for a Tesla factory and you can replace an entire continent with a factory,” Peter Ackroyd, executive director of the Art Newspaper, told the Art Newspaper. “Andrews has been a champion of the arts for decades and we are grateful for his years of service to the Museum. However, the institution has since deleted Andrew’s work from its website and replaced it with that of a museum representative who knew nothing about the renovations. We are baffled by this, and we are disappointed", "The next Biennial should be in early 2021. The next, 'The Future is Present', is currently on view at the Haus der Kunst, Vienna. The next, 'Upstream/Wirral: The Future Is Now', will be held at the Roy and Edna Disney, Scripps Ranch, and will be presented by the Bertelsmann Group in collaboration with the Haus der Kunst in collaboration with the National Museum of Modern Art in Berlin. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has commissioned artist Humberto Barredo to create a new mural that will feature an allegorical rendition of the final moments of Yoko Ono’s life and will highlight the legacy of the actress and activist. Barredo’s work will be on display in the museum’s new building, which will host the museum’s permanent collection of photographs, paintings, and sculptures, called the Museum of Contemporary Art, Los Angeles, and will be located at 1300 East Seventy-Third Street, Los Angeles.Barredo will be creating a mural that reflects the last moments of Ono’s life. “In the ‘50s, before she became a famous", "The next Biennial should bring together young artists, artists from underrecognized backgrounds, and established artists who have recently made significant contributions to their respective disciplines. The inaugural exhibition will feature work by twenty-eight artists and will open in May 2021. The biennial will be organized as a hybrid between a festival and a gallery, with the new structure co-developed with the Art Museum of Chicago and the Metropolitan Museum of Art, which is currently remodeling its space. The new installation will feature work by fifty-two artists and will run for forty weeks.The conceptual framework of the exhibition is the same: a festival dedicated to emerging artists, their emerging work, and a gallery. The new venue will house the museum’s two existing exhibitions. The museum will organize a new book, a new exhibition, and a new series of lectures. The institution will also continue to offer tours of its collection and will hold a series of public lectures on the museum’s renovations and the museum’s current exhibitions.The visual arts sector is facing daunting challenges in a changing world. The 2020–21 biennial marks the first time the museum has staged a series of exhibitions on any of its collections since 2004. The exhibition will also include new works by artists such"]