["The next Biennial should take place in 2020, with the new edition to be held in London in 2021.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Christina Ezell as interim director of its art collection. Ezell has been working at the institution for more than ten years, having assumed the role of chief curator in 2016. During her tenure, she has organized more than seventy exhibitions and curated more than 600 shows, including “The Untold Story of Salvador Dalí” (2018) and “Theater of Operations: The Gulf Wars” (2011). She has also served as a consultant to MoMA, and has presented internationally in international exhibitions such as the Venice and London Biennials, the Venice and Venice and New York Art Biennials, and the Venice and New York Art World Conferences.“Today we are thrilled to welcome Christina to the Board of Directors and to be able to introduce her to our incredible collection of works,” said Sara J. Donovan, chair of MoMA’s board of directors. “Her commitment and her energy to further this mission is unparalleled, and we are grateful for her dedication and zeal in supporting this incredible institution.”At the helm", "The next Biennial should take place in 2021.”The jury awarded the 2015 prize to the French artist, Antoine Berthot, who was selected for his work New York, 2018, and the 2014 prize to the Austrian sculptor, Annick de Toth, who was chosen for his work San Francisco, 2018. The museum is currently working on an exhibition that will showcase the work of the two artists.\n\n\nThe Museum of Modern Art (MoMA) in New York is planning to move the exhibition “Stellar: A Retrospective,” which has been held at the institution since 1964, to a new space in the city. The announcement comes on the heels of the announcement of the new museum’s new location, the Museum of Contemporary Art (MoCA), and the museum’s renovation of the former site of the Taconic Amphitheater in Long Island City, New York.“The museum is evolving as we reimagine our future in the city, and the landscape,” Mark Rubens, director of the experimental space the Teragram Museum, told Curbed. “In 2022, we will be celebrating our fifteenth anniversary in a new, contemporary building that will", "The next Biennial should be staged in 2020. The event will take place in the city’s old municipal building, in the Adras Alberti Arts District, between the city and the cathedral of St. Andrew. The 2020 event will be organized by the Adras Alberti Foundation and the city of Adras Ališ and will run from May 16 to May 23. In a statement, the museum said that the pavilion will be a “truly international exhibition,” displaying works by twenty-six artists. The museum will also create a new exhibition space in the old city, dubbed the White House, in honor of the biennial’s theme of “Peace through Strength.” The new venue will be inaugurated by a live performance by Adras Ališ, titled “A Gift to God.” The fair will also present its new theme “New Order: Art in Transition” alongside the biennial’s inaugural exhibition.During the exhibition, the artists will present works in the themes of “Global War,” “Postcolonial,” “Empire,” “New Now,” and “New Order” and will participate in a live", "The next Biennial should take place in 2021 and the last in 2024. Artist installations will include work by Galerie Toni Bergen and König on the forthcoming exhibition curated by American artist Alice Aycock, which will be held at the Arts Museum in New York in 2021.Each year the Museum of Modern Art (MoMA) in New York installs a new work by a selected group of art-world luminaries. The 2018 event featured work by Barry Williams, Maren Hassinger, Hans-Ulrich Obrist, Frank Gehry, Joan Miró, and Eddie Cue. Future events will include a biennial of Leonardo da Vinci’s Italian Modernism, which will be held at the Arts Museum in St. Louis in 2020; a biennial of Stephen Friedman’s American Art, which will be held at the Art Institute of Chicago in 2021; and a biennial of work by Eric Fischl’s associates in Korea in 2021.\n\n\nOn Friday, the Scottish National Party (SNP) in Scotland approved a new law that will grant the Scottish Government the power to remove a forty-foot-tall statue of Edward Snowden", "The next Biennial should be in 2020.\n\n\nThe Art of the Deal: The Art of the Deal (2018) will receive a $250,000 donation from the Gates Foundation, which was established in 1987 to help local NYC charities. The funds will go toward the renovation and expansion of the museum, which has been closed since June 30, and will be made available for programming and other purposes. The donation will also enable the museum to work with a new workshop, the inaugural exhibition “The Art of the Deal: The Art of the Deal,” which will open on October 27. The show will feature twenty-six works by thirty-four artists from eighteen countries, including Brazil, France, Italy, Poland, and Russia.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it is pushing back the opening of the inaugural exhibition “The Art of the Deal: The Art of the Deal”—a six-month fair that will feature twenty-five works by artists from twenty-seven countries—by a year. The museum expects the exhibition to draw in around four thousand visitors, but will schedule a launch date of May 28 to May 31, 2020, to accommodate the anticipated surge in runner-up", "The next Biennial should take place in January 2021 and will feature the works of seventy-seven artists, including Arkadi Brewster (pictured), Lisa Lavin (pictured), and Mark Masuoka (pictured).\n\n\nThe Israeli Library and Museum (INM) in Jerusalem announced this week that it plans to introduce new curatorial and curatorial-related initiatives and programs at its new location on the ground-floor of the Old City, the Grand Synagogue, in an attempt to re-create the Jewish site that has been largely overlooked in the country’s efforts to modernize the synagogues and the city.The institution purchased the ground-floor space of the Grand Synagogue, which is currently being renovated, from the architectural firm of Bezalel Toni and Adnan Menashe, of which the library is a member, for $63 million in September. The project, which began in 2015, involved the restoration of the structure along with the renovation of the adjacent Shiloosh Cavalier Gardens and the restoration of the surrounding area.“We are excited to be working with the Bezalel Toni and Adnan Menashe team at INM,” said director Daniela Gal. “They are dedicated", "The next Biennial should be held in 2020, but organisers are currently discussing whether to move the show forward.“The next edition of the Biennial will be a global celebration of modern and contemporary art, artists and their work, and an opportunity for us to witness the extraordinary transformation that has taken place in the last twenty years,” Monash University of Technology artistic director David McAllister said. The exhibition will highlight work by fifty-four artists and will feature work by artists who are still at work.\n\n\nThe Tate has appointed Clare Balding as its new director. Balding will take up the post on August 1. She succeeds Michael Gove, who has led the Tate since 2009 and is retiring after twelve years at the helm of the museum.“It is an exciting time to be at the Tate, as we embark on the Transformational Fifth—a new five-year plan that will set the museum’s agenda for the next twelve years,” Balding said. “I’ve been at the museum since 2008, and I’m proud of the work I’ve done. But it’s an exciting time to be a visionary at the Tate. I’m eager to", "The next Biennial should be held in 2022, but an exact date is currently unknown.  Deborah will lead the biennial in the role of curator. While curator, Deborah will focus on contemporary exhibitions and will work to introduce younger scholars to the work of artists such as Ed Donaldson, Paul Gauguin, and Pierre-Auguste Renoir. At the same time, the biennial will engage with topics such as the impact of the epidemic on artists and the history of art.\n\n\nThe Tate’s Board of Trustees has voted to give the British Museum $150 million to help it deal with the financial fallout of the coronavirus pandemic. The sum was agreed upon by three trustees, Sir Christopher Le Brun, George Anagnos, and Sir Nicholas Cullinan, and is the equivalent of 75 percent of the British Museum’s original $3 billion funding request.“We are delighted that the board has finally endorsed our plans to use the monies raised by the Covid-19 crisis to help ensure that the Tate keeps going,” said Craig Biggs, chair of the board. “That is our primary ambition and it should be supported by the public and private sectors. The fund will", "The next Biennial should focus on the history of the museum’s collection through the use of the Art Newspaper’s new online platform, which will launch in the summer of 2021. It should also include a survey of its collection by a panel of experts from the museum’s curatorial staff, a retrospective of the collection that is free for the general public, and a talk with the museum’s director, David Triana.\n\n\nYale Union, a nonprofit contemporary art center in Portland, Oregon, has received a $25,000 donation from the Cleveland Foundation. Established in 2001 by Cleveland native and philanthropist Jack and Nancy Armstrong, Yale Union was initially founded as a refuge for artists who were neglected by their families and were unable to afford permanent housing in the city. The space has since expanded to become an arts community for artists and their families in Northeast Ohio. The gift comes after the foundation received a $25,000 grant from the Cleveland City Council, which also established the 9/11 Memorial Art Museum as a community landmark, and a $25,000 grant from the Cleveland Downtown Development Authority. The Columbus Museum of", "The next Biennial should start in earnest in March 2019. “I want to leave the professional capacity of the arts to the talented and innovative young,” Monnaie told the Art Newspaper. “I want to focus on a unique vision of the future.”\n\n\nThe National Galleries of Scotland, which is currently undergoing a multimillion-dollar expansion spearheaded by the Scottish National Party (SNP), has announced that it is working with the design and media company Vanshas Associates on a new eight-thousand-square-foot cultural center that will extend the current exhibition-based institution and could launch in the spring of 2021.Dubbed the National Gallery of Scotland, the new venue will be in a renovated former mill on the outskirts of Edinburgh and will feature new work by contemporary artists and will host programming that includes exhibitions, concerts, concerts, and other events. The design for the museum was commissioned by the National Gallery of Scotland and includes a number of contemporary elements, including a glass floor and a metallic roof, and will be built in an environmentally friendly way that will reduce the institution’s carbon footprint.The National Gallery of Scotland has also committed to creating at least 250 new jobs as part of a £15 million campaign to", "The next Biennial should focus on the history of cinema in the collective memory of the patients, as well as the exhibition in question and its place in the history of cinema. \n\n\nArt Basel Hong Kong has announced that it will suspend the annual Art Basel Hong Kong fair until at least March 20, 2020. The canceled event, which was originally scheduled for March 21–March 24, 2020, was supposed to feature more than 150 artists from thirty countries and fifty cities, including London, New York, and Los Angeles.The fair was forced to cancel the fair due to the ongoing Covid-19 outbreak, which affected all fifty of the participating galleries in Hong Kong. The Art Basel Hong Kong exhibitor relations team informed the gallery that the event would be suspended until at least March 19, 2020, and that participating galleries would be compensated a fee for the canceled event. The fair will resume March 19.“This means that regardless of whether you are a regular gallery or an exhibitor, if your gallery is affected by Covid-19, they will be reimbursed a fee in order to continue to show at Art Basel,” said Art Basel director Maria Fernanda Pascual. “We have been working tirelessly", "The next Biennial should take place in 2019. \n\n\nThe Solomon R. Guggenheim Museum in New York has received a $10 million donation from the estate of John F. Kennedy. Established in 1961 by his wife, Jacqueline, the Guggenheim acquired the rights to the artist’s works beginning in 1975, and it has exhibited his work in various exhibitions since.The gift comes in the wake of the announcement that the estate will open a new John F. Kennedy Center for Art in 2019, and comes a year after the institution announced that it plans to build a new, expanded version of its existing space, which was completed in 1993 and houses around seventy Kennedy works. The center will also house the museum’s collection of Kennedy’s paintings, sculptures, and works of contemporary art.The new structure will add nearly twenty thousand square feet of exhibition space for the Guggenheim’s collection, as well as enhance the museum’s already impressive collection of more than three thousand works. The new space will also boast two large lecture halls and an area for the museum to create immersive works for audiences, and will boast a large terrace with views of Central Park. The center will also present new works", "The next Biennial should take place in 2019. The event will return to Jackson Hole, Wyoming, for a second and final edition in 2020. The first biennial in the country will take place in the United States in 2022 and be televised by the BBC.\n\n\nWelcome to the first edition of Commission for Art at the Museum of Modern Art (MoMA) London.   The theme of the show is “Collective Soul.” The exhibition runs September 9–September 11, 2020 and features works by eighty-six artists, including Adrian Piper (New York), Alain Guiraud (New York), Hélio Vidal (New York), ENRICO V. MARTIN (New York), LESLIE MARCH (New York), AMITA MARIE (New York), DONALD S. GALLOWAY (New York), HARVEY TAYLOR (New York), PATRICK GALLOWAY (New York), and JUANINE JOSEPH (New York).The first International Art Biennale in London will be held at the National Portrait Gallery in London, November 16–November 20, 2020. The event will be organized as follows", "The next Biennial should be held in the spring of 2021. The museum will also be redesigned to better reflect its historic setting. The project will include the installation of new works by emerging and established artists. “The Biennial is a living organism,” said John Birkett, director of the Museum of Contemporary Art, Los Angeles. “It will continue to evolve and change as it works with increasing intensity to reach new audiences for its existing collection and the art of contemporary life. The project not only presents the latest challenges but also the opportunity to extend the Biennial into the future by organizing exhibitions that bequest the collection to future generations. Therefore, I am confident that the new design will meet the contemporary needs of the collection, present a new and exciting exhibition, and foster the Biennial’s future.”\n\n\nThe American Alliance of Museums (AAM) announced today that it will award $9 million in grants to fifty-six museums in the United States over the next two years. The funds will support cultural heritage restoration and the preservation of collections and historic sites that are at risk of being demolished by developers or bulldozed by the construction and development industry.The organizations are the Los Angeles County Museum of Art (", "The next Biennial should be held in 2020. \n\n\nThe London-based nonprofit Art London, which has previously organized exhibitions in Paris, Berlin, and New York, is launching a new initiative that will help artists and organizations worldwide. Called the Artist Connects Fund, the program will be led by the London-based artist-run organization Art4All, which will assess three artists each year and will award them $100, $150, or $250 for their projects.The program will initially focus on a select group of artists whose work addresses issues of visual and/or conceptual knowledge, art, and design. As part of the initiative, the Art4All Awards will be given in partnership with Art London, in recognition of their achievements across a wide range of artistic disciplines, including sculpture, performance, design, film, and video. Since the Art4All Awards are an annual award, they are eligible to award any artist who has won the Art4All Award of the Year in the last two years. The recipients will be chosen by an independent jury comprising Erin Campbell, executive director of Art London; Michael Walsh, director of Tate Britain; MarekAjzalsjuk, director of the Jacobs Museum of", "The next Biennial should be set up by the HRC, with the support of the remaining 20%. The HRC said the game plan is to present works in select locations around the world. Five artists will receive a prize: Gere Kavanaugh, Alejandro Cesarco, Juan Diego Urruti, and Rehtaeh Khan. The other two finalists, Humberto Pérez and Stephen Frewer, will receive one-time grants.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that Kate Beckins, Terri Abbat, and Terrence Malick will be the featured artists in the seventy-fifth edition of the Bay Area Biennial, which will take place in the city next year. The twenty-first exhibition will open on January 22, 2020 and run until January 24, 2020. The Bay Area Biennial (BAB) will also introduce a new 360-degree immersive work by photographer Austin Wintemute and will feature work by forty-two artists from the United States and Canada.The original BAB was held at the Museo de Arte Contemporáneo in São Paulo from 2007 to 2009, and the seventy-ninth edition of the BAB will be held at", "The next Biennial should be held in a few years, he said. “It is possible to have a successful and sustainable biennial in the next few years.”As for how the new museum will be able to keep its doors shut during the coronavirus outbreak, Kunsthal Charlottenborg in Stockholm will not be affected. “At this moment of unprecedented challenges, we are taking all possible measures to protect against the virus while we continue to work with our partners, the public, and our artists,” said museum director Christian Kreuz. “We will have a long-term plan in place for the future of the Biennale, and we will make it workable for everyone.”\n\n\nBrittany C. Oehler, a cofounder of the New York–based nonprofit the Washington, DC–based arts incubator The Bipartisan Center for Independent Living (TCIL), has resigned from her post in protest of the Trump administration’s attempts to dismantle the Affordable Care Act, New York’s landmark social safety net program. Introduced in 2010 in the wake of the Great Recession, the ACA has provided millions of Americans with vital health coverage since it went into effect. ", "The next Biennial should open in August 2021. It will be hosted by the Museum of Art and the University of California, Los Angeles (UCLA). The 2019 edition, titled “Behind the Curtain,” was organized by the Los Angeles–based museum, which has a long history of exhibiting works from the collection of its namesake institution. The exhibition was organized with the collaboration of Museum of Contemporary Art (MCA), Sydney, and the artist-run organization Artforum. “We welcome the possibility that the next Biennial will become a collaborative event involving artists, curators, and institutions from all over the world,” said Dr. Molly Stoltz, chair of the board of trustees of the nonprofit organization Artforum. “The biennial is the great unfinished business of the exhibition lifecycle, so it’s a great honor and a privilege to present this year’s edition with full support.”\n\n\nThe San Francisco Museum of Modern Art (SFMoMA) has received a $100,000 donation from the David and Lucille Stoschek Trust. The donation includes artwork from the David and Lucille Stoschek Collection, the", "The next Biennial should be held in 2021.\n\nThe National Galleries of Scotland have announced that they are still working on a new partnership with the Edinburgh Art Museum, but that it will be a collaborative project, and will include a retrospective of the work of five artists: Richard Parnell, Paul Mpagi Sepuya, Peter Sze, and Robert Irwin. The show will be on display in the institution’s new building, the National Museum of Scotland, from January 26 to March 8, 2022.Among the events that will be included in the project are works by artists from the performer category, including Emma Hepburn, Adam Clayton, Philip Marlow, and J. M. W., and also the work of late Scottish sculptor Alan Hutton, a prominent member of the British post-war art movement.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles (MCA), has added two new members to its board of directors: artist and philanthropist Laura Mulvey, who joined the institution in 2013, and Jason Rosenblum, the founder of the investment firm Apollo Global Management. Mulvey is a founder of Foster + Partners, a firm she founded in 1997 that manages funds for artists, including Paul Gaugu", "The next Biennial should be up in the autumn of 2019. The exhibition will be held in Moscow at the Gorki Institute and Museum, and across the city from late September to early October. The exhibition will also be staged in the US at the Museum of Modern Art in New York, and at the Kunsthalle Basel in Switzerland.The exhibition is a follow-up to the 2009 exhibition “The Future of Art: Art and the Impact of Technology,” at the Los Angeles County Museum of Art, and is the third major project of the state-backed Institute of Contemporary Arts, Russia. It is housed in a modernist building in Moscow, is financed by the State Fund for Arts, and has a twenty-five-year run.The biennial will be inaugurated with a presentation of the first work by Russian artist and activist Svetlana Volkova, a survivor of the 2012 terrorist attack on the Moscow theater and the famed Saint Basil Cathedral, in which a suicide bomber blew himself up and injured more than sixty people, in the opening ceremony of the exhibition. The installation will be followed by “Art and the Impact of Technology: The Terrorist Threat to Russia,” which will feature works by", "The next Biennial should be held at the University Art Museum Dusseldorf, Germany, in April 2020. The institute will host a series of exhibitions, including a monograph on the life and works of Michael Faraday, and will present a seminar series on the contemporary art of the American South.The Biennial will also continue to advocate for the preservation of the Institute’s collection in the form of a monument. The idea of the museum as an institution for \"collective memory\" was one of the issues that inspired the institution’s founder, Werner Kner, to establish the Kner Foundation for Contemporary Art, at which point the monolith was added to the grounds of the museum.The foundation’s board chair, Axel Feuerstein, said: “We have been following through with our plans for a new exhibition that reflects the spirit of the twenty-first century. We are pleased that the Museum of Contemporary Art Hamburg feels it belongs here. It has been a great success in helping to to shape the exhibition in question and in ensuring that it is an ideal opportunity for visitors to explore the vast and diverse collections housed within the Kner and Munchausen, as well as to the Kner as a whole. We", "The next Biennial should be held in 2020 and will feature ten works. The first exhibition, a selection from the work of Sartre and Groupe Alfred and will run until March 21, 2020. The following year, another exhibition will draw fifty-six works from the collection. The second will be a biennial of more than sixty works by the legendary French master Claude Monet. The Biennial of the Propagandists, initiated in 1968, is the oldest of the three globally recognized ceremonies, and has hosted works by hundreds of artists. ELIGIBILITY: This year’s event will be held at the National Museum of Fine Arts, Singapore, from January 26 to January 28, 2020. TELEVISION: The theme for this year’s edition will be “The Present.” Featuring work by thirty artists, including Vincent van Gogh, Jean-Luc Bouyer, Salvador Dali, and Mieczyslaj Poland, the exhibition will also include interactive performances by Jean-Luc Moulène and the National Gallery Singapore.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has created a new initiative to help artists and", "The next Biennial should be held in 2021. The B.C. government has allocated $1.1 billion for the construction of more than 1,100 new homes for the Vancouver Art Museum (V.A.M.), the Canadian Museum of History (C.M.H.), and the Fraser Valley Film Festival (FVRF), and allocated $100 million to the arts and culture sector.\n\n\nThe museum where the Seattle Art Museum (SAM)’s collection of art, artifacts, and curiosities is stored is currently undergoing a major renovation, the $65 million modernization project being spearheaded by the Seattle-based firm Savant Architects, which includes the construction of a new visitor entrance, elevators, galleries, and a redesigned collection area. The $125 million addition is also intended to deliver a new collection of works by contemporary artists, including Hanna Graham, Mark di Suvero, and Nada Dziewior. The $150 million expansion project is expected to be completed by 2022.The new building, called the Seattle Center, will consist of three buildings: a 1,250-square-foot museum, an exhibition hall, and a visitor entrance. The renovation, which was overseen by architect Willem de Kooning", "The next Biennial should be staged at the Tangerani Museum in Tangerai, New Zealand, in 2022.The event will be organized as a biennial following the theme “Intersection of Modernity and Nature,” which is a reflection of the relationship between man and nature. The exhibition will feature ninety-nine contemporary and historical works by artists from twenty-six countries and will be led by artist-in-residence Su Yü, who currently serves as the curator of contemporary art at the museum. The exhibition will coincide with the seventeenth edition of the Tokyo Art Museum, which will be held every March. The exhibition will also prepare the ground for the 2020 Seoul Biennale, a triennial of contemporary art which will open at the Tangerani Museum in 2020.The centerpiece of the biennial’s program will be the exhibition “Primitive Minds:” featuring fifty works by forty-seven Chinese artists. The show will be organized as a project of National Museum of China (NMC), Beijing, and will include a solo show by artist Yu Jianli, a feature in the upcoming biennial titled “Atoms, Stars, and Moons:” which will be staged in March. In the past", "The next Biennial should take place in the spring of 2021. “The new museum will finally provide a space for the global collection of European art. We will introduce new exhibitions and projects that are based on the design of the museum, and will bring different kinds of exhibitions within the context of the existing complex.”The institution is currently working on a redesign that will make the museum more accessible to the public. The project is still in the conceptual stage, but the architects hope that the renovation will help the museum enter a new phase of its history. In a statement, they said: “This work, together with the upcoming exhibition ‘New Worlds in Europe’ and the launch of the biennial ‘Artforum 2020’, will greatly enhance and support the biennial and its mission.”Artforum is a digital platform that connects contemporary art and design. If you are an artist, designer, or collector, and would like to connect with other art and design lovers, please join us. If you are an art-loving collector, we hope that this will be the first of many exhibitions and talks that will connect you with the artists and designers working today and tomorrow.\n\n\nThe National Gallery in London is launching a new digital platform", "The next Biennial should take place in the spring of 2021.  The artist’s daughter, Anna-Doll, will also serve as the next director of the institution.\n\n\nThe Royal Academy of Arts (RA) in London is planning to shed more than 1,200 jobs in an effort to cut costs by absorbing more than twice as much arts and cultural production out of the institution. The cuts, which will not be made until at least 2022, have sparked outrage from arts professionals and have led to protests from some 150 people, including some of the artists whose works will be lost.The academy has already announced plans to reduce the number of its currently full-time employees by 11 percent, or 4,200, by 2020. The reductions would disproportionately affect women and people of color and would disproportionately affect artistic and cultural producers, the academy’s chair, the British Film Institute (BFI), said.The academy was considering reducing the number of staff by 15 percent, or 3,700, by 2021 and by 20 percent, or 6,300, by 2022. The cuts would disproportionately affect women, people of color and people working in remote and part-time roles, and would disproportionately affect artists, the BFI chair said.The academy", "The next Biennial should take place at the Museo de Arte Contemporáneo in Madrid. That exhibition, titled El Mundo del série, will showcase works by the artists represented in the three stages of the exhibition: First, under the title of a new project, which will be inaugurated by a performance by the artists in the studio. Second, the exhibition will be relocated to the Museo de Arte Contemporáneo, where the artists will present their next exhibition, entitled The Bifocal.“The Art of Design: Contemporary Art and Design” will open at the Museo de Arte Contemporáneo on January 23. The Biennial will recommence in Reykjavík in March. The artist-run space Artforum.com will be relocated to the new exhibition space the Tærklandbækring, a new location for workshops and performances, and a new digital archival collection. The annual Art Basel show, which is held in the same location, will be reorganized and relocated to a different location. The hotel will also receive new exhibition spaces. Tired of the same old things? The Tær", "The next Biennial should also include the French sculptor Emile Garson’s monumental 1981 sculpture Revolting Sea, which looms over a misty, central New York City skyline. The National Gallery of Art in Washington, DC, has announced that it is considering relocating from its current home on Pennsylvania Avenue to a new home on Pennsylvania Street, in an attempt to keep the exhibition focused on American art and the American landscape. The move would involve removing the Biennial’s current exhibition space, which hosts nearly two hundred exhibitions annually, from the street and moving the exhibition to a new building adjacent to the National Gallery.The building would be constructed of mixed-use materials and would offer a public courtyard and a museum-like setting for the exhibition, which would be relocated from the current location on Pennsylvania Street. The exhibition would then move to the Metropolitan Museum of Art. The Metropolitan has not yet announced whether the new exhibition would be a retrospective of the artist’s work or a collection of works by other notable art-world figures in the early 1900s. “The Met has been working toward a new building for thirteen years with the goal of creating a new, sustainable exhibition space on the National Gallery’s National", "The next Biennial should include a discussion of digital culture and how it intersects with the biennial as well as with the cities and many other places worldwide. The exhibition will be held at the Museum of Contemporary Art (MoCA), New York, and will run from September 5 to September 9. The exhibition will present work by twenty-four artists and will feature works by lesser-known and more established artists. The first show will feature works by Jean-Michel Basquiat, Francis Bacon, Robert Irwin, David Salle, and Walter De Maria, with an additional introduction by John Updike. The exhibition’s opening will coincide with the theme “Communities and their Embedded Digital Life.”The exhibition will be accompanied by a series of exhibitions dedicated to the history of artificial intelligence (AI) and machine learning (ML) and will take place in various spatial and temporal configurations, including in museum settings, on museum platforms, and in public spaces. Each will present a different aspect of life outside of the biennial.The exhibition will be curated by artist-in-residence Yoko Ott, a former director of MoCA who has served in various capacities at the museum for the past twenty-five years,", "The next Biennial should be held in the spring of 2021. “We are confident that the upcoming exhibition, ‘Art in Action’ will be an exciting and timely continuation of the work of the earlier Biennials,” said cofounder and director Adriana Roesler. The Biennial of Modern Art will be held at the Museum of Modern Art, in New York; the Museum of Modern Art Miami Beach; and the Museum of Contemporary Art, in New York.\n\n\nThe Edmonton Art Gallery (EA) has received a gift of thirty-nine works by Toronto-based artist Daniel Lenihan—including works on paper, photography, and video, and a selection of photographs that he created before he went blind in the 1980s. The work, called “The Most Beautiful Moment in Life,” was given to the institution in honor of its fifteenth-century Canadian founder, Alexander Lenihan, who passed away in 2017.Born in Toronto in 1939, Lenihan studied at the University of Calgary and received a Ph.D. from the University of Toronto, in 1948. In 1951, he received a commission from the Jewish Museum to create a painting of a Jewish prayer rug. The work, titled �", "The next Biennial should take place in 2021 and the 2019 will be pruned in 2020.”Merchandising by Wang, the Le Corbusier-trained artist, was awarded a $37 million prize at the inaugural conference in August. The winning exhibition is currently on view at the Biennial de l'Art et de l'Histoire (Art and History) in New York.\n\n\nThe Contemporary African Art Museum (CAAM) in Miami Beach, Florida, announced today that it has received a gift of eighteen works from the artist Maya Lin, who passed away at the age of ninety-eight in Los Angeles on April 5. The museum is currently working to determine the exact condition of the works and will present the first exhibition dedicated to the artist in its fourteenth-century, medieval, and Renaissance galleries in December.“In recent years, CAAM has continued to present an exhibition of work by Maya Lin in her original context,” said museum director John Rosendahl. “By bringing these works to CAAM, we are able to present them in their original form. By bringing these works to CAAM, we are able to present Maya Lin’s artistic, political, social, and intellectual legacy in a way", "The next Biennial should be held in September 2019. The theme for the event will be “Realpolitik in Action” and will be decided by the Biennial’s team.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has appointed Erik Solheim, the president of the D.C.-based Cultural Policy Research Institute (CPRI), as its next director. He succeeds John Delahanty, who left the agency in April 2019 to become the mayor of Philadelphia, and will begin in his new post on August 5.“Erik’s proven track record and record of success in championing important policy initiatives in cities across the nation highlights his ability to bring cultural and economic diversity and a vibrant, creative, and innovative spirit to the city’s capital region,” said D.C. mayor Muriel Bowser. “His leadership and vision for the D.C.-based Creative Capital grant program will allow us to continue to thrive as a city and region, as we continue to attract and support the world’s most creative and innovative companies, and to keep the District’s arts and cultural sector and economy vibrant and free from outside interference and interference.”Solheim previously served", "The next Biennial should be held in 2020. Cultural Historians awarded the $50,000 prize in recognition of their achievement in their respective categories. Ten other finalists were selected by the jury for their recognition of the Oshoi’s work in the exhibition “Isho: Complete Works.”“Isho: Complete Works” was established by the American and European director Rudolf and the American artist Adrienne Anselm. The exhibition was curated by Hao Fang and Jiang Fan. The next edition of the Art Biennial will be held in 2021. The 2019 awardees include Brigid Christie, Joan Mitchell, Tarch Imai, Susanne Bader, Joslyn Bader, and Arnold Bianchi. The ten finalists for the 2020 prize are João Barbosa, Timur Bocchino, Marcelo Bruguera, Sara Bartoli, Rebeccah Borthwick, Daniel Borthwick, Andrea Bruguera, Lucio Benitez, Andrea Bruguera’s Son", "The next Biennial should be held in 2021.\n\n\nThe German painter and architect Hannes Haberl, whose landmark combination of traditional geometric forms and abstract forms of light and color created the abstract ideas of the Konrad Kisch and the Konrad Fischer-I. After suffering a debilitating stroke in 1982, Haberl began to work on a more robust, flexible form of reality. In his final years in the university, he expanded his work to include an assemblage, a process for producing materials that can be arranged in different ways, as well as a series of mosaics in a way that remains nearly linear to this day. His encyclopedic output includes over 300 paintings, sculptures, and drawings; an unfinished, unfinished model of a city; a series of lithographs depicting the inner lives of animals, plants, and other living things; an unfinished, unfinished model of a building; and numerous paintings that remain unsigned, unpublished, and in storage.“This is a monumental job, for Hanse Haberl and for the rest of us,” said Karl-Heinz Krämer, chairman of the Kunsthalle Basel. The first exhibition dedicated to the artist was “Hanse Haber", "The next Biennial should take place in 2020.  The next would be 2023, but if the timelines are anything like the ones outlined above, it would be 2026, with the 2020 event being held at the newly renovated Museum of Modern Art. The 2019 and 2020 editions, respectively, of the exhibition were held at the Jefferson Theater, where they were presented by the Los Angeles County Museum of Art. The 2020 event will be on view in the redesigned museum from February 14 to February 19, 2020.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, and the Getty Museum in Los Angeles have announced their intentions to merge. The news was first reported by the New York Times. The news follows an announcement by Artnet, Artnews, and the Los Angeles Magazine on January 19 that the two institutions would form a new entity that will focus on “intersection of art and technology,” and will be charged with advancing the Getty’s mission through the acquisition and presentation of work by artists and/or through the development of its online platform, Artforum. The announcement follows a decade of acquisitions and presentations of work by artists that has seen the Museum of Contemporary Art (MoCA) acquire", "The next Biennial should be held in 2020.The Biennial will be hosted by the Pinacoteca de São Paulo (Pebulsão) and the Fondazione Prada (formerly known as the Prada Color Institute, Prada University, and the studio of Silvio Berodici). The institution will also collaborate with the Museu de Arte de São Paulo (Arte de São Paulo) to create an exhibition based on the projects of María Berrulles, José Pires, and Guámar Vergara.The inaugural exhibition was curated by Norberto Pedro-Iglesias. In a statement, the Pritzker Prize–winning architect said: “Featuring the work of contemporary artists, including the work of young and established, the exhibition will introduce the art of modernism to the people of São Paulo. . . . I am thrilled that the plan for the exhibition will allow us to invite the best of today and tomorrow.” The Pritzker Prize–winning architect will also be responsible for the next incarnation of the “Pritzker Architecture” exhibition, which will be held at the National Museum of Modern Art in Oslo in 2020. The event", "The next Biennial should be set in 2020, to take place in the city. \n\n\nThe Institute of Contemporary Arts (ICA), New York, announced today that it has appointed Merry Pfeifer as its next president. Pfeifer comes to the ICA from the Metropolitan Museum of Art, where she has served as the executive and artistic director of two decades. “Merry has spent the last decade organizing, leading, and protecting the Institute,” said Kate Packer, the board chair and president of the ICA. “We are very excited to welcome her to the board and to the ICA family. We are confident she will continue to support the ICA’s mission to create new and engaging works by and about contemporary art and artists.” Pfeifer’s appointment comes at a crucial time for the ICA, which is currently undergoing a $1.2 million expansion and now has a permanent collection of more than three hundred works. The museum is seeking new leadership following the departure of chair and CEO Ruth Ann Miller, who was replaced by Steven Feinberg, the former CEO of the private equity firm Apollo Global Management, in March. “The ICA is a leader in", "The next Biennial should be held at the Josef Althaus Sittler-Palmater, Zurich, which is currently closed due to the Covid-19 pandemic. The museum will extend the period during which the public can visit its collections by thirty days, from February 22 to March 19, 2020. The museum will also extend the period during which visitors can enter its galleries by twenty-four hours, from February 16 to March 20, 2020. To help promote social distancing, the museum will open to the public in the afternoon on Wednesday, February 12, and close three days early, from February 14 to March 16. “We are gradually reducing our activities and activities on a daily basis, which is a good thing,” Biennale director Joachim Neugroschel told the New York Times. “We have more time for social distancing now than we did a few weeks ago. We will be able to meet the needs of today’s society in the near future, with the same care and attention that we’ve been doing professionally for the past fifty years.” Commenting on the changes, Artforum editor-in-chief Daniel H. Weissman wrote:", "The next Biennial should be at least two years after the design, which will take place in the city’s new, fifty-six-story Museum of the European Diaspora (MD, DAS), with a view of the city’s Tenement Museum. If selected, the exhibit would be a reimagined version of the exhibition “Rebirth of the European Diaspora: twentieth and twenty-first centuries” that would explore the history of the European Union and its citizens and be organized by artist-in-residence, Satora, and curator Bethany Adler, with a view to a 20th-century follow-up.\n\n\nThe Museum of Arts and Design (MAD) in New York has appointed Antony Hudek as its next director. He succeeds David Moritz, who has led the institution for nearly twenty years, and will take up his new post in January 2022.“Antony is a brilliant and talented leader whose leadership, vision, and energy has made MAD a model for how an arts curator should work,” said David Adjay, MAD’s current director. “David has led MAD to a remarkable and unprecedented level of success in his twenty-six", "The next Biennial should be held in 2020, when the construction of the city’s first museum of modern art is scheduled to begin. The exhibition will be dedicated to “Art and Design,” “Suspension of the Limits: Art and the Limits of Time” and “The Limits of the Imagination: Art and Memory.” The 2019 edition was held at the tiny Anais Biennale, in the Veneto region of Italy, and attracted just over 3,000 visitors. \n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Stephen DeBerard, a graduate of Columbia University, as its next director of photography. DeBerard comes to MoMA from the Museum of Modern Art in New York, where he has served as an assistant curator since 2001. His curatorial projects for MoMA include “The American Journey: From the Art of the American West,” which was included in the 2019 Whitney Biennial; “Fred Wilson: Between Art and Life” (2016); and “Jirka Tristyn: No More Dreaming” (2016). “Stephen has demonstrated a commitment to creatively engaging with contemporary and contemporary art for", "The next Biennial should be held in 2022. \n\n\nBirgit Joos, the German artist known for her monumental multi-million-selling paintings, and these works were stolen by three youths on Saturday, March 21. According to the Art Newspaper, the three suspects fled the scene in a vehicle that had been driving in a suspicious manner.The theft occurred at the gallery where the artist has exhibited her work since she was only thirty-nine years old. The museum in the capital of West Germany, Leipzig, also houses Hans Ulrich Obrist’s exhibition “Eines klektische Kunst” (2011–12), which opened in late 2012, and Sinthujan Gupta’s “Eine Kloster und die Künstler” (2016).Both works were on display in the exhibition “Eichstädtische Kunst” (2018).In the painting, which is a reconstruction of the biblical story of creation, Joos sits in a glass-walled room and is surrounded by geometric geometric shapes, usually triangles, making up the network of the Garden of Eden. In the Künstler, she creates scenes of flowers, birds, and other", "The next Biennial should be held in the summer of 2021. The concept of a silent biennial has been around since the 1960s, when linguist and activist Uwe Wieder coined the term. Wieder believed that the art of “sitting quietly, observing silently” was a necessary antidote to the rise of totalitarianism. “Today, we are witnessing the artistic and cultural experimentations of a new kind, a new kind of democracy,” said Wieder. “The artists and composers of tomorrow will not only be able to express and interpret their ideas openly, but will also be able to live and work in an open and unfiltered manner.”\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines on how to safely store artworks and objects in public spaces following the 2016 terrorist attack that claimed nineteen lives at the Boston Marathon and injured hundreds more.The guidelines, which were sent to members of the public by the department on Tuesday, April 19, outline the five stages of storage: storage in a secure, identified location, storage in a vehicle, storage in a public area, and storage in a storage facility.“We understand that individuals may be concerned", "The next Biennial should be held in 2021.\n\n\nThe museum’s artists’ studios have been transformed into a public gathering space with eight new galleries, each spanning twenty-five stories, opening in the former Armory Building on the museum’s seventh-floor gallery. The eight projects, which will create a multiplicity of exhibition spaces, house work by artists such as Yinka Shonibare, Zaha Hadid, Edward Hopper, and Catherine Niemeyer, as well as an original public space, the Art Institute, which is still being constructed.The pop-up art museums, known as 'green platforms', are part of the new initiatives carried out by the institution to address the health, environmental, and economic concerns of its northern neighbors, the Michigan Institute of Arts, which is in the process of redesigning its campus in an attempt to reduce CO2 emissions. The green platforms will also host exhibitions, educational programming, and other events in conjunction with the museum’s annual “Living with the Bomb” exhibition, which is an exhibition of the first-person accounts of everyday life in the aftermath of the terrorist attack on New York on September 11, 2001, which took place in the museum’s", "The next Biennial should take place at St. Paul, Minnesota, in 2021. In a letter addressed to the museum’s director, Terry L. Grafton, he wrote: “Since 1988, we have presented the work of E.L. James on our campus. Our passion for the artist has always been uncompromising, and our desire to continue to present her work was uncritical. We have never, since her passing, suggested that she should stop. . . . We have never sought to influence or manipulate her, never asked for or asked her to compromise her vision. In fact, we have been proud to present her work on our campus, to watch her live and perform the work, and to witness the personal growth of her art.” \n\n\nThe National Gallery of Canada announced today that it plans to introduce a new curatorial role that will be modeled on the National Geographic Society’s. The institution, which is in the midst of a $1 billion expansion, will invite five curators to create a new exhibition every year. The next edition of the National Geographic Biennial will focus on the history of glaciers and ice sheets.“The biennial will be a celebration of the world’s", "The next Biennial should take place in February 2019. The third and final editions of the exhibition will be held in March 2019 and February 2020. The 2018 and 2019 editions, titled “12 Questions,” were organized by the curator and curator of contemporary art, Walter de Maria, and the artist Cécile Renaud. The 2019 exhibition, “12/19/18,” featured works by twenty-three artists, including Tala Naghavi, Rachida Naidu, and Sajad Jumah, and was curated by Faisal Al Qasimi. On April 4, the Lebanese artist Salah el-Khatib, who was convicted of blasphemy and sentenced to death for a painting that depicted the Prophet Mohammed in a critically acclaimed display organized by the Beirut Museum of Art in 1971, won the right to be buried in a civil cemetery in the city of Baalbek. Human rights activists were outraged as the perpetrator, Abdel-Malek al-Qasimi, was given a suspended death sentence. The twenty-four-year-old was set to be executed by the Shiite government of Prime Minister Saad al-Hariri, but was freed in 2015 after Hariri was deposed", "The next Biennial should take place at the Imperial War Museum in London, the Robert Smith Gallery in London, and the National Portrait Gallery in London, and will be held at a location to be determined. The project titled “Polarities” was created by Damien Hirst and consists of twelve portraits by the artist at a time. The work is produced on paper and is surrounded by a hologram of a polaroid image of the artist. The artist is dressed as Batman, a reference to the film The Dark Knight, and stands in front of a black and white Polaroid, which projects images of his face, a replica of the iconic Polaroid camera.The exhibition is curated by Antonia Brancusi, the curator of contemporary art at the National Museum of Italian Art in Rome, and is slated to run until March 15, 2020. Previous editions of “Polarities” include “The Last of the Pueblos” (2006), for which the artist and the iconic El Pueblo of Guadalajara, Mexico, staged a massive protest in front of the town of Palacio de las Culturas, in the state of Sinaloa, and “The Painted Lady,�", "The next Biennial should aim to make the exhibition more inclusive. It also said that it is currently reviewing the exhibition schedule for the 2020 edition to determine the best way forward.\n\n\nThe National Galleries of Scotland (NGM) in Edinburgh has received a £14 million donation from the Andrew W. Mellon Foundation. Named after Henry Mellon, the billionaire founder of the investment bank Morgan Stanley, which has supported the arts in Scotland since the 1980s, the grant will enable the National Galleries to open their new home in a year. The gift was made in support of the National Curatorial Research Unit (NCU), a collaboration between the foundation and the University of the Arts to advance the work of emerging and established British artists.“This is an incredible gift for the National Galleries of Scotland,” said Mary Moffat, director of the Andrew W. Mellon Foundation. “NGM has long been linked to art through its collection and through its collection of works by artists not previously represented at the institution. Through this work, NGM is reopening up the National Galleries of Scotland. We are excited to work with the NGM team and the National Curatorial Service to make this a reality, and to share the wealth of art that surrounds us", "The next Biennial should be held in 2020. \n\n\nThe Museum of Arts and Design (MAD) in New York has appointed Jhasa J. Patel as its next director. She succeeds Daniel Hauser, who has served at MAD since February 2019 and will take up the post in January 2021.“Following a distinguished career spanning more than twenty-five years at MAD, Jhasa has developed into an exemplary leader and exemplifies the M&D team’s vision of a dynamic, interdisciplinary contemporary contemporary museum,” said Michael W. Guggenheim, MAD’s board chair. “Jhasa’s proven track record leading cutting-edge exhibitions and projects, coupled with her passion for curating, has led us to believe she is the right person to lead the museum into the future.”Hauser departed MAD in December 2019, less than two months after the institution’s reopening in January 2021 following its $300 million expansion. The $150 million expansion added a new floor plan, added a theater, a rooftop bar, and a rooftop garden. The hall was reorganized as an open space for public events and public programs.The reopening of the institution, which relocated from", "The next Biennial should take place in 2020.   In an email to the arts writers, the organizers wrote: “We are actively collaborating with our partners at the Metropolitan Museum of Art and the Brooklyn Museum to develop this year’s exhibition, the next Biennial, as we have for twenty years. It is a challenge that we ’ve fully embraced, continuously trying to improve our exhibition format and our exhibition design. . . . Our art travels with us, and it is with us that we will find our meaning.” \n\n\nThe Baltimore Museum of Art (BMA) announced today that it is reopening to the public in September. The institution’s staff and visitors will welcome back seventy-one artists, including Elle Macpherson-Haims (2018), Kamila Larsen (2018), and Kelly Collins (2017), among many others, and will unveil the first major design overhauls since the museum’s closure. The overhauls will be made practical, utilizing materials that cannot be found in most museum collections.“BMA’s design team has worked tirelessly since the museum closed to make the BMA’s iconic building, the National Museum of American", "The next Biennial should be held in 2020. The committee will consist of : Gert Steegmann, director and CEO of the Biennale Council, and Conradin Bailho, director of the Bootle Collection, and Sandra Corrigan, a curator of contemporary art. The exhibition will be held at the Gallery of Modern Art, New York, and will open in the fall of 2020. In addition to the exhibition of new works by artists such as Maria Cipollini and Patricia Benic, the show will include a residency program in the art of bioengineering. The program will focus on the design of life-support systems for hospitals, which will be powered by wind and solar power.The 2019 winner is Andrea Katsarides, who will take up the award in September. The 2020 winner will be announced in November. The 2019 Biennale Council will be chaired by Gert Steegmann; Conradin Bailho; and Sandra Corrigan. The twelve shortlisted artists are Catherine Gallant, Carol Corrigan, Gena Marden, Dick Gregory, Jorge Luis Borges, Tereza Karam,", "The next Biennial should be held in 2021, but the dates have yet to be determined.\n\n\nCindy Sherman, the founder of the personal art business Beverly Hills–based gallery and label Melpomene Gallery, has announced that she is moving her exhibition space downtown from the United States to China. Sherman, whose practice focuses mainly on contemporary art, gave the art-world equivalent of a two-month head start in the race to open her flagship museum in the city.“I’ve been to China twice, in 2020 and 2020, and have been impressed by what I see in Shanghai,” Sherman said in a statement. “I want Beverly Hills to be a very strong place for contemporary art.”Her decision to shift her exhibition space, located in a former dairy barn on the ground floor of the Beverly Hilton Hotel, follows that of other major US arts institutions such as the Museum of Modern Art in New York and the Whitney Museum of American Art in New York.While Beverly Hills’s renowned art scene has been largely unaffected by the Covid-19 pandemic—the county recently saw a resurgence in activity in late March, with some twenty galleries and galleries exhibiting work in the first three days of March—its", "The next Biennial should be held at the V&A, London, in 2022; and, if all goes to plan, the museum should have a permanent exhibition of the artist’s work in 2020. The Biennials For All series, which aims to “save life and change the world by bringing both art and science together,” has received $2.5 million from the Privy Council, and will stage a retrospective of the work of the late British artist Anne-Marie Elliott in January 2020.Commenting on the prize, Dr. Melissa Davids, head of the Privy Council, said: “The Prize recognises the extent to which the biennial was a bold and transformative gesture for many artists and artists’ work is being recognized as a major influence on the future work of many. For the Biennials For All series, we have selected fourteen artists, including Alan Johnson, Richard Linklater, Jennifer Weiner, and Susanna Wilke, and their works will be exhibited at the V&A in the spring of 2021, as part of the award for the most important contribution to British art and the biennial’s legacy.”\n\n\nThe Museum of Arts and Design (", "The next Biennial should be held in 2022, with the new medium of the exhibition being contemporary art, the former Soviet Union, and the former Soviet state of Chechnya. The exhibition will be inaugurated by a special exhibition of works by artists such as Sasha Bilyshko, Masha Gessen, and Sergei Kavala, among others from the former Soviet republic, and will launch in conjunction with the upcoming exhibition “Art and the Struggle for Freedom.”\n\n\nThe Museum of Contemporary Art (MoCA), Chicago, has appointed Greg LaBantu, who currently serves as director of the Art Institute of Chicago, as interim director. Brought on to the museum in July 2019, LaBantu has served as interim director of the museum since April.  “In regards to the recent announcement that Greg will be returning to lead the museum, we are thrilled to see the CNA’s leadership team move forward with plans to celebrate his one-year anniversary and to welcome him back to the board of directors,” said Laura Fisk, director of the CNA. “We have been working with Greg for more than a decade in a wide range of projects, and we are grateful for his work in", "The next Biennial should be held at the National Gallery of Art in Washington, DC, in 2022. The twenty-third edition of the show will be held in the New Museum in New York in 2020. The twenty-fifth edition will be held at the Art Institute of Chicago in 2021. The twenty-seventh will be staged at the Art Institute of Chicago in 2020. “The risk of a pandemic is real,” said Donald Suss, director and CEO of the National Gallery of Art. “We must protect as many of our facilities, our employees, and our collections as possible, while we fully understand the impact that a continued shutdown will have on our visitors, our artists, and our staff. We look forward to working with our talented and dedicated team, and to welcoming you back to the gallery and the museum.”\n\n\nThe National Gallery of Art in Washington, DC, has hired Patricia Alexander Noyes to be the next director of the institution, which has a permanent collection of more than 1,600 works and is a major draw for visitors from across the country. Noyes succeeds Nancy Scott, who has led the National Gallery of Art since 2006, and will take the helm from Scott, who", "The next Biennial should be hosted by the Museum of Modern Art in New York in 2021. The first installment, “Latinx/a” (2010), drew twenty-two artists, including Kiki Smith, Alice Ayala, and Angel Barrué; the Biennial 2\u0097Latinx United States (2011–12), featuring thirty-five artists, was held in 2013.\n\n\nThe Antique & Modern Art Museum Birmingham (AMB) has received a £1.1 million grant from the National Loteries Museum in Kent, UK, to help secure the future of its collection. The philanthropists behind the grant, Robert and Helen Tanner, said that AMB is “working hard to be a museum of the past, but one that will continue to draw visitors and support local communities.”For the past thirteen years, AMB has been working with the National Loteries Museum (NLL) in London, where it has been working with specialist curators to create a new exhibition series dedicated to the collection of Katherina Maffi’s works. The program was first launched in 2005, when Maffi was working at the Institute of Contemporary Art, London, and began in 2009.�", "The next Biennial should take place in the quiet of the gardens, in the next spring, the next autumn, and the next winter. What a difference twenty-five years makes.” The theme of the twenty-fifth Biennial, “The Love of Life,” will be a short film by the Italian artist and activist Camille Balla, who is often remembered for her work The Love of Life (1940).Balla, who was born in Naples, was inspired to make the film after witnessing a live electrical installation by the artist, who was imprisoned for the murder of a woman in the early stages of the AIDS epidemic. In the film, the love interest appears as a woman with a red, red, red dress. The film is titled The Love of Life and its title translates as “The Life.” Balla has said the film is not about the love life, but about the “love life itself.”The architect and educator Daniel Garbut, director of the New York–based firm Garbut Projects and the City University of New York, said: “It is a question of how to do this in a way that is both beautiful and sensitive. In the five years that", "The next Biennial should continue to employ and update the themes and programs of the past and will continue to provide a forum for the works of the artists whose works are currently on display at the museum. \n\n\nThe Institute of Contemporary Arts (ICA) in London has created two new roles for artists: curator and cofounder. The institute will make the appointment in the coming weeks, following an announcement of the results of a yearlong survey of artistic practices which began in October 2019.The survey, called the Arts and Cultures of London (BACL), was organized by the BACL Artists and Writers Union. The five hundred or so artists and writers nominated their works for inclusion in the inaugural exhibition, “The Arts and Cultures of London 2020,” which ran from March 14 to March 21, 2020. Among the artists who were shortlisted for the 2019/20 BACL are Ulrich Heiders, Josina Johnson, and Joel Sze, and the works selected for the 2020 event were Apocalypse Now, Amarinder Pal (Timbuktu), Christo, Cinnamanwadi (Papua New Guinea), Darshan Sarkar (Ludwigshaf), Ben Gold", "The next Biennial should take place in 2021. \nThe next edition of the Biennale will be held at the Gebimäki Design Museum in Helsinki in 2021 and will be dedicated to the theme “Made in Italy,” in 2022, the Exhibitions Register announced on Monday.  The 2019 event was also reshuffled to take place in the capital of the Finnish state, Helsinki, in 2021.The 2020 event will be held at Helsinki’s Old Helsinki, the museum’s current home, which will be expanded to house the exhibition, and will be hosted by architecture historian Monika Baser and curator of contemporary art Nino Kreus, with participation from the other participating artists, including Anselm Kiefer, Jochen Schrager, Nara Strenz, and Jussi Tappan.Mapping out the 2020 exhibition will require the artists to collaborate with the city of Helsinki and the Carl Espenakonen Museum to bring the event to life. The Kukkumalmi, a former railway station, will be transformed into the exhibition venue, the Kukkumalmi Museum, and the Helsinki Art Museum. The Parnmäki Art Museum will host", "The next Biennial should, in the opinion of the organizers, be held in 2020. The deadline for the exhibition was originally set for March 19–March 21. While the event has been moved to June 1–June 3, the dates have yet to be decided. After the exhibition, which will be held in the Grand Ballroom of the Trump International Hotel in Miami Beach, will mark the tenth anniversary of the museum, the biennial will invite the public to visit the museum and will present a collection of works from Bisara’s recent residency in the United Kingdom.\n“By organizing an exhibition in such a way that it is able to host thirty-six artists in the same space, we hope to develop the exhibition’s unique and complex visual and textual relationship with the institution, and to have a tremendous impact on its subsequent development,” said Huma Fatemi, the director of the National Museum of Modern Art and the Museum of Arts. “The exhibition is the culmination of a twenty-year campaign of work, which began with the opening of Bisara’s first solo exhibition at the New Museum in New York in 1986. I have had the opportunity, in the course of my career as a curator", "The next Biennial should be held somewhere in the Stockholm region in 2022. Source: Södertälje by Rolf Nilsen (2016)  (reissue) by Rolf Nilsen (2016) (reissue) by Rolf Nilsen (2016) by Rolf Nilsen (2016) by Rolf Nilsen (2016) by Rolf Nilsen (2016) by Rolf Nilsen (2016) by Rolf Nilsen (2016) by Rolf Nilsen (2016) by Rolf Nilsen (2016) by Rolf Nilsen (2016) by Rolf Nilsen (2016) by Rolf Nilsen (2016) by Rolf Nilsen (2016) by Rolf Nilsen (2016) by Rolf Nilsen (2016) by Rolf Nilsen (2016) by Rolf Nilsen (2016) by Rolf Nilsen (2016)  by Rolf Nilsen (2016) by Rolf Nilsen (2016) by Rolf Nilsen (2016", "The next Biennial should focus on the history of the exhibition, the exhibition space, and the collection, and should utilize new artistic and conceptual techniques to present the exhibition for the first time. The exhibition will be curated by Hiromi Iwasaki, of Tokyo Institute of Art and the artist’s studio, and will be organized as 3 separate experiences that will take place simultaneously in two locations in Tokyo: the museum and the artist’s studio. The first, “Hiromaru Nara,” will be on October 18 to coincide with the festival, and the second, “Kanada Kamina,” will be on October 21 to coincide with the festival.The Biennial will include works by some twenty artists, including Nara Shino, Arnold Lauterbach, Oma Helen, from the Nara Museum of Art, Japan; Peter Mein, from the Studio Museum in Ghent; and Kazuya Takeda, from the Hirshhorn Museum, Washington, DC.\n\n\nThe Metropolitan Museum of Art (MoA) in New York has appointed Melanie Brown as its next director. Brown comes to the museum from the Uff", "The next Biennial should be called the 'Toward a New Science of Life” and will open in September 2019.The prize jury for the inaugural exhibition included:Daniela Catellani, curator, Flaminia Milano, curator, Luca Fila, and Manuela Cipolletta, director of Palazzo delle Papesse (CNN).The search committee comprised of Graziella Ballester, Sara Catellani, and Manuela Cipolletta.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York announced today that it is planning to open a new metropolitan museum, the Museum of Modern Art, on the Lower East Side. The new institution will aim to provide the public with a new and improved world-class museum experience. The museum’s director, David Samson, said that the new museum will be “designed by a team of world-class architects from outside of New York, to be located within walking distance of many of the city’s most important cultural institutions, and to be accessible by public transportation.” Its design will incorporate large galleries, large meeting spaces, and a visitor center. It will also have", "The next Biennial should mark the centenary of the Socialists and Communists in Russia, and should aim to draw attention to the country’s revisionist history, the contemporary artistic landscape, and the pressure on young people in the country to live up to their ideals. According to Artnews, the announcement was made on the eve of the May 25 inauguration of the new Russian cultural center, the State Theater, which will be inaugurated by the new director, Alexander Rublev. Rublev will take up the post on April 22.The biennial, titled Theatre of Modern Life: From the Twentieth Century to the Twenty-First Century,   is being organized as part of the initiative “Amerika: We Meet Again.” The project aims to present both a retrospective of the work of a select group of artists, and a new survey of twentieth-century Russian art. Rublev said that the new biennial, which will share the same venue as the institution originally conceived, will be “a common space for the artistic exchange of ideas, a forum for reflection on life and art,” where the themes of art and philosophy can be explored together. The authors of the description of the bi", "The next Biennial should take place in Helsinki in 2021, in cooperation with the Helsinki City Council. The theme of the event will be “Religions, politics, and spatial politics.” The architects hope it will be a point of departure for future exhibitions.\n\n\nThe World Health Organization (WHO) has warned that the global outbreak of the new novel coronavirus, coronavirus-like illness, may last for weeks or months. It has now called for all countries to strengthen their public health measures and is urging people to avoid the areas where the virus is circulating and to prepare for an outbreak. Health officials are also urging people not to travel to and from China, where the first cases have been reported in the United States, and are urging people to restructure their travel plans to maximize sanitary practices. “We are rapidly approaching an unprecedented global crisis,” said WHO director-general, Margaret Chan.  Chan said that the virus is similar to the one currently circulating in China and is following a similar path to the coronavirus, which is similar to the coronavirus, which killed hundreds of people in China in 2011. She added that China has a long way to go before the global health crisis is over", "The next Biennial should take place in the city in 2020. The twenty-first will be held in the city in 2025. It is unclear when the museum will reopen to the public.\n\n\nJust days after President Donald Trump announced that he plans to temporarily suspend immigration from six Muslim-majority countries—Iran, Libya, Somalia, Sudan, Syria, and Yemen—an urgent letter from 125,000 cultural professionals, trade associations, and labor unions urging him to do the opposite is now circulating.The Public Artists’ Association (PA), which represents artists, writers, and musicians, and represents the unions representing school teachers, announced that it received the letter from the International Association of Book Artists (IBA), which represents visual artists, and demanded that the president reverse course and allow schools, colleges, and universities in the United States to reopen.“We write to respectfully request that the President carefully consider the impact temporarily suspending immigration from countries where there is a proven and present risk of violent extremism will have on American workers, students, and visitors to the United States, and act in concert with artists, students, and arts professionals to ensure the long-term security and well-being of the United States,” reads the letter, which is addressed to Trump,", "The next Biennial should take place in the summer of 2021, and will take place at the FEMS (French Ministry of Culture) in Paris, the Paris Center, and the Louvre. The fifteenth edition, which will include commentary by Dario Franceschini, will be held at the Louvre in March 2022. Though the theme of the year is “compassion and empathy,” the show will also feature artworks that explore themes of forgiveness and redemption. The biennial’s entry in the 2019 edition was awarded to Works of Real Life, which in turn received a retrospective at the Museum of Modern Art. The biennial will be hosted by the Louvre until November 22. A running commentary by Franceschini will also be included in the show.The show will include two new works by artist Pia Camil, as well as works by artists such as Thomas J. Mering, Sylvia Minnelli, and Alexandria LaBouvier. The biennial will also feature new works by women artists, including Sophia Massimi, Nicole St-Louis, and Tanya Bonakdar.\n\n\nNew York–based artist Michael Rezendes has been appointed", "The next Biennial should be held at the Museo de Arte Contemporáneo, the Art Museum of La Chica, the Museo de Arte de Barcelona, the Palacio de Arte, the Museum de la Repúbrica in Santiago, and the Museum of Contemporary Art in Prague.  These four institutions will host the 2019 edition of the exhibition, titled Artforum: The Future is Present, which will be hosted at the Palazzo Sotto and the Museo de Arte del Prado. The 2019 edition of the exhibition will be held at the Museo de Arte del Prado from January 9 to January 13, 2020.\n\n\nThe Museum of Contemporary Art (MoCA), the Queens Museum, and the Seattle Art Museum have received a $10 million donation from the Philip Johnson Foundation, which was established to advance the arts and create stronger, more inclusive, and more inclusive communities. The gift comes amid the ongoing crisis caused by Covid-19, which has affected a number of institutions across the United States, including the Seattle Art Museum, the Seattle Chinese Art Museum, and the Seattle Chinese Film Festival.The foundation also announced that it received a $5 million gift from the D. Mark G", "The next Biennial should take place in 2021.__________\n\nThe Richard and Lucille Laing Foundation in New York has named the twenty-second year a’s winner of its Promethean Arts Awards, which are given annually to a poet or curator who has made significant contributions to their field. The seventy-five-year-old author and activist, who has championed psychedelic art and the arts for more than forty years, was selected for his novel The Black Flower, which she described as “an exploration of the mystery of the human condition,” and his work L.A. Confidential, which she said is “about the nature of the soul.”The foundation, established by the brothers David and Lucille Laing in 1979, also announced its ten-year grant award. It is named for the three artists who died in 2015 when a plane crashed into the Astrodome\u0097the former site of the Astrodome is currently being restored\u0097and is given to poetry, arts and culture, and nontraditional media.In the award, which was formed in 1989, the couple will be awarded $10,000. The first prize will be given to a poet, the second to a curator", "The next Biennial should take place in 2020.In the meantime, the museum will continue to host public exhibitions of works by artists in its collections, including the exhibition “Janeck and Picasso: The Art of Painting” (2019); “Son, Daughter, and Mother: Modern Art and the American Family” (2019); and “I, Kapu,” (2019). The first in the new series will be “The Lesser Sleep,” which will run from October 26 to November 21.\n\n\nNew York’s Metropolitan Museum of Art has suspended a fundraising event for the museum due to concerns over the coronavirus, which has infected more than 6,000 people and caused at least eleven deaths in the United States. The event, which was supposed to take place this weekend, was canceled due to concerns about the virus, which has caused an unprecedented spike in COVID-19 cases nationwide.According to the New York Times, the Metropolitan Museum of Art has canceled more than three hundred events and is working on drafting a statement outlining its response to the coronavirus. The museum is requiring its galleries to close to visitors and is restricting access to the museum to the Met’s grand opening", "The next Biennial should take place in 2022, at a date to be determined by the Ministry of Culture, and will be hosted at the same location. The museum will also continue to host exhibitions, performances, and other events at its current facility, which is located near the University of Gothenburg in Sweden.\n\n\nThe Museum of Modern Art (MoMA) in New York has announced its representation of the Lebanese artist Yahya Al-Qasimi, whose colorful and deeply personal sculptures\u0097combining cardboard, paper, and fiber-based materials\u0097explode into dizzyingly multilayered landscapes and landscapes of various shapes and sizes. As the creator of the critically acclaimed “Past Occupation” series, which assembles disparate tools and materials to create works that fuse art and politics, Al-Qasimi tells Artnet that his work reflects his personal beliefs about the world. “The art itself is a reflection of my life,” he said of the series. “I have always tried to make my work reflect the emotions associated with the sites and the people. The regions of my drawing work are the regions of my body, and the people are the people.”Born in Beirut in 1949, Al", "The next Biennial should take place in the summer of 2021, when the exhibition will be relocated to a new venue in the city; the exhibition will not resume until at least the end of the 2021–2022 academic year.\n\n\nThe Hirshhorn Museum in Washington, DC, is planning to eliminate one of its main cultural drawers\u0097the biennial exhibition “The Body in Cinema”\u0097in favor of a new model that will be more collaborative and will focus on the exhibition of new works. The Hirshhorn has stated that it hopes to have the exhibition back on the ground by the end of the year.The Hirshhorn originally had the opportunity to move the work, titled “The Body in Cinema” (2019), from the museum into a new building in the city, but opted not to under the circumstances in order to focus on its collection. Its relationship with its parent organization and the institution would have continued with the reopening of the Hirshhorn, but the move was not considered feasible at this time. The Hirshhorn has already invested considerable time and effort into revamping the exhibition space in order to improve its exhibition experience. The new building will be built to the Hirshhorn’s specifications and", "The next Biennial should take place in the first half of 2020. If all goes to plan, the first exhibition devoted to the work of British artist Sir Peter Sellars will open in London on February 17. The sculpture-maker, who was known for his experiments in both fantasy and reality, created sculptures that included a mannequin dressed as a medieval knight, a horn-toting ant-like creature, and a traveling circus performer. He often depicted images of disembodied voices and images of people in a group setting, often with a group of friends. Sellars was born in London in 1936. After studying in Paris at the University of São Paulo, he returned to the UK in 1948 to study at the University of Central Lancashire. In the same year, he met and fell in love with Irrfan, who became pregnant with his son, Simon, and moved to the picturesque village of Leelanau, near Toxteth, where their son, Peter Sellars, had grown up.In 1984, Sellars partnered with artist Rodney Ascher and created the first exhibition dedicated to the artist. He also staged exhibitions at the Savoy Cinema in London, the National Gallery of Scotland, the National Museum of Art", "The next Biennial should focus on exploring the history of colonial art in Africa. The event will also aim to include an exploration of the ways in which art and culture has been perpetuated through “objectification of black bodies.”\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is planning a three-day celebration of Black Lives Matter\u0097the activist movement that advocates for change from a militant Black perspective\u0097that is being organized by the museum. The event will take place on March 12 and March 14, 2020.The event, titled “Black Power: Reclaiming the American Dream,” will include an exhibition organized by MoCA and will be led by curator Mary Clare Herden.“The show will present Black Power: Reclaiming the American Dream, a new exhibition that aims to teach Black students about the history of Black art and to present Black artists in their most engaging, thought-provoking, and personal,” said Katy Hind, MoCA’s curator of the collection. “This exhibition brings together work by a wide range of artists from a diverse and historically-significant group of artists to celebrate Black cultural traditions and Black art in the United States", "The next Biennial should be held in May 2021. ARTforum has contacted Tate Britain for comment.  The artist-run museum is still assessing the logistics of hosting the event. \n\n\nThe Alma Mater Society, a nonprofit arts organization based in New York City, has launched the Alma Mater Scholarships. Under the new initiative, up to $5,000 in scholarships will be awarded to undergraduate students who identify as artists or have demonstrated exceptional artistic talent. Undergraduate scholarship recipients will receive $5,000 and will be able to apply to live exhibitions or residencies with a minimum of three months of residency experience. The deadline for applications is November 15.Applicants will be selected by an independent committee comprised of Valerie Lippard, a senior curator at the Museum of Modern Art; Angela Li, an associate professor of art at Columbia College, New York; and Ethan Loeb, a curator at the Brooklyn Museum. The deadline for applications is November 15. As part of its annual awards, Alma Mater will award up to $100,000 in scholarships annually to twenty-five artists. \n\n\nThe Museum of Modern Art (MoMA) in New York on Monday announced that it will begin accepting applications for its 2020", "The next Biennial should come out sometime this fall. The next Exhibition of Popular Art should take place sometime in the next two years. The next Event of Contemporary Art should be a continuation of this process.”\n\n\nThe Manhatten Art Museum (MAK) in India has appointed Shailja Thapa as its new deputy director. Thapa is currently a professor in the department of art and architecture at the university. She will be responsible for coordinating the museum’s exhibitions and education programs and developing partnerships with international and local partners.“Shailja’s recent curatorial projects include The Last Frontier: Mapping and Representation in Art (2019) and Styles of the Black (2017),” said MAK director Uma Bhalla. “This has been a very challenging and exciting time for MAK as we have experienced the construction of a new, larger building in the city of Manhatten and a major renovation of our campus. Shailja’s work has been transformative both for the institution and the city.”Thapa will assume her new post in January. Thapa comes to MAK from the Mysore Museum of Art, where she has worked since 2013", "The next Biennial should be held in 2020, with the prospect of a new exhibition in 2021. “We feel it is essential that we maintain the current spirit of exhibition at the Centre,” said director Bruno Bicchier. “This exhibition has been a central part of the Biennial for many decades, and we are very much looking forward to the opening of the new exhibition.”The institution will open a new building in the city's Beaux-Arts district, which is currently undergoing a $110 million expansion, on November 1, 2019. The new five-acre space will be located in the city’s Beaux-Arts district, the former site of the Beaux-Arts Museum and the Beaux-Arts Gallery. The move is part of a $110 million plan to improve the sustainability of the Centre and to create new opportunities for people to connect with art across the country. \n\n\nPeter Hujar, cofounder and CEO of the New York–based eponymous arts incubator space Launchpad, has announced the launch of a new online platform aimed at helping emerging artists and creatives across New York City and the country. The platform created by the New York–based artist-", "The next Biennial should be held in London in 2022, and in 2021 in the US. The first iteration of the show was held in the UK in 2013, and was notable for its exhibition of work by Bibi Brand, Paul Cézanne, and Jean-Michel Basquiat. The 2017 event moved to Los Angeles, and the 2018 event was staged in New York. The twenty-sixth edition of the exhibition will take place in Berlin in 2022. \n\n\nThe Museum of the City of New York has removed three large pieces of original artworks by the late Bronx-born artist LL Cool J. The pieces, which were part of the show “LL Cool J: The Art of Man,” were part of a series that explored the idea of urbanism through the work of the artist’s protégé, LL Cool J’s twin sister and partner in crime, Jorritto Rosales.LL Cool J’s work was also featured in a 2018 retrospective at the Whitney Museum of American Art, which was held in conjunction with the Whitney Biennial. In the show “LL Cool J: Art of Man” (2017–18), LL Cool J candid", "The next Biennial should be held at the Museo de Arte Contemporáneo Barcelona (MAS Barcelona), which will be inaugurated by an exhibition of twenty-two works by fifty-two artists.  Munich Biennale 2018: Munich International Contemporary Art Biennale 2018 Marc-Olivier Fischl, Art d'Art, Berlin, August 15–August 18.  Munich International Contemporary Art Biennale 2018: Munich International Contemporary Art Biennale 2018 Munich International Contemporary Art Biennale 2018: Munich International Contemporary Art Biennale 2018 Munich International Contemporary Art Biennale 2018: Munich International Contemporary Art Biennale 2018Munich International Contemporary Art Biennale 2018: Munich International Contemporary Art Biennale 2018: Munich International Contemporary Art Biennale 2019: Munich International Contemporary Art Biennale 2019Hagen Zeilberger, Stuttgart, February 15–March 8.  Hans-Ulrich Obrist, Leipzig, February 15–March 7. The artist-run bi", "The next Biennial should be held at the Museäbische Nationalstaltiftung Stuttgart (MUMST), in September 2019. The US$50,000 prize is the first grant to the Kunsthalle Basel in Switzerland since 1979.\n\n\nThe Museum of Fine Arts (MFA) in Denver has appointed Will Pfeifer as its next director. Pfeifer has served as director of the museum since 2015, following the completion of a ten-year term that saw the museum increase its exhibits, educate more people, and attract new audiences. He succeeds David Adjay, who retired in December 2020 after twenty-five years at the helm of the MFA.“Pfeifer’s record of achievement is unparalleled, and we are thrilled to welcome him to the MFA,” said director Marta C. Hernandez. “Pfeifer’s ability to leverage MFA’s unique collection and visionary exhibitions to cultivate a more compassionate, inclusive, and just world is unparalleled, and we are honored to welcome him to Denver.” Adjay, who founded the institution in 1994 and began as a curator in 1997, had led the MFA during its transformation from a West Point–trained academy", "The next Biennial should be in the spring of 2020, with an exhibition opening later this year. “The opening of the exhibition is the most important event in the career of the artist,” said Georges Bianchi, head of the Biennial. “At the same time, we are very much aware that the exhibition itself is a very important event in the artist’s life, and we hope that it will contribute to a stronger awareness, appreciation, and appreciation of his legacy.”The inaugural event was held in 2017, at the Museum of Modern Art in New York. The museum chose to build a new exhibition building in the grounds of the old building in order to support the project of the dismantling of the museum’s collection in order to begin the process of its reopening. The goal of the exhibition was to “lay the foundations for the artist’s future,” according to curator and chair of the Biennial Alexandre Aideau.\n\n\nIn the lead-up to the 2020 Venice Biennale, organizers of the international festival in Italy have been working to revamp the 2018 edition. The theme for this year’s edition was “Assemblages: Objects, Diss", "The next Biennial should be a platform for the work of the remaining twenty artists whose works will be presented in the exhibition. The selection committee commented: “In the next edition, we will not show only the work of the best, but also those that are within the reach of the public and who have not yet been exhibited. We hope that this time we will present a selection of works of interest to both collectors of the artist and the general public. The next edition will focus on the artist’s social, political and cultural legacy and will, at the same time, be a platform for his work to be studied and expanded upon.”\n\n\nThe Istanbul Art Museum (Istanbul) announced today that Adnan Sarsour, a New York–based artist and activist, has been selected to represent Egypt at the upcoming edition of Art Basel Istanbul. The twenty-five-year-old, Queens, New York–based artist was chosen to represent Egypt following an open call for nominations, which took place between October 21 and October 25.“We are thrilled to honor Adnan Sarsour and to be able to present his work at this unique Art Basel Istanbul event,” said Markus Bocheresi", "The next Biennial should take place in 2018, and the theme should be “The Future is Present.”\n\nThe English Heritage Trust, the charity, the charitable organization, and the arts organization that provides funding to some seventy museums across the United Kingdom, announced on Thursday that it is extending the lifetime of its board member, the British artist Amy Cahn, and her husband, the British designer Richard Mayhew. The institution plans to honor the model 100-year grant for artists by donating “a new special exhibition, or series of exhibitions, from the artist’s collection,” Artnet reports. In commemoration of the artist’s 100th birthday, the museum will hold a special exhibition at the museum on February 12.Details about the new series of exhibitions and how to donate are currently being worked out, but will be presented by the museum at a later date. The museum will present a new series of paintings by the artist in the summer of 2021.Commenting on the new partnership, Lord Browne, chair of the arts committee at the annual meeting of the Royal Academy of Arts in London, said: “Amy and Richard were a truly wonderful gift to the English Heritage Trust. As a board member, I", "The next Biennial should commence in December 2021.\n\n\nThe Portland Museum of Art (PMA) has added Sara Harris to its curatorial team. Harris is currently the director of the Metropolitan Museum of Art in New York. Previously, she worked at the Metropolitan Opera House in New York and at the Brooklyn Museum in New York.“The Met was a natural home for her work. Her multiple collaborators—including Mark Jenkins, David Lewis, and Helen Lotfler—gained her trust and knowledge with the help of a dedicated team, and she was able to push the boundaries of what was possible through radical and compelling practices,” said Mark Zuckerberg, PMA’s artistic director. Harris’s work has been featured in the Museum’s exhibitions “The Art of Being ,” “Architecture and Design,” “Motifs,” “The Power of Sculpture,” and “Theater as Design.” The PMA is currently preparing to unveil the sixth PMA–inspired exhibition, “The PMA: A Retrospective,” which will feature her work in a new location in 2020. \n\n\nThe Museum of Contemporary Art (", "The next Biennial should be held in 2022, and it will be held in the Whitechapel Gallery in London, the private exhibition space of the Rothschild bank. The show will include work by forty-seven international artists, including Andreas Ivins, Feral House, Yoko Ono, and Emma Lazarus.The exhibition will run in tandem with the institution’s new partnership with the Tate, which will bring the works of twenty-four artists to Tate Modern in London in an exhibition that will run from May 17 to May 19. The collaboration between Tate and Biennial has been in development for some time. The announcement of the inaugural exhibition drew a mixed response from arts professionals and critics, who called it a “major step forward.” But it was criticized for focusing on “borrowing, borrowing, borrowing, borrowing, borrowing, borrowing, borrowing, lending, borrowing, borrowing, lending, borrowing, borrowing, borrowing, borrowing, borrowing, borrowing, borrowing, borrowing, borrowing, borrowing, borrowing, borrowing, borrowing, borrowing, borrowing, borrowing, borrowing, borrowing, borrowing, borrowing, borrowing, borrowing, borrowing, borrowing, borrowing, borrowing, borrowing, borrowing, borrowing, borrowing, borrowing, borrowing, borrowing, borrowing, borrowing,", "The next Biennial should be the Sambisa Art Forum, which will present the work of thirty-seven artists, including Yoshitomo Matsuda, Koji Ogawa, Piotr Piotr, and Luis Villar. The 2019 edition of the Galeria das Beaux Artsi, curated by artist and curator Ana Mendieta, will be held at the Museum Arte del Trisulto in Milan, Italy.\n\n\nNew York’s Metropolitan Museum of Art (MoMA) is planning to shutter its iconic David K. Wallach Art Institute later this year to make way for construction of the $1.6 billion Museum of Modern Art. The museum is currently undergoing a $150 million renovation, and its final days are unknown. According to the New York Times, the institute’s director, Daniel H. Weiss, has given the museum permission to close indefinitely.“David K. Wallach created a unique program that has been sustained by his devoted staff for over twenty-five years—one of the most distinguished of the modern era,” Weiss said. “One of the reasons he gave for his long tenure was the high quality of the exhibitions he established and the engagement", "The next Biennial should be held in 2022. “The exhibition space will transform with the power of the new building and will provide an essential platform for exhibitions that transcend the boundaries between disciplines. The unprecedented opening of the exhibition is a victory of the Museums Union and of our partners,” the organizers wrote in a joint statement. A new exhibition fund will also be established to support the costs of exhibitors affiliated to the institution, which has three spaces at the museum.In the lead-up to the upcoming event, the city of Milan had approved the construction of a new 4,000-square-meter exhibition space. It was constructed in the former Stramaccio, a former stone quarry, in a site adjacent to the city on a plot of land owned by the city. Once completed, the exhibition space will be named after the new Italian Prime Minister, Paolo Gentiloni, and will be part of a new exhibition series titled “Sustainability. Intentional or Not?” The series will begin in March, 2020 and run until June, 2020.“The renovation of the house is a masterpiece of modern history in the Italian capital,” said artist Giuseppe Pirelli, who curated the", "The next Biennial should focus on 'Systemic Racism: Power in the Age of Color, Blackness, and Race” (2019), and the third on “Revolutions Now: From Black Power to Black Liberation” (2019).Commenting on the upcoming talks, Villela Gara, director of the Metropolitan Museum of Art, said: “We are thrilled that the biennial will return to the Museum of Modern Art and the City of New York with the continued vibrant creativity of our audiences, our artist-in-residence communities, and the community of artists who have shared their thoughts and their stories with us.”\n\n\nThe Supreme Court ruled on Monday that the University of California, Berkeley, violated the National Labor Relations Act—by refusing to recognize a class of temporary employees, known as contract workers, who had voted to form a union—when it terminated their contracts without their consent in June 2019.The decision by the three-judge panel of the California Court of Appeals, which heard oral arguments in a case brought by union supporters, was upheld by the Supreme Court on Monday. The court found that the University failed to demonstrate that the contract workers had broken the law by not informing the employees involved or providing them with", "The next Biennial should be held at the museum in 2021 and should celebrate the role of the museum as a center for the exploration and appreciation of art.\n\n\nThe Holbrook Institute for Art at Columbia University in New York has received a gift of twenty-six works by artists such as Emily Dickinson, Thomas Edison, and David Adjay from the Williams-Sonoma Museum of Art in California. The donation includes twelve works by artists whose works have been acquired through the institute’s purchase program, including Fairchild’s series “Linking Things” (2019), which the museum will display in its newly renovated space, and the new series “Composition from Point A to Point B” (2020).The gift also includes five works by artists whose works will be paired with works by the institute’s artists. The partnership was established to support the work of contemporary artists and to engage with the Museum of Modern Art in many new ways.“This is an extraordinary opportunity for the Holbrook Institute to present a collection of fifty years worth of artists’ work in a unique and transformative environment,” said Jeremy Schneider, director and CEO of the museum. “The partnership is an extension of the Holbrook Institute�", "The next Biennial should take place in the spring of 2021.Of the many projects that will be presented in the exhibition, the artist said: “I am thrilled to be collaborating with the Museum of Modern Art to present a series of works that reflect and explore the power of photography within the context of contemporary life.”\n\n\nThe São Paulo Biennial, which kicked off in May with the opening of an exhibition featuring more than five hundred Brazilian artists, has announced that the event will be extended into September. The announcement follows a move that was made by the Brazilian Curaçao-based organization Pécasa de Arte de São Paulo (MASP). The institution also announced that it will open a new 266,000-square-foot, 100,000-piece exhibition space in the city of São Paulo, which has a population of approximately five hundred thousand, in September.The new showpiece will be the first dedicated to the Brazilian artist and will boast a gallery in addition to the exhibition space and a curated programme that will unfold across three levels—the exhibition floor, an auditorium, and an extension—in the city. The exhibition will run from October 5 to November 28. The inaugural grand prize winner is Zina Gal", "The next Biennial should be on the theme of “Experimentation and Experimentation”\u0097in other words, “How does one go about experimenting with your own body and with the world around you?” In an attempt to shift the focus of the Biennial away from “art” and toward “technology,” the next iteration will be titled “Toward a Future Without Art and Technology.” The 2019 edition of the festival, titled “Art and the Future of Man,” will run from March 21 to March 28 and will feature thirty artist presentations. The full list of the 2019 prizes is as follows:Best Exhibition: Nancy Sze (Netherlands) Location: Kunsthalle Potsdamer Straße (Germany) Winner: Wangechi Mpagi Sepuya and Chris Sze (South Africa) Winner: Gina Nuzzo (Italy) Winner: Sara Zugazio (Italy) Winner: Dietmar Schoenbrunner (Germany)Best Book: Thomas Luce (Germany) Location: Kunsthalle Potsdamer Stra", "The next Biennial should be held at the International Olympic Museum in Beijing. The museum has been working with participating museums and organizations to create a program that will showcase the work of the most innovative and up-and-coming artists in the country. “This is an extraordinary year for the arts and I am thrilled to lead the way in shaping the themes and the programming of the next edition of the Beijing Biennial,” said Debbie Ormandy, chair of the museum’s board of trustees and member of the commission. The theme of the twenty-third edition, titled Art and Society, was inspired by a question posed by Andreas Viksjø to Marcel Astrup, who was the first master of the artist’s studio to be granted a vice-chair position in the Danish Academy. The next edition of the Biennial will be held at the Kunsthalle Basel from June 10 through June 12, 2020. The exhibition will be organized as follows: 1. The future of art and creativity: A visionary exhibition of contemporary art 2. Art and creativity as an environmentalist artifact: An exhibition of works by Christine dePetrigno 3. The future and future history of", "The next Biennial should be held in the autumn of 2021 and will reveal its design in the spring of 2022. The exhibition will feature over thirty artists, including Naguib Mahfouz, Khalid Nuri, Dmitriy Romanov, and A.J. Al-Bukha, and will include a retrospective of the work of 80 artists.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines for the use of social media to promote cultural institutions in the city. The guidelines state that the department will not remove a work or remove a personal identification number from a social media post unless a direct request is made for the removal of the work or number. The guidelines also outline the guidelines for the termination of an employment contract as well as procedures for complaints against mistreatment and harassment.According to the document, the department will not remove a work or remove a personal identification number from a post unless there is a direct and credible threat of physical harm to the individual or the institution. “The department will only terminate employment contracts following a thoughtful consideration of the individual’s employment history and the totality of the circumstances surrounding the termination of a contract,” a spokesperson for the department said.In an attempt to reduce the number", "The next Biennial should be held in the Spring of 2020.\n\n\nArtist-run spaces are gaining ground in California’s legal battle against the California Coastal Commission (CCCC), which is attempting to restrict the growth of towering redwood forests. The case involves the restoration of a massive redwood forest in the Santa Barbara Mountains, which is expected to yield as much as two hundred million bottles of wine in its lifetime, and started in February. Lawyers from the conservation-minded nonprofit Coastal Defense are challenging the commission’s authority to restrict the forest’s use, and Coastal Defense’s legal team is appealing a ruling handed down by a three-judge panel convened by the United States Court of Appeals for the Ninth Circuit in San Francisco last week that declared the coastal commission’s actions legal.The case is one of several facing California’s coastal communities, who are facing an unprecedented crisis caused by the coronavirus. About 80 percent of California’s coastal plants and wildlife have been destroyed—a loss of more than 100,000 acres of land, and the future of coastal public health and recreational opportunities for many coastal residents is at stake. With no cure for the coronavirus, California is running out of time to", "The next Biennial should be held in 2020. Jager said that the exhibition will focus on the legacy of the artist and will explore the significance of the work of the artist in the contemporary art world. As part of the exhibition, the public will be able to see the work of fifty-three artists, including Jack Heavens (2017), Jackie Joyner (2018), Hugh James Fletcher (2018), Henry A. Farley (2019), and Jack Nance (2019), among many others.\n\n\nThe Turkish government has removed a statue of General Cemil Bayik from its campus in Istanbul. The controversial figure, who championed the military and the government during the Gezi Park protests in 2013, was put on trial for alleged crimes against humanity in a closed trial in the capitalTaksim Square in late March.The government’s decision to remove the work came after a series of violent clashes between supporters of the outlawed Kurdistan Workers’ Party (PKK) and the Turkish government, which took place in the southeastern city of Diyarbakır on February 23, 2018, and February 26, 2018, according to the Art Newspaper. Tanks supported by the state and backed by the Nationalist Movement Party (MHP), Turkey’s", "The next Biennial should commence as soon as possible, engage with the local community, and assess the opportunities and challenges currently facing our city. ”The museum anticipates that it will be open by October.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is launching two new initiatives, the $75,000 Meditation with the Artist and the $150,000 Art of Judaism, both of which will partner with community-based organizations to offer free, guided meditation sessions at both locations. The first, called Forbidden Worlds, will gather twelve artists, including Ahmad Al-Qasimi, Amina Al-Khair, and Fatima Al-Qasimi, in one location and present them in a collaborative way. The second, called The Connection, will involve twenty-three rabbis from twenty-three communities in Los Angeles and will culminate in a public gathering, featuring photography and live music, that will be open to the public. “The first initiative will offer free, guided meditation sessions to anyone who can afford to attend one of our artists studios. The second will involve the rabbis and the artists from our studio. The sessions will take place in a space", "The next Biennial should be held in 2021.\n\nThe first edition of the symposium—which was originally scheduled for the end of March—was abruptly canceled due to the coronavirus. It reemerged in April, but was postponed again, and in April, the New York–based NGO Artnet called for a second edition of the conference to take place in the spring.The organizers of the symposium have since announced that the 2020 and 2021 editions will be held in the same city. The 2019 edition was canceled due to the pandemic, but the 2019 edition was rescheduled for March 25–March 28.The organisers said that the decision to cancel the 2019 event was not related to the coronavirus. They stated, however, that the event would have been financially unfeasible. “We acknowledge the challenges in moving forward in a rapidly evolving and interconnected world,” the symposium said. “However, we believe that the most important legacy of the exhibition is that it provides an opportunity for artists and critics to work together on critical issues of our time, such as climate change and the impact of art and the environment.”In a statement, the Biennial said: “The organizers of the 2019", "The next Biennial should be held in 2020 to mark the fifty-fifth anniversary of the institution. The museum is also planning to extend its reach into the United Arab Emirates and Australia, and announced its plans to stage the exhibition, “The Body,” for a second edition in 2022.\n\n\nThe New York–based nonprofit the Videotape Project has launched a new digital platform designed to help documentary filmmakers make their films in the aftermath of Superstorm Sandy—a massive, Category 5 hurricane that slammed into the East Coast of the United States on September 24, 2012, killing at least 128 people and causing tens of thousands more to be displaced.The organization, which is based in Brooklyn, New York, along with the nonprofit advocacy group the Institute for Policy Studies (IPS), launched the platform in an effort to assist those who have yet to film or record their own own work following a devastating hurricane that hit the area on August 29, 2012.The platform allows users to upload videos and audio clips, then link to other materials in the public domain to make texts and other works, and then to their own films.  Within days of the platform's launch, the group received more than 1,500 submissions from people across the United States. The", "The next Biennial should be held at least once a year, with a view to a future that is much more ambitious than this one,” Oleg told the Art Newspaper. “I still have a wonderful role to play in the development of the exhibition. I want to see the exhibition as an institution that is able to sustain itself for many years to come.” Born in Moscow in 1940, Oleg was brought up in the Soviet Union, where he studied at the State Academy of Fine Art in St. Petersburg. He moved to New York to work at the New York Folk Art Museum, where he met his wife, who was pregnant with their first child. In 1975, Oleg moved to the United States and married his American wife, Linda. They had two sons, Justin and Jackson. They eventually settled in the San Francisco Bay Area, where Linda continued to work as a New York museum curator.In 1983, a year after the birth of their first son, Oleg founded the 1964 exhibition “Avant Garde,” a collection of paintings and drawings by Victor Vasarely. In 1985, the exhibition was moved to the Museum of Modern Art in New York, and the 1967 collection “Paul Gauguin", "The next Biennial should be held in the fall of 2020. �Throughout our history, the Museum of Modern Art has been dedicated to showcasing the work of contemporary artists. We continue to push for a more diverse range of artists to showcase their work in a museum setting, “and to introduce new works to the museum.”The biennial’s first iteration, held in the museum’s former home in the SoHo neighborhood of Manhattan in 2017, drew a crowd of around 300 people. Two years later, a twenty-one-mile long, five-car museum was built in the borough of New York, with a capacity for 360 exhibitions. The museum opened to the public in 2007.\n\n\nThe first exhibition dedicated entirely to the life and work of Pablo Picasso, including his paintings, drawings, prints, sculptures, and printscarnts, will be inaugurated by his surviving children and the Picasso Foundation at the Museum of Modern Art in New York on Saturday, May 13. The retrospective, titled “Picasso: The Making of Modern Art” and curated by Pablo Picasso and José Pires, will run from March 16 to March 23. In a statement, MCA said: “Not only", "The next Biennial should take place in 2020, the date of the last iteration, in Helsinki. Adnan Abidi, president of the Southern Africa Forum, told the Art Newspaper: “I am very pleased that this will now be possible. I was not aware that it was so difficult.”\n\n\nThe jury that selected the twenty-fourth winners of the Turner Prize, which honors outstanding contemporary artists, has announced its final list of seventy-four artists. The artists who will receive their first prizes in London at the new Tate Space, which opened last month, are Agha Jathani (New Delhi), Alia Jol (New Delhi), Andrea Bruguera (Milan), Charlotte Hirst (New York), David Haemise (New York), Michael Chiu (New York), and Dominique Ghebaly (New York).The artists who will receive their second prizes at the Tate, which opened last week, are Alia Jathani (New Delhi), Leila Asher (New York), Keira Knightley (New York), Kenji Fujii (New York), and Peter Karlsson (New York). This year’s winners were selected by a jury consisting of Pierre Huyghe (New", "The next Biennial should take place in the spring of 2021. After that, the museum will begin an open-ended plan that will include commissions, exhibitions, and other events that will comprise the entirety of its next decade.The museum is planning to launch a series of programs in the spring of 2022 that will include programming that addresses issues directly related to the exhibition. It will also begin to renovate the original building, which is currently home to the Philip Johnson Museum of Art, and the surrounding area. The new buildings will be approximately 1,350 square feet larger and will boast additional galleries that will allow guests to view the works in the institution. The redesigned building will also be equipped with a new 100-seat theater where the exhibition will be held, a restaurant, and a bar.\n\n\nThe National Museum of Fine Arts (NMFA) in Boston has received a $2 million donation from David and Lucille Packer, the parents of Richard and Lucille Packer, from an anonymous benefactor. The gift is the culmination of three years of work by the family on behalf of a number of philanthropic projects, including the Local Initiative for AIDS, the National AIDS Strategy for Boston, and the National Geographic Society’s The Climate Crusade.“The", "The next Biennial should take place in 2022 and will address the themes of the year: “Practicality and the Conceptual,” “Unesco–logic” and “Performing Arts and the Theory of Cinema”\u0097the latter two discussions being translated as “Actual and Recognizable Art” and “The Art of Cinema.” The first exhibition will be “Actual Cinema: Post-Modern/Post-Television” (2019) and will run through January 30, 2020. The second exhibition will be “Theoretical Cinema: Modern, Modernist, Modernist II” (2019) and will run through March 14, 2020.\n\n\nThe British Museum (BMI) in London has announced that it plans to restore two of the largest works of art from its collection in a major overhaul of its existing exhibition, “The Presentation of the Art,” which opened to the public in March 2019. In March of 2020, the museum will be reopening with a new six-monthly exhibition, “The Presentation of the Art: Two Historic Masters,” curated by Michael Norton.The institution has previously made major acquisitions of works", "The next Biennial should start as soon as possible, but it is impossible to predict how long it will take to organize. We are also working hard to find other venues for the exhibition.”\n\n\nThe jury that selected the fifteen artists who will receive the $10,000 Cinecittà Prize this year has announced the finalists for its seventy-fifth anniversary awards. The prize will be presented at a ceremony on Friday, March 23, at the Palazzo Prada in Venice. Among the laureates announced this week are William Eggleston, the first African American artist to win the Prix de l'Arte in Rome, the $10,000 Lifetime Achievement Award for Art of the Americas, as well as the $5,000 Lifetime Achievement Award for Visual Artists.“The sixty-two awardees this year are a collective that employs both art and architecture to examine and articulate the arc of contemporary life,” said Carlo Cipolletta, president of the prize. “Their imaginative, ambitious, and wide-ranging visions define the contemporary, and are reflected in their works. The Cinecittà Prize honors the work of forty-eight artists who have made significant contributions to art, architecture, and architecture", "The next Biennial should begin with a presentation of the works by the ten artists represented in the collection, and then will feature a selection of other works. The program will also include a discussion, moderated by the curator, of the role of the artist-in-residence in revitalizing the campus and the Center for European Art.The museum is also planning to launch the biennial in the spring of 2020 to coincide with the opening of an exhibition of work by the artists represented in the collection, “Lithography.19.” The series will be curated by Jeanne-Claude Nothb et al. During the 2020 edition of the Biennale, the exhibition “Expression” will be the first to be held at the Center for European Art.\n\n\nA group of artists and collectors in New York City are suing the city of New York State over the removal of the Whitney Museum of American Art’s David B. Johnson’s work from its collection. The case, which centers on the move of the show from its current home on Madison Avenue to the Bronx Museum of the Arts, was filed in federal court in Manhattan on October 4, and the lawsuit was filed by the plaintiffs Gerald G. Pelle", "The next Biennial should consider the “recent history of the biennial,” said Wiradjuri, who added that the institution will also want to draw on existing work by contemporary artists. “It is important for us to examine the legacy of the exhibition, which is perhaps a historical artifact, and reflect on the importance of the work in the current climate,” Wiradjuri said.  The two-day event will be held at the Jodhpur Science Park in the city of Jodhpur, India, from March 22 to March 28.   \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has received a $10 million donation from the corporate and individual supporters of the Diller Scofidio + Renfro Foundation in support of the creation of the institute, which will support the development of leadership and public policies that will promote the full range of curatorial and performance practices in the arts.The gift comes as part of the organization’s Beyond an Age of Narratives initiative, which aims to better support contemporary artists through a $50,000 grant program that will launch in 2020. A follow-up grant program, which will focus on artists’ work in", "The next Biennial should take place in the town of Haus am Wald in the state of Mecklenburg-Vorpommer, which is currently undergoing a major renovation project. The first exhibition, titled Sarah Sze (The Eye of the World), will be at the museum until November 27.The biennial will also include a special exhibition of works by Felix Gabler, “Die neue Nationalgalerie: Die Nationalgalerie (Axelmannische Nationalgalerie), 1945–1945” (October 23–November 25, 2020), and a new film by the Berlin-based artist Thomas Mies van der Rohe. The project is part of the city’s ambitious reopening plan, announced in February, and aims to create a new cultural and industrial hub in the city. The city also plans to refocus on its cultural center, the Alfred Strassmann-designed Tadao Ando’s Space for Contemporary Art, by transforming the former headquarters of the museum into a new residence, museum, and conference space.\n\n\nMichael Pittman, chair of the American Ballet Theater, has announced his retirement at the age of seventy-nine after sixteen years in the profession. He is the", "The next Biennial should take place in the spring of 2021.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, has received a gift from the California Community Foundation (CCF), which is dedicated to supporting California’s arts and culture, from the 92nd Street Y. The gift was made in honor of the centennial celebration and to mark the institution’s centennial anniversary.“The Center for the Arts (CA) is extraordinarily fortunate to receive this generous gift from the California Community Foundation until our centennial year,” said Elizabeth Lehman, director of the Center for the Arts. “We are thrilled to present this year’s National Award for Model Cities, which will be presented to the model cities of the world. The model cities will be selected by the dedicated curators of the award, and the curators of the award will be chosen by the winners of the local community awards.”Since the Center for the Arts is one of the largest and most prestigious arts institutions in the United States, and since it is a public site, it is necessary and morally right that the model cities be chosen by the curators of the show. Therefore, the curators have been selected by the CCF,", "The next Biennial should be held in 2021 and will be hosted in the golden city of Athens. The first exhibition, titled Thesis series, will examine the theory and method of philosophy, and will run on October 24–December 31. The second, titled “Renaissance and Modernity” will be held in the spring of 2021 and will organize a four-day “discussion” on January 3, 2020.\n\n\nThe Museum of Modern Art (MoMA) in New York has received a gift that will allow it to reopen a portion of the museum’s former staff-run space, the Fabled Quartet. After the institution in 2020 completely reopened, MoMA director Monica Baratta announced that the museum would double the space’s capacity. In a blogpost published on March 3, Baratta wrote: “We are approaching this as an opportunity to attempt to re-create some of the historical intimacy of the confines of the building, while also bringing MoMA to life for all of our wonderful guests and the public. . . . We need to revisit the museum’s original vision, but we will do so with a renewed sense of purpose and optimism.”The gift is a thirty", "The next Biennial should be held at an alternate location in the city between March 20 and March 22, 2020. The exhibition will also be opened as part of the city’s newly renovated Civic Center, which is expected to open in March 2021.\n\n\nThe National Gallery Arts and Design (NGA) in London has announced that it has received the award for Outstanding Exhibition Design since it opened in 1981. The honor is given annually to an institution that has been historically influential in the development of new scholarship and the promotion of artistic practice. The $20,000 prize will be presented at the institution’s fifty-eighth anniversary celebration in London on December 29.The institution’s design team was awarded the award for its work in the design of a new National Gallery building in London’s Kensington, which is currently home to the National Gallery of Art’s collection. The redesign aims to create a new space for the collection on the ground floor of a three-story, 50,000-square-foot building and to create a new public gallery on the north side of the building.The NGA’s new structure will also feature a new public address system and a new 300-seat auditorium, a new conservation", "The next Biennial should take place in 2021. \n\n\nArtnews has learned that the city of Rotterdam will cancel the 2019 Amsterdam Art Biennial (AABB), which was set to take place at Rotterdam’s Uluverdam Science Center in the Netherlands from March 8 to March 10. Organizers have said that the decision was made in light of the coronavirus outbreak in the Netherlands and the coronavirus case count in the United States.“We have been following the developments in the Netherlands and the United States closely, and we have been concerned about the possibility of an outbreak of the coronavirus here,” said Christoph Spiegler, director of the Uluverdam Science Center. “The AABB is one of the main international events of its kind, and the project has been on-going with great enthusiasm for nearly a year. We were even invited to present an exhibition at the AABB in 2020; we declined, but we remained committed to the project. The potential of the event is great, and the organizers have been very supportive of our work. We hope that they will continue to support us and our staff, as we continue to work and develop new and", "The next Biennial should be held in the second half of the month, and will be organized as follows: Kunsthalle Basel (May 12–May 14), Berlin (May 16–May 18), and the IDG Science Museum (May 18–May 21), Beijing (May 22–May 25), and Hong Kong (May 22–May 26). Since the festival was born in Beijing in 1979 by the Chinese artist Liu Xiaobo, it has expanded to Munich in 1994 and Zurich in 2007. The biennial will be held at Shanghai Disney Resort, in partnership with the Shanghai Academy of Fine Arts, the Shanghai Art Museum, and the Shanghai Science and Technology University. The event will be hosted by the museum, the Shanghai Science and Technology University, and the Shanghai Art Museum, in partnership with the Museums and Galleries of Shanghai. “We are delighted that the museum is joining us in London and that this year’s event will be held at the Museum of London, where it has previously been held at least twice in the past,” said David Ramsey, the director of the Museums and Galleries of London. The museum will also stage a new exhibition of work by newly selected artists, curated by Catherine Ra", "The next Biennial should be held in 2022. “The biennial is an essential part of the future of art and it has been the foundation of my career,” Ritsuka told the Art Newspaper. “In order to continue to address the issues that have always animated the art, the biennial is needed not only as a tool, but also as a source of inspiration for the artists.”\n\n\nThe Metropolitan Museum of Art in New York is planning to open a new exhibition devoted to the work of American painter John Nash, an influential member of the Abstract Expressionist movement, in January 2021. The exhibition will be titled “Nash and the American Experience.”Nash’s most recent exhibition, “Theoretical Painting: From Progress to Abandonment” (2016–17), included work by forty-eight artists, including Benjamin Britten, Susan Bonner, and David H. Koch, among others from the “Avant-Garde” era. “The exhibition builds upon the themes of the exhibition ‘Theoretical Painting’s first year, which is about the relationship between art and philosophy,” said Hans-Ulrich Obrist, the director", "The next Biennial should be held in 2021. The current iteration of the exhibition is slated for September 11 to December 18, 2021.\n\n\nPopular artist Janice and George Suttner have been named the recipients of the 2019 PEN/Lord James Levett Prize. The prizes are made by the Irish artist in memory of her late husband, Lord Suttner, who was an internationally acclaimed, award-winning, and prolific writer whose paintings and drawings touched upon topics as varied as the nature of reality and the nature of art.Born in Dublin in 1948, Suttner, a poet who often employed metaphors to describe his work, is remembered for his paintings Celebrating (1961), a series of collages depicting scenes from his own life, and The Rubber Band, 1972–79, a series of photographs that explore the idea of the rubber as a medium. Suttner’s drawings have been collected by a number of collectors, including Jeffrey Mangano, Teresa Lorello, and Peter Heller.Born in 1938 in New York City, Suttner received his bachelor’s degree in 1966 from Yeshiva University in New York, where he studied with Norman Rockwell. Suttner moved to Los Angeles in the ’", "The next Biennial should take place in 2022.\n\n\nThe Rubell Family Foundation, a New York–based organization that supports artists in the arts, has announced that it will end its longstanding partnership with the Rubell Companies, the family of the late billionaire textile magnate Richard and Mary Rubell. The foundation has funded the Rubells for over forty-five years. \n\nRainer Rubell’s foundation gave $1.3 million to the Rubells’ charitable foundation over the course of a decade. The foundation’s endowment fund was one of the largest gifts made by the Rubells to a single institution, eclipsing the $500,000 given to the Rockefeller Brothers Fund and the $500,000 that was given to the Sidney and Sidney Garber Charitable Foundation.“The Rubells had been generous donors to the foundation for twenty years, and the foundation knew that this was a partnership that would last for generations,” said Susan Baumann, a longtime curator of the Rubells, who was a member of the collection. “It was the Rubells who were the true pioneers, and their contributions to the field of arts education have been immeasurable. We are very", "The next Biennial should be held at the National Museum of the African Diaspora in Washington, DC, in 2020. Felix da Costa, curator of the sixth edition of the exhibition, which will be held in Berlin in 2021, said: “I am thrilled to be back in New York. The new exhibition at the National Gallery of Art is a compelling platform for reflection on African art and contemporary art.”Frauke Petry, the European parliament’s culture commissioner, added: “Since the start of the exhibition, the National Gallery has been a model of transparency and cooperation. The exhibition is a clear signal of the National Museum’s commitment to the preservation of European art and culture, and to the important role of the Smithsonian in the maintenance of this heritage.”While the National Gallery has not yet announced the dates of the seventy-fifth edition of the exhibition, it will take place at the Nathan Cummings Center’s 146-year-old building from June 22 to June 25. The institution has also announced that the 2019 edition, “The Lasting Legacy of Henri Matisse,” will not be rescheduled and will instead run alongside the seventy-second and seventy-third Biennials.", "The next Biennial should be held at the museum in 2022. The institution has also been designated a Historic Monument and is currently undergoing a major renovation, with the introduction of a new exhibition space and larger public plaza.  \n\n\nWhen late-night television host Jimmy Kimmel revealed on Monday that he was planning to deliver a speech on race in the United States at the Fifty-Ninth Venice Biennale, the Los Angeles–based organization BlackRock announced that it would donate $1.5 million to the cause. Kimmel was responding to a question about whether the United States should recharge its existing $15 billion in federal grants for cultural institutions to do more to combat racism. While he initially suggested that BlackRock contribute the funds through a portfolio rebirthing program, the organization has since clarified that it does not intend to create any new funds and has instead asked the Venice Committee on Cultural Affairs (VCCA) to develop a new set of guidelines for how cultural institutions can be used for black liberation.In a statement released by BlackRock, Kimmel said: “I want to emphasize, we are not creating new funds for museums, but rather are sharing these funds with the Venice Committee on Cultural Affairs in order", "The next Biennial should be held in the spring of 2021, as the organizers have announced that a new exhibition of works on paper will be launched in the autumn of 2021. A press release published by the festival reads: “The new Biennial will be an exciting journey of exploration of the spiritual and cultural richness of the contemporary world. It will invite a new combination of visual and soundworks in order to push back against the limiting of art through the medium of sound, as well as new and creative forms of art in order to make a new world.”\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has acquired the work of the influential Polish-born, Colorado–based artist Olga Astakhov, whose Blue Period–era installations incorporate ska, pop, and rural sounds such as tin whistle, looms, and boats. In addition to expanding the museum’s collection of early American artists, Astakhov also written several books, including The Art of Making Noise: A Visual History (1994) and Lady with a Pearl Earring: The Student Musical (1996), and curated exhibitions such as “Cosmos in the House,” (2003) and “Emma,”", "The next Biennial should take place in the city in 2021, and the next will be in 2022. Both events will be held in the museum’s building, which is located on the ground floor of the old izabella romano in the Piazza della Scala, at 853 Piazza Crossroads. The city will be hosting the first event in the new venue, which opened to the public in 2016, in 2020.The German city of Essen, which has a population of just over three million, is preparing to welcome visitors again this fall. According to the Art Newspaper, the first event will be held in November, the second on December 28, and the third on January 1. In addition to the izabella, the city will also be home to the new Palazzo della Scala, the new Institute for Contemporary Art, the new Institute for Art History Research, and the new Zentralarchiv für die Deutsche und Internationale.The city is also planning to open a new museum for fashion in 2021, an exhibition space for women artists in 2022, and open a permanent collection space for art in 2022. The first event will take place in September, the second in November, and the third in January", "The next Biennial should be held within the next two years, and the first exhibition should open in 2021.\n\nFollowing the 2014 coup, the authorities intensified their crackdown on anti-government protests, with hundreds of people killed. In March, President Recep Tayyip Erdogan issued an emergency decree that gave the security forces the power to remove protesters from their homes without warrants and to break up gatherings. In the weeks that followed, dozens of people were killed in police violence.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles has received a gift of more than five hundred rare works by Italian modern and contemporary artists, which were on display during a retrospective of their work held at the institution last month. The works were donated by a group led by David H. Koch, the CEO and chairman of Koch Industries, and his wife, Catherine, who reside in California.According to the Los Angeles Times, the Kochs are the latest major donors to the museum. In March, the couple donated fifty works by Beauxbathes, Gherardino Poggi, Tommaso Varetti, Zinaya Zingaretti, and Hamza Walker, as well as twenty-six others by Luisa Capozzi, Mihai Catt", "The next Biennial should be in 2021. \nThe museum will unveil the new venue for the exhibition at a moment's notice. Its opening will be on January 19 and will be hosted by the National Gallery of Fine Arts in Washington, DC. The Biennials are a series of exhibitions and residencies organized by the National Museum of Fine Arts in Washington, DC. The inaugural exhibition is  The Claws of Midway: Art and Body and the American West. The second exhibition will be The Lusick Family Collection: Art and Politics. The third will be “The Black Eyed Peas: Worlds,” a collaboration between twelve artists drawn from the Black Eyed Peas tribe.\n\n\nThe Pérez Art Museum in Mexico City has announced that it has received a gift of forty-six works from the Pérez family. The works were donated by sculptor and collector Louis Pérez, who passed away last year. The gift includes works by artists from the Pérez family’s collection including Luis Pérez’s The Adonis and the El Dorado, 1919, for which he paid $15,800; Todashe", "The next Biennial should take place in the third quarter of 2020. After that, the Foundation will consider whether the artworks can be restored, and then a decision will be made as to whether they should continue.“The grandiose project for the Art of the Renaissance—to re-create the Château d’Arles in France—involves a remarkable combination of art, architecture, and design,” Artforum editor-in-chief Max Hollein wrote in a review of the exhibition. “In the process, the Foundation illustrated why it is still the dominant force in the field.”\n\n\nThe artist-run online auction house Daiso, which was forced to move its Tokyo headquarters to the same city as the company’s newly opened, art-filled exhibition space Third Line, is facing a legal complaint from a group of artists who want the auction house to pay them $3.4 million after it failed to register for the 2020 event. The artists, whose names have yet to be released, filed a complaint with Tokyo District Court on March 3, alleging that the failure to register was due to financial reasons.[Update: March 19, 7:00 PM] The automaker and the court have settled", "The next Biennial should be held in 2022. The museum is currently planning to open a new exhibition, “Boschka: Organizational Moment,” in 2021, but the decision was made after a meeting with the Bolshoi State Museum of Fine Arts in Moscow in June 2019, when it was announced that it would not be staged. The institution has since been trying to find a new venue for the exhibition, which will showcase the works of ten artists in the group exhibition “Body of Work: Art as Politics” and will run from January 51 to March 55, 2021.\n\n\nThe Metropolitan Museum of Art in New York has appointed Charlotte Green as its new deputy director for collection strategy and an experienced collector who will oversee the development of the museum’s collection in the United States. Green comes to the Met from the Metropolitan Museum of Art, where she was the director of collections management and external partnerships. Previously, she worked as the director of curatorial affairs at the Solomon R. Guggenheim Museum in New York and as the director of the Metropolitan Museum of Art’s collection of contemporary art.“We are thrilled to hire someone with her ability, knowledge, and enthusiasm,” said director Christopher", "The next Biennial should address the issues of the Anthropocene, the Anthropocene Consensus, and the Anthropocene-Future coalition; the ongoing refugee crisis, including its migrant component; and the biennial’s inaugural exhibition, “The Earth in a Soul.”\n\n\nThe San Francisco Museum of Modern Art (SFMoMA) has created a new position for marginalized artists in the museum’s permanent collection: an artist-in-residence position. The new position, which was created by former director Kenneth Almaso and was created as part of a $3 million fund that was established in 2017 for arts programs and cultural organizations, was created to help facilitate the transition of leadership in the collection and administration of the museum’s collection as it undergoes a major redevelopment.“We are thrilled that the artist-in-residence will be a part of this revitalization,” said Amanda Levin, the museum’s director and CEO. “The artist-in-residence provides a direct path into the permanent collection for marginalized artists and helps to strengthen SFMoMA’s collection in a time when the museum is committed to growing the collection as an institution of the human experience.”Previously,", "The next Biennial should also include a dedicated platform for exhibitions and collaborations between artist-run spaces and galleries. It should also introduce additional support for artists in the form of grants and loans. Finally, it should examine the potential of new media, including digital fabrication techniques, and exhibition spaces as means of empowering artists.\n\n\nNew York’s Museum of Modern Art (MoMA), which has been closing up shop in order to restructure its business, is in the midst of a major restructuring. Its board of directors, chaired by John Pritzker, chairman of the investment firm Apollo Global Management, announced today that it intends to reorganize its holdings in order to improve its liquidity and reduce its debt. In a statement, John Pritzker said: “Over the last eighteen months we have actively managed the business to reduce debt and increase flexibility to support our artists, our staff, and our exhibitions. We have also grown the museum’s holdings of contemporary art by more than eight hundred works. Our strategy has included the divestiture of art from underperforming companies and institutions.”The restructuring plan will begin with an asset sale, which will be followed by a depreciation and reinvestment plan, which will be followed by a restructuring of the museum�", "The next Biennial should be held in 2021, and the event’s creators hope to begin construction in the new year. The institution will host twenty-eight artists, including Alexander Calder, Paul Gauguin, Simone Leigh, and Sky Ferreira, in New York City in October 2021.\n\n\nThe National Gallery of Art in Washington, DC, is planning to shutter its doors on March 31, 2020, after more than seventy years of operations. The museum’s current exhibition schedule is currently divided between a two-week stint dedicated to Lincoln, and two-week runs of work by artists such as Sean Penn, Tilda Swinton, and Richard Serra. The museum is currently open to the public Monday through Friday from 10 AM to 5 PM, and on Saturday and Sunday from 10 AM to 5 PM.“The museum is truly at a turning point,” said museum director Michael Govan. “We are entering a new chapter, the longest-serving director of the National Gallery of Art in America, and we are excited to share more of our stories with you, including more of our upcoming shows, and to continue to present the work of contemporary artists in a meaningful way.”The gallery will close", "The next Biennial should focus on ‘alternatives,’ freedom,” Sissons said. “We must be aware that many contemporary arts institutions, including prisons, have not responded to the needs of the most vulnerable populations. We must, therefore, examine the roles of prisons in society and consider the implications of institutions with regard to social ills.”The exhibition will also include works by artists from the Black Lives Matter movement, including Nari Ward, Nari Ward–\"Prisoners\", 2016, and Raghebilla, 2016, both in association with the Guggenheim Museum.The Khalfani Foundation, which aims to promote the work of emerging and established artists in Saudi Arabia, will also charge a fee for the exhibition. The fee is $5,000. For the Khalfani Foundation’s fairs inaugural edition in Riyadh, this year’s theme was “Occupation,” and entries were announced last Thursday. “We are thrilled to be able to present this exhibition at Khalfani, the Kingfisher Art Museum, the Museum of Modern Art, the Museum of Contemporary Art, New York, and Narmada Art Museum in Mumbai,�", "The next Biennial should be held in 2021.Its chairman, Lei Jun, said: “The ambitious and diverse array of exhibitions, events, and programs that will be staged in the exhibition space of Biennale Miami Beach are indeed incredible, and we are thrilled to partner with the city of Miami as we launch our first biennial in Miami Beach in 2022.”\n\n\nThe Museum of Fine Arts (MFA) in Boston announced today that Zadie Smith will become its next director. Smith will take the helm from Carol Chow, who has served as the MFA’s board president and executive director since 2016, in November 2020. She succeeds Tamara Keith, who has helmed the museum for twenty-six years, and will begin in her new position on June 1.“I’m excited to continue the work of the last eight years as the next director of the Massachusetts Institute of Technology (MIT),” Smith said in a statement. “I’m eager to expand the Museum’s international reach and to continue to shape the MFA’s contemporary and contemporary art.”Smith is well-known in the art world for her leadership, curatorial leadership, and curatorial curatorial", "The next Biennial should be held in 2020. \n\n\nThe National Gallery of Canada in Ottawa has received $75 million from the National Arts Fund, Canada’s official source for arts and cultural heritage, in support of the expansion of the institution’s collection and development program. The gift, which also includes $48 million in revenue-generating loans for the construction of new collections, was made in support of the institution’s decision to purchase from the artist Frank Gehry, the architect behind the National Gallery of Canada’s current design, the Schiffer-Schermer Gallery, in New York, USA.“The National Gallery of Canada is a national treasure and the museum has been historically critical to Canada’s cultural heritage,” said Caroline Pengilano, director of the National Gallery of Canada and a trustee of the Sculpture and Paintings Heritage Fund. The $48 million in revenue-generating loans will be used to finance the construction of the new collections, which will be dedicated to contemporary art, and to expand the institution’s collection. The new buildings, which will be built on a site formerly occupied by the National"]