["The next Biennial should be on the theme of \"Remains and new creations: From the Pacific to the Inland and Beyond\".  The 2018 show featured works by over seventy artists.  The 2019 show will feature works by seventy artists. The 2020 exhibition will be devoted to the theme \"Greek and Roman art\". The 2020 exhibition will comprise twenty works by seventy artists. The 2020 exhibition will be broadcast on Saturday, April 21, 2020, at 5 PM. The 2020 exhibition will be staged at the San Francisco Museum of California. Announcements will be made available online as soon as possible. The 2019 Biennial will be held in Tallinn from March 17 to March 22. The 2020 show will be held at the Fischbachhaus in Krefeld, Germany, from March 21 to March 23. The 2020 exhibition will be held at the MAMCO, the Museum of Modern Art in New York, the Museum of Modern Art, New York, and the Museum of Modern Art, New York, from March 23 to March 26. The 2020 exhibition will be hosted by the Konsthall in Berlin. The 2020 exhibition will be staged by the Kunsthalle Basel in Frankfurt from March", "The next Biennial should be held within the next twelve months. The new venue should be located in Central Beach in Miami Beach, Florida, and will be inaugurated by a solo exhibition of works by the Colombian artist María Berrada. A biennial of works by artists from the Sierra Madre as well as from Skarbilla in the Caspian region of Uzbekistan and the Bessarabia region of the Philippines is currently on view at the Museum of Contemporary Art in London.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines for organizations that wish to host events at designated cultural sites in the city in the future. Under the guidelines, which were developed by the city government, individuals and organizations may temporarily block off certain streets or relocate their events elsewhere.The guidelines provide a framework for cultural organizations that want to host events at sites designated by the city, such as the Battery, the Battery Park, and the Battery Park East, and for those that want to hold events at sites that are not currently designated. The guidelines do not address the future use of publicly owned sites.In an effort to ensure the preservation of important cultural assets, the city will begin removing more than 1,400 historic structures from its", "The next Biennial should focus on the history of the exhibition and its alumni, and will focus on the works of artists whose work is currently on display as well as their current projects. “We are anticipating an important system of exhibitions in the coming years,” the organizers said. “The future of the Biennial is currently in the hands of the Canadian government and the Biennial is an integral part of a long-term plan to develop and further develop this country’s art and culture sector internationally.”\n\n\nThe British government has approved a $8.1 billion aid package for the Kurdish region of northern Iraq, which has been plagued by violence since the US-led invasion of Iraq in 2003. The Kurdish Regional Government (KRG), which has the power to govern over an area the size of Michigan and is a critical US ally in the fight against ISIL, announced the funding in a statement on Monday.The Kurdish Regional Government (KRG) announced the funding for “the creation of an Office of International Cooperation,” which will be run by a director appointed by the Prime Minister, who is currently negotiating a new strategic partnership agreement between Britain and the KRG, and will aim to draw international support to", "The next Biennial should be held at a site selected by the curators. The location will be chosen based on the availability of new art along with the community support of the institutions and the global community.”  The subject of public art, the lack of which is often attributed to the city, is a hotly contested one in Los Angeles. In an attempt to address the city’s housing crisis, which has resulted in an increase in homelessness, city planners have determined that the future of some of Los Angeles’s most visible structures, including the iconic Griffith Memorial Bridge, the Olympic Stadium, and the Treasure Island, may be decided by a vote of the voters of the city. “Los Angeles is a city of contradictions,” said city council member Kenlly. “It’s a city of artists and it’s a city of contradictions in people. The future of these structures must be decided by the people of Los Angeles.”The city’s Civic Art Museum and the Museum of Contemporary Art have yet to make any decisions regarding the future of their buildings, but many are concerned about the future of the Griffith Memorial Bridge, which has seen a steady increase in visitors in recent years but has yet", "The next Biennial should take place at the Museo de Cultura Modernas (New Museum), Madrid, sometime in the first half of March 2021. The museum will host eight exhibitions, including “The Future is Not Here” (2019), “Live Science” (2019), “The Museum of Contemporary Art: The Exhibition of Art” (2016), “Alberto Burri: The Collection,” and “Design and Misunderstanding” (2016).In the March 2019 issue of the Art Newspaper, Amy Lee, who writes about contemporary art from a feminist and anti-capitalist perspective, argued that the March exhibition was “a call for an immediate break from the current state of affairs,” revealing that the future of the medium is at stake. In its February 2020 issue, the magazine wrote: “The most urgent question of our time is: Who will control the future of art? The answers to which will determine whether a situation so fraught with uncertainty remains or fractures into myriad permutations.”The March exhibition will feature work by 80 artists from around the world, including Sarah Benhabib, Nari Ward, Harriet Moffatt, Kiki Smith, and Melanie Lyns, who have been", "The next Biennial should be held in 2020.  The decision to postpone the event was made after the arts minister, Birgit-Jan Steiner, declared her intention to push ahead with the opening of the museum, which was started by a group of local residents, despite the government’s efforts to stop the project. “We cannot let this development affect the opening of the Biennial,” said Steiner. “The question is how long we will be able to work together to develop the Biennial and to organize it as a civic project.”The Biennial will also be closed to the public, although the museum will re-open in 2021 with a new exhibition, “The Art of Living Together: Biennials and Living Together,” which will feature new works by artists such as Perrotin, Bettina Esker, Bertrand Bietsch, and Carlos Garaicoa.  If the exhibition is successful, the Biennial will expand to enable visitors to see all twenty-two works by artists in the exhibition. The current exhibition, “The Art of Living Together: Biennials and Living Together,” will run for thirteen weeks and will be open on March 17–March 19", "The next Biennial should be held at the Autonomous University of Barcelona on May 24–May 28.The 2021 edition of the Berlin Biennale, which will be staged at the historic Brandenburg Gate in Berlin from May 11–May 13, will be held at one of the city’s most iconic cultural attractions, the Eschbachhaus. The venue, which opened in 2009 and has hosted the event since 2003, will be transformed by the artist Billie Lurie and the architect Erich Traugott. The exhibition will be organized by the Berlin-based company Stiftung BERLIN and will include work by more than sixty artists, including Marc Montes, Thomas Bastos, Hanna Woerner, Barbara Steinhauer, and Ulrike Wirth, and will showcase work by forty-seven artists and will include an exhibition of work by the artist Kunsthalstätten Flugzeug.“I am delighted that this year’s Berlin Biennale will return to the city of Berlin, which is home to some of the most important cultural institutions in the German capital, and will build on its reputation for creativity, innovation and innovation, with a new narrative and a new focus,” said Bjorn Ne", "The next Biennial should take place in the autumn of 2020. \n\n\nThe British artist, curator and educator Suellen Roesler, whose practice remains at the forefront of art-making in the late twentieth century, has died at age ninety-six. Roesler, who had a long-standing and intimate relationship with the Tate and its director Sir Peter Zumthor, died of cancer in London on Monday.Born in London in 1936, where her mother was a homemaker, Roesler studied at the School of the Art Institute of Chicago, the Royal Academy of Arts, the Royal College of Art, the School of the Arts, the School of the Art of the Arts, the School of the Art of the Moderns, and the Art of the Opposite Minds. From the early 1960s until her death, Roesler made artworks that were created in fits and starts, using her own body and her imagination, such as Stalin: Illusion, 1971, an early, monochromatic series that features a man seated at a desk in a brightly lit room, talking; Paradise Lost, 1969, a series of sliding glass doors with painted plastic walls and glass panels that have been rearr", "The next Biennial should focus on how media can be used to dismantle and reconfigure the world around us. We need more of these events, not less.”The exhibition organisers have also announced that the fifty-ninth edition of the biennial will take place in October 2020, and the twenty-ninth in February 2021.\n\n\nPresident Donald Trump signed an executive order on Tuesday that aims to roll back environmental regulations and roll back welfare benefits in an attempt to advance his controversial travel ban, which has been blocked by federal courts. The move comes as the nations of the world are still trying to agree on a replacement for the controversial executive order, which has detained several thousand people since it was issued on February 6, and is a relief for artists and other cultural workers who have been fighting for an overhaul of US immigration policies.Enacted as part of a $787 billion tax cut bill, the executive order halts all new federal spending and only partially implements a series of Trump’s campaign promises, including a vow to scrap the Kathryn’s Law, a law that targets illegal immigration, and to temporarily suspend the entry of refugees and immigrants from seven Muslim-majority countries. Trump has claimed that the orders were meant to keep the government running throughout February", "The next Biennial should take place in 2022. Previews are currently underway.\n\n\nCanada’s National Gallery of Canada (NGA) has appointed Sarah McLaren as its next director. McLaren will assume her post after the institution’s spring 2019–20 season. She succeeds Bernard Venturé, who has served as NGA’s director since 2009, and will begin in her new role on April 1.“Sarah McLaren embodies the values and vision of NGA,” said NGA president and CEO David Breslin. “Her renowned curatorial skills, deep experience, and passion for art make her uniquely qualified to lead a modern, contemporary contemporary, and contemporary art collection in the United States.”Venturé, who helmed the institution since 2009, left the institution in March 2019 to become director of the Museum of Modern Art in New York. He was succeeded by John Akomfrah, who was hired as NGA’s interim director by Breslin in July. In his new role, which is funded by the NGA and is searched by NGA director Martha Mitford, McLaren will work closely with the NGA’s board of directors.“I", "The next Biennial should take place in the Czech Republic in 2021. The show will be hosted by Hanka Krupa, a Czech curator who is currently based in London and will curate the exhibition in collaboration with the London-based artist Janez Herf, and will feature work by forty-nine artists. The show will also be curated by Alireza Ismaili, the Beirut-based director of the United Arab Emirates-based biennial Apperasia. The Biennial will be hosted at the Biennale Rotterdam from November 13 to November 20.The art of the future is here, and it is here on your wrist: the International “Wearable” Pavilion at the Venice Biennale. Set to open at the Venice Art Museum in November 2019, the piece, titled “The Body,” will be presented by the Danish artist Troll Hjortenberg. The installation will consist of three stationary sculptures created by Hjortenberg, each constructed from a single daily ritual: the mannequin in the middle, his arms, and the torso in an attempt to explore the relationship between the body and the body. The work will be distributed by the Danish artist and Biennale Rot", "The next Biennial should be held in 2021. \n\n\nThe National Gallery of Canada is planning to open a new, larger building in the building that has housed the institution since 1936. The new building will be named the Jean-Michel Basquiat Foundation for the Arts, and will be built in the city of Ottawa on the grounds of the National Gallery of Canada. The institution will also expand its contemporary art collection by two hundred works.According to the Ottawa Citizen, the new building will add 14,700 square feet of exhibition space and accommodate an additional 200,000 items, and will also bring with it new research and education initiatives that will include the development of a biennial master class, which will be curated by a former curator of modern and contemporary art, and events for the museum’s new 125,000-square-foot building.It will also be home to the institution’s permanent collection—as well as the collection of the National Gallery of Art, the Art Gallery of Ontario, and the Canadian Museum of Modern Art—and will boast the museum’s current exhibition space, which dates back to the beginning of the museum’s existence. The museum’s current tenant is the Saint Louis Art Museum, but the", "The next Biennial should be held in 2021. \n\n\nThe UES Art Museum in the City of New York, which is working toward revamping its contemporary art collection, is proposing to build a new facility that will house the institution’s collection of modern, contemporary, and Renaissance art, among other artworks. The institution already has a new building on the upper level of the museum that will hold the collections of the Walter de Maria Foundation, the Metropolitan Museum of Art, and the Whitney Museum of American Art, as well as the collection of George A. Lucas.The new 50,000-square-foot museum, which will be built on the second floor of a brownstone in Chelsea, is being envisioned as a destination for contemporary art in the urban core. It will feature a platform for the museum’s collection of Ben Gass’s Outlaw Cabinet, Salvador Dalí’s The White, Jean-Michel Basquiat’s The Bends, and early abstract painting. The museum will also boast an auditorium, a library, and a rooftop terrace.The proposal for the new venue was first presented in a conceptual design study by Carlo Caccia, a partner at the Foro Architecture Group", "The next Biennial should be held in Helsinki in September 2020, the Finnish artistic director Martti Ahtisaari has said. The event’s artistic director, Reiki Ruai, told the Art Newspaper that the theme of the 2020 edition will be “social justice.” According to the Art Newspaper, the full list of participating artists is as follows:There are several similarities between the works in this exhibition and those presented by other international artists. For example, the works of artists such as Dania Ghemawat and Zina Saro-Wiwa and of Performa artist Matthew Higgs are based on the themes of solidarity, solidarity with others, solidarity with nature, solidarity with nature’s inhabitants and relationships with nature’s images.The Helsinki Art Foundation is also collaborating with the National Museum of Fine Arts Finland to unveil an exhibition of works by Sanjiv Mukhopadhyay and Akunari Moriyama at the Koelsch Museum of Contemporary Art in Helsinki on October 19.The next show in the New York–based project, “Performa,” is an exhibition of work by twenty-four artists, including Igor Brätsch, Ol", "The next Biennial should focus on “the African diaspora,” the first being “Negritude” (2018) and the second being “Biopolism” (2017)\n\nAdvertisement\n\nThe Museum of Modern Art (MoMA) in New York has appointed Tina Barlow as its next director. She is currently the founding director of the Baltimore Art Museum, where she has been in charge of the biennial since 2012. She succeeds David Pitt, who retired in March after eighteen years.“Tina’s experience and vision for MoMA make her uniquely qualified to lead our institution through this challenging and transformative moment,” said MoMA director Philip Johnson. “Her leadership and vision for the biennial were almost unprecedented. I’m proud to work with her to help transform MoMA into a powerful institution that furthers our mission to connect audiences with important art and to shape the direction of the city’s art by showcasing the work of artists who were not represented at large in the past.”Prior to joining MoMA in 2007, Barlow served as the executive director of the Jewish Museum in New York; worked as a curatorial assistant at the", "The next Biennial should take place in 2022 and will present presentations of work by artists such as Jean-Luc Godard, Adrien Brody, and Pierre-Auguste Renoir. Upon the theme of the event, which will also be themed the artist-ruled city of New York, the biennial will address the history of the city, its present-day inhabitants. Upon completion of the exhibition, the Biennial will be awarded $50,000.Sebastian Veal, president of the Greater Golden Gate Art Museum and Museum of California, told the San Francisco Chronicle that the museum will move the exhibition from its current venue in the Golden Gate Memorial Gardens into the venue of the California Academy of Sciences. The move will coincide with the reopening of the museum and the reopening of the campus of California Polytechnic University, San Francisco.The institution had planned to stage the exhibition as part of the 2017–18 academic year but was forced to cancel the event following an incident on the museum’s campus in January 2020. In an apology published on the museum’s website, the museum said that the exhibition’s theme “remained centered around the concept of thought, purpose, and the end of life, rather than", "The next Biennial should be held in the spring of 2021.\n\n\nThe Amsterdam Museum of Modern Art (EMMA) announced today that it has received a gift of four works by the artist Susie Tung, who died last September at the age of eighty-nine, from the artist’s estate. The gift includes a suite of paintings by Tung, whom the museum acquired in 2008 as part of a $30 million donation from her father, Peter Tung.Born in New York City in 1939, Tung began painting at the age of fourteen after moving to Hong Kong. She studied at the West Coast Institute of Art, the University of California, Los Angeles, and the New School in New York. Following a stint at the New School, Tung returned to New York for a summer in 1948 to work on a series of paintings that were exhibited at the Museum of Modern Art (MoMA). In 1951, she moved back to Hong Kong, where she studied with David Salle, and worked alongside another of her father’s sons, Piet van Eyck, until 1964, when she married van den Broek, and the couple relocated to Berlin. The family moved to the capital in 1969, and Tung returned to Hong Kong in", "The next Biennial should take place at the Kunsthalle Basel. The third annual, already scheduled for October 2019, has yet to be announced. The exhibition will be organized as follows: The exhibition will feature works created by the participants of the Fifth Framework Conference (5F), which has taken place in Almaty, Kazakhstan, from September 22–September 25, 2020. A selection of works will also accompany the exhibition, which will be presented by the Kunsthalle Basel in collaboration with the Art Archive of the National Museum of Modern Art, and will be presented in the Kunsthalle Bremen.The exhibition will also include a selection of interviews with the participants of the Biennial Bijan and Bijan, which is scheduled to run from September 10–September 13, 2020, as well as Enrique Ochoa, director of the Museo de Arte Contemporáneo Baja California, Mexico City, and the Museo de Arte Contemporáneo Rio de Janeiro, and Massimilano Di Gregotti, director of the Museo de Arte Contemporáneo San Lorenzo, Italy. Artforum has reached out to the Kunsthalle Basel for", "The next Biennial should take place in the fall of 2020 and will feature works by between fifty and seventy artists from twenty-two countries and territories. The theme of the year 2020 will be a “digital world that transcends borders and borders transform us.”\n\n\nThe Smithsonian’s National Museum of African Art (MoMA) in Washington, DC, will open its new wing, the Smithsonian African Arts Museum, on January 20, 2021. The museum’s new headquarters will be completed in 2020, but the institution will remain open during the construction phase and will commence operation in 2021.The institution will also continue to operate in collaboration with MoMA’s existing collection of more than four thousand works, which was added to the museum in 2015. Among the works on display in the new space are work by Naima J. Keith, Yoani Akomfrah, and A. V. Sison, among others that have recently returned from exhibitions at the museum.“This new arrangement will allow us to present our collection in a way that will be meaningful to our audiences and reflect the breadth of our field,” MoMA director Daniel H. Weiss told the Art Newspaper. “It’s an exciting time", "The next Biennial should take place at the London 2012 site in 2020. Jonathan.Wollaston:  With the conclusion of the twelve-year-long David and Goliath project, which explored the boundaries between art and technology, Jonathan.Wollaston said: “I’m looking forward to continuing to build on the foundation of London’s art and technology ecosystem, while continuing to expand the range of contemporary art and design, both locally and internationally. The Biennial Program will continue to shape how we think about and experience the world around us through a range of design and art, both now and in the future. I’m eager to collaborate with artists and designers everywhere in building on this history of collaboration and to prepare for the challenges and opportunities that the project will present.”\n\n\nThe New York City Department of Cultural Affairs (DCLA) announced today that it is launching a $1 million fund to support artists and creatives facing eviction from their homes by the Metropolitan Museum of Art (MoMA) in Manhattan. Among the organizations that will benefit from the initiative are Papaya Coalition, which aims to secure the future of the former Kinkade House on West Twenty-Third Street in Harlem", "The next Biennial should be held in the fall of 2020. This iteration will include the first Western archaeological excavation site outside of Asia, and will draw on the biennial’s own collection.The museum will also present its first joint exhibition with the newly established city of Rotterdam, which will include works by a group of artists from the region\u0097including Allen LeBlanc, Stijn de Grood, and Eric Madelin\u0097in the summer of 2022. The exhibition will be organized as follows:Themes in the show will be chosen by a committee chaired by Zbigniew Jęwiński, the director of the Fleur delah-Rémy, and comprising Mariko C. Lopes, the director of the Flemish Museum of Fine Arts in the Hague; Helene F. van der Vorst; and Christo, the director of the De Beers Museum in London, as well as the artists Øyvind Albrecht, Elisabeth Böttcher, Pia Camil, Caro Campo, Vito Cattelan, Anna-Sophie Charlotta, and Marianne Hlobo.\n\n\nThe International Association of Machinists’", "The next Biennial should be held in 2020, and the grand opening in 2021. The biennial will focus on art and philosophy and will be led by a select group of distinguished contemporary artists. The initiative is being organized by the 20th Century Museums Foundation (20’s) in partnership with the citizens of Venice, and will be led by curator Pierpaolo Battista, artistic director of the city’s Zona di Rivoli; Giacomo Foresta, the director of the Giangiacomo Arti; and Daniela Catellani, the secretary general of the Venice Biennale.The ceremony will take place at the Villa Borghese, the official residence of the Italian prime minister, Angelino Alfano, in Venice, Italy. Organizers are still working out the details of how the total cost of the exhibition will be funded and how the exhibition will unfold. Alfano said: “The idea of the exhibition came from the fact that everything in Venice is on the move. It is a question of how to create space for different visions.”\n\n\nThe Orthodox Jewish museum in Paris has received a donation of more than 2,500 works from the estate of the late Lebanese artist Walid Raad, including", "The next Biennial should be held in 2021. David M. Peiffer, the president and CEO of the City of Chicago, said: “We’re excited to support the work of our city’s artists, and especially artists in the South Side, who have been historically neglected by the city of Chicago. We’re committed to working with the South Side Artists’ Association, the South Side Cultural Alliance, and the South Side Arts Council to foster dialogue and discussion about the art and culture of our area.”The 2020 iteration of the Biennial will take place at the Arts Hub in Chicago’s Near North Side, in the Little Village of West Des Moines, the arts district of the city of Chicago, and will feature eighty artworks by twenty-eight artists. The 2019 edition of the event was co-hosted by the City of Chicago and the South Side Cultural Alliance and included work by thirty-five artists. The 2018 iteration of the event, which was held in the city’s West Town neighborhood, featured work by seventy-eight artists. The 2017 iteration of the event, which was hosted by the City of Chicago, attracted more than eight thousand visitors.\n\n\nThe Los Angeles County Museum of", "The next Biennial should be held in 2021. The pavilion will have a new design and will be inaugurated with a new work by artist Yu-Chun Lee. The exhibition will be curated by China’s director of contemporary art, Xi Jinping, and will be curated by the Shanghai-based firm CAA Architecture. The pavilion will also receive funding from China’s National Development and Reform Commission (NDRC), an organ of the Communist Party, and will be inaugurated on March 6. The biennial will include works by twenty-six artists and will begin hosting in 2021. Responding to the announcement, Jeff Feltman, a curator at the Shanghai Museum of Fine Arts, said: “This is a very exciting time to welcome the second Biennial to Shanghai. The theme of the exhibition is ‘humanity,’ and its exhibition will be an opportunity for a number of artists to work together. The pavilion will be a forum for the exploration of the themes of the exhibition and the future exhibition of an original selection of work.”\n\n\nThe state-run art museum in Beijing has suspended the exhibit “Humanity in Transition: Art and the Humanities in the Twenty-first", "The next Biennial should be on September 9.\n\n\nThe Metropolitan Museum of Art in New York has released a set of guidelines for how institutions should respond to demonstrations of opposition to their construction that arose in the wake of George Floyd’s death. The guidelines, issued by the museum on August 31, outline how museums should have addressed recent events in Floyd’s name, and how they will continue to address Floyd’s legacy should the invitation be extended to him.The guidelines were developed after a number of exhibitions, including “Taking to the Streets: Art and Protest in the 1960s” and “Paul and Marilyn: Work and Protest” (2019), were canceled or postponed due to the health crisis, and the museum’s collection has been battered by demonstrations in the past. The guidebook suggests that museums take steps to prevent the recurrence of such disruptions, such as conducting background investigations into former employees and conducting outreach to the public to learn about support services available to Floyd.One section of the document that concerns me most is this section: “Museum Policy. . . .must address the specific and ongoing police violence experienced by Floyd’s community. This includes specifically considering the specific needs of the Floyd", "The next Biennial should take place in 2021 and will inaugurate a new research center dedicated to the history of American art and the twenty-first century. In the process of doing so, the museum will host more than one hundred exhibitions devoted to art history and will host a number of narrative presentations that convey the biennial’s contemporary significance.The exhibition’s program, which was commissioned by the museum in partnership with the artist-run nonprofit organization the Collaborative Arts, will include a series of concerts, performances, workshops, lectures, and a number of video presentations. Titled “An Incomplete History: Art and the American Experience” and written by Hannah Arends-Hanna, the director of the Taipei Biennale, the exhibition will feature artworks that commemorate the “end of the colonial era,” “the contemporary emergence of American art,” “art history as the great generational transition,” and “the role of art in bringing about social change.”\n\n\nFrieze has released the list of twenty-six artists who will receive a retrospective at the Metropolitan Museum of Art in New York in the spring of 2020. The artists selected for the triennial exhibition are:", "The next Biennial should be held in 2022, the Swiss curator Joachim Jakobsen has said. The exhibition is currently on display at the Museum Kunst Basel Berlin.  Last year, the Swiss authorities removed a work by the artist Philippe Starck from its premises after authorities determined that it contained traces of the pesticide DDT. According to the Art Newspaper, by the late artist's will, the work is temporarily closed, and the Museum of Modern Art in New York is preparing to open a new exhibition dedicated to Starck in the fall of 2021. \n\n\nThe Institute of Contemporary Arts (ICA) in Chelmsford, Massachusetts, has received a gift of four artworks from the Charles and Lucille King Family Foundation. The nonprofit organization, which was established to administer grants and support arts projects in cities and towns throughout Massachusetts in 2016, received the works as part of its “Mid-Atlantic Landscape: Historic Landscapes” initiative. The gift includes a large-scale installation of work by artist Mark di Suvero, a large-scale ceramic work by artist Greg Colson, and a photography and video work by artist Peter Wollen—all works that are part of a collection that includes works", "The next Biennial should be up in the spring of 2021. The first was held in January 2021, and the last was held in March 2019. If all goes according to plan, the Art Newspaper reports that the exhibition will run from March 21 to March 28, with the first show taking place at the BioArt Gallery in Seoul, which is located on the first floor of a five-story apartment block in the central district of Gyeonggi Province, and the last show featuring work by artists from the United States, Europe, and Japan. The first exhibition will focus on Latin American artists and will showcase work by thirty-four artists from the Americas and Oceania. Among the artists chosen for the first show are Mierda Alvarez-Perez, Marciano Bravo, Andrés Foner, Carlos Girolamo, Laguna Maderas, and Nydia Paz. The second show is titled “Polarization: Art, Politics, and the Struggle for Civility” and will feature fifty-two artists from the Middle East and North Africa. The final show will feature “The Descent of Man: The Visualization of the Fall,” a retrospective organized by Marco Bellardi, José", "The next Biennial should be held at least every four years. It will be a combination of lectures, workshops and concerts. The theme will be “Life and Human Performance.” French philosopher and avant-garde artist Simone Lethem once noted that “Life is the performance of life.” In contrast to modern day life, the Biennale will be structured as a “center.” Kirby and Merri have collaborated on the design of various installations here, including the studio-set Artistic Encounter. The biennial is also cofounded by Kirsten Everett, the emerita director of the Centre Pompidou in Paris, and the late French architect Georges Aposté, who helmed the new institution in Paris. The new location for the exhibition is a former French commune in the UNESCO World Heritage Site of Bordeaux.\n\n\nThe University of California, Berkeley, has appointed David Shepard as its next president and CEO. Shepard was selected from a shortlist that included David Geffen, Alex Gilkes, Jonathan Johnson, and Carol Berkowitz. He succeeds Stacy Kostar, who has served as interim leader since September 2019, and takes the post", "The next Biennial should be held in 2021.\n\nThe next Art Basel Miami Beach is slated for March 2021. It is currently still being developed, and the date will be announced as the event draws near. In the meantime, the museum will continue to host events and exhibitions on its collections and on the museum’s ongoing research into the art of nineteenth-century art. “We are working hard to present the most exciting exhibitions possible,” said Mark Duggan, the director of the museum. “The first exhibition will be the exhibition ‘Unsculpted: From Europe to America’s Art and Art History,” which will open in April and will feature works by twenty-six artists: Carsten Abel, Amal El Khoury, David H. Koch, Hélio Pertuz, Krystle von Danzig, David Salle, and Alex Spezial, among others. In addition to the works on display, the museum will host the first-ever show devoted to the work of the artist Max Ernst and include works by a wide range of artists in the 2020 Biennial, including John Akomfrah, John Jackson, and Beholda.The exhibition will also introduce", "The next Biennial should aim to raise $6.5 million for the museum, which has a permanent collection of more than five hundred thousand works and is currently the home of the Museum of Art. The new event, titled “The Bop,” will take place at the library, which is currently undergoing a $3.5 million expansion, and will open with a performance by the biennial’s artist-in-residence, Miles Kane, in the lobby. The museum will be closed through June 25.\n\n\nThe Swedish Museum of Modern Art (Skulland) in Stockholm has announced that it is planning to reopen to the public in April 2020 following a $3.1 million renovation. The opening of the institution will be marked by a “SID-1,” a new sculpture garden that will include a new public gathering area, a new concert hall, a new shopping mall, and a new visitor entrance. The renovation also involved the establishment of a new public library that will be located in the museum’s former location in the city’s southwest.“The renovation of the museum is a response to the demands of the public for more intimate exhibitions of contemporary art, more accessible exhibition spaces, and", "The next Biennial should be held sometime in the second half of the year, as previously agreed. “The Biennial has been a source of inspiration for me and my work since I began, and we are currently renewing it for another twelve years,” said artist-in-residence Janice Ng, who has performed at the ceremony every year since 2000.\n\n\nThe London-based artist Nima Arsht is under fire for removing a mural by her before and after work in order to promote a new book. The work, Constructing Eve: Modern Art and Feminism in the Late Eighteenth Century, was completed in 2015 and was dedicated to Evelyn de Beauvoir. De Beauvoir is one of the few surviving artists to have painted a work dedicated to the iconic French feminist icon, and it features a bust of the 1960s French queen, Christine Legrand, whom de Beauvoir collaborated with to produce the book.De Beauvoir’s work was also included in the exhibition “Feminist” at the Museum of Modern Art in New York in 2018, and her work was featured in “The Works of Nima Arsht,” a major retrospective at the Institute of", "The next Biennial should take place in the fall of 2021. \"The importance of the exhibition is to connect with and to build on the exhibition’s first exhibition and to re-create an experience that was never staged before,” Giannini said in a statement.Commenting on the upcoming exhibition, which will be curated by the Italian-American architect Marabar, they said: “The Biennial is an extension of the themes of the festival: the development of new ones. It is an invitation to show the world what we are capable of doing. It is also an exercise in reflection and dialogue with the exhibition, a contest of the true.”\n\n\nThe Center for Contemporary Art (CFA) in London announced today that, in its eleventh edition, it is postponing the event for a total of four years. Originally scheduled for March 15, 2021 to March 15, 2022, the show will be rescheduled for March 17, 2022.“We had hoped to present an exciting and radical new series of exhibitions, but the serious health problems which have afflicted our artists and staff in recent weeks have made us reconsider the future,” said Kim Martin, director of the CFA. “The exhibition", "The next Biennial should be held in 2021.\n\n\nFrench artists have named the twenty-ninth winners of the Fifth International de Lettres Artes, which will take place in the city of Lyon in France in May 2020. The twenty-six artists who will represent France at the event are Ai-jen Poo, Claire Emmerich, Tarek Atoui, Jason Isgro, Yohan Cohen, Nadia Jaroudi, Rachid Rabad, Aleksandar Mamy, Nima Nabavi, Adam Rubay, and Sohrab Mohebbi.The jury in choosing the artists for the prestigious award included artists Mervyn Leith, Marcin Wojtas-Zajac, and Reem Akram.\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Nick Ut as its next dean of arts and design. Ut will be responsible for leading the museum’s design and design-inspired categories, such as design and design-based exhibitions, and will take the helm of the institution from Mary Anne Carter, who has served in the role since 2015.“Nick is a versatile, talented, and broad-minded leader who brings an extraordinary range of knowledge and", "The next Biennial should take place in 2020 at the København Space in Copenhagen from January 29 to February 2, 2021.\n\n\nThe Museum of Modern Art (MoMA) in New York has received a major gift of more than 1,800 artifacts from the Kuru Group, which has been working toward the acquisition of approximately 4,000 artworks by artists such as Pablo Picasso, Willem de Kooning, and Hetain Mor last year. The museum also recently purchased the work of Pablo Picasso’s nephew, Kambiz Giri, and the artist Olu Ojo.“After a thorough search of our collection, we chose to sell the works in our collection to the Kuru Group,” said Artnet editor in chief Julie Iannone. “The work of Kuru is an outstanding collection and we are proud to have contributed to its history and to have sold work by the greats to the Kuru Group. We are grateful to our clients for their understanding and support throughout this process and for the opportunity to share the Kuru Group’s collection with the general public.”The Kuru Group’s acquisition of the works began last March, with the foundation", "The next Biennial should be held in 2021, with the first exhibition in 2021. The next exhibition should take place in 2022, and the last exhibition in 2022.In a letter addressed to the jury, the organizers wrote: “The overall theme of the forty-sixth Biennial is the merging of art and technology. We aim to create an experience that is inspired by the feel of the atmosphere and the materials that are combined with art. We are also committed to a new spirit of collaboration between art and technology that will address the challenges inherent in the digital realm.”They went on to say that, after a thorough assessment of the exhibition, “we believe the themes of the exhibition form are complementary and complement each other. It would be an insult to the art world and the legacy of the Biennial to exclude the idea of an open and free competition in the art world.”The twenty-first Biennial will be held in 2021, with the opening of an exhibition of work by artists Joachim Neumann (New York and London), Leslie Jordan (New York and London), and David H. Loyer (New York and London), among others.  The twenty-third Biennial will be held in 2021, with the opening of", "The next Biennial should be held at the Museum of Modern Art in New York, which has been planning to move its current exhibition space, the Georgia Museum of Art, to the city. A third exhibition, “Beyond the Frame: Painting in the Age of Alfred Stieglitz,” will also open at the Atlanta Museum of Art in August. \n\n\nThe Philadelphia Museum of Art (PMA) has received an unexpected gift of more than four hundred photographs by the late American photographer and activist Vinnie Bagwell, who championed anti-racist and anti-imperialist causes. The works, which were donated by her daughter, Victoria Bagwell, are currently on display in the museum’s exhibition “Legacies: Photographs from the Painted Land,” which opened on March 24.Bagwell’s work, which was often used as a source of inspiration for Black feminist and anti-imperialist activists, was also instrumental in the formation of the group P.A.I.N. (Prescription Addiction Intervention Now), which fought for the federal legislation that made the war on drugs a public health crisis.Her final years together with her daughter were filled with photos that reflect her spirit and her insight.", "The next Biennial should take place in a museum with a dedicated exhibition space dedicated to the artist’s work. The Biennial is the universal language of art for all people, enabling them to participate in the work of the artist without having to leave their homes.The exhibition will also include a dedicated mobile phone and digital content studio for the exhibition. The new platform will be powered by the artist’s own personal resources, and will work in partnership with the artist through a platform which will offer the artist user-generated works.\n\n\nThe Royal College of Art (RCA) in London has appointed Ariana Corbett as its new deputy director for curatorial affairs. She will be responsible for the development and execution of the institution’s current programming, which is currently carried out by the college’s existing arts and design department, and will take up her new role on September 8.“Aria is a world-class curator whose curation has helped to define the role of a curatorial arts and design department within the college,” said Simon Lawrence, chair of the college’s board of governors. “Her curation of the exhibition ‘The Future Is Now’ is exemplary and demonstrates her ability to", "The next Biennial should take place in 2019, when the pavilion will be completed. Sculptor Patricia Ahearn, who has been a passionate supporter of the museum for twenty-five years, said, “As the biennial director, I continue to work with our talented, dedicated team to design and present a piece that the world will truly love.”\n\n\nThe Victoria and Albert Museum in London and the Tate Britain in London will launch a new exhibition dedicated to the life and work of American painter Layton Marlborough. Titled “Away from the Frame,” and curated by artist Paul Mpagi Sepuya, the show will open in January 2021 and run through March 2022.Based on Marborough’s 1975 painting The Frames, Away From the Frame—a series of stationary paintings that address themes of landscape, frame, and light—will explore the idea that composition, not just painting, can capture the essence of the natural world. “Marborough’s paintings are wonderfully alive,” said Tate director Maria Balshaw. “They are full of playful and hopeful interplay, and of a keen awareness of the world around us. Marborough�", "The next Biennial should take place in the autumn of 2020. David DiStefano, chair of the board of trustees of the Museum of Contemporary Art (MoCA), said: “The concept of an exhibition as important as ‘Art’ at its highest level is a challenge that we have collectively struggled to imagine and conceive. ‘Art at its highest level is both a reflection of and a response to the world we live in.”The museum will also reconfigure its existing holdings to make them more accessible to the public. The renovation will increase the museum’s exhibition space by fifteen feet; add new programs and exhibitions, including a scholarship and a community-based design; and add more than 250,000 square feet of exhibition space.Commenting on the renovation, Richard Armstrong, chair of MoCA’s board of trustees, said: “The new vision for MoCA, which includes a reconfigured collection, a modernist architecture and design, a modern design for the building, and a modern design for the collection, is a worthy reflection of all the museum’s achievements in more than twenty-five years.”\n\n\nThe São Paulo Bienal (SPB) has launched an", "The next Biennial should take place in the spring of 2021. “The visual arts are indispensable to our daily life,” said organizer and former director of the National Museum Daniël Azoulay. “This is the time for the national collection to be on display, to be studied and to be experienced. The exhibition should be a starting point for visitors to explore the museum’s collection and the director to present a new collection.”\n\n\nThe National Poetry Library (PoLL) in Washington, DC, has launched a new digital platform that will allow poets to share their poems, audiocassettes, and other materials with a worldwide network of over 1,300 artists and their supporters.The platform, which will be integrated into the PoLL app, will include a secure area for writers who need to borrow or print material and will offer free public access to works by selected artists. The platform will also include a community forum where poets can share audio recordings, audio scripts, and video recordings. Artists will be able to upload poems and audio recordings to the platform and other resources, such as on-line platforms, and will be able to post comments and questions about works in the platform.The platform was created by artist", "The next Biennial should take place in 2020, and it may be that the Rubell-Pereira–designed exhibition hall will be finished by 2021.\n\n\nThe Musée d’Art Moderne in Paris and the Musée d’Art Paris have announced their intentions to rename their locations in honor of the two women who are currently imprisoned in France for allegedly participating in the June 14 terrorist attacks. The announcement was made on Wednesday, and can be read in French on the two institutions’ websites.“We are thrilled to have the opportunity to contribute to the memory of the two victims of the attacks, Amedy Coulibaly and Rachida Salhi, and recognize their contributions to art as well as strengthening their voices in the medium and beyond,” said Musée d’Art Moderne director Audrey Condon. Rachida Salhi, the wife of one of the three brothers who were killed in the terrorist attacks, was awarded the Order of the Legion of Honor in Paris last September. The award was made in recognition of her contributions to art and culture.  “The closeness of their families and churches makes it easy for their pain,” the museum said in a statement", "The next Biennial should take place in 2021, and are currently working on a new schedule. Jürgen, who is fifty-eight, studied at the University of Graz in Austria, where he received his BA in 1954, and Columbia University in New York. He also taught at the University of Wisconsin–Madison, where he received his MA in 1955, and the University of Salzburg, where he received his PhD. In a letter dated April 7, 1963, he wrote: “I have always believed that the cultural heritage of the West is the heritage of man, that it is the natural heritage of the human species. It is the heritage of the European people.”\n\n\nFollowing the tragic terrorist attack in London on Thursday that killed four people and injured hundreds more, and that may have been prevented had the authorities taken immediate and decisive action to contain the threat posed by the UK’s large-scale cannabis trade, the UK announced that it plans to raise the legal age of purchase of psychoactive substances from sixteen to eighteen.The move will put an end to a major legal black market in cannabis, which is currently sold legally in twenty-four states and the District of Columbia, and will also give the police the power to make arrests", "The next Biennial should be held in 2020.  The venue will be moved to a new exhibition space in the city. In a statement, the venue said: “We are working towards a new history, one which will integrate the past and present with the aim of recognizing and protecting the city’s cultural heritage. We are not yet certain about the timeline, but we will work it out and present it as best as we can.”\n\n\nThe collection of the Los Angeles County Museum of Art (LACMA) is preparing to reopen with a new exhibition, “Unfinished Business: Long-Term Perspectives on Cinematography,” which will explore the legacy of Werner Herzog and Werner Strache, the German director of the legendary “City of Angels,” a 1976 four-hour documentary that depicts the rise of the Los Angeles-based Los Angeles Film Festival and the passing of Herzog and Strache\u0097together known as the X-Men.“We are thrilled that the opening of the exhibition was delayed as we had hoped,” said LACMA director Daniel H. Weiss. “We hope that the documentary will stimulate new conversations about the X-Men and the performance and collaboration that", "The next Biennial should conclude with a presentation of the work of the year’s most remarkable artists, perhaps including the Egyptian sculptor Khaled Hossein’s monumental The Book of My Father, 2017, which is currently on display in the exhibition “Hemispheres: The Intersection of Art and Science,” the inaugural exhibition of the Fifty-First Biennial.Artforum has invited two artists to participate in the festival in order to better understand their respective practices and to explore the intersecting themes of the exhibition. The first exhibition, “Between the Star and the Sun” (2019), will feature works by the Russian and Egyptian artists Daphne Atreiba and Salah Atreiba, respectively. The second exhibition, “The Story of the Streams,” will feature works by artists such as Paul Gauguin, Clement Greenberg, Joan Miró, Paul Sender, and Robert Irwin.Commenting on the theme that the exhibition will center around, the artists said: “We begin as if from a place without any destination. Everything is interwoven and connected. In this way, the exhibition will address the concept of space, the concept of time, and the concept of the stream.", "The next Biennial should be held at least once a year. This has been the theme of this year’s show, which is accompanied by a new exhibition of works by artists who have been selected for the 2019 edition.“This is a moment of great change for our world,” said Sophie Herschel, Director of the National Gallery, Washington, DC. “In the opening of the exhibition the artists created new work that addresses urgent social issues, from climate change to economic inequality. We are in the process of creating a new exhibition focusing on the themes of art and climate change that will reflect the current moment, and will challenge the usual assumptions about the role of art in our society.”The 2019 show consisted of work by eighty artists from twenty-six countries and thirty-six cities. The event was organized by the Nanjing Biennale Foundation, and was curated by biennial director Jiang Guangdong. The show opened on November 3 and runs until March 3.\n\n\nThe National Gallery in London has appointed Sarah Anagnos as its new deputy director. She is the third person to lead the museum since its closure in 2022. Howard Crowther, who has served as interim director of the National Gallery for over a", "The next Biennial should be held at the newly renovated Marina Bay Sands in Dubai from June 6 to June 10, 2020. With the opening of the biennial at the city’s Marina Bay, the UAE will become the first country in the world to host the twenty-first edition of the West Asia pavilion, which will take place in the United Arab Emirates at the Marina Bay Sands.Dubai’s Marina Bay Sands will be inaugurated with a presentation of the works of artists such as Tarek Atoui, Saleh bin Ali, and Amira Ganesh. The pavilion will be accompanied by a new exhibition, “The Future of Art,” and two concerts, “Gabriel García Márquez’s ‘In Defense of Life’ and “Sam Francis:”Participating artists will be announced in the coming weeks.\n\n\nThe Metropolitan Museum of Art (now the Museum of Modern Art) in New York has announced that it is awarding $2.5 million to forty-six artists for their achievements in their respective categories this year. The $2,500 prizes will be given in the form of a $100,000 grant. Qualifying artists include David", "The next Biennial should take place in 2021, and the 2019 and 2018 editions will be on view in 2021 and 2021. The museum will coordinate with the participating architects in Beijing, and the artwork will be curated by the artist himself.  \n\n\nThe 10th edition of the Barcelona Biennial, which was canceled last month due to the coronavirus, has been rescheduled for March 15–March 22. The venue will now be held in the city from 2021 to 2024.“It is with great disappointment that we announce the cancellation of the next Barcelona Biennial,” said Rebecca Procter, chair of the exhibition’s artistic committee. “The biennial’s artistic director, Isabel Staveley, explained that the decision was made in light of ‘the contagion’ and the delays of the biennial, and in light of the fact that the biennial’s 2020 edition was originally scheduled to take place in September.”Los Angeles’s Metropolitan Museum of Art, which canceled a March show about the 1967 hijacking of a United Airlines jet, is returning the favor by opening a new museum dedicated to the late American photographer Robert Irwin. The new venue will be named the Robert", "The next Biennial should take place in the autumn of 2022, and the final will take place in the spring of 2023.”\n\n\nThe National Gallery in London announced today that Nomaa Sadat, who was ousted after a tumultuous six months as director last September, will return to the institution in October for its next edition. “Nomaa’s inclusion in the next edition of Tate Centenary will mark an important moment in the museum’s history, as we approach the centenary of one of the most important artistic moments of the twentieth century,” said Simon Lewis, director of Tate Britain. “Nomaa’s tenacity, passion, and intelligence have been central to our strategy for the past six months, and it is through her that we hope to achieve our ambitious vision of transforming the National Gallery into a truly international cultural institution.”The National Gallery made the announcement after a year of promoting Sadat to the role of director. She succeeded Tony Buck, who was dismissed last spring after a tumultuous year that saw him appointed curator of modern art and design and lead of the Jumeaux-Maréchal-des-Prés exhibition. Dubbed “The Experiment,” the exhibition", "The next Biennial should focus on the history of art in the Americas, with a particular focus on the displacement of Indigenous art and materials. “The exhibition is about how art is channelled through time and space for much of our history and how that channelling can be sensed and experienced through art’s own bodies,” said Fernanda Varejão of the City of Edinburgh. “Themes of colonialism and the diaspora are also explored through the exhibition’s installation, making it a space for radical dialogue and thinking about our place within the world.”The 2019 event, titled “Between the Sun and the Moon,” will be hosted at the National Art Museum (Namaya), Abu Dhabi; the Museum of Contemporary Art (MoCA), Los Angeles; and the Museum of Modern Art in New York.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Sharon Ritter as its new associate curator of photography. Ritter will be responsible for developing and exploring new and current approaches to photography and photography culture in the United States. “Sharon Ritter’s curating history spans fifteen years at MoCA, and spans both the global and locally", "The next Biennial should include a presentation of work by artists whose practice is represented by the institution. The exhibition will be organized as follows: “Thematic,” beginning March 20, and running until March 24. The next exhibition is slated for March 24–March 27.  The next exhibition will be the first for Hanna-Barbera’s new space, the Renaissance Society, at Columbia University, New York. The venue will highlight new work by American artists, including Aaron Siskind, Peter Wollen, and HUSSEIN HARVEY, and will present the work of the newly appointed curator of African and Islamic art, Gisela Neugroschel, who will co-curate with leading American artist-historian Judith Robertson. Neugroschel and Robertson will serve as the MC for a retrospective of artist V. S. Gombrano’s work, “Climbing the Tree of Art.”The biennial’s curator, Elizabeth Tognotti, will serve as the event’s cochair. The exhibition will take place at Hanna-Barbera’s new space, the Renaissance Society, in Manhattan and will run for twelve weeks.", "The next Biennial should be in 2020 and will be the tenth edition. A retrospective of the Dadaist movement, which first opened in 1992, will be staged at the Athenaeum in Athens in December 2020. The exhibition will exhibit a selection of work by contemporary and classic artists, including Pierre Huyghe (1903–1987), Alexander Calder (1907–1988), and Ed Moses (1908–1988). The exhibition will also include performances, documentaries, and other programming that include interviews with artists like Alfred Koons, João Miro, and Wolfgang Paalen.\n\n\nCoca-Cola Bottling Co. announced today that it is working with the German government to establish partnerships with local, regional, and state governments across its 120-year history to create a new $1 trillion fund for the promotion of craft and craft production. The German government pledged $960 million for the initiative, which will prioritize capping corporate profits at $1 trillion and creating new incentives for the production and marketing of beverages in 2020, and Coca-Cola said it expects the new fund will support approximately two thirds of the $1.2 billion set aside for “craft and craft production.”Led by entrepreneurs and curators, the", "The next Biennial should be held at a location that represents the creative spirit of the city of New York. We will work with the city to make this happen.”To apply for a spot at the museum, visit the Biennial website here. The Biennial is also organizing two related events, the first being the biennial/disco-fest Ghetto Pride, which will take place at the Museum of the City of New York on the first weekend of February, and the second being the editions of the biennial exhibition, Introducing the Biennial, which will be on the museum’s campus from April 7 to April 10. The biennial exhibition, which will feature more than seventy contemporary artists, will be a retrospective of Adam Hollander’s introducing the festival, which was staged in the fall of 2013. Adam Hollander was selected as the winner of this year’s DRAWING FOR LESS prize by a jury comprising artist and curator Jen Thiessen, Brooklyn native Allison St. Vincent, and curator Elias Núñez.The prize jury also nominated four artists for the biannual Artist Award, which was established in 2011 by", "The next Biennial should take place in 2021. 1:30PM will previously present the research and the first-person firsthand accounts of the death of Palestinian artist Mahmoud Abu Khdeir, who was crucified by Israeli forces in the West Bank city of Ramallah on February 19, 2018, and another Palestinian by Israeli forces in the East Bank city of Nablus on February 13, 2019, formerly known as the Nakba biennale.In a joint statement by the organizers, the Minister of Culture and the Minister of Education, respectively, the director of the Palestinian Museum and the head of the National Museum, Ahmed Gharbi, said that the Biennial will \"remain a joint project between the Palestinian Museum and the National Museum, in collaboration with the Palestinian Authority, the Palestinian Library, and the Palestinian Center for Studies, in order to strengthen the Palestinian diaspora as a source of inspiration for young people and creative professionals from around the world.”The Nakba, which came to an end on February 13, 2019, was an uprising against Israeli occupation. The uprising was sparked by the murder of Palestinian toddler Hussein Abu Khdeir, who was crucified by an Israeli army bulldozer in the West Bank city of Ramallah on February 19,", "The next Biennial should be held in 2020. The organizers say that a new exhibition of works by contemporary artists will be presented in 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Walter de Maria as its next president and CEO. In his new position, de Maria will oversee the health of the museum as it prepares to reopen and will guide the institution through its next five-year capital campaign.“After several years as president, I’m very excited to see how the Museum of Contemporary Art (MoCA) will impact the city with unique and creative programming that reflects the vibrant spirit of Los Angeles,” de Maria said. “The institution’s concept of a museum as a public space that not only hosts but also inspires and cherishes the art of the future is exciting. I’m looking forward to working with the dedicated staff and the dedicated patrons at the Museum of Contemporary Art to deliver on that vision for the city.”Prior to joining the institution, de Maria served as the head of the Los Angeles County Museum of Art (LACMA) and as deputy director of the Tate. He was instrumental in the reinstallation of the museum’s collection and was instrumental in", "The next Biennial should be held in 2020.<|endoftext|>Singer-songwriter Jennifer Schubert, who most recently served as the artistic director of the Brooklyn-based nonprofit Run for Something, has died at age fifty-eight. She was ninety-four.Born in Brooklyn in 1941, Schubert grew up in a Jewish family, and studied at the Jewish School (now known as Yeshiva University) in New York before beginning her career as a songwriter in the late 1950s. Her first solo album, 1993's Import/Export, was nominated for a Grammy in 1993 and was certified platinum in 1997. It is also notable for its ambitious design, its use of ethnic and racial motifs, and for its grandiosity. Schubert’s 1998 retrospective at the Museum of Modern Art featured a painting by Richard Diebenkorn, a masterful abstraction of rivers, seas, and continents. In 2011, she was chosen to represent the United States at the Venice Architecture Biennale in Italy.Schubert’s career as an artist was cut short by the AIDS crisis in 1983. She went on to record two more albums, 2000’s “Picture of the Life I’ve Had,” and", "The next Biennial should be held sometime between the dates of April 11-April 14, 2020. The first show, “Ainsley/Hirson,” will be held at the Broad, where it will be on view until March 29.\n\n\nThe Robert Rauschenberg Foundation (RFA) in New York has acquired the estate of the late American artist, whose work fused photography, sculpture, and performance, and is currently on display in the museum’s exhibition space. Founded in 1904 by the German-born Rauschenberg, the foundation provides funds for exhibitions in support of art and photography scholarship. The acquisition is part of a larger initiative to support the legacy of the late American painter, whose impact extends beyond his own lifetime. “The foundation is committed to preserving the legacy of Robert Rauschenberg as a major force in twentieth-century American art,” said Nancy Wechsler, director of the Robert Rauschenberg Foundation. “This acquisition will make a wonderful gift for the gallery. We are confident that this will be a landmark year for Robert’s work, and we look forward to collaborating with the gallery to present the work in the fall.”The estate", "The next Biennial should be titled “Moments in Time.” The next exhibition should be titled “This Is Not an Artist”; and the next one should be titled “Thinking Through Art”. In a letter dated December 23, Kim wrote: “Although the work of the museum was founded for a specific purpose, it has become a part of our daily life, and the work is reproduced in every museum. We are all responsible for the outcome of the exhibition. When something is not in accordance with the artistic vision of the biennial, we have the right to change the exhibition. We mustn't allow the exhibition to be a kind of a model for the exhibition.”Kim was referring to the 2014 exhibition “The Wound: A Biennial History,” which was organized by the Beijing Center for Contemporary Art (BCCA), and not to the exhibition “Moments in Time,” which was organized by the National Museum of Modern Art (NMMA) in Seoul.Vincent van Gogh made a huge impression on his wife, Sophie, so much so that he eventually gave her custody of their son, Theo, and gave her a transfer to his academy in the Netherlands", "The next Biennial should be held in the first half of 2020 and will announce a new theme and a new academic scholar in the spring of 2021. The 2018 exhibition “The Concrete Floor,” which was hosted by Tate Britain and curated by David Blaine, was also recently canceled and will be replaced by a new exhibition titled “The Future Is Now.”\n\n\nThe National Portrait Gallery in London announced today that Louise Bourgeois has been named the winner of its 2019 and 2020 Lifetime Achievement Awards. The biennial, which was established in 1957 and 1968, recognizes an artist’s lifetime achievement, an achievement which was achieved before the artist’s death.Bourgeois was nominated for Lifetime Achievement in the first year of its inaugural award cycle and was selected for Lifetime Achievement in 2019. She was met with overwhelming support from the audience, who voted in favor of her nomination for the first time in its 20-year history. The biennial will also present the first retrospective dedicated to Bourgeois in London in 2021, and will be held at the museum until December 20, 2020.“Louise Bourgeois is one of the most important female artists of contemporary art and one of the most important contemporary artists of her generation,”", "The next Biennial should be held in the spring of 2020.\n\n\nThe National Gallery of Art in Washington, DC, has enlisted artist-in-residence Cecilia Taveras to create a new digital series exploring the role of the East and West in the painting of the American West. Titled “American Painting,” the exhibition will consist of eighty works by seventy-four artists and will highlight the aesthetic and philosophical approaches of Naima J. Keith, Richard A. Miller, and Joseph Beuys.The show will also include the first public exhibition of work by the artist-in-residence, who has been featured in various exhibitions and residencies around the country. “This is our opportunity to learn from the artists, to understand their process, and to receive their thoughts in a way that we can all have a sense of belonging and a sense of part of the national story,” said Allen Nisbett, the museum’s director.Taveras’s work is a continuation of a long-standing project that began in 1978, when she painted a portrait of Naima J. Keith in the artist’s native Ecuador. In 2013, she set up the National Gallery of Art�", "The next Biennial should be held in 2020. \n\n\nThe São Paulo Biennial of Contemporary Art (P.A.F.C.A.) has announced that it will postpone its 2019 edition, which was set to run from the Museum of Modern Art in New York, until at least March. It will also reschedule the twenty-fifth edition to take place in June 2020. In a statement, the organization said: “The postponement of the events and exhibitions of the twentieth edition is a great success, as it will allow us to present the ‘20/21’ show in July 2020.”Founded in the early 2000s, the exhibition was inspired by the early-twentieth-century Brazilian architect Jacol Miro, whose works are often remembered for their utopian visions of urban environments that were shaped by him. The exhibition, entitled “Para/Architecture/Portuguese—A Retrospective,” was organized in collaboration with Simon Miro, the curator of contemporary art at the Museum of European Art, and José Carlos Lopes, the director of the Museu de Arte de Fortaleza. The five-month program will take place at the Contemporary Art Museum in", "The next Biennial should be held in 2021, and the first in 2022. \n\n\nThe Museum of Modern Art (MoMA) has invited artist Peter Dreher to join its board of advisors for the next twenty years. The thirty-three-year-old Dutch-born artist first became interested in the biennial system in 2006, when he was working on a retrospective of the fourteenth edition of the Venice Biennale, “The Sorrows of Young Women.” Since its inception, the program has awarded more than $2.5 million to more than sixty artists. Among those who will be represented at the institution in 2021 are Claude Monet, Carolee Schneemann, and Jean-Michel Basquiat.“We are fortunate to have a visionary visionary board of advisors who collectively has twenty years of experience in the art world,” said David Fusi, chairman of MoMA. “Peter has been a mentor to numerous artists over the years, and has developed a talent for bringing a new and innovative idea to life. He is a master at taking a concept and making it work in ways that unfold in the real world. I am honored to have this opportunity to work with him.”", "The next Biennial should be held in Sweden in 2022. The next edition of the 'Grand Master’s Art Tours' will be held in Japan in 2021. The next iteration of the “Generations Exhibition” will be held in Beijing in 2020 and the twenty-fifth edition of the “Art of Nature” will be held in New Delhi in 2019.The Shenzhen Biennale will be held at the Shenzhen Art Museum in Guangzhou, China, from November 14 to November 21. The exhibition will be led by anthropologist and critic Cui Jie, who will work with a group of artists and local activists to explore issues of sustainability and climate change.Cultural producer and art curator Wong Wei will serve as the theme of the exhibition. Wong is a Hong Kong native and a native of Guangzhou who studied at the Hsin-Chang University of Finance and Economics in Beijing. Previously, Wong worked as an independent curator and visual artist in Hong Kong and Hong Kong-China.Wang Yansong, head of the exhibition, said: “The exhibition will be inspired by the Chinese notion that art can transform the world. The artist’s concept of creating a virtual reality in the form of an exhibition,", "The next Biennial should take place in 2021 and will aim to present a new work every two years. The exhibition will be curated by Alex Kundera. The event will be hosted by the National Museum of Art and will be preceded by an exhibition of work by the American artist Shan Walker, which will open on Sunday, March 6, 2020. Additionally, the venue has committed to investing $3 million in upgrading its existing exhibition spaces and will be able to host more works in the workspaces of the National Museum of Art. The National Gallery of Art in the United States is currently constructing a new exhibition space that will host more than two hundred works in the workspaces of the National Museum of Modern Art in Washington, DC. \"This work is an extension of our engagement with the many artists who have shaped the Museum of Modern Art to reflect their respective eras and their respective visions for the institution as well as a new opportunity to engage with the National Gallery of Art and the National Museum of American Art in the greatest ways possible, with the understanding that this work will be a merging of the National Gallery of Art and the National Museum of American Art in Washington, DC, to create an entirely new cultural gathering place, a center of world heritage, and a new museum", "The next Biennial should take place at the International Center for the History of Art (ICMA) in Milan, Italy, from May 1 to May 5. Last year, the ICA was forced to cancel its fest after organizers discovered that the show Open Your Eyes was likely to feature work by twelve artists who were not represented. The ICA hopes to reconfigure its venue to accommodate the exhibition, which will run alongside the biennial, as a platform to bring together contemporary art and the former Soviet Union. Views of the exhibition are available online here. \n\n\nThe Institute for Contemporary Art (ICA) in New York has announced that it is increasing the pay of the board members of the Whitney Museum of American Art to $80,000 from $60,000. The appointment, which was made during a meeting of the institution’s board of directors in May, follows a number of moves in the institution’s history that have seen the compensation of board members increase. The board also voted to increase the salaries of its other executives.“The board’s decision to increase the compensation of the members of the ICA’s board is an important step toward ensuring that the board and the institution’s executives", "The next Biennial should draw from the lessons that have been learned from past exhibitions and should combine it with those that may be relevant to future exhibitions. The exhibition should deliver a clear and direct message that enables the public to understand the history of the exhibition and what can be achieved with new strategies.”The exhibition will begin with a new survey, “A History of the World in Cut,” that will showcase cutting-edge art. The work of the curated artists will focus on the history of the exhibition “from its beginning as a museum to where it is today.”The exhibition will then move to a new installation by the shortlisted artist Lamia Khawate, which will highlight the work of African artists. It will continue with a series of lectures on African art, “A History of Slavery” and “The Past and Present of Art in the African Diaspora,” and will conclude with the opening of the exhibition “As I Walk,” which will be open from March 4–March 7 and will be on view until March 15.The full list of participating artists is as follows:​\n\nThe Los Angeles County Museum of Art (LACMA) has received a gift of more", "The next Biennial should focus on the contribution of the visual arts to the development of contemporary life and culture, and should include a selection of works which attempt to address the main concerns of contemporary life—such as climate change and the environment.\n\n\nThe British artist-run news site the Guardian, which was launched by Elisabeth Farmington in 1984, has been sued by the estate of one of Britain's most famous heads of state, Winston Churchill. The lawsuit claims that the wartime prime minister abused his position as head of the UK’s Department of External Affairs to undermine the long-term artistic legacy of the late British artist-in-residence, Jane Birkin.“In my view, it is appalling that the Department of External Affairs would try to silence Birkin’s legacy by filing a frivolous legal complaint,” Clive Whittam, a London-based attorney who represents estate collectors, told the Art Newspaper. “This is a case of the government attacking a revered British artist, after he died, and trying to destroy a legacy. We hope that this case makes it clear that the government believes that attempts to silence the artist’s legacy are illegal.”\n\n\nThe Institute of Contemporary Arts (ICA)", "The next Biennial should be held in Helsinki in 2022, the organisers said.  The exhibition will be inspired by the history of the five islands of Finland, including Helsinki, the capital of Finland and the birthplace of the Finnish-born, American-born artist Lise Marie-Ducard, and will highlight the multidisciplinary history of art through the use of materials from Finland, Norway, Iceland, and Sweden.Dubbed the Finnish Pavilion, the exhibition will include works by fifty Finnish artists, including the late painter Janina Goolikka, whose work is currently on display at the Biennial of Finnish Artists, and will include photographs by the late photographer Carl Nielsen, who influenced many of the fifty-three artists who will be represented. The exhibition will also include works by the late sculptor Ylva Villekanen, whose works are currently on display in the museum.Commenting on the exhibition, Mikko Vuusu, director of the Biennale of Helsinki, said: “Once again the theme of this exhibition is that of life and its journey through the artworks. It is an exhibition which is about the possibilities of art for the collection, and about how the artworks can be used as a point", "The next Biennial should focus on the history of the exhibition and how it has influenced our continuing artistic and philosophical practice. We are open to the idea of a biennial that would be a collective project of the entire institution. I hope that this year’s edition will be a landmark for the institution.”For Palmquist, the biennial is not only about changing the museum, but about the history of the institution and the museum’s role as a cultural touchstone for the city of Chicago, the region, and the nation. “We live, breathe, and work in a city where the history of an institution is more important than ever,” she said. The next edition of the Palazzo Moscato will be held in March 2021.\n\n\nThe Smithsonian’s National Council on Curatorial Arts and Design (NCAAD) has released guidelines for the future of its exhibition “Feminine,” an eleventh-century feminist meditation on femininity, beauty, and sexuality, which was one of fourteen exhibitions on the history of art and design it closed in March due to financial reasons. The show opened to the public on March 16 and ran through March 21. It featured work", "The next Biennial should be held in 2021. The project, which was first announced in 2016, was initially conceived as a four-year endeavor. The draw for the 2020 event was initially held in June. However, due to the coronavirus outbreak in the region, the event has been postponed to March and will now be held in September.The biennial, titled “Unseen: The Art Gallery at Columbia University,” will feature works from seventy-eight artists, including Arsht Haji, Nari Ward, and Miera Akram, among others from thirty-eight countries, as well as one work that was originally entitled “Illusion in Action” and subsequently selected for the exhibition.A selection of works by twenty-three new artists will be presented in the 2019 exhibition. The show will feature the work of Tamara Boland, Rae-Anne Charlotte, Julie Chiu, Adrianna Faria, David Goldblatt, Aline Horvath, and David Henry.\n\n\nThe Silmaruarium, the National Museum of the Arts in Washington, DC, is launching an initiative to introduce more than two hundred new works by forty-eight contemporary artists who are currently underrepresented in its collection. The", "The next Biennial should take place in the spring of 2021 and will be led by Ozi-Olivia, which will present a diverse collection of works on the human body and the environment in the city of Memphis. While the theme of the biennial will be “performative art” and the exhibition will focus on contemporary artists, it will also be a platform for artists to collaborate with other artists.The subject of the Biennial is a sensitive subject for the city of Memphis. A recent August 12 Artforum article describes a number of acts of violence that took place in the city prior to the outbreak of the Covid-19 outbreak. While the art was notably damaged by a fire that broke out in a nearby industrial building, the violence was not until the day a Biennial was held in conjunction with the pandemic. “We do not want people to think that the Covid-19 pandemic is the only cause of crime in America,” said Mayor Jeff Infiltrant, who added that the city is doing all it can to encourage development and fight the virus. The biennial is accepting entries for its second edition, “Welcome to the Biennial,” that will be", "The next Biennial should take place in 2023, and the original will return in 2027. The next edition of the Exhibition will be held at the Redfern Art Museum in Melbourne, and the next will take place in 2021.\n\n\nThe Institute of Contemporary Arts (ICA) in Chicago and the Yuz Museum in New York have announced that the next edition of the ICA Chicago will take place in 2021. The exhibition, titled The Redefined, will be held in conjunction with the ICA Chicago’s upcoming event, Art in the City, which will launch on the city’s West Side in March. Inaugurating the ICA Chicago will be the ICA Pittsburgh, which will be staged in the city’s historic West End, and will be followed by the ICA Detroit, which will take place in Belle Meade, the club district of downtown Detroit. The Redefinition will take place at the newly renovated and expanded Yuz Museum, which will also comprise a new and expanded gallery and event space.The next iteration of the ICA Pittsburgh will take place in 2021, and the Redefinition will be staged in 2022. The ICA Detroit will take place in 2023, and", "The next Biennial should take place in 2020. Vivian Ho, the director of the Felix-Kuhl Center for Contemporary Art, said the institution would not delay its opening, but was concerned about the impact of the coronavirus and said it would be open by the end of 2020.In an email, Ho wrote that the center was currently collaborating with the local authorities and that the location for the 2021 event would be determined by local council. The 2019 event, entitled “Wir sind die Biennischen Künste,” was held in, among other locations, Vienna. The 2019 event was also co-organized by the Künstlerhaus Vienna, the Louvre, and the Musée d’Art Moderne, and was attended by more than 150,000 people. The 2019 event, entitled “Der Gruppe das,” drew a total audience of 5 million people.\n\n\nThe Museum of Fine Arts (MFA) in Boston has welcomed Sandra Celaya to its board of trustees. Celaya will be the museum’s first director and will assume her responsibilities at the museum on March 31. In her new role, Celaya will oversee all aspects of", "The next Biennial should be held in 2021–20 and the next in 2023. The inaugural edition of the twenty-first Biennial was held in 2007 and featured work by more than one hundred artists. The inaugural edition of the twenty-second Biennial was held in 2009 and featured work by a group of American painters, including Mark di Suvero, Thomas Marchetti, and Seth Rilke, and was organized by the same organizers, the People’s Art Institute of China, according to Artnews. The biennial will be held at the Shanghai Museum of Art (SMA) in 2020 and will be preceded by the inaugural edition of the Shanghai Art Biennale in 2021.\n\n\nArts lovers in the city of Bonn have brought a historic landmark to a halt with plans to demolish the building where the Kunstverein Berlin (KVB) was held. In a statement, the Berlin city council said that the decision to scrap the building, which houses the Kunsthalle Basel in the former St. Martin’s Church in Bonn, was made following “consideration” of the “serious deterioration of the state of the Old Town’s cultural district.�", "The next Biennial should take place in the summer of 2021.\n\n\nThe National Gallery of Art has appointed Amy Corbitt as its next chief curator. She succeeds Lauren Oostra, who in November 2018 was appointed director of the Kunsthalle Basel in Switzerland, and will take up the post on January 1, 2021.“It’s a tremendous honor to be chosen by the National Museum to lead a grand tour of the National Gallery,” said Corbitt, the first woman to helm the museum’s curatorial division. “I’m particularly proud to be tasked with bringing a new perspective to the museum’s collection and exhibitions, as well as guiding the collection through the transition to a new building. I’m committed to working with artists, designers, and curators to develop new ways for visitors to see and experience the National Gallery of Art.”She added: “The selection of a curator is a reflection of the National Museum’s vision and commitment to moving beyond the current exhibition-driven model. This is a significant moment for the National Gallery of Art and I’m eager to make sure that future exhibitions and shows are inspired by the National Gallery’s", "The next Biennial should be held in October 2021.\n\n\nThe Metropolitan Museum of Art in New York announced today that artist and philanthropist Daniel Quinn has been selected to be the next director of the Metropolitan Museum of Art, which has been closed since March due to the coronavirus pandemic. Quinn is currently a board member of the Metropolitan Museum of Art, which was founded in 1810, and is a member of its board and a member of the institution’s staff. Quinn will begin his new role on January 1, 2021.“Daniel Quinn’s breadth of experience and commitment to museums and to artists makes him an ideal person to lead the Met,” said director Patrick de Blasio. Michael L. Blumenthal, the Met’s deputy commissioner for collections and acquisitions, added: “Quinn’s thoughtful and insightful leadership, deep knowledge of the museum’s collection and collections program, and burgeoning art-world network will ensure a strong and dedicated museum to support and celebrate the museum’s rich collection and collection program.”The Met has been operating under a critical financial and operational stress since March 15. Since the shuttered museum only has three full days a week to draw", "The next Biennial should engage with the current political situation and the international context in Europe and the Middle East, in order to create new perspectives and new opportunities for art.”\n\n\nA selection of works by the German postwar artist Wolfgang Freij (1926–1990) from the “Berlin Biennial” exhibition has been released by the German government. The exhibition, entitled “Germany in Transition,” opened at the Berlinale in 2018 and ran until 2008.The show, which features work by twenty-four artists who were active in the years between 1946 and 1990, was organized by the Federal Chancellery in conjunction with the museum Stiftung des Bundes (German Federal State Museum). The biennial was closed in 2007 after it was launched by artist Dieter Hütte to mark the end of the East-West Split, and the exhibition was postponed several times.In order to encourage greater exchange between Berlin and Berlin-based arts organizations, the German state acquired the works of thirty-six artists from the “Berlin Collection.” The acquisitions, which include paintings, drawings, photographs, sound recordings, and installations, were made possible through a donation of almost seventy works by Freij and thirty-one", "The next Biennial should take place in 2020. The exhibition is currently in its fifth year.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has received a $100,000 donation from artist-activists and philanthropists Trisha Brown and Kathleen Cleaver. The donation is the largest gift to the institution in its history. The funds will be used to support the upcoming exhibition “Theater of Operations: The Gulf Wars 1991–2011” and the forthcoming “Radioactive X: The Art and Politics of Nuclear Weapons.”The donation was made during a special exhibition of works by the artist-activists at the museum last month. The show, titled “Theater of Operations: The Gulf Wars” (Theater of Operations, Halloween, 2019), was curated by Tiffany O’Neill and featured work from seventy-four artists, including Griff Witte, J. Paul Getty, and Kiki Smith, among others from the Black Cross Collective, the Communion Project, the Forensic Architecture Project, and the Feminist Workers Club.In addition, the museum received a $50,000 gift from artist Jovan Westbrook. The donation is the largest gift to MoCA since it opened in 2000. The gift", "The next Biennial should take place in 2020, and the next in 2021. The inaugural event will feature works by two-dozen artists.The full list of participating artists is as follows:Catherine Fairbairn, Australia: resigned by Honorary Consul, Australia• Daneem Elayat, Australia: resigned by Honorary Consul, Australia• Kaya Jirani, Australia: resigned by Honorary Consul, Australia• Martin Goodman, Australia: resigned by Honorary Consul, Australia• Alberto Morales, United States: Closed until further notice, United States; MILAN: Closed until further notice, Germany; MELANIE DE PEREZ, Mexico: Closed until further notice, Germany; NEPAL: Closed until further notice, Germany; MIDDLE EAST: Closed until further notice, Germany; MIDDLE EAST: Closed until further notice, Germany; MIDDLE EAST: Closed until further notice, Germany; MIDDLE EAST", "The next Biennial should take place in 2020, with the same dates as its predecessor, which has been held every thirteen years since it was founded in 1972. \n\nShortlisted for the 2019 Pulitzer Prize in Fiction are David Lynch’s “Blue Velvet” and “City of Birds.” The book, a collaboration between the director and his wife, Stanley Kubrick, and the artist Marilyn Hopper, was nominated for the first time last fall, but was not selected. The next round of nominations will take place in the spring of 2020, with the winner announced in the fall of 2020.\n\n\nThe University of Maryland, College Park (UMC) has added four new members to its curatorial staff. The school also announced that it will begin accepting applications for the 2020 season, with the announcement expected on Wednesday.The addition of the four new members to the curatorial team comes amid a major restructuring at the private arts education institution. The university made the announcement in an email sent to students on Wednesday, which said that the changes were made to help increase the number of arts and cultural professionals on campus and improve the undergraduate experience. “We’ve also made a number of changes to help improve the academic", "The next Biennial should commence with a curated exhibition of work by the twenty-six artists represented in the exhibition. The new format will emphasize the interdisciplinary interaction between moviemakers and arts professionals in a spirit of interdependence. The exhibition will also encompass a discussion of the relevance of contemporary art and the Gallery of Modern Art’s twenty-sixth Biennial, “A.I.I.N.', in partnership with the Saʙal Art Foundation.” The new exhibition will explore emerging practices and the possibilities of a new digital frontier through a series of interviews with artists in collaboration with the Saʙal Art Foundation and a curator based in the Saʙal Art City, Saʙal Istana. In addition, the exhibition will draw from selected works by the artists who participated in the 2019 exhibition, including Gaëtan Alves, Noma Cipolletta, Gabriela Ferrer, and Nada Galán.\n\n\nThe French Ministry of Foreign Affairs and the Museum of Fine Arts (MoFA) in Paris have released guidelines for the future display of works by artists in Paris’s massive, underground, brownfield Galleries of Modern Art (Galleries Phalanges).", "The next Biennial should be held in 2020. \n\n\nThe National Endowment for the Arts (NEA) has released a new set of guidelines on how cities and counties can make use of the commissioning and curating work of literary, artistic, and cultural figures, in an attempt to promote more widespread access to public art. The guidelines, released on April 28, 2020, and by NEA president María Berrada, aim to increase the agency and transparency of the NEA’s work by providing it with a new set of tools and by increasing the scope of its current grant program.“The NEA is committed to supporting local, regional, and national creative organizations in achieving their vision of preparing for and hosting the 2019 National Museum of Art,” Berrada said in a statement. “The guidelines will give the NEA and our grantees the tools they need to better serve our communities and hold artists and local cultural organizations accountable for their proposals and designs. We are excited to see how this new program will work for our communities and artists and are confident that this new way of working will benefit the entire country.”The guidelines recommend broadening of the current grant program by giving regional and", "The next Biennial should be held in 2021. In the meantime, the exhibition will continue to present works by new artists, and is planning to present new works by artists who have not yet been selected for the first edition.\n\n\nThe Biennale de Lyon, which wrapped up in March, has announced the list of thirty-nine artists who will participate in the fifth edition, which will take place in the French city of Lyon, in 2022. In a release, the event said: “Marianne Boudjra, Petr Lača, Yannick Martel, Oteil Mantua, Mira Pekgela, Alan Sze, Bernardo Tassi, Jean-Luc Poulin, Nari Ward, Patrick Vickers, Paula Wier, Perrineau Fotopoulou, and Hélio Oiticica, among others, will present their works in the exhibition.”The full list of participating artists is as follows:Marianne Boudjra (Belgium/France)  (ex-Jean-Luc Prouvé)\n\n(Belgium)Fernando La Rosa (Spain)“Ajom & Amira: The Best Is", "The next Biennial should be held at the Mary Beard Museum in New York, with a new curator and a new collection of works that will include a survey of the contemporary art world and its relationship to the American dream. The museum will also explore themes of performance and reproduction, urban life and the body, and the limits of art and action.\n\n\nQatar’s Emir Tamim bin Hamad Al-Thani has ordered the closure of Al Jazeera offices in the country following its investigation into allegations that Qatar News Network (Qatari) and Al Jazeera America (formerly known as Al Jazeera America) were involved in a violent crackdown on protesters last January. According to the New York Times, forty-six Al Jazeera staffers were fired or suspended for their roles in disseminating false information to viewers about the operations of the Qatar Foundation (QF), an organization that provides funds and other support for arts and cultural organizations in Qatar. The decision to close the offices follows allegations of widespread corruption against Qatar’s government raised by the Doha-based NGO the Institute for Policy Research and Development (IPRD). The rights group alleges that Qatar state media outlets deliberately omitted critical interviews with officials in an attempt to make Qatar’s human rights", "The next Biennial should be in January 2022. \n\n\n\nA new proposal by the Museum of Contemporary Art (MoCA) in New York to open a new cultural center in the city’s Hyde Park neighborhood has been withdrawn after the neighborhood’s mayor, Mike Feuerstein, expressed his opposition to the arts education center, which would have served as an incubation laboratory for new work by artists, including Anselm Kiefer, Arthur Adam, and Adrienne Holloway.The proposal, which was first reported by the New York Times on September 6, was made during a heated mayoral campaign in which Feuerstein challenged incumbent mayor Tom de Blasio over his ties to Wall Street and his use of private prisons. The campaign also involved questions about whether MoCA could be considered a cultural institution under New York’s municipal charter, and whether the community approved of the center’s proposal to turn the neighborhood into a public park, which has been the theme of the park in the city since 1959.The move drew fierce backlash from local residents and activists, including those opposed to the project, including the New York Community Coalition Against Prisons (NYCCAP), who called it “an attack on the community that will hurt the", "The next Biennial should be held in 2024. “We are currently working with a great team of curators from the United Kingdom, France, Germany, Sweden, and China to present the exhibition in the best of our hearts,” said Katja von Rönnskog, chair of the Biennial Commission. “The exhibition will be a tribute to the life and work of the great sculptor, and will celebrate the rich and varied legacy of his work.”The exhibition will be organized as follows: The exhibition will be divided into two parts: a) “Living in Pieces” and b) “We are here, we are alive, we’re breathing,” and will feature the work of nearly 300 artists and collectives. The full list of participating artists is as follows:Grace and James Grubb, New York: “Adam Clayton” (1910–2011)Grace and James Grubb, New York: “Ivan Albright’s Be/longing Photo” (1940–2011)Grace and James Grubb, New York: “Adolph and Eileen Atkins’s ‘Post War", "The next Biennial should be held in the fall of 2020. The event will highlight the work of an upcoming generation of artists, with the first exhibition dedicated to Arab artists slated to open in the spring of 2021. \n\n\nThe CNAB Museum of Art in New York has appointed Tarek Atoui as its next director. He succeeds Rebecca Rosenblum, who is retiring after twenty-five years in the role. Atoui comes to the institution from the Museum of Modern Art (MoMA), where he has served as director since 2010. Atoui will assume his new responsibilities on August 31.“There are certain moments when an institution can be so pivotal and transformational for an artist’s practice, that it becomes more and more important to have someone who understands the potential of an institution’s collection and the creative process as well as its capacity to shape and transform,” said Atoui. “This is especially true for artists whose work is rooted deeply in their personal histories, histories that are frequently uninformed and unacknowledged. It is my responsibility to foster and encourage this practice in the MoMA collection.”During his tenure at MoMA, Atoui helped shape its collection", "The next Biennial should be held in the spring of 2020. \n\n\nThe Museum of Contemporary Art (MoCA), San Francisco and the San Francisco Museum of Modern Art (SFMoMA) are planning to merge in March. While the move is not unexpected, the announcement has raised concerns over the future of the arts and culture in the Bay Area, which has seen a rapid increase in population in recent decades.According to the San Francisco Chronicle, the city council approved the merger in February, but the deal only requires approval from the state government. The decision to move forward with the merger was made after the city council voted to establish an arts and culture fund, dubbed the Bay Area Arts and Cultures Fund, which will receive $3.2 billion from the sale of assets. The city also plans to sell the land on which the museum is based and build a new museum.The city is currently negotiating with the private entities to see if the arts and culture district can be preserved. While the city believes that the possible preservation of the area will allow it to continue to grow and attract visitors, the city is worried that the arts and culture district will be displaced by a new development known as the City Gallery, which will be built on top of the old Metropolitan Museum", "The next Biennial should be in 2020. Since the sessions will be held in the same building, and will share the same space, I think I have a lot of responsibility as an artist and curator to make sure that we have something that is inclusive and is sustainable.” The first exhibition of the Biennial was “First Light” (2015), which featured work by forty-four artists, including Adam Morrison, Nari Ward, Aishwarya Mukherjee, and Adam Ottaviani, among others from around the world.\n\n\nThe Jinx Museum of Art in New York has received a gift of twenty-two nearly-complete paintings by twenty-eight artists from the Jinx Collection, an independent organization that has been devoted to the pursuit of the work of African American artists since 1973. The group finds itself at the epicenter of a movement of contemporary art that has expanded the notion of the African American artist in the United States.In addition to its holdings of works by artists such as Charles Ray, Chet Baker, Alton John, and others of the Harlem Renaissance, the museum has also assembled works by artists such as Hosea Williams, Ann-Marie Wilson, and Desmond Tutu. The gift of the works,", "The next Biennial should include a presentation of some of the works that are currently on display in the exhibition. This year’s theme “Serious Play: Theory and Performance” will be “a symphony of the various forms and modes of human activity” and will embody the theme of the exhibition, “Serious Play: Theory and Performance” (2017–18).\n\n\nThe KAND Foundation, a charitable organization based in Los Angeles, has announced the launch of its Kand Research Institute for Contemporary Art. The center, which will be housed in a former convenience store on the ground floor of 3333 West Twenty-Third Street, will host around fifty artists, creatives, and indies in a series of four-month activations.Established in 2017, the foundation has supported artists and creatives who live and work in Los Angeles County through grants ranging from $50,000 to $300,000. Participants in the center’s inaugural series include Ivan Nunez, Fezana Sarr, and Agnieszka Rocca. The second edition of the fund-raising event, “The End of the Start,” will be held at the KAND Foundation in January 2020", "The next Biennial should be held in 2022.\n\n\nThe Los Angeles County Museum of Art (LADMAC), which has been working to expand its collection of approximately three hundred works by artists, has received a $500,000 donation from the collection of the late L.A. native and activist Mamie Tung. The gift, made by L.A.-based collector and democrat Konrad Zulet, also includes a set of works by the Chinese American artist Duane Edlis, whose work often explored new notions of abstraction and the boundaries between modern and contemporary art.Assigned to the museum by Zulet in November 2018, the collection includes work by artists such as Peter Sellars, who painted by tracing the contours of a blood-red sky, captured the spirit of the American West, and the mid-twentieth-century Haitian artist Farak Naidoo, whose work was influenced by the experiences of African Americans in the United States.The donation also includes works by artists such as the late Chinese American artist C. Frank Hsu, whose animated, almost photorealistic works often include a broad range of materials, from metal and concrete to and fabrics and rubber. The donation comes a few months after Kiki Smith, a longtime friend", "The next Biennial should be held in the spring of 2020.\n\n\nThe Museums Association (MA), which represents more than 2,500 museums, is calling for Britain to increase its contributions to the International Rescue Group’s (IRC) operating budget and expand its relief efforts in the face of the coronavirus pandemic. The call for relief comes in the wake of the coronavirus outbreak, which has seen the number of cases increase by more than eightyfold since the virus was first identified in 1976 and is the result of a mismanagement by officials at the UK’s sixteen local councils as well as a lack of resources from the UK’s charitable sector.According to the Independent, the UK’s central bank loaned the government more than £3 billion to help cope with the coronavirus, but only lent £1.4 billion. When it came to funding the arts, the Ministry of Culture received only £1.2 billion and the Department for Culture Media and Arts (DCCA) only gave £100 million.With the UK facing a $1.2 trillion health crisis, the Art Fund has launched an emergency fund of more than £500 million. A further £252 million can be used to help institutions", "The next Biennial should be held in the spring of 2022. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has announced that Gertrude Stein will be the next recipient of the Penny Marshall Hutton Award, which is named after the American literary and cultural historian who was the first person to receive the $100,000 prize. Stein, who died in 1984, is perhaps best known for writing about women’s issues and African American art in a feminist, anti-racist, and anti-imperialist fashion. Stein was also the first American woman to win the Nobel Prize in Literature, the Pulitzer Prize in Journalism, and the Pulitzer Prize in Arts. Stein’s work is included in the collections of the Los Angeles County Museum of Art; the Musée National Picasso in Paris; and the Metropolitan Museum of Art in New York.The award, which was established in 1988 by Pinchukhuyi Khai, the founder of the Khmer Arts Foundation, was established to support the work of women and non-European artists in Cambodia. The museum first awarded the award in 1992. The museum selected ten artists for the award—including Eleanor Coppola, Penny Marshall", "The next Biennial should be held after the screening of the first exhibition, for which the Los Angeles-based artist Courtney Howe is making a documentary about the history of early music and its relationship to art. The event will feature performances by artists such as Joan Jonas, Jean-Michel Basquiat, and John Coltrane.\n\n\n\n\n\n\nCatherine James, the British photographer best known for capturing images of women in their underwear with her camera, died on September 5 at the age of eighty-six. James was born in London in 1929, the daughter of industrialist Cecil James, who was a leading supporter of the Royal College of Art’s photography program. James studied at the School of the Art Institute of Chicago, then at the Institute of Art in the Arts, then at the School of the Craft, and eventually landed in the United States, where she met her husband, the American photographer Charles James, and their son, Prince William. The two followed art and fashion as they moved to their yacht in the English Channel and began traveling together, attending lectures and parties at the Royal College of Art in London and the Museum of Modern Art, and the Museum of Modern Art in New York.James studied at the School of the Art Institute of", "The next Biennial should not only focus on the infinite possibilities of the body but also on the infinite capacities of artists. It should be an invitation to the body to become part of the world at large. Simultaneously, it will have the potential to bring together the many strands of contemporary art and to join them in a kind of golden archipelago.”\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has canceled a show in the city in which it was planning to stage two large-scale public artworks, the largest of which will be the country’s first, a massive, thirty-foot-tall bronze sculpture known as the Seven Sisters, which will be placed in front of the Museum of Contemporary Art in 2020. The show, titled “Prelude,” was to open on September 5 and explore the relationship between art and nature. The date was moved to October 20, a day when the sculpture is scheduled to appear.“The decision to postpone ‘Prelude’ was made in light of the exhibition’s announcement that it would present ‘Dreaming in Stone’ alongside” two works by the artist Rashid Johnson, both of which will be on view", "The next Biennial should be held in Beijing in 2020, followed by a second in the city of Wuhan in 2021. The 2020 edition of the event will contain thirty-five artists and will be organized as a public space.The 2020 edition of the Biennial will be similar to last year’s, with ten artists selected from each city, and will take place in a building between the National Museum of Contemporary Art and the Hunchun Academy of Fine Arts.The platform will also include a lecture series, a panel discussions, and a public sculpture garden. The biennial will be hosted by the Beijing Municipality’s Office of Culture, Arts, and Sports.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Holly K. Hughes as its next executive director. Hughes comes to the institution from the Los Angeles County Museum of Art (LACMA), where she has served as deputy director for the past two years. Previously, Hughes was the deputy director and chief curator of the newly created museum of modern art in New York, which was inaugurated by artist Mark di Suvero.“After a thorough search, Holly was selected as the next executive director of the museum,” said museum director Daniel H", "The next Biennial should take place in 2021.\n\n\nThe UES Group, which represents Art+Vision Gallery in New York and the Brooklyn Museum, is launching a new seven-day-a-week, nonstop program that will focus on the art of movement. Called Art+Vision Tuesdays, the program will include three exhibitions: “First,” which will highlight contemporary artist Rachael Adair’s work from the late 1960s to the early 2000s; “Second,” which will highlight work from the 1960s to the early 2000s; and “Third,” which will highlight Reto Slonimsky’s work from the 1960s to the early 2000s.Inaugurating the program will be an exhibition at UES’s headquarters in New York City, which will present five works by the late Israeli architect Menashe Lieberman. The show will feature photographs by the late American painter Sidney Almon, who lived and worked in New York from 1965 to 1971, and will feature works by several other artists from the ’70s to the ’80s.In a statement, James Cuno, president and CEO of Art+Vision, said: “The", "The next Biennial should be held in 2020 and will take place in the city’s Art Deco mid-19th Century buildings. The event’s theme “Architecture of Life” will unfold in a series of exhibitions that will include the gallery’s first solo presentations of works on paper by artists such as Walter de Maria, Harald Szeemann, and Rirkrit Tiravanija.\n\n\nThe National Museum of Art in Washington, DC, has issued its annual curatorial award to Michel‐Louis Bickel, the first American curator to win the prestigious Gold Medal at the Venice Biennale. The museum’s inaugural award, given by the CNA, came in the form of a prize for art created in partnership with the United States.The organization will award $5,000 to the winner of the 2019/20 biennial. The 2019 winner, Thomas Harwood, was selected for his work The Man in the Trees. “After careful consideration, the National Museum of Art and the American Alliance of Museums have awarded this year’s Michel‐Louis Bickel Award to Thomas Harwood,” said board president and CEO Richard Armstrong. “A conceptual", "The next Biennial should focus on how the contemporary art world can reflect and engage with Greek and Roman antiquity through a reinterpretation of the Greek and Roman pantheon.\n\n\nThe Paris-based, New York–based, and New York–based nonprofit that supports artists and could be considered the nexus of the global art world, the Art Institute of Chicago (PICA), and the Whitney Museum of American Art (MoA), has awarded the prestigious Prix de l'Art a $75,000 grant for the 2019–20 academic year. The grant comes on the heels of the organization’s announcement that it plans to cut its annual funding by $5 million, and the reduction coincides with a nationwide strike against austerity by arts workers across the United States.The organization also revealed that it plans to offer new grants and to begin accepting applications for the 2020–20 academic year. The award will be given to a candidate who has recently emerged as a powerful force in the American art world—David Adjay, who will receive the prize at an award ceremony in New York on Friday, January 22. The award, which was established in 2012 by the late French collector Paul Heger and his wife, Jeanne-Claude, and was given to their", "The next Biennial should be held in Munich in 2022, said the city’s cultural association, which also noted that the institution’s new exhibition, “The Body,” will focus on the human body and the environment, and that the theme, “The Body’s Place,” will be “the body in its entirety.” The museum will also explore the role of art and architecture in the incorporation of biotechnology, particularly in the field of bioengineering, and the aesthetic and conceptual possibilities of the body.The new champion will be announced in March 2020. Artist-in-residence Jiri Wirbel, who has been commissioned to create a new work for the exhibition, is currently working on a new proposal for the exhibition. The exhibition will premiere at the Biennale de Lyon in May 2020.\n\n\nThe British Museum (BMI) announced today that artist Alison Bech, whose stunningly lifelike Abstract Expressionist sculptures evoke the work of the artist who created them, has been selected as its next winner of the £550,000 Selby Prize. Bech will receive the honor at a ceremony that will take place at the museum on May 17. The finalists were selected by", "The next Biennial should take place in the city in 2021. According to the Art Newspaper, the city hopes to begin construction in 2020 and open to the public in 2021. Notorious for its high crime rate and poor urban planning, the city\u0097which has a population of over one and a half million\u0097has previously faced numerous legal actions by artists and activists over its development plans. The 2010 bill to establish the museum, which is currently being developed by developer Adams Gale Architects, is currently before the High Court.\n\n\nThe Library of Congress and the National Endowment for the Arts (NEA) have added seven works by forty-three artists to their exhibitions and have released new works by fifteen lesser-known artists in the last two weeks, including Robert Irwin, Laura Owens, and Erma Serota\u0097all of whom have been added to the collections of the two agencies.“It is a great honor to welcome these artists to the NEA and the National Endowment for the Arts,” said Nara Allen, director of the National Museum of African Art. “These artists are creating new works for exhibitions that are both timely and important for the exhibition and for us. We look forward to providing more opportunities for their", "The next Biennial should aim to give an account of the life and death of Pablo Picasso, to consider the racial and other intelli­gence of the artist, to draw attention to the work of the contemporary artist, and to incorporate a number of other themes. The theme for the second edition of the biennial is “Modernity and Art,” and will be a reflection on the museum’s commitment to the museum and the contemporary artist.The museum will post the results of the inaugural round of interviews on its Facebook page on Sunday, October 22.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines for the relocation of cultural heritage works and artifacts from public land to private ownership in an attempt to mitigate the ongoing threat posed by the coronavirus.The guidelines, which were drafted by cultural conservationists and cultural preservationists, were issued in response to the coronavirus pandemic. The guidelines were released during a convening at the Museum of Modern Art (MoMA), on the Upper East Side, where DCLA commissioner Daniel H. Weiss and urban designer Frank Gehry are working on a new urban plan for the city.The guidelines, which were also endorsed by the cultural conservation nonprofit", "The next Biennial should open in July 2021. The event will feature more than 120 artworks and will take place in the exhibition hall of the Museum of Modern Art.[Update: February 28, 10:50 AM] The 2019 edition of the biennial, titled The Tide Turns, was canceled due to concerns over the coronavirus. Artforum spoke with the organizers of the 2019 edition, Adriano and Marco Pantani, to find out why. They said the decision to hold the event was made after they completed a thorough analysis of all the possible scenarios: The first was that the coronavirus had not reached Italy, the second that it had, and the third that it wasn't.  The Pantani brothers believe that the next edition of the Biennial will be an attempt to re-create the atmosphere of the exhibition hall on the day of the exhibition, as it was the day of the exhibition, in order to re-create the atmosphere of the exhibition hall on the day the exhibition opened. The event will also include a digital animation, created by Marco Pantani and based on the real-life events in the exhibition hall, to immerse the audience in the event.“We will try to make the event as immersive", "The next Biennial should take place in 2020 and will be organized in collaboration with the institution’s nonprofit partners, the Brooklyn Museum, the Museum of Art, and the Bronx Museum of the Arts.\n\n\nFrançois Balin, head curator of the contemporary art biennial d’Art et d’être in Paris, announced in an interview with the French daily newspaper Le Figaro on Thursday that the twenty-second edition of the d’Art et d’être will take place in the French capital next month. The show will be hosted by Pierre Gassée, the former director of the Musée d’Art Moderne, in collaboration with the Institut d'Art Moderne in Paris, the Centre Pompidou in Saint Petersburg, and the Museum d’Art Moderne in Paris.The exhibition, which is being organized by the Centre Pompidou in partnership with the Musée d’Art Moderne, will provide an opportunity for contemporary art lovers from across the globe to experience art from a Parisian perspective. The twenty-third edition of the d’Art et d’tre will take place in the Museum d’Art Moderne in Paris. The twenty-", "The next Biennial should be held in 2019. The twenty-second edition will take place in the Greek city of Olympia in November 2020. The twenty-third edition will take place in Paris in March 2021.   The fourth edition will be staged at the Palazzo Nazionale d'Italia in June 2021.  The fifth edition will take place at the Museo Nacional Centro de Histórias y Culturas y Culturas (CICHC) in Mexico City in October 2021. The sixth edition will be held in Melbourne in February 2022. The seventh edition will be hosted by New York in February 2022. The eighth edition was scheduled for March 2022, but was postponed due to the Covid-19 pandemic. The ninth edition was rescheduled for April 2022 and the tenth was scheduled for April 20-May 2022. The eleventh edition will be held in Rome in September 2022.  The fifteenth edition will be held in Chicago in September 2022. The seventy-ninth edition was created by the artist and curator Laura Owens. The sixty-first edition was curated by Laura Owens and will be on view in", "The next Biennial should be held in 2020.\n\n\nThe Italian artist Borja Pignatella has received the Prix d’Art Contemporanea® in Florence. The award for the best modern and contemporary art shortlist from the festival, which is organized by the Fondazione Prada and the Prada Foundation, was presented by Florence’s chief artistic director, Paolo Cipolletta, and his wife, Rosalind, in a ceremony at the Prada offices in Milan on Tuesday. The prize ceremony, which was held on August 10, featured a number of works by the Italian-born artist, as well as a selection of paintings and sculptures by other finalists.Pignatella’s work, Zola, 2017, is a modernist–inflected, gothic-sleeping poster for the work of the same name by the artist Ernest & Rosemary O’Brien. The work, which is based on an unfinished drawing of a woman wearing a bathrobe, was made on the night of September 19, 1967, and premiered in the show “eureka” (1967) in 1967. The work was chosen as the best work for the show in the exhibition", "The next Biennial should take place in the city in 2021. \n\n\nThe Spanish Ministry of Culture is planning to create a new exhibition dedicated to the use of food and drink in the country. The project will be led by the museum in the capital Madrid and will feature more than 35,000 items from 110 countries. The first show, titled “Cerveza y gastronomica” (Culture of Eating), will be on January 31. The show will focus on the history of food and drink in Spain, and will feature at least 120 objects from Spain’s regional and national collections.“In the past twenty years, the Ministry of Culture, in cooperation with the Spanish National Museum, has organized and presented exhibitions devoted to the cultural production of Spain, Spain’s major cities and the cultural areas of the rest of the country,” the Minister of Culture, José Manuel López-Montt, said in a statement. “The theme of this year’s show, ‘Cerveza y gastronomica’ is ‘sustainability and its impact on people’s lives. The exhibition will be organized with a historical perspective and will be divided into several parts. Each", "The next Biennial should take place in 2020 and will examine current affairs and the art of the Pacific. The event will take place inside the beautiful ship the International Museum of Modern Art, which is currently under construction in Venice. The forty-five year old museum was commissioned by the German government in 2016 and will be inaugurated by the artistic director Wolfgang Althau in 2020. After the exhibition, it will also host projects by Lucio Fontana and María Berrada. Entitled “Egoismo Pacifico” (The Ecstasy of the Pacific), the exhibition will feature work by forty-six artists, from Argentina, Brazil, Chile, Colombia, France, Italy, Mexico, Peru, and Taiwan. Among them are Edgar Castillo-Alcántara, Felipe Corral, María Serpa, Nari Ward, Ricardo Torres-Santiago, Andrea Hoxha, and Catherine Uffner. “We are thrilled to be hosting the first Biennial of Contemporary Art in our home city,” Stephanie Hicks, chair of the board of trustees of the Museum of Contemporary Art, told the Los Angeles", "The next Biennial should help raise awareness of climate change, its impacts on biodiversity, and the cultural and social impact of the crisis. The theme of the exhibition is “Climate Crisis: From Fragments to Embers.” The theme of the exhibition is “Climate Crisis: From Fragments to Embers.” Until the exhibition, the biennial had only recently been held. The next edition of the event will be held at the Far Eastern Academy of Fine Arts in Beijing from October 16 to October 19.Culture and climate activists have been campaigning for the exhibition to be moved to a different venue because of the coronavirus outbreak. Artforum has contacted the Satyr Art Museum in London for comment.\n\n\nThe Los Angeles County Museum of Art (LACMA) has received a $10 million donation from the Katz Family Foundation. The gift also includes $6.5 million from the Katz family endowment, the John and Marlene Katz foundation, and the John and Polly Katz foundation, as well as $5 million from the 2200 Club, the Leonard Shaughnessy Foundation, and the Minnie Katz Foundation. The donation comes after LACMA received $4 million from the", "The next Biennial should take place in the Spring 2020, which will be held in the city between June and November. Perhaps the best-known of the five years of the exhibition will feature the work of Sarah Henningsen, a German artist whose work is often set in the city. She will be included in a retrospective of her work that will take place in the spring of 2021. In the Fall 2018, she was awarded the Deutsche Kunstverein Berlin.\n\n\nA new survey of the vernacular art of South America is to be published this fall by the Argentinean curator and critic Ana Maria Vicente. Titled vernacularo femme, or femme art, the exhibition will examine the work of indigenous and/or third-wave artists and their continuities through time and space.The exhibition will be curated by local writers and artists and will follow a group show at the Buenos Aires Museum of Art (BAMI) this fall. The Buenos Aires Museum of Art (BAMI) will open its new space in the city next March.Commenting on the upcoming exhibition, Vicente said: “For me, it is important to highlight the continuities between indigenous artists and their contemporary forms in order to appreciate the historic role of", "The next Biennial should be held in 2021. \n\n\nParker’s will create a new model for exhibiting contemporary art in the United States following a reorganization of its curatorial staff that will include the hiring of five new artists in the coming months. The five-year plan will also include a new exhibition format and a new collection of works by emerging and established artists.“We were inspired by the new insights and new stories that emerging artists have brought to our program in the last number of years, as well as the tremendous response that emerging artists have given to the Parker’s program,” said Jennifer Parker, the museum’s artistic director. “The fourth Biennial has been the most highly regarded and most influential, and I am proud to have contributed to its success. We believe our new curatorial model can expand and advance the work of emerging artists, while delivering important new insights into their work and practice.”Parker added that the new positions will not involve the curation of works, but will “focus on the creative process as a whole,” in order to engage with contemporary artists in an effort to “explore art” in the twenty-first century. The new program will", "The next Biennial should take place in Tokyo in late May.\n\n\nThe British Museum in London has appointed Suzanne Rowland as its next chief executive officer. She succeeds Anne-Marie Hoehn, who retired earlier this month after ten years at the helm of the museum.Rowland will also assume her responsibilities in April 2020. In her new role, she will oversee the creation of the museum’s new permanent collection, which will be established in partnership with Tate London, the Royal Shakespeare Company, the National Galleries of Scotland, and the National Gallery of Art, and will oversee the development and renovation of the museum’s current design. During her tenure, she will collaborate with the Tate, the National Portrait Gallery, the Tate Modern, and the National Gallery of Art to advance the museum’s international reputation and will shepherd the museum through a major refurbishment and expansion project.“Suzanne is a great admirer of the National Galleries of Scotland, which she has supported with more than sixty years at a time, and with the National Portrait Gallery, which she has overseen for more than forty years, she has become one of the patronizers of great artists and designers,” said museum director Maria Balshaw. �", "The next Biennial should take place in 2020 and is scheduled to run from June 3–June 7. The event will have exhibitions of works by artists chosen by the public and will be led by Prof Catherine Ryan. Ryan will return with the biennial in July of 2021.\n\n\nThe New York Academy of Art (NYA) has received a $4.5 million donation from the $25 million Beaux-Arts Foundation, which was established by American billionaire Melville Sargent in honor of his late wife, the late Helen. The gift will help accommodate the medical needs of Jimmy Sargent, who committed suicide shortly after receiving treatment for his adverse disease. The foundation is also providing $3.5 million to develop a new curation series for the Fulton Museum of Art and the New York Pace. The gift is the latest in a series of treasures from Sargent, who donated from his wealth, family, and personal possessions to beacons of art and design. Among the objects gifted by Sargent are the Beaux-Arts Fellowship for Art", "The next Biennial should take place in 2021 and the first in 2022.  The biennial will be the first of its kind in the country and will be organized in concert with the annual running of the Garden Museum in London. 'The exhibition is a great opportunity for us to commission and design works inspired by the work of contemporary artists, and to engage with the legacy of the institution, which has been so influential on our lives and careers, and to explore its influence on our own lives,' said Gokhan.The Biennial will be inaugurated with a retrospective of the work of Artsakhani-born, Ondine Baghramian, at the museum. The artist was commissioned to create a work inspired by the life of Azerbaijani poet and activist Nusrat Mirza, and in collaboration with Artforum, staged an exhibition of works by the latter at the Biennial, Artsakhani-born artist Khalil Ankermann, and Saziha Vasu and their collaborator Fatemeh Haji. The work, which was exhibited at the Art Salon in Baku, was included in the seventy-second edition of the pavilion at the Art Museum in St. Petersburg last", "The next Biennial should be held at the Museum of Contemporary Art (MoCA) in New York in 2022. The next iteration of the exhibit will feature work by fifty artists and will take up themes of memory, memory of the past, and memory of the future. The event will also include a performance by the contemporary artist Mandy El Samerraie, an exhibition of works by African American artists, and a presentation of original works by works by the late French artist Marc-Olivier-Bertrand Modigliani. The twenty-fifth edition of the annual Biennial will be held at the Museum of Modern Art, New York, in 2022. The twenty-sixth edition of the biennial will take place in LA in 2022.  As of June 30, the American Alliance of Museums (AAM) had 516 members.  According to the Association of Art Museum Directors (AAMD), the Hollywood Film Center, the Metropolitan Museum of Art, and the Metropolitan Opera House are among the institutions that have expressed interest in hosting the 2020 edition of the Hollywood Biennial.\n\n\nLincoln Center, the Los Angeles County Museum of Art (LACMA), and the Museum of Modern Art (MoMA) in New", "The next Biennial should launch in 2021 and has already received support from the museum’s board of directors. It will also be supported by a philanthropic trust established by Stanley and a group of investors led by Domenick Ferrari\u0097the Rialto brothers, cousins and businessmen who jointly own the Detroit Institute of Arts. Stanley and Domenick also own the Detroit Red Wings hockey team, which Stanley leads.\n\n\nThe Mexico City Art Museum (CAM) has announced the launches of two new initiatives aimed at increasing the visibility and accessibility of Mexican art in the United States. The first, an online platform known as MiAM, was established by the museum’s curatorial department and Google; the second, a special exhibition titled “Panorama,” which was organized by the Los Angeles County Museum of Art (LACMA), was curated by artists Nydia Velázquez, Maria Elena Salazar, and Ti-Song Wong.MiAM will host two online shows: “MiAM: Mexico’s Art of the Past” (October 4–October 5) and “MiAM: History of Art” (October 17–October 20). The first show will focus on the history of Mexican", "The next Biennial should take place in the spring of 2021. The board of trustees will appoint an interim director for the arts and cultural sector.\n\n\nThe Museum of Modern Art (MoMA) in New York and the Solomon R. Guggenheim Museum in New York City have welcomed Elizabeth Alexander and Anthony Crook as cochairs of the upcoming Museum of Modern Art (MoMA) biennial. Alexander, who has served as chair of the museum’s board of trustees since 2012, will be the curator of the fifth iteration of the museum’s “Monuments Men: Art in the Age of Peter Pan” series, which celebrates the art of men and their contributions to society. Crook, who has helmed the Guggenheim since 2007, will serve as a cochair of the upcoming Museum of Modern Art (MoMA) “The Growth of Modern Art,” which will open to the public on January 25, 2021.“We are very excited to welcome both Elizabeth and Anthony into our team, and to collaborate with them, as they are passionate about the museum’s mission and mission to present the most important work of modern and contemporary art,” said ", "The next Biennial should feature forty artists, and in the coming years, it should be able to host hundreds of exhibitions. The project is a long-term undertaking, with the artist-in-residence, the residency program, and the exhibition. The Biennial has received a further $100,000 from the London-based charity, the Art Fund, and the National Art Centre in Chicago’s $250,000 endowed funds. The institution will be given $1.5 million from the National Lottery Heritage Fund, and $800,000 through the private-public partnership agreement.\n\n\nThe National Gallery of Art (NGA) in Washington, DC, has received a gift of $75 million from David and Sir David Walliams. The gift includes $50 million for a new $100 million partnership between the institution and the New York–based firm, Witherspoon Gilbert & Sullivan, which will commission artists to create a new work for the NGA’s permanent collection.The gift was made on behalf of the David and Sir David Walliams Foundation in honor of their shared passion for art and their dedication to supporting the NGA’s numerous arts initiatives. The foundation helped secure the", "The next Biennial should be held in 2021. In the meantime, the museum is preparing to welcome the public to the exhibition for the first time in 2021. The event will continue to be staged in 2022. The date of the next Biennial is being moved to 2019. The show is also believed to be under consideration for the 2019 edition.The invitation was first issued by Barcelona-based artist and curator José de la Cruz-Torres. The exhibition will feature work by twelve artists and will run from November 17 to November 21. The exhibition’s program of introductions, reviews, exhibitions, workshops, talks, and presentations will be organized in a way that allows the artists to move between the theme of their exhibitions and the history of the biennial. In addition, the biennial will be a dialogue between two groups of artists, Eljas and Castaneda.Commenting on the project, de la Cruz-Torres said: “The play of the exhibition, the exhibition, the exhibition, is a way of organizing the history of the show, the exhibition, the play, and the history of the exhibition. I hope to develop a new intellectual idea that will allow the artists to interact with the show and the play together, together, and not", "The next Biennial should begin in 2021 and will feature fifty works by twenty-six artists from different regions of the world. \n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles has confirmed that the institution will not be able to reopen to the public next year due to concerns over Covid-19. The reason for the delay is uncertain, but according to the Los Angeles Times, the museum has already scrapped the planned reopening of the gallery at 3210 Wilshire Boulevard, which it hopes will become the location for a major renovation.The Los Angeles Times reports that the museum’s board chair, Tom Goldstein, told the newspaper the decision was made after discussing the possibility of reopening with the Los Angeles Department of Public Health for the last two weeks. According to the Los Angeles Times, the department informed MoCA that it is “fully aware of and does not anticipate the need to reopen once the health and safety of the general public and our staff remains at an ‘optimistic’ level.” The department also expressed confidence that the institution would be able to reopen, as long as the necessary environmental remediation is carried out.To mitigate Covid-19-induced health risks to visitors to the museum, the staff was being", "The next Biennial should take place in the city in 2020, and the first in the country in 2021.  The Chicago Art Institute (CICA) will also welcome visitors in 2020. CICA director Karla deCaires-Bennett said: “If we manage to get through this year without disrupting the biennial, we will be able to move forward with a healthy sense of optimism for the future. We will just have to see.”\n\n\nA group of artists, creatives, writers, and other cultural activists in the United Kingdom are demanding that the government hold an official inquiry into the possible sale of works by a group of artists whose works were included in exhibitions at Tate Britain and the National Portrait Gallery in London in the years leading up to the 2015 UK general election. Following a complaint by the British Council, which represents the artists, the Culture, Media, Arts, and Crafts (BAC) and the National Poetry Library (NPLA), the latter of which featured poems by Salman Rushdie, the Guardian and P.J. Ostrovsky, the government is now reviewing the future of the artists’ works at a time when figures from the BAC and NPLA are circulating that show the", "The next Biennial should take place in New York in 2022. The next Venice in 2024. \n\n\nThe City of Los Angeles (CAL), the City of Angels, and the California Endowment for Art (CAFE) have reached a settlement with the heirs of the late artist and philanthropist Oliver Kurzweil. The five-year agreement, which was finalized on February 5, 2018, grants the three estates of the late industrialist $2 million in compensation for their wrongful termination claim.“Oliver was one of the most generous, generous people I have ever met,” said Richard DeBell, the city’s attorney general and chair of the Los Angeles City Council. “This settlement is a victory for all of us who worked with Oliver to make the arts and culture of Los Angeles possible. Oliver was dedicated to creating a place where the arts thrived and where every aspect of life was touched by art.”The settlement also outlines the next steps for the three estates; it is expected that the three litigation classes will be consolidated into one class action, and that further proceedings will be expedited. The city of LAUSD will have twenty days to file a statement of claim with the court, and the heirs will be", "The next Biennial should also explore new possibilities, from distancing to the environment, with a view to creating an experience that will last a lifetime. Since the first exhibition was held in 1976, the Biennials have been co-organized by the same organizers; the first Biennial was held in Helsinki in 1983. The second was held in Kiasma in 1999. The third was held in Tel Aviv in 2012. The fourth was held in London in 2016. The final exhibition was staged at the Museum of Modern Art in Boston in 2018.\n\n\nThe Museum of Fine Arts (MFA) in Atlanta (MFAAT) has received a gift of more than one hundred works by twenty-six artists whose works were on display in the inaugural edition of the Museum’s new residency program, “Away from the Camera. On View.” The gift includes a selection of works by fifteen artists who have lived or will live in Georgia, including Catherine Maria Alves, Alfred Koons, Kayode Peleko, and Tahira Parks.“We are extremely excited to welcome these artists and see how they will continue their work in our new home at the Museum of Fine Arts,” said", "The next Biennial should be held in 2020 and will then move into its fourth edition in the city. “We are astonished by the level of enthusiasm for the project from all quarters,” said Catherine Dunn, director of the biennial. “The project is an issue that affects all of us, and we are all facing it together.”\n\n\nThe Victorian-Australian Art Museum (VAMA) in Melbourne has appointed Tina Schoonmaker as its new executive director, effective immediately. Schoonmaker will be in charge of the museum’s collection, education, and outreach, which is currently managed by the Victorian Aboriginal and Torres Strait Islander Art Gallery (VATSI), and will begin her tenure in November.“Tina will be crucial in ensuring that we continue to prosper as a world-class contemporary art museum,” said VAMA director Elizabeth Ann Macgregor. “Her leadership qualities, expertise in representing and engaging with Aboriginal and Torres Strait Islanders, and commitment to developing new and innovative ways of thinking about contemporary art make her the ideal person to lead the museum through this challenging and challenging time.”Schoonmaker joins VAMA from the Victorian Aboriginal and Torres Strait Islander Art Gallery (V", "The next Biennial should include a selection of the sculptures, photographs, films, and/or other works that have not yet been published, exhibited, or made available to the public. The exhibition will also include a selection of public works that are not currently exhibited. The Roth Fellow, an artist whose work has been exhibited in Rotterdam, is currently working on a performance for the event titled Kurt Wegmannerte auf denken, a collaboration between an artist and an architect. The selected artists are Aruwelin Abientus-Issouf, Cindy Chen, Matthew Crawford, Lukas Follish, Beth Mathes, Liu Jie, Peng Xiaochuan, Hua Zhangjian, Juliette Ghebaly, Zhang Yilun. The committee that selected the forty-three artists who will participate in the exhibition consists of Matthew Crawford, Artforum editor in chief; Ilya Ehrenfeld, director of the Russian Institute for Contemporary Arts, Moscow; Anna Alekseyeva, director of the St Petersburg Museum of Fine Arts; and Arik Mendelsohn, the director of the", "The next Biennial should take place in the spring of 2021 and will include presentations of new works by artists, including a selection of works by Jussi Hanja, Tanja Rietveld, and Flemming Abney; and biennials that were originally organized as part of the Academy’s 50th Anniversary Celebration in 2017.\n\n\nThe Institute of Contemporary Art (ICA) in New York is launching a new funding initiative that will help artists who are experiencing financial difficulties make ends meet through the loss of income from the September 11, 2011 terrorist attacks. This is the second phase of a $1 million initiative that will also provide financial relief for artists who are directly impacted by the pandemic. “ICA New York will support the creative efforts of working artists who have experienced financial hardship as a result of the Covid-19 outbreak,” said museum director Marc Straus. “The initiative’s first phase will provide a one-time $75,000 grant to help pay for living expenses. The first phase’s second phase will provide $300,000 for artists to benefit from a combination of grants and private donations. The program will launch with fifty grants totaling $100,000. “We are", "The next Biennial should begin in 2020 and address the themes of Theoretical Physics and the Future of Life. “The Biennial is a process,” said Tanja Gebrebscht, director of the Museum of Contemporary Art, Berlin. “The exhibition should be organized in a way that not only invites contemporary concerns but also is accessible to those who might not be able to travel. The next edition will focus on the dialogues between scientists, philosophers, artists, and laypeople and will aim to foster a deeper understanding of how art and philosophy intersects with the physical and physical sciences.”\n\n\nThe Baltimore Museum of Art (BMA) has received a gift of ten rare paintings by artist Percy Sargent from the late founder of the American Expressionist movement, John Barry, the former director of the Abstract Arts Museum and the Serpentine Gallery in New York. Over the course of a decade, the gift shop has donated more than fifty works to the institution. Among the works that have recently acquired considerable attention are The Trial of Thomas Bangs, 1957, a work that has been in the collections of the BMA since 2008, and Painting in the City, 1961, a work that recently underwent a", "The next Biennial should open in 2020, said Lejeune, who will step down after a three-year tenure, and a meeting of the biennial’s board of trustees will convene to consider his future.\n\n\nThe Institute of Contemporary Art (ICA) in London has released the full list of the seventy-six artists who have participated in the ICA Biennial for Visual Arts, which runs from March 17 to March 19, 2020. Titled “Just and Beautiful,” the forty-fourth edition of the event, which launched in October 2015, is currently on view in the British Museum. Among the artists named are Maren Agle, Carol Bauer, Anna C. Bächli, Nada Cerski, Hao Chen, Jodi Donaldson, Eugenio García, Anish Kapoor, Ingrid Nilsson, Rine Olowu, and Mark Pfeifer.“ICA is proud to present this year’s biennial, which is comprised of forty-six artists, and all of whom are talented and dedicated,” said ICA director Emma Rees. \n\n\nThe Museum of Contemporary Art (MCA) in New York has appointed Rob Ellis as its"]