["The next Biennial should be on the ground in Ladakh.  It will then organize a joint exhibition between the two artists as well as a lecture series on humankind’s place in the universe. The two teams will then present the first exhibition of the two artists’ bodies together at a distinguished art museum in Delhi. The show will feature a selection of work from the previous exhibition.“The exhibition of the two works is of great importance for the future of contemporary art and culture in India,” said Arvind Thackeray, the director of the Biennial, which is organized by the National Gallery of Art. The exhibition is also a reflection of the ongoing friendship between the two artists and the Biennial's commitment to creating a more inclusive and diverse art world. The exhibition will feature a selection of work from the previous exhibition.\n\n\nDamien Chazelle and Guy Debussy’s collaboration at the Museum of Modern Art (MoMA) in New York, which featured work in both the seventeenth and the nineteenth centuries, has been officially celebrated at the institution. The biennial’s artistic director, Daniel H. Weiss, said: “Guy Debussy’s work is", "The next Biennial should assess the changing profile of the exhibition. The biennial will aim to extend the scope of the exhibition by introducing a new project, a collection, or a presentation for a particular year, as the event celebrates its thirtieth anniversary. The 2020 edition will be staged at the MAMALADIN Museum in the capital of Bolivia and will feature a selection of works from the collection of the late collector and art historian Augustin Chamorro de Castro. The exhibition will also include a documentary\u0097originally titled \"Toi Birenza\", 1992–2013\u0097that will set the project in motion. The film, directed by René Morales, is a compendium of more than a hundred of Chamorro’s paintings and sculptures.\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Amanda R. Rossow as its next director. Ranging from director to director, Rossow has helmed the museum for thirty-two years and was instrumental in its expansion to become one of the nation’s leading cultural institutions. Prior to joining the museum in 2006, she was the founding curator of modern and contemporary art at the Pacific Standard Time in New York, where she curated the exhibition “", "The next Biennial should be on June 10–11, 2021 and will organize an exhibition of work by artists such as Eduardo Campos, Nancy Davis, and Evan Cohen.The 2019 event, “The Limits of Visuality” also held its first edition, which was held at the Stedelijk Museum in Amsterdam, in January 2020 and featured work by artists such as Michael Hockney, Clara Goodell, Jasmina Habib, and Jamal Hoor. The exhibition won the $100,000 Handel Prize this year.\n\n\nThe Museum of Fine Arts (MFA) in Los Angeles announced today that it is launching a $10 billion capital campaign for its new $2 billion expansion, the Museum of Asian Art. The capital campaign will include the construction of an additional 800,000 square feet of exhibition space and the creation of a new $1.5 million endowment that will help support the construction of a new permanent collection.The MFA hopes to open the new museum in 2021 and will work with private and public partners to design and build the new facility as part of the $1.5 billion “California Dream,” a $500 billion plan that", "The next Biennial should focus on trans and interdisciplinary art and the ways that it intersects with and expresses the universality of the human condition. This year’s selections include new work by women artists from Spain and Panama, and some of the most arresting examples of indigenous craft and creation in the Americas.\u0097The twenty-sixth edition of the Biennial, scheduled to run in 2022, is currently on view at the Museum of Modern Art in New York from January 11–January 14.\n\n\nThe Museum of Modern Art (MoMA) in New York has announced that it will begin welcoming visitors back on Saturday, January 16, 2020. The institution has kept the exact date of reopening a closely guarded secret since it opened in the city in 1999. On Friday, museum director Daniel H. Weiss announced that the museum has been reopening for eight years and expects to reopen in the coming weeks. “The Museum of Modern Art has been remade by an unprecedented team of curators, architects, engineers, and others in the eight years since we opened,” Weiss said. “I look forward to continuing our work alongside our talented staff and our devoted museumgoers, who make the Museum of Modern Art unique among New York City", "The next Biennial should be scheduled for October 2020. Additional funding from the museum’s forthcoming exhibition “Art in the City,” which is currently on view, could also be forthcoming.\n\n\nAmerican painter and sculptor David Adjay, whose electrifyingly lifelike landscape sculptures embodied American dreams of the active, radical, and tribal, died last week at age ninety-three. He is survived by his grandson, Rachel Adjay; his granddaughter, Myra Adjay; and his granddaughter, Rachel Adjay’s sister, Nancy Adjay.Born in New York City in 1932, Adjay studied at the School of the Art Institute of Chicago (SAIC) and the University of Pennsylvania before settling in New York with his wife, the American artist Betty Parsons. After working on the ground in New Jersey, Adjay returned to the city for a residency in 1967, where he continued to carve his sculptures, which employ a three-dimensional, terracotta landscape of grass, water, and ferns—more than 3,000 individually numbered pieces—through a combination of improvisation and his own body. In the 1976 HBO documentary I, Daniel Blake, Adjay explained how he and his wife created the works, which", "The next Biennial should be staged at the Museum of Contemporary Art, Los Angeles (MCA); the Venice Architecture Biennial; and Singapore Art Museum.  The dates and venues have yet to be announced.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Patrick DiNardo as its new deputy director. DiNardo succeeds Jack Sheehan, who has served at MoCA for twenty-two years, and will take up his new post on March 8. DiNardo, who has previously served as director of the Asian Art Gallery in New York, is a member of the board of trustees of the Museum of Contemporary Art (MoCA) and is the founder and managing director of the New York–based firm DiNardo & Partners. He succeeds Mark Maffi, who retired in March 2019 after twenty-five years at the helm of the institution.“Patrick brings with him an extraordinary track record of success in the field, both domestically and internationally, and a deep and vibrant passion for the art world,” said MCA director James Cuno. “In the last two years, his firm has been a valued member of MoCA’s team, and his expertise and enthusiasm for the", "The next Biennial should take place in the German city of Bonn, Germany, in 2021. \n\n\nThe Los Angeles County Museum of Art (LACMA) has received a gift of more than two hundred photographs by the celebrated British artist David Hockney. The work, which is valued at between $100,000 and $250,000, was acquired by the museum in a three-way deal that included the purchase of a set of two hundred photographs, a film camera, and a Power Point projector.The gift was made to LACMA on October 7, 2017. In addition to the photographs themselves, the museum received a lifetime supply of his work, which includes a complete set of his prints, two notebooks that chronicled his early career, and two photographic prints, known as the C&D series, which are currently on display in the gallery.“We are incredibly grateful for the support of the LACMA Family, our staff and supporters, and are excited to present this historic and celebrated collection to the community in 2018,” said Mark Devlin, LACMA’s executive director. “David Hockney’s photographs are a stunning tribute to his many accomplishments and a source of inspiration for many", "The next Biennial should be held at the Centre Pompidou in Paris in the second half of June 2020. The next edition of the Tokyo Biennale will be held in the autumn of 2020. The next edition of the Venice Biennale will be held in the spring of 2021.  The next edition of the Parisale will be held in the spring of 2022. The next edition of the World Architecture Biennale will be staged from April to June 2022.\n\n\nThe Royal Shakespeare Company in London announced today that it is winding down its production of Richard Linklater’s The Social Network, which has been around since 2005 and is currently on display at the 2019 Royal Shakespeare Company (RS) Biennial. According to the New York Times, the show’s production company, David’s Picks,  said that the decision to pull the play—which is currently on view at the RSC until September 17—was made in light of the company’s ongoing engagement with the ongoing conflict in the Middle East. The decision to cancel the show has been made in light of developments in the Middle East and North Africa, the region’s epicenter of a global refugee crisis.", "The next Biennial should focus on the rich interplay between art and politics, the environment and philosophy, and the world and its inhabitants. In an age when political and cultural issues are often conflated, we hope the new art biennials will focus on the interconnection and political possibilities of human life and the environment.”The 2019 edition of the fifth Biennial, “Thearhus Biennials,” will take place at the Royal Academy of Arts in Denmark and will be staged at various locations across Denmark. It will also be accompanied by a new book, “Art and Climate Change,” which will be published by the Royal Academy of Arts in 2020. The Royal Academy of Arts is a cultural heritage organization based in the city of Copenhagen, the capital of Denmark, and is a UNESCO World Heritage Site.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, is planning to shutter its doors to the public in March 2020, in an effort to reduce the city’s greenhouse gas emissions. According to the Los Angeles Times, the museum’s longtime home in the historic district of Boyle Heights is also being shuttered, and plans for a renovation that will eliminate the building’s inside courtyard and improve", "The next Biennial should take place in the coming months.\n\n\nThe Nanjing Diaries: China Historians and the Making of Modern Japanese Art, which is currently on display in the Nanjing Fine Arts Museum in China, has announced that its next edition will take place in August. The exhibition will feature six exhibitions that examine the history and the art of Japanese modernism from the late nineteenth century to the present.The exhibition will be organized as follows:The exhibition, titled Nanjing Diaries, the first of its kind in Japan, will highlight the history of contemporary Japanese modernism from the nineteenth century to the present, as exemplified by the exhibition “Nanjing Diaries: Art and Illusion” , which will remain on view until March 23. In the exhibition, which will also include works by the aforementioned artists, the twenty-six year old artist Tatsuya Fujii will present a retrospective of his work Tatsuya Fujii: The Art of Illusion. The eighteenth exhibition, “Nanjing Diaries: Modernism and Illusion” , will open on June 1 at the Nanjing MFA in Shanghai and run until August 5.The next exhibition will be the ninth and last in the series, which", "The next Biennial should be in September 2021, when it will show the final part of the trilogy—Civilization 6, which was completed in 1989, and will be on display in the Grand Duchy of Luxembourg. \n\n\nThe California Institute of Technology (Caltech) has named John Cunningham the next director of its Center for Computer and Information Science (CCIS) in Pasadena, California. Cunningham joins the institute from the University of California, Berkeley, where he has served as chief of the Computer and Information Science department since 1993. He succeeds Stuart K. Whitney, who was appointed director of the center in September 2018.“John has been instrumental in advancing the Center’s long-term goal of providing computational, data-driven, and information-centric research in the fields of artificial intelligence, machine learning, and robotics,” said Linda Kalogridis, chair of the university’s board of trustees and the board president. “His passion for art and science, combined with his ability to create work that engages with and enriches the Center’s mission, has made him a perfect fit for this new role. We look forward to working with him as he continues to expand the Center’s research, both", "The next Biennial should focus on the history of U.S.-Mexico relations and should be held in a decade. The first one should take place in the fall of 2020. That would give the public more time to reflect on the current relationship, which has been fraught with tension since Trump was elected.\n\n\nThe Museum of the City of New York (MoCA) will move the final twenty-six works by Chicago-based artist Gwang-An Chai from its permanent collection to a new museum in the city. Named for its founder, Gwang-An Chai, the venue will be named after the late collector and philanthropist Larry Fink, who donated the institution and his fortune to the museum in 2011.Museum director Christopher Campbell told the Art Newspaper that the move is a \"great honor to take on this new role and to bring these important works to MoCA. They are deeply embedded in our collections and make this museum a truly global destination.”The move will also allow the museum to establish a new collection of works by Chua and American artists whose legacy is intertwined with the city of Chicago and the city of the museum. According to Campbell, a Los Angeles native, the institution will also receive $10 million to begin the construction", "The next Biennial should be held in 2021, according to the organisers, with the first edition slated to kick off in May 2022.There is, however, one major hitch with the proposed date: The 2022 edition will take place in the United Arab Emirates, meaning that if the event is rescheduled, it will likely lose almost all of the original April 29–April 19th slot. A statement issued by the institution says that a new date will be announced soon.The 2019 edition, titled Rebel: A Biennial of Art in the Arab World, was moved from March to March 20 and featured new works by more than twenty artists and activists. Among the artists who will be represented are Hoda Al-Ibrahim, Lina Al-Khalidi, Ahmed Aboul Gheit, Ali Abunimah, and Eshaq Al-Qasimi. “The twentieth edition of the Baad Museum is on schedule and on schedule,” said Mali-based art historian Sheikh Raheel Saeed, who was awarded a lifetime achievement award by the institution in October. “The events of the last two years have definitely accelerated the theme and the point of view of the exhibition, creating a new", "The next Biennial should be held in the spring of 2021.  As the first artist-led exhibition in South Africa, the work of Turner Prize winning artist Simon Holmes will be presented alongside works by more than fifty established and emerging artists and writers.“The Biennial is an important step in the development of South African art, and my hope is that it will inspire and enlighten an international audience to live and work in peace and harmony,” said Robinson. “The 2019 Biennial brought together art of a new and urgent kind, a kind of timeless art, which sought to create new and interesting experiences with traditionally circumscribed materials. I am thrilled that the exhibition will continue to present these pieces and others in the catalogue for a new audience, for a new generation to enjoy.” The work of the twenty-eight artists represented in the catalogue will be presented by Jacobin, Becker, Borthwick Gallery, Chery, David Kordansky Gallery, Gagosian, the Georgian Museum, the Metropolitan Museum of Art, and Tbilisi Art Museum.\n\n\nThe Museum of Modern Art (MoMA) in New York is revamping its collection by adding fifty works by contemporary artists in an attempt to balance the", "The next Biennial should be held in 2021, when the museum will mark the opening of a new series of exhibition spaces designed by the distinguished British architect Foster & Partners.The museum is currently undergoing a £500 million expansion, which will include the construction of new galleries, classrooms, workshops and spaces for public programming and an exhibition hall. “The new facility is a real game-changer for the Biennial and will set the stage for what is to come,” said Bruno Latour, director and CEO of the Biennial San Francisco.\n\n\nUS President Donald Trump has signed an executive order banning travel from seven countries—Iran, Iraq, Libya, Somalia, Sudan, Syria, and Yemen—to the US. The order includes a number of controversial measures, including a 90-day suspension of visas for citizens from Syria and a ban on travellers from Iran and Iraq. It also suspends the entry of refugees for 120 days and suspends the refugee admissions rate for three months.“This is the largest travel ban in US history, and it is being enforced with incredible speed and efficiency,” said Stephen Hahn, US secretary of homeland security and public safety. “This is a total and complete shutdown of refugees, immigrants, and visitors", "The next Biennial should take place in the spring of 2021. The first will be the inaugural edition, which will focus on the work of marginalized artists in the form of a variety of installations and performances. The second will include works by artists from underrepresented groups, including South Asian, Indigenous, and Black communities, and will be held in the fall of 2021.The 2018 exhibition “Hear Now: Art in History,” curated by Cecilia Herrero and Bénédicte de Montlaur and Cary Elizabeth Talbot, was staged in September and September 2019, and was organized by the Los Angeles County Museum of Art and the San Francisco Museum of Art. The exhibition, which was founded by the Los Angeles Public Library in association with the Los Angeles County Museum of Art and the Los Angeles County Museum of Art, featured work by numerous artists, including Carlos Castaneda, Hélio Oiticica, and Rosemarie Trockel.The 2019 edition of “Art in America,” curated by Joseph E. Chiu and released by the San Francisco Museum of Art, featured work by artists such as Ed Moses, Carmane Lopes, and Natalia Sala, and attracted a record audience. The", "The next Biennial should be held in the year 2021. The Biennial will be hosted at the Museo de Arte Contemporáneo in Madrid and will take place in the spring of 2021. The first edition of the event, held in 1999, featured artists such as Eike Hoffmann, Rirkrit Tiravanija, and Pilipin Mukherjee. The 2019 edition, which is still on display in the Museo Arte Contemporáneo in Madrid, featured a number of young up-and-coming artists, including the new names of Malayan artist Tayyab Daig, Lendlal Dunyas, and Mizanur Rahman.\n\n\nThe University of California, Los Angeles (UCLA) has appointed Maria C. Pérez-Díaz as the next director of the School of the Art Institute of Chicago. She will take the helm from Nancy Spector, who retired in March 2019 after three years at the helm of the school, at a special session of the board of trustees held on Friday, March 13.“The board is thrilled by her appointment and look forward to working with Maria to support the Art Institute of Chicago in our ongoing collaboration and collaboration", "The next Biennial should also include a discussion on how the museum’s collections and exhibitions are affected by climate change. Maureen Kelly, curator of modern art at the Metropolitan Museum of Art, told the Art Newspaper that the first exhibition at the museum in the new decade will focus on climate change not least because it is a critical time for art museums in the United States and around the world. The plan is to invite twenty-nine institutions—including the National Gallery of Art, the Metropolitan Museum of Art, the Museum of Modern Art, and the Museum of Contemporary Art Detroit—to present new works by artists in the coming months. The exhibition, titled “Art of Living Light,” will open on September 1 and run through January 20, 2021.According to Artnet, the 2017 Paris Climate March, which drew more than twenty thousand people, was organized by the Paris-based organization the Science Museum, the Louvre, and the Palais de Tokyo. The event raised more than six hundred thousand euros for the museum. France will continue to be the largest emitter of greenhouse gases in the world until 2025, when the COP21 conference in Cancun, Mexico City, is due to come to a close. The", "The next Biennial should take place in the spring of 2021 and is currently under consideration by the biennial’s artistic board. The deadline for submissions for the inaugural edition was April 7. The exhibition will be presented by the South London Gallery (SLG), and will run concurrently with the Frieze London fair, which will likely draw up to 3,000 attendees this year.The exhibition’s inaugural edition, titled “The Fictional Landscape: The Landscape of Land and Water” (2019), showcased a wide range of work on paper by thirty-nine artists, including David Adjay, Eleonora Dallý, László Kálmán, and Los Angeles’s Rodney Barlow. The second Biennial, titled “The Fictional Flesh: From Surrealism to Modern Art” (2018), took place in the fall and focused on the work of nine artists. Lee Dalloy’s exhibition “Contemporary Art in New York, 1920–1940” (2018), a show organized by the Long Island Museum in New York, was taped in early 2019.\n\n\nThe Chinese government has sanctioned the opening of an exhibition of work by forty-four artists", "The next Biennial should be held in New Delhi in 2021. The fifty-ninth will be held in Port Blair, Scotland, in 2022. The eighty-second will be staged at the Fondazione Prada in Milan in 2022. The next edition of the Fondazione Prada will be held at the Fondazione Cattelanazio in Milan in 2021. The thirty-third and the thirty-fourth editions of the Fondazione Cattelanazio, respectively, will be held in Rome in 2020 and 2021, respectively. Selected by a jury comprising Giulia Battisti, Sara Catrina, Dario Catellani, and Stefano Cattelanazio, the fifty-ninth edition of the Fondazione Cattelanazio will take place in Rome in 2021. The forty-ninth edition of the Fondazione Cattelanazio will be held at the Museo del Prado, in Milan, in 2020. The seventy-ninth edition of the Fondazione Cattelanazio will be held at the Museo del Palazzo, in Genoa, in", "The next Biennial should be held in February 2021, the artist told The Guardian. The exhibition will be hosted by the São Paulo Bienal and the Biennale at São Paulo, and will feature work by a group of Brazilians, including Mariana Miranda, Mina Maria Miranda, and Marcela Miranda, and will be hosted by João Moulène, the director of the Botanical Gardens of the Faculty of the Arts in the city of São Paulo, Brazil; Roberto Rebollo, the director of the Museum of Modern Art in St. Petersburg; and the Portuguese curator Fabiana Pereira.The exhibition is also cofounded by the artist and poet Sander Holle, who was awarded an honorary doctorate at the museum. During the ceremony, Holle and Pereira received the Biennale’s Golden Lion for their project “I’ve Been Taking Pictures And Knew I’d Never Be Seen By A Photographer.” The ceremony was also attended by artists and cultural workers from the United States and Europe, including Maya Lin, Ana Mendieta, and Agustín Pérez, and was filmed by the artist and filmmaker Luiz Altamirano and edited by the", "The next Biennial should be in 2021, and the first will be held in 2022. The first exhibition will feature “Plant the Present: The Biennial” (2019) and a selection of works that were previously underrepresented or absent from the exhibition. The second show will focus on the “12 Years a Slave” (2019).The Far East Biennial (FAB) is still working through the initial plan for its 2021 edition. “We have not decided yet whether to continue with the program as we are still considering all possible options,” said the organizers, who were advised by the FSB and the Flemish Central Council. Participating artists included Lin-Manuel Miranda, who played the title role of Shakespeare in “Plant the Present: The Biennial” (2019); Hiroshima Tada, who performed his first performance in the “Twilight Zone” (2019); and Konstantin Antonov, who was awarded the Nobel Peace Prize in 2010 for his contribution to the history of photography in 2019. The prize was presented by Björn Fischer, chairman of the Flemish Ministry of Culture. The 2020 event", "The next Biennial should be held at least once a year, and will be held at the Art Institute of Chicago in 2021.\n\n\nThe Tunis Museum of Art (TAMO) in Tunis, the largest privately run museum in the Arab world, has announced that it will reopen to the public on August 27. Following the reopening of the museum in the city of Beiji, Tunisia, in December 2019, the institution closed to the public for a period of six weeks to allow the construction of the Museum of Tunis. “We are very happy with the outcome,” told the Art Newspaper. “The building of the Museum of Tunis is one of the most important projects of our history. It will provide an excellent platform for Tunisian art and will draw huge interest from visitors from all over the world.”In addition to the restoration of the museum, the Tunisian government also pledged $17 million in aid to the institution. The funds will be used to improve the infrastructure for the construction of the museum, including the construction of two new parking lots and the renovation of the existing building. The project is expected to cost $220 million.\n\n\nThe contemporary art enthusiast was once thought of as a pedestrian-friendly destination. But according", "The next Biennial should be held in 2020 but the date has yet to be decided.\n\n\nThe Museum of Contemporary Art (MoCA), San Francisco and the San Francisco 49ers are in the process of merging into one company. The move is expected to create a new entity, the new company that will operate as the new parent company of the two major US sports teams. The move was announced by CEO Kimeni Jennings and CEO of art-world powerhouse Sotheby’s Paul Graham in an open letter addressed to the public and published by Artnet. The letter stated that the merger will “provide greater synergies and efficiencies for our partners’ portfolios, increase our exposure to leading-edge art, and deliver a more competitive and compelling marketplace for contemporary art.”The announcement comes on the heels of a tumultuous few months for the arts. On October 3, an announcement by Chief Executive Officer Marc Glimcher that the company would be “taking a step back” from the arts had he not already started the “exploration and evaluation phase” of a new corporate plan. The company had previously announced that it would remain in business as usual but will now attempt to “explore different models, different opportunities,", "The next Biennial should take place in the second half of the year in the second city of St. Petersburg. The exhibition will draw 1.5 million visitors, and will be led by the artist-run, non-profit museum, a partnership between the artist, the museum and the city of St. Petersburg. The exhibition will be a departure for the Biennial, which has historically held weekly public events in the capital. The biennial will be hosted by artist Marina Khodakova, curator of art at the Museums of Fine Arts in Kiasma in the Russian Far East, and will run from January 27 to March 2, 2020.\n\n\nThe W. K. Kellogg Foundation, the Kellogg-Briand family foundation, and the Fabian and A. A. Kellogg Foundation announced today that they are teaming up for a new $3 billion initiative to help African American arts. The initiative will give $3 billion to historically Black institutions across the United States as well as more than $800 million to indigenous cultural institutions. The funds will be divided between seventy charitable organizations based across twenty-eight states and the District of Columbia.The foundation’s new grant program, the KW Faulk", "The next Biennial should be held in the city in 2022. \n\n\nThe J. Paul Getty Trust announced today that it will donate one hundred artworks by twenty-five artists to the Getty Center in Los Angeles for its permanent collection, which comprises more than seven thousand works. In recognition of the trust’s long-standing commitment to supporting the Getty’s research and scholarship, the gift includes works by artists such as Robert Irwin, Hélio Oiticica, Pablo Picasso, Jane Pitts, Hernán Cortés, and Agnes Martin, as well as works by artists who have been designated as having ‎a significant future impact on American art.The gift comes at a pivotal moment for the Getty, which is currently being transformed by a new, $3.5 billion renovation. The centerpiece of the project, a twenty-four-story glass-enclosed museum, the Getty Villa, is slated to open in the fall of 2022 and will be completed by 2020. The Villa will be housed in the same building that houses the Getty and will house nearly seven thousand works, including paintings, drawings, sculptures, prints, photographs, audio-visual recordings, and several videos. The museum is also planning to open a new companion exhibition", "The next Biennial should be hosted at the Nativity of the Blessed Virgin Mary Church in the city of Munich from March 7 to March 12, 2020. It will be led by a panel of artists and scholars, and will comprise lectures, essays, and other events that will be comprised of inter-disciplinary approaches to an exhibition of the work of the museum to give an intimate view into the work of the artists who created it. Will be inaugurated by a presentation of work by the contemporary artist Jan Gotoč, and will be followed by a series of performances by the same group of artists in the German city of Baden-Baden.Later this year, the Biennial for the Visual Arts in the German city of Brescia will be held in the autumn of 2020. \n\n\nThe National Gallery in London has appointed Simon Leigh as its new director. He succeeds Mark Pincus, who was appointed in June 2019 following a four-year stint as the head of the Royal College of Art. Leigh will take up his new post in November.“Simon brings with him a wealth of experience and knowledge in the fields of international art and modernity, and will be crucial in our continued success as we embark on our new relationship with the National Gallery", "The next Biennial should be held in the spring of 2021, according to the organizers, who also said that Google will provide worldwide Internet access across the globe through its own artificial intelligence system Artificial Intelligence for Plants/Landscapes. The artificial intelligence program will help the museum to understand the artworks and will analyze the artworks and its surroundings in order to understand how the artworks were made.“We expect the next edition will be an extraordinary and extended experience,”said Dummy�s director, Takashi Kitayama. “We are still in the process of deciding what the themes of the Biennial will be. We are convinced that Artificial Intelligence can do great work in understanding the Art, so we are eager to collaborate with Google as they work to develop a new platform for knowing and interacting with art.”\n\n\nThe Philadelphia Museum of Art (PMA) has released guidelines for how museums should handle protests and riots over the deaths of George Floyd and Eric Garner, the black men who were killed by New York City police officers in a stoking of tensions sparked by the release of video recordings of the incidents by the grand jury that declined to indict officers involved in Floyd’s killing of George Floyd.A March 22 letter from", "The next Biennial should take place in the summer of 2021. “Artists and Breakers” is organized by the New York–based artist-run nonprofit Transworld Artists’ Union in partnership with the Institute of Contemporary Art in London (ICA) and the Art Institute of Chicago. “Theatre of Cruelty” is a joint project between the British artist-activists Playwrights Union and the London-based production company Playspace, which is represented by the London-based collective Playspace Project, and the Royal Shakespeare Company. The project is part of the “Endless Spring” series\u0097a media-campaign promoting cuts and austerity. The works will be on view in the exhibition “Theater of Cruelty” at the Biennale in March 2021.\n\n\nThe Pulitzer Prize–winning arts critic for February 2019, Gwen Ifekoya, has been appointed director of the Museum of Fine Arts (MFA) in Boston.  Ifekoya will be based at the museum for two years, ending in March 2021, before heading out to New York City to begin her new position. “With her extensive experience as a curator and as a scholar, Gwen has the", "The next Biennial should explore how the work of contemporary artists, both conceptual and commercial, has been impacted by their respective curators, and how this work can be reassembled into a conceptual work for the next edition. \n\n\nThe São Paulo Biennial, a three-day event that celebrates Brazil’s indigenous artists and their contributions to Brazil’s art, has announced that they are planning to suspend the exhibition until the coronavirus ends its spread.“We are all facing challenges, but we hope that in the coming days and weeks we can return to the performances, to the exhibitions, to the works,” said Pia Camil, the artistic director of the exhibition and a former director of the Museu de Arte de São Paulo (MASP). “We will not exclude from the rest of the year, nor will we reduce our studio shows to the physical performance. We will continue to present an exhibition which is full of ideas and performances, and which brings together indigenous and non-indigenous artists from Brazil.”The fifteenth edition of the show, titled “Aboriginal and Other,” will run from February 17 to February 21 in Porto Alegre from March", "The next Biennial should be on-site in the museum until October 21–October 23.\n\n\nThe Mariner Davis Gallery in Santa Monica, California, has received a gift of sixty-seven works from the artist, who passed away in April 2019,   The New York Times reports.A fan of Mondrian’s work, which is often linked to the early works of Eduard and Henri Matisse, the couple donated the works to the institution in February 2018. The works were in storage at the time of the donation, and will be on display in the museum’s exhibition “Matisse: The Complete Works” for the first time in 2021.The works are from the sixteenth through the thirteenth centuries. In his review of a recent exhibition of works by Davis at the Museum of Modern Art, Adam D. Weinberg wrote: “Since the early 1960s, Davis has been a major force in the field of modern art and certainly the most successful. His art has been featured in countless major exhibitions—including major ones at the Museum of Modern Art, the Whitney Museum of American Art, and the San Francisco Museum of Modern Art.” The gift of the works is the latest in a series of works that", "The next Biennial should have a new studio and a new exhibition, a new programme of exhibitions, and a new theme.”Artforum has reached out to the biennial for comment.\n\n\nThe Museum of Fine Arts (MFA) in Boston is planning to move its exhibition \"Art Preserves: A Conversation in Memory\" from July 26 to June 30. The exhibition, which focuses on preserving and presenting artworks that have had significant conservation successes, will be relocated to the museum’s new 263,000-square-foot space at 68 Boylston Street, which is currently undergoing a $100 million expansion.“The new museum is built on an ambitious mission to foster a more informed, responsible, and collaborative conservation of the world’s art,” director Daniel H. Weiss said in a statement. “Now more than ever, the MFA has a strong future and a compelling mission in preserving and presenting the world’s great art.” Inaugurating the new museum are “Art Preserves: A Conversation in Memory” (June 25–June 28), “Art in the City: Cities and Collections,” curated by curator Mary Anne Hay and curated by Weiss, and", "The next Biennial should take place on December 9th. The next exhibition should be on January 8th.The exhibition was established in 1988 by Danish artist Lars-Erik Lennartstrebk, who was granted a commission by the Danish government to create a virtual reality exhibition based on the life and work of Peter Paul Rubens. It was renamed the Biennial of the Arts after its opening. The competition consisted of fifteen artists, including Olivier Castéra, Jann Marden-Leblanc, and Martijn de Waal, in collaboration with the Danish art historian Helene Nygaard. The exhibition was broadcast on Danish television until 1991. In 1992, the exhibition was moved to the Museum of Modern Art, Copenhagen, and the Peter König–designed building in Copenhagen was renamed the Biennial of the Arts.In 2018, the Biennial of the Arts was presented at the Museum of Contemporary Art, Toronto, and the exhibition was one of the few to be presented simultaneously in the United States and Europe. The event received a Best of the Year Award from the American Institute of Art in 2019.\n\n\nThe University of Central Lancashire (UCL) in England is to welcome the first visitors in more than two decades to its new", "The next Biennial should be held at the University of Vienna in December 2020.  The next International Biennial will be held in the capital of Vienna in February 2021. For the first time in its fifty-year history, the Biennale will also be open from November to March. Unlike the previous two editions, the 2019 edition will be hosted by the Nationalgalerie in Vienna and will not include artworks, films, concerts, exhibitions, or performances.  The new format will represent a deep rethinking of how contemporary art should be organized, curated, and presented. Commenting on the new model, the festival’s artistic director Prof. Lorenzo Samacucco said: “The next version of the Biennale will be an exploration of the importance of time in art and how art can be used as a vehicle for philosophical reflection, political action, and spiritual renewal. The theme of the 2019 edition, ‘Reality and the Art of Motion’ will be immeasurable for the following year.”\n\n\nThe director of the London-based Biennale, Sabine Vermeer, was forced to resign in June 2019 after she spoke out publicly about her dist", "The next Biennial should be held in the mountains of the Russian Far East, in the city of Ulan-Ude. The first edition, entitled: МВы этомаются, was held in 1998. The second, titled: МЧНИЗ, regularly staged at the Museum of Contemporary Art, in St. Petersburg. The exhibition drew high marks from international critics and, in 2001, a documentary film version was made, titled МThe Past and Present. In 2006, the exhibition was again staged at the Museum of Contemporary Art, in collaboration with the former director of the Russian Academy of Arts, Anatoly Lunacharsky, and Martin Csiktaz.The exhibition’s first director, Oleg Taveras, retired in 2014. In 2015, the museum commissioned an artist-in-residence to lead an international panel on the history of Russian art, “On the Present and Future of Art.”  \n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines for the return of artworks and cultural artifacts looted from the World War II-era", "The next Biennial should take place in London in 2021, and the fifteenth in the US in 2021, and will also include works by artists from Asia and Africa.The broadest possible collection of contemporary art from the Commonwealth includes works by artists such as Franz Kline, Huxley, and von Trapp, as well as works by the Haus der Kunst, the Modern Gallery, the Whitney Museum of American Art, and the Willamette Museum of American Art, which will each feature three works. The museum will also stage a new exhibition of works by independent artists.“The decision to unearth the remarkable Collection of the Commonwealth was a difficult one for us, and one that we acknowledge has been difficult for everyone, including our trustees, who have been deeply impacted, we believe, by the impact of the Fund over the years,” said Liz Duncan, chair of the trustees. “We thank our colleagues, trustees, and supporters– as well as the public, who have supported the Foundation over the decades. We hope that this new era of Art History will be a time of renewed appreciation and appreciation of the extraordinary collection of modern art, and an opportunity to recommence the Museum’s long-standing commitment to the collection.", "The next Biennial should be held in 2020.”The second edition of the Biennial was held in Seoul in October 2019. The exhibition traveled to New York in March 2020 and to London, Paris, and New Delhi in March 2021. For the 2020 edition, organizers will unveil the new work on the first day of the month, October 6. In addition to a selection of forty works, the biannual exhibition will have a database of over one hundred thousand photographs and will present an original work by forty-three artists. The first project of its kind, the exhibition will be organized as a platform for the creation of new works by Korean artists and will feature thirty short films by women and children. “The Future is Brightest,” a solo exhibition, organized by Park Eui-sung and Park Hyo-sung as part of the gallery’s collaboration with a variety of cultural institutions in Seoul, will also be held at the exhibition space. The pair will present their first exhibition together as a group in the country next spring. Park Eui-sung said: “We are honored to collaborate with the Contemporary Art Museum Seoul (CAM Sengdong) and the National Museum of Contemporary Art in Seoul to", "The next Biennial should take place in 2020. \n\n\nThe Egyptian Museum in Cairo, which was temporarily closed due to the coronavirus on March 24, is planning to reopen in early April. The reopening of the museum will be delayed by one week following the coronavirus outbreak. The new date is April 28.According to the Art Newspaper, the new exhibition, “Egypt: The Past,” will be organized as follows:The exhibition will feature new works by more than seventy artists, including a selection of works by Naguib Mahfouz, Osman Jumfouz, and Abdel-Rahman Naguib, and will feature a retrospective of the work of Sajid Jumfouz, a selection of works by Abbas Naguib, and a special exhibition of works by Naguib Mahfouz’s wife, and a sculpture by Egyptian artist Naguib Mahfouz.“We are ready to welcome visitors again,” said Abu Dhabi director Ahmad Bin Ahmed. The exhibition’s curator, Barnabas Emre, added: “Egypt: The Past,” “brings together the works of the most distinguished artists", "The next Biennial should be held in 2020.\n\n\nArtist association Fotopass has announced its representation of the artist and activist Bexley Hepworth. The exhibition will be led by artist-activist and blogger David McAllister and will take up topics such as climate change, human rights abuses, and intersectionality.McAllister\u0097who works primarily in performance and performance-based art\u0097has been involved in fighting against climate change since the 1980s, and has been featured in exhibitions such as “The Body in Play: Breathing Art and Climate Change” at the House of Art in New York in 1995 and “The Body in Motion: Artists in Motion” at the Museum of Modern Art in New York in 2007. He said: “This exhibition addresses the urgent need for artists to take climate change more seriously, yet at the same time celebrates the many talents who are already working at breaking the climate-destroying power grid and creating a more livable world.”The exhibition will consist of over twenty-two paintings by Hepworth, some of which were created before she disappeared in 1990 and others which were completed in the ’90s. The works are based on the artist’s experiences of", "The next Biennial should be held in 2020.\n\n\nThe Metropolitan Museum of Art in New York has appointed Daniel B. Weiss as its next director. Weiss comes to the Met from the Museum of Contemporary Art (MoCA), where he is the founding director of the contemporary art gallery, the contemporary art museum, and the institution. He succeeds Meg Lanter, who retired in January 2019, and will assume his responsibilities on September 1.“Daniel Weiss’s past work as the director of the Met and as a curator has been critically acclaimed and his work has been exhibited at many international and national institutions, including the Venice Biennale, the Museum of Modern Art, the Museum of Modern Art, and the Whitney Museum of American Art, the latter two of which he has curated,” said Michael Govan, the museum’s executive director. “We are looking forward to his leadership and his ability to build on the Met’s rich legacy and to reimagine how a contemporary art museum should work.”In a review of his work for this year’s Venice Art Week, Artforum wrote: “Weiss is a man who has built his career on the conviction that art has a power to reshape", "The next Biennial should take place in 2020. “The one hundredth anniversary of the birth of the artist is approaching, and suddenly the prospect of a new exhibition seems even more exciting,” said Marc-Olivier Gaillard, the director of the Triennale d'Art et d’Agathe.The exhibition had been on indefinite hold since April, with organizers citing the coronavirus as a reason for the indefinite suspension of the event. In an attempt to get the exhibition back on track, the organizers have recently been making steady cuts towards the duration of the exhibition, which is currently scheduled to run from March 27–March 31.According to the New York Times, the exhibition’s original budget had been cut by more than half and its 2019 edition’s planned opening date had been pushed back to June. The show, which had celebrated its thirteenth anniversary earlier this year, has also drawn flak for moving forward with the opening date in March, even though the French health authorities have warned that the virus is spread only from person to person. During the pandemic, the fair was forced to cancel a number of events and has had to make several cuts to its programming. \n\n\nMore than 1,500", "The next Biennial should be held in 2021. The fifty-fourth was organized in 2009 and runs through March 16.\n\n\n\n\n\nHannah M. Reimer, chair of the Department of Arts at the University of California, Los Angeles, has introduced a new prize that will honor the contributions of forty-nine artists to the arts—more than 50 percent of whom are women, African Americans, and people of color. The inaugural program, entitled “Women Artists” and curated by Helen Cammock, will aim to foster a more integrated and inclusive arts landscape by recognizing and representing the contributions of underrepresented artists and groups.“This year’s biennial celebrates the contributions of artists of every community, and we are excited to feature forty-nine artists who have made meaningful contributions to the arts this year,” said Reimer. “While the biennial is a stepping stone for young artists to move to the center stage, it is vital that we carefully consider the impact the biennial will have on its artists and communities, and the artists who will be returned to the stage next year.”Cammock, who was nominated for the prize and for her work,  Forbidden Anniversary, which opens on Monday,", "The next Biennial should be a tribute to Migratory Bodies, a work by Agnes Martin, which will be staged at the Museum of British Art in New York from January 25 to February 27. \n\n\nThe National Museum of African Art (NMA) in Washington, DC, has announced that Jessica Blayde has been appointed as its next director. Blayde comes to the institution from the Smithsonian American Art Museum in Washington, DC, where she has served as director since 2016. She succeeds Mary Bottinelli, who retired after twelve years in January 2019, and will take up the post on February 3.“Jessica is a leader, an innovator, and a visionary,” said cochair Bob Gray. “We are deepened by her success as a curator and admire her bold vision for the NMA’s collections and exhibitions. We look forward to seeing where Jessica takes the NMA next.”Over the course of her thirty-year career, Blayde has developed and implemented a number of bold new programs to enhance the museum’s collection and public experience, including the museum’s first online exhibition of works by Yinka Shonibare and the museum’s retrospective", "The next Biennial should be back in 2020, with a new exhibition following. \n\nFor the past twenty years, Silver Theater, an independent partnership between the New York City-based collective, Creative Commons, and the M.I.T. Institute of Art, has hosted a series of exhibitions that celebrate the work of Black artists in the city. Each year they have selected the same artist, and presented the same exhibition. “Like many Baltimore cultural institutions, we are incredibly grateful for the support of the city’s artistic community,” said Mayor Catherine Pugh. “These artists and their families are the backbone of the city’s creative ecosystem, and we are committed to supporting their work and their artistic endeavors in any way that we can.” \n\n\nAfter a group show at the Museum of Fine Arts (MFA) in Boston last week, the institution announced that it is reopening to the public on September 27. The announcement followed a public meeting held on September 19, following which curators, artists, and other staff members signed a statement of intent to support the MFA’s decision to reopen.“We at the Museum of Fine Arts are glad to open our doors to the general", "The next Biennial should be on October 26.\n\nThe announcement of the ten new works is a resounding success for the Mental Health (H) Foundation. The organization had previously chosen fifteen works for the 2020 exhibition, which is curated by the Sydney-based artist and activist Dario Catellani and runs through the end of March. It hopes to raise $6 million for the development of treatment programs and community-based organizations that will help people suffering from mental health.“The work that has been chosen for the biennial is by a group of ten artists, including the China-based artist and activist Yi Yan, who have collectively been working to create a new kind of art exhibition. Their new exhibition will be a treat for both the artists and the public,” said Hélio Oiticica, director of the Mental Health (H) Foundation. “The show will be a combination of new and exciting works that challenge a variety of philosophical, political, spiritual and structural concerns, and will be presented in a manner that is accessible to the general public and will be deeply meaningful for the artists.”The ten works selected for the biennial are Angel, Beloved, The Cherry Truffaut Bridge,", "The next Biennial should be held in the evening between 2.00 and 2.30 of each month to give the public a chance to see the exhibition and to participate in activities that foster creative and social life.”The announcement follows a year of work by artists and designers in collaboration with the city of Seattle around the theme “Film and Video: The Art of the Film” and the installation of the video work “Films that Shaped Us” by artist Rineke Dijkstra.“The Biennial will provide an opportunity for Seattle to reexamine its image through the lens of art,” said Anne Montgomery, chair of the board of directors of the Seattle Children’s Museum. “This year’s theme is ‘film and video: The art of the film.’ That’s a theme we try to push as much as we can to the surface to draw them into conversation with other topics that are of interest to the public.”\n\n\nThe Institute of Contemporary Arts (ICA) Prague announced that Piotr Wojtas has been appointed director of its new exhibition, “Judaism and the West,” which will launch in July 2021", "The next Biennial should take place in 2020, with a date yet to be announced.\n\n\nThe Institute of Contemporary Arts (ICA) in Greenwich, Connecticut, has announced that it will welcome back five artists who were arrested in connection with the arson of a massive oil and gas work in the town of Galileo, Rhode Island, on April 27, 2015. The five were charged with arson and are currently awaiting trial.Prior to their arrests, the five were indicted on charges of fourth-degree murder and conspiracy to criminalize speech and conspiracy to commit murder. The arson was deemed a hate crime by the jury, who deliberated for only fifteen minutes before finding the four defendants guilty. The remaining charges, which were dismissed last month, were re-summed after the jury re-affirmed the convictions of the four remaining defendants at a hearing today.The five were acquitted of inciting violence, arson, and murder, but were found guilty of attempting to intimidate witnesses and obstruct justice, and of possessing illegal weapons. The arson charge was challenged by the defense, which argued that the flames were caused by a blowtorch, not gas, and the jury deadlocked on the case in favor of the government. The conviction is a blow to the defense, which had claimed that", "The next Biennial should take place in 2021. \n\nThe Museum of Fine Arts, Houston (MFA Houston) has appointed Tanya Cooper as its new associate curator of modern and contemporary art. Cooper will be responsible for leading the museum’s collection of contemporary art, with the goal of increasing its public engagement with contemporary art. The museum estimates that her duties will span eighteen months.“We’re thrilled to welcome Tanya to MFA Houston,” said director Mary Anne Carter. “Her talent and ability to bring people together and draw them in and push them through are invaluable in the fast-paced, fast-changing world of contemporary art. Tanya’s positive insights and passion for the art world and for Houston are truly inspiring.” Cooper comes to MFA Houston after five years at the University of Texas at Arlington, where she was assistant curator of modern and contemporary art. During her tenure at the university, she curated exhibitions such as “Alfred Krupa: Contemporary Critters” (2018); “Summer/Fall Art: Sculpture in a City,” (2017); and “Art and the City: A Contemporary View of Houston” (2015).\n\n\n", "The next Biennial should take place in 2021 and will be held in the winter of the year. The theme of the twenty-first century is “the assemblage of life, the life of the collection, and the life of the artist.” \n\n\nYale Union, an organization that aims to amplify the voices of underrecognized artists across the United States, announced that artist J Muḥammad has been selected to represent the United States at the Twenty-Second Portland Art Biennial (2017–18). The artist, a native of the East Coast who is based in New York and Houston, is represented by Houston-based artist-run nonprofit organization Innovate Houston.Ronnie West, senior curator of modern and contemporary art at the Museum of Fine Arts in Boston, said: “We are thrilled about this announcement, as it represents a new era for the Portland Art Museum in the West, with J. Muḥammad joining our board of trustees. He brings with him decades of experience and a passion for the art world, which will provide much needed intellectual and analytical support for our work in the field. His achievements and knowledge will be invaluable in our efforts to organize and develop programming to meet the needs of a rapidly changing contemporary", "The next Biennial should take place in the spring of 2021. “The next Biennial should take place in the spring of 2021.”Joel Slee, the director of the Museum of Modern Art, Los Angeles, told the Art Newspaper that the process of selecting a winner for the Nobel Prize has been “a very long-term quest.” The selection committee will hold an extra meeting in Washington, DC, on February 10 to discuss the resurvey of the 2020 Biennial, which will take place in the spring of 2021. The Prize jury will select the winner from among the entries.\n\n\nThe\n\nItalian pavilion at the Fifty-Ninth Venice Biennale has been renamed by the Italian president, Dario Franceschini, following the announcement that the pavilion will return to Florence in 2021. The pavilion currently hosts the works of Renzo Piano, Julio Cortázar, Monir Kahane, and Vladimir Nabokov, among others, and will open to the public on September 1. “What we are witnessing in Italy now is a global process,” Franceschini told the Art Newspaper when the pavilion was unveiled earlier this month. “We have been following through the work of the pav", "The next Biennial should take place in 2022, and the first in 2021.  \n\nAdvertisement\n\nAdvertisement\n\nAdvertisement<|endoftext|>Online and offline sales have been suspended in a number of UK museums after staff were urged to stay home on Monday as a precaution due to the coronavirus. The health authority said that the decision was made to protect the health and safety of visitors and staff, and that cinemas and ticket offices would continue to be closed throughout the day on Tuesday. Cinema chain Asda has also said that it will suspend all operations as part of a plan that involves it cutting jobs and laying off workers across its UK stores.  The UK’s largest chain, with around 40 stores, including AMC and Sainsbury’s, has been working with the government and the Royal College of Art (RCA) to prepare for the coronavirus outbreak for more than a year, developing new screening and diagnostic equipment, training programmes, and other initiatives. The Royal College of Art’s new rulebook states that “all possible measures” including restricting social contact, limiting large group shows, and limiting outdoor activities will be taken to prevent the spread of the virus.According to the New York Times, The Royal College", "The next Biennial should be on September 14.–October 25. The biennial will celebrate the history of the exhibition and will be led by Sergej Mrazek, who is currently the director of the KW Institute for Contemporary Art in Copenhagen; Cecilia Savano, the artistic director of the Museo de Arte Contemporáneo d Enseñoría, Rome; and Lánek Graz, the founder of BIRCH. The 2019 event, entitled “Vietnam: the Biennial of Biennial,” was held at the Noguchi Pavilion in Los Angeles and featured work by seventy artists.\n\n\nThe Hong Kong–based philanthropist Simon Xie, a prominent arts supporter and collector, has died at age eighty-eight at his home in Beijing. The cause of his death, which was confirmed by his daughter, was asphyxiation, the Beijing Times reports.Born in Hong Kong in 1932, Xie moved to the United States to study at Columbia University, where he eventually earned his master’s degree. After earning a Ph.D. in art history from the University of California, Los Angeles, in 1953, he traveled to Shanghai, where he enrolled in the Shanghai Art", "The next Biennial should inaugurate with the exhibition of works by artists such as El Farouk, Hossain Akram, and Murad Sadiq, which will also present the first major retrospective of work by the late Yemeni artist Saleh al-Qasimi.The show\u0097which will run from November 11 to November 14 and will be hosted at the Grand Mosque in Mecca\u0097will mark the end of a thirty-year run for the institution. The program will celebrate the ten-year anniversary of the event in February 2021. When the ten portraits by Akram were first presented by Biennial director Khaled Abdullah in 1991, the event was actually a partnership between the two institutions, which paid $4 million to sponsor the piece.\n\n\nA jury in New York has found the Los Angeles County Museum of Art guilty of violating the Americans with Disabilities (ADA) Act by denying a Black employee her request for a promotion in 2016. The jury found the museum guilty of violating the ADA by requiring the artist to have a disability-based reassignment in 2017, and of failing to make the required accommodations for the employee in 2018.“We are disappointed but not surprised by the verdict,” said Kiki Smith, the Black employee’", "The next Biennial should take place in 2020, the same year that Paris’s is set to take place. Both events will be held at the Louvre and at the Palais de Tokyo, the Palais de Commerce, and the Louvre. The inaugural exhibition will focus on “the gothic.” The show will also feature solo exhibitions of work by some forty artists, and the Louvre will stage a separate exhibition of everyday objects by  Tadao Ando in 2020.The theme of the biennial’s twenty-fifth iteration is “Thinking about the Present,” but how does one think about the future in the midst of a global climate crisis? “The past is not enough,” is a question posed by the biennial’s curator, François Pérez-Ortega, to the audience at the Louvre. “In order to live together as one, we must think about the future.”The Paris-based, New York–based artist and activist Amalia Ulissen, who was recently awarded a MacArthur “Genius” Grant for her artworks, as well as a $50,000 grant from the Robert Rauschen", "The next Biennial should be a tribute to the work of the life and work of Clement Greenberg, whose genius and vitality inspired the present generation of painters. It should also address the impact of the pandemic on the art world landscape and on the visual arts in general.”\n\n\nThe British Museum in London is facing criticism for moving forward with the construction of a new $3.2 billion science museum after the institution revealed that it will not proceed with construction with the $6 billion expansion project until it receives at least $2.3 billion in pledges from citizens for its 2018–19 budget. The move has led some critics to call for the British Museum’s Board of Directors to resign in protest of the government’s decision to leave the project unfinished.A statement from the British Museum said: “We have honoured our commitment to the public and to the museum at large by reconfiguring and rebalancing the museum so that our proposed new building will demonstrate the greatest possible range of scientific and technological creativity.” The statement continued: “We hope that the government will now consider the impact that this decision will have on the work of the museum and the political and cultural landscape, and take account of the recommendations that the board made", "The next Biennial should also include a presentation of works that were awarded by the Biennial in an effort to assess the state of art in the field. The initiative was established in order to promote the work of contemporary artists in a way that was not simply focusing on the work of older artists. The agenda for the 2019 biennial is as follows: “Art: Present How We Live.”The biennial will be held at the BAM-1 in Beijing, the National Museum of Chinese Art in Beijing, and the Tiaoyao Museum in Beijing. The inaugural exhibition was curated by Leila Weifang, a curatorial fellow at the New York–based New York–based Museum of Modern Art; Eli Goldhagen, a curator at the Brooklyn Museum; and Kirsten Islamson, a curator at the Museum of Modern Art in New York. The exhibition will also feature new works by artists such as Bradley Smallwood, Amy Licata, and Jean-Michel Basquiat in addition to original works by former and current artists that were not previously shown. The 2019 Biennial will include work by Shirley Hoffman, Lee Schirmer, Jack", "The next Biennial should be initiated in September 2021, the organizers said in a statement.\n\n\nThe Academy of Motion Pictures (AMP) in Venice—which has been closed since February due to the coronavirus—is working toward opening to the public in the coming weeks. The Spanish architecture magazine Gósol Solar announced that the institution will open on September 25, and will present the first group show of the exhibition “Sacred Vessels: The Architecture of FIG.5”—a new project by Juan César Morales, Diego César Morales, Rirkrit Tiravanija, and Mendes Uribe, which will include work by forty-three artists, including Richard Serra, César Miranda, and Gerardo Otero.The sixteenth edition of the Venice Biennale, which will take place in the city of Venice from September 21 to September 26, will be curated by María Berrada. The exhibition will be hosted by the Museo de Arte Contemporáneo Instituto (MASI), and will hold forty galleries from fourteen countries and two continents. The art world’s cultural institutions are facing numerous challenges since the coronavirus outbreak began in Wuhan, China", "The next Biennial should be in 2021, with a date to be announced at a later date. The art of photography, which will be curated by Barbara Kruijswijk, will be staged in 2021. The biennial’s next edition, “Art of Photography,” will be held in 2021. “They are going to have a very tough task,” Peter Reuter, a biennial director and a former president of the Foto-Museum in New York, told the Los Angeles Times. “We’re not trying to be silly. We’re trying to use photography as a vehicle to explore a very difficult topic, which is photography’s relation to the history of photography and our own body.”\n\n\nThe Solomon R.G. Boren Museum of Art in Belo Horizonte, Brazil, has received a gift of sixty four works by Pablo Picasso from the artist’s granddaughter, Carine B. Picasso, a Brazilian art collector, and a team led by the artist’s son, Josef Picasso, in the form of a monumental gift. The works, which were gifted to the institution by party-boy collector Rui Vieira de", "The next Biennial should be held in China in 2021 and will take place in the coastal city of Nanjing, in the capital of the central province of Jiangsu, from November 18 to November 21, 2021.The theme of the exhibition will be “The Future of Human Art: From the Origins of Modern Art to the Present.”Speaking at a biennial press conference, Gillick said: “It is an exciting time to be a curator in an age of digital technologies, with the unprecedented possibilities for art and performance. I’m looking forward to working with the artists involved and to collaborating with the audience.”\n\n\nItalian art historian and curator El Paolo has been named the winner of the 2020 Marcel Duchamp Prize. The $50,000 honor comes with two editions, one for the first time and the second time only, with the same format and same theme\u0097“The Future of Modern Art.” Duchamp’s work, which he began to flesh out in the 1960s, was finally published in 1967 and went on to influence the development of computer art, futurism, and the subversion of modernism. The Duchamp Prize, which is based in Rome,", "The next Biennial should focus on the intersections of contemporary art, contemporary life, and the natural sciences. The last should draw from contemporary art, contemporary life, and the natural sciences. The two-part series will address the issues and ideas closely linked to (and divergent from) the exhibition.Bidi: Art for the Body” is scheduled for March 15–March 20 and will be curated by San Francisco’s Lev Blouin and will feature works by seventy-five artists with fifteen artists selected by Bidi’s board of directors. The biennial will also introduce a new subject—the body—which will be the center of the exhibition. “The Body: Science Fiction and the Body” is being organized in collaboration with the Institute for Contemporary Art Research in New York; the Institute of Contemporary Art in Los Angeles; and the Institut d’Art Moderne de Paris. The exhibition will be introduced by artist and curator Maren Adnan; curator Kori Estrada; and artist Kiki Smith, whose body she has been creating since the 1970s. The first half of the show will include work from a group of twenty-seven artists, including Samuel Ayma, Landsbeth, Lutu,", "The next Biennial should be in 2020. A new exhibition of work by the artist will open in the spring of 2021.\n\n\nThe Tate in London announced on August 14 that the institution will test the waters for securing the future of the iconic Tate’s iconic stone facade in an effort to attract more visitors to its grand, glazed, glass-enclosed building, which dates to 1931 and is currently being reconstructed in a new twenty-one-thousand-seat venue.The Tate’s decision to temporarily close its permanent galleries and temporarily suspend programming has been criticized by some local residents, who claim that the institution is attempting to preserve the structure for the future of the UK’s Museum of Modern Art, which is currently undergoing a renovation. While the Tate has yet to publicly commit to the future of the building, the institution has stated that it remains committed to the reconstruction of the building.“The future of the Tate is at risk once more unless we act now to secure the future of the Tate,” said Miriam Brewis, director of Tate Britain and chair of the commissioning committee. “Tate remains committed to taking the most radical and exciting ideas from around the world to the Tate, and I urge everyone to", "The next Biennial should be held at the Radisson Blu Hotel in London in May 2021. The date was chosen by a committee chaired by Beppe Sittel, the founder of the German group Haus der Kunst, which also comprises the luxury goods label Tag Heuer and the university Schweinfurt. In the future, the museum will host two biennials per year and will rotate the works, which will be selected by an international panel of curators and art historians.\n\n\nThe Museum of Art in Bangkok (MCA) has announced that its collection of twenty-six works has set a new record for number of exhibitions sold in a single year. According to a release, the institution sold more works in the period between May and June than it had in the entire previous twelve-month period. While the museum did not break down the numbers by age, the average age of works in its collection was thirty-six and they are still on track to sell more works in 2020.“The record sale of the works in the last twelve months is a remarkable achievement for the museum, which has been struggling to promote to new audiences in recent years as it attempts to move to a new development in its collection. MCA is now returning a", "The next Biennial should be held in 2021. • Artforum’s 2019 cycle has yet to announce its nominees for its fifty-fifth edition. The biennial will be held in New York City from March 18 to March 21, 2021.A comprehensive listing of the 2019 winners can be found here.\n\n\nThe Robert De Niro Foundation in New York City has released a statement regarding the death of American photographer Annie Pape, who was eighty-eight years old and had been photographing American Civil War veterans for the influential illustration magazine Art in its first issue. “The Foundation takes seriously any allegations of plagiarism or of deceptive practices,” wrote Helen G. Williams, director of the foundation. “However, the Foundation does not believe that this is the case. The Foundation has begun a formal investigation into the matter. The Foundation is in the process of reviewing all of the work that is in its collection and has set aside an additional $500,000 to implement a comprehensive review process for works in its archive. The Foundation will make its final decision in a few months.” For years, Pape had manufactured a kind of life-size replica of the nineteenth-century Civil War era battlefield known as the Wilderness", "The next Biennial should focus on issues such as the “disturbance and injustice that capitalism and racism are capable of causing in the world,” the organizers said.The event will feature seventy-four works by fifty-four artists, including Olu Edongo, Florence Huarte, and Peter the Great, as well as a selection of contemporary works on architecture, sculpture, and performance. The theme for the first edition of the Biennale, “Theater of Intimacy,” will be the human condition in the most intimate settings. The theme for the second edition, “Theatre of Events,” will be “the impact of the biennial on the history of Brazilian art and culture.”\n\n\nThe National Gallery in London will once again be forced to close due to Covid-19, this time by March 19. The National Theatre, which has served as the central hub for British theater since 1931, has estimated that it will take eight weeks to fully reopen. According to the Times, the National Poetry Library and Botanic Gardens in East London—which will remain closed until March 19—and the National Galleries of Scotland, which will remain closed until March 16, were forced to temporarily", "The next Biennial should focus on ‘varieties of beauty’ with a particular reference to the work of Bernardo Rochat, Hu Jie, and Nie Netherlander, that is open to all.\n\nThe thirty-fourth Venice Architecture Biennale, titled “Biodiversity: State of the Art,” will be held at the Museo da Arte Contemporânea (MAS) in Venice from December 16 to January 17, 2020. Signed by Cécile B. Martinelli, Ondine de Alvear, and Irène Goldblatt, the fifty-ninth iteration of the award, curated by Julie LaBouvier, will be presented at the Fondazione Prada between January 21 and January 26, 2021.The thirty-fifth edition of 'The Arts and Architecture in the Middle East,” hosted by the Saudi Arabian royal family in Riyadh, will be held at the Royal Festival Hall in London in December 2020, and will feature works by seventy-five artists, including Nima Nabavi, Mohammad Shouri, and Nima Saeed. The twenty-sixth edition, hosted by Shanghai artist Chen Xueliang, will be held at", "The next Biennial should focus on the history of conservation in the city,” Iván DeJesus, president of the Museo de Arte Contemporáneo San José told Spanish daily ABC. The upcoming exhibition will also include an inventory of all the works in the collection and will include an introduction by Argentine artist Rafael Saiz.Artforum also reports that the next edition of the Biennale will be held in New York from March 17 to March 22. The event will take place at Rockefeller Center from March 18 to March 22, 2020.\n\n\nIn January 2019, the Supreme Court in the United States struck down a major anti-slavery statute, declaring unconstitutional a controversial 29-year-old law signed into law by President Donald Trump. The landmark ruling, which was upheld by the United States Court of Appeals for the Second Circuit, marked a dramatic shift for the nation’s eight-member Supreme Court. Since then, the court has issued several decisions that have paved the way for key pieces of the controversial legislation—which was passed by a vote of 3 to 0 and now goes into effect—to be enforced.The Trump administration claimed that the legislation, which made it a crime to be a slave trader or possess an enslaved person", "The next Biennial should be held in the spring of 2020.\n\nA new exhibition organized by the Museum of Art in New York will go on sale on June 1. Titled “Art & Design in New York: 1970–1985” and curated by Elizabeth Rich, the biennial will feature twenty-five works by twenty-six artists. The exhibition coincides with the Centennial of American Art, which will run through October.“This is a significant moment for the city of New York,” said Mayor Bill de Blasio. “As we re-emerge from a long-overdue reopening of public spaces, we are inspired by the work of artists and designers whose work engages directly with the museum’s curiosities, civic spaces, and neighborhoods. We welcome the opportunity to support them in a way that the Arts Council never did.”\n\n\nThe Bechdel Test: The Modern Way of Thinking About Beauty, by Stephanie Coontz, is being moved to a new home. The program will now be hosted at the Bechdel Museum of Modern Art in New York from June 17–June 22. It will also be available on Vimeo and will be backed by the Arts Fund.The move", "The next Biennial should be in the Fall of 2020. The 2019 version, titled “Beyond the Frame,” was staged at the University of Michigan. The 2019 show, titled “Feminine,” was in collaboration with artists such as Mica Stetten, Nara Schäfer, Olu Ojo-Lionel, and Laura Owens. The 2019 show, titled “Pale Moonlight,” was staged at the Shizuoka Museum of Art and curated by Sachiko Harada. The 2019 show, titled “Pale,” premiered at the Museum of Modern Art in Tokyo. The 2019 show, titled “Feminine,” is currently on display in the exhibition “The New Art of Life: Art and Feminism in Transition” at the National Museum of Women in the Arts in Washington, DC.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has announced that it is planning to shutter its current exhibition “Invisible City: Landscapes of the American West,” which was originally staged at the Museum of Modern Art in New York and ran until July 20, 2020, and re-create the American West in", "The next Biennial should take place in the city in 2022. \n Artforum editor-at-large Leroy H. Hunt was elected by the Board of Directors of the Society of American Painters (SAAP) for his twenty-second year in a row. Hunt, a Pittsburgh native, began his editorial career at the magazine in 1994. His first Sustainability column appeared in Artforum #16 in 1994, and he has written five other columns for Artforum and the Art Newspaper since 2001. In 2008, he was awarded the Royal Society of Arts’ Artistic Award for his exploration of the history of photography. In 2012, Hunt was selected as a fellow of the Royal Society of Arts. In 2018, he was selected as a fellow of the Association of Photographers in Europe. “Artforum has long recognized the importance of a strong arts and culture sector and has been a champion of the arts in all of its forms,” Hunt said in a statement. “Over the years, we have awarded hundreds of thousands of dollars in grant money to some of the most promising artists and organizations in America and have seen their work become iconic. I am grateful for the opportunity to work with", "The next Biennial should take place in December 2021.\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Tanya Boisson as its next executive director. Boisson will be responsible for leading the institution through its next year-long celebration of the life and work of the late architect-designer John von Neumann, which will take place in February 2022.“Tanya Boisson’s leadership and vision for the MFA is truly inspiring and we look forward to working with her to ensure the museum’s vital role in supporting the intellectual, aesthetic, and social development of a local community, as well as the vital work of our collection,” said Peter W. Ahenrohn, chair of the board of trustees and chair of the architectural department.Boisson comes to the MFA from the group of strategists and donors who collectively acquired the property that is now home to one of the largest artworkss ever built in the United States: the Neue Haberlandforschung in Berlin, the Institut für Bildung und Gesellschaft in Vienna, and the Museum of Modern Art, New York. The group also includes John von Neumann’s widow, Dora Ne", "The next Biennial should be a challenging time to return to the United States, but one that will bring together artists from diverse backgrounds and different eras to create an exhibition that is meaningful and relevant.”\n\n\nHugo Boss Washington, the American design magazine, is launching a new digital platform and online forum for visual artists. Called Artist-in-Residence (FiR), the platform will highlight the work of twenty-three artists who have lived in the District of Columbia for a year or less and will be supported by a $500,000 grant from the Lynda and Kirk Douglas Foundation. The fund will also enable the exhibition’s curators, interns, and writers to work remotely from the studio.The initiative was inspired by the issue of long-term housing for visual artists and how studios were unable to accommodate their needs, and the housing crisis in the District of Columbia. A 2013 survey by the National Association of Home Builders found that twenty-six percent of artists in the District of Columbia have struggled to find affordable housing. With the help of the foundation, the curators will be able to create online exhibitions that will engage with real life issues facing artists, such as job insecurity, homelessness, and family responsibilities.“The deadline for the", "The next Biennial should take place in the spring of 2021. It has also received a large donation of $2.5 million from the Rockefeller Foundation. In addition to the funds, the museum is collaborating with the San Francisco Museum of Modern Art (SFMoMA) and the Van Gogh Museum in the United Kingdom.\n\n\nThe National Gallery in London has appointed Mona Hatoum as its new director. Hatoum will be responsible for aligning with the institution in planning its next exhibition. Hatoum will take the helm from architect Daniel Libeskind, who has served as director of the National Gallery since 2019, in mid-January. Houlton Brown, who has also served as director of the National Gallery of Art, said: “The appointment of Hatoum marks a new stage in our journey. From the National Gallery, we will now move on to a new phase of our lives, and the next exhibition will be the thirty-third. I am thrilled to have joined the National Gallery of Art, to be part of the exciting future and to produce innovative and thought-provoking exhibitions, and to work with a talented and determined team. I look forward to working with the team at the National Gallery, and to", "The next Biennial should be held in 2020, and the inaugural edition in 2021. The 2019 edition, which was staged at the Artspace Art and the Hampton Inn in London, was co-hosted by director Andy Coulson and artist Adam Clayton.The exhibition, titled “Pale Light”\u0097a reference to the North African artist Dinek Bakan’s work that was created in one of the early stages of a ‘Yeast Land,’ was curated by Rowan de Kooning and curated by Matthew Harrison. The 2020 edition will be hosted by the Museum of Modern Art in New York.\n\n\nMore than twenty-five artists and cultural workers have signed an open letter supporting the campaign to remove the statue of General Lee Iacocca, a Confederate general and key architect of the Deep South.The letter, which was composed by Christine Redlinson, Phyllis Nolen, and Warren G. Williams, and was addressed to the presidents of South Carolina and Georgia, Jonathan Shipley, and Jeffrey Coogan, and was dated October 2 and addressed to “President Donald J. Trump,” reads: “We write to you today in support of a campaign", "The next Biennial should be held in the year 2022.  The design of the museum should be based on a life-size model of the museum in Kauai, which is located on the island of Oahu. The work will be limited to a minimum of twenty-four pieces, with the possibility of increasing the number of works to as many as sixty. The biennial will be held in conjunction with the 2020 Disney Producers’ Guild Awards, which will be held at the museum in 2020. The biennial’s project will be themed “Redefining the Museum: The World’s Museum of Contemporary Art,” and will feature artist commissions by Ricky Pierce, Tana Marie Skipper, Tobias Magers, and Yoko Ono. Nelson-Atkins Museum of Art, Kansas City, Missouri: Originally scheduled for March 2019, the museum has postponed the event to February 21-March 26. The cancellation marks a departure for the museum, which has been closed since March 10. ArtPlace, New York: Originally scheduled for February 20-February 22, the event will now take place March 13-March 16. Chicago: Originally scheduled for March", "The next Biennial should take place in the year 2021, for the United States. In a statement provided to the Art Newspaper, the festival said that the decision to postpone the event was not related to the current emissions crisis, but was solely regarding the temple’s expansion plans. The museum said it is planning to keep the US in the \"strongest possible\" way with the Paris climate accord, which will ultimately have the power to force the country to shift its energy mix. The museum said that it is already working with the US government and is discussing how the steps needed to comply with the Paris climate accord can be taken in conjunction with the museum’s restoration of the original building and the reconstruction of the grounds.The museum said that it hopes the postponement will allow the exhibit to move forward as planned. When asked whether the delay was related to the decision to shutter the museum, Stevens told the Art Newspaper: “I’m not going to get into any of that. I think we are in a very strong position to continue to operate at a high level.”\n\n\nThe Miami Beach Museum of Art (MBAM) has announced that Margot and Donald Trump will serve as guest curators for the 2020 edition of", "The next Biennial should be staged on the 25th of January 2020, in the city of Milan, following the Milan Triennale. The Biennial will draw up to forty thousand visitors. The event is supported by the Museo del Biennale Ferro. The full list of organizers is as follows:ArchitectureCenterScienceArtScienceArtHistoricalArtArtArtHistoriographyArtArtInvestigationsArtInvestigationsHistoricalArtInvestigationsModernArtInvestigationsArtInvestigationsArtInvestigationsArtInvestigationsArtInvestigationsArtInvestigationsArtInvestigationsArtInvestigationsArtInvestigationsArtistInvestigationsArtInvestigationsArtInvestigationsArtArtInvestigationsArtInvestigationsArtInvestigationsArtInvestigationsArtInvestigationsArtInvestigationsArtInvestigationsArtInvestigationsArtInvestigationsArtInvestigationsArtInvestigationsArtInvestigationsArtInvestigationsArtInvestigationsArtInvestigationsArtInvestigationsArtInvestigationsArtInvestigationsArtInvestigationsArtInvestigationsArtInvestigationsArtInvestigationsArtInvestigationsArtInvestigationsArtInvestigationsArtInvestigationsArtInvest", "The next Biennial should be on December 24–January 4, 2020.\n\n\nThe Art Institute of Chicago (AIC), which has been closed since February 19 due to the Covid-19 pandemic, is collaborating with Brooklyn Museum and the Far Rockaway Beach Community Center to launch an online viewing room and sculpture park, Artistica, in partnership with participating galleries and museums.Located on the West Side of Chicago, the seventh-century monastery will host twelve exhibitions, including “Yale Architecture and Design: A Historical Portrait” (2019); “Theater of the Americas” (2019); and “Hindenburg” (2019), which will be on view until January 17, 2020.Sponsored by the AIC, the new partnership will allow the public to experience works by participating artists and institutions in the archdiocese of Chicago. The online viewing room will draw visitors via the AIC’s online portal, while the sculptures will be on display in a viewing room.The partnership was announced in a letter from the AIC’s board chair, William H. Morgan, to Bishop Frederick M. McKean, the president of the diocese. AIC director Robert Brown said", "The next Biennial should be held in 2020. \n\n\nThe Liverpool Biennial, curated by two-time winner Gertrude Stein, has announced that it will now be celebrating its one hundredth anniversary this year. The exhibition, which featured more than three hundred works by forty-three artists, including Bernard Chirac, Charles Gass, Henri Ducournuil, Urs Fischer, and Jim Smith, was a landmark achievement that launched the modern-art movement in the United Kingdom.The history of the exhibition is told through the artist’s own words, which are presented in both a literary and a cultural context. The show opens with a book that depicts the artist’s voyages throughout the world, which was written by her daughter, Irene, and shows her paintings, which include pieces by the Nude, the Figure, and the Power Plant, all from 1949 to 1951.The next part of the series, “The Shape of Things to Come” (May 26–June 3), will be the theme of a new exhibition at the Museum of Modern Art, curated by Louis Vuitton, which will run through November 29. The theme is “The Appearance of Things to Come” and will be curated by", "The next Biennial should take place in 2021. The exhibition will be headed by Antonia Borges, who will lead the opening. Borges said: “With my guest this year, I am thrilled to present the first exhibition dedicated to the stories of living artists, and the first exhibition dedicated to African artists. Our project will be open to the public from November 14 to November 17 and will focus on the history of African art.” The first show, “The Life and Work of Louis Vuitton” (1921–2019), is currently on view at the Musée d’Orsay in Paris and will be on display until March 9. The second show, “Gerald and Marie Curie: The Art of Chemistry” (2019–2019), will be on view from March 17 to March 20 and will be on display until March 24.\n\n\nNew York City’s Metropolitan Museum of Art (MoCA), the Museum of Modern Art, and the Whitney Museum of American Art have announced that they are collaborating on a plan to open a new museum in the city in the spring of 2021. The announcement marks the first time the three entities have collaborated since the Met opened a new outpost", "The next Biennial should be held in 2021.\n\nThe institution’s board of trustees also announced that Abigail and her husband, Paul, have become chair of the Arts Council. The council, which consists of artists and arts professionals, including Jeffrey Rosen, Nick Cave, Joël and Max Beck, and Simon Laing, formed in 2004 to provide 'open and direct support for artists producing works in the visual and performing arts, particularly in Europe, the US, and Australia.”The pair have served as cochairs of the arts council since 2016. Abigail first became a cochair in 2018. She joined the council in 2007 and subsequently served as a chair of her own private arts organization, the Plaza Arts Center in Los Angeles, for a year before moving to the Arts Council’s newly established headquarters in the city’s Marina district.“We are extremely pleased with the recent performance of our inaugural biennial, especially since it felt so authentic and relevant in the contemporary world,” said Abigail. “The full breadth of our curatorial team’s interests and expertise in visual arts is reflected in the exhibition, which also looks forward to developing new modes of expression in the visual arts.", "The next Biennial should focus on the ongoing development of the museum’s collection, exhibitions, and collection programs. The museum will also continue to exhibit the work of the collection on the Biennial’s website, as it has done since 1988. The exhibition “The Making of Tanya Bonakdar” will be staged at the Panorama Sculpture Garden, Oxford, in association with the Tate, the Royal Opera House, and the Metropolitan Opera House. The exhibition will feature works that explore the history and legacy of the artist, the artist-in-residence program, and the museum’s Early Years; and will culminate in a live performance by the artist-in-residence Tanya Bonakdar, which will open on February 12. “The collection is in extraordinary hands, with many of her projects completed and many of her works on display,” said David Mitchell, the director of the Tate. “The collection is bigger than us and we’re working with more artists than ever before. And the artists who make up the collection are as diverse and talented as any group of people.”\n\n\nThe Swiss Nationalgalerie, which has locations in Zurich and New", "The next Biennial should take place in 2020.\n\n\nThe Metropolitan Museum of Art in New York has hired Audrey M. Collins as its new associate curator of contemporary art. Collins will be responsible for organizing the museum’s exhibition “Sensations: Contemporary Art in the Age of AIDS,” which will run concurrently with the upcoming biennial in Miami Beach, which is slated to run in March 2020 and to coincide with the 50th anniversary of the AIDS Healthcare Foundation (AIDS Miami Beach), and will take up the theme, “Feminine Stages,” from July 6 to August 2.“Rebecca Abrams has been appointed as the new artistic director of the biennial,” said Marc Glimcher, the director of the Museum of Modern Art. “Her new role is a real reflection of the growing influence of modern and contemporary art in contemporary social practice. She will be tasked with ensuring the exhibition is a true reflection of what it means to be a woman in the 21st century and shaping the view of contemporary art through a woman’s perspective.”The biennial will be held at the Museum of Modern Art in partnership with the Women’s March, a coalition of feminist, gay,", "The next Biennial should take place in the middle of the day in June 2020.\n\n\nIgor de Braga has announced that he intends to leave the corporate world at the end of the year to focus entirely on the arts. The Brazilian director made the announcement on Instagram, where he has nearly 1.2 million followers. His replacement will be announced in the coming weeks.“Igor de Braga is a leading visionary and an artist of conceptual movements,” Braga said. “From his earliest works, he has been deeply influenced by the works of his contemporaries and peers. The way he has approached the creative process has always been to penetrate and create new possibilities from the material, to be open and to ask what the future could be. . . . I am deeply interested in how he approaches his art, and I hope he will continue to inspire and redefine the way artists think and think about the future.”The news comes amid reports that the museum’s current exhibition “Anno Domini”, which focuses on the Italian architect and designer Giulio Liguori, is scheduled to close in March 2020. The exhibition, which opened in 2007 and drew 110,000 visitors each year,", "The next Biennial should be held in 2021, with the first exhibition to take place in 2022, according to the organizers. As the first large-scale event to take place on the island, the museum will be hosted by the city of Tromsø and the city of Oslo. The events will be housed in a 16,000-square-meter building, which will be located at 458 Nøgnefjordalen, in the city of Aalborg.Also participating in the inaugural exhibition are museums from other Nordic countries, including the Fjältidag in Finland, the Karlstad Museum, the Museum of Fine Arts, Oslo, and the Helsinki Museum of Art. The Helsinki Art Museum and Museum of Fine Arts and the Kristiansborg Art Museum will also be included in the biennial.\n\n\nThe Shaft Art Museum in London has received a donation of fifty works by forty artists, including Jonathan Barnes, Nirvan Duvall, Robert Geldhof, Kelly Johnson, and James LeMier, from the John Akomfrah Foundation in honor of its new partnership with the artist and philanthropist, and will present the works at an upcoming exhibition, �", "The next Biennial should take place in the spring of 2020. The 2019 exhibition featured fifty artists, including Amanda Black, Arash Agrawal, Anish Kapoor, Ashok Kumar, and Manish Kapoor, and was curated by Christo, who recently stepped down from the centre. The exhibition was staged at the Centre for Contemporary Art in Mumbai, and was also curated by Shiva Narain, who has served as chairman of the Biennial since 2015.\n\n\nThe Metropolitan Museum of Art in New York has acquired the multimillion-dollar estate of Artistic Director and CEO Michael Rosenfeld. The South Bend, Indiana–based artist, whose eponymous studio is renowned for its elaborate paintings and installations, which often include live animals, was one of the architects behind the transformation of the Met, which recently underwent a $150 million expansion, into a museum that celebrates the work of contemporary art, into one of the largest art holdings in the United States.“Michael Rosenfeld was a visionary leader of Artistic, whose work has shaped the museum into a uniquely meaningful home for the collection and exhibition of contemporary art,” said director Christopher Dunn. “Through his vision, his persistence, and his extraordinary", "The next Biennial should take place in 2021. The 2019 edition, entitled “Amelie Büchner: Avant-Garde” featured works by Selby Makino, Paul Gauguin, and Maurice Merhige.\n\n\nThe National Institutes of Health (NIH) in the United States announced today that it has awarded nearly $1 billion in grants to more than a hundred institutions across the United States. The awards, which are for both general and specialized biomedical research, will help support the direct research and public health needs of American communities, and will help NIH expand its network of funding to meet the growing medical needs of the country.The grants come as the United States continues to slide into an unprecedented pandemic. According to the Congressional Budget Office (CBO), the country will be hit with a $7.2 trillion spending shortfall—nearly double the size of the current CBO budget—and will continue to lose income as more people go without health care. Among the grant recipients are the Arizona State University, the Arizona Museum of Contemporary Art, and the Museum of Arizona Art; the Bechtel Art Museum, which will be impacted by the coronavirus; the Carnegie Museums, which received $", "The next Biennial should be held sometime in 2021. \n\n\nThe International Committee of Museums (ICOM) in Rome is planning to send a delegation to the capital city of Bahrain to represent the Middle Eastern country at a new event, titled Art in Capital, on January 31, 2022. Organizers said the theme is about cultural exchange and collaboration, and will focus on the importance of artists in the region. This year’s edition, which was organized by the Bahrain Art Foundation (BAF), coincides with the annual Art Basel Bahrain Triennial, and is part of a campaign to raise awareness of the human rights situation in the country.“The art scene in Bahrain is one of the most under-recognized in the Arab world,” said Bahrain’s Culture Minister Hamad Bin Isa Al Khalifa. “This year’s event will bring together fifty-nine artists from thirteen countries, highlighting their collaboration and engagement with Bahrain. We are working hard to make the event an inclusive platform for everyone, so that Bahraini art can be experienced by anyone in the region.”The event will also introduce new works by Bahraini artists, including Naseer Hassan, Rayyan Al Basha", "The next Biennial should be held sometime in 2021, with an opening of the exhibition in 2021.\n\n\nThe British Museum in London announced today that James Cuno will be its new curator. Cuno currently serves as director of the Tate Britain and is the founder of the contemporary art firm Cuno + Associates. He will assume his new post in January 2020.“James Cuno is a highly capable curator whose work has been central to the development of the Tate’s collection, and whose curatorial career has been the subject of great scholarly and popular interest,” said British Museum director Maria Balshaw. “Cuno’s work demonstrates his outstanding ability to understand and to engage with the potentialities and histories of art and design, and to draw them into historical and contemporary contexts with extraordinary clarity and wit.”Balshaw added: “James welcomes the challenge to further the museum’s journey from its birthplace in Stratford-upon-Avon to its present position at Tate Modern. With great enthusiasm, he will be tasked with ensuring that Tate Modern remains a consistently important and inspiring cultural destination for visitors to the museum.”Cuno’s first project with the museum will be the addition of a new", "The next Biennial should focus on the African diaspora and its role in shaping contemporary art. While the exhibition will be split into three sections: the Contemporary Art of Africa, which will present work by emerging and established artists from Africa; the Legacy of Africa, an exploration of African art through the lens of current events; and the Contemporary Art of South America, an introduction to artists of African descent in South America, Africa, and the Americas.  The exhibition will also include a number of interviews and public lectures on art and culture from South Africa.\n\n\nAngela Chase, the former director of the Anne Frank Museum in Philadelphia, has been appointed the next chair of the Museum of Modern Art (MoMA). The announcement comes on the heels of the institution’s inauguration as the newest home for the collection of Anne Frank, which opened last month in a former factory in East Harlem. Chase, who previously served as director of the Museum of Modern Art from 1996 to 2001, succeeds Marianne Boesky, who retired in 2018.“I’m delighted to be able to work with my former colleagues and new and existing museumgoers, and am confident in the kind of collection that will be created when we open to the public in 2021", "The next Biennial should take place in the spring of 2018. The twenty-fifth and twenty-sixteenth editions of the Biennial will be held in the autumn of 2022, respectively.We look forward to working with our partners and the members of the community to deliver a truly transformative experience for the museum in 2021.We are also committed to supporting and strengthening the museum’s relationship with the local communities in which it operates. In 2021, we will be working with the general assembly of the community in the city of Manchester, and we will be inviting the public to the museum for free admission years from now. We hope that this year’s exhibition will demonstrate that the new new museum model can deliver on the museum’s promise to present the full range of art in a curated setting, while also reflecting the city and the wider region.”\n\n\nThe New York City Department of Cultural Affairs (DCLA) announced on Tuesday that it has awarded $3.3 million in grants to more than one hundred arts and cultural organizations in twenty-seven boroughs in the state. The funds are aimed at helping them prepare for the coronavirus pandemic, which has already claimed the lives of more than 6,500 people in the US and has", "The next Biennial should be on November 27.\n\n\nOn Friday, the French government introduced a series of new anti-terrorism legislation that will allow the authorities more powers to indefinitely detain people suspected of links to terrorism. The legislation also promises that those suspected of being involved in terrorist acts will be held in custody for an unspecified period of time. It also defines terrorism broadly and gives the authorities more powers to question people who are suspected of links to terrorism.The legislation—which was passed by France’s National Assembly on Thursday and is expected to be implemented soon by France’s President—marks a shift in French counterterrorism policies, which have been characterized by a reluctance to publicly discuss the possibility of prosecuting people charged with terrorism-related offences. Since the 2015 terrorist attacks in Paris, which were carried out by a lone gunman named Abdelhamid Abaaoud, France has largely avoided using the term terrorism in public. In an interview with the Los Angeles Times in April 2016, former counterterrorism minister Anne-Marie Rempe said that the government would use the term “indefinitely” in a trial, but that the government would not use the term in a criminal case. In an interview with the New York Times in May 2016, Rempe said that the", "The next Biennial should be on March 3. From May 5 to May 7, the museum will be divided into two parts. Once the exhibition is over, the full Biennial will go online. The first part will feature works that have been on display since the 1970s. The second part will feature works that were first exhibited in the 1960s. The museum will also inaugurate the “Carnegie Museum of Art” in Pittsburgh with 10 new works by forty-eight artists, including Arturo Pimentel, Felix Ayala, and Ermanno Zingaretti. The museum is planning to open the new works in the fall of 2020. “I’m excited to be bringing the Biennial to Pittsburgh (and to the city of Pittsburgh),” said director James Riga. “Carnegie is a great and diverse city, with a rich history of innovation and creativity, and we want to honor that history by celebrating the great work of the artists whose work we will be presenting in our biennial.”\n\n\nThe twentieth edition of the Grand Prix d’Arles, organized by the French brand and partner Almine Rech, has been postponed to the second half of", "The next Biennial should be held in 2021. The next show will take place in the city of Los Angeles, California, from March 11 to March 12, 2022, and will feature a selection of artworks created by the biennial’s curators. The exhibition will also include a biennial on the history of mathematics and will include performances by renowned artist-activists and other industry professionals, as well as local and international artists. It will be held in partnership with the city of Los Angeles, as well as with the Los Angeles County Museum of Art and the Pasadena Museum of Art.\n\n\nThe Solomon R. Guggenheim Museum in New York has appointed the American photographer and filmmaker Eric Paxton a senior curator. Paxton will be responsible for helping the Guggenheim to realize its plan to create an exhibition of works by artists from the Pacific Northwest in 2021, and will assume the position in March.“Eric is an exceptional curator, who has demonstrated an exceptional ability to present the work of exceptional artists in a way that makes it accessible and engaging for anyone, anywhere in the world,” said Guggenheim director Lawrence AbuQuinn. “As a curator, he is uniquely qualified to shape the future exhibition program", "The next Biennial should have a new platform that will showcase more of our work, create new work, and expand our research. We believe that the full breadth and depth of the Biennial should be realized in the new site, with greater diversity and in greater depth.” \n\n\nThe Tate Britain has announced that Mary Beard, an English architect and landscape architect best known for her sculptures, paintings, and installations, died on January 6, 2020. She was seventy-three years old. Her work, which often references and explores the natural and social landscape, as well as the relationship between urban and natural environment, often incorporates materials such as earth, fire, and fireplaces, as well as social and political concerns. In a statement provided by Tate, Beard said: “The Tate is deeply saddened to learn of the passing of Mary Beard, a truly remarkable artist who made a profound and sometimes irreverental contribution to the Tate’s mission. She was a gifted communicator and always sought to enhance the public understanding of art through a variety of artistic mediums. She was, for many years, the patron saint of art-lovers and a true icon of England’s landscape.”\n\n\nThe Museum of Modern Art", "The next Biennial should begin in January 2021. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is in the process of revamping its current exhibition platform with a series of exhibitions dedicated to African art and the African diaspora. The overhaul will focus on creating a more engaging “perspective” of African art by bringing together works by established and emerging artists of African descent.The institution will also create new virtual spaces that will allow visitors to explore the work of emerging and established artists in the African diaspora. Among the works being curated for the first time are “Gorbán Bochereșs Paola Marini” (2017), a set of paintings that combine elements from the Gallic and Italian traditions, and a “Yinka Ndzube,” an African-American artist whose art explores the concept of migration in a range of media.The exhibition, titled “Making of the Black Nations,” will also feature work by Kameel Rashid, Christopher Pint, and Nima Nabavi. “The new exhibition will bring together artists from different continents, ages, and backgrounds in a different time and in a different place,�", "The next Biennial should be held at the University of Cambridge in England, which will pick up where the original Biennial left off. The theme of the next iteration of the event is “Living Together: Evolution, Ecology, and Design” and the theme of the upcoming edition will be “The Future We Can See.”A selection of works from the exhibition will also be presented at the new Biennial at the Museum of Contemporary Art (MoCA), which will take place at 36 Madison Avenue in New York in 2022. The biennial will hail from the same team that produced the exhibition “The Body in Art” (2019) and will aim to be an “endless journey through the body, the mind, and the body”\u0097the Golden Gate Project, a collaboration with the artist and curator, Anna Karenina. In 2018, the exhibition was selected as one of the seventy-four selected works that represent the best of contemporary art. “We were thrilled to be selected as an exemplary participant in the Golden Gate Project,” said Michael Lütjes, curator of the inaugural exhibition. “The exhibition was selected as an ideal showcase for our exhibition in the exhibition hall, and", "The next Biennial should focus on the intersection of art and the environment in the Americas, and on the country’s relationship to the rest of the world,” said Jim Miller, the biennial’s artistic director.The Museum of the American Native (MoNA), which has a permanent collection of more than five thousand works and is a major art-historical draw for tourists from around the world, is currently working on a new set of guidelines for the exhibition. The changes will include creating new dates and new guidelines for the exhibitions, which will take place in the museum’s former space on the National Mall, and will also revamp the program.“The changes we are making today will help us as MoNA embarks on a new journey of discovery and an incredible collection of works,” said MoNA director María Berrío Pérez-Girón. “The changes will help us make MoNA an even more meaningful and inviting destination for visitors to explore the museum.”The museum will also introduce new programs and activities that will engage with current exhibitions and events and reflect the history of the institution. The new exhibits will debut at the institution in March 2020 and will highlight the work of Indigenous", "The next Biennial should include a selection of new works by artists whose work has not previously been exhibited at the museum. “The Biennial is about more than the museum,” said Alexander. “It is about the work that is created by artists themselves, and about the biennial as a whole. It is about what we do for the work of artists—it is about our own work and what we do for artists.”The next iteration, which will be held at the Venice Biennale in May 2021, will feature works by seventy-nine artists and will include a selection of curatorial introductions by Nancy Lieberman, Alexander Panetta, Wangechi Mutu, and Hannah Wu. In a 2015 review of the exhibition, Artforum said that the upcoming edition of the event will reprise themes of the previous two biennales: “The original project—which was realized in 2000 and 2002, respectively—had been to include contemporary art within a conceptual framework of the museum, with a view to its opening in the summer of 2013. But this year’s iteration will be about the work of artists since the institution has been inundated by the phantom work of the past", "The next Biennial should take place in 2020 and will be hosted at the new modernist venue, the Frank Gehry–designed Herzog and de Meuron house.\n\n\nThe Museum of the City of New York has released the schedule of its 2020 edition. Titled “Unfolding,” the event will run August 28 to August 31 and will feature seventy-six works by forty-two artists, including the artist-in-residence, Zinaiko Aden & Partners, Haida artist-in-residence, John Lee Hooker, and the contemporary artist-in-residence-at-large, Jennifer Packer. The museum will also stage a retrospective of the artist’s work in the fall of 2020.The first wave of artists to participate in the event are Anish Kapoor, Michael John Crossan, Yoko Ono, Alex Katz, and Adam Clayton Peters. The 2019 edition featured work by seventy-one artists, including the artist-in-residence, the German artist-activists Heinrich Obrist, the Italian architect Jirka Piro, and the Brazilian artist Cara de Albuquerque. The exhibition will also include artist’s residencies at the Whitney Museum of American", "The next Biennial should be a celebration of vibrant trans-historical art. The issue is not simply ’how to create a work of art, but how to celebrate it in the first place.”  The biennial announced the dates for the first edition of the event in January 2020. \n\n\nThe National Gallery of Art in Washington, DC, has introduced three new curatorial fellowships for artists. The fellowships are for a new online residency program, which will run from January 2021 to March 2022, and a new exhibition in the exhibition space next spring. The announcement marks the first time the museum has overseen the development of a curatorial fellowship program since the institution opened in 1847.“The National Gallery of Art is working toward achieving greater impact and efficiency through an online residency program,” said Nancy Spector, director of the National Gallery of Art. “The online residency program has the potential to significantly improve the exhibition and residency experience for visitors to the National Gallery of Art, Washington, DC, and we are excited to learn how the program will impact the exhibition and residency program.”The fellowships come as the museum continues to undergo a major renovation, dubbed “Project Horizon,” that will", "The next Biennial should take place in 2022. The event will feature work by forty-six artists from thirty countries, including Canada, Mexico, France, Italy, the Philippines, Thailand, and the United Kingdom, and will take place at the Museum of Fine Arts, Boston.The museum will also present a new interactive exhibition, “The Future of Life and the Environment: Biennial 2020” (2019), which will be on view through February 28, 2020. The show will feature seven new works by the artists featured in the exhibition, which was organized on behalf of the exhibition “The Future of Life and the Environment: Biennial 2016” (2017–18), and will run until March 7, 2020.The biennial will also present a series of books and other works, “The One Percent Manifesto” (2019), “Beyond the One Percent” (2019), and “The Future Is Present” (2019).The first book of the series is “The Future Is Present” (2019), a new collection of essays and blog posts written by artists from Africa, the African diaspora, and other parts of Africa. The book will be organized around themes such as “The Future of", "The next Biennial should be held, if possible, in February 2020. The team is also working on a second edition of the Dreamland Biennial, which will take place in October 2020, and will present a final exhibition, “Two Gates: Future Art,” in October 2021. The museum will also host “Future Generations: “The Art of the Future” in October 2021. \n\n\nArts galleries in London and New York have condemned the city’s mayor, Bill de Blasio, for attempting to impose a temporary closure on New York’s Museum of the Arts (MoCA) during its reopening on January 7—a move that would have a significant impact on the museum’s work, which is housed in the former Far East Side industrial zone and is currently undergoing a major expansion.While de Blasio announced the temporary closure on Tuesday, January 4, citing a “serious deterioration in the safety and well-being of our public,” museum director Matthew Teitelbaum issued a statement on Wednesday, January 5, condemning the move, which he described as “premature and dangerous” in an interview with the Art Newspaper.During the six-hour closure,", "The next Biennial should be in 2021, the organizers said. \n\n\nThe Museum of Contemporary Art (MoCA), the California Institute of Technology (Caltech), and the Los Angeles County Museum of Art (LACMA) are working together to develop a new platform for the public to explore the history of modern and contemporary art through the lens of a Segway.The collaboration, which is being led by anthropologist Rebecca Roach, began with the introduction of an exhibition of work by the Swedish artist Ariel Fairey in the museum’s courtyard in December 2021. After the exhibition, which was organized in collaboration with the California Institute of Technology, was added to the museum’s permanent collection, a new exhibition of work by Fairey was dedicated to the subject—currently the only work to be exhibited by the artist in the country.The project was inspired by a question posed by the artist Jason Fairey—why does it take so long for a modern work to be displayed at the museum? In response, the collaboration developed a Biennial of Modern Art that would highlight the work of contemporary artists in a structured way. In January 2022, an open house for the exhibition, “Living in the Present,” was held in the", "The next Biennial should be held in 2021. \n\n\nMore than two hundred artists from fifty countries are boycotting the upcoming edition of the Venice Architecture Biennale in protest of a new copyright law that will curtail their right to the artistic expression of their countries of origin. Although the boycott was sparked by the new law, it has since been extended and extended by Italian Prime Minister Enrico Letta, who stated that the law does not address the cultural roots of the artwork or the work included in the exhibition.Letta also claimed that the law will not impact the work of Italian artists, such as Piero Manzoni, who will be featured in the 2019 edition of the exhibition, but only the works of Europeans, including Swiss artist Markus Lüter, who was due to appear in the twenty-third edition of the Italian pavilion.Lüter was not invited to participate in the show, which takes place at the Palace of Fine Arts in Rome from March 12 to March 14, because of his work The Strange, 1953, which he says constitutes a violation of his intellectual property rights. In a letter addressed to the artists, Letta wrote: “I am deeply disturbed by this new law, which will make it", "The next Biennial should kick off in April.<|endoftext|>Needless to say, I was not pleased by the new painting project that my daughter and I were working on. I saw her sketches online and was already working on my own version. She was not happy with the final result. The inspiration for the project came from her father’s art collection and a painting by classical Italian painter Piero Manzoni, which she used to create the sculpture for the piece.\n\n\nThe California-based artist Deborah Jayne has died at age eighty-six. Her death was confirmed by her daughter Salome. Born Deborah Ann Hughes in New York City in 1940, the California native is known for her work that explores the facets of memory and memory art. Her work can be found in the collections of the Los Angeles County Museum of Art, the National Gallery of Art, the Museum of Fine Arts, Washington, DC, and the Metropolitan Museum of Art.Born in Los Angeles in 1948, Jayne studied under the famed Italian Renaissance painter Gian Lorenzo Scarpa and was inspired by his work. Several months later, a friend introduced her to Vincent van Gogh, who introduced her to the painter Ingvar Kamprad, who introduced Jayne to the artist Marc Chagall,", "The next Biennial should take place in 2020 and will consist of 20,000 works by artists from all over the world. The theme will be “The Situationist Museum.” At the time of the opening of the exhibition the artist-run museum was in transition. Its current exhibition, “From the Shadows of Capitalism,” is a combination of “Prism” and “Microscope” and is on view through November 12. \n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Julie Barnstead as its next executive director. She succeeds Miranda March, who retired in 2015 after ten years at the institution.“Julie brings to the MFA an impressive list of experiences and knowledge, and we are excited to work with her to shape future generations of curators, experts, and organizers,” said museum director David Crockett. “Julie is a leader, a thinker, and someone who has the ability to bring people together, fosters collaboration and structure, and pushes the boundaries of the art world. We are lucky to have her at the helm of our curatorial team, and to have her on our team. She has worked with Julia Serota, who", "The next Biennial should be held in 2020, but the decision has been a long time coming.  In a letter to Clark, Allen, and Guggenheim Partners, Bosch writes: “We have been working on this for several years and it is a critically important story for the biennial. . . . The new structure of the Biennial is, in a word, revolutionary.”The Biennial will consist of two halves: a pre- and a post-Biennial. The first half will be a two-hundred-year retrospective of the artist’s work, which will open in January 2020 and run until March 2021. The second half of the biennial will be a public event that will unfold over five years. “The historical and institutional basis of the Biennial is newly founded, and the exhibition of the artist’s work is perceived as an ideal opportunity for the world to see the work of an artist who has been neglected and misrepresented,” Allen said. “The exhibition will be a platform for the public to meet and engage with the Biennial’s artists and the work of the artists.”The artists who will receive the prize for best work", "The next Biennial should take place in 2020.\n\n\nThe Shanghai artists who were selected to represent the United Arab Emirates at this year’s Dubai Biennale have signed an open letter addressed to the emirates’ ruler, Sheikh Hamad bin Khalifa, and asking for a meeting to discuss their future collaboration.“We write to you today in the strongest possible terms, as artists from the UAE and from all over the world, to express our sincere appreciation for your passionate and extensive cooperation in supporting the artistic teams of the UAE at the 2016 Dubai Biennale, to which we are particularly grateful for the exceptional work of our artists from the UAE,” reads the open letter.The letter, which was drafted by the artists and was shared with Artforum, calls for an end to the international boycott, a meeting of the UAE’s embassies in Brussels, the UAE, and the UAE’s High Commission in Abu Dhabi, and demands that the emirates cancel the 2019 Dubai Biennale and the 2020 edition, which were originally scheduled for November 25–November 29. The open letter comes amid growing speculation about the future of the festival, which was canceled due to the coronavirus.According to the Art Newspaper,", "The next Biennial should focus on “continuous change and how this may be experienced through the eyes of a single soul,” the artist-run museum wrote on its Instagram account. “This is a legacy of our generation. Please continue with the work of Gereon, as I will work with you to make it possible for future generations to benefit from our work.”\n\n\nThe Hong Kong-born, New York–based curator Kiyoshi Kikuchi has been appointed the next head of the Hong Kong–based nonprofit ArtAsiaPacific. In his new position, Kikuchi will take up the post following his retirement from his post as head of the Hong Kong–born nonprofit ArtAsiaPacific, which works to support Hong Kong art through international exchange and programming.“I am delighted to be the next Hong Kong curator,” Kikuchi said. He added that he plans to leverage the museum’s extensive collection of modern and contemporary art to bring together contemporary Hong Kong artists and their audiences. The appointment was made in honor of his wife, Rineke, who passed away from breast cancer in September.Prior to joining ArtAsiaPacific in 2012, Kikuchi served as a director of the Hong Kong Art Museum for nearly four", "The next Biennial should take place in 2020, with the goal of identifying and remediating the biennial’s remaining visual artworks; preserving the biennial’s intellectual and artistic legacy; and organizing additional discussions and public viewing sessions.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles, California, has released the schedule of the twenty-fifth annual Biennial of the American Indian, which will take place in Ogden Park in 2019. The biennial will highlight the work of thirty artists and will showcase works in the exhibition “Contemporary American Indian Art.” “The program has a strong legacy of showcasing work by indigenous and Pacific artists,” said Museum head Jonathan Tuttle. “The exhibition will continue to expand our audiences by introducing more artists to engage with issues and issues of contemporary American Indian art, and we encourage future curators to engage with Native American artists through exhibitions and programs that reflect their perspectives.”Although the program will focus on contemporary art from the American West, it will also showcase work by artists and activists who have made significant contributions to the cause of indigenous rights and representation. “This year’s exhibition will celebrate our history, rebal", "The next Biennial should inaugurate a new research-based cooperative, called the Center for Biennial Research and Open Access, which will be led by a team of internationally acclaimed scholars spanning the entire spectrum of contemporary art. The Museum of Fine Arts in Boston is already working on a new institution dedicated to the exhibition of contemporary art. The Museum of Modern Art (MoMA) is planning to open a new branch in a historic building in the city to house the collection of Louis Vuitton, and the Museum of Modern Art is also in the process of constructing a new flagship museum in the city.\n\n\nThe New York Museum of Modern Art (NYMoMA) has received a gift of more than three hundred works from the Philadelphia Museum of Art (PMA) in the form of twenty-six pieces by artists including John Beaty, Yinka Shonibare, and Monir Shahroudy, as well as four rare works by members of the Indian subcontinent. The donation includes works by the Tamil masters A.S. Ramakrishnan, R.K. Singh, and R.K. Salick, and the Tunisian sculptor Ahmed Ghadily.“PMA’s collection has a long history of championing", "The next Biennial should be held in 2022. The 2019 edition, which featured work by sixty artists from twenty-four countries, was curated by ten-eight-year-old Georgia O’Keeffe.\n\n\nThe New York Museum of the Arts (NYMoA) is launching a new digital platform that will allow users to purchase and view works by artists, including living and dead, individuals, and organizations seeking public funding, and will offer listings of the artists on its website. The platform will be powered by artist-based crowdfunding, the same tool that raised funds for the exhibition “Theater of Operations: The Gulf Wars 1991–2011” at the Taormina Arts Center in Italy in 2017. The platform will be hosted by the New York–based nonprofit the PEN American Center.“NYMoA is excited to support the PEN American Center’s mission to bring relief to Palestinian artists by offering them a platform to purchase works through our platform,” said Stephen Miller, director and chief curator of the PEN American Center.NYMoA’s new platform will include an online store where donors can purchase digital works and other goods, as well as an interactive map of the artist’s studio and", "The next Biennial should be held immediately following the USO, which will address the museum’s collection, exhibitions, and upcoming events. \n\n\nThe Tawana Library and Museum in Tunis (TLMo) and the Italian architectural firm Giustino Cervetto have agreed to jointly develop a new public space in Tunis, the Art Newspaper reports. The project, which is being spearheaded by American designer Tom Gass and his team, will involve the construction of a new 300-seat venue known as the Tawana Museum. The complex will be built in the former Rada family villa, which was constructed in the 1920s and was gifted to the government of Ben Ali by the Rada patriarch, Sayyid Qutb, who was assassinated in a Tunisian prison in 1963.The project will be funded by a $25,000 grant from the American artist and philanthropist Jeff Koons, and will integrate art and architecture in the Tunisian capital. Koons established an art scholarship program in the country in the 1970s, and the project will also involve the development of a new curriculum for schools and universities across Tunis. The cultural center will be located on the third island of Tunis and will be inaugurated by a", "The next Biennial should take place in the spring of 2020. \n\nThe second iteration of the Bienal Bienal will put forward a storytelling project in the form of an exhibition inspired by the film Black Panther, which is currently in post-production. The exhibition will be divided into six episodes, each taking place over the course of six days. The second version of the Biennial will be held at the Bienal Bienal from March 23 to March 26.  The first iteration of the Bienal Bienal was held in the capital of Mauritius from March 19 to March 21, 2018. The exhibition opened to the public in March 2019, and the first Bienal Bienal was staged at the Museum of Modern Art in New York from March 19 to March 27, 2019. The exhibition will culminate with a performance by photographer Imane Akunyili.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that Pablo Picasso will receive the 2014 Walker Art Center Artist Award for his services to art. The grant, which honors artists who have contributed at least $5,000 to the institution, will be presented to the artist at a ceremony at the Walker in Los", "The next Biennial should be held at a later date\u0097we will not have the opportunity to see it any more.”A statement from the city of Toronto, Canada, reads: “Toronto is committed to delivering a great and diverse exhibition program that reflects the diversity of our city and region. We are actively working towards this and will present a new program for the forthcoming Exhibition. The next iteration of the Biennial will be a reflection of the diversity of Toronto and will include works by artists from across the city’s spectrum of artistic experience. We appreciate the support of our community and look forward to hosting you in April. We hope you enjoy it.”The full list of participating artists is as follows:Artists Receiving Commendations for 2015:Personal Recognition Awardees:Kamala Aditya, Salem, MassachusettsArts & Craft: Exhibit AArtists Receiving Commendations for 2014:Vincent Altmann, New YorkArtists Receiving Commendations for 2013: Ana Andujar, Albuquerque, New MexicoArtists Receiving Commendations for 2012: Anastasia Andujar, Albuquerque, New MexicoArtists Receiving Commend", "The next Biennial should formally open in 2021. The organization said that the new structure will allow it to “take full advantage of the growing opportunities for public engagement through digital technologies.”\n\n\nThe Museum of Jewish Heritage (Museum Hannover) in Germany is preparing to reopen this fall following a $105 million renovation. The institution announced the reopening on Wednesday, March 8, with a new collection of more than 2,500 artifacts and works by the late nineteenth-century German Jewish composer Beethoven, as well as a selection of works by the artist-explorer Mies van der Rohe and the philosopher Immanuel Kant.The museum also announced the reopening of its main exhibition space, the Künstlerhaus, as well as Bernard Beren (1914–1996), a former member of the Künstlerhaus who died in 2004. The institution will present the first exhibition of Beren’s works in the United States in 2020, a retrospective of his art that will open in the spring of 2021. The same year, the museum will host a commemorative exhibition of the artist’s work, titled “Between the Beginning and the End of the Century: Beethoven’s Art", "The next Biennial should be held in the spring of 2021, but the organizers are releasing no date for the event. The first Biennial staged by the museum was an exhibition of works by the Italian artist Dario Catellani, whose work has been collected by the Milan Art Museum, the Museo d’Arte Contemporani, and the Museo della Scala, in collaboration with the Guggenheim Museum, in New York. The second Biennial was held in the summer of 2021, during the Museum’s annual “Picasso in the Studio.” The third Biennial was held in the spring of 2022, and the fourth in the spring of 2022, respectively. It will be the first time the museum has held a biennial during the coronavirus pandemic.\n\n\nA new exhibition dedicated to the life and work of Pablo Picasso has opened at the Museum of Modern Art (MoMA) in New York. The Pablo Picasso Exhibition, which runs through October 24, 2019, will be curated by David Greenfield-Smith, curator of contemporary art at the Italian city-state of Venice, and will feature works by twenty-seven artists from fourteen countries. “Pablo", "The next Biennial should include a presentation of the work of contemporary artists, as well as a survey of the recent history of the Art of the American West. The proposal to host a biennial was first presented by Dr. Martin Luther King Jr. at the September 8, 1964, meeting of the National Association of Art Historians. The following year, the Washington, DC–based nonprofit, which was formed to promote a new set of guidelines on the display of art, archives, and other objects in the US, began to organize the event. The 2020 edition will be held at the Museum of Fine Arts (MoFA), Miami Beach, Florida. According to the New York Times, the 2017 exhibition “discovered the biennial’s potential to expand and deepen the museum’s collection and public engagement.” The 2018 event featured work by eighty-four artists and produced the biennial’s inaugural exhibition “The American West and the Art of the American West: From the Lums to the Lones,” which explored the relationship between American art and the environment. The exhibition was followed by “The American Landscape,” which was organized as an installation, and “The American Landscape", "The next Biennial should be up by October, according to the organizers. The event will be open to the public, but reservations for the event are required. \n\n\nThe Tell-Tale Heart Foundation in New York is planning to lift the  suspension of its annual fundraising gala on August 20, following protests from some in the arts community over the exhibition’s cancellation. The organization said that it is “considering all options,” but that it chose not to postpone the event because of the prevailing health crisis in the United States.The New York artist-run nonprofit had planned to stage the event, titled “Telling Stories,” at the Brooklyn Museum with a $250,000 cash prize. Organizers cited health concerns as the reason for the cancelation in a statement on August 23. “We are deeply concerned by the current situation. As a large, established, and influential arts organization, the museum plays an essential role in fostering and celebrating the work of the most creative, talented, and gifted among us. We consulted with the health and wellness experts for weeks before making this decision, and our staff and volunteers are deeply committed to supporting the theme. We are committed to working with our artists and the community", "The next Biennial should consist of three parts: a review, a survey and a commentary. The review section should feature twenty reviews from the current collection, as well as new works that have been selected by the panel for their quality and innovative use of photography. The survey section should consist of ten essays on photography from a shortlist of fifteen writers who have won the prize, with appropriate introductions. The commentary section will address the themes of the biennial and the work of the judges.The Biennial will be held in New Delhi in 2020. The biennial will be organized as a community event, with the participation of participants from all over the world. The event will entail exhibition and public activities, lectures, readings, symposia, and workshops.In order to secure the support of the Fine Arts and Arts of India (FAAI), Mumbai’s Minister of State for Culture and Culture, Maneka Gandhi, announced today that the biennial will go ahead as planned. The decision was made while the biennial was still under discussion, and it was made in response to the fact that the art world is facing a climate emergency and its economic situation is worsening. In a statement, Gandhi said: “As a community, we have a responsibility to", "The next Biennial should be held in 2021, and the year after that.\n\n\nThe Charles and Lucille King Gallery in New York have announced that they will cease operations at the King and Museum in 2019 following twenty-three years of operations. The launch of the new museum, which recently completed a major expansion, marked a turning point for the institution. It replaced the King in 1965 as the institution became known as the Architecture Museum, and it has since become a destination for visiting architecture schools and art collectors.“The construction and renovation of the new museum and the development of the King’s collections, which helped make the museum a major cultural and financial draw for New Yorkers, has been a true joy,” said Charles King, the executive director of the Charles King Foundation and the King’s brother. “From the moment the King and Museum’s doors opened in 1965, the museum has been a wonderful success. We would like to thank all of our staff, supporters, and visitors for their tremendous dedication. We know we have much work ahead of us.”In celebration of its twenty-fifth anniversary, the museum will hold an exhibition dedicated to the development of Charles King’s organizational chart of the institution,", "The next Biennial should be announced in the spring of 2021.\n\n\nYale Art Museum, Colorado Springs, Colorado: The institution is working with the artist   Yingli Ren in an effort to create a new exhibition dedicated to his work, “The Lives of Modern Women” (2019). The show will feature sculpture and performance by Ren and will open on October 6.Ren’s works will be included in this year’s exhibition “Druid’s World: From the Gourd to the Tree” (2019) and “Druid’s World: From the Pine to the Oak” (2019). The exhibition will reopen on October 23 with a new work by the artist.Ren’s recent work has been featured in several other shows at the museum, including “The Real Life of Jesus,” in 2018, and “The Expressionist,” which was staged by artist Vito Acconci in 2017, and is currently featured in “Druid’s World: From the Gourd to the Tree” (2019), which was staged by artist Matthew Mulligan of Mulligan Gallery in 2017.Commenting on the art", "The next Biennial should be in 2020 and is currently working toward securing funding for its inaugural edition. The exhibition will be held at the Contemporary Art Museum St. Louis (CAMP St. Louis), in collaboration with the artists and their families, beginning January 16, 2020.The twenty-eighth edition of the Art of Living Life , which will take place at the Getty Center in Los Angeles in February 2020, will begin March 13. \n\n\nThe Museum of Contemporary Art (MoCA) Los Angeles announced today that it is planning to shutter its doors on January 31, 2020, and rejoin the rest of the United States in the process. The museum initially placed the closure on March 15, when it closed to the public for the season. It reopens on March 19.“We are disappointed that the museum will not reopen, but we have work to do,” said Elizabeth Savitz, director of the museum and chairman of the board of trustees. “While we believe this is the right thing for the institution, it is an interim solution that does not address the complex needs of our aging population or our growing complex.”Commenting on the museum’s decision, she said: “We hope that the museum will reopen", "The next Biennial should be held in 2021, with the first exhibition taking place in 2022.The artist-run venue, which has hosted the exhibition twice in the past, said: “The departure of the curator and the Vice-President of the Biennials is a huge loss for the museum. We are greatly looking forward to the future as a group of curators, artists, writers and activists. We are grateful to the Nieuwsuur and the Arts Council for their great support and understanding in this process and look forward to continuing our work together.”Art historian and curator Kees Mathiesen, who has curated exhibitions for the Nieuwsuur, commented: “The Biennial will always be a work in progress, still in development and still beset by difficulties. Michelangelo’s vision for the exhibition was clear: to create an exhibition that would represent the history of the seventeenth-century Dutch-American painter, and of the artist-in-residence as well as contemporary art in a very contemporary context. The changes at the museum since the second Biennial in 2011, including the construction of the new exhibition, have been immense. We have learned and adapted in different ways from the past, to make", "The next Biennial should take place at least five years from now. The first such exhibition focused on the history of art in Europe. In 2019 the festival opened in London, Berlin, and Stockholm. In 2018 it was held at the Museum Stedelijk Museum, Amsterdam. The exhibition was a joint initiative between the Museum of Modern Art and the European Art Museum Rotterdam.In 2020, the museum will host a group show “The Future of Art: Art in the Age of Digitality” whose first catalogue is the tenth biennial on the twenty-first century. The show will be organized as a “multidisciplinary exhibition of contemporary art, with an emphasis on the future.” The second show will accelerate the exhibition of work by artists in the upcoming biennials. The first is scheduled for the fall of 2020.\n\n\nThe Museum of Art in the City of New York—a contemporary art institution that was founded in 1978 by Doris Duke and her husband, Peter Duke, and that relocated to the building’s former location in 2000—is planning to open a new twenty-first-century iteration of the museum in Queens, New York, in 2021. The new venue will serve as the new headquarters of the Museum", "The next Biennial should be held in 2022.\n\n\nThe Carnegie Museum of Art in Pittsburgh has announced that nominee Kathleen Cleaver has been chosen as the winner of the 2020 Wilson-Kruger Prize. Known for her contributions to the field of theater, Cleaver is a MacArthur® fellow and a tenured scholar at the Carnegie Institute of Art. She is also the founder of the publication Theater of Life, which she cofounded with her wife, Patti.“When we were working on our playwriting program for the next Biennial, Kathleen was a leading member of the casting committee. Her involvement in the selection process was central to our success,” said Richard Mackay, chair of the Wilson-Kruger Prize. “I’m thrilled to work with such a talented and gifted curator, and to present this award to her.”Since its inception in 1976, the award has been named after Alexander Hamilton, a founding member of the Carnegie Institute of Art, and has been administered by the Carnegie Museum of Art in honor of their achievement in supporting important plays. The 2018 winner, a playwright, choreographer, and producer, was Nicole Weiner, a Pulitzer Prize–winning novelist and playwright whose work explores the relationship between", "The next Biennial should be held in 2022 and will be hosted by the Museo Nacional Centro de Artes in Madrid.\n\nThe Sunnylands Foundation has announced its new partners for the Singapore Biennale\n\nDubbed AirBnB Singapore, AirBnB Singapore is a social network and coworking space focused on helping young professionals and young artists find work and opportunities. Based in Singapore, AirBnB Singapore has more than 630,000 members and is headquartered in the Kitakyushu district of Tokyo. Sam Ho, which represents AirBnB Singapore, said: “The partnership with the Sunnylands Foundation is the perfect opportunity for AirBnB Singapore to work with the Sunnylands Foundation and its local community in Singapore, where we have many years of experience.”The partnership comes at a time when the region’s art scene is undergoing a major revival. With the opening of three new galleries in the past four months, Art Dubai and Art Paris are expanding their offerings, while the Hong Kong-based gallery Artis Modern announced its acquisition of two contemporary artists, including Damien Chazelle and Rirkrit Tiravanija.AirBnB Singapore will offer a variety of online", "The next Biennial should be held at the Smithsonian’s National Museum of American Art, in Washington, DC, next month.\n\n\nThe Museums Association (MA), an international organization comprised of the world’s leading collectors, has announced that it is launching a new initiative to advance the art world’s collective memory. The initiative, “The Museums Are Good for You,” will partner with leading museums and will provide them with a collection of twenty artworks that are designed to help museum visitors better understand the world they enter. The works will be curated by the London-based curator and educator John Birkett, who will curate the exhibition at the Serpentine Galleries in London next month.“I’ve long believed that the best way to understand art is to have it in front of you,” Birkett said in a statement. “I’ve been working towards this goal for twenty years, and I’ve come up with a way to make this work for you. I got a lot of feedback from people who were going to be in the exhibition before me, and you can be assured that the work was carefully considered and put together with the best of the best"]