["The next Biennial should be held in 2021, and the first show in 2022. An award ceremony would follow.\n\n\nThe Museum of Contemporary Art (MCA) in New York has appointed Jennifer Šarostami as its next executive director. Šarostami will take up her new post on January 1, 2020.“Jennifer is a seasoned leader who has led the MCA through an unprecedented level of success,” said director Daniel H. Weiss, who has helmed the museum since it opened in 1932. “Her proven track record of transforming MCA into a significant force in the cultural landscape, as well as an ability to bring people together, align exhibits and programs, and create meaningful connections, make the MCA a great fit for local communities and will continue to boost the museum’s reputations and attract new audiences through painting, photography, and performance.”Šarostami succeeds Keith Collins, who will resign in March 2019 after thirty-five years at the helm of the museum. The museum will celebrate his and Susanne Vielmetter’s first years at the helm of the institution with an exhibition of work by the duo on November 8.“Jennifer brings an outstanding record of success", "The next Biennial should be a triumph of innovation and creativity, as we continue to explore the conceptual and physical underpinnings of how we live and work together.”Sonia Sánchez-Morales, director of the Biennial, said: “Championship is a term that implies the highest possible level of achievement. The new Biennial will be proud to share the vision of the finalists and to present the best of contemporary art at our first exhibition in the heart of Dallas in 2021. The 2019 and 2020 cycles were transformative in their immense scale and their breadth of international scope, and we are excited to continue to push the boundaries of what it means to be a champion.”\n\n\nThe Malaysian artist and activist Jahan Nawang is reviewing his own work for inclusion in the country’s upcoming exhibition “Innocence: Malaysia and Contemporary Art” at the Kuala Lumpur Biennial. The event will open on March 4 and run until March 25, 2020. The exhibition will feature work by 81 artists, including Bandong Lek, Apichatpong Weerasattu, and Syed Sirza, and will include the works of Filipino and Malaysian artists.Gina Tan, an independent", "The next Biennial should focus on the history of the museum from its founding in the late nineteenth century to the present day. The 2019 event will include the exhibition “Ludwig Wittgenstein” along with the Biennial’s inaugural exhibition “Einstein” and will be held at the Vienna Academy of Fine Arts. The event will include a new public sculpture, a new writing exercise and a new performance.\n\n\nThe Philadelphia Museum of Art (PMA) has appointed Jeanne M. Wilke as its new executive director. She succeeds Mary Anne Pinder, who retired in December 2019 after a decade at the helm of the museum.“The museum was not expected to be in such good financial shape for its first year as an institution,” said Pender. “With this new role, I will be a vital resource for the museum as it continues to reimagine its internal architecture and our relationships with our community. I look forward to working with my colleagues and the board to ensure that the PMA’s extraordinary collection and collection-making resources are directed toward public engagement and long-term planning.”The appointment of a woman, who has served as the PMA’s director for sixteen years,", "The next Biennial should be the thirteenth, which will take place in December 2021. Judging from the reception the exhibition brought, the theme for this year’s exhibition will be “subversive play,” Artforum reports.  Matthiasa Quintana, the cofounder of the Czech pavilion at the Venice Biennale, told the Art Newspaper that the event will be “perceived as a metamorphosis of cinema.” The opening of the pavilion was marked by an exhibition of work by the Czech artist Jaroslav Bochenský, which showed how the Czech cinema industry could have flourished without the ministry’s support.The show also showcased the work of the Dutch artist Flemming Byers, who is best known for her “spooky” films, and the work of the Italian sculptor Stefano Bonicki, who made works for the pavilion. The inaugural exhibition, “The White House Cinema” (2019), was organized by the Museum of Fine Arts in New York and the National Gallery of Art in Washington, DC. The show opened on February 14 and ran until March 14. The twentieth edition of the Biennial will be held at the", "The next Biennial should be held in 2021. The event will be curated by Michael L. Smith, who previously curated the exhibition “Museums and Contemporary Art” (2019) at the Museum of Modern Art in New York and the National Gallery in Washington, DC, and will focus on the intersections of art and history.\n\n\nThe Association of Visual Arts and Design (A.V.A.D.) announced today that it is planning to dissolve its union with the American Federation of Arts (AFA). The news comes less than a month after the A.F.A. filed a complaint with the National Labor Relations Board (NLRB) accusing the Philadelphia-based collective of intentionally slowing work by artists and destroying professional relationships.“We are aware of the AFA’s request for a meeting to discuss organizatng work in its entirety,” said AFA president and CEO Deborah Rutter. “We are encouraging all interested parties to take advantage of the upcoming two weeks to review a range of creative ideas, including theories, methods, and approaches that have been developed within the past two years.”The collective is also asking the NLRB to review its collective’s representations of the A.", "The next Biennial should focus on a “transformative work,” the organizers said. “With the publication of ‘Time for Change,’ we hope to portray the ‘future of democracy and human rights as a world in which the elderly, the sick, and the poor are respected and appreciated, not stigmatized and attacked.”The biennial will take place at the legendary BAMM, a former slave market in downtown Charleston, South Carolina, which was converted into a museum and ran by the city of Charleston in 2013. The city acquired the property in 2014 as part of a $3.5 million renovation project, and it reopened in March. Organizers are planning to present a program of talks, performances, screenings, performances, and other events that will showcase the work of artists and activists, including the Dylann Storm Roof–inspired March for Truth, which drew more than 1,500 people to the city’s historic Elephant Man statue in December.The full list of participating artists is as follows:Alessandro Cattelan-Barozzi, ItalyAlessandro de Cordeiro, ItalyAna Filomena, ItalyDesign Paradise, Design in Motion, ItalyFiona Pape,", "The next Biennial should be held in 2021. The next International will be held in 2022. The next International will be held in 2020. The next International will be held in 2019. The next Biennial will be held in 2019.\n\nThe Museum of Modern Art (MoMA) in New York is working to raise $15 million to bring the McAlpine Opera House to its campus, which is located in the Bronx, New York, and is slated to reopen in the spring of 2021. The institution has already received $6 million from the city of Manhattan for its renovation, and its construction of the new pavilion began in 2016.After receiving $1.2 million from the city for its renovation of the building, MoMA also received $750,000 from the Robert Rauschenberg Foundation for his uli-jah Association for Arts and the Arts, which has funding earmarked for the renovation of the building. The foundation will match $500,000 of the $15 million raised by the artist, and it has pledged $600,000 for the full renovation. MoMA is also preparing to launch a $1 million Reward for Achievement in Arts and Art History Scholarships program, which will reward top emerging and established artists", "The next Biennial should take place in 2020. Once the venue is re-established, it will be able to record more than one exhibition per day and will be able to re-create entire landscapes. The first exhibition, titled “Theatre of Life” (Toledo), was the setting for a show by the Italian architect Andrea Albini, entitled Theo and the Eiffel Tower, in 2020. The exhibition will also include an installation by the Egyptian sculptor David Adjay, a work on paper by American artist Vito Acconci, a sculpture by the Israeli architect Ron Chernow, and a model of the Eiffel Tower.The next Biennial will be held at the Palazzo Grassi in Venice, Italy, in June 2021. The twenty-third edition of the Biennial, “Theatre of Life” will be staged at the Sarajevo Biennale in March 2022.  \n\n\n\n\n\nThe Texas Parks and Wildlife Commission (TPWC), the state’s leading conservation organization, has released new guidelines for the exhibition “No More Deaths: Toward a Conservation of Life,” which will feature works by seventy-five artists", "The next Biennial should be held in the spring of 2020. \n\n\nThe Swarovski Museum Vienna has announced its representation of the late sculptor Oskar Eustis. Born in Vienna in 1923, Eustis became a Vienna native in the 1960s. Born in St. Martin’s Church, Eustis began his sculptural career in the canton of Spoleto, where his father was a zoetrope dealer. Eustis made his first works for the museum in 1980, and in 1988, he and his brother founded the company Eustis & Van Dyke. The company moved to Vienna in 1992, and in 1998, the family moved to the capital to open a new museum, which opened in the building in 2002. In 2004, the museum closed after a period of international exhibitionist. In 2018, the family moved to the town of Spoleto, which is about a thirty-minute drive from the Austrian capital. Today, Eustis—who was a prolific painter and printmaker—has been featured in more than eighty exhibitions internationally, including the Venice Biennial (2019), the Venice Architecture Biennale (2017), the Cannes Film Festival (2018), and the Silver Lion at the Venice", "The next Biennial should be scheduled for February 2021, the organizers said. The museum will also be remodeled and will include new galleries and public spaces.The lineup for the 2020 edition includes work by thirty-four artists: Kojima Suwa, Rinka “Kochikaze,” Maki Kawamura, Sara Zahn, and Yoshitomo Miyawasaka.  \n\n\nThe Irish Museum of Modern Art (IMMA) in Dublin and the National Museum of Art in Washington, DC, have jointly announced that they will begin a formal partnership, with a formal opening date of 2020, in an effort to promote cultural exchange and collaboration between the two countries. The announcement follows the launch of a new Institute for Irish Studies (IIS) at the University of Limerick. The institution will together build a new exhibition dedicated to the history of Irish cinema, known as a “film museum.” The institute will be inaugurated by an exhibition of new works by the director of the National Art Museum in Glasgow, an exhibition of new works by artists from the West, and will run three years.“The partnership has a long history in promoting cultural exchange between Ireland and the", "The next Biennial should take place in 2019.  When asked about whether the show should be postponed, Lin Rui, director of the Biennial, said: “The festival needs to be held and continue to be held alongside of the exhibition, the exhibitions, the exhibition spaces, libraries, and galleries.”\n\n\nThe National Geographic Society’s plans to open a new research center at the University of Washington in 2018 were put on hold when the campus of the University of Washington, Seattle, became the epicenter of a coronavirus outbreak that has sickened and killed an estimated 156 people in the United States. After the campus became a hub for people who came together to share information and learn about topics ranging from climate change to design, the National Geographic Society announced in April that it was postponing the opening of its next major survey, “Deep Sky Survey,” until at least the second half of 2020.“The delay was not about politics or economics or about avoiding the political. It was about priorities and the need to prioritize,” said David H. Thompson, the executive director of the National Geographic Society and chair of the board of trustees of the Geographic Society. “We will now devote more time and", "The next Biennial should take place in 2021, with the first exhibition scheduled to open in 2022. Its successor, which will likely be called ArtSpace, will be relocated to the northwest corner of the museum, where it will continue to be held while the museum undergoes a $500 million expansion.  \n\n\nThe National Gallery of Art in Washington, DC, has received a gift of approximately $5 million in support of its $200 million expansion and renovation project, which is expected to be completed by 2021. The gift, made during a ceremony at the museum on Monday, follows a six-year campaign, from 2016 to 2017, during which the gallery launched a digital platform, biennial.meanwell.com, and an Instagram account. Launched in October 2016, the platform hosted more than 130,000 works in a single location, and the Instagram account has more than 2.5 million followers.The National Gallery of Art is currently working on a $50 million expansion to the building that will bring the museum’s collection closer to the National Mall. The project, which is expected to be completed by 2021, will include the development of a new building for the gallery, a new exhibition space, and the refurbishment", "The next Biennial should take place in 2020.\n\n\nThe British Museum in London announced today that it is expanding its digital platform for the collection of contemporary art. The institution will present a digital version of the institution’s collection to the public in a new exhibition, “Through the Looking Glass: The Collection of James Russell Lowell,” at the British Museum from October 28 to December 15.The project, titled “Through the Looking Glass” and organized by the British Museum, will feature over twenty thousand works, rare and out-of-print works, and works in suspended animation by forty-eight leading contemporary artists, including Luke Walton, Naomi Klein, Ed Klein, Wayne Koestenbaum, Chris Field, and Ruth St. James.Curated by Mark Maxwell, the curator of contemporary art at the Whitney Museum of American Art, the project will also include discussions with historians, archaeologists, and art historians, as well as with critics and writers, including Anthony Barrett, Hamza Walker, and James Turrell.“Through the Looking Glass’s ambitious and influential exhibition program will take us beyond the currently fashionable notion of a curated exhibition, and beyond the role of the curator,” said Maxwell. “By examining the", "The next Biennial should be held in 2024.  The next exhibition should be held in the United States in the same year. If the petition is successful, the museum will have the opportunity to host an exhibition of works by the artists who were selected for the first edition of the Biennial in 2020.The exhibition will be led by a team of curators comprising Richard Avedon, Nima Nabavi, and Mary O'Connell. The work will feature a selection of works from the exhibition “Aurora” which will open at the museum in the summer of 2021. Michael Wolff, director and CEO of the Whitney Museum of American Art, said: “We’re excited to have this opportunity to present the best of contemporary art. The exhibition will include work by a very select group of artists whose practices and achievements are rarely represented in the United States. We’re confident that this exhibition will inspire and excite audiences to think and feel more deeply about their world.”\n\n\nThe National Gallery of Art in Washington, DC, has released new guidelines for how museums will display the work of African American artists in a bid to address historical racism at the institution. The guidance, which were developed after several Black", "The next Biennial should be held in 2021. For the time being, the artist-run exhibition will continue to operate as usual. The institution is now accepting donations to the Biennial from individuals and organizations. More information about how you can help the museum can be found on its website.\n\n\nThe Gibbons-Bachmann Foundation in New York has been awarded a $3.2 million grant by the Carnegie Museum of Art and the Metropolitan Museum of Art in New York to help address the rapidly escalating crisis created by Covid-19. The grant will give the foundation a new tool to help manage Covid-19-related costs and a new set of guidelines for assessing grants.The organization hopes the tool will help it manage the costs of the 2015 exhibition “The Last 5000 Years: Global Evolution” at the museum as well as the 2019 exhibition “The Evolution of Art” at the Getty Center. The museum declined to provide a cost estimate for the latter exhibition, but said it hopes the tool will help it minimize the impact of the pandemic on the primary arts institutions.“We are thrilled to be able to present the first exhibition of art on our campus in over thirty years,” said Gibbons", "The next Biennial should be the foundation of a new platform for learning and sharing contemporary art, based on the themes of social justice. In this way the platform will be a bridge between the existing exhibition and the new exhibition, while at the same time honoring the past. The project will also see the return of some twenty-five works by the artists whose work was previously shown in the Biennial, and will feature a retrospective of the work of Meg Lafontaine and Mark di Suvero. The biennial will be curated by Cecilia Godin-Becker, the artistic director of the City of Zurich, as well as the Zurich-based artist Hans Christian Andersen; moderated by Ewa Zulte; and organized by the Nationalgalerie. The winners of the prize will be announced in the summer. The biennial will be held in several locations, including the city of Zurich, the Swiss Federal Art Museum in Bern, and the Universität Zurich.\n\n\nThe National Galleries of Scotland (UK) has announced that it is planning to shutter its historic National Gallery of Scotland and reevaluate its collection plans in an attempt to reduce the number of conservators working in the institution. The changes, which will be made across", "The next Biennial should be held at the same location as the exhibition hall, which will remain the same and will be rechristened the 'Dinamo House,' and will have all the same activities as the previous two. The museum’s collection, which includes works by artists such as Jean-Luc Godard, René Magritte, Pierre-Auguste Renoir, and Pierre-Auguste Van Eyck, will also be included in the new exhibition.In a statement, Dias said: “The Biennial is a major milestone for me, as I released my series of paintings, ‘Grand Illusion’ from the Baha Museum in Tehran, on the occasion of the V-E Day celebrations. I was inspired by the idea of creating a museum that would act as a cross between a contemporary art museum, a private collection, and an art school. I hope that the new museum will become a model for other artists who are interested in returning to Iran.”\n\n\nThe Art Newspaper on Wednesday reported that the Museum of Arts and Design in New York is preparing to close its doors indefinitely because of the health risks posed by the coronavirus. The institution will also temporarily suspend the collection and exhibition", "The next Biennial should take place at the Haus der Kunst in Munich in March 2020. Autobiennial organizers say that the theme for the 2019 edition, “New Foundations: Art and Architecture in the 20th Century” will be the “enlargement of the possibilities of art in the twenty-first century.”\n\n\nThe Conscience of Perfumes: From the Alchemy of Tobacco to the Art of Making, 2017–20, is now available digitally through the Museum of Modern Art (MoMA) and will be presented by the museum in conjunction with the Metropolitan Museum of Art’s forthcoming exhibition “Scent of a Woman” as part of the Metropolitan Museum of Art’s inaugural season. The exhibition is a collaboration between representatives of the production and art worlds, with the support of the museum’s board and executive leadership.“We’re incredibly excited to celebrate the twenty-fifth anniversary of the show by bringing you a new edition of Conscience of Perfumes,” said executive director Susan B. Anthony. “It’s a landmark exhibition that builds on the landmark exhibition, introducing new technologies and new perspectives while applying the themes of perfume to issues of smell", "The next Biennial should take place at the São Paulo State University from January 31 to April 23, 2021. “The Biennial is a project of the Federal Ministry of Culture, Arts, Sport, Science, and Innovation, which aims to create and develop new opportunities for cultural exchange between Brazil and the rest of the world,” said the minister. The official selection of the exhibition, “Would You Rather,” will be held in April.In the past, the Biennial has featured works by more than 600 artists, including Jesus Monir Aguiluz, Maya Uffizi, and Jodie Warner. The 2019 edition, “Cindy Sherman: A Biennial of Art,” was held at the Museu de Arte de São Paulo and hosted by the mayor of São Paulo, Jair Bolsonaro.\n\n\nThe Jamaican artist and activist Tawana Olu Oweis, who along with her husband formed the group Save Our Trees, has been nominated for a 2017 Nobel Peace Prize. The couple, who were given the award by Swedish Prime Minister Stefan Løkke Rasmussen in Oslo on December 7, had campaigned for the award to recognize their efforts to save more", "The next Biennial should be held in 2020. The Kickstarter campaign for the event has raised more than $17,000.\n\n\nThe Kauffman Foundation in New York announced today that its David Hartigan & Co. fine art auction will be held at the Javits Center this fall. The auction will be curated by Christie’s New York director, Matthew Christie. Hartigan, who currently serves as curator of modern and contemporary art at the museum, will assume the role of director of the center next month.“In an age when significant cultural institutions are struggling to address the impact of the coronavirus, we are thrilled to introduce the world to the work of David Hartigan,” said Christie’s new chief executive officer, Lora Bonk, in a statement. “With his vision and passion for contemporary art and his ability to bring the intimate and the extraordinary to our lives, he has built a distinguished career as a curator. We are grateful to the David Hartigan Foundation for the opportunity it has provided to support his art career and for its generosity in supporting his museum.”The foundation is also extending a financial gift to the institution. It received $2 million from the Klein Foundation in support of the center’", "The next Biennial should be held in the spring of 2022. Artforum said that the new location for the exhibition is the Brooklyn arts space YBA, which will create a new 360-degree gallery space in the new building. Perhaps most significantly, the exhibition will be organized around a theme of human rights, sustainability, and the future of the planet. According to the Art Newspaper, the exhibition will follow the \"tideline, a legendary painting by Pablo Picasso’s The Life and Times of Christ (1935), which explores the meaning of the line between creation and destruction, between life and death, between sides of a wall.”\n\n\nThe National Gallery of Art in Washington, DC, has received a gift of twenty-one works by artists, including Anish Kapoor, Visual AIDS, and Piyush Bhandari, from the estate of Mahatma Gandhi. The institution also revealed that it has added thirty-one works by local and international artists who will be on display in the museum’s new venue, the National Museum of Art. The works are part of the collection of the late Indian artist-activist and activist Bikashimha Rao, the daughter of Mahatma Gandhi,", "The next Biennial should be held in 2020. \n\n\nThe Metropolitan Museum of Art (the museum) in New York has received a gift of more than three hundred artworks from the collection of Maurice Greenberg, the late cofounder of the company that manufactured the eponymous brand of toothpaste, a gift estimated to be worth more than $200 million. The works, which were originally acquired by the museum in 1968, were moved to its current home in the year 2020 and are on display at the museum until November 21.“Maurice Greenberg’s legacy is an inspiration for us all,” said Bruce Gendelman, the museum’s director and chief curator. “The gifts include his most recent work, ‘Sun, Wind, and Rain,’ a series of three paintings that examine the relationship between the environment and the natural world through three different approaches: radiating sunlight, reflecting water, and reflecting sun.”The works, which were originally presented to the museum as part of a special exhibition, “Maurice Greenberg: Past, Present, and Future” (2018–19), were recently transferred to the collection of the Greenberg Trust, which has been collecting for the last fifteen years. Prior", "The next Biennial should take place at the San Francisco Museum of Modern Art (SFMoMA), which will host the event in November 2020. Former director Ann-Sophie Berger, who launched the event after sabbaticals at the Venice Biennale in 2008 and 2013, has been appointed as the interim director of the museum. Berger, who has served as the interim board chair since 2014, will assume her responsibilities on November 28. The biennial will also implement new social distancing measures to prevent crowding and will introduce new works and exhibitions.\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed William Deresiewicz as its next executive director. Deresiewicz comes to the MFA from the London-based nonprofit the Art Dealers Association (ADAA), which he founded in 1994. He succeeds Steven L. Carter, who has served in the role of director of the Fletcher Art Museum in Norwich, Connecticut, since April 2020 and will take up his post in November 2020.“Bill is a seasoned curator and organizer who has been instrumental in the organizing and development of the MFA’s annual biennial, ‘Between the Sun and the Moon’s 19th Anniversary,” said", "The next Biennial should take place in 2020. The venue will be moved and renamed and the work – which will be based on a drawing from the artist’s memory – will be presented by curator Marina Caccia, director of the Cagli Galleries, Italy. The opening ceremony will be held at the Veneto Museum of Art (V.I.M.A.), in Milan, on September 14.\n\n\nThe Museum of Contemporary Art (MoCA) in New York has appointed Adrian Wojnar as its next director. Wojnar is currently the executive director of the nonprofit Whitney Museum of American Art, where he has served as interim director since August.He succeeds David Schulner, who is departing to become director of the Metropolitan Museum of Art in New York, and will assume his responsibilities on October 2, 2020.“The museum has been headed by David in recent years and has been a model for a museum for the city and state of New York for its commitment to supporting artists and for its ability to take risks and grow the public conversation around art,” Wojnar said in a statement. “I’m looking forward to continuing this work with the museum’s talented and dedicated staff, and to", "The next Biennial should focus on “Thee, O Lord, in Unity,” a creative work by the Indian artist Pradeep Swaminathan. The upcoming edition will also host artist and curator Priya Gupta. The twenty-sixth edition will be held at the Art and Design Museum in New Delhi from December 5 to December 6. The theme of the biennial will be “Beauty and the Art,” and the show will be organized as usual. The event will be inaugurated by a presentation of the new collection of the artist Riccardo Manzoni, “Irresistible Effervesce: The Art of Rain.”The next exhibition in the series will be “Astrid & Lillian: After the Fall of the Three-Body Type.” The exhibition will open in January 2020 and will present the work of the artist Agustín Arteaga. Tania Bruguière, the curator of the exhibition, told the artnet that the biennial’s next edition should trace the evolution of the themes in the exhibition. “In the current moment of global crisis, we are facing a fundamental question: How to live together in harmony, how to", "The next Biennial should take place at the Museum of Contemporary Art (MCA), Chicago, in 2021.  The next edition of the Foundation Art Biennial will be held at the Museum of Contemporary Art, which is currently undergoing a $250 million renovation. The next edition of the Sculpture Biennial will be held at the Museum of Contemporary Art, Los Angeles, in 2021. \n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it is planning to move the upcoming two-year-long celebration of the museum’s 200th anniversary from April 2020 to November 2021. The move was made in reaction to a demand from local residents in the city to hold a referendum to delay the event.“We are carefully listening to the community and listening to their concerns, and we believe this is an unprecedented time to hold a referendum,” said director Klaus Biesenbach. “The Museum of Contemporary Art has always been about following our values and about showing work by artists whose practices are at variance with our own. But we also believe it is an opportunity for the public to have a close emotional and spiritual connection with the institution.”The museum’s new policy for future programming outlines that", "The next Biennial should take place in late summer or early fall. The theme is “Reality Politics.” The 2018 organisers’ stated that the event was created with a “simple goal: to create an exhibition that celebrates the importance of art and the creative process in the world.” “The exhibition is organized around three themes: the exhibition of work by artists, the exhibition of work by local artists, and the exhibition of work by international artists.”\n\n\nThe Taubman Center for Art and Media in New York has appointed Jennifer Mascia as its next executive director. Mascia comes to the institution from the Brooklyn Academy of Art, where she has served as a curator for fifteen years, and will assume her responsibilities in March 2020.“Jennifer’s work has been recognized internationally for bringing the Taubman Center for Art and Media and the work of artists and activists into dialogue with the Taubman Center’s audiences, artists, activists and activists, and the Taubman Center for Art and Media’s collections and exhibitions,” said center director Timothy Rub. “Her curatorial expertise and experience in connecting with artists and activists, as well as her passion for connecting", "The next Biennial should focus on “human rights and the environment” and will be held in late November or early December in Seoul.\n\n\nThe museum in Paris has appointed Laurent Burgier as its next director-general. He succeeds Roberto Cicutto, who departed the institution in April after eleven years to head the Chevignes-le-Fleuries, a contemporary art museum in the city of Leomister, Switzerland.“We are delighted to welcome Laurent, who has the vision, the energy, and the competence to improve the quality and balance of our programming,” said Jean-Luc Lafontaine, president of the museum. “Over the years, he has developed a reputation for being an expert and forward-thinking curator, and we are counting on him to establish new and expanded themes and content that represent the legacy of the museum.”The new director-general will work closely with the current director-general, Régis Maréchal, who will assume his post on September 30. During his tenure, Burgier will oversee the development of the museum’s collection strategy, the collection program, and the development of the museum’s exhibition program, and will spearhead the museum’s", "The next Biennial should take place in 2021, and the first exhibition in 2022. The symposium’s next edition will be held at the Künstlerhaus Berlin (KMB) in 2020, with the Künstlerhaus Berlin, the Künstlerhaus Stuttgart, and the Künstlerhaus Basel in 2021.“In order to be able to present the 2017 exhibition, we decided to rebrand to Biennale,” said Kunstler Dieter Klogl, chief curator of the Künstlerhaus Berlin. The new name, the golden-age Biennale, is a composite of the words Bien, the term of the art, and Biennale. The exhibition will focus on the life and work of artist-in-exile José Andrés, whose works are housed in the collections of the Künstlerhaus, the Künstlerhaus Stuttgart, the Künstlerhaus Basel, and the Künstlerhaus Berlin.Among the works on display in the show are Aristoteles and the Sea, a", "The next Biennial should focus on themes of sustainability and the environment, which is something that we are really passionate about.”As part of its partnership with the Biennials, the Art Institute of Chicago will receive $1.4 million from the Global Fund for the Arts and will partner with local artists to create a new exhibition titled “Sustainability: Making the Most of an Unstable World.” The show will take place in the Art Institute’s new home on the third floor of a former factory on the South Side of Chicago, which will open in the fall of 2020. The museum will also continue its work to acquire and preserve the artworks and artifacts of late cultural leader and socialist architect John Wanamaker, whose legacy includes the creation of the Dowling-Prestel Art Museum in New York.The partnership with the museum is part of a larger strategy to acquire and preserve works by late Chicagoan artists and to expand the collection of the Art Institute of Chicago. The institution is currently working to raise $11 million to organize and build an additional 500,000 square feet of space in its current space in the ground-floor museum. The project will also involve the restoration of the existing facade of the museum and the renovation of", "The next Biennial should take place in the spring of 2021. Julia Vaughn, who has served as chief curator at the museum since 2014, will be named interim director. “The Biennial is a great legacy organization, and I am excited to continue to shepherd this incredible collection into the future,” Vaughn said. She added that she looks forward to working with the board and staff to ensure the museum’s future remains in the collection’s public interest.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that Migoten Ismailq, a visiting artist and curator based in Port-au-Prince, has won the 2019 Artistic Artists’ Grant. The award, which honors artists who have made significant contributions to their respective fields and has been presented annually since 1987, will support the performance artist and filmmaker. “The award is a gift from MoCA to ensure that the highest standards of artistic excellence are met by visiting artists across the nation, and the world,” said director Joseph Kahn. “As an open-minded, open-hearted, and compassionate visionary, he embodies the best of contemporary art. The extraordinary life story of an", "The next Biennial should take place in the city in 2023. \n\n\nThe Carnegie Museum of Art in Pittsburgh, which laid off more than eighty staffers on Friday, December 16, to protest the museum’s decision to close its doors indefinitely, is asking the public to come visit the institution in an effort to reopen in April 2020.The museum announced last month that it would close permanently on March 31, 2020, in order to address the Covid-19 outbreak. “The Carnegie Museum of Art is committed to providing a safe and enjoyable environment for our visitors, both onsite and with our programs,” museum director Maria Balshaw said in a statement. “We believe this is the best path forward for the museum, and we are actively working with our staff to understand the best possibility for the institution when we reopen in April.”On Monday, the museum said that seventy-one employees are facing layoffs and that ninety-three others will be furloughed, and sixty-four others will be laid off during the first phase of its reopening in April, which is expected to begin March 22. The museum anticipates furloughing around eighty staffers while it conducts a “factual review” of its", "The next Biennial should focus on a general history of artistic practice and the formulation of a new set of ethical and political questions, with a view to discerning new ways of collaborating with artists. In the meantime, it will allow the Biennials to become a tool for democratizing knowledge and a platform for the reflection and clarifications of the people around the globe. The  “Theatre of the Future”’s 2020 edition “will be a reflection of our times\u0097a full of life and vitality.” The festival will take place at the Eiffel Tower from January 5 to January 7, 2020 and will include a selection of performances, including the first Open-Air Biennial ever staged by the city of Paris.For more information, visit the Eiffel Tower’s website.  The upcoming Art of the Party is being organized by the DAX Alliance and its sister organization, the Brussels Design Center for Contemporary Art (BDC), and will run January 19–January 22, 2020. The theme, Digital Life and the Art Market, will focus on the digital sphere and the future of art. The Art of the Party will be divided into two sections: “veil", "The next Biennial should be held in the spring of 2020.\n\n\nThe Metropolitan Museum of Art in New York has announced that it is reopening this week, March 14–March 16. The institution also announced that it intends to begin welcoming visitors again on March 16, and to hold another exhibition of work by the artist-in-residence, Rirkrit Tiravanija, in the spring of 2021. The exhibition, titled After Life, was previously on view from March 11–March 19, 2019.The Metropolitan Museum of Art has also announced that it will begin accepting visitors again next week, March 13–March 16.\n\n\nThe New York City Department of Cultural Affairs (DCLA) will unveil a new $1.2 billion cultural redevelopment plan that aims to protect art, preserve historic sites, and attract new audiences\u0097a move designed to mitigate the city’s rising costs of health care, education, and housing. The 2020 plan, which outlines the city’s cultural landscape, will be unveiled on April 14.The plan, which outlines the cultural landscape of the city with specific reference to the architectural styles and designs of landmark buildings, was developed in partnership with the city’s cultural and community leaders and is", "The next Biennial should be held in 2021, but the organizers say they may push it back as much as five years. “Biennials are phenomenal events,” said biennial cochair John C. Birkett, who will step down from his post this summer. “I’m sure they’ve got lots of ideas for what we’re going to do next. I think a lot of people have an affinity for the way that [the Biennials] have been structured in the past. So, I think it will be very interesting to see where they go next.”The 2017 edition was held at the San Francisco Museum of Modern Art (SFMoMA) and featured the work of seventy-four artists, including Sadiq Eid, Amanda Conner, Gilles Gant, ÜRita Katz, Sara Bareilles, Sheryl Lee, Thierry Rech, and Kirsten Tate.\n\n\nLouis Vuitton has announced that it is expanding the company’s multidisciplinary, global art museum network with three new partnerships. The partnership with David Kordansky and David H. Koch will enable the company to invest more in", "The next Biennial should be held in 2020, when the exhibition will be inaugurated with a new exhibition of works by the new generation of contemporary artists.Tomorrow (Thursday) marks the opening of the new exhibition “Jalil Al Khattab” at the Noguchi Museum in New York. The show will feature works by fourteen artists, including Nabil Ahmed, Tajikova Akbarny, and the Algerian artist Qassem Suleimani. Its first edition was held at the Museum of Modern Art in New York in 2018. “Noguchi is a game-changer in its field, a pioneer of the contemporary, a thinker whose practice spans art, culture, and politics,” said James M. Kahn, the Noguchi Museum’s director. Commenting on his appointment, Noguchi said: “I’m excited to join the Noguchi Museum, a contemporary art museum founded by and for the community. It’s a wonderful opportunity to work with the talented artists who have the power to shape the direction of our lives and their art, to work with the talented staff and to establish a track record as a leader in the field.�", "The next Biennial should be held in the autumn of 2021.<|endoftext|>On February 3, 2019, the New York City Department of Cultural Affairs (DCLA) issued an order banning New York’s Museum of the City of New York from reopening until it implemented safety measures to prevent the spread of Covid-19. The order, which also requires that all outdoor openings of the museum be suspended for a minimum of six months, was issued in response to the coronavirus—the direct result of which, according to the DCLA, is “a significant loss of life.” The department is currently implementing safety measures to mitigate the spread of the virus, which was first identified in December—including limiting gatherings indoors, limiting travel to and from the city, and limiting large public gatherings.While the department has yet to set a specific date for the complete closure of the museum—it has also stated that it will release a list of institutions that have not yet been deemed “at high risk of Covid-19 and will share that information with visitors—it has stated that it expects the closure to be in the range of ninety days. While the department will announce a date for a ‘full and immediate closure’ sometime in the", "The next Biennial should be held sometime in the second half of 2020. For the biennial, it will be a chance to visit the Detroit Museum of Art (DMA), and perhaps see the works of artists such as Pierre-Auguste Renoir, Robert Irwin, and Carolyn Parrish, as well as the works of J. M. W. Larson, Charles Schulz, and Ernest Hemingway. The artist group Kilis will be the main attraction. The show will also feature a collection of works by forty-three artists from the Detroit region. Among the works that will be on display is a selection made by the artist Marcia Gordon that is on loan to the museum from the M Woods Foundation. Her work will be presented in the form of a video installation that will run throughout the biennial. The exhibition will feature works by forty-three Detroit artists selected from a pool of thirty-six artists who reside in the city. The biennial will also showcase the work of twenty-six artists from the region in a series that will run from March 28 to April 5.The Detroit Institute of Arts (DIA) announced today that Leila Johnson-Mattox has been named the inaugural director of the DIA. Johnson-Matt", "The next Biennial should be ready by year-end.\n\n\nThe Institute of Contemporary Arts (ICA) in London has appointed David McAllister as the next director, following the departure of director-general Nicholas Cullinan. “We are delighted that David is now able to return to the ICA,” said ICA director Fergus Walsh. “His extensive experience, combined with his passion for London and his deep understanding of the arts and design, makes him uniquely qualified to lead the ICA through this tumultuous and uncertain future.”McAllister comes to the ICA from the London-based think tank Artnet, where he has served as director of strategic partnerships. He succeeds Jenny Hill, who announced her resignation amidst the coronavirus pandemic, and will take up the post on June 8.Commenting on the appointment, Walsh said: “David is a visionary and talented leader, who has been instrumental in bringing ICA to the forefront of the global conversation around design. He has led ICA through a period of tremendous growth over the last decade, and we are grateful for his tireless work in growing the ICA from a small space in Kensington to a respected global leader in contemporary design.”", "The next Biennial should be held in 2020.  The history of the Biennial is also filled with examples of a multitude of artists and cultural institutions collaborating to better understand and use the power of technology. The question is, will the new technologies improve upon these interactions and help to give life to the stories told through them? \n\n\nThe Kölnische Kunstverein (KUNL) in Germany has announced that Maren Bohn, a curator and writer based in New York, will be its inaugural director. Bohn will assume her responsibilities on August 4, 2020. She succeeds João J. de Mello, who was promoted to the role of director of the Kunsthalle Dortmund in November.“The Kölnische Kunstverein has always been concerned with the evolution and development of the contemporary aesthetic in Germany, and we are now at a point where we are finally entering an era of reinvention,” said Bohn, who will remain based at the Kunsthalle Dortmund. “I’m inspired by the Kölnische Kunstverein’s commitment to the collective and the vision of a ŜWohnen Länder, a future Germany with a strong sense of", "The next Biennial should be held in 2021 and the first in 2022. The exhibition will, among other things, celebrate the centenary of the creation of the Republic of Vienna. The venue will be relocated to a new site in the capital of Austria and will be inaugurated by an exhibition dedicated to the history of art. The 2015 edition of the fair, which was moved to Vienna from the capital in June, saw almost 6,600 visitors from forty-eight countries.In its place of the annual show, the institution will stage a new exhibition dedicated to the art of the late nineteenth century, which is expected to open in January 2021. Bradley Johnson, the director of the branch of the museum in New York that will stage the exhibition, called the move a “transformative moment.” The organization will also be inaugurated by a new program of programming, which will be organized as a series of lectures and talks, entitled “Art and Reality” and will feature works by fifty artists. The program will be centered around the exhibition “The Future is Now” and will run throughout the museum until September.The first show of its kind at the museum will be “Paul Gauguin & French,�", "The next Biennial should be held at the University of Oxford sometime in May 2020. Members of the exhibition’s staff will be invited to the upcoming exhibition. \n\n\nThe Whitney Museum of American Art has launched a new digital platform that will allow visitors to view the work of the year’s most influential artists on its website. Titled The Whitney Museum of American Art 2018, the platform will allow visitors to scan a digital image of a work’s title page and will then be able to point to a particular section within the work to see a live preview of the work. “The Whitney has been supporting artists and performing artists since its founding in 1833, and the platform makes this possible,” said Whitney director Joseph Kahn. “The digital preview will allow you to see the work in person and experience the exhibition in a way that you haven’t experienced for a decade.”The works for the platform are as follows:In the galleryMitch Albom’s Sonari: “Sonari’s Rebirth, 2019, 2017, 2018, and 2017, 2018, and 2018. “Sonari’s Rebirth is about a woman who", "The next Biennial should be up and running by May 2021. The Exhibition Center of the Museum of Contemporary Art and the Hours will remain closed until the second Biennial in March 2022. The next Biennial will take place in 2022. The next Biennial will be on October 28, 2022.“The Biennial is a living thing, and so the events of the year come and go, and we are all affected,” museum director Asa Biema said in a statement. “We are all in this together.”\n\n\nThe Museum of Fine Arts (MFA) in Miami has posted an open letter by fifty-three artists, including William Dane, Mark di Suvero, and Thom Yorke, decrying the museum’s decision to remove their works from the institution’s collection. The letter, which was published on the museum’s website on March 13, reads:“We write to express our deep concern over the museum’s decision to postpone or postpone again the presentation of twelve works by thirty-nine artists we consider essential to the future of art and of the field: James P. Haslett, David H. Watson, Harry Callahan, Allen Jones, Jane", "The next Biennial should be held in the fall of 2020. [The next Biennial should be held in the fall of 2020.” The biennial’s director, John Douglas, told the Art Newspaper that the venue would be “fully inclusive, reflecting the diversity of our communities and biennial.” Since the program’s inception, it has invited more than 1,500 artists and has hosted more than 1,600 exhibitions. In a statement, the biennial said: “The 2018-2019 season marked the culmination of a year of innovation and experimentation with a series of multi-format exhibitions that explored new forms of art and the relationship between art and technology. We are excited by the experience this year with more than 1,450 artists, and look forward to the next chapter.”\n\n\nThanks to a $10 million gift from the artist and collector Michelle Noland, the New York and New Jersey Museum of Art (NYMCA) is once again celebrating its sixtieth anniversary this year. The institution announced today that it will reopen in 2020 as part of the Javits Center and will be inaugurated with a new exhibition, “Michelle Noland: A Century of Painting (1943–1968", "The next Biennial should include a program of exhibitions and performances that will involve diverse audiences. The theme for the 2020 event should be “Empowerment, Resistance, and Peace.” The Sydney only fair, Empowering Women: Art in Action from the African Diaspora, has been cancelled due to the coronavirus. “Since the coronavirus was first reported in Australia on March 23, 2019, we have been working tirelessly to remain inclusive and to support all our artists and staff, both in Australia and internationally, as they deal with the coronavirus,” said fair organiser, Chris Wootton. “We are committed to supporting our fairs and artists and are committed to working with all our galleries and curators to ensure the fair and the exhibition space are accessible and part of the community. We have also been working with the Australian Institute of Health and Safety (A.I.H.S.), the Australian Institute of Art (A.I.A.), the Royal Australian and New Zealand Art Museum (RANZ), and the Art Gallery of North Wales (AGW) to ensure a safe and enjoyable fair experience for everyone.”\n\n\nThe New Art Museum in", "The next Biennial should take place in the United Kingdom in 2022. The first was held in London in 2016.\n\n\nThe Museum of Modern Art (MoMA) in New York has received a $450,000 donation from the Robert Rauschenberg Foundation. The gift was made in recognition of MoMA’s contribution to the arts, and is one of the largest gifts the foundation has ever received. The donation was made on behalf of the Foundation’s board and creative and artistic director, Elin M. Berndt.“MoMA was one of the first cultural institutions in America to welcome the public within a thousand years,” said board chair Sharon Berger. “No institution in America has made this important artistic legacy more enduringly possible than MoMA. It has always been a creative center, and it will continue to be. We are thrilled that the foundation and MoMA are working together to support the foundation’s mission to advance the work of art and design with new scholarship and exhibitions, to develop new exhibitions and programs, and to promote the work of the greats, including Cézanne, Beaux, Hockney, and Booth.”The gift comes in recognition of MoMA’", "The next Biennial should take place in the Fall of 2019. Its inaugural event will feature the first public works of the museum in more than twenty years, titled The Grand Tour (2019), and will feature works by eighty-five artists and collectives from forty-nine countries. The biennial, which will run concurrently with the upcoming Art Basel Miami Beach triennial, will include activities including an exhibition of work on paper, an interactive series of lectures, and a virtual reality experience.“We are very much looking forward to welcoming you to Biennale Southbank,” said Bill Hammond, director of the museum and curator of contemporary art at the city of St Ives. The Biennale is “unique, innovative, and forward-thinking.” Commenting on the upcoming biennial, Simon Box, director of the Serpentine Gallery, London, said: “The new arrangement between the Royal Academy of Arts and the Serpentine Gallery will enable us to once again combine the most exciting and stimulating contemporary art and design with the most powerful and beautiful music of our time. Simon Box’s collection is an iconic example of how art and design can create transformative and moving environments for art. The new partnership will allow us", "The next Biennial should be held in 2021. “The museum is currently working to develop an international platform that will help the museum to gain new audiences, engage in modern, contemporary and contemporary art, build on its existing holdings, and present new exhibitions,” Artnet reported. Citing declining attendance, rising costs, and the financial crisis, the museum announced last month that it is now considering leaving the five-year cycle in 2020, with a new exhibition planned for 2021. The 2018 event, titled “Toleda Al Qasimi: The Artist in the Studio,” featured artists such as the Palestinian-American artist Walid Raad and the Sudanese-born, French-based artist Tarek Atoui.\n\n\nThe Vancouver Art Gallery (VAG) is planning a major expansion that will include the construction of new galleries and a public realm in the downtown core. VAG Vice-chair and CEO Michael Billington announced the expansion at a press conference on Wednesday. The project will bring the gallery’s total footprint in Canada up to 1,200 square feet\u0097a significant increase over the current space\u0097and will consist of the construction of seventeen new buildings. The $188 million expansion will", "The next Biennial should be held at the New Museum in New York next year, and we are currently soliciting applications for the 2020 edition.\n\n\nFollowing the Paris Air Show this week, museum directors in the United Kingdom announced that they are planning to begin reopening to the public in the coming weeks. “The exhibition of our exhibition ‘Air: Art, Politics, and Design’ has shown that the future of the art show is far from certain,” Richard Butler, the director of Tate Britain, told the Art Newspaper. “We are at the beginning stages of a reopening strategy that can deliver on the 2020 exhibition and the 2020 exhibition should be ready for visitors by the middle of April. This will not only ensure that future shows we organize are of the highest standard but will also put in place the necessary infrastructure to support an open-air environment for future exhibitions.”The exhibition, which examined the exhibition space and exhibition format in the same way that “Air’s 2040 theme, ‘Air: Art, Politics, and Design’ would have been presented by a museum dedicated to the art of air\u0097an Air Show that is not a museum for the art of air\u0097has", "The next Biennial should be held in 2021. Art Basel’s intention is to present at least three exhibitions every year, but this may not be possible in the current climate. “The problem is that we live in an age of pressure,” said Art Basel’s director Marc-Olivier Moritz in a statement. “We have to rethink our exhibition programming in order to avoid being caught in a cycle of creativity and exhibition. Our next Biennial will be about moving forward, not about rebuilding.”\n\n\nThe Metropolitan Museum of Art in New York has announced the launch of two new initiatives to support artists working in the arts. The first initiative, an online-only program that launched on June 17, will help provide funding for artists of all disciplines who are facing financial hardship due to Covid-19—the virus has infected more than 154,000 people and caused at least 7,000 deaths in the US alone. “Covid-19 has made clear that the financial impact of the pandemic on artists and the arts is not yet complete,” said David Chiu, chair of the Met’s board of trustees. “Our priority now is to support", "The next Biennial should take place in the autumn of 2020. In a letter in the English-language August 7, 2019, Oskar Eustis, chairman of the board and president of the Baader-Meinhof Group, added: “In fact, the exact date between events never changed. We are just glad that the date has been set. . . . We are both very happy with our work and very confident that we will continue to be at the forefront of the artistic and cultural life of Munich.”\n\n\nThe Center for Contemporary Art (CAA) in New York has appointed Laura Vickers as its first director of contemporary art. Vickers will take the helm of the museum’s digital and interactive spaces from director James Margolis, who will retire on January 28, 2021. In her new role, Vickers will oversee the operations of the CAA’s new digital platform, the Center for Contemporary Art, and will oversee the organization’s relationship to the museum’s current exhibitions, collections, and programs and will lead the development of new works.Commenting on her appointment, Vickers said: “I’m honored to be chosen as the new director of", "The next Biennial should be ready by 2020, but the institution informed the author that it expects to begin welcoming visitors in 2021. The editors of the magazine BIS, which is published by the Swiss Art Museum Basel, have previously said that the first exhibition of at least five artists will open at the institution in 2023.\n\n\nThe Chinese artist Wenyi Chen, known for her large-scale paintings that often rely on the artist as a medium through which to examine the workings of art and culture, has died at age eighty. According to the New York Times, the artist suffered from schizophrenia since 1968 and was known as a sort of spiritual adviser to artists and thinkers of the Cultural Revolution.Born in China in 1930, Chen grew up in Hong Kong, studied at the University of California, Berkeley, and the University of Pennsylvania. She moved to the United States in the 1950s and studied at the Art Institute of Chicago before moving to New York in the 1960s. Chen spent the next three decades in the city, where she met and married the American artist Harry Spencer. Chen went on to be a board partner at the Gallery of Modern Art (MoMA), where she met the American painter Harry Christovale, who became her husband in 1969.", "The next Biennial should focus on the changing role of museums in relation to the expanding global and regional identities of the participants. The theme should be “Museum as Center of Multiculturalism: United States, Mexico, and Central and South America.”The next edition of the International Biennial will take place in 2022.\n\n\nThe American Ballet Theater in New York and the Metropolitan Opera in New York City have announced that they are preparing to open their new, 280,000-square-foot headquarters in a former auto body plant in the Bronx on January 7, 2020. The new venue will be inaugurated by a solo performance by the new company, the world’s largest independent company of choreography, at the Metropolitan Opera’s new home in the building’s auditoriums lobby in the evening of the March 14–March 17. The new center will be named for the Ballyhoo family, who been active in New York City for more than two decades, and will be led by Michael Rosenbaum, director and artistic director of the Ballet Theater. The company’s current site in the building, which is zoned for commercial use only, will be transformed into a", "The next Biennial should be held in 2021.\n\n\nThe New York City Department of Cultural Affairs (DCLA) is planning to remove more than 1,500 Civil War and early-19th-century artifacts from its holdings and is attempting to sell or donate the works to museums.In a move that will alter the public perception of the Civil War in the city, the museum is planning to sell two significant works—a 1798 engraving by American artist Thomas Edison and a 1798 engraving by Thomas Sadler—to the Charles and David Simon family, the creators of the Happy Valley amusement park in Long Island City, New York.The sale is part of an initiative to engage with the family and the David Simon Museum in an effort to help them understand the legacy of the city. According to the New York Times, the museum is planning to create a public space at the park, which is currently undergoing a $1 billion facelift, for visitors to view the works. It will also begin a series of tours that will include the family and the museum.“We are thrilled to share the works with the family and the museum,” said museum director Matthew Teitelbaum. “These two works are immensely significant to the", "The next Biennial should take place in the United States, in 2021.\n\n\nThe Royal Academy of Arts (RA) in London has appointed Lady Akram as its new president. She succeeds Paul Mpagi Sepuya, who resigned last month after months of protests over his ties to the controversial biennial, the Black Lives Matter (BLM) biennial, and the Black Panthers (B.P).The academy has long resisted calls to cancel the exhibition “Black Power Live!,” which was scheduled to open in London in December 2020, citing safety concerns. However, in March, the Academy voted to move the exhibition online and cancel the event, which would have taken place in the museum.The decision prompted a swift backlash from artists and activists, including the Museum of Modern Art and the National Poetry Library, which issued a joint statement with the Royal Shakespeare Company and the National Poetry Vault in an attempt to halt the exhibition. The statement said that the move would “undermine the very premise of the festival, and put at risk the future of our Festival.” James Turrell, a London-based artist and Black activist, said: “This is a shameful moment for the Royal Academy of Arts, and the", "The next Biennial should take place in 2021. \n\n\nA new exhibition organized by the Künstlerhaus Berlin, a noncollecting contemporary art institution based in the former East German electrical substation near the Brandenburg Gate, has unveiled its first new work by Julian Schnabel. Titled Art in Motion: The Early Modern Era (Tietrich Kunsthalle), 2017, the exhibition offers a retrospective of the artist’s work in the form of a series of films, videos, concerts, screenings, documentaries, and performances, curated by Kalle Bäckstrand, curator of contemporary art, and Kathrin Schlegel, director of Künstlerhaus Berlin.“Julian Schnabel is one of the most important contemporary artists of our time, and his work is a unique and important source of inspiration for young and established artists of every generation,” said Schlegel. “It is especially fitting that the Künstlerhaus Berlin would present this work, partly as a landmark for some of the largest names of the contemporary art world to collaborate with the Künstlerhaus Berlin.”The exhibition, which was curated by Berlin’s artistic director Magnus Tro", "The next Biennial should be held in 2022, and the first in 2021. The project will also raise funds for the construction of a new exhibition space, the administration of which will be led by curator Erik Jacobsen, and the expansion of the museum’s collection.The reopening of the new exhibition hall will coincide with the opening of the biennial’s first book, “Sensations of Dantu: Between the World and Me.” The show will be curated by Reykjavík curator Magnus Løkke-Pedersen and will draw from the work of over seventy artists. The exhibition will feature works by a selection of the artists in the exhibition “The World as I See It: From the Surface of the Earth to the Surface of Other Worlds” (2019), which was also curated by Reykjavík curator Bjarnadóttir. The show will open on September 16.\n\n\nThe Centre Pompidou in Paris is planning to open a new 24,000-square-foot, art museum dedicated to the works of Pierre-Auguste Renoir in the coming years. The institution, which will be built in the city’s Old Port, is working with architect", "The next Biennial should take place in 2022. \n\n\nAfter a group of artists, designers, musicians, writers, and others raised more than $13 million for Boston Children’s Hospital in 2017, the organization handed out $6 million in grants to Boston’s arts and cultural organizations last year. The figures don’t count money that will be used in building hospitals, expanding arts and cultural programs, or reducing hours at art galleries.The Boston Children’s Fund, which was founded in 2003 by a group of local philanthropists, is the largest source of funding for children’s hospitals in the United States. The organization selects the winners and distributes the funds through individual donors. The fund also provides funding for programming at more than 1,800 child-friendly locations throughout Boston, including the Boston Public Schools, the Massachusetts Institute of Technology (MIT), and the Massachusetts Zoo.For the 2017 cycle, the fund received $7 million from thirty-five individuals—Angel Gramsci, Gianni Meotti, Carlo Nanni, Gio Ponti, Leo Peiño, Abdulrahman Al Shani, and Alfred De Heer—each of whom gave $1 million. The biennial,", "The next Biennial should be held at the end of October 2018.\n\n\nThe arts and culture sector is experiencing a surge of activity in the face of the coronavirus pandemic. According to the Art Newspaper, more than 100,000 people are currently attending and will participate in the third annual Art for America biennial, which will run from March 16 to March 20, 2020 in New Orleans.Established by the New Orleans–based nonprofit the New Orleans Arts and Culture Coalition (NOC), Art for America\u0097the first event of its kind\u0097will feature 500 works by 125 artists from thirty-seven states and seven countries. Participants will receive a $10,000 cash prize and will be given a 2,000-square-foot home to display their works.The organization is also working with the New Orleans Museum of Art (NOLA) to develop a new biennial research campaign for Artforum, the monthly magazine that focuses on contemporary art. Coinciding with the biennial will be a retrospective of artist-related works by thirty-seven artists that will open in September of 2020. The show will focus on the challenges and opportunities posed by the coronavirus. The show will be preceded and will be followed by a public lecture series", "The next Biennial should be held in 2020. The closest thing we have to a permanent collection will be the works on display at the upcoming exhibition, “Shelter: Contemporary Art of Arab and Islamic Art”. We look forward to presenting new works.\n\n\nThe National Poetry Library, the US’s national literary agency, has named Evelyn Harrison the new chair of its board of directors. Harrison will be an integral part of building the institution’s collection and providing access to one of the nation’s great treasures.“The board has a long history of working with Evelyn Harrison to deliver on her vision of delivering a national literary agency,” said board chair Andrew Armstrong. “Evelyn has been instrumental in aligning the library’s collection with the unique needs of the American people, creating a collection that reflects the diversity of voices in America. She is also highly respected in her field and by peers and peers only.”Also elected is John LeCompte, a US congressman from New York, who chairs the National Association of Poets. LeCompte said: “Evelyn Harrison is a formidable speaker and writer, and her influence has been felt for decades in", "The next Biennial should be held next year, and the museum will continue to host programming of its own accord—including the annual Hmong Cultural Festival and its annual Star-Spangled Banner.\n\n\nThe Israeli Museum of History (IMOK) in Jerusalem is planning to put out a statement clarifying that it does not want to recognize the Jewish state. In an open letter published on Thursday, the institution said that it is “concerned about the upcoming upcoming biennial ‘Between the Sea and the Sea,’ which will be organized by the Academic and Cultural Centre Herzliya, and will be held in the summer of 2021, and the implications of this exhibition for Israel-Palestine peace.”The letter, which was signed by Ishmael Naar, the director of the Israeli Museum of History, and Avraham Bar-Lev, the director of the National Museum of Tel Aviv, and was authored by Bar-Lev and Naar, was authored in response to the upcoming exhibition “Between the Sea and the Sea: Jewish and Arab Diplomacy,” which will be hosted by the Centre Herzliya from September 26 to October 5, 2021.According to a press release from the institution, the", "The next Biennial should be held in 2021. The first event, “The Artist’s House,” was held in 1994. The second, “The Martian Landscape,” was staged in 2001, and the third, “180 Days,” was staged in 2018.\n\n\nArt historian, educator, and friend and mentor Leslie Mann, a pioneer of American art and a cofounder of the American Institute of Art, has died at age eighty-seven at her home in San Francisco. She is survived by her daughter and her son.Born in Buffalo, New York, Mann moved to New York City in the 1940s after receiving her undergraduate degree from the University of Pennsylvania in New York. She continued her art studies at the University of Pennsylvania, where she met and married Lawrence Weiner, who eventually became her husband and her father. After divorcing Weiner in the 1970s, Mann began to focus on her own work. In 1987, she formed the Women’s Institute at the University of Chicago, where she would eventually teach in-depth courses on the art of their generation. Mann also founded the Museum of Modern Art in New York to celebrate the contributions of the late American painter Robert Irwin and the museum’", "The next Biennial should be completed in 2020.  The entry fee for the exhibition will be $15,000. Contemporaries the exhibition include Michael Larch, Alice Walker, John Askey, Hannah Wilke, Carol Black, Andrea Sola, Andrea Zapata, and Diana Carbo.\n\n\nThe Metropolitan Museum of Art in New York has announced that it plans to build a new Peter Sellars–designed Frank Gehry–designed building to house its collection of more than 1,650 works. The new venue will be named the Peter Sellars–designed Museum of the City, after the American businessman and philanthropist who first proposed the idea of a museum in Manhattan in 1965. The $1.7 billion institution is currently being built on Fifth Avenue between Fifty-Second and Fifty-Fourth Streets, and will be completed by 2025.A public commission, made up of designers Sitchin + Robinson, Vincent Price, and Paula Zucker, was awarded the $540,000 Presidential Design Grant for 2018–19, and the $270,000 for 2019–20, to design the new facility. This grant comes at a critical juncture for the museum. The museum’", "The next Biennial should be in 2020–21, Rebecca Solnit said. The first Biennials were held in 1960, and the second in 1972. The 2020 iteration will be hosted by the New Museum in New York, and the next will be the International, a new initiative that will address issues of science and technology and focus on the promotion of freedom of thought and expression in the arts. 'I appreciate the contribution you have made to the project, for better or worse, and I hope you continue to be a resource to the thousands of artists and thinkers we are privileged to support, including now, in 2017, when you were chosen as a part of the Biennials for Arts and Cultures initiative, allowing us to renew your work to present your creative work in future years, as we seek to create a new biennial series that empowers as many voices as possible,' said Solnit. \n\n\nThe Museum of Modern Art (MoMA) in New York has embarked on a major redesign overhaul that is expected to be completed in the spring of 2020. The $10 billion overhaul, which includes the acquisition and renovation of two historic buildings, the Metropolitan Museum of Art and the Museum of Modern Art, will also", "The next Biennial should be in the next four years, and will be hosted at the Royal Academy of Arts, London, in the autumn of 2022. The art world contemporary, for its part, is gearing up to welcome visitors to the inaugural exhibition, which will include works by twenty-four artists in the United Kingdom, in January 2021.A statement on the upcoming exhibition said: “The new Biennial will present the most ambitious series of exhibitions of contemporary art ever staged in the United Kingdom. It will also feature an unprecedented range of new artists, including the first exhibition of artists of colour, the first exhibition with a female artist, and the first exhibition of an artist from outside of the UK.”The inaugural exhibition, “The Struggle,” was organized by Diane Arbus Gallery. The second show, “Polarity,” will be hosted by David Salle at the National Gallery of Art, Boston, and will be on view until November 15. The third exhibition, “Metamorphosis: The Rise and Fall of Paul Gauguin,” will be on view from November 19 to November 22.The press release on the inaugural exhibition said that the inaugural exhibition “remains at the forefront of the contemporary", "The next Biennial should be held in January 2021.\n\n\nThe 2018 edition of the Venice Biennale was marred by a major security breach, with the exhibition’s main stage, Pier Paolo Nitti, and the Palazzo Nelletta marred by smoke. According to the organizers of the exhibition, the security measures taken to contain the fire were insufficient, leading to the leak of the show’s discusstion, “Days of Smoke and Mirrors,” to YouTube. While the show depicts the exhibition’s history, it is not meant to be taken literally and depicts images from the show.Following the incident, the organizers of the exhibition announced that they were working with building management to prepare the building for the event, which will take place at the Palazzo Nelletta between June 14 and June 16. The show will be organized as a “show of things that happen.”The opening of the exhibition was delayed by one week after the fire brigade was called to the exhibition and by one day after the museum received the first threat of an incident. The three days of the firefighting efforts were interrupted when the fire was extinguished by the authorities. The fire had already spread", "The next Biennial should take place in 2019. “I have always believed that the future of the art of Boston is in the city’s hands,” said Mayor Charlie Evans, who was instrumental in securing a $1 billion budget for the arts last year.Evans said that he hopes to see more biennials focused on social justice issues, such as art and sustainability in the future. The mayor also praised Sidney and Lois Bourne, who was named the city’s interim director of arts and culture last month, for their work in bringing the biennial to fruition. Although the city won a temporary injunction against the construction of the glass-enclosed Pavilion of Arts in 2016, the exhibition was canceled. The city’s budget for the 2020 event is $1.25 million.\n\n\nThe Belgium-based nonprofit organization Open Culture Foundation (OCF) has emerged as the latest beneficiary of the anti-union legislation that has been put into effect in the country since January 2019. A subsidiary of the Belgian arts organization Union des Arts et Lettins (UEL), the organization was forced to close last May after it was accused of intentionally distorting the marketing of an exhibition by Belgian curator Ron Alpe", "The next Biennial should be held in 2021. \n\n\nThe British Museum (BMI) has received a gift of 100 Old Masters, a series of twenty-one one thousand-year-old artifacts dating from the reign of King Alfred. The sculptures, which are housed at the institution’s Tate Britain site in London, were donated by a company, Paine Webber, in honor of a long-standing supporter of the museum.“The museum has long been concerned with how long the artworks will be used,” said director Maria Balshaw. “Tutu metamorphoses are an ideal vehicle for expressing this, as the artworks will be used for many years to come. We see them as an extension of the museum’s history, and feel a deep sense of kinship with them.”The artifacts have been on display at the museum since 2006, and the museum first presented them as part of its long-running exhibition “King Alfred” in 1994. The show revealed that the sculptures were fashioned from materials previously collected by the king, including ivory and amber from the remains of a prehistoric animal, and included pieces that had never before been seen by the public. The exhibition was also", "The next Biennial should take place in 2019.\n\n\nThe Church of the Flying Spaghetti Monster (CFCM) in Springfield, Massachusetts, has appointed James McAllister as its new artistic director. He succeeds Simon Albrecht, who announced in February that he would not be returning to the institution in the near future.“James brings with him a wealth of experience and knowledge in the fields of film, performance, and the visual arts, and we are eager to embrace his vision for the future of the CFCM,” said Larry Higgs, chair of the board of trustees of the CFCM and the director of the National Film and Television School. “With his extensive knowledge of the arts and his passion for the arts, he will provide a terrific complement to the current leadership and curatorial team.”McAllister, a longtime Academy Award–winning screenwriter and filmmaker who has helmed the Springfield institution for nearly twenty years, succeeds Mark DeLuca, who retired in March 2019 after twenty-five years at the helm of the museum.“The board is thrilled to welcome James to the CFCM family,” said board chair Laurie G. Adams. “His extraordinary track record as a leader", "The next Biennial should be held in late April, with a preliminary exhibition opening in May. The London-based museum, which was founded in 1926, was granted a major expansion in the summer of 2019. The museum now comprises a new building, a new exhibition space, and an extension to the museum that will open in 2022. “The museum is experiencing unprecedented growth and is far ahead of where it would like to be in terms of its exhibition programme and its collection,” said director Hamish Hamilton. “We are pleased that the biennial has passed its peak at the end of its current iteration, and that the new building will provide the fantastic opportunity for new exhibitions and works.”A selection of biennial works, the first exhibition in the series, “The End of an Age of Crime,” will open at the museum in June 2022. The exhibition will include new works by the artist and will be accompanied by a new collection of paintings.\n\n\nThe Yuz Museum in Beijing is opening an extension to its Beijing outpost that will include a gallery, a film theater, and a concert venue. The Yuz Museum—which encompasses more than 2,500 works and has relocated to Beijing’s 908", "The next Biennial should focus on “social and political interventions,” especially in the Middle East and North Africa, said Deanna Haggag, the project director at the Center for European Art (CEA). “The next show should take a particular interest in the history of art and the impact of the art within. It should present the work in a contemporary context, yet reflect and reflecton the history of art as it pertains to us all,” she said.The 2019 biennial will be staged at the Institut-marché in Paris, which is currently undergoing a $1.5 billion expansion project, and will have an opening in January 2020. The theme “Be/longing: Art, Politics, and Gender” will be “‘Politics and the Female Body” in an attempt to consider the impact of female bodies in politics. The biennial will include works by forty-one artists and will be curated by Jean-François Arnaud, a former head of the National Gallery in Paris.Commenting on the inaugural ceremony, Arnaud said: “The challenge for us is to work within the constraints of the upcoming presidential election cycle. This is a delicate", "The next Biennial should be in 2020, and the first exhibition should be staged in 2022.  *\n\n\nThe Museum of Fine Arts (MFA) in Boston has announced that it is in the process of revamping its new headquarters, the Museum of Art, in the city of Boston, MA. The institution announced the redesign plans in December.“With a new design and a new mission, we are redefining how we present and engage with the art of the museum,” said Marlene Rudin, chair of the board of trustees. “We want to present the art of the museum in a way that is modern, contemporary, and alive. We’re also redesigning how the museum looks and feels to reflect and engage with the city.”The overhaul will include the addition of new galleries and spaces that will serve as training rooms for new scholars and a reimagined and expanded public plaza. The redesign was initiated by architect Jean-Jacques Brûlé, who was appointed by the city of Boston as the new chair of the board of trustees last month. In his new role, Brûlé will oversee the development of the museum’s collection and its collection program, which consists of several hundred", "The next Biennial should take place in the spring of 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has released the list of thirty-nine artists who are participating in the next edition of the Metropolitan Museum of Art (MoCA) “Metropolitan Bridge,” taking place between June 2 and June 9. The theme for the event is “Dissolve: The Art of Self-Portrait,” a collaboration between artist and artist-activist Walter de Maria, and Tate’s director Jonathan Sammer. The exhibition, which will focus on the history of photography, will showcase work by sixty artists and will showcase the work of seventy-five artists in an immersive environment in the museum.It is slated to run June 22–June 28. The full list of participating artists is as follows:ACANALDA, CIVILIZATION, FINEXCORTINO, FRANCESCO CARLO, JOSEPH COSTA, CARMEN CORGRELLO, MICHAEL FREER, GARY FRANKLIN, JOHN FROST, JOHN L. JONES, Ruth Ellis, and SANDRA LYNCH, M", "The next Biennial should take place in the northern city of Ghent, Belgium, in the spring of 2021. The biennial’s inaugural edition will examine the role of art in the treatment of various health problems, including depression and anxiety. The event will be hosted by the Ghent Museum of Art and the private collection of the artist.Curator Julew Dekkers, who is based in New York and Brussels, said: “It’s been an honor to work with these artists and to create this exhibition series for Arts+Lab. Their visionary work is vital for the future development of art and culture, and for the protection of our health and wellbeing. We wish them and their projects well.”The 2019 edition, “Announcing the Future of Art:” featured work by thirty-seven artists, including Boris Yarema, Cécile B. Cioffi, Janelle Varnbos, Oskar Eustis, and Cate Ehrlich, as well as eight curatorial projects, including a documentary and a photography show by Tina Fey and Blake Lively. For the exhibition’s seventh iteration, the artists have chosen to stage a “Welcome to the", "The next Biennial should take place in 2020. The Swiss pavilion is scheduled to open in the spring of 2021 and is expected to be inaugurated by an exhibition of works by the celebrated Belgian artist Catalina Corrias in January 2022.\n\n\nPerrotin, France’s modern art museum founded in 1972 with the goal of nurturing young talent, has been sold to a consortium of three French arts organizations in a deal valued at $4 billion. The sale includes the institution’s new headquarters in Paris, its former auditoriums in Saint-Tropez, and the prestigious Musée d’Art Contemporain in Marseille.In a statement, Perrotin President and CEO Julien Brouwers said: “The sale brings us one step closer to the vision of the Musée d’Art Contemporain, the current institution of the Michelangelo-Louis Vuillard, of transforming our museum into a channel for the extraordinary in our society. We are thrilled about the future of the Musée d’Art Contemporain, which began as a museum of art research in the 1970s and has offered a remarkable catalogue of works to the public through a dedicated collection.�", "The next Biennial should take place in 2021. \n\n\nThe National Gallery of Art in Washington, DC, has received a $105 million donation from the George and Susan Graham Foundation. The gift, which includes $100 million for the organization’s National Museum of African Art, the $75 million for its Art of the American Experience program, and the $50 million for its collection of works by African American artists, will help bolster the museum’s collections and enhance its public programs.“The gift is a great step in our journey to become a more fully integrated museum,” said David McAllister, the foundation’s founder and president. “It’s a tribute to the image, sound, and quality of the National Gallery of Art. We are grateful for the support of our dedicated trustees and friends. The museum will soon have a new, modern, and important home in Washington, DC.”The foundation also unveiled a new gift certificate program, which will give immediate cash grants of $100, $250, and $500 to individuals or organizations that are interested in learning more about the National Gallery of Art’s collections and programs. The program is being developed to help museums balance their financial needs with", "The next Biennial should have been held at least three years ago. If its organizers are going to focus on the artworks in a retrospective, then we must rethink how we present them. How can we draw attention to the current state of contemporary life with the aim of teaching about and engaging with cultural phenomena? It is also time to re-imagine what a museum of the future should look like. And most importantly, what will it look like? \n\n\nThe Ghanaian artist Wissam Buhl, known for his sculptures such as The Mound and the Pyramid, was awarded the Nobel Prize in Arts & Creativity on Thursday for the first time. Buhl was chosen from a shortlist of five nominees by an international jury in Stockholm, which curated the award. Buhl’s works, which are often constructed from skeletal remains, have been exhibited at the Venice Biennale twice before. The prize jury chose him for his extraordinary and vibrant Lego sculptures, which engage with the themes of geography, time, and the internal fragmentation of the African continent, which is often depicted as a geometric matrix of circular and hexagonal shapes.The jury also awarded Buhl a Nobel Peace Prize for his contributions to architecture and", "The next Biennial should focus on “The Spectacle of the Modern Arts” (2012), “Insomnia at the Museum of Modern Art” (2014), and “Bonjour,” also a 2008 exhibition. The first show of work from the new institution, entitled “Hannah Arendt: The Life and Death of the Babysitter,” will open on November 19. For the \"Hannah Arendt Show,\" the artist played a part in organizing a new cultural exchange with the museum to be held in the summer of 2020. “A very special exhibition that I made at the new museum,” the artist said in a statement. “At the invitation of the former director of the old museum, I was given the opportunity to present a show that would balance grief and rebirth in a way that would allow the audience to feel.”Among the works featured in the exhibition are Arendt’s The Origins of the Holocaust, 2018, a reconstruction of the events leading up to the 1938 deportation of German Jews to extermination camps; “Tulsa: City of Spites” (2018), a performance by T.A.K.M.,", "The next Biennial should be held in 2021, and will include the exhibition of work by twenty-six artists from different countries and territories in the United States, Canada, France, Germany, the United Kingdom, and Sweden to coincide with the twenty-fifth Biennial.\n\n\nThe Centre Pompidou in Paris has hired Kate McKinnon, a British American painter and filmmaker, artist-in-residence at the Centre Pompidou, and the Aubervilliers-le-Fleuriel region, France, as its new cultural ambassadors.According to Le Parisien, the appointment was made on January 27. McKinnon will soon take up the post of the Center Pompidou’s artistic director. She succeeds Jean-Christophe Prouvé, who will remain at the institution until the end of 2020, and will be responsible for representing the Pompidou.“Pamela and I are thrilled to be working with these talented artists and their families, especially the children, the young artists, and the artists whose work we admire and appreciate,” said McKinnon. “I am very proud to be a part of the Pompidou’s art collection, and to have been able to", "The next Biennial should also consider the possibility of using the existing St. Louis Art Museum’s collection as an anchor for a new exhibition. The museum is currently working on an exhibition centered around the life and work of artist George Artz, which is scheduled to open in 2020.\n\n\nThe Goldsmiths, the London art school, has launched an initiative to support young artists through a new exhibition, “The Young Art of Tomorrow.” Titled “Away from Academy,” the three-week event will feature work by seventy-five artists from twenty-seven countries. The festival will take place at London’s Tate Modern from September 9 to September 11, 2020.The program, which hopes to break a recent silence of more than two hundred days between exhibitions, will feature new artists appearing in “The Future Is Not What It Used To Be” (2019), “The Age of the Artist” (2019) and “The Future Is Not What It Used To Be” (2019). The artists will be asked to reflect on their futures, the present and the future.“We are delighted to invite young artists, especially those experiencing difficulties, to our programs to talk about their futures,", "The next Biennial should be held in October 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has hired Francesca M. Aparicio, who has worked as a curator at the Los Angeles County Museum of Art (LACMA), for its new curatorial roles. Aparicio joins the museum after serving as the deputy director of curatorial affairs at the California Institute of Technology (CalArts) in Pasadena and as director of the California Contemporary Art Museum. In her new role, she will work with director Andrea Fraser, whose curatorial team is led by Brenda Chiu, to translate the museum’s rich collection of contemporary art into a three-dimensional exhibition format.“We’re thrilled to be able to bring Francesca’s vision to life as we develop the exhibition program at LACMA,” said museum director Anne-Marie Olszewski. “We’re honored to have her join the museum in its new role as director and to have her share her remarkable curatorial expertise with LACMA’s curators and staff. We look forward to working with Francesca and her team to make this a year of exceptional works by award-winning artists, and", "The next Biennial should focus on the evolution of the exhibition from a museum of modern art to one that is open to the public. The biennial should explore themes that have a social and cultural relevance for visitors. The first exhibition, entitled “Art in Action” (2016–17), was organized by the museum of modern art in Moscow. The show explored the role of art in the contemporary world through the process of mass production. The second Biennial won the 2017 Ekaterinarstvo Art Prize for his work Domination of the Group (2017), which consists of works by twenty-seven artists from twenty-eight countries.  “The exhibition program for the 2020 edition of Biennale de Lyon requires an innovative, inspiring, and courageous show that reflects our contemporary spirit and challenges the limits of the exhibition as well as the biennial itself,” said Lille-born, French, and Berlin-based artist Edouard Vuillard, a trustee of the prize. \n\n\nThe Museum of Contemporary Art (MoCA), London, announced today that it will gift the National Art Gallery of Ireland (NGA) a collection of twenty-five works by Renzo Piano, including The Changing", "The next Biennial should take place in 2020.\n\n\nMore than 1,500 workers have been laid off from the New Museum in New York as part of its plan to reduce the size of its collection by more than one hundred thousand items over the course of three years. The cuts, which are part of a $110 million restructuring plan that was released on Wednesday, will see the New Museum divest more than 80 percent of its holdings of art and cultural artifacts—including some 3,500 works and 1,400 rare books in the New Museum’s collection—from the Scoville-Bennett Corporation, a New York–based nonprofit dedicated to curating and exhibiting contemporary art.The New Museum announced the layoffs on July 14, one day after it laid off a full-time employee and three full-time contractors, marking the end of its three-year contract with the Scoville-Bennett Corporation. The New Museum received $8.4 million from the Scoville-Bennett Corporation’s inaugural biennial, “24/7,” and is expected to lose another $6 million during the six-month shutdown, which began on March 15 and runs through June 30.Since the staff reductions were first announced in April", "The next Biennial should be held as soon as possible, and should consider whether the recovery of the artworks as well as the future of the site can be brought to a satisfactory conclusion before the exhibition closes. We are therefore continuing our work with the team at the museum’s institution, which is in ongoing discussion with the artist about the possibility of returning to Biennial.\n\n\nThe 2017 edition of the Guggenheim Biennial, which ran from March 30 to March 31, in the Swiss Alps, has announced that it will suspend publication of the exhibition “Tales of New York,” due out on May 29, 2020. The exhibition, which assembles twenty-six original works by forty-one artists from twenty-two countries, was selected from a shortlist that included entries from Italy, Japan, Turkey, Russia, and Turkey, among others. The exhibition was given a full-length presentation at the exhibition’s Venice installation in October.“We were delighted to receive the full-length presentation of the biennial at the neo-Renaissance Villa di Trisulti in Venice in October, as we are confident that the exhibition will be a fruitful start to our new project in New York,” said", "The next Biennial should be held in 2021.The auction house will also begin the process of moving the museum’s collection to a new facility, which will be built on the campus of the University of Cambridge. The news comes amid a global health crisis caused by Covid-19, which has killed more than 4,500 people in the United States as of October 5. The Bristol Biennial will take place in the city’s Carnestry Museum from October 25 to November 5, 2021. The new venue will offer a new experience for visitors to Bristol, which is home to around twenty-seven museums and galleries. The newly renovated venues will offer a new exhibition, a new forum, and a new performance and reception space.The biennial will also launch a new online feature, behind the scenes, that will provide visitors with insight into the museum’s complex operations. “The Bristol Biennial is about to begin. We are excited to introduce this new platform that will allow visitors to see behind the scenes of the Bristol Museum of Art, and to share your thoughts on what makes the Bristol Museum of Art special,” said Mark Berry, director of the museum. “This is an exciting time", "The next Biennial should take place at the Museum of Contemporary Art (MoCA), later this year. \n\n\nThe Office of French President Emmanuel Macron announced on Friday that it is planning to move the next edition of the French pavilion from Paris to Lyon in the coming months. The move follows the reopening of the venue in September.“The French president made it clear that the future of our pavilion in Paris belongs to France,” said Miriam de Cooij, chair of the French pavilion. “We are very much looking forward to the next iteration of the French pavilion at the Lyon Art Festival, and I believe that this can only happen by the agreement of all the participating countries. I am convinced that this will be the year of art in France.”The move follows the French president’s 2016 declaration that the pavilion would remain in Paris through at least 2020, with a 2019 extension. Macron said the pavilion was “at a critical moment.” He added that the move would help France “maintain its global leadership in the art world.”\n\n\nArtsadia, a New York–based nonprofit that provides funding for creative projects in the arts, has awarded $", "The next Biennial should be held in 2022, and the forty-fourth will be presented in 2021. \n\n\nThe Museum of Contemporary Art (MoCA) in New York has released the list of fifty-five artists and collectives who will take part in the second edition of the New York Art Talks next month. The event, which will run from June 7–June 10, will present fourteen topics ranging from urban design to color theory.“On the occasion of the biennial, we wanted to take a moment to celebrate the incredible roster of artists and collectives who will be presenting work in the exhibition,” said Mark L. Yang, director and CEO of MoCA. “The artists selected this year reflect the breadth and depth of their specialties, reflecting a collective vision within the art world that is at once accessible and insistent. Their work is a reflection of the vitality of the contemporary art world and the breadth of contemporary thought.”The fifty-five artists selected for the exhibition were chosen by a jury chaired by Karla Livingston, who is currently president and CEO of the Greater New York Area Council of Artists; Mark Dalcesa, president and CEO of BH Gallery; and Mary A. Murrell, who serves as", "The next Biennial should launch in 2022. The timing of the event is not unexpected. The completion of the exhibition in 2021 has been subject to controversy for several years. In February 2020 the Israeli government decided to reschedule the opening of the exhibition, and in May 2020 the Israeli culture ministry released a statement saying that it was not planning to hold the exhibition at this point.The decision to cancel the exhibition was made following an emergency meeting of Israeli cabinet ministers, which was held on March 28. Minister of Culture Yaakov Peri, who was appointed by Prime Minister Benjamin Netanyahu, and Culture Minister Mira Dvorkin, who was elected by his Likud party, announced the decision after Peri and Dvorkin met with representatives of the Israeli Museum Association in an attempt to find a solution to the exhibition.They met with representatives from the national cultural council, which is made up of a chairman and a deputy director, and representatives from the national religious organization, which represents nearly three hundred cultural institutions. According to the Jerusalem Post, the meeting was held behind closed doors and was attended by only a small group of people.The decision to cancel the exhibition has faced strong opposition from the many institutions that supported the exhibition, including the Tel Aviv Museum of Art", "The next Biennial should be held in 2019. “The transformation of the current exhibition is a breakthrough that will redefine what an international exhibition can be and will change the face of contemporary art in the West,” said Silvia Bertolotti, the president of the Palazzo delle Papesalle, Milan.The project will also benefit the Italian arts, the Italian government, the city of Rome, and the Pirelli Foundation, which was founded by the late Milanese architect Paolo Cipolletta.\n\n\nThe Bechdel Test, a United States-based survey of artistic performance in the digital age, has declared that the art world’s fixation with aesthetics has reached a nadir. More than a third of the art-world awardees who took part in its February survey—a total that included work by artists such as Anatole Shagal, who created a series of sculptures with transparent plastic spheres that moved between the viewer and the works on display, and Max Beckmann, who used a system that required the viewer to hold three medium-size digital sculptures in his or her hands—have declared that they no longer value art as a medium for human communication. When asked whether they would be willing", "The next Biennial should take place in July 2020, at the Museum of Modern Art in New York. A biennial of the fashion industry is not new, but the Museum of Modern Art has been attempting to increase the number of participants from fifteen to fifty through the use of a multi-tiered selection of contemporary artists.Since the exhibition was first announced in 2012, the museum has staged ten editions, including the second and third, which were held in January 2020 and December 2020 respectively. The 2017 and 2020 exhibitions were hosted by the Biennale di Brescia and the Guggenheim in Milan. The first edition, entitled “Oyster and the Soul,” opened on October 7, 2019 and ran for three months. The second exhibition, entitled “Suspended Interiors,” was staged in January 2020 and featured twenty-five sculptures by twenty-two artists, including Ermenegildo Olmi, Ana De Armas, and Muñoz Pérez-Hernández. The third, titled “Oyster and Time,” was staged in April 2020 and premiered at the Museum of Modern Art in New York.\n\n\nThe Smithsonian’s National Museum of", "The next Biennial should be staged in the spring of 2020. The first exhibition was organized by the San Francisco Museum of Modern Art (SFMoMA), which will continue hosting a biennial in the spring of 2020. Architects: Danilo and Sara Cifelli | Partners: Knox Roesler & Partners; Becker & Stieglitz; Cavalli & Solelli; Gagosian/Pons, New York; Henri Pérez Projects, New York; and Kasmin, New York.The Hong Kong Biennial will be staged at the Hong Kong Art Museum, Hong Kong, from March 16–March 19, 2020. The Hong Kong Design Biennial will be staged in the fall of 2020. The Hong Kong Art Museum (HAM) will host its first Contemporary Art Basel Hong Kong in 2021. The Hong Kong Film Festival will be staged in the spring of 2021. The Hong Kong Art Festival will be held in the spring of 2021. The Hong Kong Book Fair will be held in the spring of 2022. The Hong Kong Book Market will be held in the spring of 2022. The Hong Kong Book Market will be held in the spring of", "The next Biennial should be held at the Architecture Museum in Manhattan in 2022.  For the past ten years, Richard and I have been working toward establishing a new institution dedicated to the history and legacy of the great mathematician Alan Turing. The idea of a Turing Biennial was born from two things: the anticipated reopening of the intellectual experiment and the need to create new space for the work of Turing and his contemporaries. We are delighted that this year’s event will celebrate the legacy of Alan Turing and the impact of his work on people and the arts. The biennial will consist of three distinct stories, each representing a different aspect of the mathematician’s life. The first story will take the form of a group exhibition, “Components of Logic and Turing” (2019) launched by the Institute of Contemporary Arts and the Walls Foundation, the UK’s national charitable organization. This exhibition will include the work of twelve artists, including Ben Bradlee, Beatriz Rivera, Agustín Pérez-Vélez, Tanya and Sander de Weems, and James and Llewellyn and Christian Gorchov. The second story will feature five individual canvases", "The next Biennial should be held at the Open Air Museum in Los Angeles in 2021. The proposal for the first iteration of the exhibition, titled 'The Future Is Not What We Created It,” was first presented at the Art Basel Biennial in Hong Kong in 2015. The museum has since been working on a redesign and is currently working toward a more contemporary and redesigned architecture and exterior. “We have been inspired by the Open Air Museum’s architecture since we first visited it in 1998,” said Museum Director Anna Henningsen. “The new and refreshed Open Air is more accessible and adaptable, reflecting the commitment to the museum as a public space that has been the hallmark of our history.”\n\n\nThe National Museum of Fine Arts (NMFA) in Washington, DC, has appointed Maureen Kellermann as the new deputy director for collections and exhibitions. Kellermann comes to the museum from the Smithsonian’s National Museum of African Art, where she has served as deputy director since 2013. She succeeds Kate Fowle, who retired in March 2019 after a decade at the helm of the institution.“This is a truly exciting time to join the talented and dedicated", "The next Biennial should be held in 2022.\n\n\nAfter Michigan withdrew from the 2020 edition of the Detroit Art Biennial, organizers decided to cancel the event, citing the short timeframe for the withdrawal. Instead of holding an exhibition of works by twenty-six artists, organizers will invite fifty-two artists from thirteen cities to Detroit for a series of discussions and workshops titled The Future Is Bright, which will take place at Woodward Avenue’s CNE from March 12 to March 14, 2020.“Twenty-six artists are going to Detroit, and the outcome of their work is going to be a visible statement about what the future is for artists,” said Randi Ansley, artistic director of Detroit Arts Commission. “That’s what matters to us.”The announcement follows the April 14 announcement that the Detroit Institute of Arts (DIA)’s upcoming season will be canceled. DIA’s first edition at Wayne State University in Detroit, which kicked off on March 24, ran from March 23 to March 28. During its run, the show will feature twelve artists, including Shelly Decker, Wangechi Mutu, Cara Masturbin, Cynthia Tindal", "The next Biennial should be held in 2022. For the past year, the six-person team has been working to make the final design of the pavilion, which is located on the National Gallery of Art’s campus, as transparent as possible and as beautiful as possible. The team hopes to unveil the pavilion at the end of the 2019–20 academic year.The pavilion will be made of three elements: a sculpture, a habitat, and a platform. The platform will be made of fifty-six pavilion-sized translucent glass spheres, each containing one hundred square feet of habitat. The sculpture, which will be open to the public for one day only, will be hosted by the Pavilion for the Arts at the American Museum of Natural History in New York. The habitat will be made from natural materials such as driftwood, leaves, and rain forest and will be repositioned on the pavilion’s South Lawn. The platform will be made from pavilion-sized round tables and will be open only once the biennial is over.On its website, the Pavilion for the Arts, which was founded by artist and philanthropist Cynthia Bailey in 2015, said that the pavilion will be “the largest permanent installation of contemporary art", "The next Biennial should be held in 2022 and the exhibition should be curated by a leading contemporary artist from the United States or Canada. It should contend with the ensuing controversy and uncertainty about the renomination of a new president, which has seen the US’s Democratic Party reelected in November and President Donald Trump's first term dragged into the 2020s. According to Artnet News, the next iteration of Art Basel Berlin will also include an expanded version of the iconic Berlin Art Market, where it will serve as a platform for local and international art, as well as a redesign of the exhibition space, which will be rebranded as the Biennale Pavilion, and will be held at least twice a year.For the exhibition’s inaugural edition in 2019, the biennial was forced to cancel a major New Year’s Eve celebration in protest of the election of Donald Trump, who has yet to take office and has yet to outline a specific plan for how he will govern once he does. The new design for the institution was also criticized by some art critics and Berliners for its lack of an outdoor space and its location in the former Füsthof district in Kreuzberg, the capital of North Rhine-Westphalia.�", "The next Biennial should be announced in the fall, opening to the public in 2020. The next edition will be staged in the Embassy of Finland in Dakar, the capital of Senegal, and the Museum of Contemporary Art, Paris; in the city of Dakar, in the United Arab Emirates; and in the city of Saint Petersburg, Russia. During the 2017 event, the first artist chosen for the honor was Eleanor Martin, who created a fully interactive sculpture for the exhibition. The institution behind the project was the Finnish Foundation for Contemporary Arts (Finmeity), which will receive a funding of €1.52 million. The Biennial is staged annually and is organized in partnership with the Finnish State Museum of Fine Arts. The biennial is also collaborating with the National Art Museum Finland to create a permanent retrospective of the artist and the museum has adopted the artist for the role of curator of the exhibition. The artist will receive a commission to create a new work for the biennial’s 2020 edition. “The Biennial is a unique event that brings together a global range of artists and the environment in a unique place, and is celebrated by Finland as a great success,” Finmeity director", "The next Biennial should be organized by the end of the year. The 2018 edition was held in August.\n\n\n\n\n\nAll of the artists who were chosen to join the exhibition “Art of the 21st Century” at the Museum of Contemporary Art Chicago (MCA) this year have withdrawn their works. The artists are opting out of the event, which is organized to commemorate the twenty-fifth anniversary of the first edition of the exhibition, which opens in November. The exhibition, which addresses contemporary art, history, and modernism, has faced backlash from critics who say it neglects the legacy of artists who were killed by the opioid epidemic, and has drawn ire from artists who claim the museum failed to include their works in the first place.According to the Art Newspaper, MCA’s president and CEO, Marc Glimcher, announced the artists’ withdrawal. “If the members of this exhibition had chosen to participate, the result would have been the same,” Glimcher said. “While our board of directors and I recognize the inherent value of the exhibition, which is a tribute to the artists whose work we hope will inspire, engage, and change lives, we feel that the next iteration of Art:", "The next Biennial should be called quickly, and as soon as possible. ”The museum has released a statement saying that the decision to cancel the event was made in “mutual agreement” with the artists. “In our view, the current exhibition is not in keeping with the spirit of the exhibition and the future of the exhibition,” the statement reads. The exhibition, “An Open Letter from a Muslim to an American” was presented by artist William S. Burroughs and his wife, Marilyn, at the Museum of Modern Art (MoMA), in September 2019. The show, which features the work of eighty-four artists, was inspired by a personal letter from the Tennessee Williams, who was also a convert to Islam, to his wife, Rosemary.In the letter, which was addressed to Nancy, a self-described “mad mother” who was serving a thirty-day sentence for beating her husband to death with a large iron rod after he objected to their relationship, Williams wrote: “As a Muslim woman I find it hard to believe that we are allowed to be physical with our husbands and yet we are allowed to have sex with our husbands.” He added:", "The next Biennial should take place in 2022.<|endoftext|>The New York City Department of Cultural Affairs has awarded $2.65 million in grants to twenty-seven arts organizations in the city. The funds will help them expand their programming across the boroughs, improve their property and landscape conservation practices, and implement more sustainable exhibition and public artworks.“We are proud to support thirty-six arts organizations in New York City, and by doing so, we are helping to shape the future of urban life for our residents, visitors, and local communities,” Elizabeth Elleman, director of the City Department of Cultural Affairs, told the Art Newspaper. “The arts are essential for the health, well-being, and economic well-being of our communities and we’re grateful to the artists who have made this possible.”In order to receive the funds, organizations must demonstrate that they have a minimum of two hundred square feet of space onsite, and demonstrate that their plans to present work within the next twelve months will not compromise the health, safety, or welfare of the public. The $1.25 million in grants also go toward developing a new public art in the city, and the $500,000 for the preservation of art", "The next Biennial should be called the Next Millennium.”The exhibition’s executive director, Amada Cruz, said: “We are delighted to be here for the fourth edition of TIFF, which is shaping up to be another very special and engaging year. We expect the next edition to be one of the most exciting and ambitious productions of our time. The full lineup of artists will consist of a select group of contemporary international artists, including artists from the U.K., the Americas, and the Far East, as well as a number of established and emerging artists who are pushing the boundaries of their respective fields. We are very excited to collaborate with our international teams to present the Next Millennium, and to continue the work of our visionary and dedicated curator, Rachel Whiteread, who has been instrumental in shaping the programme since it was founded in 1999.”The twenty-fifth edition of TIFF will be staged at the National Gallery of Australia in Canberra, in March 2020.\n\n\nThe Museum of Fine Arts (MFA) in Atlanta has appointed John E. Brown as its new deputy director of curatorial affairs. Brown will be responsible for coordinating the activities of more than 100 museums across the United States. He succeeds Megumi Yaman", "The next Biennial should be held at the San Francisco Museum of Modern Art (SFMoMA), in 2017. The first edition of the event, titled  “The Body,” was held in 2007 and was selected by a jury comprising art historian Amy Sher, curator Terrie Hornby, and biographer David Nolen. The biennial, which was curated by Robert Rauschenberg, was released in 2009 and ran until October 20, 2010.The 2015 edition of the event, titled “Collected Works of Art,” was hosted by the Episcopal Church on the campus of the High Museum of Art in Manhattan and featured works by a number of artists including Romain Leonel, Kiki Smith, and Mary Mattingly. The 2019 edition of the event, titled “The Full Museum,” will be held at the San Francisco Museum of Modern Art (SFMoMA), which is slated to reopen in 2021. Based on a theme of “human connection,” the exhibition will focus on the interdependence of the museum and the city. “The Body’s ‘Deana Lawson’s ‘The Body in Space’ and ‘Peter Spalter’s", "The next Biennial should be held in 2021, with the announcement of the organizers being made via a date to be announced in the coming months. The production organization said that the decision to cancel the exhibition was made after it discovered that there were 'serious concerns' regarding 10 of the thirteen exhibits in the show.Among the works that were removed from the show were the critically acclaimed “Cyrano de Bergerac” (2015), a monumental assemblage work that had been scheduled to open at the exhibition in September, and “Anton Kern & Barbara Graves” (2013), a group exhibition that was supposed to open at the very end of the exhibition’s run.“The upcoming edition of Art Basel Hong Kong will be a challenge for those who want to create a new contemporary exhibition with a more contemporary exhibition format,” Artnet reported. The show is slated to open in January 2021 and will be hosted by the Hong Kong Fair-Expo 2020.\n\n\nThe Chinese Ministry of Culture on Monday announced that the country will recognize the politically-charged cultural institution the Beijing Art Museum (BAM) as an official cultural site and said that the institution will be given the status of a national museum. The announcement coincides with", "The next Biennial should take place in the spring of 2020 and will be hosted at the Museo de Cultura Matadero in Lisbon, Portugal. Through the exhibition, the artist will present an exhibition of works on paper and will present a public sculpture program, inspired by his practice, for which he will receive a prize of $100,000. The exhibition will highlight his practice in the style of Christopher Wool and will take place across seven platforms, including the Museo arabilegico and the Museo de Arqueo. The exhibition will run from February 14 to February 20, 2020. \n\n\nThe Miami Beach Museum of Art (MBMA) has appointed Kara Walker as its next director and chief curator. Walker comes to the institution from the Los Angeles County Museum of Art (LACMA), where she has been the museum’s chief curator since 2016. She succeeds Kristen Clark, who was hired as director of the New York City Museum of Art (NYCMO), and will begin her position this month.“It is a fantastic opportunity for Kara to lead the MBMA through a transformative period,” said Marianne Neegley, chair of the board of trustees. “MB", "The next Biennial should take place in 2022. According to Artforum, the event will focus on how art has contributed to the prevention and treatment of communicable diseases and will focus on the work of twenty-two artists from the exhibition. The exhibition will be inaugurated at the San José Museum of Art in California on October 20. The 2019 event, called “World AIDS Biennial,” drew more than forty thousand people.\n\n\nThe Solomon R. Guggenheim Museum in New York has appointed Alexandra Owusu-Yazawa as its next director and CEO. Owusu-Yazawa comes to the institution from the New York–based nonprofit the Women’s March, which aims to mobilize 3.5 million people to take to the streets in order to push for policy changes that would increase access to reproductive health care, expand social services, and reduce racial and economic disparities in incarceration.“We are thrilled to welcome her to the Museum,” said director Timothy Potts. “Alexandra has the experience, vision, and leadership needed to manage the museum and deliver on the Guggenheim’s promise to be a transformative center for art and ideas", "The next Biennial should have been held at the City Museum in London, which has yet to announce when it will reopen. The event’s director, Tamara Schor, told the Art Newspaper: “For the past eighty years, the museum has championed the work of the world’s greatest living artists. As we approach the eighty-sixth anniversary of the biennial, we want to reflect on the legacy of our biennial with a sense of purpose. We hope that other sites in Europe will now consider the significance of this biennial in the context of their own history.”\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has released the list of seventy-seven artists and collectives whose works will be included in the reopening of the Metropolitan Museum of Art: seventy-two works by American painters, seventy-three works by Russian painters, and seventy-six works by artists from Central and South American countries.Among the artists selected for the reimagined Met are Carolee Schneemann (New York), Willa Cather (New York), Emily Davis (New York), Laurence Fontaine (New York), Harry L. Jackson (Albuquerque, New Mexico), David-", "The next Biennial should be held in the fall of 2022.\n\n\n\n\n\nSinger-songwriter, actor, and producer Phil Collins has died at age eighty-one following a long illness. He was one of the last living members of the experimental rock band the Who, whose career spanned four decades and three albums.Born in Brooklyn in 1947, Collins grew up in a musical family and joined the band The Who in the early 1950s after a personal relationship with Alice Cooper. The bandmates included Roger Daltrey and Keith Moon, who played bass and sang with Collins, alongside his brother Bob. The group became known for their experimental music videos, sculptures, and live performances, and their songwriting, which often dealt with issues of religion and spirituality. The group disbanded in 1971, but Collins remained active in the arts, appearing in several documentaries. In 1977, Collins was invited to join the group as part of a new deal signed by the surviving members of the Who. He accepted the invitation, but his decision to leave the group led to the group’s breakup the next year.In 1979, Collins moved to Los Angeles to join his brother, Bob, and their father, who was working as a truck driver. The family relocated from New", "The next Biennial should begin with a selection of works by contemporary artists from the West, including an exploration of the idea of postcolonial art. In addition, the festival will engage with the current state of the art through an exhibition of works by visiting artists, and will present the work of selected artists.\n\n\nThe Lincoln Center in New York has appointed Donna DeScioli as its next executive director. In her new position, she will oversee programming and public engagement for the center, which was founded by architect-turned-philanthropist Richard Daniels in 1963, and will oversee the development of the institution’s new convention center, which will be completed next year.“We are honored to welcome Donna to Lincoln Center, as we continue to build on the institution’s stature as a global cultural hub,” said David Kanders, director of the Lincoln Center. “Contemporary art is a universal language, and the center is pursuing a program of exhibitions, residencies, educational initiatives, and events that reflect the spirit and heart of Lincoln Center. Donna’s leadership in the design and development of the new Lincoln Center will be key to helping us realize our vision of a contemporary art museum in every community in America.”De", "The next Biennial should take place in 2020, on the occasion of the sixtieth anniversary of the festival. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has received a major gift of $1.5 million from the Her Majesty Queen Elizabeth II, the Sovereign Embassies of Denmark and the Netherlands, as well as the United Kingdom, in recognition of its outstanding achievements in the field of contemporary art. The gift, which was made in recognition of the institution’s achievements in supporting contemporary art, was delivered to the museum during a royal visit to London last month.“This is a truly remarkable day,” Royal British High Commissioner to the United Kingdom, Sir Nicholas Bequelin, said. “Queen Elizabeth II was delighted to receive the Kingdom’s gift of 1.5 million sterling in recognition of the outstanding achievements in museum exhibitions, collections, and scholarship in the kingdom. The gift is a further endorsement of the museum’s leadership position as one of the five great cultural centers in the world. As such, it is a truly wonderful occasion for the museum and for the country.” Among the pieces awarded are the Kingdom’s Three", "The next Biennial should focus on the history of pain research, and should reflect the current situation in our society. It should also consider how pain research is currently conducted, what is being lost, and how this information can be made available to the public. The first exhibition will be a retrospective of the work of the current exhibition, “Pain, Humanity, and the Social Environment,” which is currently on view until December 12. The show will also include a discussion with Cynthia Boccard, the director of the emeritus pain clinic at the University of California, Los Angeles, and an artist who created allusions to pain that have entered the exhibition.[Update: March 7, 10:40 AM] The New York Times reports that the Exhibition and Museum of Modern Art (MoMA) is now working with a new public relations firm that will help organize the show. The company will be helmed by Markus von Uexküden, a former creative director and curator of the Kunsthalle Basel and the Museum of Modern Art (MoMA) in New York. The artist-run organization, Geraeller Gallery Presents, will represent the exhibition. The news comes on the heels of a new investigation by the", "The next Biennial should be held in 2020.”The announcement comes on the heels of Art Basel Hong Kong’s decision to cancel the upcoming edition of the show, which was set to take place in Hong Kong from March 17 to March 19. The move followed a series of actions against the company that culminated with a movement called Art Basel Art Asia (ABTA), which was led by artists, including Keiichiro Nara, Ai Weiwei, Hayao Miyazaki, and Akira Kurosawa.The decision has prompted protests from many in Hong Kong, including some of the artists featured in the exhibition, who are demanding that the Hong Kong government reschedule the exhibition and allow them to perform in the city.“This is the longest-running exhibition in Hong Kong history and it has been a privilege to present the work of so many great artists for the exhibition,” said Esther Leung, chair of the board of trustees of the Leung Chin Art Museum. “I hope that the city of Hong Kong and the international community will be able to support the artists and arts of Hong Kong with the counseling and the art of the island.”\n\n\nThe museums of New York and", "The next Biennial should be held in December 2020.\n\n\nThe Museum of Greek Art in Athens, which was forced to close due to the coronavirus, has released a new set of guidelines for managing the coronavirus. The guidelines, released on Monday, October 8, and were drafted by the Museum’s director, Georgios Panagopoulos, after the pandemic began in late December.“We are very much aware of the challenges the public, public institutions, and private organizations are facing in managing the coronavirus,” Panagopoulos said in a statement. “For the first time we are proposing to address the management of the coronavirus to reduce the number of cases and the number of deaths. We are proposing to work with partners, including partners in the field of social protection and health, to develop a strategy for managing the coronavirus in Greece.”The guidelines were created by a group of academics and health experts to help manage the coronavirus “in a holistic way, by helping everyone understand the different steps and the different scenarios,” the Art Newspaper reports. The group, which met by telephone on December 7, 14, and 16, and received 27 recommendations from twenty-nine experts", "The next Biennial should take place in 2021 and will be hosted by the museum in partnership with the Tagoori Art Museum in Mumbai. The work of the exhibition’s ten artists will be presented in combination with work by the artist-in-residence, Adrienne Atget, and the exhibition’s director, Harjant Gupta. The exhibition will also feature work by makers such as Rupakat Satyam (Ujjwal and Rupakat), Laxmikant Mehta (Manara Nagar), and Muralistha Pardeep (Uddiyal Nagar).\n\n\nThe Seattle Art Museum has opened a new digital exhibition dedicated to the Seattle Black Metal scene, “Seattle: Black Metal,” which is comprised of work by forty-eight artists and is currently on view until November 21. The show, which was curated by Rebecca Watson, will be inaugurated at the Seattle Art Museum on January 20.“Throughout its history, the Seattle Black Metal scene has been a source of inspiration and inspiration to countless other emerging artists and we’re thrilled to be a part of creating new works,” said Watson. “This exhibition will bring the Seattle Black Metal", "The next Biennial should take place in 2020. The museum will exhibit the work of 20 artists, including an amalgam of Sugihara, Sadao Anashita, Tadao Takemoto, and Kihara, for a total of 60 minutes. The inaugural exhibition was organized by the Edo Period Museum in Kyoto and deployed the works of individual artists such as the works of Kenji, a samurai who practiced in a secluded village near the Kamakura Shrine in Kyoto; Kawamura, a painter from the Edo Period whose work was exhibited at the Museum of Contemporary Art Tokyo; and Karasuno, a Japanese painter whose work was featured in the exhibition “On the Eagle Eye” (2019).One hundred percent of the national budget will be allocated to the development of the exhibition and its exhibition program. In addition, the institution will build a new pavilion dedicated to the art of the Edo Period. The next edition of the exhibition will be held at the Edo Museum of Art, which has been working on the renovation of its building, and will be held in 2020.\n\n\nThe Monuments Men Foundation, a nonprofit organization dedicated to the preservation of the men and women who have made significant contributions to the arts and humanities", "The next Biennial should be held in the autumn of 2020, and the first show in the fall of 2021.\n\n\nThe Institute of Contemporary Arts (ICA) in London and the London-based nonprofit Enterprise Institute for Contemporary Art (EICA) have launched a new initiative to help establish a new, international platform for research and scholarship on the history of art and architecture in the city.The platform, called the Bristol History Centre, will be housed within the city’s newly renovated Royal Festival Hall, and will offer free access to the research community and will focus on the history of art, architecture, design, and design-related works that are currently being exhibited on the platform.The initiative was inspired by a question posed by Daniel Hannan, the former director of Tate Britain, to David Fulford, then director of the Institute of Contemporary Art, in London, as to how future exhibitions and events might incorporate historical artifacts and the historical record. The collaborative project resulted in the creation of a website and an app, which is currently undergoing an overhaul, and will present the first exhibition dedicated to the project in 2020.“I always think about history in the context of a large historic city,” Fulford told Artforum. “We", "The next Biennial should be held in 2021.The exhibition will be hosted at the New Museum in New York and will be co-chaired by the artist-in-residence, the Baltimore-based artist-in-residence, and the artist of the year, Hannah Wilke. The Biennial will also include a number of new commissions, including a new lithographic work, titled “Thinking About the Body,” which will be part of a series by Wilke and the artist, which will be presented at a future exhibition at the Museum of Modern Art. The full list of participating artists is as follows: Beth AllenBrian BeasleyBrian Boswell Brian BuckleyBrian ClarkBrian ColladoBrian DonovanBrian FairsBrian GrahamBrian HeplerBrian JohnstonBrian LynchBrian NelsonBrian OehlerBrian ParrarBrian PowellBrian PooleBrian Shaw, Brian Shaughnessy, and John TangriBrian TrenchardBrian VogelBrian WolfenbargerBibliography ConceptualizationLabels, 2017: Beth Allen, “Thinking About the Body” (New Museum), New York. Cena & company, 2019: Conceptualization Gallery, New York. ", "The next Biennial should be held at the Museo de Cultura de Barcelona, to coincide with the opening of the new exhibition “Touhou: The Eventual Exhibition,” which was organized by the company Tate Modern. The show will include works by ninety-five artists, curated by three curators: Kae Lin, Bernardo Paz, and Alexander Smirnov.\n\n\nThe St. Louis Art Museum (SLM) has confirmed that it will not be able to reopen to the public following the completion of its renovation, due to concerns over the coronavirus. The museum was already expecting to reclaim some of its historic space in the fall of 2020 but has since been forced to postpone the reopening of its permanent collection.The institution announced on August 21 that it was preparing to move the entire program online, but it has since been forced to publicly and privately demonstrate the virtual exhibitions. SLM’s director Meg Hillier said: “We are not ready to move this fall, and will continue to work through the fall. Our long-term vision is to open in 2021, and then work to ensure that the full breadth and depth of our exhibition program will be accessible to visitors in the fall.”", "The next Biennial should take place in the United States in 2020, and the first in 2021.\n\n\nThe Art Newspaper is reporting that the Tate’s board unanimously voted to suspend the collection of the artist Samuel Barber and the collection of the German sculptor Max Hollein.The decision, made after a board meeting on Thursday, March 25, followed a two-day meeting at the Tate’s London outpost. The institute had already issued a formal statement about the changes that occurred at the institution, which is located in a former metal factory in Kensington and is managed by the Tate’s partnership with the private charitable foundation Life Media, and was unaware of the three individuals’ names.The Tate’s board chairman, Hamish Anderson, wrote: “The board is acutely aware of the impact the Tate has on the lives of thousands of people each year through the museum’s programme of exhibitions and education. The board takes seriously all suggestions regarding the collection of Barber, Hollein and Barber’s works, and the board takes these matters seriously. The board discussed these matters with the artist and the museum and the artist was in the process of arranging a presentation for the occasion. The board is acutely aware of the impact that", "The next Biennial should be held in the spring of 2022. \n\n\nThe Metropolitan Museum of Art (the museum) in New York announced today that artist James Turrell has been selected as the winner of the 2020 David K. Abram Award for his work The Eulogy, a series of lectures, performances, and performances delivered by the artist in commemoration of the Metropolitan Museum’s twenty-fifth anniversary. The award, which honors works that commemorate the life, work, and art of David Abram, was established by David and Edith Abram in 2015. “We are incredibly honored to welcome James onto our team,” said Thomas Campbell, director of the Museum. “His extraordinary and compelling performances, his tremendous vision for the Eulogy, and his commitment to the exhibition series are all qualities we have long sought in a visionary and skilled artist.”In honor of the Museum’s twenty-fifth anniversary, the Eulogy will receive a special exhibition of works by twenty-six artists, including Andy Warhol, Jean-Michel Basquiat, Ray Monk, Stephen Schwartz, Joan Soubry, and Thomas Dolgoff. The show will also be inaugurated by an exhibition of his paintings,", "The next Biennial should be in the fall of 2020. \n\n\nThe Philadelphia Museum of Art (PMA) is planning to reintroduce a new, four-dimensional (4D) sculpture by Cuban artist Carlos Ezquerra, whose sepulchral creations evoke both ancient and modern visions of human existence. The work, which was created in his home in the suburb of North Philadelphia in 1928, is called Starry Sky, a simple but profoundly moving sculpture that will sit in the Marcel Duchamp–designed Pavilion of the Sun in the Pavilion of the Moon.“Carlos Ezquerra’s work is deeply rooted in his native land and the American Southwest, and in the vision of an indeterminable future,” said Mark Federman, the director of the museum. “The pavilion of the sun and the pavilion of the moon are both reflections of a world that is already present in the sky, but is inaccessible to the eyes.”The museum added that in order to fully appreciate the achievement of advancing his career as a Cuban artist, Ezquerra has had to leave his native country and move to the United States. He first visited Philadelphia in the early 1940s. When he returned to Cuba in", "The next Biennial should be held in a two-hundred year-old archaeological site, in the town of Manassas, Virginia, in 2020. The exhibition will be organized in conjunction with the biennial’s fifty-third iteration, which will focus on early modernists. The venue will be the archaeological site of the former Confederate base, Fort Hamilton and Hamilton Barracks, in Charleston, South Carolina. Like the city of Charleston, the state of Virginia is rebuilding its roads, bridges, and other infrastructure to better connect the area to the rest of the state. Artforum has reached out to the artists who will be featured in the exhibition.\n\n\nSwiss artist Stefan Platt, best known for his sculptures made from styrofoam and organic materials, including cardboard, polyethylene, and plastic, has died at age eighty-three. In a statement, the Swiss Ministry of Culture said: “Platt is a man of many talents and accomplishments. He is also one of the greatest living artists who has created at the same time a rich and varied career. The Diadem series, his fifteenth exhibition at the Museum Fribourg, Switzerland, is a special instance of his sculptural practice, a monumental and", "The next Biennial should focus on the relationship between art and politics; it should also address the role of art, artworks, and the environment in shaping political processes. And it should focus especially on the issues of bodies and social movements, the body, the body politic, and the body politic. The next edition, which will be held in May 2020, is expected to draw more than five hundred participants from forty-six countries.\n\n\nThe Chinese artist Wang Jie, best known for his sculptures, paintings, and installations that address issues such as gender-based violence, racial discrimination, and climate change, is facing four felony charges and a misdemeanor charge for allegedly letting a Native American Chinese woman work on his paintings.According to the Art Newspaper, the three-month-old investigation into the works that were displayed in a series titled \"Ainu Women’s Sculptures at the Museum of Fine Arts in Beijing, is ongoing. The artist, who lived in the city of Wuhan from 1987 to 2017, was arrested last June after a Tencent Holdings subsidiary, the Cultural Heritage and Tourism Development Office, seized a number of Wang’s works. The office dismissed the charges after a legal battle but then filed charges", "The next Biennial should take place at the Kaomo Museum of Art, Tokyo, in December 2020. The show, titled Art in the City, will feature the work of more than 1,500 artists, including Urana Akunyili, Haléla Zamora, and Nia Z.A. In January 2021, ArtofLife, currently underway in the Guggenheim, will move to the Museum of Modern Art in New York. In the meantime, a new exhibition of work by seventy-four artists will open in the Japanese city of Nagoya on February 22. \n\n\nThe New York City Council unanimously approved a $5 billion budget for the National Endowment for the Arts (NEA) on Wednesday, delivering a boost to the arts and a boost to New York City’s economy as it tries to remain on budget during a projected $75 billion shortfall in funding due to the coronavirus. The budget also encompasses funding for “transformational partnerships between NEA and City,” which also includes affordable housing, workforce development, and workforce centers, and “transformative partnerships between NEA and private foundations,” said Council President Gale A. Brewer", "The next Biennial should be held in 2021, and it will be set in the São Paulo-Alto Ambiente, Brazil, and will be co-sponsored by the Museu da Arte de São Paulo (MASP), the Museu da Autómica de São Paulo (MASP), and the Museu de Arte de São Paulo (MASP).The bid for the exhibition was led by the Museu da Arte de São Paulo (MASP), which recently organized a special exhibition dedicated to the Brazilian anti-imperialist movement. The exhibition “In Defense of the Black,” which was organized as a commemoration of the seventy-fifth anniversary of the South American anti-imperialist movement, was organized in collaboration with the Instituto de Arte Contemporáneo de São Paulo (MASP), the Museu de Arte de São Paulo (MASP), the Museum of Cultures and History (MASP), and the Museu de Arte de São Paulo (MASP).\n\n\nThe man who attempted to blow up the World Trade Center on September 11, 2001, was sentenced to twenty years in prison by a New York City federal jury on", "The next Biennial should be held sometime in the 2020s. \n\nIn the midst of all this upheaval, the Royal Academy of Arts (RA) in London has announced that it is planning to reopen its previously closed gates on September 22, 2020. The move follows the Royal Festival of Art, which will be held at the RA from September 16 to September 19. The Royal College of Art’s board of governors also announced that it intends to reopen in the near future. In a statement, the college said: “Following a thorough review of the future of the RA, we believe that the best way forward for the college is to re-open as soon as possible under the leadership of a new director and new management. We look forward to working with the new team in order to further develop the RA as a vital platform for exhibitions and education in the UK, at a time when the college is keen to be more welcoming and engaging for everyone.”The announcement of the spring 2020 edition of the RA has yet to be made.\n\n\nThe New York artist and educator Krzysztof Kwasniewski, whose exhibition-making and practice centered on mass social movements and international collaboration frequently overlapped with", "The next Biennial should take place in Helsinki, the first in Stockholm, the second in Vienna, and the third in New York. The second iteration will be held at the Central Institute of Art in Stockholm in 2021.The 2021 edition of the conference will receive an additional $3 million from the Swedish State Foundation for International Cooperation (SIFIF), which is organizing the event, and the Swedish Association for Contemporary Art (thewho). The event is currently projected to total $10 million.The 2020 edition of the event, titled “Beyond Art,” was organized by the French artist Bernard Hébert and his wife, Brigitte, who was commissioned to create a new work for the exhibition. The work, titled   Die Neue Gold, will open at the central museum in the city of Cologne in December.The work will be a collection of four works with the name “Kassel” applied to them throughout the exhibition. Curated by the German curator Sigrid Zellweger, the exhibition will focus on “the exterior life of art and the interior life of the artist’s relation to the material world.”Helsinki’s city council has announced that the 2020 edition of the biennial will", "The next Biennial should be held in the spring of 2021.\n\n\nThe Modern Art Museum in New York has appointed the first curator of classical art to its staff. Catherine Kistler, who currently serves as a senior curator at the institution, will be tasked with the development of programs that draw from the research and analysis of the museum’s collections and the collections of the city’s leading contemporary artists - Tad Smith and Mary Boone.Kistler previously worked at the museum for three years as the director of the Samuel Dorsky Center for the Study of the Modern Imagination; as the senior curator of Roman Art; and as the senior curator of twentieth-century art. She also served as an adjunct faculty member in Art History and the Arts at Columbia College in New York.“Catherine will bring a strong conceptual and analytical sensibility to the work of the museum, and stand out as one of the most talented curators America has ever produced,” said Susan Mitchell, head of the Modern Art Museum. “Joining Catherine in her new role is a monumental task. She has the opportunity to use the museum as a laboratory, to experiment with new ways of thinking about art from a curatorial and analytical point of", "The next Biennial should include a special exhibition of art created by a collaborator of mine, the late Moroccan artist Fotopo, and will also include an exhibition of work by non-Moroccan artists. The exhibition will also include a lecture by Fotopo. The development of the show is supported by projects supported by the Biennial Foundation. The Istanbul Biennale, which opens on March 17, will follow suit.\n\n\nThe Los Angeles County Museum of Art (LACMA) confirmed that it will donate twelve works by contemporary artists to the Museum of Contemporary Art in Los Angeles (MCA) in partnership with the Los Angeles–based nonprofit the California Association of Art Museum Directors (CAAM), which is dedicated to supporting the museum’s collection of art from the twentieth and twenty-first centuries. The works, which comprise the sixty-sixth edition of the event, “The Time for Artists” will travel to the museum during the institution’s March 18–March 21 reopening in order to allow the CAAM staff and visitors to experience LACMA’s collection in a new way.“The institution is thrilled that LACMA is partnering with CAAM to present this year�"]