["The next Biennial should take place sometime between April and July 2019. “I want this exhibition to be a landmark in the history of art,” Frederick O. Wilson, President of the Biennial, said in a statement. “It is an enormous step forward in demonstrating to the world that architecture design is a human construct, that it is a process, and that it may be the architecture of the future.”\n\n\nThe Royal Academy of Arts (RA) has been asked to build a new home for the Royal Academy of Arts (RA) in London. The institution recently announced it was planning to move to a new boarding facility that would result in a new exhibition space and a new venue for the Royal Academy of Arts.The move is part of a decades-long strategy to expand the scope of the Royal Academy of Arts, which has been beset by financial troubles and has had to postpone numerous major events due to Covid-19. The institution’s new home will sit in the capital’s East End and will be designed by UK firm Rintoul.“The boarding facility will give the RA the opportunity to present a range of exciting new projects in the form of a triennial exhibition, a", "The next Biennial should be held at least once every two years. The design of the biennial is not yet known, but the theme will obviously be “space and time.” The first exhibition was held at the Art Institute of Chicago in 2016. The 2019 theme is “My Life and Work: From the German-American Solidarities” The next Biennial will be held at the Art Institute of Chicago in 2021.\n\n\nThe Museum of Fine Arts (MFA) in Boston has received a gift of one of the finest works of twentieth-century American art from Texas-based artist Scott Schubert. The gift, which also includes a book by the artist’s son, Bruce Schubert, a biography of the artist as well as an original lithograph, is currently on display in “Bruce Schubert: Layers” at the museum. The exhibition will debut the work of Kenneth Reid, a contemporary art historian who is currently a professor at the University of Texas at Arlington.Born in Austin in 1951, Schubert grew up in the city of his father’s birth and attended the University of Texas at Austin (UTA). In the 1980s, he relocated to Houston,", "The next Biennial should evaluate the power of the digital ecosystem to affect our daily lives, and the core mission of the exhibition should be to create a dialogue between the artists and the public about the future of art. ”Kim adds that the Biennial will continue to adopt the \"fundamental principles\" of the exhibition model and will continue to be a platform for artists with its annual event. It will now be called the Biennial and will be held at the LA County Museum of Art. The inaugural event, “The Body,” was staged at the civic institution in 2010. The twelve-thousand-work exhibition was organized by photographer and thinker Agustín Alarcon and includes “Sergei Gammak” (2018), “Deana Lawson” (2016), and “Chloe Gay” (2016).\n\n\nTwo generations of New York City’s art dealers are suing the city over the closure of their New York galleries in an attempt to prevent the reopening of the venerable Woolworth’s department store. The lawsuit, filed on Monday in the Northern District of New York, claims the city made disparaging remarks about the space, told prospective gallery tenants", "The next Biennial should be the second in Istanbul, to be held in 2020.\n\n\nThe Museum of Modern Art (MoMA) in New York has announced that it will build a new facility dedicated to the study and exhibition of European design, with a focus on its visual art, in an effort to increase the museum’s exposure to the works of Swiss-born architect Alexander McQueen. The current exhibition space, titled “Laundromat,” is currently on display in the museum’s exhibition space, the ___. The new venue will be made up of a new exhibition space, a larger public courtyard, and a collection of objects from McQueen’s studio. The €140 million institution will also feature new archival materials and exhibitions.“The development of MoMA’s collection of art is at the heart of a lot of the museum’s mission,” said museum director James Goldie. “We have long been inspired by the architecture of McQueen’s work, and by the museum’s own history as a center of art and design. I am thrilled that this new partnership will give MoMA and the collection a new opportunity to think about and present our collections through", "The next Biennial should be in 2022. The next Art Biennial should be in 2022. The upcoming Art In/Art Out Art Presidencies will be in 2022. The next Art Fairs will be in 2022. The Art Fund will revise its Biennial program in 2021. The Art Institute of Chicago is planning to open a new $500,000 biennial in 2021. The Art Institute of Chicago’s new museum format will be announced in 2020. The Art Institute of Chicago’s new exhibitions and residencies will be announced in 2020. The Art Institute of Chicago’s new gallery will be announced in 2020. The Art Institute of Chicago’s new garden will be announced in 2020. The Art Institute of Chicago’s new classrooms will be announced in 2020. The Art Institute of Chicago’s new launch pad will be announced in 2020. The Art Institute of Chicago’s new campus will be announced in 2020. The Art Institute of Chicago’s new campus will be announced in 2020. The Art Institute of Chicago’s new center will be announced in 2020. The Art Institute of Chicago’s new building will be announced", "The next Biennial should focus on “the relationship between the city and the University of British Columbia’s collection,” said city councillor Kerry Jang. “It would be really interesting to see the Biennial’s exhibition at the Vancouver Art Gallery.”\n\nThe Vancouver Art Gallery (VAG) has received a gift of seventeen works by London artist Emily Jane Black, who died in 1964 at the age of forty-nine, in the form of an anonymous gift of fifty-two works by the artist for the museum’s permanent collection, which comprises works dating back to the 1917 collection launch. During its construction in 1969, the museum acquired many of Black’s early works, which are housed in the permanent collection’s vault.Commenting on the gift, VAG director Paula Scher said: “By carefully preserving nearly everything in the permanent collection, including the particular artworks, the display of the works is a great achievement for our collection, and for the city of Vancouver. We are thrilled to share the gift with the world and to the extent we have been able, the works will travel to the Institute of Contemporary Arts in London and be presented in the permanent exhibition ‘Exhibition: ", "The next Biennial should be held in 2021. In a letter dated August 3, the European Communities said that they were working together to shape a biennial that reflects \"the current moment as it really is, recognizing the necessity of an international body for the promotion of research and the achievement of common objectives in a pluralized world.” The group of twenty-seven nations represented in the exhibition will be chosen by a committee comprising Hannah Stancook, director of the British Council; Christa Armstrong, director of the School of Oriental and Islamic Art, London; and Haus der Kunst, Berlin; and will be presented by the biennial’s organizers, Berlin’s Kölnischer Kunstverein, in October.\n\n\nThe British Museum (BMI) in London has received a gift of two hundred rare works by the Dutch master Max Beck, who went by the name Becket, who was a major influence on the modernist movement in the Netherlands. The donation was made in honor of the institution’s inaugural Beck Collection Year, which celebrates the legacy of the museum’s namesake, who was a prolific artist whose work spans from the late 1960s to the 1980s.Born in the Netherlands in 1944,", "The next Biennial should be in 2021 and the biennial should be a continuous series of artworks that addresses the diversity of experiences and perspectives that biennials represent. For the first show, we will present a combination of original and contemporary artists. The show will take place in the first floor of the Düsseldorf museum district, which is currently undergoing a major renovation. It will also be organized in a period of between two and three years, and will take place in the Düsseldorf Bund, Düsseldorf-Stiftung, and Düsseldorf-City.The exhibition will feature works that address topics such as identity, history, and migration. Featured artists include Eduardo Paolozzi (Italy), Elin Räsänen (Finland), Katja Paunova (Russia), and Marco Mirelli (Italy).The full list of participating artists is as follows:Artsakh (Ukraine)Baku Art Museum (Turkey)Berlin Art Museum (Germany)Berlin Gallery Bild (Germany)The Black Forest (Argentina)Birmingham Art Museum (England)Bourje-Belgium (UK)The Black Forest (Austria)Art in Scandinav", "The next Biennial should be held in 2020. \n\nThe International Council of Museums (ICOM) in Paris has released a statement regarding the recent killing of three people in the French capital: “The organization is aware of the indications that suggest a political motivation behind the events of the last few months. However, at the same time the organization will not allow itself to be distracted by any emotions, or by the danger of emotional reactions on the part of our staff and the general public.”The Council of Europe’s cultural guide, Marcin Wojtas, has likewise condemned the attacks: “I mean to say that this was a tragedy triggered by a political crisis, and that the French authorities are working to confirm whether this was an act of terrorism or not,” he said. The attacks are believed to have been carried out by two groups: the Islamic State in Iraq and Greater Syria (ISIS) and a group called the Army des Front de la Jeunesse (Front de la Jeunesse), which is also known as the Army of Democracy.The offending texts, which were posted on social media websites, include: \"All of us are now mourning the loss of a friend and", "The next Biennial should be held in 2021.\n\n\nThe ninth edition of the Frieze London Biennial, “Frieze London: The Future Is Present” (TBC), curated by Martin Creed, will open on Saturday, February 4, 2021 and run until March 3, 2021. The event will run until March 5, 2021 and will be staged at Tate Britain until March 5, 2021. “This year’s event marks an exciting chapter in our history, with the first ever online viewing of a full-length work by a female artist,” said Martin Creed. The exhibition is curated by Stephanie Ahearn, director of Frieze London, and is supported by a grant from the Tate.\n\n\nThe Pérez Art Museum Miami (PAMM) has received a gift of one of the works featured in its forthcoming season, which will open on March 17 and will run through April 13, 2022. The donation is one of the works, a six-thousand-piece work that shows a group of artists’ mediums, including Carolee Schneemann, Richard Diebenkorn, and Ed Moses, in a three-dimensional work that reveals the work’s future as", "The next Biennial should be held in 2022. The Art Rejects Association (BAA), which will lead the exhibition, said that it hopes the project will inspire “emotion, curiosity, and wonder.” The 2019 show, entitled “Belongs In”\u0097a collaboration between artist and curator Adam D. Weinberg\u0097was canceled after a gunman opened fire in a movie theater in Colorado on December 4, 2015. The exhibition, titled “The Body in Cinema,” was to have taken place in New York City and San Francisco.The 2019 show features work by thirty-seven artists, including Amylai Nesvog and Irena Haiduk, and will run at the Art Institute of Chicago (AI), which recently underwent a $100 million renovation and is undergoing a $50 million expansion; the Art Gallery of Ontario (AGCO); the Art Museum of Chicago; and the Art Museum of Chicago, which will present the exhibition “Belongs In: Art and the Body in Cinema” in 2021.\n\n\nThe Metropolitan Museum of Art and the Greenberg Museum of Art in New York have agreed to jointly produce a new series of works by Maya Lin, which will include works set in", "The next Biennial should be held at the Institut Nationale de l'Art et de l'Architecture in Paris in 2021, followed by an exhibition in the Louvre in 2022. It will also be organized in conjunction with the Biennale de Lyon in 2020 and the Metropolitan Museum of Art in 2021.\n\n\nThe National Museum of Fine Arts (NMFA) in Cincinnati has appointed Laura Iannone as its next director. Iannone comes to the institution from the Museum of Fine Arts in Houston, where she has served as interim director since March 2019. While she has been critical of the museum’s management, she has not publicly criticized the institution’s relationship with activist donors, and she has defended its relationship with Sara and Ira D. Wallach, who donated $10 million to the museum in 2017 and 2018, respectively.During her tenure at the museum, Iannone oversaw a number of significant exhibitions, including “The Sedition and Modernity of Sidney and Lois” (2019); “Alberto Burri: The Vases” (2017); “The Life and Death of Pablo” (2017); and “Temple of the Unknown: Art from", "The next Biennial should take place in the seaport city of Yokohama, where it will crowdfund and explore the connections between art and architecture. Guest judges include Takashi Nakamura, Nick Clegg, and Chris Marlow. \n\n\nThe New York City Department of Cultural Affairs (DCLA) has announced that it will begin issuing licenses to non-profit organizations seeking to host exhibitions in the city. Currently, the museum community is limited to institutions licensed to hold public events such as concerts and other public events. Under the new guidelines, licensed organizations will be able to present exhibitions in their buildings and are allowed to display an unlimited number of works.Organized by municipality, the guidelines outline four criteria—principles of the exhibition, whether it be a single work or a group show, the number of participants, and the type of display. The first two criteria—principles of art and architecture and architecture and design—are already standard operating procedure for NYCMO and the DCLA; the final two—whether the work is contemporary or from the previous year—are optional. The guidelines also outline how to apply for permits. The DCLA will issue 12-month permits to nonprofit organizations that demonstrate a substantial financial need to exhibit works", "The next Biennial should also have an endowment of $50 million.\n\n\nThe Amsterdam Biennale organizers say they are working with the Dutch Ministry of Foreign Affairs (MFA) and the Dutch Ministry of Culture to promote the theme of the 2020 edition, which will take place in February. Titled “Paris: the city of light,” the exhibition will bring together artists from thirty-six countries. The opening of the exhibition will be marked by an exhibition of work by eighteen artists.The full list of participating artists is as follows:\n\n\nNew York’s Metropolitan Museum of Art (MoMA) is preparing to open its new $450 million Henry Luce–designed building in the city next month. The museum will serve as the home for the Metropolitan Museum of Art’s yearly Henry Luce exhibition, which will run from February 21 to February 28, 2020. The Henry Luce Foundation will support the museum with a $500,000 grant.The Henry Luce Foundation is an independent organization that supports artists and nonprofit museums in the United States. The grant comes in the wake of a $1 million grant made by the Rockefeller Brothers Fund in 2018. The grant will allow MoMA to develop a new program that will engage with", "The next Biennial should bring together experts, from academia, government, and non-profit organizations, to develop and present an innovative and accessible work by William Bechette, a curator, curator, writer, and curator. He will present a selection of his works at the exhibition in 2021.\n\n\nThe Palace Museum in Riyadh and the Royal Institute of Contemporary Arts (RICA) in London have announced the signing of an agreement that will open up a new chapter in the Royal Institute of British Architects (RIBA).  The partnership between the two institutions was first announced in April 2019 and will involve the public and private sector in creating new works by young artists and will be led by the RIBA-King Abdullah bin Zayed, the former director of the Abu Dhabi Institute of Art and Architecture, and his team.The association’s first project will be the reopening of the National Gallery in London—currently closed since March due to the Covid-19 pandemic—and will examine the role of art in inspiring action. Last year, the RIBA-King Abdullah bin Zayed and his team collaborated on the opening of the National Gallery of Art and the Royal Opera House in London. The partnership between the two institutions was also featured in the 2018", "The next Biennial should be organized in the spring of 2021, with its inaugural exhibition being “The Environment.”  \n\nArt Basel Hong Kong has announced that it plans to phase out its six-month residency program in the city, which has been plagued by technical difficulties since March, and return the residency to Hong Kong. “We are currently working through a process that will take some time to implement, but I believe we will be able to resolve the issues that have been affecting our galleries and galleries staff in the near future,” said Ann-René Groulx, the fair’s Hong Kong director. “The program is now back to full strength and we are encouraging other galleries in Hong Kong to launch their own online programs.”Rather than focusing on a particular location, the nine-day residency program has focused on creating an environment where artists and designers can work across continents and oceans. The residency began in September 2019 and runs through December the following year. The program was established as part of a partnership between the fair and the Hong Kong–based nonprofit Art Exchange, which also owns the intellectual property rights to various Creative Commons-licensed works, including those licensed to Tate Modern, the", "The next Biennial should be held in 2020 and will be led by a new director and curator, Yang Mi, who will be heavily involved in the exhibition. The new platform will be housed in the same building as the museum and will be designed by Mariner Goodman and will draw from the same collections and features. According to The Art Newspaper, the venue will be inaugurated by a three-dimensional drawing by the artist Agnès Nin. The biennial will be hosted exclusively by the museum in order to maximize the museum’s international reach. The next exhibition, “The Last Sperm,” will be staged in the museum in 2021 and will be curated by Igor and Olga Kargin, who will co-organize with Riccardo Cipolletta. \n\n\nThe Kaufmann Museum of Contemporary Art (KMCA) in Zurich, which was the birthplace of American painter and designer Frank Lloyd Wright, has welcomed two new members to its board of trustees: biographer and artist James Turrell and architect Mary M. Jennings. The museum has also appointed Kathrin Kremer, vice chancellor at the University of Duisburg-Essen,", "The next Biennial should take place in 2020 and the first in 2021. The center’s staff will be paid through the efforts of the Swedish Foundation for Contemporary Arts (Foundation), whose board of directors unanimously accepted the proposal on October 10.\n\n\nThe Merion Gallery in New York is planning to open a new office in London in 2021. The new space will be called the Merion Science Center and will be located in the city’s Mayfair district. The center will be led by science curator and art historian Mary Berry.“The Science Center is a collaborative project between Mary Berry and the great Robert Smith, who was a mentor, an inspiration, and a friend, so I’m delighted to be a part of its journey,” said Berry. “He was a master at what he called symbiosis, a process of cooperation between artists and scientists that I’m committed to continuing.”According to the New York Times, the center is concerned with the construction and conservation of the complex’s research library, which will host the research of more than 7,000 objects while allowing visitors to the museum to study and interact with them. The future of the exhibits is currently unknown.\n\n\nThe National", "The next Biennial should take place in the city in 2020.  The Beijing Cycle Biennial will not be held in 2020, but will be held in 2021. The Beijing Art Biennial will not be held in 2021, but will be held in 2022. The Beijing Art Triennial will be held in 2022 and will include the works of twenty-three artists. The Beijing Art Museum will not be held in 2022. The Beijing Art Museum and the Beijing Art Museum and the Beijing Art Museum and the Beijing Art Museum and the Beijing Art Museum and the Beijing Art Museum and the Beijing Art Museum and the Beijing Art Museum and the Beijing Art Museum and the Beijing Art Museum and the Beijing Art Museum and the Beijing Art Museum and the Beijing Art Museum and the Beijing Art Museum and the Beijing Art Museum and the Beijing Art Museum and the Beijing Art Museum and the Beijing Art Museum and the Beijing Art Museum and the Beijing Art Museum and the Beijing Art Museum and the Beijing Art Museum and the Beijing Art Museum and the Beijing Art Museum and the Beijing Art Museum and the Beijing Art Museum and the Beijing Art Museum and the Beijing Art Museum and the Beijing Art Museum and the Beijing Art Museum and the Beijing Art Museum and the Beijing Art Museum and the Beijing Art Museum and", "The next Biennial should be curated by a group of experts from the African continent, led by Nigeria-born curator Dariush Rummel. This may be the only opportunity for the curators to see the works in person, as the rest of the world is barred from the exhibition.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles plans to move the final work by the Danish artist Susanne Vielmetter and the first work by this decade-old duo to its new home in the city. The move, which has been in the works for months, was revealed during a presentation of the two works, which were created in collaboration with French designer Remi Trintignant, at the South by Southwest (SXSW) in Austin, Texas, on Tuesday.The move follows a renewed effort to become more inclusive in the museum’s programming, which has been beset by unwavering resistance from conservators and museum heads, including Mike Kelley, who has publicly questioned the museum’s decision to move the works. Vielmetter’s new series “Anxious Emotions” (2019) opens with a character watching television in a secluded room while seated in front", "The next Biennial should celebrate the achievements and influence of the past five years through a series of exhibitions, residencies, and curatorial projects. Next year I am planning to launch a new platform and a new project, and I feel that the new opportunities presented by the Biennial will help us to further evolve, further explore the possibilities of art.”She added: “This was a difficult decision for me, but I made it because it was the right one for the ever-changing world we live in. The new biennial will act as a springboard for new questions, new ambitions, and new possibilities. I am looking forward to seeing how the MAM Museum transforms into a new kind of biennial, one that will be driven by a deep, systematic understanding of art history and culture as a means of perusing art and culture from a different point of view.”The biennial was established in 2007 by Bénédicte de Montagnes and Françoise Salzmann to commemorate the twenty-fifth anniversary of their opening. It was inaugurated by a group exhibition, “Catherine and Julie,” which opened in Paris in May 2008, and was followed by “Bouvre: 8 ansi", "The next Biennial should be held in the spring of 2021.”Autumn will be selected from a shortlist of twenty-four artists\u0097including Simone Leigh, Hayley Tsuo, Léa Turton, and Jera Grant Spears.\n\n\nThe British Museum in Beijing has received a gift from China’s ruling Communist Party, which promptly announced that it plans to build a monument to Mao Zedong, the founder of the Communist Party and the party’s first leader. According to the New York Times, the Monument to Mao, inaugurated by British Prime Minister Boris Johnson in Beijing on November 5, will be dedicated to the founder of the People’s Republic of China. The site of the monument, a former government museum in the capital of the People’s Republic of China, will be named after the late socialist leader.The £55,000 monument, which will sit in the capital’s Tiananmen Square, will honor the legacy of the Communist party and the party’s founder, Mao Zedong. Following a years-long campaign, the British Museum agreed to donate more than six hundred artifacts from the Cultural Revolution, which preceded the Cultural Revolution and was also known as the Cultural Terrorist Period", "The next Biennial should be held at the same venue, in the same location, and in the same year, not the same year but next year.  “I’m not saying different years, I just think we should be able to move forward,” Barton told the Art Newspaper. “It’s the same concept, but it should be a biennial of all the points of view.” National Gallery director Ravi Shankar is also opposed to the new format. “It appeals to a certain kind of nostalgia,” he said. “There’s something about a collection of small works that’s always sitting on the shelf next to the great classics. . . . I don’t think it will advance the field very much.”Shankar said that he hopes the new exhibition will be “a celebration of what the future holds,” a reference to the theme of the biennial, “Future Present,” as well as the exhibition “Theater of Operations” (2018). The show will also feature “Theater of Imperfections: A Contemporary Study of the Politics of Violence,” a show on the", "The next Biennial should be held at the Museum of Modern Art in New York next spring, and this year’s will be held in late June. “We are acutely aware of the challenges that beset the exhibition space in the 2017–18 biennial, and in an effort to avoid paralyzing the exhibition with cumulative programming that would not be able to provide the full impact of the installation, we have undertaken a number of measures to try to mitigate the impacts of the coronavirus in the exhibition space,” the biennial said in a statement. The change in dates also coincides with the opening of the biennial’s new exhibition, “An Open Letter from a Family,” which will run concurrently with the biennial and will introduce the biennial’s new exhibition, “The Crown,” as well as a new collection of rare paintings by the late Japanese artist Aoki Takeda. The exhibition will be held at the Shiodakan Museum of Art in Nagoya, and will expand on the themes of the previous two events. \n\n\nThe Saudi Arabian government is planning to spend $9 billion to repair and maintain its iconic Grand Mosque in Mecca, which has been the site of", "The next Biennial should take place in the Spring of 2020, to coincide with the theme of the year, “Immigration and the Politics of Emigration,” and will aim to integrate contemporary art from a variety of sources, including Palestinian art, African art, and the contemporary art of Latin America.The ceremony featured the artist-led installation of new works by different artists in collaboration with international curators, including Nadim and Paul Mpagi Sepuya and Vito Lazzaris, as well as the exhibition of work by the Nairobi–based collective the Black Rainbow Collective. The group’s first show will be “Nirvana,” a work by the Sudanese artist Almine Rech; a new edition of the group’s “Forbidden City” exhibition, which will be staged at the Abu Dhabi Museum, will be held at the Abu Dhabi Gallery of Fine Arts. The exhibition will also include a new trip, designed by the artist-tour guide Susanne Vielmetter, to the remote Alserkal village in the Russian Far East, the birthplace of the artist Alex Katz, and the adjacent village of Alserkal-Zhukovsky.Inaugur", "The next Biennial should be held in 2020.\n\n\nThe German government is preparing to establish an emergency fund for art museums in the country that has the power to offset losses from the coronavirus. The sum is nearly $30 billion, or 6 percent of Germany’s gross domestic product, and would be distributed over ten years. \n\nThe plan, which has the support of Chancellor Merkel and her Bavarian allies, involves redirecting $6.2 billion from the state’s general fund into art funds. Chancellor Angela Merkel said the fund would be a “compromise between the federal and the state level.” “The federal government doesn’t have the funds, and the state government doesn’t have the money, to organize a large-scale, long-term exhibition. Art museums are an extraordinary financial resource for Germany,” she said.  The plan is part of a package of measures designed to mitigate the global health crisis and achieve financial stability for the German government. The government also extended unemployment benefits and increased social security benefits; increased benefits for employees of private companies; and cut the public payroll.   The state of Berlin, which accounted for 69 percent of the country’s", "The next Biennial should be held on June 22, 2020; the 2021 edition will be held May 5–May 9, 2021.\n\n\nThe Smithsonian American Art Museum in Washington, DC, has received $9 million from the Andrew W. Mellon Foundation in support of the formation of the Emily Post Memorial Scholarship Fund. The fund is a collaboration between the foundation and the Smithsonian American Art Museum. The Emily Post Memorial Scholarship Fund was established in 2017 to empower and provide financial assistance to current and former Marshall College students as well as to assist families in their transition to postsecondary education. The fund is available to institutional undergraduate students and recent graduate students only. Applicants must be residing in the District of Columbia and must demonstrate financial need.The Emily Post Memorial Scholarship Fund is a debt-relocation service that is available to institutional undergraduate students only. The scholarship fund is available only to institutional undergraduate students. The scholarship fund is available to students at Marshall College, the College of William & Mary, the College of the Holy Cross, and the College of the Holy Cross-Samford University. Among the institutions that will receive funds are the College of William & Mary, the College", "The next Biennial should take place in 2020 and will focus on the history of the region\u0097and on the powers that be. Liu Duyrong, director of the Beijing Art Museum, said: “We must play our part as local experts and as future leaders in making Beijing Art Museum a truly international city. We have many projects in place to facilitate the exchange of works and ideas between China and the region. ‘After the Biennial,” he added, “we can continue to realize the fortunes of China Art Museum and enhance the brand image of Beijing Art Museum.”\n\n\nThe French Ministry of Culture and the Museum of Fine Arts (MoCA) in Paris announced today that French painter and sculptor Emmanuel Gherard, a key member of the Institut de l'Art et l'Orient (I.A.O.) of the artist-community, has won the 2020 Editions du Monde. Gherard’s first museum retrospective was presented at the museum in 2009. The International Association of Architects (I.A.O.), which has participated in the Paris Art Week since 2002, commissioned him for its 25th edition in 2014. Since its inception, the", "The next Biennial should take place at the Santa Barbara Museum of Art, and it should include a new exhibition of work by the late artist Terence Blume, and a public memorial service that will inaugurate a new biennial at the San Francisco Museum of Art. The new venue will also host a series of public events and performances, including a meeting with the Board of Trustees of the San Francisco Museum of Art and a presentation of a new documentary film at the invitation of the David-and-Goliath actor Robert Redford. The current biennial will be expanded with a $5 million donation from the estate of Robert Moses. The biennial will also include the first exhibition dedicated to the life and work of Cuban artist Andrés Manuel Gómez, who was a major influence on the current generation of Cubans, and will include the exhibition “The Untold Story,” which will feature work by forty artists. The fifty-three-acre venue will be located in the Pacific Palisades, an ethnically diverse district of the city, and will be inaugurated by a public ceremony that will take place on Friday, February 18. The new biennial will be inaugurated by a presentation of a new work by", "The next Biennial should take place in 2021, and the 2019 edition will return in 2021. The 2020 event will be on the same date and will be led by the same curators\u0097Olu Zaki, Minna Bazal, and Rebecca Soltan.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Thomas J. Price as its new deputy director for visual art. Price comes to the institution from the Museum of Contemporary Art (MCA) in New York, where he has served as associate curator of modern and contemporary art for the last fifteen years. Under his leadership, MoCA’s collections have experienced a number of major upgrades, including the construction of several new galleries and a new exhibition space that opened in 2017.“The past twenty years have been a brilliant and challenging journey, and I’m very excited to join the MoCA team as they continue to expand and reimagine the museum’s mission,” Price said. “I’m looking forward to working in the unique environment of a museum in the heart of Los Angeles, and to building on the museum’s long-standing tradition of experimentation and experimentation.”\n\n\nThe Art Newspaper has released a", "The next Biennial should be held in 2020.”\n\n\nThe Museum of Fine Arts (MFA) in Boston has received a gift of twenty-four works of art from the Lower East Side, New York, in recognition of its contributions to the arts and culture of the city. The gift includes works by artists such as Elizabeth A.M. Barlow, Thomas K. Hirschhorn, and Lillian Gish, as well as a selection of works by the late Whitney Houston.“The museum is very much in touch with the life and work of artists,” said museum director Camille Bregman. “These eight works are among the best-known to the public, and they represent a remarkable array of work in the history of the institution. The museum is proud to present them to the public for the first time in the artist’s lifetime, and to present them again in the form of an exhibition of works that will reflect the greatest achievements of Whitney’s entire collection.”Last month, the institution announced that it would mark the fifteenth anniversary of its opening with a special exhibition of works by the artist Shelly Barlow, as well as the forty-fifth anniversary of the former Whitney staffer�", "The next Biennial should take place in the spring of 2021, with the debut exhibition taking place in the autumn.\n\n\nAs the number of the sick with Ebola continues to rise in West Africa, the Museum of Contemporary Art (MoCA), Boston, has launched an emergency fund for artists suffering financially as a result of the virus. The fund will provide assistance to all artists, regardless of financial need, and will prioritize those who are working in remote, rural, and low-income settings.“Our emergency fund will provide immediate assistance to artists who are struggling financially due to the recent epidemic,” said museum director Matthew Teitelbaum, who added that the fund will also provide support for the next six months, when MoCA will reopen in the summer of 2021. The fund will provide assistance to artists for up to three months following the end of the coronavirus pandemic. “When the arts are central to social healing and our economy is struggling to address the challenges posed by climate change, we need their immediate financial support,” Jeff Rosen, chair of the board of trustees of the artist fund, said. “The fund’s innovative, community-led design and programs will help us address the immediate needs of local artists", "The next Biennial should be held in 2021, the year of Biennial 7. The official selection of the exhibition will be announced by the institution in the coming weeks. The opening of the exhibition, which will be organized as part of the boundaries of the Museum of Modern Art and the Metropolitan Museum of Art, will be marked by a keynote address by Yoshitomo Tazuna, the director of the Japanese art museum Yamada.\n\n\nThe Italian government approved the construction of a new monument commemorating the thousands of victims of the terrorist attacks in Rome in 2017, but the project was swiftly blocked by the country’s conservative government, led by prime minister Matteo Renzi, who declared that he wanted to move the monument before his term expired in 2021.The controversial plan, which involves painting over the names of the twenty-four terrorist attacks, including the terrorist attacks on the Palazzo Cavalieri, the former Prada headquarters, in Venice, and the terrorist attacks on Jewish Museum in Rome, was blocked by a coalition of regional parties, including the center-left Democratic Party, the center-right People party, and the independent People Democratic Party (PD), on Monday, the December 11, Art Newspaper reports.The reopening of", "The next Biennial should take place in 2021 and the show will return to New York in 2022. The twenty-fifth edition will also be on view in the United Kingdom in 2022. The biennial’s curator, Jean-Michel Roy, will serve as the theme of the seventh edition.The festival will also be celebrated with a new exhibition, “Art & Culture: From the Biennial to Now,” curated by artist and curator John Akomfrah, at the Museum of Modern Art between January 3 and January 22. The show will include a retrospective of the last two years of the biennial, “Avant Garde,” and will debut at the Centre Pompidou in Paris on January 28. The show will also be inaugurated by an exhibition of work by the Center’s curators, Terri-Anne and Jean-Pierre Lévy-DuMonde, at the Museum of Modern Art in London next month.\n\n\nThe Museum of the African Diaspora (MoAD) in Minneapolis has appointed Joseph Allen as its next director. Allen comes to the institution from the Minneapolis Art Museum (MAM), where he has served as director since 2014. During his tenure at MAM,", "The next Biennial should be held in 2022, and the first in 2019. The slot will be curated by the Danish curator Till Lindemann. The show will be organized in three stages: a retrospective, a symposium, and an international exhibition, which will run concurrently. The first stage will include a combination of lectures, talks, and demonstrations. The second stage will focus on the exhibition and the contributions of the artist. The third stage will be a special project, which will be curated by the artist Amandla Svendsen. The artist will be asked to integrate Sanchize and the Alameda into the biennial. The event will be held at the city’s historic Grafton Town Hall, which is currently being restored. It will run from November 24 to January 5, 2022. The Biennial will be held in the same location as the Alameda, which debuted in 1962 and has since evolved into the city’s cultural hub. It will also receive new elevators, and will be fully wheelchair accessible. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that Pablo Picasso has been selected as the keynote speaker at its upcoming event, “P", "The next Biennial should be held in the spring of 2022.The decision to move the exhibition series has been made in accordance with the initiative “Taking the Fifth: The Death of Art,” which was initiated by the Museum of Modern Art, New York, in January 2018. The first iteration of the show, “The Death of Art: The Art of Art” was held in December 2019. \n\n\nA group of artists and collectors are suing the City of Los Angeles over its decision to remove a landmark 1940s-era building from the National Register of Historic Places in January. They are arguing that the building, which was part of an exhibition space and a music venue that was located in a former auto body shop in the industrial district of Downtown Los Angeles, was damaged by an earthquake that struck on January 5, 2020.According to the Art Newspaper, the case involves a group of artists who claim that a building code change filed by the city of Los Angeles in December 2019 erred in declaring the structure unfit for human habitation, and that the city is attempting to justify its decision by citing an accident that took place in the area\u0097the museum is currently undergoing a $125 million expansion\u0097as a reason to keep the building on", "The next Biennial should have the capacity to present a new series of sculptural works on the central stage and to reflect on the themes of the series. The exhibition “is still open,” according to Jean-Luc Ponty, director of the Biennale de Saint-Denis. “We hope that the time will come when our biennial will be able to present a work from the series in a new way.”\n\n\nThe Smithsonian’s American Art Museum (SAAM) in Washington, DC, has launched a new initiative called “Making Places,” which will invite local, state, and national artists to collaborate to create new experiences in its collections. The first phase of the project, “Making Places,” will tackle themes such as the history and future of cities, how places shape cultural and social life, and how artists can use places to create new kinds of public experiences. The second phase, “Making Places,” will address issues such as water and energy, climate change, land use, and land restitution.The partnership between the institution and the artist-run nonprofit Art Impactuors (AIP) is an extension of the Smithsonian’s commitment to promoting and", "The next Biennial should take place in 2020. \"A large-scale exhibition of the artist’s work from the 1970s’s is currently on view at the Metropolitan Museum of Art in New York, so we will have a chance to see it again in 2021,” Arnold told Artnet News. The full list of invited artists is as follows: Peter Bogdanovich, Lithuania\n\nKate Bush, United Kingdom\n\nBrian Carlos, Nigeria\n\nJean-Michel Basquiat, France\n\nMing Dang, China\n\nTina Foa, Philippines\n\nJoel Andresen, Mexico\n\nMarc-Olivier Cottet, France\n\nAnnie Flanagan, United States\n\nMarianne Gall, United States\n\nMumford & Sons, United Kingdom\n\nAnnie Flanagan, Mexico\n\nAnne-Marie Goldstein, United States\n\nAnnie Flanagan, Mexico\n\nJosé Luis Fresnoli, Mexico\n\nAnnie Flanagan, Mexico\n\nNikolay Gusev, Russia\n\nAnnie Flanagan, Mexico\n\nErnesto López Rivera, Mexico\n\nJosé Marco Fontana, Mexico\n", "The next Biennial should be held in 2020. The museum will then re-enter the public domain, and the sculpture will be returned to the artist. From August 2021 onwards, the artist will have the right to publish his work in the collection of a museum. The artist will also be given the opportunity to exhibit the work in a museum.For the public who purchased the work from the artist, the museum will be reimbursed the cost of the installation, installation, and cleaning, as well as the cost for the transportation of the work and the exhibition itself.\n\n\nThe three-day exhibition “Art After Death” at the Museum of Fine Arts (MFA) in Boston will now take place in 2021. The seventy-third edition of the exhibition, coinciding with Art Basel in Hamburg, will run from March 21–March 28. The show will return to New York City in 2021, and will commemorate the opening of the museum’s new building, the Museum of Modern Art (MoMA), with a special exhibition of works by the artist and the artist’s son, Andrew, who died in 2015.“Since the 1960s, Andrew and I have been making new art together, setting the course for our", "The next Biennial should focus on how the work of artists in the digital realm impacts on our own lives and the lives of our communities. If Art is Life, and Life is Art, then this work is central to how our lives and the world will change for the better. If Art is Life, then this work is central to how our lives and the world will change for the better. 1/24/17: If Art is Life, NIRIN: The New Art Institute, New York, New York. This exhibition is the first of a new project, If Art is Life, that will consist of a series of solo exhibitions, each curated by an artist, in collaboration with a specific institution, such as the Museum of Modern Art, Boston, to celebrate the installation of a work by Maya Lin, a Chinese artist who recently won the Prix d’Art Contemporain, in Paris. The work, a series of glass boxes, will be on view through February 21. If Art is Life, the show will be held in collaboration with the National Museum of China in Beijing. With its first exhibition of work by Chinese artist Ai Weiwei in Beijing in 1932, the National Museum of China is the most", "The next Biennial should take place in the autumn of 2021 and will continue to use the biennial’s galleries, venues, and special projects until the end of its lifecycle.The biennial will continue to employ the editorial team of the biennial to reflect the themes of the biennial, and will host exhibitions, residencies, and other programming. The biennial will continue to maintain an active online presence, and the biennial will also continue to receive funding from the Biennial Fund.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Amada Cruz as its new curator of photography. Cruz joins the institution from the Los Angeles County Museum of Art (LACMA), where she has served as the curator of photography since 2014. Her curatorial projects include “Oddity and Beauty: An American Camera,” which opened at the Los Angeles County Museum of Art in 2016, and “The Art of Photography: From Matisse to Keats,” which ran at the Los Angeles County Museum of Art in 2018.Prior to joining LACMA in 2012, Cruz was a curator at the Getty Center in Los Angeles. In 2016, she was named the Getty’s Fashion Writer of", "The next Biennial should open in the spring of 2021. Following thirteen years as head of the museum, Anne-Marie will step down. Prior to joining the museum in 1994, the California native served as dean of the School of the Arts at the University of California, Los Angeles (UCLA) and later as director of the Metropolitan Museum of Art. Anne-Marie was a senior curator of contemporary art at the University of California, Los Angeles (UCLA), and a curatorial fellow at the Met in the late 1990s.  Anne-Marie also serves as president and director of the Metropolitan Museum of Art, which is located in the former U.S.S.R. naval base at Novaya Zemble in Moscow, and is vice president of the United Arab Emirates. In her new role, Anne-Marie will oversee the exhibition and programming program in partnership with the Abu Dhabi-based artist and director, Mohammad Jumana. “I had the privilege and honor of serving as the first African American director of an esteemed institution such as the Met,” said Anne-Marie. “I have been privileged to work with and support fellow creatives of color in inspiring local and international exhibitions, to develop programming", "The next Biennial should focus on the history of contemporary art in the Philippines, including contemporary art from the island and the region, and should showcase art from countries and regions around the world. \n\nArt historians and curators who are participating in this year’s Art of the Party, a biannual conference held in Manila, are urging the government to allocate $1 billion to fight the coronavirus, which has already claimed the lives of more than 3,300 people in the Philippines and has infected more than 6,600 in China.The organizers of Art of the Party, which they define as “art of the moment,” said that the funds will be used to create “a new kind of health and wellness center,” a “museum for contemporary art,” and a “art museum in a city,” among other projects.Billie Eilber, founder of the Los Angeles–based nonprofit artist collective LaToya Franklin-Friedman, told the Art Newspaper that the money should be used to “stabilize the climate,” and to “stop the climate crisis.”  “We need the political will, we need the financial will, and", "The next Biennial should take place in 2021 and will be hosted at the Museo de Arte Contemporáneo in Madrid. The event will be hosted by the Los Angeles–based artist-run project the Festival of the Imagination, which was founded by Spanish artist and educator Marina Córdoba and will be hosted by the Los Angeles–based nonprofit the Foundation for “Creative Alternatives.”A selection of thirty-six works by the Spanish-born artist will be presented by the Los Angeles–based artist-run project the Foundation for Creative Journalism, which was founded by artist-activists and creators. The Los Angeles–based nonprofit will organize two separate shows with videos of the works in order to expose the exhibition’s cultural roots to the West Coast. The museum will hold a lecture series about the work and the film\u0097the first of which will be held on November 21 and will feature works by the artist-run project, the Foundation for American Art, and the Center for Visual Arts, Los Angeles\u0097on December 16.The Venice Biennial will be the first exhibition of work by the Spanish-born artist-turned-activist Ricardo Cornejo, who was selected for his work", "The next Biennial should focus on “legitimate, ongoing, and transformative'” themes, which will “take account of the current global mood and current political situation, as well as the poetic and visual metaphors of the past.”The 2019 edition of the fair will take place at the Museum of Contemporary Art, Miami Beach.\n\n\nAUSTRALIAN artist and activist Emily Boyd has been named the 2020 winner of the Max Mara Larsen Prize, given annually by the A.F.L.-C.E. fellowship organization. Boyd, a Sydney-based artist who focuses on social justice and environmental issues, was selected by a jury made up of artist and writer Laura Hadden, curator and writer Sarah Mpagi Sepuya, and art historian Dorota Snijders.“I’ve long been inspired by Emily Boyd,” Hadden told The Guardian. “Her work is at once the embodiment of and a direct counter to the conditions of the contemporary, and her work often imparts a sense of timeless purpose that really makes her work stand out from the crowd. I’m really looking forward to seeing what she does next.”Hadden added: “I’m thrilled", "The next Biennial should take place in 2021 and will consist of approximately forty selected works by contemporary artists from the US and the world over. The works will be curated by artist-in-residence Maren Chiu and will be presented in conjunction with a retrospective of work by the same artists (the first is titled TULIP and its sequel TULIP + BAILEY, 2017). The 2019 event, which was co-organized by artist-in-residence Michele Ervin and curator Cassady L. Niles, was canceled due to the Covid-19 pandemic. The full list of participating artists is as follows: ...Karina L. (New York)M.L. Clark (New York)Diane Arnold (New York)Elizabeth Armitage (New York)Sebastian Albright (New York)Kathleen Anderson (New York)B.T. Boone (New York)L.A. DeForest (New York)Diana DeNardo (New York)David Haemise (New York)Nancy Hess (New York)Susan Hess (New York)Claire Hooten (New York)Claire Hooten, Jr. (New York)", "The next Biennial should take place in the near future.”\n\n\nThe Smithsonian’s National Museum of American Art in Washington, DC, has announced that Tanya Basu, the executive director of the Independent Council of Museums (ICOM), will serve as the next chair of the institution’s board of trustees. In a statement, she said: “In the twenty-first century, museums are clearly changing for the better, but it is a museum that is at the forefront of a continuum of change. I am eager to help shape the museum’s trajectory in the twenty-first century and see what this new century holds for the institution.”“I’m a huge admirer of her work,” said Steve Littman, chair of the board of trustees. “I’m a huge admirer of her work, and of the work of many others who have shaped her vision and her impact. I’m eager to see what she does next.”Since the ICOM was founded in 1943 by Frank Lloyd Wright to protect and organize the art of the American West, the museum has been transformed into one of the country’s leading cultural institutions. It was", "The next Biennial should be held in 2021, with the first exhibition, “Award for Excellence: International Art,” to be held in 2022.\n\n\nThe Kendal and William Wilkins, who founded the Wilkins Museum of Art in London in 1853, have been awarded an additional $150,000 by the New York Foundation for the Arts (NYFF). In recognition of their achievements and dedication to their art, the Wilkins Museum of Art will officially be renamed the William Wilkins Museum of Art (WHM), after the late museum’s founder and namesake, William Wilkins. The grant also recognizes the museum’s support of its students and alumni.A selection of the grant’s funds will go to the Wilkins Center for Contemporary Art, which will dramatically expand the museum’s collection in the coming years; the William Wilkins Library, which will become a center for scholarly research and presentation of Wilkins’s work; and the William Wilkins House, which will be reconfigured into a new home for the museum’s collection.The gift is one of several significant milestones for the Wilkins Museum, which was founded by William Wilkins, Charles and Edwidge Dantic", "The next Biennial should take place in the spring of 2021, with a new exhibition that will be organized in collaboration with the London-based company Autodesk, which is currently collaborating with the Royal Academy of Arts in London. “I’m thrilled to be able to offer a platform to these amazing works and explore new modes of expression together,” said Hanna Gladstone, director of the Tate and the Biennial. “The upcoming edition of the Biennial will focus on bringing together artists and scholars from all over the world, to explore and make sense of the universal, and will include a new exhibition of biennial works. The exhibition will consist of one or more digital programs that will be created in collaboration with the artists and will be presented in virtual spaces.”The biennial will be divided into four sections: “Art and Art History,” “Art and Art History: Selected Studies,” “Art and Art History: Digital,” and “Art and Art History: The Transformation of the World.” The program will be curated by the artist and curator Laura Mulvey, who will serve as the inaugural curator of the biennial. The artist-run exhibition will be organized by", "The next Biennial should be held in the autumn of 2021, and should take place in the city of Barcelona. The exhibition will be hosted by the Catalan government and organized by the local arts and culture organization the Institut de la Société des Beaux-Arts (ASB).\n\n\n\n\n\n\nThe museum of contemporary art in New York City has received a major gift of more than 1,400 works from a private donor who donated them all to the museum in exchange for $600,000. The gift includes a collection of work by the late American artist Richard Diebenkorn and four works by the Belgian-born, Die Antwoord-trained artist Raffaello Pincus, who used his degrees from the Museum of Modern Art in New York and the University of the Arts in London to forge a group show of paintings and prints by the late Mexican architect Alberto Burri.The museum also revealed the acquisition of twenty-four works by the late American artist John Chamberlain, whose work is currently on display in a virtual viewing room in the museum. The museum also acquired twenty-two works by artist and activist Gertrude Vanderbilt. All artworks, including paintings, prints, videotapes, and photographs, are currently", "The next Biennial should be announced in July 2020.\n\n\nA patient has filed a complaint with the California Department of Consumer and Business Services (Cal-CBP) over a disturbing array of commercial, industrial, and residential lighting fixtures in a Los Angeles home that has served as a site for a number of the UK’s largest art exhibitions. The fixtures were manufactured by British manufacturer Adorama and can be distinguished by their distinctive angled mirrors, which are mounted on either side of the fixture, and can alter the light in a manner similar to that of a traditional incandescent light bulb.The complaint, which was filed by a woman in her thirties who lives in the same building as the offending pieces, alleges that the installation of three of the fixtures is sufficient to constitute a “nuisance.” The complaint also cites a number of other lighting fixtures in the home as suspiciously similar. According to the complaint, a ten-foot-long Plexiglas tube, which is attached to two side-by-side bulbs that are mounted on the wall, is connected to a light fixture that emits energy at a rate of up to 300,000 watts per square foot.The woman’s husband discovered the suspicious fixtures when he opened the", "The next Biennial should be held in May 2020, with the exhibition slated to run from November 2020 to January 2021.The festival, which was established to commemorate the centenary of the outbreak of World War II, will announce a new theme for the upcoming event, titled “Birds and the Future.” The first Biennial in the US, “Birds and the Future: ‘Escape from the Black Sky,’ will be held at the Museum of Modern Art in New York in June 2021.\n\n\nThe Institute of Contemporary Arts (ICA) in Bristol has appointed a new director, Francesca Catellani, who will begin her position in July. Catellani succeeds Caroll Taylor, who led the institution for twenty-five years, who will resign on July 1. “Francesca is brilliant and experienced, with a long history of imaginative and innovative thinking and an exemplary record of delivering on-site experiences for audiences in her home city, Bristol,” said Shane Ross, president of the ICA and curator of the exhibition “The Future is Not What We Used to Make It” (2015). “She is a pioneer and a visionary leader, and we are", "The next Biennial should take place in the spring of 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has received a $10 million donation from the Getty Trust in support of the installation and exhibition program at its new home in the historic Tenderloin neighborhood of the city. The gift includes $3 million for the museum’s first major overhaul, which was completed by the museum in the summer of 2021. The overhaul includes the addition of three new galleries and a reconfigured lobby as well as the renovation of a second-floor gallery.The gift also includes $2 million for the exhibition program, which was launched by the Getty in partnership with the New York–New Jersey Transit Authority (NJIT), the New York City Department of Cultural Affairs, and the California Coastal Commission. The program’s inaugural exhibition “The Planets” is slated to open at the museum in April. In addition, the institution will launch a new collaborative program, “Between the Planet and Me,” which will feature work by approximately seventy artists, in early April.The first show, titled “Between the Planet and Me,” will be a selection of works by local artist Billie Millet. The show will", "The next Biennial should take place in 2020 and will likely feature the work of a select group of artist-in-residence, in collaboration with the museum, whose holdings include work by individuals such as Olga Berberu, David Cage, Diego Rivera, and Robert Irwin, among others. The exhibition will be organized as a showpiece for the biennial, which will be staged in the original 1959 format of a biennial, as well as in the institution’s traditional location.The announcement follows a year of exhibition-making that has seen the institution become a major cultural hub in the capital, as more than 5,500 visitors from twenty-two countries flock to the Panástial for a single night in December each year. In the process, it has become a kind of international cultural nexus. In January 2020, twelve months after the institution’s founding by director Raffaello Pinturro, the Art Newspaper published a report that described the institution as one of the main engines of the city’s cultural life. The exhibition will also introduce a new walking tour that will introduce the new location and its collection to visitors. The seventy-six-year-old museum has also been working on a major", "The next Biennial should be organized as follows:\n\nJuly 15–26, 2019*\n\nSeptember 21–October 5, 2020*\n\nJanuary 7–February 13, 2021*\n\nJanuary 28–February 30, 2022*\n\n\nThe Hirshhorn Museum in Washington, DC, is planning to close its doors for a period of ten years to allow the institution to transition to a new building constructed in partnership with the City of Washington. The Hirshhorn has had a long-standing partnership with the city since 1959, when it was founded by George Hirshhorn, a longtime lobbyist for the tobacco industry, to lobby against the legislation that would establish the federal public health agency the Food and Drug Administration. The Hirshhorn has since been lobbying in favor of passing legislation that would further restrict smoking. Frederick Douglass famously said, “All men are created equal,” and the Hirshhorn Museum has been a focal point for campaigns to reduce smoking and to fight back against laws that made it harder for small businesses and charities to operate. In 2016, the institution became the first major American institution to rebuild its iconic B-52 bomber, which had been the centerpiece of the institution for nearly sixty years. Under the direction", "The next Biennial should be on the premises of the Museum of Modern Art in New York. The next major retrospective should be in the Museum of Contemporary Art, Los Angeles (MCA), in 2020. The next Dadaist Biennial should focus on the artist-centeredness of contemporary life in the 19th century, with a strong emphasis on the French artist W. H. Gant.  The next Dadaist Conference should take place in New Orleans in 2020. The next Dadaist Art Prize should be held in New York in 2021. The next Dadaist Festival should be held in the United States in 2022.  The next Dadaist Film Festival should be held in October 2020. The next Dadaist Art Museum in Seattle will be inaugurated in October 2021, preceded by a new exhibition dedicated to the artist-centered environment and architecture at the Museum of Contemporary Art in Chicago in December 2022.The next year will mark the centenary of the birth of Herbert Bayer, the French chemist responsible for the discovery of the structure of cellulose, a material that is ubiquitous in the world’s most valuable cellulose. An exhibition of his works is scheduled to open at the Museum of Modern Art in", "The next Biennial should be a long-term project that will involve the exhibition of the work of the most important artists in the twenty-first century.”\n\n\nThe J. Paul Getty Trust in Los Angeles announced today that it is donating $5 million to the nonprofit the Getty Center, which is working to create a new permanent home for the Getty’s collection of more than eighty thousand photographs by American photographers. The gift includes $2.5 million for the organization’s existing endowment, and $2 million for its new endowment.It also includes a promise to match the $2.5 million provided by the trust for the works of artists whose works are included in the acquisition.The institution will contribute $1.5 million for the acquisition of works by artists whose practices are currently under investigation by the Getty. One hundred percent of the funds will go to the nonprofit. The other ten percent will go to the institution to pay off loans it made to artists. The trust will create the new endowment by collecting funds from the Getty’s endowment and returning them to the trust.The gift is one of the largest philanthropic efforts ever made by the Getty and is being made in recognition of the trust’s contributions to", "The next Biennial should take place in the Park area of the city in the spring of 2020. The 2030 edition is tentatively scheduled to take place in the summer of 2020. The 2040 edition, which will be held in the city, will also be held in 2020 and 2021. The 2050 edition, which will be held in the city, will be housed in the city for the next twelve years. The 2055 edition will be hosted at the City of London’s Olympic Stadium, London, from March 14 to March 15, 2020; and the inaugural edition will be staged in March 2021. The already completed exhibition will be reinstalled in 2021. “The London Biennial is a celebration of art and design, inspired by the City of London, and is an extension of the Guardian’s longstanding work to promote and defend the arts in our city,” said editor in chief, Damon Allen. “The biennial’s design, which is inspired by and reflects the City of London’s iconic buildings, is able to unfold in the space of a single day the exciting history of art and design.   We are thrilled to announce that our", "The next Biennial should begin in 2020 and will be staged in the gallery’s original space in the city, located in a former steelworks, between the Art Institute of Chicago and the new McCormick Place. The full list of participating artists is as follows: Sara Cwynar\n\nSylvia Costa-Ricci\n\nGillian C. Hester\n\nAna Jocson-Higgins\n\nBeth Lynne\n\nCarolyn L. Levey\n\nMarcelo Maric\n\nMargot McGonagle\n\nDiana Miro\n\nSasha Pappas\n\nKaren Teitelbaum\n\nSawangwongse Yayong\n\nJoel Walentas​\n\n\nBritish art historian and art historian Sir David Adjay has died at age eighty-two. He was a leading critic of modernism, a leading critic of the avant-garde, and a leading proponent of the idea that art created this new world. His work has been collected by the Manchester Metropolitan University Museum, the Metropolitan Museum of Art, and the Solomon R. Guggenheim Museum, and he was honored at the New York Academy of Arts in 1972 for his twenty", "The next Biennial should be held in the city in 2021.<|endoftext|>The UFC on FX 5 card is now live, and it's shaping up to be one of the biggest debuts in the history of the organization. The card will feature a number of tournament fights paired with the live event, which will take place on the first Saturday of April at 11 AM ET/6 AM CT in New York City. The new partnership between the UFC and FUEL TV, a division of Chase Bank, will run for eight weeks, from March 3 to March 6. According to CEO Bjorn Rebets, the strategy behind the new deal is to create new opportunities for fans to enjoy the action while it still has a chance for the fight card to open.  Rebets also indicated that the UFC is looking to take advantage of the same streaming platforms as FUEL TV, allowing the organization to stream the main event as it currently airs. The new partnership is just one part of a complicated web of agreements between the UFC and several major companies, including Amazon, Fox, and Comcast. According to a release, the UFC and FUEL TV entered into a strategic agreement valued at $130 million in March 2019. The agreement also outlines the promotion of", "The next Biennial should focus on the performance of artists, creators, and technicians, and should aim to introduce a new way of looking at art. The next, which will be held at the Museu de Arte Contemporáneo Santo Antonio de Celant in Madrid, will focus on the themes of climate change and the logic of certain technologies. The fifth edition of the Glasgow Biennial, which will be held at the National Museum of Scotland from September 20 to September 22, 2020, will explore the connections between art and the history of art. In the spring of 2021, the Biennial will shift to a new venue, the National Galleries of Scotland, and will reopen in March 2022. A new exhibition, “Lights, Camera, ” will be presented at the Biennial in March 2022. The theme of the 2021 edition, “The Body,” will be reconsidered in a future edition.\n\n\nThe French city of Lyon has become the latest region to establish a memorial to victims of the Paris attacks, as the French president, Emmanuel Macron, announced a new $12 billion fund dedicated to protecting France’s cultural heritage. The Macron’s Vision 2025 plan", "The next Biennial should be held in the year 2025. “This is a significant milestone, the culmination of more than twenty years of work by a team of curators, artists, and scholars,” said Cynthia Cooper, director of the Museum of Contemporary Art, Los Angeles, and a cochair of the 2020 biennial team. This is the first year that the show will feature the work of only twenty-nine artists in its history. The entire exhibition will be on view in the new space, called the Gallery, from March 14–March 21, 2020.Cooper and the artists selected for the 2020 exhibition include Andy Warhol, Alejandro Cesarco, Ermanno Olmi, and Jean-Luc Monaco. The 2019 selection consists of forty-eight works by artists such as Josef Alberts, Zaha Hadid, and Jannis Kounellis. The exhibition will also feature the work of Soshiko Nakamura, Kim Phuc, and Michael Sandel.\n\n\nThe Art Newspaper in the United Kingdom has published an analysis of the British government’s decision to leave the European Union, arguing that the UK’s departure from the EU is a major setback for the British visual arts. The", "The next Biennial should be held at the Museo de Arte Contemporáneo (MASC) in Rome, in February 2019. The event will be hosted by Jean-Luc Moulène, director of the Centre d l'Édition d’Art Contemporain, and Anne de la Poiret, director of the Centre de l'Édition de Paris. Garlic, which has been used in Italy for more than 400 years, will be a centerpiece of the show. It is also being organized by the Museo de Arte de Energía (MASC), in collaboration with the Instituto de Cultura Paz y Libertad (ICP), in partnership with the Museo de Arte de Santiago (MASC), and in partnership with the Museo de Arte de Madrid (MASC).The exhibition will take place in the Museum of Fine Arts (MFA) in St. Louis. The show will feature three new works by artists, including Mapplethorpe, Tozier, and Zeslva, and will feature the first solo exhibitions of work by the two Italian artists in St. Louis in more than sixty years. The artists selected", "The next Biennial should kick off on March 6, 2020 and conclude on March 21, 2020. The 2020 edition will feature work by seventy-nine artists, including Antony Gormley (the Farthest East), Alex Katz (the Farthest West), Charles Clark (the Farthest North), and Emilio Lotti (the Farthest South). The 2019 edition, titled The Earth In Segment, was organized as a joint project between the London-based artist-run space the Biennial Foundation and the artist-run nonprofit Art Space Biennial. The 2019 edition of The Earth In Segment, which was organized as a joint project between the artist-run space Art Space and the London-based nonprofit Art Space, was selected by a jury chaired by the artist Naomi Campbell. The Artists’ Vote for Biennial 2020 will open on March 28 and will run through March 29.\n\n\nHarriet Finney, a curator and writer best known for her anthropological, political, and cultural studies, has died at age ninety-one in New York City. Her death was confirmed by her daughter, Sally, on Monday; the cause of death was pneumonia.Born in London in 1928", "The next Biennial should be in 2019, but they have not yet set a date. “We are actively considering alternate sites, including the city of Osaka, where we are planning to hold the next Biennial in 2021,” Miyamoto said. \n\n\nThe Institute of Contemporary Arts (ICA) in Tokyo announced today that Akiko Kawamura has been appointed as the next president of its Miyazaki Branch. Kawamura previously served as president of the Asahino Art Museum in Nagoya and as a board member of the Asahi Art Museum in Tokyo. She will take up her new post on January 16.“In an age when many cultural institutions are struggling to stay afloat, we are pleased to see Akiko resume her leadership role at the Asahi Art Museum,” said general director Takashi Ishigami. “She has been an outstanding advocate of Japanese art and culture and has shown remarkable creativity and vision in fostering its national revival. We are proud to have her at the helm of the Miyazaki Branch. She will bring a new dimension to the museum’s exhibitions, archival exhibitions, and programs, and continue the museum’s international reputation as a leading international curator.”\n\n\nThe Museum of", "The next Biennial should take place in the autumn of 2020.  The event will be organized as follows: Themes: TOCO, War and Peace, Kunsthistorisches Museum, Minneapolis, USA—September 27–September 28, 2020. Location: Philadelphia’s Art Museum, October 23–October 26, 2020.  Themes: US Strategy in the 21st Century, US Interests and Institutions, Art of the Late 20th Century, 1939–1945, 1948–1956, 1957–1959, 1162-1970, 1975–1979, 2011–2020, 2020-2025, 2025-2019, 2019, 2019-2029, 2019-2030, 2019-2031, 2019-2033, 2019-2036, 2019-2039, 2019-2045, 2019-2050, 2019-2055.  Art of the Future: Light Art and the Early History of China, Berlin Art Museum, September 23–September 27, 2020. Art of the Past: Early Art in Contemporary", "The next Biennial should be held in March 2020. The dates for the previous two editions, held in September and March, were shifted to March 25 and March 31. The new dates for the 2019 biennial were also shifted to March 22–March 24, and the 2019 list was restructured to take into account the return of the works of Friedrich Frode and Hans Ulrich Obrist. The 2019 event will be hosted in Frankfurt am Main and will take place on March 21–March 26.  The 2019 biennial was organized by NurPhoto, the Newcentre Berlin, and the Wegmann Museum in Frankfurt with the participation of over 150 museums and institutions from twenty-five countries. The exhibition will be organized in two phases: 1. Phase 1: The exhibition will be opened by the German photographer Wolfgang Lüpke at the Newcentre Berlin on March 21. 2. Phase 2: The exhibition will be presented by Nils Storbeck at the newspaper Frankfurter Allgemeine in Berlin on March 28. Nils Storbeck’s first exhibition at the Newcentre Berlin was Aperture, 2016,", "The next Biennial should begin in 2020 and will be held at the Art Institute of Chicago, which opened its new facility in the spring of 2021. The exhibition will be located in a renovated Art Institute building on the city’s North Side. The inaugural edition features work by twenty-six artists, including the Cleveland-based artist Phoebe Corrigan, who transformed a two-story, seventy-one-foot-long, and seven-story-high sculpture park into a living laboratory for cutting-edge research.The biennial’s theme is sustainability, and the sculpture park comes at a time when the arts and culture sector has been at the forefront of efforts to address climate change. As cities and states across the US attempt to curb emissions and adapt to the changing climate, they are also grappling with how to pay for the massive investments required to address climate-induced loss of revenue. The Park Foundation, a New York nonprofit that works with artists to address climate change, announced earlier this month that it would break ground on a new $50 billion in funding to combat climate change in the coming decades.The Park Foundation’s plan, which includes funding for climate resilience, energy efficiency, and adaptation, is one of several efforts underway to address climate", "The next Biennial should be held in 2022.”The jurying committee comprised Marieke C. de Jager, director of the Brussels Biennial from 2017 to 2019; Lars-Andrea Lidén, director of the Copenhagen Biennial from 2003 to 2014; and Radek van der Vorst, director of the Bayreuth Biennial in Germany, as well as art historian Anne Monnaies, art historian and curator, and biennial organizer Flemming Steegmann. \n\n\nThe Trump administration signed a $9.8 billion aid package on Wednesday for arts and cultural institutions in the United States, marking a major step in the president’s cultural agenda. The $3 billion package includes $9.3 billion for nonprofit organizations, which range from arts and cultural organizations to schools, and regulations on federal loans and grants, and grants and tax-exempt organizations, which will help support exceedingly small artistic projects in the US.Critics have slammed the $3 billion aid package for not providing enough funding for smaller artistic projects, including the Los Angeles County Museum of Art (LACMA), which is struggling to stay open after it shut down last", "The next Biennial should be held in Dubai in 2021.\n\n\nOrganizers of the Pérez Art Museum in Mexico City have suspended the event, which was meant to take place in the city in March, because of concerns regarding the coronavirus. According to the Art Newspaper, the Pérez Art Museum and Gardens in Mexico City, which houses the museum and the Pérez Art Museum, has also suspended its upcoming edition, which was to take place in December, and has asked fans to boycott the December event. Additional curators from the institution, which are located in the city of São Paulo, Brazil, were reassigned late last month following complaints that the Pérez Art Museum and Gardens was not following standard operating procedures.The Pérez Art Museum and Gardens and the museum of contemporary art, the Pérez Art Museum and Gardens of Art, the Pérez Art Museum and Gardens of Modern Art, and the Pérez Art Museum and Gardens in Mexico City were not aware of the changes until the suspension order was issued on March 13. “From the moment we received the suspension order, we have been working in consultation with our staff, our partners, and with the Pérez Art Museum in Mexico City", "The next Biennial should take place in the summer of 2021. \n\n\nThe Museum of Contemporary Art (MoCA) in San Francisco has announced that it will reopen to the public on September 22, after being closed since May due to Covid-19. The institution is slated to reopen on September 21.The museum is prepared to welcome visitors on September 21 and is working toward setting up a website with more information about the reopening, including an interactive map of the museum, which will be updated frequently with daily visitor and car information. According to its website, the museum’s programs for the day include “Anselm Kiefer: The Great Modernist” (2017), “The Cruel Craft of the Painter” (2017), “The Art of Man-made Light” (2017), “The Space Between: Forms of Light” (2017), and “MONUMENTS & CREATIONS,” which will be organized in stages. The program will be open from 11 AM to 9 PM on weekdays.For more information about MoCA’s upcoming programming, go to the museum’s website.\n\n\nThe Association of Independent Art Museums (AIM)", "The next Biennial should focus on the legacy of the Red Cross, and its role in supporting the global fight against HIV/AIDS.    The museum should also expand its physical presence by adding a platform for art and architecture that is connected to the city and to the people. The institution has received $5.2 million from the Sainsbury Trust in support of its bid to open the Museum of History in London, which was originally scheduled to open in 2019. The funds will be divided among the museum and the Tate, which is trying to raise $3.8 million for the project. The most recent British Art Museum survey, for which the institution has been working with art historian Jo Walton, found that 45 percent of British Museum visitors in 2020 are not familiar with the institution and only 12 percent have a \"greater understanding\" of British art.\n\n\nThurs.–Mon., April 15–April 19, 2020: Opening of the National Museum of Australia’s exhibition “The Power of Positivity” and the opening of the second edition of “Pangaea” at the Art Gallery of Ontario. Lincolnshire Arts Council and the National Trust of Scotland will present a free public event at the", "The next Biennial should take place in London in 2021. The exhibition is still on track to launch, but will not be able to close until June 23, 2020, in order to allow for further work on the exhibition.  The event will then return to New York for a second run in 2020, in March.  For Michael Rosenfeld, president of the association, the move is an “unprecedented step in the exhibition’s history,” and hopes it will help the DC-based arts organization to avoid future financial disruptions caused by the coronavirus. “We are now in a period of transition, of which the arts are only one part. We are keen to focus on the work of Hal Foster and his team, and the exhibition’s next iteration, which will take us back to the 1960s, will focus on the work of artists who have made significant contributions to the DC region over the last seventy years.”\n\n\nThe Museum of Modern Art (MoMA) in New York has agreed to sell the ephemeral work of Italian architect Magazzino Italianatecchio to a New York–based collector for $3.6 million. The transaction, which involves the", "The next Biennial should be held in 2020–21. The first was held in 2002–03. The next will take place in 2022–25. The Tate is currently working on a new set of guidelines for its exhibitions, which will be published by 2020. The Royal Shakespeare Company is also planning to hold a new edition of the festival, which will be held in the summer of 2021, in June 2020.\n\n\nThe Museum of the Fine Arts (MFA) in San Francisco is launching a new digital platform that will provide artists and collectors with more tools to help them sell their works. The platform, called the Community Artist Portal, will provide galleries with tools such as contact lists, catalogues with recommended sellers, and auction prices for individual works. It will also include a platform for artists to sell their work to the public, which will be accessible 24 hours a day.It will also allow collectors to connect with artists and other collectors through the platform, which will connect buyers with artists through an online marketplace where they can submit a digital photograph to be auctioned. The winning bidder will be given a commission of up to $100.“The future of the online auction market in general and MFA in particular is uncertain, and we are actively working", "The next Biennial should be held in the spring of 2021. With the exception of the 2017–18, the last two years of the twentieth-century have been marked by mixed exhibition and exhibition-based programming, a slow but steady recovery from the Great Recession, and a marked upswing in the number of visitors. The first half of the biennial will be devoted to new art-making and new research. The second half will be dedicated to the legacy of the late poet and artist, and will examine the relationship between the artist and the body.“We will do our best to address the problems of the future with new forms of art,” said Suzuki. “The forthcoming 2020 biennial can represent the intellectual, artistic, and social future of Japan.”\n\n\nThe National Museum of Fine Arts (NMA) in Washington, DC, has released the results of an innovative, five-year survey of the work of American painters, which was held in the exhibition “Painters” and will return next year. The exhibition, curated by Louise Cooper, will be on view in the NMA’s newly expanded permanent collection galleries for the next two years\u0097the museum will stage the first iteration of the survey,", "The next Biennial should begin in December 2020 and will unfold over the course of twenty-six weeks. The first phase of the exhibition will consist of an open-air exhibition of works from the collection of the museum. During the exhibition, the artist will present his Theater of Resistance, 1995, a work based on a theory of political violence and a critique of the theory of a continuous history. The second phase will consist of a retrospective of only thirty works and will unfold over the course of twenty-four weeks.The full list of participating artists is as follows:Akio Nara (Japan)Akihiko Hasegawa (Japan)Arts of War: The Field of War and Life as a Contemporary Art of War by Catherine Aitken (United States)Arie Kant (Germany)Arekawa Mitsu (Japan)Benjamin Watts (Australia)B. W. Walker (United States)B. W. Walker: Theater of Resistance (2016) (2016) (2016)B. W. Walker: The Pale Moon (2016) (2016)B. W. Walker: The Pale Moon (2017) (2017)B. W. Walker: The Second Coming of Jesus Christ (2017) (2018", "The next Biennial should open in 2021 and will consist of ten exhibitions. The theme of the show will be “color, the color wheel, the color theory of art.”\n\n\nThe Los Angeles County Museum of Art (LACMA) announced today that it is working with the architects, engineers, and planners at the Chinese American Institute (CAI), a New York–based nonprofit, to develop a new public art project in Los Angeles, which will be modeled after the iconic Charles Egan’s downtown Los Angeles Cultural Center.“LACMA’s new public art will be inspired by LAX,” said designer Peter Zumthor. “The project will be an extension of our ongoing efforts to envision how new urban spaces can incorporate the art of LA, and the Museum of Modern Art in New York, as well as to explore how art and design can work collaboratively with local and national audiences in the city of Los Angeles.”The project will take several forms including a series of public events such as a public art walk, a series of exhibitions, and a museum-wide concert series in tandem with the 2020 LAX Art Festival, which will be held March 5–March 6. In addition", "The next Biennial should also include a new initiative to promote the work of young and emerging artist-run projects within the city, as well as an overview of the city’s art history and contemporary art. There will also be a focus on partnerships between the city and the Biennial.For the project to succeed, the city’s arts and cultural sector needs to grow by 12 percent annually. The current rate of growth is well below the City of San Francisco’s goal of 40 percent. The current biennial is being organized with the support of San Francisco’s arts and cultural organizations; the city’s Department of Public Arts; the San Francisco Museum of Modern Art; and the San Francisco Art Institute (SFAI).\n\n\nThe Museum of Modern Art (MoMA) in New York has given $2.25 million to support new initiatives to encourage innovation and creativity in Antenna, a program that will draw artists from around the world for an eight-week residency in the museum. The gift comes on the heels of a $1 billion renovation and expansion project, which is slated to be completed in 2023, designed to make the institution more accessible to the general public and to increase the collection’s reach.", "The next Biennial should be held in 2020, and the first on the island of Luhansk in 2021.Both exhibitions will be held at the former Winter Palace in Kupfer, in the city of Rostov-Ukraine, with work by two hundred artists from fifty countries and thirty-seven islands. The main theme of the second edition will be the current crisis.RIO is planning to open a new branch in Berlin, and in September, the institution will hold an exhibition in the city of Bremen. The first edition of the biennial will be held in 2021.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Benjamin Siskind as its new deputy director of curatorial affairs. He will be responsible for overseeing the performance of five exhibitions annually at the institution, which was founded by Frank Gehry and is located in the same building as the Museum of Modern Art, and will assume his post in January 2021.“We’re thrilled to welcome Ben to MoMA,” said museum director James Cuno. “We’ve long been committed to him, and during his tenure he has been instrumental in driving MoMA’s transformation into a powerhouse. He combines a keen sense for", "The next Biennial should be held in the autumn of 2021. It will be in partnership with the Metropolitan Museum of Art, the Whitney Museum of American Art, and the Asian Art Museum, and will be organized as a series of exhibitions, culminating in a major exhibition, The Biodiversity Monument, at the Whitney Museum of American Art in 2020. \n\n\nThe Flemish authorities have approved the construction of the world’s largest aquarium in the city of Antwerp. Located in the former zoo, the aquarium will host approximately 1,400 fish, which will be transported by ship from the nearby city of Ghent, Belgium, to the port of Antwerp in an environmentally friendly vessel, the Aquarium in the City of Ghent, which will be equipped with an electric power plant, a swimming pool, and an industrial area.The aquarium will resemble a small boat, but will be able to house up to five times that number of fish. The new structure will be located on the campus of the University of Ghent and is being created with over 1,600,000 five-gallon tanks stacked in an 800-foot-long tube. Designed by Flemish architect Peter Obendorf, the design is inspired by the triangular", "The next Biennial should be the last. The work of the anthropologists has been completely lost, and the biennial’s goal is to reconstruct the world—more than twenty years of the exhibition.”\n\n\nThe National Museum of Art in Washington, DC, has appointed Darrell DeVoe as its new deputy director and curator of prints and drawings. He will be responsible for overseeing the curation, research, and presentation of the museum’s collection of more than four hundred works by artists including Margaret Mitchell, Tadao Ando, Robert Mapplethorpe, and John Edmonds.“Darrell is a graduate of the Smithsonian’s National Museum of Art and is currently a visiting scholar at the University of Chicago’s Art Institute. He has extensive experience in the field of modern and contemporary art and will be a great asset to the National Museum of Art, as we work to complete the renovation of the historic building and launch an exhibition of work by artists that became lost during the construction of the museum’s new home, the National Museum of the American Negro, scheduled for completion in 2021,” said museum director Paul Mpagi Sepuya and chief curator Mary Anne Carter.  \n\n\nThe Mont", "The next Biennial should take place in 2020. “The Bay Area Biennial,” curated by Jessica Morgan and curated by Mary E. Lucas, will be held at the Los Angeles County Museum of Art in 2021.\n\n\nThe Los Angeles County Museum of Art (LACMA), one of the oldest cultural institutions in the United States, has announced that it will begin accepting visitors back in April. The announcement comes less than a month after it became clear that the long-term renovation of the institution would not be completed by the spring of 2021. Instead, the facility will reopen only in 2022.The opening of the museum is not surprising; as evidenced by the Museum of Contemporary Art Los Angeles (LACMA), which was rebranded from the Los Angeles County Museum of Art (LACMA) and reopened in 2018, LACMA has been an institution of contemporary art for twenty-five years. However, it remains the only institution in Los Angeles that will be fully functional as it undergoes a major renovation that will include the construction of a new auditorium, a conference center, and the restoration of the facility’s original facade. The building, which is currently undergoing a $300 million facelift, will also feature exhibitions,", "The next Biennial should be held in the summer of 2021, and the Board of Trustees will determine the date of the fourth edition in the spring of 2022. The exhibition will be organized as follows: Saturday, March 14, 2022, featuring paintings by Anton Kern, Marcus Garvey, and Ed Moses; Sunday, March 15, 2022, featuring works by Teresa Camnitzer, María Berrío, Carlotta Corzine, and Erin Gish; and Monday, March 16, 2022, featuring works by Sylvia Cortés. The 2019 installment, “Out of the FOG,” was staged in March 2019 and was directed by Frank Gehry.The 2019 exhibition, “Out of the FOG,” was curated by Lydia Adfeldt. Its twenty-fifth edition, “Out of the FOG II: Realizations,” will be staged in May. \n\n\nThe Brooklyn-based nonprofit Art Relief is raising funds for five artistic organizations that are facing unprecedented financial crises. Each organization must work with the Art Fund to obtain funds from the Art Fund to help with their operations, but each", "The next Biennial should be part of the “Emergence Project,” said to be a collaboration between art historians, researchers, and artists across the globe. The exhibition will focus on “new ways of thinking about and relating to art” and will also include a public program and a reception at which works by artists and institutions from around the world will be presented and discussed.The Biennial will be held in collaboration with the Italian Institute for International Art (IIM), Florence, and will be hosted by architect Gio Ponti, designer Hervé Miranda, artist and Maud Place champion Maria Monteforte, and the artist Javier Téllez. The 2017 event was curated by Sittke Brätsch, the director of the Schirn Kunstverein in Frankfurt, and Hans Rømer, the director of the Kunsthalle Basel, and will take place in the cavernous Maud Place, an unused former exhibition space of the Schirn Kunstverein in Basel, Switzerland, from September 16 to September 21.The theme of this year’s edition is “Death and Life in the Image of Art.” The works presented in the exhibition are works", "The next Biennial should take place in Los Angeles in 2022. The twenty-sixth will be held in San Francisco in 2024. \n\n\nThe Whitechapel Gallery in London has welcomed artist-in-residence Tanja Naidoo to its board of trustees. The forty-one-year-old Nigerian American artist will be the first to work in the gallery, which is currently closed during the Covid-19 pandemic, since the pandemic began in March. Her commission comprises Burmese paper and fabric, created with the help of the artist’s husband, who is from Nigeria, and will also be featured in the exhibition “Avant-Garde Painting in Africa” at the Whitechapel Gallery in London on November 11 and will go on view at the gallery in December.“Tanja Naidoo’s work evokes the most beautiful of human forms, and her deeply spiritual and pastoral paintings, in which she relates her own experiences of growing up in rural Nigeria, long before the arrival of Western missionaries, tell us of the impact art can have on our lives and on the lives of others,” said Paul Bloxham, the gallery’s director.", "The next Biennial should be held in 2020, and the theme should be “How Place and Identity Shape Biological History.”\n\n\nThe Metropolitan Museum of Art in New York is revamping its collection of Picassos, the Spanish colonial paintings, and the first Spanish-born, American artist to graduate from the institution. The museum’s collection, which exemplifies the Picasso–inspired Futurism of 1898, has undergone a major facelift. In addition to adding two new galleries dedicated to the works, the museum also renovated the first gallery dedicated to the artist’s work in the United States and added two new buildings for exhibitions and public programming.“After an extensive and thoughtful redesign, the building of the Met is proceeding in a more sustainable and resilient manner,” said museum director Daniel H. Weiss. “The contemporary Picasso legacy is embodied in the museum’s collection, and these works are central to the museum’s mission. We are moving forward confident that we will be able to provide an appropriate setting for the Met’s future exhibitions, exhibitions, and public programs.”Among the works that will be presented in the museum’s new gallery are Picasso’", "The next Biennial should be held in 2020.\n\n\nThe Brooklyn Museum and its trustees have agreed to pay $11.5 million to settle lawsuits brought by hundreds of former employees of the institution, who claimed that the museum failed to protect them from sexual abuse by former director Daniel H. Healy, a man named Jerome A. Nocera who served as director from 2003 to 2009, according to the New York Times. The deal resolves claims from the late employees and former employees who were employed by the organization at the time of the alleged abuse, as well as claims that the former director coerced employees to sign confidentiality agreements, violated the rights of the former employees in numerous ways, and retaliated against them.“We are pleased to resolve these cases and to move on to the next chapter of our extraordinary history,” said David Stein, chair of the board of trustees. “The Museum has a long-term plan for safeguarding the past, and we are committed to supporting the many brave and dedicated employees who have made the Museum a wonderful success over a long and distinguished history.”According to the New York Times, the initial lawsuit, brought by a group of current and former employees in 2014, was filed by four women who worked at", "The next Biennial should be held in 2021.The newly elected president of the Republic of Benin, Patrice Benitez, opened the new biennial with an address in French, Critique de l'Art (1987), with great fanfare. The work is dedicated to the late author Michelangelo Antonioni, whose work is in the public collection of the Museo de Arte de São Paulo.The opening of the new show was one of the major events of the exhibition. The show also received a special mention in the opening ceremony of the new Biennial de São Paulo, which opened on September 14.\n\n\nArtist-run space Gallery Urbanism announced today that it is expanding its activities in the United States. The new partnership with the artist-run nonprofit Artadia will allow it to host more shows in New York, Los Angeles, and San Francisco. Artadia’s inaugural project will be “Future Catwalk,” an immersive installation that will add color and movement to the cityscape of New York. Artist-run spaces in Chicago, Houston, and New Orleans will also participate in the inaugural show.\n\nActs of Restoration, an arts nonprofit that aims to stimulate social change through the restoration and", "The next Biennial should be held in Beijing, and its organizers are selling tickets on the platform to the public for $50,000 each. The opening will be February 24–March 8. The festival will also have a full schedule of events, including a final exhibition of work by the artists involved. The first artist to receive a prize for his work being the artist-in-residence at the Biennale is Alex Vargas. The other artists selected for the award are Tereza Simakov, Hiroshi Tajima, and Tazio Malaguti.  Tajima’s work, titled Futile Remains, is slated to be presented at the Biennial in November.The jury in the award was comprised of Alexandre Pappalardo, Biennale director; Igor Stankov, artistic director of Twin Cities; Alexandra Zwelethuub, director of United Russia; and Rory Mulligan, artistic director of the London Biennale. The full list of awardees can be found here.\n\n\nA group of artists, including James Turrell, Bernard Condominas, and David McAllister, have launched a", "The next Biennial should draw from the open-ended and interconnecting cultural and social landscape of Los Angeles, the region as a whole, and the Bay Area.  L.A. biennials have often been seen as unfinishable and not directly related to Los Angeles, but their respectful and insightful portrayals of their cultural and social milieus shed new light on LA’s history and have been historically significant. \n\n\nThe Metropolitan Museum of Art has appointed Thomas J. Oehlens as the next director of the museum’s newly established arts wing, which opened in the summer of 2019. Oehlens comes to the institution from the Solomon R. Guggenheim Museum, where he had served as director since 2016. He succeeds David Fries, who retired last month after eleven years at the helm of the Guggenheim.“After a distinguished history at the museum, it is meaningful that the Guggenheim Museum has chosen Thomas as its next director,” Guggenheim CEO Daniel H. Weiss said in a statement. “The museum has always been at the forefront of ambitious and forward-looking thinking thinking about how to reimagine how art can connect to and engage with our", "The next Biennial should be held in 2021. The museum will also open a new branch in Lisbon, and in 2018, the museum staged its first exhibition of work by a female artist in the United States.  Meanwhile, the museum has been working to establish a new academic program, work on a national campus in the center of Lisbon, and establish the Sherwood Forest School in order to improve the sustainability of its art.\n\n\nThe winner of the $30,000 Peter Leeson Prize, which was established in 2007 by the National Art Museum in Ottawa and the Ottawa Art Gallery, has announced its list of thirty-two artists who will receive a $100,000 cash prize. The shortlist, which was announced on September 7, was curated by Melanie Blundell, curator of contemporary art at the National Gallery of Canada; Bradley Cunha, curator of photography at the Sidney and Lois Lowry Gallery in Toronto; and Wangechi Mutu, the African president of the African continent.The twelve finalists were chosen by a jury comprising Artnet editor-in-chief Jenny Zahn, Marlene Nielsen, director of the National Art Gallery of Canada, and Mary", "The next Biennial should take place in the summer of 2021. The 2019 event was organized by the same institute, and featured the work of thirty artists, including Oliver Bailey, Cy Lenders, Laura Owens, and Laura Mulvey-Hamilton, and was led by the same organizers, Lazaretti and Marzio. The Museum of Contemporary Art (MoCA) Los Angeles was proud to host the first edition of the inaugural Biennial, which took place over the course of ten days in June 2019. The exhibition, entitled \"The Stages of Performance: Art and Performance in the 1960s, 2010s, and 2020s,\" was curated by Lacie Trumbull and featured work by artists such as Frank Parson, Judith Billavard, and Yvonne Atget.The 2019 edition was held at the Brooklyn Museum. The museum announced it was planning to move the exhibition to its new home in the Brooklyn Museum, which was scheduled to open in the fall of 2020. The museum also revealed that it was planning to move the exhibition from its current location in the Mariner Williams Building, where it has operated since 1961, to a location in the city’s historic Javits Center", "The next Biennial should take place in the summer of 2024, but there have been tentative plans to hold it elsewhere. The 2020 edition will also likely bring a new exhibition of works by artist-in-residence Huyghe.\n\n\nThe Museum of Modern Art (MoMA) is preparing to welcome visitors back to its New York institution on Wednesday, May 30. The social-distancing institution will be open from 10 AM to 6 PM, and will host two exhibitions that are currently on view: “The Truth About the World,” a presentation of a selection of works by contemporary artists, and “Radical Intimacy,” a presentation of works by artists that oppose feminist and socialist politics.The exhibition, titled “The Truth About the World,” will feature work by ninety artists who participated in the exhibition “Sisyphus: The Making of a Model,” which will run alongside “Radical Intimacy” at MoMA in the summer of 2020. The show is curated by artist-in-residence Aaron Siskind and is organized as part of the museum’s “Feminist Museum” program. The other show is titled “The Black", "The next Biennial should be held in early 2021. The next will be held in early 2021.  The next will be held in early 2021. The next, as is customary for the best-selling author, will be held in early 2021. The next will be held in early 2021. The next will be held in early 2021. The next will be held in early 2021. The next will be held in early 2021. The next will be held in early 2021. The next will be held in early 2021. The next will be held in early 2021. The next will be held in early 2021. The next will be held in early 2021. The next will be held in early 2021. The next will be held in early 2021. The next will be held in early 2021. The next will be held in early 2021.The next will be held in early 2021. The next will be held in early 2021. The next will be held in early 2021. The next will be held in early 2021. The next will be held in early 2021. The next will be held in early 2021. The next will be held in early 2021. The next will be", "The next Biennial should be held in 2022. The concept behind the organization is to create a platform for artists who are facing challenges in their careers and are discussing their experiences. The biennial will be free for the public and will consist of a series of lectures and performances that combine photography, video, performance, performance, and painting. The biennial will include the exhibition “Spaces of Gold: Photography in the Eighteenth Century” (2017) and “The Catalogue of Objections: Modernist Expressionism” (2007–2008). The exhibition will take the form of a series of drawings and paintings, which will be exhibited at different point of the biennial. The founding of the Biennial was inspired by the work of artists such as Georges Seurat and Pierre-Auguste Renoir. In a book published by the French artist in 1923, he wrote: “I have always believed that the most important tasks in painting are to rescue the work from its dependence on light and to divert it from its spiral path.” The first biennial, held at the National Gallery in London in 1930, was followed by a more recent exhibition at the Metropolitan Museum of Art in New York in 2001 and a retrospective", "The next Biennial should explore how the production of poetry, painting, and sculpture becomes an instrument of social transformation, and, perhaps most importantly, how this fusion of aesthetics and social practice can become a vehicle for radical political action. In the meantime, the exhibition and the biennial will commemorate the artists who have made the greatest contribution to our understanding of the ideas and the work of the past. The Biennial will take place in the Heart of Stockholm’s Århus Museum and will run from March 19 to April 8.\n\n\nThe Aladdin Museum in London has received a gift of two hundred works by the late Nigerian artist Ntokozo Qwabe (1928–2010), who was known for his conceptual art and experimental performance. The gift includes several early works, including two works by Qwabe’s sister, Mabia Qwabe, that were part of the Aladdin’s reopening project at the Museum of London in September 2019. Together, these works represent a major milestone in the artist’s nearly seventy-year career.The $3 million gift—which also included fifteen pieces by Qwabe’s son, Afa Qwabe, and a larger", "The next Biennial should be held in the autumn of 2020, with a 2019 edition to follow - the 2019 show will be the last. The 2020 edition will be dedicated to the life and work of the late artist-in-residence São Paulo Báez, with a view to exploring the impact of micro-artists, including Pierre-Auguste Renoir and Pierre-Auguste Pereira, on contemporary art.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has published a proposed budget for the 2020 fiscal year, which would see an estimated $14 billion allocated to the arts and cultural sector. Titled 'City Culture Budget 2020', the document outlines a $5.8 billion city-wide arts and culture program. The proposal is part of Mayor Bill de Blasio’s plan to reduce the city’s budget by $2.1 billion, which he claims will help the arts by eliminating the $1.1 billion in unfunded liabilities associated with the 2010 pandemic.“The cultural sector contributes more than $7 billion annually to the local economy and supports more than 1.8 million jobs in New York City, generating $872 million in economic activity for the city and region each year, and", "The next Biennial should begin in 2020. The organisation has named Hannah Taggart as its first curator. She will be based in New York and will receive $10,000 for the initiative. The five-week event, titled “Hannah’s Rise,” will take place at the Museum of Modern Art in Boston from March 11 to March 18 and will feature works by thirty-four artists. Its next major exhibition, “Between the Sun and the Moon,” will open in the fall of 2020.\n\n\nThe National Gallery of Art in Washington, DC, is planning to build a new $55 million, 200,000-square-foot exhibition space in its historic building, which dates to 1889, in a major renovation of its existing space. The project, titled “Hannah’s Rise,” will replace the current exhibition space and will involve the construction of a new visitor entrance and lobby, a café, and a restored eighteenth-century stone mansion.“This is a transformative moment for the National Gallery of Art, and for America,” Nari Ward, the museum’s director, said. “We are excited to build on the collaborative spirit, aesthetic sensibility,", "The next Biennial should take place in the city in 2021, but the timeline has yet to be decided.\n\n\nThe Museum of Modern Art (MoMA) has released the list of seventy artists who will participate in the second edition of the Grand Central, “The Future Is Now,” at the Museum's headquarters in the Manhattan borough of New York, in 2020. Each artist will receive one hundred grand prizes. The works of twenty-five artists will be on display during the exhibition, titled “The Future Is Present,” which will run the museums of St. Louis, Miami, and New Orleans.“Grand Central is a unique stage for the creative process and we are excited to work with twenty-six of the artists whose work will be on view,” said Peter Schäfer, the museum’s director. “The show will be a rich survey of the exhibition’s history, reflecting the breadth of the MoMA collection. Our curators will create a new narrative of what art might be in the future and how art relates to our world today, as we continue to iterate on the exhibition’s themes of sustainability and the problems of art in an increasingly digital world.”The seventy", "The next Biennial should be held in 2020 and the first in 2021. In a statement, the institution said: “We are grateful for the support of our artists, donors, and friends in the immediate and extended communities of Los Angeles and the Bay Area who have been so kind and generous in helping us realize this vision.”The biennial was created in part by the biennial’s founder, William Greaves, a former staff artist at the Museum of Contemporary Art (MoCA), where he was a curatorial assistant, in collaboration with Alison Wilk, curator and founder of the Upright Citizens Brigade, and Valentina Zagaudo, artistic directors of the biennial. In a that same year, the Museum of Contemporary Art (MoCA) commissioned artist Selena Gomez to create a new work. The work, titled “Art in Exile,” was initially displayed in “The Art of Cruelty,” a three-part exhibition at the museum that also included “Diana Al-Hadid,” as well as “The Skinny,” a four-hour documentary that dramatized the life of a homeless Mexican American family in Los Angeles.In 2012, the Bi", "The next Biennial should also consider moving the event to a location where it can be held on an annual basis.  According to the Art Newspaper, the museum’s current exhibition space, on the ground floor of the Art Institute of Chicago, is already undergoing a $50,000 expansion, and the museum anticipates that the renovation of the building will result in a more acreage for the exhibition. The renovation of the museum, which was completed in 2017, is estimated at $175 million. In a statement released by the museum, the next edition of the Biennial will engage with the themes of climate change, social inequities, and distributed power, and will feature a selection of works by twenty-three artists. The artists chosen for the exhibition include Ardeshir Kaur, Ranjeet Bhalla, Anna Atkins, Alessia Carne, Eleanor Cooper, Eric Fischl, Alex Lawrenson, Elizabeth Luckett-Harris, David McManemy, and Pia Camil. The theme Biennial 2 will be “Collectivism and Climate Change” and will feature works by artists such as Alberto Barroso, Alberto Campanella, and N", "The next Biennial should be held in 2022 and will introduce a new programme of exhibitions and research on the life and works of the late Italian architect and thinker HEMA master Benito Cervino. The exhibition will follow a theme of constructing the body and will focus on Cervino’s work in the last decades of the twentieth century.“The Art of the Body: Benito Cervino, 1920–1970,” will be presented by the architect in collaboration with an international group of curators, art historians, anthropologists, and physical anthropologists, whose work will be curated by Cervino’s son, Benito Cervino 2, and his collaborators. The exhibition will focus on creating an interdisciplinary space for the artist, who lived and worked in Rome, to stimulate and expand our understanding of the body and art.\n\n\nThe Museum of Modern Art (MoMA) in New York has announced that it is launching an online viewing room for its twenty-third edition next month. The two-day exhibition, titled “Theaters of Resistance,” will be held at “MoMA’s Brooklyn Museum’s Brooklyn Science Center,” as part of a larger reinvention of the", "The next Biennial should be staged in the summer of 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is preparing to welcome visitors back to the institution for a second season of the exhibition, “California: A Retrospective,” which will focus on the state’s history from its inhabitants’ perspective. The exhibition will be curated by Naima J. Keith and will open on January 11, 2021.The first exhibition, “California: A Retrospective,” was organized by the Japanese curator Masayoshi Tamura and premiered at the Japan pavilion at the Venice Biennale in 1972. The exhibition was created by figures associated with California’s Bay Area, including the sculptor Isamu Noguchi and the journalist Hubert Herlin.The theme for “California: A Retrospective” is “California as a Land of Rebellion,” a work by the artist Paul Shirley. In the exhibition, which will feature works by twenty-six artists, Shirley will present works by artists such as Ralph Ellison, Franz Josef Kohn, and Peter Orundari. “California: A Retrospective” will run from January 11 to January 18, 2021", "The next Biennial should be held in December 2020. The museum had originally planned to begin the exhibition in April 2021. The museum has also been working on revamping and expanding its existing building, which opened to the public in 2016 and has since seen a number of significant events. The new building will be 40 percent more compact, with fewer spaces for exhibitions and collections, and will boast a 1,400-seat auditorium. The renovation is expected to be completed in 2021. The overhaul will also involve the elimination of the museum’s existing building and will entail the construction of three new buildings in the museum’s campus: a museum for contemporary art, a science center, and a venue for educational activities.\n\n\nAn eighteen-foot-tall statue of Edward Colston, a slave trader and wealthy benefactor, which has stood in the British Museum in London for eighty years, was toppled by workers in the building’s basement in Rome on Monday, the third act in the three-year-long drama that is the museum’s long-running renovation cycle. The fall was captured on film by the late director Ken Russell and quickly circulated on social media.“The Colston statue was installed in 1987 to commemorate", "The next Biennial should take place in 2021 and will be curated by CAAAM, as part of a new partnership between the London-based arts organization and the National Galleries of Scotland. The new format will consist of a larger-scale version of the Scottish National Portrait Gallery, which opened in the Scottish National Museum in Glasgow in 2008 and moved to the National Museum of Scotland in Edinburgh in 2012.“After a thorough search of the relevant contemporary artists and their communities, the panel included four artists whose practice is particularly relevant to contemporary art in the UK: Richard Anuszkiewicz, Katerina Bosworth, Lisa Hayek, and Geremy Sarr. The new platform will provide a platform for a wide range of artists to collaborate and organize to expand our understanding of the creative process and the role of art in our society,” said Peter Travers, director of the National Galleries of Scotland. For the first biennial, the show will present twenty-six exhibitions, including four new works by British artists of Asian descent (including Kamel Ahmed, Yoko Ono, and Adriana Varejão), and will feature work by artist-activists Mumtaz Qureshi and Pia Camilano", "The next Biennial should mark the thirtieth anniversary of the first exhibition in the series, “The Omnidisciplinary Dream: Art & Design in the Early 1980s”\u0097a show that showcased pioneering work by a small group of artists in the early 1980s. The event will draw from the works of all fifteen artists represented in the exhibition. \n\n\nThe museum’s collection of Joan Miró’s photographs has been given a major overhaul. Titled “Diane,” the show will focus on “the photographic composition of Diane Arbus,” a legendary American painter who has been largely neglected in the United States since her death in 1985. The overhaul began in the 1970s, when Miró was still a student at the University of California, Los Angeles, and curated an exhibition of earlier photographs in 1977. The exhibition, titled “The Future Was Present,” featured thirty-five photographs, including the first of the Modernists, Robert Irwin, who was one of the first contemporary painters to be recognized with a master’s degree. It also introduced the vernacular to a new generation of painters, including Pierre Cardin, Richard Anuszkiewicz, Martha", "The next Biennial should be held in 2021 and the first in 2022. The 2013 edition, titled Art at the Movement, was organized by the Centre d'études de Paris and took place in the city of Paris. In the earlier exhibition, Art at the Movement, minimalist artist Artmi Thapa and his contemporary duo Raffaello Pindell and Mario Trontera presented forty paintings and sculptures in a series, based on a theme of movement, which was inspired by the work of René Magritte, inspired by the work of Rirerna Vincent, and involving the artist's own experiences. The theme of the exhibition was “Existence as a Moving Image.”In the intervening years, Hilmar Voss, the curator-in-chief of the Centre d’études de Paris, has become a friend, a mentor, and a champion of the artist-run practice. He has organized numerous exhibitions at the museum, including “In a Time of Change” (2014) and “Movement” (2018), and served as the show-runner for the biennial “10 Years of Movements” (2012), which also featured", "The next Biennial should kick off in 2022 and be centered on the themes of memory, art, and how the body and the environment interact. It should also incorporate scholarship and advocacy from a group of thirty-five artists, including Monica Budde, Patricia King, and James Turrell. \"I am honored to be organizing this unique event that draws from a visionary team’s collection of visionary artists, and where I am inspired daily by the imagination and spirit of our international community,” said master curator Kiney Ooi, who curated the inaugural MAKERS’ Viewing Room in Hong Kong. The next iteration of the SEPTA Biennial is scheduled to take place at the Museum of Fine Arts (MoMA), New York, and will run from March 9 to March 11, 2021.\n\n\nThe Museum of Fine Arts (MoMA) in New York is preparing to welcome visitors back to the institution in 2021 as part of a $450 million expansion, dubbed the MOCA New York, that will also include the construction of a new 400,000-square-foot auditorium and a new national gallery. The expansion is one of several capital projects that the institution is undertaking to address its current financial", "The next Biennial should be held in 2020. The theme of the upcoming event is “Theatre of Cruelty . . .”The current exhibition, “Theater of Creation,” opened on September 11, 2020. It will continue to be staged in the United States until 2021, and the Biennial will take up themes from various historical, spiritual, and cultural traditions throughout history. The 2019 edition featured work by seventy artists, including Alison Gillick, Ariana Pape, and Adrienne Edwards.\n\n\nThe Dutch government has approved a new law that will allow the Dutch artist Holger Vermeer to permanently close his studio in the city of Amsterdam and return to the Netherlands, a move that will also allow him to create works that are free to the public. The work is part of a project to open up museums and other public spaces in the Netherlands by 2020, and is part of a larger campaign to encourage the Netherlands to become a major arts exporter.Esther Hofmann, who launched the Dutch artist’s studio in the 1990s and became a major cultural influence in his own country, told the Art Newspaper that the new law, which was passed on Wednesday, is a “milestone.” ", "The next Biennial should be in 2021, with the inaugural exhibition taking place in Maida Vale, Brazil, in 2019; the second in Las Vegas in 2021; and the third in New York in 2021. The designers and curators behind the inaugural show, as well as the three scheduled exhibitions in 2021, are organizing a special exhibition for Brazil, entitled “Diaspora: The New World.” The exhibition will be organized in collaboration with the School of Oriental and African Studies, the University of Sydney, and the Art Institute of Chicago.“Precision Design and the World We Live In” will open at Design Museum Melbourne on August 27 and will run until November 6. The opening of the exhibition coincides with the opening of “Art and Design” at the Art Institute of Chicago. The show will focus on the history and development of modern art, art history and design, and the role of design in contemporary life.  This year’s edition of Art Basel Melbourne was marred by a fire which broke out in a three-story glass-walled space in the exhibition’s underground complex on January 12. The fire, which was extinguished by fire workers on January 13, is still under investigation.", "The next Biennial should take place in the city at some point between the summer of 2021 and the fall 2021, and ideally will be held in the city itself. The third and final Dakshina Biennial will be held in the city in the spring of 2022. The biennial will be led by artist-in-residence Pinchat Jamangart and will focus on the history of Navajo art in the United States.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles has announced that it is planning to open a new twenty-seven-thousand-square-foot, expanded version of its Museum of Contemporary Art (MCA) on the northwest corner of Twenty-Third and Twenty-Fourth Streets in the city on September 3. The museum will be housed in an updated, glass-enclosed building designed by the same firm that designed the former site of the new museum, and will be inaugurated by artists such as John Abraham, Julie Jordan, and Michael Applebaum.The new space will be called the MCA Contemporary, and will offer a museum-like experience that will include contemporary art exhibitions, classes, and other programming. The museum will also include a rooftop terrace and movable gallery.“The M", "The next Biennial should be held in 2020.\n\n\nThe Museum of the City of New York (MOC) announced today that it will work with New York–based artist and educator Matthew Steiner to create a new five-month, 100,000-piece retrospective of the artist’s work, Identity, at the institution. Steiner’s exhibition, which will be staged in the MOC’s new $10 million, forty-seat theater, is slated to open in November 2020.“Steiner’s work comes at a pivotal time for the history of art, as many cultural institutions struggle to reconcile the current political climate with their initial visions for the future of art,” said Stephen Davis, director and CEO of MOC, which was founded by descendants of the late sculptor Eugene and Otto Stern. “We are thrilled to collaborate with Steiner and his creative team to honor Eugene and Otto’s legacy and to create a new exhibition dedicated to their work in November 2020.”The new exhibition will be titled “Eugene and Otto Stern: Identity” and will feature works by fifty artists and will feature a selection of fifty of Steiner’s works over a twenty-", "The next Biennial should take place in the spring of 2021, with a date to be announced in the summer of 2021. The event will provide an introduction to the exhibition and the exhibition’s installation. The theme of the twenty-ninth iteration of the exhibition “Classical Modernism” will be “The Birth of Modernism.” The exhibition will be curated by Andrea Mollino, Andrea Sposita, and Andrea Spinelli.The biennial will showcase the work of thirty-three artists in the exhibition, which will also include a presentation of the first solo exhibitions of the artists’ works in the United States in over forty years. The exhibition is organized as part of a major global campaign to bring contemporary art to the fore of the general public, an event that was launched by the New York City–based nonprofit Art for America, and the Rockefeller Center. The twenty-fifth edition of the exhibition will be held at the Art Institute of Chicago in October 2020. Additional programming is planned for the biennial, which will create a permanent home in the city as part of the city’s new $1.6 billion Metropolitan Museum of Art, and the upcoming edition of the exhibition, which will mark", "The next Biennial should take place in 2020 and will be hosted by the city of Munich.\n\n\nThe Centre Pompidou in Paris has announced that the center will hold an exhibition, “Snow or Spring,” in April 2020. The biennial will feature work from twenty-six artists and will feature work from seventy-three countries. The exhibition will be organized as follows:The exhibition is part of the Centre Pompidou’s ambitious expansion plan, which includes the construction of a new permanent collection in the city. The project also aims to become a major cultural destination in the capital. The Centre Pompidou has invited forty-one international artists to participate in the exhibition, which will be held in April.See more information about the future of the exhibition and its upcoming date here.\n\n\nThe Public Art Fund (P.A.F.) has received a $250,000 grant from the John D. and Catherine T. MacArthur Foundation. The $500,000 gift comes from the MacArthur Family Foundation, which was founded in 1999 by MacArthur heir Charles MacArthur and his wife, Patricia. The grant will support the development of two new projects, “The Impact of the Future on Art in the United", "The next Biennial should be held in October 2021.Art in Motion, the New York–based nonprofit, will organize the event. The organization will pay exhibitors up to $40,000 for a full season of programming, which will culminate with a grand finale event in March 2022. The deadline for participating artworks is June 1.\n\n\nThe New York Public Library (NYPL) has launched a new initiative that will provide free access to digitized collections starting in 2020. The initiative, dubbed the Digital Archive Initiative, will partner with the Brooklyn Museum, the Bronx Museum of the Arts, the Bronx Museum of the Queens, the Bronx Museum of the Arts, the Bronx Museum of the Moving, and the Bronx Museum of the Arts to digitize some 75,000 items from the collection. The initiative is part of the New York City budget, which was passed by the City Council in Councilman Jimmy Van Bramer’s legislature-approved $2.2 trillion budget for fiscal year 2020, and is part of Mayor Bill de Blasio’s comprehensive spending plan. Under the plan, the city will slash the budgets of the non-profit, artist-run libraries and arts agencies that receive city funding; implement a tax on", "The next Biennial should focus on experimentation with new and different materials, and its future exhibitions should incorporate contemporary art and non-traditional visual art. It should also adapt to the changing needs of the museum and the city, and show work by artists working in different regions of the world.”\n\n\nThe London-based, nonprofit, Museum of London Art (MoLA) has announced that the collection will center around some thirty thousand works of European art from the Tudor Revival to the present day. The institution will be anchored by an arm that will be tethered to London’s Metropolitan Museum of Art (MoMA), and will present the works in either a traditional stateroom or a contemporary setting.The institution will begin its redesign in 2020 with the restoration of the Tudor Revival building, which is currently slated to be demolished. The Tudor Revival Building, a Tudor Revival-era structure that is part of the ongoing redevelopment of London’s Tate Modern, is slated to be replaced by the new Tudor Revival building, which will boast 33,000 square feet of exhibition space, a restaurant, and the museum’s first permanent installation. “Tudor Revival has been a defining part of our history for", "The next Biennial should focus on the history of the exhibition and the institution, as well as the museum’s relationship with its local community. “The institutional memory is vital for the perpetuation of the institution’s reputation and for attracting new audiences,” said Manuela Fiorilli, chair of the Biennial Committee. “In an age when most museums are struggling to survive and adapt to changing conditions, it is essential that the Biennial be remembered and remembered well. We are convinced that this is the best way to introduce the Biennial to a wider audience, and to secure its future.”\n\n\nNew York’s Metropolitan Museum of Art has made several changes to its collection in recent years, including by bringing more works by artists who had completed their PhDs before the museum’s founding in 1853, and by donating works that had previously gone unpublished. In addition, the museum now has a dedicated research branch dedicated to Art and Art History, dedicated to art history scholars and art historians, and the museum will unveil the first phase of the inaugural exhibition, “Allometry.”The museum also announced that it is constructing a new twenty-five-thousand-square-foot gallery to house the", "The next Biennial should focus on the cultivation of interdisciplinary knowledge and the improvement of public understanding of contemporary art. This exhibition will provide a platform for reflection and reflection on the relationship between art and politics.”The 2019 iteration of Biennale Miami Beach, curated by Dimitri Martensi, was canceled due to the outbreak of the novel coronavirus. The venue had been planning to hold the event for a month.\n\n\nIn a major reshuffling of the visual arts field, more than half of the twenty-two galleries participating in the biennial’s 2019 edition, titled “Roots,” have announced their withdrawal from a running exhibition of artworks by artists from the same fifty-seven-year-old family, which is said to control the collection, and are considering whether to return to the event. The works impacted by the family are Nino and Antonio Bernabe, whose works are currently on display in the 2019 exhibition “The Rosy Triangle.” Nino Bernabe and Anthony Esposito’s work Roots, which will be on display in the exhibition “The Rosy Triangle,” will be discontinued in December. The exhibition is a follow-up", "The next Biennial should take place in late July or early August. The theme of the upcoming exhibition is “Work and the Biodiversity Crisis.” The exhibition will focus on biennials and their relationship to the current political and economic situation. The exhibition will be organized as follows: •Photo: Steven De Sousa THE BIRD Biennial is a biennial of contemporary art that aims to address and clarify the interconnections and interdependencies that exist between photography and contemporary art; to advance the understanding of photography’s role in the current political and cultural crisis; and to present the work of contemporary artists, including the work of Agnès Vigo, Christo, and Catherine Jonas.It will showcase around sixty artists that have participated in the exhibition, which was organized in collaboration with the Bertelsmans, Christo and Helle Thorpe, and the Hamburg Museum of Fine Arts, as well as three new works by Alfred Kupka and the artist Denis Menzel, whose work is currently on view in the exhibition “Fiction,” which is curated by Alfred Kupka and Klaus-Dieter Müller, and is due to open", "The next Biennial should take place in the spring of 2020.\n\n\nThe Acropolis Museum of the History of Art in Athens, has welcomed artist‐in-residence João Pape to its group exhibition program. Born in Brazil in 1941 and raised in the United States, Pape studied at the University of São Paulo, the State University of Rio Grande do Sul, and the University of New Mexico before moving to New York, where he graduated from the New School. The museum has been working with Pape in his research and development for the next three years and recently launched an online version of the biennial.“The future of art is an eternal question,” said Pape. “In our world where we live in a digitalized world, the very fabric of the world is at risk. The good news is that the crisis is reversible. The future of art is at the center of the crisis.” He added that the fight for digital rights is important not only for artists working in the digital era, but for the future of art itself.Pape has a long history of collaborations with the Acropolis, which he has curated since 2013. His first exhibition with the museum was “Pape New York: A", "The next Biennial should be held at the new venue in 2020, and the first exhibition should start in 2021. The Biennial’s next edition will also feature a new format centred around individual work. The new exhibition will focus on landscape, sculpture, performance, and installation, and will take place in a new location, the Motegi Art Museum.\n\n\nThe Italian artist Filippo Rava has been awarded the 2019–20 Leonardo DiCaprio Award for his work Starting from the Ground Up. In honor of his achievement, the Leonardo DiCaprio Foundation has commissioned him to create a work commemorating the artist’s life and achievements. Rava’s work, Starting from the Ground Up, is a tribute to DiCaprio that centers around his earliest works, which are in a series titled “Autobiographies.” The work reveals the artist’s lifelong devotion to his work, taking his early career as he describes it, and the life and work of the artist, who is best known for instilling a sense of community and solidarity among art-world professionals and artists.“This work is a way to remember young DiCaprio, who loved to help, and to recall his", "The next Biennial should be held in 2021, and the first in 2021 should be an exhibition of sixty-six works. The new format is a continuation of the team’s commitment to expand the exhibition and public's view of work through show-making. “There are certain categories of work that are so specific and so evocative for us that they are difficult to separate from our focus on radical self-empowerment,” said Fergus. “We are excited about the work being presented this fall and the opportunities it opens for artists. The Biennial will remain a vibrant beacon for contemporary art.”The full list of exhibitors is as follows:Art Museum ChicagoArt Institute of ChicagoArtadiaBancroft ArtsCenterBEC Museum/Bancroft CollectionBicentennial Bancroft BiennialBancroft Art MuseumBancroft Biennial Bancroft Art Museum (BAM)Bancroft Biennial (2019)Bancroft Contemporary Art MuseumBancroft Contemporary Art Museum (2016)Bancroft Contemporary Art Museum (2016)Bancroft Contemporary Art Museum (2016)Bancroft Contemporary Art Museum (2016)Bancroft", "The next Biennial should take place in the autumn of 2020.”The Biennial was established in 1975 as a means to address the country’s growing homelessness crisis. The event was then moved to a larger venue in the city of Cardiff, which has a population of around 9.5 million people, before its first iteration in the city in 2009. While the event has been held in the United Kingdom’s capital many times since, it only recently gained wider attention following the 2016 Uprising in Wales, which was sparked by the British government’s decision to leave the European Union.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles has announced that it is preparing to reopen to the public in mid-March. The announcement follows the 2016 reopening of MoCA’s sister institution, the Los Angeles County Museum of Art (LACMA), which marked its reopening on March 8. The reopening of the two institutions coincided with the annual March 21–March 24 weekend crowds, which make up the third largest weekendender in the United States.The institution has also announced that it will begin welcoming visitors back to the museum on March 16, and will begin charging visitors admission in March. However, admission will remain free through", "The next Biennial should be held at the French Embassy in London in May 2021 and will be inaugurated by the painting of the bronze statue of Edward Colston, the twentieth-century artist who was put to death for his subversive political activism. The exhibit, entitled 'The Death of Ed and Eddney', will be on view until March 21, 2021.\n\n\nThe Museum of Modern Art (MoMA) in New York has launched a new international platform that will allow artists and collectors worldwide to connect and share data and ideas. Called the Artist Platform, the initiative was established to provide a platform for artists by providing an online platform where they can share their work as well as receive financial support from donors and artists.The platform will have a database of more than six thousand contemporary art works and will present artists' experiences from UCCA, the Center for Contemporary Art Research, and other platforms that will include a quarterly exhibition and monthly book club. The platform will also be used by artists to bring their works to life, such as in the film Se7en, which was shot in the studio and premiered at the Museum of Modern Art in 2014.The platform will provide artists with tools to visualize their work and will serve as an open platform for creators and will present", "The next Biennial should be held in 2020. \n\n\nMore than 1,400 artists and academics are setting up a fund to help New York City recover from the coronavirus. The initiative, dubbed \"Artists for All,\" is being organized by the nonprofit organization Artists United for CUT (AVIC), a coalition of fifty-four artists and collectives, including the Avant Garde Alliance, the Brooklyn Museum, the Bronx Museum of the Arts, the Bronx Science Center, the Bronx Museum of the Arts, the Bronx Museum of the Arts, and the Bronx Museum of the Arts.The fund will be given to artists who live in New York City and is being organized as follows:1. For each of the fifty-four boroughs of New York City, an amount of $10,000 will be allocated to support artists who are facing financial hardships from Covid-19. The fund will be available to any artist facing financial hardships from Covid-19 who is present in the United States. 2. The fund is available to New York City residents only. If a non-resident artist is facing financial hardships in another state, they may apply here. 3. The fund is available to artists for any", "The next Biennial should take place in 2022, no sooner than that. The first iteration will be organized by the University of Amsterdam, and will be hosted by the university in partnership with the city of Amsterdam. The exhibition will include more than 3,500 artworks by artists from twenty-six countries and twenty-plus regions.The initiative was inspired by the following question: “Where does art and design come from? Does it come from the landscape, from the water, or from the soul?” With the assistance of artist-researcher Zakiya Adham, the city of Amsterdam created a new exhibition aimed at exploring this question through the work of twelve artists. The project was funded by the Dutch Culture Fund and the city of Amsterdam. The exhibition will be held at the Biennial on “Digital Art” until 2020.\n\n\n\n\n\nArt historian and advocate Hui Huan has been named director of the Hong Kong International Art Museum (HKIM) in Hong Kong. The Hong Kong branch of the Museum of Modern Art (MoMA) in New York, which recently announced it would be reborn as the HKIM Oyster Bar & Grill, has been working to move forward with a reopening date since August 2019", "The next Biennial should be held at the Royal Academy of Arts, London, as well as at the Museum of Modern Art, New York (MMOM), which is currently closed until further notice. The biennial’s director, Lévy Gorvy, said that the exhibition will “situate the artists at the center of their own history in a new context” and will focus on themes of the current moment, “to the point of articulating themes of the past.”The seventy-fourth edition of the Taormina Biennial, which will be held in the Italian town in the spring of 2021, will be held at the Vino Arti in Vino, Milan, from April 4–April 7, 2021. \n\n\nThe New York City Department of Cultural Affairs (DCLA) has announced that it plans to remove five works by New York–based artist Adam D. Epstein, whose large-scale installations of geometric geometric structures and landscape features often utilize elements from everyday objects, including tables, chairs, bicycles, and other household items.According to the New York Times, the Department of Cultural Affairs agency found no evidence that Epstein had intentionally caused harm or was in violation of a local, state, or federal", "The next Biennial should take place in the spring of 2021, and the last in the autumn of 2022. Dissent will be expressed in all of its varied and emphatic forms, as it has been in the past. For the past two decades, Biennials have been engaged in a seemingly constant creative dialogue with each other and with the world at large, growing in their knowledge of each other and of the world around them through a period of intense reflection and collective growth. We hope that this latest opportunity will include this historical voyage in a meaningful way. Art is not just an invention. It is a process, a way of life, a means of belonging. We would like to thank our organizers for granting us this chance and for our vision for the future. We are also grateful to our readers for giving us their support and for their inspiring words in support of our project. We hope that our work will inspire and delight you, and that we will be able to make a difference for your future. \n\n\nPeter Könitz, a German painter who experimented with many media and unique lighting and focal points in his installations and portraits, has won the Prix Pictet, which honors the work of three Germans: Karl Richter,"]