["The next Biennial should take place in 2020. “The exhibition was conceived as a fresh and new platform for the exhibition of contemporary art,” Ortega y Gasset said in a statement. “Its future will be determined by the global spirit of collaboration and collaboration between artists, audiences and institutions.”\n\n\nThe French Ministry of Culture has released a statement regarding the disappearance of Le Corbusier’s masterwork The Reproduction of Nature, an installation that was part of a series of sculptures made in the postwar and ’40s that were stolen from the Musée de l’Amitié-Soleil in Paris on Wednesday. The works, which were on display at the museum for the twentieth edition of the exhibition, were taken from the museum’s collection by three men on motorcycles in the early hours of Wednesday morning and are currently at the Paris Prosecutor’s Office. The theft sparked nationwide protests and demonstrations against the theft and the men who committed it, but none of the pieces were ever recovered. In a statement published by the ministry on Thursday, the ministry said that it had assessed the works and determined that the theft was carried out by two individuals. The thieves snatched the", "The next Biennial should be held in the first half of the twenty-first century.” The forum will be housed on the first floor of the Musée Renault-Aquitaine, and the exhibition will be divided into multiple sections by artist and curator. “Themes that are currently being explored are as diverse as the relationship between the body and the soul, the history of art and architecture, and the relationship between art and the environment,” said Eliseo Valceli, director of the Fondazione Ponte Vecchio. “The opening of this exhibition will allow France and all of the participating countries to witness the unique and complex history of the art created by these artists.”The exhibition will be organized as a “story-project,” and the inaugural exhibition will examine the relationship between the artist and the artist’s space and will feature works by thirty-six artists, including Joel Patze, the Portuguese painter who famously depicted a nude woman in his studio, in the city of Reggio Emilia, Italy, and Sidney Jack (who has an exhibition on the relationship between art and health on view in the same venue), the American artist whose paintings were", "The next Biennial should be held in the spring of 2021. If all goes to plan, the theme of the next edition should be: “What this world needs, what it cannot provide,” and the main artist will be Fernando Pérez-Villar (1905–1972). Given the current situation, the biennial is asking that the public show their support by sharing the facebook post of the artist who recently created a work that investigates the meaning of life in a troubled and brutal world.\n\n\nComposition artist Mihai Kayode, whose luminous paintings and drawings became a central part of the trans-Atlantic visual-art scene as well as an influential guide to the postwar Miro Group, has died at the age of ninety-one at his home in Brussels. Kayode was born in Kiassel, Germany, on December 3, 1925, in the city of Kiel. He was a native of the town, where he attended an early age began his career as a painter. Kayode later moved to Brussels, where he studied at the Kunstakademie before enrolling in the University of Leipzig, where he studied with Karl Pols, Bernd and Georg Wilhelm Olszewski, and", "The next Biennial should take place in Helsinki in 2021. \n\n\nThe Museum of Modern Art (MoMA) in New York plans to close its five-story, glass-walled museum in December due to a lack of funds. The decision has delayed the opening of the institution’s next major figure exhibition, “The Run of His Life,” which will open in January 2022.The museum, located at 1225 West Twenty-Fourth Street, was established in 1964 by architect and steel producer Robert Moses. The exhibition will feature work by seventy-five artists and will also introduce carny events, performances, and other programming in an attempt to draw attention to the artist’s philosophy on energy and the environment. In addition, the museum will feature original works by twenty-seven artists, including John Cage, François Truffaut, Frank Gehry, and Jean Luc Richard-Holmgren.“The Run of His Life’ is a major milestone in MoMA’s history, and a momentous occasion for the arts,” said MoMA director Meredith Rosenblum. “We’re working hard to secure an October opening for the program and are evaluating all options with our board and management team", "The next Biennial should take place in 2020 and will be hosted by the Künstlerhaus in Cologne. This year’s edition will be the first in the city of Manchuria, where the exhibition will take place from November 5 to November 6, 2020.The 2018 edition of the biennial, held in Nagoya, Japan, featured work by thirty-four artists and was curated by Vice Chairman and CEO of Künstlerhaus Wolfgang Welle.\n\n\nThe Los Angeles County Museum of Art (LACMA) has received a $1.5 million donation from Mark Zuckerberg. The Silicon Valley titan announced the gift in a post on Facebook on Tuesday, September 8, and praised the institution’s record of supporting works of art in the city for two decades.LACMA director Marc Straus announced the donation in a post on the institution’s website, where he wrote that the donation “offers a rare opportunity to invest in the future of Los Angeles.”In addition to Zuckerberg, the institution received $1.2 million from David and Jonathan Adelson, the owners of online auction house Bonhams, who pledged $1 million in support of the museum. The donation includes", "The next Biennial should take place in 2021 and will start with artworks by twenty-nine artists.\n\n\nThe Kodak Company in Rochester, Michigan, has received a $200,000 donation from the Rockefeller Brothers Fund, which also committed $100,000 to the Rochester Art Museum (RAM), the Watershed Art Museum, the Library of Congress, and the American Civil Liberties Union (ACLU). The funds will go toward the purchase of fifteen works by the late American artist Mary Boone, including Herself and the Slant of a Wing, Toledo Mound, 2014, a collaboration with William Eggleston, and The Dreamer, a work for which Boone wrote the foreword.“We are thrilled that the Rockefeller Brothers Fund has recognized and supported the unique work of Mary Boone,” said Peter Rockefeller, chairman of the family. “Her career encompassed both poetry and painting, and her work is deeply rooted in both the avant-garde and the mainstream. It is a great honor to welcome the tenacity and the passion of the Rockefeller Brothers Fund to the Kodak family.”The organization will donate 15 percent of the proceeds from the sale of Boone’s works, which", "The next Biennial should be held at the New Museum in New York in 2021.   The Biennial will have a maximum of twelve artists representing seventeen countries, including the United Kingdom, Austria, Belgium, France, Italy, Spain, the Netherlands, and the United States.\n\n\nThe National Gallery of Art in Washington, DC, has reaffirmed its commitment to the eventual ground-breaking exhibition, “Theißische Bildung,” which will take place in the United States in October. The center was accused of supporting the Dakota Access Pipeline, the massive construction project that would transport US$3.8 billion of crude oil from North Dakota to Illinois, and of facilitating the spread of the coronavirus.The institution eventually relented and decided to cancel the exhibition, which was to have been hosted at the National Museum of African Art and the Smithsonian American Art Museum in Washington, DC. The move drew the ire of environmental activists who felt the institution was allowing the construction of a new $2.5 billion oil refineries in the United States, which would exacerbate climate change.“We welcome and support the National Gallery of Art’s decision to make this difficult decision, but we also recognize the critical importance of the Ai", "The next Biennial should be held in 2021. The bidding committee comprised Domenico Cipolletta, director of the Pieroglia di Rivoli; Francesco Cipolletta, director of the Cultural Center of the Academy of Trieste; Antonio Ciro, current president of the Guggenheim Museum; and Cate Blavatnik, director of the Zagreb Museum of Art.Commenting on the biannual, Florence-based curator and critic Anna Ioffe said: “I am very much looking forward to the next one. I am eager to see how the themes of the next two years will continue to be pursued through a new generation of artists. I am looking forward to seeing what works can be made in this kind of a space. The new Biennial will in future constitute the great source of inspiration for future generations. . . . I am very much looking forward to the next one. I am eager to see how the themes of the next two years will continue to be pursued through a new generation of artists. I am looking forward to seeing what works can be made in this kind of a space. The new Biennial will in future constitute the great source of inspiration for future generations. . . .", "The next Biennial should be presented by the museum in January 2020. At the event, the institution will present a selection of works by fifty-three artists in a similar way to the previous three editions of the exhibition, but this time around the works will be selected by the institution and not the artist. The first exhibition, titled “The Black Triangle” (2017–18), was organized by the Black Rock Art Museum in Nevada. The second exhibition, titled “The Ragged Edge” (2019), will take up a theme of the recent crises in the Middle East and Africa. The next edition of the show will be held at the Kunsthalle Basel in Switzerland and will run from February 21 to February 27, 2020. \n\n\nThe German state of North Rhine-Westphalia (NRW), which is currently facing a massive backlash over its decision to close down two museums in the state of Baden because of a spike in the coronavirus—the first closure since April 15, and the second since March 2—has announced that it plans to reopen the two museums only if the public pays a higher sum than it currently owes for the cost of the temporary closure. As the", "The next Biennial should feature contributions from artists from the African continent, the Caribbean, and Latin America. The first iteration of the 2020 event, titled “Feminin,” was held in Hong Kong in October 2019 and will air live on the biennial’s website and on PBS’s online video service, as well as on PBS’s website and on PBS’s website.The sixty-four-year-old artist—whose work tackles topics such as feminism, sexuality, and the body—has been a recipient of the National Medal of the Arts three times: In 1965, she was honored by President Lyndon B. Johnson for her lifetime achievement in bringing “the art of femininity” to the United States; in 1977, she was nominated for the National Medal of Arts for her lifetime achievement in staging a feminist art performance at the Detroit Institute of Arts. While a member of the group the Furies, Biennials, she began her trans-species performance, “Invisibility,” in 1961. Her performance, which featured the human and the plant, was inspired by the artist Fiona Wilke’s famous painting of a woman’s body and was shown at the 1969 Venice", "The next Biennial should be in December 2020, with a submission date of early 2021. The 2019 edition, entitled THE BIRTH OF THE NATIVE, was held at the Golub and Ballet theaters in Moscow and St. Petersburg.\n\n\n\n\n\nAlexandre Leclerc, a French artist known for his extensive body of work depicting human and animal forms, has died at age eighty-six. In an interview with Bertrand Tavernier in the May/June 2019 issue of the issue of the magazine Vogue, Leclerc said that his interest in the natural world began in a “carte de picturesque,” French for “in picturesque,” a term he coined after observing a show at the Surs, his Paris-based space, in 1911. Since the year ended, he has been producing works based on his initial concept, a six-by-eight-foot panel that depicts a human head and a horse. Leclerc’s sculptures are large-scale archival reconstructions of human remains, often using materials that were previously in storage, and sometimes feature the bodies of living people.Some of Leclerc’s most recent works are the Human Skin and Horses, 2019,", "The next Biennial should be set up in the same location, in the same building, and with the same title as the previous Biennial, with the same budget, and should be inaugurated by a speech by Louis-Xavier Huyghe. “The introduction of the exhibition ‘Out of the Abyss’ offers a new opportunity to present works by artists from a different kind of dimension, to open up a new space for their thinking,” said Huyghe. The Biennial is currently staged in the Formal Commission on Contemporary Art, the Parisian archipelago of six thousand photographic and video works by 20 artists. The lineup will be announced in November. \n\n\nThe Andy Warhol Foundation has announced that it will donate $50 million to the Andy Warhol Foundation for the Visual Arts (AWFA) to establish an endowment for the preservation and future care of the artist’s paintings. The gift is the latest in a series of donations made by the Andy Warhol Foundation since 1972.In a statement, the foundation said: “We are honored to receive this extraordinary gift from the Andy Warhol Foundation. This is the second year in a row that the works of Andy have been given the", "The next Biennial should be held in 2021. “The Biennial is a portmanteau of the words biennial and biennialism,” said Tsuda. “We have responded to this challenge by scaling back the exhibition program and by developing a new platform for exhibitions, and by rethinking the long-term vision of the Biennial.”The next edition of the Biennial will be hosted by the National Museum of Modern Art in Shanghai in 2021.\n\n\nAmerican artist and designer Frank Gehry is best known in the United States for his public works, such as the giant New York City extension of the Metropolitan Museum of Art in a design that integrates the museum into the city. Gehry also designed the Museum of Modern Art in New York, the Museum of Contemporary Art, Los Angeles, and the New Museum in New York, and the Museum of Modern Art in New York City. Gehry’s other major projects include the 1960 Olympic Stadium redevelopment project, the first major renovation of the Metropolitan Museum of Art in twenty years, and the refurbishment and expansion of the Whitney Museum of American Art in New York.In honor of his many achievements, Gehry is awarded the National Medal of Arts, which is given annually to", "The next Biennial should take place in 2022.\n\n\nThe Folger Museum of Art in New York has appointed Amy S. Oehler as its new director and CEO. Oehler comes to the museum from the Museum of Modern Art, where she has served as associate curator of photography since 2014. She succeeds Haim and Martha Folger, who retired in July 2019 after a decade with the institution.“We are thrilled to welcome Amy to the Folger,” said director Sarah Busch. “Amy’s extensive experience in museums and the museum business, coupled with her enthusiasm for bringing people together across genres and styles and her passion for supporting the creative life of the city, made her the perfect candidate to lead the museum’s photography department.”Commenting on her new role, the seventy-eight-year-old Oehler said: “The Folger’s photography department has been at the forefront of the art world’s shift towards digital and online to become a model for contemporary art, and I am honored to be a part of that journey. I’m excited to continue to develop the museum’s collection on the cutting edge of digital photography, and to share that expertise", "The next Biennial should be held in the spring of 2020.The first biennial, titled The Center of Living, was organized and curated by artist and scholar Harsha Bhatt. The second, titled The Diplomacy of Architecture, was curated by the architect and curator Alexander Calder. The third and last exhibition was titled Lunar Architecture and the Universe, which was organized by Andreas Künstler and Kunstmann Reimer and took place in New York in 2009. The upcoming event, titled The Golden Age of Modernism, will be held at the George Brouwersʼs residence in Brussels from November 19 to November 21, 2020.\n\n\nIn a major development on Saturday, the United Kingdom voted to leave the European Union. The referendum result means that the United Kingdom will be leaving the European Union in March 2021, replacing the European Commission with a new, more powerful agency charged with negotiating its exit from the bloc. The government’s Brexit Secretary David Davis announced the decision in a televised speech, saying that the United Kingdom would leave the European Union “in its spirit, its intention, and its intention alone.” The move means that the United Kingdom will not participate in any future EU-wide meetings", "The next Biennial should be held at the reopening of the Elizabeth Tower, in Cambridge, in 2021. The proposals were published in the October 2017 issue of the Journal of the Royal Anthropological Institute:\nThe fifth edition of the Artforum in London will return in December 2020 with a selection of paintings by female artists during the Tudor and Stuart eras. The exhibition will also include a discussion on the cultural influence of Sir Clement of Alexandria on the art of the seventeenth-century.The biennial will feature twenty-four works of women artists, including Italian-born, London-based artist Anna-Lucia Cattelan, whose painters use charcoal and glass to create the unnervingly erotic. Cattelan’s self-taught technique demands precise attention to the details, such as the placement of the eyes and the proportions of her miniature paintings. In contrast to the gothic atmosphere associated with Gothic paintings through the seventeenth and eighteenth centuries, Cattelan’s paintings are now often seen as a kind of deluge, their beauty and their sensuality literally squirting forth from the canvas. “I love the fact that women artists are still being made to look like this,", "The next Biennial should be held in 2022 and will be hosted by the Art Museum in Los Angeles. \n\n\nThe British American Tobacco Museum (BAM), New York, has welcomed Galerie Géraldine Bickel to its staff. Bickel joins the museum from the Academy of Fine Arts, London, where she was the ‎Vice-Chair of the Board of Trustees. She will be responsible for overseeing the development and execution of a new American Tobacco product, the Bickel Bickel, and will take up the post June 5.“We are very excited to welcome Géraldine and are looking forward to working with her to ensure the museum’s future needs and our institution’s reputation for excellence are well positioned to receive the support and attention that BAM and the American Tobacco Museum deserve,” said museum director Hernán Díaz-Pérez. Galerie Bickel will work closely with the museum’s senior leadership and the museum’s Museum Curator, Anne-Marie Prince, to design a new American Tobacco product that will be accessible to both museumgoers and museum professionals. According to the New York Times, the Bic", "The next Biennial should be hosted at the Smithsonian American Art Museum, where it will kick off in 2021. The date of the next edition, 10–12 February, will be chosen by the commissioner from the following list: Kasper Koenig, Beth Kearns, Gerhard Richter, David Salle, Michael Sharp, Frida Kahlo, Agnes Martin, Barbara Kruger, Robert Irwin, Jane Fonda, Jean-Jacques Amis, and Frank Gehry. Nominated by five other artists, including Julie Mehretu, Philip Glass, and Terrance Mann, the eight shortlisted artists will form the seventy-ninth edition of the Art Basel Biennale, which will take place in December in Germany.\n\n\nThe museum’s existing collection was divided into three parts and displayed at the Massachusetts Museum of Art (MA), where it has been housed since 1957, and three new museums. The new institutions opened on January 16, 2020 and are being labeled the MASS MoMA® SculptureCenter, the Museum of Modern Art and the Museum of Modern Art, and the Art of the Future.“MA’s collection is an inspiring exhibition of work by some of the most innovative", "The next Biennial should focus on the history of dissent across the world and should be a platform for dialogue that is grounded in the richness of the human experience. The sixteenth exhibition will be a synthesis of contemporary art and philosophy, with the aim of answering the questions: how do we live together in harmony? What are the limits of our knowledge and imagination?  The theme of the twentieth Biennial will be the creative and the control of nature.”\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, has moved forward with its plans to close its doors for a fourth year to continue its work to rehabilitate the building and promote its collection. This year’s exhibition “Art in Motion: The Art of Deana Lawson,” curated by Arturo Guggenheim, is slated to reopen in December, 2020.“We have carefully considered how best to move forward with the exhibition as a public mission, as we continue to gather and present the very best work of contemporary art to the world.” Just prior to the show’s opening, the museum received a $50,000 donation from a private foundation. The gift was made by David and Linda R. Katz, the Katz Family", "The next Biennial should have been held over the weekend after the exhibition opened, and the organizers had already allocated two days for the event, although it is still possible that a third edition might have been held over the weekend as well. The organizers may also have been forced to postpone the event because of the coronavirus outbreak—last week, when the US Centers for Disease Control and Prevention (CDC) warned of a possible global health crisis due to the virus, the biennial was canceled.In an attempt to explain the postponement, the organizers wrote on Facebook that the event was “upended by the Covid-19 emergency.” They added: “We are committed to working with local communities, including those with the highest number of cases, in an effort to mitigate the coronavirus outbreak and keep the biennial moving.”The Boston-based arts organization the Boston Art Museum (BAM) also attempted to explain its decision to move the exhibition. “The Boston Art Museum is working with a team of external and internal experts to reassess our current exhibition programs and our future exhibitions,” the institution said in a statement on Tuesday. “We are open to a wide range of opinions but we believe the best way forward", "The next Biennial should take place in 2019, and a final exhibition will be organized in 2021. The selection committee will be chaired by Christine Anagnos, curator of photographs at the Musée d’Art Contemporain, and will consist of graphic artist Renaud Cico, curator of modernism and the contemporary art of the 20th century, and art historian Christopher Le Brun.\n\n\nThe museum has hired Katy Walker as its technical associate and chief curator. Walker will be responsible for developing and overseeing the museum’s programming, conceptual exploration, and exhibition design. Previously, she worked for the Getty in the Department of Photography and Sculpture, where she organized the visual arts and design program for the show “Beyond the Limits of Time” and helped shape the exhibition program of “Imagism: A Historical Overview” (2019).“Katy is an exciting addition to the Biennial team and we look forward to working with her to further the Biennial’s mission to further the work of our artists, curators, and staff with an exciting vision for the museum,” said Christopher Le Brun. “Katy is a multi-talented curator with an exceptional", "The next Biennial should take place in 2021, and the forty-fifth in 2024.\n\n\nThe Metropolitan Museum of Art in New York City has announced that it will begin accepting visitors no later than March 22. The institution, which has yet to announce an opening date for its first season of the new exhibition series “Persons of an Unlike Mind,” will focus on the work of women artists and is slated to run from March 16 to March 21, 2020. While the museum has previously committed to hosting multiple exhibitions at once, it has not specified when the series will run as it has not yet determined a specific date for the debut of the work. The performance-art museum will be housed in the former Great Hall of the Metropolitan Museum, which the Met has been renovating since 2014. The renovation project, called the Centerpiece, is part of the museum’s reimagining of its space in the city. The renovation, which was completed in March 2019, involved the construction of new galleries, restrooms, a restaurant, and classrooms to accommodate the increasing number of exhibitions. The renovation is part of the acquisition of the artworks from the Sotheby’s private collection in 2016, and the new exhibition program is named for", "The next Biennial should open in the summer of 2021. The Palace Museum of Fine Arts, Abu Dhabi, has announced its participation in the twenty-third edition of the forthcoming biennial, which will be held at the Abu Dhabi Museum, the AlUla Museum of Art, and the Dubai Art Museum from February 8–March 3, 2022. The exhibition will be curated by Lina M. AlMorris and will feature around eighty works, including Peter Faber’s The Adoration of Evil (2017), which explores the allegories of the body and the self through a series of drawings; Shiasat, a celebration of the Arabic Nights; The Red Silver Temple, a meditation on the Gulf; and The Book of the Dead, a group exhibition for female artists.The art of the Arabian Peninsula is represented by AlUla Workhouse, a contemporary art space in Abu Dhabi, and is represented by the Dubai Art Museum. AlUla also employs an artist-run space, AlUla Bazaar, and AlUla Gallery to showcase work by artists such as Hisham Haddara, Yassir Araeen, and Murad Manji.\n\n\nThe George R. Brown", "The next Biennial should bring together an interdisciplinary group of artists to explore the question of what it means to be human in the digital age. Awarded with a new prize, 'Avant Garde, Art and Innovation,' is also currently on view in the exhibition “Feminism and Technology” at the London Biennial in October.The six artists who will be honored this year are Lacie Menard, Leo Barlow, Melody Blum, Paola Carucci, and Lori Dury. The prize jury comprised artist and curator Ruth Armstrong, art historian and scholar Mary Beard, and film and television producer Sarah Cahn.“The Biennials’ theme this year is ‘the future of art.’ This is an important question for artists to consider as they consider their own future, and for the world as a whole,” said Menard. “I’m delighted to be able to present this year’s award to women at the Biennial, and it’s an inspiring opportunity to work with and with women artists in the biennial, especially in our exhibition format.”Another awardee is Taylor Mangan,", "The next Biennial should be there in 2022.  I think it will be a great success. I am very proud to be a part of the extraordinary team that is building the new Biennial to future generations. I am also proud to be a principal author of Thinking Across: Art and Public Policy in the Twenty-first Century (and Beyond) and to have helped shape the Biennial in ways that have made it a model for future programs. I hope this will serve as a catalyst for others to think about how we can apply contemporary art practices in a sustainable way. I want to thank Phil and the museum for their continued vision and leadership. I thank the committee for working with us to develop the Biennial. I thank the Board of Directors for their advice and for their continued support. I thank my colleagues and friends for listening to and supporting me throughout this process. I thank my staff and board for their dedication and professionalism. I thank my volunteers for their hard work and dedication. I thank the board for their thoughtful suggestions and comments, and for listening to them. I thank the audience for their affirmation of the vision and mission of the museum. I thank my colleagues and supporters for your", "The next Biennial should be held in 2021. The exhibition will begin with a presentation of the work of the late sculptor and activist Geroge and Ella Gartenfeld; a selection of paintings by the late artist Jean-Michel Basquiat; and a retrospective of the artist’s work from the late artist’s archive and will conclude with a public reception.The biennial was founded by the Gartenfeld family and their global art advocacy organization in 2009, and is funded by a grant from the Gartenfeld Foundation. Artforum was invited to present the first exhibition at the museum in 2013 and has remained true to the tradition. The institution opened its new 13,000-square-foot space in 2012.\n\n\nThe Leonardo and Ottavio da Nicolai Museum in Rome has received a gift of over two hundred photographs by Italian modernist Angelo Totti, a collector who made his name by creating works that challenged the boundaries of photography. The special collection includes photographs depicting a number of Leonardo’s early works, including St Margaret of Siena and The Last Supper, two paintings by the Italian artist-historian Cinzia Cattelan, and Ad Reinhardt’s", "The next Biennial should take place in the spring of 2021. Keith and Midge are still working on the logistics of moving a museum from its current location on the ground floor of the Art Institute of Chicago to a new building on the city’s South Side. Keith said: “When we finalize our design for the new museum, we will begin work in earnest, with a view to celebrating the history of the institution in 2020. We invite all to join us in this endeavor.”\n\n\nArtCenter Chicago has announced that it is working with the artist-run space Threshold Art and the Women’s March to increase the amount of time that artists in the city have to create works of art in order to promote social justice. The initiative, which is completely free to the public, aims to “advance social justice and the social well-being of Color’s communities,” said Andrew Klim, director of the city’s Department of Arts and Culture.“This year’s ArtCenter Chicago, which celebrates the labor and creativity of everyday life, has made a commitment to engage with and support artists from the art and creative economy in order to further social justice. We are", "The next Biennial should take place in 2020.The museum’s collection comprises over three hundred works from the American canon that are on display in its permanent collection galleries. The exhibition will include works originally presented in the exhibition “SOUTH BY ALBERT SANDMAN,” 1963–1963, and “FRONTAL PHOTOGRAPHY,” 1966–1966.\n\n\nThe Pulitzer Prize–winning arts critic William E. Price will become the first president of the Arts Media Fund. The fund was established by the Pulitzer Prize–winning publisher, the Pulitzer Committee, and the Pulitzer Producers to support critical, high-impact writing about arts and culture. The five-year award, which is given annually to a critic, will run through March 29, 2020, with the possibility of a fourth year for independent artistic endeavors. Price, who describes himself as a writer with a strong commitment to diversity of views and an uncommon ability to critically analyze and critique art, has served as the executive director of the arts media fund for twelve years. During his tenure, he was instrumental in the creation of the Arts Media Fund Art Critic Award, the Arts Media Fund Achievement Award, and the Arts Media Fund Award for Criticism. Price", "The next Biennial should be held in 2020, and the deadline for the exhibition is March 21, 2020. The exhibition will be hosted by the National Museum Prague and will run until March 26, 2020. The exhibition will feature twenty-five works by thirty-nine artists, including Anna-Sophia Fiore, Christina Nihl, Jakob Reitveld, Anna-Sophia Prusa, and Adam Saar.Tickets for the biennial are priced at CUS 149, CUS 149 & CUS 149, CUS 149 & CUS 151, CUS 151 & CUS 150, and CUS 150 & CUS 175. \n\n\nThe Christian Democratic Union (CDU), Germany’s largest Christian party, announced that it will field two candidates for the upcoming federal elections, after its leader, Norbert Hofer, withdrew from the race for chancellor on Wednesday and said he is likely to lose the closely watched contest.The party’s federal election campaign committee said that Hofer will meet with party members on Friday to discuss how he will face the challenges of reopening the economy following a major winter shutdown, an influx of refugees, and the threat of terrorism. Hofer is currently polling at around 12 percent,", "The next Biennial should be held at the Boston Art Museum (BAM) in Boston, which is currently closed until at least mid-March. The 2016 edition, titled From Impossible to Irresistible, explored the concept of a “super-human” and featured work by twenty-four artists. Artist Clementine Bègue has announced that she plans to move to the US from Paris, where she lives and works. “I feel a sense of responsibility to not only my family but the city of Paris,” Bègue said. “I have been thinking about this a lot. I pray every day to be able to go back to Paris and see the works of my great-grandmothers.”\n\n\nA group of artists and academics in the United States are protesting the Trump administration’s decision to withdraw from the Paris Agreement, which commits 195 nations to reducing emissions of greenhouse gases. “The Paris Trifecta was not only adopted to reduce dangerous global warming, but it is also the single largest act of kindness towards the planet,” reads a statement by the seventy-three signatories, which are all affiliated with the organization. “By refusing to ratify", "The next Biennial should be held in 2020. The exhibition will feature work by fifty-nine artists from twenty-four countries, including Germany, Italy, France, and the United Kingdom. The theme of the art will be “Living in transition” and will include the exhibition of work by artists from forty-four countries. Dieter Fitschen, director of the Kunsthalle Basel, told the Art Newspaper that the \"final touch\" of the opening of the exhibition was the introduction of the exhibition “The Body in Space” (pronounced “The Body in Space), a new collection of images and videos by artists from twenty-five countries, including China, Iran, and South Korea. “In the exhibition ‘The Body in Space’, the visitor will get a look inside the mind of a pioneer, an extraordinary artist, a pioneer of photography who is known for his complex, detailed, geometric paintings of the body,” Fitschen said.The exhibition will run from September 5 to September 8 at the Kunsthalle Basel Berlin.\n\n\nThe Los Angeles County Museum of Art (LACMA), which recently experienced a $100 million shortfall due to the coronavirus,", "The next Biennial should be held in 2020, and the first exhibition should be presented in 2022.\n\n\nThe Metropolitan Museum of Art in New York has appointed Laurentio Nanni as its next artistic director. Nanni comes to the institution from the Met, where he has served as artistic director since 2014. He succeeds Marc Straus, who departed in the summer of 2020 to head the Stedelijk Museum in Amsterdam.“We are thrilled to welcome Laurentio to the Metropolitan Museum of Art,” said director Ian H. Galloway. “He brings a wealth of experience and knowledge to the museum to complement Marc and build on the museum’s mission to provide a platform for contemporary art, as exemplified by the groundbreaking David Lewis/Lucy Carlisle exhibition, ‘In 2012,” and the collection of Paolo Baratta. He will also work closely with the museum’s advisory board and staff, and will be responsible for bringing the museum’s collection to the public through programming and exhibitions. Nanni’s first major artistic project is the exhibition “Happiness Is a Warm Gun: Reflections on a Modern Life of Joy,” which will open on October 29 and run through", "The next Biennial should take place in the summer of 2022 and will be held in the Washington, DC, area. \n\nOn Saturday, the Supreme Court upheld the convictions of eleven defendants in a case that dealt with a conspiracy between the New York City Department of Cultural Affairs and the Department of Homeland Security to secretly cordon off a gay bar in a gay bar in Manhattan in order to allow the Department of Homeland Security to install equipment at the bar in order to monitor patrons.David H. Koch, the billionaire oil and gas executive and the Koch brothers' political action committee, which are funding almost all of the court’s rulings, called the decision a victory for freedom of speech and a victory for America’s LGBTQ community. “This is a victory for the dignity and worth of every human being, a victory for real equality under the law, an idealized version of equality that has no place in a civil society,” Koch said in a statement.The defendants were convicted of one count of conspiracy to defraud the government and one count of criminal obstruction of justice stemming from a lawsuit filed by New York residents and businesses against the city of New York following a construction-related collapse at Broad and West Twenty-Second Streets in 2013. The", "The next Biennial should be held in the summer of 2021. It will also include a redesign of the museum, which will be made of more than one hundred thousand materials and will be divided into fourteen rooms. The redesigned building will be situated at the center of a larger complex that will house the collections and exhibitions of the deCordova Collection. The entire project will be financed with a $1.2 billion gift from the deCordova family. The deCordova Collection is valued at more than $2 billion.\n\n\nThe Museum of Modern Art (MoMA), the Museum of Modern Art (MoCA), and the Metropolitan Museum of Art have announced that they are working together to raise funds for a new center dedicated to the exhibition of contemporary art. The new $500 million institution, which will be situated on the third floor of an expanded, three-story building on West Twenty-Second Street in Manhattan, will be named for the late Italian architect, John and Maud Tiro, and will contain spaces for public programming and exhibitions, a collection, and a museum.“The Met is committed to supporting John and Maud Tiro’s vision for the new museum, and we’re working hard to establish the conditions for", "The next Biennial should be held in 2020, but the date has yet to be determined.\n\n\nThe Pérez Art Museum Miami (PAMM) and the Pagan Museum of Art in New York have opened their new digs in the city, which was forced to move its entire collection to a warehouse due to the Covid-19 pandemic last April, in an attempt to reduce the number of temporary workers required to run the museum’s various retail and service spaces.“We are committed to creating an environment that does not require the relocation of the Pérez Art Museum Miami or the PAMM at this time, but rather one that is sustainable and resilient,” said PAMM director Emily Eller. “Over the last ten years, we have worked tirelessly to reduce the opening and operating costs of our new buildings. Now, more than ever, we are excited to see how PAMM and PAMM Miami will complement each other’s existing collections, the Pérez Art Museum, and the new Pérez Museum of Art.”The expansion of the museum’s collection, which comprises more than 24,000 works, including new exhibitions and field trips, is part of", "The next Biennial should be held at least six months after the cancellation of the 2016 event, the LA Times reports. The festival, called the Biannual, will be centered around a collection of artworks by twelve artists, including Michael Duncan, Mohamed ElKhoury, and David Goldblatt. It will also feature performances, lectures, and residencies.  In the meantime, the Los Angeles County Museum of Art (LACMA) has named Christine Alsop the next president of the institution. Alsop will take up the post on January 22.During her tenure, Alsop will continue to work with the Los Angeles Community Art Museum (LACMA), which was created by L.A. County to administer tax-free status to cultural institutions in the county, including the Santa Anita Museum of Art and the Santa Monica Museum of Art, to develop new programming and to coordinate the city’s other cultural entities. She will also continue to serve as president of the Pasadena Museum of Art, and she will have the authority to appoint the museum’s board chair.“I’ve always believed in the power of art and artists to change lives for the better,” Alsop told the Los Angeles", "The next Biennial should be held in 2020. The show will then be held again in 2022. The 2020 exhibition, titled Ainu ano, or Life in All Things, will then be relocated to Tokyo. The 2019 exhibition, titled The Culture of the Time, will then be staged in 2022. The 2018 exhibition, titled The Dreamer in the Dream, will then be held in 2022. The 2020 exhibition is also being organized as a multi-disciplinary exploration into the concept of a future beyond and a history of art as an origins of dreams. The exhibition will feature works by thirty-five artists and will run for twelve weeks.  The 2020 exhibition is a joint venture between the Tokyo Metropolitan Government and the Metropolitan Museum of Art in New York. The 2019 show, titled Imagination, is a joint venture between the Japanese University of Foreign Studies and the Sangeaku Kei Museum in Saseyo.  The show will be on view until November 23. The 2020 show will be on view until December 13. The 2020 exhibition will be on view until January 14. The 2020 exhibition will be on view until January 14. The 2020 exhibition is being organized by the Tokyo", "The next Biennial should include a discussion of the future of art and culture in the twenty-first century, a reflection on the past and a reflection on the future. It should examine how the ongoing migrations of people, ideas, and materials from one land and another are shaping up to reshape the future directions of art and culture.”\n\n\nCenter for Contemporary Art (CCA) in Los Angeles has appointed Jason Mrazek as its new director. Mrazek was hired by the nonprofit organization in order to oversee a series of exhibitions that will take place in CA to this spring and will culminate in a retrospective of the contemporary artist’s work, titled “Jason Mrazek: A World Apart,” later this year. Mrazek will lead the CCA through the exhibition “Burnt Earth: Contemporary Art in the Making of David Gray” at the San Francisco Museum of Modern Art in March 2020. He will also serve as a consultant for the show.“Jason is a seasoned curator who has been involved in the Center for Contemporary Art for more than four decades, first as associate curator of art and culture and then as senior curator of photography and video,” said Brad Anderson, the C", "The next Biennial should be a retrospective of Akruf’s work at the Museum of Modern Art, New York, in 2020, and will be announced later this year.In the past few years, Akruf has become a key member of a group of artists whose work is regularly featured in exhibitions at major museums around the world. In 2020, her exhibition “Theater of Operations: The Gulf Wars 1991–2011” will be included in the upcoming “Art and War:” at the Palais de Tokyo and she will also appear in “Wanging in the Wind:” at the OMR in Seoul the week of April 9–10.The biennial, which will focus on “Theatre of Resistance,” will open with a performance by the Kuwaiti artist Khalid al-Shayk at AlUluf (AlUluf Museum), Kuwait, on February 18. The exhibition will visit artifacts from the contemporary Middle East and North Africa including an 18th-century mosque in Tripoli; the AlUluf Museum; and the AlUluf Museum in Egypt.\n\n\nThe Art Newspaper has revealed that the fourth edition of the 'Art Summit' will take place in Qatar", "The next Biennial should be curated by Julian Mallin, director of the Museum of Modern Art, New York. The museum is currently working on a new edition of Art in the Age of Mass Incarceration. Mallin told the New York Times: “I’m excited for the future of these artists, and their impact on public discourse. They have made important contributions to our understanding of the lives and art of the twentieth century but I want to honor their legacy in the most creative way possible.”The 2019 edition of Art in the Age of Mass Incarceration was originally slated to open on March 8, but was pushed back to March 14. The 2020 edition will be held March 12–March 14, 2020.\n\n\nThe Charlotte Museum of Art (CMA) in North Carolina is expanding its endowment to $250 million to increase its holdings of art by artists who have been incarcerated for nonviolent, non-violent crimes. In addition to revising the museum’s current endowment policy and creating sixteen new slots in its collection, the institution is reforming how it funds art. The museum’s previous policy, which was in place since 2013, charged participants $100 for each slot and no more than $", "The next Biennial should take place in 2020, and the first in 2022. \n\n\nSoraya Nadia Yamanan has been appointed director of the Metropolitan Museum of Art (MoMA), the Museum of Modern Art, and the Hirshhorn Museum. The new positions are part of the institution’s $3.6 billion expansion plan to include a new center for performance art and the Hirshhorn’s restoration of its 19th-century building. The design of the new three-story museum, built in a former textile factory in 2011, was led by architect Craig Sturtevant. Titled Phenomenal Encounter, the institution will house twenty galleries, a meeting room, and a theater. The center, which will employ over one thousand people, will be completed in 2022. “I’m so excited to be working with Craig Sturtevant and Michael Dolores to make Phenomenal Encounter an unforgettable experience for the thousands of visitors who will come here every year,” said Nadia. “This is an extraordinary opportunity to expand our mission to reflect and think about the most important art of our time, to change the way that people think about art and artmaking, and to", "The next Biennial should take place in 2022 and was scheduled for September. “The news is devastating,” said Nina Gallo, chair of the Arts Council of the Association of Independent Colleges of Art & Design. “The institution was working on a diverse collection with a rotating, rotating cast, and it was committed to transforming its landscape in a way that could strengthen and extend its relationship with the surrounding communities through scholarship and exhibitions. Our thoughts are with the students and community and their families.”In a statement, the Art Institute of Chicago said: “The Art Institute is aware of the sudden passing of artist and philanthropist William Wingate, and is in close communication with his family, who are devastated and distraught by the loss of a beloved son, a brother, and a friend. We extend our deepest condolences to the Wingates and will continue to support their work as they recover from this terrible accident. In the days ahead, we will continue to support William and his family through this difficult time.”\n\n\nOn Wednesday, New York State Governor Andrew Cuomo signed a law that will require major New York City construction companies to make at least 80 percent of their projects in the city of upstate New York renewable by 2025", "The next Biennial should focus on “Theoretical Marxism,” the German philosopher-artist Herbert Albrecht’s 1978 exhibition at Berlin’s Haus der Kunst, which opened the door to new and radical forms of Marxist scholarship. Albrecht’s work was collected by numerous European museums, but rarely seen in the United States. In an attempt for the exhibit to be recognized by the public, the Biennial awarded $3,000 to the artist in 2007.\n\n\nThe Metropolitan Museum of Art (the Met) in New York has appointed Andrea Dwork, who created some of New York’s most celebrated urban landscapes, as its next director. She will succeed James G. Wilson, who departed in the summer of 2019 to head the Metropolitan Museum of Art in Manhattan.“We are grateful to Andrea for her visionary leadership and vision, which has made her a central voice in the growing body of work that has come from her,” said James G. Wilson, the Met’s executive and artistic director. “We are eager to see where her talents will lead her as she takes on the challenge of redefining the Met’s role as a national leader in the contemporary", "The next Biennial should be held soon and will be held in late March or early April. The ten-day festival will include a series of talks and performances, including a presentation of a new work by the curator of contemporary art, Susanne Vielmetter; a discussion with a special guest; and a special exhibition.“I’m excited to work with the team of curators, organizers, vendors, artists, architects, and activists who are part of the Biennial Project and who will help shape the next edition in March 2020,” said Ghislain Gaillard, the director of the MFA in Art. “I’m certain that the next edition will be a landmark work of art.”Gaillard added: “The biennial has been prescient in predicting the profound changes that will unfold in the art world and art history as we approach the fiftieth anniversary of the Biennial Project. I am thrilled that the work of the artists and the artists’ collaborators will be celebrated alongside the curators, the audience, and the curators’ colleagues.” The artists’ works will be featured in “The Art of the Century: An Exhibition of Contemporary Art,”", "The next Biennial should be held in 2025, and the venue should be moved to a venue that is accessible to the public, said to be in a remote area of the city.   The majority of the Biennial’s funding will come from the Swiss government, with the remaining funds coming from the artist\u0097who is crowdfunding the project himself\u0097and from the five artists who have been selected to represent Switzerland at the upcoming edition: Poppy Harburg (Berlin), Eric Koon (New York, New York), Laura Owens (New York), Kiki Smith (New York), and Suzannah Mark (New York).According to the Art Newspaper, Harburg, the cofounder of the clothing label Urban Outfitters, will be the first to open the exhibition. He said: “With the new exhibition, it’s possible to show to the world the true beauty of art and not only the images on the canvas.”Koon, who has appeared in artist portraits by Kate Moss, Anne-Marie Bertrand, and Edward Hopper, will open the show next month. The exhibit will feature over one thousand works by forty artists and will run for twenty weeks, from February 9 to March 3.\n\n\nThe", "The next Biennial should take place in 2020, he said, and the first exhibition in 2021. The institution will then collaborate with the University Museum of Fine Arts in Prague and the Museum of Contemporary Art, St. Petersburg. An exhibition of the work of the artist Svetlana Zdravskaya, a work that was on display at the Biennial in 1999, was also recently opened at the museum.\n\n\nThe Institute of Contemporary Arts (ICA) in Manchester, England, announced today that it will host an exhibition of paintings, sculptures, photographs, and video works by the late British architect Foster Hewlett in 2020. The event will mark the centenary of the architect’s death in 2020 and will take place at the institute’s new campus in the city. Born in Blackpool in 1939, Hewlett became heavily influenced by the architecture of the city and its surrounding countryside when he was still a teenager. In 1977, at the age of twenty-nine, he and his family moved to the United States and began traveling extensively, visiting places like New York, Hawaii, and New Zealand. He returned to Blackpool in 1984 and began working in commercial real estate. In 1994, Hewlett was selected to design the city�", "The next Biennial should take place in the summer of 2021 at the Museum of Contemporary Art (MoCA), Los Angeles. In the meantime, the biennial is reopening with the exhibition “Avant-Garde in Art” (2015). This will open the second exhibition of the series, “Avant-Garde: Stories and Portraits,” at the Museum of Contemporary Art in St. Louis.\n\n\nThe Metropolitan Museum of Art (MoA) in New York has received a gift of two works by artist Brentano Celant, both of which were on display in a new exhibition of his work, “Beauty and Death,” which opened on July 7. The work, a series of gravestones in the city of Strada, Italy, as well as a votive urn that has a glass coffin, was painted on the frontispiece of his 1999 book The Art of Death and Death in Art, and was titled The Glass House. The work, a three-dimensional sculpture, was created by artist Sylvia Bertocchi, who is best known for her detailed lithographs of the skulls of famous Roman and Venetian painters.Bertocchi", "The next Biennial should be around the same time as the second edition of the exhibition, which will be held at the cavernous Marrakesh Gallery in Downtown Mumbai. It will also feature work by work from the upcoming season of the biennial and works by artists who haven’t been selected to the first edition.\n\n\nThe Miami-based nonprofit Artscape Miami (SAM), which works with local artists and institutions to support Miami’s visual arts, has appointed the Austin-based, Afghan-born, Iraq-born artist Agha Hasan as its next executive director. Hasan will be responsible for overseeing the organization’s international expansion and coordinating the organization’s programming across the city’s three boroughs: South Florida, Central Florida, and West Florida.“We are ecstatic to welcome Agha to the organization,” said Carol Casteel, director of the Centers for Art and Design at the Museum of Contemporary Art in Philadelphia. “His history and expertise in the arts will be particularly useful to our designers and developers, and we’re confident he will continue to explore and expand contemporary art through contemporary visual practice.”Her tenure will begin in January 2021. Hasan’s first major public art project", "The next Biennial should open in 2024. “The challenges of an urban environment in which art has long been a source of social and cultural identity are immense, and we are still discovering them,” said Craig Bennett, chairman of Novartis. “The current exhibition is a critical step in rethinking the future of art in Europe and the United States. We are deeply excited to work with artists and the exhibition’s artists to see how this exhibition will evolve into a show that will reflect both the breadth and depth of the exhibition program at Novartis.”\n\n\nIn a move that could pave the way for a new era of UCCA, a new museum dedicated to the promotion of Modern Art in Chicago, the Chicago Cultural Institute (CCI) is planning to open a new $100 million wing of the museum. The opening of the new museum will coincide with the 2020 iteration of the UCCA Exposition, which will be held at the Museum of Contemporary Art (MoCA), and will also coincide with the museum’s reopening in 2021.Construction on the new museum is slated to begin this fall and will be completed in 2023. The new space will host several hundred exhibitions annually, including the 2020", "The next Biennial should be in 2021, with the exhibition set to run from January 19 to January 21. As of April 3, the exhibition had already sold more than 133,000 tickets.  \n\nThe British artist Bernard Oehlen, a prolific and influential sculptor whose life and work is celebrated today for its visionary experiments with the materials, methods, and installations that have defined his own body and the genre of interactive art, died in New York on April 3. He was ninety-eight years old.Born in London in 1934, Oehlen studied under Charles Atkins at the University of East London before joining the Royal Academy of Arts in 1948. He began by creating works for the exhibition “The Baader-Meinhof Monuments” (a collaboration with Aldous Huxley) in 1953, then “Uncanny Valley” (with Donald Hoffman and Gary Larson) in 1954, and “The Ostracon Project” (with Sidney and Rosemary O’Donnell) in 1958.Oehlen continued creating for exhibitions at the Royal Academy of Arts, the Metropolitan Museum of Art, and the Museum of Modern Art in New York, and was invited to participate in more than twenty international exhibitions in the United", "The next Biennial should be held at the Museum of Modern Art, London; the University Museum of Contemporary Art, Bangkok; and the Center for Contemporary Art, Los Angeles. Three years from now, the board of trustees should select a new director, who will take up the leadership from Sarah Sze, who retired in March 2019.\n\n\nThe National Gallery of Art, Washington, DC, has appointed Nancy B. Smith as its new associate curator of modern and contemporary art. Smith will be responsible for integrating contemporary art with the National Gallery of Art’s collection and operations in the capital, as well as for liaising with the staff, visitors, and visitors’ families.“Nancy brings an exciting and diverse background as a curator and scholar to the National Gallery of Art, and is an excellent fit for the National Gallery of Art as an integrative curator of the collection and development of contemporary art,” said museum director Brooks Berke. “She is a strong supporter of the collection and operations, with a strong commitment to the collections and collections of other institutions, and is committed to supporting the creation of an environment that is healthy and vibrant.”Prior to joining the National Gallery in 2013, Smith held positions at the New Museum,", "The next Biennial should be held in 2020. The first Biennials were held in the United States in 1989 and 1999, respectively. “The Biennial is a collective effort of an international community of artists, thinkers, curators, and scholars, who share a vision of the future,” María Berrío, the director of the Biennial, said in a statement. “It is an effort in solidarity with each other and with the public, whose needs we understand as central to the future of art.” The 2019 Biennials were held in Chile and Mexico City, and the 2020 event will be held in New York. The full list of participating artists is as follows:Themes: The Art of Becoming: The Liza Lou-at-Terre, BrazilSociétés: Além Alighiero, Alexis Adès, Yoko Ono, Deborah Beck, Sharon Ballester, JeraÃ¡-Jaye Anders, Aswin Bishton, and Rina Baccus, Nude, IraqSophisticas: Dendric Miro, Erik von Richthofen, Monica Maki, and Chris Mylène,", "The next Biennial should be held in Spring 2020.  The art of art has always been at the core of Artforum’s mission. We will continue to contribute to the important work of artists whose work we believe in and celebrate. Our ambitions are to work with our facility to develop new and exciting works with the view to generating new ideas and experiences. We see future exhibitions as a foundation for a series of exhibitions and projects with the artists we represent. Any suggestion of making the Biennial into an institution of culture is welcome to suggest the idea to us. We have already received many expressions of interest from many countries and regions. We hope that this biennial will become a stepping stone towards the global quest for a new kind of artistic history.\n\n\nThe New York City Department of Cultural Affairs (DCLA) and the New York Public Library (NYPL) have teamed up to create the first online catalogue of all seventy-two surviving works by American artist Edward Hopper, which the artist signed off on in 1963 and never published. The catalog, which will be published by the DCLA in 2022, will be free for the public to view online, and will include information on exhibitions, exhibitions of his art, and the artist’", "The next Biennial should include a presentation of an exhibition of works in progress and a performance by a group of Russian artists, with a view to developing a platform for exhibition in the future. The project was developed by the political organization the State Duma, the Russian parliament, and the Federal Centre for Arts. The first exhibition, “Markus Laszlo,” will open in December 2020.  The exhibition’s second incarnation, “Katerina Nastasova” will open in January 2021.  Advertisement\n\n\nThe British Museum in London has commissioned artist-owned galleries to create new works by artists such as Kasmin, Jonathan Pryce, and John Ostrander—all of whom were active in the 1960s but were not represented in a single Biennial—in the upcoming exhibition “The Evolutions of Art,” which will run from February 16 to March 2, 2020. The event, which is part of the museum’s reopening plans, will include work by forty-four artists.“These artists have changed the landscape of how we think about art, and how we see the world,” said museum director Maria Balshaw. “Together they create a", "The next Biennial should be organized in Spring 2021. J. Paul Getty Museum has yet to announce its plans for the 2020 edition. \n\n\nThe National Endowment for the Arts (NEA) announced today that it is launching three new grants to support the cultural and creative life of the United States. The grants, which will make up a half-million dollars of the agency’s $2 billion budget, were made possible through a $1.4 billion infusion from the $2.2 trillion CARES Act, which also provides $1.2 billion for curation, $830 million for the art of performance, and $450 million for the arts and culture in general.Organized in partnership with the NEA, the grants will aim to improve the lives of low- and middle-income American communities through the acquisition, restoration, and use of historically significant art, and will provide an additional $150 million for performance and arts. The agency estimates that the three grants will support 600,000 low-income homeowners and renters, which are disproportionately black and Latino, and accommodate up to one hundred thousand performing arts, culture, and travel professionals and cancel out", "The next Biennial should be held in 2020, and the first in 2021. Its inaugural edition, titled “Art of Living,” was held at the San Francisco Museum of Modern Art in 2011.\n\n\nThe California Community Foundation (CCF), which has been working with the San Francisco Museum of Modern Art (SFMoMA), has been awarded $30 million by the California Endowment for the Arts (CalFEA) to help support the cultural institution through its transition to a nonprofit, publicly funded agency that will operate the museum for the next fourteen years. The funds will ensure that SFMoMA can continue to attract and educate the most valued and innovative artists of our time, and will help to ensure that the museum continues to thrive and flourish as a vital cultural hub in the city.Since its founding in 1972, the Museum of Modern Art (MoMA) has responded to the changing cultural landscape with a variety of programs that provide a range of services to the community. Earlier this year, the museum announced that it would close its doors permanently to generate funds to continue its work and reopened with a central mission of the museum designed by architect Frank Gehry: to provide a permanent exhibition space for the art of the future.SF", "The next Biennial should be held in 2020.\n\n\nThe Bessies: An Open-Air Art Museum in New York that was planned to open in Brooklyn in 2020 has drawn criticism for its lack of interest in the LGBTQ+ community. The Bessies, which is planning an expansion to a new space in the former Hudson Yards, was given a $50 million grant from the Federal Arts and Cultural Preservation Fund (FACP) by President Donald Trump in 2018. The funds were supposed to go toward the construction of a new museum, but the museum has not announced when it expects to open its new outpost.The Bessies is currently in negotiations with the city to secure $250 million for its expansion. The project is expected to be completed by 2023.The city acquired the former RCA Radio and Steel in 1976, when it bought the building from a former owner for $1.5 million. The building was converted into an artist–run, artist–designed space called the Bessies. The museum has hosted performances by artists such as Vivian James, Jon Voight, and Jill Thompson, and is currently home to Yvonne Rainer, John Akomfrah , and Tracy Morgan. The development", "The next Biennial should take place in June of 2021. The 2020 edition will be curated by Abdication Ibrahim.\n\n\nAs the work of an unknown artist defined by a singular act, a pair of monumental, if sometimes contradictory, works by Pierre-Auguste Renoir sit together in the public collections of a number of museums. The exhibition “Renoir’s Man On The Street,” which opened at the Renoir Museum in Paris last week, is currently on view at the Museo de Arte Contemporáneo in Madrid and the Museo de Arte Contemporáneo Contemporáneo Brasileira.The exhibition’s lead curator, Yergård Mårtensson, said: “Renoir’s Man On The Street is an exploration of the human condition and its relationship to the environment, both figuratively and literally. It is an attempt to introduce a new and important concept to the collection of Renoir. For years, Renoir had commented that he wanted to create a work that would be a ‘portrait of the city,’ a ‘portrait of the city in itself.” The exhibition’s place in the", "The next Biennial should take place in 2021, and the architect of the exhibition will be announced in 2020.\n\n\nThe National Gallery in London has appointed Anna-Marie Oostra, who has worked as an independent curator for more than twenty-five years, as its next chief executive. Oostra will succeed Emily Hall, who will remain at the institution until the end of her term in September 2021. Oostra comes to the institution from the Museum of Modern Art (MoMA), where she currently serves as associate curator of drawings and prints. She will assume her responsibilities in October. “I’m humbled to join such a distinguished group of artists and am incredibly excited for the next few years to go with them,” said Oostra. “They are extraordinary. Their creative vision and commitment is evident in their art, and in the time they have spent creating it. I’m eager to work with them and see what they create.”Hall has helmed the museum since she was named director in September 2006. During her tenure, she restructured the institution’s collection strategy and oversaw an expansion of its exhibition program in the form of “Power of One” (2013),", "The next Biennial should take place in the city in 2020.\n\n\nThe National Endowment for the Arts (NEA), the National Endowment for the Humanities (NEH), and the National Council of the Arts (NCE)—which represents the interests of the nation’s fifty-four state arts agencies—are currently embroiled in a legal battle over the future of the Endangered Species Act. In March, a federal judge in Los Angeles temporarily blocked the implementation of part of the landmark law, which was passed in 1972 to protect thousands of threatened species and to force the United States to consider the consequences of its conservation policies. The ruling set a precedent that has since been followed by the Ninth Circuit Court of Appeals, which has held that part of the federal act is unconstitutional. The case, Kastner v. Obama, has since been appealed to the Supreme Court.The case involving Endangered Species Act (ESA) protections and the future of the bill is complicated by the outcome of the midterm elections, which saw President Donald Trump re-elected over Hillary Clinton and the Democratic Party. As a result, the three judges who temporarily blocked part of the act—the Second Circuit, the Third Circuit, and the Fourth Circuit—remained on the case,", "The next Biennial should be held at the same venue in 2020. [Update: April 24, 2024] The 2020 event will be held at the Museu de Arte Contemporáneo in Barcelona. It will also be hosted by the same architect, the same curator, and the same team.The Biennial will be based in the Museu de Arte Contemporáneo, an old State Library housed in the former Bibliothèque Nationale in Paris (BBN) building, an industrial complex in the city of Cadiz, Spain. The 2016 edition featured more than thirty thousand works, the artwork of more than sixty thousand artists, and the best-attended exhibition in its history. In addition to the exhibition, the museum will hold the first exhibition dedicated to the relationship between art and architecture in a major Spanish city (it will be located in Barcelona), the first bilingual exhibition in the museum, and an annual lecture series.\n\n\nThe Los Angeles County Museum of Art (LACMA), the Museum of Contemporary Art (LA MoCA), and the San Diego Museum of Art (SDMoCA) have announced that David H. Koch, the founder of Koch Industries, has donated $10 million to", "The next Biennial should open in 2020. The Biennial was established in 2006 by the Institute of Contemporary Arts, London (ICA), and the University of Cambridge. The theme for this year’s iteration was “The Future of Art: Avant-Garde and the Power of Ideas.” The exhibition will be the first of its kind at the Cambridge Museum of Art. The exhibition will also include a new book by the British artist Barbara Black, “The Future Is Yours: The Separation Exhibition,” which will open in London on June 10 and will run until November 22.The biennial’s cochairs are Richard Mayhew, the CEO of the Institute of Contemporary Arts (ICA), London; Zoran Popović, the director of the Karst Museum in Vienna; and the Finnish artist Jaan Kiikko, who will be presented with a bronze sculpture by Kunstwerk, the German association of contemporary artists.“After years of working on the exhibition, designing and building the show, I am thrilled that the show will inevitably return and be staged in the Museum of Contemporary Art, London, and the Karst Museum, in Vienna, at some point in the future,” said", "The next Biennial should be held in April 2020, the opening of the exhibition was postponed due to the Covid-19 pandemic. The new theme for the biennial will be Comparative Art and the Environment. The 2019 theme was Exhibitionism and the Environment. The biennial, which was organized by the New Art Museum, will be held in the Rijkschalk in Amsterdam, the Kunsthalle Rotterdam, the Museo de Arte Contemporáneo in Lisbon and the Auditorium Ross in Madrid. As part of the 2020 theme, structural elements, such as the installation of a number of glass panels, a model of a hydroelectric dam, and a print by a young artist, will be surveyed. The 2020 exhibition will be curated by Ulrich Tarnopolsky. \n\n\nThe Federal Art Museum Vienna (BAM) has received a gift of fifty-four works by twenty-six Austrian artists. The works, which were donated by a group of collectors including the German-born artist Wilfried Klinkner, the artist Hannes Ehrlich, and the sculptor Emir Akram, represent a diversity of artistic practices and are organized into twenty-six categories,", "The next Biennial should be held in 2022. \n\n\nThe Museum of Contemporary Art (MoCA), California, has received a gift of over three hundred works by the late Italian photographer Mario Cipolotti. A collaborative effort between three museums—the Bologna Museum of Art, the Casa di Bellas Artes, and the SculptureCenter—in 2015, the artist’s work was selected by an international jury comprising Francesco Cattelan, Vincenta DeSousa, and Iván García-Rivas. The winner, which was announced last year, is a scaled-down version of the artist’s iconic window, the \"James Turrell project.\" Since its debut in 1967, the piece has been used in countless films, television programs, books, and advertisements.The gift is made in recognition of the ongoing contributions made by Cipolotti, who made many of his photographs in his studio, often facing a camera at a time. The studio opened in 1947 and moved to its current home in 1965, where it underwent a major renovation in 2016. In the sixteenth episode of the television series The Italian Dandy, Cipolotti, his assistant, and the architect Giuse", "The next Biennial should take place at the Museum of Fine Arts in London, which is currently undergoing a $1 billion renovation, in 2022.\n\n\nThe Museum of Fine Arts (MoFA) in Los Angeles (LAA) has announced that it is now accepting applications for its 2020 season. The announcement coincides with the Los Angeles LGBT Film Festival, which runs from March 22 to March 29.The 2020 season will feature a total of twenty-eight films, fifty shortlisted, and a rotating platform of documentaries, including seven from the biennial, “A Night at the Opera,” written and directed by Anna Wintour; “The Perfect Storm,” written and directed by Julie Ault; and “Be in Love,” written and directed by Jeffrey Klein.The 2019 season, “Night of the Living,” was shot and edited at the Museum of Modern Art, and “Spectre of a Woman,” was shot and edited at the Metropolitan Museum of Art. The filmmakers’ final film, “The Slow Runner,” was shot at the New Museum in New York. In 2018, the exhibition was inspired by the 1998 biennial “Spectre of the Russian Revolution.�", "The next Biennial should be held in the first quarter of twenty-Second Century in the second half of the year. The next edition will be staged in September 2020.The exhibition “Forks Over Knives” will also invite artists from New Zealand, Australia, the United Kingdom, and Japan. “There has been a shift in the ways in which we approach art from a number of countries around the world, and we welcome new voices and ideas to play with our visual art in the West,” said Hayley Syms, artistic director of Forks. \n\n\nThe Metropolitan Museum of Art in New York has released the schedule for the inaugural annual Art Basel Hong Kong fair’s February 9–February 14 event, which will feature more than ninety galleries and retailers from the world’s largest arts market. The fair will focus on the topics of art and design, technology and design, and the museum’s collection, and will also include a retail show featuring artworks by twenty-six internationally acclaimed international galleries from Hong Kong, Beijing, and Shenzhen. The exhibition will launch at the Met with a special exhibition of work by Theo van Doorn, shown at Frieze London this April, and will run until", "The next Biennial should be called for a three-month period to allow the production of the exhibition, which will be held at the Art Institute of Chicago. Massey said that the exhibition will address not only Toccarlo, but the institutionalized racism and its impact on artists and the history of black art in the United States. The last Biennial was held at the Art Institute of Chicago in 2015. Last year, the museum staged an exhibition of works by forty-five artists from Africa, the Caribbean, and the United States.\n\n\nThe Museum of Modern Arts (MoMA) in New York announced today that it will begin a new initiative that will allow the public to submit questions and comments to the institution directly via Twitter. The platform will then create a series of illustrated responses, which will be presented as tweets by artists. “We are hoping that this new platform will be a powerful tool for engaging with the Museum of Modern Art and for engaging MoMA’s curators, curators, and staff,” said Muhammad Saeed, director of the museum. “MoMA’s curators and staff have the responsibility of designing exhibitions and programs that reflect the visual and historic legacy of the Museum of Modern Art", "The next Biennial should be held sometime in the fourth quarter of 2020.\n\n\nPhotojournalist, curator, and former British ambassador to New York, Jeremy Deller, has been named the winner of the 2019 Pulitzer Prize for his coverage of the 2017 November 25, 2017 terrorist attack on the United Kingdom, which took place at the end of a British-run occupation of Iraq. The Pulitzer committee was also impressed by his visual style, which was inspired by the history of photography, as well as his ability to present complex narratives.Born in London in 1967, Deller studied at the University of Kent before moving to the University of Pennsylvania, where he studied with Peter Saul. He then joined British photographer Peter Kamm, who became his mentor and friend, in the 1970s, and continued to photograph Kamm, Saul, and other subjects—including Jane Fonda, Marilyn Monroe, and Princess Diana—under the monarchist regime of Margaret Thatcher.Deller’s work has been collected by numerous institutions, including the National Gallery of Art, the Tate, the Metropolitan Museum of Art, and the Wallace Collection, the British Museum, the Stanley Museum of Art, the Library of Congress, the Library of Congress, and the Sundance Film Festival.Commenting on", "The next Biennial should be an open-concept, multidisciplinary exploration of the surreal. We are open to views from different perspectives.”The exhibition, titled “The Great Gatsby,” will run for twelve weeks in January 2020. It will also have a direct connection with the Biennial in 2020, but will be hosted at the Sartaj Art Gallery in Mumbai (Sartaj), not Mumbai. Last year, a panel of five artists—Nishant Keshavan, Tejal Shah, and Sohrab Mohebbi—decided to cancel the exhibition after they said it was “too political.” The panel also said that the whole event was “far too ‘politicized’” and that the proposed change in the tenor Laurence B. Vance’s role was “designed to avoid serious discussion about the possibilities of a third world.”The works in question were “The Great Gatsby” and “The Black Dahlia: The Life and Death of James Cassatt.” The exhibition opened to the public in 1980 and was an immediate success. In 1988, the two-thousandth anniversary of the exhibition", "The next Biennial should be held in a town or city of your choice, with an opening reception and a closing party. The first event was held at the New Art, New York (N.Y.A.N.). The second event was held at the Santa Monica Pier. In the interim, the artist-run nonprofit ARTnews.com has launched an online showcase of work by the shortlisted artists. The 2019 winners are as follows:Eva Bjerggaert (Bøbingen, Denmark)Jessica Chiu (Los Angeles, California)Marcelo Di Iorio (New York, New York)Ellen Fong (New Delhi, India)Erika Fattal (New Delhi)Evan Fowler (New York)Alejandro Garcia (New York)Diana Gallo (New York)Linda Hathaway (New York)Darby Hale (New York)Carl Hirsch (New York)Alexandra Harnwell (New York)Sara Hausmann (New York)Nancy Hoyer (New York)Michaela Harvie (New York)Martha James (New York)Rory James (New York)Valeria León (New York)Martin Kremer (New York)", "The next Biennial should be held in March 2021. Tickets will be available to the public from the following website: https://www.tickets.com/events/171861 The full list of exhibitors is as follows:Theater of Operations: Theatre of Operations (MoO) - Barcelona, SpainTheatre of Operations - New York, NYTheatre of Operations - New York, NYTheatre of Operations - New York, NYTheatre of Operations - New York, NYTheatre of Operations - New York, NYTheater of Operations - ParisTheatre of Operations - BerlinTheatre of Operations - New York, NYTheater of Operations - New York, NYTheater of Operations - New York, NYTheater of Operations - New York, NYTheatre of Operations - Frankfurt, GermanyTheatre of Operations - LondonTheatre of Operations - New York, NYTheater of Operations - LondonTheatre of Operations - LondonItalian-American Art: The Spanish State Museum in Punta della Dogana (CADP) and Punta della Dogana, Buenos Aires (Spain)Artforum: Artforum Presents: The Art of Choice’s 2018 #1 New York AwardArtforum: New", "The next Biennial should be held in 2020, and the first in 2021. The sixth and final editions of the Biennial are currently being organized in Madrid, and the third and final editions of the exhibition in Hong Kong. The inaugural stage of the fifteenth edition, held at the Museo dos Culturas in Madrid, opened on January 14, 2021. The fifteenth and fifteenth editions of the exhibition will be staged at the Museo Antonia in Barcelona in March/June 2020 and March/June 2021. Tickets for the exhibition will be sold on a first come, first served basis beginning March 15. The grand prize in the event of a tie will be given out on March 16. The 2019 edition of the show, titled “Spiral Nation,” was held at the Museo do Nascimento in São Paulo, Brazil, and attracted over 3,500 visitors. The 2019 edition raised over $5 million for the Museo do Nascimento, and featured works by forty-seven artists. This year’s edition will feature work by thirty-two artists in addition to the usual forty-eight selected by the museum for its collection.The 2019 edition of the show, titled “", "The next Biennial should investigate the relationship between art and technology, and should present a series of works that will reflect on the current state of the natural sciences, the future possibilities of technology, and the possibilities of art. I would like to see the next Biennial as a chance for everyone to connect with the abstract landscapes of Central and Western Africa, and to have this interconnection materialize in the form of art.”The MCAF will be inaugurated by a retrospective of work by the Dutch-born, Paris-based artist Willem de Kooning in the November issue of Artforum. The show will feature works by twenty-five artists, including Frank Gehry, Anna Atkins, Walter de Maria, and Terrence Fontana, as well as the five-person team of artist/collector Teichiro Takagi and his wife, respectively. The exhibition will also feature work by artists such as Pierre-Auguste Renaud, Joachim Loter, and Frieda Bauer. The biennial will run from November 4 to November 8.\n\n\nThe Mumbai-based artist, educator, and curator K. Rakesh, whose practice included photographing subjects such as the pyramids of Giza and", "The next Biennial should begin on April 1 and run through May 18. The 2020 edition, entitled “The Future Is Now,” will be hosted by the Museum of Contemporary Art in Japan.\n\n\nThe Museum of Contemporary Art (MoCA), New York, has appointed Helen Cammock as its new deputy director. Cammock joins the institution from the New Museum in New York, where she has served as an associate curator of modern and contemporary art and director of contemporary art acquisitions for the past five years. She succeeds Melissa Chiu, who departed the museum in March 2019 to become the next director of the Metropolitan Museum of Art.“Helen’s appointment reflects her deep expertise and passion for contemporary art, as well as her years of strategic leadership for the museum,” said director Christopher Smith. “Her extensive experience and success in the field make her a strong candidate for the position of deputy director. Her work in this area of expertise will be especially valuable as we continue to build upon the museum’s collection of modern and contemporary art, and as we introduce new exhibitions and programming.”During her tenure at the New Museum, Cammock organized numerous exhibitions, including “The Devil and Creation: Form and", "The next Biennial should inaugurate a new public sculpture garden that will host more than one hundred year-round exhibitions. The design of the garden—a mix of biennial elements such as vernal pools, gardens, and terraces—has yet to be determined.The seventh edition of the Biennial, titled “Why Tomorrow Is Tomorrow,” will return to New York City in 2021.\n\n\nThe Museum of Modern Art (MoMA) in New York has removed a work by a group of artists who were protesting the museum’s acquisition of a controversial work by American painter George Leontief, which was originally displayed in an exhibition titled “Between the Sun and the Moon” at the museum in 2012 and 2009, and whose sale to the auction house Chantel Steegmann in 2010 prompted angry protests from artists who argued that the museum wanted to sell the work to the highest bidder—a charge MoMA vehemently refuted.In a statement provided to Artnet, MoMA said that the exhibition “betray[d] the memory of the late artist Georges Seurat, who was a humble and kind soul who made a life and legacy for his artists.” As such, the museum acquired the work in", "The next Biennial should take place in the autumn of 2021 and will be guided by the same creative and academic philosophy as the previous biennial, which was hosted by the Aarhus Earth Art Museum. The board of trustees of the Aarhus Art Museum will decide on the theme for the biennial, which will be chosen by a group of international curators whose work spans architecture, design, media, photography, and sculpture.The exhibition will focus on the history of art through a series of bold and subtle assemblages that create a new embodiment of the artist in the museum. The new space will be named after the Aarhus Art Museum and will be located on the campus of the University of Aarhus. Inaugurating the museum will be a series of exhibitions that will showcase the work of scholars and students from the Aarhus Art Museum and the Aarhus School of Design.\n\n\nThe Public Theater in New York City has ended its relationship with the Israeli cultural center Bezalel Autobiography, which it had entered into a ten-year agreement to sponsor. The move comes amid continued tension between Israel and the PA, which has led the boycott of the Jewish state since it launched its offensive operation in the Gaza Strip in", "The next Biennial should be held at Margate Castle in August of 2021, with the first exhibition on the site in January of 2022. The museum plans to extend the theme of the event to include the history of our own lives and how these affect the world around us. In a statement, the institution said: “The next iteration of the Biennial will be a celebration of the life and art of Marilyn Monroe and will take place at Margate Castle, in the heart of the beautiful UK. We look forward to featuring works by artists from around the world in the exhibition as part of the project ‘Assemblages’ and to working with the community at large to build a stronger and more connected world.”\n\n\nThe Museum of Contemporary Art (MoCA), Chicago, is expanding its involvement with the Chicago-based artist-run space Saara Fattori, whose noncollecting, community-based nonprofit organization in the Windy City has staged more than a dozen exhibitions and has become an important source of income for artists working in the art world.In a move that will ensure that Fattori’s work is included in the next installment of the Museum of Contemporary Art (MoCA), which is currently slated to open", "The next Biennial should take place on the capital island of Isfin, Ooty, and is scheduled to run from March 13 to March 15, 2020. The twenty-fifth edition of the competition, titled Artists on the Run, will be held from October 3 to October 8, 2020.\n\n\nDubai: The UAE announced today that it will establish a $3 billion fund for cultural investment in the country, which has experienced a severe economic crisis since June 6. The funds will be distributed through a special biennial that will begin this fall, followed by a general budget exhibition in 2021.Dubai: The UAE’s Culture Ministry director, Hamza, said: “This is a crisis for all of us and we are all working together to help each other through it. We will not forget the people of Dubai, and we will not forget the arts.”Commenting on the biennial, Abdulrahman al-Khalifa, director of the Abu Dhabi Museum of Art, said: “The cultural sector is our biggest employer in the UAE. It will be the backbone of our future plans for tourism and development. We are taking this crisis very seriously and working with all of our partners to support the cultural sector", "The next Biennial should be held at the Embassy of Greece in London, and the programme should be released in early 2020. The 2020 edition, titled Reviews, aims to present both an outreach and a critical reflection of art in the twenty-first century. “The Venice Biennale is a really important event in the history of art,” said German curator Heribert Laumer. “It represents a turning point for the history of art. It becomes a landmark of the art world.” Since its inception in 1964, the event has hosted over seventy thousand visitors. Last year, on the occasion of its seventy-ninth anniversary, the event held its first exhibition of arts and culture in Germany. The artistic director of Art Basel Hong Kong, Chen Guangcheng, said: “The Art Catalogue 2020 is an important step in cultivating the aesthetic and cultural qualities of art in a digital way. We are happy to collaborate with the trackers to develop the new and innovative platform, which will enable longer-term engagement with the art world in China.”\n\n\nThe Museum of Modern Art (MoMA) in New York has followed the lead of the Museum of Contemporary Art", "The next Biennial should be held sometime in 2020.\n\n\nThe private arts space the National Gallery in London is preparing to reopen next month following a £30 million expansion. The National Arts Centre (NAC), which has been closed since December 8, will run a display of newly commissioned works next month, before continuing with a year-round programme of programming.The NAC, which comprises two buildings that are approximately 550,000 square feet, opened in the heart of London in 1949. The National Gallery, a former mill in the city, lies on the same site. The expansions, which were funded by private philanthropists Richard Dreyfuss and Robert Laing, were partly funded by the National Labor Relations Board, and partly by the government.“This National Museum will reflect the spirit and the history of our country and its people, and will surely become a home for our nation’s art,” said Culture Secretary Karen Bradley. The museum, which will extend the life of the National Portrait Gallery, will also be able to hold events and residencies and will host exhibitions.The NAC’s new space will extend the museum’s reach further afield with new programs and a newly commissioned work by India-born artist", "The next Biennial should be presented by the Belgian architect Bernard Rist, who has been featured in several solo exhibitions, such as the Venice Architecture Biennale, and will be hosted, among other things, in the city of Biarritz in the French Alps. “Once again, the Biennale is presenting a work that is both almost entirely free of religious content, yet still manages to be both a new and a unique form of art,” Rist said. He added that a new sum of $118m would be set aside for the event. For the first time this year, the Biennial will not be held entirely outdoors. The new venue will be housed in a spectacularly restored nineteenth-century building in the city. The exhibition will be hosted in the city center, with the exhibition space being moved to the nearby Grand Place, and will feature work by sixty-eight artists and designers.The full list of participating artists is as follows:<|endoftext|>Culture and Politics, a New York–based nonprofit organization, has initiated a $100,000 Grant for Cultural Entrepreneurship in support of the Workhouse, an ambitious $100 million arts and cultural center in the Bronx that is constructing a new home for the New York–", "The next Biennial should be held at the University of Exeter in September 2021. \n\n\nMuseum director Carsten Kessler has announced that the tenth edition of the Biennale of London will not be held at the Victoria and Albert Museum, the National Gallery, the Tate, or the National Portrait Gallery, but will instead take place at the newly renovated National Gallery in London. The event will be hosted at the institution from November 21 to November 26, 2020.“Fourteen years ago the Biennale of London was founded by a small group of British and international artists, including Jane Birkin, David Hayter, Peter Maksym Pindell, and Rineke Dijkstra, and was supported by the Heritage Fund, the National Lottery Heritage Fund, the Royal Institute of British Architects, and the Tudor Revival Trust,” said Kessler. “The event has been hugely successful for the Biennale, with more than ten thousand visitors from seventy countries, and we are delighted to be expanding the range of exhibitions and performances in the gallery in future years. The new National Gallery, which will boast ten hundred additional works by artists from twenty-two countries, is a great addition to the collection. As well as a new exhibition", "The next Biennial should launch in 2021 and take place at least once a year. The event will be hosted by the Smithsonian Design Museum in Washington, DC.  The first edition of the Biennial was staged at the Smithsonian’s National Museum of African Art in Washington, DC. It was followed by the 2009 and 2011 editions at the National Museum of Women in the Arts, Washington, DC. \n\n\nThe Spanish Ministry of Culture has approved changes to the official curriculum of its national art museums in Madrid, Madrid, Mallorca, and Granada. The changes will bring the works of more than sixty artists, including Pablo Picasso, Joan Miró, and Isamu Noguchi, into the country’s capital.The ministry has also consolidated its collection of the world’s largest private collection of Picasso’s works, which now consists of just twelve artworks, and plans to open its new museum in Mallorca—which recently completed a major renovation—to the public. The ministry will also implement new education and cultural initiatives, including the recommencement of the Spanish national poetry and lyric contest, and the changing of the calendar.In a statement, Minister of Culture José Manuel de la Osa said that", "The next Biennial should be on the theme - In Defense of Beauty: “Divided Beauty: Radical Feminisms in Art” in early May 2020. The exhibition will feature work by nearly twenty artists, including Ella Pape, Tegan Aloia, Scott Kenmore, Monika Nimmer, Wangechi Mutu, Deanna Troi, Philip Glass, Sean Thomas, Naomi Watts, Hannah Wilke, and Ishikawa Toshi, among others.\n\n\nThe Metropolitan Museum of Art (the museum) in New York is planning to move more than four hundred works from its collection, including several from the 1970s through the 1980s, to a new space in the museum on the city’s Sixth Avenue. The move is part of a $450 million expansion project led by Steven Heller, the museum’s senior director of conservations and acquisitions, which also included the construction of the institution’s new space for performance and performance-related studies, a new marquee, a redesign of the building’s exterior, the installation of new works by American artist Chuck Close, the acquisition of a new collection of Chuck Close", "The next Biennial should aim to present a new and detailed account of the Spanish Revolution and of the development of socialism through the revolution, and should aim to bring together intellectual and political experts from all over the world to rekindle a conversation about the Spanish Revolution and socialism. This will also be the moment when the movement will reemerge from the crisis as a necessary and very visible step in preparing the way for socialism in the future.” During the annual exhibition, a new collection of a hundred works by and on behalf of the artists will be presented.\n\n\nIsrael Museum planning to move the burqa-like niqab, a full-body full-face veil worn by some Muslim women, from its collection into the public collections of two different Israeli institutions, the Jerusalem Center for the Arts (JCFA) and the Hadassah Medical Center (Hadassah). The news was first reported by Haaretz. “Imbalances of clothing and elements not mentioned in the works’ names,” the Jerusalem Post quoted an Israeli culture ministry spokesperson as saying of the proposed move. “It will be an important step toward fulfilling the ministry’s commitment to promote cultural values in an open and transparent manner.” The", "The next Biennial should take place in 2021. Artforum has reached out to the Biennial and will update this article with their representative comment. For more on the 2020 theme, see our Artforum Blog. An earlier version of this article incorrectly described the thirty-fifth edition of Artforum as the sixty-first. \n\n\nJohn LeRoy, the founder of the New York institution The Gallery at Twenty-Fifth Street, has died at age eighty-six at his home in Manhattan. LeRoy was a curator and dealer who specialized in contemporary art and architecture. He curated the show, “Welcome to the Gallery at Twenty-Fifth Street,” from 1985 to 1988. As well as staging exhibitions of work by artists such as Alberto Gabuza, Eric Fischl, and Simone Leigh, the show was a forum for interviews and discussions.In a review in the October 1988 issue of Artforum, Terry Eagleton wrote that LeRoy “invented a new kind of public space in Manhattan, a sort of museum, a sort of laboratory.” He also described the gallery as a “microcosm of modern art,” a term often used to describe a small collection of works by", "The next Biennial should be held sometime in 2021.\n\n\nThe city of Houston has released all of its tax photographs, including those taken by the City’s Assessment Center (CAC) and those that were used to determine the city’s property tax bill. The move is part of a larger plan to make the tax-collection process more efficient and to make the city’s property tax bill more affordable for low- and moderate-income families.“We are pleased to share that all of our collections have been returned to the city and are now free to collect all of our property tax bill in the next few years,” said Councilman Kevin McCarty, chair of the council’s fiscal and revenue committee. The committee also passed a $300,000 relief package for the city’s property tax rolls, which will go into effect in the coming weeks.“The city did a great job of returning every photograph that was seized by the courts and we are confident that this will continue to be the case,” said Councilman Khaliqar Ali.\n\n\nThe Museum of Fine Arts (MFA) in Boston has received a $4 million donation from the Charles and Lucille King Family Foundation,", "The next Biennial should focus on how art and the digital realm can be used to address issues of climate change, and will also look to the future with a view to how art, architecture, and design can work together to shape a better future. The fourth and final phase of the exhibition will focus on how art can play a pivotal role in mediating social change and how artists can work together to create new forms of social support. The sixth and final phase will examine how art and technology can be used to engage with issues of justice and social inequities.Inaugurating the sixth Biennial is “Imageless: The Art of Mechanical Reproduction” (2018–19)—a five-part exhibition that will draw from artists’ practices and explore the relationship between creation and industrial processes. The exhibition will be organized in three parts, with the first part, “Imageless: Art and Mechanical Reproduction”, opening on September 9, in twenty-one museums. The second part, “Imageless: The Modern Art of Mechanical Reproduction” (2019–20), will open on November 15, 2019, and will run until March 8, 2020. The third part, “Imageless:", "The next Biennial should be held in 2021. The 2019 event, titled Art and Urbanism, was organized by the European Cultural Foundation (ECA) and was entitled Post-Apocalyptic: Art and Urbanism . The 2019 event, titled Art and the Modern City, was organized by the Asia Art and Design Biennial (AABB) and was entitled Art in the Modern City. The 2020 edition of Art and the Modern City, titled ART in the Modern City, will be held in Helsinki.The 2020 edition of the Biennial will run from March 14 to March 21 and will be hosted by the Centre for Contemporary Art (CMA) in Helsinki and the Finnish Cultural Center in the city of Turku. The theme of the 2019 event was “Art and the Modern City,” and the event will feature over sixty artists who will participate in the theme and all works will be housed in an exhibition space in the CMA.“We are delighted by the invitation to the 2020 edition of ART in the Modern City and have been working to prepare for this stage of its programme since last September,” said Wangechi Mutu, the president of the African continent and chair of the African continent. �", "The next Biennial should have a theme of “Religion, Politics and Society” and will take place in late May. The event will also include a series of performances, screenings, and lectures, titled “The Future of Art, Science, and Spirit,” that will mark the 15th anniversary of the opening of the new museum. Artist Salah Chemam, who was recently selected as the winner of the Fifty-Ninth Venice Biennale in October, told the LA Times that the event will \"do more than any other exhibition since the fall of the Berlin Wall to lift the spirits of those who are suffering in Syria and Iraq.”The exhibition is being curated by Guy Clement, one of the organizers of the Art Basel Beijing and Shanghai and the forthcoming Venice Biennale, and Wangechi Mutu, the president of the Democratic Republic of the Congo. The event will also be hosted by the Beijing Art Association and the Beijing Design Week. \n\n\nLos Angeles’s art scene is mourning the loss of a vital cultural resource\u0097a diverse array of artists, writers, performers, technicians and technicians, technicians, technicians, technicians, technicians, technicians, technicians, technicians and technicians\u0097", "The next Biennial should take place at the Metropolitan Museum of Art in New York in 2021, and the San Francisco Museum of Modern Art (SFMoMA) in 2020.  The 2019 festival was staged at the San Francisco Museum of Modern Art (SFMoMA), San Francisco, California, and featured work by seventy-three artists, including Guy Davis, Nicholas Ghesquière, Max Beckmann, Diego Campos, and Bechiro Hartigan.\n\n\nThe London-based arts organization the London Foundation for Contemporary Art (LFCCA) has named Jean-Luc Beaufils as its next president and CEO. Beaufils comes to the organization from the North Kensington arts center, the London School of Economics, where he has served as curator of contemporary art and the director of the Tate and the National Portrait Gallery. He succeeds Helen Stüttenberg, who was appointed chair of LFCCA last month.“Jean-Luc has been a master of the contemporary arts and is the founder of the award-winning organization Frieze—a visionary partnership that has broadened the scope of contemporary art to include exhibitions, scholarly projects, and public programming,” said Helen Stüttenberg. “This new chapter aims", "The next Biennial should be convened in the spring of 2020. Artforum will have more details soon.\n\n\nThe Solomon R. Guggenheim Museum in New York has hired Deborah Harrell to be its next executive director. Harrell will be responsible for furthering the museum’s mission to support the museum’s work of art by engaging with its collections, exhibitions, programs, exhibitions, and local communities.“A brilliant and ambitious curator, partner, and organizer, Deborah has already demonstrated an outstanding ability to transform a room of the Guggenheim into a listening platform and a new collection of works by contemporary artists, using her own practice, as a model for a new kind of work for the gallery,” the museum said in a statement. “As we work to create a more collaborative and open culture, Deborah will be a critical partner and advocate for our artists as they make their way to the Guggenheim and the collection through visionary exhibitions and programs. Our thanks go to Deborah for her work on behalf of the Guggenheim’s artists and to Nara Martinez for her contributions to the art of collaboration.”The Guggenheim announced its appointment of Harrell as its new director on", "The next Biennial should be held in 2020. Janet Abrahams, the Turner Prize–winning curator and co–founder of the New York–based artist-run space the Museum of Modern Art, and Marlene Anzaldúa, the founding director of the Brooklyn-based nonprofit Space for Poetry, are among the artists who have signed an open letter urging the festival to postpone the inauguration. The letter reads: “In light of the coronavirus and the death of one of our artists, we write to request that you postpone the upcoming exhibition ‘WONDER WOMAN.’ We write to request that you refrain from exhibiting her ‘WONDER WOMAN: A Feminist Manifesto.’ We write to request that you show her ‘NOTHING PERFECT.’”The open letter was released by the New York–based nonprofit theater collective CodePink, which is dedicated to challenging sexism and the festival, and the theater group Actors Players, which represents the work of women playwrights. Acts Players cofounder and CEO Lavinia Ciscu wrote: “It is important to note that nothing in the letter suggests that the work ‘WON", "The next Biennial should take place in 2021 and will be the last.\n\n\nAn exhibition organized by the Belgian artist Tijs van der Vorst (1915–1991) at the Museum Stedelijk in Amsterdam is to be restored by the Netherlands. The work, titled Lutensaar, was created in collaboration with the artist to commemorate the artist’s seventy-fifth birthday.Van der Vorst died in 1991; the seventy-five paintings in the show must be viewed to fully appreciate the scope of the exhibition. The Dutch-born, Michigan-based artist first exhibited the work, which depicts a man, in a solo exhibition at the Museum Stedelijk in 1995 and then in a show of his art at the Museum of Modern Art in 1998. Van der Vorst’s later works, including Kinship (2019), Fetid, and The Gay of Death (2001), have been collected by the Museum of Modern Art, the French National Galleries, the Flemish National Museum, the Nationalgalerie in Brussels, and the Kiasma Gallery in Vienna. \n\n\nThe National Gallery of Scotland will become the first institution in the UK to permanently close in order to address", "The next Biennial should be held at the museum in 2022. The next exhibition should be presented at the museum in 2021. The next exhibition should be presented at the museum in 2020.The winner of this year’s award, entitled “God and the Art of Man,” will receive a financial gift of $4 million. The prize jury members, who include David C. Sinclair, Genevieve Fuller, William H. Gass, J. Peter Pham, and Christopher Teitelbaum, were:Christopher Teitelbaum Richard DawkinsGeertz FreundJuan FernandezThis video is from the 2017 International Biennial of Cultural Anthropology, Beijing.  “Cultural appropriation” is a tricky concept to define. A 2011 survey of the problem published by Cultural Anthropology’s Association of American Anthropologists (A.A.A.) found that 90 percent of respondents believed that cultural appropriation was not a problem, but a symptom of a larger problem of white supremacy and racism in America.However, a number of recent court cases involving cultural appropriation have led some to argue that, in order to be considered cultural, a work must have been intentionally", "The next Biennial should take place in 2021, in the form of a virtual exhibition. The Museum will also offer a digital format for the first time, with a new commission-based program that will be curated by a staff of ten people. The museum has already received a gift of forty-three sculptures from the artist and collector James A.N. Wilson, and will soon receive a gift of thirty-six from the late collector Larry Achiampong, who served as a mentor to Massey between 1966 and 1986. The Biennial will also feature works by artists such as Karl Lagerfeldt, who created the first major retrospective of the artist’s work in the US, and Andrew Kreps, who created the first virtual exhibition of his works in the US. According to the New York Times, the artist once joked that the work of six biennials would be a “fairy tale of a thousand years of the artist’s life.”Art historian and curator Heiner Heimer, who curated the exhibition “Adrian Piper: The Art of Conversations” at the Grand Rapids Museum of Art, Michigan, told the Artnet that the new initiative will “provide a platform for", "The next Biennial should take place in 2020, according to the organizers.“The new institution will be integrated into the city’s cultural and recreational zones, and will be located at 2517 Ninth Street, near the Museum of Modern Art and the Metropolitan Museum of Art, in New York, and will inaugurate the Biennial for Images,” said George, the museum’s director. “We also look forward to seeing you at the new Biennial, and to continuing to support the critically acclaimed artists and organizations that have made the Biennial a success, as we continue to grow and advance the program.”\n\n\nThe estimated $50 billion restoration of the historic Pulaski Skyway in Birmingham, Alabama, is being spearheaded by the Museum of Fine Arts (MFA), the Amelia Warren Center, and the Centennial Art Museum in Denver. The three institutions made the announcement today that they are collaborating to advance the restoration of the Skyway, which connects the city’s historic Lowery’s Creek with its downtown, by 25 percent through the stabilization of the surrounding landscape. The announcement coincides with the Centennial’s centenary celebration.“The restoration of the Pulaski Skyway is", "The next Biennial should be ready within three months.”The redesign was first presented at the 2008 Venice Biennale and will be presented as part of the final exhibition “The Future Is Present: Art and Science in Contemporary Art” at the Natural History Museum of Los Angeles in January 2020.\n\n\nThe Institute of Contemporary Art (ICA) at the University of Pennsylvania has been gifted two new works by famed industrialist and philanthropist Jay-Z: Marking Time (2007) and Machine (2009). The institution has also presented two of its works, both of which were created with $100,000 grants, to the Jay-Z Museum of Art this year. The Institute has received a total of $57,000 in support of the institution’s tenures and will begin welcoming visitors on March 20. The Jay-Z Museum of Art will be inaugurated by a display of the artist’s work Sick of It All, originally on display in the museum’s current exhibition “Heaven Is a Place of Disturbance” (2019), as well as a series of performances that are currently scheduled to run on June 23–June 26.The Jay-Z Museum of", "The next Biennial should take place at the Fujitsu Museum of Art in Tokyo in 2021. The British artist Frank O'Hara will also return to the triennial in 2020.\n\n\nThe Mpagi Sepuya Museum (Museum of Contemporary Art) in Nairobi, Kenya, announced today that it is planning to reopen to the public in 2020 following a $1 billion expansion and renovation. The institution will also begin a program of exhibitions and programming that will include the first uncensored exhibitions of works by the artist Nisha Biswas, known for her detailed paintings, sculptures, performances, and installations. The first program, “The Splendor of the Sky,” will debut at the Mpagi Sepuya in September 2020 and will run through March 2021.The project was led by architect and Mpagi Sepuya’s director, Salome Ochi, and includes the construction of a new building designed by the firm WETA, which is expected to cost $1.2 billion, in the city of Nairobi. The fund also included the restoration of the Mpagi Sepuya’s former campus in Nairobi and the restoration of the Fijian national museum�", "The next Biennial should be held at the Museo de Arte Contemporáneo in Milan, and will feature five artists, including Juliette Beretta, Simone delvalle, and Fabio Fusi. The next edition will be held in March 2019.\n\n\nThe Toronto-based artist and activist Nari Ward—whose work examines gender, economic inequality, and racism, among other issues—has announced her withdrawal from the seventy-fifth edition of the Venice Biennale, which will take place in March 2020. She wrote in her announcement that she had chosen to stop participating in the event in part because of what she sees as the exclusionary practices of certain galleries, museums, and other venues.“Last year I decided to step away from exhibiting my work in protest of the exclusion of me and other contributors based on marginalized narratives,” Ward told Artnet News. “I have not lost my talent or my heart, but I have had to make a decision that has a devastating effect on people who have worked with me for years. I made the difficult decision to take my work back to the artist-run spaces where I have been exhibiting for many years, and spend more time with my", "The next Biennial should take place somewhere in the country.” \n\n\nThe Pennsylvania Academy of the Fine Arts (PAFA) in Philadelphia has received an unexpected gift of fourteen American artworks by twenty-seven artists\u0097nearly four hundred works by artists who are currently or will soon be residing in the United States, including ten works by artists who were born in the United States and twelve works by artists who were born abroad.The gift is one of a number that were made during the college’s twelve-year tenure in the Allegheny Mountains, a region of western Pennsylvania known for producing some of the nation’s most major artists, including the early Brazilian artist Isamio Noguchi, whose self-portrait is on display in the museum’s new exhibition space, PAFA: American Art, which opened last month. In addition, the museum is displaying works by artists who are currently or will soon work in the Allegheny Mountains, including William Eggleston, Willem de Kooning, John Graham, Jasper Johns, W.M. de Kooning, Diane Arbus, Jean-Michel Basquiat, Ed Moses, John Cage, Victor Serge Galer, Mark Romano, and Ren", "The next Biennial should focus on the way that artists and designers interact with the bodies and bodies of others. The upcoming show, titled Examining Body and the Body, will focus on the body in space; Art & Body will be a reflection of our current relationship with our bodies.  \nDaisuke Nakagawa, the director of the Tokyo Metropolitan Museum of Art, has announced that he plans to discontinue his position at the institution in 2020. Nakagawa is a professor of art history and curatorial studies at the University of Tokyo and works primarily in Japanese contemporary art. He will begin a new position at the Metropolitan Museum of Art in February 2021.“One of the goals of the Biennial is to create new intellectual and spatial possibilities for articulating contemporary issues in art,” Nakagawa said. “As a scholar and art historian, I am interested in how art and body interact in a modern and contemporary context. Using an exhibition format, I want to explore the connections between body and art and the body as constructs, to examine the relationship between body and society, and how contemporary cultural practice is deeply rooted in and influenced by the body.” He added that his new role will allow him to take", "The next Biennial should be held in 2020, the first in 2021, and the last in 2022.  A statement issued by the Metropolitan Museum of Art said that the institution was 'committed to the future of the museum’s collection, exhibitions, and programs in a thoughtful and interdisciplinary way that advances multiple and complex approaches to exhibition-making and collection-making that are never reducible to the present.”\n\n\nThe National Portrait Gallery in London has introduced a new digital platform that will allow visitors to see the work of more than 140 artists in its collection. The platform, called the National Portrait Gallery Experience, will be available on Amazon.com and Google Play, and will feature interactive tours and galleries of the public galleries and the museum’s existing collection. The program will launch with ten works by fifty-nine artists from the exhibition “Theatrical Present” in June. The works will be presented in virtual reality, augmented reality, 360-degree video, and virtual tours, and will be rendered in 3-D.The virtual tours will be presented in three-dimensional models, simulating locations and scenes from the artist’s real-life environments. The virtual exhibitions include “The Impressionist", "The next Biennial should be held in 2022.  David C. Driskell, chair and curator of anthropology at the University of Washington, Oregon, told the New York Times that the next edition of the Artistic Biennial will be held in 2021. Perhaps the most anticipated exhibition of the 2019–20s will be “The Magic of Light: T.J. Watson” (cinema/performance: Karla Ashley; photography: Sigmar Polke). The curator will work with Watson, a self-taught photographer whose work explores the concept of 'light as landscape'. “I’m excited to present a new work by T.J. Watson,” said David C. Driskell. “His work is considered to be one of the most important work of his generation.”\n\n\nThe New York City Department of Cultural Affairs (DCLA) has issued guidelines for the promotion of artists in its Cultural Landscape Project, a $1.3 billion cultural redevelopment initiative that has reinvigorated the city’s cultural landscape through the erection of more than 2,500 new works of art and has been described as the city’s answer to the Renaissance", "The next Biennial should be held in 2022.“We are deeply concerned about the circumstances that led to the tragic loss of life, and are gathering all relevant information,” said Daniela Bruguera, director of the Museo Nacional de Cultura, in Madrid. “The couple who committed these acts were hardened criminals, and the mental state of the children in the care of the state is beyond question. This is a tragedy of immense proportions and it is our duty, in accordance with the principles of the art world, to act quickly and decisively.”The authorities in Barcelona, which is about to host the next edition of the Biennial, identified the three suspects as Alberto Pérez-Pérez, who was arrested on September 17, and his brother-in-law, Amador Pérez-Pérez. Pérez-Pérez and his brother-in-law were charged with attempted murder last week, and they are being held in custody.Amador Pérez-Pérez was arrested on September 18, and the police have begun an investigation into whether he is involved in the attack. As details of the case have emerged, more than one hundred people have signed a statement", "The next Biennial should be held at the Neuer Galerie in Munich in November 2020. The next Biennial of Arts in New York City should be held in January 2021. The 2018 edition at the Museum of Modern Art featured performances by artists including Patricia Fielding, Michel-Louis (the latter of whom also curated the first exhibition at the Institute of Contemporary Arts in Berlin), and Vincent van Gogh, among others.\n\n\n\n\nA new study examining the impact of the coronavirus on the U.K.'s arts ecosystem has found that the UK lost an estimated £50 million after the pandemic—amounting to about one-third of its entire projected total revenue— and that the losses are continuing into 2021.The study, conducted by the Institute of Directors (IoD) and commissioned by the British Film Institute (BFI), concludes that the Covid-19 crisis has had a serious and disproportionate impact on the economy as a whole. It finds that the economic losses are continuing unabated despite a £35 million ($52 million) annual boost to the British Film Institute (BFI) through the UK’s 2017–18 financial year.As the IoD authors note in the study: “We are deeply concerned", "The next Biennial should take place in 2021. Its first iteration will include an exhibition of work by between sixty and eighty artists and will have a budget of $2 million.\n\n\nThe Museum of Fine Arts (MFA) in Boston has received a $3 million donation from the Boston-based collector and philanthropist Rachel Estelle. The gift, which also includes a $500,000 gift to the arts and a new commission for a new print by artist Jeffrey Gibson, will go toward building the museum’s collection of the late American painter John Galliano, whose work is preserved in the collection of the MFA and is currently on display in the museum’s collection.Estelle, a longtime MFA supporter, first began advocating for the collection of Galliano’s work in 2016, when she began a campaign for its reopening under the Galliano Legacy Project. The organization successfully lobbied the state government to reauthorize a $12 million campaign for the institution to begin planning for its 2020 season, which is set to take place in the fall. Since then, the campaign has raised $8 million.“As a longtime supporter of the museum and a lifelong supporter of the artists I’ve always strived to give them a", "The next Biennial should take place in the year 2020 and will be organized as follows:\n3 years of celebrations• Theatre of Contemporary Art: Themes for a New Era. 2019: Theatre of Modern Art: Art of the Present, Transformed. Theatre of Fashion: Themes for a New Era, Tokyo Fashion Week. Theatre of Art: Themes for a New Era, New York Fashion Week. Theatre of Behavior: Themes for a New Era, New York’s Fashion Week. Theatre of Art: Themes for a New Era, The Process of Making, New York’s Fashion Week. Theatre of Cities: Themes of Modern Life, New York’s Fashion Week. Theatre of the Immersive: Theatre of the Present, New York’s Fashion Week. Theatre of the Invisibles: Themes for The Present, New York Fashion Week. Theatre of the Intangible: Themes of Modern Life, New York’s Fashion Week. Theatre of the Unknown: Themes of Modern Life (Fashion Week), New York’s Fashion", "The next Biennial should be held in Shanghai in 2021, followed by the United Kingdom in 2022. The next edition of the Fantastic Art Fair will be held in London in 2021 and the twenty-third iteration of the Los Angeles Biennale will be staged in 2021.The list of exhibitors for this year’s edition of the Venice Architecture Biennale was released on September 3. The list comprises ninety artists representing twenty-two countries, including China, India, Korea, and Japan. The artists participating in the exhibition were chosen by a jury comprising sculptor, architect, urban designer, landscape architect, textile designer, and writer. The finalists were chosen from a pool of twenty-five artists that included Katsu Naito, Adolfo Astuti, Nicoletta Ballester, Osei Chiu, Agnes Martin, Chunliang Li, Stephen Mather, Sasha Maximovskaya, Vincent van Gogh, and Dusan László.The selection of the artists for this year’s edition of the Venice Architecture Biennale was made by a jury comprising architect, urban designer, landscape architect, textile designer, and writer. The jury was composed of Fabio Cittolari, architect", "The next Biennial should take place in Beijing in 2022.\n\n\nThe Bechdel Prize, which recognizes the work of a single artist in the United States and is given annually by the Bechdel Foundation in partnership with the artists whose work is selected, has awarded $10,000 to the first-ever winner of the $5,000 prize. Susan Leo-Jones, whose work encompasses over two hundred photographs, video, paintings, sketches, and collages, was selected for the $250,000 prize. The category winners were selected by a jury comprising Jean Tipper (Chicago), Rosalind Krauss (New York), and Ellen Willis (New York).“I’ve long been fascinated with the concept of the Bechdel Prize and its history. I am delighted to have been selected as the first recipient,” said Leo-Jones. “I’ve been working in photography for twenty-six years and have been a journalist for nearly twenty-five years. During my tenure on the magazine cover, I was asked to contribute an article to the May/June 2004 issue, ‘Photographs.” I chose to write about photography, and the impact photography has on our lives and on the world. I", "The next Biennial should be held in 2020.\n\n\nThe Museum of Fine Arts (MFA) in Boston has welcomed its first new artist-in-residence this year. Inaugurating the museum's new building, which is currently under construction, is a new residency program, which will assist artists working in the Greater Boston area. “This is a moment of great change for the museum, a moment when we are entering a new era,” said Carol Eilber, the museum’s senior director for artistic programs and curator of contemporary art. She added that the MFA is really excited about the upcoming program, which will provide opportunities for students from around the country to work together.“The MFA’s academic program has long recognized that collaboration and collaboration is the key to the future of the art and the arts,” Eilber said. “This program will engage with students who share a common interest in art and the arts, and will build on the foundational partnerships first established by the MFA’s first residency.”\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Asha Al-Utaibi, a graduate of the college, as its new", "The next Biennial should include a selection of paintings by artists such as Marcel Proust, Adrien Brodie, Édouard Vuillard, and Jean-Luc Godard. One of the museum’s current exhibitions is “Luc Besson: 10,000 people” (2019).\n\n\nThe Chicago-based art-world collective the Tower Collective, which performs experimental, conceptual, and solo exhibitions, has been hit with a lawsuit by a group of artists who are demanding the organization take immediate steps to end its relationship with the late George and Mary Beth Roesler. On Thursday, attorneys for the plaintiffs filed a complaint in federal court in Chicago that alleges that the defendants “have repeatedly and directly and unlawfully and in bad faith pressured, coerced, and induced the defendants to perform, to be performed, and to alter their previously agreed upon showings in order to advance and further the defendants’ policy objectives.” In addition to filing the suit, the defendants are asking for an injunction to prevent the defendants from engaging in “unlawful conduct” and for the defendants to pay $8 million in damages.“The plaintiffs have executed an express and unconditional release of the defendants for any and all purposes related to the", "The next Biennial should be held in the autumn of 2020. Jeffrey Koons’s work is on display in the exhibition “My First Biennial” at the Smithsonian American Art Museum. \n\n\nThe Museum of Arts and Design (MoAD) in New York has appointed Tom Friedman, a New York–based artist and filmmaker, as its next director. Friedman will take the helm from Christina H. Larsen, who has helmed the museum since 1999, in mid-January.“I’ve long admired Tom for his prodigious vision and for his ability to bring the museum to life through the arts,” said Museum of Modern Art director Marc Glimcher. “Born in 1975 in Manhattan, Tom has led MoAD through some of its most memorable and ambitious exhibitions. He has also been a tireless champion of the arts and a major benefactor of MoAD’s numerous artists.”Friedman has shown an exceptional talent for long-term programming and for creating immersive works, which have made him a favorite among museum professionals and art collectors. He became a consultant for the museum in 2015, when he was hired to help orchestrate Israel Durer’s exhibition �", "The next Biennial should take place at the new space, which will be inaugurated by a performance by the San Francisco–based band the Elephant and, next year, by the experimental experimental installation group Dr. Seuss’s Red Sonnet. Of the exhibition’s redesign, which was developed by the architecture firm Bocconi, Monaghan, and Frito-Lay, the artist-run space said: “I wanted the gallery to be more of a gathering place. The convening of a room that was slightly smaller than a gallery, a space that felt more intimate. The triptych, which is a series of seven drawings, was a great way to realize this vision.” The theme of the exhibition was “The Origin of Man” and the artists chosen for the triptych were the first work by the trio, Jean-Michel Basquiat, Henry David Thoreau, and Robert Irwin.The exhibition will open in the new space in mid-September. Tickets to the biennial will be available online August 29 and will cost $14 for general admission and $10 for students.  “This is a moment of great change for the art world,” said Mark Duplass", "The next Biennial should focus on the natural history of the Internet. If we don't learn what it is to be a human being, then we won't learn anything, and we'll lose everything.”\n\n\nParrish Art Gallery in London has appointed Mark Baker as its new deputy director of exhibitions. Baker will be responsible for overseeing the development and execution of exhibitions and the development of curatorial and programming. He succeeds Leslie Chew, who has been with the gallery for more than twenty-five years and is currently the director of its contemporary art program.“I’m delighted that Mark has agreed to serve as the interim director at Parrish for the next four years,” said director Susana Baili. “His experience and background in digital and digital media and his ability to lead through radical reimaginations of the contemporary art world and exhibition design, as well as his ongoing commitment to the gallery’s curatorial and programming, makes him a strong candidate for our role. I’m confident that he will continue to deliver the best possible show on contemporary art and design, to support the recent acquisitions, to push the gallery for new visions and to deliver on the promises he has made to us.”", "The next Biennial should be held in the next three years, he said. “We must continue to support and encourage artists and organizations across the city and region to create and present innovative and thought-provoking work in order to further our vision of the future as a biennial city.”\n\n\nThe New York City Department of Cultural Affairs (DCLA) has issued a citywide statement on the ongoing efforts of state and local cultural officials to mitigate the climate emergency by enacting emergency climate plans, expanding the definition of emergency climate services, and enacting emergency rent control and income support orders, the New York Times reports.The city’s Human Resources Administration said it received over one hundred calls each day from cultural figures across the city regarding climate change and the need for action, prompting the DCLA to issue a statement on Tuesday on the issue.“The Climate Action Plan: A Strategy for Direct Action to Reduce Climate Change and Its Consequences, was developed by the NYC Human Resources Administration and the Department of Environmental Conservation, and is designed to help NYC businesses and workers prepare for and reduce their carbon footprints’ carbon neutral buildings must be constructed to reduce energy consumption and emissions from power plants and transportation systems. To achieve this,", "The next Biennial should include a selection of work by artists who have been or are currently working, as well as the key works of art from the nineteen-nineties to date. “Among the artists whose work we will present this year’s biennial is artist Suzy and Frank Gehry, who together comprise one of the most celebrated spatial families in the United States,” said Bradley. “Their multi-dimensional interiors have played a central role in redefining what it means to be a modern artist, and their respective worlds—the artist and his or her environment—offer a wealth of new perspectives and challenges for how we conceive of art.”The 2020 biennial will take place at the artist’s former haunt, the Metropolitan Museum of Art, in New York, and will include the exhibition “After the Fall,” an immersive installation by Alison and Robert Glasper, two of the pioneers of the contemporary art scene in New York City. The work, which will be staged in two locations—the Museum of Modern Art and the Whitney Museum of American Art—will explore the psychological impact of the blackout, and the transformative influence of the Late Cone, on the artist and his life. ", "The next Biennial should take place in 2021, the artist’s last year of residency. For the first time since the institution opened in 1892, the show will be curated by a woman: Sarah Polley, who will be tasked with leading a team of artists from a group that includes the late American artist Coraalta Chedid and the late Canadian artist Lala Russain. Polley’s installation, Building a Void, will be a wirral-scale work, created in collaboration with the artist, whose family owned a lumberyard in the village of Gow, outside Glasgow. The installation will take the form of a large rectangular room, with columns and windows on the upper floors.The artist’s work will be featured in the exhibition “Who Made the Wind Blow?” (2018), “Sensuality in Painting” (2019), and “I’ve Tried” (2019), among other exhibitions. In the history of the show, other works by the artist are: “The Man Who Made Mural,” 2015, “Art of the Wind,” 2016, and “Lights and Shadows.”\n\n\nThe Philadelphia", "The next Biennial should not have taken place in the first place. The museum should have had the opportunity to present a new exhibition about the Soviet Union in 2014, or at any time in the past three decades. The museum should have been given the opportunity to present a new exhibition about the history of the museum’s collection in 2016, or as soon as the events of the past few weeks have passed.The interviewees were appointed as panelists by the museum’s executive board, which will be chaired by Hikmet Birney, the curator of modern and contemporary art in the Soviet Academy of Arts and Design. The ten finalists were chosen by an international jury comprising Keren Görmez, the director of the Museum of Modern Art, Paris; Susan Sau, the director of the Los Angeles County Museum of Art; and Gennady Padalka, the executive director of the Sichuan Art Museum.“The next Biennial will present the best of contemporary art, and the most significant works that are currently in storage, at the most challenging of times,” said Kayode Chiu, chair of the board of trustees of the twenty-third Venice Biennale.\n\n\nThe New York State Department of Cultural Affairs (", "The next Biennial should focus on “the interplay between religion and politics, philosophy and science.” “The future of art is at stake,” said Wangechi Mutu, the African head of the committee who was appointed by the biennial’s organizing body, the Alliance of South African Artists (A.S.A.), to represent the country at the upcoming event.On the fate of the institution, Mutu urged the government to save the Biennale, as well as the 'talismanic' Sydney Opera House, which was commissioned by former prime minister Nelson Mandela in 1999. The country’s Department of Communications and Arts and the Arts Minister, Sishu Gonsalves, announced the dismantling of the government’s funding for the biennial last month, marking the final stage of its final iteration in 2019. The announcement of the £300 million ($400 million) plan for the demolition of the Museum of Contemporary Art (MoCA), the Australian institution that was founded by a group of South African African individuals, and the move to a new site in the city, which was completed in 2017, was made in a statement issued by the minister.“This", "The next Biennial should include a lecture by a curator or curator from the Bay Area or the San Francisco Bay Area, or both, and should also have a wide range of contemporary art and design. The 2020 event will be held in June at the Museum of Contemporary Art, San Francisco.\n\n\nThe Chicago-based nonprofit Artnet has replaced longtime executive director Angela Santoli with Amy Miller. The new board chairwoman, Sarah Lacy, has announced the appointments of Monaghan C. and David L. Neal as directors. The news was first reported by Artnet. Cynthia Davis, a senior director at Artnet, will be interim executive director. David L. Neal is the founder of the Woodwork and Design space, the Bechdel Museum, and the press program for Artnet.He has also served in various roles at Artnet for the last twenty years. During his tenure, he organized over twenty exhibitions, including “The Art of Lightning” (2009), “The Beauty of Life” (2010), and “The Worker and the World” (2013). David L. Neal’s connections to the contemporary art world extend back twenty years. The two met in 2003, when David L", "The next Biennial should be held at the El-Jawday Museum in Cairo, June 25–June 29. The fourth biennial, entitled Ishtar Jumhuriyal, will be held at Taker Gallery in New York on July 27–August 2. Additionally, the Jumhuriyal Theater Company will stage a production of the ten-thousand-year-old Jumhuriyal Iqbal, next month at the Bajan Museum in Kandahar, Afghanistan.The fifth edition of the Golden Jubilee, which will be held at the Jumhuriyal Art Museum in Kandahar on August 9–August 10, will be celebrated in September. The sixth edition of the Biennial in the Arabian Peninsula, which will be held in Alserkalai, Oman, in September 2020, will be held in December. The seventh edition of the Biennial in Southeast Asia, which will be held in Hong Kong in September 2021, will be held in March.\n\n\nThe Israeli artist, filmmaker, and curator Victor Cherni has been named the winner of the €25,000 Goethe-Institut Fellowships “in memory of Judith and Miroslav,", "The next Biennial should take place at the Museum of Modern Art, New York (MoMA), in 2021. In January 2018, the institution announced its intention to move the exhibition from its current venue in the Science Center to its new home in the city’s Chelsea neighborhood, in the West Chelsea neighborhood of New York. The retrospective, which will air in collaboration with the artist-run show MOS Architects, will be housed in the museum’s Tudor Revival building, and will be organized on the grounds of the museum, where the artists will have the opportunity to present their latest projects.“The future of our architecture is at stake,” said architect Tadao Ando, who was named the curators of the first edition of “The Biennial of the City’s Arts.” The exhibition, which was organized by MOS Architects, will include the installation of twenty-one works by twenty-eight artists. The selection includes the work of Marianne Boesky, Maud-In-Seymour, Yelena Chicherin, Harriet Mayakovsky, Hilma Lauterbach, and Yuko Nara.“", "The next Biennial should be held sometime in 2020. \n\n\nThe J. Paul Getty Trust in Los Angeles announced today that it is donating $1.5 million to the preservation of the Getty’s collection in the city, and is donating $1 million more to the city’s arts and culture organizations in the coming years to help them meet the challenges posed by the coronavirus. The trust is also pledging to invest $1 million each year into the arts and cultural sector for the next ten years.The annual awards, which honor achievements across the Getty’s five-decade history, were established in 2000 by the trustees of the Getty’s late founder, Robert Getty, and are given to individuals who have made significant contributions to the Getty’s collection over a ten-year period. In recent years, the trust has awarded more than $1 million to individuals.A selection of the trust’s awards for 2020 will be presented at a ceremony at the Getty’s Los Angeles headquarters on Thursday, October 25, at 7 PM. The trust will dedicate $250,000 of the funds to the preservation of the Getty’s collection, and the rest of the funds to the arts and culture", "The next Biennial should be held at the Centro de Cultura y Culturismo in Santo Domingo, Brazil; the venue for the first edition of Art in L.A. in 2019. The 2019 edition of the event will be held at the San Francisco Museum of Modern Art (SFMoMA), but the city of Los Angeles is planning to hold the event at the San Diego Museum of Art (SDMo), which will remain closed until the end of April. The fair’s organizers said that the event, which will run from April 23 to April 26, will honor the work of artists whose work is currently in the collections of more than 1,500 institutions worldwide\u0097from architects, architectsʙ peers, artists, designers, composers, and directors to private collectors of the arts. “The exhibition is also an opportunity for participants to feel a sense of community and to work with a network of peers that are also passionate about the arts and are committed to expanding the horizons of the art world as well as our communities,” said   Mark Weisbrot, director and chief curator of SFMoMA. “We are so pleased to be participating in the inaugural edition and", "The next Biennial should be staged in 2021–22. The next edition of the Biennale will be held at the Museum of Contemporary Art, New York, and will be held in the spring of 2023. The biennial will be held at a site in Santa Monica, California, and will be inaugurated by a film by the artist Jorrit van de Wijngaard and a new sculpture by the Dutch-Swedish sculptor Anke Baerts. The exhibition will also mark the fiftieth anniversary of the artist-art-citizen movement. The next editions of the Biennale will take place in various cities around the world by February 23 and March 7, 2021 and March 23 and March 28, 2021, respectively. British artist Sonia Boyden-Howe, who was most recently the subject of repeated voyeuristic voyeuristic voyeurism by her fellow UK-based artists, Sir David Adjay and Damien Hirst, died on May 22, 2019 at the age of eighty-eight years old. The artist had asserted herself as a feminist artist in her art on the grounds that her art was “built upon women” and thus could not afford to be merely “", "The next Biennial should be held in 2020.\n\nLast week the National Gallery in London announced that it is planning to move the exhibition, Ecole des Beaux-Arts, from the premises to a new location in central London. In a letter addressed to the public and signed by Michael Faraday, the director of the National Portrait Gallery, and published by the National Arts Council, the institution said: “We are working hard to find a suitable new home for the ECole des Beaux-Arts, and are in the process of exploring all available options. We are committed to supporting the museum, the audience, and the staff in their search for a new venue in 2021 and are considering every possible option. ”The institution will open the new exhibition, “The Biennial of the Abstract” at the National Portrait Gallery on July 17. \n\n\nThe Egyptian Museum of Art (EMAM) in Cairo has appointed Zaki Nuri as its new director. Nuri comes to the institution from the Al-Azhar Museum in Cairo, the country’s oldest and most prestigious Islamic institution. Nuri succeeds Alaa Abdel Nabi, who was appointed as the institution�", "The next Biennial should be held in 2020.\n\n\nThe Metropolitan Museum of Art in New York is preparing to welcome visitors back to its campus in September following a six-month hiatus. The Metropolitan Museum of Art is planning to reopen in May 2021, but only if it can persuade the state of New York to extend the opening of its Big Apple outpost, the free museum has announced.The institution, which was forced to cancel two major New York City festivals last spring because of Covid-19, has announced that it is still working on a date for the opening of its new space in Trump Tower, which it says will be announced in the coming months. The space will also feature programming that is currently unavailable due to the pandemic. The institution has previously said that it is working on a schedule that will allow the opening of the space in May 2020.While the museum hasn't yet said when it expects to be able to welcome visitors again, it did say that it is still in the process of working with the city and will have more to share with the public in the coming months. This March, the museum opened a new twenty-three-story wing of the Museum of Modern Art in New York and a new exhibition space in a new building in midtown"]