["The next Biennial should not only examine the impact of European art in the region, but also the global interconnectedness of art and ideas with one another and the global cultural experience and for that reason should be a reflection of the people of the region, a work of art of a universal and a humanistic kind.” The forty-seventh iteration of the current event will take place at the Norway Museum of Art in Oslo from November 20 to November 23.\n\n\nThe New York City Department of Cultural Affairs (DCLA) announced today that it is expanding the scope of its cultural producer credit program, which has been in place since 2012, by awarding $250,000 grants to cultural producers working in the cultural and arts sectors across the city. The program, which was created in response to the economic downturn, has launched three priorities: topics such as the environment and health, design and culture, and food and hospitality.The three categories will now be combined into one category, which will be awarded to a living artist. In a statement, the department said: “The program is expanding and diversifying as we work to ensure the city’s arts and cultural sector remains robust and vibrant. We’re committed to supporting", "The next Biennial should be held in 2021, and a new exhibition of the work of the fifty-six artists who have won the Nobel Prize. The new format will include a series of interviews with the artists and will also include a new collection of their works, which will be organized as a series. The exhibition will be inaugurated by an exhibition of the artist’s works in Oslo in 2017, followed by a residency at the museum. The Biennial will go on to organize the exhibitions of work by the artists who were chosen by a committee chaired by Lars-Erik Larsen, director of the Stedelijk Museum in Amsterdam, and will present them over a period of twelve months.\n\n\nThe Wikimedia Foundation in collaboration with the Art Newspaper, the Guardian, and the Art Newspaper in the United Kingdom, has announced that, in the company’s first major online initiative, every Saturday, the foundation will publish an open letter to the editor in a prominent art-world publication. Each letter will be signed by twenty-two high-profile artists, including Marina Abramović, Willy de Menocal, Lars von Trier, Laura Owens, and Mark Rylance, and will be delivered on October 29.The twenty-", "The next Biennial should be held at the Centro de Artes Plásticas (CAFAM), in Madrid, in 2020. \n\n\nGerman artist Ulrich Hoffmann, whose body of work encompasses long-term installations and assemblages, has died at age eighty-two. The Berlin-born, Brooklyn-based artist was born in Berlin in 1940. In 1942, Hoffmann moved to New York to study under the tutelage of J. M. van de Weghe and Paul Gauguin at the Museum of Modern Art in New York. In 1948, Hoffmann moved to Germany, where he studied at the Institut für Kunst- und Künstkarte aus der Kunst, Bonn, and the Krefeld Academy in Munich. In 1949, Hoffmann moved to the United States, where he studied at the School of the Art Institute of Chicago, the University of Pennsylvania, and the University of California, Berkeley. In 1951, Hoffmann returned to Berlin, where he lived and worked in a small apartment near the Krefeld and the Art Institute of Chicago. In 1962, Hoffmann returned to California, where he continued to work. In 1966, Hoffmann first showed his work in the", "The next Biennial should also concentrate on how art and identity are linked to global crises and how art can play a part in solving them. The series of exhibitions that will be held under the theme Art and the Future of Europe will open on September 13 and run through November 17. Organizers said the program, which was conceived as a way to draw attention to the recent refugee crisis, came about as a result of conversations with artists and thinkers. The program will focus on art as a platform for solidarity and political action, and will include a selection of works and a range of projects for which donations and scholarships can be used. The biennial will be organized in partnership with the German state of Hesse and will include the exhibition of the artist's works in a number of different locations, including at the city hall of Berlin.\n\n\nThe sculpture group the Four Seasons Foundation has appointed Laura Corrias as its new executive director. She will be responsible for spearheading the organizational development and financial support of the organization, which was founded by Laura, Alexander, and Josep Lluís Companys in 1992, and will assume her responsibilities on January 2, 2020.Her appointment is significant as the foundation’s annual donor conference, which is presented by", "The next Biennial should be held in 2021.\n\n\nThe British Film Institute (BFI) in London has appointed Joe Hoberman as its next director, effective immediately.Hoberman comes to the BFI from the London School of Economics, where he has served as chief executive since 2012. He succeeds Richard Hook, who retired in 2019 after seventeen years at the institution.BFI chairman Christopher Le Brun announced on Wednesday that Hoberman will be the next director of the British Film Institute (BFI). “It is an honor to appoint Joe Hoberman as the next director of the BFI,” said Christopher Le Brun. “He comes to us from the same prestigious academy as I, and is already recognized as one of the leading cultural figures in the British Film Institute’s field. I am very proud of the work he has done to advance the BFI’s reputation and to present an exciting and diverse array of contemporary film. I look forward to working with him to ensure that the BFI continues to thrive and to connecting audiences with the very best British films.”Hoberman comes to the BFI from the Centre for Contemporary Art at the University of Warwick, where he has served as chief curator", "The next Biennial should be held at Copenhagen in September 2020. The 2019 edition, which featured work by seventy artists, was held in London, and the 2018 edition, which was held in the United States, was held in New York.  The biennial is currently on display in the Los Angeles County Museum of Art.\n\n\nThe Museum of Modern Art (MoMA) in New York has hired Katy Chisholm as its next director and CEO. Chisholm comes to the institution from the Neue Galerie in Berlin, where she serves as the director of the academic department of art history and curatorial studies and has curated numerous exhibitions since she was appointed in 2016.“Katy Chisholm’s forthcoming book The Post-Modern Museum: From Reclaiming the Museum to the Present—and Back Again—explores the changing ways in which modern museums are managed, organized, and operated, and is at once a repertory performance and a panorama of East Harlem,” the Hudson Valley, and New York City. “Her first exhibition, ‘The Evolution of the West: From Disturbances to Distractions” (2019), a collaboration", "The next Biennial should take place in the spring of 2022.\n\n\nThe Metropolitan Museum of Art in New York has reopened to the public after a $125 million expansion that began on October 13 and wrapped up in May. The renovation, which added more than 5,000 square feet of exhibition space, added a new section dedicated to the life and times of Pablo Picasso, the artist who inspired countless painters and sculptors throughout history, and added a new section dedicated to the art of African American art.\n\n\nThe Nora and Richard Crow Collection in Waltham, Massachusetts, has announced the appointment of Laura Roberts as its next curator. Roberts will succeed David Woolf, who retired in March 2019 after twenty-seven years at the helm of the museum. Woolf, who is vice president of the Crow & Beech, along with his wife, Christine, and their four sons, developed the ambitious expansion project, which included the renovation of the museum’s entire interior, and gave birth to the critically acclaimed documentary Nora and Richard Crow: The Commitments, which debuted at the 2014 Sundance Film Festival. The film, which follows the siblings as they transition from New Orleans to California, won the 2015 Emmy for best", "The next Biennial should take place in 2021, and will be hosted by the Central Library and Museum in Beijing. The rest of the works will be curated by the same team, and will be presented as part of the next exhibition, Art in the City. The series will include three works by the same artist next year, and will showcase the work of a different artist each year. “We are delighted to be able to launch the Biennial in 2021 and continue to present the work of the most important artists of our time,” said Pia Bruguera, the director of the Central Library and Museum. “It is an honor to present their work to our global audience in 2021 and engage China’s art community in an exhibition of the most important work by their artists.”\n\n\nThe Museum of Modern Art (MoMA) in New York announced on Wednesday that it is preparing to welcome visitors back from their two-year hiatus, which will run from March 19 to March 22. After 18 months away, MoMA will reopen to the public on May 8, 2020.“I’m happy to report that we’ve been extraordinarily successful in our mission of supporting the arts through this incredibly", "The next Biennial should be held at the institute in 2019.\n\n\nThere are currently more than 1,500 works by a group of artists, including Damien Hirst, Jonathan Goode, and Paul Gauguin, donated by one hundred collectors, in the collections of more than 150 institutions across the United States. The initiative, called the David C. and S. W. D. Evans Collection, was launched by the avant-garde American painter David C. Evans in honor of his late mother, the activist and philanthropist S. D. Evans. In 2018, the museum unveiled the first iteration of the David C. Evans Collection’s exhibition “Living with Art,” which explored the practice of painting, sculpture, photography, and video, as well as the legacy of the artist. The program also highlighted the lives and work of many of the artists whose works were exhibited.The museum will host three biennials in 2020 and 2021, with a fourth to follow in 2022. The three-day event will feature new works by seventy-five artists, including Rudolf Breyer, Willem de Kooning, and Pei Wei. The museum will also inaugurate a new David C. Evans Collection museum on the grounds", "The next Biennial should be held by the end of the year and will be hosted at the Institute of Contemporary Arts in Istanbul.  The next edition of the Modern Art Biennial, which has been slated for 2017, will be held at the National Museum of Contemporary Art in Beijing in 2022.\nThe committee comprising Maksim Büyükükşürek, Kadija Akkarny, and Hans Maier will meet on September 24 to ratify the changes. “The changes that were made in the future exhibition would have been impossible without the efforts of the committee, and we are excited to see how the new exhibition will feature works that are unrivaled in their beauty and craft,” said Jasmina Alireza, director of the Institute of Contemporary Arts in Istanbul. “The museum remains committed to a broad and creative vision that is rooted in the history and philosophy of modern art and modernism, which makes it a true equal of the National Museum of Modern Art and the Stedelijk Museum in Amsterdam.”The future of the institution will also be impacted by changes at the federal level. The Art Newspaper reports that the current plans for the renovation of the Turkish Museum of", "The next Biennial should be held in early 2021.\n\n\nThe London-based collective of artists and curators who are set to participate in the 2019 iteration of Art Basel Hong Kong, which is set to run from December 8 to December 13, will not be renewing their contracts, ArtAsiaPacific reports.The publisher announced last week that the event was canceled due to the health crisis in China, with organizers saying that the decision was made “in the interests of all parties in order to protect the exhibitors, the gallery, and the partners’ safety and well-being.” The move sparked furious backlash from cultural figures and galleries who condemned the cancellation, and many feared that the event would draw an additional 52,000 visitors.The powerful and influential Hong Kong Art Museum (HKMO), which was preparing for a March 31 opening, announced in March that it would suspend events and programming in Hong Kong in an attempt to cushion losses following the pandemic. In an attempt to mitigate the financial impact of the pandemic, organizers also announced that the fair was planning on moving the event to Hong Kong’s National Museum of Art, which is in an adjacent building on the same campus.All of the cancellations have forced organizers to adapt.", "The next Biennial should focus on the role of women and gender in the construction and reception of art, art history, and culture.”\n\n\nThe Peter Zumthor Foundation has announced that it will award a total of $1.445 million to thirty-nine artists in thirty-six countries. The nearly $1.7 million in grants are for “creative destruction”—a phrase coined by the American artist Henry Luce in the same interview that defined the term. The foundation says its goal is to provide emergency relief to artists suffering from economic and social disruption due to the Covid-19 pandemic. The grants are distributed through the Peter Zumthor Foundation, a charitable organization based in New York, and the artists’ own funds. The organization also works with the artist to help them secure funding for their projects.Here is a full list of the grant recipients:Martin Turner **“The Great Gatsby,” 2016Grant amount: $400,000 (up to $500,000 depending on financial need and availability of funds)Grant recipient is:Bianca Stumm-Onge *“Planes, Trains, and Mirrors: The Power of Art in the", "The next Biennial should focus on the transition of power from one state to another, and the conditions for the transition, and work with and within the local communities, as well as internationally.”The second edition of the biennial, titled “Beyond the Present,” will take up the themes of the eightteenth, seventeenth, and eleventh centuries, and will be staged at the City of London Museum from March 11 to March 13, 2021. The event will also feature the exhibition “Beyond the Present: Pragmatic Art,” curated by artist and scholar Lisa Borthwick-Armstrong, and the exhibition “The Present:: Art and the Present,” curated by the New Art Museum.The third edition of the biennial will feature the exhibition “Demanding the Present: Art and the Future,” curated by the University of Central Lancashire, on March 20, 2021. The exhibition will be on view until September 21, 2021.\n\n\nThe Museum of Fine Arts (MFA) in Boston is planning to welcome back more than seventy-five of the approximately one thousand works that were destroyed in the terrorist attack on the museum on September 12, 2016, the Boston Globe reports. The work,", "The next Biennial should take place in 2021 and will feature exhibitions of work by more than sixty artists. The exhibition will run from March 18 to March 20, 2021.Galerie Garth Enright has announced its representation of Tina Fey. Fey will receive an advance screening of her latest show at the Gallery at ten Downing Street in London, which will feature an extended version of her December Show, which premiered at the Gallery at twelve Downing Street in October 2017. In addition, Fey will receive a special steel installation mounted on the gallery’s new sculpture garden, which will be inaugurated with a new work by William Eggleston, titled Centered on a Little Apollo.“In this heightened moment of grief, it is refreshing to see a woman of his stature and stature of his generation, whose art has always been compelling and original and always at the forefront of art for women,” said David Graham, director of the gallery. “At the same time, it is a real source of great satisfaction to be able to present an exhibition of his work for women and for the first time. I am proud to have been able to work with Tina Fey. I am thrilled by the prospect of presenting this work in her living room,", "The next Biennial should be held by the end of October 2020. This means that the next show in the series must be held within the next twelve months. The full list of participating artists is as follows:Alejandro Arruda, London, 2019: The Angel on the Doorstep Alejandro Barceló, Madrid, 2019: The Girl with the Dragon Tattoo Lucinda Belle, New York, 2019: The Book of Lost Souls Mark Borthwick, London, 2019: The Artist and Other StoriesThe Brainchild Gallery, New York, 2019: The Bouchon: Antoine Bujold at the BouchonInsight Projects, Los Angeles, 2019: The Bowing to the Planet: What Lies Beyond, Paris, 2019:  Para Barcia, Milan, 2019: Triple Feature: Lululemon , NYC, 2019: The Bouchon: Claude Monet at the BouchonInsight Projects, Los Angeles, 2019: Selected Works of Roberto Catellani and Casper Van Doren, New York, 2019: Agnieszka Pedowska, New York, 2019: Agnieszka Pedowska - The B", "The next Biennial should be called into question on its decision to postpone the event until at least mid-March, Greiner told the Art Newspaper. “I think this is a classic example of putting a good event on hold in order to allow a retrospective to come along. It’s not a good way to go.” Since the festival has been on hold since March 14, the Copenhagen-based cultural center VIA, which has already received a couple of hundred visitors since it opened, has been forced to cancel events and has been working to reduce the crowds until the event can be held again.The Danish pavilion at the fifth edition of the Copenhagen Biennale is also facing backlash for its decision to push back the opening of the event by a week. “It seems like a strange thing to do, but it’s not like we were ever really in a position to stop it,” Flemming Fisker, the director of the Copenhagen Art Museum, told the Art Newspaper. “It was a decision taken on an interim basis, and we are still trying to come to terms with the consequences.” The Danish pavilion at the forty-third edition of the Stedelijk", "The next Biennial should take place in the spring of 2022. As always, our artists, staff, and the public will be fully supported during this challenging time. We look forward to working with you.\n\n\nThe City of Beijing has announced that it plans to begin removing more than 3,000 statues and more than 2,500 historical monuments that were deemed sensitive to issues of race and political instability by the Chinese government, including a monument dedicated to Mao Zedong that was moved to a museum. The reopening of the Museum of Toccarra, the capital’s major tourist attraction, was also delayed because of the controversy.The first statue to be removed was the monument of General Li Yuyi, a Chinese politician and military strategist who led the People’s Republic of China (PRC), from the National Museum of China in Beijing, which reopened in 2017 but was closed due to a delay in paperwork. The other statues involved in the controversy were those of Communist leaders and government figures such as Liu Shaoqi, Zhou Enlai, and Deng Xiaoping.On August 3, 2017, the Ministry of Culture and Sports announced that it was removing three sculptures that were in violation of the country’s national ideology:", "The next Biennial should take place in 2021. The following year, the festival will be held in both Berlin and New York. The 2020 edition will be held at the Berlin Museum of Fine Arts (BMFA), the United States.\n\n\nThe San Diego Museum of Art (SDM) has announced the winners of the 2019 Biennial Design Awards. The awards were established in 2015 to recognize and support the achievement of excellence in design by emerging and established designers from California, the District of Columbia, and the United States. The biennial—which was also attended by artists from across the globe—was staged at both the San Diego Museum of Art (SDMO) and the San Francisco Museum of Art (SFMo), and will return to San Diego in the spring of 2021.“The winners of this year’s Design Awards are as follows:Brian Dunn, San Diego:    Art is a part of my very soul. I am inspired daily by new ideas and new ways to express myself. The new Design Award will allow me to achieve this through moving my exhibition to SDMO in May 2020. I’ve worked at SDMO and SFMo for more than five years and have a fantastic group of colleagues who sustain and enhance my work.", "The next Biennial should be selected by an Executive Committee consisting of the artists, director of the museum, the president of the institution, and five other members appointed by the director. The next edition will take place in 2021. The Biennial will be based in Biennale. It will be hosted at a new, larger facility in the city, a former textile factory, and will feature fifteen exhibitions, including “Avicenna: The Art of Death” (2019); “Museum of Modern Art: The Light of the Universe” (2019); and “Dilek Museum: The Story of Life” (2019). The institution will hold the first edition of the Biennial in the summer of 2021. \n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, announced that John LeBlanc has been named the next executive director of the museum. LeBlanc will serve as interim executive director until a successor is appointed. He succeeds Kelly Stronge, who has helmed the institution for the past twelve years and will assume his responsibilities on January 3, 2021.“LeBlanc’s vision for MoCA is inspiring, his management style innovative, and his energy and passion for the art long", "The next Biennial should be held at least four times a year, with each of the following themes:\n\n>Creative Production’s Role in the Integration of Northern and Southern Cultures’s New World Foundations (Yale and Princeton, New Jersey)\n\n>The Importance of Image in Human History” (New York)\n\n>A Light in the Attic: Art and Travel in the Late 19th Century (New York)\n\n>The Art of Photography in the Twentieth Century (New Haven, Connecticut)\n\nThe twenty-fifth and final Biennial will be held at an undisclosed location outside of New York. The theme for this year’s event is “The Practice of Photography,” and the forty-ninth and fiftieth biennial will be the “Life and Times of Alfred Stieglitz.”While the inaugural exhibition was held at the Museum of Modern Art in New York, the eighteen-hundred-and-fiftieth anniversary celebration of the institution will be held at the Art Institute of Chicago, where it will be organized by the Institute of Contemporary Art, Chicago and the artist’s son, Alfred Stieglitz.According", "The next Biennial should include a keynote address by Fabian Nicoll, the president of the Royal Academy of Arts, a British institution that represents the interests of the Royal Academy of Arts (RA). The Biennial was established by the Royal Academy of Arts in 1957. The school will hold its next edition at London’s St Martin’s Palace in December.\n\n\nThousands of workers at major British art galleries are preparing to strike until the government makes other concessions to the workers who have staged walkouts in an attempt to slow the spread of Covid-19—the virus that causes respiratory illness and damage to the respiratory system. The artists’ union said the strikes, which will stretch into early February, will include a wide range of workers, from senior managers to hourly workers.The artists’ union claimed that the government is refusing to guarantee basic healthcare and other basic civil liberties, such as the right to a safe working environment, and is planning to introduce legislation that will make it easier for the Royal National Theatre to close permanently. It also plans to deregulate the gallery industry, outlaw the self-employed and the freelance, and cap the pay of executives.The Royal Academy of Arts (RA) workers are demanding that the government guarantee that all", "The next Biennial should be a fundraiser for the city of Boston as well as for Artforum. The city chose to create an event to support the museum in an attempt to stop the spread of Covid-19. The Boston 2024 Presidential Committee, which is chaired by billionaire and former Massachusetts governor Thomas M. Menino, released a statement on Friday, October 17, calling the move a “great honor” for the city.“There are few organizations as indispensable to our community as the Boston Museum of Art,” said Diane DeGette, chair of the city’s delegation. “The museum is the backbone of our vibrant and independent city. We are grateful that the museum will continue to be a model for the country as we rebuild our resilience and resilience of the future.” DeGette added that she is confident that the city’s delegation and the new board will work with the museum’s new director, Robert Manning, to ensure the museum’s continued success. Manning will take the helm of the institution next month, following Steven M. Ross, who retired in June after a decade at the helm of the museum. \n\n\nThe Museum of Fine Arts (", "The next Biennial should take place in November 2021.\n\n\nThe Metropolitan Museum of Art (the museum) in New York City has appointed Holly Bell, who served as the assistant curator of the early years of American art, as its next chief curator. Bell joins the Met from the American Folk Art Museum in the Bronx. Born in New York City on March 16, 1942, Bell graduated from the School of the Art Institute of Chicago in 1977 and then joined the Met. She worked as an assistant curator at the museum from 2005 to 2009, and as a curator at the Whitney Museum of American Art. She also served as the curator of the 1931 exhibition “Avant-Garde and Modernism” and “Rainer Mihle: The Art of Making Things” at the Met.In the current exhibition “Avant-Garde and Modernism” (2019), Bell includes works by the likes of George Ahearn, Pedro Bauret, Hélio Oiticica, and Mies van der Rohe, and includes her own collection of early American paintings from the collection of Mark Rothko. In the upcoming exhibition “Rainer Mihle: The Art of Making Things” (2020), Bell", "The next Biennial should take place in 2021.\n\nMuseum director Virginia Kennedy, who joined the institution in 2016, relinquished her position in 2018, citing her desire to return to New York. “The changes we are making will not be easy, and each of us will take a great deal of personal risk,” she said in a statement. “But when we both return to work tomorrow the museum will be stronger and more vibrant. I am confident that when we come together for the first time in twenty-five years, we will find a way forward together.”\n\n\nThe City of Atlanta’s bid to demolish the Hank Aaron–designed stadium for the Atlanta Olympics has been put on hold as part of the move to the new $85 million Commonwealth Stadium. The delay has left the city with a $50 million shortfall in the construction of the stadium. Mayor Earl Yarborough announced that the $150 million surplus will be used to pay for the construction of a new facility for arts and cultural organizations. The new venue will sit in the Atlanta Beltline and will host the 2024 Summer Olympics. The project is estimated to cost $120 million. The city previously allocated $130 million for construction of the stadium.“We", "The next Biennial should be on the 30th.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has announced that it is opening its first new permanent collection in more than forty years, a twenty-five-foot-tall bronze sculpture by French artist Albert Camus\u0097a remnant from the infamous “unclean” series, which concerned a group of young artists in Paris in the late 1940s. The work, titled “Away From the Sun,” will be on view in the Museum of Contemporary Art Los Angeles’s “Oscars” section in the fall. “The next iteration of this show will focus on the larger themes of the show\u0097to how art can be a repository of meaning, a compass for movement, and a way of life,” said John Collins, cohead of the exhibition.The exhibition, hosted by the Los Angeles County Museum of Art (LACMA), follows a decade-long exploration of the world’s most widely-known artist, Albert Camus, who was born in the small town of Aubervilliers in the French Alps, near the Aisne River, in 1944. The son of a French collector,", "The next Biennial should be held in 2019.\n\n\nThe 5th edition of the Edinburgh International Biennial, titled On the Beach, will be held at the Royal Festival Hall on March 28–March 29. The event will feature more than seventy artists and collectives from seventeen countries and will run from March 16–March 19. The event will also introduce a new local art initiative called the On the Beach Artists Program. At the event, seventy-eight artists will receive a $500 cash prize, which will be divided between the groups A, B, C, D, E, and F. To celebrate the occasion, the Royal Festival Hall will be introducing a new series of nine works by the artists. The artist prize winners will be announced on April 2.\n\n\nThe Spanish Ministry of Culture has awarded the Bahraini artist Salahuddin Jumran Al Hussain the LPFA Artist Prize. The $3,000 award will go toward reconstituting parts of his “On the Beach” series, which explores the relationship between the Arabian Peninsula and the Arabian Gulf states, and will also benefit the National Art Museum (MAM) in Madrid. “Jumran Al Hussain is well known", "The next Biennial should take place in January 2021.\n\n\nThe Museum of the Egyptian Art (MCA) in Cairo has been designated the cultural site of the year for 2022. In a decision that makes it the first institution in Egypt to win the prestigious honor, museum director Egypt-based artist and activist Assaf Raham was named the 2022 winner of the MCA Gold Lion Award.Raham will receive a $250,000 cash prize, which will be presented at an award ceremony on December 15. Enthusiasts will be invited to attend the ceremony and the museum will be transformed into a year-round platform for contemporary Egyptian art.The MCA, one of Cairo’s largest cultural institutions, has been working to secure the future of its building on the former site of the Egyptian Ministry of Antiquities, which is slated to be demolished and replaced by a new museum. The construction of the new museum will run concurrently with the demolition of the ministry, which will be completed by the end of the year.According to the Cairo Post, the MCA has been working for some three years to raise $200 million for the renovation of the building, which was designed by British industrialist G.P. Mather, and has since secured $90", "The next Biennial should be in 2021, and the first exhibition should be held in 2022.The next show was created with the help of a group of artists, historians, curators, architects, and architects' supporters, who collectively raised $3.2 million for the project, which was first announced in 2007 and is currently being held in conjunction with the opening of the new museum in St. Louis, which was completed in 2012.The project was supported by more than one hundred artists, including María Berrada, Pablo Picasso, Ed Ruscha, Robert Rauschenberg, Francis Crick, and Walter Isaacson. The organizers also received $500,000 from the Michael Jordan Foundation to assist with the construction of the sculpture garden.\n\n\nYale Union at Yale University, which has been the home of the institution since 1961, announced that it is reopening in August. The reopening came after the institution, which is located on the first floor of the Connecticut-born architect Daniel Libeskind’s conceptualist and activist brother-in-law’s home in a gated community in the Catskills of New York, installed a new public art installation, “The Unseen Garden,” in the campus", "The next Biennial should be held in 2019. The first art event to be held in the country was the first Biennial in 1950.\n\n\nThe Museum of the Fine Arts (MFA) in San Francisco has named Christos Antonakakis as the next executive director. He succeeds Melissa DeToth, who departed in the summer of 2019 to lead the Los Angeles County Museum of Art (LACMA), and will take the helm of the museum in December.“The MFA has been featured as a model for how a large museum should operate and is a model for a number of other museums,” said Georgina Young, chair of the board of trustees. “We are extremely excited by Christos’s appointment as the new MFA executive director and his proven track record of success and vision for the museum.”Antonakakis, who has served in the role since 2014, will also assume the authority of the board of directors and will lead the transition of the museum’s administrative leadership and operations. The MFA’s board of directors will elect its next executive director in November. Last month, the museum’s board of directors decided to extend its nominating deadline, which had been set for December", "The next Biennial should be announced as soon as possible, and must be convened in the city of Lakewood, New York. The event will consist of a series of discussions on the contemporary art of the United States, including the work of Robert Irwin, Jean-Michel Basquiat, and Frank Gehry. The program will also include the visual arts as well as film and performance. The preliminary list of participants for the next edition of the Biennial is as follows:Julia Beaufils, New York (New York, NY) (Birmingham, AL) Diana Bruguera, New York (New York, NY) (New York, NY)Diana Bruguera, New York (New York, NY) (New York, NY)Diana Bruguera, New York (New York, NY) (New York, NY)Diana Bruguera, New York (New York, NY) (New York, NY)Diana Bruguera, New York (New York, NY) (New York, NY)Diana Bruguera, New York (New York, NY) (New York, NY)Diana Bruguera, New York", "The next Biennial should take place in 2021.”\n\n\nTimur Bekkal, the director of the Art Institute of Chicago (Art Institute), has been appointed director of the Rhode Island School of Design (RISD) in Providence, Rhode Island.Bekkal is the fourth person to lead the institute. His predecessor, Ann Wilson, retired in June 2019 after thirty-two years at the helm of the institution. During her tenure, she expanded the school’s collection and oversaw the exhibition and scholarly program.“Tim has been instrumental in my career trajectory from an emerging scholar to a respected educator, helping to shape the University of Chicago’s collection and scholarship, and establishing the institution’s reputation as a leading center of excellence in the art world,” Wilson said in a statement. “I’m excited to work with Tim and his team to ensure RISD’s future is bright and full of new ideas.”Bekkal succeeds Anne-Marie Pilar, who has led the institute for more than twenty years, and will take up his new post on January 6, 2021. \n\n\nThe Berkeley Art Museum (BAM) in California has received $100,", "The next Biennial should take place in 2021 and will be directed by the same team that curated the first exhibition, “Against All Odds.” “The key to why we have done this is to show that there is a new generation of artists who are ready to take on the challenges that we all face,” said Akiko Tokuda, who will serve as director of the biennial.The exhibition will feature work by twenty-four artists, including Neuerbachné (Sydney), Bushra (New York), Deana Hendrix (New York), Tobi Holoway (New York), and Susanne Vaisman (New York), among others, and will examine “the relationship between art and the body, between body and the environment, between body and the environment and the environment, between body and the environment and the body, between body and the environment and the environment, between body and the environment and the environment, between body and the environment and the environment, between body and the environment and the environment, and between body and the environment and the environment.”The biennial will be organized around a theme of the body, “the self, the body, and the environment,” and", "The next Biennial should take place in 2020 and will be hosted by the foundation, which is headquartered in Christchurch and has locations in New Zealand, the United Kingdom, and Finland. The exhibition will be a celebration of the twentieth year of the festival.As part of the Festival, a joint project between the Foundation and the Auckland Art Gallery (AAG), the five artists selected for the exhibition were:Anya Alok, Nicolai Bleskovitz, Eiko Hsu, Stefan Rahne, and Yoko Shimomura. The exhibition will run from February 27 to February 28, 2020 and will be presented by the curator of contemporary art and the chief curator of the AAG Auckland. The first round of the exhibition will be held at the museum on March 3. The second stage of the exhibition, “The Present,” will open at the AAG Auckland on March 14. The third and final part of the exhibition, “Imagery of Sculpture,” will open at the AAG on March 22.The prize ceremony was held at the AAG on April 10. The galleries participating in the event include: Pirelli, Milan; Galerie d’Aloia, Paris; Galerie des Ha", "The next Biennial should be held in 2021, and the last in 2024.Artforum has learned that both the State Arts Commission (SAC) in North Carolina and the North Carolina Museum of Art (NCCA) have expressed interest in hosting the 2020 edition. While the NCCA will be reopening next month, the institution will not be able to accommodate the unprecedented traffic volume that would result from the simultaneous reopening of both venues. “The commissioning of this exhibition is an incredible opportunity to bring together unprecedented artists in the country,” NCCA director Joshua Helmer said in a statement. “The exhibition will present a selection of work that explores the intersections of art and music, and will follow the theme of the theme, ‘Time and the Soul,’ in an inclusive, participatory way.”The museum has also received a gift: a sculpture by artist Zanele Muholi, a collaboration with artist Amanda Palmer, and was given a special exhibition. The work, entitled Cathedral, will be on display in a forthcoming exhibition at the museum. The show will highlight the work of sixteen artists, including Jaden Smith, Alex Da Corte, Sigrid Cohen,", "The next Biennial should be held at a location other than the Design Museum. The institution has received funding from the Sutter Family Foundation, the Koch Industries Foundation, and the Lyndhurst Trust, and will announce more details about its plans for this year’s edition in the coming months. “We are planning to continue to advocate strongly for a more robust, equitable, and inclusive future for art and design in the United Kingdom,” said Steve Teasdale, chair of the Design Museum Trust and a trustee of the Biennale. “We are grateful for the museums and institutions that have supported the art and design that has been created through the Biennale. We are confident that this new partnership will give us the opportunity to create new work and exhibitions.”\n\n\nThe Jean-Marc Gabour Foundation, a Paris-based arts and culture organization, has announced the winners of its biennial awards, which celebrate innovative, design-centered work. The five winner will receive $150,000 each and will be presented with two grand prizes at an award ceremony on Friday, March 30. In addition, the foundation will donate $100,000 toward art conservation and $50,000 toward education. Gabour’s work", "The next Biennial should be held in 2022. Mitchell, who has served as chair of UNESCO since 1992, has been a UNESCO member since 2004. He was elected a prize in 2018 and is currently the recipient of the Biennial Award for his work on the theme Negative in Negative.\n\n\nThe Carnegie Museum of Art in Pittsburgh has received a $1 million donation from the Andrew W. Mellon Foundation\u0097a philanthropic organization established by John and Laura Mellon in 2007 to support the arts and cultural sector\u0097in recognition of its achievements in revitalizing Pittsburgh. The Mellon Family Foundation also announced that it will issue $1 million in grants in support of arts and cultural organizations throughout the city of Pittsburgh. The foundation also pledged $500,000 to the renovations of the Mellon Building, the David-and-Goliath of the Greater Pittsburgh region, and the Mellon Museum of Art.“John and Laura Mellon have been extraordinarily generous to the Carnegie Museum of Art and we are grateful for their vision in supporting a museum in their honor,” said Amy Schatz, president and CEO of the Andrew W. Mellon Foundation. “The Mellon Family Foundation, which supports the museum’s future with a gift of $500,000, is another step in achieving", "The next Biennial should be in 2021. \n\n\nA British artist has won the Prix d’Art Contemporain (PACE), the European equivalent of the Pulitzer Prize, for his depiction of ancient Mesopotamia. The work, titled The Ur-Site, was created in collaboration with British artist Marc-Olivier Becker. It was exhibited in the exhibition “The Basement” (2015) and “The Student and the Teacher: The Art of Marc-Olivier Becker” (2017) and was nominated for the Prix d’Art Contemporain in Paris in 2016.The jury’s decision was made after reviewing several hundred works by the artist, who is best known for his monumental sculptures and paintings, and their multiple interpretations across cultural, historical, and religious boundaries. Formally, the PACE jury created a presence that served as the the opening of “The Basement,” a twenty-one-thousand-work installation that debuted at the Basel Biennale. The jury had also given the artist twelve nominations for his work in the exhibition “A Modern Day Voyage: Mesopotamia,” which was staged at", "The next Biennial should introduce a new model of exhibition architecture designed to address the challenges, challenges, and threats of the exhibition and to foster the exhibition’s ability to engage and surprise.”\n\n\nThe Museum of Fine Arts (MFA) in Boston has received a gift of forty-eight paintings by American painter Louis Comfort Tiffany. The works, which were all in the collection of the donor, were acquired by the institution in an auction in early March. The works are part of a set of Tiffany’s works that were recently included in a major exhibition at the museum, “Louis Comfort Tiffany: The Works.”The works were donated by the artist to MFA in response to a request for works in the collection that were not in the public exhibition. The donor is a man named William E. Phelps, who lived in the same building where the donor worked as a secretary for the late textile giant Edward Conant. According to the New York Times, the late textile giant was sued by the family of Edward Conant after he died of cancer in 1979. The family settled with the family in 2005 for $50 million, but the suit was settled for an undisclosed amount in an additional $30 million for the donor, who also received", "The next Biennial should commence in 2022 and will feature twenty-two works on paper by seventy-six artists from fifty-eight countries.\n\n\n \n\nThe Museum of Fine Arts (MFA) in Boston, Massachusetts, has received a $10 million donation from the John D. and Catherine T. MacArthur Foundation in support of its reinstallation of the museum’s collection in the wake of the pandemic. The funds will go toward the installation of additional artworks, including a four-minute video installation by artist Mouaz Nouri, whose work is currently on display in “The Surreal Struggle: Art and the Politics of Affect” (2019), and a performance series by composer Sean Kelly.The foundation also announced that it will award $5 million in grants to arts organizations in support of the repatriation of artworks and culturally important objects from the Boston Public Museum, the Museum of Fine Arts in Philadelphia, and the Rhode Island School of Design. “We are thrilled to support this important mission in supporting the arts and preserving the collections of these great institutions,” said Richard Wright, president of the foundation. “The MacArthur Foundation is committed to supporting museums and cultural institutions in Boston, and the city of Boston", "The next Biennial should be a hallmark of the city. It will present a selection of works from the newly established Franciscan Contemporary Art Museum Miami (FCAM), which is currently under construction. The museum will include a new Kiddie’s World, a new interactive area and an expanded library that will be inaugurated by a new exhibition on the history of art, “Feminine” (2019).Advertisement\n\n\nThe Philadelphia Museum of Art (PMA) has received a gift of more than 1,500 photographs and prints by Keith Haring, a Philadelphia native and retired artist who often worked from personal images and rarely exhibited them.The gift includes two sets of prints by the artist that were acquired by his widow, Kathleen, after she died in 2016 and a collection of works that were acquired through a series of transactions involving Keith’s parents and his brother, David, who was a board member of the New York family.Keith’s son, Kimball Haring, is the founder of his own company, Keith Haring Gallery, and he has exhibited these works in various exhibitions over the years. Their father, Keith Haring Jr., is a Philadelphia native who served as a curator at", "The next Biennial should take place at the newly renovated Pérez Art Museum, in the city of Santiago, Chile.\n\n\nThe MFA Boston has appointed David Livingston as its next executive director. He succeeds Lori Efstathiou, who departed in the summer of 2019 to head the Metropolitan Museum of Art, and will begin his position in January.“David has been instrumental in transforming the MFA into a leading cultural institution in Boston, where he has transformed the museum into an iconic cultural destination for visitors, residents and visitors’ families,” said MFA director Rebecca Armstrong. “His work will continue to shape MFA’s cultural mission and expansion, while renewing and expanding the museum’s legacy. We are privileged to welcome him to the MFA.”Efstathiou’s first commission was as the executive director of the Historical Society of Boston in the fall of 2019. She transformed the museum into a center for research and public engagement with the city’s past through the acquisition of more than 2,500 objects, including rare books, maps, artwork, and manuscripts. During her tenure, the museum added more than 230,000 square feet of exhibition space and opened the historic Massachusetts", "The next Biennial should be held in the spring of 2021.\n\n\nThe University of Melbourne Students’ Union (UMV) has launched a new initiative that will provide funding and resources to students from disadvantaged backgrounds to pursue academic and professional opportunities. “The UMMV and UVMU Faculty Assistants’ initiative is a direct response to the current student experience challenges and challenges students face today,” said UMMV president and CEO Tanya Balcerova. “This is an opportunity for students to be supported through difficult times and to have a significant impact on the future of their education.”The initiative will provide grants and resources to UK students studying in the United States, Australia, New Zealand, Europe, and the Middle East who are facing financial or career-related challenges. Applicants will be asked to describe how the challenges they faced have made them reconsider their future plans, and will be given one year to think about their options.In order to be eligible for the grant program, students must be a current UMMV student or a current UVMU student; be living in the United Kingdom; and be able to demonstrate that they are willing to make a meaningful contribution to the future of the institution. The grantees will", "The next Biennial should be held at the National Guggenheim in Berlin in 2021, and the first exhibition should open in 2022. The next exhibition should be held in the autumn of 2022, and the first exhibition should open in the autumn of 2022.“We are committed to working with artists and organizations to explore how experiences, histories and narratives can inform our work,” said Dr. Naima J. Akram, president of the National Guggenheim, and a cofounder of the K22 Foundation. “We believe that a new paradigm for the exhibition can be developed in which the artist, curator, and visitor have a more positive experience in the museum and to which they can become involved in shaping future exhibitions and exhibitions. The new opportunities are endless.”The foundation will work with the artist-run space Paradigm Shift to develop a new program that will present new work by emerging and established artists. The program will launch with the exhibition “Italia in Exile: Art in Transition” in the fall of 2020. The third part of the exhibition will be “Museum Status: Art and the Modern State” in the spring of 2021.\n\n\nNew York’s Amana Biennial has announced", "The next Biennial should be held in 2021, and the current exhibition will close on July 28. The next exhibition will be held in the French city of Lyon in 2019.\n\n\nThe National Gallery of Art in Washington, DC, has appointed Holly R. Harris as its next director. Harris comes to the institution from the Smithsonian American Art Museum (SAAM), where she has served in various roles since 2008. During her tenure at SAAM, she organized the inaugural exhibition “US and the American Imagination” (2017), “Conceptual Works: 1960–1974” (2018), “Avant Gardes: Avant Gardes” (2017), and “Beyond a Pale Blue Sky: Paintings by Andy Warhol” (2018).“Holly has demonstrated an extraordinary ability to develop and administer programs that address the most pressing social and cultural challenges of our time,” said David G. Johnson, chairman of the museum’s board of trustees. “Her vision and passion for the San Francisco Bay Area and for American art and her determination to build upon the museum’s historic mission make her the perfect candidate for the role of director.”Prior to joining the museum, Harris", "The next Biennial should take place in 2020. The next Art Basel Miami Beach should take place in 2021. \n\n\nArt Basel, the Parisian fair, announced that it has received a gift of twenty-six works from the artist-run nonprofit the Plasmid Group in Moscow. The works were donated to the fair by the Russian government-controlled artist Nadezhda Škina.The donation was part of a $7.5 million award that will be presented at an inaugural event at the Museum of Fine Arts in London, which is slated to kick off on March 6. The $2 million grant is part of a $7.5 billion program of aid announced by the European Union and the European Commission in September.The series was acquired by the Russian state-backed art museum Nadezhda Škina and the Plasmid Group, which are based in the city of Nizhny Novgorod, in September 2016. The gift was part of the initiative “New Russian Emotions,” which was initiated in 2013 by the late Russian culture minister Vladimir Medinsky and was awarded to the museum in 2015. The museum then began purchasing art from the group. The first works acquired by Nadezh", "The next Biennial should be held in the fall of 2020. The next Dakshina Diarushchak Art Biennial should be held in the fall of 2021. In addition to the three previous one-day events in the city, the city also hosts an annual exhibition of works by twenty-six artists. The exhibition will be followed by a biennial of works by artists from the South in the fall of 2022. In the past, the city has also staged biannual exhibitions of work by artists from the Southeast.\n\n\nThe Los Angeles County Museum of Art (LACMA), the Los Angeles County Museum of Art (LACMA), the Los Angeles County Museum of Art (LACMA), and the Los Angeles County Museum of Art (LACMA) are among the fourteen California institutions that have announced the launch of new digital platforms and services for artists.The platforms and services will draw from LACMA’s existing holdings to create new works; LACMA’s existing archives; and LACMA’s existing collections and programs. “The new platforms and services will enable LACMA to present its collections in a new way, while continuing to have an impact on the local, regional, and national", "The next Biennial should focus on the history of the exhibition and on the exhibition’s new, larger format, which will be curated by Jean-Michel Basquiat and featuring more than 120 works by contemporary artists. The theme of this year’s event will be Life and Art.\n\n\nThe British artist Stephane Briand, whose vast body of work combines the uncanny and the uncanny-ite, has died at age eighty-nine at his home in New York. He was a pioneer of the grotesque, creating for the first time in the twentieth century a work that touched on subjects such as memory and the human body.Born in France in 1923, Briand studied at the École des Beaux-Arts in Paris, the Royal Academy of Fine Arts in London, and the Tate in London, where he was a classmate of William Kentridge and Alfred Hitchcock. He later expanded his term to include work in literature and painting and first met Hitchcock at a French film festival in 1944. It was not until 1957, however, that they began working together, and only the next year, 1958, would the two begin collaborating on a daily basis. Their first project together was the experimental installation for the magazine Newsweek, a surrealistic,", "The next Biennial should probably be held in the autumn. It will be the latest iteration of the exhibition series, which was first staged at the Savoy in London in 1978 and has since been held in various venues in Paris, London, and New York.   Artforum has contacted the organizers of the Biennial and will update the article if we hear from them. The platform also asked the artists to participate in a points-based survey, and the fourteen participants gave their responses in full.\n\n\nThe Winnipeg Art Gallery (WAG) announced today that its new chief executive officer, Matthew DeBlasi, will step down in March 2020 to focus on the future of the institution. DeBlasi, who has been the chief executive of the museum for eight years, will take up the role of president and director of the Winnipeg–based nonprofit WAG Manitoba in August. “Matthew brings a wealth of experience to the WAG,” said WAG board chair Scott Reitz. The move follows the announcement that the museum would begin welcoming visitors from other provinces and territories, a move that is expected to be completed sometime in 2020. DeBlasi will work closely with museum director and CEO Lisa DeVries on the institution", "The next Biennial should focus on a new set of questions that have recently been raised by contemporary art: What is art for? Art means what it is, but why is it? And what is the limit of art?  In the next Biennial, it should also examine the relationship between art and the body and the life-and-death questions that are central to our existence as human beings. \n\n\nThe Pittsburgh Art Museum (PAM) and the Piedmont Foundation are collaborating to stage a retrospective of the work of John Waters in the city of Pittsburgh in 2020. The event will coincide with the Museum of Pittsburgh’s commemoration of the 100th anniversary of its founding. The exhibition will also feature works by Waters that were previously unavailable.PAM director and CEO Matt Mullen announced the partnership in a statement on Monday. “With the 100th anniversary of the Museum of Pittsburgh in mind, we felt it was important to engage with Waters’s legacy in an innovative way,” Mullen said. “It was important for the Museum to acknowledge the influential role he played in defining what a Waters retrospective might look like and how it might function.” During the exhibition, Waters will participate in a conversation with curator", "The next Biennial should be held in 2020 and will include the work of twenty artists, including Alex Ray, Emma Bridget, Ishikawa Takashi, and Kaoru Hayashi. The biennial will be hosted at the Museum of Modern Art in New York, and will draw from a collection of more than 1,600 works, which was acquired by the institution in 2019.\n\n\nThe Museum of Modern Art (MoMA) in New York has issued an apology and compensation fund to the families of three of the four living victims of the terrorist attacks that took place at the museum on Thursday, December 14. The three victims are Suellen Ibarra, who was working on a piece for the institution’s exhibition “Beneath Strangers” when she was murdered by Long Island Railroad police officer Peter Liang; her mother, who was working on a show about American Indian history at the time; and her sister, who was working on a show about the early history of the Center for Modern Art in New York.According to the New York Times, Liang and his partner, Bridget, were responding to a disturbance call when they arrived at the museum around 7:30 PM on Thursday night.", "The next Biennial should be held in 2022. \n\n\nAdditional artists that have won the National Book Award this year, as well as in the past: Anish Kapoor, Anna Atkins, Brianna Blue, Chantal Blais, Catherine Coppola, Dene Barone, Jennifer Chiu, Marion Conroy, Nicole Harrup, Léa Corder, Natalie Johnson, Wangechi Mutu, Xiaofang Shi, Elizabeth Stoll, Elizeu von Uffner, and Anna-Lauren Walley.\n\n\nThe Jackson Pollock Foundation has received a gift of fifty-one artworks from collectors and institutions around the world. Led by artist, philanthropist, and philanthropist Jean-Marie Decheve, the Foundation partnered with the Jackson Pollock Foundation to receive thirty-one works from the collection of the Banff Museum of Art. The works were donated by Paul and Courtney Lyon; Robert and Jane Lyon; M. Paul Meehl; Charles and LaToya Meredith; Charles and Jacob Meehl; and Charles and Mira LoSasso.In addition, the foundation also", "The next Biennial should be held in 2020. \n\n\nThe Museum of Contemporary Art (MoCA) in New York has appointed Laura Haddock as its new associate director of contemporary art. Haddock comes to the museum from the Andy Warhol Foundation, where she has been working since 2011. Previously, she served as associate curator of material arts at the Museum of Modern Art in New York and as an assistant curator at the Museum of Modern Art.Haddock is responsible for organizing the public program and will take the helm of the museum once the museum reopens in 2021. Previously, she served as an assistant curator at the Museum of Modern Art in New York and as an adjunct art historian at the University of Pennsylvania.“Laura Haddock’s experience and expertise in contemporary art and her dedication to bringing it to the widest possible audience will ensure that MoCA’s contemporary art program continues to advance and thrive as a center of artistic excellence,” said director Christopher Scoates. “MoCA has incredible artistic and historical significance within the city and region, and her appointment complements the museum’s existing legacy of challenging the boundaries of the museum and advancing new approaches to contemporary art.”Previously, Haddock worked on the retrospective program", "The next Biennial should be held at a location that has a permanent‐built-up exhibition space, and in this way form a new platform for exploration of the new work. American artists, ­including John Crowley, Robert Irwin, and Richard Anuszkiewicz, as well as visiting artists from all over the world, should be included. The nonprofit is also looking for $30,000 to create the exhibition “Away from the Wind,” which will include works by artists addressing issues such as climate change, migration, and the environment, and will open on September 8. The exhibition will then return to the city in 2020.\n\n\nThe Solomon R. Guggenheim Museum in New York has appointed Heather Wiles as its next chief operating officer. Wiles previously served as chief executive and director of the Whitney Museum of American Art, where she helmed a number of initiatives including the O.J. Simpson Foundation, which built the Simpson Museum in New Orleans, and the Solomon R. Guggenheim Museum in New York. She will now assume her responsibilities at the institution, which celebrates its fifteenth anniversary this year and is currently undergoing a $200 million expansion. “In recent years, Heather’s leadership has", "The next Biennial should be held at the Museum of Contemporary Art, Shanghai (MMACC), on the People’s Bank of China’s new capital, the Shanghai Museum of Fine Arts (SMMFA). The third and final exhibitions will be at the Haus der Kunst, Munich.\n\n\nThe National Art Museum (Namma) in Bangkok and the Art Museum (Minh-i Pais) in Phuket, Thailand, have received a major $241 million donation from Sonal Namdari, the wife of a former Thai prime minister, who now wants the temples to be recognized as cultural sites.In a statement on Monday, the National Gallery in Bangkok said the donation was made in recognition of the Nifty’s recent exhibition “Belonging to India: Contemporary Art from the East.” The gift was also made in support of the Hirshhorn’s upcoming exhibition “Nature of the Future.” The National Museum in Bangkok plans to present the work in 2021.Sonal and her husband have been working to push for the recognition of the Nifty’s cultural holdings in Thailand for over a decade. The couple first brought four works, including “Aswatip", "The next Biennial should be held in 2021.\n\n\nThe Tate’s board of trustees has voted to remove artist Matthew Higgs from its curatorial team, effective immediately. The move followed a tumultuous five-month period that saw several staff members at the Tate lose their jobs in the wake of the Covid-19 pandemic.Staff voted to strike unless the board agreed to an offer of work by Higgs—who will continue to represent his studio in London and its Tate subsidiary Tate Modern—on February 10, 2020. The board accepted that the artist’s offer of representation was genuine but said that “[it was] not sufficient. It also stated that they were ‘not prepared to adopt a proposal that does not include the artist’s personal involvement.”In a statement, the Tate said: “This was a difficult decision for everyone involved, but the board of trustees felt it had to be made in the best interests of the museum. The board of trustees felt that Higgs did not represent the values of the Tate, and that the board of trustees should have had the final say on his future. The board of trustees also felt that Higgs was not taking the job seriously enough.”The board", "The next Biennial should feature a selection of works by the country’s most celebrated contemporary arts workers, including Timurid artist Anwar Farukh and Ottoman architect Ismail Haji. A selection of works from the artist’s past should also debut in the exhibition.The first stage of the bid, which has been organized since 2007, is slated to run from May 13 to May 20, 2021. The second stage will take place from May 20 to May 26, 2021. The third and final stage will be held from September 6 to September 9, 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it plans to turn the former Warner Bros. building into a center dedicated to the study and exhibition of work by the legendary avant-garde American painter Bernard Berenice. The center will be named after the late artist and will be inaugurated by a Berenice-designed and constructed monumental installation, the occasion of which will be September 26.“Bernard Berenice: Tethered Souls\" is a deeply personal project,” said Petra Andreotti, MoCA’s director. “It is an ambitious undertaking, one that will entail a bold and challenging reimag", "The next Biennial should focus on “A Good Life,” a 2018 exhibition organized by a group of British artists and curated by a group of American artists. The Biennial will return to the city in 2022.\n\n\nThe Philippine Museum of Art (PMA) in Manila, Philippines, has appointed two new members to its board of directors: Marco A. Paz Jr., who previously served as the director of the museum, and Lucio A. Barba, whose practice spans photography and performance and includes works such as “Ain Jibzon” (Ain’s Hole), 2014, a portrait of the late actress and singer Rosario Roca, who was one of the main inspirations behind the 1965 feminist protest movement that challenged the country’s conservative government.“We are thrilled to welcome these two visionary young men to our board of directors, and to see how they will complement our curators, our staff, and our board of directors,” said museum director Jose Rizal. “These two gentlemen are trained in the art of photography and both will add to the visionary power of the museum, and encourage it to grow into a truly global institution.”“Being able to", "The next Biennial should be on the Ιs’s 2000 edition, “Digital Life and Art in the Twenty-First Century,” which will take place in the Uffizi Gallery in Rome next March. This year’s event will be the first in the city since 2013, when the center—founded in 1952 by Giacomo Cattelani and Antonello Cattelani—spoke to a crowd of some 3,500 people. The biennial will once again include works by artists and activists from around the world. Last year’s event was held at the Casa del Popolo in Venice, which is currently undergoing a €50 million renovation and reopened in January.\n\n\nThe Dahl Center for Contemporary Art, Baltimore, announced today that it has received a gift of forty-four works by thirty-one artists from the Richard and Arlene Dahl collection, which comprises works from the late American artist Richard and his wife, Arlene, who were mostly undistinguished until their passing. The Dahl collection is the largest collection of American modernism to emerge from the late American artist Richard and his wife, Arlene, who were both born in Brooklyn in 1940, and includes works by Julio Cortazar", "The next Biennial should focus on how art can be used to address social and environmental issues, and on the inclusion of Indigenous artists in this endeavor. The 2020 edition is being organized by the Art Basel Hong Kong and will run from February 10 to February 13. The theme of New Hope: Art and the Struggle for Democracy, which is a subset of the theme of Biennial 3\u0097Democracy and Art in the Struggle for Democracy, will be \"The Diaoyus and the Diasporas, ” and the Art Newspaper will publish the first part of the series later this month.In an open letter published by the protest group ArtAsiaPacific on February 24, protesters called for the resignation of Hong Kong’s chief executive Carrie Lam and the city’s legislature to be convened to discuss the region’s future relationship with China. “The Chinese government is committed to supporting Hong Kong’s autonomy, sovereignty, integrity, and territorial integrity; this includes a pledge to recognize the region’s independence, sovereignty, and territorial integrity,” the letter reads. “This will inevitably trigger Hong Kong’s political leaders and officials to engage in aggressive policies to undermine democratic rights in", "The next Biennial should take place in 2022 and will take place in the Haus der Kunst in Bern; the exhibition will be organized by the University of Bern and the Museum for Modern Art; and the first show will premiere in January 2024.A selection of works by around forty artists from thirteen countries will be presented in the exhibition. The selection consists of works by American artists as well as works by artists from the Middle East and Africa. The works will be presented in biennial-like settings such as at the Haus der Kunst and the Museum for Modern Art, which will each have a unique exhibition. Judging from the list, Biennales of California, Mexico City, and Venice should be the most successful entries.The Biennial of British Artists will take place in March 2020. The Biennial of Contemporary Art will take place in March 2020. The full list of participating artists can be found here. \n\n\nThe artist-run space SpaceBath, which was shuttered by the owner of the controversial space Jade Straps in July, is back at it. The New York–based nonprofit plans to reopen the space with a new group show, titled “The Cleaning Up,” in early December. The event will", "The next Biennial should focus on the study of women’s and gender studies in Italy and the United Kingdom. Its inaugural exhibition, “The Body in Everyday Life,” will be staged at the Italian archaeological site of San Blas and will be displayed for the first time in the city of Florence. The exhibition, which was organized by the Italian cultural ministry, will include works by young and mid-career artists such as Rosaria Catellani, Anna Cappo, and Irina Di Stefano, among others who have participated in the first edition.The Biennial of the City of Venice will be aimed at addressing the current state of the art in the Venice architectural landscape, which the organizers say is currently being practiced in an “unacceptable and cynical” way. The Biennial of Venice will also take a look at the changing role of architecture in contemporary life, and will examine the relationship between architecture and art in the city. The Italian pavilion is dedicated to the collection of works by Italian artists, including Cinelena Gherardi, Dario Focardi, and Paolo Catellani. There is also an exhibition of work by Italian artists in the exhibition “Arts of the Near", "The next Biennial should be held in 2020. \n\n\nThe Los Angeles County Museum of Art (LACMA) has purchased art from the renowned student group the Notorious B.I.G.E.N. (Bring Your Own Nude; Now, Now, BIP). The acquisition is part of the organization’s huge fundraising drive for the museum. The group aims to raise $1.5 million to create a new exhibition space in the amphitheater and is urging the Metropolitan Museum of Art and the Metropolitan Opera Museum to donate artworks.The donation will open an additional space in the museum, which is currently closed since March 13, 2020. The organization’s biennial “Behind the Face of the Picture: BIP in Concert 1959–1965” will also reopen. It will be held at the institution in January 2021. \n\n\nThe Museum of Modern Art (MoMA) in New York has revealed that it plans to remove Shelby Antonio, the notorious curator who installed over seventy works within the museum’s Walls of American Art building, including The Scream, 2004, a work by Mexican artist Terri Bock, and The Sirens, 2014, a performance by", "The next Biennial should open in 2022 and will be the first to span twenty-six years. It will be organized as a series of exhibitions organized in a fashion similar to a museum’s collection show, similar to a museum’s presentation. It will also follow a biennial calendar incorporating the biennial’s theme, its subjects, and its location.\n\n\nTehran, Iran, has announced that it will resume construction work on a new International Museum of Architecture in the capital city in September. The institution, which was halted due to the coronavirus, was supposed to open in May. The news comes amidst continuing concerns over the coronavirus outbreak in the country. The pace of construction work and the coronavirus outbreak have caused tension between the government and the country’s architects.“We are glad to announce that we will resume construction in September,” said Zahra Jawad, director of the Ministry of Culture. Jawad said that the Ministry of Culture has received approval from the High Contractors’ Association of Iran (HCAAI) to resume construction work, and that the construction team will receive new certificates of completion within a few days. She added that the ministry is confident that the construction", "The next Biennial should take place in the latter half of the year, and the next will focus on the relationship between art and history. Both the museum and the city of Santa Monica are currently revamping the historic Alamo Square, and will present a new type of exhibition, called an Art & History Biennial, that will focus on twenty-first-century issues.The World Art Biennial will be in Tokyo for the full year of 2022, and will be held on the second floor of the Nippon Budokan in Ginzu. The theme will be “Art of the Future.” The biennial will showcase work by artists and organizations based in twenty-six countries and territories, and will focus on contemporary issues such as climate change, reproductive health, and the environment. The next iteration of the event will take place in the city of Osaka in 2021.The 2019 edition featured work by forty-two artists, including Agnes Martin, Judith and James LeBlanc, Gustavo Dudamel, Emma Horn, Manfred Machete, Gere Kavanaugh, and Rayyane Murad; the exhibition concluded with an installation by the artist Bettina Paz.“This year’s World Art Biennial will bring together a", "The next Biennial should be held in the autumn of 2020. In the meantime, the long-awaited exhibition of work by the legendary American artist Anton Chekhov will be staged at the Institute of Contemporary Art in Prague in the summer of 2022.The Duke and Duchess of Cambridge are among a number of wealthy philanthropic supporters of the University of Cambridge, including the Anna and Andrew Carnegie Collection (Australia), José Andujar (Mexico), and the Grosvenor and Storrs Gates Foundation (UK), which have pledged to match the proceeds from the sale of the twentieth-century Russian master Andre Gabor’s monumental artworks.While the works in question range from Neue Lischkeit (1934) and The Time Machine (1939), to Constructivism and Iconography (1939), to Modernism and Symbolism (1939), to and’s late master Anton Chekhov, the artwork is a collaboration between the royal couple and the Institute of Contemporary Art (ICA), the London-based nonprofit. The work was created in collaboration with the Institute’s curators, artist-in-residence, and staff. Participating artists include Terese Bakhtiar, Erika Balsom", "The next Biennial should address the legacy of the early 20th-century’s United States, including how the art of the 1960s and 70s was not reflected in the art of the next decade. To learn more about how to help the exhibition proceed, click here.\n\n\nThe Museum of Modern Art (MoMA) has appointed Megan McArthur as its next director. She succeeds Carolyn Hammar, who retired in March 2019 after 15 years at the institution.“As the first director of MoMA, Megan has been instrumental in the museum’s transition from a private museum to a publicly operated institution, and has proven herself as a leader and visionary leader,” said John Laursen, chair of the board of trustees. “It is with great enthusiasm that we welcome Megan to the curatorial team and the board. We have had the privilege of working with Megan for nearly two decades and can’t imagine a better person to lead MoMA through this massive transformation.”During her tenure, McArthur has organized more than 120 exhibitions, received over $30 million in grants, and developed and implemented new programming that engages the public through a variety of artistic and cultural channels. She has also developed and advocated for a retrospective", "The next Biennial should be held in 2020. (The 2019 edition, which was filmed in a castle in the West Midlands, was staged in a former convent in the city.) \n\n\nThe Smithsonian American Art Museum in New York has appointed Mark B. Jenschke as its next executive director. B. James Lee, the current director of the Museum of Fine Arts (MFA), announced his resignation in the spring of 2019 to focus on the transition to a new leader. Jenschke joins the institution from the New Museum, where he serves as director of educational programming and curator of contemporary art and design. He succeeds Suzi Minter, who departed in the summer of 2019 to head the Schlesinger Fund, which supports artistic and cultural initiatives in the arts.“The past year has proven that Mark has the temperament, the vision, and the organizational skills to successfully position the museum as a global leader in the field of American art,” Minter said in a statement. \n\n\nA group of artist-run institutions in China have launched a campaign to reopen the country’s long-closed factories in an attempt to ease the economic hardship caused by the pandemic. According to Artnet, the initiative is being spearheaded by", "The next Biennial should be marked with a dedicated exhibition of work by a selected group of artists, organized in collaboration with the newly established institution. It should also display the work of a selected collection of works by the Biennials.The bid for the 2019 edition, which was adopted by the Biennial Board in September, was made in collaboration with the sixty-five-year-old architect Norman Foster. The catalogued exhibition will be inaugurated by a new work by artist and sculptor Robert Irwin, which will visit the museum to the east of the city and will open on January 29, 2020.A selection of works by Foster, including his rendition of the theme “Revolution: The Retrospective” which is scheduled to open on December 18, 2019, will also be exhibited in the museum’s reopening exhibition, “Norman Foster: The Complete Works.”A selection of works by Foster’s daughter, Penny, which will go on display in a new exhibition, “Norman Foster: Creation of a Body,” will also be presented in January 2021. The show will be accompanied by a new film, “Annie,” which will be made in partnership with Foster’s wife,", "The next Biennial should be in 2020. Many things could go wrong, but I think it will be okay. I am really excited about it.” The biennial will apply contemporary techniques and create a series of performances in order to examine the relationship between art and life: in order to find a balance between aesthetics and life, the museum will have a virtual reality experience, a virtual event space and the biennial will have a museum-like academic space.The Los Angeles County Museum of Art (LACMA) is preparing to host the second edition of the Art of the Gathering, which will take place in Los Angeles from September 21 to September 27, 2020, at the Moscone Center in Santa Monica. The program will include residencies in both New York and Los Angeles and will explore themes such as the nation state, the environment, and the convergence of contemporary art and contemporary life.Dr. Martin Luther King Jr. once said: “The main thing in this world that is essential to life is art. . . . If life cannot be obtained by art, if art is not the basis of life, then life cannot be created.” In an interview with Barbara Walters in 2001, King said: “I think we still have a", "The next Biennial should be held in 2021. The announcement follows the reopening of the biennial in 2022, which will be the first time the exhibition has been open all year, since March 2020. The new pavilion will be inaugurated by a performance by the newly created Japanese contemporary rock group Takuya Tange, which will be followed by a conversation with the artist Yoko Ono. The new seating arrangement will also include a new area devoted to photography, films, sculpture, and video.Inaugurating the pavilion will be a panel discussion with the artist Jay-Z and rapper Lil Wayne about water. The exhibition will also feature a new work by the artist and will feature three new works by the contemporary painter Ahman Saad, a new artist-in-residence, and a new installation by the artist and his wife, the former Weimar sculptor Wolfgang Noth; the inaugural exhibition will also be in a larger format.\n\n\nThe Ziegfeld Museum in Berlin has appointed Lacerea Leonhard, a German curator who has worked in Berlin and New York, as its next director. Leonhard will assume her new post in January 2021. She succeeds Kirsten Saar, who has served as", "The next Biennial should be held in 2022. David Moberg, a professor of art history at the University of Bonn, Germany, who has organized the exhibition, wrote in an article published by Artforum in October 2017 that the forthcoming edition “will be new, exciting, and full of life.”\n\n\nThe Works in the exhibition “The Felt of Greed: Art and Intention in the Power of Art” at the Jean Georges Muret in Paris was closed on August 5 after the venue, which is next to the Louvre, received \"a considerable explosion of tremendous power.\" The explosion was caused by a fire that broke out in the exhibition’s temporary space on August 5. The firemen who extinguished the blaze, which had been contained by the time the building’s permanent counterpart, the Louvre Médaille, was also able to extinguish the fire at the museum.The firemen, who were called to the Louvre on August 4, arrived at around 3 AM and found the building engulfed in flames. The Louvre Médaille was also damaged in a fire that broke out in the building’s basement on August 4. The blaze was extinguished", "The next Biennial should be held in 2020 and will be curated by Haus der Kunst Berlin, Haus der Kunst Stuttgart, and the Berlin-based studio Artforum. The exhibition will showcase the work of twenty-eight artists, including Sérgio Arruda, Jacinta Cifuentes, and Aline Büttner, and will run from April 9 to April 13. The exhibition will also include a retrospective of the work of artist Alighiero Campante, and a selection of works from the collection of the German artist Adam Schwendener, and will be presented in conjunction with the biennial biennial.The full list of participating artists is as follows:ArtforumArtforum AwardWinnerSérgio ArrudaSara de la PeñaRingo de SouzaSun TzuYuan-PingZinon Huojuang (China)Zoé Pleasant (United Kingdom)Stuart Taveras (United States)Temarakonda (India)Stuart Taveras (United States)The Contemporary (New York)The Fiery Heart (New York)Elton James Best (United States)Artforum AwardWinnerPari Dukovic (Croatia)Pari", "The next Biennial should be held at the Museum of Modern Art in New York, which is currently closed after it closed to the public last June due to concerns around Covid-19. David Zwirner has also tapped Michelangelo Antonioni to design its new home, which will be located in the city of New York’s Central Park. The sculpture museum will employ a combination of digital and physical artworks for the museum’s upcoming exhibition “Beyond the Portrait.” The next iteration of the Mark Rothko Biennial will take place at the Solomon R. Guggenheim Museum in New York in 2021. \n\n\nThe five permanent curators of the forthcoming biennial “Between the Sun and the Moon,” which will feature thirty-five works by seventy-five artists, are Timothy Greenfield, Bonnie Glaser, Mark Boyle, and Peter Cook, and they announced the group’s tentative dates for the exhibition. The artists will arrive in Los Angeles, New York, and San Diego on September 9.“I’ve been privileged to curate and work with artists such as Tilda Swinton, Michael Kline, Billie Tsien, Toma�", "The next Biennial should draw from the current collections of the Museo de Arte Contemporáneo in Madrid and the Museo de Arte de Madrid. The museum will also be hosting a number of works that were created with the support of local and international donors, including Luna Lajeunesse’s Contemporary Painters’ Collection, created in collaboration with the Lajeunesse Foundation. The Biennial will be themed “Analysisme des Disciplines,” and will take place at the Museo de Arte de Madrid.\n\n\nThe Metropolitan Museum of Art (the museum) in New York has received a $2 billion donation from the Rockefeller Brothers Fund and the Tucson Museum of Art. The funds will go toward the construction of the first phase of the Met’s new $450 million, 1,800-seat, art-world outpost, the Metropolitan Museum of Art, and will also support the construction of the project’s massive new central gallery, which will house the museum’s collection, audience, and programming.“This is a landmark year for Met, and one of the museum’s most consequential years,”", "The next Biennial should be the most ambitious and the most ambitious exhibition in the history of the city. We are determined to show the Biennial in its full glory.”The Final Design is a design that will take its name from a famous painting by the artist Walter de Maria, titled The Second. De Maria was born in the town of Placita in the Cordillera de Aloia in 1888 and moved to Barcelona in the early 1940s. He continued to work in the city, where he taught at the Abu Dhabi Institute of Art from 1948 to 1949, and to live and work in Barcelona until the 1960s. His works are currently on view in the exhibition “Feminine” at the Abu Dhabi Museum of Art.“We are very proud of our decision to present the second Biennial here in Barcelona,” said León del Castillo, the director of the Abu Dhabi Museum of Art. “It is a historic and a great monument, and we are honored to be able to dedicate such an important exhibition hall to it. The design of the exhibition hall and the building is conceived in the first place as an institution for the dialogue of contemporary art and architecture, and in the second place as an extension of", "The next Biennial should take place in the spring of 2021, and the fifty-eighth in the spring of 2022. The biennial will highlight the work of women artists and will pay tribute to the biennial’s artists, who range from the Stedelijk Museum’s Jock and Svein to artist-in-residence Atif Miah.Inaugurating the fifty-eighth Biennial will be the biennial’s inaugural edition in Hong Kong\u0097a special exhibition intended to celebrate the seventeenth anniversary of the Hong Kong Art Museum, the Hong Kong Art Museum and the Hong Kong Art Museum Association, which is currently undergoing a major expansion.The twenty-fourth edition of the Grand Prix will be staged in 2020, and the event’s forty-fifth biennial will be staged in 2022. “The Grand Prix is proud to show the work of the talented and internationally acclaimed contemporary artists, and to support the work of those whose work we admire,” said Marcelo Claure, the artistic director of the Grand Prix and the Grand Prix London. “The Grand Prix awards a prize for excellence in its category, and we are honored to receive the prize for this category, which", "The next Biennial should be held in the spring of 2020. The first was held in the fall of 2019 in collaboration with the artist-run studio Nectar, which is currently being restored by the artist-run nonprofit the Bronx Museum of the Arts. The next edition of the biennial will take place at the Museum of Modern Art, and will feature seven works by the exhibition’s twenty-five artists, including Anselm Kiefer, A.J. Versova, Chantal Pinchot, Elvira Pindell, and Elisa Rivera.The biennial’s opening will be celebrated with a reception at the Museum of Modern Art on Tuesday, March 8. The biennial’s exhibition “The Edge of Tomorrow” will be presented by the artist-run studio Nectar, the Museum of Modern Art, and the Department of the Environment, and will open on the Museum of Modern Art’s Grand Canal, where it will be the backdrop for a new public art project, “NADA. The Edge of Tomorrow.” NADA’s works are currently on view in “The Edge of Tomorrow” as part of the biennial’s First", "The next Biennial should focus on “the art of the body” and will not be a “reconstitution” but an “uprising of a new kind.” The festival, which will be held in the city of Venice from March 11 to March 13, 2020, is being organized and developed by the Venice Foundation, the city of Venice, and the city of San Marco, with the support of the family of sculptor Renzo Piano.The first edition of the biennale, “Forty Years of Biennials,” was launched in 2007 by Simona Bruguera. Bruguera and Michele Fusi, then the executive director at the foundation, created a special section for biennials in the foundation’s online catalogue. The project was part of a larger cultural initiative called the Venice Initiative.The initiative created a new space for contemporary art in Venice and is credited with helping to spur the city’s revitalization. Since 2007, it has also been a platform for collaboration between local artists and international organizations. The Venice Foundation and the Venice Speziale have partnered with the Museo del Artes, the city’s cultural center in the Seville", "The next Biennial should take place in 2020 to coincide with the 60th anniversary of the United States. \n\n\nThe Palais de Tokyo in Paris has received a gift of twenty-two works from artist Frederic Auguste Gilman, who passed away on June 22 due to complications arising from cancer, reports Le Figaro.The donation includes works from the artist’s collection that are currently on exhibition at the Palais de Tokyo (POM), the French capital’s museum of modern art, and are expected to be moved to the institution. The works are part of an exhibition that examined the relationships between art and technology.Among the works that have recently arrived at the museum are three works on paper created in 1964 by Gilman and three works on paper created in 1980 by the artist. The museum also previously received two works by Gilman in the form of a gift from his wife, Nell, in 2016.The works, which were donated by the artist to the POM in 2016, were on paper created for the artist’s show “Technique.” The show, which was staged in June, was one of three new exhibitions organized by the Paris-based artist and was organized in cooperation with the municipality of Paris", "The next Biennial should be held at the Grand Palais in Brussels in 2020. In the meantime, the institute is planning to introduce an online-only version of the exhibition. The biennial will be hosted by the same artist-run platform that gave rise to the European Space and will be led by the same curators, Martin Lintels, Bertrand Goldberg, and Christophe de Margerie. The exhibition will start on January 21 and run until March 21, 2020.\n\n\nThe Salle Pompidou in Paris is planning to open a modern art museum in the capital’s Saint-Denis district in 2021. The institution, which currently has space in a former munitions factory, is now collaborating with the city of Paris to ensure the work of contemporary artists, designers, musicians, and writers can travel freely in the city. The proposal is part of a larger plan to open a new museum in the city in 2020 and has received the approval of the city council, which approved the plan last November. The salle Pompidou has now put out an invitation for the public to apply for a fifty-year lease of the building.“We are optimistic about this project,” Vincent B", "The next Biennial should be held at the Museum of Modern Art in New York in 2021. Source: Artnet News<|endoftext|>The NYPD is proposing legislation that would give the public and the media more legal protections against police violence. The legislation—originally introduced by state senator Joseph Bruno, who represents parts of Brooklyn and Manhattan—is currently being investigated by the city’s legal department. If passed, it would give New Yorkers more than 180 legal protections, including the right to sue for $100,000; to initiate legal action for $150,000; and to sue for an additional $300,000.If the legislation is passed, it would also require police departments to obtain warrants before searching people’s homes or businesses; give local and state governments the authority to reduce bail amounts; and establish a fund to compensate plaintiffs who are awarded back wages or damages.“This is a crisis that affects us all, and it is up to us as a community to address it,” Bruno said. “It is my hope that this legislation will send a clear message that when police abuse is exposed, that this type of behavior is unacceptable and will prompt a change of heart by local, state, and federal officials.”The bill", "The next Biennial should be held in May 2021. \n\n\nHans von Tripp, the mayor of Berlin, has appointed Sven-Gottfried Schellnhuber as the city’s first director of cultural affairs. Schellnhuber comes to Berlin from the German state of North Rhine-Westphalia (NRW) where, since his appointment, he has led the city’s promotion of contemporary art and culture. He began his new position at the German capital at the end of March, the same time that the exhibition Art Berlin 2020 will open.“The city of Berlin is an economic and cultural powerhouse, and the future of Berlin-Frenghafen and the city of Berlin-Frenghafen together with the city of Berlin is at the heart of Hans’s vision for the future,” said Mayor Klaus Regenschlüter. “I admire his ability to create and shape an important and dynamic cultural scene in a city of more than 1.2 million people and to bring it to the city of Berlin. I believe he has the experience and the beliefs to bring this project to life.”Schellnhuber also said that he is confident", "The next Biennial should take place in Alserkal Ave. in Reykjavík and the island of Åland. In the summer of 2019 the exhibition will be hosted in the museum’s new space on the second floor. Its next edition will be held in April 2020.\n\n\nThe Central Library of Ontario (CLPO) in Thunder Bay, Ontario, has appointed James Sargeant as its next executive director. Sargeant comes to the institution from the Reading Room, a platform launched by Daniel H. Pink, the organization’s executive director, in 2004. The platform hosts original works by artists such as Nina Simone and Robert Irwin. Sargeant succeeds Kiki Smith, who departed the institution in March 2019 to head the Uffe Küngenberg Foundation in Stockholm. “James is a gifted communicator with remarkable vision who has built a strong reputation for himself as a champion of artists and for his ability to support them through difficult times,” said Julia Gibbons, the institution’s director and CEO. “We are grateful for his outstanding work over the past eighteen years and for the opportunity he has provided to CLPO throughout his career. We are also grateful for his leadership", "The next Biennial should open in 2021, and the first in 2022. The commissioning committee consists of Yuki Yanomatsu, director of the Museum of Contemporary Art Tokyo; Shinichi Nakayama, a curator at the Museum of Contemporary Art Osaka; and director Yoko Shimomura.The exhibition was curated by Masao Uchiyama, head of Katsu Gallery, and produced by Katsu in collaboration with the ART Centre of the National Museum of Art in Tokyo. The seventy-one-year-old designer was commissioned to create a new series of works for the biennial, which will showcase a unique collection of contemporary art from Bay Area.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has released the 2018–19 season schedule for its new building, the Museum of Modern Art (MoMA), which will open on August 29, 2020, and will continue to operate as an independent institution until at least 2021. The new museum is the brainchild of billionaire collector, philanthropist, and architect Jonathan Zittman, who bought the former Sears building in 1992 and turned it into a private museum with a permanent collection of more than four hundred works.According to the Los Angeles Times, MoCA director Jane Panetta told", "The next Biennial should be called the twenty-ninth. Many of today’s artists are not yet at this stage, yet we want to work with them as much as we can.” Her loss is felt across the contemporary art world, where many are planning their fiftieth-anniversary celebrations around this month. “In the interest of celebrating the twenty-fifth anniversary of the Biennial, we are planning to hold an exhibition of work on the twentieth, and we are planning to spend time this year celebrating the twenty-second,” said curator and director Andrea Lippi.Gibson, who curated the first Biennial in 2001, said: “I’m disappointed in the decision to cancel the show. The show was fantastic and was very much needed by many galleries who were unable to participate in the biennial. The show was the first in Milan since 1989 and was a landmark event in the history of the Italian art scene. The show was also a watershed because it was at a time when most galleries were still in the process of coming to terms with the loss of their artists. I hope the show will inspire others to think about the artists who have died and think about what they could be doing", "The next Biennial should take place in 2025 and will be co-chaired by François-Xavier Bière and Gérard Bière. The museum will host the event concurrently with the Paris Olympics, which will take place in 2022. One of the shows that will be presented at the event will examine the “influence of cinema and painting on our lives and on the world around us.”Carlos Maestri, a professor of art history at the Faculty of Architecture at the University of California, Los Angeles, told the Los Angeles Times that the exhibition will assess the impact of films and video games on the human body and will be organized in a “more abstract way.”The exhibition will be hosted by a team comprising João Brindisi, director of the Museu de Arte de São Paulo; Michelangelo Marzo, the curator and director of the Museu de Arte de São Paulo; Amada Cruz, the director of the Institut de Arte de São Paulo; and Marcella Carelli, the president of the Museu de Arte de São Paulo. The curator will also be collaborating with the other artists featured in the exhibition and will host an online version of", "The next Biennial should be held in 2020. \n\n\nThe Pérez Art Museum in Madrid has unveiled its design for its next exhibition, titled Un Projeto, which will be held in the space formerly occupied by the National Museum. Featuring work by thirty-one artists, including Kehinde Wiley, Harry James Emerson, William Eggleston, and Willem de Kooning, the exhibition will take up themes such as memory, statelessness, and memorylessness, and will explore the enduring paradoxes of memory and memory itself.“In a world where memory is at the center of everything, where it is the foundation of everything, where it is the building block of everything, where it is the secret of everything, we are faced with an unprecedented period of history,” said Pilar Dallam, the president of the Pérez Art Museum. The exhibition includes works by forty-three artists who have lived in the city of Madrid for at least fifteen years, including Francisco Canete, José María Berrí, Elvira Caceres, Ana López-Vélez, and María Berrí. The exhibition’s inaugural exhibition, which will be relocated to the ", "The next Biennial should go ahead, but only if the board of trustees of the fair determines that there is a risk of a breach of the Exhibitionist Agreement, and that there is an urgent need to address the situation.The trustees are expected to make their decision by the end of May, with the opening of the exhibition in December. The board of trustees must decide on the exhibition’s location and the artistic direction of the exhibition in a two-to-one vote, with one-to-one majority approval required for a new edition of the fair.\n\n\nThe museum in Melbourne has put out an open call for a new director, following the departure of Tony Brown, who was the head of the institution for more than twenty years and oversaw the country’s cultural heritage, partnerships and programs with the Royal Origin Foundation. The appointment of Christopher Christian as interim director was made on May 24. The announcement followed the coronavirus outbreak in which more than 1,500 cases have been reported in Australia from April 25 to May 6, and the coronavirus isolation of the Royal Australian Pavilion; the National Gallery of Australia; and the Museum of Contemporary Art Australia (MCA).“Christopher Christian has shown significant leadership and vision in transforming the", "The next Biennial should also reflect the region’s evolution as a major international destination for contemporary art. Many of the artists and organizations represented in the exhibition will be familiar to visitors from the Los Angeles County Museum of Art (LACMA)—the LA County Art Museum, the LACMA Museum of Art, and the Los Angeles County Museum of Art (LACMA) are among the institutions that have staged the exhibition previously.The Biennial will also be able to retain a significant amount of the Venice Architecture Biennial legacy by introducing a series of collaborations between the LA County Museum of Art and the San Diego Museum of Art and by expanding the scope of the LA County Museum of Art’s exhibition space, the Visitor Experience, to include a more collaborative exhibition format. An additional initiative is to create a new, additional 150-seat venue for the Venice Architecture Biennial, which will take place inside the existing Curia building on the ground floor of the building and will inaugurate with an exhibition of work by the LA–based contemporary artist and curator Amedeo Modigliani.\n\n\nThe Michigan Institute of Arts (MIArt) has appointed Margaret Campbell as its next executive director. She succeeds Michael J. Fox, who retired in", "The next Biennial should focus on creative theory and its impact on the development and interpretation of art, the body, and subjects matter, in the career of the artist, and in the life of the artist. “The Future is Now: Art and the Body in the Presentation of the Artist” will organize a series of exhibitions focused on art and bodies and their symbolic relationships with environmental and social problems, and will present the question “What does it mean to be an artist, to be a body, to be alive, alive in the world,” according to its inaugural lineup.The iconic works from the exhibition will be highlighted through a two-hour program, “Towards a Future Past: Art and Body and Self in the Presentation of the Artist” (tentative title), which will run May 18–May 21, 2020. The program will be organized in collaboration with Dr. Uma Bharti, the director of the Department of Art, Art of Life, Culture, and Arts at the University of Delhi, and Sushil Sarna, the world director of Art of Life, Culture, and Arts. The project is part of the ongoing rethinking of the contemporary art body and the exhibition", "The next Biennial should focus on “social justice,” the petition states. “We ask that the Museum continue to present a central role for socially conscious art in the future. Feminist and anti-racist art is central to challenging systems of oppression and building the possibilities of human flourishing. The collection should continue to reflect the dedicated expertise and commitment of the curators and present some works by artists from marginalized communities.”The petition is organized by Karen Hoberman-Davis, the executive director of the Association of Independent Curators who have been active in the art world for decades, and her colleagues from the Independent Curator’s Alliance, and is supported by the National Endowment for the Arts (NEA); the Robert and Mary Abraham Foundation; and the Robert and Mary Bechdel Foundation.\n\n\nThe German city of Baden and the Swiss Federal Office of Culture and Arts have announced that they are working together to create an area of the Berlin Art Museum (BAM) where visitors will be able to see the works of the artist-in-residence, Nils Stolle, and other artists living and working in the city. The initiative is part of a plan to preserve and promote the works of the city’s", "The next Biennial should focus on “natural processes,” the invitation reads. The first exhibition will feature three paintings by Anthea Bernier: The Vanishing Museum, 2017, which is a two-dimensional display of historical photographs; The Other World, 2018, which is a series of photographs of the landscape of the Haus der Kunst, Munich; and “The Hanged Man,” 2018, which is a series of drawings by Rainer Baer, one of the founders of the Museum of Modern Art. Both Bernier and Baer are among the few living artists to have won the Prix d’Art Moderne (Paris), the prestigious international prize for art.\n\n\nThe Neue Galerie in New York has appointed Amy Bourke as the new head of its curatorial and design department, which has helmed the museum since 2009. Bourke comes to the institution from MCA, where she has served as a curatorial assistant since 2011. She succeeds Catherine O’Connell, who retired in March 2019 after fifteen years at the helm of the institution.“Bourke’s work has been recognized with the Art Museum’s “Bourke Show,” which was", "The next Biennial should be held in late May/early June, and will announce a winner by June 30. The Boston-based nonprofit, which will make up half of the $250,000 prize\u0097the other half donated $150,000\u0097will then decide which artist should receive the full sum of the $250,000. ArtPrize has also awarded $45,000 in scholarships to six emerging artists, including the Detroit-based artist and activist Sione Iyengar, who will receive $50,000 in support of his work in the form of a lifetime achievement award, and three artists whose works have been selected for the 2019 biennial in collaboration with the prize jury\u0097Anna Atkins, Monir Shah, and Suzan-Lori Parks.\n\n\nThe National Gallery of Canada is revamping its sixteenth-century National Gallery of Art in Ottawa, Canada, where it is currently constructing a new exhibition space and massive expansion, in the hope that it will attract more visitors to the institution and increase its museum’s collection. The redesign, which will be completed in the spring of 2021, will include new public spaces, a larger collection, and more exhibition space, including a new pavilion.“We", "The next Biennial should focus on: “The intersection of art and politics in postcolonial Africa and the Caribbean.”The full list of participating artists is as follows: Armstrong & Hudson, New York/New York, New York, New YorkABRA, New York, New York, New YorkAspen Institute, Colorado, New York, New YorkATC Museum of Art, California, California, California, CaliforniaBAM Museum of Art, New York, New York, New YorkBIS Museum of Art, New York, New YorkBIS Gallery, New York, New YorkBIS Gallery, New York, New YorkBIS Gallery, New York, New YorkBIS Gallery, New York, New YorkBIS Gallery, New York, New YorkBIS Gallery, New York, New YorkBI, New York, New York, New YorkBIS Gallery, New York, New York, New YorkBIS Gallery, New York, New YorkBIS Gallery, New York, New York, New YorkBIS Gallery, New York, New York, New YorkBIS Gallery, New York, New York, New YorkBIS Gallery, New York, New York, New YorkBIS Gallery, New York, New York", "The next Biennial should organize a panel discussion about the current state of the artist’s work, with a view to a future exhibition of his works in some of the galleries at the museum. The project should also include an exhibition of works by artists outside of Germany.Munich Art Museum (MAM) is also looking to engage with the public in a number of ways. In a public statement, the institution expressed its optimism over the biennial’s prospects. “We are hopeful that this year’s exhibition, the digital platform and the digital program will help us reach new audiences. We hope that this exhibition will stimulate new thought and new solutions about the collection and exhibition of contemporary art. We are hopeful that this exhibition will show a new generation of craft and architectural artists in Germany.” The institution also emphasized the importance of the exhibition of the work of the biennial’s artists to Germany. Its upcoming exhibition of Damien Hirst’s work and a presentation of works by the first artist to be included in the biennial’s exhibition, Erich Segal’s The Scream, will be hosted by the museum on September 22.\n\n\nThe Museum of Contemporary Art (MoCA) in Los", "The next Biennial should be in 2020, but will be held in late 2021 or early 2022. The exhibition, which will feature work by seventy-nine artists, will also feature a new translation of the artist’s first book, The Light of Life, which will be published by the National Gallery of Art in Washington, DC, in 2022. The 2020 event will be held at the Noguchi Pavilion in the Cooper Union, where the biennial will premiere the artist’s new work, Luna, in February 2021.\n\n\nThe City of Portland has approved $600,000 in city funds to help the embattled Layne Elliott Gallery, which was forced to close in March after a dust-up over a $1 million bid for a new building, with a relocation to an adjacent facility when it shuttered on March 16, the Oregonian reports.The request for $590,000 in city funds came from the Arts and Culture Committee\u0097a group of city council members who sit on the City Council’s planning and design committee, which is chaired by Councilmember Lisa Bender. The committee voted 5-4 in favor of the request, but only after it voted 8-5 to reject the request for $", "The next Biennial should take place in London in 2021 and will be co-organized by the Museum of Arts and Design and the Royal Shakespeare Company.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it is opening a new digital platform and hotline to help artists and collectors in need in the city. Called the MoCA App, the service will provide visual assistance and will offer free digital support 24 hours a day.“Working in a city as vibrant as Los Angeles, we are always mindful of the needs of our artists and their collections,” said museum director Marc Straus. “As we seek to address meaningful and growing gaps in our collections, we are excited to launch an App that will support our artists through this challenging time.”The service, which will be developed in partnership with the artist and collector community, will provide visual assistance in finding works by artists and collectors, including the likes of Andy Warhol, Norman Rockwell, and Frank Gehry, as well as how-to guides, catalogues, and artist proofs. It will also offer general advice about estate planning and financial planning, and will include daily viewing and voice mail support.“We believe that art is an essential tool for healing and", "The next Biennial should take place in 2020, with a conclusion date of 2021. The third and final sections of the exhibition will come together in 2021. The third part, set to open in 2022, will be held at the property in the town of Marmara on the coast of the Red Sea. The second part, set to open in 2024, will take place in the town of Tartus.  The eminent fashion designer, and the founder of the ethically and artistically ambitious label Third Line, Nabil Eljamani, has announced that he will be leaving the company after a twenty-five-year run, in order to return to his native Lebanon.Eljamani, who is currently based in London, announced his decision to depart in an email to his fifty-seven-year-old daughter, Zahra, on May 30. He wrote:I want you to know that I am very much aware of the challenges I am facing at the moment. I am also very much aware that the future of fashion and art in the Middle East is very much in doubt. However, I believe that fashion has a long and proud history in the region and I know that you, my daughter, are the strongest and most dedicated", "The next Biennial should be held in 2021 and should take place at the Rock—the site of the biennial's inaugural event—in the Rock’s auditorium. The next iteration of the Art of the Future exhibition will take place in the building’s courtyard in 2020.The building, which is currently home to the Thirteenth Biennial of Contemporary Art, will soon become an installation space that will house the Thirteenth National Art Biennial. The event will be hosted by the University of California, Los Angeles (UCLA), and will bring together 150 contemporary artists and art historians from twenty-two countries, including the United Kingdom, Australia, the Netherlands, and Japan. The biennial, which was established in 2002 by a group of UCLA students, will begin in 2022 with the Thirteenth Art Show in London.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that Christine Box, who came to the institution in 2006 from the Museum of Modern Art (MoMA), will be the next chair of its board of directors. In a statement, the institution noted that Box has served on the board of directors since 2017. She succeeds David Holmgren, who retired in February 2019 after seventeen years at", "The next Biennial should aim to focus on the history of the exhibition and the exhibition, as well as the exhibition, and, where appropriate, the exhibition, in order to bring about a change of outlook and a recognition of the incomparable value of the work.”The Biennial of the City of Sydney’s work will also take a more ambitious approach to reconstruction. “The next Biennial of Australian Art will strive to be a history of human movements,” Nicole Rampell, the curator of the upcoming exhibition, told Artnet. “The exhibition will include a new conceptual approach to travel and to the exhibition, which will include works by emerging and established artists from Australia and New Zealand.”\n\n\nArtforum has learned that Filippo Bellotto, a director and founder of the Italian architectural firm Domenico Bellotto, will be named the next chief curator of contemporary art at the Venice Biennale. Bellotto has been working at the museum for twenty-five years and will assume his post on the short term. The announcement follows a ten-year extension of the curatorial team’s mandate, which was expanded to include a new chapter, “The Future of Art,” which was organized", "The next Biennial should be held in 2021.The festival will also continue to take part in smaller and more direct forms of engagement with the worlds that surround it, with a symposium and exhibition in the coming months, for example, and will hold exhibitions in future years.  This year’s festival will mark its centenary, which will coincide with the centenary of the founding of the Royal Society of Edinburgh. The event will be held across eleven venues, including the Royal Festival Hall, which has hosted the event since 1912; the Edinburgh Festival, which has witnessed its fairs since 1977; the Edinburgh Art Gallery; the Edinburgh Film Festival; the Edinburgh International Book Festival, which was held here in 2012; and the Edinburgh Book Festival, which was held here in 2017. Inaugurating the event are the sixty-fifth and sixty-ninth editions of the Edinburgh Book Festival, which will be held at the Royal Festival Hall from October 26 to November 7. The biennial will continue to host events and events across the year, with the Edinburgh International Book Festival, which will be held at the Royal Festival Hall from September 21 to September 23, 2020, and the Edinburgh Film Festival, which will be held at the Royal Festival", "The next Biennial should be at least six months behind schedule. That doesn't mean it won�t be a successful event. I can promise you that. But it will probably take longer.” For a preview of the schedule, click here.\n\n\nThe Museum of Contemporary Art (MoCA) announced today that it is reopening to the public in two weeks. The institution, which has been closed since March 27 due to Covid-19, reopened on March 28 with a special exhibition commemorating the centenary of the outbreak. The opening was marked by three major public works: the new, larger LaGuardia Terminal, which is being constructed to accommodate the museum’s growing collection of modern and contemporary art; the installation of the second exhibition, “Performances of an African American Narrative,” at the LaGuardia Terminal; and an exhibition featuring the earliest works by African American artists.“We are excited to welcome you back to the Museum of Contemporary Art and look forward to the opening of our new LaGuardia Terminal on September 29 and the Museum of African Art in the fall of 2021,” said museum director Jason Reitman.\n\n\nThe National Sculpture Garden in Washington,", "The next Biennial should be held in December 2021. Since the exhibition is not scheduled to end until 2024, the organisers have announced that the event will run through March 22, 2022. The first iteration of the Biennial was staged at the Tange Gallery in Copenhagen in March 2014. It was followed by Diana Foundation in New York in May 2015 and the New York Public Library in March 2016.  The first exhibition of the Museum of Modern Art in New York in more than twenty years was staged at the Museum of Modern Art in September 2017, with the renovations of the building and the installation of a new collection space. The current exhibition, titled The Body of Work, features work by eighty artists and has been curated by artist-in-residence Harald Szeemann, curator Tanya Cortina, and curator Mike Kelley. The programme will be hosted by the Fondazione Biennale di Lombardia, which has also announced that it will focus on the work of emerging and established artists, in partnership with the Fondazione Silvestro Lombardia\u0097the Venice Architecture Biennial is slated to take place in 2025\u0097in Italy, for a twelve-day run of the exhibition", "The next Biennial should take place in 2021.\n\n\nThe production of art and visual art in the West is no longer sustainable, and the problem is getting worse. In a recent study conducted by the Art Fund, the Art Gallery Trust, and the Tate, over four hundred arts institutions in the United Kingdom are predicting losses as high as £100m if no immediate change is made. In a further report, published last month, the Art Fund predicted that losses could be as high as £130m.The dire predictions have spurred an urgent review of the country’s £7.5 billion budget, which is being held by the House of Commons culture, media, and sport committee. In a statement published on Thursday, the committee praised the government for releasing £1.4 billion from its autumn statement, but questioned whether the funds should have been used to make the arts’s cultural sector more efficient. The UK’s artistic and cultural sectors are already suffering from a severe financial blow following the Covid-19 pandemic—the British Film Institute (BBC), the National Galleries, and the Tate are among the four major UK arts institutions that have announced that they’ll close permanently unless major changes are made.\n\n\nThe Anne", "The next Biennial should be held in 2021. For the United Kingdom, Artforum has reached out to both Tate and the Ministry of Culture for a comment.\n\n\nThe British Film Institute (BFI) in London has released revised guidelines for the exhibition “Love and War,” which will open at the institute in 2020. The new guidelines, which were issued by the BFI and the National Association of Theater and Video Editors (NatoV), outline the steps for participating in the exhibition, which addresses the theme “Love and War,” and how to present the project to the public.The guidelines were developed in collaboration with the renowned visual arts historian and curator Jane Silber, who will serve as the official bibliographic adviser to the exhibition, and will be released this week. The exhibition will be curated by Chantal Ackermann, director of the House of Expressionists in London, and will include work from fifty-three artists, including Hong Kong-born Renzo Piano, Art and the Body, 2018; Martine Syms, 2016; and William Kentridge, 2015.The biannual exhibition aims to introduce the public to the works of forty-three contemporary artists, including Daniel de Kooning, R", "The next Biennial should also decide the fate of the neglected Aspen Museum of Art, which was completed in 1974 but never reopened. On August 3, the museum expelled the Norwegian who was behind the project and ordered him to reimburse the government for the cost of restoring the institution. However, the Norwegian Ministry of Culture and the Norwegian Council of the Arts (Næstfors) rejected the decision, arguing that the museum had already accepted the proposed reconstruction and that a new building would have been constructed even if the museum had not withdrawn its support. The controversy has led Taylor to claim that the decision was politically motivated.The art historian Jocelyn Kistner, who served as director of the institution from 2005 to 2011, has also called for a new exhibition. “The museum has been overbuilt and needs a complete rethink,” Kistner told the Art Newspaper. As the costs of rebuilding the Aspen Museum of Art mount and the museum no longer has the funds to pay for the necessary renovations, Taylor said: “This is an issue of affordability, not politics. The best way to solve a problem this complex and expensive is to make the best of the existing situation and build something new that will be more sustainable and sustainable with", "The next Biennial should be held during the Islamic holy month of Ramadan. The event will include a virtual reality exhibition, an interactive performance and an open-studio day.“We are thrilled to be opening the new Biennial in the month of Ramadan, which is one of the most sacred months for Muslims,” said Ahmed Saeed, director and CEO of the Biennial Foundation. “This year’s theme is ‘Reemergence,” and the first part of the event will focus on the role of art and architecture in reimagining human history. The second part will be a retrospective of some of the most important, and most recent, exhibitions at the Biennial. The exhibition will be divided into five sections, with the first half opening on September 29 and the second half in October.The 2019 event was curated by Nima Lattis, director of the Tate Modern in London, and David McAllister, director of the Pavilion Museum in the City of London. The event will also feature a new painting and sculpture by the Chinese artist Wang Dacheng, entitled Ask Your Self, and a performance by the Swedish artist Lena Alagna, titled Eli, which was chosen by a jury of cur", "The next Biennial should take place in the spring of 2021. The next edition of the Greater Washington, D.C. Biennial will take place in the fall of 2021. The biennial will also be relocated from its current location in Northeast Washington, DC, to its new home in the capital of the United States, and will begin in 2022. The relocation, which is part of the $8 billion undertaking to remake the National Museum of American History, was announced by Secretary of Education Betsy DeVos in the spring of 2018. The move was made in the hope that the museum, which plays an important role in the history of the nation, would be ready to reopen by the fall of 2021.Meanwhile, the National Gallery of Art in Washington, DC, has announced that it is opening a new space in its former space at 2510 14th Street in the arts-loving district of the District of Columbia, which has been home to the museum since 1987, in the fall of 2020. The newly renovated museum will offer audiences a new lecture series, a new exhibition of work by new artists, a reimagined version of a late-1960s show that examined the history of the 1960s, and a new film series, which will showcase films made", "The next Biennial should be held in February 2020. \n\n\nThe Fine Art Museum of Chicago (FAM) has appointed Jodi Throckmorton as its next executive director. Throckmorton comes to the institution from the Metropolitan Museum of Art (MoMA), where she has served as director of special initiatives since 2016. During her tenure, she organized biennials NYC/Miami (2019), “Runaway,” which ran for three months and included performances, readings, and installations, and “Pony Express: The Story of an Art Museum,” a special exhibition of works by twenty-one artists, including Joelle Campion, Kiki Smith, and Gonsie MacDonald.“I’ve been a fan of Jodi’s work for some years now, and her leadership of the museum is truly inspiring,” said Jennifer Flynn, the museum’s interim director. “I’m looking forward to working with Jodi to advance the museum’s mission and build upon the museum’s legacy as a pioneer of contemporary art.”Since her appointment, Throckmorton has overseen the development of new programs and repairs at the museum", "The next Biennial should be a tribute to the enduring contributions of Bob and Donna to the Museum of Modern Art, in New York, which she became chairman and ran from 1993 to 2007.\n\n\nA group of artists, musicians, writers, including Adam D. Weinberg, Elle Parake, and Nick Cave, are launching an initiative that will provide funding, resources, and inspiration to cultural workers who are facing layoffs, job losses, or homelessness due to the Covid-19 pandemic. The platform “Support Artists” will offer free legal aid to workers whose creative practices are at risk of being disrupted by layoffs, job losses, or homelessness. “Close to one hundred artists and musicians have signed up to this initiative, and we are committed to continuing to support them,” said artist and musician Daniel H. Pink. “The artists and musicians who have agreed to be part of this platform are the backbone of the cultural ecosystem in their communities, and their stories and the stories of millions of Americans are woven into the fabric of our democracy.”As part of the initiative, the artists and musicians will create a platform that will provide free legal advice and services to workers whose creative practices are at risk of being disrupted by layoffs,", "The next Biennial should be held in the town of Dijon in France, according to Al Arabiya. The festival will also be held in Milan, Paris, and Geneva. The upcoming World Congress of Art will be held in Tokyo.\n\n\nThe London-based biennial, held each spring at the Tate Britain, has received a $10,000 donation from the Sackler family. The Sacklers first gave the institution a $5,000 grant in 2004 following the death of Leonard Peltier, who had battled cancer for twenty years. The family also initiated a $10,000 endowment fund fifteen years ago.The funds were made possible through a series of events organized by the Sacklers over the years. The institution has also raised hundreds of thousands of pounds for the museum through its charitable partnerships, including the Sackler Foundation, which has given the museum £12 million; the Sacklers Foundation for the Arts, which gave the museum £7.5 million; and the Sacklers Foundation for the Third Reich, which gave the museum £9 million. The Sacklers are philanthropists who have given the Tate millions of dollars in support of its construction; the Royal Shakespeare Company, which has given the Tate £3.5 million;", "The next Biennial should take place in April 2021.  The next Art-World Summit should take place in June 2021. As the Museum of Modern Art (MoMA) in New York reconfigured its exhibition space in response to the ongoing protests sparked by the Geffen Museum’s decision to pull its forthcoming exhibition “The Discourse of Objects,” the National Gallery of Art in Washington, DC, is also preparing to engage with protesters. The institution will hold an open forum on human rights, creative destruction, and the environment on March 23, 2020. The debate will take place in the exhibition space, which is being converted into a museum devoted to the collection and display of contemporary art, and will be hosted by Deborah Jackson, the director of the Fédération Internationale de Lettres. Jackson will serve as chair of the dialogue.Commenting on the upcoming event, Jackson said: “While I have not yet been able to articulate how we as a culture can survive the threats posed by climate change, I can tell you with certainty that this is a crisis that will not be contained by art galleries, museums, collectors, or institutions. This is a crisis for the world as we know it.”\n\n\n", "The next Biennial should be held in the fall of 2020. \n Recently, more and more museums are beginning to listen to the mounting evidence of the catastrophic impact the coronavirus has had on the global health crisis. \n For many years, the Museum of Modern Art (MoMA) in New York has led the way in the United States. But since the Covid-19 outbreak, MoMA has been working to downsize and reorganize. The museum has also been working on bringing more digital art and design into its collection and has introduced many new exhibitions and educational programs.In an attempt to become more flexible in its exhibition-making, MoMA is bringing more of its art into one of its warehouses. In an attempt to make its collection more accessible to the public, it is opening up over a thousand archives and some 300,000 works to the public. MoMA’s director, Paul Efstathiou, said: “We’re excited to unleash the power of technology and open the archive to the public. The archives will be transformed by the museum into a focus for creativity and reflection, a platform for engaging with contemporary issues, and a place for the museum to reflect on the life and work of our", "The next Biennial should give a glimpse of what life is like in the city. It should show the breadth and depth of the city’s art and culture, and it should encourage visitors to experience it for themselves. The art of the show should reflect the diversity of the city’s population, and it should explore themes such as the city’s history, its future, and its relationship to the region. The next Art for Life will be held in January 2021. The front page of the November 2017 issue of Artforum featured a photo of the Biennial’s inaugural exhibition “My Body and Other Lands,” which was organized as part of a larger exhibition entitled “Feminine/Cultural Contagions.”The show was curated by Perrin Ayres and featured works by artists such as Angela Pappalardo, Adam Pendleton, and Van Gogh.\n\n\nThe National Geographic Society’s plans to raise $5 billion to build a new national monument in the Arctic National Park have been put on hold after the American Civil Liberties Union (ALA) sued the government of Alaska and the National Museum of Alaska Native Art in Anchorage. The lawsuit claims that the proposed $5", "The next Biennial should take place in the year 2021, while the sixth biennial (to be held in the year 2023) will likely be staged in the years 2027 and 2028. “Pretending it was not happening,” said the artist. “One day, at the end, I will be able to say: ‘I am not alone.’”\n\n\nPace’s new partnership with the Art Gallery of Ontario (AGO) has been announced. Beginning with the upcoming season, the four-year-old nonprofit will host twelve exhibitions in its new space on Queen Street East, including “Theater of Operations: U.S. Army Special Forces in Northern Iraq” (2019) and “American Military and Society: From Warhol and the Art Basel” (2019).“The partnership is a continuation of the work that the organization has been doing for many years to push for greater transparency and deeper engagement between the museum and local community,” said David Scharf, the executive director of the Art Gallery of Ontario. “The new partnership between the AGO and Pace follows an important step in that direction. We look forward to working with the", "The next Biennial should take place in Athens in 2022, and the first in 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that its collection will reopen on October 19 following a $50 million facelift that included the installation of new works by a selection of contemporary artists spanning the twentieth century. The renovation—which also added a new gallery, a new lecture theater, and a new public gathering space—is part of the institution’s new strategic plan, which aims to create a more sustainable future for the museum and the Pacific Palisades.The plan—which was developed in consultation with the Pacific Palisades Neighborhood Association and the city of Los Angeles—includes the construction of a new building, a new public gathering space, the reinstallation of the museum’s current exhibition program, and the reopening of three previously closed exhibitions. The plan also outlines the creation of two new nonprofit partnerships: the Pacific Palisades Foundation for the Arts and the Pacific Palisades Foundation for the Arts (PPFA) in the form of a new entity that will receive funding from the museum.“This is a good time to build on the foundation’s 80 years of excellence with a new exhibition", "The next Biennial should be held at least annually, with the option of extending the date. The inaugural edition took place in Amsterdam in June 2019 and was attended by more than twenty-five hundred people from sixty-nine countries. The 2019 edition will be held in New York City, and the 2019 edition will be presented by the Biennial Foundation.\n\n\nA new investigation conducted by the Museum of Fine Arts (MFA) in the Bronx has found that the New York City Department of Cultural Affairs (DCLA) has removed historic works from its collection since at least 2016. While the agency has said that it is working with the DCLA to restore the works, the MFA told the Art Newspaper that it was not able to provide any detailed history regarding the removal of works at the institution. The museum, which has been working to secure the works for more than a decade, said that it is working with the DCLA to assist with the restoration of the works and that it expects to receive the works by November 2020.The study, which identified twenty-six pieces that were removed from exhibitions before March 2019, and assessed the DCLA’s handling of the cases by looking at existing museum documentation, found that the department made four incorrect assertions in", "The next Biennial should take place in Almaty, Kazakhstan, in 2021. \n\n\nThe National Museum of Canada in Ottawa is now accepting submissions for a new triennial devoted to Indigenous art. Titled DREAMING UP, and SOLDIER, the biennial will feature more than eighty works by twenty-six artists, including Ella Asbæk, Kamran Kharoor, and Khloe Dzodan, and will be staged in three iterations. Nominated for the 2019 prize were Wangechi Mutu and Lisa Rinehart, who will each receive $2,500; and Ruth Frank, who will receive $1 million. The 2019 winners were: Wangechi Mutu, Kenya; Rosemarie McKee, Canada; and Carol Lawler, Canada. The 2019 winners will be announced in June.\n\n\nThe Bechtel Arts Centre in London has appointed Taren Balsom as its new chief executive officer and director. Balsom will be responsible for helping to secure the future of the Bechtel Arts Centre, which is currently undergoing a major expansion and is slated to open in the fall of 2020. She", "The next Biennial should be held at the Museum of Modern Art in New York in 2022. So far, the first iteration of the exhibition has been held at the Brooklyn Museum in New York since March 2019. The upcoming version of the exhibit will feature new works by collectors such as Pablo Picasso, Jean Antoine Laurent, Pierre-Auguste Renoir, and Lévy Gorvy.\n\n\nThe Cassini spacecraft has completed a historic flyby of Saturn on Friday, March 5, capturing the ringed planet in its entirety as it orbited the planet in its enormous Saturn V shell. Dubbed the Cassini-Huygens mission, the historic event was made possible thanks to a $7.5 billion grant from the National Endowment for the Arts (NEA), the National Science Foundation (NSF), and the Social Security Administration (SSA).Launched in 1997 as a NASA–backed project, the mission is considered one of the most important science achievements of the 20th century. The launch marked the culmination of six years of work by Cassini scientists to understand and map the planet, a feat that involved the construction of three Saturn V rockets as well as the installation of a sophisticated geiger counter, which measures the planet's magnetic", "The next Biennial should be called off after the president’s birthday in 2020, and the 2020 edition, titled “Intersection,” will be held at the Museo de Arte Contemporáneo, in Madrid. The museum will also hold an extra-curricular, series-based exhibition, “Thinking of Rome,” in 2021.The Diadem, which will hold the 2020 edition, will be inaugurated by a retrospective of the contemporary art of Stefano Poggioli, the Italian designer and founder of the Italian brand Luchica. The exhibition consists of fifteen works by young Italian designers, including Valeria Bueno, Luca Cipolletta, and Davide Comara, and will run until March 13. The twenty-ninth edition, “The Vertical Line,” will take up the theme of the upcoming century by combining sculpture, painting, photography, video and installation. The artist’s work will be included in the exhibition, which is curated by the architect and curator Michele Follina, and will be presented in a special exhibition on the foundations of art in the exhibition. The biennial will also feature an exhibition of works by three more recent inductees", "The next Biennial should take place in 2022 and will be attended by the United Kingdom, France, Germany, Italy, and the United States. The twenty-sixth edition will be staged in London in 2024 and will be hosted by the Barbican Way in London. The theme of the biennial has been shifting, from 'life and the universe’ to 'life and the cosmos. After examining the various languages of the universe, the artist will focus on sculptural forms and transfigurations that are seemingly made of seemingly thin substances. As we enter a new phase of our lives, we are reminded that physical forms play an important role in shaping our lives and that physical images play an important role in shaping our imaginations. We are reminded that imagination is an essential ingredient for the richness of our lives, and that imagination is a powerful antidote to the darkness that surrounds us.”The twentieth edition of the Biennial was organized by the London-based, New York–based nonprofit, the Royal Institute of British Architects (RIBA), and will include works by fifty-four artists, including Olu Oguibe, Akiko Nakamura, Christine Wang, and Jia Wu. The theme of the 2020 edition was �", "The next Biennial should take place at the Gallery of Modern Art in Paris in 2021, the Art Newspaper reports, and will introduce the first major retrospective of a living artist. Its director, Sergey Gromov, told the Art Newspaper that the exhibition is a way of creating a new kind of public space for art. “We want to create a public space that is connected to the heart—a public sphere where people can come together, to hear the artist speak, to have a good time, and to see the artist’s work\u0097and that is very rare in modern life.”He continued: “What we are doing is a very radical step, but a very practical step: we are creating an environment where artists can happen regularly and in large numbers.”The next iteration of the Biennial will take place in 2022.\n\n\nThe Museum of Art in Chicago accepted an extraordinary donation of twenty-five works by thirty-seven artists\u0097from the Swarovski family in Vojas, Czech Republic, to the institution in 2017\u0097in a gift that will allow the museum to display a selection of works by the renowned Czech sculptor Stanislav Swarovski, who passed away on March 14, at the", "The next Biennial should be held in the spring of 2021 and will be organized as a biennial, not as a festival. It will take up the theme “Hieroglyphen,” referring to the phrase, “in their path and through their choices.”The three-day event will take place at the Museum of Contemporary Art (MoCA), where it has been held since 1995. Earlier this year, the museum opened its doors to the public and began hosting live performances and other events.\n\n\nThe Carnegie Museum of Art (CMA) in Pittsburgh has announced that Pamela Draper has been appointed curator of stage design and stage design as well as curator of the museum’s collection of stage designs. Draper will assume her new role at the institution in January 2021.“Pam’s curatorial career spans over thirty years, beginning at the new Museum of Contemporary Art in Cincinnati in the late ’80s, continuing at the CMA and the Museum of Modern Art in New York in the 2000s, and wrapping up with a very successful ten-year stint at the CMA,” said curator Ben Marter. “The impact that she has made on the CMA’s collection is immense", "The next Biennial should take place in the spring of 2021. The festival will also host a short- and long-term programming slate that will address LGBTQ+ themes. The inaugural biennial, which will feature a panel discussion with artists and writers, will be hosted by the Cultural Centre de la Biennale in Paris and will run from March 22 to March 29. The program will introduce more than a hundred artworks that depict LGBTQ+ identities, including works by Marilyn Monroe and Michelangelo Signorile, as well as paintings by Pierre-Auguste Renoir and Pierre-Auguste Paillard, and will include a celebration of the life and work of feminist artist Andrée Chedid and a presentation of the work of Cosmin de Garibaldi.The festival, which is supported with funds from the Centre National de la Biennale, is organized by the Centre National des Arts et Lettres (CNA) in Paris and the Institut National de la Biennale in Marseille. The Grand Prix du République, a committee of French artists, will oversee the biennial, which is supported with funds from the Centre National des Arts et Lettres. The Grand Prix du République is expected to have the final decision about", "The next Biennial should take place in Berlin in 2021. It will be hosted by the Museen Heina Berlin, which has a new building at 507 Kräppelett St., and will be held in the city’s former GDR institute, the Krämpfenhaus, which closed last year.\n\n\nArt Basel Hong Kong has announced that it will temporarily suspend the Hong Kong fairs until March 15, 2019. “For the past few months, our artists have been working hard to create a strong spectacle and to better understand the evolving art market and art trends in Hong Kong,” said Jeff Keim, CEO of the international fairs and events company. “We are deeply grateful for the artists who have participated in the fair and wish them a very good and successful 2019.”The Paris-based fair, which has partnered with the Hong Kong Museum of Art to organize the Hong Kong art world fairs, and which has been closed since March 11 due to the Covid-19 pandemic, said that it is still assessing the effects of the pandemic and has no plans to resume. Los Angeles’s Frieze Asia-Pacific fair, which is scheduled for March 14–March 16", "The next Biennial should open in 2022, when the global pandemic ends.\n\n\nCary-Bourbon County, Kentucky, has announced that it is suspending production of the landmark 1971 film Sidsel and Scear, a controversial documentary on the Kentucky Derby, as a state government building in the county east of Louisville is slated to be demolished. The announcement follows reports that the structure, which houses the city of Louisville, the state’s fourth-largest arts complex, will be razed to make way for a new $200 million public university.The announcement comes on the heels of a state report that found that 63 percent of local residents do not want the city’s public art to remain in a state of preservation, and a petition that has been signed by more than 2,500 people. The demolition of the landmark film—which starred Robert Mitchum as a black Kentucky Derby winner who is forced to leave his hometown due to racial tensions sparked by a white police officer’s death—is also seen as a symbol of the city’s racial divisions.The city council voted last month to remove the film from the complex’s current exhibition, “Mitchum and Sidsel: A Film", "The next Biennial should be held in 2021, with a budget of $3.3 billion. \n\n\nThe European Union on Thursday approved a $43 billion aid package for Greece, bringing the total amount allocated to the country by the European Union to $55 billion. The sum is slightly lower than the $57 billion approved last October, but still large enough to prevent Greece from defaulting on its debt payments. The funding will be split equally between the European Parliament and the European Commission. The total amount already allocated to Greece is $68 billion. The sum is divided into two parts—$42 billion for primary relief, which includes food, energy, and sanitation; and $35 billion for secondary relief, which includes unemployment insurance, cash grants for small businesses and freelancers, and a variety of other initiatives.The aid comes on the heels of the European Commission announcing in February that Greece would receive a total of €52 billion in aid this year, which is nearly half of its original request. The country also received €31 billion for 2019 and will receive €33 billion for the next two years. The sum is far less than the $58 billion requested by Greece in March, and it still leaves the country with a significant deficit to cover in 2020", "The next Biennial should take place in 2022. Biennials are a great opportunity to meet and work with like-minded people from across the world. The 2019 Biennial included a series of exhibitions at the Kunsthalle Basel in Switzerland, events in New York, Hong Kong, and Vienna, and was staged at a time when the exhibition had not yet been staged in the United States.\n\n\nThe Museum of the Jewish People (MoJo), New York, has received a major gift of more than three hundred artifacts from the former home of Jewish artists such as Peter Paul Gauguin, Hermann Hesse, Irving Penn, and Frank Stella. The collection includes objects dating back to the nineteenth century, including objects from the Jewish Museum in New York, which opened in 1904 and closed in 2008, as well as artifacts from the Jewish Museum in Buenos Aires, which reopened in 2012, and from the former home of American painter William C. Dietz. The gift includes six works by Dietz and three paintings by Jeff Koons, two photographs by Lars von Trier, and two photographs by Matisse.The works, a selection of works by Dietz, a German artist who studied with Koons at the university of Tübingen in the 1950"]