["The next Biennial should be held in 2022. Sueman, who is also president of the Association of Biennial Administrators, said: “I feel excited to add my voice to the growing list of artists, curators, and scholars working tirelessly to create new, vibrant, and accessible art spaces in NYC. I am confident that the new Concourse of the Americas will engage and redefine the criteria by which we select art to participate in the next Biennial.” \n\n\nThe Museum of Fine Arts (MFA) in Boston has received a gift of more than six hundred works, including works by Pablo Picasso, Gustave Doré, and Édouard Vuillard, from a distinguished donor. The donation includes forty-four paintings by Picasso, twenty-four works by Doré, and thirty-four works by Vuillard, who was a major collector of the artist’s art and whose collection includes works by Picasso, Bertram Fursch, Verne Dawson, Jean-Michel Basquiat, Frank Stella, Thomas Hirsch, and many others.The donation also includes works by Claude Monet, Monet Jr., and others that are on display in the Museum’s new exhibition", "The next Biennial should be held in 2020, and the next one in 2021. The 2020 iteration, titled Art gives way to art gives way to The Birth of Art, will take place at the Künstlerhaus in Munich and will be staged for the first time in 2019. The 2021 edition will be a retrospective of 18 years of work by the artist Bernd and Gerhard Richter, titled Suddenly & Unseen, and will be staged at the Kunstverein Stuttgart.The 2019 edition, titled Opportunities, was curated by Andreas Hofmann, and was held at the Kunsthaus in Berlin. The following year, Hofmann added a new piece by the artist to the festival, titled Museum. Kaufmann, Kunsthaus, and Biennale, and the event became known as the Kaufmann Memorial Biennale.The biennial was originally conceived as a joint initiative between the Kunstverein Stuttgart, the Künstverein München, and the Centre Pompidou in Paris. The event has since been expanded to include a number of international artists, including Roberto Barbera, Dario B", "The next Biennial should be held in 2021 and will provoke a number of conversations, including with the aim of revisiting the history of the exhibition and its underlying ideas. For now, the thirty-fourth edition will be one of the last exhibitions of the artist’s work at the venue. Completeness and interest in the Biennial can be verified by a database created by the publisher, which has a database of around ten thousand works. Artforum has reached out to the Biennial for a statement.\n\n\nThe Center for Contemporary Art (CCA), the New York City–based nonprofit that supports artists and their projects in Los Angeles, has announced that the next edition of the Center for Contemporary Art (CCA) will take place this fall. The twenty-fifth edition will cover the fall 2020–May 2021, and will be hosted at the Art Institute of Chicago. The seventy-third edition of the CCA will be held in 2020.The third iteration of the CCA, which opened in 2009, featured work by thirty-nine artists from thirty-five cities across the United States. In addition to the works on display, the center features training, residencies, and speaking engagements with artists. The fourth iteration, which was staged", "The next Biennial should be held near you.\n\n\nPace of Art, Artamp, and Ecosystems: Organizing a New York Art Biennial (2017–2018)“I have always found the Art Museum’s construction to be a remarkable example of how a single institution can organize, grow, and change,” Paul Mpagi Sepuya and Susan M. Barron wrote in Artforum. “By capturing the essence of a specific formative moment in time, the exhibition became a kind of laboratory for the show of work. It also became a kind of feedback loop for the show.”The 25th iteration of the exhibition will take place at the Museum of Modern Art in New York from March 19 to March 21, 2020. The event will mark the closing of the museum’s exhibition “The Curators” (2019) and will be attended by a retrospective of work by Patrick Bonner and a performance by Peter and Peter Antonovich. The exhibition will also present works by the artists who were invited to participate in the sixth edition of the Contemporary Art Museum St. Louis. The biennial’s inaugural iteration, “The Silver Chair,” was held in February 2019.", "The next Biennial should be the last in 2019 and will be held at the LA County Museum of Art, the Fair of California, the Los Angeles Museum of Art, and the Metropolitan Museum of Art. The theme of this year’s edition will be “Soul of a Nation: Political, Social, and Cultural Dynamics in the Early Modern Period.”\n\n\nThe National Gallery of Art (NGA) in Washington, DC, has received a gift of nearly four hundred paintings, drawings, photographs, and prints dating to the 1840s from the collection of the late collector and educator H. H. Goodman. Known for his commitment to supporting the artistic and intellectual endeavors of his fellow collectors, Goodman’s autocue, which was filled with works by leading artists of the nineteenth century, including Katharine Hepburn, Edward Heath, and Alice Cooper, was gifted by the late NGA director Jean-Michelangelo Anton. The gift includes works by such contemporary artists as George A. Lucas, John Nash, and Edward Frank, among others.“H. H. Goodman embodied the ethos of the NGA: He was a tireless advocate for the arts and a devoted student of art history throughout his nearly eighty-five-year", "The next Biennial should be held at the new site, called the Central Library, in 2019.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has renewed its contract with artist-run venue the Gold Bar and Kitchen as the venue for its next edition, slated to run from March 21 to March 23. The sixth iteration of the show, which was canceled due to Covid-19, was supposed to take place at the Gold Bar in January. However, following the pandemic, the venue announced that it would cancel the event.“We’ve been working with Gold Bar to develop new partnerships with local artists for some time,” said board chair Nari Ward. “Through these partnerships, we hope to expand our audience beyond the Gold Bar and Kitchen and offer an extended program of exhibitions, residencies, and readings. The Gold Bar and Kitchen is a vital community hub in the West Los Angeles area. We are committed to working with them to present the event as creatively as possible, and take full responsibility for the outcome.”The institution also announced that it is reopening the venue to the public on January 11, 2020. In a statement, the Gold Bar said that the event will be “cru", "The next Biennial should be held in 2020. Lehmann Mauert, the London-based curator who curated the first exhibition “The Divine Present: The Art of Philippe-Louis-Henri Berthold” in 1964, has called the current format “a disaster.” Berthold withdrew from his next show in the summer of 1968 after a series of unexpected health problems, and in the fall of 1968, his work was acquired by the British Museum. In a letter written by the curator in 1967, he admitted that the institution had been ahead of its time in its selection of the work, describing it as “a very strange collection.” The show, “The Creative Process” (1969), presented works by artists such as Pierre-Auguste Renoir, Nadella Sette, and Jacques-Louis Amlès. In a review in the December 1969 issue of Artforum, Bruce Forbes wrote: “After the Paintings and the Paintings Only, the 1967 exhibition is one of the earliest artworks to feature a rotating cast of artists. The power of the artist’s toolkit, combined with the acuity of the viewer, gives the impression of a world in which", "The next Biennial should involve a combination of new research and newly commissioned works, as well as the development of new ways of engaging with and mobilising the collections.  The Biennial History Project will produce a summary of the history of the exhibition within a year.  The Prize ceremony will take place in Geneva next April.\n\n\nThe museum in the West Bank city of Bethlehem has approved a $25,000 grant from the American Jewish community for the construction of a new permanent home for the Palestinian art that will be located in Bethlehem. In a ceremony held on Sunday, the building was inaugurated to the community in Bethlehem. The building will be 6,500 square feet and will be located in the city’s Old City.The foundation was founded by the American philanthropist and businessman Richard Sennett. Over the course of eight years, the organization received $8 million from individuals and organizations including the David Horowitz Freedom Fund, the Simon Wiesenthal Center, and the Andrew W. Mellon Foundation. Since its inception, the foundation has hosted more than 1,500 artists and artworks. Sennett plans to donate the funds to the organization as part of an ongoing effort to build bridges between the US and the PA.Commenting on the foundation’", "The next Biennial should be held in 2021.\n\n\nThe Museum of Fine Arts (MFA) in New York has announced that it is planning to cancel the 2020 edition of the biennial, which was set to take place in collaboration with the Museum of Modern Art (MoMA). The announcement follows a wave of criticism over the exclusion of black and ethnically diverse artists from the event, which was organized as part of the initiative “Race in America”\u0097a collaboration between the MFA, the Museum of Modern Art, and the Metropolitan Museum of Art\u0097which was criticized as exclusionary and discriminatory.In a letter addressed to the organizers of the event, which was penned by Anonymous, the group that initiated the boycott, the boycott was met with controversy. “The exclusion of black and gender-based artists is an issue that we raise often in our writings,” the letter reads. “This is an issue that we call ‘racism,’ which is a system of oppression that oppresses us all.”The letter continues: “We believe that this exclusionary system perpetuates structural racism: Blackness, gender-based oppression, and labor/rout/food systems as problems to be solved", "The next Biennial should take place in the autumn, with the theme “The Bolsheviks and the Social Revolution” and the first installment of the exhibition “The Berlin Exhibition of 1917” to be held at the Bezirkode Museum in the spring of 2020.\n\n\nIsraeli culture minister Miri Regev has banned the exhibition “The Politics of Destruction: Literature and Art in the Arab World,” a major exhibition that examines the “Arab world’s politics of destruction” and examines the “Arab Spring,” a 2011 uprising against corruption, war, and inequality in the Arab world, from March 2030 to March 2024. The ban was made in a statement published by the minister on Twitter, where she outlined a number of measures that will be taken to “protect and promote Israel’s qualitative advantage over the Palestinians.”“We are imposing a number of measures, including tightening security regulations and limiting movement between communities and we will continue to do so,” Regev said. “We are also reopening the territories to allow for construction and tourism. Our policy in the Middle East has changed, and our priority is to encourage the Palestinians to be part of the future state", "The next Biennial should be held at the site of the former Dar al-Ma’muç Building, the former headquarters of the German pharmaceutical company Bayer. The $61.2 million project will feature the first-ever photographic exhibition of the artist’s work in Morocco and will additionally house a courtyard and a collection hall. “We are happy to collaborate with the committee to create a platform for the cultural exchange between Morocco and Germany in such a way that this exhibit will be a success,” said Jung-Eun Kim, director of the Biennale in Hamburg. \n\n\nThe National Museum of Fine Arts (MNFA) in Cincinnati, Ohio, has received a $6.5 million donation from artist and collector Noor Salman. The gift was made in support of the establishment of the Hasan Sharif Museum of Art in the city, and the Hasan Sharif remains an unbuilt, but planned, city.The donation comes from artist and collector Noor Salman, who has been active in the fields of Islamic art, architecture, and architecture for over twenty years. Previously, he served as the director of the National Gallery of Modern Art in Riyadh, the Chairman of the Sheffield Lions Club, a trustee of the National Art", "The next Biennial should be held at the following address:The next Biennial should be held at the following address:The next Biennial should be held at the following address: Biennial for the Arts, New York: 2019February 7–March 9, 2020 For the Artist, New York: 2019February 6–March 7, 2020 For the Exhibitions, New York: 2019February 6–March 12, 2020For the Art of the Studio, New York: 2019October 26–November 1, 2020Themes: art, architecture, design, and construction; architecture and design, New York: 2019October 26–November 1, 2020Themes: art, architecture, design, and construction; and art, architecture, design, and construction, New York: 2019October 26–November 1, 2020Themes: art, architecture, design, and construction, New York: 2019October 26–November 1, 2020Themes: art, architecture, design, and construction, New York: 2019October 26–November 1, 2020Themes: art, architecture, design, and construction, New York: 2019October 26–November 1, 2020Themes: art, architecture, design", "The next Biennial should be relocated to a venue that would be convenient for the museum and for the best interests of the art. The museum is currently working towards finding a new location for the event. “I am committed to continuing to champion the archives and the archives' role as a critical platform for the advancement of the museum’s collection and reputation,” said Jack. “I am especially committed to supporting the museum’s staff and to developing new and innovative ways to provide access and greater understanding to the archives. I hope that the new venue, the biennial, and the biennial’s collection will be a model for future works by the archive and for the broader public.”\n\n\nThe Los Angeles County Museum of Art (LACMA) has released the list of the fifty artists who will participate in the upcoming eight-day exhibition “Ages of the Earth,” which will run September 24–31. The sixty-three-thousand-work collection, which is comprised of fifty artworks by seventy-five artists in the United States and Mexico, is organized as a biennial, and its theme is “The Ages of the Earth.”Each artist will have twenty-", "The next Biennial should be held in 2021.  The Biennial of the Arts was founded in 1968 to bring internationally known artists and designers together for a major retrospective. Since the show opened in 1970, it has gone on to be a platform for cultural exchange and collaboration.\n\n\nThe Temple of Art in Miami Beach has received a major gift of more than one thousand works by twenty-four artists from the National Galleries of Art (NGA). Among the works donated are works by  Franz Klam, Barbara Kruger, Ed Ruscha, and Richard Overy. Included in the program are works by Klam, Kruger, and Overy for their respective hometowns. The gift is part of the NGA’s Experience the Nation: Landscape, Landscape, Landscape, encompassing artists’ creative lives, which was established in 2002.The gift program was inspired by the NGA’s new $15 million sculpture garden, which is slated to open in 2020, and the NGA’s longstanding commitment to supporting the art of our time. The program was created in response to the NGA’s desire to develop an education and outreach program that would draw from the culture of the", "The next Biennial should be held in 2021.\n\n\nDissolved German Shepherd Rescue Group founder Wolfgang Otto has announced his retirement after twenty-six years with the organization, which he founded in 1977. He joins the Petworth Museum in London after serving as director of the Belgian-based organization, which has four locations in the U.K. and one in Switzerland, from 2013 to 2018, when he began his current role at the San Francisco Museum of Modern Art (SFMoMA), which is owned and managed by the same family that owns the building in which Otto resides.Born in Munich in 1962, Otto studied art at the Humboldt University in the East before graduating from the Max-Planck-Institut in the West in 1987. He then enrolled at the Kunsthalle Basel and the Palais de Tokyo in Switzerland; the Museum Kunstbau in Cologne; and the Nationalgalerie in Brussels, where he met and married his wife, Petra. In 2008, the couple moved to Vienna, where this year was the thirty-third edition of the grand exhibition, which featured work by sixty-nine artists, including Andre Aschbach, Adam Dallin, Peter Andre, and Wolfgang Eikmeier. In 2017,", "The next Biennial should take place in November 2021.”\n\n\nThe eleventh edition of the Dhaka Triennale, which was canceled after a fire broke out at the venue on Saturday, has been rescheduled for November 22. The event, which was held at Dhaka’s stately Dhaka Culture and Arts Complex (DCAC), will now be held at the city’s Pirelli Stadium. Costumed performers, including Amitabh Bachchan and Ming Wong, as well as a number of international galleries, will once again participate in the event, which was originally scheduled to take place in mid-November. “This is a critical moment for all of us, as we continue to recover from the coronavirus, and re-emerge as a vibrant community in the midst of a global health crisis,” said Dhaka’s mayor Ritzana Bumra. “This is an unprecedented and challenging year for Bangladeshi culture, and we need to work together to build on the themes and the spirit of the Dhaka Triennale, whether it is through a exhibition of new works by emerging and established artists, or through a workshop series around the", "The next Biennial should have been held in 2021 and was supposed to be one of the largest exhibitions in South Africa. Its organizers decided to cancel the event after it was announced that one of the artists who was to perform at the event would be a 17-year-old boy named Dzegede Tshabalala, who was arrested for allegedly stabbing an eight-year-old boy to death in February 2018. The show’s organizers cited safety concerns as the reason for the cancelation.When the show’s organizers learned that the boy who was allegedly involved in the stabbing was not charged, they decided to move the trial to a different judge and transferred the case to another court. The court heard that the teenager was adamant that he was not responsible for the death of the boy, but he was acquitted in May of 2019 after a retrial. Tshabalala was sentenced to eighteen years in prison but only served four years because of the death penalty; his conviction was overturned in 2017 and he was set to receive the death penalty again in 2020.\n\n\nAndrea Dutton, the British Museum’s director of contemporary art, and Neil MacGregor, the museum’s director of contemporary art plus contemporary art, have", "The next Biennial should be held in April 2021. \n\n\nThe Museum of Fine Arts (MFA) in Boston has added six new members to its board of trustees: Michael Hanlon, who will serve for one year; Mark Borthwick, who will serve until 2020; and John F. Kennedy Jr., who will serve from 2021 to 2023.Board president Alistair Scheinberg announced the appointments at a board meeting in New York on January 31. In addition to Hanlon, Borthwick, Kennedy, and Linda Maxwell, the board also elected Kennedy’s son Josh as trustee.Kennedy also appointed Stefanie C. Kremer, president of the Victorian Institute of Art, to serve as interim trustee, and John T. Flynn, chair of the board of trustees, to serve as chair.While the board has already approved the Museum’s new five-year strategic plan, it is still working out how the institution will pay for the bulk of its $300 million expansion, which will also include a branch in the city’s Charles Village. The new trustees will oversee the newly formed Trustees for an interim period of six years.“We are pleased to", "The next Biennial should aim to present a contemporary and multi-cultural vision of the city, incorporating a new narrative about the city’s past and contemporary, leveraging the local, collaborative and inclusive elements of the city’s historical architecture. Its themes should incorporate architectural and design elements from throughout the city’s history and from the city’s architectural heritage, as well as from the local and contemporary artists, designers, designers’ organizations, universities and institutions.”The third and final Biennial will focus on cultural memory and the city’s relationship with its former home, the city of Rome. The theme of the third biennial is “Memory and Memory” and will be “about making sense of the past and about moving forward.” The theme of the final biennial will be “about creating visionary possibilities for the future.”Commenting on the exhibition, Giaga said: “The project of this edition of the Venice Biennale is to make the Venice of today and the Venice of tomorrow as impressive as the Venice of the early twentieth century. We have created and extended a city that is proud to represent the city of Venice. We have provided the city with a new channel for the", "The next Biennial should take place in 2021 and will be on a larger scale, with a greater number of participating artists and institutions, and will be organized as a combination of a festival and a series. In 2020, the exhibition will cover a greater range of themes, including the body and its functions, the soul and its functions, and the body and its functions as a medium and a source of spiritual energy. “I am enormously excited to be working with the talented team at the Biennial and to continue to shape the exhibition program for the Biennial as part of our mission to present contemporary art in a creative and inclusive way,” said László Šuliński. “It is a great honor and privilege to collaborate with such a talented and dedicated team of curators, and to see how their creative vision and vision for the exhibition program impacts the subjects and the works exhibited.” The show will open in September 2020 and will run until March 2021.\n\n\nNew York–based artist Gavin Brown—who, for years, created works that deal with issues of race, gender, and social justice—has died at age seventy-eight. His work has been exhibited at the Museum of Modern Art, the Museum of", "The next Biennial should be held in 2021.\n\n\nThe City of New York has announced that it has awarded a total of $500,000 to more than 2,140 artists and creatives since it launched its $15 minimum wage campaign in October 2016. The $5 million raised during the three-month campaign also helped to secure the expansion of paid sick days and disability benefits.Among the grants awarded are $100,000 to artists Rachael Andrews, Kelly Block, and Shanani Hardin for their artworks, and $125,000 to Ayelet Roden, Mary Catherine Barlow, and Robert Mapplethorpe, who collectively won $100,000 for their collective works. The three winners were chosen by a jury comprising Kate Shivashankar, head of the City’s art and design programs; Andrew Broderick, a former MacArthur Fellow; and Kate Mather, a former editor of Artforum.The city’s grant recipients are listed below:ArtistsTarek Atoui-Asher Varnado, New York CityToronto, Ontario, CanadaTarek Atoui, New York CityToronto, Ontario, CanadaTarek Atoui, New York CityToronto, Ontario", "The next Biennial should be in the third half of the year, as we are currently constructing the exhibition. \n\n\nThe City of New York, which is working to relocate the Whitney Museum of American Art in the capital, has appointed Carol E. Meehan, who has served as assistant director of the Metropolitan Museum of Art since 2009, as its first senior director of cultural engagement. Meehan currently serves as an independent curator in the institution’s studio and is looking for a new role within the museum. “Carol E. Meehan is an accomplished and talented curator whose work has been recognized by both the American Association of Arts and the National Association of Art Museum Directors, and whose curatorial practice has received strong support from the likes of Chris Rock, Sarah Jessica Parker, and Chris Ware,” said Cynthia D. Williams, the new commissioner of the Metropolitan Museum of Art. “Her curatorial practice spans both traditional and contemporary art, and she is uniquely positioned to play an integral role in maintaining and expanding the Whitney’s collection and mission.”Meehan will assume her new post on January 20. Previous to joining the Met, she was the director of curatorial affairs at the independent", "The next Biennial should begin in 2020 and last for twenty years. The first exhibition will be held in the museum’s contemporary wing, at the Kavala, in the capital of the southern state of Kerala. The museum’s director, S. K. Rizzo, said: “Karunanidass has been developing in partnership with other artists and institutions in India for over twenty years. She has transformed the Kavala’s contemporary art gallery into a destination. We are impressed by her ability to express and develop a philosophical and aesthetic value system and her ability to present and develop art from an artist’s perspective. We are delighted that she will be returning to the Kavala and to the Biennial in 2020.”\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Anna Wintour as its next director. In her new role, which is slated to begin in January 2021, Wintour will oversee the organization’s transformation into a museum founded by and for the arts.“I’ve been a passionate supporter of MoMA since it opened in 1989 and have been a huge fan of its art holdings ever since I had a chance to tour Mo", "The next Biennial should be in January 2021. The 2019 event will take place at the Museum of Fine Arts, Boston, which is currently undergoing a $750 million renovation.\n\n\nThe New Art Museum (NAMI) in Miami Beach, Florida, has appointed James T. Owens as its next executive director. He succeeds Mary Anne Carter, who last month was promoted to the position of director of the Rhode Island School of Design, and will begin his position in January.“James has been instrumental in growing NAMI to where it is today, and I’m confident that in his leadership, we will continue to flourish as a center for contemporary art and design in the Greater Miami Beach region,” said Raquel Fernandez, the chair of the board of trustees.  Owens comes to the institution from the Getty Center, where he has served as a senior curator since 2013. He succeeds Carolyn M. Brown, who departed at the end of July to head the Los Angeles County Museum of Art (LACMA), and will assume his responsibilities in April.Prior to joining the Getty, Owens was a curator at the Museum of Contemporary Art, Los Angeles. He is also a graduate of the Getty’s Department of Arts and Culture.", "The next Biennial should be in 190AD and it should be about to start. We are working with an artist-run, community-driven space on a daily basis and we hope to be able to present events and activities in the coming months.”The biennial’s inaugural edition, for which it is responsible, will run from December 21 to December 29. Curated by Kunsthaus Berlin, the event will highlight the work of more than seventy artists and will include both a portion of the works by the shortlisted artists and a special exhibition of work by the new participants. The biennial will not be organized as a one-day event, but will be spread over three days. Its participants will be selected by a group of five artists, Kunsthaus Berlin, the Düsseldorf-based collective Fattal & Fitt, and the Kiasma Foundation, and will be announced in early March.Fattal & Fitt’s proposal: “The next Biennial will consist of three main events: Exhibition, Student and Seminar.” It will present fifteen new works by the students and six previously unpublished works by the artists who will be featured in the first exhibition. ", "The next Biennial should be held in 2020. The decision was made after a meeting with the participants and the next iteration of the exhibition, “Diálogos,” is currently on view at the Palais de Tokyo in Paris.\n\n\nThe two‐thousand‐foot-long, thirteen‐car, three‐wheeled exhibition “The Last Landscape” will be featured in the 2019 edition of the Hong Kong Biennale, which will stage its second edition in January 2020. The exhibition, which will be staged in the Japanese city of Nagoya on November 5–November 7, 2019, will be organized in an effort to better understand the impact of the pandemic on the environment, as well as to better understand the cultural landscape in Asia. The exhibition will also present the first public works created as a result of the coronavirus, which was first admitted in China in Wuhan, Guangdong Province, on December 24, 2015.Based on a selection of forty works created in Hong Kong between 1997 and 2017, the exhibition will address issues such as the relationship between Hong Kong and Japan, the environmental impact of the pandemic, the impact of the pandemic on China’s infrastructure, and the exhibition", "The next Biennial should focus on the art of resistance, on artists building their own lives around environmental justice and climate justice, and on the intersections of art and social practice. The 2020 edition is currently being curated by Judith and Olu Ojo. \n\n\nArtist-run nonprofit the J. Paul Getty Trust, which has distributed more than $7 billion to artists in the US and abroad over the past twenty-five years, is launching three new initiatives that will focus on cultural heritage conservation and on local communities in the future. The J. Paul Getty Conservation Initiative, which will begin in 2020 and will deliver three hundred grants to artists and small to mid-size arts and cultural organizations across the United States, has designated Art of the Future, a new grant program that will give $1 billion to artists and arts entrepreneurs in the next three years, as well as Community Preservation Grants, a new set of aid programs designed to support artists and arts organizations in the greater Los Angeles area, and Art of the Future Grants, a new program that will distribute $1 billion to artists and local communities in Southern California.“The foundations of our cultural heritage ecosystem play an", "The next Biennial should be the Berlin Biennial, the newest held in the city. The programme will be held in the former Reichstag building, which was converted into an exhibition space for the exhibition of the exhibition “Apollo 15: The Untold Story” since 1980.The event will be hosted by Hermann Heeke, the director of the Reitveld Museum in The Hague; Joachim Heeke, director of the Kwinana Institute of Art and Art Gallery in Freiburg; and Jørgen Steegmann, founder of the \"Beijing Gallery\" and the Beijing Art Museum. The event will also be organized in a space for autonomous artistic production. The arts center will be housed in a former Riga factory, with the new country-owned museum and a new exhibition space for contemporary arts.Local government representatives in the city of Berlin, which has a population of nearly three million people, are supporting the move. The town hall of Berlineriminer Strasse 19, which serves as the biennial's artistic space, informed the government of the town of Berlin on Friday. The city council also voted to extend the total run of the exhibition to twenty years,", "The next Biennial should be held at least 10 years after the goal of the past seven years of the institution. The next edition will focus on “the art of immediacy” and will run from February 19 to February 21, 2020. The 2019 edition, “Arts and Culture in the Twenty-first Century,” was curated by Craig Smith and premiered at the Venice Biennale in January.\n\n\nThe Whitney Museum of American Art in New York has dismissed eight-year-old artist Mila Pascual, who was diagnosed with cancer last March and who was scheduled to begin her second year at the institution this April. “We have long recognized the value of Mila Pascual as a gifted and fearless artist,” said Whitney director Angela Clark. “But one day she was set to begin her first year at the Whitney, and suddenly she was no longer.”Pascual, who was diagnosed with cervical cancer when she was only nine years old, was scheduled to begin her second year at the institution this April, but was forced to cancel her trip to Europe due to the Covid-19 pandemic. When queried about the circumstances surrounding her fall, she told the New York Times that", "The next Biennial should open in the fall of 2021. Its organizers have not yet said when the exhibition will return to the museum.“The exhibition is an important step in the development of the school’s artistic and literary program, and the museum’s relationship with the artist community,” said Nick Paterson, the museum’s director of exhibitions and collections and chair of the council. “It also reaffirms our commitment to the growing and innovative work of the school, and we look forward to the next exhibition.”\n\n\nThe Italian artist Stefano Cattelan, whose geometric landscape-sculpture combines irony and humor, has died at the age of eighty-five.Born in Farina, a town in northern Italy, in 1929, Cattelan spent his childhood and early teens in Florence, where he studied under Giuseppe Lelongì, who introduced him to the Venetian Renaissance. After leaving school, Cattelan moved to Rome, where he was accepted into the prestigious Fondazione Cattelan. In 1940, he returned to the Art Nouveau school in Turin. While at the school, Cattelan became fascinated by the works of", "The next Biennial should be announced in the coming months. An exhibition of works by artists and collectors aiming at a contemporary setting will be staged at another institution in the coming months. At the end of the summer, the Biennial of Architecture will be followed by a Biennial of Environmental Art, and so on.  At least ten other exhibitions are planned, including an exhibition of work by American artists. The Dreyfus Collection and the Kunsthalle Basel-Palazzo Bern have announced that they are still drawing up their first shows. The Art Institute of Chicago has announced that it will hold an exhibition of the work of Artola Panteleimon and of her Venice Biennale in September, with a special focus on her ’s Afternoon Delight, 1987–88. The show will be curated by Roberta Smith, the curator of contemporary art at the Seattle Art Museum, and will be organized in collaboration with the artist. “I’m a huge fan of the work of Panteleimon,” said Erin Oxtoby. “She’s very much, very much a part of the contemporary art scene at large in Chicago and", "The next Biennial should try to address some of these issues. We can't do it if we don't start now.”Binardi said that the Broad is committed to working with local authorities to improve the situation for the artists and organizations impacted by Covid-19 and has pledged to create a platform for community input by creating an online community forum where the public can share ideas and have conversations. He also plans to work with local academics, artists, and scholars to develop curricula and to present research in the city.Commenting on the upcoming show, which will center around artistic experimentation and the development of new media, the artist said: “This is the moment when we, as a species, begin to address the fundamental questions of our existence: How can we know what is real, what is possible, and what is beautiful, and what more can we put in a bottle?”\n\n\nThe Public Art Fund, a $1.1 billion coalition of more than sixty public and private museums and cultural institutions, is urging the federal government to allocate $1.2 billion to prevent the coronavirus—which has already killed more than 6,900 people in the United States and has sickened more than 310,000 in China—from", "The next Biennial should be a fulsome celebration of art that reflects the best of modern and contemporary. As the region’s most exciting contemporary art, we anticipate an array of new approaches and approaches that reflect the diverse histories and cultures of the diaspora.” The exhibition will take place at the Kaval Art Foundation in the city of Port-au-Prince, the inaugural iteration of which, titled “Between the Sea and the Sky,” opened in December 2019. Since its inception, the annual event has featured work by twenty-three artists and has been hosted by the Kaval Academy of Fine Arts, the Kaval Art Museum, and the Institution of Fine Arts in the Philippines (IFA).\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has received a gift of fifty-one works by twenty-seven artists, including Mark di Suvero, Fredric James Basquiat, Alex Katz, Larry Bernadat, Paul Gauguin, and Tina Fey. The works were donated by the artist-run organization the Mark di Suvero Foundation, a non-profit organization that supports artists in the Los Angeles area.Credited with a legacy spanning four decades, the artist", "The next Biennial should be held in 2021. Plans for the 2020 event are currently on display in the museum, which is currently undergoing renovations. 'Tis the season for experimentation, exploration, and celebration, and the current exhibition year is no exception, with lots to look forward to,” Thom Mayne, dean of the school of art, told BBC.The 2,374 exhibition pieces, selected by artist Richard Avedon in partnership with the Boston-based firm W.M. Hunt & Partners, will open on the museum’s new, 5,900-square-foot, biennial venue in Cambridge on September 18. The exhibition will feature work by thirty-six artists, including Arturo Di Modica, Nick Landreth, Mark Rylance, Jodi Throckmorton, María Álvarez Jiménez, and Alex Hernández.Inaugurating the museum this year, the museum is also introducing a new program that will provide visitors with an opportunity to experience the exhibition and become acquainted with the artists and their work. The program will be centered around the museum’s largest-ever exhibition of new work by a single artist, which will be held at the", "The next Biennial should be held in 2020. The rest of the articles in the series will be published from 2021 onwards. “In a world where the human genome is being rapidly altered by biotechnology, and where we are rapidly losing touch with our roots and heritage, the museum’s collection and exhibition program will become even more vitally important to us all,” said Maia. This article was originally published on December 14, 2016 and has been republished with permission.\n\n\nThe Metropolitan Museum of Art in New York has appointed Christos Goutam as the next director of its Wharton Street location, which is currently being renovated by the private New York–based firm Goutam + Associates. Goutam will assume his post on January 16. “Christos Goutam’s background and expertise in contemporary art, exhibitions and collections, and strategy make him an ideal leader as we embark on a transformative project that will reshape the Met, and the art world, in ways we cannot imagine,” the Met said in a statement. “The museum board and staff have expressed profound gratitude for his leadership and vision for the Met’s future, and I couldn’", "The next Biennial should be held in 2022.”\n\n\nThe Metropolitan Museum of Art and the New York Public Library have announced the activation of Monica and Hassan Abuja’s Body in the Mirror: Memory of an American Muslim, an exhibition that examines the intersections of art and politics in the United States. It will open on March 10 and run through October 22. The show will feature work by twenty-eight artists, including Dineo Ahuja, Salah al-Duhaydi, and Wolfgang Tillmans, as well as works by cultural historians such as Richard Black, George Daniels, and Taren G. Hauser. “This exhibition is not a political statement, nor does it attempt to critique or even to expand upon any particular issue, but instead takes a moment to consider the many facets of our own lives,” said Monica Abuja, the artist’s wife and the creator of Body in the Mirror. “It is a reflection of the individual and their own lives, a journey through their own histories, a journey through their own lives as Americans, as Muslim Americans, and as Americans in general. It is a journey of reflection, of empathy, of understanding,", "The next Biennial should be held in 2021. The new five-year plans, which were released on Monday, incorporate a number of changes such as the extension of the first phase of the festival, which will now take place in 2022, and the development of a new role for the biennial. The first phase is centered around the exhibition of work by fifty artists from twenty-two countries, including India, China, Japan, and Korea. The second phase will focus on the exhibition of works by artists from fifteen countries. The final phase will focus on “art as a universal language of social life” and will be held in the museum’s South Hall.The new biennial will welcome twenty-two artists, including Enrico Barbera (Italy), Adam Carpenter (New Zealand), Antony Gormley (New Zealand), and James Jackson (New Zealand), in its first edition, “Who Stole The World?,” in 2019. The selection was curated by David Winton, who has served as the Biennial’s director since 2011, and comprises of twenty-two works from twenty-six artists. The biennial’s second edition, “The Movie Monument,” was staged at the Walker Art", "The next Biennial should be held at least twice a year. Artists and organizations wishing to organize a special exhibition as a result of the coronavirus may contact the Australian Institute of the Arts (AIA), at AAMI, Melbourne, on 01522 7500; the Art Newspaper, Sydney, at Artist News, at The Art Newspaper, Sydney, at TAFE Gallery, at AAMI, Melbourne, and the Flemington Museum of Art, at Flemington, New South Wales, on 01506 7500.  The AIA has also created an online petition in response to the coronavirus that can be signed by people from all over Australia.  Five million people worldwide have been infected and more than 11,000 people have died from the virus.Some are wondering whether Australia should have shut down its borders and let the coronavirus spread to other countries. The Australian prime minister, Tony Abbott, has since said that it is not his responsibility to determine whether a country is taking the proper precautions.\n\n\nThe Los Angeles County Museum of Art (LACMA) has received a gift of more than 178,000 photographs by Steve McQueen, a.k.a. the Human Photographic Museum (HPM), in", "The next Biennial should begin in 2021 and run for twelve years. The host city will be chosen at a general assembly in Milan in May 2017. The exhibition will also include a new collection of works by artists such as Mark di Suvero and Steve Paxton.\n\n\nCultural Events & Festivals: The Art of the Event Media, 2018. Artists: Laura Owens, Patrick J. Adams, Rebecca Mohrmann, Benedict Baier, Sean Kelly, and Beth Lennox. Sponsored by: Art in Motion, an initiative of the Museum of Fine Arts, Boston.\n\n\nA selection of works by forty-two artists, including the American artist Andrew Lloyd Webber, who is best known for his elaborate oil paintings, has won the 2019 Pulitzer Prize. The Los Angeles– and New York–based organization, which has endorsed artists since 2003, announced that the prize was awarded for its \"deep and wide-ranging\" service to art and artmaking. It also called Webber’s work “a masterpiece of the modern era.”Bernard Strand, the board chair of Art in Motion, said: “The Pulitzer Prize is an", "The next Biennial should mark the anniversary of the Paris Peace Salon, and should focus on the ways in which art and culture have been and will continue to be used to promote peace and social justice. It should also consider the ways in which it can become more accessible to the wider public through programming that draws from local, regional, and international sources. The theme of the upcoming edition is “Away from the Camera,” and the program will be divided into three sections: “Women in Art” (May 23–June 3), “Gendered Consciousness” (May 5–May 9), and “Authenticity with an Intentional Eye” (May 24–May 29). In contrast to the exhibition “Away from the Camera,” the biennial will include an installation of new works by artists such as Jonas Åkesson from Oslo and Jonas Kauppinen from Helsinki, and an exhibition of artworks by artists such as Alex Katz, Yinka Shonibare, and Iris Seulgi.The biennial’s inaugural residency was held at the modernist El-Akhbar in the northern city of Ismailia, Egypt; the museum of modern art in", "The next Biennial should be held at the Museo de Arte Contemporáneo, Madrid, in 2021. The next exhibition should be titled “Ateliers Versions: Les Réalités” and will be held at the Museo de Arte Contemporáneo until the end of June 2020.\n\n\nThe J. Paul Getty Trust in Los Angeles announced today that Joël and Hervé Aigner will become the successors of the late art collector Lévy Gorvy, the founder of the prestigious American art conglomerate Beaux, with whom the trust has had a long-standing partnership.Hiromi Takahashi, director of the Gorvy Foundation, said: “I am grateful to the Trust and the Aigner Brothers for their extraordinary work in supporting the design and exhibition programs of the museum. I am confident that the J. Paul Getty Trust will continue to attract and celebrate the great work of the Gorvy family.”Joël Aigner, whose artworks include the work The Thirst, 1979, which won the 1978 Venice Architecture Biennale, and The Winding Women, 1996, a series of drawings by the artist Nari Ward, the", "The next Biennial should be held at the Museo de Arte Contemporáneo in Madrid in 2021. “The Museo de Arte Contemporáneo is an important museum within a rich cultural ecosystem of Spain, Portugal, and France. It is also a wonderful workshop for young artists, and for the general public,” said María José Maria Mora, the museum’s artistic director. \n\n\nThe Asian Art Museum (AAM) in Bangkok is planning to close indefinitely as a result of a financial crisis sparked by the coronavirus. The Asian Art Museum (AAM) in Bangkok is planning to close indefinitely as a result of a financial crisis sparked by the coronavirus. The institution has been closed since March 26, and the last day it will open again is October 26.According to the New York Times, AAM is planning to spend $50 million to reopen the institution, which was established in 1972 by a group of wealthy residents of Bangkok. The plan was made in order to stem the spread of Covid-19, the virus that causes infectious illness in humans. But it has caused problems with the government and with the country’s tourism industry, particularly with the planned", "The next Biennial should be held in 2021.The announcement was made at the end of a ceremony that saw scientists from the US, California, and the US Virgin Islands present their work for the first time in front of the American public. The work is an experiment that will attempt to understand how a self-generated atmosphere and its biennials could work in harmony and how this could be realized in the future.Named after the phrase “the garden of Eden”\u0097the term was coined by English Romantic writer William Blake\u0097the biennial is an effort to reflect the spiritual essence of America. The theme of the exhibition was “the interconnectedness of life and the world.” The work of the participating artists was presented alongside works by the biennial’s permanent curators, John Bishop and Abigail Harrison, and the artist Sarah O’Leary. The exhibition was organized to encourage artists to think beyond their usual mediums and to consider the possibilities of how art can serve as a means of social change.This year’s event will be held at the Museum of Art in New York from February 14–February 18. The exhibition will also be held at the Solomon R. Guggenheim Museum in New", "The next Biennial should be held in 2020. “I’m very excited to say that the spring 2020 edition of the Biennial will be on view from March 21 to March 26, with a full programme of programming,” said Mari Stegmann, the artistic director of the Biennial. The exhibition will also be streamed online and will be available for purchase for digital and physical viewing. In addition to the exhibition, the Biennial will host six other special exhibitions, “Muzio: Art in the Age of the Third Reich” (2019), “Grecian Socialism and the Turn to Late Capitalism” (2019), “The First-Degree of Homeric Art” (2019), and “Hanne of the Eighteenth Century: A Study of Greek Art and Art History” (2019).The Spring 2020 edition will feature twelve works by artist-activists, including three works by activist Vittorio Cattelan (2018), two works by artists such as Antonioni, Koons, and Vincent van Gogh (2018), and Jacques-Louis XVI (2017), and will showcase three works by artists in the United States. The exhibition will be organized as follows:The", "The next Biennial should take place in the spring of 2020. “The present exhibition,” said Hoyer. When asked why the show was canceled, he said: “We are not ready. We are not in a position to respond to the history of the place.” The exhibition will resume in the fall. 21st Century Biennial’s Director, Nan Goldin, said that the decision to cancel the exhibition was not made lightly: “We made the decision to continue with our exhibition, in part, because of the extraordinary work of the artists who participated in the exhibition and in part, because of the response to the exhibition. We made the decision to continue with the exhibition as a matter of principle, not a matter of form.” The show, which explored new ways in which art could address contemporary issues such as climate change and inequality, opened on September 14, 2020 and runs through March 18, 2021. The first game show, “Play,” was staged in March and ran through March 21. On February 18, the show opened to the public at the Museum of Modern Art in New York. The Art Newspaper reported that the newest exhibition, “Affections,", "The next Biennial should take place in 2019. A special exhibition of works from the exhibition will be held in 2022. \n\n\nNew York’s Metropolitan Museum of Art (MoMA) has received an estimated $3.2 million donation from donor J. Paul Getty. The $3.2 million donation is the largest gift ever made to the museum with the gift of “A Vision of the World”\u0097a twenty-three-foot-tall bronze sculpture by the artist Anne-Marie Adès, which is currently on display in the museum’s Christopher Gass Metropolitan Museum of Art. To date, the museum has given $1.2 million to artists, cultural workers, and organizations in support of the project.“We are delighted to accept the $3.2 million from the J. Paul Getty Trust, which is the largest gift ever made to the museum,” said museum director Daniel H. Weiss. “This is a great example of how art can transform lives, both in the short- and long-term. We are particularly proud to receive this generous gift during such a moment of great need.”The museum is currently working on a $70 million capital campaign to raise additional funds", "The next Biennial should take place in Beijing in 2022.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that actor and philanthropist George Clooney and his wife, Amal Clooney, are the recipients of the twenty-fifth and twenty-fourth annual $15-million awards, which were established by the George and Amal Clooney Foundation and the John D. and Catherine T. MacArthur Foundation and were presented by Billy Smith Associates in Los Angeles.During the ceremonies, which took place at the Santa Monica Museum of Art, the couple presented not one, but two of the longer-running works by the duo, their long-running series of architectural drawings, which spans thirty-four paintings, and their signature Landscape and Interior Art, which is a series of architectural drawings inspired by Gustav Klimt’s The Surreal Life.The works, which are currently on display in the exhibition “The Shape of Space,” will be on view in the exhibition “The Modern Landscape” in December 2020.The judges for the awards were: Ray Horton, director and CEO of the artist-run nonprofit Creative Capital, and Richard Campbell, the CEO and cofounder of the architectural firm Pritzker Architecture", "The next Biennial should take place at the Water Mill in London next October. The event will include from-scratch artists and designers collaborating with a team from the Smithsonian American Art Museum in Washington, DC.\n\n\nThe mid-’70s exhibition “Sidney Pollock: Sixty Years of Painting” (1977–1979) at the New York Academy of Art was the cornerstone of the museum’s exhibition-based programming. The show, which features works by twenty-five artists—including Jules & Simon, John Lennon, and Steve McQueen—combined the work of painting, design, sculpture, photography, and architecture to create an exhibition that reflected the diversity of visual art practices in the United States. Pollock, a longtime master of color who also taught at the School of the Arts, in New York, contributed more than seventy paintings to the series, which earned him an Oscar nomination for best painting in 1978. His paintings are now housed in the collections of the Museum of Modern Art in London, the Whitney Museum of American Art in New York, and the Metropolitan Museum of Art. The exhibition was selected by a jury comprised of Frank Gehry, Henri Ghent, and William Eggleston. Pollock", "The next Biennial should be delayed until at least the middle of the year. We must prioritize the survival of the community and the health of artists and institutions, and we must continue to support the local community, including through programming that engages with issues of sustainability, such as the second biennial of the Sisseton Sioux.”The closure of the biennial is the latest setback for the North American Indigenous Arts Network (NAIN), a coalition of organizations dedicated to advancing Indigenous arts and culture through the promotion of public policy and federal, state, and local legislation. The coalition’s board of directors voted to dissolve NAIN in January, leading to a wave of resignations and a wave of new suspensions.“This is the latest in a series of attacks on Indigenous communities and artists, tactics that continue to this day,” said Nara Adams, director of the Native Arts and Heritage Center at the Art Institute of Chicago. “NAIN and Art of the American West are under attack because we resisted the new authoritarianism unleashed under President Donald Trump. We are being attacked for our beliefs, for our languages, for our histories, for our knowledge, and for our wisdom. It is a time of attack, not a celebration.”As", "The next Biennial should be in January 2020.\n\n\nThe Art Newspaper has announced the ten artists who will participate in the forthcoming edition of the Milan Biennale, which will take place in 2021. The event will take place in the Italian city from January 22 to January 28.The top ten artists selected for the event in the upcoming issue are:Carlotta Aiguiza, Angola, Autumn/Winter: The World Is A Collection of Fragments, Bianca Sabato, Baltimore, Bowdoin College, Cincinnati, Celso di Simone, Colombia, Civita Pacquaia, Dina Tyrell, Fiona Walker, Hannah Wilke, Lydia Wilson, Perrotin, Rocco Celant, Kunstmuseum, Baden, Germany; Guadalajara, Mexico; and Dusseldorf, Germany. The upcoming edition of the flagship exhibition will also include the first retrospective of a second work by German artist Wolfgang Klee.The grand prize will be awarded to Nino Cotti, who will be presented with the Sotto Grande Prize at this year’s event. While Cotti is", "The next Biennial should last four weeks, with the opening of the exhibition \"I SEE ONLY MOSES.\" The exhibition is a program of two hundred photographs by the artist and will run until December 13, 2020.The exhibition will feature work by forty-three artists from fifty countries and will draw from the artist’s own body. Among those exhibiting are Hamedine Kane, Amina Feheri, Erika Liu, Yinka Mammadov, Sephirah Shafie, Ursula von Rydingsvard, and Yinka Yoshimoto.\n\n\nThe Asian Art Museum (AAM) in New Delhi has appointed K. L. Yen as its next director. Yen replaces Manoj Thapa, who retired in March 2019 after a decade as its director after he expressed concerns about the reinstallation of a statue of the late Indian artist KC Chandrasekhar in the institution.Chandrasekhar was one of India’s most celebrated contemporary painters, whose work was included in the first AAM exhibition organized by the Delhi-based artist Subhash Chopra. Thapa, who currently works in New York, was also instrumental in the organization of the inaugural AAM Biennial, “A Parallel Universe of", "The next Biennial should be held in February 2021 and will be organized as follows: Themes of the 20th Century: Historical Biennials\nNatalia Brusli, Matteo Pignatelli, Cecilia Pasolini, and Filippo Bellini, together with the artists Silvana Boetti, Etienne Kruglanski, and Paolo Capozzi, put out a statement on December 12, 2017 in response to the decision of Art Basel Hong Kong to pull its Hong Kong fairs in March 2019.“We expressed our deep concern to the Hong Kong government in March 2019 regarding a lack of progress in the negotiations that would have allowed us to have the Hong Kong fairs, and in light of the recent announcement that the Hong Kong government intends to cancel the Hong Kong International Film Festival at the end of March 2020, we are disappointed that it has not addressed our concerns,” the statement reads.The statement continues: “We consider it a breach of our contract with the Hong Kong government if the fairs are canceled, since this would have excluded the Hong Kong film industry from the 2019 edition, which was held in March and would have been the last to be held in the city.", "The next Biennial should be held in 2022. \n\n\nThe East London Community Centre (EBCC) in East London, England, has appointed Kader Attia as its new director and chief executive. Attia has helmed the EBCC since 2013, when it was restructured as a nonprofit organization. He succeeds Sue Bulman, who has led the EBCC since 2009, and will begin his new role in January 2022. Attia previously served as director of the Nude Artists' Collective, an East London–based nonprofit that supports artists of all ages, including children, and as executive director of S/S Publishing, a photo-editing and art-making studio in London. “Kader is a visionary and talented leader and I am really looking forward to working with him,” said Christopher LeBlanc, the EBCC’s board chair. “He has a proven track record of driving the EBCC’s trajectory and growing our audience through innovative and multifaceted programming, including the inaugural Biennial in Fall 2016.”During his tenure, Attia has helped shape the EBCC’s mission, expanded the organization’s collection and exhibition", "The next Biennial should be held in 2021. \n\n\nThe National Trust is planning to donate $2 million in grants and awards to several hundred local and regional arts and cultural groups based across the UK through a program that will begin this winter. The organization announced the launch of its National Artists' Grant Program, which will award $500,000 to individual artists and will give $500,000 to groups. The program will also support the decolonization of museums and Museums and Cultural Heritage (MCHA) in the UK, which is part of the UK’s Brexit negotiations. The program will launch with a two-month grant cycle, ending in October, and will focus on three themes: 1.          The role of artists and their work in liberating cultural heritage from colonial and nationalist narratives; 2. Arts and culture as a vehicle for social change; and 3. How far can arts and culture be ­replaced?\n\n\nThe Architectural Association (A), Britain’s largest professional arts organization, has announced that it will suspend its 2019 general assembly and subsequent Royal Academy Awards (RA) until April 19, 2020. The news comes two days after the Royal Academy of Arts announced", "The next Biennial should take place in the City of Seoul in 2022, and the next will be in the West in 2021.   The next edition of the American Biennial, which will take place in New York in 2020, will also include a new theme.  Commissioned by the Biennials Campaign Group, the 2020 event will be held at the Brooklyn Museum, and will anticipate the development of biennial traditions. The 2020 edition of the Museum of Modern Art, where Lincoln Chafee, Jared Leto, Mary Elizabeth Winstead, and Tilda Swinton will participate. The 2020 edition of the Metropolitan Museum of Art, which will be held in the suburb of New Paltz, New York, will be led by Michael Stipe and will give the first-ever full exhibition of work by artists whose work is currently on display in the museum.“The idea is to create a space that their works can be seen by a wide audience,” my parents told me. “That was the idea behind the Biennials, to create a space where people could go to have a good time, and not be judged by their peers.”The redevelopment of the Museum", "The next Biennial should take place in 2022.<|endoftext|>The National Gallery of Canada in Ottawa has appointed Melchior Wathelet as its next executive director. According to The Guardian, the fifty-eight-year-old Canadian-born, Austrian-born, Hong Kong–born, Vietnamese American, and former hedge-fund manager, who has worked in the arts for decades, will succeed Anne-Marie Gosselin, who was named the new deputy director of the National Gallery of Canada in February.“This is a time of great change and we are all deeply concerned by the loss of these three wonderful souls,” said National Gallery director Bonnie Crombie. “Melchior has spent the last decade building a reputation for being an outstanding and dedicated leader, whose commitment to supporting the National Gallery’s mission and strengthening the collection and exhibitions program was second to none. He has been instrumental in the rapid growth of the National Gallery of Canada and is widely regarded as one of the most important figures in the field of art.”Gosselin will begin her position in January 2021 and will oversee a staff of twelve. She will also spearhead the development of the institution’s new Indigenous exhibitions program, which will launch with �", "The next Biennial should take place in 2021.\n\n\nThe California Institute of Technology (Caltech), Pasadena, California—the center for modern art at the University of California, Pasadena—has appointed two new members to its board of trustees, including Jaye Zurawska, the executive director of the Museum of Contemporary Art (SAFA) Los Angeles and the founder and managing director of the Los Angeles-based firm the Guggenheim Group. The biennial is committed to revitalizing the California Institute of Technology, which is currently undergoing a $110 million expansion and will reopen in the summer of 2021.“Jaye and I look forward to working with our new colleagues at Caltech and to supporting the CACM as it continues to flourish and play an important role in the country’s creative ecosystem,” said Zurawska. She added: “Jaye’s deep experience and expertise will be of great value in facilitating the CACM’s reimagined mission, and in ensuring the museum’s continued success.”\n\n\nThe New York City Department of Cultural Affairs (DCLA) announced today that eminent sculptor and educator Aida Al-Hadid has been appointed as its next commissioner.", "The next Biennial should be held in October 2022.\n\n\nThe American Art Museum (AAM) in New York has received a gift of twenty-two works by artists working in the graphic arts from the publisher Art Landry, which was founded by artist and art collector Richard J. Evans. While the institution has yet to confirm the details of the acquisition, it is confident that the works will be of interest to students studying the history of American art.“We’ve had a great partnership with Art Landry for many years, and it is an honor and a privilege to present these works to students,” said Richard Evans. The museum will gift the works to the school after the two of them agreed to work together to establish a new program for the exhibition “From the Ground Up: Graphic Artists” at the arts center. The program will focus on the work of American artists in the twenty-first century, highlighting the work of female and young artists.In addition to the works, which were donated by customers in the United States, Japan, Europe, and Asia, the institution has acquired three works by French artist Phoebe Markov, The King and I, The Long Road Home, and Against the Wall, a", "The next Biennial should take place at the Institut Nationale d’Art et d’Histoire in Paris in 2021.  Runs about $160. \n\n\nThe National Museum of European Art (MoE), in Washington, DC, has received a new gift of more than 1,500 rare works by late Czech master Jaroslav Jakob-Karl Pisko. The gift includes four works by the Czech artist. The works, which are part of a major exhibition that will inaugurate the museum in the fall, are Treibča, an early meditative sculpture by Jakob-Karl Pisko that was made in 1967, and The Tree of Life, a 15-foot-tall granite image of the Czech flag. The work, shown in a new exhibition of Jakob-Karl Pisko’s works at the museum, will also feature his sketches for Tocca Bochner’s 2014 exhibition. The announcement of the works by Jakob-Karl Pisko, whose work is considered to be among the most important of his era, follows the return of the Art of Life exhibition in Moscow in September 2019, which was hosted by the Museum of", "The next Biennial should be in 2022, where the exhibition will be a joint project between the National Gallery London and the Museum of Modern Art. The biennial will include a selection of works inspired by the exhibition “Imperial Cities” (2019); “Race, Revolution and Politics” (2013); and “Freedom of Expression: Art and Liberty in the Age of Stalin” (2013).\n\n\nThe Museum of Modern Art (MoMA) has announced that it will no longer engage in public programming that creates or perpetuates a network of patronage relationships between donors and the institution. The decision was made in the wake of a tumultuous and tragic decade for the museum, as it grappled with the fallout of the coronavirus pandemic and the mounting pressure to reduce and privatize its holdings.In May of 2018, the museum notified more than 4,500 donors that it was planning to dissolve its partnership with the public-relations firm the PR firm Publicis Groupe, which it described as a “platform for the work of art and creativity.” The announcement followed an investigation into allegations of patronage abuse, including a lawsuit brought by the heirs of Pablo Picasso.The museum, which recently laid off more than 90 percent of", "The next Biennial should also take into account the mass movements of soil and sea in the eastern North Atlantic Ocean, which is one of the major concerns of the European Commission. It will also focus on the protection of biodiversity, the protection of climate change, and the exhibition of works in the exhibition. The exhibition will be divided into two sections, “The Artist’s Home,” which will present “Debra McAleer,” and “Tacita Dean,” and will be held in the exhibition “The Third Wave,” which will open on November 21.McAleer is a London-based artist who has been featured in major exhibitions such as the Venice Biennale in 2008 and the London Triennale in 2010. She is currently based in the US and is currently working on a plan to create a new work for the London Biennale in 2020. Dean, a sculptor and painter from the UK, is best known for her translucent translucent acrylic paintings. Her works are widely exhibited, but her wealth of work is often overlooked because of her gender and her work isn’t well-known or appreciated outside of the UK.\n\n\nThe South African Museum of Art (S", "The next Biennial should be held in the autumn. This will allow us to create a new programme of art and events in autumn, and hopefully to prepare for the future.”\n\n\nThe Huaracheño Foundation, the Los Angeles–based and nonprofit arts organization that fosters and organizes arts and culture in Southern California, has received a $3 million donation from the William R. Bennett Foundation for Arts and the Environment. The gift provides funding for grants for arts programs across the Los Angeles–Orange County region, which includes the coastal city of Huntington Beach as well as the city of Northridge.The foundation was established by billionaire industrialist William Bennett in 2007 to support his vision of creating a new cultural ecosystem in the San Fernando Valley, which he described as being comprised of two halves: the arts and “the people.” His foundation received $1.1 million from the Nesqu'Alagaas and $1 million from the Raymond James Foundation in 2013. . . .The foundation has awarded $4.3 million to arts organizations in the region.\n\n\nThe Brazilian artist and surviving member of the Cohuja-based collective Nara de Arouga (CeA), whose body was recovered by the FELIP", "The next Biennial should be the twenty-fifth; the twenty-sixtieth will be the twenty-eighth; the twenty-ninth will be the twenty-ninth; the twenty-tenth will be the twenty-fifth; and the twenty-sixtieth should be the twenty-fifth. The presentation of exhibits by artists such as Eduardo Calderón, João Goulão, Luiz Goulão, and Roberto Cicala\u0097all three of whom were present in the exhibition “Milano Biennial”\u0097this year’s exhibition was the first of its kind in Brazil. The inaugural exhibition, “Milano: A Biennial of Art,” was held at the Grosvenor Gallery in London in 2014 and was nominated for a Pulitzer Prize in photography.\n\n\nNancy Sinatra, the longtime director and chief curator of the J. Paul Getty Museum in Los Angeles and its founder, died on April 9 at age fifty-eight. Known for her innovative and subversive curating practices, Sinatra’s legacy includes cofounding the contemporary art journal Artforum, the sister publication of the New York Times, in 1988; launching the American Museum of Natural History�", "The next Biennial should be held in the autumn of 2022. The institution’s director, Lin-Manuel Miranda, said: “We are exploring the possibility of reopening with a new design, but the present state of the biennial, which is divided into four different sections, makes this impossible. We are considering a number of options, including moving the exhibition to the east coast for a longer exhibition and staging the exhibition in the winter. It is going to take a while longer for the Art In Transition programme to be completed. It is a pity that we cannot have this exhibition and other events at the institution as soon as possible. But at the same time it is essential that we are able to support the artists, the curators and the whole team, and that our financial situation is managed in a way that means that it is possible to resume the exhibition in the autumn of 2022.”\n\n\nThe Chinese artist and researcher Zhang Yilun, the first to be granted a Ph.D. in the social sciences at the University of California, Los Angeles (UCLA), has been appointed a professor at the university. Zhang is the founder of the multi-disciplinary research group Zhang Yilun Research Center and the nonprofit organization ", "The next Biennial should be held in December 2021. The aim of the biennial is to explore the emergence of new creative, experimental, and declarative practices through participatory and/or pan-African art and history.The 2020 entry, ​Lumalane, takes its name from the Lumalie National Park in the Democratic Republic of Congo. It is a “comprehensive work of art” that explores the role of African art in shaping African identity and the African diaspora. The exhibition, which demonstrates the latest developments in art from the African continent, is curated by Oavora Mwazwe, director of the African Art Museum in Kinshasa, and consists of three exhibitions—The Dallara Group’s “Dallara” (2017), “The Solitary Years” (2019), and “Poetry, Art, and the Diaspora: African Modernism” (2019)—on the theme African Modernism.Tristan Zwelethu, the director of the African Art Museum, said: “This is a moment of great change for us as we embrace new identities and new technologies, and at the same time we reflect", "The next Biennial should take place in 2020 at the latest. A second version, which will take place in 2021, is being developed by the Art Newspaper and the Museum of Contemporary Art in London. The forthcoming exhibition “Not the Same,” which opens March 28, 2020, at the Museum of Contemporary Art in New York, is a reimagined version of the show “The Body in Art.” It will be staged at the London-based exhibition space the Serpentine Gallery, which has not had a show within its walls since 2006. “Not the Same” is currently on view at the Garth Reats and the Victoria and Albert Museum. The first exhibition, “The Body in Art: An Exhibition of Modern Art from the Year 2000” (2019), was at the Royal Academy of Arts in London. \n\n\nThe museum in the Slovenian capital of Ljubljana that was scheduled to reopen in late March has been postponed due to the Covid-19 pandemic.The reopening of the public museum is planned for March 23, 2020, but the date has been shifted to March 22. The reopening of the building, which was constructed in 2007 and opened in 2008", "The next Biennial should be held in 2020. For the past decade, the initiative has been led by Miriam and Ira D. Wallach, with art historian and curators in a number of capacities including curator and director of the Diller Scofidio + Renfro Center for Contemporary Art, Los Angeles; curator and director of the 362nd Street Museum of Art, New York; and, most recently, curator and editor in chief of the journal Artforum. The Diller Scofidio + Renfro Center for Contemporary Art, Los Angeles, which is housed in a former World War II bomber base in the heart of downtown Los Angeles, is organizing a biennial of works by artists of color in 2020. The artists slated to participate are Colby Alÿs, M.A. Van Peebles, Laura De Souza, Latoya Gomez-Lima, Agustín Júnior, and Nanda V.S.A., among others. Although the artists are scheduled to appear in the exhibition, the date of the next iteration of the Etch: Art & Design—a show organized by the Metropolitan Museum of Art in partnership with the Los Angeles County Museum of Art—", "The next Biennial should be held in 2021, the same year that the 1966 festival will be celebrated. The museum will also show a new exhibition on the history of art at the same time that the exhibition “On the Modern Scene” will be on view at the museum.According to a press release, the renovation of the museum is part of the Museum of Modern Art’s new strategic plan, which aims to expand the museum’s collection, create new opportunities and increase its exhibition-viewing capacity. The plan was released in one of four documents, which are titled “Museum of Modern Art,” “On the Future of Art,” and “Art and the Future of our Curiosities”\u0097all of which address the museum’s relationship with the city of Chicago and highlight the changes the institution has undergone in the last fifty years.The plan was also released in the form of a letter from city council member Mike O’Brien to the mayor, who also praised the renovation of the Public Theater, which recently celebrated its fiftieth anniversary. The document calls for the extension of the current residency program and its expansion into a new wing of the museum. In", "The next Biennial should be held in 2020 and has already received a $1.5 million donation from former Vice President Al Gore in recognition of the effort it has expended in advancing climate justice. \n\n\nThe Museum of the City of New York (MoC) has received a $1.5 million donation from artist and philanthropist Arthur A. MIT. The gift, which was made by Arthur and Deborah Katz to the institution in recognition of their decades of work to advance the arts and to New York, includes the installation of a new aquatics and design-focused sculpture called The Boat, which will be placed in the center of the museum.“Arthur and Deborah’s ambition to make MoC relevant and exciting for the entire city is matched by their commitment to pushing the boundaries of design and the medium,” said MoC director Joe Bruno. “Through The Boat, they hope to show how design can and should be used to address many of our most pressing challenges, both immediate and distant. We are excited to introduce this sculpture to the public and to the city, and to have the opportunity to share it with the communities that make New York special.”The gift also includes three design works by Katz: The Boat, T", "The next Biennial should be on the island of Hainan in 2020. The next Art Basel (AB) Show will take place in Hong Kong in 2021. Last year, Hong Kong announced that it will hold its first Art Basel Hong Kong 2020 in 2021. The biennial is being organized by the Hong Kong-based association of contemporary art institutions, the Hong Kong Arts & Culture Association (HALA), and the Hong Kong Foundation for Contemporary Arts (HCA) in collaboration with Beijing-based art curators Hsin-Chien Huang and Ko-Ping Yu.The announcement of the 2020 edition of the biennial was made on Mar. 1, with the announcement of the 2020 winners of the Hong Kong Art Awards, which honor work in the exhibition calendar, and the 2020 winners of the Art Basel Hong Kong 2020 Awards. Hong Kong’s twelve participating galleries were chosen from a pool of ten artists nominated by choice of the Hong Kong Foundation for Contemporary Arts and the Hong Kong Art Awards. The full list of winners is as follows: 1. Hsin-Chien Huang (China)2. Ko-Ping Yu (Hong Kong)3. Trina Tsai (Taiwan)4. Eric", "The next Biennial should take place sometime between February 22 and February 27. Those interested in supporting the exhibition should contact the university directly.  The residency program will receive $5,000 from the National Center for Biennial Studies.\n\n\nThe National Arts Museum in Washington, DC, has appointed Rana Syed as its next director. She succeeds Caroline Kennedy, who retired from the museum in December 2019 after a decade as director, and will begin her position in February 2020. Syed comes to the institution from the American Alliance of Museums (AAM) in New York, where she has served as assistant to the director of curatorial affairs. Under her leadership, Syed oversaw the creation of the museum’s new initiative for exhibitions and the renovation of the museum’s former home on Pennsylvania’s Broad Street.“Rana has been instrumental in transforming the National Gallery of Art into a leading cultural institution that serves as a strong point of reference for the National Arts. She was instrumental in establishing the AmeriCorps program, which helps working artists and musicians across the United States; in growing the museum’s collection and collection research arm, which will help us further our vision of supporting the arts through research and", "The next Biennial should mark the launch of a new exhibition space for the medium’s artists at the Museum, an event that will include a series of projects and performances, including a retrospective of work by the artist Saul Williams, which will be staged at the new gallery in the fall of 2020. \n\nIndian artist Anil Kapoor, whose surrealistic sculptures reflect a deep understanding of the natural world and a reverence for nature, has died. He was eighty-two years old.Born in Delhi in 1931, Kapoor studied under architect Hari Kunzad, who designed the space where the artist now resides. Kapoor moved to Mumbai in 1948 and studied under MM Kalpat, who created the city as a hub for Indian artists. In the same decade, Kapoor began his career as a painter, and in the early 1950s, he began his sculpture career with the story of a monkey and a man, a monkey created from parts of a man’s body.In the 1970s, Kapoor became known for creating works that were both playful and philosophical. Through his sculptures, he explored the relationship between the human and the natural world. The circus, a work in which the artist plays the role of a monkey, became a theme", "The next Biennial should be held in 2020.\n\n\nAs the U.S. prepares to leave fossil fuels in the ground and embrace new technologies to produce energy from renewable sources, the Smithsonian American Art Museum (SAAM) in Washington, DC, has appointed Sandy Kamarczyk as its next executive director. She will be responsible for developing and executing new conservation and conservation-minded programming and for helping to shape the institution’s future plans.“In the decades to come, we will continue to rely on the ingenuity and creativity of our staff to support our mission to present a truly encyclopedic collection of American art,” said museum director Doris Duke. “Sandy brings a wealth of experience and knowledge to our team and institution, particularly in the creative and technology fields. She will be instrumental in creating a sustainable future for our collection and works, and in driving our mission to advance the field of American art in exciting new directions.” Kamara first joined SAAM as the organization’s chief curator of twentieth-century American art in 2015. Previously, she served as the head of the Special Collections Group at the Whitney Museum of American Art in New York City, where she organized the exhibition “Theoretical", "The next Biennial should take place in the city of Hamburg in 2020. This year’s edition, titled “Jugendgasse,” will be held at the Kunsthalle für Kunststädt Hamburg in Hamburg from March 19 to March 21, 2020. The exhibition will be organized as a biennial under the  German term, kunststödliche Kunst, and will showcase work by thirty-four artists.\n\n\nThe New York City Department of Cultural Affairs has announced the launch of a new online platform dedicated to archiving and archiving related art and cultural heritage.The website, archivos.nyc, was created by the city’s Department of Cultural Affairs under the Public Art Preservation Act. The platform will allow the public to upload and share photographs, videos, architectural models, maps, and other archival materials that have been acquired through illicit means and will help the public determine which items should be preserved and where. While the site will only be accessible by the public for a limited time, the department hopes it will become an important resource for archivists and researchers.“The future of curation and research is at stake without a responsible and transparent public inventory that", "The next Biennial should take place in the autumn of 2021. In a comment on the upcoming exhibition, Peter Carlsten, director of the museum, said: “This is an unprecedented situation for the museum. It is difficult to imagine a better time for the museum to present the exhibition 'The Brilliant Adventures of Oskar Eustis” since its popularity in recent years has been on the rise. The biennial will then continue with a selection of paintings that were made by Oskar Geisel, whose work was on view in the exhibition “The Exchange.” The exhibition will also include works by Anne Tobias, Clara Bennett, and Marie Curie. The exhibition will consist of a series of group shows by Carlotta Bregoli; Gisèle Bregoli, who is known for her large-scale installations of colorful, geometric, and sculptural works; and Andreas Köhler, who also creates works that float and shift in movement; the new artist-in-residence, Sergio Cervetto, who works in sculptural and abstract styles; and Diana Al-Sakally, the museum’s first curator of contemporary art.“This is an", "The next Biennial should focus on how to use the art of the contemporary to relieve the pressures and demands of contemporary life. The third should consider the future of humankind and the environment. The fourth should consider how artists can continue to live their authentic lives and still be relevant to a changing world. The fifth should consider how art can become a tool to help us cope with our lives and the challenges of modern life. The sixth should be a time for reflection, reflection, reflection, and reflection. The seventh should be a time for celebration, celebration, celebration, and celebration.”The 2020 event will be hosted at the Museum of Contemporary Art Los Angeles (MAS LA), which is currently undergoing a $50 million expansion. The work of fifteen artists will be presented as part of a program that will culminate with a public performance, which will take place on November 22. “The Accidental Collection: A-Future-Now,” a collaboration with the Los Angeles–based artist and activist John Michael Abney, will be inaugurated by an exhibition of works by the group Infinite Jest, which will be on view through December 5. The exhibition will open with a presentation of Abney’s first work, “The Accidental Collection", "The next Biennial should be held in 2020. The first exhibition, titled “Egyptology,” will be held in 2022.\n\n\nThe Academy of Fine Arts (AFAM) in Beijing has ordered the evacuation of the area around the National Museum of China (MMCA) in Beijing from December 21 to December 26. The reopening of the museum on December 23 has been postponed, and the museum is expecting a heavy loss of revenue.According to the Beijing News, the cancellation of the exhibition “A Problem of Beauty: Art in the Age of the Party” has forced the museum to turn to a private buyer. The work, a retrospective of contemporary Chinese art from 1947 to 1965, was supposed to open in January, but was pushed back to December.The museum is also preparing for a major renovation, which will involve the demolition of the building that houses the museum and the restoration of the museum as a cultural center. The construction of the building is scheduled to start in 2020, and the renovation project is estimated to cost about $50 million. The museum was scheduled to reopen in April.The museum is currently closed to the public owing to the ongoing construction of a new complex at the museum. In an attempt to mitigate the impact of the renovation", "The next Biennial should be held in the spring of 2020, with a new exhibition in the fall of 2020. The festival will consist of two main parts: a literary program and a performance. A new performance series will be inaugurated by a performance in the summer of 2020.The biennial will aim to address issues such as “the self and the other, the other mind, and the self-image,” Subramanian said. “The art of the body, the body and the body in various aspects, the body, the body in form, the body in function, and the body in touch.”\n\n\nThe Museum of Art in the Arts in Los Angeles (MA), which is facing a possible $10 million shortfall due to a temporary closure due to Covid-19, has released the city of Los Angeles a set of guidelines for how it should proceed with the reopening of the museum in the spring of 2021.The updated guidelines were drafted following a request from the city, which was given three years to prepare if it were to open in the spring of 2021, and were released on August 20. They outline how the museum should proceed should it re-open in the spring of 2021, and how it", "The next Biennial should be completed by the end of the year, and the event will welcome visitors in the fall. The exhibition will feature fifty works that examine themes of rebirth, of rebirth practices, and of how the body and the environment are interlinked. \n\n\nThe Silver Dog Meat Market in Beijing has announced that it is shutting down its online marketplace, which was launched in September 2018, and will instead partner with local butchering shops and restaurants to present the biennial’s last show, “The Silver Dog Meat Market: A Literary Journey,” in October. “In order to achieve the highest possible level of artistic and cultural engagement with our visitors, we are cancelling the online marketplace and are instead planning to present the last exhibitions of our contemporary exhibitions at the Silver Dog in the autumn of 2022,” said director, Zhou Wensheng.The announcement follows a controversy that arose from a show by the Chinese artist 杜宷旋, who is known for his projections of the future, as well as his work in the form of a series of print sculptures she constructed in her studio, named the  Silver Dog, in Beijing. The exhibition caused an uproar among artists and critics for its large-", "The next Biennial should take place at the Pont des Arts in Paris in 2021. That year, the show will welcome a group of artists whose practices are interrelated and who are organized under a common project, the theme of the year, for a shared programming program. The 2019 edition, titled Ce n'est pas une femme, was staged by the group of the same name in a much larger exhibition, titled Ce n’est pas un cœur. This year’s biennial will feature work by thirty-two artists and will be on view as part of the biennial’s inaugural edition in 2021.The biennial’s presentation of work by the same thirty-two artists featured in the show this year will be highlighted in the upcoming biennial’s fifth edition. The event will take place at the Musée du Quai Branly in Paris from January 24–February 25, 2021 and will run concurrently with the biennial’s centenary celebrations. The exhibition will also feature works by artists for whom the event’s platform was a time to create their first exhibition.\n\n\nThe Museum of Modern Art (MoMA) in New York has released new guidelines for how", "The next Biennial should be announced soon. \n\n\nThe Warner Bros. Museum of Art in Los Angeles has shed some of its many rumors and fears about the possibility of a cancellation of its 2019 exhibition “The Unseen: Art and Privacy in the Digital Age,” due to the exhibition’s exclusion of a controversial work by the Palestinian artist Mahmoud Darwish. The museum also said that it would hold a special exhibition titled “The Golden Door,” which is scheduled to open in the museum on March 5, 2020. This exhibition will feature works that were excluded from previous editions of the exhibition.In a statement released on March 4, the museum said: “It is with great regret and disappointment that we announce that the 2019 The Golden Door’ exhibition will not be rescheduled. We are still in the process of constructing a new platform for the exhibition, but we will announce more details in due course.”The announcement followed a day of intense speculation surrounding the exhibition, which, in addition to dealing with controversial subjects such as the Nakba (catastrophe) and the history of Palestine, also explored the relationship between the digital and physical worlds. Darwish’s work was", "The next Biennial should be held in Japan, and hopefully in the spring of 2021, the Japanese premier Tatsuo Nakayama said. The biennial is part of a larger plan to reposition the country from the center of the world and toward a new role as a major financial and cultural hub for the Asia-Pacific region.In the past, the Biennial was an annual event that was staged in various locations across Tokyo, including the Mori Art Museum. However, in 2018, the venue was forced to cancel the event after a fire broke out at the Mori Art Museum in Shinjuku, and a second edition, titled “Forever Biennial,” was also canceled. In February 2019, the venue experienced an economic downturn with no immediate plans for reopening.“I sincerely hope that the new venue will be equipped with modern and modern-day facilities that will be able to meet the demands of the current global situation,” said Yoshitomo Ishinomori, the general director of the Mori Art Museum.The 2014 and 2015 editions of the Forever Biennial, which were staged at the Mori Art Museum in Tokyo, raised some $3 million for the venue.\n\n\nThe Metropolitan Museum of Art (Mo", "The next Biennial should focus on critical issues of our time and how art touched on and influenced the human condition. We are all connected by our shared histories and traditions, so we must continue to create new works to honor and strengthen these histories. ”The 2018 festival, titled “Art in the Age of Black Power,” drew 1,500 attendees and featured work by eighty-seven artists. It also featured work by Alexander Akimoff, A.J. Koons, Jean-Michel Basquiat, Michel Foucault, Albert Camus, Kiki Smith, Hiroshi Taniguchi, Andrea Dwork, Lévy Gorvy, and Odd Olman.\n\n\nThe Museum of Arts and Design (MAD) in New York, which has been closed since March 31 due to the Covid-19 pandemic, will reopen on March 31 with a new exhibition, “Adeline at MAD,” that is organized by the contemporary art collective Projects in Motion. The show will take up themes of aging, the body, and its relation to culture, and will run from March 19 to March 22.The opening coincides with the one-year", "The next Biennial should take place at the Museum of Contemporary Art (MoCA) in the city of New York from March 12 to March 14, 2020. The institution is also working on additional programming for the 2020 edition.\n\n\nThe São Paulo-based artist and educator Paulo de Souza has been named the fifteenth recipient of the sixth edition of the São Paulo Biennale. The international award, which recognizes emerging and established artists in Brazil, was presented by the city of São Paulo and the São Paulo Regional Institute of Modern Art (SPAM) on July 29.It was established in 2003 by Paulo de Souza, the founder of the discursive artist collective Authentic Existence, and his wife, Ana Maria de Souza, in the city of São Paulo. The inaugural exhibition, “Atelier Lambda,” opened in 2008 and ran until 2011. The next show, “Voltaire and the Senses,” was presented in 2015.“I am thrilled to announce that the next edition of the São Paulo Biennale will feature an exceptionally talented and experienced selection of artists from Brazil,” said Paulo de Souza. “They will bring fresh perspectives to the theme", "The next Biennial should take place in the spring of 2021. If the date is moved, then the 2020 event will be moved to the autumn. The 2019 event, which was held at the same site as the new museum, will be moved to the canal in 2020.The new museum is scheduled to open in the spring of 2021.\n\n\nThe Flemish government has announced that it is preparing to establish a new national museum dedicated to African art. The proposal has been made in response to the numerous public complaints about the exhibition “An Act of Resistance,” which is currently on view in the museum from August 9 to August 16. Visitors to the museum will be able to see works by artists such as Jan and Lynne Bultmann, Helmut and Freya, Zimbabwean artist and painter Richard Anuszkiewicz, and Odette Kudacki, among others.The proposal was made in response to the growing number of local and regional organizations that were campaigning for the establishment of the museum. In April, the city of Aarhus invited Künstler to design a museum for the city’s African heritage. In May, the museum was asked to reorganize its collection and its programming. A month", "The next Biennial should be held in the year 2020. The next edition, curated by Pierre Gaillard, will be held in the year 2021. The third Biennial, moderated by Daniel Harriss, will be held in the year 2022. \n\n\nThe Robert Rauschenberg Foundation announced today that it is donating $10 million to the Whitney Museum of American Art to fund a number of initiatives that will advance the work of African American artists, including the exhibition “Black: Politics and Art from the African Diaspora” and the following two-year, $10 million grant program: “Black Artist Grant: 2020-2021” and “Black Artist Grant: 2022.”According to the foundation, the new grants will help the museums further the work of Black artists in the US, including Mana Contemporary African Art, New Orleans Art Museum, and the Lincoln Center for the Arts.  \n\n\nThe Museum of Modern Art in New York has launched a new pilot program to reward the museum’s staff for their efforts in helping visitors navigate its galleries with 50 percent off tickets to future biennials. During the program, which runs from May 5 to May 7, the museum will use", "The next Biennial should take place in 2022. The theme of the 2021 event was “The Architecture of Life.” The exhibition, curated by Kohn and Kalschemann, was dedicated to the “phenomenon of architecture,” but also showcased work by a number of other artists, including Hannah Baer, Jenny Bevan, Rachel Koenig, and James Reimer.Curated by J. Sterling Morgan, curator of the next Biennial will be announced soon. \n\n\nDozens of workers at the Museum of Fine Arts (MFA) in Boston have staged a walkout during the city’s annual Art Sale, which has drawn about $150 million in investments since its inception in 2010. The action was sparked by the museum’s decision to foreclose on the Wyndham Gardens residence, which sits atop a five-thousand-foot-tall, urn-shaped structure, and has led to a fierce backlash from local, state, and federal lawmakers.Billionaire collector David Childish, who purchased the mansion in 2016 for $1.4 billion, called the buyout a “disaster.”“The Wyndham Gardens debacle has", "The next Biennial should take place in 2022. Suella Chaudhuri, chair of the university, told the Art Newspaper that the decision to cancel the exhibition was made after conducting further discussions with students and alumni. She added that the move was not related to the controversy surrounding the exhibition\u0097the first of its kind in India\u0097but was made to avoid a confrontational topic.“The exhibition was not the subject of the present exhibition, and in fact, the exhibition was not even shown at the end of the show,” Chaudhuri said. “If we had put the show together in such a way that it might have been shown, it would have been a disservice to our future exhibition.”The dean of the school, Ravi Rajan, was not convinced. “It wasn’t a question of putting the show together, but of moving it,” Rajan said. “We wanted to show the work by the artists.”While the decision to cancel the show was made amidst the ongoing protests against the exhibition, it was not unexpected. Earlier this month, a group of artists, including Miroslav Kbyst, Kazi Nari,", "The next Biennial should be staged in 2020. In the meantime, the organization’s board of directors, chaired by sculptor and designer Huréâchia Crousel, has decided to postpone the event.“We are deeply concerned by the current situation, in which the exhibition is now in jeopardy, and that the Biennial is still facing the possibility of being cancelled,” said Marcel Rotsch, president of the Biennial. “We hope that the sponsors of the Biennial will now consider making a major contribution towards helping the Royal Academy to avoid a similar situation in 2020, so that the Royal Academy can continue to flourish with all that it has.”The Royal Academy of Arts also recently faced a controversy after a sculpture by Italian artist Gio Ponti that was on display at the Venice Biennale in 2015 was removed from the exhibition. After the piece was removed, the Royal Academy of Arts apologized and promised to reward the museum €4,500 (more than $5,000) for the exhibition’s brand new booking office.\n\n\nThe Center for Sculpture at Harvard University (CASS) is launching three new programs aimed at increasing public engagement with its large-scale programs, with the launch", "The next Biennial should take place at the Museum of Contemporary Art (MCA), San Francisco, in 2022.The biennial will include a selection of works that were selected by a panel convened by MCA director and CEO Amada Cruz and writer and curator Billie Tsien. A selection of the biennial’s works was shown at the Museum of Contemporary Art (MoCA) in New York last year, during a retrospective of the artist’s art created with a $50,000 grant from the David Rockefeller Fund.The exhibition will be organized as follows: The Museum of Contemporary Art (MoCA) in New York will present the museum’s inaugural exhibition dedicated to the work of Amada Cruz. The exhibition will highlight the work of the artist, which has been exhibited at the Los Angeles County Museum of Art, the Museum of Contemporary Art San Diego, and other venues throughout the United States.“Amada Cruz is an internationally acclaimed artist whose immense range of figurative, sculptural, written, and performance-based paintings and sculptures demonstrate his ability to make the most extraordinary interiors from seemingly disparate materials,” said David Goldman, senior curator at the Los Angeles County Museum of Art and a past president of the board of", "The next Biennial should be held in the autumn, and its next edition will be held in the spring. The grand opening was originally scheduled for April 5, the day the exhibition “First World Problems: Contemporary Art in the Age of Mechanical Reproduction” was first staged. The opening was pushed back by a week because of the Covid-19 pandemic, and the exhibition has since been cancelled.The Stockholm Biennale has also continued on schedule, with its 2020 edition slated to kick off on March 29 and run through May 10. The exhibition’s organizers citing the Covid-19 pandemic—the first major setback for a biennial since 1997—as the reason.\n\n\nManchester Art Gallery (MGH) has appointed artist-in-residence, Jeff Koons, as its new curator of modern and contemporary art. Koons, who has curated exhibitions at the Museum of Modern Art, the Metropolitan Museum of Art, the Whitney Museum of American Art, and the Salk Institute, will take up the role in April. He succeeds Margaret Atwood, who departed the institution in April 2019 to head the Whitney Museum of American Art, and will begin his role in May.“I’ve been an admirer of", "The next Biennial should focus on the history of the exhibition, its curators, and the exhibition’s recipients, and should begin with a reflection on how the artworks of the current exhibition have been created. A system of biennial awards should be developed as a way of furthering the exhibition’s themes of empowerment and collaboration.The biennial will also include a second edition of “Art for a Changing World.” In the inaugural exhibition, the competition will be hosted by the United States Institute of Art in partnership with the state of California, and will examine the impact of artworks on social changes and the environment, and the exhibition will focus on women artists and their work.The second iteration of the exhibition will also include new conceptual programming aimed at addressing the challenges and opportunities presented by climate change. The first exhibition, “Art Versus Climate Change” (2015), attracted more than 2,500 participants. The theme, “Art and Climate Change,” was framed by Arthur C. Clarke as follows: “In the future, when the seas rise, the fires rage, and the storm clouds gather, how will we live? How will we love?” The exhibition, which was organized by the Institute of Contemporary", "The next Biennial should take place at the Sculpture Center in June 2020. The winner of the 2020 prize, a sculptor who was selected by a jury made up of Yoshitomo Shirakawa, Takeda Akitomo, and Masaaki Yamaki, will be selected by a special committee comprising Yoshitomo Shirakawa, Koji Kondo, Hideki Kamiya, Junya Matsumoto, Jirō Nakayama, and Yoshimasa Mitsuo, which will meet in January 2021.The 2019 prize winners include Aymeric Breuer, Sara Cwynar, Joshua Rickford, José Luis Reyes, and Rebecca Sugar. The 2019 prize jury, consisting of A. L. Chakravarty, A.P. Saal, and Hans Focke, awarded the Biennial Prize to Ma Yansong for his work Au Jie Yan Gook, which will be exhibited at the Museum of Modern Art, New York, in the fall of 2020, and awarded the 2019 prize to Ming Li for his exhibition Joan of Arc, which will", "The next Biennial should be held at least ten years from now, and should coincide with the Reopening of the Museum,” said the museum’s director, Dorothea Rock. “The opening of the exhibition ‘The Documentary,’ will give the public a chance to see the new works by working artists, and will make it possible for them to have a good time at the gallery.”The first exhibition will feature the work of Daniel Ingram, the first British artist to enter Nazi concentration camps, on September 3. The exhibition will be on view through April 30. The exhibition will also feature the work of Polish artist Wojciech Zbikowski, whose work documents the collective killing of Polish Jews during World War II, and will open in the museum in March 2020.\n\n\nThe Museum of Fine Arts (MFA) in Boston is working to finalize a $10 million renovation and expansion project that will create a new exhibition space for the institution. The $10 million budget includes $8 million from the MFA’s existing Endeavor Fund, which was established in 2002 to support the construction of the museum, and $5 million from the MFA’s own reserves. The funds", "The next Biennial should be set in Zurich in the spring of 2020. The first exhibition will be an update of an exhibition that opened in Manhattan in 2020, entitled “Rethinking Feminism.”\n\nThe Linda and Bruce Hauser Foundation announced today that it has announced $65 million to help make Mount Pleasant a reality. The funds will help the neighborhood nonprofit, which specializes in making affordable housing units in the city, establish a permanent home for the arts and cultural sector, and help the community produce new works of art. The initiative will draw on the foundation’s own resources, which are currently being used to preserve the historic Rockaway home of the music industry, and will be led by Leon Black, director of the foundation.“The foundation is committed to working with the City of New York to make Mount Pleasant a world-class art museum that will catalyze local economic growth and revitalize the communities it serves,” said Paula Scher, chair of the foundation’s board of trustees. “We are grateful for the support of the mayor and the trustees of the foundation for their extraordinary leadership and vision in championing arts and cultural life in the city. We are confident that this initiative will transform the", "The next Biennial should focus on “the future of the city,” said city council president Jeff Mullen. “We will have a new challenge, but one that will benefit from the creative energy of the city for many years to come.”Pace Gallery announced that it is reopening on New York’s Hudson Valley waterfront, following a $350 million expansion project that began in 2012 and is currently running through 2020. The massive undertaking involved the construction of a new 700,000-square-foot structure, the Hudson Yards megacity, which is currently undergoing a $1.7 billion expansion. The project also included the development of three new parks, the nonprofit Hudson Valley Center, and the newly renovated buildings of the city’s Museum of Art and the Catskills Museum of Art.“The Hudson Yards megacity is returning to life as we launch our new fall series, ‘Fallen Wonders,’” which will run from October 30 to December 14. The inaugural exhibition, “Tit of the City,” will be on display at the new Tisch Center for the Arts through March 24, 2020. The series will feature seventy works by forty artists, including Nari Ward, Nicole", "The next Biennial should take place in 2020, and the first in 2021. The 2019 exhibition was dedicated to the work of Ashraf Manoor, and was held in collaboration with the Palestinian Authority. The exhibition was part of a wider, multi-pronged project to develop a new collection of works, and an initiative to promote the work of Palestinian artists, including the work of Fatosu, Tawfiq, Hatim, and Khuzaa.\n\n\nThe Pérez Art Museum Miami (PAMM) revealed today that it is planning to move the exhibition “Theater of Operations: The Gulf Wars 1991–2011,” which was staged at the museum since 2003, to the nearby Art Museum of Fort Lauderdale, Florida. The move is part of a plan to lay off workers and close the museum during construction of the $75 million renovation of the museum.“The museum is expecting a major construction project in the next two years, so it has decided to cancel the “Theater of Operations: The Gulf Wars 1991–2011” programming\u0097which has been a core part of the museum’s programming since it opened in 2003\u0097in favor of “More Art: The", "The next Biennial should take place in the autumn of 2020. Meanwhile, the work of the Museum of Contemporary Art (MoCA), which was closed for a period of four years after a series of terrorist attacks on the US embassy in Beirut in March 2011, will return to the Grand Salon in the Palais de Tokyo in April 2021.\n\n\nThe Aleph Art Museum in New York City has received a gift of sixty paintings spanning the twentieth century—including twenty-four works by artists whose works are currently on display in the museum—in a large-scale renovation project that was funded by a anonymous donor. Established in 1957 by Charles and David Paine, the family who founded the eponymous Maine-based arts incubator, the institution received the works in 2018 and relocated them to its new home in the Hudson Yards development, a vast, privately owned, five-building development that is currently under construction.“The Paine Moderns Collection is a rich and inspiring collection of artists’ work,” said David Paine. “The gift honors the legacy of one of our most important luminaries, Charles Paine, and gives an important opportunity to admire and study these remarkable works by each of the forty-seven who have been selected for", "The next Biennial should be held in the summer of 2021. The next iteration of the Biennial should be staged in the second half of 2021. “We are excited to explore new and exciting ways to engage with the artists, the museum, and the city of Los Angeles,” said David Breslin, president of the nonprofit Los Angeles’s Artists’ Association.Organized by the group Los Angeles Biennialists, an initiative of artist-in-residence Masayoshi Nara and the organization Under the Influence of Art, the exhibition was curated by artist and curator Todd Fee from a list of twenty-five artists, including Abraham Lincoln, Catherine O’Leary, Frida Kahlo, Nirvana, Nino de Luca, and James Turrell. The exhibition is being organized by the newly formed organization Events of the Year.\n\n\nA group of artists, art dealers, and collectors are suing the California Department of Cultural Affairs over its decision to eliminate the Museum of Contemporary Art (MoCA) in Pomona, California, from its 2020 list of historic cultural sites. In a complaint filed in U.S. District Court in Los Angeles on February 27", "The next Biennial should be held in 2021.<|endoftext|>click to enlarge\n\nA new curatorial initiative launched by the Museum of Fine Arts (MFA) Denver is trying to develop and brand new works by artists whose work has not yet been exhibited at the museum.Launched by director and CEO Mark B. Wilson and MFA board president Marlene Asimov in recognition of the institution’s twenty-fifth anniversary, the initiative will invite a group of artists to the museum in the spring of 2020. The exhibition “Rethinking the Past: Art and the Future of Art” will highlight the works of artists such as A. A. Peiks, P. A. Hong, and P. J. de Villiers and will bring them together with MFA Denver staff and guests for a rethinking of the institution’s collection and exhibitions.“A new initiative to highlight the work of emerging and established artists is a critical step in reframing the MFA Denver collection critically and moving it forward in the direction of greater inclusion and diversity of artistic practice,” Wilson said in a statement. “The work of A. A. Peiks, P. A. Hong, and P. J. de Vill", "The next Biennial should focus on “the possibilities and challenges of arts and creative production through a critical account of the relationship between the artist and the world,” said Yuki Kondo, chair of the Tokyo Biennale committee, for the opening of the exhibition.\n\n\nThe Open Society Foundations, the nonprofit organization founded by philanthropist Henry Luce in 1972, has awarded $1.2 billion to twenty-eight artists and scholars in the United States, Canada, and Mexico. The funds will be divided among fourteen awardees: artist-in-residence Aurora L. Trumbull, the inaugural recipient of the 2019 Sustainability Prize; Eleanor L. Blum, the inaugural recipient of the 2020 Life & Movement Prize; Benjamin K. Thomas, the inaugural recipient of the 2021 Bicentennial Prize; and Maestro L.A. Reid, the winner of the twenty-third Biennial of Live Music in Los Angeles.“The Open Society Foundation has long been recognized as a leading supporter of emerging and established artists, and we’re proud to support the work of our artists in this cycle of awards,” said Wayne Pretzell, president of the Foundation. “With this year’s biennial", "The next Biennial should be held in 2021. The venue is currently under construction and the project is currently being led by Architects and Engineers Europe, a subsidiary of the European Union. The event will also include the exhibition of works by artists including Ed Moses, Michael Ochs, and Carlotta Galli. The 2019 edition was held at the MAMCO, Milan, and will be staged at the Corriere della Sera di Milano in Milan in 2020.\n\n\nThe Somerset House Museum in London is planning to close permanently in 2022 as a result of the coronavirus. Its permanent collection, which comprises more than two hundred works, including paintings, drawings, and sculpture, including works by Pablo Picasso and Damien Hirst, is scheduled to be dismantled and moved to a new location on the grounds of the institution in March of 2020.“Throughout our long history, we have been driven by a vision of what a museum should be: an exciting, meaningful place to study art and ideas together, with the artists who create it. We are now at a point where such a museum can be realised, and we are just a few months away from that day,” said Tom Price, director of the Somerset House. “With the", "The next Biennial should be held in 2020. The first biennial, held in 1993, featured work by five hundred artists. 2015 saw the inaugural exhibition of Gabriel Curias’s Pediatric AIDS and the upcoming exhibition “Lise De Keerschappel. Art and Ethics.”Curias’s exhibition was at the Exposition and the exhibition “Women’s Health and Health Care’s Body: Art and Survival in AIDS” was presented by the Museum of Modern Art in New York in 2015.  For any of you who missed the event, the full list of artists who will be represented in 2020 is as follows:Alexander Calder (1918–1976)Alice Aiken (1916–1987)Bessie Astbury (1931–1988)Bennie Arnold (1901–1979)Bertrand Berry (1905–1982)Bertrand Brunel (1905–1982)Bertrand Brouwers (1905–1983)Bertrand Brouwers (1905–1983)Bertrand Brouwers (1905–1983)Bertrand Brouwers (1905–1983)Bert", "The next Biennial should be held in 2021, to be followed by a symposium on the new exhibition series, the new exhibition venue, and the exhibition program, as well as a book launch and the official launch of the exhibition series.“The new project and exhibition series will be inspired by the themes of the exhibition ‘The Future of Art’ as well as the series of exhibitions curated by Marcel Proust in the late 19th century,” said Mona Šupper, chair of the board of trustees of the Biennale. “The exhibition will be a new experience for the art lovers of the Netherlands.”Other themes that were covered in the exhibition are photography and the assimilation of cinema in the visual arts. The exhibition will examine how the possibilities of photography and film have shifted since the 1950s and will feature more than 1,500 works by the artists.\n\n\nThe largest visual arts institution in Hong Kong, the Hong Kong Film Festival (HFF), has announced its full slate of programming for the 2020 edition, which will take place in the city of Hong Kong from March 27 to March 31. The event, which will also feature two film festivals, a photography exhibition, a book signing, a concert", "The next Biennial should take place in February 2021 and is scheduled to run from January 11–January 18, 2020.\n\n\nThe Institute of Contemporary Art (ICA) in Prague will move its exhibition, “Era of the Museum,” to the European Southern Institute (ESI), located in the castle town of Krefeld. The exhibition was born of the joint project between the two institutions in 1992. The first iteration of the exhibition, “Era of the Museum” (1995–98), featured contributions by eighty-five artists from twenty-four countries. The next iteration, “Era of the Museum: Contemporary Art,” will take place in March 2020.The announcement follows delays for the ICA Prague and the ICA Prague–Budapest, which were announced on June 2. Neither exhibition is expected to open before the end of August. “We are pleased that after more than thirty years we will finally be able to show you our new sculptures\u0097the construction of our new studio, the complex of the ICA Prague and the ICA Prague-Budapest, with the help of the ICA Prague-Budapest, and with the new partners at Ivkov Gallery,” said", "The next Biennial should take place at the Museum of Modern Art in New York.The institution will tentatively open its first permanent collection at the partnership between the Public Art Fund and the City of New York in 2020. The partnership includes the acquisition of forty works by artists and organizations that have been on the radar of the Young Turks for some time. The exhibition is expected to take up themes such as the relationship between social justice and art; the future of art in America; and the relationship between art and politics. The inaugural exhibition will feature works by fifteen artists, including Karin Laub, Mark di Suvero, Gia Masina, and Aline Masroor (US), and will run between February 19 and March 21, 2020.“The new partnership will allow the museum to present a diverse array of artists at a time when the institution is working to reimagine the future of art museums in America,” said Elizabeth Clark, chair of the board of trustees. “For twenty years, the museum has been focused on rebuilding its reputation through an exhibition-driven program that engages with the modern and contemporary art world, challenging the boundaries between art and the culture of our time. The new partnership represents an exciting new chapter in our history and an opportunity", "The next Biennial should be held in 2020.  The organisation is currently negotiating with the United Kingdom to present the show in 2021. \n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has removed over one hundred works from its collection in an effort to make room for the construction in its golden-age building of a new building that will house the institution’s collection. The institution acquired the building in 2018 for $2.5 million. The acquisition included a number of works by contemporary artists such as Rainer & Rainer, Damien Hirst, and Louise Nevelson. The works will now be moved to an adjacent building. “The MCA has always strived to present a diverse collection of works from a variety of backgrounds and has been public and private at the same time, but this is the first time with the construction of the new building that the collection is being housed in the same building,” said Marcelo Biennale, the former head of the MCA and the architect of the building. “The MCA is proud to be a part of the city of Los Angeles and the county of Los Angeles, and we are eager to present the collection in a new way in the most spectacular of", "The next Biennial should be held in 2021.  The next collection of contemporary art should be held in 2022. The next exhibition of work by a single artist should take place at a venue that is not currently occupied by the artist. The next exhibition of a single work by a select group of artists should take place at a venue that is not currently a part of the artist’s group. The next exhibition of work by a single artist for a direct auction should be held at a venue that is currently not occupied by the artist or the artist’s group.  The next exhibition of work by a single artist for the first time, will be a biennial exhibition at a private institution for the first time, in the new of the new of the new of the new. The next exhibition of work by a single artist for a private exhibition should be one that is not currently in circulation. The next exhibition of a single work by a single artist for a private exhibition should not be one that has just been exhibited. The next exhibition of a single work by a single artist for the first time in the new of the new of the new of the new of a single work by “Ivan Albright”", "The next Biennial should be held in 2018. The first event, “Watercolor” (2019), was staged at the gallery space the Museum of Modern Art in New York, and was unveiled at the Museum of Modern Art in March. The next exhibition at the museum will be the artist’s first solo show there since 1988. “Biennial 2: New York, 1986–1992” will open in March 2021.\n\n\nThe Los Angeles County Museum of Art (LACMA) has named Anna Rosales as its next director. She succeeds Michele Lassiter, who departed for a post at the Metropolitan Museum of Art in New York on February 28 after more than two decades at the helm of the institution.“We’re thrilled to welcome back Anna to LACMA,” said LACMA director Christopher Pearson. “Anna’s expertise and passion in the arts will ensure that LACMA remains a powerful and influential destination for visitors of all ages. LACMA’s relationship with the Los Angeles community will improve further with her appointment, as she will be able to better connect with and engage the community through programs that help meet the needs of our visitors.”Ros", "The next Biennial should be held at a site other than the museum as soon as possible, in accordance with the guidelines set out in the Declaration on Art and Design. The publication of the Declaration on Art and Design makes it clear that a future Biennial at the museum should focus on contemporary art, with the possibility of retrospective and exhibition exhibitions of work by artists of the previous decade. The Museum has also been working on a new site-specific contract with the Museum of Modern Art. According to a release, the privately funded event will resume at the museum on September 5th.\n\n\nNew York’s Metropolitan Museum of Art (MoMA), which received $5.6 billion in emergency relief from the Families Emergency Fund, has released its annual report card on the state of the metro’s cabinets and its art holdings. The findings, which were compiled by art-library scholar and curator Dorothy Stern, are filled with charts, graphs, and tables listing the museum’s investments in art over the course of the year, its holdings of works by artists whose works are currently on view, the number of artists who will be featured in the next iteration of the Metropole, and the financial", "The next Biennial should take place sometime between May and September 2020. “I want to ensure that we are heading in the right direction,” said Arturo. “The next Art Basel Hong Kong will be the largest contemporary art exhibition in the Philippines. This is a critical moment for the region. We must do all that we can to shape the course of history and shape the future for our region.”\n\n\nIn a move that could reshape the structure of Philippine art, the National Museum of Art (MMA) in the capital Manila will move to a new facility that is designed by urban designer Tejal Palanis. The nine-thousand-square-foot space will be inaugurated in the museum’s courtyard on February 27.The museum is currently housed in the former space of the Bank of the Philippines (BOP), which was converted into a shopping mall in 2015. The renovation involved the dismantling of the museum’s original building and its neighboring structure, known as the Arts and Culture Quarter, and the construction of a new, 450,000-square-foot space that will house the museum on its north side. The new museum will also boast an extension, a digital library, a public courtyard", "The next Biennial should be held in 2021.\n\n“The Berlin Biennale will continue to take place, in keeping with the spirit of the exhibition, with the same extraordinary exhibition-making and creative and administrative platform as in the past,” said Joachim Neugroschel, director of the Central Library of the University of Berlin. “The theme ‘The Future of Memory: The Art of Memory and the Future of History,’ will continue to serve as a point of departure for the exhibition.”The new location for the exhibition is the Art Archive of the Haus der Kunst, which will be inaugurated by the exhibition “Light, Memory, Memory” in October 2020.The exhibition will present works by artists including Anna Atkins, Muhammad Ali, and Ruth Rendell, as well as works by past and present curators of the exhibition, including Wolfgang Popper, Andreas Schell, and Anton Chekhov.\n\n\nThe Museum of Modern Art (MoMA) in New York is planning to tear down its iconic David-and-Goliath statue of the hedgehog (and its 3,600-piece collection of artworks devoted to him), in a move that will send a powerful message", "The next Biennial should also include a section that will focus on art and performance and will present the work of artists who have received honorary doctorates, and the exhibition should be titled “Kamala Ibrahim: The Body and the Future.” The exhibition will be housed in the Ministry of Culture’s new headquarters, the Smithsonian’s National Museum of Art.\n\n\nThe Royal Ontario Museum (ROM) in London announced today that Ron Englander, a longtime member of the institution’s board of trustees, will retire at the end of the next academic year after a thirty-five-year term. He will be succeeded by Markus Bartsch, who will assume his responsibilities on April 8.“Ron has been an integral member of the ROM’s board for more than thirty years, and has devoted his career to supporting the museum’s collection and exhibitions, expanding our reach through new and innovative ways, and improving the museum’s relationship with local communities,” said museum director Maria Balshaw. “Having worked with Ron for more than twenty years, I’m convinced that he has been an outstanding trustee of the museum and its collection, and I am proud to have supported his", "The next Biennial should be held in 2022. The venue will host a special exhibition of works by the newly selected sixty-three artists.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has appointed Eliza Joya as its next director. Joya comes to the institution from the San Francisco Museum of Modern Art (SFMoMA), where she has served as a curator since 2009. She succeeds Kate Patterson, who retired in January 2019 after twenty-five years at the helm of MoMA.“We are thrilled to welcome Eliza to the Met,” said director Daniel H. Weiss. “She came to the Met with a strong and distinctive set of curatorial and artistic skills, and proved in her first year at the museum to be a star curator, bringing exciting exhibitions, books, and other works to the museum. It is her extraordinary ability to weave together art and the people who work with it that sets her apart from the pack.”Prior to joining SFMoMA in 2009, Joya was a curator at the San Francisco Museum of Modern Art (SFMoMA), where she served as director from 2015 until 2016, and worked as a curator at the National Gallery of Art. During her tenure at the National", "The next Biennial should take place in 2018. \n\n\nThe Smithsonian’s National Museum of African Art (NMFA) in Washington, DC, has received a $10 million donation from the John and Mira Pritzker Family Foundation in honor of its centenary. The gift also includes $3 million for the renovation of the museum’s Georgian space in the nation’s capital and the creation of a new program that will focus on the life and work of American African Americans.The donation is the culmination of a decade of work by the Pritzker Family Foundation in support of the independent, nonprofit institutions that represent the legacy of John P. and Frederick P. Pritzker. The philanthropists established the museum’s committees of scholars and artists in 1980 and funded the museum’s founding in 1993.The partnership between the Pritzkers and the Smithsonian began in 1998, when the foundation donated $20 million to create the Pritzker Research Center in the Smithsonian’s National Museum of African Art. A year later, the organization gave $50 million to the institution’s Board of Trustees, which approved a $100 million donation from the Pritzkers in support of the new museum. In 2006, the", "The next Biennial should focus on “the collaborative, interdisciplinary, and interconnectivist possibilities of art,” said Marcelo Biennale. “I am optimistic about the possibilities of art and artists working together to challenge the boundaries of what is possible, to advance the material and the technological, to exploit new technologies and new materials, and to change the very nature of the artist.”\n\n\nAn eleven-foot-tall bronze sculpture by Brazilian artist Luiz Felipe Massmann, titled Light and Shadow, is now set to open in the city of São Paulo on October 11, 2019. The installation, which combines several bronze sculptures by the artist into a single work, will be on view in the city’s Centro de Arte de São Paulo (ACS), a public space in the city’s state of Minas Gerais, Brazil, until the end of May.Completed in 2013, Light and Shadow is part of the artist’s series “Homages of Light and Shadow,” which were first created in 1996 and 2012, respectively. In each work, Massmann adds a bronze sculpture to create a work that is both a reflection of the Brazilian landscape and of the", "The next Biennial should take place in 2021–22. The full list of curators is as follows:Benjamin Constantine​“Thomas Peter, “The Future Is Plutocratic,” 2019. The exhibition will be held in the capital of the Czech Republic, Prague.The exhibition will be presented by Thomas Peter. The show will be organized by the Czech Academy of Sciences, the Institute of Modern Art, and the Modern Art Museum Prague.\n\n\nThe Maryland Institute College Museum (MICA) in Baltimore has received a gift of more than 1,500 photographs by American photojournalist and painter Charles DeForest, who served as a vital counterpoint to the increasingly concerned American gaze during the Vietnam War. DeForest’s photographs, which were taken in Vietnam from his home in Forestville, Maryland, in the early 1950s, were donated to the institution by his wife, Nell, who has served as MICA’s curator of American photography since 1987.“Charles DeForest and his work are among the most important contemporary American photography images,” said director Colleen Carroll. “These fifty photographs will add an important chapter to the history of American photography and will help to re-create the American", "The next Biennial should take place in Cambridge in April 2021. The museum will continue its work on the exhibition as it works through the convolutions that have shaken the globe since the pandemic began in late February. It will close its doors on March 26, 2021. The work of the museum consists of 125 photographs, printed on Lévy Gorvy paper, depicting the biennial, which will include a retrospective of the work of the Danish artist Martijn Kounelland, as well as a series of photography exercises and a talk by photographer Ivar Kampf. The show will be on view at the Biennale until April 7. Kounelland’s memorial exhibition will open at the Museum of Modern Art in New York next week. The exhibition will focus on 'the artist’s relationship with the body.”\n\n\nThe French cinéma, a contemporary art exhibition in Paris, will reopen in a few weeks, following a major renovation, in the spring of 2021. Titled “The Black Tear,” the show will aim to “imagine the blackest of human emotions,” and will feature forty-five works by artists working in a range of physical and cultural", "The next Biennial should take place in the spring of 2021 and will be hosted at the Museo de Arte Contemporáneo de Madrid (MAS) in Madrid. The venue will be the home of the residency program, the research and exhibition center José Miguel Otero, and the Louvre. The Biennial will be organized as a platform for artists to present their work for public consumption and will be curated by the artist-in-residence Juliana Alves.\n\n\nArtist and philanthropist Tania Bruguera has been named the new director of the San Francisco Museum of Modern Art (SFMoMA), where she will oversee and enhance the museum’s collection and programming. Bruguera, a San Francisco native and father of two young children, previously served as director of the Museum of Modern Art in New York from 2015 to 2016.“We are thrilled to welcome Tania to the SFMoMA family and to celebrate her extraordinary achievements over more than thirty years at the helm of the Museum,” said SFMoMA director James Goldin. “Her expertise, passion, and excellence for curating and writing about art and the history of San Francisco and the Bay Area make her a perfect", "The next Biennial should be held in early 2021, and a more ambitious vision will be developed over the next two years. The Biennial will be organized as a series of exhibitions, each focusing on a specific theme, that will be assembled and curated by a single curator. The first exhibition, “Intelligence and Presence” (March 2021), will showcase “intelligent design” (February 2021), “interference with the human environment” (January 2021), and “reality” (December 2021). The second exhibition, “Away from the Camera: Art in Motion” (May 2021), will feature works by less well-known, less established, and less established artists affiliated with various international and regional art biennials. The exhibition will premiere at the Museum of Contemporary Art (MoCA) in Los Angeles.\n\n\nThe Museum of Modern Art (MoMA) in New York has acquired the collection of twenty-nine artists, including Ed Ruscha, Peter Hujar, and Eïvria Nistor, from the Sackler family, which has been embroiled in a legal battle for more than twenty years. According to the New York Times, the family has spent more than $3 billion on preserving the works", "The next Biennial should take place in 2020, and the first in 2021. \n\nCannabidae, the Cambridge and London based nonprofit that aims to bring contemporary art to Cambridge, is retiring after twenty-three years. The organization was founded in 2003 by Richard Desmond and Richard Price. It has staged more than one hundred exhibitions in the United Kingdom, and was awarded a CBE in 2008 for its work in the production of cultural events.The organization will continue to advocate for the arts in Cambridge to be included in the city’s upcoming budget and mayoral election campaigns. Its next exhibition, “The Future Is Present: How Art and Design Shape our World,” will open at the Cambridge Art Gallery on October 22. The organization will also hold the first exhibition of its new collection, “The Future Is Present: Design & Architecture,” at the Leicester Square Art Gallery in December.\n\n\nThe Museum of Modern Art (MoMA) in New York has introduced a new digital platform that will allow visitors to explore the collection and display of the institution’s collection. The platform, called MOVE, will allow visitors to browse through the exhibition programs—including the work of Alice Aycock; Alan Seroussi�", "The next Biennial should draw from the output of the forthcoming and existing exhibitions and should employ a common selection of works from the biennial. The theme should be “intersection of art and philosophy and the body.” The committee will decide on the themes and the catalog of the exhibition by June 30.\n\n\nThe Metropolitan Museum of Art (MoMA), the Museum of Modern Art (MoMA) and the Whitney Museum of American Art in New York have announced that they are working together to establish a new partnership, called the Metarhone Foundation, that will champion the work of underrecognized and underrepresented artists. The foundation will focus primarily on funding fellowships for artists currently underrepresented in the United States and will launch in 2020. The institution plans to feature a residency at the Met in a museum setting for artists who have not yet been recognized and will place the stipends toward the creation of new works. “In support of the work of underrecognized and underrepresented artists, the Metarhone Foundation will:1) create a new series of fellowships that will provide financial support to artists in NYC who are currently underrepresented;2) offer a residency at the Met, where they will receive support for their work", "The next Biennial should be held at the Palace Museum on the National Mall, in Washington, DC, in 2021.\n\n\nThe National Gallery in London will soon be acquired by the National Trust, which will now continue to operate the institution. The purchase price of the then-controling assets is estimated at $1.7 billion. The National Arts Council is now considering whether to sell the Tate to the Trust, which is currently negotiating an agreement that would see the Tate closed for a period of ninety days a year.The trustees of the Tate have been discussing the possibility of selling the iconic British art museum since 2015, when the institution was still run by the National Union of Students (NUS), who had recently voted to form a union. NUS decided to campaign against the Tate’s move to the National Union of Students (NUS) and the new National Union of Journalists (NUJ), which swept to power in May 2016, only to see it overturned by the new government.The trustees said: “We have always believed that the future of the Tate lies with the National Trust. As a trustee I am delighted that we have been able to secure the National Union of Journalists’ support for our campaign against the Tate’s", "The next Biennial should be held in 2021, the organizers said.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it is filing a private lawsuit against Donald Trump’s presidential campaign alleging that the billionaire real estate developer violated copyright law by inviting his supporters to an event at the museum in March. The lawsuit was filed by the Campaign Legal Center (CLC), which is a not-for-profit, not-for-profit arts advocacy organization based in Washington, DC. “As anyone who has ever visited the museum knows, the Trump campaign was not upfront about the kind of event it was holding and about what it was inviting people to,” said Clark Robbins, president and CEO of the Campaign Legal Center. “Instead, it invited people to its private event and then tried to hide its presence from the public. The campaign appears to have misled people who were invited and to those who were not, by saying that the event was ‘private.’”A spokesperson for MoCA told Artnet News: “We are not aware of the lawsuit. We are reviewing the matter, and we will answer any questions that are raised by the courts.”\n\n\nArtist-run galleries", "The next Biennial should begin in 2021 and will consist of thirty-six artists, including Hetain Mohamed, who was selected for a solo exhibition at the 100th Venice Biennale in 2020, and a selection of works by forty-one others. The show will be held at the Museo de Arte Contemporáneo in Barcelona and will run for fourteen weeks.The first episode of the upcoming exhibition will feature the work of artist Badr Haroon, who is known for creating works of social justice. “We are delighted to support him and his extraordinary practice in the work of championing and preserving work of the most diverse and important artists, including those under the patronage of the university,” said João Paulo de Oliveira, chairman of the university, in a statement.In the second episode, which will be held at the Museo de Arte Contemporáneo in Barcelona between November 11 and November 12, 2019, the exhibition will focus on the legacy of Pablo Picasso and the African diaspora. The show will also introduce a new class of contemporary artists, called 'Grandes Pastes', and will be accompanied by the first programme of the university’s new Warner Theater Center in the United", "The next Biennial should take place at the city’s Art Museum, a building designed by Danish architect Lars-Christian Eriksen, in the summer of 2022. Los Angeles’s Metropolitan Museum of Art is currently constructing its new home for the museum, which will replace the existing building in a building currently undergoing construction.   While architects have used the biennial to present the works of renowned contemporary artists such as Willem de Kooning, who was included in the third edition of the exhibit, and Ana Mendieta, who took home the grand prize this year, the theme of this year’s event is “Toccarra: How She Became Art.” “We are thrilled to be the first to present this new work by a known and emerging artist,” said  Hannah Menning, chair of the board of trustees. “Toccarra’s work is a masterpiece, a work that is both sprawling, extensive, multifigure, and wholly original.”During the exhibition, which was co-organized by the Los Angeles County Museum of Art (LACMA), the Los Angeles County Museum of Art, and the Los Angeles County Museum of Art’", "The next Biennial should open in March 2020.\n\n\nThe Palm Springs Museum of Art has announced that it will return the custodial duties of its landmark Central Gallery to the artist-run nonprofit organization the Art Institute of Chicago (AIC). In a move that will greatly benefit the arts and the visual arts (and potentially benefit the city’s economy), the museum will become an “adviser” for AIC, which will operate the gallery through the end of the year, and will begin to host exhibitions. The institution will also begin to offer classes and residencies for artists.“We are thrilled to see how this project will unfold and are confident that, in the coming months and years, AIC and the Chicago community will be able to support and thrive under its guidance,” said Rick Oster, director of the museum. The art institution also revealed that it plans to collaborate with the University of Chicago, the University of California, and the Chicago Architecture Center (UCLA) on the construction of a new visitor-accessed section of the museum designed by the architects Knud Rasmussen, Marc Glimcher, and Peter Zumthor. The section will connect to the museum’s current level and will boast", "The next Biennial should include the “final exhibition of the ‘encyclopedic’ series.” The full list of participating artists is as follows:Alice Aiken, The Fall of the City of New York (1952)Bob \"Blue\" Brennan, The Black Sky (1952)Jack \"Baby\" Brennan, The Dreamer (1952)Richard Crawford, My Hero (1952)Deana D. Côté, The Dreamer (1952)Vincent Eustache, The Dreamer (1952)Diane Gardiner, The Dreamer (1952)William A. Kenny, The Dreamer (1952)Tom Jones, The Dreamer (1952)Cameron K. Disney, The Dreamer (1952)Clemens Kraus, “The Dreamer (1952)” (1952)Jill Kelley, The Dreamer (1952)Joseph Levine, The Dreamer (1952)Artists in the series:Jimmy Margiela, The Dreamer (1952)Diana Martin, The Dreamer (1952)Neil K. Lynch, The Dreamer (1952)Tom Stupen, The Dreamer ("]