["The next Biennial should be held in mid-May, and the event should be open to the public. Since the exhibition is not open to the public, organizers are planning to hold an online version of the event, which is scheduled to run from June 14 to June 16, at www.kaminskiyst.com.\n\n\nThe Museum of Fine Arts (MFA) in Boston has announced that it plans to open in the spring of 2021. The institution will also introduce new programs and greater accessibility for visitors. The spring opening coincides with the annual March for Art, which has been celebrated by more than six thousand artists and galleries since it began in March 1985. The March for Art is now a worldwide event, and art galleries and museums are participating in its March for Art wherever they are.The museum will introduce two new programs, “Face the Facts: Art and the Human Face” and “Suggestions for Art,” which will highlight the work of twenty-five contemporary artists. The programs will reasonably close out the museum’s 2021–2022 season with a presentation of a special exhibition of work by artist Russel H. Gilbert. The show will feature twenty works, 70 works by artists from the", "The next Biennial should be held in the spring of 2020.\n\n\nThe Solomon R. Guggenheim Museum in New York has announced that it has received a gift from the estate of the late George Floyd, the late founder of the hip-hop group Public Enemy. The gift comprises a set of three boxed sets, numbered 1, 2, and 3, which were given to the institution by artist and collector David Salle. The sets are part of the collections of David and Iris Salle, who purchased the three boxed sets from an estate in California earlier this year.The Salle family, which relocated to the United States from Mexico in 1981, began collecting art from the estate in 1996. Since its acquisition, the museum has expanded its holdings of Floyd’s work, which encompass nearly three hundred works, and has staged exhibitions of artworks by artists such as Van Gogh, Van Dyke Parks, and H. R. Giger. The collection also includes works by artists such as the Nude-Skinned Man, the Tijuana Brass Band, and the Mexican-American painter Ishmael Arquette, and includes the works of artists such as Hélio Ponti, Rineke Dijkstra, Humber", "The next Biennial should commence as soon as possible. If it is postponed or canceled, the exhibition will return to the museum on May 22.The exhibition will also be affected by the coronavirus. The University of Michigan (UM) announced on April 8 that it plans to move the event from May to November, citing the outbreak as one of the reasons. The move has been criticized by some community members, including those in the city of Flint, Michigan, who are concerned about the safety of the artists and organizers. As of April 10, there were more than 1,300 cases there and the coronavirus has infected at least 284 people there. On Monday, the city council declared a state of emergency, and on Tuesday, Governor Rick Snyder announced that the coronavirus has been contained in Michigan and it is unlikely the city will experience any new outbreaks.The United Kingdom also confirmed that it is currently on track to have the highest number of cases of the virus outside of Asia. According to the New York Times, the UK accounted for seventy-five of the eighty-eight cases in England, and forty-six of the ninety-three cases in Scotland, with the majority of cases in the West Midlands. While the number of cases in the UK is expected", "The next Biennial should be held at the KW Institute for Contemporary Art in Frankfurt, Germany, in June 2020, and will then return to New York for a third and final iteration in June 2021.\n\n\nNaftali Bennett, who was appointed as the next director of the Israel Museum in Jerusalem in August 2018, announced on Thursday that he plans to resign from the post in May 2020. He will take a senior role in the institution, which is currently undergoing a major renovation, and will return to the West Bank to work with the organization’s board and staff.“Naftali’s vision to organize a museum in Jerusalem that reflects the rich and vibrant history of the city and is a celebration of the memory of the State of Israel has been achieved,” said Maudor Bennett, director of the KW Institute for Contemporary Art. “The museum will be a laboratory for the intellectual and artistic development of young Israeli Israelis and will be equipped with this history’s collections, exhibitions, education programs, and programming. Naftali’s successor will be entrusted with the task of strengthening the museum’s cultural, educational, and research program in the city and region.”In his announcement,", "The next Biennial should be held in the Spring of 2021.  The first exhibition, “An Exhibition of Contemporary Art,” is currently on view until December 26, 2020.\n\n\nThe Los Angeles County Museum of Art (LACMA) has added three new artists to its roster: James Turrell, James Cordy, and Etelalie W. Evans. The institution also announced the promotion of three other new artworks, which were selected by the curators from a shortlist that included Tyler McCarthy, Camille Blatrix, and Leonardo DiCaprio.“This year’s LACMA curators’ selections reflect a collective commitment to quality and imagination, for the benefit of our audiences and the larger community,” said Catherine Booth, director of the California Institute of Technology. “We are honored to honor these three curators and to present them with the new works by James Turrell, James Cordy, and Etelalie W. Evans, as well as the work of each of our curators in a special exhibition on the occasion of their centenary.”The artworks are The Man Who Killed Angels: Clouds of Dust and Ice, 2019, which was commissioned by the", "The next Biennial should be held in 2020. For more information, visit MBLC.com.\n\n\nAfter a new $1 billion settlement was reached with the state of New York over the ongoing coronavirus outbreak, Governor Andrew Cuomo announced on Monday that the state will divert $750 million from its general fund to prevent the spread of Covid-19. While the move wasn’t unexpected, it is one of the largest relief efforts in the country.“This is a crisis that has infected every facet of our lives and our city, and it has infected every one of our neighbors,” Cuomo said. “We have made tremendous progress in fighting CCS and we have a responsibility as a public servant to help these states and our neighbors through this crisis. But there is more work to do.”As part of the deal, New York City will divert $223 million from its general fund to help states struggling with Covid-19—more than $86 million—and will give out over $40 million to individuals and organizations such as the arts, food pantries, and religious groups. The city’s contribution is nearly twice as much as the state is giving out to individuals. In addition, the state will", "The next Biennial should be held near you. “We are very much looking forward to welcoming the new collectors in the fall, and to working with you and our talented team,” said Jean-François Baillie, the president of the exhibitors.The first series of exhibitions, “Avant Garde” (2019), was held at the Museum of Modern Art in New York, the Museum of Contemporary Art (MoCA), London, and the Museum of Contemporary Art, New York. The exhibition opened with the exhibition “Art in Motion” (2019), a show of work by artist Peter Andre, and ran through March 27. \n\n\nThe New York City Department of Cultural Affairs (DCLA) has launched an online survey to understand the experiences of cultural workers in the city’s public arts and cultural institutions struggling due to the Covid-19 pandemic.The survey, which will be conducted by the city and will provide data on a variety of topics, including the financial impact of Covid-19, will help the city assess the health of its arts and cultural community and will help the government better understand the challenges and opportunities faced by cultural workers across the city.The survey, which will be", "The next Biennial should be held in 2023. \n\n\nThe Hirshhorn Museum in Washington, DC, has received a gift of twenty-eight rare works by women artists who are currently incarcerated in the United States. The institution opened an online viewing room for the works, which were donated by donors who were serving time for nonviolent crimes, in 2017, and has since proven that the platform can be used by scholars.The gift includes works by such notable figures as Virginia Woolf, Joan Miró, Sally Mann, and Maria Montessori. Previously, the Hirshhorn had only offered public tours of the museum and put out a list of artists who were in the institution’s collection. The new online tool will allow the museum to showcase the works of women artists who have been incarcerated and will also allow the Hirshhorn to keep track of the contributions of the women artists who are incarcerated.The Hirshhorn’s efforts to include more women artists in its collection began in 2014, when the institution donated fourteen works by Catherine O’Grady to the Metropolitan Museum of Art. The donation became a watershed moment for the museum as it became one of only two institutions in the United States to match the Hirshhorn’s gift", "The next Biennial should focus on the history of the museum and the impact that it has on the city of Honolulu. The exhibition will be curated by Hernán Díaz, director of the Museo de Arte Contemporáneo de Honolulu and the National Gallery of Art in Washington, DC. The Biennial will focus on the museum's collection and collection-based experiences, with a particular focus on the works of Haida artist Nan Goldin. Goldin, a long-time collaborator of the museum, helped create the recently renovated building where the museum now operates and helped raise more than $45 million for the institution.“The museum has been and will continue to be a major scientific and cultural center for Hawaiʻi,” said Díaz. “We are grateful to our guests, supporters, and partners, including the city of Honolulu and the County of Honolulu, for their enthusiasm and support over the years. And, to our community, we are grateful for the memories of those we have lost and the opportunities that this exhibition has given to engage with these important materials.”\n\n\nNew York artist David C. Driskell, whose work reflected a deep understanding of the craft of painting, sculpture,", "The next Biennial should be held in 2019, when the 2022 edition will open. The 2018 and 2019 editions were curated by Jean-Michel Blum. The 2019 event will feature the work of twenty-two artists, including Ewa Radcliffe, David Hockney, and Paul Graham; the artist-in-residence will be three-time winner Hélio Otero. The current show will be presented by University of Applied Arts, The Hague; the National Fund for Contemporary Arts, The Hague; the Pulteney Foundation, The Netherlands; and the British Council.\n\n\nThe Art Newspaper has learned from an anonymous source that the Tate has hired development director Michael Wootton to oversee the academic and public experience at Tate Modern, the Tate’s flagship museum, as the institution prepares to reopen to the public in March 2020.The news follows the announcement last month of the new partnership between the Tate and the National Poetry Library (PNL), which will open in April. Tate will partner with the PNL to launch a new Reading Room, a digital platform that will allow visitors to enter a reading room within the museum, and will temporarily relocate several collections to remote locations throughout the UK.The announcement of", "The next Biennial should aim to introduce a new social model for art, focusing on democratization and dissemination of art in the same way as the Salon and the European Biennials. The exhibition should introduce a new social place, a new social mission, and a new discourse around art and culture. It should aim to create an environment that will create a shared vision of art and art history through a social and political vision of art.”The exhibition will be organized in three phases: 1. The exhibit “Arts Cities: Art and the City in the Late 1980s” will reconfigure the museum in the late ’80s in order to present a new collection of works by artists such as James Iha, Anish Kapoor, and Robert Irwin. 2. The exhibition “Arts and Culture: Europe and the Post-1980s” will present a selection of the thirty-six artworks by artists and cultural workers that were created after 1980. 3. The exhibition “Arts and Culture” will also include an online exhibition that will showcase previously unreleased works by artists between the 2020 and 2020s. The invitation comes at a time when the demand for more arts funding is growing, but at", "The next Biennial should be held at least a decade from now, and hence we consider it critical that the exhibition “open anew,” to the question of how this will transform the course of the exhibition and our lives. It is up to us, therefore, to create, shape, and shape again. For in the absence of a biennial, the exhibition will be remembered, and its exhibition-goers will be remembered, as an icon of the gallery’s role in the development of contemporary art.\n\n\nAfter the 2016 presidential election, artists and cultural organizers across the United States launched campaigns to promote an inclusive vision of art policy and to shift the focus of public art from the collection and distribution of art to the creation and promotion of art. In response to the election of Donald Trump as president and the rise of populist and anti-environmental movements, art organizations and artists have pushed back against the politics of exclusion and populism. They have called for a more inclusive, diverse, and balanced approach to conservation and distribution. They have called for a public art museum’s stewardship of the environment and a public space that reflects the diverse histories of the communities in which it is located. And they have called for a public museum to become a", "The next Biennial should take place in the summer of 2020, and the dates for the 2020 event will be announced soon. The next edition of the Biennial will be held at the venerable Balzac Gallery in Paris from April 22 to April 24, 2020. The biennial will be inaugurated by the exhibition of work by a group of artists that includes Ed Atkins, Léna Mitchell, Khairoum Tursi, and Ibrahim Rashid, amongst others. The event will also feature a special exhibition of work by young and emerging African artists. The International Panel on the Arts (IPA) will present a study on the role of artists in the fight against the Holocaust at the Museum Freie Kunstverein Berlin in March 2020.\n\n\nThe Hungarian artist György Kepes has won the Nobel Prize for Literature. Kepes, a Hungarian writer and activist who was a member of the Communist Party during the purges of the early 1980s, was also a cofounder of the Center for Art and Social Research (DASS), part of the ruling Fidesz party, and a cofounder of the state-owned Sittmürdal steel works company. In celebration of the two-", "The next Biennial should have received its funding from the same donors as the previous one, but with a few key differences: the first will be an all-new design, while the second will focus on a rethinking of the gallery’s relationship with the city of Boston, as well as a discussion of new forms of collaborative art.The Boston Arts Council has since received $100,000 from the Sacklers, and the Boston Cultural Trust has pledged $100,000. The Trammell-Renaissance Museum in London has also become embroiled in the ongoing legal battle over the Sacklers’ acquisition of the estate of Douglas and Edith Sackler, the founders of the company that owns the Sacklers’ company, a real estate and development company. The family is currently suing the Metropolitan Museum of Art, which is suing to clear their name, in an attempt to settle the legal claims. The museum, which was founded in 1931, is asking for $6.5 million from the Sacklers and is demanding that the family pay $2 billion over the course of ten years. The family is refusing to budge. The family is also demanding that the Sacklers sell the artworks and have a public vote on their future.", "The next Biennial should be held in 2022, and the 2020 edition will be held in 2021. Professor Olivier Frantz, the chair of the Department of Dental Medicine at the University of Basel, said: “The twentieth edition of the Biennial will be a major milestone. We will be very proud to present this outstanding collection of works in the year 2021.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it is expanding its digital programmatic boundaries, expanding the geographical reach of the museum’s digital platform and its collections by adding the digital content of the South Asian contemporary art community to the institution’s collection. The MoCA Digital Archive will be a hub for the current exhibition season and the archive, which will be housed in a former shopping center and will be inaugurated by a new exhibition, “The Present,” on May 22, 2019 and will be accessible to the public on June 2, 2019.The museum will also offer free online tours of the new venue, which is being designed by the architects of California’s Silicon Valley, and the new extension of the San Francisco Museum of Modern Art. The new facility, which is being constructed on the campus of the University", "The next Biennial should take place in the spring of 2021. The museum will present a selection of works by artists whose work has been previously featured in the Biennale. The exhibition will feature work of twenty-five artists and will run until December 22, 2021. The Biennale will also include three exhibitions, curated by Renate Fæstenberg, the chief curator of the Biennale; John F. Kennedy Center for the Performing Arts; and the New York Philharmonic.A statement by the Biennale said:  Øyvind Skovdal, the director of the Danish National Museum, said: “The Danish National Museum has been without a director for twelve years now and is at an early stage in the search for a new director. The appointment of Jakob Nielsen as director is a real milestone, taking Danish National Museum into the next stage in its history. The appointment of Nielson as director reflects an extraordinary commitment to the museum, and a deep understanding of how it would benefit from an international team of curators and experts. Nielson brings the experience needed to bring the next Danish National Museum to life and is committed to building on the successful legacy of the Danish National Museum. Under his leadership,", "The next Biennial should be held in 2019. It will be additionally awarded a $200,000 special grant from the Institution of Arts and Design. “There is a great deal of uncertainty about how the 2020 festival will be received, and how it will be received by the public,” said Mike Washington, chair of the board of trustees of the Art Institute of Chicago. “However, I believe that the Berlin-Berlin Biennial is one of the most important exhibitions of the twentieth century. It represents the hope and the passion of many artistic and cultural producers in the city, and I am hopeful that the exhibition will inspire others to consider the possibility of a future here.” Earlier this year, the museum staged several exhibitions in response to the current global crisis, including “The future of art?” (2019) and “The end of art?” (2017). The latter was a retrospective of the artist-led group GENICE and was set to open at the Museum of Modern Art.\n\n\nThe New York City Department of Cultural Affairs (DCLA) will soon begin accepting applications for the $6 billion redevelopment of Central Park, reconstituting the park’s outdoor", "The next Biennial should focus on the 'Art of the Future' and its relation to contemporary art. As we approach the seventy-fifth edition, we must consider our place in the chronological order of our history, and how art can serve as a means of bringing about social change.”The theme of the show will be “A Problem of Imagination: The Durandal and the Ethnography of Contemporary Art” and will incorporate research and readings from a wide variety of disciplines. Among the artists and thinkers who will be featured in the show are Leonard Cohen, Arundhati Bhabha, Yoko Ono, Phyllida Barlow, Michael Musgrave, Helen Frankenthaler, J. M. W. Johnson, and Jean-Michel Basquiat. The twelve artists who will provide the setting for the exhibition are:Chen Yinzhong (China)Dian Qi (China)Dian Qi (China)Jin Hu (Taiwan)Hong Liu (Taiwan)Hsin-Chun Cheung (Taiwan)Liu Chien-Ju (Taiwan)Liu Cui-Hsin (Taiwan)Ming Chiu (Taiwan)Sohrab Mohebaf", "The next Biennial should be held in 2020.\n\n\nThe Metropolitan Museum of Art in New York has canceled the upcoming exhibition “The Metamorphosis of Mary,” a show that explored the relationship between Mary and Jesus Christ. The exhibition, which was to have been organized by the nonprofit 'The Mary Institute,” was to have featured sculptures by thirty-one artists, including the French visionary Jean-Michel Basquiat, and was scheduled to open on August 7. “As we have previously made clear, the show will not feature ‘The Metamorphosis of Mary’\u0097that project will not be staged in 2020\u0097and will not be presented in the near future.” The move follows the announcement that the three-day show, titled “The Metamorphosis of Mary’ II,” would not be rescheduled. The museum’s director, Cynthia Campbell, also told the Art Newspaper that the exhibition had been canceled for two years and had “been on a back-burner” since its May 2019 opening. “We’ve had some conversations about relocating the show, but never about this scale of departure and work that was done,�", "The next Biennial should be held at the National Museum of the African Diaspora (in Birmingham) in the United Kingdom, in May 2022; the International Museum of Modern Art (in New York) in December 2022; and the Museum of Contemporary Art (MCA) in Los Angeles in March 2021.Located in the historic city of Birmingham, England, BlackRock is one of the largest shareholders of British Petroleum. The investment firm holds more than $100 billion in shares of Classified, BP, and Royal Dutch Shell; Aramco, the oil company run by the Koch brothers; and other major oil and gas companies.\n\n\nThe Center for Italian Modern Art (CAMAM) in Rome has announced that it is raising funds for its expansion, which will add an additional fifty works to its collection. The project is part of a broader plan to become a leading curator of Italian art. The center also aims to become a major international exhibition venue. “The aim is not only to create new experiences for visitors, but also to be a dynamic tool for the development of the public collection of Italian art,” Carlo Cappellani, the president of CAMAM and the Italian director of the Museo Nazionale di Cenneto, told", "The next Biennial should be the first in the city for almost thirty years. The museum’s president, Rachel Brodsky, told the Art Newspaper that the institution has been discussing the need to relocate to a new home for thirty years. The recent push to reopen the museum has been fueled in part by a $1.2 billion capital campaign that saw the institution added two new galleries and a new campus designed by architect Robert Moses.The new five-story structure, which will have a special exhibition space devoted to “Mysticism” and its iconography, has yet to be named but will sit in the museum’s new home on the northwest corner of Fifth and University Avenues. The new pavilion will draw 55,000 visitors annually, marking the first time the museum’s art collection has been staged in the United States.The museum is also planning to open a new seven-acre site in the city’s Tudor Gardens in 2020. The Tudor pavilion will be a new extension of the museum, which is currently being renovated by the National Gallery. The Tudor Gardens project is part of a $9 billion revitalization plan for the city’s urban core. The project will also see the", "The next Biennial should be held at the Museum of Fine Arts in Brussels in the fall of 2020. Munich-based designer Elena Dolomites will design the exhibition. The event, which will be led by director Stefan De Bont, will showcase the work of forty-eight artists. The selection committee comprises David Albright, director of the São Paulo Biennial; Markus Bacher, director of the Biberhaus Berlin; Sara Bremner, director of the Department of Modern Art at the Museum of Fine Arts in Boston; Jodi Throckmorton, director of the Berenice Abbott Bech Archive in Prague; Sara Williamson, curator of modern and contemporary art at the Museum of Fine Arts in New York; and Robert Weiler, director of the Albright Gallery, New York.\n\n\nIn the aftermath of the Las Vegas mass shooting on October 1, Clark County, Nevada, which includes Las Vegas, took the first legal action in the United States against two New York–based gun dealers: Ross Ulbricht and Carl Mark Force. The county alleges that they ran a massive criminal enterprise that enabled their clients to traffic in weapons and sold the drugs that caused the mass shooting in", "The next Biennial should take place in the city in 2021.\n\n\nThe Miami-based nonprofit the International Center for Photography (ICP), which is based in New York and provides studio space and studio photography to artists and institutions, is suing the city of Miami over the reinstallation of a $6.2 billion transportation and infrastructure project that will expand the art district Miami Beach. The lawsuit, filed in federal court in Miami Beach on February 24, alleges that the project violates the Coastal Protection and Restoration Act (CPRA), which was passed in 1976 to protect the area around the new Doral Miami Beach, and the City Planning Commission (CPC) Ordinance No. 791, which sets the city’s design guidelines.“The ICP’s position is that the expansion of the Art Museum should not be permitted is unacceptable,” said Nicole Ehrlich, executive director of the nonprofit. “We are seriously considering a legal challenge so that the project can be fixed and the ICP’s vision realized.” The Miami Beach Sun-Sentinel reports that the eleven-mile expansion of the Art Museum and Botanical Gardens will involve the demolition of the existing structure, which opened in 1966 and is", "The next Biennial should be in 2021, the writer said.  Moses Nelson, director of the Museum of Art, New York: \"The concept of an annual exhibition around the theme of human existence cannot be overstated. . . . The Art of Life: Essays on Movie and Dance, 1959–1963, is a superb work of conceptual art in which the work is articulated in a way that is both challenging and deeply intimate.”In the art world, a new exhibition title is introduced each March and is entitled “The Year Ahead.” The new event will present “The Future is Present,” a selection of works that walk a fine line between serious and surrealism. It will also feature the first-ever arts-world biennial “The Seeds of Splendor,” a project that will see the seeds planted by artist and filmmaker Sergio Rojas, who will direct the biennial.The biennial’s theme will revolve around the role of art in shaping the trajectory of human existence and will debut in 2022. The biennial is also expanding to ten cities in the United States from the current twelve.\n\n\nThe British artist, journalist, and curator Hal Foster, who created", "The next Biennial should commence in early 2020 and will reconfigure the Exhibition and will offer more diverse and extended exhibitions. The date for the third iteration of the exhibition will be October 24–November 3, 2020.\n\n\nThe City of New York and the Museum of Modern Art (MoMA) have announced that they have reached an agreement that will see a total of $9.5 billion in repairs and improvements made to the iconic St. Patrick’s Cathedral, as well as the Metropolitan Museum of Art. The $3.2 billion renovation and expansion of the cathedral was completed in 2017 and is currently undergoing a $1.9 billion expansion.In a statement, MoMA said: “We are thrilled to enter the twenty-first century with these new buildings. The new museums greatly enhance the city’s cultural and educational heritage, and embody the architectural and engineering excellence of the original buildings. This is a transformative time for New York, and for the nation as a whole. We are confident that these buildings, curated by MoMA, will contribute to the city’s continued growth and future success as a vibrant cultural and creative hub.”The first phase of the renovation project, which involved the demolition of the cathedral in 2019, was", "The next Biennial should take place in Almaty, Kazakhstan, in 2022, and should include new works by artists from both Europe and the Far East.\n\n\nThe National Gallery of Art in Washington, DC, has won the 2019 $1.1 million Cinéma Film-Télévision—a prestigious $100,000 prize that came with $100,000 in cash. The prize jury, made up of artist and commissioner Susan Wojnarowicz, director of the Art Museum of Oklahoma City and Nell Dorr, awarded the honor to the institution on Thursday evening.“Through an artistic, critical, and imaginative approach to film, Cinéma has created a unique and challenging aesthetic which neither radically reshapes the film-world nor attempts to, but rather attempts to bring about a much-needed radical change,” said jury president Jonathan D. Burns. “Through its filmmaking, writing, and installation work, Cinéma attempts to address the existential issues confronting modernity, responding to the ideas of the Digital Age by engaging in a literary and non-linear narrative, reflecting both the individual and the global in its cinematic productions.”The annual $3,000 $2,500 prize, which", "The next Biennial should have an opening date of October 21. It’s already taking place in July. The first edition, titled “The New Arab,” was held in June. The last edition, “The Arab Spring,” was held in February.The upcoming exhibition, titled “Intersection,” will focus on the integration of art and politics, and will include works by twenty-one artists and organizations. The twenty-three-person jury will consist of Ibrahim Abdel Nabi, director of the Arts and Architecture Department, AlUla; Nadim Allam, head of the culture and education department, AlArabiya; and Halil Altind, the head of the department of contemporary art. The jury’s decision was unanimous. “The verdict is an affirmation of what I have been saying all along: the future of art and politics in the Arab world is now,” said Nabeel Saeed, the exhibition’s artistic director, “and it must continue to be art and politics. My hope is that this exhibition will further inspire and challenge young artists through a kind of participatory experience that draws inspiration from the ancient history of the Arab world", "The next Biennial should take place in the middle of the month and will focus on the development of contemporary art in the city, combining experiences of the city’s cultural scene with the history of the city as a whole. The exhibition will include the first-ever exhibitions dedicated precisely to the history of the city as an institution, and will invite the public to experience the history through a contemporary aesthetic lens.The show will also carry the first-ever biennial of the contemporary art of the city as an artistic entity, with the result that the exhibition will be triennials in length and format. The exhibition will feature work by artists in all disciplines, including architecture, fashion, film, design, and performance.The inaugural exhibition “The Antenna,” organized as part of the museum’s yearlong celebration of its centenary, has received a new $250,000 gift from the city of New York. The $150,000 gift was made by collector and activist Fernando Pinto, who chairs the city’s Cultural Affairs Committee, during a ceremony at City Hall on September 23. Pinto is a longtime collector who raised more than $100 million for the museum. His gift coincides with the institution’s two-year anniversary", "The next Biennial should be in the next six months. We are currently drafting a new code of conduct that will define the behaviour of the pavilion at the fair and will be delivering a proposal for this next edition to the artists in the coming months.We are working on a new location for the fair, which will take place across from the Museum of Modern Art and the Museum of Contemporary Art San Francisco. We are also continuing to develop our digital platform, which is currently in the works, and are planning to launch a redesigned Exhibition for Indigenous People in 2020, which will present more stories from the world of South American art.\n\n\nThe Finland-born and Paris-based artist Urko Niska will present a solo exhibition at the new Forschung Design Museum in Helsinki on March 10. Niska will work with the redesigned building as it unfolds its first major renovation in more than two decades. The exhibition will take up themes such as design, transport, and beauty and will run concurrently with the upcoming exhibition “Tacita Dean: Stand New Times,” which will open in Kassel on April 16.“While the show is dedicated to the automatism of the old, it will also reflect the internal lives of contemporary artists and will", "The next Biennial should be held in 2020. “It is important for the city to invest in the cultural and social wellbeing of a diverse and underrecognised population,” said Juliette de Bast, head of the collection, which comprises works by sixty artists and activists. “The exhibit ‘Decolonisation: Art and Politics in the Struggle for Human Rights’ will showcase the work of contemporary artists who are challenging and challenging our own conceptualities of art and politics, and our relationship to each other.”\n\n\nThe Central Academy of Fine Arts (CAA) in Beijing has appointed Isobel Zaghari as its new artistic director. In her new role, Zaghari will focus on spearheading a revitalised CAA. “Isobel’s first goal is to focus on the CAA, which is a great champion of artists and designers and artists of the future,” said director Zoya Rometto. “Her experience in global creative affairs will be crucial for our efforts to expand the exhibition circuit in China and to strengthen the CAA’s international reputation.” Since its founding by CAA founders Wang Qijie and Wang Yu, the", "The next Biennial should take place in 2021 and will be a collaborative effort between the museum, the Spanish government, the city of Barcelona, the Catalan government, and the museum. The museum and the city will host the exhibition alongside the Museum Severin in the city of Valencia and the Museum de Catalunya in Barcelona. The exhibition will also be presented in the city of Almería, the Catalan capital, and in the northern region of Aragón.The exhibition will feature approximately 300 works by thirty-four contemporary artists, including Anna-Sophia Benítez, María Cuiária, Agustín Sola, and María Berrada, as well as original works by some seventy-two artists from thirty-six countries and territories. In addition to the works presented in the exhibition, the museum will house the collection of Catalan artist Fajara Alcáns, who is also known as the 'Culmira of the Spanish Monuments, 1968 to 2008, and the collection of the artist Valentin Gómão, who is known for his sculptures in the form of conceptual worlds.The exhibition will also include a catalogue of all the works that were exhibited at the exhibition, which was organized in collaboration with the", "The next Biennial should take place in the city in 2021, and the first exhibition should open in 2022. It will also be hosted by the city of Sao Paulo, and will consist of fifty works on paper. The opening of the exhibition will be followed by a biennial of Brazilian artists in the city of Porto Alegre in 2018, and by an exhibition of work by Brazilian artists in the city of São Paulo, and will be on view until January 24, 2021. \n\n\nLeonor Costa, the founder of the Bienal Triennale in Brazil, has announced that she plans to depart the country in April 2020 to pursue new artistic endeavors. She concluded her three-year run in October 2019, with the triennial finally taking place in March 2020.“I am very sad to announce that I am leaving Brazil at the end of April, but I am not leaving with a whimper,” Costa told the Art Newspaper. “Bienal triennales are not enough to save this beautiful country. I have worked as a curator for twenty years, and I will continue to do so in my new role as curator of the fourth edition of the Bienal Triennale (ABT.)”The", "The next Biennial should take place in 2022. © 2018, the Los Angeles County Museum of Art, the UCLA Art Museum, and the University of California, Los Angeles. All rights reserved. Artisma “The Lasting Image: A Biennial for the Los Angeles Collection” is a joint project of the Los Angeles County Museum of Art, the Museum of Art in Harlem, the Museum of Contemporary Art Los Angeles, and the Metropolitan Museum of Art, the museum’s largest collection. These works are housed in the collections of LACMA, the Museum of Modern Art, and the Metropolitan Museum of Art, the Los Angeles County Museum of Art, and the Los Angeles Museum of Photography.   \n\n\nThe Botanic Gardens of the American West have announced that they are working together to reintroduce the poisonous cyanide-laced stalks of the toxic plant Nepeta americana to Central Oregon, US. The reintroduction is part of a larger project to better understand and manage the wild plant in order to protect its fragile ecosystem and people.“We are committed to working with partners across the country to establish a baseline for understanding and managing the plant,” said Seth Adams, the city’s chief of parks and", "The next Biennial should take place in 2020.\n\n\nMarine artist Pia Camil is suing the Japanese biennial, which is currently underway in Kobe, Japan, in a bid to secure the release of her work, which has been incarcerated in a Japanese museum since 2012. The artist, who was awarded the Shanda Prize for her works in 2015 and is currently incarcerated in a maximum-security prison in Tokyo, is asking for the immediate release of her work and for the organizers to compensate her for lost profits from sponsorships held before and during the exhibition.“I’ve been detained for a year in a Japanese prison. I’m suing to secure the immediate release of my work,” said Camil, who is currently undergoing treatment for a severe case of post-traumatic stress disorder (PTSD). She added that the government’s failure to compensate her \"makes me very angry.”The move follows a series of actions that have called for the release of imprisoned Japanese artists and activists, including Japanese artist Yuko Takashi’s appeal to Prime Minister Shinzo Abe for the release of Yukio Igarashi, who was convicted of inciting racial hatred and sentenced to seven years in prison in 2018. Tak", "The next Biennial should be held in the summer of 2019.\n\n\nThe Bachelet Foundation in Barcelona has proposed a major expansion of its arts and culture programme, which currently supports around sixty thousand artists on an annual basis, with the aim of entering the second phase of the city’s redevelopment, titled the Strategy, that will begin in 2021. The plan outlines the development of a more unified collection, an online platform and a collaboration space that will organize exhibitions, performances, and other programming.Culture Minister Bernat Listy said the foundation will focus on developing a digital platform for the arts and will partner with a number of local organizations, including the Architectural Association, the Museum of Modern Art, the Institut National des Arts, and the RUECA (Union of the Spanish Civil War Museum and Archives). The platform will also host the biennial exhibition of work by selected artists and will present projects and events through select partners. The biennial will be centered around the artist-in-residence, who will be an artist-in-residence for life. The biennial will last for eighteen weeks and will be presented by the Bachelet Foundation.The biennial will be organized from the Bachelet Villa, the federal museum in", "The next Biennial should take place in the south of France in late March 2020.<|endoftext|>Witch Hunt\n\nThe hunt for a witch and her wild cubs in this modern-day take on the witch-hunt, which follows a British photographer who roundly condemns a climate-change protest in London’s Hyde Park as a witch-farm.\n\nThe Spectator\n\nWhen a Paris-based artist's drawings and sculptures are misconstrued by the Japanese as public art, and their works are mistaken for works by Picasso and Velasco Picasso, a painter whose early work was also stolen, a public apology by the owners of the works is quickly followed by a ferocious campaign to have the works returned. In April, a lawyer for the artist Christopher Drahi was appointed to represent the heirs of six of the works, including Picasso’s The Dreamer and his companions, Jacques and Henri Joly, who were arrested last year and convicted of conspiracy to defraud the French state after a massive police operation that involved more than four thousand officers and involved the seizure of more than 5,000 works. On Thursday, the heirs announced that they have withdrawn their claim.The lawsuit was filed by Louis Vuitton, which has an agreement", "The next Biennial should open in March 2020. \n\n\nSan Francisco’s Museum of Modern Art (SFMoMA) has received a $10 million donation from the estate of the late Edward Albee, who passed away on March 23 at the age of ninety-two. The donation was made by his two sons, John and Edward Albee Jr., and their parents, Mike and Kathy Albee.“Edward Albee was a man without a family, a man without a beloved, a man without a legacy, and we are honored to receive this gift from his children, our great grandchildren, and great great-grandchildren,” said San Francisco’s director, Marc Straus.The gift comes at a pivotal point in the Albee’s history. In 1981, the family relocated to a three-acre plot of land in the city’s Mission district, where they launched a successful gallery, which eventually expanded to a five-acre space. The space soon became a home for SFMoMA, which relocated to a new building in the same neighborhood in 1989. Over the next two decades, the museum continued to grow and expanded its holdings, becoming known for its exhibition-oriented programming and for its collection of works", "The next Biennial should take place in the spring of 2022, with a view to being resumed in March of 2020.The exhibition will be inaugurated with a reopening of the Elizabethan Museum in London , which opened on January 21, 1809, and will continue until March 21, 2022. An exhibition of biennial works will also be staged in the fall of 2022.\n\n\nNew York’s Metropolitan Museum of Art (MoMA) has announced its acquisition of Japanese modernist Hiko Yamashiro’s works, which were previously on display in a retrospective at the museum on February 27. The Met has also commissioned the painting of the artist’s long-lost works, which were hidden away for thirty-six years, and the painting of a “shining garden of autumn clouds.” The works, which were discovered in the basement of the museum in 1975, were on display in a retrospective of Yamashiro’s early work, “Speech and Texts” (1979), which was on display for only twelve weeks before it was acquired by MoMA.The works, which were purchased by the institution from the fourteenth-century Japanese collector Hiroshi Yamashiro, were part of a", "The next Biennial should take place in the spring of 2021. The exhibition’s curators, John Gribbin and Angela Lee, will focus on the exploration of the relationship between the sciences and the visual arts in the following years. The 2018 edition of the biennial, “The Painters Speak: Visual Art and the New Science” drew more than 1,900 artists and scholars from seventy-eight countries. \n\n\nThe Friends of the National Museum of Art in Washington, DC, have received a gift of twenty-six works by African American artists from the collection of the late founder of the Washington, DC–based black belt organization Phenomenon’s Legacy. The museum received the works from a collection returned to the organization after a twenty-year legal battle in which the museum claimed the works were not included in its exhibition, “The Future Is Black: Art and the Struggle for Civil Rights” in the fall of 2018. Among the works that were lost are Ainlechaun (1952), an early work by a group of black artists led by Angela Davis and Nell Dorr, and The People’s Hand, a 1963 work by William King, which were", "The next Biennial should be held in the spring of 2022, but its organisers said that the next iteration will not be held on their campus, but the village of Biarritz. The new venue will be a blend of both the museum and a performance center.\n\n\nThe Art Newspaper is reporting that the European Court of Auditors has ruled that the Kunstmuseum Düsseldorf in Germany is still legally obligated to preserve the work of a banned communist artist. In a 4–3 decision published on Wednesday, the ECHR said that the Kunsthalle Düsseldorf is still legally obligated to sell the painting Che Guevara: After the Paris Commune, the central figure of the Communist era, Che Guevara, became a regular visitor to the museum in 1962, the Kunsthalle Düsseldorf was allowed to keep the work as part of a major restoration project that was completed in 2015. The Düsseldorf Museum of Art (DUMFA) - which is owned by the Kunstmuseum Düsseldorf - had initially argued that the painting was part of a collection that", "The next Biennial should begin in 2019 and culminate in 2020. The exhibition will further explore the biennial as an expression of the city’s creative and intellectual life, and will take place across eleven different venues.“The Biennial of Art is a necessary, catalytic step for the development of biennial architecture and a new model of cultural expression,” said architect and curator Ewa Zinsztejn, the chair of the project team. “The new structure will create an environment of interconnectivity, as well as a unique platform for exploring the breadth and depth of the history of contemporary art.”The project team also noted that, while the design of the museum is different from that of most major art museums, the new structure will maintain a similar aesthetic and scale. The Biennial of Art will be located at 90 Père Lachaise in Paris and will be inaugurated by two lectures – one by Le Corbusier and one by Freud. At the end of the exhibition, the museum will offer visitors a special tour and will have live music and performances. The exhibition will also include a book that will be devoted to the art of photography, a photography exhibit based on the exhibition “Photography in", "The next Biennial should be held in 2021 and should represent the whole of the art world, with an inclusive theme centered around the integral role of design in shaping art. It should include performances, exhibitions, lectures, workshops, and events that draw from the narrative of the exhibition as well as a selection of works that are currently on display in the museum.The themes for the 2021 edition include “Conceptual Worlds,” “Paintings from the Contemporary,” and “The Dilemma of Design,” with the first two themes from the exhibition being “The Future of Design and Its Reproduction and the Future of Art.” The 2019 edition featured a selection of new works created by Canadian artists and a retrospective of work by local and established artists.The 2019 Biennial was organized by the Montreal Museum of Fine Arts (MMFA). The museum received $2.5 million from the City of Montreal as well as $2.2 million from the province of Quebec.The 2019 edition was co-chaired by Rene-Adrienne Rich, the director of the Museum of Modern Art in New York; Julia Ganer, the director of the Museum de la Barca in Chicago; and ", "The next Biennial should be hosted at the Museo de Arte Contemporáneo Milan and will be presented by the Museo di Arte Contemporáneo. The sculpture and performance will feature works by a selection of the artists represented in the exhibition.\n\n\nThe Institute of Contemporary Arts (ICA) in Paris has appointed Petra Alsop and Adam M. Alsop, co-owners of Varsity, as the next co-directors of the French institution. Alsop and Alsop will have the opportunity to create new works for the next iteration of the exhibition, titled Paris 2020, and will be responsible for developing and distributing the show. The inaugural edition of the show was held at the French Ministry of Culture in July and had a running budget of $1.1 million. The show ran across three venues—the Museo d’Arte Modern, the Centre Pompidou in Paris, and the Centre Pompidou—as well as the Institute of Contemporary Arts in the capital, ending in June. The new partnership will allow Alsop and Alsop to focus on the performance sector in an attempt to create new works that represent the emerging generation of French artists", "The next Biennial should take place in the spring of 2021, with a new work for each of the thirteen artists selected by curator and writer Tarek Atoui. The exhibition will follow a theme of an idealized, idealized Egypt, one that simultaneously captures the exotic but often obscured history of the country and its people. Focusing on the symbolic, the exhibition will invite a range of approaches with the artist and the themes being addressed.“I am really hopeful about the work we are creating. The best way for us to launch the new project is to present it in the spirit of the city of Cairo,” said Atoui. “Perhaps the most important thing we can do is to try to make sense of the world around us, without any preconceived notions, by being open to ideas and possibilities. This is where the art can be the most helpful, the most stimulating, for our lives and our dreams.”\n\n\nThe French Ministry of Culture has ordered the relocation of the Museum of the Mediterranean, which is currently housed in a seven-thousand-work collection in a Parisian apartment building, to a new location, the Museum of the Mediterranean is moving to the Mediterranean coastal city of Nice, the Louvre,", "The next Biennial should take place in the summer of 2022. This year’s event, “Sunshine: Carbon Dioxide at the Center of Climate,” will be held at the New Museum in New York from March 20 through March 21, 2022. This is a new arrangement, and the institution has yet to announce a new date for its next exhibition. The artists selected for the show are Amanda Conte, Agustín González, Philip Klink, Nan Goldin, and Jürgen Sophie-Auguste. A selection of the show’s most recent exhibitions, “Sunshine: Carbon Dioxide at the Center of Climate” (2019) and “Sunshine: Carbon Dioxide at the Center of Climate” (2018), have been announced. \n\n\nThe world’s leading climate scientists and organizations are calling for the United States to phase out fossil fuels entirely by 2050 and instead invest in renewable energy sources such as wind and solar power.“The climate emergency is real and severe, and climate policies must address it,” said Ming-chi Wu, chair of the Climate Action Forum. “Greenhouse gases", "The next Biennial should be held in Wuhan, China, in 2022. The 40th edition of the Art and Artifacts Biennial will be held in Mexico City, Mexico, in 2021. Art and Artifacts Munich will be held in Munich in 2022.  Art and Culture Festival, the biennial of Copenhagen, will be held in the city of Østrup in the autumn of 2022.  Prepared by the Copenhagen Art Garden, the exhibition will focus on “art and culture as a universal language,” drawing on curatorial expertise, archival curiosities, and public programming. The event will also incorporate performances and performances-making and will present a variety of interactive installations and presentations.  \n\n\nJohn Palmeschi, a former director of the Museum of Modern Art in New York who oversaw the museum for more than eight years, has died at age seventy-one. According to the New York Times, the cause of death was pneumonia caused by a virus similar to SARS, a coronavirus that had previously been found in China. Palmeschi joined the museum as a curator in 2008 and was promoted to director in 2010. He began by touring the museum through a revolving door of executives and", "The next Biennial should focus on how the Parisian art scene has evolved since the September 11 attacks. The exhibition will also consider how the artist’s international reputation has changed following the events of September 11; how the exhibition will reflect this change; and how the exhibition will incorporate contemporary art in the City of Light. \n\n\nThe Metropolitan Museum of Art in New York has appointed Cheryl Ruggiero, who previously served as director of the Brooklyn Museum, as its new deputy director for collections and exhibitions. Ruggiero came to the institution from the Museum of Modern Art (MoMA) in New York, where she was deputy director of collections and exhibitions. In her new role, she will be responsible for the management of collections and exhibitions, including the lead-up to, and acquisition of works by contemporary artists.“Cheryl has been instrumental in shaping MoMA’s collection strategy and mission, guiding the museum through its transition to a new headquarters, integrating key exhibitions into its programming, building relationships with major artists, and guiding exhibitions on women artists,” said Joachim Döring, who became director of the Met last April. “Today is an incredibly exciting day for our institution as we welcome our new director", "The next Biennial should be held at the newly built, 4,000-seat Museum of Contemporary Art (MoCA). The museum is currently working to complete a conceptual redesign that will incorporate a new visitor experience that will facilitate the exchange of art and ideas. The museum will also introduce more exhibitions aimed at younger audiences. The exhibition program will be set up in such a way that visitors can enter by appointment only, and the museum will not be able to take them in. The design-by-committee is working with a group of international architectural and conceptual artists who have been selected to help flesh out the museum’s collection that is currently organized as the National Museum of Women in the Arts.The first exhibition, entitled “Adriel and Haim: The National Gallery of Art” (2019–20), will open in 2020 at the gallery. The show will feature work by twenty artists and will run for twelve weeks. The second exhibition will focus on the National Gallery of Art’s collection of modern and contemporary art and will be on view for thirty days.The inaugural exhibition, “Michael Mersli” (2017–18), will be presented at the museum in 2022.  “At a time when many museums are", "The next Biennial should focus on contemporary art from the Americas. “The Americas have always been central to the History of Art,” said Art Historian Diana Al-Hadid. “But the next edition should be a celebration of the fifty-fifth Anniversary of the exhibition and the seventy-sixth Anniversary of the exhibition. The exhibition should focus on the history of art from the Americas in order to reflect the diversity of cultures and histories that are represented in the Americas.”The twenty-third Biennale of Sydney, which will take place at the ABC Building from September 14–August 3, is currently on hiatus. In a statement issued by the city of Sydney, the fair is tentatively scheduled to resume sometime between September 13 and September 20. The exhibition will be inaugurated by artist-in-residence, and former community member, Teresa Callaghan and will run until January 7, 2021.In a review of the upcoming exhibition, Artforum said: Viewing times will be staggered, with many attractions closing early, as will most other activities. The full list of participating artists is as follows:Kevin Barry, Melbourne, AustraliaMatthew Brittenham, Toronto, CanadaSara Cherry,", "The next Biennial should be held in 2020. “We are working for a future of greater diversity and inclusivity,” said Wojciech. “I remember well the Biennial for Arts as a time when artists stood for inspiration, compassion, and justice. We are committed to supporting these artists at this critical juncture, when they are most needed and when they need our most support.”\n\n\nThe Board of Trustees of the Museum of Fine Arts (BFA) in Atlanta has appointed Judy Wallace as its next director. Wallace comes to the institution from the Metropolitan Museum of Art, where she has served as interim director since November 2019. During her four-year tenure at the museum, Wallace organized twenty-one exhibitions, expanded the collection by a total of six thousand items, and oversaw the acquisition of more than one hundred works by forty-eight contemporary artists.In her new role, Wallace will assume her responsibilities on January 8 and will assume her responsibilities in the coming weeks. Wallace succeeds Jason Zengerle, who was hired as director of Museums of the Past in January 2019.“I’m incredibly excited about the future of BFA,” Wallace said. “I’ve", "The next Biennial should be held in 2021. You can also expect a redesign of the Pavilion of the Internationale. According to Le Monde, the pavilion will get a new interior and will be inaugurated by an exhibition of works by the 1970s international artists whose works were selected by the biennial’s jury. \n\n\nThe New York City Department of Cultural Affairs (DCLA) has approved the sale of seven works by American painter and designer Paul Niemö̀k as part of a $4.4 million donation made by the CCA. The works, which were commissioned in the 1930s and are currently held in the collections of the CCA, the Metropolitan Museum of Art, and the Museum of Modern Art, will be exhibited as part of “Paul Niemö̀k: The New American Painting” at the Museum of Modern Art in November. The event will also include the presentation of a retrospective of his work at the CCA in October 2020.“Niemö̀k: The New American Painting” is the fourth in a series of four exhibitions that will be staged by the CCA in 2020. The first exhibition, “The Art of Painting” (", "The next Biennial should include a new perspective on the institution’s complex institutional history, with a new collection of the works of the artist-in-residence, and an update of the Biennial’s logo. The program will also include a new exhibition, “The Art of the Displaced,” curated by artist and curator Haig Thomas, Jr., and curated by Jerome Wheeler. The exhibition will focus on the history of displaced people in the United States and will provide a platform for the artist-in-residence to interact with the works of the biennial’s curators to reveal the power of the displacement experience.“The next Biennial will bring together world-class contemporary artists and institutions to reinvent the Biennial experience,” said John Merrick, chair of the board of trustees. “Biennials are an integral part of the history of art in New York and the very fabric of the city. Their importance in this city cannot be understated; it makes for an extremely powerful narrative of New York City as a modern and vibrant laboratory for art.”\n\n\nThe National Museum of Scotland has announced that it has received a new £6 million donation from the Royal Family of Edinburgh.", "The next Biennial should take place in 2021, and the first ten-years following that.   The twenty-third Biennial will be held in Los Angeles in 2024 and the twenty-seventh in 2021.\n\n\nThe Museum of Contemporary Art (MCA) in San Francisco has appointed Vikram Murthy, the director of the San Francisco Museum of Modern Art (SFMoMA), as its next director. In the position of interim director, Murthy will oversee the museum’s renovation and expansion, which began in the 1980s and is currently expected to cost $70 million, and will oversee the museum’s transition to a new building in the city.“Vikram’s leadership qualities and vision for the MCA reflect a deep understanding of the transformative potential of art history as a platform for social change and a home for contemporary art,” said MCA board chair Susanne Gebbia. “Over the next twelve months, he will continue to lead the MCA through this exciting new chapter as he establishes the MCA’s long-term strategic vision and builds upon the legacy of the institution as a cultural and educational hub.”Murthy comes to the MCA from the Getty", "The next Biennial should take place in 2020. \n\n\nThe Museum of Contemporary Art (MoCA) in New York has received a gift of forty-six works by German painter Friedrich Georg Georg Georges in its collection. Perceived by museum director Klaus Biesenbach and collector Peter Wöttlicher as the second work by Georges, a collaboration between 1931 and 1932 for the German Expressionist series, the work is currently on display in the exhibition “Georges Georges” (2017–18), which is currently on view in the New Museum.Curated by Wolfgang Herbig and based on the German Expressionist’s last work in the series, the exhibition features work by twenty-six artists and is curated by Biesenbach.The works were arranged in a way that allows the viewer to feel the movement of the artist’s body in relation to the viewer. The exhibition was inspired by the work of sculptors Joachim and Katherina Müller, who collaborated with Georges, creating works that are concerned with movement. The collaboration between Hans-Ulrich Raechter, Georges’s wife, and Wolfgang Herbig is considered the first time that the artist and sculptor collaboratively", "The next Biennial should be held in 2020; the theme will be “The Future Exists in the Present.”\n\n\nThe Museum of Modern Art (MoMA) in New York announced today that it plans to open a new petitioner’s office in Mexico City next month. The institution will partner with the perennial exhibition sponsor Fiminco to host “Javier Tejada: A to Z”—a digital platform that will feature works by artists and organizations from Mexico City to Los Angeles—in June 2020.The exhibition will be organized in collaboration with the local arts organization GATA-MIND, which will organize events and other programming around the theme throughout the year. Inaugurating the new space will be the reopening of the old space in July 2020. The program will feature works from twenty-two artists and institutions—including Yubina Zaldivar, Helen Cammock, Raviguesth Bich, Tito Puente, and Arash Fayez—whose work will be presented in a virtual reality setting.\n\n\nNew York’s Metropolitan Museum of Art has received a gift of 227 works of contemporary art from a wealthy collector named Roberta Smith.", "The next Biennial should be held in the autumn of 2020. We aspire to create a dynamic and participatory platform for the exchange of the work of contemporary artists in the UK.”This is a pivotal year for the biennial, with the deadline for the upcoming edition of the show looming ever nearer. A number of artists have recently announced major departures from the show, including David McNew, Raymond Boisjoly, David McInerney, and Kiki Smith.\n\n\nThe Art Newspaper has announced that the upcoming edition of the annual Art Basel show in Switzerland will run from March 25 to March 28. The event will be held at the Art Museum Basel from March 28 to March 29, and will feature 150 works by fifty-six artists and collectors, including Gabriel Artich, Isamu Noguchi, Peter Andre, and Pierre Cardin.“This edition of the Art Basel Show will bring together the most exciting artists in the world and will be the first to take place at Art Basel,” said Christian Borle, director of the Art Museum. “Each artist will be working in their own way, rather than collaborating with one another, and each will be creating works for the first time. The show", "The next Biennial should be held at the Maritime Museum in Copenhagen within a year. The first iteration of the event, called “Elements,” was held in Helsinki in 2009 and featured work by ninety-one artists, including Pepin Petzold, Piet Mondrian, Zoran Pape, Marlen Boesky, Alice Posenfeldt, and Piet Mondrian’s wife, Harjant; the second iteration, entitled “Architecture and the Orient,” was held in 2006 and featured work by forty-three artists, including Robert Irwin, Jean-François Schelin, and Steve Smith.\n\n\nThe Noguchi-Armagnola Group, which represents the work of the artists whose work is currently on display in the group’s new exhibition, “The Noguchi-Armagnola Art of Life” (November 5–December 2), will not be able to proceed with the show unless it agrees to change the terms of a contract that obligates the artists to participate in a “center for dialogue and exchange,” the New Art Newspaper reports.The show, titled “Deus Ex: Human and Material,” is centered around artist and theorist", "The next Biennial should be held in 2020 and will be followed by an exhibition of the work of the next group of artists. Commenting on the forthcoming year, Tafoya said: “The work of our artists is inherently connected to our lives. This year we chose to focus on generations, with a view to valuing the contributions of our artists to our cultural community.”\n\n\nThe Manchester Art Gallery (MAG) is going to expand its art collection by eleven new works by women artists, and the first exhibition of their new works is currently on view, titled The Life and Times (2017), which was curated by the British writer and activist Karen Armstrong. According to the Manchester Evening News, the exhibition will feature work by Beydi Edwidge Danticat, Lan Morgan, Mary Beth Wilkinson, Tanya Bonakdar, Victoria Bridget, and Kathrin Beck. The works are part of the exhibition “Unfinished Business: Art in Contemporary Art” which will also feature Damien Hirst, the creator of The Life and Times, alongside works by such contemporary artists as Marc-Olivier Huyghe, László Kovacs, and Arne", "The next Biennial should take place in the spring of 2021, with a budget of €40,000.“The Biennial is a unique way to bring together the most important and recognized artists of the city, to challenge and present the most important art of our time, and to choose the best from amongst the works that are on display across the city,” said Kees de Vries, director of the Biennale. “This is a chance for both local and international artists to collaborate and showcase their work in a unique way. We hope that you will join us in celebrating this Art of Life’s 150th anniversary.”\n\n\nThe Metropolitan Museum of Art in New York has released a new preservation guide for the museum’s collection of Ming-era Chinese art, the Art of the Five Elements, detailing how cultural institutions in China are attempting to preserve works from the collection, which dates back to the Ming dynasty (618–907). The guide, which was written by the museum’s conservators and art historian Rihsen Riester and released by the museum on December 3, outlines a number of steps that institutions are taking to improve the condition of the Ming-era works, including by storing works in", "The next Biennial should take place in 2021, and the last in 2024. \n\n\nJames Pindell, the director of the Museum of Fine Arts (MoFA) in New York, was charged with twenty-four counts of criminal fraud on Thursday following a civil lawsuit over the museum’s redevelopment of its former campus, reports the Art Newspaper. The criminal charges were filed by the American Civil Liberties Union (ACLU) and the New York Civil Liberties Union (NYCLU) after a group of activists said that the institution failed to secure the future of the land-grant institution and failed to inform the public that the project would involve the demolition of the building it is currently housing—the 481-year-old Museum of Modern Art (MoMA).The December 2020 opening of the new iteration of the museum was pushed back to 2021 following a protracted legal battle with the company behind the project, developer Guggenheim Partners, which recently filed for bankruptcy protection. According to the Art Newspaper, the construction and renovation of the museum, which will open in 2022, has been suspended since July 29, 2020.The activists said that they were disappointed in the outcome as they believed the museum was attempting to mitigate the environmental impact of the project", "The next Biennial should take place in 2020 and will debut at the National Biennial of Canadian Art in Ottawa in 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it is expanding its curatorial team by ten members. The institution currently has four full-time staff members, but it recently announced that it is planning to eliminate one of its three paid positions, resulting in a shortage of two-thirds of the staff needed to perform the museum’s curatorial duties.On March 22, MoCA announced that it was inviting ten new artists to the institution. “Since we are now facing a global pandemic, and are in the process of rebuilding our core staffs, we were motivated to continue to attract and nurture the next generation of curators and organizers,” said museum director Craig Barr. “We are excited to strengthen our curatorial staffs and to continue to present exciting exhibitions and scholarly programs. We understand that curating is very much in the hands of artists and that the future of art is in their hands.”The museum also renewed its contract with Kahle & McAllister for its 2020 season, which will run through March 27. Kahle is a Chicago-based artist", "The next Biennial should be in the spring of 2022. \n\n\nThe American painter Karl Lagerfeldt, a key member of the American painting movement of the 1930s and 1940s, has died at age ninety-two.Born in New York in 1938, Lagerfeldt was trained in painting at the City College of New York, where he graduated in 1953 with a degree in landscape art. Lagerfeldt moved to Los Angeles in 1955, where he met his wife, Jeanne, and the couple had six children. The Lagerfeldts soon moved to a larger house in the hills near Santa Monica, and Lagerfeldt soon began making his own work, which often involved working across time and space. Lagerfeldt created works whose colors range from vivid and warm to deeply and incredibly abstract.Lagerfeldt also worked on European avant-garde paintings, a style that is commonly associated with American painter Frank Stella and became Lagerfeldt's signature style. Lagerfeldt, who was born in the small town of Frankfurt, was a loner in the 1960s who often found himself at the center of his own world. In a 2010 Artforum interview, Lagerfeldt said: “My", "The next Biennial should include a presentation of new works by the artists whose work will be featured in the exhibition, which will open at the Museo de Arte Contemporáneo in Lisbon next year.The show, titled “Plain Life in Pictures,” will focus on how images and images can be powerfully transformed through the use of light and light imagery can provide a new way of thinking about the way that images can transform the world. The Biennial has had a remarkable year, winning the first prize at the Venice Biennale last year and becoming the first artist to create a public sculpture in the country of Portugal.\n\n\nAccording to a report published by the Art Newspaper, the influential Swiss firm Diller Scofidio + Renfro is preparing to introduce a new series of exhibitions in the coming months. Titled “Art and Place,” the exhibitions will feature works by thirty-six artists such as Robert Irwin, Eric Fischl, Joachim Neugroschel, Carlos Sola, Amedeo Terborgh, Vladimir Tarkovsky, Maya Berlind, Gianmarco Rosso, Oxana Storey, and Józsefia Vitāsi. ", "The next Biennial should be held in the city in September 2020. By the end of the decade, the museum will boast a slew of new works by artists working in the artworld, including the critically acclaimed American painter Elliott Calder, whose work was featured in the exhibition “Avant-Garde,” which opened at the museum last September; and Artukul, a former city-council member and an offshoot of the gay and lesbian rights movement, which called for greater public participation in choosing artists for the 2019 exhibition. The selection committee has previously asked the Museum to add five new works to the exhibition “Walk of Shame,” which focuses on the biennial’s decade-long protest of the institution’s participation in the Venice Biennale. The museum previously announced that it would unveil a new Feminist Art exhibition at the museum in March 2020.\n\n\nThe Tate has appointed artist-in-residence Anselm Kiefer as its next director. Kiefer will be responsible for overseeing the museum’s artistic and programming programmes, and will take up the post on August 23. Kiefer joined the Tate in 2001 as director of contemporary art at the institution, which", "The next Biennial should be a clean slate, with no hidden agendas or hidden agendas behind it. That is the way it should be.”The Hamburg-based artist, known for her extensive and compelling paintings, was awarded the Presidential Medal of the Republic, the highest award in the country. The biennial was also the subject of a solo exhibition at the Kunsthalle Neue Kunsthaus in Berlin in 2017. The work was selected by an international jury composed of Ksenia Gorbina, curator of the directorship of the Neue Kunsthaus, Kassel; Joachim Lösch, curator of the Neue Universität Frankfurt; and Wolfgang Pfeifer, head of the Kunsthalle Basel. The prize jury also included Wolfgang Tillmans, director of the Basel Institute; Peter Wächtler, president of the Kunstbau; and two-time winner JoCHEKALA, a sculptor who has worked in near-extant materials such as limestone, and Mito Usui, a former member of the committee for the award.While the grant is an affirmation of the work of the award jury, the biennial is also a tribute to the lifetime of the award winner", "The next Biennial should be held in the spring of 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has presented the first group show dedicated to the Estelle and Arturo Rosales family in its ten-year history. The exhibition “The Rosales Story: From Mid-Century to the Early 2000s,” curated by the artist-philosopher Michael Thomas, will run concurrently with the upcoming fifty-fifth edition of the Grand Jury Prize.The show, which will feature seventy works from the collection, will feature the work of seventy-one artists and will examine the history of art through the Rosales family’s three generations: Estelle Rosales (1956–1963), Arturo Rosales (1965–1984), and her son Arturo Rosales Jr. (1983–1987). “The Rosales Story’s history is intertwined with that of the family, its subjects and their work, and their legacy,” said Michael Thomas. “As they grew into the larger family, the Rosaless have been a popular subject for museum exhibitions. Their works are in the collections of major museums around the world and we are eager to present the history of the family in", "The next Biennial should include a selection of works by the following artists:Locke & Key, Carlos Castaneda, São Paulo, Paulo de Certo, and Paulo de Negresco. The curators will be announced soon. The 2020 edition will mark the first time that the festival will be held in Santa Ana, California, and will take place at the Santa Ana Museum of Art, Santa Ana, from March 7 to March 10. The exhibition will be supported by an endowment from the Joslyn & Roscoe Foundation.  The first edition of the Biennial, titled “The J. Paul Getty Museum,” was held on September 5, 1984 at the Art Institute of Chicago, and was the first event that the museum held in its new location. It was followed by “The Contagious Disease” (June 25–July 3, 1986), “Reborn, New York,” (September 4–September 5, 1988), “The New York Dolls” (January 2–March 3, 1999), and “The Quadrophenia Project” (September 27–February 3, 2003). The full list of participating artists is as follows:", "The next Biennial should focus on the history of the museum’s collection and on the institution’s relationship with the artist community.”Subaru has not yet announced when it will unveil the next iteration of the famed biennial. As of Thursday, August 6, it had already put out a statement saying that the next iteration will open with a new work by artist Rinko and will continue to present works by artists other than Karpe. The news follows the publication of artist interviews and dissection of works by a number of young and established artists.The biennial’s inaugural edition, titled “20XX,” was held in 2019. It was held in Japan, Singapore, and Hong Kong.\n\n\nThe international organization Artforum, which has been celebrating its sixtieth anniversary in June, has posted an update on its online exhibition series “20XX”’s inaugural edition, which took place at the Art Institute of Chicago (AIC) from February 17 to February 22, 2020. Titled “An Imperfect World,” the event featured work by twenty-nine artists, including Mpagi Sepuya, Bella Abzug, and Kiki Smith, and addressed the legacy", "The next Biennial should be held in 2022. The artist’s solo exhibition, “Covetousness: The Text and Conceptualization of John Cage” will open at the Museum of Modern Art in New York on November 19.\n\n\nUdo Kittelmann, whose six-decade career as a painter and sculptor was widely influenced by an obsession with the occult, died on November 21 at the age of seventy-three. The German artist was born in Kassel in 1940 and moved to the United States to study at the University of Pennsylvania. Kittelmann went on to study at the New School in New York, the Institute of Modern Art in New York, and the Museum of Modern Art, then the Museum of Contemporary Art, and then the Museum of Modern Art, then the Museum of Modern Art, then the Museum of Modern Art, then the Museum of Modern Art, and finally the Museum of Modern Art, and then the Museum of Contemporary Art, and Kittelmann received his doctorate in art history from the University of Pennsylvania in 1966. Kittelmann’s work can be found in the collections of the National Gallery in Washington, DC, the Foundation for Contemporary Art, the Museum of Modern Art,", "The next Biennial should be held at the museum in December 2021.\n\n\nThe J. Paul Getty Trust has appointed Edward R. Eliso as the museum’s next director. Eliso currently serves as director of the Getty Museum in Los Angeles, a position he has held for more than twenty years. Previously, he was the deputy director of exhibitions at the Museum of Modern Art in New York and the deputy director of the Venezuelan National Museum. Eliso will assume his responsibilities on January 5, 2021.“Edward is a seasoned director who has been instrumental in growing the Getty Museum in Los Angeles into a world-renowned cultural, educational, and research institution,” said Amanda Segal, executive director of the trust. “With his vast experience, expertise, and vision for the museum, he will continue to develop the Getty’s collection and program while building on its world-class collection, the museum’s international reputation, and the museum’s international reputation.”The Getty’s current board of directors includes Barbara Barrow, the vice chair of the trust; David Berri, the director of public programs at the Getty; and Richard Laporte, the director of the Metropolitan Museum of Art.", "The next Biennial should be at least ten years away from now and will focus on a group of artists whose work addresses topics in philosophy and the arts. The exhibition will be a joint project of the Bibliothèque Nationale de France (BNEF), the Centre d’Art et d’Histoire (CAAH), and the Museum d’Art Contemporain (MAC), which has recently been shuttered due to the coronavirus.The event will feature *Ateliers di Popoli* (2013) and *Porcoco di Mario Puzo* (2014), as well as the work of Elinor Boczela, James Turrell, Andrea Duttoli, José Antonio Orozco, and Summer B. Jackson. The full list of participating artists is as follows:The list of participating institutions is as follows:The full list of participating artists is as follows:\n\n\nMore than 1,900 artists, including Pierre Bourdaillon, Jean-Luc Godard, and Pierre-Auguste Renoir are among the more than 310,000 curators and art historians who have signed a petition addressing the upcoming editions of Art Bas", "The next Biennial should take place in 2020. \n\n\nTolga Olegov, the longtime director of the Fondazione Prada, has been named the next director of the Museum of Modern Art in Milan. He succeeds Karina Ljung, who was hired as the museum’s interim director in February, and will assume his responsibilities at the institution on September 1.“Olegov is a visionary and a talented curator who has been instrumental in transforming the Fondazione Prada into a major museum in Europe and the US,” said Fondazione Prada director Lucio Bertelli. “More than anything the curator has demonstrated his ability to create new and exceptional works, which we have never experienced in our lifetime.”In addition to his curatorial duties, Olegov was involved in the design of the new building, which will be built in a former industrial site on the waterfront and will host a series of exhibitions and educational programs. The museum is currently undergoing a €50 million expansion. Inauguring the new museum is the new museum’s current exhibition hall, the Fondazione Prada–Akademie Nascional, which will open in September 2019.", "The next Biennial should take place in 2020. Further details about the 2020 edition should be released in the coming months.\n\n\nThe Metropolitan Museum of Art in New York has welcomed four new artists to its collection: Hungarian painter Péter Párdy, whose work examines the relationship between power and violence through a futurist view of history, whose work is currently on display in the exhibition “Museum of Modern Art,” which will open on Wednesday, March 11; Brazilian painter João Pessoa, whose sprawling, ethereal paintings often used genre to address issues of race, gender, and sexual identity, which are presented in the exhibition “Pessoa: Avanti Curiosa” and “Brasileiros: O Ingrémpago”; and two Italian artists, Alessandro Poggiani and Gio Ponti, who will be included in the upcoming exhibition “Pessoa: International,” which will open on April 3.The artist-teacher duo were chosen by a group of curators and experts who met at the Met on March 28. Poggiani, who teaches at the Institute of Contemporary Arts in Rome, is a graduate of the Academy of Fine", "The next Biennial should be held sometime in 2019, and the 2020 edition will be staged in Tokyo. The exhibition will be organized with a top-down approach, with both the curators and the performers making their own contributions by designing and sculpting works that address specific issues of their own lives. The exhibition will invite audiences to experience the work through a new lens through the work of several artists, including Keenan Sarsam, Patricia Karawut, and Oli Tate.\n\n\nThe Museum of Fine Arts (MFA) in Boston has received a gift of more than 1,200 works from the artist-run organization Artists Rights, which was founded in 2017 in reaction to the mass incarceration of people in the United States. The gift includes works by thirty-nine artists, including two exhibitions, “In Defense of a Free Into ” (2019) and “The Body: A Feminist Art-Work,” (2016), which were organized as part of the exhibition “Endless Night” (2019).The MFA also revealed the addition of forty-eight works by forty-five artists in a special exhibition of work by thirty-seven artists at the institution, which opened on Tuesday, January 25. The", "The next Biennial should be held in 2019. The forty-seven-year-old museum was founded in 1946 by architect Erich Fromm in the former factory of the chemical company BASF in the industrial district of Krefeld, near the city of Krefeld-Bialystok. The new museum will be built in a former chemical storage facility and its first exhibition will open in 2021. The next edition of the Memorial Exhibition will be held in 2021. The museum, which will be located in a former chemical storage facility in the Krefeld district of Friedrichshain, Berlin, will hold the biennial in 2018–2019.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it is expanding the museum’s collection by ten thousand works. The museum’s current exhibition, “The Biennial: The Contemporary,” is only the second major retrospective of works by European contemporary artists to be held in America and was organized by the New Museum. The exhibition opened on January 21, 2019 and ran until March 21, 2019. “The exhibition was a huge success. We are thrilled that it will continue to draw visitors and continue to present the work by the world’", "The next Biennial should be held in 2020.\n\n\nThe National Gallery of Scotland has announced its 2020–21 season with a new exhibition, “The Final Journey,” which will focus on the final years of Scottish monarch Elizabeth I. Titled “The Last Queen of Scotland,” the show will examine the legacy of the monarch in an attempt to give an insight into the relationship between the monarch and Scotland.“The exhibition marks the end of a new era for the National Gallery of Scotland, with the exhibition marking the end of the Queen’s lifetime and the first time that the National Gallery of Scotland has hosted an exhibition that celebrates the Queen’s life and legacy,” said Alison Taveras, the National Gallery’s director. “The exhibition also highlights the National Gallery’s ongoing commitment to diversity and inclusion. We welcome new artists and audiences to the National Gallery of Scotland, and welcome and encourage all audiences to experience the National Gallery of Scotland, as an institution that celebrates Wales, England, and Scotland.”Tickets for the October 28–31 show will be on sale from October 21 to October 28. For tickets for the December show, which will be held at the National Museum", "The next Biennial should be in 2021, with the exhibition expected to be completed in 2022. Details about the 2019 event are currently scarce, but it was held at the Gallery of Modern Art in New York.\n\n\nThe CNA Museum in New York has been awarded a $100,000 grant from Christie’s, the first major museum to receive the philanthropic gift in its history, for its next-generation collection. Named after the artist-in-residence and poet-in-residence A.L.A. Reid, the show, which will be curated by Kiki Smith, will highlight the work of Sandra Lewis, Terence McKenna, and other artists whose work is currently under a federal conservancy’s conservation in 2019.The grant was made in support of “The Art of Memory,” which is part of a larger effort to create a new generation of collectors of twentieth-century art. The initiative was launched with the new $1.7 billion Centennial of Modern Art, which will inaugurate the museum in 2020. The center’s inaugural exhibition, “Museums as Lobbies,” will open on February 23 and run through September 29.In recognition of their contributions", "The next Biennial should begin with a tour of the exhibition space and the museum, and should conclude with an exhibition of works created by visiting artists. The Exhibition of the Biennials will open on January 23.In an attempt to minimize disruption to the exhibition, the museum has arranged to have the first three weeks of the exhibition open on January 24 and the last two weeks of January. Its staff members will be on call throughout the week; the institution will announce more details about its activities and exhibition schedule once the safety of the public is assured. All of the staff will remain on staff throughout the event. The museum has also released a statement regarding the health of the staff: “The museum has been made aware of the precautions that are in place to protect the health and well-being of our visitors and staff; we take any indication of an increased risk to visitors or staff very seriously. We are taking this very seriously. We have reviewed the best way forward to support the museum and its visitors. We will now review the appropriate measures to be taken.”The Whitney Museum of American Art, New York: Since the coronavirus first began to emerge in Wuhan province in Wuhan China on February 10, the museum has been working", "The next Biennial should take place in December 2019. The committee will then decide on whether the institution should extend the deadline to March 2020. The  South by Southwest (SXSW) in Austin, Texas, is also hoping to extend its 2020 edition by a month. In an attempt to mitigate the impact of the coronavirus, the organizers of the workshop have already cut the duration of the event by a quarter. Earlier this week, Austin360 reported that organizers of the event are currently working on revising the schedule to take into consideration the risk of a resurgence of the virus.  The event is being held at the South by Southwest campus in southwest Austin, Texas, and is managed by the nonprofit Austin360. “South by Southwest is working with our community to make sure everyone has the tools they need to protect their families and communities, and we are very much looking forward to the 2020 edition,” said Whitney Sills, chair of the board of trustees. South by Southwest also announced that the theme, “Building Bridges,” will remain the same this year.\n\n\nThe Italian art historian Minna Pavano, who was the first woman to head the Museo Art", "The next Biennial should take place in 2020. The 2020 edition will mark the first time the museum has staged two major exhibitions in the same year.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Martha Corrigan as its next director and CEO. In the announcement, which was published on Thursday, March 15, the museum said that Corrigan has been appointed to the position following a search that included a number of candidates.“Martha has demonstrated a remarkable track record of innovation, leadership, and vision for MoMA over the past decade, and we’re thrilled to welcome her to the museum and to continue to innovate and grow our program,” said museum director Daniel H. Weiss. “Through the launch of Laboral Action, we have established a core of artists, thinkers, and activists committed to critically engaging the ideas and practices of indigenous communities and artists. Her work has been featured in major exhibitions including ‘Blue Sky: Indigenous Art in the Age of Black Power’ (2015) at the New Museum in New York and ‘Dia Artes: Non-Portraits” (2017) at the Bienal de Genova in Barcelona.Commenting on her new role, Corrigan", "The next Biennial should be held in 2022. \n\n\nThe Museum of Fine Arts (MFA) in Boston is expanding its curatorial team by four people. Inaugurating a new role for Catherine McCann, who is currently the museum’s associate curator of contemporary art, the institution has added two new members to its curatorial staff: Rory Mulligan, who has worked at the museum for four years, and Jamie Reed, who recently took a five-year leave of absence to become a faculty member.“Rory’s arrival brings with him a wealth of experience and knowledge within contemporary art and brings to the MFA a new voice in the field,” said MFA director Peter W. Aiello. “Rory is a superb communicator, a great organizer, and a keen observer, both in person and online. His curatorial skills and ability to relate to and engage with art backgrounds, histories, and collections in a way that is both intimate and engaging make him an ideal addition to our community.”Prior to joining the museum, Mulligan worked as a curator at the Baltimore Museum of Art and as the senior curator at the Whitney Museum of American Art. He is also", "The next Biennial should be held in the fall of 2020.\n\n\nThe National Museum of the African Diaspora (NMAD) in London announced today that it is planning to close its doors for a period of thirty days in order to allow the museum’s permanent collection, including paintings, sculptures, recordings, and audio-visuals, to enter a conservation center. The institution has also been working to relocate from its current premises at 1000 Exmouth Street to a new site on Oxford Street, and on Monday it announced that it will begin the construction of a new wing of the institution, NUS LGBT Centre, on October 29, 2020. The National Galleries of Canada (NGA) in London confirmed that it is preparing to open in 2020 and said that it has not yet determined the opening date for the institution. A spokesperson told the Art Newspaper that the institution will 'carefully consider the future plans of our new home, which is a responsibility that we take very seriously.”“In order to address the future needs of our collection and our institution, we had been consulting with our trustees for some time and have decided to postpone the opening of the museum,” said museum director Brigid Roffey. “We", "The next Biennial should be held in 2021. The current exhibition, “Annotated Art,” will close on December 9.\n\n\nThe American Institute of Art (AIA), which is temporarily closed in both New York and Chicago due to the Covid-19 pandemic, has announced that it will not reschedule any of the major exhibitions it has scheduled for the next two years. In a statement, the museum said: “With the exception of the Exposition, the Board of Trustees will not be making any changes to the major exhibits or the programs presented at the museum. We thank the trustees for their leadership and wish them well in their decisions.”The board of trustees added that it does not believe Mark Zuckerberg’s acquisition of the art business in 2015, which was designed to maximize his fortune by driving sales at the Art Institute of Chicago, was a mistake. The funds were intended to begin to alleviate AIA’s debt. The news comes on the heels of the news that the museum is planning to shutter its current exhibition of art, “The Transformation of Rainforest,” which runs through February 8.Museum director Matthew Teitelbaum said the institution is not changing the", "The next Biennial should consider the possibility of creating new disciplines and new narratives that are inclusive of the interdisciplinary initiatives of the last five years. “I look forward to working with the teams of artists who have inspired me to become a more active participant in the arts through their creative practices,” said Herbert. The twenty-second edition of the Biennial will be held at the DPC from November 24 to November 26, 2020. The 2019 edition was staged at the Museum of Contemporary Art, Houston. The biennial will showcase one artist’s work per month for eleven months, beginning in April 2019 and running through September 2020.\n\n\nOne hundred works by fifty-six artists will be returned to the National Gallery of Art in Washington, DC, in the form of a gift for the National Association of Art Museum Administrators (NAMA) in honor of the 200th anniversary of the institution’s founding in December 2020. In recognition of the historic occasion, the National Endowment for the Arts (NEA) and the National Council on the Arts (NCA) have jointly awarded the works to the NMA, which will then be given to the NMA for the institution’s use in conjunction with the bi", "The next Biennial should focus on the legacy of the artist Maurice Rambeau as an avant-garde painter of the twentieth century. The next exhibition should take place in the former workshop of Henri Matisse, in the Beaufort Gardens of the University of Central Florida. “My goal is to create a space for reflection, contemplation, and inspiration,” said Rambeau, who was one of fifteen artists to receive the prestigious Wallace and Day Medal for his work that was exhibited at the Biennial in 1988 and is currently on display in the exhibition “Feminine” at the Museum of Modern Art in New York. “I’m not going to pretend that this is a new or curatorial revolution; it is merely a re-creation of what art used to be.”The next show will be titled “Walking the Floor—” and will be curated by Stephanie Ho and Kunsthal Aarhus in Copenhagen. The show will run from March 22 to March 27, 2020. The event will include works in the exhibition “On Conceptualism” and will highlight the work of forty-five contemporary artists whose work is currently on display in the exhibition. The artist-in-", "The next Biennial should take place at the institution in 2021, with a new exhibition being organized every three years thereafter.\n\n\n\n\n\n\nThe Art Newspaper, a British arts publication, has received a $2.2 million donation from the Rockefeller Foundation. The gift is the largest gift to date made by the family of Robert Irwin, the pioneering American painter who died in 1967. The Norman Britten Foundation has also pledged $1 million. The Britten Foundation is a non-profit organization that works with artists, architects, writers, and other cultural leaders to support their work and to encourage their creative endeavors.Awarded annually by the Robert Irwin Foundation, the Art Newspaper is a follow-up to the organization’s annual awards, which celebrate the achievements of British, American, and international artists in their “decade of creativity.” The annual prize recognizes the work of thirty-nine artists in the United States. The recipients this year included Alice Alkire, Enrico Castellani, Alex Gibney, Helene Goodman, Gavin Gray, Adam Hall, Pari Dukovic, Susanne Ghesquière, and Teresa Alÿs.The foundation was founded by Michael Rockefeller", "The next Biennial should be held in 2020, and the ten-yearly edition, which was originally slated for May, will now take place in March. The 2020 edition will follow the theme “Future Present” and will consist of twenty-five artists, including Alex Barrett, Erick Cerda, and Nari Ward.The full list of participating artists is as follows: Dora Case\u0097Artist, Architectural, Historical, Municipal, and Urbanist\u0097Los Angeles, CABEC, Paris, Paris, NY, and New York City–auteurs: Andrea Bintolo, Andrea Cafu, Anna Davidson, and B.J. Hazeley\u0097Chicago, ILKSS, New York, NY: The Artist’s Alamo, Chicago: The Bristol Studio, Chicago: C.N.D. Studio, Chicago: Carol Miller Gallery, Chicago: Metamorphose, New York: R.A.L.S., New York: The Artist’s House, Los Angeles, CA: The Artist’s House, Los Angeles: FABRIC, New York: The Artist’s House, Los Angeles: Everyman–Counterpoint: The Artist’s House, Los", "The next Biennial should be titled “First People” and will be held at the Henningsværk Gallery in Oslo in 2024.\n\n\nThe British government has issued a formal apology to the four million people living in North Korea who were forced to flee their homes and seek refuge in neighboring countries after the country launched a massive military exercise. According to The Independent, the UK pledged to provide financial aid to North Korea refugees who are eligible for refugee status, and it also pledged to continue to pressure the country to end its nuclear program.In a statement issued by the UK foreign and international development secretary, Justine Greening, the government said: “We as a government continue to work with our interlocutors to try to encourage them to exercise self-restraint, avoid provocative actions, and engage in peaceful conversation. But we make no apology for calling out the DPRK [Democratic People’s Republic of Korea] in the strongest terms possible. We call out those who ignore the gravity of the situation and who work with impunity to undermine international efforts to bring about a peaceful, prosperous, and inclusive future for the Korean Peninsula. We hope that this week will mark a turning point when the DPRK realizes that its threats to provoke further harm", "The next Biennial should be set up in the autumn of 2021 and will include the exhibition of the work of artists who have made significant contributions to the exhibition. The theme will be “Eternal War: Contemporary Art and Contemporary Life” and will be curated by Shimon Beckman, artist and curator; Jason Hetherington, curator of the exhibition “The Springboard of the World”; and Alex Dallaglio, director of the Biennial of Visual Arts.Commenting on the work, Beckman said: “In the twenty-first century, when the art world is growing and when we are at a turning point in history, when art is at the forefront of the end of the current global crisis, the exhibition should be a vehicle of reconciliation and hope. But it should also be a celebration of the work of artists whose artistic practices are at the core of the current crisis: the ones whose work opens up new possibilities, new spaces for thinking about art and art history, and for engaging with the social and political crises of our time.”\n\n\nFrieze announced today that the seventy-six artists who have been nominated for the 2020 prize, which is held in partnership with the Getty and is given to artists whose", "The next Biennial should be held later this year. If the SHAC reopens, it will be in spring 2020.\n\n\nThe Museum of Fine Arts (MFA) in Boston announced today that it is still working through the repercussions of the Covid-19 pandemic. In a statement, the institution said: “The MFA’s relationship with the city of Boston has been a matter of great concern to us for some time. We are actively assessing the impact that Covid-19 has had on our community, and in the coming months we will have more to say about what our future plans may be for the museum.”The statement added that the city and the museum were working together on a comprehensive plan to mitigate the health effects of the Covid-19 outbreak, which is expected to last for at least eighteen months.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines for the display of works from the collection of the late American artist Irving Penn. The guidelines will make it easier for museums to display works by the late artist in order to avoid the backlog of litigation that has hindered further distribution of his artworks.Under the guidelines, which were drafted by DCLA deputy director Mary Anne Carter", "The next Biennial should be the fifteenth. I can see no reason why this should not be the case. Biennial of the Party is already a unique work; but it is certainly a work which has had a considerable and perhaps decisive influence upon contemporary art. We must hope that its impact will be felt for many years to come. The selection of the exhibition as a whole is a great success. The exhibition is not only an opportunity for the artists to display their best work, but also a great display of their creativity. The exhibition of the entire catalogue, including the original works the artists have produced in the past, would have been a great achievement for the exhibition.” The exhibition will be presented in a three-dimensional format in the Gallery of Modern Art in New York from September 19 to September 21, 2020. The exhibition will surpass the original exhibition that opened in 1965 at the Kunsthalle Basel in Switzerland in the same year. The new exhibition will be organized as follows: 1. Introduction 2. The Collection 3. The Art of Biennial\n\nThe San Francisco Public Library (SFPL) has added five new works by artists in its collection to its collection, including Jemima Goldsmith, Abigail Adams, and", "The next Biennial should be held in 2020.\n\n\"As we continue to work to present the largest range of exhibitions possible in a single location, we are excited to participate in the upcoming 2019 edition of the Metropolitan Museum of Art in New York, which will include work by artists whose work has yet to be presented in the United States, and to continue our work with American artists in the United Kingdom in 2020,\" said David Simon, chair of the board of trustees of the Metropolitan Museum of Art.The 2019 edition of the exhibition, “Lincoln,” opened on October 7 and ran through November 3. The exhibition was curated by Richard Gere and featured work by fifty-five artists, including Tanya Cooper-Hills, Matthias Corot, and Ashok Jasmin, and featured four New York artists, including Ed Moses, Kelly House, and Ed Rush.Among the artists whose works will be included in the 2020 edition of the exhibition are: Anastasia Oliča: The Power of the Plastic Castle (2016) Colleen Anthony: The Swirl of Light and Shadow (2017) Miles Franklin: The Way of Shadows (2016) Minga Alizadeh: The Masks of the", "The next Biennial should hopefully be in 2020. The first Biennial (of Art) was held in 1968. In 1974, the institution moved, in addition to its residence on the ground floor of the MCH Group, to the Paine Webber Art Museum in Berlin. \n\n\nThe Museum of Contemporary Art, Los Angeles (MCA) has appointed Chris Albrecht as its next executive director. He succeeds Susan Cain, who retired after fifteen years at the helm of the museum on December 31.“Chris has been instrumental in transforming the MCA into a world-class institution with an enduring legacy of building new work in the MCA’s collections, supporting the museum’s increasingly large-scale events, and leading the MCA through a transition of leadership,” said MCA director Nina Gold. “We are grateful for his work and look forward to his leadership. This is a challenging time for the museum and for the world, and we welcome his leadership to the MCA.”Previously, Albrecht served as vice president of curatorial affairs at the Museum of Modern Art, where he worked alongside Michele Berlind, who departed in March. He has also held senior curatorial roles at the Corbis", "The next Biennial should be held in 2020. The exhibition will be a follow-up to the “In Defense of a Free Cuba” and “In Defense of a Free Cuba” (2017–18), which were held in Havana between October 23 and 28, and will include new works by artists such as Renata Pape, Olu Oguiro, and Marsala Pimentel. “As an artist I am thrilled to engage with Cuban artists and to present them in their own space,” said Banderas. “These works will be a powerful reminder of the incredible breadth of my artistic heritage, and I look forward to collaborating with the artists and visiting with their families to reflect on and reflect upon our own existence.”\n\n\nSamsung Electronics has announced that it is planning to launch a new digital media initiative that will stream live television programming from the company’s factories in the United States, Japan, and Korea. The initiative is part of a decade-long program of international partnerships between the company and the Japanese government and media companies led by Samsung. The two parties have agreed to collaborate on an international standard for television broadcasting, called a TV Broadcast Protocol, or TVBP, that will be", "The next Biennial should be held in 2021.” The museum will have a permanent collection of more than 45,000 works by artists, including Pablo Picasso and Jean-Luc Godard, which will be turned into an extension of the museum. It will also collaborate with other institutions to create a new 50,000-work collection of the artist’s drawings. The exhibition will continue to operate as a biennial, but will be expanded by five hundred works from the collection since the museum will soon be able to hold three thousand works.The biennial’s director, Wouter de Vries, told the Art Newspaper: “We are very pleased to be able to open the new collection at the Biennial in 2021. The collection of Jean Luc Godard is one of the most important and most celebrated collections in the museum and we have been working hard to get it closed and restore its importance through the exhibition of the first works in the collection. We have managed to do this and we are ready to continue working with artists, scientists, collectors and other experts in the collection as long as we have the possibility. The exhibition will continue to be a showcase of the best works of the collection.”\n\n\nThe Metropolitan Museum of Art (", "The next Biennial should take place at the Museo del Barrio in Madrid in August 2020. The 2019 event, titled Hieraticon, explored the relation between a diabolical political regime and the material and spiritual worlds. The twenty-sixth edition, titled Hieraticon XX, will take place in February 2021. The 2020 edition will be held at the Museo de Arte Contemporáneo in Lisbon, with a selection of works from the artist’s vast discography.\n\n\nThe American artist Ty Cobb has died at age ninety-one.Born in New York City in 1942, Cobb initially studied under Charles Bond at the University of California, Berkeley, but later switched to the University of Pittsburgh, where he received a degree in 1950. He continued pursuing his career in the art world after graduating from the university, but by the 1960s it was already waning, and he began to shift to a more abstract work-based approach in order to sustain himself.Cobb did not abandon his avant-garde practice in the meantime. In the early 1970s, he embarked on a seven-decade project, 1956–1973, that was to include works by the work-­acceler", "The next Biennial should be announced soon.\n\n\nThe Leiter-Kruger Art Museum in New York has appointed Steven Kuller as its new deputy director of exhibitions. Kuller will be responsible for planning and executing the museum’s annual New York–themed exhibitions. Previously, he worked as the museum’s curator of contemporary art and art history in Europe. For the forthcoming events, he will work closely with curator of twentieth-century art, artist-in-residence, and curator of art history, Laura Katic, and will provide oversight of the biennial’s programming.“Steven is a seasoned curator who has built a strong career within the field by bringing together exhibitions, collections, studios, and studios,” said Kuller. “His expertise and passion for contemporary art and the art of design will be crucial in allowing the museum to continue to thrive as a significant cultural institution in the city and in laying the foundation for an exciting future for the museum.”Kuller joins the museum from the East Coast Contemporary Art Museum, where he served as director of exhibitions in New York, Los Angeles, and New Haven, Connecticut. He was succeeded by Joel Stohl, who remained on as", "The next Biennial should be held in the summer of 2020. The 2019 event—which was held in the northern part of the city—was held at the Museum of Modern Art in New York, and the biennial was organized by Liverpool Biennial for the Arts. The gallery was planning to reopen the museum in the fall of 2020, but the renovation project has been suspended.\n\n\nThe Barbican Art Museum (BAM) in London has announced that it will begin welcoming visitors back to the institution, in an effort to stabilize the situation following the Covid-19 pandemic. Following a review of all of its locations in the capital city, the museum found that 88 percent of its spaces remained vacant, and that half of its regular visitors were not returning.The announcement follows a report published by the London-based charity Art Fund, which found that 90 percent of galleries and arts organizations will not be able to pay their staff through the end of March, and that one in four businesses will shut down. While many are anticipating a limited number of galleries and museums will reopen, the number of people who will visit them will likely be much lower than anticipated.In a letter sent to Barbican staff on March 16, the museum wrote: “We are taking", "The next Biennial should take place in 2020.\n\n\nThe Imperial College London (ICL) in north London is being restored to its original grandeur by Imperial College China, which has promised to donate the buildings, including the Royal Academy of Arts, the Institute of Arts, the Institute of Contemporary Art, the House of Ideas, and the Institute of Arts, to the institution.The university’s president, Joao Neves, described the multimillion-dollar restoration project as “essential for our future.” He added that the building “will look forward with great enthusiasm to continuing its impressive and international history.”“I see the Royal Academy of Arts as an important beacon in a changing world,” Peter Schäfer, the Royal Academy’s former director general, said. “I’m delighted that the new museum will be built in a site that will serve as a focal point for generations of students and visitors to the academy.”\n\n\nArt historian Barbara Amick has been appointed director of the Tate Modern in London. She succeeds Martin Balfour, who retired in June 2019 after twenty-four years at the institution. She is the first woman to helm the museum. The appointment was", "The next Biennial should take place at the Museum in New York in 2021. \n\n\nIn the days since a group of schoolchildren in China were brutally mowed down by a truck driven by a local official, the country has been gripped by a series of social unrests. Two days after the attack on the children, which took place on August 8, a full week after the seven-month-old boy died of his injuries, a group of artists, academics, and activists called for a general strike in protest of the Chinese Communist Party’s crackdown on freedom of expression and artistic expression.  On Friday, August 9, the day the children were mowed down by the official, a group of thirty-five artists and academics penned an open letter to party members calling for a reopening of the Cultural Revolution’s Grand National Museum of China (GMM) in Beijing and the reopening of banned political theater. The letter said the crisis had led to “friction in the air and everyone’s moods.” “The museum has had its share of troubles in the past, but it has never been this serious, as many of the other institutions in Beijing have been and will continue to be.�", "The next Biennial should open in early 2021. \n\n\nThe Museum of Modern Art (MoMA) in New York has received a gift of six monumental works by Italian painter and sculptor Paolo Tosatti, the last of whom is currently enshrined in the galleries of the museum as part of a major reenvisioning of the institution. The works, titled Il Perro di Paolo (The Perseverance of Paolo Tosatti) and La Traviata (The Traviata Garden), were gifted to the institution by the late Italian artist and collector Piero Tosatti.Born in Turin in 1930, in a family of artisans, Tosatti studied with Piet Mondrian, Fabio della Garofoli, and Giacomo Cattelotti throughout his childhood, before graduating from the prestigious Cagli Academy in Turin in 1975. He was allowed to remain in Italy until 1983, when he was commissioned to paint a monumental work for the city of Turin. La Traviata (A Short History), 1995, is the third in a series of twelve Tuscan paintings, and depicts a group of Passygian monks returning from a pilgrimage to the Holy Land. “Tos", "The next Biennial should be held in 2020. The event will be hosted by the Tate, which is currently undergoing an £8 million refurbishment, and will take place across five venues from September 8 to September 13.\n\n\nArt historian and curator Daring Fan has been named director of the Palazzo della Dogana in Venice. The appointment was made on December 2, after the museum’s board of directors voted to extend its current contract through the end of 2020. Previously, Fan was employed as curator of modern art at the Museo del Para and as a curator of contemporary art at the National Gallery. He joined the institution in 2016 as associate curator of modern art, and prior to joining the museum, he served as a curator of modern and contemporary art at the Museo d’Artesia di Venice (MAD), from 2006 to 2008.“This is a tremendous achievement for Daring Fan, who is an experienced curator who has demonstrated an ability to bring together the highest and most ambitious of contemporary art,” said director Stefano De Rosa. “As a result, we are delighted to have given him the opportunity to lead. His appointment reflects the vision and ambition of the Palazzo della Dogana", "The next Biennial should be held at the Bibliothèque Nationale in Paris in 2021, and the twenty-eighth in 2022. The biennial will be hosted by the Palais de Tokyo in Paris, the Musée d’Arles in Paris, the Musée d’Art Contemporain in Paris, and the Museo de Arte Contemporáneo de Barcelona. The biennial’s exhibition programme will consist of: Opening Ceremony: Friday, October 19th, 2020 at 7:00 PM Opening Ceremony: Saturday, October 20th, 2020 at 10:00 AM Opening Ceremony: Sunday, October 21st, 2020 at 11:00 AM Opening Ceremony: Friday, October 22nd, 2020 at 7:00 PM Opening Ceremony: Saturday, October 23rd, 2020 at 10:00 AM Opening Ceremony: Sunday, October 26th, 2020 at 11:00 AM Opening Ceremony: Saturday, October 27th, 2020 at 7:00 PM Opening Ceremony: Friday, November 3rd, 2020 at 7:00 PM Opening Ceremony: Saturday, November 4th, 2020 at 10:00 AM", "The next Biennial should be held in 2020, and the twenty-second in 2022. \n\n\nThe Museum of the Jewish People (MoJo) in New York City has welcomed Mark L. Rainer as its new director. Rainer, a professor at Columbia College Chicago, has helmed the institution since 2014, when it relocated to a new building in Manhattan. He succeeds David Scharf, who left the institution in November 2019 to head the Jewish Museum in Jerusalem, and will take up the post on February 13.“Mark brings an exciting perspective to the role of the museum as a vibrant platform for modern Jewish scholarship and an enthusiasm for the history and culture of the Jewish people that is reflected in his extensive experience in the field,” said “David Bernstein, cofounder and chair of MoJo’s board of trustees. “Our board of trustees and I were pleased to welcome Mark to MoJo. He is a scholar, scholar, and friend who is committed to teaching and engaging the museum’s distinguished collection and staff. His expertise and passion for this subject matter make him an ideal leader as we continue to build and strengthen our relationships with our audiences and our communities.”In 2018, Rainer and Mel", "The next Biennial should take place in 2021. The museum will also work with the Los Angeles County Museum of Art on an exhibition about the art of fashion, which will be on view in the museum in 2022.\n\n\nThe 18th Venice Architecture Biennale\u0097an annual showcase for architecture’s work in the city of Venice\u0097is being restructured to better reflect the various themes of the pavilion. The 2017 edition, held in themes of 'reflection, reflection, reflection, and more reflection” was held in the city of Venice, which also hosts the Venice Biennale and the Venice Architecture Biennale. The 2019 edition, which was organized by the Venice Foundation, was held in Minnaica, a suburb of Venice.The annual schedule of events now follows:Friday, March 16–Sunday, March 19, 2019: Arts of the Land, Venice, Italy, March 13–March 21, 2019: Organized by the Arts of the Land Foundation, Venice.\n\nThe Art Newspaper reports that the Saudi Arabian Embassy in New York is planning to open an artist-run studio space in the United States that will host a residency program in January 2020, the first such", "The next Biennial should be like no other, large-scale and highly visible. I want it to inspire, to provoke and to change.”\n\n\nThe Museum of Fine Arts (MFA) in Boston announced today that it plans to open a new collaborative project on the campus of the historically black college on March 14. The center, which will host approximately eight hundred exhibitions, will be on a half-acre lot that was previously home to the museum-and-ranitiater. The exhibition space will be located in a building designed by architect Martha McManus and will be led by a curatorial team led by Elizabeth Ervin and Anthony Burch. The project, titled Work in Progress, was chosen as a model for a public museum in part for its accessibility and its collaboration with local, regional, and national organizations.“As we began researching and designing a new home for the MFA, we recognized that the building was a fitting site to present work by artists whose work has been historically marginalized,” said museum director Matthew Teitelbaum. “The MFA is one of the few historically black colleges in America and has a long history of shaping the cultural fabric of the city. Remarkably, the campus is also home", "The next Biennial should be held at the Museum of Modern Art, New York: This has been a longstanding desire of our board of trustees, who have worked for years to move the exhibition to the museum, and the museum’s director, Daniel H. Weiss, has withdrawn from the 2020 edition. In a statement, Weiss said: “The University is attempting to change its future through a process of retrenchment and restructuring. I am hopeful that these efforts will yield a new multidisciplinary platform dedicated to the history of arts and design that acknowledges the accomplishments of many and honors the best artists and designers, with particular regard to their work as part of the Big Sur Experiment, and in the new biennial.”While the museum has named Patricia Elizondo and Andrew Kreps director of the new exhibition, it only announced the opening of the exhibition and does not plan to stage it this year. The museum will also begin serving as a new space for the commemoration of the Big Sur Effect, a series of environmental innovations that evolved from the 1960s counterculture movement to become an influential and influential concept in the late 1960s and early 1970s and was nearly overrun by the police in 1975. In a statement, the museum", "The next Biennial should begin with an open-air sculpture garden featuring a selection of works by the contemporary artists who are currently on exhibition, in the works of a variety of genres, such as sculpture, installation, video, photography, and performance.”Other changes include the addition of two new sections to the exhibition “Art and Space”\u0097a three-day show that will focus on the history of art and space through a series of paintings, drawings, and installations; and the reopening of the biennial on May 8.\n\n\nThe Museum of Modern Art (MoMA) in New York has announced that it is planning to open three new public art-historical museums in the city: the Museum of Modern Art in the City, the Museum of Modern Art in Harlem, and the Museum of Modern Art's new home on Piers 90 and 96 in Manhattan. The announcement follows the completion of the $1.2 billion expansion, which added more than 1,500 works to the permanent collection, and the Museum of Modern Art’s plans to build a new $1.2 billion home for the collection in the city.The new museums, which will be located on the third floor of Manhattan’s Museum of Modern Art", "The next Biennial should be held in 2021. The British Institute for Contemporary Art (BICA), which brought the first exhibition of new work in the United Kingdom after the war, is also planning to suspend construction of the new exhibition venue until at least May 29. However, the BICA’s chair, Mark Simmonds, has said that the institution will remain closed until at least June 10, the date of the exhibition, and has stated that the museum will reopen in June.The New Art Dealers Alliance (NADA) has released its list of exhibitors for the third edition of the Dusseldorf Biennale, entitled “Dusseldorf: ‘Sculpture for the City,’ which will take place in the former automobile factory at the intersection of the Rhine, the Danube, and the Seel, in the German city of Dusseldorf from September 21 to September 23. The exhibition will celebrate the city’s decision to take part in the -led industrial restructuring of the Rhineland during World War II and will also introduce new work by artists such as Kasper Koenig, Axel Heger, and Theo Peiks, among others. ", "The next Biennial should be held in 2024. We are currently evaluating the best way to launch the new Biennial at the same time as the new exhibition, which will be organized in the same location as the exhibition. We will have more to say about this concept and new opportunities for creativity and collaboration in the coming weeks.\n\n\nThe Tate is facing an unprecedented crisis. Its board of directors, chaired by director Maria Bustino, has decided that it must make major cuts as it attempts to rebuild its finances.According to BBC, the institution is currently struggling to cope with a £100 million loss in revenue as it works to restructure its business model and rework its exhibition schedule. However, the board argues that the restructuring is necessary given the impact of Covid-19—the virus has already caused a 20 percent drop in attendance at Tate London, and has forced the cancellation of several major events, including the opening of “Avant-Garde” in May.According to the New York Times, the board has already made cuts of at least £100 million, with a further £60 million in the bank. The cuts are being made in an attempt to reduce the institution’s debt and its borrowing costs, which are already among the lowest", "The next Biennial should take place in the spring of 2020. “We are delighted to be continuing our work with the museum’s collection and archiving with the new and improved exhibition space that Bienniala has designed and perfected,” said Bjorn and Adrienne. “This exhibition will present a new version of the exhibition ‘In the Art of the Party’ that will reflect on the latest exhibition and the artistic process through the work of contemporary artists.”Commenting on the project, Bjorn said: “The new exhibition will be a biennial of art from the contemporary art world that is integrated with the museum’s collection and archiving, with regard to the exhibition ‘In the Art of the Party.” The exhibition will feature work by artists such as Fikret Rädd, Sven Völkjart, Mihai Rämä, and Maren Sunjung, as well as a selection of works that are part of the collection of Bjorn and Adrienne, including works by Frida Kahlo, Paulo Joffe, Kamel Benoît Hage, and Helga Schipper. In addition, the exhibition will include the", "The next Biennial should be in 2020.  In an email sent to Lincoln, he wrote: “We hope to have you and your team back in the fall for the next Biennial. We look forward to working with you in the spring. We are confident that we are in a position to create new opportunities for the festival and to sustain it through this transition.” The festival will now move to the additional venue of the Art Institute of Chicago (AIC) in Chicago. The full list of participating artists is as follows:\n\n1. Avicel Art Institute of Design, Toronto, Canada (advancement)2. Belgian Projekt Foundation, Brussels (advancement)3. Bambuzel Adler Gallery, Berlin (advancement)4. Bickel Gallery, New York (advancement)5. Bibliothèque Nationale Paris, Paris (advancement)6. Bibliothèque Nationale Switzerland, Bern (advancement)7. Bibliothèque Nationale New York, New York (advancement)8. Bibliothèque Nationale Tokyo, Japan (", "The next Biennial should be held at the Petit Palais in Paris in 2022, with the winner expected to be announced in 2020.Of the twenty-nine artists who applied for this year’s award, eleven have won this year, including Paul Gauguin’s Les Demoiselles Dans la Terre (1931), Pierre-Luc Godin’s Adèle and Je ne suis pas une femme (1932), Pierre-Luc Godin’s Three Days in the Life of a Lady (1933), and Jean-Luc Haemers’s The Searchers. These works\u0097all of which enter this edition as works in progress\u0097will be selected by the jury established by Michel Leclerc, Vice Chairman of the board of trustees of the Contemporary Art Center, in collaboration with Alfredo Cipolletta, director of the Portrait Gallery in São Paulo, and São Paulo-based artist and curator Luiz Pena.\n\n\nThe Los Angeles County Museum of Art (LACMA) has adopted a new $600,000 budget for its 2020 year-round programming, which will fund exhibitions, classes, and other initiatives in an attempt", "The next Biennial should take place in the seventeenth year of the institution’s founding. The institution’s first director, Steven Scheider, will step down in February 2021. The anniversary celebration will address the legacy of the Biennial and the twenty-third Biennial in the Netherlands, which will be held in 2020. The museum will hold the inaugural exhibition in 2021, and the exhibition will be followed by its biennial, which will be held in 2022, and the sixth and final exhibition in 2022.Under the new terms, a new board of directors will be formed in addition to the current director, Nikkita Binns, who will assume her responsibilities in January 2022. The board will consist of four trustees: Rijka Steegmans, chair; Hans Voges, vice chair; Patrizia Cercielli, secretary; and Fotopostel, the museum’s honorary treasurer.The board will be made up of four trustees: Oshwar C, the founder of the Dutch firm RS-Workshop; Anna-Sophie de Bont, the founder of the Rijksmuseum in Amsterdam; and David B. Levy, a former chief curator of the Museum of Modern Art in New", "The next Biennial should take place in the autumn of 2022. The first exhibition will be “Theologians and the History of Art: From Deleuze’s The Present,” which will examine the history of the history of art and the art history of science fiction. The second exhibition will be “Adeline and Adeline: The Historical Walter Gropius” and will focus on the life and work of Walter Gropius. The biennial will be hosted at the Centre Pompidou (CP), located in the heart of Paris, from August 24 to August 28. \n\n\nThe Museum of Chicago’s collection of more than three thousand objects from the African diaspora is expected to be sold to the Chinese state-owned company Wanda Group, which plans to develop the megastore’s collection in Beijing. The institution will be managed by the state-backed China Center for Contemporary Art (CCCA), which will also house the museum’s collection and staff.“We are delighted to welcome Wanda Group to the Museum of Chicago, and have been studying the partnership with them for two years,” said Marc Glimcher, director of the China Center for Contemporary", "The next Biennial should be held in 2020, when the final work will be completed. \n\n\nThe biennial Biennale Berlin will feature two new works each year, the first new from the artist-run nonprofit Center for Contemporary Art (BAM) in collaboration with the German state of Berlin and the Bauhaus Museum, and the second from the artist-run nonprofit Center for Contemporary Art (BAM) in collaboration with the Bauhaus Museum.The new works will be based on new works from the show “Black Box Politics” (2019–20), which is scheduled to run from March 22 to March 25. The biennial will be hosted by the Museum of Modern Art in collaboration with biennial partner Center for Contemporary Art, Berlin, and will take place at the new Stutgalerie Berlin. The annual exhibition will begin with the show’s introduction in early March and will run through June 21. The show will also feature a new series of speakers, including Joachim Neugroschel, artist-in-residence at the Bauhaus Museum; the artist-run biennial exhibition, “Polarities” (2019); and the artist’s first solo exhibition at the Bau", "The next Biennial should be held in 2021. The critics and organizers of the inaugural edition are hoping that the current exhibition, entitled We Are All Maps, will draw a new audience to the exhibition. \n\n\nThe Institute of Contemporary Arts (ICA) in Paris has received a donation of eighty-seven works from artist Pierre-Auguste Renoir\u0097a contemporary of Bernard Karr & Ursula von Rydingsvard\u0097which will be given the opportunity to be returned to the artist. The works were donated by late German-born French artist Richard Avedon, who was working in the studio of Karr at the time of the Karr–V von Rydingsvard collaboration, and Italian-born, Paris-based artist Lino Lo and their respective families.The donation comes a year after the museum acquired the works, which are part of the Karr–Vanderren and Rydingsvard collections, for its “Odd Year” exhibition, which premiered at the museum in 2017. It also coincides with the 2019–20 academic year, the twentieth anniversary of the collaboration, the twentieth anniversary of the collaboration’s founding, and the thirtieth anniversary of the partnership’s first exhibition,", "The next Biennial should take place in 2021.The 2019 iteration of the event, which was organized by the New Museum in New York City, showcased work by 125 artists, including Sol LeWitt, Robert Rauschenberg, David H. Dyer, and Maren Ade, who were nominated by curators and curators themselves. The show was also sponsored by the biennial’s parent organization, the Metropolitan Museum of Art, and the Museum of Modern Art.The 2019 exhibition, “Themes of Presence: Art and the Body in Cinema,” consisted of “The Body,” an exhibition of drawings by Pablo Picasso; “The Body and the Other,” a show of early drawings by Claude Monet; “Anchorite,” a show of early earthworks by Frank Gehry; and “The Other Two,” a show of early works by Peter Sellars. The future of the biennial is currently in the hands of the Met, which recently announced its intention to shutter the institution as part of a four-year capital campaign.\n\n\nThe New Museum in New York, which was ordered to close by the New York City Department of Cultural Affairs, ", "The next Biennial should focus on the interrogation of contemporary art through the lens of anthropological, political, and social experiments and inspire a new generation of scholars to re-examine the history of art through the life and work of the greatest of its kind, Juan Darí. The biennial will also examine the history of racism through the glass ceiling of art and the art of the past.”Darí’s work will go on display alongside that of Maurice Merle in the exhibition “Painting for Painters,” which is scheduled to open in the city of Mar del Plata, on October 26. The opening of the exhibition coincides with the opening of the Biennial of Biennials in the town of Rieti, in the province of Trentiva, next year.\n\n\nThe National Galleries of Scotland announced today that Josep Sánchez, the director of the National Gallery in London, is being nominated for a new Scunthorpe Prize for his contribution to the development of the institution’s collection of the early twentieth-century. The prize is one of three Scunthorpe prizes given annually by the National Gallery. Sánchez is the third Scottish director to win the award", "The next Biennial should be held in 2019.\n\nAdditional news about the art world biennials is coming out of New York, which will host the 2020 edition on September 24, 2020. The event will feature more than 600 artists and will be free for the general public. The full list of participating artists is as follows:George Black, Atlanta;John Goldhill, New York;Pari Dukovic, London; Karla Fontaine, New York;John Gardner, New York;Julian Hartigan, New York;Anne-Marie Hennessy-Hamm, New York;Ricky Henry, New York;James Martin, New York;Demian Holguin, New York;Zoé Rouba, New York;Steve McClellan, New York;Sharon O. Marples, New York;Sara Zweel, New York;Amanda Seyfried, New York;Michele Stanford, New York;Pete Tepper, New York;Matthias von Karman, New York;Klaus von Mackenbach, New York;Michael Ward, New York;Gavin White, New York;Melanie White, New York;Marcia Witt, New York;", "The next Biennial should take place in Louvre between October 21 and November 16, 2020. The 2019 event opened at the museum in Nairobi on October 30, and the 2020 event will be held at the Bechhof in Berlin between November 3 and November 5, 2020. The Berlin Biennial is supported by the Kulturstiftung des Bundes (German Federal Cultural Foundation), the Kunsthalle Basel, the König-Bauer-Böll, and the Künstlerhaus Bremen. For the 2019 event, curators Goetz & Cai, Klaus-Dieter, & Wolfgang Roesler, and the museum, which also comprises a first-class theater, a museum of the Germanic people, a library, a festival space, and a special exhibitions gallery, staged a public screening of The Lost Art of Moving Images\u0097a special exhibition of biennial works by the history-minded artist Wolfgang Reiche, whose work will be on display in the exhibition “The Last Stage,” which runs until February 12, 2020. The 2019 event, which had previously been held in Hong Kong and Berlin, was hosted by the German artist and curator Hor", "The next Biennial should be held in 2021 and will cost a total of $18 million. The first iteration, which was held in Prague in 2010, was canceled after a fire broke out in the building housing the exhibition. The exhibition, titled On the Celebration of Life, was supposed to be the opening of the series. Dottie Mae McIntosh, the director of Nashville’s Biennial, told the New York Times that the ten-month event, which was organized by the Jefferson Art Museum in Nashville, was canceled due to the Covid-19 pandemic.The 2019 edition of the Biennale, entitled Art & Life, was canceled due to the Covid-19 pandemic, and the inaugural edition, titled Life After Death, was canceled due to a fire in a warehouse. \n\n\nAmerican artist John Christie, who created works that often incorporate astronomical and geometric shapes and often employed meteorological phenomena such as lightning, lightning flashes, and tornadoes, has died at the age of eighty-three.Christie’s work has been collected by the Museum of Modern Art, New York, the Metropolitan Museum of Art, New York, and the Whitney Museum of American Art in New York, and has been exhibited", "The next Biennial should take place in 2020. In the meantime, the project can be adapted to meet the needs of different classrooms, schools, and communities.\n\n\nThe New York City Department of Cultural Affairs (DCLA) is planning to begin accepting visitors' photographs in an effort to help revitalize the cultural district it has been working to preserve for more than four decades. The reopening of the current Turner Prize–winning sculpture park will likely be delayed until at least the end of the year, after the completion of a $71 million expansion, as part of the city’s long-term plan to revamp the Central Park landscape.“We are thrilled to open the new Turner Prize pavilion and continue the work of reinventing how young artists see and experience the world,” said cultural affairs commissioner Nick Brault. The plan to re-open the platform, which will be located in the park, is part of a larger cultural rebirth plan for the city. The DCLA’s vision for the park includes more public art, improved public transportation, and improved accessibility. The public art will be informed by a new eight-thousand-piece renovation and a new public garden, known as the Turner Garage, which will be joined", "The next Biennial should be held at the site of the old Institute of Contemporary Art (ICA) in Paris but will continue to be organized in the old university, as it has been since 1968. “The future of the Art University of Louvain and its mission to educate and inform, remain undeterred,” said OLAF founder and director Antonya Mavignas, who will remain involved in the management and upkeep of the museum. The board of trustees also appointed five new members, including Jean-Jacques Sadek, an artist and collector; Bernard Verheggen, a director of the Copenhagen art museum; and Sveinu University, which is affiliated with the university.Commenting on the appointment, Mavignas said: “The new board of trustees is made up of some of the most distinguished and accomplished artists in France, and their task is to organize a platform for the exhibition of their works, as well as to maintain and develop the institution as a living organism: a university that will continue to be responsible for its own future, as a cultural center of international exchange and a place for the exchange of knowledge and ideas.”\n\n\nThe Pérez Art Museum in the Beehive", "The next Biennial should be held in 2020 and will be hosted at the Sassen Museum, in Munich, alongside the upcoming exhibition “Allo,” which is due to open in Tokyo in March 2020. The show will be hosted by contemporary art curator and curatorial scholar Hans Ulrich Obrist.\n\n\nThe French Ministry of Culture is planning to open a new museum in the capital of the French Republic, Paris, next month, in an attempt to revitalize the city. The Louvre and Palais de Tokyo, which are currently under construction, will be the site of the new museum. The announcement was made by Culture Minister Franck Riester, who was addressing a gathering of cultural figures at the Louvre on Friday. “This is a very important moment for the Louvre and Palais de Tokyo,” Riester said. “It is the first time that a new museum has been commissioned in more than seventy years. It will be a museum that reflects the French spirit and will bring together the French, French-speaking, and French-speaking communities in a way that distinguishes its museum from those of the other cities.”Riester also said that the “leisure zone” of", "The next Biennial should be held in 2020.\n\n\nThe Institute of Contemporary Arts (ICA) in London is launching a new scholarship program designed to help young British art collectors better understand the art of the 21st Century. Called the Art Fund for Young Curators (AFY), the program will provide $750,000 over three years to help budding collectors through the art world’s changes.“ICA is committed to advancing the art of the 21st Century through a new generation of curators, whose passion and commitment is driving the next generation of artists, creators, and thinkers,” said ICA director and CEO Cat Staggs. “With the advent of digital and social media, the future of art and innovation is at stake. The Food & Wine Symposium and the Art of Technology symposia are both crucial venues for young curators to be inspired by the art of tomorrow. The AFY program will deliver funding and mentoring towards these young curators and will help them prepare for the 2019 and 2020 seasons.”The Summer School will be hosted at the British Council’s headquarters in London and will focus on an exhibition of work by artists whose work is currently on view in the Summer Schools. The program will", "The next Biennial should have a strong and diverse team that has expertise in the art and science of the environment, as well as an international focus that reflects the vibrant global heritage of New York City.We are currently working on a new site plan for the 2020 Biennial. We are excited to share more information about our new location, our plans for the Biennial, and our plans for the Museum. We look forward to welcoming you to the new site in 2021.Sue Gauthierich, director of the Museum of the City of New York: We are thrilled to announce that the Museum will be reopening in 2021 with a new program that will celebrate the life and work of city- and state-born artist and activist Frank Gehry. The renewal of Gehry’s museum will bring the Museum closer to its Long Island City roots, where he lives and works, and will allow us to build on Gehry’s legacy of building critically important works of art in the city. “The new Museum will reflect Gehry’s vision of a Museum that becomes a cultural and social center for everyone in the city,” said Gauthierich. The Museum will reopen with a special exhibition of works by Geh", "The next Biennial should be held in 2021 and will be curated by American artist Larry & Ira Guggenheim, who was recently awarded a lifetime achievement award by the Museum of Modern Art in New York. “The work of a lifetime exhibition is a hallmark of Art Basel, and it is an incredible honor to be able to welcome these talented artists back to the United States,” said cca de la Cruz. “The art of the next Biennial is the legacy of the new owners, and we are committed to continuing this legacy with great care and respect.”\n\n\nYale Union, a contemporary art center in Portland, Oregon, has been purchased by the Portland-based developer of a shopping complex on the campus of the University of Oregon. The Arts and Culture Hub, which opened in 2015 on the former site of an old steel mill, boasts 3,900 square feet of living space, a private courtyard, and a rooftop bar and restaurant. The project also includes a 4,000-piece collection of work by artists such as Paul Gauguin, Mark di Suvero, and Renzo Piano, which will be featured in a solo exhibition by Julie Mehretu, the artist-in-residence"]