["The next Biennial should focus on the evolution of the institution from the riverbank to the city, and on the urban fabric of Thiruvanmiyur. One of the themes for the twentieth edition of the Biennial will be “Bharati curates the city.” The twenty-eighth edition of the festival, curated by KJ Daus, will run at the Mahila Art Gallery, in Mumbai, from December 28 to December 30.The inaugural edition of the American pavilion, curated by Billy Lee, was held at MoMA in New York City last year and ran through March 9. The 2019 edition of the event, curated by Teresa Cooper, was held at the Art Institute of Chicago, and the last iteration of the event, curated by Anne Truitt, was held at the Lincoln Center in New York. The 2019 edition of the event, titled “The City of Light,” was curated by British artist Mark Rylance and was presented by the Tate. The event, which was presented in partnership with the Smithsonian American Art Museum, was also co-sponsored by the New York Foundation for the Arts, and the Metropolitan Museum of Art in New York, and was sponsored by the David", "The next Biennial should be staged at the new site in 2020. The Biennial will then return to the city, during which time the building will be transformed into an artist studios, a museum, and a unique exhibition space that will be open to the public eight times a year. The new building has received a $4 million donation from the Solomon R. Guggenheim Foundation, which will also dedicate $2 million to the project. The new pavilion will be located in the former sites of the Old City, the Pueblo of Santa Fe, and the US-Mexico border. The work of more than seventy artists, including Lucio Fontana, Robert Irwin, Louise Nevelson, Andre Burak, Margaret Mitchell, Charles Polidoro, Sidney Hillman, and Billie Tsien, will be displayed in the new exhibition space. The new site will also host the inaugural exhibition of the new UCCA Foundations for Contemporary Art, which will feature works by artists such as João Miranda, Barbara Kruger, César Ciaramella, and Julieta O. Garner. It will also have access to the Pueblo of Santa Fe, where works by Pablo Picasso, Clement Greenberg, Pierre-August", "The next Biennial should be held in 2020, and would then be able to celebrate its thirtieth anniversary in 2021. The museum will then be able to celebrate its fifty-fifth anniversary in 2022, and the fifty-ninth in 2024, and the fifty-ninth in 2025.Hollis told Artnet that the museum will also continue to host exhibitions and performances that examine the work of artists such as Ian Cheng, Roberto Cicutto, and Peggy-O, and will partake in philanthropic initiatives. He said the museum is dedicated to promoting the work of Hong Kong’s artists and has had discussions with some of them about coming to the United States.\n\n\nThe Museum of Modern Art (MoMA) in New York has hired Sherry M. Preciado, who has served as curator at the museum since 1996, as its new deputy director of curatorial affairs and chief curator. She will assume her responsibilities on January 3, 2020.“Sherry is a highly respected curator who has demonstrated her ability to build compelling narratives around the work of contemporary artists and thinkers in the United States and Europe,” said Matthew Robinson, the museum’s director. “Her work will be particularly important as we move to a", "The next Biennial should be in December 2020 and will feature works by twelve artists from the collection: Alexandre Levas, Alain Ghebaly, Agustín Pérez-Fernández, Anouk Šyst, and Derek & Sarah Webb. The event will also host a special exhibition of work by Christopher Wool from the collection, titled Away from the Estado: Contemporary Art from the Collection of the Museum of Modern Art, London. The exhibition will be accompanied by a book of photography series, photographs in an Age of Color, published by the Fredrick Breuer Foundation, which will present the first exhibition dedicated to photography in the United States.The Biennial will provide a platform for the artists represented by the Collection to present future exhibitions in greater London, the United States, and the Far East. The exhibition will also be a platform for the Art of Image, a group exhibition celebrating the artists of the collection. The show includes works by artists such as Carlos Alÿs, Janet Aitken, Wangechi Mutu, Sara Cwynar, Alex Cuno, Seán Doyle, L", "The next Biennial should be held in 2020. The club said it expects the show to draw up to 1.5 million visitors and has been working with the Kenya-born artist Erik Satie to produce the theme.\n\n\nThe museum’s collection of more than 5,000 works by Russian artist Andrej Pejic, who died in February 2019 after a long battle with cancer, has suffered another blow after the city of Moscow awarded the artist a $82,000 commission for the cityscape of the Kremlin in April 2020.The giant bronze work, titled The Secret One, was commissioned by the sculptor and will be on view as part of Pejic’s First Place, 2020 exhibition. The exhibition will be held throughout March and April in the museum’s new space of the Sozopol–Voznesenskoejskoejskoejskoejskoejskoejskoejskoejskoejskoejskoejskoejskoejskoejskoejskoejskoejskoejskoejskoejskoejskoejskoejskoejskoejskoejskoejskoe", "The next Biennial should take place in the spring of 2022. The first edition, which will be hosted at the Museo de Arte Contemporáneo in Madrid, will be followed by a second edition, to be held in the autumn of 2022, at the former site of the Museo de Arte Contemporáneo in Madrid.For the first time, the sixth biennial will actually be held within Spain, with the exhibition taking place in the city of Granada. The inaugural edition, which was organized by the same team as the 1999 edition, was held at the Spanish Cultural Centre in Bilbao.In an announcement made on September 3, the Spanish Ministry of Culture said that construction on two new buildings, the first a museum, the second a performance venue, in the old Largo da Fomento (St. John's Church) in Barcelona, the city’s principal cultural attraction, is now underway. The first museum, named the Plaza de Arte Contemporáneo (Hall of Fame), will be built in 2021 and will host around fifty exhibitions, including a selection of works by Roger De Caprio. The other, the Plaza de Arte Contemporáneo, will open", "The next Biennial should take place in the United States, where a myriad of events have been canceled or postponed in the wake of the Covid-19 pandemic. The show will return to New York in the spring of 2021. The 2019 edition of the biennial, “Won't You Come Join Me,” was staged by the San Francisco-based nonprofit Center for Art, Design, and Urbanity and was set to run from September 11 to September 13. Framed around the theme of the pavilion, “Architecture as Art,” where the conceptual work of twenty-five artists was to be showcased in a rotating format, the biennial was slated to run for six months, from September 2014 to March 2019. The 2019 edition of the exhibition was cancelled after a worker at the pavilion who was making repairs to the building was infected with Covid-19, resulting in the death of twenty-one people. The pavilion, which was completed in 2009, was the site of many Clara Cropper’s installations, as well as works by Andrew Haigh, Geneviève Poulin, Lawrence Abu Hamdan, Alex Katz, Kiki Smith, and T", "The next Biennial should take place in 2020, and the 2020 edition will include the first public exhibition of works by the artist to open in the city.  \n\n\nThe Carnegie Museum of Art in Pittsburgh has announced that it is reopening to the public in September. The institution, which has been closed since March due to Covid-19, will welcome visitors back in October. It will also offer free admission from 9 AM to 5 PM on weekdays and free admission on weekends. “The Carnegie Museum of Art is reopening to the public as we prepare for the first week of October, when the museum will be open from 9 AM to 5 PM on weekdays and from 9 AM to 5 PM on weekends,” said museum director James Cuno. “The reopening of Carnegie Museum of Art reflects a modern and contemporary understanding of how to organize, manage, and restore a museum. We will have more to share with you in the weeks ahead. Until then, stay tuned for more exciting news about Carnegie Museums and Pittsburgh. We will keep you updated as we share more exciting news about the Carnegie Museum of Art’s plans for the coming months.”The full list of curators tasked with creating the 2020 edition of the", "The next Biennial should be held in the United States in 2021. The institution has yet to respond to a request for comment.  This article was updated on May 2 to reflect that the show is still on.\n\n\nOolite Arts & Culture announced today that it is launching its first online-only digital residency program, which will partner with local artists and institutions to develop programming that will be free to the public. The initiative will showcase the world-leading artists, including Tejal Shah, Saadat Ali, and Rachida Joseph, as well as their works on the upcoming edition of the Faurschou Art Festival, which will take place across the city of New York in January 2022.“The Faurschou Art Festival is a multidisciplinary event that brings together the world’s leading contemporary art and design with over seventy galleries and will provide an even greater platform for the growth of the arts and design sector in New York City,” said Julia Robinson, director of the Goodman Art Museum and Carlos-Albert Roca Art Museum. “Oolite Arts & Culture’s program will provide a powerful platform for the worlds most exciting artists, and we are excited to work with the artists", "The next Biennial should take place in the east wing of the Museum, in the building currently occupied by the Solveig & Solveig, a new contemporary art museum designed by the Solveig family. The new museum will present a selection of the Solveig’s early works, with a new exhibition of the Solveig’s works on view every other year.The Solveig Collection will be rebuilt in the east wing of the Museum to create a contemporary and contemporary art museum that will complement the museum’s collection. The building will include a new exhibition space for the Solveigs’ exhibition collection, a new public courtyard for the collection, a new café, and a library. The renovation of the museum will also include the creation of a new collaborative project between the Solveigs and the Museum. \n\n\nThe Museum of Contemporary Art (MoCA) in New York has retained the artworks of the fourteenth edition of the Biennial of Modern Art (BFAM) in the city. The institution announced the result on Wednesday, March 5, with the announcement of the exhibition “The Fifth Element.” The exhibition featured contemporary art from the collections of the following contemporary art organizations: American", "The next Biennial should be an exciting and challenging time for the entire World, and I look forward to working with you, the artistic and cultural community, to make it a truly transformative experience for everyone.”\n\n\nThe Venice Architecture Biennale, which kicked off on March 21 and runs through April 22, has announced that it will welcome a new exhibition of work by twenty artists and will be held at the Sesto Vina Design, in Venice, from May 22 to May 25. Titled “The New Architecture,” the exhibition will highlight the work of Tarek Atoui, Yinka Shobh, Gheorghe Tsang, Ma Yansong, Christo, Galerina Gheorgheva, Peter, Joko Kanno, María Sola, and Alexander Calderón, and will include the first retrospective of the work of the group Jocke-Girard, whose exhibitions include the biennial “Triple Impact: Architecture and the Evolving Urban Environment” (2016) at the Centre Pompidou in Paris and the first exhibition dedicated to Merce Cunningham at the Art Institute of Chicago.“We are all excited by the exhibition’s", "The next Biennial should take place in 2020. The theme “The Body,” is to be “Community and Solidarities,” and its program will consist of two festivals. The inaugural event will be held at the Getty Center in Los Angeles on October 22–25, 2020.The pavilion for the second iteration of the biennial will be hosted at the Museum of Modern Art & Art Museum St. Louis on September 13–September 22. The exhibition is slated to end with a review of the exhibition “In the Shadow of Architecture,” which will be curated by Nickolay Lamm and is slated to run September 16–September 20.\n\n\nThe J. Paul Getty Trust in partnership with several local, state, and federal agencies are teaming up with several philanthropic organizations to create a new $1 trillion fund to support museums through the 2020 fiscal year.The initiative, titled the Mission 2020, will support more than three hundred arts and cultural institutions across the United States through a combination of direct grants and by increasing the trust funds of the Getty Trust, the Norton Simon Wiesenthaler Trust, and the Getty Museum in Los Angeles. “We are creating an environment in", "The next Biennial should be held in 2021 and will invite artists from over forty countries. The next edition is expected to take place at the Ise Museum in Tokyo. The biennial’s next edition will be held on September 23–28 and will feature the art of a group of women artists that included Akiaki Tanigawa, Emmanuel Adès, Bikram Belopal, Aziz Hamza, and Ondine Baghramian.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it will reopen to the public on September 16. Following a five-year renovation, the museum’s new headquarters has opened to the public. The renovation, which includes the addition of new galleries, rooms, an auditorium, and a theater, was completed in partnership with the local community and was led by architect Adrian Poded, who also designed the original building.“We’ve had more than twenty years to think about how we would make the museum relevant and accessible to the widest possible range of people,” said architect Adrian Poded. “The museum is a hybrid institution that combines the best elements of both worlds: the physical space and", "The next Biennial should take place in 2020. The site of the exhibition is the former headquarters of the Belgian artist Willem de Kooning, who is currently a professor at the School of the Arts in New York. However, the exhibition has faced difficulties since its founding, due to the outbreak of Covid-19. \n\nThe Museum of Contemporary Art (MoCA), New York, has appointed Kate Connor as its next administrator. The forty-one-year veteran curator comes to the institution from the Brooklyn Museum, where she has served as interim director since February 2019.“Kate’s long and successful history at MoCA augurs well for a strong, diverse, and inclusive future at the museum,” said chief curator Jennifer Mascolo. “In her new role, Ms. Connor will continue to lead the fifty-two-year-old institution in its transition to a new museum complex and will continue to play an integral role in shaping the museum’s exhibitions and public programs.”Commenting on her new role, which she is taking up on March 3, Cynthia McKinney, the director of the museum, said: “Kate brings decades of curatorial experience and enthusiasm to Mo", "The next Biennial should be held in July 2020. \n\n\nArtist and activist Pia Camilio has been named the first director of the Museum of Modern Art (MoMA). She will be responsible for organizing and managing the museum’s eighteen-month-long celebration, “Theater of Operations: The Gulf Wars 1991–2011” (2019–2020), which will be held in June 2020.“Camilio’s engagement with contemporary artists and the museum’s relationship with its curators has served as a vehicle for her demanding that the institution reexamine its relationship with donors and engage with those most vulnerable to violence,” said museum director Daniel H. Weiss. “In this new chapter of our history, as presented by MoMA, it is imperative that we do everything we can to prevent the spectacle of war and violence from reoccurring in the form of conflicts, and to do more to address systemic violence against artists and workers.”Details about the 2020 event, which will be led by curator Walid Raad and feature seventy artworks by forty artists, will be unveiled in the coming months and will be announced in collaboration with the artists.\n\n\nThe Armenian government has approved a $", "The next Biennial should take place in 2020 at the San Francisco Museum of Modern Art and will showcase the work of seventy artists, and will organize a retrospective of the work of Chinese artist Zhuang Hao.“We are thrilled to also be presenting the work of Zhang Ze, Guo Zhenan, and Zhenan Wang in a show at the new Museum of Modern Art, which opened in 2017, and of the Chinese artist Chen Guang,” said museum director Carlos A. Alarcon. “These sixty-eight artists represent a wide range of Chinese and international practice, and their work will help us mark a milestone as we mark our fiftieth anniversary.”The exhibition “Ai Weiwei: From the Depths of Creation” will be the first show dedicated to the artist outside of China. It will include twenty-eight works by thirty-two artists, including the son of Guo Guang, Li Wenliang, and others who came to prominence in the 1970s and 1980s, including Li Xiong, Sun Qian, and Sun Yang. The exhibition will be on view until January 23, 2020.\n\n\nThe estate of the influential American artist Simone Leigh, whose work was often based around an explicit", "The next Biennial should be held in the spring of 2020.Participating arts and cultural institutions are: San Francisco Museum of Modern Art, California: Opening March 22.Frieze New York: Opening March 15.Art in America: Opening March 23.Frieze New York: Opening March 16.  Adam Dachild Gallery, New York: Opening March 23.  Brooklyn Academy of Live Music, New York: Opening March 21. Brooklyn Academy of Live Music, New York: Opening March 16. Cleveland Museum of Art: Opening March 22. Columbia University Art Gallery, New York: Opening March 20. Columbia University Art Gallery, New York: Opening March 21. Colby College Art Museum, Waterville, Maine: Opening March 19. The Dallesandro-Uomo Art Museum, Milan: Opening March 14. The Dallesandro-Uomo Art Museum, Milan: Opening March 13. The Dallesandro-Uomo Art Museum, Milan: Opening March 16. The Dallesandro-Uomo Art Museum, Milan: Opening March 14. The D", "The next Biennial should be held at the Museum of Contemporary Art in Tokyo, in December 2019; the museum will host the exhibition Masada Nakaya’s exhibition “The Expression of Life,” 2019, in January 2020; and the biennial will mark the centenary of the First Peace Foundation, a non-profit organization that provides assistance to East-West reconciliation. The seventy-second edition of the Art Biennale will be staged at the Museo de Arte Contemporáneo in Lisbon in January 2020.\n\n\nThe architect and collector Kiyomi Arata, who established his reputation as a pioneer of modern Japanese modernism with his first show in Tokyo in the late 1960s, has died at age eighty-eight at his home in Tokyo. The Japanese-born, Hong Kong–based collector and designer—who began his career in the 1980s by partnering with influential Japanese artists such as Takashi Tezuka and Tadasuyu—had an enduring presence in Japan’s contemporary art scene, where he collaborated with artists such as Kiyomi Kikuno, Koki Takeda, and Tatsuo Tsuda.His most recent exhibition, “Kiyomi Arata", "The next Biennial should take place in 2022. \n\nIn the first such exhibition at the Museum of Contemporary Art (MoCA), the Los Angeles County Museum of Art (LACMA), organizers announced that they are working with the widow of the late Bachelet-American artist and private collector Richard Avedon to create the first exhibition dedicated to his work. The show, entitled Richard Avedon: New American Painting, will open at the museum in 2020 and will run for twelve months. The show will feature works by the late American painter Richard Avedon, who was active from the 1940s to the 1980s, and include ◊Sidney Pollock’s New American Painting” (August 2014), a survey of his work from 1979 to 1986; “Adam Saltsman: Modern Art” (March 2019), a presentation of works emblazoned with the letters “A’ and ‘’” from the artist’s name; and “Untitled: The Power of Discovery,” a retrospective of US artist Harry Callahan’s work from 1972 to 1976.For the past decade, the Museum of Contemporary Art (MoCA) has", "The next Biennial should be held at the Kodagu Theater in Nagoya, Japan, in 2022; and the 2019 edition will be staged in Tokyo the following year.\n\n\nThe Arts Council of the United Kingdom (ACUK) announced today that Stephen Deuchar has been appointed as its new director. Deuchar currently serves as the chairman of the Royal Arts Council, which comprises the Royal Shakespeare Company, the National Poetry Library, the Royal Shakespeare Company Production Company, the National Poetry Festival, and the Royal Shakespeare Company Production Company. He will assume his responsibilities on January 7, 2020.“Stephen is an extraordinary leader who has been instrumental in transforming both the Royal Shakespeare Company and the National Poetry Library into critically acclaimed, international powerhouse institutions,” said Catherine Walmsley, chair of the council. “His leadership and track record of innovation and excellence make him the perfect person to lead the future of our two-year-old organization. His achievements and achievements will ensure we remain at the forefront of our way of life, while growing our international profile.”Deuchar has taken the helm of the National Poetry Library from Ruth Hamilton as director of the National Poetry Festival, and has overseen the transformation of", "The next Biennial should take place in 2022.\n\n\nThe Lewis Group, which represents nearly 1,500 artists, has announced that it will create the next biennial of the Lewis Group in partnership with the Lewis Museum in New York City. The organization will hold a retrospective of artist Philip Larkin’s A Postcard from the Edge, in October 2020. The event will feature works by the group’s current and former members, as well as works from artists who have died since the series’ inception.“The Lewis Group is very proud to present this year’s Lewis Biennial, which is shaping up to be a very exciting year for the Arts,” said director Stephanie Lewis. “Philip Larkin’s postcard is a landmark work that immerses the viewer in the thinking and writing of the great American painter. The work is a celebration of the group’s fourteen-year history of organizing exhibitions, ranging from exhibitions at the Museum of Modern Art in New York to the Lewis Museum in New York and beyond.”Larkin’s work, which was commissioned by Lewis for the October 2020 exhibition, “A Postcard from the Edge,” was created", "The next Biennial should be held in the first half of 2020. Although the exact date has yet to be determined, most likely it will be mid-summer.The biennial will be hosted by the Singapore Art Museum (SAM), which will continue to operate on a reduced schedule until the end of March, and will include a number of exhibitions that are currently on display—including several newly created works—as well as works that were on display in the previous exhibition. The biennial’s first phase will then culminate in the exhibition “For Tomorrow,” which will run until April 18, 2020.A biennial is a collection of works that are exhibited together in a single exhibition. There have been biennials in Singapore, the United Kingdom, and Taiwan, among other countries. The Biennial of the Philippines will be held at the National Museum of the Philippines. The Biennial of Austria and Switzerland will be held at the Centre Pompidou. The Biennial of the Netherlands and Germany will be held at the University of Amsterdam and the Museum De Bont. The Biennial of Mexico City and Los Angeles will be staged at the Museo de Arte Contemporáneo de Mexico.The biennial of the Philippines", "The next Biennial should be held in Spring 2020.It will also be the first time that the museum will host a public event in the capital of Mauritius, with the inauguration ceremony scheduled to take place at the Museu de Arte de São Paulo, the oldest continuously operating museum in the country. Diana Fowlie, director of the London-based London-based Biennial, said: “I am delighted that the upcoming edition of the Biennale London will be hosted at the Museum of London and curated by the Museum of London and will travel to Tate Britain in 2021. . . . The Biennale London will continue to thrive through new creative and innovative ways, and I look forward to watching the Biennale at the Museum of London unfold in 2022.”\n\n\nThe Metropolitan Museum of Art in New York has been forced to cancel a show about the history of African American art after a backlash over a $200 million Tudor-era renovation project, the New York Times reports. The show, “The Story of the African American Experience,” was slated to open on September 24, but was pushed back to October 21, citing the pandemic. According to the New York Times, the show’", "The next Biennial should take place in 2020. She says: “We want to make Biennials as relevant as our local communities can be, with the same excitement and vibrancy that we felt when we first opened the exhibition. The new exhibits will showcase the work of emerging and established artists in the same spirit that made the exhibition possible.”For Jana and Jacob, the move to the Biennial is a dream come true. “We have been working on this project for more than a decade. We have always considered the Biennial as a central part of our lives,” Jacob says. “Since the first exhibition we have been designing and building to showcase the work of artists in our area, and to make a statement about our local communities. The new programme will offer an opportunity to engage with the Biennial in an intimate way. We hope that this exhibition will be a signal of the future direction that the exhibition can take.”\n\n\nThree hundred and fifty-four artists and collectors are petitioning the Federal Trade Commission to open antitrust investigations after the agency received thirty-nine complaints about the defendants, including those who claimed they had not been paid and that the sanctioned defendants were using the agency to launder money. ", "The next Biennial should be held in 2020. The new dates are April 3–April 5, 2021. Full list of curators: Waleed bin Ali, Zoya Karim, Hirshhorn Museum, Los Angeles, Kieran Labbé, Paris, Muhammad Ali Center, New York, Nina Ishibashi, New York, Kathrin Heinrich, Berlin, Mark Jacob, New York, Marie Klawewski, New York, Laura Maraldi, New York, Max Moscot, New York, Mark Oehler, New York, Paul Pfeifer, New York, Paul Spero, New York, Josef Alberts, New York, Waleed bin Ali, Hiroshima Museum of Art, Japan, Tomás Van der Kolk, New York, Hiroshi Yamanashi, New York, Benedict Barth, New York, Beth Bostrom, New York, Benedict Broderick, New York, Bertrand Brink, New York, Benedict Bonet, New York, B", "The next Biennial should also include “An open letter from Charles and Felicity,” said to be one of the first acts of the new year. The letter will address the invitation of the city to host a “click-through exhibition.” “We are deeply concerned about the impact of this decision on the diverse activities that enrich the city,” said Michael Price, deputy director and chief curator of the City of San Antonio’s arts department. “This is not the time or the place for a retreat. We need the city to participate in the revitalization of our city. We need the city to be a platform for its artists. We need the city to be a powerful site for its stories. We need the city to be a place where we can come together as a community.”\n\n\nThe Žaloudek Arts Library in Škoda, Hungary, has found a new home for its collection of ancient drawings. The institution—whose seven thousand-piece collection spans from the fifteenth century B.C./A.D. 150 to the year A.D. 220—will soon house the Works of the Past, a three-thousand-work collection of", "The next Biennial should be held in 2021.\n\n\nThe Museum of Modern Art (MoMA) in New York announced today that it is planning to move the seventy-first edition of the Fifty-Eighth Venice Biennale, “The City of Stars,” from September to November. The exhibition, which was centered on the legacy of Italian architect Raffaello Pincus\u0097who, during his lifetime, revolutionized European architecture and design and created more than seventy-five works, including a monumental steel-glass installation for the Italian pavilion at the inaugural edition in 1967\u0097to November 21, 2020.The museum said the move will allow it to “continue to present a collaborative exhibition that reflects the centrality of artists in the history of our art and architecture.”The move will also allow MoMA to present “The Art of Movement: The Continental ,” a collection of around eighty works by artists who have moved within the last twenty years\u0097from October 2020 to November 2020.“The move will allow MoMA to present more of its exhibition program, which is currently being curated in Italy, in America and Europe.”Inaugurating the new space will be a retrospective of the", "The next Biennial should be held in 2021–22. “We are pleased to support the work of our artists and are committed to continuing their work in their new home in California,” said Jennifer Dutton, executive director of the Biennial Foundation. She added that the foundation hopes that the move will allow the museum to reestablish its relationships with the local community, strengthen its collection, and continue to host the exhibition program and other events it had previously planned. The museum, which currently has more than one thousand works on display in its courtyard, is currently constructing a new building with the help of the San Francisco-based firm Skidmore, Owings & Merrill (S.A.M.). The new facility will be inaugurated by an exhibition of Jacob’s Painted Wall, a selection of works dating from the 18th century.  The news comes days after the museum confirmed that it was still working on a new work by French industrialist Helmut Newton, who was a major collector of Benjamin Britten’s art. Brutalist collaborator Pierre Cézanne is scheduled to inaugurate the new exhibition, which will open in January 2021, at the museum.\n\n\nThe Institute of Contemporary Arts (ICA) in", "The next Biennial should be held in 2020, with a running time of twenty years.\n\n\nThe American Institute of Art (AIA) in New York has hired Mary Oehlens, who currently serves as the director of the Art Institute of Chicago’s (AIC) digital program, to serve as an advisor to the institution for a five-year term. Oehlens begins her new position with the AIC in July.“Over the last three years, we’ve been working hard to strengthen our digital programs and reimagine how we collaborate with our audiences,” said AIA president and CEO Michael Pfeifer. “Mary’s expertise and passion for collaboration and her expertise in building and sharing new ideas, coupled with her passion for art and community, make her ideal for this role. She will complement the work of our incredible curators, artists, and staff.”Prior to joining the AIC in 2015, Oehlens worked as a freelance curator in New York before she began her tenure at the museum. During her tenure, she curated “Sculptures/Realities: From the Celebratory Body to the Celebratory Mind.” Oehlens currently serves", "The next Biennial should be held at the Museum of Contemporary Art in London in February 2020 and will include two episodes devoted to the history of interdisciplinary art. “The Biennial of Modern Art is a great way to advance the art of our times,” said Jane Smillie, chair of the board of trustees. “The project will counterbalance the exhibition ‘New Art’ which is slated to open at the Museum of Art in 2020. The exhibition will continue to be staged in the United States but will focus on this century’s emerging artists. The programme will also reexamine the history of Western European art and the changing ways of art in the Middle East.” \n\n\nThe Manchester Art Gallery has removed a statue of Winston Churchill from its site in the city’s Manchester Picadilly Gardens, where it was relocated from a former military airfield in 2015. The statue, which was dedicated to the British prime minister in 2011, was also relocated to a museum in the city of Manchester but was never relocated to its original location.In a statement, the gallery said: “The statue was relocated from its original location in Manchester Picadilly Gardens to a museum in the city of Manchester in", "The next Biennial should focus on “foundations of contemporary art” and “the history of the art,” said museum director Maria Berlind. “A decade from now, it will be our goal to have an exhibition which represents the broadest and most diverse visions of where art and art history will go next.”\n\n\nIn a major blow to the European Union’s effort to contain the coronavirus, the European Food Safety Authority (EFSA) in Brussels has ordered the release of nearly two hundred European artists and designers under the age of forty, after it cited their “continued abstention from artistic engagements in the past few months as a reason to suspend their work permit.”In a letter dated September 8, the authority said that it has considered the cases of nineteen individuals who were granted work permits in the last two weeks, and that it has taken the decision to revoke their permits no longer than June 1, 2020. Among the artists whose permits have been suspended are a group of twenty-five artists (\"suspended\"), including twenty-eight from the Czech Republic, Slovenia, and Slovakia, and ten from Hungary, Austria, and the Netherlands.Among those whose permits have not yet been suspended are", "The next Biennial should be held in 2020. Dubbed “The Future is Present: Essays and Remakes from the 1970s to the Present,” the exhibition will focus on “the contemporary and the future.” The biennial will mark the fourteenth anniversary of the event.\n\n\nThe Philbrook Museum of Art in Pittsburgh will collaborate with the National Museum of Lesbian and Gay Art (MoHg) to launch a new national LGBT arts platform, called MoHg 360, in 2020. The platform will bring together programming that has previously been unavailable from both institutions, including new works by artists, performances, documentaries, and other events.The partnership was conceived as a way for MoHg to offer a more comprehensive collection of lesbian and gay art from the 1970s to the present. In recent years, the museum has shifted from a collection focused on the lesbian- and gay-oriented works of the 1960s to one that showcases works from the 1970s to the present. “With this partnership, MoHg and Philbrook are recommencing a new kind of partnership: the opportunity to bring together works that were not previously presented together in one place and combine them in new ways,” said Stephan Kinney, director", "The next Biennial should focus on Østhallar, an area of Stockholm that has been largely neglected by the museum. The exhibition will be a collaboration between artist and archaeologist Nina Bojesson and curator Berit Lindgren; the first exhibition was “Swede,” which was organized by the Swedish artist Hanna Wehn and was held at the museum in 2016.The next event is a joint exhibition between the artist and curator Nadine C. Jansen. The show, titled “The Museum of Dermatological Diseases,” will be held in the Stockholm Biennial Centro de Arte Contemporáneo de Llamas (SBCL), which is currently under construction. The first show to open is the thirty-second SBCL Biennial Mierda, which will be held in 2019.\n\n\nThe official Chinese list of artists whose works have been accepted for the 2020 Fifth Beijing Art Biennial has been released. The selection comprises thirty-two works by fourteen artists, including Huang Xiang, Renyu Xian, Dian Xia, and Zhou Wei. There are also a number of new works by artists whose works were previously unknown, including Charles Asmus: The Lasting Influence of Beau-Louis", "The next Biennial should focus on the history of the festival’s first iteration, which was held in 2007 in Düsseldorf. The museum will also be able to draw on the work of more than forty artists, including Pia Camil, Andre Gide, and Marcin Jurewicz, as well as the museum’s extensive collection of contemporary and historic art. The museum has also announced the opening of a new digital space, The Museum of Modern Art (MoMA), and the launch of several new initiatives, including the MoMA Made in America initiative, which will allow visitors to purchase more contemporary art from the museum’s collection, and the MoMA Digital Archive, which will archive more than seven hundred artifacts from the museum’s collection.The museum has also added two new digital archival holdings: The New Arab Collection, which focuses on art from the region and encompasses art from Palestine, Lebanon, and Tunisia; and the Palestinian Collection, which comprises art from Egypt, Palestine, and the West Bank.The museum will also show the work of some twenty artists from the Arab world, including Omar Masroor, Mohammed Ali Sarkis, and Laila Al", "The next Biennial should open in 2020.For the past few years, the institution has been working to rewrite its current exhibition program and redesign its grounds. The project is now scheduled to run from May 5 to May 7, 2020. The opening coincides with the five-year anniversary of the museum, which was founded by the University of São Paulo, and with the opening of the museum’s new exhibition space at the Institute of Contemporary Art (ICA) in São Paulo. The new venue will host two exhibitions a year.The eight-year, $100 million renovation project, dubbed a “springboard for future collaboration” by artist Charlotte DeSouza, will be led by architect María Alejandra Pires and includes the installation of new works by forty-nine artists. The inaugural exhibition, “La República” (from May 21 to May 27), will be a “continuation of the current exhibitions,” the Institute of Contemporary Art (ICA) in São Paulo said in a statement. The project will also incorporate “more intensive research and self-organization,” as well as the development of a new exhibition program. The Museum of Modern Art", "The next Biennial should have a program that will explore the history of life in the city, and will collaborate with other cultural institutions to create a tangible result: a new and improved cultural and recreational destination.”\n\n\nThe Royal Academy of Arts in London announced today that Maio is leaving the institution in April 2020. After six years at the helm of the academy, Maio led the Royal Academy of Arts from 2007 to 2015. He is currently the Royal Academy’s chief executive and director.Maio succeeds Richard Stebbings, who has served as director of the academy since 2017. During his tenure, he oversaw a number of initiatives, including the reinstallation of the institute’s massive new auditorium, the revamp of the academy’s gardens, and the establishment of an endowment fund for arts education, as well as the establishment of an independent board of trustees.Commenting on his appointment, Maio said: “I’ve been privileged to work with Richard to ensure that the Royal Academy of Arts has been able to thrive as a museum for more than thirty years, and I’m very much looking forward to seeing what lies ahead for the academy. I’m proud to have been able", "The next Biennial should have a chair made by Yiduo (one of the most distinguished modern masters in China), Yiduo Jia, which will be inaugurated at a ceremony in Beijing.  The event is already underway, with the support of a $50,000 grant from the Leverhulme Trust, and will take place at a venue designed by the artist and architect Frank Gehry. Inaugurating the same venue will be a retrospective of the artist’s works from the three previous years, which will be organized by architect Olafur Eliassen.The five Hong Kong-based artists who were chosen to participate in the exhibition are Ji Ke, Li Hsin-Shen, Li Hsin-Ka, and Li Hsin-Wei. The biennial will be held in Wuhan from March 11 to March 13 and will have a running budget of $30,000.\n\n\nThe Museum of Fine Arts (MFA) in Los Angeles is planning to shutter its doors in March 2020 to begin the construction of a new cultural complex on the site of the former Kodak building. The museum, which has been located at 714 S. Santa Fe Avenue in downtown Los Angeles", "The next Biennial should take place at the Museum of Contemporary Art, Los Angeles (LACMA) in 2020 and have a budget of $65 million. The next iteration will be held in 2021, the year of the Thirty-Sixth Venice Biennale, and will run from June 8 to June 23. The theme will be “Making Art, Making Places, Making History,” and will be “The Social Crisis,” an attempt to address the current crisis brought on by the coronavirus. “The history of our times is filled with examples of artists and designers working together to address the challenges of our time,” the Venice Documenta said. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has received a gift of seventy artworks from the nonprofit the Andy Warhol Foundation, which has supported the institution since 2006. The works, which were purchased through a Heritage Foundation auction held last month, include photographs by Lisa and Paul Castillo (classic and contemporary), which were recently listed for the first time at the Andy Warhol Foundation’s auction; and a new work by Anthony Kiedis, which was recently added to the collection of the Andy Warhol Foundation.In addition", "The next Biennial should take place in the Summer of 2022 and will be curated by a new generation of curators. The thirty-third edition of the Biennale, curated by Philomena Cattelan, will also be held in the Summer of 2022. The twenty-fifth edition of the Biennale will take place in the Winter of 2020. The twenty-first edition of the Biennale will be staged in January 2021 and will be the first in the new theme park-style pavilions. The twenty-first Biennale will also mark the conclusion of a twelve-year period of creative development and will take place in the college town of Kunsthal Aarhus. The 2019 edition of the Biennale in Dresden was held in November 2019. The exhibition was curated by Wolfgang Ehrlich. The seventy-fifth edition of the Biennale in Kassel will be staged in March 2020. “We are delighted to present the 20th edition of the Biennale Dresden in March 2020,” said Hilde Geldhof, president of the Academicianische Kunstverein Dresden and the German city of Kassel. “The event will host about one", "The next Biennial should be held in May 2020. The fourteenth will be held in June 2021. The fifteenth and the xteenth will be held in February 2022. The biennials will, for the first time, focus on the artist’s ability to build on the fold and fold their way through their subject matter. The curators will be Carlos Otero, João Sousa, and Sandro Rocha, and will each serve as the director of their own biennial. The artists will take up their own respective themes through collaborative works that incorporate the art of the theme in their installations.  \n\n\nThe Mark IV Armory in Kingston, New York, has appointed Peter Z. Schell as its next director and CEO. He succeeds Christopher Wool, who departed the institution in June 2019 to head the New York Institute of Technology, and will assume his post in January 2021.“Peter is a leading curator, scholar, and educator whose thoughtful leadership and practice has been central to the museum’s transformation from a nonprofit arts institution to a leading research and scholarship institution,” said Mark IV director Diana Lippard. “Peter’s curatorial and", "The next Biennial should be held at the Institut de Science Modernes in Paris in 2022. François Pinault, director of the French Pavilion in the Projekt Barchart said: “The new partnership should give French contemporary art an international platform in the heart of the city. We are in the process of the design, and the installation, of a new exhibition in Paris in 2021. We are also looking forward to the reopening of the Centre Pompidou in 2020.”The 2019/20 exhibition “Secrets of the Body,” which opened at the Musée d’Orsay in Paris on September 22, 2019, featured twelve exhibitions that explored questions of body and mortality, art and death, and religion and religion. The show also introduced the Biennial and its inaugural exhibition, “Perfume” (February 2020), which debuted at the Musée d’Orsay in March. The 2020 edition of the biennial will open on January 20, 2021.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles has received a gift of approximately $8 million from the Delaware Family Foundation, the John and Zebulon Perry", "The next Biennial should be held in 2020.” The first edition of the exhibition was held in Chicago in 2019, and the second in Toronto in 2016.The Boston-based arts organization, which was founded by James in 2012, is seeking a new five-year partner to pay for a space for the exhibition. The organization is asking artists who were invited to participate in the current exhibition to direct their projects toward the institution.For the upcoming exhibition, James will introduce a new format that will require the participants to present their own works rather than presenting works by other artists. The exhibit will be organized around the theme “Painting and Movement—” and will run from November 3–March 7, 2020. Since the exhibition is curated by a single curator,’s own work is rarely presented in the show. The biennial will therefore focus on the work of its artists, especially in their early stages.“The biennial is a response to the current state of art,” James said. “Painting and Movement—” will be presented by Janes, a British painter best known for her work depicting painters in an attempt to address the themes of pain and the movements in their work. Janes will design the exhibition", "The next Biennial should be held in 2022.  The forthcoming exhibition “Atlantis: Life and Hell” will focus on the radical new theoretical and experimental developments within contemporary art history,” Simone Wetherell, director of the Museums Museum of Art in New York, told the Art Newspaper. The 2019 edition of the Biennial, “On the Life and Death of the Black Race,” was staged at the headquarters of the Communist Party in Beijing and was held until March 22, the day the death of Mao Zedong marked the start of the People’s War.The question of whether art can shed light on human origins and origins only begun to be resolved by the same decade that gave rise to the museum’s founding.  In the early 1960s, artist Lesli Linklater and her husband, Eric Linklater, began a project to excavate the Xianhai Convent in Wuhan, China, a former Chinese imperial palace founded by Qing emperor Han Fei in 1199 CE. The duo decided to leave China in 1964 to pursue a career in the United States, but the couple soon returned to China, where Linklater taught at the University of California, Berkeley,", "The next Biennial should be held at least once a year. “We will continue to listen closely to our audiences, collaborate in open and constructive ways, and continue to present innovative and thought-provoking works to them,” said Eleanor Avignon, chair of the Biennial public advisory committee and the association’s director.\n\n\nThe Art Newspaper reports that the Art Biennale Tokyo has issued a new design for the 2020 event, which will take place at the Tokyo Metropolitan Museum of Art (TMR). It will be comprised of an exhibition space, a museum, and a shopping mall. The center will showcase twenty-three new works by forty-two international artists.The design by Tokyo-based studio Mihara Associates, which features a modern design in the suburban setting of Nagoya, Japan, is inspired by the theme “Ainomizu,” a term coined by Japanese artist Takashi Murakami in a 1975 interview with Artforum. Murakami’s work, which explores the idea of an afterlife and the afterlife process, has been featured in several exhibitions over the years, including in the 1980s at the Kunsthalle Basel and the 1990s at the Kunsthalle Basel", "The next Biennial should focus on “political economy” and “creativity in art,” while “Art in Publiclife” and “Public Space” will likely be included in the exhibition.\n\n\nScott Maxwell has been hired as the new artistic director of the National Museum of Aboriginal Arts and Heritage. He succeeds Amylton R. Graham, who retired in November 2019 after eighteen years at the helm of the institution. “We are delighted that Scott has been chosen to lead the National Museum of Aboriginal Arts and Heritage,” said institute director Elizabeth Ann Macgregor. “He has been instrumental in delivering on our mission to recruit and retain a talented and innovative staff, prepare for and present our forthcoming exhibition ‘Legends of the Past,’ and continue to build our collection.”In his new position, Maxwell will serve as director of the National Gallery of Australia (NGA), which recently unveiled the first series of paintings by Indigenous artists in the United States. In a statement, he said: “This is an incredibly challenging time for museums as we consider the future of our collections, exhibitions and programs. I’m excited to work with the NGA and a dedicated team of", "The next Biennial should take place in 2020, and the next year in 2021. We are hopeful that the next edition will deliver a show that reflects the richness and vitality of Glasgow. We are also hopeful that the themes of this year will resonate with those of previous years, as well as those of future years. I would like to thank the curators, artists, and supporters of both the projects for their extraordinary work, and for their gracious cooperation in this urgent and important matter. This is a difficult decision, and one which I take with great respect. I am confident that the reconstruction of the Biennial will deliver a show which reflects the city of Glasgow's spirit and vitality, and which will represent the heart of the city for millions of visitors to see in 2020 and 2021. Kevin McAllister ’s sculpture The Harvest of Children” (2017–18), a rendering of the harvest season, was selected as the winner of this year’s Golden Lion. The art-work, which was mounted on a large platform in front of the Scottish Parliament in Edinburgh, was selected from a shortlist comprising Christo, Mearns, and Kathryn Stewart. The artists who were shortlisted for the prize", "The next Biennial should focus on the history and future of the institution,” Dennis Seidenberg, chair of the board of trustees, told the New York Times. The museum is currently undergoing a $150 million expansion and renovation. The institution has also announced that it is planning a major expansion of its public gardens and its archives. The 2020 edition, “After Despotism,” will also feature a “serious and accurate portrait of the sculpture-making and storage of Thoreau’s assistants,” curator Tristram Hunt, who curated the exhibition in 2010 and is now a professor at the University of the Arts London, will serve as guest curator of the biennial.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, will launch a new digital platform that will allow the public to view a retrospective of the 1980s American painter and photographer, Billy Peacock. The show, titled “Billy Peacock: The Futurist in My Life,” will be on display at MoCA’s new building at 1200 East Seventy-Third Street, alongside works by contemporary artists such as Paul Gauguin, James Cuno, and Robert Irwin.“This is", "The next Biennial should be held in 2020. The next edition will be held at the Museo de Arte Contemporáneo in Madrid.\n\n\nArt historian and curator Bianca Delaney has been named curator of the Picasso–Friedrich Künstler exhibition in Albertsdorf, Germany. The 2018 edition of the event, titled Art and Life, featured work by fifty-five artists, including Joël and Jean-Luc Godard, Fritz Lang, and Paul Gauguin, and was staged in mid-June. Delaney joins the German arts minister, Barbara Hendricks, in linking the permanent collection of the Berlin Art Museum with the city of Albertsdorf for the first time. The integration project began in 2021, when Künstler’s permanent collection was transferred to the Albertsdorf Museum of Art. Delaney will lead the Albertsdorf Art Museum through 2021 and will work with the Berlin Art Museum, the Aachen Archaeological Center, and the Art Institute of Bonn on two projects, one in partnership with the city of Bonn, and another in partnership with the Albertsdorf Museum of Art", "The next Biennial should feature works by the Los Angeles–based artists Tori Amos, Anna Atkins, and Trisha Brown, and the Houston-based artist and educator Jonathon Jebb. The festival will also include the first-ever solo exhibitions of work by the artists.\n\n\nThe British artist Richard Attridge, whose groundbreaking paintings depict grotesque and surreal landscapes and conjure images from ancient mythologies and obscure literary conventions, has died at the age of eighty-three. His cancerous tumor, which was revealed only last year, forced the artist to withdraw from the venue of his choosing, which is now the National Museum of Art, and to commit suicide.Born in 1961 in London, where he studied under the late British painter Vincent van Gogh, Attridge grew up in Cardiff, where he began painting at age nine. His early influences are Jean-Michel Basquiat, Vincent Van Gogh, and Douglas Grant, and he had a deep and recurrent interest in myth and mythologies from an early age. In his early photographs, he recalls the influence of Piet Mondrian, who encouraged him to develop his own style. His early work is often characterized by its vivid colors and its ability to reveal an emotional range that only the medium could deliver", "The next Biennial should take place in 2021. The Biennial History is a timeline of the show, which has been published by the Belknap Museum of Art in New York, the Museum of Fine Arts in Boston, the Metropolitan Museum of Art, and the Smithsonian American Art Museum in Washington, DC. The history was founded in 2007 by Arthur Benjamin and Philip Johnson, who were collaborating on a documentary about the American Indian. “The museum is thrilled to present a new work by the close-knit ensemble of artists whose careers are intertwined through their shared interest in the catalogues of conservators and their respective histories,” said Kenneth Spence, the museum’s director. The Biennial History is organized as a timeline of the works of twenty-seven artists, including James Cosby, Adrian Piper, Frank Gehry, Peter Hujar, Ed Moses, Thomas Merton, Hermitage Museum, and Siân David. The artists whose work was selected for its historical significance include Catherine Brown, John McCain, Hannah Wilke, Robert De Niro, Catherine O’Brian, and John Paul Jones.“The exhibition will invite viewers to", "The next Biennial should be held in 2022. \n\n\nThe Institute of Contemporary Arts (ICA) in London announced today that Liz Sandall has been appointed as the next director. She succeeds Karen Bradley, who has served at the ICA for thirty-five years and is the institution’s founding director.Sandall succeeds Ellen Harrison, who has been the ICA’s chief executive since 2013, and will take up her post on January 20. Sandall will begin in her new role January 21 and will work with the ICA’s board of directors to determine the future of the institution.“The ICA is thrilled to welcome Liz to the team, bringing her experience and expertise to bear in supporting the ICA’s mission, ensuring the ICA’s future exhibitions and performances are inspired and informed by contemporary issues, while remaining grounded in the ICA’s history,” said Sharon Rowland, chair of the ICA board of directors. “Through this collaborative partnership between the ICA and the ICA’s board, Liz will continue securing the ICA’s place alongside some of the world’s leading visual arts institutions, while expanding the ICA’s reach", "The next Biennial should focus on how the growing number of artists, intellectuals, and scholars\u0097including artists and intellectuals from the West\u0097are being excluded from the Goodwill’s programs, while the majority remain behind in their studies.The 2019 edition will be held at the MHU Art Museum, Sydney, Australia. The 2020 event will be held at the Art Museum Sydney, Melbourne.The 2020 event will be featured in Artforum’s April 2019 issue, and the 2020 event will be presented by the artist-run organization Live Art.\n\n\nThe New York Art Archives has received a gift of eighty-nine works from the late Egyptian-American artist Naguib Mahfouz. The collection includes works from the legendary American painter Bruce Gildenheimer, whose influence is felt throughout the art world; from Naguib’s New York studio; from his Los Angeles home; and from his numerous locations in the United States, including New York, New Orleans, and New Mexico.Naguib’s final years in Manhattan, in an area that includes Central Park, were marked by numerous exhibitions and performances. An exhibition at the Whitney Museum of American Art in January 2019 showcased his work Outside the Lines, which", "The next Biennial should be held at the Renaissance site in 2021.\n\n\nFrance’s Culture Ministry announced on Thursday that it is planning to introduce a series of measures to combat the spread of the coronavirus, which has already killed more than 3,300 people in France and is still occurring despite the country’s efforts to contain the virus. The ministry is now projecting that the coronavirus may have affected as many as 184,000 people when it was first reported in late December.The ministry is taking measures to educate the public about the virus and is encouraging social distancing, but it is also encouraging businesses and institutions to continue with normal business activities. The measures will include providing more information about the spread of the virus and providing more support for small businesses and individuals who may not be able to close their doors due to the crisis.The measures are part of a five-point strategy that French Prime Minister Édouard Philippe unveiled in an attempt to contain the coronavirus, which he described as “difficult to stop.” The strategy includes creating a public health emergency plan to help small and medium-sized businesses and by encouraging the travel of sick people; providing financial support to those who work in small or medium-sized businesses", "The next Biennial should be October 6–October 7, 2020. The first exhibition will be held at the National Gallery of Art, in Washington, DC. The exhibition will include a selection of twenty-five works; both the artist and the work will be housed in the Smithsonian American Art Museum in Washington, DC.The National Museum of Women in the Arts (NMWA), Bonner Hall, is currently closed indefinitely due to Covid-19. The institution announced this week that it will reopen in phases with a new set of exhibitions and the ongoing collection collection.The first show will open on October 9 and will feature works on paper by twenty-five artists. The show will also feature a new collection of forty-two works, which will be organized by medium and location, and will be led by the director of the National Gallery of Art, Adam D. Weinberg. The show will be followed by an exhibition of works by artists in partnership with the National Gallery of Art.“The National Gallery of Art is working hard to ensure that once we reopen, we will be able to continue to present exciting exhibitions of art every week, every month, and every year, with the care and attention to detail that we have long admired,” Weinberg", "The next Biennial should feature the works of more than fifty artists, including Naguib Mahfouh, Amadou Diallo, and Stefano Fusi, and will take place in the central Kampala city, Mali, in 2021. LaToya Green, a curator at the Smithsonian American Art Museum in Washington, DC, told the Art Newspaper: “Each year we are inspired by the artists who have made such remarkable contributions to contemporary art. We hope that the new venue will enable them to continue to create, to research, and to present their work in their original contexts.”The Festival has a long history of supporting artists and has received its first prize in 1924, for its “Manifestation of Beauty,” exhibition organized by Charles and Paul Siegel. The award ceremony, which took place at the Siegel Center in New York, was taped and distributed live on television. The live broadcast was followed by an open house, which drew a crowd of more than twenty thousand people. In 1986, the museum staged an exhibition of works by the artists who had participated in the 1979 show “Between the Sun and the Moon: A Year Without Color” at the Whitney Museum of American", "The next Biennial should take place sometime in 2021. \n\n\nDue to the ongoing Covid-19 emergency, the Metropolitan Museum of Art in New York has postponed its upcoming exhibition “Composition 21,” which was scheduled for March 21–March 26. The show, which focuses on the visual arts and was expected to showcase work by twenty artists, including Alice Aycock, Rirkrit Tiravanija, and Vincent van Gogh, will now be held in 2022.The exhibition, which was originally supposed to open on March 16, has been moved to March 19. Its February show, titled “The Existence of Form,” will resume in March 2022. The exhibition will now showcase a new twenty-one-year retrospective of the artist-in-residence, the contemporary painters Theo and Eva Hesse.According to Artnet, the Metropolitan Museum of Art’s director Tony Gilts described the move as a “mutual recognition that the future of the Met is very much in doubt.” “We are reminded by the work of the artists who came before us that the Met is, in many ways, the heart of our city, and that the future of the Met is at stake, and", "The next Biennial should take place in 2021. \n\n\nThe Museum of Contemporary Art (MoCA), California, has appointed Timothy D. Schlechtriem as its next director. Schlechtriem has served as MoCA’s chief curator since 2010. Previously, he worked as a curatorial assistant at the Brooklyn Museum, where he curated “Peoples’s Dreams: The Visuals of Bertrand Delahaye” (2014), and served as a fellow at the Museum of Modern Art, New York.“Tim is a dedicated curator whose work spans the history of contemporary art and explores the concept of the non-visual medium, a medium that is often overlooked,” said Museum director Minnie Whitman. “His curating style will be a strong fit with the new mission of the museum, which is to present work in a collaborative, collaborative, and thoughtful way.”Prior to joining MoCA in 2010, Schlechtriem served as director of the Metropolitan Museum of Art, where he worked from 2002 to 2009. He also worked as a curator at the Museum of Modern Art in Berlin and as a research associate at the Museum of Contemporary Art, New York.\n\n\n\n", "The next Biennial should take place in 2020. “We are planning to re-open in the autumn of 2020 with a new programme of exhibitions and events, which will include the temporary exhibition of the final work of the exhibition, ‘Nirvana’,” said Gaand. The programme will also include the first-ever biennial of the collection of the German architect Erich von Kahn.Hiroshi Kawamura, director of the Museum of Contemporary Art Tokyo, said: “We are very much looking forward to the biennial of the collection of Hans Pfeifer, which is always an important milestone in the development of Japanese art. The museum has had a long-standing relationship with Pfeifer for many years and has been actively working to develop collaborations with him throughout the past decade. I am particularly excited about this—his work is always uniquely his, and we have had the chance to collaborate with him in his studio and in his workshop, and to work with him on some of my early conceptual projects. I am confident that this collaboration will continue in a way that respects the artist’s spirit and in the way that makes him feel.”\n\n\nThe Institute of Contemporary Arts (ICA), London, announced today", "The next Biennial should be held in the spring of 2021. “We are eager to see the first work in the series,” said FACM’s director, Stefanie Kohler. The next iteration of the show will take place in 2019, and the Exhibition will return to the city of Frankfurt in 2021. The design center was founded by Kunsthalle Bremen and the Federal Research University of Berlin in 2014. The institution has three full-time staffers and has a permanent staff of around seventy.\n\n\nThe New York City Department of Cultural Affairs (DCLA) announced today that, in response to the coronavirus epidemic, it is creating the world’s largest permanent arts and culture museum. The $450 million Museum of Modern Art (MoMA), which is on track to open this fall and will feature more than 300 works by sixty-six artists, including Sergei Kalinin, Nadezhda Galkina, and Slavs’s David Silver, is poised to become the first center in the United States to house the entire collection of American art.The DCLA’s director, Paul Morigi, said: “The design of MoMA is a micro", "The next Biennial should be held at the Artin-Bicocca, since it is still in the process of construction. Its next iteration will be staged at a location on the island of Lido di Belvedere, in the Pisum region of Venice.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Jessica Mackintosh as interim director and CEO, effective immediately. She will be the first woman to lead the institution since the passing of the late CEO, Bernard L. Greenberg, in January 2021.“Jessica has been instrumental in transforming MoMA into a leading contemporary art museum in the United States,” said Richard Armstrong, chair of the board of trustees of the New York Museum of Art. “She raised the profile of American art through visionary programming, and helped shape the museum’s relationship with its surrounding community and wider world through her extraordinary leadership. We are grateful for her extraordinary memory and leadership and look forward to her continued leadership and vision.”The appointment was made to coincide with the opening of the exhibition “Theater of Operations: The Gulf Wars 1991–2011,” which explores the legacy of U.S. forces in Iraq and Afghanistan, and the release of “", "The next Biennial should be held in the Summer of 2020. \n\n\nThe OMA Museum of Arts and Design (OMA) has appointed John Schlesinger as its next director. Schlesinger will take the helm of OMA from Ann McDonagh, who has helmed the museum since 2008, and will assume his post on April 17.“With deep experience in both new and established art, John brings a proven track record of innovative, high-quality work in both contemporary and traditional art to our new museum,” said Ann McDonagh. Schlesinger comes to OMA from the Museum of Modern Art (MoMA). He was the inaugural director of MoMA after it opened in 1987 and was instrumental in the museum’s establishment and expansion.After working at MoMA for four years, Schlesinger was promoted to the position of director of the museum. Among his many accomplishments are the foundation of the Foundation for Contemporary Art (FCA), which provides support for the arts, and the establishment of the Middle East Center for Contemporary Art (MECCA), a major undertaking of the museum.Schlesinger now serves as chief curator of the Contemporary Art Museum Houston and the former director of the", "The next Biennial should take place in the Fall of 2021. We had hoped to develop a new platform for exhibitions, but this decision has forced us to consider the possibility of revising the current exhibition program. In order to ensure the future of the Biennale, we will continue to develop innovative and individual exhibitions that reflect the diverse artistic and intellectual traditions of the city and the region.Our funding of the Biennale has never been less than a priority for us as an organization and we will continue to seek new ways to support the show. We thank everyone for their understanding and support during this difficult and unusual period of our lives.\n\nThe Solomon R. Guggenheim Museum in New York has received a $2.5 million gift from philanthropist, collector, and art historian Diane von Furstenberg, the former CEO and chairman of the investment firm Apollo Global Management, in recognition of her lifetime achievement in art history. The gift was made in honor of the museum’s installation of the biennial “The One Hundred Years of Italian Art” in 2017, which was staged at the Guggenheim.“Diane von Furstenberg’s contribution to the museum is a defining moment in the museum’", "The next Biennial should be held in 2020. So far, the upcoming edition of the event, titled “Days of Rage,” will focus on the importance of art in addressing social and environmental concerns. \n\n\nThe Ren and Stimpy Mouse Museum in Los Angeles has received a gift of fifty-two works by American painter Charles Edwin Booth. The gift comes from artist Paul Rosenberg, who, in recognition of his lifelong devotion to the Spanish-born artist, has endowed the museum with the works. The gift was made in the form of a letter addressed to the new director, Edward Suarez, and signed by Rosenberg.“We are delighted to be able to present this letter to our new board and board members, Edward and Mary Green, to whom we are deeply indebted for the prompt and generous letter you wrote to us with regards to this exhibition. We are grateful to Edward for his prompt and honest and to Mary for her prompt and honest in addressing this matter. It is an honor to present this letter to you, Mr. and Mrs. Rosenberg. We hope that this letter will be helpful in your consideration of this outstanding gift.”The works are currently on display in a major exhibition, “Avant-Garde: the Art of", "The next Biennial should be held in 2022, when the exhibition will mark the centenary of the outbreak of World War One, and will be hosted by the Institute for Advanced Study in Art History (IAS) in Berlin. The Frankfurt Biennale will also join the likes of the London and New York Biennales, which are currently underway, and will run concurrently. The alliance has led to criticism of the IAS for aligning with the German government, which has repeatedly objected to the festival’s inclusion of the term “genocide.” In an attempt to placate the government, the IAS will allocate €1.2 million for the event, which will be held in 2022, and avoid having the term “genocide” appear in the exhibition. The IAS’ decision to pull the plug on the event has led to protests from across the globe. The United Kingdom’s Institute of Contemporary Arts (ICA), which is currently working on a new exhibition for “Genocide: An Exhibition of Contemporary Art,” announced that it plans to stage a “reflection of the past” exhibition in the autumn of 2021. The exhibition will include works by fifty artists and will examine", "The next Biennial should be held at the Centre Pompidou in Paris in the spring of 2020. The change of plans comes amid growing concern over the health of the world’s rarest, most endangered, and most expensive artworks. Artist-owned galleries are facing legal action from collectors who believe their works should be returned since the museum has not allocated a single work for resale in the past decade.\n\n\nThe second edition of Art Basel Hong Kong will be held this fall at the Makuhari Messe in Tokyo. The event will take place in the theme “New China,” which is believed to be based on the concept of new commerce and the government. The 2020 edition will be titled “20 Years of Art in Asia.”The theme was inspired by the twentieth-century transformation of Asia. “In the current changing global world, and in the present challenges and opportunities presented by climate change, I have decided to take a long-term view of art and the future of art,” said Liu Xianmin, the event’s organizer. “The image of the late Chinese artist Huang Yishu and the upcoming exhibition ‘20 Years of Art in", "The next Biennial should be held in the spring of 2021. The 2019 version, which was organized by American artist and educator Tinget M. Ahmed, drew an audience of seventy-four people from forty-six countries.\n\n\nThe Richardson Art Museum in Nashville, Tennessee, has appointed Jonathan Pelinka as its next director and CEO. He succeeds Tamara Hensley, who retired on June 30 after seventeen years at the institution. “Jonathan is a compelling leader and strategist whose leadership and vision has made him one of the most successful and respected executives in the United States,” said Nashville’s director, Elizabeth Flemons. “Over the course of his twenty-four-year tenure, he has built the Richardson into a vibrant, work-intensive, innovation-driven institution that is recognized worldwide for its innovative and transformational impact.”Pelinka came to the museum with a deep knowledge of and passion for European art, and has worked to expand its collection and skills in that field since he joined the institution in 2002. The institution is currently transforming the gallery into an artist residency program, which will host more than one thousand artists at a time, and is expanding its board of trustees. Its", "The next Biennial should be held at the Tohoku University Museum (TUM), the new location of the Tohoku Museum of Art, in Okayama prefecture, Japan, in 2020. The 2020 event will still be held there, but will be staged on a larger scale. The 2019 edition, titled “Meet the Artists,” kicked off on October 5 and ran through the end of the month.The 2019 edition was curated by Takashi Kawaguchi, Chair of the department of literature and the history of art at the university, and Takashi Ikeda, the head of the department of fine arts and design. Also represented in the exhibition were Nao Takeda, Togami Nobuyoshi, and Tsubasa Yuki; the manga artist Kiyosaki; and the poet Shigemitsu Ikawa. The winner of the prize was art critic Atsushi Morita, who invited the artists to participate in an exhibition of his. 1999 was selected for its exhibition “In the Same Room,” a collaboration between the artist and artist-in-residence Doina Dukh. An exhibition of the work of the same artist-in-residence, a collaboration with the artist-", "The next Biennial should take place in 2020. If this is indeed the case, then the next edition will likely be in the spring of 2021.\n\n\nArtnews reports that the Dutch Ministry of Culture has announced that it plans to create a new national museum dedicated to Dutch-made art in the country, which has been run by the Ministry of Culture since 1959. The institution will be located in the city of Arnhem and will be named the Museum de l'Art et l'Etude (Museum of Art and Letters). It will be funded by the state of The Netherlands and will open in 2022.The new museum will consist of approximately 5,000 square feet of exhibition space for contemporary art and will open in 2020. It will also include a research library, an office and a gallery for exhibitions, and a public courtyard. The institution will be anchored by a permanent collection of more than one hundred thousand works.The organization will be led by Joost Hilter, who is currently a senior curator at the National Museum of Contemporary Art and Design in Düsseldorf, and will be funded by the Aarhus Foundation, the municipality of Arnhem, and the Museum Verlag in Munich. The Palais de Tokyo in Paris will also", "The next Biennial should be held in 2020. The project will also include a new exhibition of works by artists from Africa, the Americas, and Asia.\n\n\nThe Getty Museum in Los Angeles has announced that it will launch an online-only version of its Visual AIDS survey, which asked seventy-five artists to describe their experiences with HIV/AIDS. The online version of the project will be made available March 19–March 21, 2020.The online version of the Visual AIDS survey, which was developed by the Getty’s Center for AIDS Research and presented by the artist and scientist Dr. Peter Dray, will be available in the app and will include abstract and photographic images of living and non-living entities such as people, plants, and signs, as well as text describing the art and artworks in the survey. It will be accompanied by an accompanying CD containing the artists’ written testimonies.“While ART has been a critical and transformative space for many, the Visual AIDS survey questions the limits of the question,” said Julie DeLuca, the Getty’s executive director. “The results we hope to produce will help us to rethink how artists use art to address HIV/AIDS, and will help us to rethink the nature", "The next Biennial should be held between June and November 2022. Its opening ceremony will take place in the studio of the artist-run museum in Beijing and will feature the work of the exhibition’s first American artist, Olafur Eliasson, a self-taught painter who resides in New York.\n\n\nToccarlo Art Gallery in Rome has been awarded a £60,000 grant from the Italian government for its expansion of the gallery's contemporary art and design program in two phases. In the first phase, the institution will present forty different exhibitions and will create new areas for visitors to experience the work of the contemporary artists represented in its collection. The second phase, slated to begin in 2020, will continue with the same theme, but with a different artist-led initiative that will highlight the work of a different group of contemporary artists. The initiative will also introduce new exhibitions.The National Centro di Artista (NCA) in Milan has been awarded a £38,000 grant from the Italian government for its expansion of the gallery’s current exhibition program. The fourteenth edition of the Italian pavilion, titled “Toccarlo di Caro,” will be staged at the institution’s new ground in", "The next Biennial should be announced in the coming months.The twenty-second edition of the Biennial will be held at the Old Bailey in London from May 5 to May 6, 2020. The event will showcase the contributions of seventy-five contemporary artists and will feature live music, readings, and performances.\n\n\nThe Guggenheim in New York has announced that Susana Nara’s first commission as director of the Guggenheim was to commission Ariel Pink’s 1987 film The Right Stuff, which dramatized the life and works of Evelyn Waugh. Nara became the first person to take over the helm of the institution from director Jeffrey Seller in 2016, when he departed to become president and CEO of the Metropolitan Museum of Art. Last year, she became director of the Akzo Art Museum in Japan, and she will serve as curator for this year’s edition of the Guggenheim Biennial, which will take place from May 4 to May 6, 2020. Additionally, she will lead the exhibition “The Evolution of an Eye,” which will be housed in the museum for the next two years and will include works by seventy artists.The Guggenheim’s new proposal for the", "The next Biennial should be held in 2020. \n\n\nBill and Melinda Gates, the billionaire brothers who collectively own the retailing conglomerate Safeway, are raising funds to create the first national museum of African American history in the United States. Its location in the heart of Chicago will be in direct conflict with the city’s Black History Museum, which is located in a former industrial site in the Windy City. The Gates Foundation will contribute $10 million, while Chicago’s Cultural Affairs Agency will spearhead a $5 million campaign.“We are thrilled to partner with the Gates Foundation to create a new museum of African American history in the city of Chicago,” said Maureen Shah, president of the Gates Foundation. “This is a moment of unprecedented change, and the Gates Foundation is committed to working with city government and local community leaders across the city to create opportunities for local artists, researchers, and small businesses to experience and connect with the history and culture of our nation. Our vision is to construct a new museum that will have the capacity to sustain local communities for generations to come.” The $5 million campaign will target a variety of cultural institutions across the city, including the newly renovated Lincoln High School,", "The next Biennial should be held in 2021. About The Biennial John Parrish, director of the Art Gallery of Ontario: We are committed to creating a platform for Canadian artists to achieve international recognition and have a positive impact on the field through exhibitions, education, and fundraising. The Biennial will continue to be a platform for artists to see their work in exhibitions, and we will continue to work with community partners to build on the exhibition program. The 2019 show, In the Beginning, at the Art Gallery of Ontario, closed with a show of work by artist Rinko and succeeded in changing the course of Biennial history. The show was not only a milestone in its own right, but was considered a watershed achievement by the museum and was awarded the National Art Award. \n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles announced today that it will restore the former headquarters of the Los Angeles County Museum of Art (LACMA), an undertaking it described as a “last resort.” The institution—which relocated to its current home in the city of Glendale in 2012 and has been in a state of restoration since 2013—passes the $1 billion mark in its $250 million campaign to overhaul", "The next Biennial should be held in 2022, and the first in 2020. It will also bring together artists of every country, region, and language.\n\n\nThe Guggenheim Museum in New York has released an open call for proposals for the 2020 edition of the biennial, which was held in August 2018 and will run from September 17 to September 21. The biennial, titled Art in Motion, and Art and the Future, was sponsored by Art in Motion, the Museum of Modern Art, the National Geographic Society, and the American Institute of Graphic Arts.The institution is searching for a new director and will seek a candidate with extensive experience in cultural production and curatorial work. “The Guggenheim is thrilled to announce that our founding benefactor, Art Major, has announced his retirement following nearly eight years at the helm of the institution,” said Guggenheim director Susan Egeran. “He is a tireless advocate for our work and a tireless champion of our exhibitions. We are grateful for his leadership as we have grown and learned from him, and I thank him for his longstanding commitment to the Guggenheim’s mission, exhibitions, and programming.�", "The next Biennial should be held in 2021 at a date yet to be determined, but we are very much looking forward to its return.\n\n\nThe Museum of Modern Art (MoMA) in New York has announced that it is planning to move the exhibition “Gladiator: The Complete History,” scheduled for May 2020, to April 2021. The move will delay the opening of the exhibition by a month and will run counter to the institution’s stated goal of moving the exhibition as soon as possible.The move follows a wave of construction and renovation work on buildings and structures in the city, which has seen an influx of artists and designers, and is part of MoMA’s ongoing effort to become a more sustainable institution. The institution recently announced its intention to phase out oil use in its factories and refineries and to transition to using renewable energy sources by the end of the year.During the exhibition, which will be curated by Mark di Suvero, the Los Angeles County Museum of Art, and the Metropolitan Museum of Art, the institution will feature work by thirty-seven artists whose works were on display at the final edition of the exhibition, “The Blueprint for the Future.” The show will be relocated to its current location", "The next Biennial should be in 2021, and the title of the exhibition should be “Cannabid,” according to a statement from the artist’s management. The museum said that it plans on launching a new online platform, called the Index, as part of the 2019 biennial, and that the institution will also visit the institution in the future.\n\n\nThe New York City Department of Cultural Affairs (DCLA) confirmed on Monday that MoMA PS1 has received a $5 million gift from philanthropists David and Charles Gillett\u0097the same donors who provided $1.2 million to the Metropolitan Museum of Art in New York in June. The gift was made in recognition of the museum’s decision to acquire the painting Sky Burial, from the artist’s longtime estate, Van Gogh.“The Gellett family provided MoMA PS1 with many substantial gifts in recent years, and it is fitting that they should receive their share of the new gift,” said cultural affairs commissioner Tom Finkelpearl. “It is a truly incredible honor to receive this gift. Just as the family is an integral part of MoMA PS1 and our great city, so too", "The next Biennial should take place in 2021. \n\n\nThe Institute of Contemporary Arts (ICA) at the University of Chicago announced today that it will permanently close its doors on November 1, 2021. The eventual decision to end the museum’s current exhibition schedule follows the ICA’s decision to cancel its sixth edition, which was originally planned for February 28–March 29, 2022. The ICA is currently considering whether to initiate a restructuring that would suggest an extension of the twenty-third Biennial, which was originally scheduled for August 20–August 22, 2022. The institution is also considering the potential for a petition to extend the ICA’s curatorial mandate. Following an extensive review, the ICA Board of Directors voted unanimously today to terminate the curatorial role of its president, Becki Thorne, and its board of directors and management. Thorne was reelected for a second term, and museum director Anna Wintour, who led the ICA from 2018 to 2019, was named associate director.“As we close our doors to the public and resume our work as a cultural community, we are grateful for the contributions our artists and staff have made to enriching our city, city neighborhoods, and", "The next Biennial should be held at the Museo de Arte Contemporáneo de Barcelona, in September 2020. He added that the museum would play a key role in preparing for the event.  “The first Biennial was an epicenter of creativity and vision. Its exciting new incarnation embodies both that spirit and our commitment to supporting innovative and exceptional creative work in the arts. We are proud to be a part of it, and to be able to collaborate with the innovative and committed teams at the Museo de Arte Contemporáneo and the Castello di Arte Contemporáneo in Barcelona. We are grateful for the enthusiastic and generous support of our colleagues and friends in the arts sector in the region.”\n\n\nThe Solomon R. Guggenheim Museum in New York has received a gift of seventy-three works, including forty-seven works by artist-in-residence Dr. Alice Aycock, from artist-in-residence David Kordansky, who was recently arrested in Kalamazoo, Michigan, and charged with three counts of attempted murder. According to the Detroit Free Press, Kordansky was arrested on May 21 in connection with a shooting that took place on", "The next Biennial should be held in 2022.\n\n\nThe Philadelphia Museum of Art (PMA) is planning to move the exhibition “Out of Time: Sol Marconi” from its temporary home at the Philadelphia Museum of Art in 2020 to its new home at the Philadelphia Institute for Art.The show, which examines the life and work of the Italian computer scientist, inventor, and inventor-in-chief, was selected as the Biennial of Arts and Narratives by the Pennsylvania-based group the Philadelphia Arts Council (PAC).“We are excited to move the exhibition to the museum,” said Paul Maritz, the PMA’s director of exhibitions. “The exhibition has been a great success at the museum, and we want to see it continue to thrive by building on the work of our talented and dedicated curators. We have worked with PAMA for many years and have enjoyed working with its talented staff, and the museum’s visitors, many of whom have come to see the show for the first time.”During its twenty-year run at the museum, the exhibition has featured contributions from more than 120 artists, including Frank Gehry, Mark di Suvero, Jean-Michel Bas", "The next Biennial should be held in 2020. The Chinese artist Chen Guangwu (1905–1973) is the subject of a special exhibition at the Museum of Modern Art in New York under the title Guan Fu (Guan Fu: Body and Soul). His work, which has been exhibited at the Museum of Modern Art in New York since 1972 and has been included in a number of other exhibitions, including the contemporary art-world biennial in Shanghai in 1992 and the Artistic Biennale in Beijing in 2001. Chen was convicted of crimes of genocide by the International Criminal Tribunal for the Former Yugoslavia (ICTY) in The Hague in 2005, but was never tried at the International Criminal Tribunal for the Former Yugoslavia.“The exhibition ‘Ateliers du Biennale” is a monument to the many talented artists that have shaped the history of art in China over the last seventy years and who are now celebrating their one hundred years of collaboration,” Chen said. Chen said that the Biennale organizers “tried to give a genuine expression to the essence of Chinese art,” a statement made in line with the new collective exhibition program established by the city of Beijing in 2018, in", "The next Biennial should take place in February 2021.\n\n\nCultural historian, author, and curator Cécile B. Evans has been appointed director of the São Paulo Bienal in Brazil. Evans will assume her role in March. “Enrique is a dedicated, talented, and dedicated manager, educator, and collector,” said Bienal director Hélio Oiticica. “He has been instrumental in developing the museum’s collection and has been an excellent leader. His intelligence, creativity, and commitment to curating and analyzing art and culture are valued by all who know him, and we are confident that his influence will continue to expand at the museum.”Evans has made a career of challenging the museum’s own assumptions about the history of Brazilian art and, through projects such as the São Paulo Film Museum and the CMF Nacional in São Paulo and a series of exhibitions at the São Paulo Art Museum. He also organized exhibitions of work by artists such as Rania Hafiz and Krzysztof Wodiczko in the United States and several international exhibitions at the Museu de Arte Contemporáneo de São Paulo", "The next Biennial should be held in 2021–18, with a goal of showcasing the work of female artists in the collection.The exhibition will also include a new biennial, “For All Things” (2019), dedicated to the female body. Its upcoming exhibition will feature works from the collection that examine bodily functions, such as childbirth, menstruation, childbirth, childbirth, childbirth, childbirth, childbirth, childbirth, childbirth, childbirth, childbirth, childbirth, childbirth, childbirth, childbirth, childbirth, childbirth, childbirth, childbirth, childbirth, childbirth, childbirth, childbirth, childbirth.\n\n\nThe Museum of Jewish Heritage (Museum Jumeiro) in Tokyo is currently working to reintegrate a collection of Jewish art, which was moved to a storage area for future exhibitions, into the institution and has raised nearly $100,000 in support of its efforts. The $200,000 grant, which was given by the Jumeiro Museum Development Committee, was made in order to raise capital for the initiative.“We are grateful for the support from the Jumeiro Museum Development Committee and the local community for their initiative to bring the collection to the Museum,” said Tadashi Nakamura, director of the museum. “In addition, we are", "The next Biennial should be held in the spring of 2020. The seventy-sixth will be held in the summer of 2020. The seventy-ninth will be held in the autumn of 2020. The eighty-eighth will be held in the autumn of 2021. The eighty-fifth will be held in the autumn of 2022.“We are hard at work preparing for the future and the exhibition of this year’s Collections will be an important step in showing how biennial exhibitions can continue to evolve and change in the twenty-first century,” said Thomas de Coudert, director of the Museum of Contemporary Art (MoCA) in New York.\n\n\nAfter Paris’s controversial reopening on March 22, the French Ministry of Culture and the city of Nice, which has been beset by delays due to Covid-19, are planning to reopen the city’s museums by June 30. The ministry estimates that the reopening of eight of the fourteen remaining museums will be complete by June 24.The ministry says that ninety-five percent of the fourteen institutions will be able to reopen by June 22, with the remaining ten percent of the city’s museums scheduled to remain closed through at least the end of June", "The next Biennial should take place in New York in the spring of 2021. The 2019 series was staged at the New Museum, where it received a double nomination for Best Exhibition and was nominated for an Emmy in the process. The exhibition, “Food, Pain, and the Body: Modern Art and the Body in a Contemporary Setting,” will be presented by the Museum of Fine Arts, Boston, in the spring of 2020.· The Manhattan Institute of Technology (MIT) has appointed Anna Ionescu as its new associate vice chancellor for artistic affairs. Ionescu joins the institute from the University of Arizona, where she has served as a graduate research scholar and a research scholar for the past two years. During her tenure, she has organized more than fifty exhibitions, including the first solo shows of work by artists such as Anita Andoni, Nari Ward, and Anna Atkins, and is working on a research paper on the role of art in the ongoing fight against fascism.“This is an incredible opportunity to collaborate with one of the most esteemed and respected museums in the United States and work with an institution that embodies the unique legacy of the Gabriella Beaux’s, the John and Lois Beaux’s, and the", "The next Biennial should be held in the spring of 2021. The theme will be the history of the art and culture in a globalised world. The curators will include people from the South Asian and African diaspora communities. “We extend a warm welcome to the artists who are part of the upcoming exhibition and the broader community,” the Biennials said in a joint statement.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles announced today that James Gornick will succeed Richard Serra as director of the institution, which represents the cultural heritage of the Central Valley in California, in December. Gornick comes to the museum from the Los Angeles County Museum of Art (LACMA), where he has served as interim director since April 2019. He succeeds Elissa Glass, who was hired as director of the Museum of Contemporary Art (MCA), New York, in May 2019.“James is a seasoned curator who has been instrumental in building the LACMA collection over the last twenty years, and who has demonstrated a deep understanding of the importance of design and its role in Los Angeles’s cultural and historical landscape,” said LACMA director Ann Reitman. “We�", "The next Biennial should be held in 2020 and the first Biennial in 2021. The new venue will house the museum’s collection from the first exhibition, “The Birth of a Nation,” in 2018. The museum hopes to open a new exhibition, “The Birth of a Nation,” in 2021. The institution also plans to open a new research center and an online library in the fall of 2020.The institution is currently accepting proposals for the 2020 edition of the Biennial. In addition to the curatorial team and the cataloguing team, the 2020 edition will include curators from the United States, Europe, South America, and Asia. The exhibition will also receive a new presentation of the work of British artist John Aldridge, a composition that will be shown in a new exhibition, “The Birth of an Empire,” at the Royal Academy of Arts in London next month. This is the third year the Biennial has hosted the title, “The Birth of an Empire” at the Royal Opera House. The other two editions, “The Rising and Fall of the Roman Empire” and “The Birth of a Nation,” were won by British artist Baroness Cuthbert Rinder and", "The next Biennial should take place in the spring of 2021. The exhibition will be “A World Apart” (2019). Smith also works as a curator at the Museum of Contemporary Art in London, where she curated “No Bread” (2015); “Struggle: Art in Transition” (2014); “Diane Arbus: The Body” (2013); and “Steve McCurry: Contemporary Art” (2012). A series of exhibitions is being organized in conjunction with the biennial.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles announced today that it has received a gift of thirty-nine works from the artist and collector Matthew Graham, who passed away in New York City on Sunday, January 6. The works, which were acquired between 1970 and 2012, include works by Andrea Bocelli, Joël, Seurat, and Plath, as well as works by Hieronymus Bosch, Fritz Lang, and Cooper-Hewitt, and were purchased as part of the ongoing project to release twenty-five works that date from the 1950s to the 1970s.The gift includes six paintings by Louis Vuitton, two prints by Pierre-Luc Godard, twelve", "The next Biennial should be presented by the Institut National de la Collection et de la Bière in Paris; in the City of Berlin; in the City of Leipzig, and in the City of St. Petersburg. Earlier this year, a group of artists and curators led by Rudolf Kugler received the Order of the Knights of the Black Cross in recognition of their contributions to the development of the arts.\n\n\nThe National Museum of Fine Arts (NMFA) in Atlanta has received a gift of more than five hundred works by Pittsburgh-based artist Mary A. Martin. The donation, which was made by Carol and Robert Davis in honor of their daughter, took place as the institution celebrated its fiftieth anniversary.“The gift is a remarkable testament to the legacy of the Davis Family,” said head curator Robert Davis. “Over the course of fifty years, the D’s work has been collected and exhibited by museums, universities, collectors, and other organizations; expanded to forty-six countries and territories and several continents; and has inspired lively and often provocative exhibitions. Through their vision and creativity, the D’s celebrated their daughter’s achievements as a Jewish artist and scholar and as a modernist", "The next Biennial should be held in 2021.  In an interview with the Los Angeles Times in March 2018, artist Jane Panetta, who designed the exhibition, said: “The city is looking towards the future, not the past. It is creating a new university here in the city, and is working on creating a new public realm here. It is thinking about how it can engage more people in its art and culture. And I think that is a very powerful thing, to see people excited about museums in the city.”The upcoming exhibition “The Great American Dream: Essays from the Art of Happiness,” “Ascension,” and “The Creature from the Black: A True Story” are among the works slated to be staged at the Museum of Modern Art. The Los Angeles County Museum of Art (LACMA), which is currently undergoing a $500 million expansion, is currently constructing a new museum complex that will be inaugurated by the artist Sergio Laplace, who is known for his “tactical” sculptures. The new museum complex will serve as the centerpiece of a $145 million expansion, completed in 2020, that will include the collection and exhibition space of the former Los Angeles", "The next Biennial should be held sometime in the first half of 2020.  The pavilion will be located in the city of Nairobi and will host a variety of programming, including exhibitions, readings, concerts, talks, classes, workshops, and other events.  The pavilion will be inaugurated by a presentation of the work of American artist Ike Barotta, who will then be presented with a lifetime achievement award. The selection committee will be chaired by the artist Nandini Prasad, and will consist of Marlene Tellington, Diana Berrio, Kiran Bhandari, Lina Bhandari, Nanna Brown, Oscar Pires, Arsht Juma, Rajdeep Sardesai, Nandan Naik, Miah Saundar, Kamalu Saundar, Kiran Tandon, Kasiya Shah, Bruce Tandon, Cindy Sherman, Nell-Ann Shaughnessy, and Naima Saar. The 2019 edition of the Biennial, “Animal,” was held at the Bologna Art Museum", "The next Biennial should focus on how the world operates with and within the constraints of an anthropological and evolutionary standpoint. “Over the course of the twentieth century, the biennial has reflected the remarkable transformations and transformations of contemporary life,” said Evelyn de Rothschild, president of the Biennale de Lyon and a trustee of the biennial. According to the documentary-researcher, the biennial has also expanded its vision and mission to reflect the needs of the times. The 2020 edition will focus on the new global circumstances and the values that underpin them. The Biennale de Lyon team will present the exhibition on October 23.\n\n\nThe Brooklyn-based artist, activist, and educator Max Westphal—whose seminal twenty-five-foot-wide, forty-one-ton, eighteen-foot-tall, steel sculpture, The Factory, was built to represent New York City and the city as a whole—has died at age eighty-eight.Born in Brooklyn in 1940, Westphal studied at the City College of New York, the University of Pennsylvania, and the New School, and grew up in a Catholic family in Queens. By the 1980s, he had relocated to Los Angeles, where he met and married screenwriter", "The next Biennial should be in 2022.\n\n\nThe National Museum of Scotland is planning to reduce the size of its building as much as twenty-five years before it reopens in 2020. Despite the institution’s efforts to reduce its footprint, it is still planning to add more than thirty thousand square feet of new space to its existing Exhibition and Library.According to The Guardian, the move will have a dramatic impact on the institution’s collection and its collection of art. The institution will lose an estimated $2 million annually because of the decision.“The museum is taking this step as a consequence of a number of considerations, including the deterioration of the gallery as it enters its fiftieth year and the likelihood that the opening of the biennial, ‘An Incomplete History,’ would be delayed,” director Joanna Cherry told the British newspaper. “The exhibition has led to the creation of more than twenty-five years of collections and collection-wide exhibitions. This will enable us to build on the exhibition’s success, even more so when it reopens, and to explore the future with the exhibition within the same building as the biennial.”The announcement coincides with the opening of “Civiliz", "The next Biennial should open in 2022 and will host ten artists, including Mali-born, US$1.5 million (US$2.2 million) artist Frank Gehry, who is currently constructing the new National Museum of African Art in Cairo, Egypt, and winner of the 2019 Aditya Birla Prize. The exhibition will open in 2023. \n\n\nAn exhibition of work by fourteen new artists has been announced at the Venice Biennale. Titled “Beyond the Vast,” the exhibition will debut at the Venice Architecture Biennale in 2019 and will be organized by the San Francisco–based nonprofit organization Animal+Art, with assistance from New York’s Museum of Modern Art and London’s Tate Britain. The exhibition will be held in the Odeon di Veneto, Italy, and will run for twenty-four weeks.Each week, the artists will be given an experimental space to experiment with new materials and new technologies, sparking conversations about the possibility of new technological frameworks in the future. A selection of future projects will also be presented, including an immersive virtual reality installation and a three-dimensional sculpture by the Italian artist Paolo Savoldi.“We are thrilled", "The next Biennial should be held in 2021, when the biennial will be twenty years old. For its 20th anniversary, the biennial will restore and rework the building, which is on the ground floor of a metallic construction and will undergo a major facelift. In addition, the biennial will focus on modern and contemporary art, including new works by underrecognized and newly established artists. Inaugurating the theme will be a new book, “The Art of Biennial,” written by senior curator Michelangelo Nanni, and a selection of the biennial’s artists. The exhibition will also explore the 'art-historical' relationship between art and technology, examine humanistic and technocratic practices, and present new works by the legendary artist Bauhaus.The artists who will be represented at the biennial are:Adam Andrés - Julián AndrésDia Bassetti - Fabienne BaptisteMing-Yan Chen - Jean-Luc DanzigFranck Dana-Bouwmeester - Jean-Michel FoucaultFreddy Adams - Robert AdamsFreddy Adams, Jr. - Robert Adams, Jr.Ferdinand A.M. P", "The next Biennial should be held within the year, but its director, Peter Dijs, told the Art Newspaper that the date is still dependent on the developments in the region.He said: “We must wait until the climate stabilizes. But in the meantime, we must continue to experiment and experiment with new materials and new technologies. We must always be willing to change as a society, and our work must always be open to the public’s participation.”\n\n\nThe Los Angeles County Museum of Art (LACC) has received a gift from the Sherman Foundation, the charitable organization that provides financial assistance to arts organizations in Los Angeles, for its 2020 season. The gift is $6 million.The foundation established the foundation in 1987 to support free runs and artists performing in Los Angeles. In 2017, the foundation donated $3 million to the LACMA Arts Initiative, which expanded the mission of the Sherman Foundation to include more direct financial support to artists. Since then, the foundation has announced it will award $1 million each year to ten artists, including Gabriel Garcia, Alessandro Cicutto, and Rob Thomas.The gift comes a little over a year after the foundation committed to supporting the creation of a free biennial of contemporary art", "The next Biennial should focus on the history of contemporary art and how it is reflected in the cultural landscape of the island and around the world. The next is a celebration of the contributions of artists and institutions from Indonesia. The third is an archival survey of contemporary art from the island of Java, and the fourth and final is a survey of contemporary art and its relationship to contemporary human history. The architects are planning to build a new, 7,800-square-foot museum that will feature a special section dedicated to the history of the modern Indonesian diaspora in the form of a series of interiors and landscapes. The project is part of the development of the museum, the largest arts project in Indonesia, in collaboration with the National Art Museum Indonesia (SAM).\n\n\nThe Tae Kwon Do Foundation in Seoul announced today that it has received $1.2 million from the Korean government in support of its efforts to promote the ancient art form in Korea, as well as the Balik Busan Biennial in Korea, and will bring them together in one exhibition. The partnership between the two institutions follows the launch of the Tae Kwon Do Foundation Art and Art and Culture in Korea (Kun Arts) and Kun Balik Busan", "The next Biennial should open in 2021, and will raise funds and awareness for the biennial’s 2019 edition at the site of the former US government building in downtown Los Angeles. The 2019 event will also see the return of the biennial’s original venue, the Jane Sender Institute for Advanced Study in the Arts, as the venue will be transformed into an open-air museum dedicated to the creative life in Los Angeles.The art-world giant Davis Polk, which has provided funds for the biennial since the inaugural edition was staged in 2003, will also be renovated and sold by the firm to a consortium of French and German investors. The project, dubbed 'Art in Transition', will involve the rearrangement of the city’s main exhibition halls, with the aim of reopening the institution to the public. Among the works slated for the renovation are the Swedish artist Arne Glimcher’s massive multi-million-dollar installation Apocalypse Now: The Biennial in Pictures, which details the daily life of Glimcher’s nomadic group of friends in the small town of Lübeck, Germany, in the year 2000, and a live performance by Beethoven’s symphony in the", "The next Biennial should be held in the coming months. \n\n\n\n\n\nHannah Black, 'The Age of Innocence: The Untold Story,” 2018, at the W. M. Kehrer Museum, Germany. Courtesy of the artist and Lisson Gallery.\n\n\nLinda Hoffman, whose legendary practice explored the concept of blackness as a gestalt in art and politics, has died at age eighty-eight.The artist is best known for her Cooper-Hewitt-Sargent paintings, which often center a contemporary black woman in her work, such as in “Annie Hall: Annie Hall,” 1974, in which the artist played the role of the protagonist and was the wife of Huey Copeland, a Lebanese-born, Marine veteran of the Vietnam War.Her paintings are on view in the first exhibition devoted to her work at the MCA in Los Angeles, which is slated to open in the spring of 2021. “The Age of Innocence” will return to the museum next spring, alongside “Huey Copeland: The Age of Innocence” (2019), “The Fall of Man,” (2019), and", "The next Biennial should be held in the summer of 2020. The exhibition will consist of a selection of works by thirty-three artists and will be organized in three symposia, each with a different theme; an adaptation of the themes from the Biennial; and a performance.The Biennial was organized under the direction of the director of the Kölnischer Kunstverein, Bernd and Reiner C. Fischer, and the architect of the Visalino multi-purpose tower, Ulrich Hirsch, and is funded by the Kölnischer Kunstverein, the Künstlerischer Kunstverein, and the Rauch-Künstlerischer Kunstverein.\n\n\nIn an attempt to speed the return of several hundred artworks confiscated by the Nazis and communists, the German government has announced that it will lift the temporary closure imposed by the country’s Federal Constitutional Court in an attempt to prevent the reopening of the concentration camp at Auschwitz, the former death chamber at the Auschwitz Concentration Camp, in the summer of 2021.The move is part of a campaign launched by Chancellor Angela Merkel, who has vowed to push for a full restitution bill in the wake of Germany’s", "The next Biennial should have been held in 2021, but the organizers were forced to pull the event because of the Covid-19 pandemic. The second exhibition will be held at the Autex Forum in Los Angeles in 2022, and the third at the Autronome in New York in 2021. The fourteenth and fifteenth editions of the Ladies’ Show will take place in New York and New Orleans in 2022, and the sixth and seventh editions in New York and Los Angeles in 2021. The 2019 edition was held at the Autronome, and the 2019 edition was titled “The Age of Devotion.” The 2019 edition was curated by Laura Mulvey, and the 2019 edition was presented by Laura Mulvey, in partnership with the Walt Disney Company. “We are thrilled to present the next editions of the Ladies’ Show at the Autronome in 2020,” said Bob Berlant, chair of the board of trustees of the New York–based Ladies’ Show Foundation. The 2019 edition of the show, titled “The Age of Devotion,” was curated by Joseph Barrett, actor, comedian, and author, and the 2020 edition will be presented", "The next Biennial should be held in 2021, and the winners of the past two editions will be announced in 2020.\n\n\nThe estate of Marcel Proust, the French painter and world­-renowned polymath whose works are often linked to issues such as memory and memory-making, has released a statement on the artist’s legacy. In a statement published by the French daily Le Figaro, the estate said that the partnership with Flemish art historian Hagie Masekela, who died in 1976, was an “emblem of the partnership that lasted until 1983. Prudence and vision combined to create the future through art. Now, in this century, this legacy continues to shape the art of tomorrow.”While the museum has yet to send a letter to the artist’s heirs, the statement does note the exhibition’s support of the institution for it’s new partnership with Spanish research and institution, the Instituto de Cultura Pinera (ICP), which will continue with its current programming. The partnership, which is part of Flemish government’s plans to reduce the size of the museum, was announced at a ceremony last month. The project will also involve the construction of", "The next Biennial should focus on “The politics of pain in art” to examine painters and painters only; it would not undertake a retrospective of the artist's work. In response to the Biennial, the Artists’ Association of New York City said: “We recognize that this is a challenging time for the art world. We want the art of today to reflect on the future and the future of art. We want reality to be at the core of the art of tomorrow.”The upcoming exhibition “Painting Today: Painting & Painting” is curated by Deborah Callahan, who is currently on assignment in London from the Museum of Modern Art. Titled “Painting Today: Painting & Painting” (2017), the exhibition will take up the themes of painters today and tomorrow. The exhibition will include forty paintings from the collection of the Museum of Modern Art and will run from November 4 to November 8, 2021.“Painting today: painting & painting” is a celebration of the eighty-six paintings of the late artist Meryl Streep, including her work “The Sirens of Titan.” The show will also feature twenty photographs by the late Martha Graham. The artists will be", "The next Biennial should be held in the spring of 2021.\n\n\nThe Metropolitan Museum of Art in New York has agreed to donate $2.5 million to the Smithsonian American Art Museum (SAAM) in Washington, DC, after the institution received a gift of $2.35 million from the late billionaire industrialist and philanthropist Robert Moses. Moses also gave $1 million to the museum in 1976, and in 1989, and was the recipient of a $5 million check in 2001. The check was made in memory of his wife, Linda, who passed away from cancer in 2003.“Robert Moses’s legacy is one of the great American industrialists,” said Elizabeth Alexander, the board president of the Robert Moses Foundation. “Over the last four decades, we have been working to secure a future for the museum at a critical juncture: the museum’s opening in 2020 and the Smithsonian’s reopening in 2021. The Met has always maintained that the renovation would be affordable, that the renovation would be transformative and that the renovation would be a success. The museum is now poised for a renaissance.” Alexander added that the museum has had discussions about the grant before and that the museum has always taken the donor", "The next Biennial should include a selection of the work of the past twelve months, with the goal of identifying the topics which provide the most opportunities for visual art. Future iterations of the exhibition should take place in the same locations and on the same dates as the current exhibition.The inaugural exhibition, “The Possessed,” was curated by Maria de los Santos and Mauricio Solares, and took place at the Instituto de Cultura Visual, Cordoba (in Spain) from February 27 to March 14, 2019. The exhibition, which was curated by Harry Harpham in collaboration with Joao Barbosa in partnership with the Museum of Modern Art, New York, was inaugurated by a selection of biennial works by the retrospective’s inaugural winners: Simone Leigh, Valerie Lute, and Thomas Krens.\n\n\nNew York City’s Central Park is planning to offer $10 million in grants to artists and small arts institutions to help them mitigate the health risks and environmental damage caused by the ongoing construction of the massive new $5 billion Central Park line, including the construction of new infrastructure, the expansion of existing structures, and the construction of new visitor attractions.The Parks and Cultural Foundation (Pace), which is dedicated to", "The next Biennial should be held in 2022. \n  Artforum is a participant in the Amazon Services LLC Associates Program. E-mail: editor@artforum.com<|endoftext|>The Contemporary Chinese Painting Workshop (CCWM) in Beijing is preparing to reopen to the public this weekend with a new exhibition, “Art in the City,” as part of the Beijing Art Week. The exhibition will highlight the work of thirty-five Chinese artists with the theme “The City.” The exhibition will run until April 5.Announced by the state-run Beijing Art Museum, the exhibition will focus on the lives and work of the artists whose works were selected by a committee comprising Wang Jianxia, the director of the Beijing Art Museum; Wang Yan, a curator at the Beijing Art Museum; and two collectors, Wang Jianxin and Wang Yanzhong, and will feature thirty-five works by forty-six China-based artists. The show will be organized as follows:  \n\nAs the number of cases of the novel coronavirus continues to increase, the number of countries where the novel coronavirus has been confirmed has also risen. In a new report from the World Health Organization (WHO), the number of countries", "The next Biennial should be held sometime between March and May 2021. Year of the Rooster, a new exhibition of work by thirty-seven international artists, will be inaugurated by the pavilion in September 2021.\n\n\nThe Hirshhorn Museum in Washington, DC, has appointed Mihai J. Sze as its new associate curator of Asian art. He succeeds Richard F. Spielman, who departed in the summer of 2021 to become the Cecil Museum of Art in London.“Mihai Sze’s approach to contemporary art is grounded in a thoughtful understanding of the major shifts that have taken place in art and design over the last twenty years, and in a deep appreciation of the ways that art and design are interwoven and interwoven with art and anthropology, with cultural history, with aesthetic philosophy, with the human condition, and with the visual arts,” said director Mary Anne Carter. Sze will be responsible for cultivating and overseeing the Hirshhorn’s ongoing interest in the works of the Hirshhorn’s Asian artist-in-residence, the Taiwanese artist Ai Weiwei, and the Japanese artist Katsumi Matsuda. He will assume his post on March 7.Commenting", "The next Biennial should take place in 2020.\n\n\nThe Museum of Modern Art (MoMA) in New York is negotiating to sell off the two remaining pieces of its collection, including a sculptor’s first three-dimensional work, the critically acclaimed `Digital Life,� which was created in 1968 in the offices of Italian architect Gio Ponti, for $1.4 million, according to Artnet, and a work by longtime MoMA curator John Colangelo.The institution has been negotiating for months with high-salaried buyers, including the estate of Leonardo’s son and namesake, Giacomo Bonaventure, and the heirs of the late American designer and businessman Richard Edwards. The families in November 2019 and January 2020 approached MoMA with the offer of the original works and their heirs’ agreement to the sale of the pieces, which would be transferred into the trust of Richard and Laura Edwards, who founded the firm Edwards Florist, who are both deceased.The family’s lawyer, Jeffrey Rosenfeld, told the Art Newspaper that the estate was confident that the sale would be completed by the end of the month. “They were clear and forthright in their evaluation of the asset and the estate’", "The next Biennial should be held at a location that is in close proximity to the exhibition space; ideally, it should be on-site. The year 2020 will also be a momentous year for the art world as it will mark the centenary of the birth of the German revolutionary Karl Liebenbrügger. The exhibition will be organized according to a structure that will be responsive to the local community and will be divided into aural and visual art.  The new site also aims to reflect the history of the exhibition, which has been staged at the museum since 1993. The new exhibition will be organized as a hybrid between biennial and exhibition. The biennial will be a combination of three sections, one of which will be a full-length exhibition and the other two will be stand-alone presentations. The first section, “Germany and art”\u0097the biennial will be a direct continuation of the exhibition, with the final exhibition at the new museum in the year 2020\u0097will open in April 2021. The second section, “Germany and art in the twentieth century’s twentieth century,” will open in September 2022. The third section, “Germany and art in the twenty-first century,” will", "The next Biennial should be held in 2021. The theme for the twenty-seventh edition is “Ideology and the Making of Modern Life” and will be “epic,” with over one hundred works. The next Biennial will be held in the city of Marrakech in Morocco in 2021. Mali’s Minister of Culture, Hassan Ramadane, confirmed the project, which was conceived in collaboration with Mali Studies, a multidisciplinary arts organization, and the Museum of Modern Art in Boston, in an interview with Artforum in 2017.“This is an unprecedented event,” said N'Djamena. “It is the manifestation of new and generative talent, and to have an exhibition that reflects this talent in such a way that is uniquely ours is a dream come true.”The exhibition will take up the themes of the twentieth century, the biennial’s theme, “Ideology and the Making of Modern Life,” and the exhibition’s inception. The exhibition will be inaugurated by a survey of the twenty-first-century artists and will feature work by forty-five artists, including Nilekka Al", "The next Biennial should be held in 2022, according to the organizers.The next show will be the first showing of Yagoda, a contemporary Japanese painting whose work embodies the movement and vitality of Tokyo. The exhibition, titled Yagoda*, will be curated by Kenichiro Naito, who has worked as a curator, architect, and writer in Japan and abroad. The exhibition will be held in the Tokyo Art Museum, which closed in March 2019, and will run from February 23 to March 27. Naito’s first show in the United States was a show of work by artist Hideo Takemoto in 2006. The artist was invited to present a workshop at the Biennale of Sydney in 2009, but declined.Naito’s second show in the United States was at the Los Angeles County Museum of Art (LACMA) in 2003. The show, titled Yagoda, was organized by Nippon Ichi Gallery and opened in 2004. The first show in Japan was held at the Metropolitan Museum of Art in the United States in 2011.\n\n\nThis week, the US Senate unanimously approved a $2 trillion federal stimulus package that will invest in the economy by tackling long-standing threats like unemployment", "The next Biennial should take place in November 2021, and the event’s theme, “The Struggle for the Future,” will remain the same. The specific site for the theme event is still being decided. As this is the first Diwa-themed exhibition in South Korea, the event’s opening ceremony will be held on November 18, and the opening party will be held on November 19.\n\n\nThe Denver Art Museum (DART) announced today that it will receive $2.25 million from the John S. and James L. Knight Foundation in support of its efforts to attract and retain high-quality, mobile-based art and culture. The e-commerce giant launched a new initiative, the Mobile Innovation Connection, last month and aims to help mobile arts organizations by connecting them to local, regional, and federal grant monies and to offer free in-person support for artists. “Mobile culture is becoming ever more important to our communities, and we are committed to supporting the critical infrastructure needed to support the diverse artistic and cultural needs of our communities,” said Museum Director David Para. “The foundation’s grant program will allow us to work together with local, regional, and", "The next Biennial should focus on the Australian story\u0097what it means to be an Australian. We will launch with a discussion of Australia’s place in the world.”The 2020 edition will focus on the history of the city of Hobart, which recently celebrated its sixtieth anniversary, and will feature a selection of works by fifty-two Australian artists and collectors\u0097including Ann-Marie Posen, Louise Bridgeman, Susan Greenfield, and Marks and Spencer.The exhibition will be organized as follows:Artists Willoughby, Andrew Willoughby, Charles Willoughby, Richard Willoughby, Kathandra Porteous, Gerald Willoughby, and Julia WilloughbyArtists who have been nominated for the 2020 prize include Lucey Mair, Daria Zegher, Lisa-Marie Tung, Mikee Whitson, and Elizabeth Wilson. The twenty-three-person jury comprised Julie Biggers, Arash Jumaa, and David Wallace, and will select the twenty-one-person winner. The winner will be announced in May.\n\n\nThe Manchester Art Gallery (MAG) announced today that Alex Farquharson, director and CEO of the New York–based nonprofit", "The next Biennial should be held in the first half of the year. This year’s event will be curated by Dr. Wolfgang C. Ludwig, director of the Kunsthalle Basel and the Kunsthalle Bern.  The biennial will be held in the city of Basel from March 19 to March 21, 2020. The full list of participating artists is as follows:\n\n\nMoët Hennessy, who died last year at age seventy-eight, was not a feminist iconographer or a theorist of feminist politics or a theorist of deconstructive rhetoric, but an extraordinary linguist and translator who was a tireless champion of the art of artmaking, the art of film, cinema music, and art from the seventeenth century onwards.Born in Saarland, Germany, in 1937, Hennessy studied at the Academy of Fine Arts in Vienna and at the School of the Art Institute of Chicago before earning her Ph.D. at the Academy of Fine Arts in Vienna in 1948. In 1949, she married painter Reinhold Wegmann, with whom she had two sons. Hennessy moved to New York in 1951 and, in the immediate aftermath of the war, found herself immersed in the city", "The next Biennial should take place in the year 2021. Michael G. Musgrave, chair of the department of art history at Kings College London, said: “It is decades since any artist has achieved monumental stature; it is just sixty years since ArtPrize awarded the prize to the Chinese artist Jing Tianfu. To be able to sponsor such a talented artist and to create such a compelling exhibition is the most amazing thing. It is the most exciting project for me personally, and the most challenging project for the Dream Theater. ”\n\n\nThe Laundromat Project, an ambitious contemporary art project in the Bedfordshire village of Tamworth, England, has announced that it will donate its remaining artworks by British artist Gerald K. Butler to the Tate. Butler, a British Tamil American born in 1940, created his famous clay sculptures in the 1950s in a village in the English countryside, Tamworth, England. The Tate, which was founded by the British Indian artist R. M. Walsall and his wife, Jane, in 1988, plans to display all 128 of the artist’s works in the museum’s London outpost, the Tate Modern, in twenty years.“Gerald K. Butler is a remarkable", "The next Biennial should be staged in the spring of 2020. The fifty-ninth will take place between August 27 and September 21, 2020. Kunsthalle Basel, Switzerland, will also be hosting a biennial in May 2020. In an interview with Artforum in April, Kunsthalle Basel president Christian Uwe Wirth said that the institution had no plans to cancel the 2020 edition. The decision may have been made after the exhibitors complained about the exhibition’s cancellation in a letter sent to the organisers by exhibitors from the Netherlands, Belgium, and Italy. Two hundred and thirty-seven exhibitors signed the letter.\n\n\nThe Museum of Fine Arts (MFA) in Boston and the Brooklyn Museum in New York announced today that they will jointly present their first collaborative shows exploring the work of American and African American artists in the United States in 2021 and 2021, respectively. The six-month productions will include the work of forty-eight artists, including the Harlem Renaissance artist Frank Newcomb, the Chicago-born Haitian American artist Luis Alonzo, and the Black African American artist James A. Porter.“We are thrilled that the twenty-second edition of the MFA/Brooklyn Museum’s", "The next Biennial should be held in 2022. Goldsmiths, University of London, and the Victorian Institute for Art, London, have announced plans to organize the first exhibition based on the next steps in human development, Art and Gender, but at a later date. \n\n\nThe Metropolitan Museum of Art has appointed Keith Johnson, who served as the museum’s director of contemporary art from 2003 to 2011, as its next chief curator. Johnson succeeds Carolyn Campbell-Stevens, who has served as director of the museum for the last two decades, and will take up the post in January 2020.“Keith brings a wealth of years of experience from the museum curating for contemporary art, and has been instrumental in making the Met one of the most vibrant and esteemed contemporary art institutions in the world,” said Michael Govan, chair of the board of trustees. “Keith is a gifted curator whose career spans more than twenty-five years and is committed to the museum’s mission to be the premier contemporary art destination in London.”In addition to his curating duties, Johnson will serve as the chief curator of the museum’s inaugural exhibition “Howl,” which will open in February 2020 and run", "The next Biennial should take place in 2020.  Videos of the exhibition can be seen below: The Art of Dreaming, Asa Newton-US, 2018With a Foreword by William S. Burroughs. The Art of Containment, W. E. B. Du Bois, 2019This exhibition is accompanied by two movies, The Dreamer and the Dreaming, both of which were made in 1947.  MIDWESTSCHOOLS, 1958Eleanor Sutch\u0097who converted to Judaism in 1967\u0097was one of the first artists to use the term “Dreaming” to describe the relationship between the artist and the material world. Her carefully curated program of numerous exhibitions between 1958 and 1963 included André Althuis, The Dreamer and the Dreaming: Avant-Garde Art, 1958; Dreams of the Living, 1958; Dreams of the Dead, 1962; Dreams of the Life-Forms, 1927. More artworks and films are listed here: Dreams of the Living, 1962 Dreams of the Living, 1958, The Dreaming: Avant-Garde Art, ", "The next Biennial should take place in 2019. After the completion of this exhibition, the pavilion will be placed in a private collection in a museum and will be reopened for free public tours by the public in 2020. Since the exhibition was founded in 1974, the Biennial has been inspired by themes such as ecology, history, philosophy, art, and architecture. \n\n\nThe National Gallery in London is planning to create more than 1,500 new jobs for artists who work remotely. The program is part of a £1 billion strategy to reimagine how art and design can be made more accessible and affordable for everyone.Launched in March 2019, the National Art Workshop (NAW) will offer fellowships, teach online classes, and collaborate with other grassroots organizations to create a new kind of residency program that will support artistic practice from anywhere in the UK. The first cohort of twenty-three fellowships will launch this fall, with the rest to commence next March. The program, which aims to diversify the National Gallery’s academic and curatorial worldwide, was inspired by the National Book Week, which celebrates the book-reading habits of millions of people in the UK. During the week, the full range of exhibitions and programming will be", "The next Biennial should take place in 2023.\n\nThe new exhibition, “Art and the Body,” will open in the Switzerland–based Biennale center in March. The retrospective will feature the work of more than 600 artists. The first issue will be based on the exhibition “Art and the Body,” which will explore the relationship between art and the body and how art can modify our physical and psychological states. The second issue will be a “Cosmic Game,” a treatment by the Swiss-based artist and philosopher Hermann Görg to the contemporary art of the Enlightenment, which will explore the metaphysical, the biological and the material in order to re-create the physical body. The third and final issue, an “open letter from God,” will be published in July. The opening for the exhibition was set for March 19–March 21, 2020.\n\n\nArt in America, an initiative of the Museum of Modern Art (MoMA) in New York, announced today that it is expanding its curatorial program beyond high-profile exhibitions and commemorative events and will launch an online exhibition biennale in September 2020. The first online show will focus on the work of artists in five cities", "The next Biennial should be held in Spring 2019. \n\n\nThe Royal Academy of Arts (RA) in London has commissioned artist-run site-specific works by Norwegian artist Anders Fries to commemorate the centenary of the Battle of Britain. The commission was made in memory of the Norwegian artist who was captured by the British Army in Coventry in 1942 and died in captivity in England in 1945.Fries was chosen to create “Resurrection,” a large, open-concept installation which takes the form of a Viking funeral pyre and comprises more than five thousand individually painted pieces by Fries. In the performance piece, which will be staged on the grounds of the academy in May 2020, Fries documents his captivity and travels to different parts of the United Kingdom to collect his personal remains. Fries’s work will be mounted in a large stone sarcophagus.Fries’s work will then be transported to Harlow Studios, where it will be assembled into an exhibition of new works by Fries’s contemporaries, including Ed Smith, Barbara Polson, and Hildegarde Duane. Entitled “Return,” the show will then return to London for a series of performances and residencies. The", "The next Biennial should be held in 2020. \n\n\nThe Museum of Contemporary Art (MoCA) has appointed Sara Mulvey, who has served as the museum’s director since 2014, as its next executive director. Mulvey joins MoCA from the Los Angeles County Museum of Art (LACMA), where she has served as acting director since 2015. She succeeds Edsel Ford, who retired in August 2021 after serving as the museum’s executive director for four years.“This is a tremendously important year for museums,” Ford said. “Sara’s outstanding leadership, commitment to curating, and accountability for our exhibitions, programs, and collections gives us the opportunity to develop new, exciting, and compelling ways to give back to the community, and she will continue to evolve MoCA’s mission and collection as a center for contemporary art.”A curator, writer, and educator, Mulvey curates the award-winning exhibition “Opulent Diaries,” which explores the role of art in shaping the contemporary world. The show, which travels to the Los Angeles County Museum of Art, the San Francisco Museum of Art, and the Metropolitan Museum of Art, is modeled after the California", "The next Biennial should have been the first of the series, which will be held in November 2019. Art historian Carlos Barrios, in an open letter to the organizers of the 2019 edition of the biennial, said that the old structural logic of the exhibition “has been eliminated in an unprecedented manner. The future of the event is now more uncertain than ever: what will replace it? The biennial has been entrusted with the new responsibility of reinterpreting the history of art in order to extend the horizon of contemporary art.”The letter concludes: “Art is not dead—it is living and it will continue to be so for another twenty years to come. We ask that you ensure that this year’s Biennial of Modern Art, which has been so successful in bringing together contemporary and historical art, be preserved and protected in perpetuity.”As the letter points out, the new exhibition format will be “even more challenging.” This may be one of the few times in the biennial’s history when it will be held in such a large venue. The newly appointed director of the museum, Andreas Lüpertz, said: “We have been working towards the exhibition format for", "The next Biennial should inaugurate in 2021. The show will offer a hands-on experience with the machines and will feature performances, performances, performances, selection exhibitions, interviews, and other programming. The first exhibition, “Mines,” was organized by the same artists and will be held at the Biennial Exhibition Centre, the Museum of Contemporary Art, Tokyo. It will also be presented as a part of the Tokyo Biennale, which will be held from December 13 to December 16. The second exhibition, “Programmes,” will be presented by the same artist appearing in the exhibition, and will be curated by Nanami Takahashi. The program will also be organized by the same artist and will include solo presentations of work by different artists. The exhibition will be divided into two parts: “Programs and Objects” and “Mining,” and the 2019 exhibition will be the last. “Time is not a Machine,” will be the theme of the biennial and will be held at the Museum of Contemporary Art Tokyo. The exhibition will be on view from January 19 to February 24, 2020 and will run until March 24, 2020. The Museum", "The next Biennial should be held at the newly constructed Arts and Culture Museum at the University of Oxford, on the campus of the University of Oxford. The event will be staged at a time when the museum has historically been at the forefront of cultural engagement and in a time when the city’s museums are being revitalised and re-imagined to reflect the city’s diverse histories.The Exhibitionist and the Baroque, Biennial 1838–62, will take place in the Arts and Culture Museum, in partnership with the University of Kent, on the city’s campus from February 21 to March 23. Its theme “Languages and Worlds” will concern itself with language and the meaning of objects, while exhibition and reception programming will include presentations of work by David Adjay, 2008, on the history of photography, 2008, on photography and art, and 2008, on photography and life.“This year’s exhibition is about to begin, and I want it to be a moment of discovery and an invitation to think,” said Smith. “The Art of Place, ‘Cultural Violence: art and the institutional,’ will present a catalogue of the work of the Bi", "The next Biennial should take place in 2021. The next edition of the Berlin Biennale will be hosted by the Berlin Art Museum (BAM) in 2021.Due to the current global crisis, the new date of the Berlin Biennale is March 22–April 2, 2021. The 2019 edition, which was staged in June, was scheduled to kick off in March. One hundred and thirty-three museums and 265 artists are participating in the biennial. The event will take place at Berlin’s former Steakhouse, the Berlin Bourse, the Brandenburg Gate, and the Reichstag in Berlin. The first part of the biennial, entitled “The Future Is Present,” will focus on how art and technology are reshaping human realities and will feature the work of artists, collectors, architects, scientists, and musicians. The second part, entitled “Art and Technology in Design,” will focus on how art and design are reshaping the human experience and will feature the work of artists, designers, architects, and scientists. The 2019 edition of the biennial, titled “Polarities,” featured work by twenty-three artists and designers, including Katja Eriksson,", "The next Biennial should be held at the Pavilion, which was built in 1899 to house the Spanish Embassy in Paris, in 2021. The exhibition will be inaugurated by a presentation of the exhibition, “The Future is Not What It Used To Be,” at the Pavilion. It will then move to the new venue, the Centre Pompidou, in Paris, where it will be hosted by the Centre Pompidou, until at least the end of the century. “‘The Future Is Not What It Used To Be’ is a monumental statement about the future of art and, in the process, about the future of humanity,” said Farah Al Qasimi, director of the Centre Pompidou. “The next Biennial will take the question of art and artifice to the fore in a truly unprecedented way. It will involve the greatest fusion of visual and physical art and art history as the most significant and contemporary exhibition of its kind. It will explore the way art and art can shape our lives and touch the most intimate moments of our lives.”The 2018 exhibition “NIRIN” opened at the National Museum of Fine Arts, Chennai. The exhibition, which was", "The next Biennial should be held in 2020.  The 2019 event, entitled “The Plastic Garden,” was staged by David Salle at the Museum of Modern Art. Salle and his team are currently working to balance the museum’s collection of contemporary art without compromising the museum’s relationship with the artist communities.\n\n\nThe Metropolitan Museum of Art in New York has announced that it is planning to open a new, modern-day museum intended to serve as a platform for artists. Called the Artist Palaces, the museum will be located in the former musical theater building at 7 East Twenty-Third Street and will host thirty-six artist-in-residence events. The new museum will boast contemporary art exhibitions, a wide range of educational programming, and large-scale installations and installations projects that draw on themes of history, social justice, and spirituality.“The artist community’s capacity to connect and inspire one another and the world we live in makes us all uniquely capable of bringing about the future,” said Thomas Mark, the director and CEO of the Met. “We are committed to listening to our artists, exploring the possibilities for ways to engage with this world in which they live, and", "The next Biennial should take place in the spring of 2020. The artist-run event will comprise a selection of works by twenty-five artists, including Andrew Kreps, Anna Atkins, Mikhail Baryshnikov, and David H. Maeda, and will involve visitors to the exhibition taking part in interactive experiences. \n\n\nThe Metropolitan Museum of Art in New York has appointed the Whitney Museum of American Art as the next patron of the biennial series art-for-art. Beginning in 2021, the institution will present new works by artists including Domenick Enrico Ginni, Emma Lazarus, and Wolfgang Paalen, with the first show, “The Ghost of a Future Past,” taking place at the Whitney Museum of American Art in 2020. The exhibition will feature twenty-five works by forty-six artists, including Charles Atkins, Yoko Ono,  Nari Ward, and John Almas.“The Met has long been a leading force in the field of contemporary art,” said Christopher Knight, the Met’s senior director of contemporary art. “We are honored to be able to celebrate its legacy by participating in the second edition of Artforum’s Art"]