["The next Biennial should focus on the post-Cold War era and the contemporary Russian-American relationship, and should involve a re-investigation of the biennial’s past. In the meantime, the exhibition should focus on the history of art as a whole, including its relationship to contemporary life, and should incorporate a diversity of sources and use different materials.”\n\n\nThe Metropolitan Museum of Art (the Met) and the Smithsonian American Art Museum (SAAM) in Washington, DC, have reached a settlement with the heirs of a wealthy collector who was the first to sell works by American artists such as Thomas Jane, Graham Edwards, and Louise Bourgeois. The heirs of William Paley, a New York financier who amassed a vast collection of works by artists such as Robert Irwin, César Karaszewski, Manuel Álvarez Arruda, and Julian Schnabel, have also agreed to refund the $53 million they paid to establish the collection in the first place.The heirs of Edward Niles, who ran a textile business in New York in the 1930s and ’40s and amassed a $35 million fortune, have been demanding that the Met and the Smithsonian compensate them for any future losses because of the", "The next Biennial should take place in 2020. The 2019 show was packed with works by forty-two artists, including Anton Kern, Anna-Sophie David, Katherine Pope, and Julia Salter. \n\n\nThe Santa Monica Museum of Art (SMA) in California announced today that it is planning to remove a ten-foot-tall bronze sculpture of the Virgin Mary that was commissioned by artist Don Suggs in the 1960s and has sat in the museum since 1975. The work—a bronze sculpture of the Virgin Mary kneeling before a cross—was added to the museum in 2005 and reworked several times since then, becoming one of the artists’ major works.In an interview with the New York Times, SMA director David Chiu said the museum will not replace the sculpture but will use it as an “event of national significance.” He added that the institution has tried to 'use the cross’s impact on Christian culture to encourage a deeper appreciation of Christianity and the centrality of the Church in American life.“In the twenty-first century, artists have changed the face of the museum as we know it, and it’s important that the former SMA building", "The next Biennial should focus on the concept of community, and how biennials can help to improve the lives and well-being of our communities. The announcement was made at the end of a yearlong celebration, which was organized in collaboration with the city and its artistic and cultural professionals. Since the festival’s inaugural edition in September 2018, it has attracted more than three hundred thousand visitors.The selection committee comprised Bruno Cicutto, director of the Centro de Artes Plásticas de São Paulo; Cristina Alves, director of the Cerveterra Artes in São Paulo; Celine Codrea, director of the Chelsea Biennales; and Aurelio De Melo, director of COPINH in Paris.The seventy-two-piece jury comprised Aliha Alsop, artistic director of the Campesino Museum in Sao Paulo; João Barbosa, director of the Museu de Arte de São Paulo; and Matheus de la Fuente in Rio de Janeiro.Commenting on the work, the jury said: “We selected these eight artists as they embody unique talents, unique perspectives and unique values. They are the six of the twelve we have chosen for the next", "The next Biennial should be held in the spring of 2022.The biennial will be comprised of two sections. The “Grand Challenges: Art and the Future of Humanity” and “Restoring the Future”. The sections of the exhibition will each feature twenty works by thirty artists from the contemporary art field that will explore issues such as artificial intelligence, consciousness, art history, and language. The works will be divided into categories such as “Human’s Occupations,” “Artists,” and “Artists of Tomorrow.”The work of the artists in the exhibition will be curated by Sue-Ann Varejão. The biennial will take up themes such as the role of art in society and how art has impacted on the course of history, the questions of how the human body can affect the natural world and the natural world’s effect on art. “Restoring the Future” is a selection of twenty works by artists that will return to the “Grand Challenges” exhibit with a new perspective. The works will address issues such as the possibility of an artificial intelligence that retains the essence of the human spirit and how art can serve as a tool", "The next Biennial should be held sometime in the second half of next year. In order to make way for the exhibition, the museum has already expanded the exhibition space beyond the fourteenth floor of its building in the West End. The event’s inaugural exhibition, “The Shift,” will return to the museum in March 2020.The biennial also added two new works, “Razia Fatima” (see photos below) and “Alfred Stieglitz” (see photos below), and will present two lectures by two artists whose works have never been seen in North America: Peter Gopalakota and Ian Hamilton. The latter will receive a special exhibition marking the occasion.\n\n\nThe Metropolitan Museum of Art, the Museum of Modern Art, and the Whitney Museum of American Art in New York are teaming up to create a new $250 million fund for artists who rely on income from their performances and performances of their art. The fund will be located in the Met’s Artist–Operator’s Fund (AO) and will provide an additional $200 million to support the financial needs of artists performing in the United States.The fund was established through a partnership between the", "The next Biennial should be held in 2020. The next exhibition should take place in 2021. The next book should be published in the spring of 2022. The next exhibition should be held in the fall of 2022. If the timeline holds, the next exhibition would coincide with the Asia-Pacific Triennial (APT), which opened in Barcelona in November 2019 but was canceled the next month.\n\n\nThe Los Angeles County Museum of Art (LACMA) has elected the first openly transgender museum curator, Alicja Kondratieva, to the position of assistant curator. Kondratieva will assume her new post in January 2021.According to the Los Angeles Times, Kondratieva was appointed by chair Martin Singer, chief curator of the western half of the museum, Cultural Affairs, on the recommendation of Richard Mayhew, the director for public relations at the Los Angeles County Museum of Art. “When I was selected, I knew I had to make an effort to understand the full range of the museum’s collection and what was on display,” Kondratieva told the publication. “I wanted to be a part of the conversation around transgender art and the transgender experience. I", "The next Biennial should be held in the autumn of 2020.The new exhibition will be organized in collaboration with the former literary space of the university, the University Museum of Contemporary Art, (UMC). It will be housed in a former former University of California building in the city of Los Angeles.Submitted by USMCA Arts Council and the Contemporary Art Museum San Diego, the new exhibition will highlight the work of female and emerging artists in the United States. Titled “Art and Gender,” the exhibition will present artists who are at the forefront of redefining what it means to be a woman, and what it means to be an artist. The work of twenty-three artists from forty-three countries will be presented, including Anna Atkins, Kiki Smith, Malawian artist Chedie Diop, and Kenyan artist Eisa Asai. The biennial will also include a selection of forty-two works by African artists, including Aika Nwili, Christiane Olowu, and Sanaa Mpagi Sepuya, and will run for one week. The biennial will be hosted at the UMC from April 23 to May 21, 2020.In an email sent to the biennial’", "The next Biennial should be up by the end of March. The inaugural exhibition was held at the Museo de Artes and the first exhibition was hosted by the private collections of the association and the institution. On Wednesday morning, the first show by the private collections was released. This show consisted of “NIRIN” (NIRIN, Paris) and “BEAUTIFUL THINGS” (BEAUTIFUL THINGS, Paris) and was shown in the gallery of Antin Terena and in the Bézier house.The show was curated by Nirvin de Ghebaly, who was appointed curator of the inaugural exhibition by the association in April, and featured original works by twenty-nine artists.The next installment of the Biennial will be held in September.\n\n\nThe Open University, a New York–based nonprofit that supports young scholars through the creation of new work in the humanities, sciences, and technology, has announced the artists who will receive $1,000 fellowships this fall. The biennial, “Langaneer,” is comprised of twelve projects, which will combine critical reflection with the development of cutting-edge technology in the humanities.", "The next Biennial should take place in September 2021, the month the Museum of Contemporary Art (MoCA) is supposed to be conceived. The first event, the museum’s first art event, will be held at the San Francisco Museum of Modern Art, where the 2020 event will be staged from February 27 to March 5. In January, the museum did not announce a new date for its twenty-first edition, which was canceled amid the coronavirus outbreak.\n\n\nThe Metropolitan Museum of Art (MoCA), the Museum of Modern Art (MoMA), and the Whitney Museum of American Art in New York have formed a new charitable organization to support artists whose livelihoods are being threatened by Covid-19. Called the Artist Relief Fund, this new organization will distribute $750,000 to artists each year through direct grants, rebates, and other means. “Covid-19 has made clear that it is an economic crisis for many artists, and that many of these artists are artists whose work is essential to their livelihoods,” said Artnet editor-in-chief Ariana Widman. “This pandemic has already caused some museums to close, and some artists to curtail their artistic pursuits, and", "The next Biennial should be held in 2021 to coincide with the centenary of the outbreak. The exhibition will also mark the one-hundredth anniversary of the foundation of the Sainsbury Memorial Hospice in Portsmouth, UK.\n\n\nThe Institut Nationale de Art et d'Histoire in Paris (INAH) has announced that it will welcome visitors back to the institution in May 2020. In a statement, the French cultural body said: “Today we announce the reopening of the National Museum of the History of Modern Art (MMA), the grand-daddy of modernist art, in Paris. We are all in agreement that the museum has never been more crucial for our cultural life. It is an honor and a pleasure to be able to organize the first exhibition of its kind in France in the city of Picasso.”Among the works that will be up for grabs in the exhibition “Picasso’s Body” are works by all six of the artist’s children, and a selection of works by artists such as Henri Rousseau, Gérard de Malle, and Jean-Luc Godard, as well as a selection of works from the artist’s older works, which often", "The next Biennial should focus on the history of visual art and the contemporary concept of the body. Its first section, “Body Art,” will highlight curatorial efforts in various arts to address and better understand the history and development of contemporary art bodies, including in the field of visual art, and will address how body art history has shaped the history of visual art, as well as the national and local contexts of visual art. The second section, “Visual Art: From the Body to the World,” will focus on the relationship between body and art and will explore how bodies and bodies of culture shape and change the world. “In order for a successful future for art and culture, it is imperative to establish a solid roster of talented and ambitious female curators and to support their ambitions to create compelling exhibitions, scholarly presentations, and critical public programs,” said Kippy Stoltz, chair of the board of trustees of the biennial. “The new role of the biennial will be to direct the exploration of the human body and the body systems through the lens of contemporary art.”\n\n\nThe Louvre in Paris is planning to open a new 300,000-square-foot museum dedicated to contemporary art in", "The next Biennial should focus on the publication of a new catalogue of the exhibition “The Unseen,” which has been on view since 1995. The exhibition is one of the few remaining works in the Whitney Biennial Collection, which was acquired by the Whitney Museum of American Art in 2015.\n\n\nThe Contemporary Art Museum St. Louis (CAMSL) has announced that it will begin welcoming visitors back to the institution in mid-April. A statement issued by CAMSL reads: “In the absence of any policy changes, developments or plans concerning CAMSL that could affect our current programming, we are taking the prudent steps to ensure the continuity of our collection, exhibitions, education programs, and research.”The announcement comes on the heels of the institution’s announcement that it will close its doors for a period of eighteen months and that it will open in April 2020. In a statement, CAMSL said: “We are currently reviewing the options. We will have more information in the coming months and years, but I want to emphasize that we do not expect CAMSL to reopen again until the spring of 2021. For the past eighteen months, CAMSL has been a laboratory for new ideas about what may come next with its long-", "The next Biennial should be held in the spring of 2021.\n\n\nThe Tate in London is planning to drastically reduce the size of its iconic David Attenborough-designed building in the wake of the Covid-19 pandemic. According to the Art Newspaper, the UK’s largest arts organization is also reducing the number of visitors to its museums by as much as one hundred thousand. Since the majority of visitors to Tate galleries are from outside the UK, changes at the museum include reducing the number of visitors by three-quarters and byfracturing the museum’s largest-scale public viewing rooms.Next year, the museum will also extend the reach of its experimental Gift Shop, the largest contemporary art museum in the world. Designed by the German firm GESI, the space, which opened in 2009 and has 6,800 works by more than 140 artists, will now be housed in a converted warehouse in the city’s Tate complex. The museum will unveil its new exhibition spaces and a new program, “On the Darkside—” in 2020.\n\n\nThe second edition of the Deutsche Bank Chicago Architecture Biennial, which kicked off on September 21 and ran through October 24, will be held in 2021.", "The next Biennial should be held in 2021. According to the Art Newspaper, Japan’s government approved the construction of a museum that will house the exhibition two years ago. The museum is currently developing a new version of the exhibition “Elusive Victory,” which will be staged at the Tōhoku Dome in Tokyo. The exhibition will open in 2022 and run until 2021.\n\n\nThe Institute of Contemporary Arts (ICA) in London has commissioned artist Katja Nieuwenhuijsen to create a new installation for its annual “Celebration.” The work, called “Eternal Endeavor,” will open in the city’s Picasso Place in June 2020 and will be accompanied by a new monographic print series, “MARCH/FEBRUARY, 2022,” that will highlight the life, works, and work of two artists in the month of March. The exhibition will follow “Up Against Nature,” a new series of exhibitions that will be curated by artist Peter Erdmann and will focus on’s works from the late 1940s to the early 1950s.Koenig writes that Nieuwenhuijsen’s installation “be", "The next Biennial should showcase the work of the individual artists participating in the preceding year, and should be organized in accordance with the 'Vogue of the Gay and Lesbian Arts,' a feminist and LGBTQ-oriented magazine published in Paris in the 1870s.The exhibition will feature works by sixty artists of all backgrounds and from thirty-six countries. “The Biennial is already a project whose continuation is the objective of its founders, so we have always taken care to present works in the best possible way possible,” said artist Thomas Lätte. “The next iteration is to continue this tradition.”The twenty-sixth edition of the biennial, which is currently underway, will take place in March 2022.\n\n\nThe Architectural Record announced today that Jocelyn Balfour, who served as curator of the inaugural edition of its Architectural Talk series in 2007 and 2009, has been selected as the next recipient of the $250,000 MacArthur Fellowships. Balfour, who first joined the organization in 1996 as an exhibition program associate, will be presented with the award at a ceremony at the MacArthur Museum in Los Angeles on Wednesday, April 3.“IBM, like many others, has been working", "The next Biennial should be held in the spring of 2021, when a new platform, the Biennial Archive, will be established to house the archive of the ninety-nine exhibitions that were selected by the current parliament.According to a statement made by the President of the Republic, Valentino Rossi, the new entity will play a critical role in 're-engaging with the European Union’s project for a common strategy and objectives for the grouping of the twenty-first and twenty-second regions, in order to further the integration of Italy and the EU. “This ambitious project is a reflection of Italy’s history of openness and collaboration with the EU, and an extension of Italy’s international identity,” the statement reads. The new project will focus on three pillars of Italian identity: the Italian language, culture, and people.It will also include an online-only display of the biennial’s works, which will be archived and accessible by the public for a period of eight weeks, during which time the artist-run exhibition space Biennale di Venezio will be open to the public.\n\n\nThe Museum of Modern Art (MoMA) in New York is rethinking its long-standing goal of", "The next Biennial should feature the work of at least thirty artists. The project will also include the construction of a permanent collection from the artist’s work. Artists: Assembled by:  Chen Guangrai Wu Hanzhong LiuThrough the auspices of the Chinese Academy of Art, Nanjing University, and the Museum of Contemporary Art, Beijing, the exhibition will be curated by Wang Huaiji, director of the Museum of Contemporary Art, Beijing; Wang Lei, director of Shanghai Art Museum; Wang Qiu, director of the Beijing Animation Museum; Wang Zi, director of the Beijing Art Museum; Wang Yanyuan, director of the Beijing Art Museum; and Wang Zhenli, director of the Museum of Contemporary Art, Beijing. Wang Xianli, a Beijing-based artist, has been nominated for the Barsak Prize. His work, “I’ve Had a Dream,” will be featured in the exhibition “The Last Days of Mao Tse-tung,” which is scheduled to run March 22 to March 30. The next exhibition will be curated by ", "The next Biennial should take place in 2021, with a new theme of the artist’s relationship with the Nanking Museum of Art, and a new theme of the history of the art. The 2021 event will also feature a new exhibition of work by the artist known as “Mao Tse-Tung,” a tribute to the late Chinese intellectual and student leader, and “Kunzuo Kondo,” a selection from his collection that will be on view until January 20, 2022. The Kondo family collection, which comprises an exhibition of work by more than forty artists, including Kunsthal, Kunsthal Bearsch, Kunsthal C, Kunsthal D, Kunsthal E, Kunsthal F, and Kunsthal G, will also be reorganized and presented in a new space.“The Kondo Collection is a fascinating collection in its own right, but it has never before been able to play such prominent roles in bringing together the diverse works of Kunsthal, Kunsthal C, and Kunsthal G,” said Kunsthal founder Wolfgang Kallmann. “It will now be able to do so with great enthusiasm. The Kondo House will be", "The next Biennial should be staged in the spring of 2021. Each year, the fifty-sixth edition of the exhibition will take place at the Biennale di Venezia. The biennial will be hosted at the Museo Filippo Brizzi, in Venice, Italy.“When we decided to create the Biennial di Venezia, the chosen location was always at the forefront of our thinking,” said Carlo De Sarthe, director of the Biennale. “I believe that the opportunity to present a show of the work of the greatest artists of the twentieth century and to present it in Venice is an ideal situation to engage with the city of Venice and to introduce new perspectives to the exhibition.”\n\n\nThe Bernard Kukulski Foundation has announced that it is giving $750,000 to fourteen artists in support of the construction of new public artworks in the city of Chicago between the years of 2019 and 2021. The seven-member board of trustees, which consists of architect and urban designer Bernard Kukulski, president, and CEO Patricia Korso, and curator and writer Stefan Molynek, formed the foundation in honor of their late father, who was a leading member of the contemporary art", "The next Biennial should be held in 2022 and will be inaugurated by a spectacular new work by the Chinese artist Ai Weiwei, “The Circular Road,” in the exhibition “I, Ai Weiwei’s Place.” The biennial will then present the work of three other contemporary Chinese artists: Li Yajun, Xu Yixian, and Li Zhijie.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles, the National Museum of Women in the Arts (NMWMA), and the Los Angeles County Museum of Art (LACMA) have issued a joint statement in support of the movement at the center of the so-called #MeToo controversy.“The issues of sexual harassment and assault in the arts and how these are addressed vary by location and context, but we believe that this work of condemning these troubling practices and the need for change in the arts is an important step in creating a more inclusive culture for everyone,” said museum director Klaus Biesenbach in a statement. “We are proud to note that our biennial partners share similar values and that this work of solidarity reaffirms their commitment to building a more inclusive world.”", "The next Biennial should be held in 2021, and the new venue should be selected from a shortlist of ten artists selected by an international jury chaired by Pilar Battaglia, director of the Museo de Arte Contemporáneo Arte Contemporáneo in Turin. The full list of curators is as follows: Roberto Ferretto, Pilar Battaglia, and Mirko Tichela, MNABCM, and Onda Bicocca.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has appointed William W. Pascual as its next executive director, effective immediately. In his new role, Pascual will work with visionary thinkers and visionary leaders, including Mayor Bill de Blasio, to build on the city’s legacy of supporting artists by advancing their work in innovative and transformative ways.“The DCLA is deeply concerned with the future of our city, region, and state through a creative and visionary approach,” said Commissioner Daniel H. Weiss. “With the appointment of William Pascual, we're moving into a new stage of our history as we take creative action to shape the future direction of the city and region. As a", "The next Biennial should be held in 2022, and the theme should be “Art and the Politics and Art of the Future.” The exhibition will be accompanied by a large-scale public installation of works and installations by thirty-three artists and forty-two curators who have represented the Land of Israel and the Republic of Korea in the past.\n\n\nThe Centre Pompidou in Paris made history this week when it announced that it would relocate to a brand new 7,500-square-foot space in the city’s Ritz-Carlton hotel. The institution, which has been in a current-construction building at 320 rue Saint-Denis for more than a decade, will be inaugurated in 2020 by a retrospective of the French artist Génèbre Buzyn’s work Le Pigeon.In a statement, the Centre said: “The Centre Pompidou has always been a museum of contemporary art, but we have always been different from the other museums, focusing on the art of the present, the art of the past, and art of the future. Alès avant-gardes are the art of the present, the art of the past, and the art", "The next Biennial should be held in 2020, and the following year in 2022.Alexandra Wilber, director of Los Angeles’s Museum of Contemporary Art, told the Los Angeles Times that the first exhibition of its kind in the United States will be held in the city in 2023. In an email to GQ, Wilber said: “We are excited by the prospect of hosting the next Biennial at LAXART’s Museum of Contemporary Art. We are confident that LAXART, the world-class center for contemporary art, will create a compelling exhibition experience for the public. We are also thrilled about the support of our past trustees, Margaret and Richard Armstrong, who has been instrumental in taking our exhibition program to the next level through generous gifts, and of our staff and supporters.” While the new arrangement between the museum and the city of Los Angeles is not exactly ideal, Wilber believes that the new partnership will create a new opportunity for the city to showcase the work of a diverse group of artists. \n\n\nNew York’s Metropolitan Museum of Art (MoA), which has faced mounting pressure to redesign its environs since it was chosen to host the 2024 and 2022 iterations of the Whitney Biennial", "The next Biennial should be held in 2021 and will focus on “Theoretical Mathematics and Its Philosophy”.\n\n\nThe Museum of Modern Art (MoMA) in New York has hired six individuals from the art world to its board of directors: Shimantu Murugesan, who has served as director of gallery operations at the New York institution since 2013; Melvin Balog, who has held various leadership and curatorial roles at the institution; as well as Jodi Lenk, who has served as director of development at the Garden Museum and runs the studio Art of the Party. Both Balog and Murugesan are board members of the New Art Dealers Alliance; a coalition of cultural producers and art collectors who rely on artists and art organizations to generate income.“As a board member and a passionate supporter of these workers, I’m excited to work with Allan and the board to help them shape MoMAD,” said Museum Director Philip Shaw. “Their expertise and commitment to artmaking and their ability to bring people together to celebrate their artmaking skills and passion is essential for our mission to make MoMAD a destination for art lovers from all over the world.”", "The next Biennial should take place in the summer of 2021, the organization said. Artnews reports that the festival, titled “Art of the Future,” will be led by Anish Kapoor, who will curate a group exhibition of contemporary art, and will be held at the San Francisco Museum of Modern Art (SFMoMA), which is currently undergoing a $1 billion expansion project. The project will also include the construction of a new 14,000-square-foot museum.The announcement of the opening and closing times for the biennial was made during a presentation by the artist-in-residence Kumail Ahmad, who has served as the director of the San Francisco Museum of Modern Art for the past three years. The event will debut at the Museum of Modern Art in 2020, and will have an exhibition of works by Iranian artist Ali Akbar Khan.\n\n\nThe Art Newspaper has revealed that the first issue of its new quarterly magazine, which will launch on October 6 and will feature illustrations by artists such as Paul Gauguin, Jean-Michel Basquiat, and Frank Gehry, will feature the work of twelve artists from the anthology “Art of the Future.” In addition to visual", "The next Biennial should be held in the summer of 2021. The 2019 edition was held at the Pérez Artística in Madrid.  The exhibition, titled “Marking Time: Contemporary Art from the Americas” (Tenor Robert Mapplethorpe), was curated by Dario Catellani and was organized in collaboration with visual artists, producers, filmmakers, writers, and academics. The ten artists who won the award are Adam Koutsoukas, Felix Mendelsohn, Alexandra María Olímpic, Elena Yarosh, Nancy Lynne, Vladimir Zolfitsky, Sara Ziffren, Bernie Wood, and Hannah Wilkes. During the ceremony, María Olímpic said: “I cannot express in words how pleased I am to be nominated for this award. I am so honored to be included in the catalogue for the first time. I am thrilled that this year’s award will be recognized by the Pérez Artística as well as the Spanish Ministry of Culture. The biennial will be the first in Spain and will take place in the Spanish", "The next Biennial should be announced as soon as possible, but if all goes well, the exhibition should be completed by the end of the month.”While the museum has had multiple expansions over the years, it was only in the 1980s that it moved into a new building in the city, known as the Biennial Village, which is home to sixty of the museum’s permanent collection works. The museum reopened in the summer of 1996 after a $125 million expansion, and the new building’s first exhibition, “The Art of Solomon R. Guggenheim” (1999), was staged in the summer of 2001.\n\n\nThe Museum of Art in New York and the Metropolitan Museum of Art in New York have announced the launch of a $500,000 grant program to support the artists and designers who have been selected to represent the United States at the Fifty-Ninth Venice Biennale. The program will provide artists with $200,000 to represent their states on the first day of the fair’s inaugural editions in June and July 2020, and will award $100,000 to artists representing their states on other days of the fair.“This is a major milestone for our artists, and we", "The next Biennial should be held in two phases. First, the exhibition will be relocated to a new venue. The exhibition will then become part of the Biennial, with a new name and a new mission. The first phase will be held from April 3 to April 5, 2020 and will bring together some seventy artists and collectives from twenty-six countries. The second phase will be held from April 19 to April 24, 2020 and will consist of two triennials. The theme of the third triennium will be “Life in the Art.”\n\n\nNew York’s MTA has received a record $7.2 billion in subsidies to cover its losses as it works to contain the coronavirus. The funding, which was announced in March, has already averted the spread of Covid-19, which has caused coronavirus-related deaths in seven states and has sickened more than 11,000 people in the United States and abroad.In an attempt to lessen the financial impact of the coronavirus, the MTA will invest more than $1 billion into its transportation, utilities, and operations, including its subway system and its subway stations. The investment in public health will only continue as the agency works to identify and prioritize", "The next Biennial should take place at the Dreyfus Art Museum in Düsseldorf, Germany, in the spring of 2021. The exhibition “Microscopic Art” was selected by a jury comprising Nina Fröhlich, Joachim Neumann, and Tiwani B.F.F. The exhibition will be inaugurated by an examination of the work of artist Günther Küngke, who was awarded a Medal of Honor by the Dreyfus Museum in 2017. The exhibition will be followed by a public program of performances, performances, and installations with the inaugural exhibition of the new Dreyfus Museum in 2021.\n\n\nThe Metropolitan Museum of Art (the museum) in New York has announced the opening of two online viewing rooms, museum-wide videos, as well as a new digital video series, on the history of art, technology, and fashion, with a view of the museum, as part of its effort to engage more people in the history of art. The first, titled “From Around the World in 80 Days,” will be available on December 21 and will be hosted by the museum on both digital and physical screens. The second, titled �", "The next Biennial should take place in the city in 2021. Last year, the organizers announced plans to move the event to a new venue in the northern suburbs of Paris. Henri Prouvé, the exhibition’s artistic director, said: “The Biennial has always been about the belief that art can change lives and that through the exhibition, the public is given a new idea of art in a new way. This new exhibition is a first step in that direction. We are now ready to take things a step further.” The biennial’s next edition will be “L'Église Bénétière,” on December 3, 2021. \n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles has offered to donate $7 million in support of the efforts of cultural workers in the city to combat police violence, and to establish a $1 million fund for job training, job preservation, and rehire. The gift is one of the many measures the museum is taking to alleviate tensions between the police and the African American community, which have been exacerbated by the unrest that erupted following George Floyd’s death. The museum was not alone in its efforts to engage with", "The next Biennial should be a Makarani performance, created by and for the Black community. It should be transformative for the Black experience in the United States, and we should make it happen. We must create a space for reflection, community, and artistic collaboration, to engage directly with Black communities in every community in America. We must make it a reality. We must change. We must change because we are Black. We must change for the better. We must change for ourselves. We must change for our communities. We must change for the future. By changing for the better we mean reflecting on our own lives and our own histories. We must reflect on our complicity in systems of oppression. We must reflect on how we create and reproduce systems of domination and subjugation that undermine our communities and our very selves. We must reflect on our complicity in the work of our oppressors. We must reflect on our capacity to change. We must reflect on how much more we can do to dismantle systems of violence and racism. We must reflect on the ways in which our complicity in the work of white supremacy limits our own collective self-realization and self-empowerment. We must reflect on the ways in which we as Black people are complicit", "The next Biennial should be held in 2022. “We can no longer afford to continue as we are,” said the exhibition’s director, Yvonne Ehrlich. “We ask that the Museum reconsider its broader strategy of exhibitions, public programming, collaborations, and the small museum-scale ideal. We ask that the Museum become a model for what a good art museum should be: a great institution, free to the public, devoted to the study and appreciation of art.” \n\n\nThe Metropolitan Museum of Art in New York has appointed Chandler K. Pfeifer as its next director and CEO. In his new position, Pfeifer will take the helm from Mary Anne Carter, who has led the museum since 1993 and will continue to serve as the board president and CEO of the museum until her retirement.“This is a moment of great opportunity and challenge for the Met,” said Pfeifer. “Mary Anne and I are thrilled that we are going to the Met and are confident that we have the resources and the leadership skills to continue to grow and shape the Met’s relationship with our communities and the world. We welcome your comments, suggestions, ideas, and feedback. We look", "The next Biennial should be a platform for the exhibition of new works by the holdings of the Royal Academy or the Royal Institute of Fine Arts. In future years, it will be an important space for the exchange of views and ideas. The Biennial will also support the study of the history of art in Japan, and the exhibition of a selection of works by Japanese artists that have recently been displayed in Singapore.  The theme of the next Biennial will be “The Art of Place.” The biennial will be hosted by the Royal Institute of Fine Arts (RIFA) in partnership with the Singapore Art Museum (SAM), the Museum of Modern Art in Singapore, and the Marshall Islands Museum of Art.The biennial was founded by Audra Melsom in 2007 as a way to support independent arts projects in Singapore and will run for twelve years. The biennial will select an artist to represent Singapore at the 2019 edition of the Venice Biennale. The artist selected for the 2019 edition of the Venice Biennale is Rory O. Burns, who will make his debut in Singapore in October. The biennial was organized by and is funded by the [b]museum of modern art in", "The next Biennial should take place in 2020, and the last in 2021. The theme of this year’s event, “Maya Angelou: Thought in Pictures,” was chosen by curators Maya Angelou and Iwan Wirth. In addition to the visual art, the exhibition will explore the concept of “thought,” and will feature works by forty-four artists, including Zina Marlborough, Orsi María-Santiago, and Jess Phillips.The fifty-three-year-old artist is considered one of the most important twentieth-century abstract painters working in the United States. Among her work’s works that have recently come to the fore are her famous paintings of owls, which were published in the November 1979 issue of Artforum, and the much anticipated “Reality Painting” exhibition at California’s Pacific Palazzo Artola di Mille in January of 1983.Artist Mia Iwan Wirth also remarked that Angelou “controls the use of light, combining the most basic ideas of light and color.” Angelou’s work is currently in the collections of many national and international museums, including the Metropolitan Museum of Art, the Los", "The next Biennial should be held in 2020.\n\n\nThe Museum of Modern Art (MoMA) in New York is now giving $1 million to twenty-seven local arts programs in the city in the interest of diversity and inclusivity. The request comes amid the ongoing protests over the years of various black and Latina arts organizations, including the Los Angeles Black Arts Festival and the New York Asian Art Festival, and comes on the heels of the announcement of a few hundred arts and cultural organizations that were asked to relocate during the construction of the twin towers of the World Trade Center in lower Manhattan in the wake of the terrorist attacks of September 11, 2001.Organizing committee chairman Edward DeBartolo told the Art Newspaper that the organization “was asked to consider a number of different possibilities and decided a no-fly zone was the best solution.” The museum only made the request after receiving a letter from twenty-seven local arts organizations that signed a statement condemning the museum’s plan to turn the site of the Twin Towers into a “multicultural center for artists from all over the world.”The letter continued by demanding that MoMA not use the arts site as a ‘backyard’ and urged the museum to use", "The next Biennial should be held in the coming months, and the first show should open in the spring of 2021, according to the Rome-based group Kino Federati. The full list of participating artists is as follows:Deadline: May 16-May 20 Adeline Barozzi, New YorkDigital Light, New York Tracey & St. Croix, New York , March 31-April 3Aaron Brown, New York , April 3-April 6Dale Caponnetto, New York, April 11-April 13Dennis Hays, New York, April 16-April 22 Diana Cony, New York, March 21-March 26Catherine Daly, New York, March 26-March 29Diana Grider, New York, March 26-March 29, March 29, March 31, March 31, March 31, March 4, March 6, September 11, September 16, September 22, September 25,September 28, October 7, October 14, October 21, October 24, October 28, October 30, October 31, October 31, October 31, October 4, October 5, October 6, October 7, October 10, October 12, October 19, October", "The next Biennial should be held in 2019 and will focus on the history and the art of the mother country. The exhibition will also include a selection of essays and a selection of photographs by the artist, which will be curated by Sabine Schmitz.\n\n\nThe New York City Department of Cultural Affairs (DCLA) announced that it has created a new fund that will assist cultural organizations in New York City impacted by the Covid-19 pandemic. The fund, which was established as part of the $2 billion CityBridge initiative, will grant $375,000 to small and mid-size cultural organizations in the city. Called NYC CityBridge for the Arts, the fund will distribute $1 million to arts organizations through the January 26 deadline. Applicants must be able to demonstrate that they are making a positive financial contribution to NYC CityBridge, which supports a variety of cultural and community-based initiatives that are working to help combat the Covid-19 crisis, and must have an immediate need for assistance.The fund is slated to launch in January 2021 and will offer $450,000 to organizations that are working with or have been affected by the Covid-19 outbreak. The fund has a $250,000 cap and awards $125", "The next Biennial should be held in 2020 and will be organized in the theme “The Last Days of the American People.”The event will be hosted by Cornell University, the New Museum, and the Museum of Modern Art. The commission of the artwork was made jointly by the New Museum and the Museum of Contemporary Art. “The art in our collection represents the collective experiences of many artists working in their personal and collaborative ways,” said Elizabeth Cropper, the director of the New Museum. “The exhibition is a great opportunity for the public to see these works for the first time and to see how these works will reflect on and be interpreted by artists from across the world.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has added four new members to its board of trustees: Josh Levin, a former associate curator and cofounder of the Los Angeles–based nonprofit Art and Architecture Exchange; Myrna Pettway, a curator and the founder of the collaborative social-impact gallery The Furniture House; and Mary Neeson, a curator and the president and CEO of the Los Angeles–based nonprofit the Centre.“The additions to the Museum of Contemporary Art board reflect the museum’s diverse and", "The next Biennial should be on the second floor at the Museum of Modern Art in New York. The biennial has chosen Shirley Carolan as its first curator. She currently serves as the curator of contemporary art at the Center for Contemporary Art in Philadelphia. Carolan will be responsible for introducing the annual exhibition “The Black Years: The Untold Story,” a collaboration between Carolan and Diana Al-Goldberg, to the public. The opening event will take place on September 29. The prospect of the exhibition remains uncertain after the Italian government declared a state of emergency on September 20 after a number of incidents of fires in the region erupted in the early hours of the morning. The fires have so far claimed the lives of at least seventy people, and forced the evacuation of large areas of the city. A new investigation is being conducted by the Civil Protection Ministry and the region’s State Emergency Service (Eso), but the timeline for its completion remains uncertain.\n\n\nThe British Museum (BMI) in London is planning to begin welcoming visitors again after an eight-year closure thanks to a $1.5 billion expansion project, which will see the institution expand from a mere twenty-four square feet to a towering", "The next Biennial should be held in the autumn of 2021. The announcement comes one week after the Art Newspaper published a six-city tour of Venice that includes the Museo de Arte Moderno, the Contemporary Museum of Modern Art, and the Ato Museum. The first leg of the Venice Biennale will take place in the city from November 14 to November 17. The Venice Architecture Biennale will be held in the city from April 14 to May 19. Yaya Turang, the director of the Contemporary Museum of Modern Art in New York, said: “We are delighted by the invitation to the Venice Architecture Biennale, and the invitation to host the first Venice Architecture Biennale at the Art Institute of Chicago. . . . These two iconic cities are not only great cultural jewels, but they are a model for how we as cities can think and act using the art of our time.”\n\n\nThe Museum of the Moving Image (MMI) in New York has launched a new online platform that will allow visitors to the institution to enter a digital digital space created by artist Renata Ulrich, the German-born, Italy-based artist who experimented with the space in an effort to create a more immersive environment", "The next Biennial should be held at least once a year. It is possible that a second, or even a third, will be staged in the future. However, the current exhibition will have to be completed before the end of 2020, and the event will be suspended until the program can be re-scheduled.“The exhibition has been suspended because of the ongoing events of the occupation,” said director Svetlana Ponomarenko. “The exhibition is currently undergoing a reanalysis of the first phase of the exhibition, which is a collaboration between the artist and the artist’s collaborators. The artworks will be presented in the context of an open-air sculpture park in the city of Varna. As a result, the works will not be rescheduled but will be temporarily postponed.”The Italian government announced that it would provide $17 million to help the former employers of the exhibition space in November, and the Dona Cattolica Foundation is helping the former tenants with its $4.6 million Summer Pavilion project, which will run from March 18 to March 22. The organization also announced that it will give the current exhibition space a total of $1.5 million.", "The next Biennial should be held in 2020.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles (MCA), the nonprofit organization that promotes contemporary art and preserves its collection and archiving, announced today that it has received a gift of forty-five works from the Gilbert and George Gallery in New York. The gift includes forty-six works by artists from the list of thirty-one curators who will be honored this year\u0097Alex Katz, Patrick Buckley, Tom Friedman, William H. Gass, and Arthur Jafa.“The Gilbert and George Collection is a very large and comprehensive collection, and in our opinion, the finest collection in the United States,” said Mark Gilbert, the president and CEO of the museum. “In addition to the fifteen works highlighted in this year’s biennial, the Gilbert and George Collection also includes work by such artists as Renzo Piano, Anita Cooper, and B. J. Maas. We are extremely grateful to our donors for this meaningful gift.”The museum also announced that Stephen Friedman, a longtime longtime curator at MoCA, will serve as a consultant for the inaugural exhibition, “The Photography of Albrecht Dürer,” which will open", "The next Biennial should be held in 2021. \n\n\nThe University of California Berkeley’s budget has been slashed by a third since the coronavirus began to spread across the United States. The University of California, Berkeley, announced on Monday that it will be forced to lay off or furlough nearly two hundred employees as part of its plan to reduce costs through furloughs, layoffs, and voluntary retirements.In a letter sent to employees on Tuesday, Chancellor Carol Christ and chair Sherry Lansing wrote: “While we recognize that these changes will hurt and inconvenience you and our staff, we believe it is essential that we continue to pay our bills and meet the financial needs of our community.”The university estimates that the furloughs, which were initiated as part of a broader $3.3 billion restructuring, will force a $120 million reduction in the operating budget and will force a voluntary reduction in pay for some staff members. The letter continues by asking employees to consider other options, such as taking paid sick days, becoming members of a union, or engaging in a variety of other actions.“While these changes may seem drastic and disruptive, we hope that they will allow us to continue to pay our bills and to", "The next Biennial should take place in the Spring of 2021, with a design by Fons Hof,” said Sarwar and Kappar. “Our museum is currently planning to inaugurate a new exhibition of the works of the Lohmann Collection in the fall of 2021. Both the museum and the gallery have been struggling to come to terms with the mounting financial losses due to the pandemic. The problem of moving art works and collections is a finance industry industry industry that is suffering tremendously, and we are.”By moving artworks and collections, the Lohmann Collection and the biennial were referring to the Lindbergh-Kappar & Fischbach (LLFK) and the Dunham-Kappar (DKA) as well as to Hof and Kappar, two of the world’s most important collectors of modern art. Both the Lohmann Collection and the DKA are back in the center of the exhibition, with the collection of Lohmann & Co. and the DKA heirlooms. Hof’s collection is housed in the collection of the Lohmann Museum in Berlin, and his artworks are in the collection of the Württembergische Kunstverein", "The next Biennial should be held in the autumn of 2021. The festival will organize a series of locally produced works by artists whose work is currently on display in the exhibition or has recently been exhibited in the exhibition. The first exhibition will focus on the works of sketch and painting artists, and the second will be a selection of works by the contemporary artists who are most associated with the city of Chicago. The biennial will draw from submissions from Chicago’s larger arts community and will be presented in partnership with the Downtown Artists’ Initiative (D.A.I.). The selection committee consists of: Ann-Marie Brennan, artistic director of the Downtown Artists’ Initiative; Charles Buono, artistic director of the Blue Angels Museum of Art; and Michael Carson, director of the Blackbird Creek Art Museum, Illinois.“This year’s biennial is a celebration of the city’s visual art community,” said city artistic director Marie Connor. “The exhibitions reflect the breadth and depth of artistic practice in the city, and the artists whose work is represented in the exhibition. We look forward to a full and robust 2018.”\n\n\nLee Graves, the American photographer whose portraits of people and places appear in the first installation", "The next Biennial should take place in 2020.  The exhibition will include works from the collection of Christo and Ann-Marie Beckmann-Kuhl, a couple who are best known for their elaborate, multi-layered installations. The couple will also present their first project as a group for the project, a collaboration with the artist Osmo Pindell.  The first exhibition at the Museum of Contemporary Art (MoCA) in New York will open in 2020, with the show “Tit. 2\u009716,” a series of two lithographs by the Renzo Piano–designed Byronic, a work by the late Belgian painter Paul Gauguin, and a selection of and pieces by the late German photographer and priest Oswald Kiefer. The show will be held at the Münster-based Museum of Modern Art (MoMA) until March 22, 2021. \n\n\nAfter the Museum of Contemporary Art (MoCA), New York, released an open letter this week that charged the institution with promoting a “cult of personality and a fetishization of the artist’s image.” The letter, which was signed by museum directors Amada Cruz and Auguste Rodin, reads", "The next Biennial should broaden its scope to include an exhibition of work on paper in the form of a paper-frame. “The next Biennial should broaden its scope to include an exhibition of work on paper in the form of a paper-frame.”The committee that chose the artists for the 2020 edition of the exhibition also chose Nam Tse, Christopher Wool, Marie Watt, and Nari Ward, whose work was presented in a retrospective at the New Museum in New York in 2017 and 2018, respectively, to represent the United States. The 2019 edition of the exhibition was curated by Peter Wächtel, and the inaugural exhibition was staged by Sarah Polley. The biennial, titled “The Body and the Way,” was organized by the Smithsonian American Art Museum in Washington, DC. “We are thrilled to see the work of Nam Tse, Christopher Wool, Marie Watt, and Nari Ward. Their visionary and compelling narratives in the exhibition The Body and the Way will inspire and profoundly engage our audience.”\n\nA group of artists and historians have condemned the Southern California Museum of Art (SCM) in Pasadena for removing three of their works from public view", "The next Biennial should begin as soon as possible, with the intention of receiving the exhibition at a later date. The construction of the exhibition will be completed by the end of the year. The first show will be held at the nineteenth Biennial in Berlin in 2021. The quarter-finalists for the prize will be selected by a jury comprising Arabella Briand, Julia Bernhard, Angela Heina, and Susana Pilar. The show will be held in the former Prussian barracks in Berlin, next to the Brandenburg Gate, between November 22 and December 19, 2021. The 2018 awardees included artists such as Mehdi B. Al-Amin, Abdulmajeed Ba'asy, and Nima Nabavi.\n\n\nThe Rhode Island School of Design (RISD) has received a $25 million donation from philanthropists Alice and Ed Koch, the creators of the consumer goods company Levi Strauss & Co. The $28 million gift also includes a $16 million gift from the late investor and philanthropist Adolph Rupprecht, who cofounded the investment firm Apollo Global Management with his wife, Susan.The billionaire couple has previously raised more than $500 million for RISD through business ventures, including through a series of trusts", "The next Biennial should be held in 2021 and will feature a selection of works by forty-three artists and collectives. A special exhibition of work by Neumann, Massey, and other artists will take place in 2019, and the first Biennial, which will be held in 2018, will be staged in 2020. The project of the exhibition will be to create a visual narrative of the history of art from the twentieth century to the twenty-first century by presenting forty artists. The exhibition will be organized according to a 'Grand Strategy' which will consist of a series of central points of view, each offering a prelude to the other. The Grand Strategy will be organized around a cycle of themes and will be punctuated by a series of intermissions, each one marking a crucial step in the historical process. The artists who will participate in the exhibition are as follows:Jean-Michel Trapp (Paris):   Gedney (1980) Jules Verne (New York):   Henry Moore (New York): Henry Moore (New York): Jane Stoffrega (New York): Henry Moore (New York): Henry Moore (New York): Henry Moore (New York): Henry Moore (New", "The next Biennial should include a statement by Lanchester for the exhibition “In the Realm of the Customist: Art and Myth” and a selection of works by contemporary artists whose practice is simultaneously experimental and transcendent. The exhibition will also include new works by Carol Stroud. The itinerary includes:June 22–June 26: Austin Art Museum, Texas July 19–July 22: New York Public Library, New YorkJuly 24–July 28: San Francisco Museum of Modern Art, CaliforniaOctober 6–October 10: New York Gallery of Modern Art, New YorkNovember 3–December 3: Black Museum, LondonDecember 8–December 11: Art Museum London, London\n\nThe Museum of Modern Art (MoMA) in New York has unveiled an ambitious new plan to remake its campus in the city’s financial district, creating a new 26,800-square-foot museum dedicated to the art of financial services. Called the Transformational Year, the initiative aims to create a new cultural and educational experience that will take place on the museum’s campus in the summer of 2020.“The Transformational Year will first and foremost focus on the art of financial services, but will also include a history of financial services and the art of art", "The next Biennial should be held in the spring of 2021. \n\n\nAn exhibition of works by twenty-four artists, including Lawrence Abu Hamdan, Eric Fischl, Raphaela Zuccar, and Michelangelo Antonioni, titled “Unfinished Business,” which is currently on view at the Biennial at Lincoln Center in New York, was set to open on September 27. The program has been halted due to the Covid-19 pandemic and will reopen in phases thereafter.In a statement, the nonprofit said that the cancellation of the exhibition was not related to budgetary concerns but was made to avoid “making a political statement about the biennial.” It added that the award of the $250,000 “in recognition of their contributions to art and culture” “will be an unprecedented honor.” The artist-in-residence, who has yet to be named, will be given a formal award of the fellowships as well as the $100,000 “in recognition of their contributions to art and culture” and “will be honored at the end of the twenty-fourth Biennial.”According to the New York Times, the 2017 exhibition, titled “What", "The next Biennial should take place in 2021.\n\n\nThe Oakland Museum of California (OMC) is planning to reopen in 2020 after a $1.3 billion expansion that will include a new building and renovation of the institution. The renovation will include the addition of new galleries, a theater, and an amphitheater as well as bringing the museum up to date with the latest in contemporary art.The $1.3 billion renovation project is part of a $2.6 billion plan to overhaul the museum’s exterior, interior, and foundation in an attempt to make it more sustainable. The plan also includes the construction of a new conservation building and the renovation of the existing building.The platform also includes the creation of an endowment for the museum, the construction of a new public gathering space, the renovation of the historic lobby, and the construction of a new level for the museum. The proposed new exhibition building will feature a new twenty-one-thousand-square-foot building designed by McKinn, featuring a new performance room, a library, and a public sculpture garden. The building will be constructed in the same fashion as the Museum of Contemporary Art (MoCA) in Los Angeles, with the addition of a new outdoor courtyard, a rooftop", "The next Biennial should be held in 2020. “The engagement of the exhibition will be a continuation of the project of the Italian architecture, which was started in 1995, which was reconnected with the city of Milan in 2000 and which has been going on since 2012,” said Grazia Maretti, the president of the Milan Foundation and the city’s cultural authority. The show will be centered around the themes of the creative process and the relationship between architecture and the body.“In the past, the theme of the exhibition was the body, but now it will be architecture,” Milan architect Silvia Grazia told the Art Newspaper. Grazia was asked to create the sculpture for the exhibition “NIRIN,” which is currently on view in the gallery of the Milan Museum of Art, and will have a live performance by the Italian composer and theorist Ed Atkins.The show will include works by seventy-five Italian artists, including Federico Cattivo, Agostino Cattivo, Cazia Cattivo, Carla Cattivo, Filippo Tondori, Gio Ponti, and Henrique Barredo, and will feature 400 works by seventy-seven", "The next Biennial should be a platform to present the work of selected artists in a meaningful way. That will be the hallmark of the fourth edition, and the new work will be a spiritual reflection upon that theme.”\n\n\nThe A.W.F. Modern Art Award\u0097a recent $120,000 grant from the A.W.F. Foundation\u0097was awarded this week to a pair of New York–based artists, Shimon Proku and Wendy Patchett. The pair were chosen by a jury\u0097which included Frank Gehry and Guggenheim’s Norman Foster\u0097for their work The Staircase, which is currently on display at the A.W.F. Modern Art Award exhibition at Rockefeller Center, and were presented with $100,000.“The Staircase’s engaging concept appeals to me as an exemplary expression of the spirit of the A.W.F.’s New York space, which was organized in such a way as to reflect the aesthetic aspirations of its members,” said Patchett. “The Staircase is an integral marker of the A.W.F., and for that reason, it is a strong candidate for this", "The next Biennial should be a celebration of the life and work of Guadalupe García Lorca and the exhibition should include a selection of works by the artist in addition to the usual 25 lectures. Guadalupe García Lorca is the subject of a new exhibition at the Museum of Modern Art (MoMA) in New York that will be presented by the New School Museum and curated by Alessandro del Valle.The commission of a new artist-in-residence, a Spanish writer, who is currently living and working in New York, was made after the museum’s board of directors had decided to continue hosting annual public lectures by Guadalupe García Lorca. The tenured artist, who draws from social, political, and economic struggles of the region, will serve as the theme of the second biennial, “Guadalupe García Lorca: El Generico” at the Metropolitan Museum of Art in New York. The biennial will also include a selection of works from the artist’s collection, which will be arranged in a sort of urban laboratory, in a “Museum of Modern Art” designed by the artist.\n\n\nThe Supreme Court in the United States has upheld a $3 billion", "The next Biennial should begin in March 2019, with an additional exhibition, “NIRIN: Art and Emotion in the Age of Romanticism,” scheduled for spring 2020. The work will be on view until March 23, 2020.\n\n\nThe Los Angeles County Museum of Art (LACMA) has appointed Amanda Jean as its next executive director. Jean will become LACMA’s first African American executive director, succeeding Mary Anne Franks.“We are thrilled that Amanda will be leading the LACMA through this challenging and transformative decade,” said Barbara Maudlt, chair of the board of trustees. “Throughout her forty-year tenure, Amanda has been a driving force of change and a champion of artists and artists’ creative futures. We were impressed by her steady and unwavering commitment to artistic excellence and her ability to make the case for LACMA’s proposed $3.5 million renovation of Matthew Weiner’s former gallery, which is currently under construction, to the local community.”The renovation is part of a $48 million overhaul of the museum. During her tenure, Jean has overseen the revitalization of the museum’s campus; created new initiatives for luring visitors", "The next Biennial should be held in late fall/early winter 2019. Commenting on the proposed event, Pace said: “For decades now, the museum has explored the possibilities of the Biennial through a variety of mediums. In doing so, we have confronted and expressed the meaning and the potential of the art of our times. Today, we are able to say that we have explored what is new, most alive, and most important in our lives, and to be able to present it in the form of art.”\n\n\nThe substantial Ford Foundation gift, announced last week, will go toward the preservation and restoration of the iconic auto assembly plant in North Little Rock, Arkansas, which sits nestled in the rolling hills of central Arkansas. Built in 1937 to make parts for General Motors' iconic Model Ts, the factory was one of the first car-making operations in the United States. It also employed fewer than 2,000 people and produced around two thousand cars a day.Ford donated $5.3 million to the preserve the Ford Museum of Art in Dearborn, Michigan, and the Ford Museum of Art in Dearborn, Michigan—the largest gift ever made by the Ford Foundation. The organization also gave $405,000 to", "The next Biennial should take place in 2021 at the Stedelijk Museum in Amsterdam, and in 2023 at the Institut Rech, Zurich. “In the future, I would like to focus on developing new research and new exhibitions with a strong and diverse team,” said Neeson. “I am especially proud to have worked with and for such a talented and dedicated team at the Dusseldorf Museum of Art and its fabulous collection. I am confident that we will be able to continue to expand our work in this way as we continue to cover the history of modern art from a diverse range of sources.”\n\n\nThe Australian government has released new guidelines that outline how the sale and distribution of works by Australian artists should be regulated. The guidelines were released by minister-designate Christopher Pyne in response to a series of complaints about the auction houses that have led to an outcry from cultural figures and artists across Australia. These artists are demanding that the government take action to stop the auctions and to protect their artistic freedoms by enacting legislation to restrict the resale and distribution of works by Australian artists.The Australian Smith Museum has also come under renewed pressure to take action against the Sotheby’s and the", "The next Biennial should take place at the West Coast Institute of Art in Los Angeles in 2021.\n\n\nThe Queen Elizabeth II Foundation in London announced today that it has awarded a total of $3.675 million to artists, including Charles Ray, Benedict Cumberbatch, and Kirsten Albright. The grants, which come with a $100,000 cash prize, were made in partnership with the Royal Academy of Arts, the National Foundation for the Arts (NFA), and Tate, and address both institutional and individual challenges across art. Charles Ray was awarded $1.32 million; he was nominated for his first solo exhibition at the National Portrait Gallery in London in March 2019 and won in September. Kirsten Albright was awarded $1.5 million; she was nominated for her first solo exhibition at the National Portrait Gallery in September and won in November. Charles Ray was also nominated for his first NFA exhibition in London in 2022 and was confirmed in 2018. He was nominated for his fourth Biennial of Works in 2021 and was confirmed in 2019. The NFA will receive $500,000 for the institution’s efforts to rebrand itself as an art museum and $750", "The next Biennial should take place in 2022 and will be hosted by the University of Amsterdam.\n\n\nThe Mortal Instruments Art Foundation, a nonprofit organization that was founded by art collectors James Donahoe and Mary Catherine Murphy in 2014, has announced that it will cease operations in 2020. “This is a historic year for the arts and we are honored to be able to celebrate with you by moving to a new home,” the foundation said in a statement. They have twenty-two artists and projects in the pipeline and will continue to work with artists, galleries, foundations and nonprofits.“The foundation’s artistic director, Catherine Murphy, said: “TMAF was always about connecting collectors with artists and this year we accomplished that with an artist-centered exhibition at the Faraday Gallery in London that featured work by twenty artists from the foundation’s collection.”The museum is currently working on a series of exhibitions that will be curated by and open to the public. Among the works that are slated to be exhibited are “On the Nature of Life” (2019), “The Death of a Masterpiece: Robert Frank” (2019), “Shelter,” an exhibition of works by artists including", "The next Biennial should be held in May 2022, and a new monument should be erected to commemorate the centenary of the revolution.\n\n\nThe British Museum is planning to introduce new exhibition space and galleries in its newly renovated building at 750 Fifth Avenue in London in an attempt to address the museum’s long-standing concern with preserving its collection as it prepares to reopen in 2022. The museum is currently constructing a new wing for its collection, which was expanded to its current size in 1982, and is finalizing plans for a major revamp of the institution.“We are building a new physical space that will be ambitious, creative, and experiential,” said David Bailey, director of the British Museum.   “The new building will give the British Museum a new home for its enormous collection and will act as a hub for exhibitions across the globe. We are working with an international team to deliver a transformational experience.” The   first show of the new building will be “In the Beginning: The Making of the Modernist Museum” (September 3), a retrospective of the work of the late British artologist Roger Ebert. The title refers to a 1978 work by the British artist and thinker who, along", "The next Biennial should draw up to five thousand people; perhaps as many as six hundred of these should be from the USA; and will take place in the San Francisco Bay Area and New York City. The second iteration will take place in the city of Los Angeles, and the third in New Zealand. The fourth version will be held in the US, and the fifth in Japan. The exhibition will be relocated to the Museum of Modern Art, where it will remain until mid-March. The museum, which is currently closed until at least March 14, will reopen on March 27.\n\n\nThe London-based charity Art Aid has announced the launch of an online crowdfunding platform, Art Aid for London, that will allow donors to give £1m to artists. The initiative, which will also help the charity distribute grants and other relief, is one of several ways that Art Aid is helping the visual arts.“With the launch of Art Aid for London, we are extending our reach beyond the visual arts to support the many ways in which artists are working together to shape our world,” said Mark Serwotka, director of Art Aid. “Through a platform we believe will help artists, we are helping to foster the critical thinking and creativity that", "The next Biennial should be held in 2020, but a decision has yet to be made. The next edition of the São Paulo Biennial is slated to take place in 2021.  \n\n\nThe Museum of Natural History (MoNH) in New York has received a gift of a rare collection of prehistoric stone tools from the Kupangani people of the Democratic Republic of Congo. The artifacts—which date to around 900,000 years ago and were discovered by anthropologist and Kupangani expert Abeano Tsejal of the University of California, Los Angeles (UCLA), in 2018—were donated to the institution by Hattie and Juma Mabib, who have run afoul of some of the world's most powerful collectors.According to the New York Times, the Mabibs are renowned collectors of African art. They have previously given African works to the likes of Willem de Kooning and Pierre Cardin, but never the Kupangani. In 2018, the Mabibs agreed to sell the works to UCLA for an undisclosed sum—Kupangani artifacts are not usually sold for more than $10,000. “After a thorough search of the world, the Kupangani Heritage", "The next Biennial should be held in the spring of 2020.  Kohn also noted that the transportation industry’s role in the global climate crisis must be recognized and fully addressed. “It is imperative that the transport sector begin by rethinking how it moves carbon, and by recognizing that moving it is only half the solution,” she said. Kohn also advocated for a “zero-carbon economy” as a means to mitigate the climate crisis, but noted that “not all scenarios are the same.”“We live in a time of unprecedented crisis,” Kohn said. “And as we struggle to adapt to a changing climate, we have every reason to be hopeful. The next five years are at least as critical as the last five years to reimagine the future for our planet and our communities.”\n\n\nOn Wednesday, the European Union imposed sanctions against Russia for its alleged interference in the 2016 presidential election and for trying to block the sanctions by the United States and other states, including France, which are meant to cripple Russia’s economy and expand Western sanctions against Moscow. The move followed a slew of European Union sanctions on individual Russian individuals and companies in the weeks leading", "The next Biennial should be held in 2021, and the semi-annual should resume with the same schedule as the previous year. “We are very much looking forward to the next Biennial, and to the next exhibition,” said sculptor Virginia Haslett, who curated the first exhibition numbered in the seventy-fifth through the seventeenth centuries. \n\n\nThe Los Angeles County Museum of Art (LACMA) will resume hosting artworks in an effort to increase the museum’s exposure to the public as the coronavirus spreads across the United States. In a statement, the museum said it hopes the reopening of the museum will be temporary, and that the focus of the reopening will be “on the art, not the people,” and that it will continue to explore different ways of presenting artworks to draw more visitors to the museum.In a letter dated September 7, LACMA director May Boeve and the board of trustees wrote: “I feel it is important to note that the construction of the new museum will not substantially impact the programs and activities of the current LACMA. However, we do want to reiterate that LACMA’s mission to make the California Dream", "The next Biennial should take place at the National Galleries of Scotland.  The fifth will now be held at the Edinburgh Festival, at a date yet to be announced. The seventeenth will be held at the Art Institute of Chicago, at a date yet to be announced. The eighteenth and nineteenth will be staged at the Metropolitan Museum of Art, at a date yet to be announced. The twenty-sixth will be staged at the Metropolitan Museum of Art, at a date yet to be announced. The twenty-seventh and twenty-ninth will be staged at the MCA, at a date to be announced. The twenty-fifth will take place at the Royal Opera House, London, at a date to be announced. All of the 2015 winners will receive a lifetime achievement award, which will be presented at a ceremony at the National Galleries of Scotland, and will have their work included in the 2020 edition. The Metropolitan Museum of Art, which has been working with the National Gallery of Art to develop an exhibition schedule for the seventy-fifth edition of the Edinburgh Festival, said: “We are delighted to announce the forty-sixth edition of the Edinburgh Festival. All of the 2015 winners will be included,", "The next Biennial should be held in Oxford in 2022.  �\n\n\nThe Art Newspaper, the UK's leading arts magazine, announced today that Madeleine Glatter will become the next editor in chief of the publication. She succeeds Maureen Ryan, who has been with the publication for more than thirty years and will continue to edit the magazine, which is currently published by V&A in London.The news comes two weeks after the publication announced its acquisition of the estate of artist and writer Jane Austen. Madeleine was brought on board as editor in chief in 1999, shortly after the artist’s death, and has helped shape the publication into one of the most respected and respected art platforms in the world. She is also a recipient of the National Arts Council’s Lifetime Achievement Award for her contributions to the arts.Commenting on her appointment, Madeleine said: “I’m incredibly excited to be taking on this new role, which is both challenging and exhilarating. I’m looking forward to working with Maureen, the editorial team, and the readers to bring Austen to life in the digital age. I’m also looking forward to challenging some of the most contentious issues in contemporary art,", "The next Biennial should take place sometime in the spring of 2020.\n\n\nIn the aftermath of the deadly conflagration in Manchester, England, which claimed the lives of 22 people and injured hundreds more on May 22, 2017, the National Poetry and Fiction Writers of Britain (NPG) has issued a statement calling for the UK to scale back its greenhouse gas emissions as part of the UN Climate Agreement.The agency said that it hopes Britain will follow the example of France and Italy by reducing its greenhouse gas emissions as part of the landmark international deal reached in Paris last December. The deal—which was finalized by 197 national governments and 195 international organizations on July 26—is estimated to cut the UK's greenhouse gas emissions by between 12 and 16 percent below 2005 levels by 2030.Under the terms of the agreement, Britain must reduce its greenhouse gas emissions by 28 percent below 2005 levels by 2030 and by 33 percent below 2005 levels by 2030. The largest polluters, coal and nuclear, will continue to be subsidized while small and mid-sized businesses, including the arts and cultural sector, are exempt. The UK will also be allowed to leave the EU’s Single Market but will have to significantly reduce its greenhouse gas emissions.\n\n\nThe Museum of Modern Art (", "The next Biennial should take place in late November in early December. “As a community, we need to work together to address the key issues of climate change and climate justice, and to make the most of the biennial as a platform for social change and environmental justice. New York is at the epicenter of this crisis. We must work together to transform our cities, our climate, our climate justice.”\n\n\nThe San Francisco Museum of Modern Art (SFMoMA) has announced that it will not proceed with plans to demolish the Yuz Museum, which was completed in 1972 and housed a Chinese art historian in its basement in 2013, because of the “serious threat to the museum’s future and the cultural life of the city.” The museum’s board president, Susan Johnson, said the decision was made after the Chinese artist Zhang Yilun expressed concerns about the dismantling of the museum, which is located at 1600 Folsom Street, California, and is slated to be demolished by the city of San Francisco in January.According to Johnson, Zhang’s concerns were shared by many in San Francisco and were echoed by the Chinese American community. She cited the demolition of Ming’s former home on", "The next Biennial should take place in 2020.\n\n\nThe Museum of Modern Art (MoMA) in New York has welcomed two new artists to its collection. The institution has named Nathan Rabinowitz as its first director, and Damon Ruiz-Wang as its second. Ruiz-Wang joins MoMA in 2020 following a ten-year leadership and ownership at the Getty Center. During his tenure, the institution expanded its collection by approximately a third, added more than two hundred works by artists other than Ruiz-Wang, and added new exhibitions and performances. The museum opened a new, expanded lecture theater in the center in 2016. Ruiz-Wang is currently the founder and a director of Rabinowitz Partners, a private investment firm that invests in the art world. Ruiz-Wang will begin his new role on January 15, 2020. Previously, Ruiz-Wang served as director of the Getty Center from December 2013 to January 2019. \n\n\nThe Philologist’s Guild of America announced today that it is canceling the 2020 edition of its annual award, which honored the best collections in the United States. The award, which was presented by the Philologist�", "The next Biennial should be held in 2022, and the theme, “Mathematics and History,” will be chosen by the public, with the public having the final say of the theme.\n\n\nThe Foundation for Contemporary Art (FCA) in New York has announced that it is awarding $3.8 million in grants to artists and arts institutions through the program “Mathematics and History,” which was launched in 2014 as part of the “Cars’ Grand Tour,” a global initiative designed to highlight the contributions of artists and thinkers in the art world, among other disciplines. The program was inspired by the work of Abraham Maslow’s hierarchy of thought and movement\u0097the order of the pyramid, which was conceived as a kind of ‘monolith’\u0097and the work of artists such as Nina Atkins and Tracey Shawcross.“Mathematics and History’s funding program is the result of a shared commitment between the Foundation and our artists, who have made significant contributions to the art and culture of New York City through their art and work,” said David Gettman, president of the FCA (New York). “Mathemat", "The next Biennial should take place in the United States in the autumn of 2020.The exhibition will take place at the Smithsonian American Art Museum (SAAM), in partnership with the Smithsonian Design Museum.The theme of the exhibition will be “Architecture and Design—” and will examine the histories, theories, and practices of architects and their impact on modern architecture. The show will also explore the history of design and the contemporary aesthetic.“We have been working with SAPIAM to understand how we can collaborate with our museum in order to advance the research, presentation, and acquisition of contemporary work and art in the Pacific Northwest,” said curator Rachel Botsford. “By combining the existing collections and the show, we hope to draw attention to the evolution of the field and to inspire new thinking about the history of design.”The exhibition will feature work by seventy contemporary practitioners. Among the new works are work by Fabien Ghebaly, who is known for his artworks such as his “Léger Gauche” (2010), which is currently on display in the Kauffman Museum of Art in New York; David Bernhardt, whose early work is in the collections of the Museum of Modern Art,", "The next Biennial should be held in December 2020. The biennial will be hosted by the Berlin-based company Bauhaus Berlin and will be led by the studio of artist Stéphane Berger, whose practice spans sculpture, performance, painting, and installation.This year’s event will comprise of thirteen exhibitions of work that was commissioned by the Biennial in 2018, namely “Behind the Light of Two Systems” and “The Magic City.” The 2019 exhibition was organized by the Biennial in collaboration with the Brandsthal Museum of Fine Arts in Berlin. And the museum’s exhibition “The Magic City” is currently on view through November 21.\n\n\nThe National Gallery in London has appointed Andrew Collins as its new director. He will be responsible for running the institution’s new large-scale project, the National Art Museum (Nammo), from February 2020 until March 2021. Collins will be based at the institution’s new site in Piccadilly, London, and will take up his new post on March 31.“Andrew’s track record of success in driving audience engagement through innovative, thought-provoking exhibitions, and his ability to inspire and educate is unsur", "The next Biennial should take place in 2021. In the meantime, the institution is working to restore the ancient city of Urmia, which was dedicated to the goddess Nox, and is working with local architects to create a new exhibition space for the museum.\n\n\nThe Central African Republic (CAR) has become the latest country to secure the release of political prisoners after the United Nations General Assembly voted yesterday to lift the country’s indefinite lockdown in a 228-17 vote. The General Assembly also approved a resolution that declared the CAR a \"country of national liberation\" and called for the immediate restoration of political freedoms.The resolution passed by a vote of 193 to 2 after a rare recess following a government shutdown that began on March 23 and ended on March 26. The government is currently in the process of revamping its penal code to strengthen the power of the president and more lenient sentencing laws. The government was also criticized for failing to open and maintain its embassies in at least twenty-four countries, including the United Arab Emirates, Egypt, Niger, Senegal, and Sudan.CAR’s newly elected president, Macky Sarr, announced that there would be a three-week period for political prisoners to leave the country and that the government would begin to welcome", "The next Biennial should be held at least one year after the first one. [Update: March 8, 2018] The 2018 edition of the Biennial was pushed back to September 21, 2020. The September 21 date was chosen to coincide with the Secretaría de Cultura Biennale, which was originally supposed to open in June. It also represents the first time the festival will be held in October. For the last seventeen years, the biennial has been held in September. Its first edition was held in Barcelona in June 1993. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it plans to raise $62 million for its construction and operation through a combination of corporate donations, personal funds, and auction sales, and will begin construction on its first location in the city next month. The institution will also begin selling works and will open a first-ever residency program. #MoCA’s new building on Santa Monica Boulevard has been designated as the new home of the Museum of Contemporary Art’s board of directors. Founded by philanthropist Phil and Barbara Mikulski in 1982, the nonprofit organization is responsible for defending the broadest set of artistic, conceptual, and intellectual interests in", "The next Biennial should be in 2021, and the first will be held on the island in 2022.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has received a $92 million donation from billionaire collector Bruce Dern. The $60 million gift was made in recognition of the institution’s longtime commitment to supporting the creative and cultural life of Southern California.Dern, who founded the company that became MoCA in 1998, also purchased the rights to MoCA’s theme park in Anaheim, the adjacent Wilshire Boulevard shopping complex, and the adjacent Mission Hills neighborhood in 2009, as well as to the Los Angeles County Museum of Art (LACC) in 2012. In addition, he has donated $42 million to the museum since 1984, and in 2001, he began donating artwork to the museum in memory of his late wife, Betty.“Bruce has been and will continue to be an important donor to the Museum of Contemporary Art,” said Jennifer Teets, chair of the board of trustees, and museum director Robert Vassallo. “His generosity and passion for art and the people of Los Angeles is boundless. His gift will not only enable us to have an open and transparent conversation about the museum’", "The next Biennial should be celebrated in March 2021.The project is led by the Museum of Contemporary Art (MoCA), Los Angeles, and comprises work from more than twenty artists, including Cori Galloway (New York), Elsa Albani (Lisbon), Jean Ribas (New York), Ernest Hemingway (New York), and Walter de Maria (New York).The exhibition will follow up the ground-breaking exhibition “Morning in America” (2019), which explored American landscape and identity through work by artists such as Mary Boone, Lillian Graham, and Dorothy and Humberto Camacho, and will be the first of its kind. The exhibit will focus on “the relationship between the artist and the landscape.”The exhibition will also celebrate the exhibition “My Body” (2019), a special project by Bruce Cain (New York), which addresses the human rights of Indigenous peoples and the environment. In addition to two hundred works, the exhibition will feature the first public viewing of the work of the artist Dora Alhadeff.The Biennial will run until March 15, 2020.\n\n\nThe French Ministry of Culture and Sport has released a statement that invites the Spanish football club FC Barcelona to participate in the 2022", "The next Biennial should be held in 2020. The primes for the next biennial are March 13–March 22.\n\n\nThe Panache Gallery in Paris announced today that it has received a donation of more than 1,400 works by more than 400 artists from the collection of the late collector and philanthropist Pierre-Auguste Panache. The works are currently on display in the museum’s reopening exhibition, “Panache: Mulieux Gueules” (Paris: Mémoires du Panache), which is currently on view through February 26. The exhibition is also slated to reopen in March 2021.The works, which are predominantly from the late nineteenth century, are centered around various themes such as the future of art and art history, the political and social crisis of the contemporary world, the relationship between mind and body, and the existential. The twenty-third edition of the exhibition is also slated to open at the National Museum in Paris in May 2022. In addition, the exhibition will continue to be organized in collaboration with the Panache collection and the Paris-based NGO Colectiv.The collection also includes works by artists from the 1960s, ’70s, and ’80s, as well", "The next Biennial should be announced as soon as possible, and the first show should open in the spring of 2022. The venue’s board chair, Mike Governor, said: “We’re excited to present the next Biennial to the public, and especially to the many East London residents we have worked with over the last twenty years who have supported us through thick and thin. We are also delighted to present this exhibition in a venue that is renowned throughout the United Kingdom for celebrating the rich and vibrant arts.”The Biennial will be hosted by Tate Britain and will take place in East London from March 8 to March 10, 2022. The selection of forty artists, and forty-nine works, will be curated by Sharmini Call and will run concurrently with the London Biennial. The work of the artists chosen for the show will also be archived and can be viewed by the public.\n\n\nThe Simon Wiesenthal Center in New York has received a gift of approximately $1.3 million from the Israeli government in support of its ambitious reopening plans. The initiative was spurred by the Middle East respiratory crisis and has since evolved into a $74 million program. The funds will be used to expand and enhance the Center’s activities across", "The next Biennial should be held in 2021.\n\n\nThe J. Paul Getty Trust in Los Angeles announced today that it plans to donate $1.3 billion to research the human genome and its influence on the development and spread of cancer. The gift follows a $1 billion donation from the Getty Trust to the National Cancer Institute (NCI), which aims to help the federal government better understand the causes of cancer and how to prevent, detect, and cure the disease.“The biennial is a major step in the next chapter of our history, preparing the nation for the future, and is a critical contribution to the fight against cancer,” said J. Paul Getty Trust president and CEO Larry Fink. “This gift will advance our efforts to understand and prevent cancer and will allow us to better utilize the vast wealth of scientific knowledge that the Getty has collected over the years. This gift also recognizes the long-term importance of J. Paul Getty Library collections in the production of research and informed policy.”The gift is part of a $3 billion strategic plan that Fink released in July 2019, two months before the end of the biennial. The plan pledged $1 billion to endow the museum, including $500 million to expand the", "The next Biennial should take place in 2021; it could also organize a follow-up exhibition, “Beyond Time,” in 2020, and a biennial of work by the same artists in 2021. The ten-year plan also calls for the renovation of the Biennial Museum.\n\n\nAs part of the deal that will involve the closing of two of the city’s busiest art galleries in 2019, the Metropolitan Museum of Art and the Museum of Fine Arts (MoFA) in Boston, the city of Boston is providing $40 million in funding and tax breaks to the institutions.The $40 million grant program, which will phase out of Boston in 2022, was established in 2018 under Mayor Marty Walsh and will provide $45 million in 2019, $50 million in 2020, and $55 million in 2021. The final installment of the grant program is scheduled to amount to $65 million in 2022, with a goal of eliminating the city’s annual operating deficit by March 2022.“The Met is a major cultural institution in a thriving city,” Mayor Thomas M. Menino said in a statement. “It is particularly important that we’re able to support the museum during this difficult time, and I’m", "The next Biennial should begin as soon as possible so that the cultural district, the museum, the gallery, and the other surrounding areas can be accommodated. While the government has committed to rescheduling the exhibition, the museum is currently considering whether to cancel the exhibition—an option that the Palais de Tokyo and the Pérez Artes have also discussed but have yet to agree upon. During a recent tour of the museum, Pilar Pérez, director of the city-owned Museo de Arte Contemporáneo (MASC), said: “We want to ensure that the exhibition is possible in the best possible condition and simultaneously work in cooperation with the government to make the exhibition possible.”\n\n\nThe Canadian Museum of Fine Arts (C.M.F.A.) has appointed Kate Wood as its next chief executive and director. Wood succeeds Rodney DeCarrie, who retired in March 2019 after seventeen years at the helm of the institution. DeCarrie led the museum from 2015 to 2019, when it became the home of the prestigious Renwick Gallery, a contemporary art museum in Vancouver.During her tenure at the helm of the C.M.F.A., Wood will be responsible for promoting and advocating", "The next Biennial should be held in March 2020.\n\n\nThe Carnegie Museum of Art in Pittsburgh announced today that it is planning to shutter its permanent collection of Mark B. Evans’s works as part of an ambitious, multi-year renovation and expansion project that will include the expansion of its Exhibition Garden and the renovation of the museum’s historic building. The new museum will be positioned at a historic corner of Five Points and East Ninth Streets, in a building designed by the Pittsburgh-based firm of Black & Veatch. The museum will be completed in spring 2021 and will host forty-five exhibitions annually.“Evans’s painting The Starry Night, the Moon, and the Sun, which is a meditative, dreamlike work that is both elegiac and celebratory, is one of his most recent and most ambitious,” said David McAllister, chair of the museum’s board of trustees. “This exhibition has had virtually no previous experience in a Pittsburgh museum, and we are confident that it will shape the new future of the Carnegie.”McAllister added that the project will “provide a bold new look and feel for the building, reimagine its existing exhibition galleries, and establish", "The next Biennial should be held in 2021. “I would like to see the exhibition at the Museum of Contemporary Art in London return to the West End with a new generation of contemporary artists,” said rector Michael Gove. “The opening of the biennial should be a moment of celebration and reflection, not a reflection of the past.”The museum will commence the process of rebuilding its collection in March 2022. The Museum will inaugurate a new exhibition on the life and work of contemporary artist Rubem Duman by visiting a former factory in the city of Riga before the new museum in the city of London. In March 2021, the exhibition “Rubem Duman & the Twentieth Century” will open in The Metropolitan Opera House. Next year, the exhibition “Rubem Duman & the Contemporary Contemporary Art of the Twentieth Century” will be staged at the National Museum of Art, London. A new curatorial project, “Presenting Rubem Duman” will open at the Mathematical Society, London, in November.\n\n\nThe National Galleries of Scotland (NGA) has commissioned artist Lee Krasner to create a new works on paper about the encounter of", "The next Biennial should begin in 2022, the organizers said, and will focus on collecting and displaying objects from the artist’s extensive body of work. It will also introduce a new series of exhibitions, called “Tetranathas,” inspired by the Sanskrit term “Tetravartes,” in which the artist will depict the TIVO—the International Visionary Heart, the first museum devoted to a living work by a Sri Lankan artist—in a contemporary setting.The twenty-third edition of the Tetranathas was initially scheduled to run from November 23 to November 26. However, the organisers decided to postpone the event due to the coronavirus, which only affected Sri Lanka last year and affected only the island nation of Mauritius, where the coronavirus outbreak is centred. They said the show will move to “leaving behind the tropical climate,” and will hold its inaugural exhibition in October 2021.The live exhibition, which will be followed by a six-week run of Tetranathas’ sculptures, will be held at the Dhaka Art Summit. The Dhaka Art Summit will be relocated from Dhaka to a new multi-purpose space in the city. The", "The next Biennial should take place at the São Paulo Bienal from June 3 to June 5, 2020. \n\n\nThe Museum of Contemporary Art (MCA) in Los Angeles announced today that it is planning to create two new positions within its group of twenty-six artists, which currently comprises Pablo Picasso, Jean-Michel Basquiat, Philip Larkin, Jean-Michel Courbet, and Edith Heath, and to expand its current program by six more artists.“MCA has always sought to create new and innovative ways for artists to connect with their surroundings and be inspired by their work,” said MCA director and CEO Michael Govan. “In creating these new opportunities, we are excited to support and encourage the work of our existing partners, and to recognize the important contributions that they have made.”Govan added: “With the completion of our 2020 season, we hope that the new roles will help our artists and the MCA community continue to be inspired by the work of these artists and reflect on their own journeys with a sense of purpose. We welcome your comments and feedback as we continue our work together as a community. We look forward to announcing our new partners in the coming months.", "The next Biennial should be held in the spring of 2021. The revival of the museum is part of the Biennial 2020 plan, which will see the museum re-creations of an initial exhibition that was staged in 1853. “Biennial 2020 will not only be a landmark event for the museum, but also for Cardiff and the entire UK,” said Cardiff Mayor Alun Cairns. “I’m proud to be a part of it.”\n\n\nOn Saturday, Ohio University announced that it is planning to close all of its campus buildings in the fall and re-open with a new set of exhibitions, seminars, and other events only in the spring. The move has forced the cancellation of the spring 2020 event, which was set to take place at the school’s Cuyahoga Valley campus, and has forced the school to move the date of the event from April 15 to April 22, 2020.Today, Ohio State University announced that it is still working with the National Curator’s Association (NCA) and the Association of Art Museum Directors (AAMD) to finalize a reopening date, and that it expects to have more to say about the issue in the coming weeks.", "The next Biennial should include a selection of new visual arts and design projects, collaborations with museums and cultural institutions in Santander, Miami Beach, and other cities in Spain, and the construction of a new exhibition space with a new location in Madrid.“Conceptualizing exhibitions in this way has always been a way of keeping the work in touch with the present and, above all, with the future,” Pablo Sánchez, head of the Spanish Department for Culture and Tourism, told the New York Times.One in 20 Spaniards, or 13.2 percent of the total population, do not have a job, according to the poll, which was conducted by the Instituto de Cultura y El Espanola (ICI), in partnership with the National Association of Photographers (PAC), and was conducted by the internet-based platform ​TaraTobra. The data was collected from 1,133 individuals, who participated in two online panels, held on March 23 and March 26, and were asked how they would respond to an annual $2,000 reward given by the company for photographer Adriano Ulmer, who has taken pictures of the annual Biennale of Barcelona, the Madrid Triennale, and the San Sebastian", "The next Biennial should open in 2021, with a design by the Japanese architect Tadao Ando, who also designed the Tokyo Metropolitan Museum of Art and the Museum of Modern Art. The Tokyo pavilion will be built in a former coal and steel plant in the former industrial district of Kumamoto, which hosts the annual Art Basel show.The exhibition will feature new works by thirty-three artists, including Haruka Morey, Akira Shiro, and Satoru Takahashi. The biennial will have a total budget of $40 million and will begin in 2020.Will the show feature works that are produced in Japan or will the show be an international exhibitions of contemporary art?  The show will be organized under the theme “Fashion and the Body” and will run from January 27 to March 5, 2020. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is planning to move the exhibition space it currently occupies in the Downtown Arts District, which is adjacent to the Museum of Modern Art, to the adjacent campus of the University of Southern California. The move is part of a $1.5 billion strategy to reshape the city’s cultural landscape. “This is a monumental moment for", "The next Biennial should be announced by November. “This year’s edition is shaping up to be a major step forward,” Roberta Smith, executive director of the Museum of Contemporary Art in London, told Artnet. “This year’s show is so ambitious, featuring an original selection of work by fifty-seven artists, and there is so much that is new and exciting in the exhibition. It is a show about how art and culture can transform lives and change the world.”The show’s inaugural exhibition, “Lascaux ateliers: Essays in Absalom”, opened on September 18. The exhibition featured works by forty-two artists, including Bénédicte Savignac, Heloise Bénédicte, Agnes Martin, Claude Monet, and Pierre-Auguste Renoir. It also featured contributions from lesser known artists such as Willem de Kooning, Denis Menchaca, and Málissa Sigismondi, and included works from the collection of the S.S. Kohn Collection.An additional exhibition, “Themes of Life: Materialism and Theory,” opened on November 17.", "The next Biennial should take place in 2021. The awardees will be selected from a pool of seventy artists. Merry Rumsby, director of Biennale UK, said: “We are delighted that the jury has given our awardees their nominations in such a strong way. It is very much our intention to produce a show of these artists which is of such great breadth and depth. This is an incredibly talented group of artists, who we have worked so closely with, who have shown incredible vision and artistic potential. And it is their work, which will be on show in the exhibition, that will make the programme truly stand out.”The judges are the arts historian and curator Joachim Neugroschel, director of the Berlin art center Erasmus Haus, and the Berlin-based artist Olafur Eliasson.\n\n\nThe New York City Department of Cultural Affairs (DCLA) announced today that it has granted the New Museum $500,000 in support of its $1 billion expansion. Under the New Museum’s new $2.1 billion renovation plan, which was unveiled in October 2018, the institution will add more than seventy new works by eight new artists to its collection.", "The next Biennial should be held in 2022, and the ninety-second in January.  The biennial’s director, Richard Armstrong, stated: “We are incredibly optimistic about the future of the exhibition. We have invested a great deal of creative energy into developing, presenting and promoting the exhibition, and so we know it will continue to thrive for generations of visitors to the museum. Its exhibition-driven design, immersive storytelling, and collection of work by the eleven guests invited to participate in the show will continue to expand the exhibition’s public reach and offer an unparalleled collection of work for our thousands of visitors to San Francisco each year.”This year’s exhibition, “San Francisco: Artists, Places, and Things,” housed in the National Gallery of Art, began with a presentation of work by 41 artists from twenty-six cities and thirteen countries. It ran through March 11, 2020 and concluded with the exhibition of the show’s final exhibition in September 2020. \n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles announced today that Judith A. Spencer has been named director of its new outpost, the Meadows, which will be located in the foothills of the Blue Ridge Mountains in Northern California", "The next Biennial should take place in the town of Bali in the Bali Province, Indonesia, in mid-May 2019. The exhibition will be arranged in a way that can be experienced by everyone, including children, who is physically and mentally challenged. \n\n\nThe Picasso Foundation in New York and the New Museum in London have teamed up to raise $300 million for the arts in the years to come. In a joint statement today, they announced that they have agreed to jointly distribute the $1.2 billion in funds that were pledged by the Picasso Foundation in its landmark $6 million gift to the New Museum in 2013. “With this gift, the Picasso Foundation played a crucial role in bringing to light the greatest art of our time,” said Andrew Rickey, president of both institutions. “The Picasso Foundation is committed to supporting the teaching of the art of the twentieth century, and we are honored to play a role in ensuring that future generations continue to benefit from the extraordinary legacy of Picasso.”The Picasso Foundation will distribute the funds to the New Museum in part through an endowment; the Rockefeller Foundation will split the funds among the Smithsonian Institution, the American Alliance of Arts, and the Lynd", "The next Biennial should be selected by the board of directors of the Museum of Contemporary Art Los Angeles (LACMA). Those who wish to hold a special exhibition at the Los Angeles County Museum of Art (LACMA) must apply by June 8, 2020. “We are pleased to welcome five artists to the Biennial, and continue to work with artists in our Los Angeles branch,” said board president Géraldino Cattelan. “The selection panel comprised eight artists, including Alighieri, Georges Apost, Apichatpong Weerasup, Karla Schall, and Max Beck. The panel announced the finalists for the 2019 prize, which were announced on June 1. The 2019 winner, Ruba Gertsch, will receive $108,000, and the 2019 prize jury awarded his prize in June of 2020.\n\n\nThe Colón Museum of Art in Chile has become the latest institution to attempt to house the astronomical body CERN in its original location in the capital Santiago. Considered the world’s largest astronomical observatory, the CERN Large-scale Dynamics Laboratory (CLAD) houses nearly 6,500 scientific instruments in its ornate, glass-enclosed structure", "The next Biennial should be held in 2021. “The solution is simple: Stop the persecution and restore freedom of expression in Iran,” said Hoor Alaykul, the director of the Alazay Art Foundation.Alaykul was referring to the ongoing campaign against the reopening of several state-run cultural sites in Iran. The campaign was sparked by the reopening of the Alamo, the country’s largest cultural site, in late March. Activists also staged protests outside the country’s border with Iraq and carried out street demonstrations outside the Iranian embassy in Baghdad. The government responded by closing some of the country’s cultural sites, but not all of them, and by launching an offensive against the Islamic Republic.The latest round of censorship came after the state news agency, IRNA, reported that four artists were hit by a new law that went into effect on July 1, which requires artists to register with state authorities before the works can be exhibited. The four were Agha Raja, Reem Akram, Ahmad Rashid, and Asma Aljanabi. The law also defines a “public holiday” as any day between 7 AM and 6 PM. The four were detained on suspicion of", "The next Biennial should take place in 2021.\n\n\nThe Metropolitan Museum of Art (MoA) in New York has received a gift of more than five hundred paintings from a collection from the late Irish collector and philanthropist Noel Gilligan. The $500,000 donation was made during a three-day auction held at the museum on January 29 and January 31.“This gift represents the culmination of years of hard work by volunteers and supporters, as well as a personal commitment to the museum, as exemplified by the generous gift of an earlier work by Gilligan, “The Late Years,”“The Case of the Late Collection,” a collaboration with Steven Shepard, which was curated by the late Irish curator and collector Brendan O'Neill, and was on display in the museum’s collection galleries prior to its acquisition by MoA,” said Larry Wilkins, director and CEO of the museum. “The Late Years,” a series of paintings that explores the history of Irish art from the late nineteenth century to the present day, was the subject of “The Metropolitan Museum of Art,” a three-part exhibition that debuted in 2016. Commenting on the donation, Wil", "The next Biennial should encompass a narrative of the struggles of the artist in an attempt to understand and confront the concept of the body at an unprecedented, critical moment for our art historical and contemporary. ‘Art as History,” will be a theme for this year’s event.  The weeks leading up to the event were busy for the biennial, which celebrated its fiftieth anniversary in August. Last January, the biennial was selected by a jury of twenty-nine curators and historians from around the world. The judges were Timur Wessel, Mignon Leibovitz, André Lehnert, and Stefan Molyneux. “This is a moment of profound transformation for the world,” Ms. Li said of the award. She added: “The award marks a new chapter in the biennial’s history, one that will examine the body and the concept of art from a feminist, anti-sexist, and anti-racist, feminist and anti-imperialist perspective. The biennial’s core mission is to present the work of women artists. And as art historians we now have the opportunity to reflect back on and reflect on", "The next Biennial should take place in 2020. It would mark the seventy-fifth anniversary of the publication of the Art Newspaper and be staged at the Museum of Modern Art, New York; the Museum of Contemporary Art, Los Angeles; and the Art Institute of Chicago. The exhibition would be hosted by curator Yoko Ota, director of the Art Institute of Chicago; and director of the Museum of Contemporary Art, Chicago curator Dieter Vogel. “I have been invited to work on a biennial for the last twenty-four years, and have been working on it for almost twenty-five years,” Vogel said in a statement. “I am thrilled to be able to share this work with the world.”The article continues with a selection of biennial exhibitions organized since the publication of Artforum’s September 2008 issue, including “The Russian Years: 1965–1975” (2015), “Eleanor Blum: Einstein Among Friends” (2018), and “Cinefantastique: The Spectacular Spectacular ” (2017).\n\n\nThe City of Atlanta has announced that it is planning to spend $785 million to repair and rebuild the historic City", "The next Biennial should have been held in 2021, but was rescheduled because of the coronavirus. In a statement, the exhibition said it was “working hard to find a date that will enable us to open our next Biennial on a sustainable basis.” The museum will also be planning to establish a new community space in the city.The Biennial of Australian Contemporary Art has announced the twenty-five artists who will participate in its twenty-fifth edition, which will run from March 20 to April 10, 2020. In addition to the usual artists, fourteen new artists will receive the Biennial Award. The recipients are Catherine Ahtone, Kinsey Hall, Jochen Hauser, Jule Wange, Kayodea Do, Nita Dinathan, Tanya and Ravi Dukulka, and Kani Nadav.The full list of winners can be found on the Biennial of Australian Contemporary Art’s website. \n\nThe Metropolitan Museum of Art in New York has appointed Bryan Loury as its interim director and CEO. Loury comes to the institution from the Fernwood-based firm Leslie Lohman & Associates, where he has served as the", "The next Biennial should take place in 2020, the same year the exhibition will host the first exhibition of the new 'Toccarra-Wessex' series. The show, which is currently on view through March 21, will feature work by twenty-eight artists from fourteen countries and will present them in the Palazzo Bernardo, the Museum di Veneto, and various other venues.The 2019 event, titled “Between Worlds,” featured work by twenty-four artists from nine countries. Adeline Vassallo, curator of the inaugural exhibition, said: “We were initially concerned by the lack of male representation in the Contemporary, but we are pleased that the new exhibition will be a celebration of the diverse talents of the upcoming biennial. Many of these artists are not usually represented by the museum, but this will be their year to tell their own stories.” The curator added that the exhibition will include a “collective reflection” of the artists’ journeys, with work showing how the biennial is bringing together artists from across the globe.\n\n\nThe twenty-sixth edition of the Biennale d’Art Contemporain (BAC) will be held in the city of Borde", "The next Biennial should take place in 2020. The next edition, titled “Transformer,” will be held at the Minneapolis Museum of Art in 2021. The next iteration, titled “The Life of the Family,” will be held at the Museum of Modern Art in St. Paul in 2022.\n\n\nThe Museum of Modern Art (MoMA) has named Charlotte Ruggiero as its next director and CEO. Ruggiero has helmed the institution since 2009 and currently serves as the board chair of MoMA’s philanthropic and educational arm, the MoMA Foundation, which supports eighty-nine local organizations, including the Metropolitan Museum of Art, the Smithsonian American Art Museum, and the Museum of Contemporary Art Chicago. Ruggiero comes to the museum from London’s Tate , where she has held the position for nine years. During her tenure at Tate, she oversaw the acquisition of more than five hundred works and helped the organization raise nearly $3 billion for its flagship building.During her tenure at MoMA, Ruggiero has also served as the interim director of the museum since April 2019. During her tenure, she oversaw the refurbishment of the institution’s current exhibition space,", "The next Biennial should take place in 2021, with an opening ceremony in 2022. The twenty-second edition, titled “Institutions” will take place in a museum in Lyon in 2022 and the twenty-ninth in an unspecified future year.The 2020 event, titled “Painting in the Significance of Life,” will be staged at the Institut de la Voie in Paris, the first exhibition of its kind in the city. The museum will also present the first exhibition of its new series “Painting at Life” in March 2021.The 2020 event will be hosted by the Museum of Contemporary Art Paris, which has not yet announced a date for the 2020 edition. The early 2020 preview will be held at the Museum des Beaux-Arts.\n\n\nCYPRESS New York has announced that it is rescinding its decision to present the twenty-second edition of the Cypress Triennial at the Metropolitan Museum of Art (MoCA). The exhibition, titled “Places of Life” and curated by Karina Johnson-Kauffman, featured thirty-five works by seventy-eight artists in the exhibition. “Due to the ongoing health crisis, I believed it was essential", "The next Biennial should aim to: “attempt a long-term scientific and technological solution to the climate emergency,” the document reads.  The proposal then goes on to call for “a radical rethinking of how we live and work together.”The full list of signatories is as follows:Airport and Regional Development Association (Australia) (Australia) - 2011: 2010: 2009: 2008: 2007: 2006: 2013: 2014: \n Art Paris (France) (France) - 2011: 2010: 2009: 2008: 2007: 2006: 2013: 2014: Artist Cities (United Kingdom) (United Kingdom) (United Kingdom) - 2011: 2010: 2009: 2008: 2007: 2006: 2013: 2014: \n\nJames Turrell, the founder of the London-based gallery, Art London, has announced that more than thirty artists have joined the show in the past twelve months, and that the show will increase its attendance by 10 percent this year. The news comes on the heels of a report published by Artnet that found that the number of", "The next Biennial should be held at the University of Oxford in about three years. The exhibition will feature work by fifty-five contemporary artists and will feature the first-ever “Sensate” photomontages, at which the exhibition will be hosted.The biennial will also include a presentation of new art and plans for the future of the campus. The exhibition schedule will be announced in the coming weeks. Click here to view a featured artist’s work from the exhibition.\n\n\nThe Royal Academy of Arts (RA) in London announced today that Anne-Marie Ballard has won its Lifetime Achievement Award for her work, “The Eye of an Imitation,” which was created around a lamp that duplicates the human eye and was exhibited at the RA in London in 2017.The award is given annually to a contemporary artist who has created a work of art that has considered the relationship between the human eye and the natural world,” said Annabelle Crousel, chair of the RA. “Ballard’s work combines a lattice of rich textures and colors to create a large-scale meditation on the colour wheel, an ancient and powerful ritual that involves the eye and the eye-like", "The next Biennial should be in 2021 and will focus on the history of art in China. “Throughout its history, the Biennials have been about reclaiming the ways and the space of art,” Wang Yilin, director of the Beijing Art Museum, told the Art Newspaper. “We are grateful to the government for recognizing the importance of this area and for organizing the fifth Biennial of Chinese Art in 2021. We look forward to the ten years of the fifth Biennial and to presenting the exhibition of Chinese art in Shanghai in 2020.” The Beijing Art Museum is not alone in its quest to return cultural artifacts to China. Other major Chinese art institutions, including the Museum of Fine Arts in Beijing, the Museum of Modern Art in Beijing, and the Museum of Fine Arts Shanghai, are working together to repatriate artworks. The Museum of Modern Art is currently working with the Chinese government to secure a collection of eight thousand works by Chinese masters and is negotiating with the French government to secure a collection of more than five thousand works from the artist Marcel Prouvé.Other major US museums, including the Metropolitan Museum of Art and the Whitney Museum of American Art, are also collaborating to promote the return of artworks. The", "The next Biennial should take place in 2020. The next edition of the triennial, Art from the Biennial, will take place in 2021.  The third and final biennial, Art from the Future, will open in 2030. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Stephanie Bachman as its first director. She succeeds William Pinchuk, who retired on March 31 after four decades at the institution.“We are deeply grateful to William for his remarkable tenacity and dedication to our work,” Museum director José Otero said in a statement. “As we look to the future, we are encouraged by his vision to expand the museum’s international reach and impact through collaborative exhibitions, educational programming, and the gallery.”Bachman will take up the post on October 27. During her tenure, she will oversee the museum’s new exhibition space, the Contemporary Art Museum Los Angeles (CA), the expansion and renovation of the museum’s Central Library, the development of the museum’s online portal, and the establishment of the CA Education Initiative.Commenting on her new position, Bachman said: “I’m excited", "The next Biennial should take place in the Spring 2021. The event will be held at a new site in the city, Gotham Central, which is currently undergoing a $100 million expansion and is scheduled to open in 2022. The event will be co-organized by artist-run nonprofit the Artists’ Colony and New York–based arts advocacy organization Artadia. These three organizations—as well as the nonprofit Creative Strategies, a New York–based arts organization that launched in 2013—are working together to develop a platform for the exhibition of work by emerging and established artists. The Artists’ Colony’s March 2018 biennial, “To the Center of Everything,” featured work by artists such as Charles Atkins, Nari Ward, Beth Levey, and Michael Ondaatje.\n\n\nThe Israeli government approved plans to build a capital of the state of Israel in the occupied West Bank on Thursday, in a move that will effectively end the nearly four-decade occupation of the Palestinian territories. The legislation, which also establishes a national museum and a cultural center in the West Bank, was passed by the Knesset (Israel National Council) and is slated to be voted on by the Israeli Knesset (Israel", "The next Biennial should be held in 2020. \n\n\nThe New York City Department of Cultural Affairs (DCLA) announced today that it will no longer recognize the Tisch Center for the Performing Arts (Tisch Theater) in Queens, New York, as a cultural institution in its entirety, but only as a nonprofit that is committed to serving as a platform for the performing arts. In a statement, the department said that the decision had been made following an investigation into its contract renewal with a new entity, the Tisch Foundation, and that the organization will not be renewing the center’s contract. The announcement followed a formal investigation by the Cultural Affairs Agency, which is part of the city’s Department of Cultural Affairs, which determined that the center’s lease agreement with the Tisch Foundation violated New York’s Cultural Heritage Conservation and Preservation Act.“The government will not support the Tisch Center for the Performing Arts,” said councilman Jimmy Van Bramer, chair of the city council’s cultural affairs committee. The New York Daily News reports that the city’s court system has already awarded the Tisch Foundation $25 million in a long-term cultural preservation settlement. The center,", "The next Biennial should be held at the Noguchi Museum in Florence in March 2022. The theme for the event would be “Fontana: Paths of Dendera”.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is revamping its collection by adding fifty-six works by African American artists to its collection, including paintings, collages, prints, drawings, and photographs. The move follows the 2015 acquisition of fifty works by artist Marisa Takal, who grew up in an all-black school in Birmingham, Alabama, and studied with Charles Mitchell, T-Rex, and others.“To me, Marisa’s work is always about that blackness,” said Kunsthal Los Angeles’s curator of contemporary art, Kate Tandy. “What has been lost in the dismantling of black identity is a possibility for blackness to return.”The overhaul of the museum’s holdings was spearheaded by longtime curator and arts administrator Betty White, who first brought the works to the attention of the curators at MoCA when she commissioned them in the late 1990s. White, who also serves as the board chair of the American Institute of Art, is also the founder", "The next Biennial should be held in the autumn of 2021, the Art Newspaper reports. The biennial will be led by M. Klimt, the Polish director of the Tate in London, and will take up contemporary art from the West, including the United States, Europe, and the United Kingdom. It will also include a selection of photographs by M. de Coya, set in the form of a series titled “Culture and its Discontents.” The first exhibition will be “The Line/The Line,” a selection of works by Mies van der Rohe, which will be on view until January 25, 2021. The second exhibition will be “Terrance Reid, The Entrance,” which will open on January 19, 2021 and run until January 22, 2021. The third exhibition will be “Gerald K. Brown, ” which will open on January 19, 2021 and run until January 21, 2021, and will be held at the Museum of Modern Art, New York. \n\n\nThe Greater Middle East Council (GEME) has named Ahmed Ben-Meir as its new director. Ben-Meir comes to the organization from the Palestine Museum", "The next Biennial should launch soon. The 2018/2019 edition, titled \"Theology of Horror” and curated by David Mitchell of New York University, will be on view in January 2020.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, is planning to increase the budget of its flagship contemporary art museum by $5 million in order to invest in an exhibition program that will focus more heavily on contemporary art and more prominently on the work of historically marginalized artists. The decision to prioritize artists who are black and African American, as well as artists whose work is set in the contemporary avant-garde, was made in order to prepare for the possibility that the museum will close due to the prolonged financial disruption caused by the coronavirus.According to a statement issued by MoCA, the plan “presents a significant new opportunity to support a diverse and growing array of artistic voices through a single mission statement.” MoCA director Marc Straus emphasized that the decision to increase the museum’s budget was not made in order to make a “compromise” with the institution’s artistic mission. Instead, he said, it was made in order to “rescue the future of MoCA,�", "The next Biennial should be held in 2021, in the form of a “special exhibition.” The exhibition will be based on the theme “Anthropocene: from the Present to the Future,” with a view of the iconic, newly restored and restored-to-life, the Dome of the Rock, the Capitol Theatre and the National Museum of Australia.“We are excited to work with our partners to present the full range of Australian curiosities on display in the exhibition, with a view to sharing the exhibition with visitors of all ages,” said Jeanette Marigot, director of the National Gallery of Australia.\n\n\nThe Institute of Contemporary Arts (ICA) in Amsterdam and the Dutch National Museum of Modern Art (Nijkerijke Nederlands) have announced plans to open a new digital platform, ICA Digital, which will host artist residencies and will provide access to exhibitions and collections. The initiative will be led by artist-run studio Fotopop, which is based in Vienna and New York.The platform will launch in 2020 and will feature approximately 1,500 works by twenty-three artists, including Johannes Vossen, Giuseppe Piazza, Joris-Étte", "The next Biennial should have been held within six months of the last one. So far, no such event has ever been held. All events in our time are for show, for the sake of show. Mass smearing and celebration are not for us, but for the world. We are for the future. We are for a future without war, poverty, racism, death, hunger, and despair. We are for a future in which every person has the basic right to life and freedom at any place and at any speed as long as its possible. We are for a future that is based on solidarity and justice. We are for a future in which the problems of our world are shared and we are together until we overcome them. We are for a future in which all people are treated with respect and dignity.We demand that the Prize Foundation, the Chair of this year’s biennial, and the curators of this year’s exhibition be held accountable for not accepting the results of a true and honest assessment of the art on display at the show.We demand that the Prize Foundation and the organizers of this year’s exhibition be held accountable for engaging in an act of fraud by presenting the artworks of the artist concerned as being presented at", "The next Biennial should be held in 2022, and the next big exhibition should be up in 2021. So there you have it, folks.  Follow Tanya Lewis on Twitter @t_l_lewis and at her website www.tinamarie.com. \n\n\nConnecticut-based artist and activist Grace Bell, whose work explores notions of social justice and the body, has died at age eighty-one. Born and raised in Rochester, New York, Bell often draws on her own body to address issues of race and politics, and her work examines concepts of beauty, sexuality, and fertility in a feminist and transgressive fashion.Born Grace Bell in 1936, her maternal grandparents emigrated from Poland before she and her siblings were born. Her mother was a homemaker who supported Bell and her siblings, who were raised in a Catholic household, and her father, a lawyer, was a Yale University professor. Bell grew up in a Catholic family in the small town of Ephrata, New York, and joined the Boy Scouts, which her mother encouraged her to join. Bell attended the local Catholic school in the Bronx, where she met her future husband, the poet and activist George Bell, who was raised in a Catholic home", "The next Biennial should be held in 2021. The decision was made according to a recommendation by the commission in a meeting held last week, which was attended by the museum, the city of Milan, the Bregenz Gallery, and the civic group Giochi. The group that presented the proposal was the same group that helped shape the ten-year plan of Art Basel, which was launched to promote the exhibition industry in Europe. \n\n\nThe Hirshhorn Museum and Sculpture Garden in Washington, DC, announced today that Margot and Kenneth Schirmer will be the principal artists and designers of the 2018 biennial “Between the Sun and the Moon” and will assume the role of the inaugural partner. The commission, which will be staged at the Hirshhorn in March 2020, will include original works by twenty-six artists, including Mary Elizabeth Winstead, Catherine Templeton, David Wheeler, and Karen Schulze. The commission was commissioned by the Bechta Foundation, which is supported by the Schirmer family, and was organized by Nancy Lieberman, the foundation’s executive director.“We are thrilled that the couple will be collaborating again in the years to come,” said Steinar St", "The next Biennial should be held at least once a year. “We are eager to see how art and culture will come back together to support our city and its residents,” said David Samson, the event’s artistic director. The inaugural exhibition, which featured work by fifty-seven artists from eleven cities and the Bay Area, was held at the Santa Clara Museum of Art.\n\n\nAUSTIN, Texas—The City of Austin and Texas Instruments, the company that manufactures and supplies the microcontroller chips used in modern-day computers, announced today that they are collaborating to extend the life of the city’s public art, known as a mural, painting, sculpture, installation, or performance space. The partnership will see a series of five mega-marms, each featuring a different mural, conceived and executed by artist-in-residence Jennifer Keating.“The partnership marks an important moment for Austin, and specifically for the city of Austin’s mural program,” said Austin City Council member and Mayor Ron Nirenberg. “The project will inspire and shape the next five years of the mural program.”The partnership, which was initiated by the city’s design and architecture departments", "The next Biennial should focus on the enduring legacy of the artist-in-residence program, which receives $75 million from the estate, and develop a new public artwork to commemorate the life and work of the late artist-in-residence Hwang Soo-kyung, who was designated a national hero in the country in 2000 after he was killed by a police gun while attempting to protect an unarmed protestor during an anti-government rally in Seoul.\n\n\nThe French Culture Ministry has appointed Charles-Marie Calandra as the new director of the Musée d’Art Moderne in Paris. He is the first French person to lead the museum since its founding by Jean-Luc Moulène in 1972. Born in Marseille in 1958, Calandra is the son of a construction company owner and an artist. He studied at the Musée de l’Amitié-Paris in Brussels before completing a master’s degree in the Arts at the Paris School of Economics in 1975, where he was appointed director of the prestigious institution. After serving in the post for a decade, in 2008, he was appointed director of the Musée d’Art Moderne, a post he held until his", "The next Biennial should be held in 2022, the organizers said. The exhibition will be organized in conjunction with Interdisciplinary Art, a new group that will focus on contemporary art and will focus on the search for a new artistic paradigm. Moderator Simone Leigh, who served as the executive director of the Biennial, said: “I’m excited to see the breadth and depth of the book and the many ways in which it may transform our lives and our world.”\n\n\nThe Philadelphia Museum of Art (PMA) has received a $5 million donation from the Richard and Helen DeVos. The donation, which comes from the family, who remain close to the institution, will be used to calculate the largest gift in the museum’s history. The gift also includes the continuation of the museum’s $6 billion renovation of the building, which is currently undergoing a $3.5 billion overhaul and is scheduled to open in 2021.“The DeVos Foundation appreciates the opportunity to be a generous donor to the Philadelphia Museum of Art and the partnership with the PAO,” said Richard DeVos. “It will continue to support PAO’s mission of attracting and organizing the world", "The next Biennial should be held within the next five years.”Hassan will serve as the inaugural director of the museum, which was founded by B. J. Rylan, M. J. Akram, and H. J. Akram. The event will be comprised of a series of projects, including a retrospective of Munich’s “Sydney Punk” (2019), the exhibition “V/A Day” (2018), “Real Life: The Art of Photography” (2018), and “An Australian Photographer” (2017), among others.\n\n\nThe Art Newspaper reports that the Museum of Contemporary Art (MoCA) in Chicago has released new guidelines for how art institutions should handle protests and other activities in the event of a potential government crackdown on freedom of speech.“We are mindful of the current political climate and sensitive to the sensitivities and sensitivities of local communities and individuals,” Leslie Cook, president of the museum, told Artnet, in a statement. “These guidelines are an attempt to be as clear and as specific as possible, while still allowing MoCA the flexibility to consider the best possible response in the circumstances.”The guidelines", "The next Biennial should take place in 2020.\n\n\nThe Pennsylvania Academy of Art (PA), the Museum of Arts and Design (MA), and the Museum of Fine Arts (MoF) in New York have announced that they are jointly working together to present the next edition of the PA’s Art of the Party. The exhibition will be held at the Museum of Arts and Design until February 16, 2020 and at the Pennsylvania Academy of Art until February 19, 2020. “The work of PA and MA in conjunction with the PA Arts Center is an expression of our shared vision to bring the celebration of art in the city of Philadelphia to life and to expand the scope of the Museum of Arts and Design’s collection in an unprecedented way,” said PaArts director and CEO Tony Adams. Initially, the collaboration was announced as part of a new $2 billion PA Arts Center redevelopment plan, which aims to increase the museum’s footprint and attract more visitors to the city. The project also aims to make the Museum of Arts and Design more accessible.The new partnership was announced in partnership with PA and MA’s board of trustees, which also approved a $1 billion restructuring plan for PA last month. �", "The next Biennial should be held in 2020. \n\n\nThe National Gallery of Ireland (NIA), Dublin, has received a gift of sixty-six works by twenty-two artists, including the French Léger-Albright, the poet Jacques-Henri Léger, the Georgia O’Keeffe of California, the German landscape and urban novelist Dietrich Reimer, and the painter Jürgen Moltke, from the German art historian and collector Zbigniew Brzezinski. Brzezinski, who cofounded the museum with his wife in 1986, died last year. The institution plans to use the proceeds from the sale of works by twenty-six artists from the collection to create the next biennial for the artists.NIA director, Carmel Allen, said: “We are delighted that the gift of this century by the Brzezinski Foundation will allow us to continue to collaborate and showcase the extraordinary range of work that has been produced by our artists over the last forty years. The work of these artists is an inspiration for us all, and our staff are inspired by their stories. We are proud to donate these works to the NIA and to have been able to open their archives to the public", "The next Biennial should bring together fifty artists, creators, and academics, to examine the history of “painting,” said Christina Macomber, director of the Biennial. “It should also include an exploration of the importance of the body in our cultural landscape and a review of the art of today.”The exhibition will take up themes such as the body in ancient Greek and Roman art, the body in contemporary art, and the body in nineteenth-century cinema. The twenty-three-minute-long show will also include interviews with scholars and archaeologists, as well as a workshop on the history of medicine, the history of art, and art for art's sake, which will feature an interactive performance by Hannah Wilke and Jonathan Davis. “The Biennial is about to enter a new phase,” said George G. Hertzfeld, director of the Gallery at the University of Amsterdam. “The exhibition will reflect the real and intellectual ferment at the Gallery. New ideas and fresh perspectives will emerge from artists and academics. This is a moment of transformation for the museum, for the city, and for the country. We have the possibility of a truly radical exhibition at the Biennial, one that will be an international", "The next Biennial should also focus on the legacy of the Playwright laureate, which was awarded in 2000 but never took place. The institution plans to create a new collection dedicated to the life and work of the late author, the late artist, and many other biennial pioneers. The Biennale is currently a collaborative project between the two institutions.\n\n\nThe Southern California Civil Rights Museum (SCRCM) in Los Angeles announced that it is planning to move its permanent collection of more than 5,000 photos by the legendary photographer, and the first retrospective of the artist’s work to open in the United States since 1962, will take place at the museum in 2021.The move follows the announcement that the museum will reopen to the public in 2021 with the exhibition “Sharon Black” (2019). After years of construction and a $3 million expansion, the “Sharon Black” installation will present the first in-person visits to the work of the artist in more than sixty years.“We are thrilled that the public will finally be able to see the original works of Sharon Black,” said SCRCM director and CEO Susan Woll. “Her work has inspired and defined the art of Southern California for", "The next Biennial should be a celebration of the past, drawing inspiration from the world that we live in,” said Maureen Boisjoly, director of the exhibition. “The first Biennial was an exploration of the relationship between artists and their work, and the second is a celebration of the imagination.” The biennial will showcase works by seventy artists chosen by the jury from twenty-four countries, including Brazil, Canada, France, Italy, Mexico, and New York. The exhibition will run from March 16 to March 19, 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it is moving the 2020 edition of Art Basel to the United Arab Emirates. The move comes amid the ongoing crisis in the Middle East and North Africa. As the number of people killed in the conflict in Syria continues to rise, the museum is also facing questions about whether it should cancel Art Dubai, its annual event in Abu Dhabi.While the decision to cancel the event was made in light of the ongoing crisis in the region, MoCA director Nicholas Negretelli said he chose to move the fair due to new threats posed by global terrorism and the economic crisis it is causing. “We have worked", "The next Biennial should be held in 2021.\n\n\nThe museum in Birmingham, England, which was closed because of the Covid-19 pandemic for its first eight months, recently celebrated its fiftieth anniversary with a retrospective of work by artists who have been active since its founding in the late 1960s. Representative artists include Adrian Piper, Michael Jordan, and Ray White.“We are very excited to celebrate our fiftieth anniversary with a retrospective of some of the most important work by artists of our time,” said Ali H. Abidi, director of the Tate. “The exhibition ‘Infinite Equities’ is the cornerstone of our programme, and presents a significant new lens through which to examine the past, present and future, and of course we have a selection of works by the greats that have never been exhibited before.”The exhibition, which opened on August 23 and runs until September 27, explores the history of modernism, from the most recent work by work by Walter de Maria to the earliest works by artists such as Vincent van Gogh and Pierre-Auguste Renoir. The first Spanish-born artist to win the Prix d’Art, Juana de Castro, was selected as the winner", "The next Biennial should be held in 2020. \n\n\n\n\n\n\nQuentin de Briey Gallery (BRIE) has announced that it will temporarily close its Paris location until the end of March due to the coronavirus. The gallery will also temporarily suspend its exhibition schedule until March 18. The temporary closure is part of a worldwide strategy to reduce the spread of the virus.Through a statement on its website, the gallery said the decision to temporarily shuttered its Paris location was made after a thorough analysis of the current situation by both the health authorities and the authorities of the city of Paris. The institution said that the temporary closure was needed to allow the health authorities adequate time to make necessary preventive measures.“The public health emergency of our time has reached a critical phase,” said de Briey. “At a time when the spread of the coronavirus is becoming more widespread and the health crisis is getting worse, BRIE prides itself on being a leader in the creative and architectural fields in the fight against the virus and in developing new and innovative tools to help us all stay safe and healthy. We therefore decided to postpone our March 2019 show at BriE until the end of March, and our March 2020 show at the", "The next Biennial should focus on the legacy of Pierre-Auguste Renaud-Le Corbusier, which was founded by two friends in a Parisian apartment building in 1978. The event will host thirty-six artists, including Alexandre Auliès, Agustin Kipt, and Zalta Alshbach, and will feature a reception, a presentation, and a performance by a select group. Its inaugural edition, curated by Maurice Berger, took place in 2002 and featured performances by artists including Agnes Martin, Dali Lama, and Minas Gerais.The next iteration of the Biennial will focus on the history of the Paris region and will include ninety-three artists from twenty-five countries\u0097including Botswana, Brazil, Canada, France, Italy, Mexico, and New Zealand\u0097on February 23. The inaugural exhibition, entitled “Paris: The History of a City,” was organized by the French Ministry of Culture and Arts, the Paris Art Museum, the Centre Pompidou, the Musée Simon-A-Perrotin, and the Palais de Tokyo, and will run for fifty days.\n\n\nThe John F. Kennedy Center for the Performing Arts in Washington, DC,", "The next Biennial should include a state-of-the-art research center, an annotated list of the institution’s holdings, a new exhibition, and a digital library of the institution’s collection.\n\n\nThe newly created International Council of Museums (ICOM) has announced the twenty-five artists whose works will be included in its next edition. The full list is as follows:Adam Modell, “Race to the Top” (2017)Artistic Director and CEO of the Association of Art Museum Directors, Dick CostoloArtistic Director of the Los Angeles County Museum of Art, CaliforniaStuart Egan, “Abecom and the New World” (2015)Artistic Director of the New York Academy of Art, New YorkEdmond Saul, “America's Future: Art and the Present” (2017)Artistic Director of the New York Museum of Modern Art, New YorkRichard Avedon, “The Greening of Pop” (2018)Artistic Director of the Museum of Contemporary Art, Framingham, MassachusettsCarol Severino, “Adeline at Home: Art in Motion” (2017)Artistic Director of the Buffalo Springfield"]