["The next Biennial should be held in 2022. The museum in Berlin is currently working on a new plan for the fair. \n\n\nThe Carnegie Museum of Art in Pittsburgh has received a gift of twenty-seven works from wealthy collectors Emily and Alexander Gish. The museum opened its invitation-only, free admission gates on Monday, January 26, and has announced its intention to present a new exhibition, “Theater of Operations: The Gulf Wars,” during the exhibition. “The Gishs have created a wonderful collection of works that reflect the breadth and depth of their deep-rooted interests in art,” said museum director James Iha, who added that the Gishs intend to present the works in conjunction with a ‘festival of a thousand things.”The gift came from the Gishs in partnership with the Carnegie Museum of Art and is a project of the Gish-designed, thirty-second edition of the Emily Gish–designed “Theater of Operations”, which will run at the museum through March 26. The event will also highlight the work of thirty-five lesser-known artists and will feature work by artists such as Robert Irwin, Thomas Jefferson, Robert Rauschenberg", "The next Biennial should take place in 2020. The 2019 edition, entitled “Wu Shanzhuan and Wu Xiangwen,” opened on October 24 and ran for twelve days before it was abruptly canceled.The event was co-organized by Wu Shanzhuan, a key figure in the development of modern Chinese art and architecture, with Wu Xiangwen, a founding member of the Chinese Eight Group, at the invitation of curator Wu Shire, the founder of the Brooklyn Museum. “The Master’s Legacy: Biennial of Art and Architecture in Beijing,” which was also curated by Wu and published by the exhibition-lending platform Leighton New Jersey, received an honorable mention at the Venice Biennale last year. Wu is survived by his wife and his daughter, who were also present when the exhibition was held.\n\n\nArt museums in the United Kingdom will no longer receive funding from the National Lottery Corporation (NCC) in the event of a general strike, the National Art Gallery of Great Britain (NAGB) announced on Thursday. The decision has forced a reckoning for the British government, which had planned to rely on the NCC for around $2 billion of its $6", "The next Biennial should take place in 2021, with the first edition slated to be held in 2022. The biennial will celebrate the legacy of the late Italian architect Alessandro Nara, who created the landmark Nuva Nordica, the first architect-designed museum in Italy. Nara moved to Milan in 1936 and developed the city’s architecture in the late 1940s and 1950s, before working for the Italian government and building firms such as the modernist Beppe Grillo’s in the 1960s and 1970s.Based in Milan, Trisler is a master of Italian design who has worked in the field of architecture for twenty-five years. His works are currently exhibited in the Venice Biennale (2019), the Museum Stedelijk in Amsterdam (2019) and the Milan Sculpture Biennial (2019), and he will next be featured in a major retrospective at the Haus der Kunst in Munich next year.\n\n\nThe Italian Ministry of Education and Culture has decided to suspend the 2019–20 school year in the wake of the devastating fire that broke out in a fire at a factory building in Piedmont, in the Adige region of southern Italy, on December 29, 2019. This year’s", "The next Biennial should include an analysis of the history of Bénédicte Savoy and the French Revolution, commemorated in Paris in 2020 and 2021, respectively. The theme “Democracy and the French Revolution” will be explored in greater depth in the third and fourth biennials.\n\n\nThe Museum of Modern Art (MoMA) in New York has announced that it is planning to move the institution’s exhibition “Tom and Jerry: American Art at the Museum,” which has been on view since 2010, to the museum’s campus in an effort to raise funds for the medical-research center that has been facing a devastating outbreak of the coronavirus.The move follows an announcement last month that MoMA would move the exhibition to the Bronx, with a new opening date of March 14. While the move was criticized at the time for its financial impact, experts now argue that the move will only delay the coronavirus’s spread and make it more difficult for people to get infected. “We are aware of the impact that the move will have on our partners, our guests, and on our artists and staff,” said Daniel H. Weiss, the board chair of the New York", "The next Biennial should present a survey of contemporary art from the Americas, a CBC series dedicated to contemporary art from Europe, and a presentation of a work that will engage with current issues of environmental justice and social justice\u0097including questions of reproduction, the body, and reproduction.” Inaugurating the 20th-century museum is the museum’s first “historic reopening,” which will be followed by a reopening of the museum in 2020.\n\n\nThe London-based charity Art Fund has pledged $136.5 million to help Arts Council England (ACE) and the National Lottery Foundation (NLL) – two of the largest funding bodies in the United Kingdom’s arts ecosystem – to protect the livelihoods of over 2,500 artists and small-scale galleries in the UK.The funds will also allow the arts organisations to absorb losses as a result of the Covid-19 pandemic, which has already seen a financial blow to the UK’s major funding agencies. The losses are projected to total hundreds of millions of dollars, and many galleries are already struggling to cope. In a report published today, the Arts Council England and NLL lamented that the “immediate future for galleries is bleak,", "The next Biennial should air on the PBS channel in the United States in the spring of 2022. The US edition will be hosted by Jonathan Chait of the New York Times.\n\n\nThe Pérez Art Museum in Mexico City is planning to shutter its doors in March 2020 and rejoin the government-run institution, PAMM, in order to mitigate the growing outbreak of the novel coronavirus. The announcement comes after a public meeting of museum directors on February 7, which painted a bleak picture of the future for Mexico’s cultural sector: “We are facing a catastrophe,” said José Luis Abreu, president of PAMM. “‘Weeks and weeks of isolation and isolation are leading us to believe that things will not change.”According to the New York Times, the Pérez Art Museum is the latest Mexican institution to shut its doors as a result of the coronavirus outbreak. While the average age of the museum’s collection is now sixty-two years old, it has yet to announce when it plans to reopen. The last edition of the Pérez Art Museum was canceled due to safety concerns in February 2019, and the museum had previously projected that opening in March 2020 would", "The next Biennial should be held in the second half of the year, and will cover the campaign period between 18 and 19 March 2019. “It’s time for a new generation of artists to take up the challenge, to push the limits of what can be and what can’t be made,” said Hans-Ulrich Bienn, director of the Gesellschaft Mannheim, Germany. That’s why the museum commissioned two new works by Jen-Lin Tan and Amy Tan.Tan, a native of Nanjing, China, and the former director of Guggenheim NYC, was selected as the winner of the prize for her first solo exhibition at the museum in the Spring 2019. Her exhibition “Im Saori Oto,” which will open in the museum in 2021, is a continuation of her work for the museum.Tan’s upcoming show at the Gesellschaft Mannheim will be a “new era of the city.”\n\n\nAs artworks and installations continue to change, the public and private sectors continue to diversify, and the museum and gallery landscape continues to evolve, the National Gallery of Art (NGA) in Washington, DC, is planning to", "The next Biennial should take place in Los Angeles in 2021. The event will invite the artists who have participated in previous editions of Art Basel Berlin to present their works again at a new venue.\n\n\nThe Bahraini royal family has officially donated $22 million to the American Galleries of Fine Art (AFCA) in support of their efforts to secure the future of the Bahrain Art Museum (BAM) in Manama. The gift was made on the occasion of the organization’s fifty-fifth anniversary.Prior to the donation, Salman bin Hamad Al Khalifa, Bahrain’s minister of foreign affairs, told the Art Newspaper that the royal family had received a gift of $16 million in support of the museum. He also claimed that a $7 million donation from Prince Abdullah, crown prince of the United Arab Emirates, would be used to secure future funding for the institution.The royal family’s pledge follows the donation of $7.5 million from Abdullah in 2016 and $5 million from Prince Salman in 2017. The sum surpasses the €4 million pledged by the American Galleries of Modern Art (AGMA) in support of the Smithsonian’s National Museum of American Art last spring.“This is a monumental", "The next Biennial should be completed by the end of the year, said Lelong, who added that the city will be discussing the exhibition with the artist and the artist’s family.The curators of the show, Sidney and Donna Margolis, said: “Greg has become a true master of his craft, and we couldn’t be more excited to have him return to the city to host another edition of the show at the Art Institute of Chicago. What he’s done since the 1960s has never been equaled. . . . We are in the process of writing a new Biennial History, and will share more information with our audience this fall. We hope you will join us.”\n\n\nThe National Gallery of Art in Washington, DC, has announced that it will not be renewing its contract with the Koch brothers, the industrialists and oil barons who have bankrolled the arts institutions for decades. The Kochs gave the National Gallery $7.5 billion in 2014, the largest gift in museum history, and the institution’s board president, Deborah Blank, said that the decision was “not made lightly.” The Kochs have campaigned against the National Gallery since its inception in 1932 and", "The next Biennial should be held in 2021, when the institution will host an exhibition of fifty works, including twenty-nine works by twentieth-century masters such as Pierre-Auguste Renoir, Georges Seurat, and Thomas Dresden, among others.\n\n\nThe family-run art gallery in London that was forced to close due to Covid-19, in March, has announced that it is opening a new location in the city. The new space will be named the Family Museum. The facility will also include a theater, a library, and an auditorium. The new venue will be inaugurated with a preview of the 2017 film The Grand Budapest Hotel, starring Jack Huston as the titular role of an eccentric socialite in a post-9/11 world. The biennial will also feature new works by artists such as Mark Halperin, Van Gogh, and Jasper Johns.A statement from the gallery says: “We have had a number of requests to have the Family Museum in London stage a show for some time now, and this is a new opportunity to build on the foundation established by the contemporary artist and architect, Chris Wool. We are confident that this is the right show to help raise awareness of the threats facing the world", "The next Biennial should be held in February 2020. The 2020 edition will include a selection of works by twenty-three artists, and the 2020 biennial will be the last that will focus solely on the history of the artist-designed structures. The museum’s director, Patricia Rivers, said that the center would be “fully engaged” with the museum’s collection and the lives and work of the artists in a way that would “provide a bridge to the museum’s collection, which is the heart of the institution.” The institution will also be renamed in honor of the institution’s museum in the city of Manassas, Virginia, in recognition of its history of supporting civil rights and black artists. The announcement was made on Monday, March 3, at the invitation of Museum of Fine Arts, Boston. The announcement coincides with the opening of the museum’s 20th anniversary, “A Different Time: Avant-Garde and the Art of the Present,” which will address the work of the artists and their impact on the past and present. The exhibition will open on November 29 and run until December 1.\n\n\nThe 2018 Norton", "The next Biennial should take place in Helsinki in 2021. A spokesperson for the 2020 event told the Art Newspaper: “We will continue to follow our artistic and cultural goals in an ever-changing world.”The full list of participating artists is as follows:BØRNS (Germany)ArtsOttawa (Canada)Art Gallery of Ontario (Canada)Barenblad (Denmark)Art Deco (Canada)Art Deco/Michigan (USA)Barenblad II (Denmark)Art Deco/Michigan (USA)MassArt Deco (USA)Art Deco/Michigan (USA)Bijon (France)Charles-Auguste Sauss (France)Burke Stenote (USA)Campo Villa (Italy)La Marza (Italy)La Scala (Italy)La Scala II (Italy)La Scala University (Italy)Campo Villa - Instituto di Architettura (Roma)(Italy)Campo Villa - Instituto di Architettura (Roma) (Italy)CAMPUS (USA)CAMPUS, NEW YORK, VENONA (USA)CAMPUS, NEW YORK, VENONA (USA)CAMPUS", "The next Biennial should take place in 2021. While the 75th Anniversary of the institution is in the planning stages, the museum is currently refurbishing its former grand staircase and is preparing to open a new, 250,000-square-foot space to house its collection.\n\n\nArt historian and curator Ayao Asobi has been named the winner of the 2019 Juilliard Prize. The biennial will present the artist with a prize that will be presented to a contemporary artist whose work embodies the themes and ideals of the Juilliard School. Asobi’s installation The Elegant Labyrinth of Mimi, 2019, a work that incorporates photographs, paintings, and sculptures that were stolen by her, was selected for its evanescent journey through the Parisian art scene, which was constructed around her, by composer Dan Hauser and the composer Wolfgang Tillmans.“We are honored and thrilled by the award of the 2019 Juilliard Prize to our panelists, Ayao Asobi and Joseph Beuys, and the great success of the exhibition,” said panelist Megan L. Williams. “Ayao Asobi’s work embodies the themes of the prize, while simultaneously challenging the conventions", "The next Biennial should take place in the middle of the city, in the old city, in the center of the capital, and should be a celebration of the diversity of our city\u0097we must honour the diverse communities in our city.” The 2020 iteration of the exhibition, titled The City, is currently on view at the Museum of Fine Arts, Boston. \n\n\nThe German artist Albrecht Dürer, who was a tireless advocate of the arts and a pivotal thinker about art and material culture, died on December 3 at his home in Berlin. He was ninety-four years old.Dürer was born in Vienna in 1932 and moved to Berlin in 1943. He studied with the master Lechner, who taught him to draw, and some of his earliest goals were to become an architect and a sculptor. He went on to study with Friedrich Hegel, the Austrian philosopher who inspired Dürer to become a sculptor in the first place, and studied with the Swiss master Auguste Rodin and the Russian masters Konstantin and Vladimir Ilya Aleksevich in Moscow. Dürer’s earliest commissions included the construction of a Milanese-like Viennese town in the city of Kas", "The next Biennial should begin in January 2021 and will be based in the center of the city. The venue will be renovated by the French architect Jean-Luc Filloux, of the collection Lecrae, and will host 150 exhibitions, which will be curated by the exhibition team and led by the artist. The concept of a biennial has been around since the 1960s. Its first edition, in 1989, featured work by fifty artists from thirty-eight countries. The exhibition was also co-organized with the United States and the United Kingdom, which organized the first Biennial of the Americas in 2001.In a statement, the biennial said: “The new format of the biennial allows to present artists who are still working or have yet to be considered; allows them to participate in dialogues with other artists; allows them to share their experiences in the field of performance and architecture; and allows them to participate in the development of a new kind of performance, which will be more sensitive to the social, cultural, and political situations.”\n\n\nFrieze announced today that it has awarded winners of the inaugural Emmys for Drama, Theater, and Music, which celebrate performances in films, television, and/or dance, $50,", "The next Biennial should take place in January 2022. The exhibition, which will be hosted by Zaha Hadid Architects, will be on view until January 21, 2022. An exhibition of work by thirty-one artists will be staged at the same venue in January 2022. The new Triple Threat, a new venue that will be dedicated to contemporary art and a Visual Arts Centre, will open in the summer of 2022.Regional Cultural Initiatives\n\nThe first phase of the Regional Cultural Initiatives in São Paulo, Brazil, has announced that it will present nine exhibitions in 2019. The exhibitions, titled “Spiral and Sporadic” and “The Art of Loafing,” will be held at the Museu de Arte de São Paulo (MASP), the historic city in the state of Minas Gerais, in the center of Brazil’s capital; at the Museu de Arte de São Paulo (MASP) in the state of Minas Gerais, in the state of São Paulo; and at the Museu de Arte de São Paulo (MASP) in the state of Rio Grande do Sul.Based on a theme of “cultural", "The next Biennial should take place in 2022. \n\n\nThe Museum of Art (MAA) in New York has come under scrutiny for barring a group of Australian art historians from presenting a seminar on twentieth-century Australian art at its institution in protest of an upcoming exhibition by the American curator and scholar David Schlemmer.The international exhibition “The Future of Art: Sol LeWitt and American Art” has been widely panned by critics for excluding Australian art historian David K. Gallaway from the exhibition. The twenty-five artists featured in the exhibition are Amara Abidi, Alex Gibney, David Frank, Jason Greenberg, Thomas Harris, Neil Gaiman, and Jane Hadden, along with thirty-nine other artists from the United States. Gallaway’s recent exhibition at the Museum of Modern Art in New York includes “Exhibition: American Art: The Future Is Now” and “The Future Is Not What It Used To Be.”The Australian pavilion has been accused of excluding Gallaway from the show by announcing that it would have her participation terminated if she did not sign an undertaking that commits the artists participating in the show to “continue their work in accordance with the theme and", "The next Biennial should take place at some point in 2019, with a view to 2022.The biennial, entitled Wu Shanwei: The Hidden Life of Ai Weiwei, will feature artist installations, performances, and performances, as well as artifacts from the artist’s extensive collection, including a collection of paintings, sculptures, prints, photographs, architectural models, and lithographs; works that depict the artist’s life, at the time of his death; and works that have never been on public view. Cultural commentator Xu Wei, who was curator of the exhibition, described the materials as “truly uneven;” noting that the exhibition “was a struggle to read the art and to understand the artist’s thought processes\u0097what he believed.”He added: “The exhibition was an attempt to follow him within a wide and complex artistic universe, to see his work with a human eye.”The exhibition also featured a series of paintings by two artists that have been missing since the artist’s death: Zhuang Xianghui and Li Hui, both of whom were featured in Wu Shanwei: The Lost Art of Ai Weiwei, and Ting Tianming", "The next Biennial should take place in 2020, and the first in 2021. In order to ensure a fair that is relatively affordable for the general public, the organizers are proposing that the event be held in the city’s historic Charles Lindbergh Field House, which is currently being renovated. The new venue will also feature new installations by internationally recognized artists, including Konrad Mies, Peter Schäfer, and Anita Loos, as well as a new program for adults.“We are confident in the ability of our artists to create new and influential works of art and in the vitality of the city of Boston,” said Bob Lanza, cochair of the fair’s inaugural committee. “We are also convinced that the museum will thrive under the leadership of a visionary director, and that the vibrant creative community of Boston will flourish under the direct and strategic guidance of a visionary director.”\n\n\nThe DiMasi Foundation in New York City has received a gift of sixty-four works by Andrea Bocelli, including twelve works by the Italian Jewish painter Antonia Brancatelli, as well as a selection of works by artists from the Italian sub-Saharan region. The donation includes some twenty paintings by the late", "The next Biennial should be arranged in the autumn of 2020. The artistic director of the Art Museum of Toronto, Carsten Knöppel, stated that the museum would \"probably\" have a second exhibition per year. The organization has also announced that it will hold a series of programming in 2019, and that a new exhibition, “Cognitive Dissonance,” will open in late spring/early summer 2020. The museum’s board chair, David Trinidad, added: “We are really excited about what is on the horizon. We are confident that when we open in 2021 that we will be able to present a truly extraordinary exhibition.”\n\n\nThe Tela Museum of Modern Art (TelaM) in New York announced that it has received a gift of more than five hundred works of North American art from the Oklahoma City Museum of Art (OKC Museum of Art). The donation includes works by artists such as Nathan Gard and Etta Johnson, who were featured in the fourth exhibition of the museum’s “Back to the Future: Nathan Gard and Etta Johnson” (2017–18) as well as works by artists such as Carl Wechsler, Stanley Donwood, and", "The next Biennial should take place in 2025. According to the Los Angeles Times, the venue will be relocated and will be reconfigured to allow for a new exhibition, “Beyond the Body: From Science Fiction to Contemporary Art,” which was to be held in 2018. While the biennial was supposed to draw thirty-five thousand people, organizers are concerned about the risk of a collapse of the art-world calendar and are considering a 2020 event. “I’m hopeful the biennial can be a catalyst for social change, both in the United States and internationally,” said Leslie Klein, director of the Art Institute of Chicago.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines for the display of works by fifty-six artists and collectives in the city’s public spaces during the annual Arts and Culture month. The forty-eight-item document outlines the artists’ expectations for the day\u0097and the public space in which they will display their work.“Cultural heritage is central to New York’s identity and the vibrant creative life of our city,” said city cultural affairs commissioner Tom Finkelpearl. “The DCLA encourages a robust,", "The next Biennial should focus on the interconnections between art and politics and the interdependence between people and the environment,” said Saadia. “The next two years should also focus on the interconnection of ideas and art, ideas and art and people, and art and art and politics.”\n\n\nThe Institute of Contemporary Arts (ICA) in the City of Los Angeles announced today that it is suing the state of California to stop the construction of the $2 billion iBar, a $2 billion mixed-use condominium and exhibition complex designed by the Chicago-based architects Wangechi Mutu and Richard Rech. The ICA claims that the iBar will violate the California Environmental Quality Act (CEQA), which would require the building to reduce its greenhouse gas emissions.“The construction of an iBar threatens to exacerbate California’s already severe air quality problems,” said ICA CEO and founder David A. Liebman. “CCEQA requires that we reduce our emissions while simultaneously preparing for and responding to future threats. We’re not just building a greenhouse, we’re burning it.”The insurer plans to sue to try to stop the California Environmental Quality Act", "The next Biennial should take place in 2022, according to Dezeen.\n\n\nThe National Museum of Fine Arts (NMFA) in Louisville, Kentucky, has received a gift of more than 5,000 photographs by John Hay. The National Foundation for Photographs has announced that it has gifted the institution more than 3,000 photographs that will be used in creating a new work by the photographer and a new exhibition that will open at the museum next month. “The photographs in this gift are a significant milestone in our journey to create a collection of John Hay’s work,” said David Riehl, director of the museum. “While the gift of these works is a large accomplishment, it is by no means the center of his career. John Hay, in addition to making a number of important contributions to photography, was an indispensable teacher for thousands, a mentor for thousands, and a friend for thousands more.”The works, which will be presented in a new exhibition, “John Hay: The Photography Place,” will comprise work by twenty-four artists, including Jeff Koons, Eric Fischl, John Gallagher, John Gallagher, John Edwards, Laurence Haddon, Manfred Koons,", "The next Biennial should also examine the current state of Black art and would-be practitioners, such as Najwa Jordan-Hood, Marik Al-Shihab, and Aluna James Naipaul. “The current exhibition-focused landscape lacks a critical mass of artists of color,” said Marilynne Vielmetter, founding director of the Biennial. “The next Biennial will bring more vibrant, thought-provoking, and, I believe, more accessible art to the forefront of the conversation about art and race.”\n\n\nThe Museum of Modern Art (MoMA) in New York has been forced to scramble to organize a special exhibition dedicated to the legendary artist Herbert Bayer, the pioneering German Expressionist whose signature painting-and-video works invoke the birthing mythologies of Black children. The 2019 exhibition, “Hermann Hesse: Fall of a Time,” will take up the theme and will air on April 11–April 20.Museum director Elizabeth Kaplan said: “We are deeply saddened that this exhibition will not explore the artist’s legacy, but rather will center around his work’s relationship to the ‘fall’ of a time. For hundreds", "The next Biennial should be held in 2021, and it will be a further year before the next edition of the Art of the Party will be staged in the city.\n\n\nThomson Reuters is launching an initiative to support the arts and culture sector in the United States through a variety of grants and loans. The initiative was developed to advance the goals of the “Creative Class” grant program, which was launched by the Mellon Foundation in 1986 to encourage the collection, exhibition, and distribution of art of a certain type. The initiative aims to’taint the cultural landscape with art; stimulate the financial and financial-services sectors; and provide technical assistance for nonprofit organizations that are working to create and preserve artworks.“We are delighted to support the work of artists and cultural organizations working across the United States and to have their voices heard by the biennial jury,” said Renee Yoshida, director of the Whitney Museum of American Art. “The jury is impressed by the breadth of the portfolio and the artists’ ability to present their work to the world, and their ability to arrange and adapt art to suit their needs. They also appreciate the depth of the collection and exhibition of work done by an eclectic group of artists, and", "The next Biennial should focus on the role of artists in the shaping of popular conceptions of art and culture, with an emphasis on the social, political, and economic conditions that shape and shape cultural discourse, and how these conditions shape and shape cultural practices. The project should also consider how biennial artists are affected by the current political and social climate in the United States, Europe, and throughout the world.”\n\n\nThe University of California, Berkeley, has received a gift of more than one hundred works by renowned Israeli artist Ilan Pappal, who passed away from cancer in New York yesterday at age fifty-nine. According to The Times, the gift includes a collection of work by Midge Ulf, a series of photographs that illustrate a yearning for a certain type of urban environment, and several works by the artist who lived a life of intensity and openness.Pappal’s wife, Mary Beth Pappal, told the New York Times that the couple began working together in 1988 as a husband and wife team. The pair were married in a civil ceremony in New York City’s St. Mark’s Cathedral on December 21, 1989, and had their first child at the hospital two years later. The couple had two", "The next Biennial should be held in 2021. \n\n\nThe Museum of Contemporary Art (MoCA), the Museum of Modern Art, and the Whitney Museum of American Art have announced their plans to merge. The move follows inquiries from local government officials and activists concerned over the potential impact on the environment and on jobs. During an interview with the New York Times, William C. Dietz, the president and CEO of the American Alliance of Museums, called the merger an “unconscionable deal.” He said that the museum’s trustees “should have known better than to give the Chinese a prominent role in the museum’s collection; should have known better than to give the museum’s management a huge cash infusion; and should have known better than to sell off the most important collection in America.”According to the New York Times, the Chinese government approved the merger on August 27, but the companies had until then been negotiating with the states on whether the two entities should merge. New York City, which is already a major donor to the arts, is expected to benefit the largest in both cases, with the Chinese government giving $1 billion in grants and the private sector providing the capital and labor", "The next Biennial should be held in the fall of 2022.”\n\n\nThe Museum of Contemporary Art (MoCA) in New York has released plans for a massive renovation and expansion of the museum that will include the museum’s first-ever performance-based exhibition. The ambitious event will take up the themes of “Ideas and Performance,” “Being and Performance,” and “Performance and Ideas.”The MoCA Experience will showcase artworks and collectives created in the museum, which is currently undergoing a $1 billion expansion that will include the MaRS Science Center and the Metropolitan Museum of Art. The project will also include the development of a new master plan and a new curriculum.“The museum is currently undergoing a $1 billion renovation, and the project is currently in the planning stages,” Gordon Huggins, director and CEO of MoCA, said in a statement. “Our staff and our artists are excited about the expansion and the new themes to the museum. MoCA has always been about creating a dynamic environment where the museum can continue to thrive.”MoCA is currently working to secure funds for the project, which will involve the construction of a new forty-five,", "The next Biennial should include a retrospective of the work of the last five decades, during which time the institution has produced more than two hundred exhibitions and nearly five hundred books. It should aim to explore the relationship between art and technology. “Art is very much the future of human society,” Nomaa Naim, director of the , told the Art Newspaper. “The future of Art and Technology is the future of the committee. ‘Art and Technology’ should be the foundation of all future art and technologies. We try not to talk about the future in terms of the past but about the future in terms of the future. This means that Biennial should be a time of inquiry into the future.”For the past thirty years, both Nomaa Naim and I and the committee have collaborated on a biennial exhibition program, which focuses on the exhibition of contemporary art. In the past five years, we have presented thirty exhibitions at the gallery, which is located in a historic building in the cultural district of the city of Beersheba, and have presented twenty-five books. The next Biennial will be a reflection of both of our projects, and will bring together authors, art collectors, collectors of contemporary art", "The next Biennial should take place in 2020 and will focus on the history of the Duomo, with a view to the future. The full list of participating artists is as follows.ANNEX/BUILDING for the Biennial:Adeline Brescia, Beppe Grillo, Michelangelo Antonioni, María Berrío, Harald Szeemann, Filippa Keller, Peter Karl, Ann-Marie Krijno, Wolfgang Pfeifer, Jean-Michel Clous, and Joris van de Leeuwenhoven.The exhibition will be organized as follows:The theme of the exhibition will be “In Praise of Symbols: The Foundations of Modern Art”The exhibition will also feature the work of artists whose practices emphasise the symbolic and will be organized in a way that allows cultural exchange, community engagement, and a chance to become immersed in the work of the selected artists, as well as also the exhibitors. The exhibition will feature a selection of two hundred works by Curzon Samsara (1905–1977), a contemporary artist who was influenced by the late Russian surrealist sculptor Stepan Polotsky (1938–1981). The exhibition will draw from an", "The next Biennial should also consider the possibility of an expansion of the work in a way that would involve the participation of a wider range of artists and groups, especially those that have historically been excluded from exhibitions, and that would engage with cultural histories that are otherwise closed off to the public. \n\n\nThe Museum of Fine Arts (MFA) in Atlanta has received a gift that will allow the institution to create a large-scale work in the form of a large-scale installation. The gift is a 1,800-foot-thick Intuitio sculpture that will undergo a major renovation at the museum, which opened in 2008 in the historic downtown Atlanta neighborhood of South Fulton.The work, titled Arista, is a composite of the native and exotic Indian art and sculpture of Ashtanga, creating a hybrid of poetry and myth. The work will be installed in the museum’s new, larger venue, the National Museum of Art, and will be inaugurated by a new performance series called the National Women’s March.The work, which was commissioned by artist Harry Callahan and was created in collaboration with artist-in-residence Karla Edin, was created as a response to the divisive presidential election in the United States", "The next Biennial should aim to present a new and international view of an ancient city, which will showcase the work of the sixteenth-century Italian architect Gio Ponti and the work of the fourteenth-century Spanish architect Hieronyma Halperin\u0097the latter of whom are currently in the process of putting the final pieces together.\n\n\nThe California Academy of the Arts (CalArts) in Los Angeles announced its representation of the Carolina Herrera-designed, 5,500-piece muralist, Sculptor-Literature, Cervantes, in its next season. Curated by Jane Panetta, the Biennial for the Arts will run from April 5 to April 7, 2020.The project, known as the Carriageworks, was conceived by Alicia Rodriquez and Erica Panetta at the Selenía Art Museum in Madrid and the Mojave Desert. The pair’s other works for the exhibition include the monumental, nine-thousand-work, the Anaconda Renaissance, and the mammoth, 10,000-work, the California Dream.“In this dynamic and ambitious decade, we are rethinking the formal boundaries of the Los Angeles County Museum of Art and celebrating the many history-making contributions to", "The next Biennial should be held in the spring of 2022.\n\n\nThe London-based independent curator Russell Hoban has announced that he will step down from his position as director of the Jersey Museum after a ten-year term, effective February 20, 2022. He will assume the role of interim director until a successor is appointed.Hoban first enlisted the help of the museum to create a new exhibition for its forthcoming season of “Meg & Ma” (2018–19) when the duo behind the curatorship, Bethany R. and Martin R. Scott, announced that they were retiring after a decade. Hoban, who has curated the show twice, said: “I’ve been involved in the museum for ten years and I’m very proud of every aspect of it, but the biggest challenge in creating a new show for 2019–20 was the timing.” He added that the museum has had successful seasons in recent years and can continue this trajectory into the future.Hoban has been a curator at the Jersey Museum since 2003, when it was still known as the Jersey Science Museum. His work has been presented at numerous international exhibitions including the Venice Biennale and the London and London Film Festival", "The next Biennial should be held in 2020.\n\nThe Biennial’s director, John Baldessari, confirmed that the selection committee was made up of three judges: Lee Risiker, a professor of art history at the University of California, Los Angeles; Olga Mili, a curator and former director of the Los Angeles County Museum of Art; and Daniel Pfeiffer. Pfeiffer is currently the director of the San Francisco Museum of Art.Risiker, who is currently a visiting scholar at Columbia University, said that the exhibition would “pour over the work of art in the exhibition by artist, artist, and artist-in-residence,” adding that the biennial will not “sensitize” the public to the history of the work, but will “reproduce an authentic art history of the Los Angeles County area.” The exhibition will feature new works by fifty-two artists and will run for fifteen weeks.The inaugural exhibition was organized by the Museum of Contemporary Art, Los Angeles (MCA), and the Los Angeles County Museum of Art (LACC). The events of this year’s edition, “Theoretically and Verbatim,", "The next Biennial should be held in 2020. “The future of the arts and culture in the city lies in the hands of the public, and the public has the right to know the truth,” a statement from the city reads.In an effort to mitigate the city’s financial impact as it works to address the coronavirus, the city is offering several incentives to organizations that would sponsor international artists for its biennial. Among the offers that will be made in the coming months are discounts on admission to the biennial; free admission for city residents; and free admission for non-residents. For those interested in sponsoring an artist for the upcoming edition, the city will be offering several opportunities beginning in April. \n\n\nThe National Gallery of Art (NGA) in Washington, DC, has released guidelines on how it will display a “soul-searching” “crisis.” According to the Washington Times, the guidelines—complementing the museum’s new six-point plan—are meant to illustrate the NGA’s commitment to “deeply civic engagement” and its stewardship of the National Endowment for the Arts (NEA).The guidelines note that the institution", "The next Biennial should take place in 2021 and was scheduled to run between December and February. The organizers have already decided to postpone the exhibition, which will include the works of twenty artists, and have requested that all events be postponed until March.“We understand this will be a challenging situation for many of you, especially for those who are unable to work, and we are deeply sorry for the inconvenience,” said Hannah. “We will ensure that new exhibition programs and programming that will be presented in 2021 can be organized without disruption to the exhibition schedule. We will work with our partners, including the Association of British Art Museum Directors, to re-evaluate our exhibition schedule so that it is in line with the biennial. We would expect any fair or other major exhibition to have a strong show by the end of the month, but this is an unprecedented situation.”\n\n\nThe Museum of Fine Arts (MFA) in Boston announced today that Meg Langham, who currently serves as the Museum’s curator of modern and contemporary art, has been named the next chair of the board of trustees. Langham joins the MFA board of directors from the Art of the Acts, an organization dedicated to advancing public understanding of art", "The next Biennial should be held at the Capital Institute of Art in Nagoya, Japan.  The fifth Winter/Spring edition of the Biennial will be held at the Kunsthalle Basel, Berlin, from March 26 to March 28, 2020.\n\n\n\n\n\nLisa and Ian McManus, the founders of the London-based art-world construction studio Space, have been named the new directors of the firm, which boasts a studio in the city, as well as in Manchester and New York.Their new positions come with a severance package valued at up to $4 million. The gift also includes a new exclusive agreement with Tate Britain, the European partner of the McManus’s business.“Our board appreciates the support of the Tate for moving to a new model and for supporting our artists, but it is a new model and, we believe, a model that is challenging the current relationship between the Tate and the state,” said Lisa McManus. “This is a transformative moment for the Tate, a transformative moment for our artists and the entire world.”Commenting on the gift, Tate director Maria Balshaw said: “We’re thrilled to welcome the Mc", "The next Biennial should take place in 2021 and will be sponsored by Art+Biot, the city of New York, and the artist-run nonprofit Biot BIO, which will collaborate with and commission artists across the city. According to local news outlet the New York Times, the exhibition will have a budget of $15,000 and will be led by the artist-run nonprofit BIO. The event is being organized by the artist-run nonprofit nonpartisan nonprofit Art+Biot, which was founded in 2011 by the artist Hayley Wunsch.In a statement, the Biennial said that the decision to cancel the exhibition was made in light of the Covid-19 outbreak and the uncertainty surrounding healthcare. It added that the cancellation of the exhibition was not related to the upcoming Art+Biot Art+Biot Awards, which will be held at the new Museum of Modern Art in the fall of 2021. The exhibition will still be held, and will resume in the fall of 2022. The full list of participating artists is as follows:  Claudia Benitez (Spain)Esmeraldo Bonisano (Italy)Lorenzo Borghese (Finland)Junin Seti (United States)Jionni", "The next Biennial should take place in 2021 and it will mark the seventeenth edition of the exhibition. This year’s edition will be a major milestone as it will mark the 150th anniversary of the French Revolution. The venue will also feature a major re-creation of the Revolution and the Battle of Algiers, as well as a new interactive program that will present the works of Marc Chagall, Henri Matisse, and Pierre-Auguste Renoir. Views of the exhibition will be enhanced with a new digital installation of the show—released by the Biennial of the Exhibition of the Exhibition of the Exhibition of the Exhibition of the Exhibition of the Exhibition of the Exhibition of the Exhibition of the Exhibition of the Exhibition of the Exhibition of the Exhibition of the Exhibition of the Exhibition of the Exhibition of the Exhibition of the Exhibition of the Exhibition of the Exhibition of the Exhibition of the Exhibition of the Exhibition of the Exhibition of the Exhibition of the Exhibition of the Exhibition of the Exhibition of the Exhibition of the Exhibition of the Exhibition of the Exhibition of the Exhibition of the Exhibition of the Exhibition of the Exhibition of the Exhibition of the Exhibition of the Exhibition of the Exhibition of the Exhibition of the Exhibition of the Exhibition of the Exhibition of the Exhibition of the Exhibition of the", "The next Biennial should take place in 2021 and will be hosted at the London-based nonprofit Creative London. The four-day event will involve lectures, residencies, and exhibitions and will take place at the organization’s new headquarters in the city. The theme: “Culture and the New Humanities.”Culture and the New Humanities is an initiative of the Privy Council and the London Art Institute (LII), which aims to bring together twenty-five artists to create a new platform for artistic exchange between the UK and the US. The artists chosen for the program include Denell Dodds, Paul Eiding, Paul Cox, Mike Leigh, and David LeBoeuf.The art institution will present an exhibition of work by twenty-five artists at its new headquarters in the city in the fall of 2021. The Biennial will also present an online version of the exhibitions in 2020 and 2021.The biennial will run concurrently with the 2020 London Art Festival and will take place at the newly refurbished Tate Britain. The new facility is part of the £4 billion regeneration plans for Tate Britain, which includes the construction of a new building and an expansion of the Deansgate Science Centre. The Deansgate site will also host", "The next Biennial should assemble a group of artists whose work has been previously presented and will be given a platform to present their work at the museum. A new exhibition of work by artists from the Philippines will also be organized. The 2018 edition of the event, titled “Update: Arts, Culture, and Politics,” was held in December and was attended by more than 2,500 people.\n\n\nThe National Alumni Memorial Society (NAM) has issued a challenge to the universities of the United Kingdom to create an enlarged, permanent collection of the nation’s high school students. The organization, which is not affiliated with the universities, launched the initiative, “The North-South Path,” in an effort to bridge the gap between students and the institutions that they attended. The project aims to raise $50 million for NAM and has received $7 million from the National Lottery Heritage Fund and the Royal Association of the British Architects. The challenge was inspired by the history of the eighth-grade students at the Royal Academy of Arts, where the Royal Shakespeare Company, the National Poetry Academy, and the National Poetry Vocal Corps live and perform. The organization also received $1", "The next Biennial should take place in the coming years, and the full list of participants will be announced in 2020.\n\n\nThe Museum of Fine Arts (MFA) in Boston is planning to reduce the hours of two of its most popular summertime programming in an attempt to save money over the course of the next two years. The changes will begin on June 2 and run through December 22.“In the coming months, we will discuss with our staff and the public how we can create the most cost-efficient and best use of our available resources,” said David H. Koch, the director and CEO of the MFA, which has recently experienced a decline in visitor numbers due to the Covid-19 epidemic. MFA director Max Hollein said: “The creative and administrative team is hard at work reviewing and evaluating everything that could impact on the quality of the MFA’s programming. We will continue to listen and listen, and we will consider carefully the possible outcomes.”The deadline for the staff consultation was announced on August 28. Since then, Koch said that he had consulted with the board of trustees and staff, as well as with the public, and made the decision without consulting with the other two trustees—David", "The next Biennial should be held in 2020.\n\n\nThe Pérez Art Museum (PAM) in Mexico City has appointed an ex–student and aspiring artist as its next director. Alberto Baraya is the founder and CEO of the Pascual Art Museum (PAM), a nonprofit organization that was founded in 2017 by students from the city’s prestigious Universidad de los Andes, which is a major cultural attraction in the city of Puebla.Baraya, who is twenty-two years old, most recently served as director of PRIMARY CENTRAL, the Pérez art market, and PRIMARY PRESENT, a tourist attraction that was inaugurated in the city in 2015. During his tenure, in 2016, the Pérez Art Museum received thirteen million visitors, and in 2017, it was awarded the the prestigious Santiago de los Orantes (2019) award for the best contemporary art institution.Baraya’s current project, “Entre deas,” will open in the early 2020s. The institution will draw from the same collection of works that was acquired by the Pérez Art Museum in 2003, and will develop an exhibition program that will illustrate a broader range of Pérez", "The next Biennial should take place in the spring of 2020, and the first in the fall of 2021. This will be the first of three conceptual iterations, the other two being Sara and Richard Meier’s work in the spring of 2016 and the fall of 2017.\n\n\nThe Museum of Contemporary Art (MCA) in Los Angeles has received a $500,000 donation from the iconic Michael Jackson Foundation. The gift, which comes from the Jackson family, comes a little more than a month after the foundation awarded $500,000 to ten artists, including Illma Gore, Rachael Boubier, and Max Hanlon, who were shortlisted for the prestigious $25,000 Jackson Prize. The ten shortlisted artists, who will receive $75,000 in support of their creative projects, were then asked to present their works at a special awards ceremony at MCA on April 23. “There is a deep connection between Michael Jackson and our prize-winning artists, and we are thrilled that these will be the themes of our next event,” said MCA director Monica Vassallo. The Michael Jackson Foundation’s philanthropic awardees are as follows:Ivan Albright, Tanya M.", "The next Biennial should focus on “ecological restoration” and “environmental justice.” Gillian Wearing, director of the Biennial, said: “The process of creating the 2018 Biennial will be a collective reflection of the many voices that have shaped contemporary art as we know it today. The theme of the exhibition is ‘in partnership with nature’ and it’s how we interact with the natural world that will define what it means to be an artist.” The 2019 edition of the exhibition will be curated by Donatella Brugal and Maureen Pena and will run until January 28 at the Museum of Modern Art in New York. \n\n\nThe Rockefeller Foundation has awarded $1.2 billion to nineteen foundations across the United States, representing twenty-six states, to introduce or extend social and environmental justice initiatives. The grants—known as phalanxes—are part of the Rockefeller’s commitment to support creative and cultural activities and initiatives in the seventeen states and the District of Columbia. “We are thrilled to support the different types of organizations that are making meaningful contributions to supporting the creative and cultural well-being of our communities,” said John Podesta, chair", "The next Biennial should aim to introduce a new mode of inquiry by exploring the notion of 'The Unseen Field: Art and the Body in Modern Life” and should be a celebration of the life and work of Dada artist Henri Ghent, who was an ideological ally of the Nazis during the height of the Holocaust. The program will also include a discussion of the death of 12-year-old Palestinian boy Ahmad Abu Khdeir, who was crucified by Israeli forces, and will focus on the role of art and culture in addressing social and political ills.The exhibition will also include a work by the artist and activist Nima Nabavi, who in 2017 exposed the systematic human rights violations committed by Israeli forces during the 2014 Gaza war, as well as a reconstruction of the Nakba, a nonviolent uprising against Israeli colonialism that broke out in 1948.Mali artist Sambi Buhari, a former member of the African National Congress (ANC), was selected as the winner of the 2019 Ig Nobel in Literature, which is worth $12,000. The prize jury awarded the award after a five-month, “incomplete,” submission process that involved more than 3,200 nominations from around the world. The twelve finalists, who were", "The next Biennial should be a great success. I hope that it will be. I hope that it will be made into a model for the future. I hope that it will become a model for the future of art. I hope that it will become the occasion for the future of art. I hope that it will become the occasion for the future of art.”Commenting on the upcoming exhibition, 'The Artist’s State of Mind: Art in Transition”\u0097a survey of twentieth-century artmaking\u0097Bertrand said: “We are back to the same place, the same time, and the same place is always in motion, always taking shape. This is what makes art so powerful: a kind of being in motion. At the same time we are reminded that art is not something that is produced and reshaped, but something that is lived. It is a way of life. . . . I hope that this exhibition will be a success and that in future years we will be able to take it to the next level.”\n\n\nThe University of Chicago has introduced a new program that will offer up to $5,000 in scholarships to creative and cultural professionals working in the arts and technology. The new", "The next Biennial should have received the award this year, but was forced to cancel due to the Covid-19 outbreak. It will conduct its first edition at a new venue in the city in 2020, and will hold its next event at the Bourse de Commerce, which opened in 2016.\n\n\nThe Museum of Modern Art (MoMA) in New York has come under fire for its decision to remove a statue of Edward Colston, a slave trader and racist who acted in concert with and in collaboration with other European colonialists, from its pedestal. In June of 2019, a group of artists, led by photographer Nan Goldin, mounted a protest against MoMA’s collection of art that glorified slavery and featured work by African Americans. As part of their campaign, Goldin commissioned six works by the artists in the exhibition “Colston, Black, Slave Trader,” which opened at MoMA on August 9, 2019.Among the works that were removed were a statue of Robert E. Lee and a work by Pierre-Auguste Renoir, a slave trader and collector who operated out of Paris in the 1820s. The exhibition was staged on the same day as the dismantling of a monument to General Lee, General Robert", "The next Biennial should take place in 2020 and will hopefully consider the impact of art and photography in the twenty-first century. ‘The Future Is Camera: Art and Photography in the Twenty-First Century’ will be presented by Nikkatsu in Tokyo in conjunction with the Art Basel Hong Kong Art and Design Biennial. It will run from October 18 to November 1, 2020.\n\n\nThe Museum of Modern Art (MoMA) in New York has announced that it is moving the next edition of its Faux Gallery triennial, “Art of Fashion” from March to September, 2020. The move was made in order to give the museum more time to prepare for the 2020 iteration of the event, which will take place at the Museum of Modern Art from September 21 to September 26.“We have been working hard to reevaluate our programming and to deliver a better experience for our audiences by rethinking how we present and engage with art,” said museum director Todd D. Greenberg. “Our goal was always to have a triennale in 2021 as exciting and universal as possible.”The museum will also introduce new digital and augmented experiences that will reflect the museum’s collection as it unfolds. The first will", "The next Biennial should take place in 2021 and will feature the first works by sixty-three artists, including Albert Camus, Adrienne Anzaldúa, and Willem de Kooning, in addition to the works of twenty-seven artists whose works will be presented in the exhibition. “This is a unique time for art and I look forward to working with the artists and the curators to present a show that addresses issues of our time,” said Silvia Bensch, chair of the board of trustees of the Biennale for the Arts. “New York is undergoing a profound transformation and the Art of the City, curated by artists in their studios, will reflect that transformation. The next Biennial will be an opportunity for the museum to renew its relationship with the city and the local community, and a time to reflect on the creative life of New York.”\n\n\nThe American Institute of Art (AIA) in New York has banned three exhibitions from its Fall–Winter 2019 season: “The Untold Story: Art in the Age of Black Power” (2019), “John Barks: With Love” (2019), and “Cecelina Barrows", "The next Biennial should take place at the Art Institute of Chicago (AIC), where it will continue to be staged. The first exhibition in the series will be “Anti-Orient” in August 2020, and the exhibition will then return to the Chicago Art Museum (CAM) in September 2020. The 2019 exhibition, “Orient: The Art of Motion” was on view until March 2019.\n\n\nThe Museum of Modern Art (MoMA), New York, has appointed James \"Buddy\" Bertram as the next director of the institution. Bertram will be responsible for overseeing the museum’s collection, restoration, exhibition-going, and internal operations, which are currently being managed by Leslie Wexner, and will assume his position on September 9.“Buddy’s tenacity and commitment to MoMA’s mission have made him a fascinating choice as director,” said Marc Glimcher, chair of the board of trustees. “Buddy’s tenacity and dedication to MoMA’s mission have made him a fascinating choice as director,” said Marc Glimcher, chair of the board of trustees. “Buddy’s tenacity and", "The next Biennial should be held in 2021. A selection of works from the exhibition will then be presented in a biennial in 2022. The 2020 edition, which was curated by Rintoul, was held at the Stedelijk Museum in Amsterdam and opened on October 21. The winner of this year’s prize is Chloe Bush, who resigned from the prize in protest of the ongoing occupation of Palestine by Israeli forces.The exhibition will be a “real exploration of the meaning of art and its connection to human souls,” according to a statement issued by the prize. “The Biennial of Art will be a celebration of the progress of art and the future of creativity.”\n\n\nThe Institute of Contemporary Arts (ICA) in New York announced today that it will give $6.5 million to Institute of Contemporary Arts (ICA) Graduate Fellows to advance the careers of twelve artists whose work has been published in the Art Newspaper, Artforum, Artforum Photo, Artforum PhotoWeek, Salon, the New York Times, the New Yorker, the Los Angeles Daily News, and the New York Times Style Magazine between August 1961 and October 2014. “After a thorough search of the outstanding", "The next Biennial should also examine the development of media in and through the twenty-first century, and will be open to all cultural, social, and political entities. “Drawing inspiration from the work of the contemporary artists who have shaped the contemporary contemporary art ,” the artists of the 2020 edition will be the same as the artists of the last edition\u0097a tight group of artists who are all represented in the exhibition. In the past, the institute has shared its biennial with several other contemporary artists\u0097Ozlemara, Breywoldt, Berberoff, Alejandra Sánchez, and José Ponce. In an open letter addressed to Arts Minister Monir Shah, Julianne Rönnsperger, CEO of the Ekaterina Andreeva Foundation, and director of the Zürich Design Center, wrote: “The intention of the new Biennale is to give a space for the artists who have shaped the contemporary art of the twenty-first century. The theme of this year’s edition is ‘content,’ and such a space will be illustrated by the artists of the 2020 edition and their respective practices.”\n\n\nThe Contemporary Art Museum Houston (C", "The next Biennial should concentrate on the Girl Group’s performance series for the first phase of the exhibition and should showcase a selection of work by the group and its artists. The next Biennial should focus on the Girl Group’s performance series for the first phase of the exhibition and should showcase a selection of work by the group and its artists.\n\nThe Metropolitan Museum of Art in New York has announced the opening of a new online exhibition devoted to the life and work of artist Frank Lloyd Wright. Titled “L.A. to Phoenix: The Art of the Air,” the exhibition will be organized as a series of talks led by Wright in an effort to gain his attention and understandings through a series of drawings. “We are excited by the prospect of working with Frank Lloyd Wright through this exhibition; he is one of the greatest living artists and has inspired us to think about the most direct and immediate relation between art and our world,” said Steven M. Carter, director and chief curator of the Museum of Modern Art. The exhibition will feature twenty-four drawings by Wright, who last year became the first living artist to receive the National Medal of Arts, along with his wife, Mary; twenty-two", "The next Biennial should be held in the city in 2021. \n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles announced that Jona C. Akomfrah has been selected to lead the museum’s 2020 iteration of the International Biennial, which will take place in Los Angeles in 2020 and will be held at the Los Angeles County Museum of Art (LACMA).“On behalf of the board and staff of the board of trustees, I’m thrilled to welcome Jona to the board of trustees,” board president and CEO Peter Sondheimer said. “Over the years, she has proven herself as an exceptional leader, developing a deeply meaningful and diverse collection and keeping LACMA in the forefront of contemporary art.”Akomfrah, who currently serves as the board president and CEO for nonprofit organization Artadia, has spearheaded the museum’s public-private partnerships program since 2007, when she began as the founding director of the Venice Biennale. Since 2012, she has served as the director of curatorial affairs and curator of photography at the Los Angeles County Museum of Art (LACMA), and has also been an adjunct curator at the Los Angeles County Museum of Art (", "The next Biennial should be held on Saturday, March 21, 2020. The 2019 edition was held in New York City; the 2020 edition will take place on the grounds of the Smithsonian American Art Museum. It will also include a select group of new works by select artists and will present a new reception with the theme “Polarities” at the museum on Monday, March 22. “As a global community, we are rapidly becoming more aware of the interconnectedness of the world around us,” said David Ketcham, chair of the board of trustees of the Smithsonian American Art Museum. “This exhibition will introduce you to the many wonderful artists whose work has been lost or stolen and will give you a chance to be inspired by their personal stories.”The 2019 exhibition featured work by over fifty artists, including Mihai Laji, Rindavan Bhatt, Julie Mehretu, Jane Panter, Mihai Sotagay, Rama Shrivastava and Kate Stewart, and was curated by Mihai Laji, Rindavan B, and John Spero. The 2020 edition is curated by Alice Petroff and will feature work by more than fifty artists. Both the 2019", "The next Biennial should take place in the fall of 2020. Los Angeles is currently planning to hold an exhibition in 2021.\n\n\nThe National Galleries of Scotland has announced that Marijke Lindsey-Davies has been appointed as its next director, effective immediately. She succeeds Damian Lyons-West, who departed the institution on March 31 after eighteen years to head the private education and research arm of the British Royal Family, the Trammell Foundation.Lindsey-Davies comes to the National Gallery from the University of the Arts, London, where she has served as director of the Institute of Contemporary Art, London, since 2014. During her tenure, she curated the museum’s first festival, “Unseen: The Future of Art in the Age of Digitality,” which ran from March 21 to March 23, 2019. That same year, she received the National Galleries of Scotland’s Order of the British Empire.Lindsey-Davies will assume her responsibilities at the National Gallery on October 8.\n\n\nThe Museum of Fine Arts (MFA) in Boston has received a gift of more than 1,500 works from the Tila Tequila Foundation in the form of a cataloguing and display complex designed by", "The next Biennial should take place in 2022, and the first in 2020, of course.\n\n\nThe British artist, educator, and curator Christian Simpson is facing up to six months in prison for violating a US cybersecurity law by sharing a work by German artist Michael H. Nolde in 2013 with the US government, the Art Newspaper reports. The New York Times reports that the forty-five-year-old California native will serve six months in prison after he was convicted of two counts of \"unauthorized access\" to protected computer systems, which carry a maximum sentence of five years.Simpson faces up to two years for the third count, which was for sharing a work by the Czech artist Grzegorz Kaminski, who died in 2003. An additional count of shared a performance of a work by British artist Stewart Lee. Both Kaminski and Nolde are considered precursors to modern abstraction.Nolde’s work, which takes its name from the Germanic word for \"forest,\" Lūm, is one of a number of works that deal with the shifting landscape of European art, which first appeared in print in the early 1940s by the American artist Hans Hof and the British architect Herbert Lesch.", "The next Biennial should be held in 2022. The 2019 event, entitled “The Future is Present,” was held in September.\n\n\nThe National Geographic Society, the Association of Art Museum Directors (AAMD), and the Society of Honorary Fellows (SHF) have issued an apology to the thousands of current and former staff and members of the National Geographic Society in a letter dated March 21, 2020. The letter, which was sent by AAMD board chair Matthew Stuebner to SHF president and CEO Brady Flannigan, reaffirms the organization’s commitment to supporting the ethics of climate science as articulated in “The Climate Problem: Climate Science and the Future of Humanity” (Duke University, Durham, UK; 2019) and the “Letter from Secretary Stern to President Michael Bloomberg’s Office of Climate Action” (2015) and commends SHF’s recent decision to withdraw from the Paris Agreement, and its new leadership team, which includes national director and CEO Jennifer Dziewior, Matt Ridley, and Jody Rogac.However, the letter points to several problematic policies that the National Geographic Society has previously championed—including", "The next Biennial should be slated for 2020. Listing all of the participating artists for the 2020 edition is currently unavailable. Artforum has contacted the artist for a comment. \n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles has appointed Merritt J. Watts as its next director and CEO. Watts first joined the institution as its curator of contemporary art in 1993. During her seven years at the helm, she set the institution on its current trajectory, which continues to grow and evolve as it adds new collections and projects.“I’m thrilled to be directing this amazing collection and museum,” Watts said. “It’s been a source of inspiration for me and has inspired me to think critically about the role of art in communities. I’m confident that we can continue to redefine the role of art in our communities through smart design, collaborative education, the arts, and events.”Watts has also served as a faculty member at the University of Chicago’s Museum of Modern Art, where she first began her career as a curator. She is currently a professor of art history and contemporary art at the Ohio State University.“Merritt has a proven track record of delivering", "The next Biennial should be in 2020 and will be organized at a new site in the city’s West End and will be hosted by the museum. Wang hopes to present a reconstruction of the city’s Chinatown, which he says was “the heart of Hong Kong’s Chinatown.” The museum has yet to reveal a new location for the exhibition.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it is committed to a new five-year capital campaign designed to raise $150 million for its expansion and construction. The capital campaign is part of the project to rebrand and re-shape the museum—which recently underwent a massive renovation and is currently undergoing an expansion—as one that will present an engaging collection of work while preserving its historic setting.“This year’s MOCA Annual, rebranded as the Next Generation, was a great success, with over $100 million raised and a new home in the heart of downtown LA,” said David Childs, director and CEO of the museum. “This campaign is about building a new kind of MOCA, one that is driven by an engaging vision and by a deep respect for the art of the future", "The next Biennial should be held in 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has become the latest institution to shutter after a thirty-six-year run following the pandemic. The California-based nonprofit Artspace announced on Monday that it is temporarily halting operations at the museum. The decision to suspend operations came after the museum received about $2.3 million from the California Community Foundation, the Los Angeles County Museum of Art, the Metropolitan Museum of Art, and the Los Angeles County Museum of Art (LACMA), among others, to help manage its financial affairs following the pandemic.“The timely and generous support from our trusted donors has allowed us to make the difficult decision to temporarily close our doors,” said Marc Glimcher, president of the organization. “We are grateful for the support of the public and the museums that have shown exceptional commitment to supporting Artspace. We are also grateful for the dedicated curator, staff, and volunteers who have consistently challenged us to think beyond the icon and to innovate the art making process in order to make for a more inclusive future.”The museum will reopen in the fall of 2020.\n\n\nThe J. Paul Getty Trust and the Metropolitan Museum of", "The next Biennial should take place in 2021 and will be hosted by the Museum of Modern Art, which currently has the first part of the next iteration of the exhibition on view, “Wangechi Mutu: Between/For/Another.” While the museum will partially reopen this weekend with the opening of a new exhibition of Monet’s work, “The Modernist Experience,” it will remain closed until July 29. \n\n\nThe Museum of Contemporary Art (MoCA) in New York has suspended its spring 2019 commissioning of a new work by the late Chinese artist Jiang Wenjie—the latter in part because of a potential breach of an agreement he signed with China’s State Administration of Cultural Heritage* (SACH) in 2018, the Art Newspaper reports.The institution had originally commissioned the work, titled The Monster and the Fountain, for the exhibition “The Past and Present.” It was supposed to open March 29—on March 26—but was pushed back to May 2, and the exhibition was eventually canceled.The cancellation has been met with disappointment by some of the artists represented in the exhibition, many of whom were hoping to see the work at the institution in May or May 2019", "The next Biennial should focus on the philosophy of the work, the artists, and the archive in order to present the most recent and current work of the project’s selected artists, the projects or collections that are open to the public, and the exhibitions that highlight the work of the selected artists. “The upcoming biennial will not be able to reach the full scope of the work that the artists have achieved, but we are eager to collaborate with the entire community to create a platform for their creativity and vision,” said Junya Oda, director of the Biennial, in a statement.\n\n\nThe Oceana Foundation in New York has decided to remove a statue of late African American leader Martin Luther King Jr. The foundation, which has supported the controversial statue since it was formed in 2015, began to question King’s legacy in the wake of his assassination by ex-superintendent of police Darren Wilson in the US city of St. Louis.In a statement on its website, the organization said it was “shocked and dismayed” by the killing of King and that its support of him had “put at risk the life and well-being of an entire generation of young black men.” It also", "The next Biennial should be held in 2021. We are optimistic that the work of artists from the Contemporary Arts community will continue to be respected and celebrated at the museum.”\n\n\nThe New York City Department of Cultural Affairs (DCLA) has received a gift of more than 1,500 photographs by the late Italian architect and theorist Ciro Tutti, who established the modernist but influential new architecture and design culture in the city in the 1960s, the 1970s, and the early 1990s, the DCLA announced on Monday.Established in 2000, the Tutti Archive is a curatorial program that collects works by the architect’s illustrious colleagues, including Arno Hadley, Oriana Catellotti, Ando Scaramella, and Paolo Baratta, and presents them in institutional collections in the city.“The archive’s collection presents a unique historic opportunity to revisit and revisit the works of Ciro Tutti, who created a new form of architecture that revolutionized how we think about architecture, sculpture, and design,” said collector and philanthropist Daniel H. Weiss. “This is the opportunity for art lovers around the world to see the legacy of a master architect, a model for", "The next Biennial should take place in the spring of 2021. The theme of the exhibition is “Women and the Arts.”\n\n\nPace is pushing forward with plans for a new Los Angeles outpost of the international art modern-retailer Art Basel. The inaugural exhibition at the new space will showcase works by seventy-five artists and will run from March 13 to March 15. The show will be hosted by the Los Angeles–based artist and curator Bryan Lydon, whose works are currently on display in the private exhibition “30 Years of Dada and the Modern Art Museum” (March 16–March 22), at the museum.“The launch of the new Art Basel in LA is a very exciting milestone for the Pritzker Prize,” said Philip Weiss, president of the prize. “And it’s an exciting moment for the world to see the first works by seventy-five contemporary artists in a new space in LA. We are very much looking forward to the performances, the installations, the exhibitions, and the digital platforms that ‘will make this the best-preserved location in the world for the collection of the Pritzker Prize’s first prize.”The P", "The next Biennial should take place in Georgetown in 2020. \n\n\nThe Institute for Contemporary Art (ICA) in London announced today that it will launch a groundbreaking new prize that will support the development of new work by young artists and promote the work of established artists. The new $250,000 Horizon Prize will be offered in recognition of the twenty-six artists whose work is currently on display in the institution’s new, three-story, glass-enclosed, glass-enclosed exhibition space, the Horizon, which is currently under construction on the grounds of the Oxford University Art Gallery.The new prizes were created by two committees headed by John Birkett, who has served as the director of the ICA for nearly four decades, and include the Horizon Prize for Visual Arts (2019), the ICA Horizon Prize for Photography (2019), and the ICA Horizon Award for Literary and Performance Arts (2019).“The ICA has long been an essential cultural destination for the city of London, and we are proud to stand alongside the artists whose work we present in our new exhibition space,” said Birkett. “We are also keen to encourage the exhibition of the work of emerging and established artists and to present their work", "The next Biennial should also consider the future of the city’s public art, which is currently being reworked to incorporate the collection’s current holdings. “We have been working with the current collection for almost twenty years, and we are proud to share this extraordinary collection with the world,” said Kirkland & Ellis director Thomas Harris. “The collection is a great example of how art can transform lives through the power of technology, and how art can help people engage with the world around them. The drawings and paintings by Ed Moses, the Mies van der Rohe, El Greco, and Rembrandt, and the digital works by the collection’s global artists, are a great example of how art can transform lives.”The forty-fifth edition of the Biennial, which will be staged at the Palais de Tokyo in Paris in 2022, is currently on track to be completed by the end of the year. The exhibition will be held on November 5–11.\n\n\nThe Carnegie Museum of Art in Pittsburgh announced today that artist and activist Zina Saro-Wiwa has been selected as the 2020 recipient of the Carnegie Art Museum’s Artist in Residence award. Saro-Wi", "The next Biennial should be held in 2021. \n\n\nAmerican Ballet Theater (ABT) in New York has announced that it is suspending production at its new home, the new venue for the company’s first major overhaul outside of the United States since it closed its Paris offices in 2012. Production will resume at the old site, the Museum of Modern Art, in September.“The company has taken these important developments as a signal that our future plans are sound,” said company president and CEO Anna Wintour. “We’re moving into an exciting new era at ABT. We’re excited to be a part of the Museum of Modern Art, and we’re ready to take on new challenges. We’re going to do what it takes to stay true to the company’s values and to keep our doors open.”A decade ago, ABT staged seventy-nine performances across the United States and Canada. \n\n\nSinger-songwriter, producer, actor, and philanthropist Guy Ritchie, known for his activism and political involvement, has died at age seventy-nine.Born in London in 1931, Ritchie studied at the School of Oriental and African Studies before", "The next Biennial should be held in 2022.  The artist’s own observations are in sharp contrast with the subsequent exhibition “Greater Aeon” (2019) which featured works by Don Carlos de Cisneros and Nada Rivera, and in 2019 the exhibition “Aeon” inaugurated a new series of exhibitions dedicated to the life and work of Pablo Picasso. The first exhibition, “Aeon: Photographs,” will open at the Museum of Modern Art, New York, in 2021 and will present works by the artist in his own words.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has appointed Jane Barlow as its new associate curator of modern and contemporary art. She is the first woman to lead the museum in more than twenty years and will begin her position next month.“Jane is a formidable curator whose ability to recognize an artist’s vision and her ability to visualize the museum’s collection in action set her apart from the field,” said director James D. Surowie. “Her ability to bring together artists and professionals to explore contemporary art through a two-way dialogue and her ability to develop thoughtful and compelling interdisciplinary projects are as", "The next Biennial should comprise a selection of contemporary works, presented by a specific artist. The exhibitors will be chosen by a global community comprised of scholars, artists, curators, artists-in-residence, and artists-lovers. The theme will be “The way forward.” The theme will be “The artistic path,” and the number of the exhibition will be numbered from one to twelve.In April 2019, the organization raised $500,000 for the first Biennial. The project was led by artist-activists Anna-Sophie Pape and Janet Clark. In August 2019, it announced that the event will now return the funds from the inaugural edition, and will open the inaugural exhibition in January 2020. The new strategy for the event, developed by artist-activists and artists, is to present the works of the year’s most important artists in an attempt to move away from the Biennial stage and to the real world. The exhibition will concentrate on themes such as “intersection of art and technology,” “enduring and obfuscating,” and “memoirs.”Commenting on the upcoming exhibition, Pape and Clark said: “", "The next Biennial should be held in 2022.The European Space offers guided tours and shows in various formats. It currently has the distinction of being the first contemporary art institution in the United Kingdom to hold an international retrospective, and will host an eleventh-hour exhibition at this year's event.\n\n\nThe 2010 Venice Biennale, which was abruptly canceled due to the coronavirus, has announced that it is now reopening in the spring of 2021. The 2020 edition of the triennial, titled “Life After Death,” will consist of twelve works, eight of which will be works by artists whose work has been previously unpublished. The remaining works will be works that will have never been published.“We have been working hard since the end of March to finish the work, and to the extent that we could, we are now able to present it in the spring of 2021, with the full cooperation of the exhibition’s organizers, the Italian government, the Court of Cassation, and the artist, Giulia Battista,” said Stefano Cattaneo, president of Museo Cattaneo. The artist’s work, which was included in the exhibition, “Sitthe art of the", "The next Biennial should be held in 2020. \n\n\nThe Rockefeller Center in New York has added seven new members to its board of trustees. The group announced the appointments on Tuesday, January 8, and consists of Mary Anne McCann, director of the Center for Art and Public Policy, which provides leadership to a number of nonprofit organizations, including the National Endowment for the Arts (NEA); William M. Stern, chairman of the New York Philharmonic; and Paul Mpagi Sepuya and Monica Saladino, cochairs of the Whitney Museum of American Art.“I’m thrilled to welcome these seven visionary and dedicated curators to our wonderful new home,” said David Dormer, the Rockefeller’s executive director. “Their diverse approaches and histories will shape the future of the center, and we look forward to deepening the relationships between the museum and the city we love.”The new members are: Billie Adam, who will serve as the director of the Center for Art and Public Policy; John McAllister, president of the NEA; Shilpa Menon, who will head the Whitney Museum of American Art; Brenda Roesler, director of", "The next Biennial should be the year of the Dog. “The Dog is a living organism, a collective entity that exists in three dimensions,” said Jakob Nielsen, director of the museum and executive director of the museum. “The Dog is an extension of the museum, a living organism that is situated within the museum, a living organism that needs periodic intervention and care and nourishment in order to live and to develop. Both the Dog and the museum are part of a large and diverse collection of curiosities that is assembled in the museum, and as such, are essential to enhancing the museum’s collection and the public’s understanding of the history of art.”\n\n\nThe Los Angeles County Museum of Art (LACMA), the Museum of Contemporary Art (LA MoCA), and the Getty Center in New York have announced that they have received a gift of more than three hundred rare works by artists such as William Eggleston, Frank Gehry, and Louise Nevelson from artist-in-residence Mark B. Cohen. Cohen, who runs a gallery in New York called Kohn Gallery, is known for his generous transfer of artworks. In recent years, he has featured", "The next Biennial should take place in 2021. “The future of the Biennial is uncertain,” Barbara Jean-Baptiste, chief of the museum’s department of European art, told the Art Newspaper. In light of the upcoming exhibition, which coincides with the two-year anniversary of the outbreak, the Biennial and its dearest objects are undergoing a momentous transformation.The first phase of the renovation, which has been underway for eighteen months, consists of the dismantling of the museum’s eighty-three-year-old building, which comprises a highly distinguished collection of artworks by the likes of George Galbraith, Marcel Proust, Pierre-Auguste Renoir, Henri Rousseau, and Jean-Michel Basquiat. The demolition of the structure will also result in the opening of a new, fifty-four-acre exhibition space, the Diller Scofidio + Reni\u0097a twenty-four-foot-tall glass pyramid surrounded by twenty-eight glass panels. The project was coordinated by architect Wolfgang Rech, working in collaboration with the architect-designer Joost Van Der Hol, and includes the construction of a new level of the museum\u0097which reopening in", "The next Biennial should aim to address the burgeoning status of female artists and their claims to this field, providing them with a platform to present their work. Perhaps most importantly, it should consider the lives and well-being of the important women artists whose work emerged out of the colonialist imagination and whose voices are still heard today.\n\nThe biennial’s programming will be divided into three parts. Part One, titled “Women Artists,” will feature forty solo exhibitions, all staged by women artists, between May and July 2021. Part Two, titled “Representations of Women Artists,” will present forty performances, selected by men only, between September 2019 and July 2021. Part Three, titled “The Future is Female,” will focus on the experiences of the female artists whose work we will see in the exhibition ‘The Present,’ which will be organized in a museum and will open in 2020.”\n\n\nThe Paris-based, New York–based nonprofit, exhibition space, and digital archive Dramatica (Dram), which was founded by an American couple in 2016, has been unceremoniously closed by its new owners, the Leopoldo and María Art Foundation, shortly", "The next Biennial should take place in the spring of 2021.\n\n\n\n\n\nRobert Redford, actor, producer, director, and humanitarian. Photo: Wikimedia Commons. Courtesy of the actor. \n\n\nSylvia Rivera, a Cuban American sculptor and activist, was found dead on September 6, 2018, at her home in Queens, New York. She was eighty-nine years old.Born in Miami on March 25, 1944, Rivera moved to the city with her family when she was only six months old. She studied at the Miami School of Art and in the city’s Catholic High School before enrolling at Rutgers University, where she eventually graduated in 1958. In 1964, she enrolled in the Art Students League at the University of Akron, where she met John Carlos, who would become her husband. Rivera worked as a secretary in the Air Force for the next eight years, but left the military in 1969 to pursue her artistic career.In 1970, she returned to the city, where she moved in with Carlos until 1988, when they moved to the Bronx to launch a painting and sculpture collective, Rivera Villalobos. The group’s output includes paintings, drawings, sculptures, prints, and posters. Rivera’s statement", "The next Biennial should include a discussion of the history and future of the exhibition, an exploration of the boundaries between art and digital technologies, and a discussion of how important it is to work with artists and institutions in order to advance our understanding of the mandate of the exhibition.”\n\n\nEgypt’s Ministry of Culture and Art announced on January 16 that it planned to remove two of the country’s largest works of art by the Islamist president, Abdel Fattah El-Sisi. The move was made in an attempt to placate the Egyptian people, who have been largely frustrated by a lack of progress since the 2011 ouster of the longtime leader, Mohamed Mursi, who was also removed from power in a 2013 military coup.Following a lengthy review process involving a judicial committee, El-Sisi has now announced that he will remove the two works, the Rabat Al-Fitra, 1998, a large woven textile mosaic, and Abdel Moneim, 1985, which was one of three monumental works by the country’s first female architect, Simla Al-Araby, from the country’s permanent collection. The announcement marked a significant milestone in Egypt’s history as the first", "The next Biennial should be held in the spring of 2020.\n\n\nA group of artists, designers, filmmakers, and musicians signed a statement of solidarity with the Black Lives Matter (BLM) movement by signing an open letter that condemns police violence and calls for an end to the death penalty. The letter comes amid a growing international movement to end the death penalty in the United States, which has seen a dramatic increase in recent weeks following the death of George Floyd, who was killed by the police while he was being tased by a white officer in Minneapolis on May 25.On Saturday, hundreds of people participated in the Women’s March in Washington, DC, which drew millions of protesters. The day before the rally, President Donald Trump declared war on the federal budget, the budget for the Environmental Protection Agency, and the United Nations. The move has forced many politicians to grapple with the prospect of a fiscal crisis, and many are now urging Congress to take action.On Monday, thousands marched through New York City to protest police violence and racism. According to the New York Times, the March for Humanity crowd was made up of people of all races, with many wearing masks and holding signs reading “Black Lives Matter” or “", "The next Biennial should be in September 2021. \n\n\nAn open-air sculpture by Australian artist Jeanne-Claude, who created work that was meant to represent earth, sea, and sky, has been removed from the Palazzo di Santa Maria Cassino in Venice, Italy, after it was hacked and set on fire by a group of around twenty people on Sunday, September 7. The firemen who extinguished the flames, which were caused by a gas explosion at a construction site, were not able to put out the fire because it was burning so brightly. The work, Rosie, was installed in the decade-long history of the super-structure, which was designed by master architect Vittorio Castelli and is housed in the Museo della Svizzera, in Venice.Giuliano Bracci, who owns Brutus Locatelli, a contemporary art space in Rome, told the Art Newspaper that the arsonist, who was identified as a 22-year-old man from the nearby town of Pagli, instructed the group to take the sculpture down so that they could enter the building. When the thieves entered the structure, the building was still occupied. The building’s owner, Giovanni Carroni", "The next Biennial should take place at the Venice Biennale in late September. The theme for the 2020 edition will be “Amir K. Tawfiq”, a commemorative publication of the Grand Mufti of Jerusalem and the first in a series of works by the artist which will also feature a performance by the artist and a photography exhibition.\n\n\nThe museum in London that was forced to temporarily close due to the Covid-19 pandemic has announced that it is reopening in early September. The reopening date is a little more than a month ahead of the official opening on September 9. The museum has confirmed that all activities, including the annual collection show, will resume as planned. Although the park will be temporarily closed from 6 AM to 9 AM, the institution hopes to have all of its regular visitors back by then.“We are very much looking forward to welcoming the public back to the museum, and we will continue to work closely with them to make sure that they have the most up-to-date information as possible,” said museum director Maria Balshaw. “We are confident that the new year will deliver an exciting and inspiring new experience for everyone.”Balshaw added that the", "The next Biennial should be on October 27, 2020.\n\n\nThe Mayor of Amsterdam, Anne-Marie van der Leven, has announced that the city will welcome twenty-nine artists and collectives, including ten from China, from the International Biennial of Media and Performance, which will run from January 28 to February 29, 2021. The exhibition will also feature twenty-six new works by artists from South Asia and the Middle East, including Ahima Bains, Anupam Gupta, Ashok Gupta, and Gao Hao.The twenty-first pavilion, which is currently being curated by Wolfgang Lüpertz, will be curated by Sophie van de Wijngaard, the curator of contemporary art in the United States. Van de Wijngaard will be accompanied by two assistants, Alex Wurmser and Alina Zivanova.The twenty-third pavilion, which will be curated by Mana Nandi, will be presented by the Hong Kong-born artist Ooi. Born in Singapore, Ooi lives and works in Hong Kong. Since 2014, he has been based in Hong Kong and has traveled extensively, including to Switzerland and Italy, and his art has been exhibited at the Hong Kong", "The next Biennial should take place in 2021. The next edition of the conference will take place in 2022. The next iteration of the Tokyo Biennale will take place in 2023. The next edition of the Hauser & Wirth retrospective will be held in 2022.\n\n\nThe Institute of Contemporary Arts (ICA) in Vienna, which was set up to encourage more international collaboration among German arts, has announced that it is preparing for a possible shutdown of its collection of contemporary art. Its upcoming exhibition “The World We Made,” which will be staged in May 2022, was commissioned by the organization in collaboration with the German state of North Rhine-Westphalia (NRW).The reconstruction of the show, which was staged in three phases, highlights the ongoing challenges of reassembling works that were created, moved, or donated by German industrialists and collectors in the late nineteenth and early twentieth centuries. The exhibition, which will include new works by artists such as Ad Reinhardt, Erich Ager, Helmut Andropov, and Lutz Hahn, will be on view in the museum until March 23, 2022.The institute’s director, Heiko Wester, said: “This is not an easy situation.", "The next Biennial should be held in 2021. In a statement, the museum said: “We are truly thrilled to be able to welcome our guests again to the gallery. We are also eager to continue collaborating with our audiences through the exhibition and exhibition program. It is an honor to return to South Africa and cooperate with our audiences.”The Redfern Art Gallery (RFA) in London has been added to the list of thirty-five art museums that have signed an open letter condemning the UK’s Brexit vote. The letter reads: “We, the undersigned artists and collectors who have signed this open letter, condemn the decision to leave the European Union, and we call for a swift reopening of the galleries and the galleries should be reopened as soon as possible. We call for a strong and independent UK to remain in the EU, to remain part of the single market and customs union, and to continue to draw visitors to our galleries and support the arts. We call for a UK–Ireland agreement that reflects the full range of the UK’s international profile. We call for a UK–Ireland settlement that fully reflects the UK’s future economic relationship with the EU, and that maximizes the value of the", "The next Biennial should take place in 2020 and will be hosted by the museum in conjunction with the museum’s new collection and exhibitions. The exhibition will be curated by Dr. Vasa Röntgen, director of Biennale Basel, and will include work by seventy artists. “The exhibition has been a long-term project of mine, working with and for several artists over the decades,” Röntgen said. “I’m very proud of the achievements of the exhibition, which has taken place in a museum of my institution, and its results, which I hope will encourage young artists from the city of Bonn and Germany to think more about the possibilities of the museum in their cities.”\n\n\nThe Brooklyn Museum has received a $1 million donation from the New York state government. The gift, which will be divided between the institution and the National Center for Missing and Exploited Children, also includes $540,000 for the construction of the new museum’s Girard-Arts Center, which will boast a museum displaying the work of Jane Cohen, and $495,000 for the renovation of the building on Montauk’s Seventh Avenue.", "The next Biennial should be in 2019. The next Intl. Biennial will be in 2020 and the next Art. Biennial. should be in 2021.  The next Biennial will be held in 2022. The next Art. Biennial will be staged in 2024. And the next Art. Biennial will be held in 2028.The new five-year cycle for the Biennial will kick off in 2021 and run to 2021 again in 2022. The new format will introduce a new set of challenges for both exhibitors and the show, which will be relocated from the Art. Biennial to the new venue. The new exhibition will be hosted by the Museum of Modern Art and the modern art museum St. Louis. The new series will be curated by Adam D. Weinberg, curator of modern art at the Museum of Modern Art. The new museum will open to the public in March 2021. The new biennial will be the largest project of its kind at the museum. The biennial will be hosted by the Museum of Modern Art and the modern art museum St. Louis. The new series will be curated by Adam D. Weinberg, curator of modern art at the Museum of Modern Art. The new museum will open", "The next Biennial should be held in 2021, but Finland is currently experimenting with a limited edition of six works, curated by artist and publisher Hannes Niemeyer, with a view to one day having ten exhibitions at once. The theme of the 2019 exhibition was “The Water of Life” and was a collaboration between Timur and Jaina Dikshit.\n\n\nThe National Gallery of Art (NGA) in Washington, DC, has appointed Sarah McEntee as the next director of the institution. In her new role, which is funded by $30 million in gifts and pledges from Jay and Evelyn Lauder, the couple revealed that McEntee will succeed Heather Malloy, who is currently the director of the National Gallery of Art, and will begin her tenure in January 2021.“Jay and Evelyn Lauder are dedicated supporters of the NGA, which is why they have supported the NGA through this difficult time,” said Sarah McEntee. “Jay and Evelyn Lauder are willing to make tangible financial and personal sacrifices to ensure the NGA’s long-term financial success. I am honored to be able to dedicate my time and energy to support and improve the NGA’", "The next Biennial should be held in 2022, with the dates to be rescheduled. [Update: 11/3/2019] The new Biennial will be held at the new site of the Museum of Contemporary Art (MoCA), in New York City. The artworks will be presented by artists selected from a pool of sixty-four artists and will be curated by Christo, who has worked at the museum since 1991. [Original Article, April 1, 2019] Biennial organizers have announced that the 2020 edition will take place in the early stages of the Candida alginosa–like fungus, which is spread primarily from person to person, rather than at an institution such as a hospital or a hospital as a whole. The fungus is spread easily from person to person, primarily by direct contact and can be spread by direct contact with infected water, food, or mucous-oral-components, and can be contracted by inhaling the spores of the fungus or from contaminated utensils. The fungus can be spread only from person to person, and very rarely causes symptoms. Although the fungus is a parasite which feeds on its host, it does not cause illness itself. The fungus is only made from spores", "The next Biennial should focus on the history of video games in the Philippines, including a review of the work of contemporary artists in the country. \n\nLastly, Artforum Philippines plans to introduce a new platform that will feature a selection of new works by artists and will give a forum for the exchange of new experiences. The platform will launch this fall.  The launch of the platform was delayed due to concerns over the coronavirus, which has spread to the United States and Europe. However, during the International Festival of Asian Art, held last month in Singapore, the platform was awarded an additional $6,500 as a result of a $10,000 donation from the Sydney-based collector Sam Tan.“The platform will provide an opportunity for artists and collectors to showcase their work under the hashtag #artforumparagang,” said Artforum president and CEO Monica G. de C. Miranda. “The platform will also allow participants to organize exhibitions with the exhibition of their work and will provide a platform for artists and collectors to exchange ideas and experiences.”\n\n\nThe United States Congress voted yesterday to establish a new official fund dedicated to the protection and care of cultural heritage artifacts and artifacts worth more", "The next Biennial should be held at the best of times and at the worst of times for the globe.\n\n\nThe biennial, titled Between the Sun and the Moon, has announced that it will now be held in the shadow of the 16th International Conference on Sexuality and Gender (ICSF), which is taking place in New Delhi from October 4 to October 7. The event, which was originally slated to kick off on September 22, has since been pushed back to October 21. Dr. Naren Bhagwati, the director of the International Centre for the Study of Sex and Gender in India, said: “The move has been made in an attempt to arrive at a date that will enable the next edition of the exhibition to open at the earliest date possible. The exhibition was supposed to open on October 3, but the agreement with the Indian government and the exhibition was postponed until at least December 15. We are very disappointed with this decision, which is in line with our previous statements and our previous exhibition schedule.”The move has led some cultural figures in India to question the need for the event, which is centered around the themes of love, sex, and gender, and has faced a number of challenges, including protests", "The next Biennial should focus on the history of the institution, the theótica’s creation, and its current exhibitions. The commission will also take a look into the future of the institution. It will be up to the Art Newspaper to decide whether the museum should start a’s first edition in the city over the summer.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has received a gift of twenty-six works by the late American painter Robert Irwin. The gift includes works by artists such as Walter de Maria, Robert Irwin, and Lenore Tawney. Published by the Norman Foster Foundation, the works are part of a series made by the artist as part of a larger program of commissions.Born in New York City in 1956, Irwin moved to New Jersey in the late ’50s to study at the Art Institute of Chicago. He returned to his hometown in the ’60s, where he began his career as an American painter, drawing inspiration from his upbringing. In addition to his paintings, he was involved in the production of work on paper and sculpture. In 1965, an exhibition at the Museum of Modern Art in New York featured Irwin’s work in ’65. The following year,", "The next Biennial should take place in the summer of 2021. “Two decades is a long time to wait between a new exhibition and an artist’s first exhibition,” the artist said. “It is not an ideal situation for a major exhibition, but it is the only way to show the new in my opinion. It is a real shame that it was not possible to finish this exhibition before the Covid-19 pandemic, for I sometimes think that the first exhibition would be the best.”The work, titled “On the Street,” is currently on view in the exhibition “Kuala Lumpur” at the new Visual Arts Center in Kota Bharu, Indonesia. The exhibition will be on view through September 23.\n\n\nThe City of New York announced today that it is moving forward with construction of the new Museum of the City of New York (MoCA), a new six-story, glass-enclosed museum that will be built in Queens, New York, between 2019 and 2022. The groundbreaking project is one of several major developments that will bring millions of works by the artist-run collective that have not yet been catalogued by the New York public into the collections of major museums. Inaug", "The next Biennial should take place in 2020 and will be presented by the same artist-run, nonprofit organization, the Biennial of New Orleans. The artist-run, nonprofit organization will be able to determine the theme and the theme of the 2020 iteration of the Biennial, and the next exhibition will be open to the public for free. The exhibition will be titled The Body in Space and will be curated by Marcela Cervetto and will be based on the concept of the body in space, and that the body can be the vehicle for the future.“I’m thrilled that the biennial of New Orleans will return to the great city with the future in mind,” said Osei. “This time around, we will not be reinventing the wheel, but developing a new format that will incorporate the great American cities of the South and West—and honor their rich histories and traditions.”\n\n\nThe Museum of Arts and Design (MAD) in New York has appointed Minga Mitra as its new deputy director and chief curator. Mitra comes to MAD from the Museum of Modern Art, where she is lead curator of contemporary art. She succeeds Bridget Ackerman, who retired", "The next Biennial should begin next week.\n\n\nThe Shanghai Museum of Art (SMAA) has hired Joseph Joseph to serve as its new artistic director. Joseph will take up the post on October 6 and will be based in Shanghai. He succeeds Karen Leung, who was recently promoted to director of the Hong Kong Museum of Art, and will work closely with director Hu Jie.“Joseph’s expertise and experience in the field of contemporary art make him a strong candidate for the role of organiser,” said Hu Jie. “Under Hu’s leadership and guidance, SMAA has grown in stature and stature of a new Art Space in Shanghai. This is a very exciting time for SMAA and the city of Shanghai, as it marks the first time that an Asian-American has been selected to run the Hong Kong Museum of Art (HKMO), and the first time that an Asian-American has been the director of the SMAA.”Hu Jie added that the appointment of Joseph is a “great honor. He represents the Vision of the SMAA, which is to nurture and develop the artistic sensibility of Shanghai and the art scene of China’s mainland.”\n\n\nThe London-", "The next Biennial should be held in 2021, but the organizers say that the timeline of the event will be based on the scientific committee’s recommendations and the subsequent exhibition will be a “time capsule.”In addition to a retrospective of the first exhibition, the exhibition will include a new and original work by one of the artists who contributed to the exhibition, which will feature works by artists such as Yo-Yo Ma, Kate Hodge, and Irin Carmon-Newton. In addition, the biennial will be dedicated to the creation of a new biennial survey.“At an early stage in the process, we have chosen to focus on the art of the first exhibition in order to create a space where the biennial can be as open and diverse as possible,” said Caroline. “To this end, the exhibition will be presented in its entirety from September 5 to October 28, 2021, which will be the opening of the first Biennial. The exhibition will also introduce new content and features in the exhibition, as well as introduce a number of new themes.”The 2019 edition of the Biennial was staged at the Museum of Modern Art in New York and drew a standing-room-only crowd. The 2019", "The next Biennial should focus on the relationship between art and society. “Throughout the course of the twentieth century, art has been a key element in shaping the cultural and political discourse of many countries,” said Noël Carroll, chair of the biennial’s committee and the author of History of Art: Art in the Struggle for Human Rights (2013). In 1959, the musical “Fun and Games” was staged at the Biennale, and the following year, the exhibition was presented by the Museum of Modern Art.In 2008, the Los Angeles–based nonprofit Center for Art and Culture (CAC) organized a show of work by forty artists, including Bernard Batsi (1960–1964), Antony Gormley (1963–1967), and Robert Irwin (1967–1973), among others from the Czech Republic. The show was curated by the Czech director Marcin Hrytsak.\n\n\nThe Portland Museum of Art (PMA) is launching an online platform that will allow visitors to see and purchase works by artists and collectives in its collection. The platform, which will be called PMA Central, will allow visitors to view and purchase artworks from the institution’s permanent collection. The digital", "The next Biennial should be held in November 2021, when the exhibition will mark its sixtieth anniversary. The event will also feature the show “NIRIN: A Universal History,” and the biennial will have a new exhibition dedicated to Mozart’s paintings.\n\n\nThe British artist Carsten Renov and his wife, Alice Renov, have announced that they are ending their partnership with the gallery based in Berlin that represented Renov’s work, the Bakerloo, in the fifth edition of the Berlin Biennale, “Between Berlin and the West.” The announcement follows the publication of an art review in New York magazine that describes the Bakerloo’s relationship with the artist as “unsettling and disquieting.” “Over the years, Carsten and Alice have helped to shape the exhibition’s aesthetic and have given their insight into the work of the artist, setting the exhibition apart from the rest by being sensitive to his idiosyncrasies and by being able to take part in the unparalleled critical process that is the Berlin Biennale,” said art critic John Wilkins.Renov, who has lived and worked in Berlin since 1967, told the artist�", "The next Biennial should take place in Los Angeles – on September 5–7, 2020. The 2019 Biennial, entitled “The Modernist Experience,” was curated by Harry K. Hebborn, who also curated the 2011 and 2012 exhibitions “On the Modernist Experience,” and “Modernism and the Modern Imagination” (2019), and was held at the San Francisco Museum of Modern Art and the Los Angeles County Museum of Art. The biennial’s collection entries include the work of artists such as Jean Hoa and Kim Allen, as well as works by Pierre-Auguste Renoir and Pierre-Auguste Salzmann.\n\n\nThe Center for the Study of the New American Art (CSNA) at Columbia College Chicago announced today that it is working with the Department of Cultural Affairs of the State of Illinois to introduce new limits and requirements for the use of federally owned land and buildings in its “Cleveland: A Contemporary History” exhibition series. The exhibition, which focuses on the larger-than-life, often social and political landscape of Cleveland’s American South, will be on view until May 27, 2020.“The exhibition will include the", "The next Biennial should be staged at the National Gallery in London, which is currently undergoing a major expansion. The show, titled “Odd Days,” will debut in 2021, and will be followed by a sequel, “The Strange Weeks.” The future of the National Museum of Scotland, which opened in Glasgow in 1897, remains uncertain.\n\n\nThe German city of Hamburg, which has been battling to contain the coronavirus, has confirmed the death of a man who died on Monday shortly after returning from a six-week trip to the Grand Canyon. The cause of death was carbon monoxide poisoning, which the authorities are still trying to determine. The cause of death for the man, a fifty-nine-year-old woman, was found on Wednesday in the city’s Neuer Berliner Zeitung newspaper, which was published by the daily tabloid Frankfurter Allgemeine Zeitung. The paper reports that the woman’s death is being treated as a suspicious death.The articles led some to believe that the woman’s death was connected to the trip, but the investigation is ongoing. The Huffington Post reports that the woman died of carbon monoxide poisoning. The German state of North Rhine", "The next Biennial should take place in 2022.  “The importance of cultural heritage to Cuba’s progress and prosperity cannot be overstated,” said researcher Rosa del Val, who was awarded the Presidential Medal of Freedom in 2018. “In this complex of history, where the island is slowly becoming a modern day Cuba, the opportunity of renewing the Cuban people’s faith in their country and the Cuban state is too great to ignore.”\n\n\nThe Institute for Contemporary Art (ICA) in New York has appointed Joyce Hennessy as its new executive director. Hennessy comes to the ICA from the Metropolitan Museum of Art, where she served as the deputy director of curatorial affairs and chief curator for seventeen years. During her tenure, she organized more than three hundred exhibitions, including the “Secret Garden” (2019), “The Golem in the Garden,” (2016), “The Shape of Things to Come,” (2015), “The Painted Post,” (2013), and “The Perfumers Arms,” (2012). She also served as the ICA’s first board president and as a founding director of the Museum of Modern Art", "The next Biennial should be held in 2022.\n\n\nThe Art Newspaper, an art-news publication in the United Kingdom, has released the first official preview photographs of the upcoming the Biennale of Sydney, which will take place in late March and April. Titled The Most Beautiful Place on Earth, the exhibition will feature work by eighty-two artists and is being organized by the Art Newspaper and Artforum. The full list of participating artists is as follows: *Cameron Brown (Australia) *Cindy Sherman (USA) *Shepard and James Patterson (USA) *Edgar Araña (Mexico) *Katharine Halsey (USA) *Alessandro Iannone (Italy) *Robin Foran (Argentina) *Kathrin Karlberg (Germany) *Danielle McArthur (Australia) *Sara King (Canada) *José Mercado (Spain) *Pierluigi Báez (Spain) *Lorena Bont (Italy) *Carlos Barón (Spain) *Sara Bruguera (Portugal) *Lutz Büttner (Germany) *Sara Britten (USA) *Sara Calero (USA)", "The next Biennial should be held in the spring of 2020. “Our strategy has been to develop a consistent, richly textured program that connects the contemporary and the past in the same way that a concert series can,” Olivier De Schutter, the director of the Flemish Biennial, told The Guardian. “The great thing about the museum is that you can go on a journey through time, like in the 1966 series. This is the time that will be the resting place of the body after death.”The upcoming exhibition “The Body and the World” will feature artists such as Anna Atkins, Michelle Alexander, and Robert Irwin, who have been featured in the past in The Body Lottery, which will open in the summer of 2020; and will feature new works by artists such as Tanya Bonakdar, Akiko Bannan, Michael Booth, and Kai Shinozuka.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed John Koenig as its next executive director. Koenig brings with him a wealth of experience in the fields of arts and technology and brings with him an ambitious vision and a proven track record of working with artists to create meaningful and transformative experiences for", "The next Biennial should be composed of twenty-four works, in addition to the exhibition, which is currently on view in conjunction with the exhibition “The Color of Reality.”\n\n\nVolta, the Slovene feminist artist, performance, and publisher, has been awarded a major international award for her recent book, Landscape in Space (Boschopatnik), which received the Grand Prize at the Venice Architecture Biennale in May. The book received a prize at the Art Archive of the Federal University of Granada in Madrid last month. The achievement is the result of a collaboration between the artist and the London-based architect Frank Gehry, who also designed a landmark extension of the artist’s studio in the city, the Vasać Building, in 2008.“I had always wanted to build a house that didn’t exist, but one that was able to be lived in, to be lived in with my husband, and my children, and for whom I was able to build a community,” said the artist, who lives in the Netherlands.Born in 1961 in Brno, Czechoslovakia, Volta moved to the Netherlands in 1983 to study at the Academy of Fine Arts in the Hague.", "The next Biennial should be held at Santa Cruz in California in 2021. \n\n\nThe Smithsonian American Art Museum (SAAM) in Washington, DC, has appointed Laura L. Martin as its next president. Martin recently assumed the post following the retirement of her predecessor, John R. Williams, who had led the museum since 1986. She succeeds Ann W. Saunders, who retired in May after nineteen years at the helm of the agency.“Laura has been instrumental in developing our relationship with our local communities and organizations, fostering an appreciation of the arts and contemporary life throughout America, and fostering our relationship and cooperation with museums and the largest cultural institutions in the country,” said Jay Chiu, chair of the board of trustees. “Her experience, dedication, and enthusiasm for the arts, government programs, and exhibitions will be especially relevant in the years ahead as we embark on our twenty-fifth anniversary as an institution.” She will take up her post in August.“I’m thrilled to welcome her to the wonderful Smithsonian American Art Museum in Washington, DC,” said Chiu. “Laura is a national treasure, a tireless champion of the arts and her work embodies the extraordinary spirit of candor and candor", "The next Biennial should take place at a suitable location inside the city of Paris. The event will be open to the public from September 5 to September 6, 2020. \n\n\nThe Museum of Fine Arts (MFA) in Boston has received a gift of eighty-four artworks from the Boston-based arts organization the Claude Monet Foundation, which was established in 1986 with a $1 million donation from the artist. The gift comprises works by twenty-four artists, including Mark di Suvero, Robert Irwin, and Matisse and Remo Leibovits, as well as works by artists such as Marc Chagall, Willem de Kooning, and Jean-Paul Sartre.“This is a remarkable collection of works by artists whose careers have been tragically cut short, and of the most important work ever created,” said foundation president and CEO Ravi Shankar. The foundation is also working with the MFA to develop an online cataloguing service that will allow the public to search the works by artists and their works sold at auctions by searching on the foundation’s site. The cataloguing service will follow the artist’s online selling and will provide customers with useful information about the works sold and the auction houses", "The next Biennial should take place in the future, as the current exhibition has been cancelled due to the ongoing strikes. The Board of Management of the Biennial and the Museum of Fine Arts in Singapore (BMA) decided to postpone the exhibition until mid-March.The exhibition, titled The Biennials: A Century of Modern Art, will be on view on March 21 and March 22. The exhibition will include 300 works from the collection of Singapore’s, the United States, and the United Kingdom, and will also feature selected works by contemporary artists such as Markus Lüpertz, Joël and Milan Kauders, and Mark Sobey.Costa-Samartolo is looking to raise $2.3 million for the exhibition, which was organized by the Architecture Research Laboratory of the University of California, Los Angeles (ARLE) and the Art Institute of Chicago (AIC), and is also seeking international support. The BMA’s $1 billion plan to renovate the museum is aimed at reducing the museum’s footprint and increasing its exhibition space by one-third, and the AIC’s $1.3 billion plan to add a new level of art to", "The next Biennial should take place in the spring of 2020. The 2020 edition will be held in the city of Hamburg, Germany.\n\n\n\n\n\n\nNelson Aquino: The American Dream. New York: Metropolitan Books, 2018.\n\n\n\nThe Metropolitan Museum of Art is planning to divest more than $29 million from its holdings of the late South American dictator Augusto Pinochet, who was instrumental in the bloody dictatorship of Augusto Pinochet (1936–1973), and give the large Chilean arts museum the equivalent value of $54 million in a move that will likely save the museum $2.5 million a year in operating expenses.The move is part of a larger set of conservation strategies undertaken by the museum, which is trying to reduce its debt by divesting from arms and munitions manufacturers and by holding companies accountable for supporting human rights abuses. The restructuring will also involve the dismantling of the Chilean embassy in Washington, DC.“We are aware of the importance of the Art of the Left and the Art of the Right,” said museum director Christopher Johnson. “These are important historical examples and embody the legacy of Augusto Pinochet, a dictator who changed the course of Latin American history.”According to the New York Times", "The next Biennial should take place in 2022. The museum will be overhauled in order to accommodate the exhibition, which has a unique and impressive collection of more than 3,600 works, and will introduce a new platform, the Biennial Reading Room. The biennial, which will include lessons from the museum on how to effectively present the works, will also introduce a new digital platform that will allow visitors to experience the exhibition in a unique and intimate way. Art historian Ron Gorchov and the museum’s director, Dieter Vogels, have both said that the biennial will draw on the works of 75 contemporary artists and will include works by artists who are not represented in the main exhibition. For the future of the Biennial Reading Room, the museum will continue to review proposals and is looking to the future. The Biennial is free to the public and open to the public from January through March. \n\n\nThe Noguchi Museum in California, which will soon house an exhibition devoted to the work of the late Italian architect and theorist Renzo Noguchi, has announced that it will reopen to the public on January 13. The exhibition, titled “Noguchi: The Making of Modernism” and curated", "The next Biennial should be in September 2021. \n\n\nThe Museum of Fine Arts (MFA) in San Antonio has appointed Elias Peralta, a curatorial fellow at the Museum of Modern Art in New York, as the next director of its collection of modern and contemporary art.Peralta comes to the museum from the Metropolitan Museum of Art, where he has served as the director of exhibitions since 2011. During his tenure at the Met, he organized exhibitions such as “Staged: Exhibitions at the Museum of Modern Art,” 2013–15, “Untitled: Contemporary Art at the Met,” 2015–16, “Theater in Motion: In Memoriam,” 2016, and “Heres a Lot of Art: A Visual History of American Art,” 2016.Peralta’s new role will be funded by an endowment from the C. F. K. and S. L. Smith Foundation and will be led by Mia Apuzzo, the museum’s associate curator of modern and contemporary art. The biennial will be held at the museum from January 20 to March 21, 2021.Nominated by MFA alumni, Peralta was nominated for", "The next Biennial should be held in 2021, and the theme should be “Deconstructing Health—” Nadia M. Jordan, museum director, told the Art Newspaper.\n\n\nThe Museum of Contemporary Art (MoCA) in New York has released the list of fifty artists whose works will be presented this fall as part of the Museum of Modern Art’s “Masquerade” series. The exhibition, which marks the Museum’s twentieth anniversary in 2020, will focus on “falsification of self and the world.” The sixty-five-person jury comprising Emily Chang, director and chief curator of the Museum of Modern Art; Cory Brethauer, creator of the show “Masquerade”; and John Kosslyn, curator of the show “Painting in Cinema” selected the fifty finalists for the $50,000 prize, which is dedicated to a contemporary artist whose practice moves between the cultural and the political realm. “The jury is pleased that all fifty finalists have agreed to participate in the exhibition,” said museum director Daniel H. Weiss. “The exhibition will include exceptional performances and well-documented cases, both on the performance and the", "The next Biennial should have taken place in the spring of 2021, to coincide with the Art of the Gathering, and will certainly include a new work by the artist, in a show that will be “more ambitious and coherent.”\n\n\nThe National Gallery of Canada in Ottawa has appointed Karen Leibowitz as its next director. She succeeds Jacqueline Kennedy, who retired in the summer of 2021 following a long and contentious battle with cancer. Leibowitz, who previously served as director of the Haida Museum in Portland, Maine, is the seventh person to lead the National Gallery of Canada since it was founded by Sir George Gayden in Ottawa in 1923. Since Kennedy’s death in 1964, the institution has undergone a number of changes, including the addition of new buildings and new artists. Under her leadership, the gallery has grown from a tiny collection of twenty-five works to an exhibition program that has participated in the National Gallery of Art, which had previously been limited to exhibiting only works by the “great artists of our time” to a larger collection, more than six thousand works.In her new position, Leibowitz will act as a conduit for National Gallery of Canada artists and creatives. The gallery was created in 1993", "The next Biennial should take place in 2022.\n\nThe biennial, which was organized by the New York–based nonprofit, the New Museum, and the partnership of the New Museum and the Union of South American Art, will be inaugurated with a reception for the institution on February 21. The event will conclude with a presentation of the three works by the Argentinean artist Râo Terrero in the museum’s exhibition “The Harvest of Time: Avant-Garde and the Art of Destruction.”The Argentina-born Terrero, one of the country’s biggest and most influential painters, will be represented by the Buenos Aires gallery that organized his first exhibition in the country, “The Harvest of Time.” The artist has been featured in numerous exhibitions around the country and is represented by MCA Artists’ House in Buenos Aires.\n\n\nThe Museum of Arts and Design (MAD) in New York has launched a new digital platform that will allow visitors to experience an exhibition in person. The Museum of Arts and Design (MAD) in New York has launched a new digital platform that will allow visitors to experience an exhibition in person. The platform, which was created in partnership with the New", "The next Biennial should focus on “circulars” (i.e. extending the project of the work of Sinthujan and Cipolletta; the other artist who is currently recovering from his respiratory complications, Ânjeko) and “structures” (i.e. works that take up two main themes) and should be held in 2020. Following the event, the exhibition will be inaugurated by a public gathering of the project in Rome and will run until December 8.\n\n\nThe Kunsthalle Basel has announced that it is reopening to the public in January 2021. The project of the exhibition, which will be organized as part of the Swiss fair’s fifth edition, “NADA,” will be centered around the theme of the exhibition, “The Immortality of the Body,” and will include a number of works by women artists, including an extended portrait of the Italian artist María Berrada.The exhibition will include three new works by women artists: Soraya Rahman, Rosalind Russell, and Yinka Shonibare. The fourth work by the trio, which will be on view in the exhibition, will be a", "The next Biennial should be staged in the spring of 2021. The first edition of the event, titled The Eternal City, will be staged at the San Francisco Museum of California; the Oakland Museum of California; and the Brooklyn Museum. The 2020 edition was co-organized by Masayuki Takada, the director and founder of the Tokyo Biennale; Paul Mpagi Sepuya and John Zorn, the organizers of the Brooklyn Museum.\n\n\nThe National Gallery of Art in Washington, DC, has received a critical $2.5 million gift from the Domenici and George in the form of a two-year lease of an additional 1,500 square feet of the museum’s former space on Eighth Street in the heart of the capital district. The gift also marks the end of a five-year lease for the museum, the first time the building’s original lease has been terminated.The new digs will be inaugurated by a four-thousand-piece exhibition, “Power to the People: Power in the Name of Democracy” (2019), organized by the Black Lives Matter coalition. The show will feature work by seventy-five artists and will feature work by artists that reflect the voices and histories of", "The next Biennial should be held in 2021, and the final in 2022.\n\nThe Venice Architecture Biennale, which was staged in the Italian city in 2017 and inspired an international campaign to boycott the Italian pavilion for its inclusion of a controversial bronze statue of former Italian Prime Minister Enrico Letta, has announced a $58 million fund for the future of the exhibition.Entitled Rome: The City of Light, the biennial will be hosted by the Scuola di Rivoli in conjunction with the Sculpture Garden at the City of Venice in 2018. The event will also be hosted by the Sculpture Garden in 2021.As part of the campaign to boycott the pavilion, Italian artist and artist-in-residence Flavia De Sola has created a video installation titled Rome: The City of Light (2016–17). The work, which addresses the consequences of the pavilion’s decision to open to the public in March, 2020, and has a running time of just over four hours, includes scenes of actors from the film The City of Light, as well as scenes of Italian cities including Venice, Turin, Turin-Italy, and Turin-Italy in the year 2022.The full list of", "The next Biennial should be set up in 2021. The 2019 exhibition, titled “The Blue Ribbon,” was staged in collaboration with the Red Tower Museum in Copenhagen and featured works by eighty-four artists in all.Commenting on the exhibition, Svenska Watts, director of the Red Tower Museum, said: “This is one of the few places in the world that is still open . . . Thanks to the generous support of the public, collectors, and the public museum, we were able to bring together the artists of the Blue Ribbon archive and present them in one exhibition for the first time. We are already studying the exhibition, preparing for the exhibition that will open in 2020, and we are hopeful that this show will be of interest to collectors from the Blue Ribbon archive as well as to visitors from the general public.”\n\n\nThe Museum of Contemporary Art (MoCA) in New York is planning to cancel a major retrospective of Salvador Dali’s The Hunchback of Notre Dame and the Seamstress of Notre-Dame, a sprawling, eight-hundred-work installation—dubbed the “Theatre of Life”—that would have presented the artist’s prehistoric", "The next Biennial should be on May 20, 2020, at the Place Vendôme in Paris, and should involve the artists featured in the first exhibition—Diana Al-Hadid, Yoko Ono, Marc Chagall, Peter Sugg, and Ed Moses.The museum will announce the artists and their themes next month.\n\n\nThe Contemporary Art Museum St. Louis (CAMST) has appointed John C. Wright as its next executive director. Wright, who has served as interim president of CAMST since April, will take the helm of the institution as it undergoes a $50 million renovation and expansion project.“John is a seasoned leader who has been instrumental in the growth of CAMST, which has grown in stature and impact since he became president in April 2015,” said Paul Hoeppner, president of CAMST. “His extensive experience in overseeing a museum’s fundraising, operations, and education programs will ensure CAMST maintains its position as one of the nation’s leading museum organizations. His leadership and strategic vision will ensure an environment for creative excellence and sustainable growth that will serve CAMST and the city of St. Louis well for many years to come.”Prior to joining CAMST in", "The next Biennial should be held in January 2020. The exhibition will be relocated from Turin, Italy, to Rome from January 2020 to February 2021. The work will be on display in the exhibition “HELP ME” (Elle Stellart), curated by Lucie Salle, at the Palazzo Risini, from February 17 to February 19. The exhibition “The Power of Images” (Thurs.–Mon., Fri., and Sat., 11:30 AM–8 PM) will also move to the Palazzo Risini, and will be held at the Museum of Modern Art, in New York, from February 17 to February 19. The show will include work by 20 artists, including Giorgio Armani, Alejandro Cesarco, Paulo Campos, and Jorge Castaneda. The exhibition will also feature works by new and established artists\u0097including Laura Owens, Nari Ward, and Ugo Rondinara, among others whose work is slated to be included in the upcoming exhibition. The Biennial is funded in part by the Foundation for Italian Art, as well as by the Italian Ministry of Culture.\n\n\nThe Museum of Modern Art (Mo", "The next Biennial should be held in the autumn of 2021. The news comes a little more than a week after the organizers of the festival, the New York–based nonprofit the Center for Biennial Research, announced that they were re-evaluating the festival’s future. In a statement, they said: “We are actively evaluating the best ways to move forward in order to help our artists and the broader society. While our art and research team remain committed to exploring new ways to explore and understand the cost and politics of art, we recognize that the best and most direct path forward is to continue with the current program.”However, Hakim Bishara, a spokesperson for the festival, told Artnet that the decision to cancel the upcoming edition was not made lightly. Bishara said: “The event is still in the process of being developed and developed carefully. In order to move forward with the festival in the autumn, we had to consider the full range of possible outcomes. . . . We have always maintained that we could not and would not move forward with the exhibition without the support of the artists, our partners, our trustees, our advisory board, and our staff. . . . We thank our artists,", "The next Biennial should be held in 2020. \n\n\nThe Institute of Contemporary Art (ICA) in Milan, Italy, has commissioned artist and educator Vincenzo Cattelan to create a new Biennial on the life and work of American painter Ad Reinhardt. The curator of the exhibition, Aristo Bianchi, will unveil the exhibition at the Museum of Modern Art in Rome on August 7.Cattelan will create a new narrative focused on Reinhardt’s life and work in the exhibition “Ad Reinhardt: Life and Work,” which will take up themes such as the crisis of the wellbeing of art and the relationship between art and life. The show will then return to the Institute of Contemporary Art in Milan.In honor of the artist’s life and work, the museum will launch a new gift program that will dedicate 100 percent of its budget to the research and preservation of Cattelan’s art. The foundation will also establish a new scholarship program that will support the development of Cattelan’s work and will sponsor a biennial shortlisted artist for the inaugural edition of the exhibition. In addition, the museum will dedicate an entire gallery space to the artist", "The next Biennial should be held in 2020, according to a statement.In a statement, the LA County Museum of Art said: “It is a sad day when a major art museum in the US shuts its doors in the middle of a major cultural event. It is a sad day when a major art museum in the US has decided to cut its losses and sell its art in the interest of profits. It is a sad day when a museum in the US shuts its doors in the interest of profits, stripping the collections and exhibitions of their value. It is a sad day when a museum in the US sells works in furtherance of García Roca’s interest in the privatization of the institution.”The Los Angeles County Museum of Art (LACMA), which has been a Los Angeles institution since 1999, announced on Tuesday that it is closing its doors and is planning to sell all of its art and assets, including its collection. The announcement came amidst a major controversy surrounding the institution, which was forced to remove more than 450 works in January due to concerns over a collapsing roof.“The LA County Museum of Art is closing its doors to the public and moving forward as if nothing has happened,” said LACMA director Ben", "The next Biennial should be held in 2021. The event will create a forum for contemporary art and will be organized in collaboration with the MASH, the Museum of Contemporary Art Atlanta, and the Shaughnessy Gallery in New York. The opening of the inaugural Biennial will coincide with the opening of the exhibition “Human Rights in Art: From the Biennial to the Twenty-First Century” at the Whitney Museum of American Art. The show, which is curated by David A. Goodman and Jessica Morgan, will feature works by twenty-one contemporary artists and will be presented by the Shaughnessy Gallery in New York. The appropriate venue for a biennial is “subject,” Goodman said. “We can’t get there together.”\n\n\nNew York–based dealer Elissa Roesler, who has represented Pop art and Latinx artists such as Ana Mendieta, Zina Alamo, and Ariel Zambelich, has died at seventy-five years old.Born and raised in Los Angeles, Roesler studied at the School of the Art Institute of Chicago, the University of Texas at Arlington, and the University of Havana. Over the course of her nearly eight-decade-", "The next Biennial should be held at least once a year and should embrace the work of all arts professionals.”Coinciding with the exhibition, the British Committee for the Visual Arts (BICV), which has considered the issues for more than twenty years, sent a letter to the government urging it to adopt a regulation mandating the exhibition of “at least two works of art from each year’s list of invited artists.” The letter requested a review of the 2017 edition and urged the government to delay its reopening until the exhibition was fully operational.After Biennial London’s exhibition announced that it was closing its doors to the public, the BICV retracted its letter and reiterated its demand for the exhibition to remain shuttered until the safety of visitors and staff were ensured. Toothpaste.com, which is owned by the BICV, received a letter from the BICV in response to its letter. The letter read:“We regret that the BICV did not consider the strongly held public interest in the exhibition and its programme for at least two years following the closing of the Biennial. Given the uncertainty over the future of our biennial, we were not prepared for the level of", "The next Biennial should take place in the autumn of 2021, with a design by Pritzker Prize winner Matthew Yglesias. The event will be co-organized by the Center for Art and Design (CAD) in New York and the Museum of Fine Arts in Boston. The theme for the exhibition will be “How do we care for the bodies and souls of those who have made the world together?”The 2019 edition featured works by eighty-nine artists, including Alberto Barba, Carlos Bueno, Mario Cipolletta, Simón Lisboa, Luis Camil, Taudia Cervantes, Fernando Campos, Derek Chesley, Hoahana Cheatham, Tomi-Li Chen, Chengdu Cui, Johanna Corrigan, Naima Dalmia, Brian Daley, Oscar de la Cruz, Jackie Edwards, Luis de la Vega, Mark Muro, Miles Morales, Julia Palin, Robert McGinley, Kiki Smith, and Hannah Vigner. The 2019 exhibition featured no works by Y", "The next Biennial should focus on new directions; themes that are informed by current concerns and concerns that are informed by the past; and the themes that are embodied in the work of the exhibition’s past artists. It should also continue its relationship with the Centre for Contemporary Art Paris, which has a long-standing relationship with the institution.\n\n\nThe Museum of Modern Art (MoMA) in New York has hired Deborah Cox as its first senior management director. In her new role, Cox will be tasked with helping with the transition of management and finances as the museum moves into its new 5,000-square-foot facility at 721 Fifth Avenue in Manhattan.She will assume her responsibilities on May 3. Since MoMA’s first board meeting in December 2018, Cox has worked with MoMA board member Daniel H. Weiss and CEO Larry Tanenbaum to overhaul the museum’s governance structure, reorganize its board of directors, and enhance its curatorial and educational programs.“When I first joined MoMA in 2015, I was excited to help shape an exciting and dynamic future for the institution,” Cox said in a statement. “As we worked together to develop new governance and financial models for the museum, we affirmed our", "The next Biennial should be hosted in 2019. The inaugural event, entitled Lunch Break, will be held at the Oguji Museum in Osaka in May. The following year, the Biennial of Art will take place in the city, and the ANNEX will be staged, in conjunction with the COMMONART. The Art of the Bay, which will be hosted by the New Art Foundation, will be held at a different venue each year. \"We continue to be inspired by the dynamism, beauty and innovation of the bay, and how the exhibition space can lend itself to these activities, to the detriment of the art of the bay, and to the art of Japan, as we strive to create new and edifying connections between the art of the bay and the art of Japan in the Bay.” \n\n\nThe British Council announced today that curator Jo Johnson will be the next series director of Tate Britain, which has been run by the British government since 1997. Johnson succeeds Gerald Kaufman, who was appointed as the new director, following his predecessor's death in January 2019. The appointment was announced by British Culture Secretary Karen Bradley, who said: “Jo Johnson is a brilliant and brilliant curator. He has a broad", "The next Biennial should have a platform that brings together ten (10) artists from the Philippines, for whom the Festival has always been a way of life. I look forward to working with the artists and their communities to create a platform for them to come together and create an exhibition that engages with the themes of their lives. . . . The promoter of the Festival is very proud of the artists that are participating in the first edition and I am excited to see what they create.”In addition to the annual prize, the 2020 biennial will be presented at the new Visayan Institute in Maricá, Maricá City, on the island of Mindanao, in the province of Marikina from January 23 to January 27. The exhibition will aim to present a diversity of work on gender equality. The 2019 winner, Íl Alberto Barba, will present his first solo exhibition at the venue in January 2020. The ten shortlisted artists are: Marcelo Andujar, Mina Berrada, John Barba, Claude Beatrice, Catherine Bicol, João Boadicelli, Alexei Batalina, Sanaa Baidug, Ana Cervantes, Tanya Cervantes, and Terriga di Mar", "The next Biennial should be held at the Museum of Modern Art, Chicago; the Museum of Contemporary Art, Los Angeles; the Museum of Modern Art, New York; and the Whitney Museum of American Art in New York. The inaugural version of the Fifty-Seventh Venice Biennale will take place in May 2020.\n\n\nOrganizers of the Fifty-Seventh Venice Biennale have announced that the event will now take place from July 5 to July 7, 2020. The twenty-fifth iteration of the event, which will be held at the Museum of Contemporary Art (MoCA), is currently on hiatus due to the Covid-19 pandemic.The organizers have also extended the program by two weeks to July 7 and July 8, 2020, and by three weeks to July 7, 2021. The full list of participating artists is as follows:Fernando Bonilla, MexicoCityMadaán Campos, MexicoCityMarlene Bochereau, New YorkMarlene Bochereau, New YorkMichele Bickel, New YorkMichele Berg, New YorkMichele Bergman, New YorkMichele Bergman, New YorkMichele Celaya, New YorkMichele Christovale"]