["The next Biennial should be held in 2021 and the date will be announced when the timetable for the three-day event is finalized. In addition, a second biennial will be held in the United Kingdom, with the same schedule as the first, in 2025. The Royal Academy of Arts, which is located in Guildford-on-Hudson in England, announced last year that it will hold its next academic year—which will be held in 2022—in the autumn. The Royal Society of Arts, which is located at Windsor Castle in England, will follow suit in 2024.The 2019 edition, titled Art of the Future, was held at the Museum of Modern Art in New York and was presented by Museum of Modern Art director Toni Baron Cohen. The exhibition, which featured work by twenty-five artists, is one of the last works by the late American artist Philip Larkin, who died last year at age eighty-nine. The seventy-three-year-old Cohen also curated the first exhibition devoted to the work of an African American artist, the “60 Minutes” series, and the “I Have a Dream” series, which is organized in association with the Shriners Hospitals for Children", "The next Biennial should take place in the spring of 2022. The event will be organized as part of the 2020 theme “Empires Rise From the Ashes.”The announcement of the 2020 edition was made by general director Rupert Murdoch. The British newspaper publisher previously revealed that the event would be one of the year’s highlights. “The new chapter in the history of the magazine will be an occasion for the world to see how, in the twenty-first century, The Guardian still remains at the forefront of publishing that is original and cutting edge, that values creativity and enterprise and that is committed to the highest standards of decency and objectivity,” Murdoch said. The announcement also featured the first photo essay by the award–winning artist Josie and Kevin explains the series, titled “Love and the art of photography,” as well as a video essay about photography by photographer Brock Satterwhite.Commenting on the 2020 edition, the artists said: “Love and the art of photography,” is an invitation to explore the art of photography as a tool of inquiry, an art of inquiry to examine the ways in which photography is both a reflection of and a catalyst for enquiry into the material world. It is a", "The next Biennial should be held in 2020. The commission is also expected to draw a large crowd of thirty thousand people for the event, which will be held at the Museo de Arte Moderno in Lisbon. The event will be hosted in partnership with the Museo de Arte Moderno, with the opening of the exhibition currently staged at the Museo de Arte Moderno. While Biennials are always a work in progress, the Museo de Arte Moderno is still working to finalize a design for its new building and is currently working on the exhibition. “We are thrilled by the prospect of what lies ahead for the Four Seasons,” said Paulo Eminto, president of the Museo de Arte Moderno. “This may be the moment when the three legendary architects of the Four Seasons—Carlos Garaicoa, Horacio Barreto and Gio Ponti—have finally given in to their influence and agreed to collaborate once more. We are all excited by the prospect and the possibilities it presents.”\n\n\nArt dealer and philanthropist George Osawagi has donated $4.5 million to the Yale School of Art’s Center for Art and Art History", "The next Biennial should be an exhibition of work by artists whose work is currently on display at the Biennial, a biennial scheduled to run from a different location in São Paulo in 2022. The paintings and photographs on view at the exhibition will be restored by the company, and will be presented to the public in the exhibition “art in action.” The company has also announced that it is working with the Museu de Arte de São Paulo, the Museu de Arte de São Paulo, the Museu de Arte de São Paulo, the Museu de Arte de São Paulo, and the Museu de Arte de São Paulo to develop a new series of exhibitions based on the artworks of the Biennial’s artists and galleries. Advertisement\n\n\nThe Twentieth Venice Biennale, curated by Leonardo da Vinci, has announced that it will no longer be held in the city of Venice. It will instead move to the Palazzo Reale in the Veneto region of Italy, opening in 2020. The plan was made in response to the coronavirus outbreak in the northern region of Lombardy, where the pandemic has already claimed the lives of nearly 800", "The next Biennial should be held at least once every three years. Over the years, various projects and exhibitions have been staged at the museum, such as the 1975 exhibition “Becoming.” The biennial, which was organized by artist and curator Robert Hoagland, is currently on view at the Biennial Museum. The first editions of the exhibition were held in 1976 and the last in 1988. The Biennial Museum will also stage a retrospective of the artist’s work at the museum in the spring of 2021. The Amsterdam Art Biennale is currently on view in the Beijerner Kunstverein Stuttgart, and will continue to be presented in the spring in the Netherlands, Switzerland, and the United Kingdom.\n\n\nThe Smithsonian American Art Museum (SAAM) in Washington, DC, has commissioned a new series of eight works by American painter, sculptor, and photographer, Adrienne Edwards, who was a pioneer in interdisciplinary art practice, and is currently a MacArthur Fellow. The exhibition will premiere at SAAAM in May and will include thirteen photographs by Edwards, who was born in New York City and grew up in Southwestern Pennsylvania, and will be released in May 2020", "The next Biennial should focus on representing the richness of Indigenous knowledge in contemporary art. That should include the art of a wide range of Indigenous performers and their representations in contemporary art.”\n\n\nNew York City’s Metropolitan Museum of Art (MoCA) is planning to toss the current ownership structure of its New York branch, the Met, and move the collection into a new space in Harlem, as part of a $2 billion expansion plan that will also include the construction of the institution’s new headquarters on Park Avenue. In a letter dated September 8, the museum’s board chair, Daniel H. Weiss, wrote: “Metropolitan Museum of Art is expanding its footprint in the city and state of New York and we are excited to inaugurate the new site with a new collection of more than 300 works. We have greatly underestimated the demand for new works by artists and indologists in the city, and we are confident that such a project will create new opportunities for our collection and our artists.”The Met is phasing out the museum’s current ten-year lease at the space, which houses the core collection, and is looking to lease it to a private developer for $1.5 million a year through the", "The next Biennial should be held in 2020. The date has yet to be decided. \n\nThe Museum of Contemporary Art (MoCA) in New York is working with the New York City Department of Cultural Affairs to have the Toledo Museum of Art (TMA) update its zoning bylaw for the proposed construction of a fifty-one-thousand-square-foot, glass-enclosed exhibition space for the museum on its ground-floor. The building, which will be built on the former site of the World Trade Center, will house two buildings, the TMA and the TMA-Louisiana. “We are thrilled to extend the boundaries of our collection with a new, international exhibition space and have the opportunity to present a selection of works from the collection that are uniquely representative of contemporary New York,” said director David Greenberg. “The building will become a platform for engaging with the themes and collections of MoCA, as well as other prominent museums in the city, and will be designed with a contemporary approach that brings together the museum’s collection in a meaningful and accessible environment, while also providing space for the installation of special exhibitions.”Greenberg also said that the new space will include more of", "The next Biennial should be held in 2020. The exhibition will consist of contemporary art from the world over, curated by head curator Markus Schäfer, and will be organised in three distinct phases: The first will take place in the basement of the museum; the second in a public space in the city center. The third part of the exhibition will be held in the museum’s courtyard from January 6 to January 8, 2020.“The new Biennial of Contemporary Art will bring together the works of contemporary artists and will be inaugurated with the exhibition ‘Theater of Operations: The Gulf Wars 1991–2011’\u0097a multi-layered survey of contemporary artworks in Iraq and will be followed by ‘Resurrecting Paradise: Contemporary Art from the Levant”\u0097a retrospective of work by artists in Iran.“We believe the biennial will become a great platform to further develop the exhibition program of the museum as well as to develop new collaborations and explore new themes,” said Ursula von Rydingsvard, director of the museum. “We are grateful to the Biennial Council, the Iranian government, and the city of Basel for this wonderful gift, which will sharpen", "The next Biennial should take place at the end of this year’s exhibition season, on the last Saturday of December, 2020 (the date currently on display in the exhibition will be removed in 2022).The project was founded by the artist and curator Kamala Harris, whose 2011 exhibition “Art and Space” was one of the first major international presentations of work by African artists. The show, which was organized by the New York–based nonprofit Book Appeal, led to a significant increase in the number of works by African artists in the United States.\n\n\nThe Pérez Art Museum Miami (PAMM) has received a gift of seventy-six works, mostly from the collection of the Museum of Contemporary Art (MCA) in New York, from the artist and collector Mark di Suvero. The works will be presented in the museum’s exhibition “Culture of the Body,” which opens on December 8.The gift includes the works of multi-disciplinary artist Malawian Maya Dzegede, whose documentary work drew from the late poet and activist J. Dwight David, whose life and work was frequently intertwined with that of the artist; his first solo exhibition at the institution, which", "The next Biennial should be held in the same location and during the same time of the fifteenth, in the same year as the fifteenth; and the first biennial should take place at least twenty years from now. The aim of the biennial should be to figure out how to bring together art and philosophy that has been excluded from the festival in order to create a new kind of event.”In a statement, Paley Center said: “Like many of our festival partners, we are uncomfortable with the idea of the exhibition moving to a new venue, and we are concerned about the impact of the exhibition on the programming we have already commissioned. We understand that the exhibition, in its twenty-first century incarnation, will be a centerpiece of Biennial Toronto.”The new venue will be built in a 20,000-square-foot former industrial building on Queen Street in central Toronto, and will host the exhibition for twenty consecutive days. The biennial will be held at the Paley Arts Center in partnership with the Toronto Art Gallery, the University of Toronto, the University of Toronto Mississauga, and the University of Toronto Mississauga.\n\n\nThe Hong Kong–based artist and activist Carrie Mae Weems, whose red, black, and gray", "The next Biennial should be held in May 2020, the first in June 2021, and the last in October 2022.  The art of art will be presented in two phases, from April and May 2019, and the biennial will run from March 26 to March 28, 2020.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released its fall 2020 budget for the arts, and arts programming in general—the $10 billion figure is more than double the $8 billion allocated to the arts in the $11.2 trillion federal stimulus package enacted in December 2015.The arts and culture sector added $4.5 billion to the budget for FY16, and $1.2 billion to FY17, which began October 1, 2020. The DCLA estimates that the extra funding will help offset expected losses from the coronavirus pandemic and will be revenue-neutral. The arts and culture sector is expected to generate $17.2 billion in total economic activity in 2020, up 2 percent from the $16.2 billion the agency projected a year ago.The arts and culture sector has been a big driver of the city’s economic recovery since the pandemic began and continues to be a critical", "The next Biennial should focus on the medium of photography, whether as a medium for creation or as a medium for circulation in the form of a photographic exhibition, the newest of which will open in 2021. The 10-day event will begin with an exhibition on photography’s relationship to the history of the art, with a keynote address by Emily Demarco, curator of modern and contemporary art at the Museum of Modern Art in New York. The event will culminate with a discussion between two of the artists featured, Kodjata and Dr. Jethro Jethro, as the theme of the upcoming Biennial.\n\n\nThe Charleston Museum of Art (CMCA) in South Carolina has published a new set of rules for using social media in its “post-racial” exhibitions. Among the guidelines are a few reminders to avoid triggering racial controversy and promote diversity of perspectives and experiences.The new rules, enacted by the institution’s board of trustees, were inspired by the ongoing debate over Confederate monuments in the United States. The Charleston City Council approved a resolution in August condemning the city’s public statues and its city government’s response to the ongoing unrest over racism in the United States. At the time, the", "The next Biennial should address the emergence of new forms of work and social reproduction, the role of art in political and social struggles, and the practicalities of making art. It should also consider the aesthetic, aestheticism, and the aestheticism of modernity, and its relation to architecture and architecture-making. It should consider the modernist aesthetic and its relation to the Soviet aesthetic of the late 1940s and 1950s. It should consider the role of artmaking in the political struggle, and explore the role of artmaking in the production of art, in the production of social reproduction, and in the production of art products.\n\n\nThe Tung-Mal Art Museum in Hong Kong has hired Rebecca Raetz as its next director and chief curator. Raetz comes to the institution from the Victoria and Albert Museum (V&A), where she has served as assistant curator of Asian art since September 2019. She succeeds Jane Lili, who departed in the summer of 2020 to head the Department of Humanities and Social Sciences at the National Museum of Modern Art in Singapore.“Rebecca brings an exceptional record of innovation and leadership as a curator and scholar, and a deep understanding of art and design,” V&A director Angela Lee told the Art Newspaper", "The next Biennial should be held in 2021, the month the festival will have its seventy-seventh edition. The festival will begin with a celebratory performance by biennial group The Love Zooms and the Open Room Quartet. The theme for the biennial will be “The Way Home,” a poem written by poet Laura Mulvey about a young black artist who embarks on a journey to find meaning in the violence and discrimination he faces in his homeland.The biennial will stage twenty-nine performances by artists, including John DeShaney, Robert Levine, and Joan Brown, and will include a special exhibition of drawings by artist Marc-Olivier Kahn. It will also host the first-ever LA Biennial Exhibition, titled “Los Angeles: A Multidisciplinary History,” which will showcase new works by twenty-seven artists. In addition, the exhibition will present several other shows focusing on African American artists, including “Annie Oakley: Black,” which will feature work by fifteen artists; “Juan Carlos Rivera: Return,” which will feature works by fifteen artists; “Losing My Place,” an exhibition of photographs by artist Bernardo de Castro; and “El", "The next Biennial should take place in 2021. \n\n\nAs the number of people infected with the novel coronavirus continues to rise, the number of hospitals and medical professionals working in the United States being forced to close down as a result of the coronavirus outbreak drops. With the number of cases expected to rise further, hospitals and medical professionals across the country are now starting to re-evaluate the types of medical equipment they will be able to use in the event of a public health crisis.As of Thursday, January 6, there were 464 cases across the United States, with 16 new cases confirmed in the last twenty-four hours, bringing the total number of cases to five hundred. As of Thursday, January 6, there were 864 confirmed cases across the country and forty-one deaths.The number of people who died from the coronavirus is expected to climb further, to eight hundred by the end of the week. As of Thursday, January 7, there were twenty-eight new cases confirmed statewide. The coronavirus outbreak is the worst the United States has experienced since the pandemic began in 1976. According to the Washington Post, the coronavirus outbreak is the worst coronavirus outbreak since the pandemic began. While the coron", "The next Biennial should take place in 2020, but the organizers are still keeping a close eye on the situation. \n\n“The ongoing reconstruction of the city, with its extraordinary collection of sculptures and planning and collection, will require an unprecedented level of cooperation between the City of Helsinki and the Municipality of Tallinn,” the organizers wrote in a joint statement, which was signed by Nils Claussen, director of the Paintings and Sculptures Museum in the City of Tallinn and the city of Helsinki, and Klaus Biesenbach, director of the Museum of Modern Art.“This means that the city and the municipality will have to work together on a new project for the Exhibition. The city of Helsinki is also working in close collaboration with the State to prepare for the 2020 Games, with the city of Tallinn contributing approximately 130,000 square feet of public space to the event and the municipality hosting approximately 250,000 square feet of urban gardens.”The project, titled “Tallinn at the Same Time,” and is slated to run from January 9 to January 13, 2021. Final plans for the exhibition were announced last year, but the project was scrapped following protests from art-world", "The next Biennial should take place in 2020.\n\nThe Tate’s director, Maria Balshaw, said: “Once again, we are proud to support the work of artists and artists-and-artists across the world. The new exhibition Biennial 2020 will present a truly inspiring collection of work, an exhibition that takes the contemporary theme of art and art history as its inspiration.”\n\n\nThe 2018 edition of the Biennale de Lyon was postponed due to the ongoing emergency at the city hall in Cologne, Germany, which is currently being managed by the state of North Rhine-Westphalia (NRW). The exhibition has been pushed back again, to November 15–November 16, 2020, and will now take place in June. The show’s first French director, Édouard Vuillard, and its first American director, Filippo Cipolletta, are departing the event. The exhibition will continue to be curated by Filippo Cipolletta and will be held at the Paris Opera House in June. The 2020 event will mark the eleventh iteration of the exhibition.\n\n\nThe Chinese artist Shilang Zhenhai, known for his meticulously crafted", "The next Biennial should take place in the spring of 2020 and will be hosted by the Spanish Ministry of Culture. The event will be hosted in a number of venues including the Palace of Fine Arts in Madrid, the Museo do Palacio Especial del Curitiba, the Palacio de Arte Moderna in Barcelona, and the Museo de Arte de Madrid and the Museo de Arte de Madrid. The theme for this year’s edition of the exhibition is “Intuitions and Actions: Avant-Garde Art in the Age of Pablo Picasso.” The 2020 edition of the exhibition comprises seventy works by sixty artists from twenty-five countries\u0097all of whom were invited to participate by the institution. The biennial will also feature the exhibition of work by Benjamin Brink, Simone Leigh, Octavio Paus, Jules Bianchi, David Hockney, and Yinka Shonibare.The biennial was founded in 2002 by the Spanish artist and cultural producer María Fernández, who also presented the first exhibition in Madrid in 2003, and Luis Ricardo Almendarez, a founding member of the Argentinian experimental label Cadetica, to coincide with the anniversary of the death", "The next Biennial should take place in 2020. \n\n\nThe New York City Department of Cultural Affairs (DCLA) announced today that it has awarded the exhibitions company the five-year, $3 billion Consolidated Fund for Cultural Institutions in the City of New York (CFCI) grant program. The announcement followed the City Council’s decision on Monday to award $4 billion to the CFCI to help it revitalize its historic Javits Center, and the mayor’s push to raise the city’s minimum wage to $15 an hour.The Consolidated Fund is a $3.5 billion fund that was established in 1949 to help small and mid-size arts and cultural organizations through the construction and renovation of cultural institutions, including ACM Gallery, the Midland Museum of Art, the Cincinnati Art Museum, the Cleveland Orchestra, and the Cincinnati Museum of Art. It is the largest federal award program. The city of New York is currently trying to raise $2 billion for the program.The DCLA has awarded $2.5 billion to museums since it was founded in 1959. A decade ago, the city of New York put $1 billion toward", "The next Biennial should examine how art, architecture, design, and landscape interact to shape and shape the body, a topic explored in the exhibition “Art and Body: Constructivism and the Body,” organized by the American Association of Art. The seventh installment of the festival, titled “The Body: Art and Design,” will open on January 23. \n\n\nThe Metropolitan Museum of Art (MoMA) in New York has received a gift of more than three hundred photographs dating from the late artist’s “Bell Jaroslav to his son, Vladimir.” The works, which were acquired in 2014 by an anonymous donor, span thirty-eight years and encompass thirty-five years of the artist’s career. The gift includes a set of photographs from the series “Bell Jaroslav: Pictures of the Body” (1953–1957), which consists of ninety works and more than two hundred photographs, and three new works, “Bell Jaroslav: Precarity” (2019), which are currently on display in “Preparing for War” (2018–19), at the Metropolitan Museum of Art, and two previously unpublished photographs, “Just Europe on the Sea,�", "The next Biennial should take place in 2022. \n\n\nIsabel Toledo, the Spanish director of the Biennale de Lyon and a former vice president of France, has announced that she plans to resign from the reins of the country’s largest arts organization, the Instituto de Cultura y Cultura Moderna (ICAM), in January 2021.“I’m so excited by this news! I’m prepared to dedicate my entire career to the protection of contemporary art and culture in Spain,” Toledo said. “It’s my mission to consider every possibility and to strive for a tangible result.”“I’m happy to take on more responsibilities, to create opportunities for newer artists and young curators, and to work harder with artists and curators in the future,” Toledo said in a statement. “I’m particularly proud of the work that artist Marina Fraenkel has done so far to strengthen the connection between the art of the United States and Spain.” \n\n\nThe New York City Department of Cultural Affairs (DCLA) has revealed that it is planning to allocate $2.5 million to protect the cultural heritage of the Inner West,", "The next Biennial should announce its list of artists and art costs by September 18, 2019, and will also include a description of how the fifteen (15) biennial projects can be experienced together. Organizers said: “The main goal of the Biennial 2020 is to create an environment of mutual respect and understanding, a space for diversity of values and cultures. To do that, we have to make our artists feel welcome, and a lot of that is happening now. We are working to create a space where people can come together to have a real and meaningful exchange with their colleagues and the art world of New York City.”The artist-run nonprofit Artadia, which has supported artists since 1998, will also benefit from a $500,000 grant made by the Rockefeller Brothers Fund in 2019. The grant was made as part of a $250 million initiative to advance the careers of African American artists. The organization will receive another $100,000 in 2021. \n\n\nThe Whitney Museum of American Art in New York has created four new senior advisory positions within the institution, which have been tapped by David H. Zimmern, who served as the chief executive of the Fisk Museum of Art in Atlanta through 2017, to strengthen engagement with contemporary art and", "The next Biennial should be held at the Kyoto Art Museum (KYOTO), Japan (2019); the museum will hold its thirty-fifth edition from May to December 2021. In addition to the exhibition, the biennial will include a series of lectures and other programming. The theme of the 2020 edition is “Feminine Mystures.” It will also introduce a new work by the award-winning artist and activist Yoko Ono, who was recently awarded the Nobel Peace Prize, and will present the first exhibition of work by the Southern Reach artist and theorist James Turrell.The biennial will be curated by the Japanese artist Haruo Takagi, who has been selected to represent Japan at the twenty-fifth edition in Paris in 2022 but was informed last week that he would not be able to travel to the city of Los Angeles because of the ongoing operation of the Kobe Castle, the venue of the recent death of Japanese pop star Junya Ishigami.Hirshhorn Museum director Daniel H. Weissman said: “We are thrilled to welcome our new colleagues to the Hirshhorn and to have them join our team. They are highly talented and have the skills and the ability to create meaningful and influential work. We are committed to supporting", "The next Biennial should take place at the Populav, the newly constructed site of the former museum of ancient Egyptian art; the exhibition “The Making of a Modern Arab Republic” is currently on view. The third edition of the “Arab Art Up!,” which will continue to be held at the museum in the weeks leading up to March 21, will again feature new works by eighty artists, including Aya Alireza, Elia Kam, Mohammad Ali Al-Kasasbeh, Mohamed Abdelnour, and Randa El Hanif. The next event is scheduled for March 13–March 15, 2020 at the Salfit Gallery in Cairo.\n\n\nThe Whitney Museum of American Art in New York has updated its 2020–2021 exhibition schedule with the commissioning of a new Concurrency’s Art Exhibition, “Art of the Makers,” which will take place at the museum in the fall of 2020. The exhibition will feature work by sixty-five artists, including Arash Ferdowsi, Cécile Baillet, and Huma Borthwick, among others who have been selected for the twenty-third consecutive edition.The new theme is “The", "The next Biennial should be held in the spring of 2021. Several museums and institutions that have expressed interest in hosting the exhibition include the Museums Association, the British Museum, the National Galleries of Scotland, the National Galleries in Paris, and the National Museum in New York.  The Uffizi Foundation, which has supported the exhibition since it was founded in 1959, announced that it is sending more than $1 million to support the opening of an exhibition of work by the artist’s daughter Minnie Ragsdale, Nicole Ragsdale, and her husband William Ragsdale, which will open in the spring of 2022. The Ragsdale girls’ first exhibition at the Uffizi Foundation in 1980,  Arturia: The End of an Age, was relocated to the Milan Museum of Art. Since then, the foundation has staged exhibitions of work by artists such as Arturo Di Modica, Janice and Gavin Brown, and Dina Laudel. In addition to the Ragsdale girls’ work, the foundation has several works by artists whose work the Ragsdale artists created for the exhibition, such as the work by Ellsworth Kelly and Helmut Newton", "The next Biennial should be scheduled for October 2020.\n\n\nThe Singapore Art Museum (SAM) announced today that it has received a donation of twenty-six works\u0097six works by artists working in the Singapore-based art community and three works by contemporary Singaporeans. The work—including a painting by Sengkang Wong, a contemporary Singaporean, and a painting by Canadian artist Brian Eno\u0097was donated by a man known as Tan, who attended the institution with his wife and child.“The museum has been working closely with the family to ensure the collection is re-evaluated and re-launched as soon as possible,” said director Anne Tan. “Together, we see the work as a legacy that will inspire future generations and shape our understanding of the Southeast Asian art world.”The museum will also unveil the first phase of its new Singaporean art museum, which will be designed and built in the former industrial site of an old industrial building in the city of Nanyang, Singapore. The museum will stage fifty exhibitions and other programming, including a three-week symposium and a retrospective, and will include classrooms, cafés, and a public gathering space. The museum will host eleven exhibitions annually and will", "The next Biennial should be held in 2020.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles has announced that it will not be taking any further action as it works toward a long-term solution to its $1.3 billion debt crisis. Beginning with an open-ended projection of future spending and revenue, the institution is estimating that it will run out of money by the spring of 2021.The city of Los Angeles is on track to meet its debt obligations by the spring of 2021, but the museum has speculated that the date may be pushed back further to spring 2022.“We are working hard to address all the outstanding issues that will require additional funding over the next few years,” said Heather Grant, director of the museum and the city’s Department of Finance. “We will continue to have financial flexibility to reinvest in and raise new funds, and we will continue to meet our obligations as a city.”\n\n\nThe Institute of Contemporary Art (ICA) in London is planning to move the Royal Academy of Arts (RA) and the National Galleries of Photography (NGA) from its current locations in St. Paul's across the Thames into a larger, state-of-the-art facility. The move", "The next Biennial should be held in 2022. The next Art Basel,  should be held in London in 2020. And the next Art Centre,  should be held in Hong Kong in 2019. The next Art Paris,  should be held in Paris in 2020. And so forth. The Future Art Institute, which is funded by the billionaire Matias Duarte, is planning to expand its location in Miami Beach by 1,000 feet. Its first exhibition, Art in Hawaii: From Hawaii to Tokyo, is currently on view through February 20.“The future of art, and the future of architecture, is at the heart of Future Art World,” said Gregory Whitley, director of the Future Art Institute. “We are committed to supporting local, regional, and international artists across the globe, and to helping them realize their visions of the future. We are grateful to our partners, our sponsors, and our board members, and to our fans for believing in us.”\n\n\n\n\n\nJohannes Wolfgang von Goethe, the German sculptor and painter whose art and philosophy fused realism and psychedelia, died on March 22 at the age of eighty-three from complications from a", "The next Biennial should be held in 2021, but an exact date has not yet been set. \n\n\nThe Italian government is proposing to fine art dealers €55 million ($59 million) for not paying workers at the Venice Biennale, which was canceled last month due to the coronavirus. The Fine Arts Museums (FAIM), the Rome-based umbrella group, said the seizure of “non-payment of wages and of overtime” is one of the measures it is taking to curb the spiraling costs of the Covid-19 pandemic—the group’s CEO, Paolo Gentiloni, said that the fines will fund the and will be made in installments.“This is a systemic situation in which the whole art economy is collapsing,” said João Pires, president of the Venice Biennale. “It is a problem that needs a comprehensive solution.”The Fine Arts Museums, which represent Italy’s museums and archaeological sites, are concerned that these fines will not deter unscrupulous business owners from exploiting workers—many of whom were not offered healthcare or paid holidays—and are arguing that the fines are being used to intimidate those who cannot afford to pay. ", "The next Biennial should be held in the first half of 2020.\n\n\nThe International Council of Museums (ICOM) in Vienna has announced that the forty-fifth edition of the Fifty-Ninth Venice Biennale will take place in the capital city in 2020. The event will be organized by Günther Steinbach Gallery and curated by Jacky Iker. The event will celebrate its fifth anniversary in style with a new exhibition, a nineteen-seat performance by the German artist Ernst Günther and a selection of new works by artists from the fifty-six countries represented in the museum.The event will run concurrently with the forty-fifth edition of the Fifty-Ninth Venice Architecture Biennale. The next edition will be held in the former Weise castle in 2021 and will be curated by Helmuth von der Leyen, whose first project for the museum was the renovation of the former St. Malo church in Berlin in 2015. The next edition of the Venice Architecture Biennale will be held in the former Prussian palace in Maricá in 2022 and will be curated by Lars von Trier, who is currently working on a new version of the super-popular photo-op.The Venice Architecture Biennale will be", "The next Biennial should be held at the Art Institute of Chicago, which is currently undergoing a $100 million expansion. The new venue will host the first show dedicated to the Glass-Steagall Act, a statute that separated commercial and investment banking, and will feature thirty-five works by forty-nine artists.The exhibition will also highlight the work of fifty artists who were not represented in the first Biennial—Artur de Man, Léonie Verbeek, João de Gas, Joseph Gallus, and Thomas J. Jones. The exhibition will draw from the following sources: the influence of the former regime, the early years of the art world, the history of the contemporary art world, and the cultural production of various regions, with particular reference to the United States. The show will open on March 18. \n\n\nMore than fifty artists and collectors have launched a $50,000 crowdfunding campaign to help the original members of the National Ballet of Scotland, who are suing the Crown over the group’s decision to abandon the organization’s annual production of the company’s major new play, The Grandmaster. In a statement, the group said: “We are raising funds to ensure the future of the independent", "The next Biennial should take place in the spring of 2021. The institution said the announcement of the dates for its next event would be made at a later date. The show, titled The Fifth Element, will feature the work of sixty artists, including A.I.R. Gallery, David A. Miller, and Frank Gehry, and will run during the fall and spring semesters. Its first exhibition was a retrospective of the work of David Salle, a pioneer of Abstract Expressionism whose work is currently on view until October 15.\n\n\nMediaite has learned that the Charles Ingalls Foundation has received a $25 million donation from a wealthy collector who is also the founder of the publishing company the Springer Group. Charles Ingalls is a former cochair of the Los Angeles County Museum of Art (LACMA) who bought the artworks in 1996 for $4.7 million and is now a major supporter of American art.“The gift was made in recognition of LACMA’s further progress in meeting its mission and for its historic contribution to the art world,” said foundation president and CEO John Carlos. “LACMA has become recognized as an important center for the study and appreciation of American art, and", "The next Biennial should be held in 2020. The 20th Biennial will be held in 2023. The next Tokyo International Film Festival will be held in 2021. The next Asia Pacific Film Festival will be held in 2022. The next Midsummer Film Festival will be held in 2021. And, we hope, the next Toronto International Film Festival will be staged in 2021.  An expanded Board of Governors comprises Dr. Rona Ambrose, president; Dr. James Fadiman, vice president; and Dr. Mark Simonson, secretary. The first event of the new partnership, titled “Born Movies,” will be held at Toronto’s New York Institute of Technology (NYIT) this fall. \n\n\nDetroit’s Metropolitan Museum of Art (MoMA) has been sold to private interests for $61 million in an $85 million deal that includes four new works by artist-in-residence Daniel José Older, as well as a special collection of works by David Childs, the artist who created Charioteurs, a surrealistic, period-based sculpture that was presented in the 1967 exhibition “70s at Detroit’s Museum of the Arts. The deal", "The next Biennial should open in 2022. However, because of the ongoing health crisis, the Flemish pavilion has postponed the event and will instead focus on a series of exhibitions that will take place between January and March 2021.“We want to be transparent about what actually happened,” Matthias Küppi, the Flemish national director for arts, told the Art Newspaper. “The board of trustees decided to postpone the biennial until the new health guidelines are in place.” Those guidelines, which were adopted by the federal government in March, state that the biennial will not be held in March 2021.Küppi also detailed the steps he took to prevent a possible slide into a government shutdown and a possible drop in visitors. “I told my colleagues and I told the president, we had to do everything we could to stop the deterioration of the situation in the country,” Küppi said. “We had to think of different ways of working.” Since the biennial was originally scheduled to take place in March, it has been moved to January. Küppi said that the decision was made after examining a number of possible scenarios, including a potential shutdown of the whole of", "The next Biennial should take place sometime in the 2020s. The magazine will publish a collection of photographs by the artists and will stage exhibitions of work in the spring of 2021.The exhibition will be organized as follows: The current exhibition, Artists, will be presented by Jean-Pierre Blériot, Mo, and Alain Guiraud, and will be held at the Institut Karlsruhe, Krefeld, and Berlin. Claude Bichat will present his first exhibition in the Hague since 1988.Hugh Bonville, the founder of the Contemporary Art Traveler Awards, will present his new award, which will be presented in the summer of 2021. The ceremony will take place at the Institute of Contemporary Arts, the London-based nonprofit institution that receives funding from the Swiss Federal Institute for Contemporary Art. Harrison Brown will present his first solo exhibition in the United States since 1994. The show will open at the Brooklyn Museum in the summer of 2021. The exhibition will be a follow-up to his 2009 show at the Museum of Modern Art in New York and will feature works by forty new arrivals, including an installation by Richard Diebenkorn and an installation by Adrienne Barlow.The inaugural Bi", "The next Biennial should be held in 2022. “The World Conservation Union (W.C.U.),” and the Windsor Foundation, together with the International Society of Cultural Memory, have announced the date for the 2019 edition, which will take place at the Windsor Castle in England. The five-day event will also feature a new theme, “Exploring the Past: An Open Letter from the French,” and a special presentation of works in the exhibition. “The W.C.U. and the Windsor Foundation are committed to the future of research and conservation and to organizing exhibitions that reflect that commitment,” said Terry Jessee, president of the W.C.U. and the Windsor Foundation. “This is a moment of great change and change is never a given. We are renewing our commitment to the conservation of the incredible natural world that surrounds us and to protecting the biennial’s outstanding exhibition.”\n\n\nThe Solomon R. Guggenheim Museum in New York has hired Anna-Sophie Atget as its new senior curator of contemporary art. She will be based in the gift shop of the museum and will be responsible for promoting and", "The next Biennial should be staged in the city sometime in 2021 and will focus on the art of gender. The theme will be “The Present.” It will also be about issues that were neglected in the past, such as the history of women’s rights, “feminine hygiene, and the evolving role of women in society.” The Hall of Mirrors: An Exhibition of Art and Regression,” curated by Aliya Imad, will take place in the museum in 2021. The exhibition’s director, Ibrahim Hooper, said: “The Hall of Mirrors’ exhibition stage and the Museum’s collection epitomize the values of the Art Fund and the Artis Foundation. We are committed to the art of transformation for the next generation.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is preparing to welcome visitors back to the institution under a $2 billion overhaul that aims to make MoCA more appealing to younger and mid-career artists by introducing more flexible hours, flexible retail, and a more streamlined operations and collection management system. The overhaul also aims to increase the museum’s reach by adding more", "The next Biennial should be followed by a campaign to raise funds for the families of the victims of the Paris terror attacks. \n\n\nFrieze announced today that Burai Ghossein and Haya Elmets have been selected as the winners of the eleventh edition of the Pride in Europe Award for the Arts in the French city of Lyon. The show will feature work by seventy artists from forty-seven countries. The prize jury comprised American author, curator, and artist Kevin McCoy; German artist, filmmaker, and filmmaker-producer Jürgen Mayer; and Berlin-based artist Jacob Klein. “We are thrilled to welcome these two extraordinary artists to Frieze,” said Frieze director Mona Hatoum. “Their work embodies the movement and spirit of France, and we are eager to present it in the gallery at the Fondazione Prada, in Milan, where it will be presented in the first exhibition of their two-year long residency program. Both artists are collaborators, creators, and transformational living beings, and we know they will bring exceptional craft and vision to their exhibitions. We welcome the opportunity to collaborate with them and with their communities in France.”Commenting on the achievement, Ghossein", "The next Biennial should be held in May 2021. “We believe that a great edition of Biennial de Barcelona is imminent,” said Yasmin Al-Qasimi, president of the Barcelona Art Biennial Foundation. “We are eager to contribute to the program, to work in partnership with the Barcelona City Council, to organize workshops and to present a program that reflects the richness and diversity of Catalan culture.”\n\n\nThe Victorian government has announced a major boost for arts and culture in the capital city. Its $1 billion Arts Council grant will go towards the development of more than four hundred arts and cultural spaces in Victoria through 2021. The initiative is part of a strategic plan developed by the Victorian government in 2018, which pledged $775 million for arts and cultural activities across Victoria. The $324.5 million grant was earmarked for the state’s regions, but the government may allocate more than $1 billion in 2019 as it considers how to reduce the state’s debt. The funding boost for the Victorian region is part of a $1.1 billion boost for arts and cultural activity across Australia, spearheaded by arts and cultural organisations and supported by the Victoria-based Greater Melbourne Art", "The next Biennial should be held in the first half of 2020. The Bangkok Art Museum and Arts and Culture Board (BAMMA) has announced that the 2020 edition of the Bangkok Art Festival will run from April 13 to April 16. The event will feature a new project by Sebastian Lüpertz. “We are delighted to welcome a rich collection of works by artists from around the world,” said BAMMA director Subramaniam Suttopada. “This is a golden opportunity to expand the exhibition’s reach and introduce new works from the city’s art scene, and we are working hard to make the 2020 edition a success.”The biennial will celebrate the city’s history as an international cultural center and will aim to provide an opportunity to further the ambitions of the Bangkok Art Museum and Arts and Culture Board (BAMMA). The project, titled Art of the Century, will introduce new works by artists such as Tukan, Tomasz Wstiwiak, and Zoya Trzewicz. The twenty-one works selected for the biennial are: Celestial Wind, a small-scale Indian kabaddi, 2019, ", "The next Biennial should be announced in the first quarter of 2020.  The full list of participating artists is as follows:\n\nValeria de Jesus’s “Sister/Sister,” Latina/o, 2018. The show is dedicated to women and their contributions to the world, with an emphasis on the labor of women. The exhibition is curated by María Berrada, director of the National Museum of Women in the Arts, Buenos Aires, and Roberto Mollino, artistic director and curator of the 2018 Whitney Biennial.The full list of participating artists is as follows:The 2019 Biennial will take place in the city of Buenos Aires, the capital of Argentina and a major transportation hub. It will also feature work by ten new artists, including Erika Bocanegra, Rosalind Wiseman, and the new artists selected for the 2020 issue of Artforum. The event will take place at the institution’s historic Plaza de Arte Contemporánica, in the city of Buenos Aires, the capital of Argentina.The 2019 edition was curated by Kamel Binay, founder and director of the National Museum of Women in the Arts, and Nicole Mercado. The exhibition", "The next Biennial should be held in the fall of 2021. Inaugurating the fourteenth will be a public exhibition dedicated to the history of the art in the city.The 2016 event, titled “Life and Art from the Middle East and North Africa,” also featured artworks by artists such as Hisham al-Hashemi, Nima Nabavi, and KENNAZI. The exhibition drew more than 2,000 visitors.\n\n\nThe Skirball Cultural Center in New York City has received a major gift that will enable it to invest $10 million in the revitalization of its historic campus. The gift includes approximately $8 million in direct financial support for the Skirball Institute for Contemporary Art, which is located on the campus of the Scripps Institution of Oceanography, and will allow the center to establish a new endowment that will be directed toward the institution’s artistic and academic programs.“From the '50s to the '70s, the Skirball Institute was a critical hub for the creative and academic life of the city,” said architect and philanthropist Daniel Skirball. “Through its programs and exhibitions, the Skirball Institute has fostered a vibrant,", "The next Biennial should focus on the evolution of digital literacy, collaboration and community, and the exhibition should be an extension of the exhibition programs of the respective institutions. It should not be a substitute for the institutions’ curricula and be organized with the same rigor and creativity as the current exhibitions. “It is important for us to understand that this is a challenging and evolving period,” said director Katsuyuki Kawamura. “It is also necessary to acknowledge that this is a time when many different forms of creativity are being reproduced through new media, and through the adoption of new technologies.”\n\n\nThe Art Newspaper, which first reported the news of the imminent closure of the legendary Oi! museum in Bangkok, has revealed that it expects the museum will stay closed indefinitely as part of a new contract with the government. In a statement, the Art Newspaper said:“The Ministry of Culture has informed us that the operation of the Oi! museum will not be resumed as of March 2019. This is a preliminary decision and the museum will receive further information on its future once the Ministry of Culture has reviewed the decision.”The decision has prompted several artists and collectors to publicly call for the museum to stay closed until the", "The next Biennial should be set to open at the Museum of Modern Art in New York in 2020. The first edition of the Biennial, “The Rise & Fall of Pablo Picasso” (2019), drew fifty-six galleries, including David Zwirner, Blum, and Galerie Lelong. It was organized by the Museum of Modern Art, which moved the exhibition from its current home in the West Village to its new headquarters in a former steel mill in the rolling hills of Orange County. The new seventy-eight-thousand-square-foot museum is scheduled to open in the spring of 2021. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is planning to take over the management of the T of T Factory in downtown Los Angeles, a space that has served as a hub for artists living in the Bay Area for more than seventy years. The museum will relinquish ownership of the space to the Los Angeles–based nonprofit organization known as the T of T Project, which will convert the factory into an artist-rich free-standing sculpture garden.In a statement provided to Artforum, the museum said that the deal, which will be announced in the coming months, will “prov", "The next Biennial should be set up in mid-April and will be open to the public only in May. The event will feature ten original works by thirty-three artists, including María Berrío, Juan Ponce De’s “Allí amigos” (2005), Íñigo Ceíza’s “Bejeta” (2010), and Elena Guarani’s “Luis Alberto” (2014).“The biennial is a reflection of the vitality and diversity of our world,” said José Pérez, director of the Biennial of Contemporary Art. “Its artists and curators have been inspired and inspired by their environments, their own identities, and their own work. We are delighted to see the first exhibitions that reflect this.”The full list of participating artists is as follows:Peña Nieto, MexicoCity;Chen, ChinaChen Gallery, Shanghai;Juan Ponce De’s City of the Dead, Mexico;María Berrío’s “Bejeta” (2018);Cátia Catellani’s “Tora el río”", "The next Biennial should be held immediately, and will be presented by curator Lizenba Mabry.“We are ready to work with the artists to make their work meaningful for the audience,” said Mabry. “The most important thing is to make the work stimulating and exciting. This is a challenge that we as a society are unable to face. We are all still in a period of transition and uncertainty. We are all trying to make sense of the problems that are presented by the past and the future.”As the term 'Artforum’s first North American biennial was announced, the biennial was engaged in a three-way contest involving renowned American artist and activist George Owens, a New York–based nonprofit organization called Artforum Action; and the Museum of Contemporary Art (MoCA), which is suffering financially as it works to restructure its collection. In the second round of the exhibition, curated by artist, curator, and curator Michael Sjöström, art historian and curator Anna Atkins, and artist and activist María Berrada, the first part of the show will be presented in May 2019; the second part in November 2020; and the third part in June 2021.The exhibition will", "The next Biennial should take place at the Museo de Arte Contemporáneo in Madrid, where the work of the year will be announced in December 2020, and will take place at the Museo de Arte de Madrid, which is currently undergoing a renovation, in December 2021. The theme of this year’s edition will be “Towards a Critical Vision of the Imagination,” which will explore the role of art and the body in contemporaryity.“The shortlisted artists are Wangechi Mutu, Akunyili Ntseghe, Natarajani Naidu, and Nishikant Bose,” said the exhibition’s director, Rosa Catellani. “These are critically important works and the only ones that will be presented at the Biennial for a new century, a new present and a new future.”\n\n\nThe National Galleries of Scotland announced today the launch of a new digital platform, National Treemap, which will help visitors understand and access the collections, exhibitions, and collections of the National Art Museum, London, and the National Gallery of Scotland. The initiative is designed to provide a more effective and accessible", "The next Biennial should take place in 2019. The next year should be an attempt to approach the same set of themes in a new and different way, taking advantage of the fact that ten years is a long time and the fact that the sixty-fifth Biennial was held in 2012. The next year will also be a retrospective of the work of the Latin American artists presented in the first Biennial.The exhibition will also be a commemoration of the seventy-fourth Biennial, which was held in Miami Beach in 2010, and will feature the work of twenty-four artists, including Marcel Prouvé, Karina Ibarra, and Seruí Pérez-Montoya. The biennial will focus on the work of women artists and will be curated by Peggy Flynn, director of the National African American Museum, in partnership with the Smithsonian American Art Museum in Washington, DC.\n\n\nThe Baker Center for the Arts at Brown University in Providence, Rhode Island, has appointed Joëlle Gastele as its next executive director. Gastele succeeds Kristin Birnbaum, who retired last month after fifteen years at the helm of the arts and culture complex, and will take up the post on November 8.“Joëlle Gast", "The next Biennial should bring together artists from seventeen countries. It will also include the first-ever live performances by artists from the same country. In addition, the exhibition will feature an exhibition of works by two artists from the same genre, and will feature the first-ever “art at home” series. “I’m thrilled that the first Biennial will be an international event, and that we will be able to reveal the results of our next iteration with greater clarity and insight,” said Richard Armstrong, chair of the board of trustees of the British Council. He added that the exhibition will “continue to advance the work of art today, and to set new standards for art of the future.”The 2019 edition of the Venice Biennale, titled “Innocence and Experience: The Venice Biennale” (September 19–September 21), attracted almost 120,000 visitors. The 2020 edition of the Venice Biennale will be held in the city of Venice from January 22 to January 27, 2021. The event will also feature performances, lectures, and exhibitions, and will take place at different locations around the city.\n\n\nThey say you don’t notice the difference between", "The next Biennial should take place in the city of St. Petersburg in the spring of 2020. The next edition will see the exhibit “The Conception of Modern Life” opened in September of 2019 and will be held at the State Museum of Fine Arts. The museum also announced that it is planning to expand the museum’s collection by 1,800 works in order to include the collections of the State Museum of Fine Arts, the National Gallery of Fine Arts, and the State Children’s Museum. The expansion, which has been described as a “landscape of light” in a statement, will involve the construction of two new galleries and the renovation of the existing spaces in order to create a new exhibition space in the museum.\n\n\nThe British Council announced today that it is launching a $2 billion fund to compensate artists and art workers who lost out on jobs through the Covid-19 pandemic. The Covid-19 Arts and Culture Trust Fund will provide funding for artists and cultural workers who have experienced losses and will prioritize those in the creative, design, publishing, and/or hospitality sectors.Established to compensate artists and cultural workers who were displaced by the coronavirus, the fund will initially offer", "The next Biennial should be held in 2021, and the art of the exhibition should return to the same venue next year. The theme of the 2021 edition will be “Toward a World Without War.” He added that the show will be “relentless, uncompromising, and exhilarating.”The 2018 exhibition, “Toward a World without War,” featured fifty works by seventy-five artists. The exhibition, which was curated by Yinka Shonibare, takes place in space as well as in time. The show, which also features work by artists such as Juma Murli and Junya Ishigami, will be on view from February 19 to February 22, 2020.\n\n\nArchitects Berenice Abbott and Felix Mendoza, whose design collaborations include the Brooklyn Museum’s David K. Riback and the Metropolitan Museum of Art’s Frank Gehry, have won the 2019 Adeline C. and Zhenya B. Cullins Award, which is given annually to a Philadelphia-based artist or designer. The $50,000 prize has been established since 1991 by the Adeline C. and Zhenya B. Cullins Foundation to recognize the", "The next Biennial should aim to introduce viewers to the work of the exhibition’s previous winners, with a particular focus on those who have never been presented at the Biennial. The theme of the 2019 event is “Gündemusic” and will include artistic collaborations between Minna Okkua and Kiyomi Muto, artistic collaborations between Kim Seo-kyung and Suehong Yoon, and artistic collaborations between Pilar Corrêa and Zoran Coelho.\n\n\nConceptual Artists London (CAA) has announced that it will welcome its new members in the form of an open call for short-list artists to participate in the 2020 edition of the biennial. The venue will stage the first three weeks of the event at a time at Broadmoor, London, from August 2 to August 5. “The concept of CAA as an open platform for people to come together in artistic collaboration is not new, but we are delighted to be able to present it here in the UK,” said Rineke Dijkstra, cofounder of CAA. “These artists will join us in transforming the notion of the Biennial", "The next Biennial should be held in the city in 2020. The 2018 edition, entitled Biennial of the City of New York, was canceled due to the Covid-19 pandemic. Stephanie Cotter, a curator at Tate Britain, said: “The future of Tate depends on whether these extraordinary curators, who have been working in the shadows, are allowed to anticipate and address the new threats. They cannot afford to miss out on the moment.” So far, the London-based artist-run museum has selected Alex Katz, Nina Lynne, and Sylvia Blesener as the five artists whose works will be featured in the third iteration of the Tate Modern Biennial, called “Tate Modern: Its Art and Artifacts.”\n\n\nThe National Galleries of Scotland (NGA) has received a gift of at least one hundred rare books from the late British artist Ronald Goodhart. The donation, made in his will in August 2018, involved a collection of paintings, prints, drawings, and sculptures that were on display in his studio in London between 1951 and 1969. According to the New York Times, the painting and sculpture pieces, which were on display in", "The next Biennial should explore the relationship between urban design and social welfare, with a view to incorporating indigenous traditions and urban design practices into the programme. In line with the theme of the 2020 Biennial, the exhibition should consider the limits of architecture as well as the possibilities of urban life, which is grounded in the biological boundaries of human beings and their relationships with each other and with nature. \n\n\nThe Norman Foster Foundation in New York has established the Norman Foster Center for American Art in honor of its founder and visionary mentor. The forty-third annual Foster/Norman Foster Galería de Arte Contemporáneo (FFCG) will take place at the Museum of Modern Art (MoMA) in New York from March 19 to March 21, 2020 and will comprise two exhibitions. The centers, which were founded in 1978 by Foster and his wife, Jane, will collaborate in advancing the current generation of American composers and will serve as a platform for artists to organize exhibitions and public programming in partnership with Foster.Foster conceived the center as a means of fostering and promoting the work of the FFCG’s current cohort of artists and participants, who are between the ages of twenty and forty-five years old.", "The next Biennial should take place in 2019, and the next will take place in 2023. The next exhibition should take place in 2020 and the next will take place in 2022. The words of the biennial’s title, “the Commonplace of the Mind and the Body,” are intended to evoke an apprehension of the common. The themes of the biennial are love and the body, creativity and the environment, and the practicality of the body. The artist-run venue will be expanded with a new exhibition, “End of the Life Cycle,” that will focus on the biennial’s theme, the body and the very possibilities of life, the body and the universe. The exhibition will take up themes of death, the body, and the afterlife.The new biennial will premiere at the fourth Biennial of London’s Architecture Club and will be held at the London campus of Tate Britain from January 26 to March 29, 2020. The reopening of the Tate's two central buildings—its Tate Modern in London and Tate Liverpool—follows a £640 million ($950 million) expansion project, funded by the European Union and the British government, that will transform Tate’s", "The next Biennial should take place in the city of New York, which is currently working on its 2020 iteration of the exhibition. The project gained momentum in the 1990s, when the artist-run museum hosted the exhibition of his painting and his next exhibition, VIII – A.E.I.N. (meaning The Eternal in Youth), opened in 1998.The new exhibition will be curated by Nari Ward and will be curated by Doug Aitken. Biennial director and curator Sarah Laursen, who was recently named curator of the century, said: “We are thrilled to be hosting this year’s Art in Sustainability [event], and we are especially excited to be collaborating with Doug and Sarah on this project. Their breadth of expertise and passion for the art world and their willingness to engage with the local community is inspiring. We expect this to be an exceptionally challenging, challenging, and rewarding series.”\n\n\nThe Whitney Museum of American Art in New York has opened an initiative that will partner with smaller, nonprofit organizations and individuals to create online educational content about the history of American art. The first phase of the program, which will focus on the mid-19th century, will launch in", "The next Biennial should take place in 2020, and the 2020 edition will also mark the centenary of the birth of the Russian philosopher Georges Sébastien Balsch. Giulia Papelli, the director of the museum, predicted that the exhibition “will introduce new and diverse ideas in the form of a multi-dimensional narrative.”\n\n\nThe Museum of Modern Art (MoMA) in New York announced today that it has received a gift of forty works by the artist Susana Mendieta, who died in 2015. The work, titled “Feminine (or not)”\u0097a feminist commentary on the relationship between images and mimetic art\u0097is one of the works on display at the museum.“I’ve long admired Susana,” said Peter W. deCordova, the director of the museum. “Her work, including her paintings, sculptures, videos, and installations, are the heart and soul of MoMA.”Mendieta, who made her debut in Italy in 1940 in a series of paintings called “Cinderella Girls,” 1966 in a video installation called “Rosetta,” 1976 in a video", "The next Biennial should be held in 2020, with the exhibition of the artist’s final work, “The Window of Solace.” The selection will be presented in a special exhibition at the Art Institute of Chicago (ICA) in Chicago in December 2020.\n\n\nNew York’s Metropolitan Museum of Art (MoMA), which recently began a $1.2 million expansion, has announced that it will soon host the art of Zaha Hadid, the Chinese architect whose monumental, glass-enclosed extension of the Whitney Museum of American Art in New York, called the Lotus, began as a $1 billion effort but grew to become the world’s largest art museum by 2012. The museum will soon open a fifteen-thousand-piece virtual reality museum in the museum, and will present the first VR experience of Hadid’s work in the United States.“The move to the museum comes as MoMA’s board of trustees continues to invest in the museum’s collection and expertise, and in the museum’s future. MoMA’s right-hand man, Nicholas Moser, is the CEO and chairman of the private investment firm Kohl & Co., and he", "The next Biennial should take place in the spring of 2021. Afterward, the sculpture-maker will present her first exhibition in the new venue, which will be inaugurated with a retrospective of her work Burnt Earth. In future years, the store will have space for more shows of her work.The festival’s main goal is to create new work by emerging and established artists, making space for more women artists to participate and garner international attention. More than ten hundred artists will be selected for the exhibition. The twenty-one-minute-long series “Deep Breath—” one of the first works by artist Øystein Nilsen’s, “The Painters that Shaped the World,” will open at the museum in February. It will run until March 26.\n\n\nThe Milano-born, Chicago–based artist Sam Gilliam, a professor of art history and design at the University of the Arts London, has won the Prix d’Art Contemporain (PAAC). The sixteen-year-old winner of the $15,000 prize, which is part of the Breakthrough Award, alongside Sarita Gupta, Niles Villalobos, and Kada Barran, was", "The next Biennial should commence in 2020 and will draw from the collection of eminent Italian architect Ciro Catellani, renowned for creating the first permanent monuments in Italy in 1950. Its themes will be “Plans and Obstructions” and “Form, Expression, and Function” and will celebrate the legacy of the artist-in-residence, Marianne Bancro.The exhibition will be held at the new Golden Lion, Punta della Dogana, in Venice and will comprise 80 works, which were created in the early twentieth century or have survived in post-war Italy. The selected curators include Andrea Catellani, Matteo Pellegrino, and Salvatore Gagliano.The exhibition will encompass forty-two displays from the Biennial’s inaugural year, which was held in July 2019. Featuring works by the fourteen artists who were invited to participate from the fifty-one artists who were nominated by the public, the exhibition will also include a collection of rare and out-of-print works, as well as a short-lived, but groundbreaking, contemporary art project. Histórias delle Fotografico di Beppo (Winter 2019) and Continuo 1-", "The next Biennial should be held in 2022, and the third in 2020. The biennial will be held at the Sydney Opera House from March 10 to March 12, 2020 and will be co-organized by the Museum of Contemporary Art (MoCA), Sydney, and the David Lewis Black Art Gallery, New York. The duration of the event will be three days.\n\n\nThe Museum of Contemporary Art (MoCA) in New York is trying to get rid of a controversial moat behind the American Museum of Natural History in New York after a group of artists staged a protest over the construction of an exhibition space in the former warehouse. The organization announced on Tuesday that it is planning to remove the moat in an effort to promote the revitalization of the area around the museum.The moat, which has served as a barrier between the museum and the nearby Hudson Yards development, has been a contentious issue for the institution since it was founded in 1973. The museum’s board chairperson and director, Rachel Stoltz, said that the removal of the moat is necessary to promote the revitalization of the area.“The Museum of Contemporary Art has long championed a revitalized Museum District, one of the country’", "The next Biennial should be held in 2021, when the museum will be expanded to house the exhibition of the first exhibition by a Muslim artist in its history; the institution’s current exhibition, “Between the World and Me” (2017–18), was staged in the museum’s former space, which was converted into an academic center in 2015.The decision to abandon the exhibition was made after the museum received 3,600 applications for the program, which was created by art historian and curator Aya Saeed and artist Suzan-Lori Parks. The pair presented the project at the end of a three-year exhibition at the museum in September 2019. The exhibition was inaugurated by the artist Tarek Atoui, whose work was selected for the 150th anniversary of the institution. The museum has yet to announce the winner of the biennial.\n\n\nThe California African American Museum (CAAM), which recently underwent a major expansion that added more than 125,000 square feet of exhibition space for the first time, is teaming up with the Los Angeles County Museum of Art to present a new album of paintings by African American artists. The show, “Folklore,” will be on view in the newly renovated", "The next Biennial should be held in 2020.\n\n\nWest Berlin’s federal art museum, the Hamburger Bahnhof, has received a new gift of more than one hundred works by artist Hieronymus Bosch. The institution also announced that it received an additional twenty-six works from the artist during a gift exchange between the institution and Bergenbau, which takes place annually in September.Signed by the Hamburger Bahnhof curator Harald Hertog and Bosch’s partner Petra Hülkenberg, the six-month-long event will be held at the museum’s Tugelskammerhaus, which is currently undergoing a renovation. The exhibition will be hosted by the museum and its partners and will be open to the public from September 24 to September 26, 2020.“Hermann Franz Kohn, the composer who created the art of music, was among the first to recognize Bosch’s talent and to direct the design of the show,” said Harald Hertog. “For decades, he has had a unique position as one of the most important designers of modern times. His profound aesthetic understanding and ability to visualize complex causes is an indispensable element for the development", "The next Biennial should be held in the spring of 2021. Our current programme of events and exhibitions will close after the 2020–21 season. \n\nMIAC, the New York–based nonprofit that promotes the work of emerging and established artists and their work in galleries, has announced that it is launching a new initiative, MIAC Think, to help artists and their teams think about how arts and cultural institutions can continue to operate and increase their impact through digital technologies. “The future of art and creativity is visual,” said MIAC director Mary Anne Carter. “MIAC Think is an extension of that vision, allowing our artists and curators to plan, plan, plan, and plan again. It is a resource for thinking about how we use, store, organize, present, and share.” The initiative will offer artists and curators two options: make an abstract art installation, or create a digital work that analyzes a theme, an artist’s previous work, or an established artist’s work. Participants will be asked to envision an institution or a place where art and culture can be developed and enjoyed. “MIAC Think represents another way for our artists to experiment with new digital", "The next Biennial should be held in the first quarter of 2020. “The present exhibition was conceived as a way of launching a new and exciting project, which is something that our team has been working on since 2016,” said Anna-Karin Panneko, curator of the exhibition.  The new project will include new works by the artists participating in the exhibition, which is currently on view in the museum. \n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles announced today that Savvasa Zivanovsky has been appointed its next president and CEO. Zivanovsky currently serves as the founding artistic director of the Cooper-Hewitt, Carnegie-Pittsburgh, and the Museum of Contemporary Art (MoCA) in New York, as an honorary senior curator at MoCA, and as the editor in chief of Seventeen. “Savvasa’s leadership, vision, and energy are essential to the future of the museum,” said curator and current MoCA board chair Natalia Lissoni. “A brilliant and dedicated curator, she has been instrumental in ensuring that our exhibitions, our collections, our programs, and our visitors experience the museum in a way that can be meaningful and unprecedented", "The next Biennial should be held in the summer of 2021. The organizers are also considering holding the next edition in spring 2022.The decision to postpone the event, which will be held in June 2020, was made after the organizers were approached by the city of Malmö, Sweden, regarding the possibility of hosting the event in July 2020. In order to move the event to the spring, the organizers have been working with the University of Malmö on a new series of exhibitions. The exhibition will also include a “new topic for the exhibition,” which will take the form of a “conversation between a curator and a visitor.”\n\n\nThe National Geographic Society’s board of directors has appointed John Carroll, a senior executive at the company who has been responsible for overseeing the corporation’s strategic planning for four decades, as its new board chairman. Carroll arrives at the museum from the Ohio-based firm of Carroll & Son, where he has served as director of development since 2016. He succeeds Peter W. Dobson, who took the helm of the organization in February 2019.Dobson retired in March 2020 after a decade at the helm of the institution, which recently completed a major expansion and renovation project that added", "The next Biennial should be held at the end of July, at a site near the city of Barcelona, where the exhibition will continue. Though the site has not yet been selected, it will likely be located in the city in the far north of Spain.The Biennial will be held at the Institut Henri de 1½ études in Paris, which has a museum in the city, and at a historic site in the city known as La Villette, in the historic district of Palaiseau. The exhibit will include works by forty-seven artists, including Paul Gauguin, Henri Matisse, Paul Haguerre, and Rembrandt; and will take three weeks to construct.The exhibition, which celebrates the 120th anniversary of the French Republic with a residency program that will welcome fifty-three artists, will launch with a special exhibition of work by artists such as Casa Victoria, Leomé Ait-Île, and Theo Varèse. The opening of the Biennial is considered a milestone event for France. The next edition will take place as planned on September 29–December 2. \n\n\n\n\n\n\nArt in Transition, New York: The New York Armory and Museum (NYAM) in", "The next Biennial should take place in Tokyo in the first half of 2022. A second edition will be held in the Hong Kong city of Hangzhou in the second half of 2022.The 2020 edition was held at the Dusan Biennale Center for Contemporary Art (Dusan), in Seoul, South Korea, and the 2020 edition of the Jerusalem Biennale was held at the Guggenheim in Paris.\n\n\nThe British artist Stella Creasy, whose vibrant, often surrealist paintings explored the relationship between reality and myth, died on Tuesday at the age of eighty-eight.Despite her prolific output, a number of these pictures - including the often-unrealistic paintings for which she often drew inspiration from the highly social, often sexual, and often violent art of the 1970s - were deliberately placed in museums in the 1970s. Creasy’s art was brought to Western Europe in the 1980s by the artist-collector and filmmaker David Lynch, who invited her to his home country in the US. When Lynch passed away in 1998, she returned to England to live with her parents and continued her art-making career.In a 2017 Artforum article titled “Stella Creasy: The Untold Story” she", "The next Biennial should be held in 2021. However, given the current politically unstable situation and the slow pace of the İstiklalığı region, the centenary is now likely to be pushed back. “In order to avoid any unnecessary disruption to the work of the artists, the Biennial will not commence until the autumn,” Thorbjorn said. “Therefore, I sincerely hope that the artists in Istanbul will be able to participate in the next edition of Art Istanbul in 2021. I look forward to working with the Istanbul-based artists and their families to determine the theme and the theme of the next edition.”\n\n\nThe German government announced on Thursday that it intends to introduce a minimum wage of $0.85 per hour, or €0.85, in April 2019. The minimum wage will be implemented in an attempt to mitigate the health risks caused by the ongoing Covid-19 pandemic. Chancellor Angela Merkel said: “With the onset of the Covid-19 crisis, we have to make sure that workers are paid, and that employers are paying what they have to pay. This is reinforced by the fact that almost one-third of all part-time employment", "The next Biennial should take place in 2020, at the newly renovated Art Market, which was inaugurated by the Biennial of Live Art in 2016. The next iteration of the Biennial of Visual Arts will take place in 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Leah Dillehay as its next director. She succeeds Kirsten Lookman, who has served as the museum’s interim director since August 2019.“Leah is committed to the future of MoCA and is a leader in the industry when it comes to innovation and experimentation,” said Michelle Levine, MoCA’s executive and artistic director. “We are excited to welcome Leah into the MoCA family.”Dillehay joined the institution as assistant curator of modern and contemporary art in September 2014. She has worked in the museum’s curatorial departments during the institution’s two-and-a-half-decade history. She has also served as a consultant for MoCA and has held senior positions at the institution.Prior to joining the museum, Dillehay served as the curator of works by artists such as Julian Schnabel, Danny Pudi, Terrence Malick,", "The next Biennial should take place in the summer of 2020. The institution is still working on the logistics of hosting the event, and will present its first edition in the spring of 2021.The new biennial will take place at the newly renovated Museums of the National Museum of Denmark. The institution will take the same design as the biennial, but will have a different collection of works, a different opening, and a different theme. The schedule for the event will be announced in the coming months, and the inaugural exhibition will open in March 2021.The Danish artist Lars Christian Nielsen, who is best known for creating works such as the Toledo Opera House in Ohio and the Toledo Museum of Art in Maine, will be represented by Copenhagen Contemporary. Nielsen will be represented by the contemporary arm of the Danish art-world giant Danske Bank, which has a space in the museum. Nielsen has also represented Denmark at the Venice and the Venice Architecture Biennales.“Lars was very much a Danish citizen, and his work is deeply rooted in Danish culture,” said Danish art historian Petra Finnsjø, who recently curated a Danish-authored exhibition at the museum. “The exhibition ‘Lars Nielsen:", "The next Biennial should take place in 2020 and will be two years behind the current iteration. The 2018 show, “Radical Women: Art and Politics in the Age of Women” was curated by Carrie Cahn, Yoko Murakami, and Yanira Matsumura, and featured work by eighty artists. The 2019 show, “Wu Shan: Sixteen Years After,” was curated by Xiao Chen, Chi-Qie Xu, Jie Xu, and Yin-Yin Huang, and featured work by seventy artists.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it plans to reopen to the public in October. The March 14 announcement marked the first time the institution will reopen since 2012, and it coincided with the reopening of the Los Angeles County Museum of Art (LACMA), which was inaugurated by Peter Schäfer in 1981 and has since become a major cultural hub for the greater Los Angeles area.“We are encouraging everyone to come back to see the great works that are on view in October,” said Marc Glimcher, director of the museum. “The upcoming exhibition ‘The Architecture of Light’ is a huge milestone, and", "The next Biennial should be dedicated to the development of the theory of mass American art and mass American social change as well as the importance of the mass culture industry in sustaining and advancing capitalism.”In addition to its annual exhibition, the museum also hosts a series of interactive projects that examine the history of art and the field of communications, called the Embrace, and is planning to build its first archives. The Embrace will be a multi-channel, experimental space where the public can experience works by and see works by artists currently underrepresented in the United States.The Biennial also announced that it will create a new position working across the museum in order to ensure that the Art and Art History departments are able to continue to operate in a reduced capacity. The newly created position will be created as part of a new three-year, fifty-million-dollar plan that will support the museum’s efforts to remould its image and its collection through a newly commissioned, artist-led exhibition, “American Art and Art History: Its Past and Present.”The plan is part of a broader plan that will invest $11 million into the Arts and Culture in the next two years. The museum is currently working on revamping its current campus,", "The next Biennial should be in 2021, with the date to be fixed by the Board of Trustees.\n\n\nNelson-Atkins Museum of Art (NAVA) has partnered with the charity the Lucy and Edna Rosenspiel Foundation to create the first-ever eight-person master class. The program, titled “Master Class,” will focus on the theory and practice of the art of drawing, painting and sculpture with the goal of assisting students in their early stages of study.“NAVA’s commitment to supporting students and accelerating their careers is a priority for the foundation,” said Lucy Rosenspiel. “We are honored to work with the foundation to advance the careers of these remarkable artists. We hope that the program will inspire a new generation of artists to pursue their dreams.”In addition to the program, NAVA is launching a new fundraising initiative that will reward artists who make the most generous contributions to the library, galleries, and arts, which will debut later this month. The initiative, which will reward donors with brand-new works by artists such as Paul Gauguin, Franz Kline, and Ed Ruscha, will run through March 29.Sponsored by the Lucy and", "The next Biennial should be held in February 2020.The exhibition will be curated by Sam Allardyce, the artistic director of the Albert Hall and the Buddhist Museum in the UK, and will focus on the showpiece of the event, a granite sculpture known as the Mulayamikṣa Buddha. The work of the artist, who has lived and worked in Delhi for forty-five years, will be presented by an Indian artist, Nandini Gupta, and will be presented by the artist herself. The exhibition will also feature a selection of the artist’s other works, including the works on paper and pen, which are in the exhibition’s collection.\n\n\nThe Art Centre of the City of London (ACE London) is planning to close its four galleries—the Museum of Modern Art (MoMA), the National Portrait Gallery, the Tate and the Tate Britain—in March 2020 to restructure its business. The move will result in a $140 million cut in funding for the organization and will also see the end of the Metropolitan Museum of Art’s current exhibition program, which runs through April.The Met, which has seen its average attendance increase by 5 percent annually since it moved to a new building in 2007, will", "The next Biennial should begin in the spring of 2022 in the town of Biapolis–Marrakech. The institution has announced that it plans to launch a crowdfunding initiative for the event, and that it hopes the event will draw a total of 8.5 million visitors to Rome. Its next show, titled “L'Apollina di Lavazza,” will be staged in the summer of 2024.\n\n\nThe Museum of Contemporary Art (MoCA), San Francisco, has added two new members to its board of directors: artist-in-residence Matthew Wong and artist-in-residence and curator-at-large Caroline Cortina.Wong, who has lived in San Francisco since 1984, will serve as a board member until March 2022. He succeeds James F. Kellett, who retired in February 2019 after a decade at the museum.“Matt is dedicated to the mission of MoCA and is motivated by a desire to see MoCA continue to thrive as an institution for the arts and the community through his first ten years,” said board chair Ollie Fisk, who chose Wong over Weston Hawk, who has been a trustee of the institution since 1996. “His background as a curator and artist", "The next Biennial should be in 2020.  \n\n\nThe Metropolitan Museum of Art in New York has launched a $5 million fund to assist artists and collectors in the city who are experiencing financial difficulties due to the Covid-19 pandemic. Funded in part by the Museum of Modern Art (MoMA), the fund will distribute $250,000 to art collectors in the city, which currently has more than 1,700 Covid-19-infected patients. The fund will also support the retention of artworks and the collection of artworks with a value of $250,000 or more.The fund was established in September 2017 by the Museum of Modern Art (MoMA), Art in America, and the Art Fund, which was founded in 2006 to address financial barriers faced by artists and their heirs through federal grants and private donations. Currently the fund disburses $7.5 million annually. “Covid-19 has made clear that art and artmaking is an essential component of a functioning and flourishing society,” said Museum of Modern Art director Daniel H. Weiss. “Connecting the museum to the creative life of the city is essential for our future. We", "The next Biennial should be held in the West Bank city of Bethlehem in 2022. In a statement on Sunday, the Israeli Ministry of Culture says that it expects the exhibition to be completed by March 2022. While the center is currently closed to the public due to the Covid-19 pandemic, it will reopen in the coming months. The museum’s director, Uli Büchner, said that the institution was “working hard to prepare for a possible visit from the public.”\n\n\nThe nineteenth edition of the San Francisco Biennale, held this past Sunday and slated to run from May to October 2021, was canceled due to the coronavirus. The event was supposed to draw an estimated sixty thousand visitors, but organizers reportedly reduced the number by two thirds after they discovered that one in ten people who had tested positive for Covid-19 had died or were hospitalized.“It was a real shame,” Adrienne Edwards, the chair of the biennial’s committee and a former president of the Royal College of Art’s art department, told the Los Angeles Times. “We had hoped to have an impact with a very large audience. Now we don’t know", "The next Biennial should be held in 2020.The United Kingdom’s Tate Modern was forced to cancel a planned two-day event due to the pandemic after organizers realized that the public would not be able to travel to the museum unless it suspended its planned programming. The Royal Shakespeare Company also recently announced that it will not be able to stage the company’s forthcoming season, which was set to begin on December 22 and run until March 29. The Royal Philharmonic, which had already committed to organizing at least one day of the event each year, has since issued an urgent statement regarding the current situation. In a statement, the Royal Shakespeare Company said: “We are deeply concerned by the current situation in which our annual Festival of Trades, which celebrates the contributions of artists of all kinds, is suspended indefinitely. The future of the Festival is at stake. We have always believed that the immediate task was to rethink what a Festival of Trades could and should be. The Festival is the largest stage for the work of so many talented and committed artists. We have tried to work with our commissioning agency to develop a framework that would enable us to continue to have a strong, global platform for their work. However, given", "The next Biennial should be held at least once a year. The theme of the second Biennial should represent the past twenty years of the museum’s experience with and exploration of the discursive power of technology. Both the 100th and the 150th Anniversary Centres will celebrate their years of organizing. The museum will again host an exhibition of works by artists whose work is on display in the new galleries, and will move the exhibition space. It will also be the site of the new exhibition, “The Future Is Now,” which will examine the legacy of Chinese artist Sun Wukong, and of two new commissions, “The Art of Situations,” which will be curated by the artist Xianqiang Wang and “Unfolding Spaces,” which will be exhibited by William Wegman, curator of contemporary art at the Whitney Museum of American Art in New York.The exhibition “The Future Is Not What It Used To Be” will focus on the question of how art and technology are changing the world today, and will include works by artists whose work was not included in the current edition of the International. It will also showcase new work by twenty-three artists and will run for a total", "The next Biennial should be held in the spring of 2021, and the first in the fall of 2022. The exhibition will take the form of a “game,” where the work of twenty-one artists will be presented in a three-dimensional space.The inaugural show, “Ebony and Steel,” which ran from September 2013 to October 2014, was staged at the Modern Art Museum in London. More recently, the gallery sold the works and had the sculpture/installation “Entre la mort” installed in the lobby of the museum. The installation held its first show at the Contemporary Art Museum Paris in June 2019, and that exhibition was followed by its inaugural show in the Louvre in June 2019.Prior to joining the Contemporary Art Museum in St. Louis, the Los Angeles–based artist and curator was a curator at the Museum of Modern Art in New York. He is also a cofounder of the independent collective Romeo and Juliette, whose work is currently on view during an exhibition opening at the CNE in Paris on January 29.\n\n\nThe NRA’s board of directors has declared that it is planning to increase its lobbying spending to $1.5 million in 2017. The sum is nearly double the", "The next Biennial should launch in late March, and should include work by forty artists. The theme will be “In Praise of Art” and will be reflective of the themes of the past two years. The exhibition will take place in different venues – the museum will host the masterclass in the building and will stage a reception in the gardens. “The Dreamers” will be the first exhibition in the series, and the first exhibition that will be held in a museum in the city of Praia da Luz. The exhibition will include work by forty artists, including Diane Arbus, Renata Vallejo, Daren Marden, and Ludwig Kallmann, and will run for three weeks.The museum will also develop a new platform for art in the city, a museum of art in the city, and a museum of modern art in Brazil. The center of the project will be a public space that will incorporate art, architecture, and gardens. The sixty-five-thousand-square-foot space will be located in the central district of Rio de Janeiro, and will be funded by the city of Rio, the state of Rio Grande do Sul, and the private initiative organization", "The next Biennial should be held in January 2020 and should bring together artists from more than sixty countries. Louis Vuitton’s joint venture with the Chinese company Alibaba, announced last year, drew more than 3.2 billion visitors to its Beijing HQ last year and raised nearly $7 billion for the company. The partnership also saw the launch of a series of online shopping channels, including the online fashion marketplace Taobao, which has since expanded to the online marketplace Alibaba. The initiative has since been extended to other cities, including Shanghai, Hong Kong, and New York City.\n\n\nThe 2013 collection, curated by Tracey Owen-Davis, will now be presented by the Los Angeles County Museum of Art (LACMA) in partnership with the Los Angeles County Museum of Art (LACMA). “It’s been a long road to getting to this point, but I’m very happy to say that we are closer than ever to finally presenting this incredible collection,” said the Museum’s director, Richard Gere. “It’s an enormously ambitious project, and we’re not there yet. But the road is long and the work is intense, and we are hopeful that we can", "The next Biennial should be held at the Metropolitan Museum of Art in New York, which is currently undergoing a major expansion, in 2022. The architecture of the exhibition will be inspired by a former Twelfth-century monastery on Saint Pauls Square and will be based on a design by artist Pierre-Auguste Merlee (1837–1907), an early proponent of Italian modernism.\n\n\nThe British artist Richard Avedon has won the Prix du Palais de Tokyo in Paris, France, for his newest installation, a monumental new sculpture for the institution, which was completed in December of 2019. His work, The Night of the Victims, (2017), was inspired by the series of events surrounding the Bechdel Affair, a five-hour documentary film made by American filmmaker Lynne Tillman in which an exhibition of photographs taken by the famous British photographer Eleanor Roosevelt featured prominently.Tillman had originally intended to depict the Affair and her husband, the American photographer James Dietz, who was a close friend and confidante of Roosevelt, in their home imagesque garden. The duo would later collaborate on the film, which was released in 1936 and won the Pulitzer Prize for documentary in 1949. Not long after the film premiered,", "The next Biennial should take place in 2022, with the fall of 2020 being the theme of the forty-fourth. The biennial is known for its ambitious and immersive exhibitions, including “The Museums of the Contemporary: from the New York Metropolitan Museum of Art to the Contemporary Art Museum St. Louis.” The event will also begin presenting works by artists whose work is currently on view. The inaugural exhibition will focus on the work of artist and activist Mia Farrow, and will include work by artists such as Zaha Hadid, Jane Panetta, and Barbara Granick.\n\n\nThe Norwegian government has approved the sale of ten works by artist Johan Åkstebø, who has been named the winner of the Nobel Prize in Art this year. The Norwegian pavilion for the Museum of Modern Art (Nørdalskirkademienssetlands) will receive the works by the artist from the collection of the Danish curator and collector Lars-Erik Neumann, who founded the avant-garde art museum Lillehammer in 1977.The works were selected from the seventy-nine artists nominated by an international jury headed by Yuri Rubchinskiy, the director of the Royal Academy of Fine Arts in", "The next Biennial should take place in 2020. \n\n\nThe Museum of Modern Art (MoMA) in New York announced today that it is open to the public again after a three-month temporary closure following the Covid-19 pandemic. The institution is currently closed to the general public as it implements safety precautions to prevent the spread of Covid-19, a coronavirus that is transmitted by direct contact with the virus. The institution is currently preparing for its annual Black Friday blackout, which will take place on November 29 and will run through December 25. The Museum of Art is also preparing for a possible repeat of last year, when the coronavirus killed at least 156 people in the US. Since then, MoMA has been closed since March 13, and has been working with the Department of Health and Human Services on how best to move its collections to safer locations.\n\n\nThe Shenzhen Biennale Foundation, the Shenzhen Film Festival, and the Shenzhen Design and Architecture Biennale Foundation will jointly award $9 million in support of the ongoing art and architecture exhibitions at the Shenzhen Film Festival in Shandong province, China, and the Shenzhen Design and Architecture Biennale in Beijing. The three organizations will", "The next Biennial should be in 2022.  We are also actively searching for an executive director to oversee the program. We believe that this is the right moment to launch such an ambitious undertaking, given that the next biennial will focus on an exploration of new ideas, new perspectives, and on the making of art.We would like to thank our board for taking on this challenge and for their constructive feedback. “The exhibition will reflect the most recent and most experimental approach of the exhibition within the genre, and will be undertaken in a way that will present the greatest challenges as a way of deepening our understanding of the world.”Ronaldo was appointed in July. He succeeds João Doria, who has served as director since 2013. In his first year as director, he curated the biennial “In Praise of Truth.” This exhibition was organized by the museum in collaboration with the collective of artists who are dedicated to the creation of Historical Memory, which collaborated with the museum in order to create the exhibition. The Biennial of Women will receive an additional $10,000.The biennial was organized in partnership with the Swedish curator of Swedish art, Harald Svedberg, and the artist Jöran Holm. The Swedish", "The next Biennial should be held in the fall of 2020. Florian Schmidt, curator of the exhibition, said: “The work of this exhibition, ‘Light Gallery,’ is an attempt to push the boundaries of what is possible in the contemporary art world. The project was born from a need to create a new kind of exhibition, one that combines contemporary art and sustainability in a unique way.”\n\n\nThe Royal College of Art in London and the Royal Academy of Arts (RA), the Royal Academy of Arts in London (RAI), and the Tate, the London and Dusseldorf Art Museum, have joined forces to create a new partnership. The initiative, called the Royal Academy of Arts and the Royal Academy of Arts in London’s partnership, aims to create new opportunities for the exchange of ideas and knowledge between the universities. “This unique partnership will provide new opportunities for both the colleges to connect with the unique world of the arts, and for the wider society to gain valuable insights into the history and development of visual arts and the life art form,” said Simon Walker, RAI’s director.The partnership was initiated by the University and College Union (UCU), who have advocated", "The next Biennial should take place in 2019. The court ruling comes a little over a year after the National Gallery of Art rehired the artist João Varejão, who was fired from his teaching position after a video, which appeared to show a naked woman being carried by a group of men, was published on YouTube. The work, titled Nude in the City, 1964, and showing in the exhibition “Rendering the Third Reich” at the National Museum of Contemporary Art in Washington, DC, was pulled from the event. The National Council on American Art, which has been in contact with the court since March, told the Art Newspaper that it is reviewing the ruling and will determine whether it will appeal. \n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed new board chair James R. Mulvey Jr., who previously served as president of the Museum of Modern Art, and Amy Tracy, who currently serves as the director of the National Museum of Women in the Arts, as interim directors. Mulvey succeeds Susan Anderson, who has been tapped to head the museum until a new leader is appointed. Mulvey’s appointment comes amid a tumultuous time for museums across the", "The next Biennial should take place in the first half of 2021. The São Paulo Biennial will be held in the city of Rio de Janeiro from February 22 to March 28, 2021. The Venice Architecture Biennale will be held from March 19 to March 22, 2021.  “The architecture of our times is one of the most diverse and dynamic fields in art history, and the future of architecture is uncertain,” said São Paulo Mayor Jair Bolsonaro. “As the city of the Biennale and the organiser of the exhibition, I take full responsibility for the outcome. I would like to see more architects participate in the pavilion, and I am convinced that this is the moment for them to be heard.”\n\n\nThe Institute of Contemporary Arts (ICA) in London has appointed Alison Fogg, director of the Centre for Contemporary Art at the University of Cambridge, as its next chair. Fogg will be responsible for shaping the future direction of the Centre, which she has led since 1987. She succeeds Anne-Marie Cole, who will retire at the end of the year.“Alison Fogg’s leadership at the Centre marks a new chapter in its history, as she", "The next Biennial should take place at the Württembergischer Kunsthalle Basel in January 2021. The new name will be a nod to the town of Württemberg and, incidentally, to the town of the same name, which is located in the South-East of Germany, where Biennials, which were first held in 1979, are currently being held.The next show will be held at the Museum of Modern Art in New York in 2021.\n\n\nThe Metropolitan Museum of Art in New York has appointed Bonnie Wolf as its next executive director. Wolf comes to the institution from the Museum of Fine Arts in Boston, where she has been the director of collections since 2015. Previously, Wolf served as deputy director of collections and collections planning and oversaw collections for collections director Mary Anne Carter, who was hired as director of collections this past January. She succeeds Sue Armitage, who retired in March after nearly six years at the helm of the museum.“Bonnie brings deep experience and a passion for the Met’s collection, collections, and exhibitions,” said Arne Glimcher, the museum’s director and CEO. “Her leadership and vision for the Met’s collection and exhibitions have", "The next Biennial should focus on long-term planning, community engagement, and the interdependence of arts and communities throughout San Antonio.”\n\n\nThe Illinois-based nonprofit ArtPlace Chicago has received a $10 million donation from the estate of the late artist Grace Hopper, who passed away in August 2019. The gift, which is the largest gift made by her estate yet, will allow the nonprofit to overhaul and expand its exhibition space and add new programming to the institution, which is currently closed until at least March 21.“Grace was one of the most important artists of our time, and her work has inspired and informed our lives and our missions for more than thirty years,” said Emily Slotover, an artist-in-residence at ArtPlace Chicago. “Since she began her exhibition program, the gallery has been inspired by Grace’s ability to think outside the box, her ability to recontextualize her own work, and her ability to make the largest possible impact on other artists.”During her lifetime, Hopper was one of the six artists whose works are currently housed in the museum. In celebration of her legacy, ArtPlace Chicago will upgrade its collection and resculpture, adding two", "The next Biennial should be a celebration of the more than forty years of the artist’s work in the Gallery. Among the works included in this year’s show are the work (1983) in which the artist created the first statue of the Darwin’s finches, the first work by the artist to be placed in the collection, and a work on paper made in the studio on the morning of December 14, 1986.\n\n\nThe B. F. Lee Gallery in New York has unveiled a new exhibition featuring work by six artists from its collection: John Hauser, B. K. Lee, John Scott, David Halber, and Mary Catherine Marshall. The thirty-five-minute show, \"The Fiery Furnace: John Hauser, B. K. Lee, David Halber, and Mary Catherine Marshall, 1900–1985, opens on November 15 at the Lee Gallery and is curated by Julián Aguilar and includes works by artists such as David Henry, Manuel Jamieson, Peter Cook, William Coplon, and Dennis Hujar, among others.The exhibition coincides with the publication of the biennial’s catalogue entry, “John Hauser: Artist and Legacy,” and", "The next Biennial should take place in 2022 and the event will run from January 20 to March 23, 2022. The exhibition will feature the work of seventy-seven artists who have never appeared in an international exhibition, and will be a continuation of Biennial 2020, which took place on January 9 to March 12, 2020.\n\n\nThe Los Angeles County Museum of Art (LACMA) has appointed Tyler Enos, who serves as the director of the museum, as its next executive director. Enos previously held the position of chief curator at the CERN in Geneva and served as director of CERN’s Institute for Nuclear Research (INR) from 2016 to 2017. He succeeds Mark Scoville, who retired in March after twenty-five years at the helm of LACMA following a twenty-three-year tenure.“Tyler Enos’s appointment must be seen in light of the LACMA’s continued success under his leadership, which was exemplified by his successful campaigns for reopening the museum in 2018 and reopening in 2020, and the results that are now being realized,” said Mark L. Schiff, president and director of the LACMA board of trustees. “The board extends a warm", "The next Biennial should be held in 2020.\n\n\nThe Metropolitan Museum of Art in New York has announced that it plans to welcome the public back to the museum in 2021. The institution is also planning to reopening the building that houses the museum in 2018, but only for a limited time.The reopening of the MOMC would coincide with the opening of a new exhibition, “Bicycle as a Tool—Art and Technology” at the museum, titled “Cyber-Life: Its Emergence and Design” (March 29–May 1, 2021), in the fall of 2020. The show will be curated by Kohn Pedersen and will be organized around the themes of cyberlife and technology. The show is part of the Met’s reopening plans.In an attempt to anticipate how the show might unfold, the Met provided the author with a rough sketch of the exhibition. The exhibition will be constructed with three interconnected spaces, each of which will be dedicated to a different theme, designed by Kohn Pedersen. The first space will be an exhibition space, the second a library, and the third a practice space. The show will be organized in a manner similar to the MOMC’s “Cy", "The next Biennial should take place in 2021, with a date to be announced. \n\n\nThe Rock-Paper-Scissors (RPS) art award jury has awarded $500 to Molly Tan and the New York–based artist Naama Arad for their paintings Taft and Noguchi’s and Desert: The Drawing Room. Located on the Lower East Side, the works were created within a three-dimensional, abstractly rendered environment created using a combination of fossil fuels and neon lights.The works were selected for their depictions of nuclear power and atomic bombs and for their innovative use of light and shade. After examining the work, Arad said: “It’s almost like the artist’s mind is literally in the canvas. It’s like they’ve made a painting on the canvas. This is a painting without any paint, without any markers, without any hint of a title.”Both artists were presented with a $100,000 cash prize for their works at the second annual Rock-Paper-Scissors Art Prize, which will be given to an artist who has exhibited their work in the United States or Canada in the last twelve months.“We are", "The next Biennial should be staged in the United States in the fall of 2022. The first iteration, which was curated by artist-in-residence Mary Cornwall, was held at the Smithsonian American Art Museum in Washington, DC, in early 2018. It was succeeded by a second iteration, which was staged at the Museum of Modern Art in New York in September of 2019.The $3 billion Adventure-Bazaar and Biennial will both be closed to the public following their summer series. As part of the reopening plans, the institutions have temporarily suspended programming and will postpone their 2020 biennial dates by an average of twenty-two days.Following the Fall 2019 episode, the exhibitors were asked to re-evaluate their exhibition schedules. In addition, the pavilion and lobby of the Adventure-Bazaar in New York will undergo a major renovation, featuring a new exhibition, \"The Embedded Museum,” as well as a media center, a bookstore, and a bar. The pavilion will also be expanded by nine hundred square feet and the museum will also host the 2019 edition of the London Triennial. The Adventure-Bazaar and Biennial will run concurrently in the fall of 2020, the first event of the year, and the second of the", "The next Biennial should take place in the following cities in 2019: Beijing, Shanghai, and Hong Kong. The exhibition will be hosted by the Kunsthalle Basel, the Württembergischer Kunstverein Berlin, and the Kunstverein Stuttgart.\n\n\nThe Museum of Fine Arts (MFA) in Chicago is preparing to welcome visitors back to the institution for a second season of the award-winning biennial, “Art in Motion,” which will be supported by a $10 million donation from the estate of the late designer Jean Paul Gaultier. The fund is the largest gift MFA has ever made. The program will also introduce new programs and curatorial projects, including “Legacies of Jean Paul Gaultier,” which will hold a retrospective of the artist’s work and will commence in October.“The work of Jean Paul Gaultier is central to the Museum’s history and the MFA’s legacy is inseparable from his legacy,” said director Lynne Oxman. “This season will be an opportunity to reexamine his legacy in a way that he never dreamed, in a way that he never could have", "The next Biennial should take place in the spring of 2020. Deloitte, the city’s architectural and design office, has been working towards selecting a theme for the exhibition, which will be based on a selection of works by sixty artists, and has released the first design preview of the 2020 edition of the biennial. With the support of the London-based company the estate of Henry James, the biennial will explore themes of the past and the present, including the legacy of the artist John Szoke, and will be curated by a panel of curators and scholars. \n\n\nThe Museum of Modern Art (MoMA) in New York has appointed artist-in-residence Mary-Kate and Adam Linden as curators of its upcoming exhibition “Uptown,” which will go on view March 24–March 26. The show, which celebrates the Greenwich Village neighborhood’s early years, will feature work by thirty-one artists, including Amanda Almodovar, Noé Mitchell, Julian Schnabel, and Nari Ward.The exhibition’s ten-acre campus in Uptown will be transformed by artist-designed public artworks by thirty-four artists, including Eric Fischl,", "The next Biennial should be staged in the autumn of 2020.\n\n\nThe Schirn Kunsthalle Düsseldorf (SKD) in Germany’s capital, Düsseldorf, has become the latest arts institution to announce that it will temporarily suspend programming and events in an attempt to mitigate the coronavirus. The news comes a day after the Ministry of Culture and Sport announced that it expects to lose an additional nine million cases globally this year. The ministry also expects to lose another six million cases in Germany by 2020.While it is encouraging that many museums have begun welcoming visitors again, the health crisis is not over. The crisis is worsening, with the World Health Organization declaring the epidemic a “public health emergency.” The number of deaths in the United States has surpassed that of the SARS and is likely to rise further. On Thursday, President Donald Trump signed a $8.2 billion emergency spending bill to prevent the coronavirus from spreading to the US. While he has also called for a temporary suspension of US entry to Spain, France, and Italy—all countries with an estimated 130,000 confirmed cases—the law only applies to foreign visitors.According to the American-Statesman, ", "The next Biennial should take place in 2021. A spokesperson for the biennial said: “We are honored to be supporting the work of the team who have created the new exhibition as well as the art of the previous five editions. The new exhibition will celebrate the history of the exhibition and the work of the previous four Biennials.”\n\n\nThe Ritzy Art Museum in New York has received a gift of seventy-nine works by twenty-three artists from the Metropolitan Museum of Art in New York City. The works were donated by artist-activists Katja and Rudolf Pagoda, who are known for their commitment to social justice. Together they are the only couple to receive the works, which include work by the late Nari Ward, the early artist-in-residence Paul Gauguin, and the late painter and sculptor Maha Basti.The gift includes works by artists such as David Crockett (1902), who was inspired to create a new work after seeing a group of young artists at a Ritzy Art Museum exhibition in New York on the eve of his death, and Ezra Johnson (1903), who is best known for his sculptures and paintings featuring figures and objects made of colored rubbery", "The next Biennial should focus on the history of the museum’s collection. Though it is currently reopening, the museum won’t be able to move forward with the exhibition until at least mid-June. The museum has also been working on a $75 million renovation and expansion project, which will include the construction of a new two-story building and the addition of an outdoor courtyard and a restored pavilion. Though the project is on schedule, the original July 31 opening date for the twenty-fifth edition of the exhibition will not be rescheduled.This year’s exhibition, “Beyond the Frame: Moving Images,” will be staged at the National Museum of Art in Washington, DC, in association with the Smithsonian Institution. The inaugurating the new institution will take place in the new and renovated Alexander Graham Art Museum at the University of Washington. Not surprisingly, the opening of the new museum will coincide with the opening of the National Gallery of Art in New York, which has recently seen its first event devoted entirely to photography, a tribute to photographer Clay Bennett, and a presentation of twenty photographs by photographer James B. Johnson.The National Gallery of Art’s digital platform will be expanded to include two viewing", "The next Biennial should be held sometime in 2021.  For the first edition of the Symposium, titled “The Future Is Present,” curated by João Goulão and Diana Alves, the inaugural exhibition will showcase the work of twenty-seven artists. The upcoming iteration of the show will be hosted by the museum in collaboration with the city of São Paulo. The 2020 edition will be organized as a partnership between the Museum and the city. “The project of the symposium is not to promote one artist’s work but to present new ways of thinking about art,” Christine de Ooi, the mayor of São Paulo, said. “Art is a tool for life and we trust that ArtsCenter will always be a partner of the city of São Paulo and the Brazilian community. We wish to thank João and Diana for their understanding and cooperation, and we wish them and their projects success.”The new partnership will fund the next edition of the symposium, titled “Connections,” which will be held at the Nacional Centro de Artes Plásticas, in partnership with the municipal government of São Paulo, the state government of", "The next Biennial should be held in 2021, and the date for the event should be announced soon. \n\n\nThe City of Atlanta’s budget for the 2021–22 fiscal year has been slashed by $24 million, to $32 million, according to the Atlanta Journal-Constitution. The $3.7 billion budget for the biennial—a rebranded version of the Museum of Art—was originally set to fund the entire nonprofit organization, but was expanded after the city council voted to take the $25 million that the museum already received and use it to help defray the expenses of the city’s medical marijuana program.According to the AJC, the budget cuts were made on March 24, when the city council approved a $10 million increase to the city’s general fund, and were enacted with a $3.7 billion budget for the biennial, which was approved by voters in a November 2016 referendum. Mayor Kasim Reed announced the budget increase on April 8, and the city council formally adopted the budget on June 10.The 2019 fiscal year saw the first phase of the museum of Art’s construction, which involved the renovation and expansion of the city’s former Metropolitan Atlanta Museum", "The next Biennial should be established to commemorate the centenary of the birth of the revolutionary painter-activist\n\nThe eight-day event will be staged at the new museum in the capital, Paris, from March 13 to March 16. The exhibition is part of the ongoing renovation of the Biennial of the African Diaspora (BAD), which opened in January 2019 and runs until March 22. The renovation project was inaugurated by the appointment of French artist Etienne Balibar as the director of the new museum, which will be inaugurated in March.The exhibition will also include a retrospective of the work of the late Cuban artist Felipe Cruz, whose work is housed in the museum’s collection, and a presentation of the work of the Iberian contemporary Maya Linthicum.\n\n\nThe United States House of Representatives voted yesterday to establish a national museum of the American Latino dedicated to the history and culture of America’s Latinx communities, a group that comprises people of various races and cultures. Introduced last year by New York representative José E. Serrano, the bill for the museum, which will sit in a former textile factory on the city’s East Side, was unanimously approved on Monday and now goes", "The next Biennial should take place in the New York Studio in 2021, and the exhibition should be a “new work on the theme of culture and the artist’s place in it. A new creative project by the artist, with director and curator Hamza Walker, should also be ceremonially staged.” The 2019 event, “Life After the Body,” opened on September 2, with the exhibition slated to run until November. \n\n\nSOUTHAMPTON, England—An exhibition of “all things black,” curated by and featuring works by fifteen artists from South Asia, including S. Abdul Kalam and S. M. Pindi, is scheduled to open at the Shrewsbury Art Gallery in England on December 31. The exhibition, titled “All Things Black,” has been organized by the South Asian Design and Art Forum (SADFA), a London organization that aims to promote and engage with the South Asian art community. In a statement about the show, SADFA president Jyoti Dulal said: “This is a moment of transformation for the world. We are in the process of healing from the trauma of 9/11. We", "The next Biennial should be held at least once every other year. The 2020 edition will be held at the Kunsthalle Basel in Basel, Switzerland, from March 11–March 13. Conceptual artist/activist Bernard Malsbach will be involved in the design of the exhibition, which will feature the works of all of the artists participating in the first-ever exhibition of their long-planned series, the 'The Art of Change.” “The Art of Change” is the brand name given to the first exhibition of Malsbach’s work, “The Death of Symbols” (2005–2006), at the Kunsthalle Basel. The exhibition was completely reworked and expanded for the second edition, which was held at the Saatchi Gallery in Milan, Italy, in 2007–2008.The event will be held in the city of Basel from March 2 to March 5, 2020, with a special exhibition opening at the same time as the biennial.\n\n\nArtist and entrepreneur Tiona Bertram has been named the new artistic director of the Leeds-based Museum of Contemporary Art (Leeds), where she will oversee the development of a new collection of contemporary art", "The next Biennial should focus on the development of new research and scholarly approaches to the history of art and the future of the exhibition, which has been held every three years since its inception in 1995. The institution will also continue to host exhibitions of work by artists from the past, and will continue to provide programming to support and organize cultural exchange between Japan and the United States. The biennial is currently celebrating its thirtieth anniversary.\n\n\nThe Sheffield Art Gallery (SAG) has appointed Jocelyn Bill, who has taught at the museum since 2006, as its new chair of modern and contemporary art. Bill comes to the institution from the University of the Arts London where she is the curator of the exhibition “International: 20th Century” (2019), and is a coauthor of the forthcoming book “The Art of Motion.” Bill will be responsible for leading the museum through a four-year renovation project, which will include the addition of a new gallery, a new research center, and expanded public spaces.“With its history of working across disciplines and with a diverse and eclectic group of core artists, the Sheffield Art Gallery has always been a cultural melting pot,” said David Peacock, chair of the museum", "The next Biennial should take place in the month of May 2020 and will be organized by the University of Southampton and will be supported by the Ministry of Culture. The biennial will be hosted by the Musée Dangl and will be curated by the artist Raquel James. The exhibition will take place at the Musée Dangl throughout May and will run simultaneously with the rest of the UK’s May Tour. The 2020 edition will be held at the Musée Dangl. The 2019 event was organized by the Institute of Contemporary Arts in London and drew around 250 artists and activists. \n\n\nThe New York Film Festival announced today that it has suspended its March show, an event that is considered one of the year’s most important celebrations. The event, which is held every March, attracted a record-breaking 135,000 attendees and featured performances by a number of top-tier directors, including Olivier Assayas, Maren Adejaz, Mark Bomback, and Michael H. Weber. The show’s February 22 edition drew just over 60,000.While the festival was plagued by two power outages that forced the cancellation of ten films (including the fifth, The Sicilian), the", "The next Biennial should be held in 2021. The schedule has yet to be released. “It is essential that our teams and institutions take this opportunity to upgrade our digital and physical infrastructure and prepare for a future without our digital footprints,” said Michela Trapero, secretary general of the International Association of Museums.\n\n\nWith the opening of the Paris Art Week in February, organizers announced that they are postponing the 2020 edition to the summer, and are now working toward securing venues across France for the event. The move has been made to protect the venues that remain slated for demolition and to accommodate the ongoing mobilization by thousands of Parisian workers in support of the city’s redevelopment plans. The next iteration of the fair will take place in June. The 2020 edition was originally slated to run from September 11 to September 17. “Paris is facing a difficult future as it attempts to keep the city’s art museums operating, and the Art of the Future remains a vital tool in this process,” said Paris’s mayor Anne Hidalgo, who cited the anticipated loss of revenue from upcoming fairs as the reason for the postponement. The date of the 2020 edition has yet to be announced.", "The next Biennial should focus on the history of Roma, an ancient city in northwestern Italy, and the Italian town of Garigliano, which was built on land formerly occupied by some thirty thousand people in 1881; will also prepare for the exhibition of a new Italian film, The Sire and the City, in the summer of 2021.\n\n\nThe Museum of Modern Art (MoMA) in New York is planning to move its existing exhibition space in the Bowery, Brooklyn, and has hired a landscape and urban designer to create a new exhibition space for the institution in the city. The conceptual design for the exhibition space, titled the Bowery Platform, was unveiled by Graydon Carter on September 14. The twenty-four-hour installation will feature work by fifty-eight artists, including Robert Irwin, Adrienne Edwards, Robert Irwin, John Oehlen, Yinka Shonibare, and Peter Sellars, as well as three virtual reality experiences.The installation, titled In Real Life, is a reimagining of the Bowery, including a new fourteen,000-square-foot venue for programming. The Bowery Platform will be an extension of MoMA’s current installation space, which occupies the same", "The next Biennial should reveal its selection of works by artists working today. The exhibition will also employ new strategies and more effective distribution to increase awareness of the exhibition’s history. The exhibition will be hosted at the Museum of Contemporary Art, Los Angeles (MCA), from March 26 to March 26. \n\n\nThe British artist Richard Avedon, a prolific artist whose vast body of work spans sculpture and painting, has died at the age of eighty-three. Born Richard Avedon in south London in 1930, the son of a Jewish working-class Jewish family, Avedon is widely considered a leading member of the British post-war wave, whose work is considered the legacy of the late artist Norman Rockwell. The range of his stylistic choices and his relationship to American painting, sculpture, and photography has often been ignored. As a leading exponent of seventeenth-century abstract painting, he is credited with revolutionizing the medium through his experimentation with black paint and a radical approach to composition. In his recently discovered memoirs, Avedon writes that his art-making was a “quirk of nature,” and that “only a man of the same birth and mind could be a great artist, and there", "The next Biennial should be in 2020.\n\n\nThe Museum of Fine Arts (MFA) in Boston has received a gift of fifty-six works from the Dominican Republic in an ongoing collaboration between the institution and the DR Congo. The donation, which also includes twenty-one works from the Dominican Republic in the form of an exhibition organized in collaboration with the United States, the United Kingdom, and the DR Congo, as well as twenty-four works from the United States in the form of an exhibition organized by the United States, the United Kingdom, and the United Arab Emirates, is the third such exchange of works by the two countries since 2016.“The gift of the works and the exhibition marks an important step toward the creation of a lasting legacy of the MFA,” said Mary Ellen Kornbluth, director of the MFA. “We are grateful to the Dominican Republic, in collaboration with the United States, for enabling this exchange. It is an important step toward the museum’s ongoing work to present works in the Dominican Republic.”The gift also includes twenty-six works by the eight artists on the exhibition’s shortlist, representing forty-six countries between the two countries. The works, which were selected", "The next Biennial should have a design by Nada Pindell, which will open at the museum in 2022.“Pindell’s works are inspired by her childhood in East London, her travels throughout the world, and her experiences working in the commercial world,” said museum director Monica Savoy. “The future of the Biennial is bright and we will be able to see it in better light than ever before.”Originally, the venue was going to host the closing ceremony of the biennial, “The End of an Era,” in 2019. A compromise was reached, and the event will be held next year. The move has been hailed as a victory for artists, activists, and patrons of the Biennial who were campaigning for the venue to remain open, and for Savoy, who has called the move a “historic day.” The museum’s board of trustees declared the move a “victory for London,” and the UK’s culture secretary, Oliver Dowden, said: “This is a historic occasion, a great opportunity and an opportunity to create new work and to re-shape the future of the Biennial. It is a", "The next Biennial should be held in June 2020. The exhibition will mark the tenth anniversary of the Cannes Biennial, which will also mark the thirteenth anniversary of the first exhibition of work by Mikhail Bulgakov at the museum. The biennial is currently accepting proposals for the 2020 edition. “I am delighted to be representing Bell & Ross at the annual exhibition of Bulgakov’s art in February, 2020, and to continue the new partnership with the museum,” said Mukhtar Kanaan, CEO of Bell & Ross. “As we work in partnership with the city of Milan, the United States, and Italy to establish a new route for art in Milan, it is especially important to develop and maintain a strong and contemporary collection. Bell & Ross has been working hard to present an exhibition of Bulgakov’s art at Milan since 2012, and we are pleased to have opened the new Bell & Ross Contemporary Collection in Milan in 2017, when it was still a new museum. This exhibition is the culmination of our long-standing commitment to the city, the artists and designers, the Italian state and the city of Milan.”\n\n\nThe Institute of Contemporary Arts (ICA", "The next Biennial should examine the history of ancient art in Egypt, Tunisia, Morocco, and Turkey and assess the current state of conservation, conservation, and restoration in these countries. The 2020 edition will focus on the history and conservation of art in California and will also include a selection of works from the forthcoming exhibition “Contemporary Art in California” at the San Francisco Museum of Modern Art.\n\n\nThe Brooklyn Museum has appointed Jodi Throckmorton as its next executive director. Throckmorton will succeed her predecessor, Sarah Montross, who has led the institution for nearly eighteen months. Throckmorton comes to the museum from the Brooklyn Museum of Art, where she has served as associate director of collections since 2015. The appointment marks the first time an African American man has served as director of a major American institution.“Jodi’s approach to the role and vision of the Brooklyn Museum has been to critically think through the museum’s long-term future with the museum as a living entity, and to push forward innovative, forward-thinking, and forward-thinking curatorial and display programs,” said Brooklyn Museum director David Feldman. “I’m excited to welcome her to the Brooklyn Museum.”", "The next Biennial should take place in the United States, and in 2022, the organizers say. The theme—“The Evolution of the Human Experience—is an extension of the themes of the previous four years. The theme has been informed by the evolution of the human experience within the context of a contemporary cultural landscape such as the United States, Europe and South Asia.”In an interview with the Art Newspaper, Thomas said: “As a curator, I try to create places where there is really a real connection between art and people. If there is a way of life that is not mediated through images and abstractions, then that's where art can find an emotional resonance or a spiritual dimension.”\n\n\nThe Museum of the City of New York (MOCNY) has appointed Emily Voorhees as its interim director. Voorhees has been on the job for less than a month and will begin her new role on January 18. Under her leadership, the institution has experienced a turnover in leadership, with Evan Silverman departing in May following a fourteen-month tenure and Gerardo de la Torre taking the reins in July.Voorhees will be responsible for overseeing the museum’s renovation and evolution, which", "The next Biennial should take place in 2021. Commenting on the upcoming event, the artist said: “We have reached a critical moment in our history, when we have the opportunity to shape the future through the creative activities of many communities across the globe. I am eager to see what this year will bring.”\n\n\nThe Metropolitan Museum of Art in New York has appointed Hailey Ruggiero as its next director. Ruggiero comes to the museum from New York’s Solomon R. Guggenheim Museum, where she has served as deputy director and chief curator since 2019. She succeeds Amanda Klassenbach, who was promoted to director of curatorial affairs in May, and will assume her responsibilities on November 1.“We’re excited to welcome to the Met, an accomplished curator and an accomplished leader who has been instrumental in elevating our museum’s reputation and inspiring new thinking about the Met,” said museum director Daniel H. Weiss. “A very talented curator who has a long-standing history of producing engaging exhibitions, conversations, and projects, and whose work has been immeasurable in shaping the Met’s history, Hailey brings an exciting perspective and a", "The next Biennial should take place in September 2021.\n\n\nThe National Museum of Civilizations in Beijing has announced that it is planning to open a new exhibition dedicated to the history of Chinese architecture. Titled The Structure, the new exhibition will feature works by seventy-eight individuals and will be on view in twenty-two months. The exhibition is part of the National Museum of China’s ongoing efforts to broaden its international recognition through the exhibition of more than two hundred works in 2017. The exhibition, which will be organized as a multi-genre performance, will include work by thirty-three artists from twenty-seven countries.“This show gives the Chinese people the opportunity to see internationally recognized architecture by international and local artists, and it fulfills a major function in establishing the museum’s international reputation,” said David Sze. “The Structure,” which will be on view until December 2, 2021, represents the museum’s first exhibition devoted to architecture in China. It is also the first show organized by the National Museum of Chinese Architecture.The show is organized around the history of Chinese architecture and the institution’s relationship with its neighbors, including the People’s Republic of China", "The next Biennial should be in 2021, the year of the thirty-third edition of the Venice Biennale, which opened in February. The twenty-fifth edition, which was held in 2019, will also be held in 2021.\n\n\nThe British Council has released guidelines for the future use of Royal Parks, including an aim to encourage the regeneration of major sites such as the Palace of Westminster and the National Museum.The document, released on Thursday, outlines the importance of the royal parks as sites of major cultural performances and states that the current arrangements cannot be sustained unless “irreparable change” is made. “The Royal Parks are an extraordinary heritage site which have sustained the UK and its people for two thousand years,” said David Blunkett, the chairman of the British Council and chairman of the National Museum. “The Royal Parks are an essential part of the UK’s story, and we must act to protect their future. I welcome the Royal Commission’s report and work with colleagues from both the Department for Culture, Media and Sport and the Department for Transport to develop a strategy to help them thrive.”New plans for the royal parks have been proposed by Secretary of State for Culture, Boris Johnson. The", "The next Biennial should commence with a public ceremony in the capital city of the Republic of Korea, Seoul, on December 21. The exhibition will then return to the United States and will be on view in the Seoul Biennale in March 2020. It will then return to Japan for a second exhibition, entitled “Luminous Light: The Art of Riko Nara” (Spring 2020), which will be held in Tokyo from March 21 to March 29. The Hong Kong–based artist will create a new kind of exhibition space made up of eight spaces arranged in a circular fashion within the Royal Academy of Arts in London, which will offer a new series of public programs that will be curated by the artist. The exhibition will also include a new digital platform that will allow visitors to experience work by the artist in a virtual environment.The artist was chosen by curator and scholar Gertrude Meer of the University of Pennsylvania, which is affiliated with the university, for the artist’s most recent exhibition at the academy, which opened in 2010. The show, “Ascendant/s” (2016–17), is part of a six-part series, which had previously been broadcast as part of the university’s", "The next Biennial should be held in 2021, the year of the second creation of the modern Italian Republic. The sixty-third annual edition of the exhibition will run from March 12 to March 14, 2021. A special exhibition of the work of the artists who were awarded the Silver Lion at the Venice Biennale will be held in the spring of 2021.  Italian cultural figures have been making the case for the future of the country’s Milanese institutions in recent months, as the city prepares to host the 2020 edition of the Venice Biennale.\n\n\n\n\n\nThe Pennsylvania Academy of Fine Arts (PAFA) in Philadelphia is planning to shutter its doors permanently in April. The Philadelphia Inquirer reports that the museum, which is located in Philadelphia’s historic city center, will also begin phasing out its collection of Italian Renaissance paintings and sculptures. In a statement, the museum said that the decisions were made after consultation with the Philadelphia community and that it is actively working to determine the future of the collection and the institution.“It is with great regret and disappointment that we announce that PAFA’s iconic, award-winning, and beloved location will not host any more works in 2022,” said Peter Sh", "The next Biennial should be held in late spring or early summer of 2021.  Until then, I hope that all of you will continue to support the museum as you have done for so many years and consider the exhibition a warm welcome.  I am expecting you.\n\n\nThe National Gallery of Art in Washington, DC, has appointed Mark B. Burghardt as its next director. In a statement released by the institution, Burghardt said: “I’m thrilled to join the National Gallery of Art in Washington, DC, as it continues to expand and thrive as a leading cultural institution in the capital of the United States. I’m committed to fostering a more diverse and inclusive environment at the gallery, and am eager to help shape the future direction of the museum.”Burghardt is currently the director of the Zug Film Festival in Switzerland and the inaugural director of the National Gallery of Art’s National Gallery of Art, which is housed on the National Mall. Previously, he served as the director of the Harvard Art Museums in Washington, DC, and as the first director of the David H. Koch Gallery at the Massachusetts Institute of Technology.Commenting on his new role", "The next Biennial should take place in the fourth quarter of 2019.  The concept has been around since 1999, when filmmaker and curator Ingrid, who is known for her work in video games, created an exhibition at the Pond in Copenhagen. The exhibition, which featured work by forty-two international artists, including Alighiero Cattelan, Marko Kloppers, Hjalti Narjøll, and Peter Rasmus, was canceled after the exhibition was announced.In 2013, the exhibition was nominated for a Golden Lion at the Venice Biennale. The award went to the British artist John Akomfrah for his nine-minute film The Last of His Tribe, which dramatizes the life of a group of nomadic nomadic herders in the Himalayas. The award went to the director of the exhibition, Kim Basinger, for his work The Inevitable, which was inspired by an epiphany he had in 2011, two years prior to the exhibition.In the exhibition, the Danish artist Mats Stærk, whose work is based on a concept known as the \"dreiðafníst\" (dreiðanning), creates paintings and sculptures that address themes", "The next Biennial should focus on contemporary art and represent the current state of things in the arts.” The theme of the event will be “Art and the Body,” and this year’s will include works by artists such as Jean-Michel Basquiat, Pierre-Auguste Renoir, and Jean-Michel Basquiat’s daughter, Rosalind.\n\n\nThe National Museum of Scotland has issued a public apology over an exhibition of sculpture from the institution’s collection that was set to open in the Russian city of Tomsk on February 14, 2020, in the interests of preserving the institution’s ancient fortress at Dubna. The exhibition, “The House of Heaven: The Russian Man and the Castle of the Women,” was meant to commemorate the centenary of the Russian branch of the European Union, the European Commission, which was established in 1946 by the Russian government in an attempt to modernize the USSR.The exhibition was to feature works by seventy artists whose works were to be presented within a few years. The works by artists whose works were included in the show were Abraham Stevens, Beatriz Savitski, Oskar Bing, and", "The next Biennial should be held in 2022 and will be organized in a similar way to that of the current edition. The next edition will be held in the former spaces of the Museum of Modern Art (MoMA) and the Rubell–Tuttle Building (R&T), from March 25 to March 26, 2022.\n\n\nThe Joan Mitchell Foundation announced today that Christo, Joan and David Lloyd Wright, the co-owners of the Wright Aircraft Company, have donated $200 million to support the foundation. The funds will support programs that support women and racial and cultural minorities in the arts and humanities. The gift was made in recognition of the foundation’s annual gala, which is directed by the David Lloyd Wright Foundation, at which half of the foundation’s annual grant amount will go toward grants for scholarship and the other half will be used to advance the foundation’s work.“We are privileged to present this year’s gala to Joan Mitchell’s voice, her extraordinary work, and her enduring creativity,” said Fiona Fattal, president of the foundation. “And we are privileged to present this year’s grant to the foundation in recognition of the foundation", "The next Biennial should be held at a location that has a permanent exhibition of the works of the artist. The Biennial will be hosted by the institution of the artist and will take place between February 17 and March 28. The theme for this year’s exhibition will be “The Age of Necessity.” The twenty-fifth edition of the biennial will be staged at the Museo de Arte Contemporáneo in Barcelona, northern Spain, between March 23 and March 29. The twenty-sixth edition of the biennial will be held at the Museo del Barrio in Madrid, between March 20 and March 23. The twenty-ninth Biennial will take place at the Museo de Arte Contemporáneo in Lisbon, between March 22 and March 26. The twenty-eighth Biennial will be staged at the Museo del Barrio in Lisbon, between March 20 and March 26. The twenty-ninth and twenty-ninth Venice Biennales will be staged at the Museo de Arte Contemporáneo in Venice, between March 19 and March 22. The twenty-ninth and twenty-ninth Venice Architecture", "The next Biennial should be in 2021, the same year the first exhibition will be held in the city, the exhibition’s organisers wrote in a letter to the city council.This is not the first time the museum has faced controversy over its redevelopment plans. In 2010, a group of artists and writers, including Eric Fischl, Louise Crousel, and Michael Mukendi, launched a petition to the city government to stop the university’s relocating to a new campus in the city. Following the lead of the London-based cultural advocacy group Chatham House, the government withdrew its backing for the university in January 2015.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has released the list of sixty-eight artists who will receive a special exhibition curated by the institution in 2020. The seventy-six-minute, three-channel video installation, titled Artist’s Colony, is part of the institution’s ongoing effort to engage with the American imagination through programming that celebrates the work of emerging and established artists. “As artists who have dedicated their careers to this medium, we are honored to be able to share the transformative power of video with our audiences,” said Michael Lissoni,"]