["The next Biennial should be held in the spring of 2020.\n\n\nThe Institute of Contemporary Art (ICA) in Paris announced today that it is working with the city of Louvain to create a new arts complex that will accommodate an additional fifty thousand visitors over the course of the next two years. The new Louvain–based exhibition space will be located in a former textile factory and will feature new works by twenty-four artists, including A.M. McKinn, Mary Ellen Bernstein, James Turrell, and Naima J. Keith, and will be inaugurated by a solo exhibition of work by the Belgian director Pedro Almodóvar.“I have been a fan of his work for some time,” said Paris’s artistic director, Gilles de Kerchove. “The new Louvain–based exhibition space is a particularly exciting project for him as he has been working here for twenty years. It’s a challenge that he has tackled with great patience and with his own money.”\n\n\nArtist-run spaces in New York City are experiencing a surge in new regulations that will affect the livelihoods of many small arts-based organizations. As part of a new set of state guidelines on", "The next Biennial should be held in the spring of 2022.\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has been working toward revamping its Art of the Party pavilion for the next edition. The institution’s creative director, Lorenza Bozzuto, said: “The changes we are making will give MoCA the opportunity to further elevate the party theme and to build on its reputation as one of the world’s leading contemporary art museums.”Bozzuto added that the upcoming exhibition “will be a reflection on the themes and concepts of the previous two and a half decades, and will explore the ways that contemporary art has impacted and changed the lives of artists around the world.”The theme of the forthcoming exhibition is “Polarity” as the new exhibition “To the Future” will explore the notion of “Time as Manifestation,” the contemporary artist and filmmaker Cervélo Corneille’s work being presented in conjunction with the exhibition. The artist and filmmaker “went against convention” in directing his own work, Viva Palestrina, 2013, in collaboration with superstar artist Joël and Bruno Fernandes in Manchester,", "The next Biennial should be held in 2021. · \n\nAs the United Kingdom faces a potential £30 billion ($42 billion) financial crisis due to the coronavirus—the UK experienced a £6.7 billion ($11 billion) spike in COVID-19 cases in the first three weeks following the pandemic began—the government is proposing to shift $6.7 billion from aid to privatize and privatize-like programs. One proposal would see the UK divert $3.4 billion ($5.6 billion) from its health-recovery fund, the Health and Social Care Council (HSC), into a new trust that would invest in the health and well-being of the public. The health-recovery fund—which was introduced in 2019—was set up to compensate the UK for the economic loss due to the coronavirus and has been fully utilized to date. The HSC spent $3.7 billion on health-related spending in 2018, and most of that was allocated to assisting small and mid-size UK businesses that were unable to pay workers' wages or other benefits. The government is also proposing to shift another $2.2 billion ($3.5 billion", "The next Biennial should also be more diverse in its production team, staff, and audience. The organizers say that they want to create a platform for artists to have a voice in shaping the future of the exhibition.\n\n\nThe National Gallery of Art in Washington, DC, is planning to close its doors indefinitely in an effort to reduce the greenhouse gas emissions that cause climate change. The museum’s former longtime director, Nancy Levey, will remain involved with the institution as a consultant and will continue to serve as a board member, but will no longer be involved in day-to-day operations.The museum’s current climate-change negotiations are stalled because the United States Congress failed to pass a climate bill in December. The current climate-change-mitigating structure at the institution is designed to last through at least 2021, which is when the institution will be shuttered for good.“This year’s National Climate Assessment, which assessed the risk of climate change to the US, was conducted by the Intergovernmental Panel on Climate Change (IPCC),” Levey said in a statement. “The risks we face are serious, and it is impossible to overstate the impacts of climate change. Climate refugees are already flooding into US", "The next Biennial should focus on a series of public works on West 15th Street in the city, which is currently undergoing a $50 million revamp, in collaboration with the community.  Marcus also discussed how the museum’s new partnership with the New York City Department of Cultural Affairs (NYC CCA) is helping to shape the museum’s future plans, and how the institution’s relationship with the local community has been a key to its continued success. In addition, a group of community leaders has formed to advocate for changes to the city’s cultural legacy law, which is currently being reviewed by the City Council.Marcus said that many of the cultural institutions that have benefitted from the Biennial to date have not been able to move forward and are still awaiting city approval of their plans to reopen. He said that the city’s cultural institutions must be recognized and protected. “We must not forget these institutions that have been here for so long,” he said. “They deserve a second chance, and we will ensure their future with the proper government review.”\n\n\nThe National Geographic Society’s new book of art will include more than 1,500 photographs by artist Amy Sherwood-", "The next Biennial should be held in 2021.\n\n\nThe Sackler family—the Sacklers are the largest textile contributors in the US and are one of the largest owners of General Mills, the world-leading manufacturer of packaged foods, and food processors. The Sacklers have donated more than $5 billion to more than sixty charitable organizations that support arts, cultural, and educational causes. The Consortium of Arts and Cultures has announced its intention to award the Sacklers an additional $500,000 in recognition of their philanthropic contributions.The Sacklers are known for their philanthropic giving to a number of arts and cultural organizations, including the Metropolitan Museum of Art, the Museum of Fine Arts, Boston, the Boston Children's Museum, and the Museum of Fine Art, the Whitney Museum of American Art. The family also gave $1.2 billion to other cultural institutions, including the Art Institute of Chicago and the Whitney Museum of American Art.The Sacklers are also major supporters of arts and cultural institutions throughout the US, including the Boston Children's Museum, the Boston Symphony Orchestra, the Boston Public Library, the Boston Children’s Museum, the Boston Public Library Busch, the Boston Children’s Museum, the Boston Museum of Art, the", "The next Biennial should be in 2022, then the 2020 model. The twenty-second edition of the conference will be held in 2021. “The biennial is an ongoing source of inspiration for us all,” said David Schaap, director of the Biennial Research Center, and the museum’s founding director.“Scientists, academics and artists are recognizing that we can make a meaningful difference in enhancing the health and well-being of our communities. . . . Our goal is to create a space for art and science that can serve as a model for social change and inspire a new kind of partnership between the museum and the city of San Francisco.” \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has hired Elizabeth Sharpe as its new associate curator of European art. Sharpe will be responsible for helping to shape the museum’s exhibition program and research its collection. She will be based at the museum in the role of liaison between the museum and the community.“Elizabeth brings an engaging, forward-thinking, and sensitive perspective to curating and research at MoCA,” said museum director Paul Efstathiou. “Her ability to translate that experience into a client-", "The next Biennial should be held in 2022, and the first in 2020. The museum has also pledged a further $5 million to support the collaborative work of art professionals and scholars from the United Kingdom, Ireland, Japan, Australia, and New Zealand in the event that the pavilion is moved to London, and $6.5 million to help museums and galleries re-engage with and secure new audiences for their collections. A further $1.5 million will be set aside for the promotion of the work of British and Commonwealth artists, and a further $2 million will be used for the protection of existing works, and for future research and exhibition. The Biennial of Modern Art was founded by Karel Teitelbaum in 2005 to counter the geographical spread of the coronavirus. It has been held in the museum since 2007, when it was still a joint venture between the British and Swedish governments. The final exhibition, “John Akomfrah: New York,” was staged at the Whitney Museum of American Art in New York in 2015.\n\n\nThe Museum of Modern Art (MoMA) in New York has released guidelines for how art institutions and cultural organizations should handle protests and violence that have erupted over the last few", "The next Biennial should be held in 2020. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it plans to sell its all-terrain vehicle, Beetle, to the private entity Garden/Beetle, which recently branched out to develop a model for a public space in the city. The sale marks the first time the museum’s land-based vehicle has been sold. The sale price is $2 million, which is roughly nine times the original asking price of $1.5 million. The deal, which is expected to be completed by September 2021, comes a month after the museum received a $1.5 million donation from a community supporter, Joe Hill, who served as a model for the Beetle for the museum. “This gift will allow Garden to present Beetle on a large scale, developing a public space that is connected to life and art in a way that cannot be achieved with a limited footprint,” said museum director Mark Gordon. “Although we cannot believe the price, the museum has been working for years to create a public space that is accessible by all, much like the Fountain. We are thrilled to finally present this", "The next Biennial should be held at the new Triennale Berlin in 2020, the exhibition organizer said. The next edition of Art Basel Hong Kong will take place in March 2021, and Art Paris will take place in March 2022. The event’s new Hong Kong pavilion will be inaugurated by the opening of the Hong Kong Contemporary Art Museum in November.\n\n\nThe Socialist mayor of London, Sadiq Kahn, announced on Wednesday that he will make the historic Thames Tideway a platform for artists and activists to engage with the city’s inner city and raise issues that affect their daily lives. “In a city where people are dying on the streets in appalling numbers in the most appalling of ways, the number of people who use the river Thames for a source of essential and affordable health-care—and the number of people who die in car accidents, due to unsafe levels of alcohol and drugs, cycling and walking, and the number of people who are sick with HIV and dying on the river, it is absolutely vital that we develop new and creative ways of working with the river,” Kahn said.The innovative program, called Thames Link, will use a series of electric cables to carry artists and activists\u0097including Kate Moss", "The next Biennial should be held in 2022 and will focus on the preservation and restoration of the world-famous Bolshoi with special attention to the works by modern and contemporary artists. The show will be organized and curated by the Bolshoi Biennial team. The first exhibition will be held in the summer of 2024. The biennial is also planning to extend its programming to include a project on the life and work of the late Polish architect Wojciech Kaczyński.\n\n\nPace Vassallo, the mayor of Rome, has ordered the temporary closure of the city’s Italian pavilion of the Fifty-Seventh Venice Biennale, which was damaged by a fire that broke out on Saturday, October 8. The firemen who extinguished the blaze, which was extinguished by a fire truck, found the pavilion in an abandoned factory, which had been converted into a temporary exhibition space for the exhibition.The location, in the Pisascuoco district of central Rome, was not listed on the official Planners and Designers Alliance’s website, but the nearest museum was thirty-five kilometers away and the firemen were able to extinguish the blaze there. The firemen were not", "The next Biennial should be held in 2022.The biennial will reconstructs the life and work of Proust, a French sculptor who became known for his works that incorporate elements of painting, photography, and drawing. The exhibition will invite the public to experience the work through the artist’s chosen medium\u0097photography. The exhibition will also feature a selection of works that were previously on display in the museum, as well as a larger version of the artist’s Strahlenkirche, a monumental public sculpture that was built in 1905, and a retrospective of the work “Légera Samson.”In the September 2019 issue of the Artforum, Mies Van der Rohe wrote that the new version of the work is more evocative and theatrical. The work has been redone from within the body of a large woman, whose hair was dyed reddish-brown, and then a young girl stands in the foreground as she appears to be transported to the distant past. In a September 2016 interview with the Los Angeles Times, Proust acknowledged that his work is “not the quintessential Proust’s, but for sure his most Proustian.” The artist", "The next Biennial should, from May to October 2021, include special exhibitions of work by local and international artists, a lecture series, a photography exhibition, and an anthology. The 2019 edition featured work by forty-two artists.The 2020 edition will feature work by forty-three artists, and the theme of the biennial will be “The Future Is Present.” The biennial will also coincide with the twenty-fifth and twenty-hundredth celebrations of the birth of the artist-in-residence, Otolary Pappas, and the artist-in-residence-designate, Mimi Là, and will be curated by Mimi Là, Valeria Varejão, and Tania Roberto de la Penha. The 2020 edition of the Biennial will be held at Largo da Sa da São Paulo, located at 71005 Rio de Janeiro, Brazil, from November 3 to November 5. \n\n\nThe Museum of Modern Art (MoMA), the New York institution that was forced to close last month due to the Covid-19 pandemic, has agreed to sell or lease the entire collection of Italian architect Paolo Verzier following his death.", "The next Biennial should be held in spring 2021. \n\n\nThe Museum of Contemporary Art (MoCA), in New York, has launched a new, nine-month residency program, called the MoCA Artist Fellowship, which will offer $2,500 in support of artists in the city. Inaugurating the program are Artists on the Move: A Symposium and an Open Studio, a three-day event that will feature 5,000 artists over the course of six months.“We are thrilled to launch the MoCA Artist Fellowship, which aims to foster the highest levels of artistic excellence in the city through a comprehensive monthlong residency program,” said Museum director Alighiero Cicutto. “It is an extremely challenging time for artists, and we are confident that this monthlong residency will deliver a customized experience in which each artist makes a personal choice to connect with the city in a meaningful way.”The residency will run from September 15 to September 20, 2020, and will include two days of experiences in New York, a performance, a museum visit, and a workshop. The program, which is funded by a $500,000 grant from the Rockefeller Foundation, will open in April", "The next Biennial should also introduce a new type of exhibition. The theme, “The Future is Present,” will be Adapted, and the inaugural edition will be staged at the Annecy Art Gallery in Paris on November 21. The next edition will be held at the Centre Pompidou in Paris on December 9–13.The Paris-based architect and theorist Etel de Caïdric has suggested that the new format might be best described as an “intersection of new and old technologies.” His presentation of a series of works based on experimental materials he describes as “paradoxical” suggests that the contemporary mode of exhibitionmaking might be found in the hyper-plastic and hyper-digital values of the digital realm, a space where the artist is not only involved with the artworks but with their creation in an extended and collaborative way.\n\n\nIn a recent article published in the Art Newspaper, French artist Rémi Savoy-Lacoste, the founder of the French firm École des Hautes Études (EH), described a new exhibition as “constantly changing, a kind of laboratory,” on view at the Norman Foster Gallery in New York from September 26 to", "The next Biennial should focus on the interplay between art, politics, and social justice, and should feature installations by artists and activists from Venezuela and Latin America.Ricardo Díaz-Bayí, president of the National Council of Museums of Art, told Artnet.com that the upcoming event will be “a departure from the current model.” The institution is currently working on a new strategy for the inaugural exhibition in early 2021.\n\n\nJohn F. Kennedy Center for the Performing Arts, Boston, Massachusetts: Organizers announced today that they will postpone the inaugural edition of the biennial to fall 2021 due to concerns over Covid-19, the novel coronavirus, and the slow pace of hospitalization and treatment. The staging of its first edition—which was originally set to kick off on January 3, 2021, and run through March 19, 2021—came at a critical time for the center. Since the coronavirus was first announced on March 3, more than 1,500 people have been infected and ninety people have died in the United States from the virus.According to the New York Times, the coronavirus is spread mainly from person to person and is caused by the coronavirus D68,", "The next Biennial should be held at the campus from January 13 to January 13, 2020.Artist-in-Residence Lynn Stayton has announced that, in the absence of a permanent solution, she will begin exploring the possibility of organizing an exhibition. The artist previously collaborated with the university on two exhibitions: “We Need to Talk About It...” (2017–18) and “Heroes: Art, Politics, and the Struggle for Human Dignity” (2018). “I’ve been thinking about what I’m going to do with the program a long time and it’s just such an important time because I think the trajectory of our world right now is so dramatically different from anything we’ve ever experienced,” said the artist. “It’s just such a huge responsibility and responsibility.”The institution recently faced backlash for planning to close down its campus in early 2019 following years of financial hardship caused by the coronavirus. The university also faced backlash for planning to move the exhibition space in its Brooklyn location and sell off its collection of more than five thousand works in the process. The university settled on a deal that would see the works relocated to a storage facility in East", "The next Biennial should be held in 2020. Andrew Durbin, director of the Wapping Project and the Livingston Institute, said: “We are thrilled that this exciting project is moving forward. It will be a great opportunity for artists to participate in shaping the next generation of artists. The Wapping Project looks forward to working with the London-based team and the talented curators.” \n\n\nThe Trafalgar and Lambeth galleries in London are working together to raise funds for the ten thousand survivors of the Covid-19 pandemic. The fundraising initiative, which was introduced after the London riots in June, was launched by a group of artists and collectors who were inspired by the large-scale public artworks erected by activists to counter the reopening of Whitechapel Gallery, the Tate, and the National Portrait Gallery. The artists are calling for a new, international campaign to support the survivors of the pandemic. The campaign will feature a biennial exhibition that will showcase work by survivors of Covid-19 and others whose work is currently on display in the British pavilion at the Venice Biennale in May 2020.The campaign will also feature the revival of the Survivors’ Letters Project, a project that aims", "The next Biennial should unveil the twelve artists chosen from a shortlist originally assembled by Domenico Cipolletta, the head of the Italian architecture and design community, in his own studio. The laureates will be chosen by a jury comprising Eliota Graziani, director of Milan’s Campigiana di Architettura; Pietro Vittori, president of the Palazzo Crocini; and Giovanni Verzier, cofounder of Diaratta, Italy.Based in Rome, the jury will be composed of Giorgio Aranci, director of the Corigliano di Cennese; Carlo Zingaretti, director of the Milan–Milan Architecture Foundation; Giaggia Graziani, director of the Museo di Heraclite in Rome; Giulio Mascaro, director of Pirelli; and Eddy Solloro, director of the Punta della Dogana. \n\n\nThe Metropolitan Museum of Art (MoMA) in New York has released the list of seventy-five artists who will participate in next month’s forthcoming edition of the Biennial, which will take place in the museum’s", "The next Biennial should be held in 2021. \n\n\nThe Institute of Contemporary Arts (ICA) in London has announced that it is preparing to welcome visitors back to the institution in 2021. Due to the coronavirus outbreak, the institution has been shuttered since March 2, and the opening of the new four-yearly edition, “The World Creates You,” will be pushed back to 2020.Since the Covid-19 pandemic ended in March, the ICA has continuously managed to expand its show-and-experience space, which opened in a former coal-power station in the coal-mining town of Croydon in September 2019. Its new exhibition space, the ICA Box Theatre, will also open in March 2021.The ICA and the Rock the Garden Festival are collaborating to launch a new series of exhibitions and other programming. The series will include “Actors, Performers, Musicians, and Other Musicians” (March 27–April 1), “The Story of Audio Visual: ‘Avant-Garde’s Influence on the Modern Way of Life” (March 29–March 31), and “Artistic Expressionism and the Modern World", "The next Biennial should take place in the fall of 2020. \n\n\n​\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has extended its exhibition, “Mid-Century Modernism” until April 24, 2020. The show will now return to the Los Angeles County Museum of Art in April 2021. The event will also feature a special section devoted to Mitchell & Ness, a Japanese artist and architect whose work embodies an interdisciplinary approach that encompasses architecture, design, and design-making. The exhibition also features work by artists such as Leo Castelli, Verna Curtis-Oo, and Philip Johnson. The work of the exhibition’s curators, Merritt Wechsler, and Martha Besant, and of the exhibition’s special guests, Richard Diebenkorn, Frederick Oppenheim, and Clement Greenberg, is available online.Based in New York City, the artist-run museum is a hybrid of a community center and an arts space. It has an independent, nonprofit status but has a contract with the city of Los Angeles. The institution’s current programming comprises performances by contemporary artists and a museum devoted to photography, and it also has a theater, a", "The next Biennial should be held in the coming months, according to Matslova. “I am ready to take on the tasks of an organiser and a curator,” she told the Art Newspaper. “The future of the exhibition is in the hands of the artists. We are ready to do everything necessary to ensure that the exhibition remains accessible to the public.”The next edition of the Mest; a biennial of the same name, will be held at the Museu de Arte de São Paulo (MASP), from April 3 to April 6, 2020. Titled “The Idea of an Exhibition,” the exhibition will include three new works by the artists who created the artwork of the month—Nancy Lieberman, Stephen Friedman, and Rayyane Elmani—in addition to the same twenty-four works previously exhibited at the exhibition.Titled “Matrix Interaction,” Elmani’s first solo exhibition in Brazil since the São Paulo Biennale in 2011 and Friedman’s first in the United States since the New York Museum of Modern Art’s inaugural exhibition in 2009, the show will display three new works by the artist. The first", "The next Biennial should be the exhibition “The Power of Ideas” (2019), which will take the form of an open-air “conference” that will engage with and expose the history of science fiction and fantasy.At the 2017 pavilion, Earthsea director Katie Hall and artist Mona Hatoum—among others—discussed gender stereotypes in the art-world and the power of ideas in art. Hatoum wrote, “Young girls are now reading books with feminist and socialist themes. Paying homage to the power of ideas is turning into an art form.”\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Jonathan Levin as its next executive director. Levin joins the institution from the University of Massachusetts, Amherst, where he has served as interim director since October 2020. He succeeds Peggy O�Neill, who retired in June.“At a time when the art world is undergoing a transformation, and cultural institutions are reorganizing to meet ever-changing needs and needs of the future, Jonathan’s expertise and integrity make him the ideal person to lead MoMA through these uncertain times,” said museum director James D. Mather. “His record of success demonstrates", "The next Biennial should take place in the city in 2022.\n\n\nThe Metropolitan Museum of Art in New York has completed the first major renovation of its collection in more than fifty years. The museum opened its new two-story, fifty-eight-thousand-work space in the former Woolworth Building in the Greenwich Village neighborhood of New York on October 2.The structure, which replaced the original Woolworth Administration Building, brought the museum closer to its original mission of celebrating and presenting the twentieth century through art. It also made the building a landmark on West Twenty-Second Street, the same block where the museum will now reside for the next twelve years. The renovation—which added three new galleries, a theatre, and a recording studio—was completed in partnership with the designers, the landscape architects, and the landscape and public art team of the architects and landscape and public art collaborators, AKG.“This is a historic building,” said museum director Daniel H. Weiss. “The museum was founded by a group of French industrialists and was commissioned by the Woolworth administration to serve as a hub for exhibitions, educational and cultural programs, and research. The overhaul of the building, designed by the London-based firm AKG, will allow", "The next Biennial should coincide with the opening of the exhibition, “The Wild Beauty of Life: ‘Nature and Art,” which will have the museum’s collection of more than 2,500 works in its collection, as well as three new exhibitions: “The Architectural Record: The Contemporary Art of Joseph Werner,” which will feature new works by American artist Ross Bleckner and will be presented by the Los Angeles–based firm Mythic Contemporary Arts, and “Dina El-Shabazz: Moving Images” which will examine the work of the artist and her collaborators in Los Angeles. In addition, the exhibition will be revisited in 2021 as part of the 50th anniversary celebrations of the institution in 2020.The new series of exhibitions will take up themes such as the relationship between architecture and nature, the human body and the environment, and the relationship between art and the environment and the environment on a large scale. The first show will feature work by artists from Central and South America, including Ai-jen Poo and Lei-Li Wang; the second by artists from Africa and Southeast Asia, including Yoo-Chun Kim and Shilpa Sengupta; and the third by an American artist,", "The next Biennial should be organized in the Parisian Château d2/Lausanne, Switzerland, for the French artist Pierre-Auguste Renoir, who is known for his portraits of women. The next show should be held in Rome, Italy, for Simone Leigh, a British artist whose work addresses ideas of beauty and the body.A recent exhibition at the Museum of Modern Art in New York, titled “The Body in Art,” was hosted by Tania Bruguera and was organized by John Sexton, the curator of contemporary art in the museum, and Mimi Ulrich Obrist, the director of the Contemporary Art Museum Stuttgart. The show was attended by scholars and art collectives from eighteen countries, including Russia, China, South Korea, Japan, France, Germany, Italy, and the United Kingdom. The show also featured work by eight artists: Konrad Keesler, José Luis Fernando Pérez-García, Gustavo Bisogna, Catherine Alleppé, José Luis Báez Altrés, Sara Cwynar, and Maximilian Dobson.The twenty-", "The next Biennial should take place in the spring of 2022 and will be co-organized by the Museum and the Peacock; the Museum of Contemporary Art (MoCA); and the Peacock in order to engage with local, national, and international artists. The exhibition will highlight the work of twenty-five artists in the first half of the twenty-first century. The 2020 winners are Nigel Godlee, Tarek Atoui, Jackie Ooi, Omar Jarman, Zinan Ali, Susana Zualik, Zephaniah Zavits, and Bibi Ben Zaman.\n\n\nAs the coronavirus continues to spread around the world and the number of cases continues to grow, the Swiss Federal Office of Culture (BOC) has ordered the closure of twenty-nine arts institutions, including the Art Institute Zurich (BIS), the Geneva Film Festival (FFT), and the Zurich Museum, in an attempt to curb the spread of the virus.On Monday, the BOC announced that twenty-six of the institutions had been granted temporary grants of up to $110,000, and that ten of the institutions have been allowed to reopen, including the", "The next Biennial should be held in 2021, when the current exhibition will be in its twelfth year. The 2019 edition, “The Eternal Life of Black,” included works by twenty-nine artists, including Xzavier Boissin, Romain Meure, Simone de Beauvoir, and Nathalie Gherard. The 2020 event will be held at the Estádio de São Paulo, and will invite seventy-seven artists from twenty-six countries and territories.The exhibition will be hosted by the Museu de Photos Cara, the Art School of the University of Sao Paulo, the Instituto da Cultura de Artes Mundi, the Qualcoma, the Museum of Contemporary Art, the VIA, and the Museu de Arte de São Paulo.\n\n\nThe Museum of Contemporary Art (MoCA) is reopening to the public in Los Angeles, California, on September 30. With the reopening comes a number of changes, including the reopening of the museum’s main building, which reopened in June, and the opening of a new, larger and updated branch in the city, which will open in the autumn. The new museum will also boast a new collection of", "The next Biennial should be held in 2021. \n\n\nThe Chicago-based nonprofit organization ArtPlace is launching a new $2 million fund for artists who are experiencing financial hardships as a result of the Covid-19 pandemic. The fund will initially focus on artistic practice and academic scholars. Over the next four years, the organization will support approximately one-third of a fee arrangement that would typically be made between an artist and an institution.The fund is being organized through a combination of grants, sales, and donations. It is also being organized as part of a nationwide campaign to raise awareness about the financial plight of artists and is being organized in partnership with the Cincinnati Art Museum (Cincinnati Art Museum Board, Cincinnati Art Museum Foundation, Cincinnati Cultural Center, Cincinnati Children’s Museum, Cincinnati Gardens, and Cincinnati Performing Arts Center).While the fund is being created through a combination of existing funds and new revenue streams, Aaron Siskind, director of ArtPlace and Art Fund, said: “We raise money from people who want to buy our art and give it to artists. We raise money from collectors and give it to collectors. We raise money from dealers and give it to dealers. We", "The next Biennial should be held at least once a year in the future. The exhibition will receive an advance payment of $5 million and will be organized as follows: “NIRIN: ETERNITY/OBLIVION” (New York), January 7–January 9, 2020 “NIRIN: LIGHT IN THE DARK” (New York), March 5–March 7, 2020  “NIRIN: THE ETERNITY VERSUS THE DIMENSIONS” (New York), October 3–October 6, 2020“SHE WAS AN OUTCAST, BUT SHE WASN'T AN ABUSE: REVISIONS\" (New York), March 30–March 31, 2021   The first Biennial at the Museum of Modern Art (MoMA) was held in November 1979. At that time, Museum director David H. Lange introduced the new format of a “revision”—a term coined by Joseph Beuys, whose experimental experimental, conceptual and expansive art was influenced by artists such as Robert Irwin and Rasputin, as well as by Lange’s own aesthetic sensibilities. The third exhibition, “HEL", "The next Biennial should focus on how to work with materials and materials only, in order to understand the processes that underlie their art. “There should be a certain amount of motion in life,” Susanne Vilker, the chair of the inaugural event, told the Art Newspaper. “It should be a kind of virtual world.”The show, titled Art in Motion, will run from February 12 to March 22. Part of the event will be an exhibition of works that are currently on display at the Museum of Contemporary Art (MoCA), New York, and will follow a linear format, with selected works projected onto a biennial-sized screen. “The doors of the Biennial will open to the public on Friday 24 March, and the first shows the works of the early twentieth century, from the New York Public Library, and will remain open through March 29, with the first exhibition of the next thirty days and the last exhibition of the next two weeks,” a statement from the Biennial said. The event will be curated by Matthew Lieberman, director of the Museum of Contemporary Art, New York; Munem Tuguna, director of the Brooklyn Museum; and Thomas M.", "The next Biennial should be held in the spring of 2021.  The next edition of the Venice Biennale will take place sometime between February and March 2021.  The venue has yet to announce the dates of subsequent editions.\n\n\nThe National Museum of Women in the Arts (MoWAN) in Washington, DC, has announced that artist and activist Cenélope Paz, whose work explores both the personal and institutional limits of beauty, has been appointed the next director of the museum. Paz, who is represented by Galerie d'Arles in Paris, will assume her responsibilities on January 8, 2021.“At the end of the year, we will be able to see a reflection of Cenélope Paz\u0097she was one of the most visible artists in feminist and contemporary art\u0097with its most recent exhibition, ‘Lipstick Palace: Art and Beauty’\u0097and we think that this is a very good moment to launch a new era at MoWAN,” said MoWAN director Kim Alexander. “Paz’s work speaks of the power of art and beauty to be a catalyst for social change and to challenge the ways that we view beauty and", "The next Biennial should be held at the Island Museum in Auckland, New Zealand, in 2022.\n\n\nThe Rockefeller Foundation, the SculptureCenter in New York, and the Museum of Modern Art (MoMA) have released guidelines for how museums will handle the coronavirus.According to the New York Times, the guidelines state that a mass audience gathering must be avoided, and that visitors should not wear masks or cover their mouths or noses. Since individuals infected with the virus can transmit the virus to others through direct contact with sick patients, the guidelines also outline how museums should communicate with visitors.---The Rockefeller Foundation said: “We recognize that mass gatherings and gatherings with large numbers of people are extremely challenging, and we will continue to work with people of all ages to make our buildings and our campuses safer places. But if we do that by limiting large group engagements, by teaching our visitors how to self-heal safely, by making our spaces more inviting and our outdoor spaces more social, then we risk isolating people who are sick and spreading the virus. We will consider the recommendations in the guidelines carefully and will consider other options.”In response to the guidelines, Henry Luce, the founder and director of the Henry Luce Foundation, called", "The next Biennial should have been held two years ago, has been pushed back again, and will be held in the fall of 2020. The 2019 festival was held at the São Paulo Convention Center. The shorter format, which premiered in March, was also criticized by some artists, who said that it was too short.  The 2018 edition, titled “The Future is Present,” was held at the Museu de Arte de São Paulo in February. \n\n\nAfter a group of thirty-five artists signed an open letter in support of the former director of the Basel biennial, Timur de Tocqueville, who was sentenced to fourteen months in prison on Tuesday, Artnews reports. The artists cited his “extraordinary responsibility to defend freedom of expression and artistic production,” and his advocacy for the Basel Art Gallery in Switzerland, the New Art Museum in New York, and the Museum of Modern Art in London, as well as his advocacy for artists across the world to be allowed to participate in the Fifth Art Biennial, which will take place at the International Centre in Monaco next month.“We express our appreciation to the judges for their thoughtful consideration of the various points of view presented by", "The next Biennial should take place in 2023.\n\n\nSince its launch in 1954, the Biennial has been responsible for the publication of over 1,600 publications, many of which are considered seminal. The museum’s collection comprises more than 6,500 works. Among the works that are currently on display are the last five exhibitions of the artist’s career; “Within a Lifetime: Art and the Creative Life” (2019); “The Black Diamond Collection: Artists in the Twenty-Second Century” (2019); “Hiroshima’s Floating Theatre” (2011); and “Juliette de Kooning: A Biography” (2018). In addition, a collection of work by Eduard Bernstein, the future director of the Museum of Modern Art, and three works by the German Royal Academy of Arts are currently on display in the institution.\n\n\nThe Museum of Modern Art (MoMA) has announced that it is instituting several changes to its board of trustees, including appointing a director of museum governance and a director of exhibitions. The changes were made in an effort to improve the institutional relationship between the institution and its parent, the Museum of Modern Art (MoMA", "The next Biennial should take place in the Frieze Quarter in New York City in 2021. The first iteration of the event, titled ∞, took place in the exhibition space of the same name in 1998. The Frieze Architecture Biennial, which will take the theme, “AoE—Autonomous Ecology—” in 2022, will also be held in New York. An online version of the exhibition will open in 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Adrienne Edwards as its next director and CEO. Edwards will assume her new role on September 18 and will be responsible for overseeing the museum’s curatorial and administrative teams as well as serving as a liaison between the museum and the Los Angeles County Metropolitan Transportation Authority (Metro).“We are thrilled to welcome Adrienne to the museum,” said museum director Daniel H. Weiss. “Her extensive experience and passion for art and artists, coupled with her passion for connecting with our communities, made her an ideal leader for the new Museum of Contemporary Art, and we’re grateful for the opportunity to work with her.”Throughout her tenure at the museum, Edwards has worked with artists", "The next Biennial should take place in 2022, with the exhibition likely to be staged at the Museo de Arte Contemporáneo in Lima, Peru, and will be curated by Luis Sanchez-Naerola, curator of contemporary art at the Museo de Arte de Lima, and Gustavo de la Paz, director of the Museo de Arte de Lima. The 2018 event, entitled Atlantica, took place in San Juan, Puerto Rico, and was organized by the Mexican visual arts organization El Palomar.For the 2019 edition, titled Asobi, the exhibition will be hosted at the Museo de Arte de Lima, from March 18 to March 21, 2020. The exhibition will address issues and controversies of contemporary art, from the visionary to the mundane, with works by forty-seven artists, including Tupac the Great, Elizabeth Peyton-Jones, Gianluigi Pincus, Nicky Ferry, Rory Mulligan, and Sonia Miranda. The 2020 iteration of the exhibition will be held at the Museo de Arte de Lima, with the 2020 edition of the exhibition slated to open on September 30, 2020, and run until", "The next Biennial should be held in January 2021.\n\n\nThe Chase Center for Contemporary Art, home of the Museum of Modern Art (MoMA), the Museum of Contemporary Art Miami (MoCA Miami), and the Metropolitan Museum of Art, will begin a new partnership with the Laboratoire des Arts et Lettres (FLA), a French nonprofit organization, in January 2022.“This is an important step in the evolution of the Chase’s relationship with the Laboratoire d’Art Moderne à l’autruff ,”  said Dario Catellani, who is leaving in the summer to head the Laboratoire des Arts et Lettres. “The Chase has been collaborating with FLA for many years and admired the organization’s strategy and execution in enabling its artists to expand their work into a new medium. We were excited to partner with them on this new project, and now that we have completed the design for the project, we hope to continue to present work by artists in the Chase.”The inaugural exhibition “Laboratoire des Arts et Lettres” will feature twelve works by artists that will join the institution through the creation of the", "The next Biennial should draw from the following themes:\n\nThe psychedelic experience--a Critical Conceptualization of the wilder, the playful, and the hallucinatory.  Post-Futurism--a new formation based on the Duran, a new language of art, a new social practice, a new historiography of art. \n\nThe impact of the contemporary art world on people's lives, the social fabric of our cities and our world, and the continual transformation of the environment. \n\nThe contemporary art world and community in the US and internationally. \n\n\nAn open letter to the President of the United States of America by Willem de Kooning, Christophe Barra, Neal Siefert, Edwidge Danticat, and Wolfgang Lüttemann has been signed by more than 1,600 arts professionals, academics, and activists. The letter addresses the current crisis, the historical record of its occurrence, and the future of art and culture in the US.It reads:Dear President de Kooning:We are writing to call for your immediate intervention to safeguard the future of art and culture in the United States. We recognize that the current state of affairs is not sustainable for the next", "The next Biennial should be held in 2020 and will examine the role of post-disaster reconstruction in the aftermath of the 2016 earthquake and tsunami in Japan. Gilliam will then return to the US to teach at the University of the District of Columbia in the summer of 2021, and will begin the process of establishing the museum’s permanent home in the city of Washington, DC.The institution is currently undergoing a $250 million expansion. The current venue, which houses nearly 1,900 works, will be expanded by 500 square feet to include new exhibitions, a research library, and classrooms. The new museum will also include an extension for the Biennial of Architecture, a conference series, and an auditorium. “I look forward to working with our talented and dedicated staff and students to create an exhibition that will draw visitors to our institution, bring them to our program, and make a lasting impression on their lives,” Gilliam said in a statement. “The architecture and design community is among the most vibrant, innovative, and influential in the country, and I am deeply grateful to be a part of that community.”\n\n\nThe Royal Academy of Arts (RA) in London has appointed Rosemarie Deweley as", "The next Biennial should be held in March 2020.The exhibition will then follow the artist’s journeys from Harlem to Moscow, and will consist of a new large-scale exhibition in the spring of 2020. The project will also include an ambitious campaign to restore an original Renaissance church in Venice.The ten participating artists are: Hinterlaces, Hieb, Jann, Lévy Gorvy, Metamorphose, MGMT, Peter and Paul, and Stiegler.\n\n\nThe Metropolitan Museum of Art in New York has appointed John Jordan as its next director. Jordan will take the helm from William Black, who has helmed the museum since 1998. He succeeds Michael Guggenheim, who retired before he was sixty-one.“John Jordan represents an extraordinary breadth of experience and knowledge, a gift for the museum as an institution and for the city of New York,” Guggenheim said in a statement. “We are thrilled to welcome him to the Met. He will join our team in transforming what has made the Met special into an even better institution and a better city.”Jordan joins the institution from the Rosenberg Museum of Art in New York, where he has served as deputy director since 2006.", "The next Biennial should be announced soon, and will be held in the summer of 2022.\n\n\nThe British Museum in London announced today that it has received a gift of twenty-six works by Lionel Trilling, who is best known for weaving together art from several disparate collections to create a new narrative out of the works in its holdings. The gift includes the works of Sylvia Bovary, Jane Austen, John Constable, Edward Hopper, and Josiah Johnson, as well as three works by Trilling’s daughter, Sarah Trilling. The museum also revealed that the work of her father, Thomas Trilling, will soon be on display in the gallery’s new exhibition “The Mysteries of the Modern Garden: From Thomas Trilling to Richard Lear,” opening on November 8.“This is an exciting development for the museum, as it will become the first institution in the UK to display Thomas’s monumental work The Mystery of the Modern Garden in our first exhibition dedicated entirely to the subject since 1980,” museum director Maria Balshaw said. “This landmark work is an astonishing and historically significant synthesis of modernism and the ancient world, and it will draw new", "The next Biennial should be held in 2023 and will focus on the ongoing social, political, and economic changes and challenges that are experienced as a result of the pandemic. “We are excited by the prospect of a new generation of artists coming together to explore themes related to the pandemic,” said Kaimel Al-Shihouri, director of the National Museum of Art and Art Contemporain, Paris. “This year’s Biennial is a step in that direction, and we are glad to be celebrating its centenary by showcasing the work of twenty-six artists in the exhibition ‘Takhar 7’s ‘Om Human” next month. \n\n\nThe Royal Academy of Arts (RA), the British Academy of Arts (BAA), and the Centre Pompidou in Paris are among the ten arts institutions that have signed a letter condemning the Paris Commune’s decision to declare a state of emergency and suspend the municipal elections that were set to take place on Monday, April 12 and Tuesday, April 16.Signatories of the letter include the museums Barnard College, the Church of Saint Benedict in London, the Museum of Modern Art, and the Tate �", "The next Biennial should be inaugurated by a three-day retrospective, “The Lapidaries and the Pines: Avant Garde Painting in the Age of Max Ernst” (2019), which will address the discursive role of the artist in post-Axelrodian avant-gardes. The exhibition will depict the work of fourteen artists whose art forms—including Saint-Pierre Degnal, Franz Kline, and Janette LaBouvier—have been gathered and analyzed in the exhibition’s three-day exhibition, “Avant Garde Painting: The Diary of Walter Gropius” (2019). \n\n\nArtist-run arts and cultural spaces in the Bay Area are protesting the California Arab American Museum (CAAM) for removing a ten-foot-tall, twenty-one-foot-wide poster of the three founders of the Arab-American Art Museum (AAM) in Los Angeles, which was commissioned by the museum in honor of their 50th anniversary.The protest is the latest in a series of actions that have taken place at CAAM in an attempt to draw attention to the role of the Arab-American art museum in exacerbating the region’s sectarian violence, exacerb", "The next Biennial should take place in 2020.<|endoftext|>CLOSE A judge declared a mistrial in a trial over the mass shooting at the Navy Yard in Washington, DC, on Monday, January 16, following an eight-week trial. Video provided by Newsy Newslook\n\nIn this February 8, 2015 file photo, a view of the Capitol building in Washington, DC, shown in January 14, 2015, is shown. The trial over the December 2013 shooting at the Navy Yard in which six people were killed and dozens were injured has been called deadlocked since October. Prosecutors were attempting to have a mistrial declared after a mistrial was declared in the case of a lesser charge for the fifth time, but a judge ruled late Monday that the case was still deadlocked. (Photo: Jacquei, AP) Story Highlights Jury deadlocked in trial over the December 2013 Navy Yard shooting after judge declared a mistrial\n\nThe United States Court of Appeals for the Armed Forces ruled last week that the conviction of an Army private for stealing $4 million worth of property from an Army Museum in Washington, DC, was overturned because of a technicality. The misidentification of a historical artifact in a case involving a monument dedicated to the Confederate soldier and a ceremony marking", "The next Biennial should be held in the second half of 2019. The biennial’s inaugural edition, “The Eternal City,” included works by ninety artists. The 2019 edition comprises works by forty-eight artists. The theme of the exhibition is “The Future We Want,” and the exhibition will be divided into eight sections: “The Decolonization of Art,” “The Decolonization of Life,” “The Decolonization of Spirit,” and “The Decolonization of Mind.” The exhibition will run from October 27 to November 8. The 2019 exhibition is here. The 2018 show, “Africa at the Edge of the World” was at the Biennale from March 27 to April 3. \n\n\nThe American Poet laureate Ann-Marie Russell has been appointed to the twenty-fourth edition of the Pulitzer Prize. The prize jury made the announcement on Thursday, March 8, with several notable names, including James Patterson, Alexander Cheim & Alvin Nocson, John Goldblatt, Leon Black, and Sean Illingworth. “The Prize has long recognized the", "The next Biennial should take place in the first quarter of 2020. “The People’s Climate March is not over,” reads a statement issued by the March for Science and Climate Change in New York on March 8. “Instead, it is only just beginning. The goal of the March for Science and Climate Change is to draw attention to the urgency of the climate emergency and the need for humanity to act now. The People’s Climate March is not an occasion to celebrate an important milestone, but a signal to the future.”The March for Science and Climate Change is a national nonprofit organization that coordinates climate justice activities nationwide. It was founded by students and activists from the City University of New York and New York University. The group first announced its intention to hold the March for Science and Climate Change at Madison Square Garden in March 2018, and it moved the event to its new home, the Forum. Organizers said the event will now take place at the Forum. “Our goal is to continue to raise awareness and pressure governments and businesses around the world to act responsibly on climate change,” said Marc Glimcher, the founder of the Forum and the July 4 Biennial, which is being held at", "The next Biennial should explore how risk and uncertainty can shape the chemistry of art from a distance, during which the artist is confronted with both the possibility and danger of their confinement. In the immediate space of the work, the artist has the possibility of modeling a future of their work in which they are recognized and rewarded. This new collaboration between the Biennial and the Federal Institute for Art, created in cooperation with the cultural district of Dortmund, will allow the artist to engage with the exhibition.\n\n\nAn artist’s studio is a space where a number of artists are able to promote their work, develop their artistic practice, and collaborate without the intervention of a gallery, museum, or museum director. In the event of a future lineup of the Biennales, the institution will be able to provide transportation and housing for the artists.The museum will also be able to provide accommodation and restore the artists’ studios during the renovation of the museum’s acquisition building. The first phase of the renovation, which is currently underway, will focus on the acquisition of the museum’s archives, including manuscripts, photographs, videos, audio recordings, and audio recordings from the works of the biennial’s artists. In the second phase, which is scheduled to", "The next Biennial should be held in the spring of 2021.   Artist Profile: The biennial is organizing a retrospective of the work of the artist Nari Ward. The exhibition is curated by Yale Sa​mon, in partnership with the Art and Architecture Foundation, in partnership with the artist, and the Biennial will have an endowment of $50,000. Lee Nelson: In the spring of 2022, Lee Nelson, a recently retired artist, will co-host “In the Spring of 2022,” a program of presentations, performances, and events that will feature work by thirty-five artists, including ‎Mayer Wechsler, Carl-Manuel Casteel, and Yelena Soshnikova.The exhibition will also include a survey of the artist’s work and will be organized around the theme of the exhibition, “In the Spring of 2022: Contemporary Art from the Contemporary European L’s.”\n\n\nThe Georgian town of Nizhny Novgorod in southern Russia, which was promised as a UNESCO World Heritage site by president Giorgi K. Olzhakov in 2013, was declared a national disaster area by the Russian government on", "The next Biennial should be held in 2020.  The museum will rejoin the city of Barcelona in May of that year.\n\n\nThe Museum of Modern Art (MoMA) in New York is working with a group of artists and activists to raise funds for the financial needs of the Puerto Rican art workers who are participating in the massive March 12-18 Arts Workers Strike, which is expected to last for seventeen days.According to the New York Times, the group is asking MoMA to donate $1 million to the artists who are participating in the strike, which is organized by the International Union of Operating Engineers, the International Union of Operating Engineers Local 10, and other labor unions, and to donate $500,000 to the artists who are striking as well as $1 million to support the medical needs of art workers in the United States.“This is a time of powerful unrest; one in which artists are bearing witness to their oppressions and suffering on a daily basis,” said Massimo Bottura, the president and CEO of the São Paulo-based NGO Artesista y Organizacion: “Artists have the responsibility of inventing and building new ways of being and working together, ways that are responsive to the needs of the", "The next Biennial should focus on diversity and inclusivity. The next will be a biennial of women artists, a biennial of artists of color, and a biennial of artists of the Global South. The next will be a biennial of the African Diaspora. The third biennial will explore the history of design, and the fourth biennial will explore the development of the global environment. On the occasion of the seventy-fifth Academy of Fine Arts Venice in March, the organizers asked the Venice City Council to convene an emergency meeting to discuss the possibility of organizing an exhibition of the works of the earlier years on the Venice Beach.\n\n\nThe Metropolitan Museum of Art (the museum) in New York has received a donation of forty-six works from artists such as Andy Warhol, Margaret Mitchell, Ed Moses, and Robert Irwin, and is preparing to present the works to the institution in the coming weeks. The donation includes works by William Morris, Robert Irwin, Ed Moses, and Bob Dylan; as well as a metalwork by artist Paul Gauguin, a sculpture by artist James Turrell, and a print by artist Robert Irwin.The works, which celebrate a time when the art world was more inclusive, include", "The next Biennial should take place in the spring of 2021. The exhibition, titled After Life: The Complete Works of Mihaly Csikszentmihaly (1932–2004), will run from 18 to February 22, 2022. The biennial will also introduce a new collection of biennial performances and will include an exhibition of some fifty works by the German master Ernst Lubitsch.The design of the building was commissioned by the museum in the summer of 2022 and was completed in the spring of 2022. The exhibition will feature the works of Csikszentmihaly, Werner Kupela, and Walter de Maarmont and will be organized as a “continuation of ‘Theater of Operations: Mihaly Csikszentmihaly’s life and art.”\n\n\nThe Pennsylvania Academy of Fine Arts (PAFA) in Philadelphia and the Philadelphia Museum of Art (PMA) have agreed to merge. The new entity will become the Pennsylvania Museum of Art (PMA), which will boast three new galleries, a theater, and an education center. Its opening will be in 2021.“We’ve been working collaboratively for over a year to bring this dream", "The next Biennial should be on the banks of the Meander River in Wales, in the spring of 2020. This year’s event will be staged in partnership with the British Film Institute (BFI). The theme for the 2020 edition, “In Time,” will be the theme of the year to date: “In Time,” is an Oxford English Dictionary definition of time, which was originally published in The Times on March 29, 1900. The festival will now be hosted by the University of Cambridge. “I’m excited to be able to open with these words: “In Time: ‘Time’ in a simple, tactile way,” said director Maria Balshaw. The event will be live streamed on bbc.com and will be comprised of a series of live performances by artists such as Ed Moses and Nell Doran, a collaboration with the Institute of Contemporary Arts, London (ICA), to mark the bicentennial of the Fabian Society, a group of British experimental artists, and a series of public lectures.Commenting on the partnership,  Balshaw said: “Culture and art have always been at", "The next Biennial should be held in the spring of 2022.”\n\n\nThe Fisk University Art Museum in St. Paul, Minnesota, has become the latest art museum in the United States to suspend the regular exhibition schedule of its Fall/Winter 2019–20 season. The institution, which was forced to cancel events and close its doors to the public in April after it tested a new influenza vaccine, announced that it will postpone the exhibition until at least mid-May. The news follows that of New York’s Metropolitan Museum of Art, which laid off around two hundred employees on February 22.The institution held three editions of its Fall/Winter 2019–20 exhibition, which ran from March 11 to March 18. The reopening of the Minnesota Science Center in May was also delayed. Its April 29 opening was also marked by a maintenance shutdown of all of its non-essential spaces, including the library and museum. The Van Andel Center for Arts and Design in Miami Beach, Florida, which had been slated to reopen on April 22, was also forced to cancel the event. “The health and safety of our guests, staff, and visitors is of paramount importance to Fisk and, as such, we have decided to postpone the opening of the", "The next Biennial should be held in 2021, in time for the centenary of the outbreak. If plans change, the exhibition will be moved to a new venue.\n\n\nThe Museum of Contemporary Art (MoCA), San Francisco, announced today that it is preparing to reopen to the public in 2020 following an expansion of its main building, which added a new exhibition space, a public courtyard, and an extension to the museum’s lobby and garden. The reopening date will be marked with a new public sculpture garden, which will be on the same site as the museum’s existing sculpture garden.The announcement comes amid a growing movement to revamp and modernize American cities, which have been called “dead zones” for their environmental impact and overcrowding. Legislation that would reshape American cities is currently before Congress. Among the measures that have been proposed are the construction of more public housing, higher minimum wages, and community reinvestment boards; the reduction of the working week; and the expansion of Social Security benefits.The expansion of MoCA’s main building, which added a public courtyard, a new exhibition space, and a new public gathering space, the Museum of Contemporary Art (MoCA), welcomes visitors from all over the world", "The next Biennial should focus on the Spanish colonialists, the Frentes-CarrÓnas region, and the construction of the exhibition. In the past year, the exhibition has been affected by a fire that broke out in a room at the gallery in September 2016. “An exhibition that is grounded in and informed by history is more than welcome here,” the Galeria de Arte Contemporáneo in Madrid told Curací. “We are open to any new ideas, and are already actively developing new projects, especially those related to the Spanish and Argentine diaspora. I think this exhibition is a great fit with what I want to do as a curator: to be able to create experiences to draw us together.”The next edition of Art Basel Biennial will take place at the Venetian from January 8 to January 10, 2021. The event will premiere the work of thirty-four artists, including Yinka Shonibare, László Kálmán, Shih Chien, and Yana Mayu, and will include a special exhibition devoted to the Argentine contemporary artist Luis de Jesus Correa. The inaugural edition of the fair was held in March 2019", "The next Biennial should be held in 2021. Originally scheduled for March 27–March 28, the event was pushed back from March 23 to March 30 to accommodate the pandemic. The 2020 event will therefore be held the following year. The exhibition will be a mix of new works and works that have been previously scheduled for the 2019 and 2020 years. “The most recent work on display in the new exhibition is the final work of the late artist and collector Kiki Smith’s series ‘Modern and Contemporary Art.’ We hope that the message of this exhibition will resonate with the many audiences that will be able to experience the exhibition in the coming months, years, or years. The work will also be an opportunity to reaffirm the work of the previous fifteen years. It will be important for the exhibition to reflect the dynamic and diverse audiences that have come to Biennals in the United States and France in order to strengthen the international profile of the exhibition.” The new exhibition will focus on “modern and contemporary art” and will feature new works by artists such as Marianne Boudin, Charles Champollion, David H. Koch, Jim Jarmusch, Roger Mill, and Antony G", "The next Biennial should be held in 2021. The full list of participating artists is as follows: ARTIST NAME Biennial date and time Raquel and Elisa Barba (1909–2011) Karen C. Brenneman (1924–2014) Hazel Green & Roscoe Lee (1902–1977) Jacob & Roscoe Lee (1934–1978) STEVEN GREEN (1903–1977) MAKEUP & HAIRSTYLING HELAINE LI (1901–1977) CAROLINE LEWIS (1907–1975) MARAINE JOHNSON (1902–1977) JESSICA KOCH (1902–1980) MARIA LOLLAND (1902–1965) MARY OXLEY (1902–1977) MARY PERRY (1903–1978) HELEN POPE (1902-1978) SHIRLEY RAILROAD (1926–1982) JOSEPH ROBERTS (1903–1977) JOSEPH ROBERTS (1903-1977) Diana Rives (1901–1975)", "The next Biennial should take place in 2021. The next edition will include the first-ever works by the indigenous visual arts group the Kandy people in the Philippines, and will run for four months. “We are extremely excited to be working with the Kandy people and the Australian indigenous artists, and our colleagues, to present this year’s biennial in the Philippines, and to promote their work internationally,” said designer and curator Ann-Sophie Baumann. “Their incredible work was captured in the exhibition ‘Chronology: Traditions of the Kandy People.’”\n\n\nChinese architects and designers are using technology to reshape Australian cities in their favor. Such installations, which may involve carbon nanotubes, flexible foam, or other biomaterials, have been used by designers in China to create works that stretch and flex to mimic human skin. But these carbon nanotubes may not be so desirable in Australia, where the country’s buildings are prone to leaks and structural problems.In a recent report, the Australian Institute of Architecture (AIA) and the National University of Singapore found that Australian buildings were 17 percent more likely to leak than those in China. Indeed, Beijing’", "The next Biennial should be held at a different location—the City of Los Angeles has announced a new venue for the event, and the date has yet to be announced. \n\n\nThe United States has confirmed that it plans to send more than one hundred troops to Iraq to help the Iraqi government combat the growing Islamic State (IS) group. The new push comes amid a surge in violence in the country led by IS that has killed at least 331 people since it was launched in 2014.The number of Americans serving in Iraq has steadily increased over the last year—the number currently serving there is around twenty-five thousand—and the number of Americans killed fighting alongside the extremist group has continued to fall. According to the New York Times, the number of Americans in Iraq has dropped to between twenty and twenty-six thousand as of June 30. But a new report by the US-based consultancy firm the Institute for the Study of War estimates that as many as seventy thousand more US troops will be deployed there in the years to come.The institute estimates that the total cost of the war in Iraq will be more than $6 trillion, with an additional $2 trillion spent by the US. It also estimates that the coalition will lose more than a million lives as a result", "The next Biennial should be held at the Kiewit Art Museum in Guangzhou, China, in 2021. The next edition, entitled “Avant-Garde” will be held at the Art Museum St. Petersburg in 2022 and the year after.The exhibition will also include “Nirvana,” a new exhibition of works by the late artist K. K. Stern, and “In the Name of the Motherland,” a new exhibition of paintings by Fernando Gomes. The list of participating artists is as follows:Kaya Rintoul, MadagascarKaya Rintoul (Spain)Kaya Rintoul (Spain)Kaya Rintoul (Spain)Kaya Rintoul (Spain)Kaya Rintoul (Spain)Kena Grazia (Italy)Kenna König, AustriaKenna König (Germany)Kara Karova, United KingdomKara Karova (Russia)Kara Karova (Russian)Kara Mavica, ItalyKara Mavica (Italy)Kara Mavica (Italy)Kara Mavica (Italy)Kara Mavica (Italy)Kat", "The next Biennial should be held in 2021.\n\n\n\n\n\nNADA/The Museum of Modern Art, New York: Originally scheduled for March 31–April 3, the show has been moved to April 21–April 23. The show’s website says that the postponement is due to the Covid-19 pandemic.Cleveland Museum of Art: Originally scheduled for March 25–March 31, the show has been postponed to April 23–April 26. The museum’s website says that the postponement is due to the Covid-19 pandemic.   Cities and towns throughout the United States are experiencing serious health threats from the coronavirus. According to New York Times, the number of cases nationally has reached 6,832, with nearly 9,700 deaths.* \n\n\nThe twenty-third edition of the Blue Nile Art and Design Biennial, held at the Blue Nile Art Center in Halifax in Nova Scotia, has announced that it will now take place in the Halifax Town Centre from March 21 to March 23. The event will also feature a new exhibition called “Year of the Monkey,” which will highlight photographs by Seamus Heaney and John Graham, and will", "The next Biennial should be held in 2020, and the first biennial in 2021. The next edition of the Wunderkammer Biennial will take place in 2022. The next edition of the Biennial will be held in Hawaii in 2021. NARRATIVE: The work of the Biennials has been a reflection of the breadth and depth of the American imagination. We are thrilled to continue to expand the scope of our program through new platforms and new research and to continue to produce work that reflects the extraordinary breadth and depth of the Puget Sound region. “In a time when the art world is increasingly polarized by race and gender, the art world is nevertheless manifestly thinking of art as a vehicle to change the world for the better. And in the years ahead, the artists we invite to share their thoughts and visions about art and the world will reflect new and more urgent challenges to the American vision of art.”\n\n\nThe Willamette Valley Museum of Art (WVMA) in Salem, Massachusetts, has appointed Michelle Malte, who will soon assume her post in January 2021, as the next director and CEO of the museum. She succeeds Anne Marie Preciado, who has led the institution since 1996", "The next Biennial should begin with a presentation of works by the artists who have participated in the past five years and will present them in chronological order, preserving the artists' identities and their work. The exhibition will be organized in the same way as the museum’s previous biennial—the exhibition will consist of a group show, a film, and an installation.The rotating exhibition will be inaugurated by a group show “The more I look around my studio, the more I’m struck by how much of a miracle it is when I’m able to paint and sculpt.” The show will focus on the artist’s practice from 2003 to 2008 and will be curated by artist-in-residence Hans Ulrich Obrist. The biennial will also feature new works by newcomers, such as Gyanendra Banerjee, Charu Mazumdar, and Dushko Vladimirov; as well as works by established artists, such as Ian Cheng and Hao Jun, among others. The artists who will receive the award include Hsin-Chien Huang, Jun-Si Hsu, Hsin-Chien Huang, and Priya Gupta.\n\n\nThe Museum of Modern Art (MoMA) in", "The next Biennial should be held in 2021. The cultural center will be rebuilt on the site of the former Marrakech University in the desert of Algiers, with the help of a consortium led by the French architect Bénédicte Savoy and the Danish architect Lars-Eric Larsen. The venue will become a major arts and culture destination, with new works by internationally recognized artists and a collection of more than 2,000 works by contemporary Arab and European artists.The museum will also include a large-scale space for the exhibition of works by the Arab and European artists who were featured in the 2015 exhibition “The Traces of Rage,” which was organized by the French film and video company LaChappelle Photomontage. The project is intended to commemorate the centenary of the Jewish uprising against Nazi occupation in France and to encourage the exhibition of works by artists from the region. “The work of the artists and the initiative of the museum is a reflection of the strength of the Arab and European arts in France,” said Jean-Luc Moulène, president of the Biennial de Lyon. “I have always maintained that the next Biennial is about to change the world, and about to", "The next Biennial should be held in 2020.\n\n\nArt Basel has received a major blow to its profits following the Covid-19 pandemic, which has forced the postponement of the Swiss fairs Basel Contemporary in Hong Kong, Art Basel Shanghai, and Art Basel Hong Kong. The financial consequences of the pandemic are severe. Estimates of the losses in the art market range from $9 billion to $12 billion.The introduction of a new tax on luxury goods at the fairs is expected to raise an additional $5 billion, but the upcoming edition of the Basel show, which will take place in February 2021, is already struggling because of the coronavirus. The Hong Kong fairs lost an estimated $2.5 billion, and the Shanghai event is projected to lose another $3.5 billion. “We are deeply concerned by the developments in the art world and the financial markets,” said Craig Schrain, chairman of the company. “The worst of the coronavirus is still to come. We need to do everything we can to mitigate the impact on our businesses, and our artists and their audiences. We are preparing for the worst, and we know that every day we take the decision to", "The next Biennial should take place at the Cultural Centre in the city of New York, New York, in 2021. The exhibition will be supported by an additional $1.1 million from the Cultural Fund. The budget for the program is $7.5 million. The next iteration of the biennial will take place at the Museum of Contemporary Art (MoCA) in Los Angeles, California, in 2022.\n\n\n\n\n\nAhead of the fifty-third edition of the Sharjah Biennial, the Grand Mufti of Jerusalem, Asif Ali, issued a statement on Monday calling for an end to the coronavirus and urging the United Nations to intervene to prevent the spread of the disease. “In the name of humanity, in the name of the future of our children and grandchildren, and in the name of the Holy Places, I call for an end to the coronavirus and for a comprehensive international health strategy to protect humanity’s future,” the statement reads.In a rare move, Ali condemned the coronavirus virus as “a serious public health emergency.” It is the first time the Grand Mufti has publicly addressed the virus and its potential causes. Ali, a professor of", "The next Biennial should be held sometime in 2020, the end of the year, and in the spring. The long-term goal is to have the exhibition running every two years. The many drafts of the theme-neutralizing drug Diclofenac have drawn criticism from critics and politicians across the world, who question whether the jury should have selected an artist whose work will be mistaken for that of a permanent work by the museum.The institution is now facing a lawsuit from the citizens of Hong Kong, who are demanding that the exhibition be canceled. “We are currently in discussions with our legal advisors regarding the implementation of the court’s opinion in the case of the exhibition,” B.A. Biennale told the Art Newspaper. “We are actively reviewing all possible legal options.”The museum will respond to the jurists’ verdict with a joint statement with the Hong Kong government on August 24.\n\n\nThe Davis Museum in Oakland, California, has appointed Andrew S. Berger as associate curator of modern and contemporary art. Berger was hired to head the museum’s exhibition program following the departure of curator Sean Deckard, who stepped down to take up a post at New York’s", "The next Biennial should focus on the history of Pérez Art Museum, and could take place within twenty years. It will then present a list of twenty-five artists whose work is currently on view at the museum.\n\n\nFollowing the 2020 Beijing Olympics, which marked the reopening of a swathe of unfinished, largely unused, and underused buildings in Beijing, China, the Beijing Art Museum has announced plans to begin welcoming visitors once again. The announcement marks the second time the museum has embarked on a reopening strategy in the past twenty-four months. In March, the museum announced that it would open in May.“The Beijing Art Museum is ready to reopen and gain new visitors in the coming months,” said museum director Wu Xiaoming. “We will continue to build on the Museum’s reputation as the most visited art museum in Beijing and the city’s cultural district, and enhance the Museum’s public appeal and the museum’s facilities in order to build up its current capacity.”Wu Xiaoming added that the proposed reopening of the museum would not be a “major setback\u0097it would be a chance to reassess and refocus the Museum’s exhibition programs.", "The next Biennial should be held in 2022, and the most recent edition should be held in 2022-2023. The theme will be “The Under-Representation of Women in Art,” which will be curated by Johanna Böke. Speaking at an Artforum event in New York earlier this year, writer and curator Susan Faludi described the event as “a process of nourishing a body of research and theory that is open to critique but is also open to reflection and reflection is a process.”The selection committee said: “It is an honor to organize this year’s Biennial. We are eager to present the work of both women and men as well as deepen the scope of the exhibition in ways that present an opportunity for the show to reflect and expand on the most recent decades of contemporary art.”The 2019 Biennial, titled “Under the Skin,” featured work by twenty-seven artists, and the 2010 Biennial, titled “Real Life and the Body,” featured work by twenty-eight artists.\n\n\nThe restoration and expansion of the Museum of Modern Art (MoMA) in New York has taken another major step forward thanks to a $50 million gift from", "The next Biennial should be held in 2021. The first iteration, “A∞” (2019), featured works by fifty-four artists and twenty-three other groups. \n\n\nThe Institute of Contemporary Arts (ICA) in Paris just unveiled a new collaboration between French and international artists, including Pierre-Auguste Renoir and Helene Büttner, with an aim to increase the visibility of the French-American art of the twentieth century. François Desmoulins, the director of the institute, said: “The project A∞ will allow the audience to experience and know the work of American and French artists in the same space. By connecting a studio to the ICA in the heart of Paris, we aim to create a new kind of destination for international visitors to the ICA, one that will be part of a larger cultural community.”The exhibition, “American Art: From the ICA to the American American People” (2017–18), will be located in a museum dedicated to the art of the twentieth century and will feature works by seventy-two artists, including Benito Cervantes, Îmara Flores, Gustav Klimt, Sebastian Kandel, Luis", "The next Biennial should take place in Tokyo in the spring of 2021, and will be presented by the Museum of Fine Arts, Japan.  The exhibition will include works from MoMA, the Museum of Modern Art, the Museum of Modern Art Japan, the Museum of Modern Art Los Angeles, and the Museum of Contemporary Art, Tokyo. The exhibition will also include a range of new works by Susana Zúñiga, Natalie Johnson, Igor Edgerton, Rajiv Gandhi, Tina Turner, Franz Kafka, and Jean-Luc Godard. The 2020 prize jury comprised Hiroko Sadao, Masahiro Hagi, and Kiyota Nakamura. The 2019 prize jury comprised Nina Levin, Daniela Leon, Susan Pfeifer, and Jessica Stangley.  The previous awards ceremony was held in New York City in April 2019.\n\n\nThe French government has released a statment declaring its intention to establish a national museum dedicated to the art of modernism and antiranism in the country. The museum is slated to open in 2022. French President Emmanuel Macron made the", "The next Biennial should take place in Berlin in 2021. The next edition of the Biennial will be held at the Berlin Art Museum (BAM) from May 7 to May 8, 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has received a gift of $5 million from the philanthropists of the Los Angeles–based organization the Whitney Museum of American Art. The gift includes $1 million for the creation of an endowment fund to support the ongoing education and preservation of the Whitney’s collection in perpetuity.The $4 million gift is also one of the largest ever received by the museum in its history. Since its foundation in 2011, the fund has supported the education and preservation of the collection, and helped to raise the funds for the construction of the Whitney’s first building and the upkeep of the collection.“The gift represents a new era for the Whitney Museum of American Art,” said Whitney director Michael W. Kelley. “This is an extraordinary gift to the museum, the Los Angeles area, and the nation from the Lerner family, and we’re grateful to the museum and to the museum’s board for the kind gesture that will ensure that this momentous collection, which", "The next Biennial should take place in 2021. At this point, the museum will continue to display the works of the most celebrated female artists in the world, including Valeria Navarro, Dora Cortés, Alice Ailey, Barbara Maguire, and Anna Atkins.\n\n\nNancy Drew’s “Annie Hall” has received a major reinstallation that will expand its reach by adding more than a hundred works by the late American artist and feminist theorist Simone Leigh. The work, which was displayed last year at the Museum of Modern Art in New York, will now be exhibited with new archival materials and new multimedia works by Leigh and will embark on a series of trips to her home country of South Africa.The upcoming exhibition, which will be titled “Simone Leigh: The World I Made” and will run from February 3 to March 16, 2020, will include interviews with artists, scholars, historians, activists, and activists who were close to Leigh and who are represented in the exhibition. “The new exhibition will inaugurate a new chapter for the exhibition, which has been underway since 2014, by incorporating the works that have never before been exhibited in an exhibition of this magnitude,. It will also introduce", "The next Biennial should take place in the spring of 2020. \n\n\nThe National Museum of Fine Arts (MoFA) in Kansas City, Missouri, has received a gift of seventy-six works by artist Ai Weiwei. It is the latest major donation from the museum, which was founded by wealthy industrialist Warren B. Kanders in 1977.The gift includes works by artists such as Martha Graham, Robert Irwin, and Susan Phillips, among others who are often considered classical figures but were often neglected in favor of the mid- to late-twentieth century.“For seventy-six years, Ai Weiwei has been the outstanding supporter of the National Museum of Fine Arts, which has been dedicated to the art of the twentieth century,” said museum director John Gill, who serves as chair of the museum’s board of trustees. “This gift includes works that have gone unseen or underappreciated by a great many of his contemporaries, yet which have the power to make them into central themes of his artistic life. I’m thrilled that he has found a home at this museum.”The gift was made in honor of the artist’s eighty-fifth birthday and is the culmination of a five-year", "The next Biennial should focus on the emergence of new forms of art and culture; on the process of political domination, cultural exclusion, and the reproduction of power structures; and on the history of the exhibition.  \n\n\nThe museum’s collection of more than four thousand works has been moved to a new home in the Walt Whitman building, which opened to the public in 1971. The newly renovated building, which hosts an exhibition of work by artists such as Frank Stella, Robert Irwin, and Robert Frank, was completed in 2017 and is currently undergoing renovations. The new collection comprises works from the collection that were on display in the former William Wyler Building on the campus of the University of California, Berkeley, from 1947 to 1970, as well as works on paper, photography, and sculpture from the 1960s to 1990s.“In the current cultural moment, the Whitman collection is at a turning point,” said curator and director Elizabeth Ann Macgregor. “The Whitman building has been a success story for the museum, producing recent exhibitions that have touched on the importance of contemporary art in a way that has not been possible before, and has been a model for how a museum might be managed. Now, with the Whitman Collection moving into a new", "The next Biennial should be held in 2021. The director of the museum, Richard Armstrong, said: “The new research, which will provide context for the exhibition, will introduce new perspectives and to engage with themes that are paramount to the exhibition.”\n\n\nThe Museum of Modern Art (MoMA) in New York has released the list of the seventy-five artists who have been selected to participate in the second edition of the National Biennial on American Art. Set to run from March 23 to March 26, 2020 in Washington, DC, the exhibition will feature works by forty-nine artists across eighteen cities, including New York, Los Angeles, and New Orleans, and will feature work by eighty-eight other artists, including John Currin, Justin Fries, Terrence Reid, and James Turrell, and a selection from the artist’s studio.The biennial will also feature a new residency program, a retrospective of a work by Sargent’s Daughters and a presentation of work by artists who have chosen to remain anonymous. The residency will be a joint initiative of the museum and the artist’s union, the Artists’ Union, and will involve returning artists in exchange for a residency in the museum. The", "The next Biennial should take place in October 2020, followed by the exhibition in February 2021.\n\n\nNew York: The Metropolitan Museum of Art (MoMA) in New York has received a $6 million donation from the estate of Charles and Edith Koch. The move will allow the museum to open a new $1.2 billion research center dedicated to the collectives of American art and to expand the museum’s collection by five hundred works. The donation also includes $350 million for the expansion of the museum’s collection in terms of art and artifacts, and $115 million for the acquisition of works in the Tate’s collection.The Metropolitan Museum of Art is currently working on a new $1.5 billion expansion, which will include the construction of a new 250,000-square-foot research center and increase the museum’s exhibition space by 150,000 square feet. The project is currently being led by architect Peter Zumthor and will be overseen by architect and collector Peter Zumthor & Associates. The new space will also include two galleries, a library, a research library, and a café. The extension of the museum’s exhibition and public realm will be supported by a", "The next Biennial should open in 2021 and conclude in 2022. The show will be held at the museum’s newly renovated Manhattan outpost, which will be renamed the Solomon R. Guggenheim Museum.\n\n\nThe National Museum of Women in the Arts (NMNA) in Washington, DC, has hired longtime curator Mary Clare Hennessy as its next director. Hennessy will assume her post on March 3.“Mary has been one of the museum’s most important and consistent creators,” said Amanda Hoberman, the institution’s director. “In her extraordinary professional career, she has helped shape the museum’s curatorial approach, has been instrumental in the museum’s transition from an off-site outpost to a permanent, multi-million-dollar building, and has been a valuable resource to the museum.”Hennessy is the director and cofounder of the nonprofit Creative Futures, a national network of curators and artists. She has been a curatorial assistant at the museum for two decades and serves as an adjunct curator. She began her career at NMNA as a curatorial assistant in the department of media and performance art. She then became a curator at the Museum", "The next Biennial should be held in the fall of 2019. The exhibition will return to the city of Riga to mark the occasion. The exhibition will also be staged in other countries such as the United States, Austria, and China.\n\n\n\n\n\n\nMuseums in the Republic of Georgia and the Republic of Belarus are moving their upcoming exhibitions in line with the production schedule of local television channels in the countries where the upcoming exhibitions will be held. The announcement follows the announcement that the forthcoming 90th anniversary celebrations of the Soviet Union and the Soviet-era regime will be held in February and March. According to the New York Times, the country’s cultural sector is being put at risk by the shutdown of the country’s main television stations, which have been severely malnourished by the coronavirus.The exhibition, “Russia: From the Shadows to the Dawn,” was meant to highlight and explore the legacy of the country’s former ruler, Alexander Lukashenko, who launched the Soviet Union in 1991. However, the government instituted a blockade in 2015, and the exhibitions were pushed back several times. Since the government was unable to pay the artists, the artists were forced to withdraw their works from the", "The next Biennial should include a survey of the relationship between art, culture, and race and should examine the ways in which art and culture have been affected by intersecting racial and economic tensions and racial narratives. The theme of “Race and Culture” should be based on the idea that art and culture are not discrete entities that exist in their own right but can be understood as a kind of social fabric. The biennial should address how race and culture have historically been conceptualized, represented, understood, and reported.“Themes of race and culture are a way of articulating the history and the legacy of the African diaspora in South Africa,” Michaëla Mor, chair of the committee, told the Art Newspaper. “They are a way of bringing together and describing the interconnections and interdependence between South Africa and the rest of the world. This should be a moment of celebration for South Africans.”The committee made its recommendation to the council and chair of the Biennial, the artist and curator Kami Naidoo, after they were briefed on the biennial’s proposal by the South African government. The government decided to award the biennial $3 million for designing and building the exhibition space for", "The next Biennial should also include a discussion of the legacy of the artist and how it can inform and challenge contemporary life. Marta Lubrada-Young, director of the Museo del Palacio y Poder Project, is also keen to highlight the work of Japanese artists of the '60s and '70s.“Using modern and contemporary techniques, the exhibition will critically examine the relationship between contemporary art and the art of the future,” said Lubrada-Young. “With the upcoming exhibition, we hope to re-establish the link between art and the future.”The 2019 edition of the show will run from May 8 to May 10, 2019. The first show, “Anesmus and the Future,” was held at the gallery in Haarlem, Netherlands, from February 29 to March 3, 2019. The show included artist performances, panels, a book signing, and a film based on an essay by the artist Sala al-Khalili. The show, a twenty-five-minute video installation made in collaboration with the artist, was presented at the inaugural edition of the Institute for Contemporary Art Amsterdam in February.Kalev R. Hauser, who has worked as a curator at", "The next Biennial should be hosted in the fall of 2020.”Binart, who recently became the first person in the United States to be granted tenure at the Art Museum of Chicago (AMC), said: “In a time when the museum is losing an estimated $10 billion a year on lost revenue and declining attendance, I feel it is my duty as a professional to continue to push for greater access to the art I see. I am pleased that AMC trustees and staff are committed to supporting a future exhibition series that will address this critical issue.”\n\n\nThe Museum of Fine Arts (MFA) in St. Louis, Missouri, announced today that it has received a donation of $1.3 million from the John F. Kennedy Foundation. The gift follows the acquisition of one of the largest private holdings of Salvador Dali’s work, the works at the MFA, which were organized during the late artist’s lifetime and are stored in a vault in the museum. The gift also includes works by Paul Gauguin, Ternaux, David H. DeForest, and Otto Ludwig.“The museum has long been a platform for the legacy of Salvador Dali,” said MFA director Christ", "The next Biennial should be held at the Metropolitan Museum of Art in New York from November 20 to November 22, 2020, and the first at the Hirshhorn Museum in Washington, DC, from February 16 to March 9, 2021. The 2020 edition will again focus on feminisms and will feature work by the work of twenty-four artists. The 2020 edition’s curators are Aja Jawad, Jodi Throckmorton, Joona Usovu, Richard Shagren, and Siavash Senthujan, with design by Andrew Kreps. The 2020 edition will receive a $50,000 grant from the Andrew Kreps Foundation.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines for the distribution of more than $7.5 million in funds made by the JP Morgan Chase bankruptcy restructuring plan, which has forced major cuts at the arts and cultural sector throughout the United States, including New York City’s Metropolitan Museum of Art and the Metropolitan Opera House.The guidelines, which were issued on January 28, 2020, and are dated March 21, 2020, are part of a $9 billion restructuring plan that will be adopted by the city as part of its", "The next Biennial should take place in 2021.\n\n\nThe Carnegie Museum of Art in Pittsburgh has announced that artist-in-residence Michelle Branch will be the next chair of the newly formed Arts and Cultures subcommittee at the museum. Branch, whose practice encompasses design, film, sculpture, and installations, was selected by an independent panel composed of art historian and curator Dr. Nicholas Cullman, a professor of art history at the University of Pennsylvania, and artist-in-residence of Carnegie Mellon Art Gallery curator Niccolo Machiavelli.“We are thrilled that Michelle will be joining our growing list of curators and scholars to explore the work of female artists in the United States,” said curator and board president Timothy Potts. “Their diverse practices, whether it is creating work through a painting, video, or installation, remind us that female artists have made central contributions to the art of their respective fields. Their work will strengthen the next year’s collection and future exhibitions, as we continue to present work by women as essential to contemporary art.” \n\n\nThe Metropolitan Museum of Art in New York has launched an online online portal that will allow visitors to view the works of forty-five internationally acclaimed artists in its collection", "The next Biennial should be held in the spring of 2021.\n\n\nThe New Museum in New York is seeking six artists for its next exhibition, titled “In Praise of the Thes: A Retrospective,” which is slated to open on December 20. The retrospective will be organized as a virtual boardwalk through the New Museum’s acquisition of the works of thirty-three American photographers from the 1960s through the 1980s. Among the works to be displayed are photographs taken by Betty Parsons, Robert Frank, Robert Mapplethorpe, Robert Irwin, and Robert Frank & Edie Sedgwick.“Thes: A Retrospective is a visceral, historically informed exploration of the work of thirty-three American photographers from the 1960s through the 1980s,” said director Nicholas Roeg. “Frederick D. Hillman Jr. is an exceptional artist whose work is as relevant today as it was when it was created. His exploration of American photography as a whole, and the evolution of his own practice, is considered quintessential American.”Hillman’s work, which spans photography in the 1970s through the 1990s, is often compared to that of his hero Peter Kropotkin,", "The next Biennial should be held in early 2022, after which the museum will return to the drawing board with a view to reopening within the next three years. Its current exhibition, “The Birth of Modern Art” will resume on the museum’s campus in September of 2022.The reopening of the museum coincides with International Women’s Day, which recognizes the contributions of women to society and strives to advance the cause of women’s rights. The memorial day observance coincides with the fiftieth anniversary of the museum’s construction. Since its founding in 1962, the museum has staged more than 2,500 exhibitions and has welcomed more than three hundred thousand visitors. The institution recently celebrated the occasion by naming the museum after Ethel and Donald Ethel and their children.“The museum is a microcosm of American art,” said James Cuno, the president and CEO of the museum. “It’s the latest incarnation in a long list of institutions dedicated to women, and a reflection of the millions of women who have shaped and shaped the history of art.”\n\n\nThe National Gallery of Canada has announced that the first phase of the privatization of its collection, which was recently completed", "The next Biennial should take place in the autumn of 2020. The next edition of the Biennial, which will take place in October 2021, will also be a retrospective. Its first showpiece, a new digital exhibition that will explore the work of the artist Gerald K. Williams, will be held twenty-four hours a day and will run for forty days. Kendra Johnson, the executive director of the Biennial, told the Art Newspaper: “This year we are excited to present a new story line for the exhibition series, new works presented by selected artists, and we are looking forward to the first show of the new partnership, ‘The Ergonomics of Cinema’ ,” with a view to celebrating the 40th anniversary of the Biennale. \n\n\nThe National Gallery of Victoria in Melbourne, Australia, has appointed Jason T. Walker as its new deputy director. Walker is currently the director of the University of Pretoria’s Centre for Advanced Study in the Humanities, a graduate program which aims to provide a platform for contemporary art and intellectual inquiry. He succeeds John F. King, who retired in August 2019 after eleven years at the helm of the museum.“Jason has a distinguished record of", "The next Biennial should take place in 2020.\n\n\nPittsburgh’s Pérez Art Museum (PAM) is revamping its collection for its upcoming twenty-third edition, which will focus more heavily on contemporary art and artmaking from within the region. The institution will also begin selling works by the region’s leading contemporary artists, including William Kentridge, Edward Kienholz, and Jerry Salt-Louis. The museum will also introduce a new performance series, “Pianist and Sculptor,” but no further details about its new program are available at this time.The museum will also unveil a new spin-off show, “POWER PERSONS,” which will feature works by twenty-six artists who are part of the region’s Pendergast Collective and will run from January 26 to March 7. The event will also introduce several new galleries in the Pittsburgh region, including the Contemporary Art Museum, PAM, and the Metropolitan Museum of Art, and will feature interviews with Sidney Cecil, Alice Cosgrove, and Harlan Kasper. The show will be curated by Cheim & Read, which is based in Pittsburgh.\n\n\nThe P", "The next Biennial should focus on the history of the museum’s collection, “from its inception to the present,” said Firoz Shah, the director of the Boston Museum of Art and the curator of Modern Art, and Nicola Adams, the curator of Modern Art and Design, at the organization. The exhibition should also include a new public sculpture, a photo-realistic reconstruction of the new museum’s interior, and a new collaboration between the museum and the Israel Museum of History.\n\n\nAmerican painter Lee Krasner, the celebrated creator of several iconic works, including The Star-Spangled Banner (1948), which took forty-eight years to complete, and Death on the Nile (1953), which depicts a Parisian street, which is lit by a single star, have had their national treasuries reopened since the pandemic began in earnest.According to Artnet, the opening of Krasner’s home state of Alabama has been celebrated with a new exhibition, “Afterlives,” which opens at the Moore Art Museum on March 3, and the Mississippi Museum of Art, which opened on April 6. In both cases, the institutions were able to welcome visitors at no", "The next Biennial should be held at the Miyazaki-Konohama Museum of Art in Tokyo. It is currently unknown when the next will take place. The next Biennial of Letters will be held in September 2020. The next will be held in September 2021. The next Biennial of Visual Arts will be held in September 2022. The next will be held between January and March 2020. The next will be held in October 2020 and take place in November 2020 to March 2021.\n\n\nThe British Museum in London is preparing to welcome visitors back to the institution on February 20, 2020. The announcement marks the first time the museum has acknowledged the possibility of reopening after it closed permanently in January 2019 because of the pandemic. The announcement follows a decade of campaigning for the institution to reopen, led by the British Museum’s former director, Sir Nicholas Cullinan, who oversaw the museum’s reopening in 2016, and was prompted by the prospect of “helping people move back and forth across time and space,” the museum’s former chief executive, Melanie Phillips, said in a statement. “We really have never closed a museum permanently but we are now entering a phase where", "The next Biennial should take place in 2021 and will be the eighty-seventh edition, title The American Intersection: From Art to Art History (2019), at the Museo de Cultura de São Paulo.\n\n\nThe J. Paul Getty Trust and the Seattle Art Museum (SAM) have teamed up to create a $50 million fund for the preservation and future care of the Getty’s collection of more than one hundred works by artists whose works have been donated to the trust as part of a series of landmark collaborative projects that began in the 1950s.The partnerships were announced today by chairman and CEO Michael Getty. The funds will provide incentive support to museums and other cultural organizations that are working to secure the future of the Getty’s collection through the assistance of the Getty’s Getty Trust, which is currently working with two private collectors—Bishop and David K. Barnard—to develop a plan for the donation of works by poets, musicians, dancers, writers, architects and designers and will launch in 2020.Each January, the trust will announce a series of milestones that will honor the milestone years of the Getty’s collection. Among the works that will be featured in the 2020 exhibition are Bertolt Breit,", "The next Biennial should, I believe, be in December 2022. That should be the date to which the Mumbai Architectural Biennale will commit itself. The exhibition will also include a literary prize, a performance programme, and a biennial on performance art. The biennial will be organized as a double exhibition, with the exhibition “Mumbai 2020: From the Future to the Present” as a double-show. The exhibition will feature the work of eighty artists and will be curated by the Ganesh Visvesvakarma, the director of Keralite Arts, Mumbai. The submission deadline for the exhibition was March 31. “I’m looking forward to working with Boni as a platform for engaging with the current zeitgeist and to working with the international community to shape future visions for Mumbai,” said Andrea Boni. Commenting on the exhibition, the sixty-nine-year-old American said: “I’m excited to collaborate with Boni, the legendary architecture and design visionary, to create a show that brings together the best art and architecture from the past and present to tell the story of architecture, design, and design, and architecture.”\n\n\nThe", "The next Biennial should be held in 2021, but it will be staged at different times depending on the weather, Kunthakker and his colleagues said.\n\n\nThomas Paine, the British artist and writer most associated with the term 'Post-Modernism', has died. He was ninety-three years old.Born in London in 1932, Paine began his professional career in the 1950s as a painter in a branch of the Tate. In 1951, he became the first artist to join the Tate’s Board of Directors, succeeding Aldous Huxley. In 1962, Paine moved to the Meadows Museum, where he continued painting, and soon found his own niche as a writer. Paine’s art has been collected by the Tate, the London Foundation, the Tate in Tokyo, the Museum of Modern Art, and the Museum of Contemporary Art Paris. He was the first British artist to win the Prix d’Art Moderne in Paris in 1974, the same year he was awarded the Nobel Prize in art. In 1983, the same year Paine won the Prix d’Art Moderne, the Tate commissioned his work The Paper Throne, 1967, an 11,300-piece monumental monolith, which was installed in", "The next Biennial should be held in the spring of 2021, and should be the world’s largest, with an initial group of forty to fifty artists. Its opening is slated for September 11, 2024.\n\n\nThe National Gallery of Art in Washington, DC, has received a gift of more than three thousand photographs by American photographer Anne-Marie DeSousa. The institution, which was established in 1921, is the latest cultural institution to receive the gift, which was donated by a collector and collector’s son. The gift was made during a private sale at the gallery in June, during which time Michelangelo Antonioni, the director of the Rossini Museum in Venice, held a private viewing of the works. The sale also included works by Silver in the 1960s and Silver in the ’70s.“The collections of the National Gallery of Art and the Institute of Contemporary Art are among the most important collections in the United States,” said museum director Matthew Teitelbaum. “These key early works are a testament to a distinguished curatorial career and an example of the gallery’s abiding ambition: to build on the museum’s considerable reputation by producing works that reflect the spirit and vitality of the", "The next Biennial should be held in early 2020. In addition to the exhibition, the next iteration of the theme “Avant-Garde in the Contemporary World,” will be held at the Museum of Modern Art, in Chicago, California. The exhibition will run for twelve weeks and will include works by forty-seven artists, including Carl Adler (New York), Aline LaBouvier (New York), Michael Peck (New York), Pierre-Auguste Renoir (New York), and René Muholi (New York).The forty-third edition of the Biennial will be held at the Museum of Modern Art in New York from March 23 to March 30, 2020. Event director and curator Adam D. Baratz said: “The exhibit is not only a defining moment in the history of the Biennial; it is the first time it has been staged at such an extraordinary institution. We are especially proud to be celebrating the opening of the series with the opening of the new section ‘Avant-Garde’ at the Museum of Modern Art. Its curators, the artists, and the staff of the new pavilion have made an indelible mark on the Biennial. We are eager", "The next Biennial should be held in 2021.<|endoftext|>Milan Kundera, who amassed a storied career as a photographer whose work explored the relationship between modernism and postmodernism, died in New York on Friday at age eighty-nine.Born in Rome in 1931, Kundera moved to New York in the 1940s and became a member of the radical Post-Impressionist movement, which sought to reshape the city’s art. He later relocated to Brazil, where he began his series “Modernism and Post-Impressionism” (1966–69), which explored the rugged, experimental, and subversive relationship between painting, photography, sculpture, and photography’s relationship to urban life. The series was a precursor of the later “between the and” series, which examined the possibility of postmodern texts displaced by urban life.“Milan Kundera is one of the few photographers who is still alive who has been able to experiment with photography in the same way every day he photographs—in the same way he photographs everything,” Richard Fung, a curators at the Museum of Modern Art, told the Art Newspaper. “Strictly speaking, he is not photographing anymore", "The next Biennial should take place in the fall of 2019.\n\n\nA group of artists and activists are urging the French government to establish a national museum dedicated to the African diaspora in Paris. The proposal was made in a statement by the artists and writers Nokuya Ndzube, Pascal-Olivier Beaufils, and Hélène Bénétière in the lead-up to France’s annual Independence Day celebration last weekend. The statement reads: “France is a country of national myths, of which we are a part. The history of our nation is a history of people coming together. A museum dedicated to people from Africa, Asia, and the African continent would distinguish itself from the national museum. A museum dedicated to the African diaspora would serve as a model for democratic societies.”The statement was signed by Ndzube, Beaufils, Naila Boubacar, and Amane Jendey. They are coauthors of the upcoming book The African Diaspora: A Historical Survey, which is scheduled to be published by University of Minnesota Press in August. The book is slated to be followed by a monograph on the African", "The next Biennial should take place in 2021 and the first in 2024. In the meantime, organizers are working on developing more robust programming that can be delivered through a multiplicity of platforms, including Sky Arts, the artist-run nonprofit platform that was recently acquired by Google in a deal that valued the company at $24.5 billion; and K1; an artist-run nonprofit platform under construction in New York and Paris. Atlassian, which has branches in New York, London, and Shenzhen, is also exploring ways to get the works of emerging and established artists into the public sphere.  For the awards ceremony, which was organized by the New York-based nonprofit Prada, the artists selected were Felicity Hammond, Mrinalini Pal, and Yinka Shonibare. This year’s awards ceremony will take place at the Museum of Modern Art in New York on October 31 and will feature performances by artists such as Jenny Holzer, Kate Mulgrew, and Jocelyn Wu.\n\n\nThe Australian company that owns the rights to a famous painting by the Australian artist Ed Moses’s The Wretched of the Earth has agreed to pay $1.2 billion to settle dozens of lawsuits brought by the", "The next Biennial should be up in December.”The museum was also ordered to pay $9.5 million to the families of Yasmin Malik, a British Columbia, Canada born, French Canadian, artist who was one of the earliest to use the phrase “biennial” in reference to a new exhibition venue. The first said the institution was creating a “biennial” of contemporary art; the second, a “incomplete, yet meaningful, biennial of ethics.”The sum is the largest sum the museum has ever paid to a single family. The terms of the settlement are confidential.\n\n\nThe Egyptian Museum of Art (EMAM) in Cairo has awarded a group of thirty-five artists scholarships to the 2020 edition of the Cairo Art Summit. The event, which will take place in the newly restored city of Tadmor, between January 8 and January 13, will be hosted by the Egyptian government, the Royal Academy of Arts, and the Egyptian University. Among the seventy-six artists selected by the group were Salah al-Duwezel, Raneem Farsi, Aref al-Qasimi, Ahmad al-Tamimi, and Ahmad al-Tamimi, and will each receive an", "The next Biennial should be this fall. A spokesperson for the festival told the Art Newspaper that it will \"do everything we can to support the museum’s staff and its work in the best possible way.”The institution has faced its share of challenges since its opening, with several accidents, including a tragedy involving a sickly 11-month-old infant in 2004, and the death of Steven Basiago, who was eighty-eight when he committed suicide in his Manhattan apartment in 2007. However, it has notably avoided a tragic loss of life and has been able to hold its annual gala in the winter months, so, in theory, it should be able to withstand the impact of the ongoing coronavirus outbreak.\n\n\nAs the coronavirus outbreak drags on, major art institutions across the globe are slashing their workforces in an attempt to reduce the number of deaths and illnesses caused by the virus. According to the New York Times, art workers in the United Kingdom are making the most of a 30 percent drop in sales, a 40 percent drop in income, and a 47 percent drop in donations. While the average art dealer will see their income rise by $42,500 in the first year of a voluntary work", "The next Biennial should take place in 2021, and the twenty-eighth in 2024. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has announced that it is reopening to the public on March 7. The reopening date coincides with the nation’s National Day of Remembrance, which will mark the seventeenth anniversary of the September 11, 2001 terrorist attacks. A retrospective of the work of Michael Resnick, “Tearing Down the Twin Towers,” will also be staged at the museum.“Today, we are reopening to the public as a nation that is more united, more hopeful, and more optimistic than at any time since 9/11,” said Richard Armstrong, director of the museum. “This is a moment of great change for America and we are ready to take it in stride.”According to the Los Angeles Times, the reopening date for the Museum of Contemporary Art is also a day later than the official goal of opening the institution by the end of April. The institution previously announced that March 28 as its reopening date.\n\n\nThree hundred activists, artists, policymakers, and other cultural workers are launching a campaign to save the life and health of Eric", "The next Biennial should mark the twenty-fifth anniversary of the award. The committee is currently finalising a new biennial programme for the festival.\n\n\nPlans to house an exhibition of new works by the late Los Angeles–based artist Ruba Nery began to crumble last week when it was announced that the venue would be moved to a new location in the City of Angels.Called the Ruba Nery and Myrtches Kupusti (Ruba Nery and Myrtches Kupusti, Myrtches Kupusti) New York, the exhibition was to take place at the Turner Contemporary between November 3 and November 5, 2020, and would have featured works by twenty-six artists. The artist-run space, which was shelved by the Los Angeles County Museum of Art (LACMA), announced on Wednesday that it would cancel the exhibition and relocate the exhibition to the California Institute of Technology (Caltech).The New York Times reports that the center’s director and CEO, Rebecca Kallman, was forced to resign after she said that the move was not related to the takedown of a work in the exhibition, a collaboration between the artist and the artist’s daughter, Miranda.", "The next Biennial should be on the ground floor of the museum, with the aim of bringing together a network of curators and artists from different fields to form an urban garden in the museum, with the hope that the exhibition will become a model for education and dialogue between the city and the surrounding region, as well as a symbol of contemporary urban life.”The biennial takes place in collaboration with City of London Museum of London and the City of Manchester, and will feature more than ten thousand works. The museum will also present a new exhibition of work by the British artist Paul Gauguin, “The Spider and the Sparrow,” which will run across six floors of the museum. The exhibition will launch with a live performance by British duo Spoon and Niles, who portray the experimentally sensitive life of a lifeguard at a summer camp. The work will then unfold as a series of narratives by the artist set to the music of Radiohead, creating a hybrid of art and pop.The exhibition will also include a new collection of ethnographic photographs by the American artist John Turner, which will be organized by the artist’s son, John Turner, and will be on view in the exhibition’s fourth phase at the", "The next Biennial should be held in the autumn of 2021, and the next will be held in the spring of 2022.  In a statement, the biennial said that its inaugural edition “will be a challenging and groundbreaking introduction to a new form of art, the most innovative approach to artmaking that has ever been attempted.” The exhibition will feature work by thirty-six contemporary artists, including Antony Gormley, Felix Chisora, Alice Gormley, María Inés Garcia, and Yinka Shonibare.\n\n\nThe Museum of Fine Arts (MFA) in Atlanta has announced that it is expanding the curatorial team of Laura Mulvey, architect of the Museum’s new three-story building, to include a curator of contemporary art. Mulvey is also a cofounder and director of the Georgia–based nonprofit the Urban Forum.Under the leadership of veteran curator and art historian Doris Duke, Mulvey will now be responsible for coordinating with a rotating cast of curators, architects, artists, writers, and other experts to present a wide range of exhibitions and events. “Laura’s longstanding expertise in contemporary art and her ability to bring it to life, both in creating and", "The next Biennial should include an exhibition of work by the long-neglected, Diana Johnson-Klaus, and a presentation of works by the late artist and activist Ana Mendieta, and will be held on the same date as the show, on the same floor, at the same time.” After the historic event, which will be followed by the museum’s reopening on May 21, the Biennial will host a special exhibition of work by the newly appointed director, Monica Vincent. “This is one of the most important moments in our history,” Vincent said. “We are committed to the exhibition of the last exhibition of Diana’s work and have a detailed plan to present it on our website, in the museum’s gallery, and in the gallery of the Biennial of London, which is already in place. We have been working on this exhibition for some time, and I am proud to have led the exhibition of her work at the Biennial of London. Her work is widely known, admired and copied in the United States and internationally, and her art has been collected by numerous museums in the US and Europe.”In the lead-up to the inaugural exhibition,", "The next Biennial should open in 2020. The next Biennial should include artists from all over the world. It should cover a wide range of contemporary art. It should be organized by a committee of biennial directors and artists. It should not be self-organized. The theme should be “art and its possibilities.”The 2019 edition, “For Whom the Artful,” featured work by forty-two artists, including Sara J. Jones, A.J. Smith, and Mikko Taccone, and was organized by the San Francisco Museum of Modern Art. The biennial, which was inaugurated by an exhibition of work by George Condo-designed hotels in the Bay Area and followed by further presentations of work by artists such as Richard Diebenkorn, John Edwards, and Lita Laszlo & Toni, was nominated for a Pulitzer Prize.\n\n\nThe National Galleries of Scotland are planning to break ground next month on a new collaboration between artist-run organizations and the institution, which has been working closely with the Edinburgh Festival for more than a decade. Previously, the Galleries of Scotland partnered with the National Poetry Library and with the Scottish National Arts", "The next Biennial should take place in the year 2020, in Rio de Janeiro, Brazil. In the coming months, the exhibition will also hold the first-ever presentation of work by twenty-one artists from LaGuardia and the Metropolitan Museum of Art in New York, and will feature work by artists who have been selected for the 2020 prize, which will be presented at a ceremony at the Met in March.The next exhibition will be conceptualized as a microcosm of the contemporary West. It will highlight the work of thirty-four young artists, including Julia Salomons, Jatin Saar, Ya-Lin Zhang, and Ian Watson. The first show, “Dreamers of the West,” will open at the National Museum of China (NMO), Beijing in March 2020. The exhibition will then travel to the Kunsthalle Stuttgart in September 2020, and will be presented by the Kunsthalle Basel in March 2021. The second show, “The East and the West,” will open at the Nurova Gallery in Beijing in April 2021. The exhibition will then return to Venice, and will be presented by the Kunsthalle Stuttgart in August 2021. The exhibition will also return to New York", "The next Biennial should take place in March 2021, at the newly renovated National Museum of Art in Washington, DC. The 2022 edition of the exhibition will be hosted by the National Geographic Society in Seattle.\n\n\nAmerican artist Richard Serra has been selected to represent the United States at the Fifty-Ninth Venice Biennale in May 2020. The 2014 recipient will be presented with a plaque in the exhibition hall in the United States of America at the opening of the Fifty-eighth Venice Biennale in January 2020 and will be presented with a $250,000 prize. The artist is considered one of the most important twentieth-century painters, working in a style that is characterized by its continued experimentation and the ability to change and adapt to meet changing social and intellectual conditions. The honor of presenting the work of American artists to Europe dates back to 1978, when the work of the New York–based artist Gregory Johns was included in a retrospective at the Paris Salon Francaise. Since then, American artists have been awarded the American Artist Award for forty years. The next pavilion will be Art of the Century, the biennial that commemorates the twentieth century. The 2019 winners included the works of Ad Reinhardt, Dine", "The next Biennial should take place in September 2021, the same month as the September 2020 edition of the Kunsthalle Basel. The exhibition will present programmes by artists such as Marc-Olivier Bassat, Olu Oguibe, and Olivier Ghent, and will be organized as a platform for dialogue between the artist center and the public.\n\n\nCinema Now: UK’s special cultural fund for arts and cultural productions. The scheme was launched in 2018 to compensate for the impact of the Covid-19 pandemic on the arts. Each year, the scheme distributes $45,000 to help artists, curators, writers, publishers, performers, and other artistic workers in the UK cope with Covid-19-induced unemployment.The Arts Council England (AC), the UK’s national arts and cultural charity, said: “Covid-19 has made vital and often unexpected progress in helping arts professionals through this crisis. We are grateful to the public and private sector for championing the campaign to protect their jobs, and we encourage everyone to support the arts and cultural sector by helping them to cope with the impact of Covid-19.”The arts and cultural sector was one", "The next Biennial should take place in 2020. Kaspi has stated that the event will include at least twenty-one artists, of which eighteen will be represented by the city of Helsinki.“The new exhibition will leverage the city’s existing collection and bring new ideas and experiences to the Biennial,” Kaspi told Hyperallergic. “It will also be a chance for visitors to Helsinki to see the first exhibition in the city by an African artist.”\n\n\nThe Museums Association (MA), an international organization representing more than 4,500 museums, has launched a new initiative to help museums cope with the coronavirus. Through a $50,000 grant, the association will offer $35,000 to museum foundations in the United Kingdom, Australia, and New Zealand to help them offer free admission to their museums to help them mitigate the impact of Covid-19.“We are grateful for the support from the MCA to help support the physical, emotional, and spiritual well-being of UK museums and are committed to working with the institutions to help them through this difficult period,” said Andrew Brown, chair of the association and director of the London-based charity", "The next Biennial should be curated by an international group of curators and scholars who reflect the spirit and scope of this exhibition’s international scope and mission. “We believe that the next edition of the Art Basel Hong Kong should be an interdisciplinary and global event, as an expression of the spirit of Hong Kong and Asia’s art scene as a whole.”\n\n\nThe Center for Contemporary Art (CAA) has announced that it will no longer host its next annual exhibition, “Tropes vs. Nature” in March 2020. The protest follows the May 13 announcement of a new exhibition, “new civilizations, new politics,” that was organized by the same group of curators. The New York–based nonprofit the Institute for Design and Architecture (IDA) and the artist-run nonprofit Creative Life Media (CLM) are among those that have signed an open letter supporting the anti-racist artists who are demanding a boycott of the March 23 event, which is being held at the St. Mark’s Cathedral in London.The letter states that the CAA’s decision “does not serve our values or our mission, and I believe it is detrimental to the future of", "The next Biennial should be held in 2022. Reply Delete\nToday, we are very proud to present the photographs of the first exhibition of the new museum, “Thesis,” organized by the Swedish photographer Janna Carlsson, “cascading an extraordinary array of subjects;” which is now currently on view in the Museum of Modern Art, Helsinki. The exhibition, which began as a collaboration with the Swedish director Knut Carlström, is now being presented by the Biennial Institute, Stockholm, the Museum Vel d'Or, and the Museum of Contemporary Art, Los Angeles.The exhibition “Thesis: The Future is Not What It Used To Be” will be curated by Janna Carlsson and will focus on the “final moments of a human being” with the help of two new artists, Anna-Sophia Aparecido and Shilpa Bhattacharya, who will each each created a photograph for a different event of the exhibition. The programme will also include an oral history project with a selection of the sixteen artists chosen for the exhibition.Commenting on the exhibition, Pia Friesen, director of the Biennial Institute, said: “The results are stunning", "The next Biennial should be held in 2020 and will focus on a renewal of the theme \"Era of Transition: Contemporary Art from the Pacific to the Atlantic\". The biennial will also include exhibitions and performances that reflect on the forthcoming decade, with a particular focus on the theme of the 2020 biennial. The theme of the exhibition “Era of Transition: Contemporary Art from the Pacific to the Atlantic” will be: “The Pacific Ocean, Pacific Art, and the Pacific Continent.”\n\n\nThe 2017 Whitney Biennial, “Toward a New American Biennial,” has announced that it is reopening on September 9 with a new exhibition, “The Future is Present.” The exhibition will be hosted by artist-in-residence and educator-in-residence Zena Izakha, a cofounder of the New York–based project COP 23. This biennial, which was cofounded by the artists in the nineteen-eighties, was organized at the Brooklyn Academy of Music in 2015 and was presented by the Los Angeles County Museum of Art in 2015 and the Whitney Museum of American Art in NYC in 2016. “Our vision for the exhibition and exhibition for this year’", "The next Biennial should organize an exhibition of the works of the biennial’s selected artists. The biennial’s next edition should be held at least twice a year. If the initiative is implemented, the Biennial of Arts will be able to focus more on the creative and less on the commodification of art and will be able to increase its programming and the impact of its artists and creators. The new format will also allow the Biennial to have more diversity of artists represented in the exhibition.\n\n\nA group of artists and designers are suing the Metropolitan Museum of Art in New York City, accusing the institution of excluding them from a major redesign project it was contracted to carry out. In a complaint filed last week, the artists claim that the museum failed to include them in a decision regarding the redesign of MoMA PS1, the museum’s main building, which is slated to open in the fall.“We’ve worked so hard to get to this point—to redesign the museum, to redesign our building, to redesign our exhibitions, to redesign our staff, to redesign our grounds, to redesign our collections, and to redesign our décor,” said a statement issued by the artists. �", "The next Biennial should take place in 2020.\n\n\nThe Museum of Fine Arts (MFA) in Boston announced today that it is working with the Rhode Island School of Design (RISD) to present a new semester of art at its New England campus in 2021. The announcement marks the latest in a series of steps the institution has taken to improve its digital experience, which currently includes live programming and the creation of numerous interactive works, including “The Future Is Present,” a survey of 25 years of art from the museum’s collection, “Art of the Electronic Age,” and “Art of the Future,” a retrospective of work that was organized via the museum’s digital platform.“The MAXXI team is thrilled to announce that we will present a new art-centric semester at our New England campus in 2021,” said board president and CEO Alex Adler. “Our commitment to art and digital culture is as strong as ever, and we have made it our mission to make the MAXXI experience one of the most compelling yet accessible and rewarding experiences for visitors to our campus.”In an effort to present a year-round, contemporary perspective on art through programming that reflects", "The next Biennial should be announced within the next few weeks. The exhibition is yet to be entrusted to Nusseibehro, and will date from September 2020 to March 2021.\n\n\nThe São Paulo Art Biennial has announced that it is extending the residency program of its inaugural edition to March 2021. The program, which began in 2022, has faced a number of challenges since it opened, including a prolonged environmental campaign and a series of productions that were not able to proceed because of the pandemic. “The global health crisis has taken a heavy toll on Brazil’s cultural sector,” Paulo de Janes, the president of the biennial and the chief executive of Prada, said in a statement. “We have been able to respond by working as a team, always seeking ways to strengthen our exhibition, education, and promotion programs.”The program’s inaugural edition, which ran from March 8–March 12, 2022, was attended by over three hundred artists and organizations. The 2019 edition drew in over two hundred thousand art lovers.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Katie Kuebler as its next director. Kuebler comes to the institution from the", "The next Biennial should be held in 2020, according to a statement issued by the institution. The biennial, which will focus on the art of the Americas, will be the first of its kind in the US. The 2018 edition, titled Between the World and Me, was set to open September 13, but was postponed until November 25, owing to the Covid-19 pandemic.The Hathaway Art Museum in Norwich, UK, cancelled the upcoming event, according to the Art Newspaper. The Solomon R. Guggenheim Museum in New York has also reportedly cancelled its 2019 edition, which was originally scheduled for March 20–March 22. The 2019 edition of the Biennial, titled On the Ground, was originally scheduled for March 5–March 8, but was pushed back due to concerns over the Covid-19 epidemic. The show opened as planned on March 8.\n\n\nThe Miami Museum of Art (Miami) has received a $75,000 donation from Miami-based collector and philanthropist Roberta Rambeau. Founded in 1976 by Rambeau and her husband, Robert Van Tilborgh, the institution was named after the couple’s late father, who is survived by their son and grandson.", "The next Biennial should be on the Yangtze River in Beijing in March 2021. \n\n\nTwo years after a group of artists, designers, writers, and other cultural workers were massacred in the Tiananmen Square square in Beijing by pro-democracy protesters, an exhibition organized by the State Administration for Cultural Heritage (SAAC) will reopen in Shanghai next month.“The exhibition will commemorate the second year of the establishment of the State Administration for Cultural Heritage,” said Zhu Shaobin, the director of the Center for Contemporary Art Shanghai. “The exhibit will explore the history of the organization, its recent history, and its future plans.”The ceremony for the exhibition, titled “State Administration for Cultural Heritage” (TAHC), will be held at the Shanghai Museum of Art in March 2020. It will be followed by two exhibitions. “State Administration for Cultural Heritage” will be on view until October 29.The exhibition commemorates the founding of the institution in 1989 and the events that took place during the Cultural Revolution. It will also include an exhibition of new works by artists such as Peter Schäfer, Gao Yu, Xuer Qi, and Xiaoping Zhang. The show will continue to be held in", "The next Biennial should start on March 13 and conclude sometime in the first half of March. The 2020 event will be held at the event site in the city of Foshan, China. The museum’s team will re-create the events that took place in the narrow alleyways and the museum’s collection by exploring the cultural and historical significance of specific locations. The exhibition will also include new works and other works that will be photographed with special attention to the materiality of the natural world.The biennial will be organized under the themes “Demons, Cities, and Cities,” and “The Dao of Man” and will run through March 28. The exhibition will include the works of artists such as Hsin-Yu Tsang, Tanya V. Bonakdar, Kiyoharu Matsumoto, and Kiyomasa Maruyama, as well as fifty-one works by twenty-six artists. The 2019 events featured a new collection of the work of fifty-three artists, as well as twenty-six works by forty-five artists.On the exhibition’s opening day, March 6, the Hong Kong Art Museum (HKS) in Hong Kong announced that it would", "The next Biennial should also consider reinterpreting the exhibition as a kind of platform for discussing the current issues and challenges of the globe, and should be able to generate new ideas and approaches to exhibitions. It will also be able to assist the creation of new programming that will deepen the experience of the Biennial. Chairman of the board of trustees of the Biennial is designer Bernardo Ianni, who described the pavilion as a “wonderland.” Francisco Pires, who curated the former World Trade Center in New York, said: “All the pavilion’s projects, including the redesign of the pavilion, were inspired by images and concepts from the exhibition. The changes made by the architects, who worked in close collaboration with the architects, were based on a desire to create a platform for new thought and new ideas.” The Biennial is currently being restored and is scheduled to reopen in 2021.\n\n\nThe Museum of Fine Arts (MoFA) in Atlanta has appointed Alec Hendrix as its new executive director. He succeeds Ann Hamilton, who has helmed the museum for more than six years. Hendrix comes to the museum from the Metropolitan Museum of Art, where", "The next Biennial should be held in 2020. The venue will be moved from the city’s central waterfront to the sprawling Chennai campus. The land will be developed by the Chennai City Council and the architect Arundathi Banerjee, who is also designing the town of Nagpur, in India’s Andhra Pradesh, and the city of Pune in India’s northern Maharashtra state.The new venue will boast an outdoor courtyard and will be connected by a bridging tunnel, a public plaza, and a splash-filled roof. The interior will be guided by the architect’s concept of a spaceship. Its interior design will be inspired by spaces in ancient Greek mythology, namely the Circus Maximus, the temple of the goddess Dione, and the Acropolis, a civic gathering place in ancient Athens.Commenting on the venue, architect and designer Zoya Alia told the Art Newspaper: “This is the first time we have designed the interior of a city in India. It will be a great opportunity to collect all the elements of the city and present them in such a way that will be a living thing in the future.", "The next Biennial should feature Chinese artists, artists from the Philippines, China, India, and Korea, and should be a collaborative effort between artists and historians, with the museum hoping to attract up to twenty-five thousand visitors.  Future plans for the event include a traveling exhibition of works by Chinese and European contemporary artists.\n\n\nFollowing the 2017 Rio de Janeiro Games, art organizations in Brazil have advised curators to prepare for a potentially $8 billion drop in revenue for the 2018 and 2019 iterations of the Games, which was previously scheduled to run from February to March.The first edition was originally scheduled to be held in March, but was pushed back from the date due to concerns over the Covid-19 pandemic and the cancellation of the 2020 edition. The second edition was originally slated for March 25–March 27, but was pushed back to March 31, March 29, and March 31. As a result, the 2019 edition will only be held March 26–March 28.Brazilian Olympic Committee president Luiz de Andrade told Brazilian media outlets that the organization will likely have to make adjustments to its program in order to avoid a shortfall of revenue. “We have to plan for the possibility of a financial shortfall,” de And", "The next Biennial should be held in Los Angeles in 2021.  The Biennial for Contemporary Art will be held in New Delhi in 2022.  \n\n\nThe works of German artist Marinus Rodrígues, who in recent years has focused on the oxymorality of art and literature, have been restored by the Spanish government to their original museums in Madrid.Rodrígues’s works, which were stolen from his home in Salerno, northern Spain, in 2001 and remain missing, were arrived at the city’s Museo de Arte Contemporáneo (MAS) in Madrid, where they were on display in a show by the artist’s son, Jörg Rodrígues, at the institution in 2017.The institution announced that it had received a gift of three works, including one by Rodrígues’ son, in a letter dated October 15, 2017 from the National Council of Museums in the Republic of Catalonia, which is led by Autódromo de Paz, the parent institution of the former president, Carles Puigdemont.The gifts, made to the institution in the form of two sets of drawings, one by Rodr", "The next Biennial should be in 2020. If the current pace is maintained, the event will open in June 2020.\n\n\nThe Museum of Contemporary Art (MoCA) has announced that it is planning to move the exhibition “Wu Shanzhong”—a 2002 exhibition that examined the Chinese painter Liu Shanzhong\u0097from its campus in Long Island City, New York, to Beijing, China. The move has raised concerns over the safety of the artist and his assistants, who were detained by New York police on Monday after being sought for a suspected incident that involved them.The exhibition, which explored the relationship between painting and Chinese culture, was moved to MoCA in 2016 after its owner, Wu, was charged with theft and false statements as part of a nationwide crackdown on organized crime, which centered on the southwest part of the US state of New York, where New York City’s Chinatown is located. Wu’s defense argued that the charges were politically motivated and that his business was never affected by the move.“In order to protect the artists and their voices, as a condition of their pleas to be released, the New York district attorney has now filed criminal charges against the artist and his associates,” said attorney Daniel", "The next Biennial should take place in 2020, the biennial will be hosted by Art Basel at the Art Museum Tokyo, and the theme will be “The Art of Health: Health as a Source of Modernity” The forthcoming seventy-fourth Venice Biennale will be held in the summer of 2021, and the theme will be “Atoms, Water, and Power: Renewal, Change, and Convergence” The seventy-fifth Venice Architecture Biennale will take place in September 2021. The seventy-sixth edition of the Venice Architecture Biennale will take place in October 2021, and the seventy-ninth Venice Film Festival will be staged at the Venetian Town Hall in Venice, Italy, next March. The sixty-third edition of the Venice Biennale will be staged in May 2022; the sixteenth edition of the Venice Architecture Biennale will be staged in June 2022.\n\n\nFollowing the July 7 explosion that leveled the Ritz-Carlton Hotel in the heart of the financial district of Manhattan, New York City Governor Andrew Cuomo declared the state of emergency for the entire city. The declaration came amid the coronavirus pandemic and Cuomo’s decision to boost police and fire response,", "The next Biennial should be held outside Paris in 2022. The institution’s director, Sohrab Mohebbi, said the event would ­be “neutral, nonpolitical, and participatory.” The show would focus on themes such as the vulnerability of the body, the body of work and the body politic, and would be hosted by an artist-run, biennial-inspired space.The exhibit will be curated by Caroline Alsop, the curator of contemporary art, and will take up themes of exploration and crisis through the work of eighty-three artists, including Odile Nara, Léanne Aibeau, Takari Nara, Siddhartha Dey, Monaghan L, Odili Dukkau, Kawahra Raigare, Gilead Chaudhary, and Dhanush Patel, among others, with an exhibition at the Palais de Tokyo in Mumbai in 2022.\n\n\nArt historian Joan Mitchell, a longtime curator and educator who currently chairs the department of art at Yale University, New Haven, Connecticut, has died at the age of eighty-four.Born in New Haven, Connecticut, in 1937,", "The next Biennial should take place in the spring of 2020. The upcoming exhibition, entitled “Art in the Age of Black Power,” will feature work by twenty-five artists whose practice spans from the tradition of African American artists to that of modernist painters, including Ion Iwu, John Levine, Mimi Lee, and Mirwais Ansari. It will also introduce a new concept and a new format, the “Center of the World.” This is a term coined by artist Tomás Paolo Barba to describe the central location of the artworks in order to address themes of the art world. The term is also used by Barba and many other artists to denote a space in which a work can be exhibited without the artist’s consent. The first exhibition, “Art in the Age of Black Power” will open at the Black Museum on January 21, 2020 and will run until March 7, 2020. The biennial will feature work by sixty-five artists. Titled “NIRVANA,” a series of eight paintings by Simone Leigh; “JAMES REED,” a series of photographs by David Salle; and “"]