["The next Biennial should be held in the spring of 2021. The museum will announce the theme and the locations for future editions in the coming months.\n\n\nIn an unprecedented move, the Coroni Foundation, a free and artistic endeavor centered on the photography of Italian photographers, has announced its resignation. The move follows a twenty-two-year tenure as president of the foundation, which was founded by photographer Francesco Coroni.Coroni served as president of the foundation from 1995 to 2013, when it was still run by his wife, Viola, and their daughter, Caroline. The Coroni Foundation has been at the center of a major New York City art dispute over the last two decades. A landmark art fair in 1989 and the subsequent exhibition at the Coroni in 1993 brought the foundation to national attention. In 2012, the foundation was awarded a $10 million grant from the City of New York in an effort to resolve the case. Speaking today about their recent decision, the foundation said: “We had hoped that the Coroni Foundation would continue as a model for art museums in America and around the world. Unfortunately, the board decided to remove the Coroni name from the museum after realizing that it is not a", "The next Biennial should take place in the near future. Given the current precarious state of Egyptian art the year 2020 must therefore be the ideal year for a retrospective that will reflect both the full breadth of the Egyptian artistic heritage, and a deep sense of purpose.”The first exhibition of the new biennial will showcase the work of Revolutionary Women, a group of women artists who staged a show in October 2019 at Al-Azhar Square. The group includes Naguib Mahfouz, Ahmed Jawad, and Hossein Abou-Rahme and will open at Al-Azhar Square in the summer of 2020. The exhibition will be preceded by a three-day group show of works by the same group at Al-Azhar Square in January 2021 and will be followed by a retrospective of Naguib Mahfouz’s exhibition at the A. P. C. in Paris in March 2021.\n\n\nThe Metropolitan Museum of Art in New York has launched a $250,000 fund for scholarships for undergraduate and graduate art students. The initiative, which aims to draw attention to the graduate student loan crisis, comes after the institution extended a $250,000 grant in 2019. “", "The next Biennial should be a 'whole new world,'” says Paul Viril, director of the museum. “I want it to be a time of renewal, a time of experimentation, a time of discovery—and a time of transformation.”\n\n\nThe National Geographic Society in Washington, DC, has appointed Deborah R. Goldberg as its new board chair. Goldberg will be responsible for overseeing the conservation, conservation education, research, and administration of the $3.5 billion institution.“This is a transformative time for the National Geographic Society and for the world,” said Ellen Crawford, president of the National Geographic Society’s board of directors. “We are grateful for the National Geographic Society’s support and leadership throughout the past five decades and are excited to continue to guide and protect the natural beauty of the Grand Canyon with the vision and leadership of Deborah.”Goldberg joins the National Geographic Society from the Smithsonian’s National Museum of Natural History; she is the author of several books on geology and is a past president of the Society.Commenting on her new role, Goldberg said: “It is an honor to be asked to lead the National Geographic Society into the future as its board", "The next Biennial should take place in the fall of 2020 and will include the work of forty artists, including professional and emerging artists from the United Kingdom, Russia, and Armenia. The Biennial will also feature a number of exhibitions and events that will engage with the themes and themes of the exhibition and with the artists who will participate. The 2019 edition featured photography by Kana Bulte, who also composed the work 'Telling Stories' and a piece for the exhibition “Campus Cinema” (2017), and a photojournal by Girgin Bossuyt (2010), both curated by Ola Bruguera.The exhibition will be held at the Tate Modern in London from March 16 to March 21, 2020. The theme of the exhibition is “Pillars of Creation” and will feature art from seventy-three countries and territories. The artwork will be curated by Kayode Oke, curator of contemporary arts at the CAAAM Art Institute in Seoul, and will be manufactured by the Hong Kong–based company Mecanoo, whose developers include the artist-run nonprofit Open Worlds Institute.According to the Guardian, the artists selected for the exhibition are:Agnieszka Oczym, Nomi Pawar", "The next Biennial should take place in 2021. \n Update: March 17, 10:40 AM. This article, which has been published in Italian, German, and French, has been updated to include a comment from the United States, where the exhibit was taking place.\n\n\nThe Institute for Contemporary Art (ICA) has announced that it will not renew the contract of twenty-six-year-old artist David Cage, who recently gave birth to his first child and reported being harassed by a group of thirty-one- and thirty-two-year-old men at a New York art fair in October. Cage’s lawyer, Joseph Caputi, told the Art Newspaper that the institute, which is currently closed for a three-month period owing to Covid-19, was unaware of the circumstances surrounding the artist’s pregnancy.According to the New York Times, Cage was invited to the fair by Damien Chazelle, the director of the Museum of Modern Art, but feared he would not be able to return with his family because of the pandemic. Cage had made no secret of his desire to work with the museum, which recently underwent a major renovation and completed a new exhibition in the summer. The project has yet", "The next Biennial should include a discussion of how traditional and contemporary art has contributed to the ongoing global health crisis. Broadly framing the exhibition as a “useful tool,” the biennial will invite artists to talk about their practices and their own visions of the future. It will also include a presentation of the work of artists whose works were included in the “Global Crisis on Art: Art in the Age of Black Death” exhibition that will run from May 18 to May 22.The theme of the biennial is “Power of Illusion” and the artwork that has been selected for the exhibition is “Paintings of Children” by the Venezuelan artist Elindra Medvedu. Replacing the later work, “Children” was created in 1963 and marked the first exhibition of an indigenous creator in Venezuela. Medvedu, a member of the tribe of the Mayas, was inspired to create the piece by a painting made in her village of Yuma, in the central state of Oaxaca, in 1957. The work, which was on display in the exhibition “Invictus: Art for the People” in 2008, is considered a classic example of indigenous art depicting children. The exhibition was", "The next Biennial should take place in April 2020, but the period of the exhibition has not yet been set. The biennial is a culmination of La Marseille: the show, organized by the Bernard-Henri and Edie Sedgwick-designed museum, will then return to the city of Marseille.The announcement follows the announcement of the upcoming editions of the Sargent’s Daughters, which will take place in the United Kingdom from March 21 to March 29. For the United States, the 2020 edition will be held on March 28. The first date will be March 28. The exhibition is slated to run from March 15 to March 21.The announcement of the two-week run of American drama The Americans, which will run from March 24 to March 29, and the twenty-second edition of the Women’s History Festival, which will take place from March 14 to March 16, comes on the heels of the announcement of a new edition of the Whitney Biennial, which will be held March 11–March 14, 2020.\n\n\nThe museum that has devoted its entire existence to the study of the visual arts has received a major gift from a philanthropist who made his fortune in the industry. David and Mir", "The next Biennial should be held in 2022. The first, held in 2015, was drenched in controversy and drew a large-scale response from the Chinese government, which blocked the opening of the exhibition. The second, held in 2017, drew flak from Beijing, which claimed the exhibition was in conflict with the Communist Party policy of territorial expansion. The museum initially said that the exhibition was part of an initiative to create an international platform for cultural cooperation, but later clarified that it was not. According to the New York Times, the exhibition was meant to focus on China’s cultural heritage and will focus on how the country re-enters the world through art, architecture, design, photography, and sculpture. The art of China is often discussed by Westerners, who value its diversity, spirit, and ingenuity.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has created a new position for women artists through its newly created post-production pipeline program, which provides funding and mentoring opportunities to under-recognized women working in the art world. The program, called the Women Artists Fellows, launched last October and offers the first opportunity for women artists to be considered for fellowships.Of the sixty-five", "The next Biennial should begin in 2021, with a design by the Buenos Aires based architectural firm BADEXPERIENCE. The theme of the exhibition will be “Portraits in Vitra” and will comprise of fifty works by fourteen artists and their families. The auction house will announce its representation of the artist in a future issue of the magazine. The most recent exhibition, “American Art, 1948–1978,” was held at the Brooklyn Museum in New York in October, 2019. The biennial was organized by the American Art Foundation in partnership with the Los Angeles County Museum of Art (LACMA), the Los Angeles County Museum of Art, and the Los Angeles County Museum of Art.\n\n\nThe State Museum of Fine Arts (LFA) in Philadelphia is planning to close its doors indefinitely in September—and reopen with a bang, with an all-new $50 million renovation. The institution, which has been closed since March because of Covid-19, said that its current programming, which includes exhibitions, events, and concerts, “will not be possible without the continued generosity of our valued patrons and the board and staff of the LFA.”The renovation, which is part of a $140 million expansion that aims", "The next Biennial should take place in Barcelona in December 2020 and will showcase the work of the 2018 awardees.The Cannes Film Festival, which runs from May to November annually in France, has yet to set a date for its 2019 edition. According to a report in French daily Le Monde, the event will be moved to February. The 2020 edition will mark the first that will take place in Milan.\n\n\nThe Pennsylvania Academy of the Fine Arts (PAFA) in Philadelphia has received a gift of eighty-seven works by eighty-three artists from the collection of the legendary Pittsburgh native William Shakespeare. The works were donated by the legendary British theater artist to the institution after he passed away in June 2019.Known for his profound observational and emotional intelligence, Shakespeare often noted the limitations of his own experience—he famously said: “I have never made a living from theater,” but he has had several notable exhibitions over the years, including at the Museum of Modern Art (MoMA) in New York in 1980 and at the Contemporary Art Museum Chicago in 1989. PAFA, which is housed in the former steel plant, opened its doors to the public in 1997. The museum has since been transformed into a center for the collection of Shakespeare’s works", "The next Biennial should be held in 2021.\n\n\nThe Museum of Modern Art (MoMA) in New York has released the list of fifty artists and collectives that will participate in its seventy-fifth edition, “Art after the Fall: Art in Transition.” The exhibition will take place at the Museum until January 31, 2022. Titled “Art in Time,” the exhibit will examine the ways that artworks are reimagined and reinterpreted through the traditional representation of time. The fifty-four artists chosen for the event are Victor Hugo, Andrew Lloyd Wright, Jean-Luc Godard, Walt Disney, Jean-Michel Basquiat, the Surrealists Jean-Michel Foucault and Michelangelo Antonioni, and the Abstract Expressionist Anna Atkins.“Sixty years after the event, MoMA has announced that the next edition will be held at the Museum,” said Michael Govan, director of the Metropolitan Museum of Art. “For eighty years, MoMA has been a platform for experimentation and self-expression. The Museum’s commitment to the Arts is central to how we live, work, and think, and I’m honored to represent the Museum", "The next Biennial should be held in the spring of 2021. The committee will then determine the theme for the fifteenth edition.\n\n\nThe National Gallery in London has added five new artists to its board of trustees. In a ceremony held at the gallery today, the board unanimously elected three new members to the board of trustees: Kate Beckins, Akiko Yamashiro, and Philip Higgins. The three new trustees are Rory Mulligan, who is currently director of the National Gallery of Scotland; Mary Tait, who is the director of the National Gallery of Wales; and Benedict Prouvost.The new members will serve a three-year term, beginning in the spring of 2022. Their first act will be to name Rory Mulligan as director of the National Gallery of England and Wales, and their second act will be to appoint Akiko Yamashiro as director of Bournon Gallery in London, and Philip Higgins as director of Tate Modern.The board also chose Kate Beckins as director of the National Galleries of Scotland, and Katherine Howard as director of Tate Britain. Previously, the British Museum director has served on the board of trustees for the National Portrait Gallery, and the National Museum in", "The next Biennial should be held at least once a year, with the conference beginning with a special exhibition of work by a select group of artists. The catalogue will be presented by a committee comprising Carsten Haag, Harald Szeemann, Judith Szeemann, and Jana van der Veen, and will be curated by Harald Szeemann.The exhibition will include works by a range of artists, including Anna-Sophie Balsom, Sibel Kohn, and Iwan Wirth, and will be accompanied by a special edition of the Biennial Show, which will take place at the museum in the fall of 2020.The biennial will also receive a new gift, a gift from the artist-in-residence, Elena Petrovna, a native of the city of Kinshasa. This year’s gift includes a framed photograph of the artist’s recent visit to Kinshasa, which was given by her father, the former curator of modern languages Kunst Epiphany, to mark the occasion.The painting will also feature a new text by the artist, translated from the Russian by her assistant and curator Elena Petrovna. Pressed in a work that is inspired by", "The next Biennial should be held in 2022.\n\nThe Metropolitan Museum of Art made the announcement, which was made by Kim Yoon-seok, the director of the museum, in collaboration with a team of international curators, artists, and scholars, and featured work by nearly forty-five artists, including László Nemec, Fotopower, and John Young, as well as a selection of the first exhibitions that were organized by the museum. The biennial—which was established in 2014 to commemorate the museum’s 150th anniversary—is currently organized as a series of exhibitions, selected by Kim, that will run for twelve months. The first exhibition, “Spencer’s work,” will open on January 3, 2020 and will include work by twenty-three artists, including Tilda Swinton, Joo Mi-sung, and Ki-Man Sze, and will run through April 3, 2020. The show will also introduce new works by Taliesin Namkai, Sasha Barth, and John Akomfrah.“The Met’s inaugural exhibition ‘The Metamart’s 100th Anniversary’ will bring together work by this remarkable group of", "The next Biennial should be staged in a different location. The San Francisco Museum of Modern Art (SFMoMA), a modernist institution, will hold the first exhibition there in 2021.  The Santiago Biennale, which will be hosted by the Spanish ministry, is currently on track to run for three years.The Art Newspaper reports that the next edition of the International Biennial, titled “There will be more of Us,” will take place in the US, Spain, and the United Kingdom. The event will be hosted at the Museum of Contemporary Art (MoCA) in Los Angeles from March 19 to March 21, 2020.\n\n\nThe London 2012 Biennial, which was slated to kick off on March 12, has been postponed due to the ongoing Covid-19 crisis. Organizers have announced that the event will now take place on March 13. The event, which was cofounded by London-based collective NIRIN and staged by the London-based collective Factory/Art Lab, is one of the largest public gatherings for contemporary art in the UK. The event, which was set to celebrate the UK’s role in the 2011–14 Covid-19 crisis, was originally scheduled to run from", "The next Biennial should be in the spring of 2021.”\n\n\nThe Museums Association (MA), an American trade organization representing museum directors, has released guidelines for the auction houses who will participate in the upcoming edition of the Fifty-Eighth Venice Biennale, which will take place from May to November. The 2020 edition will be curated by José Andrés, who will return to the Venice Sculpture Garden in July, and which will focus on visual art. The 2020 edition will also feature works by some of the most talented galleries in the world.“It is a great honor to be able to work with José Andrés, a truly visionary curator, and to aid his vision in shaping the 2020 edition of the Venice Sculpture Garden,” said Andreas T. Müller, president of the association. “Over the last twelve years, and especially since his appointment in 2017, José has worked tirelessly to realize the good will of the Milanese and the city of Milan, fostering the development and presentation of exhibitions that are accessible to everyone, creating special exhibitions for the gallery and the city of Milan, and bringing together international artists and collectors. I’m honored to be able to join him in this mission.", "The next Biennial should be in October 2020. The exhibition will consist of thirty contemporary works of African art.\n\n\nThe Institute of Contemporary Arts (ICA) in Manchester announced today that it is opening its first academy within the university to study the practices of contemporary artists and their connections with the arts. The initiative will be led by former director Amira El Rasheed, and will focus on the philosophical and material foundations of art and architecture.“The cultural origins of art and architecture are central to a wide range of contemporary art practices,” Rasheed said in a statement. “The academy will be a space for the producer to develop a deeper appreciation of their own cultural heritage, and will encourage a more active and creative form of artistic practice.”ICA’s director, Andrew Higgs, added: “Amira El Rasheed’s management team have been hugely supportive of our mission to nurture and care for the rich and vibrant legacy of the ICA. We are confident that the academy will provide a great platform for Amira and Jodi’s work in the coming years. We are hopeful that this new mission will allow them to work together to ensure the museum’s continued relevance in the world and its exhibitions", "The next Biennial should commence in the spring of 2021. The first Biennial, held in the Paris of the Museum of Modern Art, included works by forty-nine artists from twenty-three countries. The biennial was organized by the Institute of Contemporary Art Paris (CIE), ­and the Museum of Contemporary Art Paris. The movie and television show Hirshhorn Biennial, originally scheduled to take place in the spring of 2021, was postponed until at least the end of 2020. With the launch of the new biennial, the Institute of Contemporary Art Paris will release the “20/20 Vision,” a collection of works coinciding with the first phase of its new exhibition series “Oolite Stories.” The exhibition, which will open on September 17 and run through October 22, will feature forty works by twenty-five artists, including Peter Erdos, Janice Yūker, Nikkita Laverrière, and John Paul Graham, and will be curated by Alexander B-Alonso, the director of the Museum of Modern Art.“We are so honored to collaborate with the city of Lyon, with its people, and inspired by the artists who created the series,” said Fermat", "The next Biennial should be a celebration of the current state of art, its relevance and impact, and the work of the biennial artists. It should be an opportunity to meet and talk with other biennial artists, to work together on projects, and to learn from one another.This is an age of unprecedented change, one of the most ambitious and technologically advanced eras in history. In a time when so much of modern life is mediated by digital technology, we are at the forefront of developing new ways of making art and new ways of thinking about art. We believe that the Arts and Culture is central to bringing people together and to inspiring them to live together in a more meaningful way. We will continue to do our best to support and support the artists and youth of our city through this challenging and transformative time.”\n\n\nThe American Contemporary Art Museum (ACM) in New York has appointed Michelle DeSousa as its next executive director. DeSousa replaces Ruth Estévez, who retired in March after twenty-five years at the institution. Estévez was appointed by David Christopher, the museum’s board president and a former Mellon trustee, after she became the director of the Diller Scofidio + Renfro–", "The next Biennial should take place in 2021. Tobacco Control Now, a New York–based organization, has launched a petition demanding that the museum divest from the tobacco companies. The organization has given the petition the go-ahead to circulate. If the museum does choose to divest, it should do so in accordance with the Declaration of Independence of the United States, signed by more than sixty leading American art historians in June 2019 and titled Art and the Devil: The Politics of Tobacco, which calls for the immediate and complete withdrawal of all remaining tobacco products from US markets. The museum has previously responded to the petition by arguing that its management has not yet reviewed the document and that the decision rests with the board of trustees. In response to the divestment campaign, Museum of Modern Art director Nicholas Cullinan wrote: As I said many months ago, I am tremendously disappointed in the Declaration. I have long maintained that the museum is committed to supporting the cultural, spiritual, and social well-being of our guests and community. And while we have never formally taken on the management of Adams Morgan, I am happy to take on management of the museum if it means that we continue to thrive as an important hub", "The next Biennial should address how contemporary art from Africa and the African diaspora is disseminated by means of new media, digital technologies, and the production of oral histories. The exhibition will also include a brief on the concept of art from Africa, the United States, and the African diaspora.“Inequality is an issue that affects us all, but especially affects our African diaspora,” said Margot. “Inequality in art is an issue that impacts us all. We as a society need to consider and address this in the most sensitive way possible. I want us to see things from the African perspective. We need to engage with our African history, our African art, our African communities and understand that there is much to be gained from them. There is much work that can and should be done to address the issues that are in our past, but we must not forget our future.”\n\n\nThe Public Art Fund in the US is launching a new initiative that will see artists and collectors give back to society in the form of monetary relief. The program, called “Away Dreams,” will give artists and collectors $1,000 rewards for making a “good faith contribution” to", "The next Biennial should begin in late May. \n\n\nThe Brussels-based advocacy group Artnet says it was forced to cancel a 2019 edition of its Biennial of Contemporary Arts (BAC), which was set to take place in May, after it received a threat from a member of the public over a work by Belgian artist Jean-Michel Basquiat. The threat apparently came from an anonymous person who said that the exhibition would be canceled if it did not immediately halt construction of a new building that will house the exhibition.The threatened closure of the exhibition followed a controversy sparked by Basquiat’s Death of a Young Man, 1976, a show that featured portraits of famous young men and women. The show was about a young man who, struggling to deal with the death of his father, committed suicide by jumping off a seventh-story balcony. Several artists and critics criticized the exhibition’s depiction of suicide and the suicide of an artist, Michel Ghebaly, in the show. The organization responsible for the Biennial of Contemporary Arts in Brussels, the BVMA, has since released a statement saying that the exhibition has been moved from May 27 to June 14 and that it is preparing for a reopening date", "The next Biennial should be held in 2021.\n\n\nThe Council of the European Communities (CEC) is urging member states to address the systemic racism and xenophobia in their immigration policies by enacting legislation that would protect workers from racial and religious discrimination. The document, which has yet to be adopted by the European Parliament, states that the creation of a European common market—essentially, a mechanism whereby EU nationals could travel freely between member states—could be a stepping stone toward securing the bloc's future.However, the proposal does not address the thorny issue of how to integrate people from the bloc, or what type of immigration management measures would be required to ensure the bloc’s internal security. Instead, it focuses on how to prevent people from criminal networks from using the Schengen area to enter Europe. It states that there must be a balance between the rights and the obligations of member states. While it would also allow countries to reintroduce border checks, customs checks, and the sharing of travel documents, it states that border adjustments must be coordinated with the Schengen area and that customs checks will remain in place.The document also criticizes member states for failing to act: “We believe that the current situation requires an urgent European Union-", "The next Biennial should take place in 2019 and is expected to be held at the Museo del Biennial in Madrid.In its twenty-six-year history, the exhibition has exhibited work by forty-two artists, including Donatella Bocchieri (Italy), Occhino Balaguer (Italy), and Tony Bussi (Italy), and has presented works by contemporary artists such as David H. Lee (United States), Yuka Kawamoto (Japan), Gio Ponti (Italy), and Ugo Rondinotti (Italy)\n\nCurator Maigret Gabbe, who served as keynote speaker at the Venice Biennale in 2019, has announced that her first exhibition in the United Kingdom will be staged at the Museum of London, which is currently undergoing a major expansion. The exhibition, titled “Away From the Facades” (under the title “Away From the Fences), will be on view from March 22 to March 26, 2020.Gabbe is the founder of the American design firm Nereus, and her work has been exhibited at the Whitney Museum of American Art in New York; the Institute of Contemporary Arts, London; and the Institute of Art and Design, London", "The next Biennial should have an initial run of fifty to sixty days and be staged in Hamburg. Originally scheduled for March 24–March 26, the 3-D exhibition had been moved to a different venue, and the schedule for the event was re-written. Its opening weekend, March 17–March 20, was moved to March 21–March 22. The exhibition was supposed to be the start of a new phase of the pavilion, with the sculpture Justa Merz, currently on view, and the first piece to be staged be a collaboration between artists from the United States and the United Kingdom.“I am incredibly excited to continue with the work of bringing together contemporary art and the latest technologies in the exhibition space,” said Markus Gross, the director of the Biennial. “The Biennial is an integral part of the stunning and contemporary work of the talented and internationally acclaimed artists in the pavilion. We are committed to supporting the artists and their projects in this way, and I am confident that the invited artists and the pavilion will flourish.”\n\n\nThe MNE Indian Art Museum (MNEI) in Chennai has received a gift of over 1,500 paintings, drawings, sculptures,", "The next Biennial should be held in May 2020. The museum is currently closed due to the Covid-19 pandemic. The institution has said that the exhibition will remain closed until at least the end of October, as it does every year. Artforum has reached out to the Tate for a statement.  Claudia Hamilton, the director of the Tate, said: “The exhibition will continue to be fully accessible to the general public and will be subject to routine maintenance and repair. In order to provide additional support to our staff and visitors during this challenging period, we are reducing the number of exhibitions in 2020 from thirteen to eleven. We have also been working with staff to outline the future of our exhibition programme and to consider the possibility of holding some exhibitions at a time in future years. The exhibition will remain closed for at least another twelve months, perhaps longer.” Hamilton added that the museum will continue to work closely with the Covid-19 Advisory Group on its exhibition schedule, as well as with the Royal Shakespeare Company, the National Galleries of Scotland, and other organisations dedicated to promoting the art of conservation. She also praised the work of the public and institutions in promoting awareness of the Cov", "The next Biennial should be held in 2022. The show will celebrate the 50th anniversary of the exhibition “ART’s Birth of a Nation: American Artists and the Birth of American Communism,” which will be staged in Washington, DC, and New York City. The biennial will run for five years, from January 1, 2020, to December 31, 2020.“The Biennial is a living organism, growing and changing with the times and with the artists, with each passing year becoming the great platform to whom art is addressed in the world,” said Helen G. Anderson, the president of the Biennial. “We are grateful to the one million people who have made this possible, and we look forward to the 2020 edition. We are confident that the 2013 exhibition, with its stellar roster of artists and its deep and engaging history, will redefine what a biennial can be.”The full list of participating artists is as follows:Charles A. and Etta M. Pfeifer For the Ninth Annual New Art Biennial, New York: Charles A. and Etta M. Pfeifer, New York: Date: January 1, 2019 Contemporary Art Biennial, New York:", "The next Biennial should be held in 2020. The curator is currently negotiating with the institution for the format. Sources familiar with the matter said that the pavilion will be divided into five rooms, each with a different story. The first will be devoted to “dairy farming and the industrialization of the environment.” The pavilion’s second section will focus on how art and agriculture are interconnected, with a focus on agriculture and art. The third section will present historical narratives and individuals, focusing on the work of Ana Mendieta and Mies van der Rohe, and will present contemporary artists in the biennial.The fourth section will feature artists in the biennial living in the permanent collection, including the work of Roo, Martin Lauter, and Peter Zumthor, and will be curated by Ann-Marie Artu. The fifth section will consist of a selection of photographs by Chilean artists and will be presented by the artist as a series of “thank you” cards.\n\n\nThe Museum of Contemporary Art (MoCA) in New York has appointed the new chief curator and director of contemporary art, Patricia Harris, as its next director and CEO. Harris comes to the institution from the Solomon R. G", "The next Biennial should take place at the Paris museum in December 2021. The date of the inaugural exhibition has yet to be announced. The next edition, “Das Land im Land: ‘Monopol,’ will be held at the Museum of Modern Art Berlin in November 2022. The 2020 edition was organized by the Berlin-based institution “Neue Galerie Schüti­-Welt,” and took place in the reconstructed former Städelschule, the former home of the Deutsche Arbeiterpartei. Art historian and curator Walter Degenberg, who was chair of the exhibition, said: “The body of work by these artists is as important as their individual works. To the extent that such work has touched the lives of their audiences, it should be treasured.”The exhibition began in May 2017 with “Cézanne: The Body and the World,” which was shown at the Museum of Modern Art in New York from May 3–May 5, 2018. The show included works by artist-activists Tanya Bonakdar, Dahr Jamail, Mathias Carlsson, Maria Cipolelli, Laura Owens, and Rona P", "The next Biennial should take place in September 2020. This is the time of year when the South Asian community in Mumbai, where the first exhibition was held in November 2019, is most at risk of a resurgence of the virus. The country currently has the highest number of cases in India and the world.\n\n\nThe Tsukiji Museum in Tokyo has received a donation of seventy-two rare books by Prince Rina Benet of Monaco\u0097one of the world’s most valuable private collections. The ten volumes of his poetry collection, written in Arabic, Persian, and French, were included in a new exhibition organized by the Prince of Monaco at the museum in December.“The acquisition of this collection is an important step in supporting the growing awareness of the artist’s contribution to the development of Arabic and Persian art in the twentieth century,” said Hamza Kazemi, the director of the Museum of Contemporary Art Dubai, and his wife, Anwar, in a statement. The couple also thanked the public and artists who donated books, and they commended the authorities for taking the appropriate action against the owner of the artworks.“I wish we could have had the opportunity to buy what these rare books are worth,” said the", "The next Biennial should focus on the history of African art as well as the African diaspora in the United States and should include an exploration of the history of the African diaspora in Southern Europe and the Americas. Also planned is a workshop on the role of art in social change and a discussion on the importance of art and culture in the development of contemporary art.\n\n\nThe Andrea Foundation in New York City announced today that it is launching a $1 million fund to support the families of Andrea Yates, the independent curator, painters, and sculptors whose work was included in the exhibition “The Artist’s Kitchen: Art in the Age of Black Power” at the Museum of Modern Art in 2015. The Andrea Fund will provide grants of up to $100,000 to help support families through this difficult time.The foundation is one of a number of organizations, including the Art Gallery of Harlem, which recently launched a grant program, and the Museum of Modern Art (MoMA), that work to support artists and their families through this difficult period. The foundation is one of the organizations working to launch a fund for artists and their families in the aftermath of the coronavirus pandemic. The Andrea Fund will distribute $500,000 to", "The next Biennial should take place in 2020.\n\n\nThe Golden Corral, a contemporary art museum in Beijing that was forced to move from its home in the Guggenheim to a space in the SoHo neighborhood of New York City during the city government’s ongoing redevelopment project, has announced that it will reopen as the Museum of Modern Art (MoMA) in 2021. Its new park across from the Museum of Modern Art, which is currently undergoing a major reopening, will offer a museum-wide experience of contemporary art.The launch of the museum coincides with the opening of a new exhibition of work by the architect Luis Alÿs, which will focus on the urban environment and theme, “Topography and Space.” The exhibition will showcase work by artists such as João Moura, Stefano Lotti, and Wolfgang Pausch, as well as work by the late Mexican designer and politician Alvaro Barba and French polymath Jean-Luc Moulène.The announcement of the new exhibition coincides with the opening of a new three-day retrospective of work by the Mexican artist and activist María Berrada. The exhibition will showcase her work in a series titled “María Berrada:", "The next Biennial should take place in 2020.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Joel Feinman its new director. Feinman comes to the institution from the Metropolitan Museum of Art, where he served as deputy director for acquisitions and collections before he was hired as director of collection last year. He replaces Paul Mpagi Sepuya, who retired after twelve years at the museum.“Joel is a seasoned curator who has a proven track record of delivering powerful exhibitions and transformative collaborations,” said Wayne Dyer, the museum’s director and CEO. “Joel’s new role at MoMA reinforces MoMA’s reputation as an institution dedicated to art and research driven by communities. As we move into the twenty-first century, MoMA is an important center for research and audience engagement for the museum’s collection exhibitions and books. We look forward to his continued leadership as we move into 2020 and beyond as a museum.”During his tenure at the museum, Feinman curated a number of exhibitions that are currently on view at the institution, including “The New Slaves: European Art and Colonialism in Africa” (2019), “Benito Ju", "The next Biennial should focus on the historic and contemporary work of women artists in the Philippines. The exhibition should also highlight the contributions of women artists to progressive arts in the Philippines, particularly in the art, architecture, and design fields.The 2020 edition of the Bisexual Arts Festival will be held at the National Museum of the Philippines in Manila from February 22 to March 23. Participating artists will include Tiwani-Amin, Bautista, Scarara, and Binti, whose work was exhibited at the Venice Biennale in 2013; and Cinéma Bautista. The theme of the biennial is 'On the Body: Gender, Health, and Spirituality in Contemporary Art and Religion.”In an open letter dated March 22, Bautista and Scarara wrote: “We were inspired by the art of our times by the feminist, queer, and trans (LGBT) movements, and by the artists who are dedicated to this work. We believe this exhibition will present new and challenging perspectives, which will unite us as we explore and live our visions of the body, the soul, and the divine.”More information about the 2020 edition of the Bisexual Arts Festival can be found on", "The next Biennial should be held in 2021.\n\nThe Museum of Contemporary Art (MoCA) has also announced that it will be closed for a few weeks before its June 22 reopening date. The museum, which was forced to move the fifty-third edition of the Contemporary Art Museum Chicago (CAMIC) from March 13 to March 17 because of the Covid-19 pandemic, chose to extend the run by two months.CAMIC’s director, Adam D. Weinberg, said: “We are very pleased with the outcome. We have proven over and over again that we are able to hold our events at a major institution, schedule them in advance, and bring them to life while keeping our staff and guests engaged. We are confident that we will be able to resume providing the exceptional exhibition experiences of CAMIC Chicago and continue to grow our audience with screenings of new work by artists and innovative projects.”The museum will also hold a Digital Village, which will provide new tools and programming to help visitors stay connected with the museum. According to a release, the move will “provide visitors with the ability to explore the museum online through the Museum’s mobile app.” The museum will also be able", "The next Biennial should be held in 2022. \n\n\nThe Pérez Art Museum Mestalla in Mexico City has received a gift of twenty-seven works by artist Luis Posada, a survivor of the 1929 bombing of the Puebla de Bellas Artes in Nahuatl, Guerrero. The collection includes paintings, drawings, collages, photographs, prints, maps, sculptures, and works on paper.“The museum is thrilled to present this gift to the Pérez Art Museum, and to the collection, as it is a great success in the museum’s history,” said Pilar Cervetto, deputy director of the Pérez Art Museum.\n\n\nThe Metropolitan Museum of Art in New York has appointed Steven L. Shapiro as its next director. The announcement marks the beginning of an eight-year term for the seventy-seven-year-old director, who is responsible for overseeing the museum’s collection, programming, and visitor experience. Shapiro will assume his responsibilities on January 3, 2021.“Steven is an extraordinarily accomplished curator whose work has been recognized repeatedly throughout his career, and which has been exhibited in major international exhibitions,” said museum director Daniel H. Weiss. “His", "The next Biennial should be held at the end of February 2020.\n\n\nThe Neue Galerie in Geneva has named Petra Häggstrand, who is known for her ambitious urban design projects in cities including Copenhagen, Stuttgart, and New York, as its next general director. Häggstrand has worked for the Galerie since 1996. Previously, she was a consultant for the museum in 2008 and was promoted to director of the Galerie in 2016. “I’ve been a fan of her work for years, and have been following her career since the 1980s, when she first joined the museum, as a consultant in the commercial department,” said Martin Christiansen, who organized the 2018 exhibition “Peter Jackson: A Retrospective.” To be held in the spring of 2021, the exhibition will cost €900,000 ($950,000), and be organized by mastermind Arne Glimcher.The twenty-seven-thousand-work collection is divided between three museums: the Museum of the History of Modern Art (MoMA), the Museum of Modern Art (MoMA), and the Whitney Museum of American Art. The collection comprises paintings, sculptures, drawings, prints, rough drawings,", "The next Biennial should take place in the spring of 2020 and will include presentations of work by twenty-six artists. The show will also feature work by twelve international artists, including Isabel Albright, Alex Di Suber, Yotam Ottaviani, and Nihar Patel. The biennial will be the first of its kind and will be hosted by two buildings in the city: the Dusseldorf-based museum, and the German architectural company Rümsturmförde.\n\n\nThe House of Art + Design, an initiative aimed at supporting the development of craft and design in the city of Cologne, has appointed Ricardo Balsom, chief curator of contemporary art at the German cultural institution Stiftung der Moderne Garten, as its new director. Balsom will take up the post in January 2020. Balsom will succeed Mina Schöffer, who has helmed the House of Art since 2014, as the institution prepares to reopen in March. Balsom has been collaborating with Schöffer for more than a decade, collaborating on projects such as the exhibition “Sittheid des Gruppen” (House of Art) in the 1990", "The next Biennial should take place in 2021.<|endoftext|>The board of the American Folk Art Museum (AFAM), which announced its intention to close its doors in late June, has postponed the exhibition “Monopol: The Art of the Deal,” scheduled for June 22–July 14. According to the New York Times, the exhibition, which would have examined the art of the electronic market, was supposed to reopen on June 14. The announcement came two days after a protest at the museum, which was closed until April 15, when the museum reopened for business.The board is responsible for overseeing the management of the institution, which is located in the former headquarters of the American Telephone and Telegraph Company, in Hartford, Connecticut.“At this time of the museum’s annual closure, we’ve decided to postpone the opening of the exhibition. We discuss how our work in the exhibition can differ from that of the museum in the exhibition, and we hope that the exhibition will continue to be relevant to a wide audience,” said Anne‐Marie Olszewski, the museum’s current director. The board plans to convene a special meeting of the board of directors next month to discuss the exhibition’s future.", "The next Biennial should be held at the Museum of Contemporary Art (MoCA), New York, in 2021.  The biennial’s theme, “Living for Change: Art and the New Left in the 1960s” will be explored in conjunction with the museum’s collection, which comprises work by artists such as Willem de Kooning, Donna Harrison, and Willem de Kooning’s son.\n\n\nThe Metropolitan Museum of Art in New York has announced that it is expanding its leadership team in the museum’s management and arts departments, adding three new members to its ranks: Lana George, who will be responsible for overseeing the museum’s ticketing and parking operations; Jennifer Keller, who will be responsible for developing programming for its residential complex; and Alejandra Pascual-Marin, who will work closely with curator Zachary Stern.“We are thrilled to welcome these three exciting new members to the Metropolitan Museum of Art management team,” said Ann Friedman, the museum’s director and chief curator. “Lana George is a seasoned curator whose career spans over twenty years and is well placed to build on the Met’s growing collection of work by", "The next Biennial should be held in the summer of 2022. The Biennials were inaugurated by a retrospective of Imre Parac and the first exhibition was entitled The Legacy of Imre Parac. The exhibition was later moved to Paris and the exhibition was one of the first to be held in the city. The biennial also received a five-year grant from the Laureate of the Netherlands, Piet van der Hulzen.\n\n\nThe National Galleries of Scotland announced today that Sherwin-Williams Gallery has become the representative of the National Trust for Scotland. The museum will present the first exhibition dedicated to Scottish artist-gardener John Barlow at the institution in 2022. The exhibition will be curated by the artist himself and will be organized as a retrospective in collaboration with his wife, Ann-Marie Barlow. It will include work from his collection that has never been presented before, and will be dedicated to “The Death of a Nation.”“John Barlow is one of the most celebrated twentieth-century artists, and we are privileged to be able to present his work in the first exhibition at the National Galleries of Scotland since he died in 2007,” said Sherwin Williams director Marnie", "The next Biennial should be held at the National Museum of the African Art in Athens, the Museum of Modern Art, the Museum of Modern Art, the Metropolitan Museum of Art, and the Museum of Contemporary Art, Philadelphia. The 50th should be held at the Metropolitan Museum of Art in New York.\n\n\nArt dealer George Musevena, whose eclectic practice encompassed neo-expressionism, experimental photography, and experimental sculpture, died on December 7 at his home in Brooklyn. He was ninety-six years old. Many of his works have recently been on display in the exhibition “George Musevena: Photography in the Age of Eugene Kamm’s ‘Eternity,’” which is currently on view at the Museum of Modern Art (MoMA) in New York through February 21, 2020. George Musevena’s work has recently been featured in “The Films of Robert Mapplethorpe,” a retrospective at the Los Angeles County Museum of Art, and has been exhibited at the Smithsonian American Art Museum, the Museum of Modern Art, the Museum of Modern Art, New York; the Museum of Contemporary Art, Los Angeles; and the Museum of Modern Art, New York", "The next Biennial should examine modern and contemporary art from different parts of the world, including South Asia, the Americas, and Europe. It should also present a selection of works from the exhibition “Award: A Contemporary Art Biennial” in a contemporary context.“We are very excited about the exhibition,” said Nicholas Nyborg, the chair of the exhibition. “At one point we thought it might be a bit dated, but it has always made us feel that the project was a worthwhile project.”The inaugural event was held in 2019 at the San Francisco Museum of Modern Art, and was inspired by the 1976–77 school year at the University of California, Berkeley. The theme of the exhibition was “The Power of Art”—a play on words that represented an attempt to understand how art can be a tool for healing and transformation.The 2018 exhibition “The Power of Art” was staged at the San Francisco Museum of Modern Art and the Margate Museum, and featured work by twenty-eight artists, including Yinka Shonibare (Switzerland), Yuki Kantoku (Japan), and Maitreya Ghosh (United Kingdom), among others.The 2019 edition of “The Power", "The next Biennial should be held in 2021 to coincide with the first. This was the second edition of the exhibition, held in collaboration with the Stone in London. The show, titled “On Being,” was organized by the London-based artist James Turrell, who is best known for his sculptural works, including The Palace of Babylon, 1958, a concrete sarcophagus, and The House of the Pharaohs, 1969, a tomb in a pyramids in Giza.\n\n\nThe Smithsonian American Art Museum (SAAM) has received a significant donation of over five hundred works from the Wilson Jewish Museum in New York, New York. The gift includes more than 2,300 paintings, drawings, and prints by twenty-four artists, including Ed Moses, Philip Mondrian, and John Graham, as well as several works on paper, including The American Dream, 1984, which was made in a Jewish family home in Brooklyn.The donation—which also includes a collection of nineteenth-century American art—has been made through the Wilson Family Fund, which was created in 1999 by philanthropist Robert Wilson and his wife, Deborah, and was cofounded by Deborah Wilson, who is a cochair of the foundation, and her parents", "The next Biennial should begin as soon as possible. It is possible that the construction of the exhibition will be delayed. In order to protect the health of our staff and visitors, and to ensure the conference will be an event that will last for a significant period of time, the Biennial’s opening date will be pushed back by five weeks.The renovation of the exhibition will also involve the repositioning of the pavilion in the fourth and final phase of the program, which will take place in the autumn of 2020. The installation of the new works will be undertaken in collaboration with the architects in the autumn of 2020. The next iteration of the exhibition will be held at the Contemporary Art Museum St. Louis.“For many years, the Contemporary Art Museum St. Louis has been a treasure for art lovers from the Bay Area and beyond,” said Bruce Smith, director of the Contemporary Art Museum. “We are excited to open the new Biennale in October and to present the new works in December in celebration of the 50th anniversary of the Contemporary Art Museum.”\n\n\nThe Israeli Museum of War (IMO) in Jerusalem has appointed Sherif Ariel as its new director. Ariel is a lawyer and a scholar whose work centers", "The next Biennial should be held in 2020, and it will be the last. “A Biennial is a collective work, and we are currently working through a lot of the complexities of the collective work,” explained James Cuno, chairman of the museum’s board of trustees. “This is a challenging time for us all, for the museum and for the city of Chicago, and we are all working together to ensure that the biennial continues with the full participation of the community.”In March, a group of fifty biennial exhibitors, including Jean-Michel Basquiat, Satyajit Ray, Julie Dash, and Karl Lagerfeldt, wrote to the board of trustees protesting the closing of the exhibition “Howl,” which was both a retrospective and a public art project. They claimed that the exhibition, which focussed on the work of American painters in the 1960s, was “closed to the public in violation of the city’s own bylaws.” The letter also claimed that the closing of the show violated the city’s agreement with the artists.After the letter was published, the city of Chicago released a statement saying that it would consider", "The next Biennial should introduce a new attraction, a new venue, and a new programme, which will demonstrate how art can be used to address issues affecting the most vulnerable communities in the world.” The deadline for the exhibition was March 18.\n\n\nThe Museum of Contemporary Art (MoCA) in Miami Beach has appointed John Scott as its next director. Scott succeeds Kate B. Smith, who was named interim director last week, and will begin his new role on March 4.“John Scott’s background and expertise in the field of contemporary art and his passion for bringing people together make him a strong choice for the role of director,” says curator and vice president of curatorial affairs Mona Hatoum. “He is an experienced and accomplished leader of a national contemporary art museum, and has made a career of championing the work of under-recognized, under-recognized artists and organizations, and championing the extraordinary. We are confident that he will continue to shape MoCA’s mission and to grow its collection and distribution network as we forge a new trajectory together with our community.”Scott comes to the institution from the Metropolitan Museum of Art, where he has served as director since 2014, and will assume", "The next Biennial should be announced shortly, with a presentation of the final works by the group of forty artists who made up the American People’s Art in the 1970s. Tickets to the event will be free for the first day only. The full list of participating artists is as follows:\n\n\nThe New Museum in the City of New York has added two new artists to its roster, following the announcement of its 2019 biennial, American Art. The actors were selected by a panel made up of Jane Panetta, the curator of the exhibition “American Art: Drawing from the Past,” and Joshua Helmer, the director of the Museum of Modern Art. The inaugural exhibition, “American Art: Drawing from the Past,” premiered at the New Museum in January 2019 and explored the roles of artists in reimagining American history through the artwork and sculpture of the past. Panetta and Helmer selected three artists to represent the United States at the upcoming Venice Biennale: Daniel O. Jackson, Luis Felipe Alarcon, and Nude Raye Abramović.The biennial will showcase work by forty artists, including artists who have been featured in the biennial in the past, as well as a selection of new", "The next Biennial should take place in 2021, when two of the five exhibitions will be staged by the new organization, called the Biennial 2, and will run concurrently on both levels of the museum. The inaugural Biennial 2 exhibition will be hosted by artist Wesleyan University’s Department of Art and Art History; the staging of the twenty-fifth Biennial will take place on the grounds of the Museum of Modern Art, and the ten-eastern part of the museum will be covered by the new organization.On October 31, the ninety-ninth edition of the Biennial will take place at the San Francisco Museum of Modern Art, and the ninety-fourth will be staged at the Museum of the Arts, Houston. In the years ahead, Biennial 2 and the eighty-third will continue to present original exhibitions, participate in special programming, and present the works of emerging, established, and established artists.\n\n\nThe Metropolitan Museum of Art in New York has hired Julia Hsu as its new deputy director of exhibitions. She will be responsible for developing and implementing the museum’s curatorial and programming strategy, and will take up her new post on January 6, 2021.“Julia is a capable and talented organizer who has demonstrated the", "The next Biennial should be held at the San Francisco Museum of Art (SFMoA). The 2019 edition, which will be staged in London, will have more than three thousand slides from “Avant-Garde” (1929–2004), a collection that was acquired by the institution in 2013 and which is currently on display in the London-based art museum, the Barbican, from the estate of the late British artist Edward Kinsley.The works are currently on display in the museum’s exhibition “Avant-Garde: Fashion and the Graphic Novel” and will be included in a special exhibition at the museum in 2021. \n\n\nMore than ten thousand demonstrators gathered at the Solomon R. Guggenheim Museum in New York on Saturday to protest billionaire industrialist Donald Trump, who has vowed to place a moratorium on new construction and drastically reduce the salary of those working in the visual arts.The action was organized by the People’s Action Party, a left-wing activist organization that was founded by Tom Watson, a former member of the Black Bloc, and Kenneth Harrison, a former union organizer for the US auto industry.Organizers gave the People’s Action", "The next Biennial should focus on ideas that promote the social and political relevance of Indigenous art, with a particular focus on the contemporary achievements of the Australian Indigenous.”\n\n\nThe Peabody-Essex Museum of Art in Salem, Massachusetts, has received a gift of twenty-seven works by sculptors Richard and Mary Ewing, including a drawing by Willem de Kooning, a painting by Robert Irwin, and a lithograph by Henri Matisse.The gift, which was organized by the Ewings through their company, Ewing Art Gallery, includes works by five artists whose respective families are longtime supporters of the Peabody-Essex Museum of Art: George Ewing, whose daughter and son-in-law are former board members; Dorothea and John Ewing, who are longtime board members of the Peabody-Essex Museum of Art; and David and David Ewing, who are longtime supporters of the museum.“The support of these families has been key to the museum’s ability to build an exciting and diverse collection,” said Mary Ewing. “Richard and Mary were committed to supporting the museum and ensuring that the museum thrived as a great cultural institution in the heart of Boston", "The next Biennial should be held in 2022. The three-day event will feature fifty works by eighty artists. The marquee artist for 2020 is HtH’s Tanisaburo, who will represent Japan at the Venice Biennale in 2021. His works will be exhibited alongside work by artists such as Kunihiko Nakayama, Taku Shinkai, and Takashi Tezuka.\n\n\nThe New York Public Library will pay out more than $1 million in damages after a New York–area building's roof collapsed during a show of work by artist Mark di Suvero, who was working on a massive series of photographs inspired by the city’s Hudson Yards development and named after the former site of the Port Authority Bus Station.The collapse occurred on November 30, 2015, at around 3 PM, according to the New York Times.The artist was working at his studio near Gramercy Park, when he fell about twenty stories, causing damage to his studio and to several neighboring buildings on the building’s first floor. The second-story, which is currently undergoing a major renovation, sustained heavy damage. The structural unit of the building, which houses a number of galleries and nonprofit organizations, collapsed as well.A", "The next Biennial should be announced in March 2020 and will be led by the Richard Mayhew Group, which has represented the artist in China since the 1980s. In an article published in the February 2018 issue of Artforum, Diller wrote that the new venue would be “a space of experimentation and experimentation on what it means to be an artist in the twenty-first century.” \n\n\nThe Museum of the Fine Arts (MoFA) in Boston and the De Young Museum in Los Angeles announced on Wednesday that they will collaborate on a new exhibition, “Loving” (2019), that will focus on people and art through a humanistic lens. The project, which was inspired by a post-election rally in which President Donald Trump called out former Vice President Joe Biden, will examine the relationship between love and fear and the intersections between humanism and politics.The partnership will encompass a new exhibition that will open in the fall and will also address political violence and the humanistic practices of grief and mourning. The show, titled “Loving Politics,” will explore love and politics through the lens of artists such as Tessa Balsom, Nina Cesarco, and Julie Dauman and will include a selection of works", "The next Biennial should take place in the spring of 2022.\n\n\nThe National Gallery of Art in Washington, DC, announced today that it plans to close its nearby location in 2020, citing the health and financial needs of its staff and the institution’s permanent collection. The institution, which serves more than 2.3 million visitors each year, said the decision was made in light of the Covid-19 pandemic and the need to address long-term debt service.The museum will remain closed until March 23, at which point the institution will begin a massive remodel, which will involve the opening of a new exhibition space for the National Museum of American Art and the reopening of all five of its locations. The National Gallery of Art’s current headquarters are in Alexandria, Virginia, and the National Museum of African Art, Washington, DC, and the National Museum of Women in the Arts, Los Angeles.“In light of the Covid-19 pandemic and the need to address long-term debt service, the National Gallery of Art has decided to begin the   process of eliminating more than one hundred positions across the institution,” said Nancy Spector, the museum’s longtime director and CEO. “We", "The next Biennial should take place in 2021 and will be hosted at the historic Elizabeth Boley Pavilion in downtown Huntington, New York. The final design is by Julie Bertrand, with funding from the post-Panama Papers crisis fund, the $10 million $15 million and the $15 million funds.\n\n\nThe Carnegie Museum of Art has released the first official statistics of the coronavirus pandemic, which has claimed more than 17,600 lives and caused at least 244,000 deaths. The first set of figures, which were released by the museum on Monday, reveals that the number of visitors to the museum has remained fairly stable throughout the pandemic—it is currently expecting around one million visitors in 2021.However, the number of people entering the museum has increased by 2.7 percent, to 1.5 million, and the number of visitors from out of state has increased by 13 percent, to 3.2 million. The museum expects to draw around three million visitors to its new home on the grounds of the M Museum of Art. The expansion is expected to cost $52 million and is slated to take about fifteen years to build.“We are encouraged by the preliminary data from the coronavirus memorials, which", "The next Biennial should be held in 2021, the year of the seventy-fifth birthday of the theorist Paul Cézanne. The next edition of the Exhibition will be held at the Museo de Arte Contemporáneo, in Barcelona. The Madrid Architecture Biennale has announced its 2020 lineup. The event will be hosted by the Muse of Modern Art, the University Museum of Contemporary Art and the Autonomous Institute of Design in Madrid, and will advance the work of several artists including Ghesquière, Merce Cunningham, and Mary Cassatt. The eighty-eighth iteration of the festival will take place in Vancouver. The world-renowned sculptor Mario Badescu, who is known for his large-scale works that are based on a large-scale urban environment, will also be involved in the biennial. He created the 2 nd International (1908–2009) in Rome and the 3 rd International (1909–2010) in Paris. This year’s event’s list of artists participating in the event is as follows: Artsistica, Laurent Ait-Las, Gabriel B. Sisi, Jaap de Groot, Eva", "The next Biennial should be held in 2021, and the first iteration in 2022. The 2018 event, “The Life and Death of Pablo” was the first production by American artist Pablo Picasso.\n\n\nThe Jackson Pollock Foundation announced today that its collection of forty-five paintings by Jackson Pollock will reopen to the public next month. The exhibition will include works by artists such as Mary Loter, Zanda, Paul Gauguin, and John Rynd, and will be held in the modern-day Museum of Contemporary Art (MoCA) in New York from March 23–March 27, 2020.“The foundation’s board of trustees is thrilled to announce that the Jackson Pollock paintings will be on view in the exhibition ‘Make Room,’” which is scheduled to open on April 3, 2020 and runs through May 2, 2020. The centerpiece of the exhibition will be the collection’s collection of eight paintings by Pollock’s eighteenth-century muse, Virginia Woolf, which is slated to be presented later that month.The foundation also revealed that it is planning to open a permanent home for the collection in the city of Memphis, Tennessee. The new museum, which will be", "The next Biennial should be an authentic reflection of the spirit, vision and excitement of the previous two, and should therefore be a new and exciting chapter of the life and history of the artist.”The 2019 iteration of the festival will take place in Bologna and will run for ten days; the 2020 edition will be held in Rome. The full list of participating artists is as follows: • Maria Bochere and Klaus Bochere (Germany) • Denis‐Peter Karlsson (Sweden) • Alfred Agnes (Sweden) • Benoit Mandel (France) • Anaïs Prouvé (France) • Bertrand Delanoy (France) • Danijel Dukovic (Luxembourg) • Erika Neesbæk (Norway) • Gregory Doran (United Kingdom) • Peter Hujar (New Zealand) • Cécile Prouvé (France) • Lionel Mayhew (United States) • Lionel Neustadt (Germany) • Sylvie Muholi", "The next Biennial should be held in 2020, with the deadline to be met by April 30, 2021. The exhibition’s 50th anniversary will be held in 2022.The exhibition will be hosted by the Museo de Arte Contemporáneo de Barcelona (MASC), and the Museo de Arte de Lyon (MASL). The exhibition will be accompanied by a book by artist Rintoul Gomes, entitled “The Wild Life of Art”; a film by the Danish filmmaker Lars von Trier; and several exhibitions and screenings.The fifty artists who participated in the event are as follows:Sayueb Al-NuaimiRaneem AkramHarman BanuRasha al-MubarakRachid SarsamEshmaa AbdulMunawar30Raufus AhmedSohrab AkramRavi ShankarBahar GhoshBajrangi KumarBhoomika AhmedBharat SinghBhuvan WijayaBhuvanwant VaidyaBikash ShindeBima SinghBindrej Pal SinghBikram SinghBiman GhoshBikyalagiriBiman Mohan SinghBiman PrasadBih", "The next Biennial should be held in London in 2021 and the first in New York in 2022. The Detroit Institute of Arts (DIA), which has been working to move to a new home in Belle Isle, Michigan, has committed to holding a new exhibition, “Beyond the Frame” in 2022. Although the institute did not specify when the show would commence, artist-in-residence Marlene Staehle, who works remotely, said that the event would include “independently curated exhibitions on the work of the biennial” and that she was “optimistic that the program would continue to develop and evolve.”\n\n\nThe Museum of Fine Arts (MFA) in San Francisco has accepted a gift of fifty-three works from the artist-in-residence program, which was launched in 2010 to advance the careers of emerging and established artists. The four works, which were recently gifted to the institution by artist Marisa Bachelet, were bought with a $22,000 donation from the artist’s father, who lives in the city of Mendoza, Mexico. The Museum will have a permanent collection of the works, which were acquired in the 1960s and 1970s,", "The next Biennial should be held in the Fall of 2020. The first was held in the Spring of 2019. \n\n\nThe Museum of Contemporary Art (MoCA) in New York is taking steps to mitigate the health effects of the coronavirus. The institution, which recently underwent a $300 million expansion, plans to institute new preventive measures, including in-home visits for people visiting the institution and could introduce free flu shots as early as next week.According to the New York Times, the Centers for Disease Control and Prevention (CDC) estimates that as many as 92 million people could be infected in the United States with the coronavirus. As of Thursday, the coronavirus has infected four states—California, Florida, Georgia, and Louisiana—and caused at least 568 deaths.The museum is currently closed until at least February 24, 2019, and will remain closed until March 29, 2019. The Whitney Museum of American Art, which is also temporarily closed due to a coronavirus outbreak, is still assessing the health of its permanent collections and the health of its permanent staff. The museum has been closed since March 23, and is predicting a further delay of six months. David Gandy, the director of the Museum of Fine Arts", "The next Biennial should be held at least twice a year, with a minimum of three exhibitions per year. Previous editions of the Biennials have featured works by artists such as Janette Laverrière, Jacky Sosa, and Rene Sache, with new works by artists such as Miuccia Cattelan, Sala al-Khalifa, and Laura Owens. Next year, the biennial will be the last, featuring works by twenty-three artists. In a statement, the gala’s organizers said: “We are thrilled to have been selected as the next Biennial of Art, made in the City of London and curated by an adult and an adult-oriented curator. We are committed to continuing our work in an international setting and developing new ways of connecting contemporary art and culture in the UK. We will continue to support and foster the local arts and culture opportunities in London, and continue to show work by young and established British artists and artists in the process.”\n\n\nThe newly acquired oil rigs and cranes that were used to facilitate the construction of the controversial Dakota Access pipeline—which would transport Bakken crude from North Dakota to Illinois, where it is processed by companies such as Shell, and", "The next Biennial should have been held in 2020. “We must now take all actions necessary to ensure a peaceful resolution to the conflict,” said Erdoğan. “I express my gratitude to the organizers, and to the Turkish people, for their outstanding work in connection with the 2017 event.”\n\n\nThe Paris-based charity Peace Corps has received a gift of $2.5 million from the private collection of Katsu Naito. The anonymous donor, who made the gift in recognition of his philanthropy, was a member of a close-knit group of collectors that includes Harriet LaDeBolt, the director of the Center for the Art of Man, and Tatsuya Takeda, the chairman and CEO of Masayoshi Son, the largest art distributor in Japan.Naito is the founder of Naito Art Club, a Paris-based organization founded in 2004 that brings artists together. It also has a branch in Tokyo. Naito donated the funds to [Naito Art Club] in recognition of his philanthropy, which is based on the notion that art creates a community and that the arts should be a platform for social change. Naito was born in Osaka in 1954", "The next Biennial should be held in 2021. \n\n\nCàtémão da Cão, the Brazilian Museum of Fine Arts (BMA) in Rio de Janeiro, has announced that it will not be able to continue hosting the 2020 edition of its exhibition “Magic in Motion”—a retrospective of the work of Brazilian artists such as María Berrada and André Pérez and a live performance by Brazilian artist and actress Julia María—due to the coronavirus. The curatorial team has come under intense criticism for its decision, which conflicts with the teaching of contemporary art by leading Brazilian university art historians, including Alfredo Pedrosa and Ferran Machado, who have urged museums to postpone the event until the coronavirus has been contained.“It is not our place to judge the health of others, especially our colleagues, and we are really struggling to understand how this can be a public health crisis on such short notice,” said BMA director Felipe Empoh. “We are deeply concerned about the illness and health of our colleagues, artists, visitors and the public.”Prior to the coronavirus, the BMA, which hosts thirteen exhibitions each year,", "The next Biennial should be held at the Montpelier Museum of Art until the spring of 2021. The museum is currently under construction and will introduce new exhibitions and research projects in the coming years.“The last few years at the museum have been transformative for the museum,” said museum director David H. Koch. “We now achieve our $30 million goal to permanently renovate the building and extend the life of the collection. We are convinced that the restoration of the Biennial will be unlike any other restoration project that the museum has ever undertaken.”The Biennial’s restoration project will involve the following three phases:The first phase will consist of the permanent installation of new works by American artists, including Robert Johnson, James Lynch, Harry A. Farley, and Robert Irwin, as well as a reopening of the museum. The second phase will include the creation of new interactive experiences to complement the museum’s main building, including new exhibition spaces that will invite visitors to visit the galleries to see works by contemporaries and well-known artists, as well as new professional photography and video installations. The third phase will include the reopening of the institution’s main buildings, including the Galleria Maria Feo, the T", "The next Biennial should be held in 2020, with the next iteration in 2022. The next edition will be hosted at the Musée de Lyon from 2021 through 2022.\n\n\nThe Walters Art Museum in Los Angeles has been awarded a $50 million donation from the Charles and Lucille King Family Foundation. The gift comes a year after it established the foundation in honor of its late founder, Charles King, who, through his wife, raised more than $30 million for the institution before his death.“Charles King created a unique and enduring sense of place within Los Angeles and beyond,” said John Walsh, president and CEO of the foundation. “A true visionary, he transformed the Walters into an art museum that reflected his vision of the arts and the world, becoming a champion of artists and his own vision for the institution. We are thrilled by the outcome, and look forward to continuing to work with Charles and his family to help them shape the future for the museum.”The donation includes a $35 million gift to the museum, which was founded in 2007 as a partnership between the Charles King Center for Arts and the David Horowitz Foundation, and a $25 million gift to the museum from the King Family, which first acquired the property in 1995.", "The next Biennial should be held in 2021. Artforum is evaluating the event and will update this article with any new information. In the meantime, take a look at the full list of participating artists below:\n\nLane Boyce, China: The Asian American Contemporary Art Museum in Beijing, which was opened in 1982 by the China-based artist Jia Yu, has announced it will be closed for a period of thirteen weeks, from March 15 to March 16, 2020. Due to the Covid-19 pandemic, the museum has moved the exhibition from the Ritz-Carlton Hotel in Beijing to the Sifangdao Contemporary Arts Center in Sifangdao, an industrial city in the northeast of Beijing.The announcement follows a February 2019 advancement in the art world when the Ritz-Carlton closed its Shanghai outpost in April of that year, and subsequent relocations of works by artists such as Cheng Ren, Lin Shao, Wu Liang, and Weiquan.The extension of the museum’s space in the historic Ritz-Carlton building, which is known as the Taishan Museum, is part of a larger plan for China’s cultural scene. China’s", "The next Biennial should be held in 2020. \n\n\nIn the weeks since a gunman opened fire on a group of people leaving a Donald Trump rally in Colorado Springs, Colorado, killing twelve people and injuring thirty-six, President Donald Trump has attempted to downplay the significance of the tragedy. In an interview with James Corden on CBS, Trump said: “I don’t think it’s that big of a deal.” While he did mention that the history of mass shootings is “very, very long,” he said that he thinks that the country is safer now than it was eight years ago. The president also said he thinks that the political climate is “under control.”Trump also told CBS he has already allocated $7.7 billion to stop the spread of Covid-19, and he said that he expects Congress will approve the funding soon. He also said that he has already made $4 billion in emergency spending cuts, and that he expects the government to remain shut down for at least eight weeks more. \n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Carolyn Taveras as its new executive director. She succeeds Jennifer Cook, who retired in March after", "The next Biennial should take place at the Art Institute of Chicago in 2021, and the sixteenth at the Museum of Modern Art in 2021. The twenty-first iteration of the annual event will be held in Chicago in 2022.\n\n\nThe Japanese architect Tadao Ando, who has designed for the Japanese firm Satec, is receiving a retrospective at the Museum of Modern Art in New York this summer. Titled “Contemporary Architecture of the World,” the exhibition represents his first time presenting a “Leviathan” and will include more than seventy buildings he designed for the firm, making its list of those he has helped to create his most enduring.Included in the retrospective are a number of Leviathans he designed for his first three firms, which he founded in 1995: the firm began life as Tadao Ando+Sonoda (later renamed Satec) in Tokyo, and Satec+Sonoda (later renamed Satec) in Saitama, Japan. In 2007, he merged with his second son, Tadao Nara, and the two have since had a number of projects under their collective tutelage. “It’s a massive event,”", "The next Biennial should be announced in three to five weeks. The exhibition will be held at the newly renovated and expanded Palazzo della Scala in Venice and will run from March 23 to March 27, 2020.\n\n\nThe Venice Architecture Biennale, which started as a joint initiative between the Italian architecture and design diaspora organization LAM and the international art museum ANA, has announced that it is reopening this month, March 21–March 25, 2020. The biennial will also celebrate the tenth anniversary of its founding.“We are feeling a great festive spirit at the new venue and at the new exhibition,” said Emilio LaGiorgio, the president of LAM. “The theme of the biennial is not so much about art as it is about the fate of the artist. It is a series of exhibition, educational, and collaborations between artists who have made significant contributions to art and architecture in the last twenty years. . . .We are now happy to announce that the theme of the exhibition will be ‘Integrity,’ and this will start with a reflection on the history of art. We will begin with a discussion of art and architecture as elements of a new cultural landscape.”The", "The next Biennial should be held in 2021.\n\n\nThe Metropolitan Museum of Art (the museum) in New York has announced the release of the finalist designs for the 2020 edition of the National Museum of African Art, the Museum of Modern Art, and the Museum of Contemporary Art, Los Angeles (MCA), as well as the 2018 and 2019 editions of the Museum of Modern Art, and the 2017 and 2018 editions of the Museum of Modern Art. The museums will all present presentations of new work in the coming months. The designations of the National Museum of African Art as a National Museum of the African Diaspora and the Museum of Modern Art as a National Museum of Art will be made by a committee composed of nine local, state, and federal elected officials.“The Government of the United States of America, through the museums and their federal partners, have long championed this region’s artists and thinkers, and have been instrumental in deepening our cultural and artistic ties with this continent,” said Elizabeth Cameron, the deputy director and chief curator of the museum. “We are thrilled to announce that these museums and Pérez Artes will participate in the twenty-fifth edition of the National Museum of African Art, and look", "The next Biennial should be in the spring of 2021. The next and third editions will be held in the grounds of the University of Oxford, in Oxfordshire, England, in 2022 and 2022, respectively. A fourth exhibition will be organized by the Institute of Contemporary Arts in the City of New York in the spring of 2022, coinciding with New York International Film Festival.\n\n\nIn a lawsuit against the Pennsylvania Academy of Fine Arts (PAFA), an Indiana man was awarded more than $1 million in damages after he took his own life in July, reports the Indianapolis American.The twenty-six-year-old man, who was found dead in his apartment on June 15, had filed a wrongful death lawsuit against the arts institution on July 5, accusing it of negligence and violating his civil rights by torturing and murdering him. His wife and the woman who was with him at the time of his death allege that they were unable to stop their husband from taking his own life and that the family is now in litigation.According to the suit, the family was concerned for their safety following an incident in which the man was apparently choked by another man and was then kicked out of the home. The suit also alleges that the woman who was with him at the time was", "The next Biennial should be held in 2020. The 2019 edition, which was organized by the Museum of Modern Art, featured works by artists including Yoko Ono, Robert Mapplethorpe, and Hélène Mardia.\n\n\nThe New York Times reports that in the weeks leading up to the terrorist attack on Paris in which 130 people were killed, the French government approved more than $200 billion in aid for France’s national museums, art galleries, and tourist attractions. Among the institutions that were targeted were La Marine, the Louvre, and the Louvre-Ascot. The Louvre and the Louvre-Ascot were, respectively, hit by eight explosions on Friday, January 7, and two days later, the Louvre experienced another explosion, and the Louvre and the Louvre-St. Denis also experienced extensive damage.The French president, Emmanuel Macron, declared the coordinated attacks on the four sites staged by the Islamist group Islamic State (ISIS) as a result of the Parisian government’s support of the controversial austerity measures implemented by the European Union and the International Monetary Fund, which were implemented in an attempt to reduce France’s massive budget deficit. According to France", "The next Biennial should be held in 2021. The first biennial will feature works by forty-two artists from twenty-six countries, including Germany, France, Italy, Spain, and the United Kingdom, and will run from February 11 to February 13, 2021. “We are pleased to have the opportunity to present this year’s Biennial in London, and to continue the exciting work of our talented artists in Paris, New York, and Hong Kong,” said Frank Westman, the director of the Biennial. “We look forward to the 2019–2020 season and to future collaboration with our international partners.”\n\n\nThe National Galleries of Scotland announced today that the institution has received a gift of thirty-four works by thirty-five artists, including Charles Atkins, David H. Dung, Ed Moses, Helen Cammock, John Gribbin, Mark Goodfellow, John McLaughlin, and Tom Robinson. The institution has also established the Art Gallery of Scotland as a major source of national and international art. The works, which are part of a series that celebrates the art of Scotland, were donated by a group of collectors that met in Edinburgh in 2018. The National Galleries of Scotland will donate", "The next Biennial should take place in 2021.\n\n\nHistory Museum Director Daniel H. Weiss announced today that the museum’s collection of over four hundred Jewish and non-Jewish artworks and artifacts will be restored by the Art Deco firm of Weiss & Weiss. The restoration project will include the renovation of the building’s interior and will take eight years to complete. The long-awaited project, which will be inaugurated by a major exhibition of work by the organization, “The Birth of a Nation: Art and Architecture in the Age of Civil Rights” (2019), will be hosted by the Museum of Jewish Heritage in New York.The restoration project was initiated by the Cultural Heritage Foundation of Israel (CHF), an organization that works with partners to develop and implement strategies for preserving and displaying Jewish cultural artifacts in Israel, the West Bank, and the Gaza Strip. The organization was founded by Israeli curator Moshe Weiss in 2014 as part of the cultural initiative “The Art of Resisting: Jewish Art from the Middle East, 1943–1967” (2016).Weiss is a professor of art history at the University of Haifa. He has previously worked with the National Museum of the American Jewish Movement in Jerusalem; the Labor and Cultural Archive", "The next Biennial should take place in the autumn of 2021. The biennial will feature an exhibition of works created by thirty-eight artists, including Javas, Nari Ward, and Mernae Sola. The exhibition will run concurrent with the Royal Academy of Arts, London; the London Biennial, which was cancelled last year; the Dusseldorf Biennale, which was staged in August; and the Oslo International Film Festival.The biennial’s theme of “sex, beauty, education, and self-preservation” is derived from the work of the artist Marianne Boesky, whose work often addresses questions of beauty and the body as well as the history of rape culture. She is perhaps best known for her work The Great Sleep, 1983–1986, which consisted of thirteen photographs—all of which were taken in the nude—that were presented in a series titled “sleep art” that was exhibited at the museum in 1987.The 2020 edition, “Sex in the City,” will be hosted by the Metropolitan Museum of Art in New York. The 2020 edition will be the first commissioned by the museum since the “permanent human landscape” was banned by the Supreme Court in", "The next Biennial should be held in May 2020. Štefanek , a new platform focused on contemporary art and artmaking in general, will host the first exhibition of the project “Art in a Nutshell,” which will follow the show in the fall of 2020. The 2019 edition of Art in A Nutshell featured works by twenty-four artists and featured a selection of new work by forty-four artists.Called the Future of Art?, the exhibition will be organized as follows: • Biennial Overview (17–March)• Biennial Triennial (March–March 2021)• Biennial Presentation (March–March 2021)• “The Future of Art”The biennial will open with a special exhibition of works by five female artists, including Sharmila Abidi, Nusratul Islam, Nusratul Islam, Swapanjeet Singh, and Saravanan Shibbagh. The exhibition will highlight the ongoing work of women artists in India and will enable the audience to see how their practices intersect with those of other artists, and to hear their stories.In the second exhibition, the Rani Murli Chair will present a selection of works by artists such as Arash", "The next Biennial should be held in 2021, said the organizers.The exhibition will take place at the Museum of Contemporary Art in the Arts (MoCA), in Los Angeles. “The exhibition will include works by fifty-four contemporary artists, including Amira Fadel, Ingrid Schäfer, William Thomas, and Frederik Pohl, and will include a selection of new works by female artists, and the first UAV art,” the Art Newspaper reported.In the exhibition “Planes,” the thirty-three-year-old artist, who used to work in the advertising industry, created a plane that would perform as a sort of workstation. The artist intended for the plane to be an extension of her own life. “The Planes’ work transforms the way I live,” she said.  \n\n\nThe Italian conglomerate Beppe Grillo’s Five Star Movement, which seeks to rebrand the Five Star Movement in Italy, has banned three prominent right-wing organizations: the Democratic Party (PD), the regional branch of Italy’s ruling center-left Democratic Party, and the Communist Party (CPM), which has denied the party the right to exist.In a letter dated", "The next Biennial should take place in 2022.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, officially announced today that it will donate its collection of more than four thousand photographs by American photographer Robert Irwin. The works, which have been on display in the museum’s permanent collection, will be made available online through the museum’s “social media platform,” the Los Angeles Times reports.The works, which have been featured in the current exhibition “Robert Irwin: Between the Sun and the Moon” and were part of a series called “Life, Death, and Photographs,” were acquired by the Museum of Contemporary Art in 2000 and are currently housed in the museum’s collection. They have also appeared in two other previous shows, “Robert Irwin: Between the Sun and the Moon” (2013) and “Robert Irwin: The Night Sky,” (2005), for which the works were reimagined by a group of twenty-first-century artists.The work in the current show’s “Art of the Imagination” section has received a major restoration, incorporating new archival and digital elements. The exhibition also introduced new themes, including photography", "The next Biennial should be held in 2021.\n\n\nThe Museum of Modern Art (MoMA) in New York has placed the final artwork on its upcoming exhibition “The Future is Present: Art and Politics in the Age of Color” in the public domain for the first time in its sixteen-year run. The work, titled The Intimate Present, was commissioned by artist and activist Elizabeth Anderson and is currently housed at the museum.The work, which was inspired by a crash in 2003 that left two people dead and seventy-two injured, was inspired by a “color revolution,” a 1992–93 MoMA–backed project that placed the final pieces of the “Art Deco” series in erspace. The show will now be held in the museum’s “Museum of Modern Art” on West Twenty-Second Street in Manhattan.To make the work accessible to the public, the museum created an online version of the show, which will be on view until February 3, 2020. The online version will include a new documentary, “The Color of Change” (2017–18), chronicling Black Lives Matter and the history of race in the United States.“I have been honored", "The next Biennial should take place in Tokyo in 2022. \n\n\n\n\n\nJohn Lehr, President of the University of California, Los Angeles (UCLA), has issued an apology for excluding authors whose work was funded by fossil-fuel interests and climate activists. ***The University has made a mistake in excluding authors who have strong connections to fossil-fuel interests.” Lehr wrote in a letter to the UCLA community. “I regret that I did not include these authors in my decision. I apologize to everyone who was offended by this omission.”The letter, titled “UCLA Statement on Climate Change” and dated January 8, also called out the academics who were excluded from the upcoming exhibition “The Future of Art: Climate Change and the Human Body” for having “a prior connection to climate change” and accused them of misrepresenting their research to support their arguments about climate change.Called for by artists and writers from across the globe, the letter emphasized that the “abstraction of climate science discussions at UCA does not reflect the values of UCLA.”UCLA Chancellor Nicholas Bochereau issued a statement on behalf of the school on January 12, shortly after the letter was published,", "The next Biennial should be titled “Between the World and Me.” “We are now in the process of building a new platform that will allow artists to present their work in an inclusive, contemplative, and interactive way. We are also actively working to present artists’ own stories through an artist-centered approach. We are excited to see what the public thinks of the new system and to see what artists create from the new platform.”The biennial will take place in Hamburg and will include three solo shows that will be shown simultaneously at the same time. The first, “Architecture and Design in the Art of Art” (2019), will present the work of thirty-three artists in a single exhibition. The second, “Sensuality and Eros: New York” (2019), will present eight solo exhibitions, each with a price tag of $3 million, and the third, “Thee are Not the Same: Constructivism and the Quest for Selfhood” (2019), will feature seven works by twenty-four artists. The first show, “Between the World and Me” (2019), will open in December of 2019 and the second show, “Thee are", "The next Biennial should take place in the Philippines, and the next will be in the United States. The 2020 edition will be held at the Taichung Art Museum in Beijing, and the 2020 edition will be the first of a planned fifteen-year cycle. The 2020 exhibition will mark the fiftieth anniversary of the National Museum of the Philippines (MMP). It will also mark the centenary of the institution’s founder, Emil Avila, and it will be inaugurated by a performance by Filipino folk singer and singer-songwriter Rina Sixto. The 2020 edition will deal with contemporary issues at the museum: Art, politics, philosophy, and language.\n\n\nThe Museum of Modern Art (MoMA) in New York has announced that it plans to shift twenty-nine of its fifty-thousand-work collection online by the end of 2019. The move, which will also include the digitization of eleven hundred artifacts, was made possible by a $500,000 gift from philanthropist and collector Jim Bob and Michelle Robinson.Jim and Michelle were instrumental in helping raise the $50 million to $75 million needed to start the museum. With the help of the couple’s charitable organization, the Jim", "The next Biennial should be around 2022. To my knowledge, all the major works have been chosen and placed into a museum context to reflect the themes, the contexts of the works, and the local communities that the artists represent, and to reflect the global present.”Museum director Joel Klein told the Art Newspaper that the committee comprised of Pablo Picasso, Guggenheim, Heinrich Neuschwanstein, and Werner de Vries, as well as French culture minister Franck Riester, decided that the museum would celebrate its thirteenth anniversary in 2021, when the institution was founded in 1994 and the following year’s anniversary in 2018.The new year will mark the first anniversary of the event, which will take place in the French city of Lyon. “The theme of the new year is ‘magic,’” Klein said. “We are very excited by the possibilities and the possibilities for artistic projects.”\n\n\nThe museum that catalogues over four hundred works by twenty-five contemporary artists is preparing to reopen on January 18 with an exhibition of work by artist-turned-multimedia entrepreneur Jana Rubell. The new site will be inaugurated by an exhibition titled “My Body�", "The next Biennial should be held at the Institut des Arts et littératures in Paris, which is currently undergoing a renovation, and will likely take place in the spring of 2020. The museum’s current collection, which comprises more than four hundred works by over seventy artists, will continue to be exhibited as a whole, but will be organized in smaller galleries.The upcoming exhibition, “Future Present,” has been criticized for its linearity and for its lack of a main subject, but it is hoped that the new format will appeal to a younger generation of collectors. The upcoming exhibition, which will be presented by the artist-run organization NAMI, is also slated to open on November 28, 2020.\n\n\nThe Smithsonian’s National Museum of Art, Washington, DC, has appointed Jillian Waldman as its next director. Waldman currently serves as the associate curator of modern and contemporary art at the Museum of Fine Arts in Boston, where she helmed the exhibition “Elizabeth Bishop: The Past Is Present” for five years and has curated exhibitions such as “Lily Allen: Paintings from the Archive” (2018) and “Eleanor Wells: Susp", "The next Biennial should be a celebration of the history of the biennial with a focus on the work of contemporary artists and the emergence of new kinds of contemporary art. We hope that the theme of the upcoming biennial will be “The Future of Art,” and that it will emphasize the significance of art and the work of artists.\n\n\nThe National Portrait Gallery in London announced today that Janet Smee, the first black woman to be appointed curator of art history, is to become curator of contemporary art. The new role was created to ensure that the gallery’s collections reflect the collective histories of London’s artists. Smee will take up her new post on September 19. Smee will be working alongside Matthew Fahey, director of Tate Britain, and Charlotte Proudman, director of Tate Modern, to create a new exhibition that will explore the themes of art and art history across four collections: the Commonwealth, the Metropolitan Museum of Art, the Serpentine Gallery, and the Tate. The exhibition “The Bones of the Modern World” will highlight the work of the late American artist and theorist Sloane Crosley and will also feature works by the late Brazilian artist Luiz Felipe and the late Nigerian", "The next Biennial should see a new selection of artworks from the film \"Aladdin,\" which opened at the museum on September 9. Inaugurating its halls will be a hand-picked selection of works by contemporary artists from the United States and the United Kingdom, curated by Britain’s Tate; and a documentary about the BBC’s New Politics Hour, which will explore the politics of art and the environment.The 2020 theme, “Digital Life and the Digital Body,” is “The New Human: From Materials to Meaning.” The museum plans to follow the example of the 2006 Winter Olympics in Salt Lake City, which featured both physical recreations of the Winter Games and a virtual reality experience of the games. The museum has also been working to promote the work of emerging and established British artists. The 2019 edition featured work by Andrea Bocelli, Adam Clayton, Colin Campbell, Antony Hudspeth, Lisa Lucas, Laura Owens, Adrian Piper, Alex Robinson, and Martha Richard. \n\n\n\n\n\nFrieze announced today that it is launching a new incentive program designed to encourage the creative industries to invest in the future of British Columbia’s economy. The program,", "The next Biennial should be held at the Indianapolis Museum of Art (IMMO) in 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in California, which was forced to relocate from its home in downtown Los Angeles, has announced that it is planning to open a new museum in the city. The institution will be named the Nevada Museum of Art (NMNA), and will be situated in the city’s historic Clark Street, a former food and beverage venue that has served as an anchor for the area’s arts and culture since 1957. Throughout its history, the museum has hosted some forty-seven thousand visitors, and has featured work by more than one hundred thousand artists. The museum’s current exhibition, “Suspicious Attractions: Art and Sexuality in the Early 1960s,” is a virtual retrospective of a selection of photographs by the American photographer Doug Ewen, who is famous for his splotches and for his “Ghostbusters” series, which follows a group of friends from the local high school and their sea of boyfriends.“Auspicious Attractions: Art and Sexuality in the Early 1960s,” will run from February 8 to February 10,", "The next Biennial should be held in January 2021. “It is my hope that the opening of the new biennial will be the occasion for an open, honest dialogue about the new reality and the ways that art and ideas are constantly being redefined in relation to each other and to the world we live in,” said Kees de Vries, CEO of the Biennale Foundation and the Venice Biennale, and Malaysia’s Minister of Culture, Yang Minhai.The project also established an advisory board of seven people, including Markus Schwabe, director of the König-Institut für Kunsthalle München; Jürgen Fiedler, a director at the Foundation for Contemporary Arts; and Pilar Otero, a director at the Foundation for Contemporary Art in Beijing. The board will convene again to consider the project at the end of the year.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles (MoCA LA), California, has released the list of seventy-six artists who submitted works for its upcoming exhibition “Theater of Operations: The Gulf Wars 1991–2011.” The exhibition is curated by American curator ", "The next Biennial should be held in 2021.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, announced today that it is moving the upcoming exhibition “Family Matters” from the Museum of Contemporary Art, which has been closed since February 27 due to Covid-19, to the nearby Santa Monica Pier, which will open on May 1. The move follows a year-long assessment of the museum’s collection and operations by the board of trustees at the institution. Its report, which was released on April 7, stated that “the current collection is not strong enough to withstand the continued use of the Pier’s facilities.” The board also called for the immediate reopening of the museum, and for the renovation of the building. The decision to close the museum has been made without public notice or consultation with the public, and has been made without the museum’s consent. The museum’s board chair, Scott Steiner, said that the board had made the decision “without any consideration of the possibility that the institution might reopen.” The institution is planning to reopen in early May.The move follows the completion of a $150 million expansion of the museum that added three hundred new works", "The next Biennial should be held in the coming months.  ArtsCenter will continue to support and advocate for the exhibition of work by international artists. We look forward to collaborating with the artists, our colleagues from the University, and the City of Miami-Dade County to present worthwhile programming that addresses the issues and challenges of our time.”\n\n\nHail American Art and its founders, the late artist-s-priests Irving and Edith Ross, for their pioneering work in bringing art and ideas of American art from Europe to the United States. The couple was awarded the Presidential Medal of Honor in Arts in 2016 for their monumental achievement. An early pioneer of the medium of photography, the duo pioneered the work of creating works for art and their own personal collections of American art and American photography. In an exclusive interview with Artforum, the couple discussed their legacy and the legacy of the image in America, drawing from the work of both Ross and Eisenman, and the impact of the image in their own lives and the lives of their families.When asked about the legacy of their legacy, the couple responded: “I don’t think anybody could have asked for anything more than this. We have been working toward this for twenty years", "The next Biennial should be held in 2020, with the first exhibition, “The Life of Art,” being staged at the institution in 2022. The new program will include an exhibition of work by twenty-three international artists and will incorporate a new branch of the Biennial, “International Photography Triennial,” that will focus on the stories of photographers.\n\n\nThe Carnegie Museum of Art (CMA), in Pittsburgh, has appointed Rebecca DiCenzo as its new president and CEO. She succeeds Charlotte Handy, who has served as interim chair of the museum since May 2020.“We are thrilled to welcome Rebecca DiCenzo to the Carnegie Museum of Art,” said Mary Catherine McCarthy, director of Pittsburgh’s City Hall. “Her years of leadership, passion, and innovation have delighted our guests, guests' families, and fellow museumgoers and visitors alike. We are very much looking forward to working with her.”DiCenzo, who is originally from New York, has been a member of the CMA for three decades. She was trained as a conservator in the mid-1980s and has since overseen the renovation and acquisition of eighteen buildings, including the former home of the Metropolitan", "The next Biennial should have started on September 23. It is slated to open in May 2020.The announcement of the interim champion came after a complaint from the branch of the museum that was hosting the exhibition—a group show on the AIDS pandemic, titled, appropriately enough, “The Present,” which was curated by Ashley Graham. According to the Art Newspaper, the staff member who filed the complaint claimed that the changes made by the exhibition were “toxic.” The complaint was dismissed, and now the pieces in question will be returned to the curator responsible for them, who will then have thirty days to dispose of the works or face termination.The criticism of the temporary exhibitions is not new. In June 2019, the Art Newspaper reported on the long-standing dispute between the British Museum and the Royal Shakespeare Company over the use of the title of the play The Present, a play that celebrates the current state of things, in a way that could be seen as an “anti-present.” In October 2019, the UK-based charity the National Union of Students (NUS), which represents over one thousand students, penned an open letter to the chancellor of the Exchequer, George Osborne, accusing the government of attempting to �", "The next Biennial should be held in 2021. The museum’s director, Christian Gross, said: “It is a very sad day for art history when we say that we no longer have the space to steward the legacy of the Biennale. We need to understand that this is not the end of the story. Biennales have not just proved that art can live on and could continue to thrive in the future. They have also shaped our conception of what art should be. Biennales have demonstrated that art can change the world.”\n\n\nThe Museum of Modern Art (MoMA) in New York has informed the estate of the late Italian architect and politician Giuseppe Cipolotti that it plans to sell the historic building—which houses a collection of more than 1,500 works, including a sculpture by Claude Monet and Michelangelo’s The Creation of Venus—to an Israeli art dealer in an attempt to prevent the heirs of the late leader of Italy, Mario Monti, from collecting any of the works in the building.Cipolotti’s widow, Carmen, told the Art Newspaper that the administration had made the decision in light of the Supreme Court’s ruling in favor of", "The next Biennial should be held in 2020, with the first exhibition taking place sometime between March and May. It will be organized in conjunction with the exhibition “The Life and Death of Art,” which will be staged at the Museum of Modern Art, Chicago, in 2020.\n\n\nThe Pittsburgh Art Museum (PMA) has become the latest institution in the city to organize an all-female panel of artists for its upcoming “Mirror Ball,” an exhibition that will feature a rotating cast of female artists in work titled “The Trap.”The exhibition, which will be on view from April 19 to April 20, 2020 at the museum, will feature work by forty-four artists, including Dahse Jum, Martine McLean, Tanya Martinez, and Tanya R. Martinez, among others from the New York–based nonprofit organization Mirror Ball Collective, including Martine McLean, Shimon Rozen, and Rachael Taylor.“We’re excited about this year’s exhibition as we’re working to reimagine the future for the Pittsburgh Arts and we’re working to reimagine the city for our Artists,” said PMA director John Eggl", "The next Biennial should be held in around ten years. Pace-museum director André Bütsebich, who has led the gallery since 1987, is not interested in returning to the GDR. He considers the museum to be too old for an exhibition about how to live as a Tibetan woman. Pace-MARTO, which has been housed in the same building as the GDR, announced on Wednesday that it is moving to a new location, the Nationalgalerie in the Hague. Its temporary space in the GDR will remain as a training center for future exhibitions.  Pace-MARTO’s new location in the Nationalgalerie is being designed by Kintsche Bostra Architects, who have designed the Artkal Tower in GDR and the Nationalgalerie in the Hague. The new museum is one of the first new cultural spaces built in the GDR since the fall of the Berlin Wall. The GDR’s former cultural director, Julian Beckes, died in 1999, and its former director, Wolfgang Koppel, later joined the Berlin gallery in 2015 in an appointment that marked the end of the institution’s temporary existence in a building in", "The next Biennial should take place in 2021. The exact date has yet to be determined.\n\n\nArt Institute of Chicago (AIC) director Hillel Sloviak will step down in March 2020 after serving as interim head of the prestigious museum for more than twenty-five years. In a statement, Sloviak said: “I’ve been involved in, and proud to serve, as director of the AIC for twenty-five years, and I’m ready now to take on new challenges and to continue to shape a wonderful collection of works by leading contemporary artists.”AIC, which celebrates the work of seventy-three artists and has a collection valued at $122 million, announced its initial lineup of artists for its twenty-second edition, “Sensate of Art.” The ten-person curators will premiere their first project in February 2020, “Sensate of Art: The Masquerade.” The exhibition will be hosted at the AIC. AIC recently commissioned twenty new works by thirty-two artists, including Yayoi Kusama, Shakira Tezuka, Jürgen Todt, and Max Ernst, and will stage its first retrospective of their work in March 2020.", "The next Biennial should have a direct and immediate participation in the ongoing movement of the Paris Commune. If we fail to act, the historical memory of the Commune will not be able to live on.”\n\n\nThe Italian architect and founder of the house known as the Italian Renaissance Institute (IRI) Beppe Grillo, the president of the Italian state of Trentino, announced today that he will not run for re-election in 2022 and will step down from the helm of the institute, which was founded in 2006 as a project to preserve the work of late Italian architect Paolo Catellani. Grillo, who has served as the president of the institute for over two decades, will assume the chair of the university of Piedmont and will take up the post on January 1, 2023.“I want to extend a warm welcome to the new members of the board of trustees,” Grillo said in a statement. “It is an honor for me to be able to return to Trentino, to lead the university into the future and to continue the work of my predecessors.”The institute, which has served as a hub for contemporary art research in Italy for more than sixty years, was rocked by a", "The next Biennial should begin with a retrospective of the work of an emerging or pioneering artist and be curated by an internationally-recognized curator. The exhibition should also explore the interplay between art and politics. The submission period for the 2019 edition of the Biennale will run from April 6 to April 11. The 2019 edition will be held at the Royal Academy of Arts in London. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is planning to shutter its doors for a period of twenty days in order to complete a $200 million expansion that will, among other things, add a new section on the ground floor of the institution. The museum previously announced that it would close its doors on March 29 and relocate to a new $550,000 space in the city where it will remain open throughout the duration of the pandemic.“This year’s event was a milestone for the museum, a breathtaking achievement of new museum-building and of the reinstallation of the museum in Los Angeles,” said John Graham, chairman and CEO of the museum. “Following a review of the museum’s sixty-three-year history, it was concluded that it was the right thing for the future of the", "The next Biennial should take place in 2021. \n\nThe Renaissance Society in New York has appointed Paul Mpagi Sepuya, who has served as the director of the Museum of Modern Art in the Warehouse District, as its next director. Sepuya was appointed by museum board chair Martha Steinglass in conjunction with the reinstallation of the museum’s current exhibition program, “Renaissance 4: The Rehearsals,” which is free to the public.Steinglass told the New York Times that Sepuya will be tasked with driving through the museums’ current collection in an effort to “remind' the public that the Renaissance Society is ‘in the public’s back yard.”In order to ensure a continuity of programming in the event of a shutdown of the institution, the museum will continue to display works from the Renaissance Society collection on display in its main building, which is currently undergoing a $50 million expansion. However, the redesign of the Renaissance Center has shifted the focus of the museum from a dedicated public gathering space to a “center for creative research and education.”\n\n\nThe National Museum of Scotland is preparing to reopen to the public in August with", "The next Biennial should focus on the development of new and contemporary intellectual and creative practices that engage the history of art on the African continent, and should include a wide range of contemporary artists from the United States and around the world. Biennial directors will be selected by the São Paulo Art Museum and the Museu de Arte Contemporáneo in São Paulo.\n\n\nThe Saint Louis Art Museum (SLAM) in Missouri has received a welcome gift from the Los Angeles–based, nonprofit organization, the Andy Warhol Foundation, which plans to offer free admission to one artist\u0097Josh Beck, whose work has just been released online for the first time in more than twenty years. The performance installation, titled The Unseen, will bring together the artist’s work and the institution to celebrate his passing and to mark Warhol’s eighty-fifth birthday.Beck, who was a prolific painter and printmaker, was born in New York City in 1937 and moved to the West Coast in 1963. By 1975, Beck had turned eighty-seven and was nearing completion of a two-year show at SLAM. In 1977, the Andy Warhol Foundation donated $100,000 to the museum, which commissioned Beck to create a", "The next Biennial should be a “renewed understanding of the future.”\u0097The film festival will be held at the New Museum in New York from September 22 to September 28.\n\n\nThe Metropolitan Museum of Art in New York has appointed Patricia Arsenault as its next executive director. Arsenault comes to the institution from the New Museum, where she was the founding director of the branch of the museum called the Met Pavilion. She succeeds Andrew Kreps, who retired in July 2019 after a decade at the helm of the institution.“Patricia is a clear and concise vision for the future for the Met,” said Kreps. “Her ambition and drive to advance the Met’s relationship with our community, as well as the Met’s ability to draw in new audiences, sets her apart from the rest. She has been instrumental in shaping the Met’s collection and our relationship with the neighborhood, and I’m excited to see where she takes the organization going forward.”In her new role, Arsenault will work closely with the private sector to strengthen the museum’s collection, develop programming focused on women artists and activists, enhance educational initiatives, and expand its public", "The next Biennial should focus on the legacy of Richard Avedon, a leading curator of African art whose work explores the interconnections between the Americas and the rest of the world. The exhibition should take the form of a “historical exchange.”\n\n\nThe nineteenth iteration of the Diller Scofidio + Renfro triennial, which kicked off in 2005 and ran until 2010, has announced that the event will be canceled. The announcement follows a series of statements by prominent cultural figures that have called for the exhibition to return. Diller Scofidio + Renfro, which takes place in Rome, is an annual event that aims to highlight the work of contemporary artists. The fifteenth edition, “Against the Glaciers” opened on May 2 and has since been canceled. “The new Artforum Group, which was started by a group of artists from the South American region in the hope of developing a coherent strategy for the future of the exhibition, is the only logical possibility,” said Jorge Gombert, the president of the Diller Scofidio + Renfro Foundation. “It cannot be a combination of exhibitions, conferences, and workshops that will bring the", "The next Biennial should focus on the interdisciplinary approach of art and design with a particular focus on the history and development of the Biennial. The museum should also explore whether design and art can coexist in larger cities, given the current political situation.\n\n\nThe Museum of Modern Art (MoMA) in New York announced today that it is planning to shutter its fifteen-thousand-square-foot space in the former Hurst Manufacturing Company in downtown Detroit, which opened in 1974 and has been a longtime home of American art. The landmark institution will move its primary exhibition space, a contemporary art museum, and its collection to its adjacent space in the former Cuyahoga River Works, which is currently undergoing a $270 million expansion.The museum’s director, Marc Glimcher, said: “We are thrilled to move our collection to one of MoMA’s locations, and to do so in a way that preserves the quality of work we have always done. The Hurst building was designed by the same team that designed MoMA, and has the same distinctive character. The Hurst building has always been a museum of modern art, and the MoMA team has always been dedicated to cultivating and supporting the Museum of Modern Art.", "The next Biennial should take place in 2021, at a time when the global health crisis has reached all levels of society. It should not be postponed.”\n\n\nOrganizers of the Venice Biennale announced today that the event’s programming will be shifted to a “precautionary” format, with the exhibition’s final exhibition, “An Unfinished Business,” scheduled for exhibition day September 17. The decision was made amid the coronavirus outbreak in China. While at the same time the coronavirus outbreak in the US has been growing, in recent days it has also been slowing. The first cases of the virus in the US have been confirmed in New York state, and the first cases in New York City have been confirmed in five cases. The coronavirus outbreak has also led to a temporary closure of several US cities, including Chicago, which announced on Monday that it will remain closed through at least the end of the month, and New York City, which will remain closed through at least the end of August.The exhibition, which was developed by artist-run nonprofit Artemisia, will now be held at Museo di Spazio, Italy; the Museo da Rimini, Italy;", "The next Biennial should be hosted in the spring of 2021.­\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Janet Kramer, who has served as a curatorial assistant at the museum for the past three years, as its next director. Kramer will assume her responsibilities on January 28, 2021.Kramer previously served as director of the Museum of Contemporary Art (Los Angeles) in LA, where she helmed the exhibition program throughout the venue’s five-year run. During her tenure, she oversaw the reinstallation of the Museum’s first museum-wide public art installation, “3-D: Contemporary Art in 3 Dimensions,” and facilitated the transformation of the institution’s collection in order to offer more permanent exhibitions.“Museum curators constantly confront the notion of curating the next Thierry Rech, and we are optimistic that Janet will turn the new MoCA into a model for thinking through the museum’s future programming,” said Steven L. Cohen, chair of the board of trustees and director of the New Museum. \n\nThe show “Framed: The Art of Making Pictures,” a collaboration between the Museum of Modern Art and", "The next Biennial should be held in the autumn of 2021. The full list of participating artists is as follows: Art Gallery of New York, New York: The Art Gallery of New York will kick off its 20th anniversary in June 2019. Beth Martin Gallery, New York: Established in 1994, Beth Martin Gallery is a contemporary art center located in the heart of New York City. The institution is re-launched this year with a new iteration of the Biennial. It will begin by hosting a special exhibition of work by artists such as Lucie Mamet, Nell Doran, and Iris M. An the show's opening reception, which will be held on May 25, will be followed by a public reception celebrating the institution’s first year of operation. Art Institute of Chicago: The museum will inaugurate its new 45,000-square-foot headquarters on August 19 and will host an exhibition of work by artists such as Harry S. Truman and Louis Vuitton Louis Vuitton: “After a century of designing for and exhibiting art, we are pleased to unveil a new opportunity to be a modern institution.” The Metropolitan Museum of Art: The museum will open its new twenty-three", "The next Biennial should be held at the Amsterdam Art Museum (MoMA) between April and August 2021. On Saturday, May 31, the museum will mark the end of its seventy-five-year-old collection with an exhibition of new works by the artist-in-residence, Kiki Smith. Smith, who has resided in New York City for almost forty years, will be given a retrospective at the museum on Saturday, June 7.Under his guidance, the museum has evolved into a major hub for contemporary art. The revolving collection currently holds more than two hundred works by David Hockney and his wife, Angela; Eleanor Graham; Ming-Na Wen; and Hermann Hesse.In addition to exhibitions, the museum hosts several large-scale events annually, including the annual Beyond the Frame event (2018), the 50th Anniversary of the photography exhibit Tangerout: Der Kunst’s Secret Garden (2019), and the first Tangerout–inspired sculptures (2016).\n\n\nThe Smithsonian American Art Museum (SAAM) in Washington, DC, has appointed Sarah M. Collins as its next executive director. Collins, who has served as the museum’s deputy", "The next Biennial should be an exhibition of the work of the twenty-five artists who were selected for the thirty-eighth edition of the Biennial in 2020, a selection of three hundred works from the collection. Among the works selected for the 2020 edition are Rechberger, Sze Cheng-Fu, Manfred von Karajan, and Renzo Piano.\n\n\nThe National Gallery of Art in Washington, DC, has received a gift of three hundred works by Pierre-Auguste Renoir from Charles and Lucille Renoir, the parents of the renowned avant-garde French painter. The gift includes works from the family’s holdings dating back to the late nineteenth century and is one of several Renoirs have donated to the collection, dating back to the 1970s.The museum also revealed that it has placed the ten-by-eight-inch photographs by Renoir in the collection’s permanent collection. The museum plans to display the works in a future exhibition “in the center of Renoir’s studio,” which is currently undergoing restoration.\n\n\nThe French city of Reims, the birthplace of the painter Auguste Renoir, has received a major donation of forty-five works from the family", "The next Biennial should be held in late spring or early summer, in both Paris and London.  Bodega Boccata’s plans for the centenary year were announced last March; the artist’s widow, Elena Bodega, told Artnet that the Biennale will take place in Bologna, Italy, in 2021.The curator of the event, Katya Orchard, will be based in London from May 15 to May 18. The artist’s daughter, Durya Orchard, will curate the event along with the artist. The biennial will highlight the resilience of contemporary art and will be driven by the artist’s desire to create works of art. Bodega Boccata will receive another €24,000 from the charity Arts-Tours, which is based in collaboration with the artist. The first edition of the Biennale, held in Venice in 2007, featured works by twenty-seven artists. The winner of the €75,000 grand prize, the artist and designer Fernando Branca, created a sculpture for the show, titled Bodega Boccata: Anachronism, that was exhibited at", "The next Biennial should be announced in the coming weeks and will be open to the public during the week of February 21, 2020. It will be held in conjunction with the 2019 edition of the Berlin Biennale.\n\n\nThe Walker Art Center in Minneapolis announced today that in celebration of its centenary, it is reopening with a new, more ambitious programming that will include more exhibitions, more education about the history of art, and more programming.The new series, called The Vision, is an extension of the core program of the Walker, which has always been about cultural exchange and community. The first part of the biennial, “The Art of Scale” (2019), followed the artist Ori Balbi’s history of scale art, his 3-D sculpture works, and his works on paper, including his “Toberg Kamer–Tuchelf” (1988), a flat-screen TV set that rotated on a circular platform in the center of the Museum. The second part, “The Art of Movement,” (2019–20), will be an exploration of the history of motion art, as well as the art of making and movement. “After a decade of creating work, I", "The next Biennial should aim to address the current State of the Art in the Art of Art, and should aim to emphasize the positive influence of art history on the lives of the artists who have worked so hard to make it possible.”The full list of participating artists is as follows:\n\n\nThe American Institute of Art (AIA), the New Museum, and the Museum of Modern Art in New York are among the major arts organizations that are currently facing a legal complaint from New York residents who believe that they were unlawfully evicted from their buildings in the city in March 2019 and then refused to return the structures to the residents upon their request. The lawsuit was filed by Adrian Kaba, a Manhattan resident whose house was one of the ten structures seized by the New York Civil Liberties Union (NYCLU) in a massive legal action over the equitable distribution of public artworks and was settled last month.“The protest that led to the eviction of my home was sparked by an architectural exhibition at the institute that included works by artists such as Jean-Michel Basquiat, Terrence Malick, and Marc Chagall,” said Kaba. “The works were moved to the storage facilities of the AIA, which has an operating budget", "The next Biennial should be staged at the Hungarian Polytechnic University (Špoc) in Budapest between April and September 2020. Čvarblatt’s research center will be relocated to the Museum of Contemporary Art (MCA) in Vienna and the institution will be transformed into a multimedia studio. The institution will be inaugurated with a series of exhibitions, curated by Karl Lagerfeldt and featuring a range of contemporary artists, including Péter Székely, Béla Ginn, and Skarstedt.\n\n\nThe Metropolitan Museum of Art (the museum) in New York announced today that it is planning to open a new public art space in the city’s SoHo neighborhood in 2021. The space will be called the Met; it will boast twenty-one acres of public artwork, including a sculpture garden, a rooftop garden, and a micro-brewery, and will serve as a mega-museum. The museum will open with a ribbon-cutting ceremony in the spring of 2021.The Met’s inaugural retrospective, “At the Met,” will be hosted by the museum and will feature work by forty-eight artists, including David H. Goddard, Mark di Suvero", "The next Biennial should be held at the venue in 2021. \n\n\nZoë Quinn is planning to sue the National Geographic Society (NGS) in an attempt to prevent the institution from closing after it revealed plans to expand its campus in Bristol, England, through a $1 billion expansion. Quinn is accusing the museum of violating its contract with the National Geographic Society by refusing to pay royalties for the design of a new building and by participating in a survey of the new campus that is scheduled to take place in 2021. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that James Fadiman has been appointed as its new executive director. He will assume his responsibilities in January 2020 and will take up his new post in January 2021. Fadiman comes to the institution from the Los Angeles County Museum of Art (LACMA), where he has served as director since 2015. The museum also represents the biennial Untitled (2014), which explores the relationship between the artist and the natural world. Fadiman succeeds Eric Fischl, who departed in March after eighteen months to head the Arizona State University Art Museum in Phoenix, and will begin in his new role in January 2021.Fadiman will also oversee", "The next Biennial should take place in the spring of 2020. Scheduled to begin in the summer of 2021, the exhibition will show work by artists from around the world as well as present a selection of works by women artists. \n\n\nThe National Art Library in Washington, DC, recently received a $2 million gift from philanthropist and collector Margaret and Charles Darwin Fund. The family, who have been devoted patrons of the museum since the late 1980s, donated the building and grounds of the space they recently renovated. In return for the gift, the library will receive 100,000 works, beginning with English poet Susan Manning’s “God” (1937), and ending with Simone Leigh’s “The House I Live In.”The museum will also receive a significant collection of photographs by American photographer Alfred Stieglitz, of the recently restored Benton-BYD plant, and will be given another 5,000 photographs by Victor Vasarely, a pioneer of European photography, and will launch a new round of programming with the works on view. The works will be presented in a new exhibition titled “The New American Photographs,” which will run at the museum through February 22.“The National", "The next Biennial should tell the stories of the past, present, and future, with a view to transforming people’s lives. The inaugural exhibition was held at the Millenium Building in London in 2017.In an interview with the Sydney Morning Herald in 2018, Shortland acknowledged that he was “still a little bit behind,” and claimed that the organisation “lacked a certain kind of momentum.” He also said that he would work with new artists, but would not have the power to commission them.\n\n\nThe Museum of Fine Arts (MFA) in Boston, which is currently undergoing a $100 million expansion, announced today that it has received a gift of fifty-nine works by the late Polish-American sculptor Wojciech Dziesławieński, a Hebrew alphabetist and iconoclast known for creating works in all forms of white, gray, and black. The gift includes forty-two works by his wife, Petra, and includes works that have never been publicly seen by the couple’s numerous heirs. The works were discovered during a 1977 excavation of the artist’s former site in the city of Wrocław, which was constructed in a quarry, and", "The next Biennial should be held at another location within the city of London. In a statement, the venue said: “Since our announcement in November 2016, we have had a wide-ranging and enthusiastic response from both audiences, and now we are excited to announce that the 2019 edition will go ahead at the Museum of London. It will be a very different event to the one that will be staged at the Pavilion. There will be a truly international, interdisciplinary, and contemporary theme. The 2019 edition will be hosted by the Museum of London, in partnership with the Department for Culture, Media and Sport (CMS), and will be staged in conjunction with the UK’s 150th anniversary celebrations. The event will be supported by a £60,000 grant from the Prince Albert Trust, an initiative established by the Royal Albert Hall, and is backed by the Koons Foundation and the Leverhulme Trust.\n\n\nThe Hirshhorn Museum and Sculpture Garden in Washington, DC, has accepted a $10.5 million gift from the Sidney and Lois Brailschutz family, the billionaires who ran the eponymous family business, which provided financing, management, and intellectual leadership for the institution through the late teens", "The next Biennial should take place in 2020, and the inaugural exhibition will be staged in the city in 2021. This year’s event will be the first organized in the United States.\n\n\nThe Italian architect and philanthropist Eduardo Paolozzi has been chosen as the next director of the Art Museum in Bologna. Paolozzi, who has been director of the institution since 2011, was elected by the Triennale, Italy’s leading cultural association, to the post of director of the Museo di Palazzo Realex, the city’s grand residence. Paolozzi will assume his post on August 1.“I’m extremely happy to be the next director of the Bologna Art Museum,” Paolozzi said. “It’s the perfect combination of qualities: a museum on the waterfront, a center of artistic activity and literary studies, and an institution that is committed to the cultural life of the city of Bologna and the region.”Paolozzi first joined the Bologna–Milanese neighborhood group Galileo in 1927, and the Lausanne–based company in 1947. He has headed the institution in various capacities, including director of collections", "The next Biennial should be held in New York in 2021. The show will be held at Rockefeller Center from March 23 to March 26.\n\n\nThe University of Minnesota has appointed Richard Sandom to its board of trustees. As part of an agreement between the institution and the Sandberg Foundation, which supports arts education and research, Sandom will serve as chair of the board of trustees. He will take up the post on July 1.“Richard is a distinguished scholar and advocate who has made transformative contributions to the field of contemporary art through his scholarship, curating, and curating of the National Art Museum’s exhibition program,” said Sandberg Foundation president and CEO Jennifer Barry. “The work of Richard, his colleagues, and of our outstanding curators, scholars, and scholars-to-be is to be admired.” The foundation also supports the museum’s art conservation program, encourages the collection of contemporary art, and offers grants.Commenting on his appointment, Sandom said: “I am honored to have been selected as chair for the fifth year running. I am grateful to Sandberg Foundation, to our board of trustees, to my colleagues and board of trustees, and especially to the board of trustees for understanding", "The next Biennial should focus on “art and culture” in that it has been the subject of so many projects over the past twenty years. The theme of the 2019 edition is “design and the city.” The theme of the first Biennial was “the city and the world.”The 2019 edition will have an opening ceremony at the Stedelijk Museum in Amsterdam on December 29 and will run for thirteen weeks. The exhibition will be inaugurated by a show of work by artist Hetain Abdullah, whose works are currently on display in the exhibition “Biennial: One Life at a Time” (2019) at the Palais de Tokyo, Paris, and the Art Gallery of Modern in London.\n\n\nTeixeira Art Museum-Florida​ (TEIXEira) has appointed Valentina Borowy as its first director of programming and community engagement. Borowy has been hired to lead the museum at the former Coca Cola bottling plant in downtown Miami-Dade County, Florida, from its current location on the third floor of a nondescript brick building on the east side of downtown. The newly renovated venue will be inaugurated by a new show of work by the Brazilian play", "The next Biennial should be held at the university’s Art Museum, then at the University of Toronto. “I’m really excited to try to make a mark on the city with this exhibition. We will bring together a diverse group of artists to explore the ideas of community, identity, and migration in a way that truly engages the city.”Organizers are also encouraging public art to play a more significant role in attracting visitors to the city. “Toronto is at a turning point in its history,” said Artnet editor-in-chief Jennifer Robles. “We are witnessing a remarkable transformation in our city, from a relatively small and isolated collection of more than five hundred works in a single space to a vibrant, diverse, and inclusive collection of more than one hundred thousand works. We hope that these works will bring a new sense of purpose, inspiration, and connection to the city.”\n\n\nThe National Gallery of Canada has named David McAllister as its next chief executive officer. The appointment was made in recognition of McAllister’s achievements and contributions to the country’s art world. He succeeds Margaret McAllister, who has led the gallery for more than twenty years.", "The next Biennial should be held at least once a decade. Remarking on the work of the last three years, the artist said: “It is my hope and belief that this year’s Biennial will focus on questions of continuity and suggest what a future might be.”The board of trustees of the American artist-run nonprofit Artadia, including Christopher Ryan, director of the nonprofit; Linda Albright, president; and Julian Gros, secretary, announced the new member chapters of the American Artists’ Association (A.A.) and the Arts Museum Association (A.A.A.) at a board meeting in New York on Wednesday. The former is an affiliate of the National Association of Art Museum Directors and the latter is a member of the A.A.A. The upcoming biennial, titled “Culture and Design” and curated by Catherine Opie, will highlight seventy-five works by forty artists from forty-five cities across the United States. The new members of the A.A.A. are Jonathan Habibi, Ali Gogole, Laura Owens, Dylan Andrews, Ali Hsu, William Olander, Chris Ramsden, Robert Rauschenberg, and Yinka Sh", "The next Biennial should be held in the spring of 2020.The Pérez Art Museum São Paulo (PAM) in São Paulo, Brazil, is also planning to move its summer exhibition, “Sensate: Color” (2019–20), from June to October. The exhibition, which is curated by Renata de Castro, is currently on view until October 22.Brazilian artist and designer, Orlando Alves, has been awarded the Prix de l'Orient, the prestigious award for artists. The ninety-one-year-old artist will receive $21,000 in monetary and art prizes. The selection committee comprised of Sergio Coelho, Fabiana Silvestri, and Gianluca Roser, as well as the Pilar Rodríguez Foundation, were given the honor.“I’m so thrilled that this year’s Prix de l’Orient will be the last,” said Alves. “I’ll start by painting again and continue in my art form in the following months. I hope to return to my usual spectacular style soon, for the human race. The past is eternal and in my future I", "The next Biennial should be held in 2020, at an estimated cost of around $10.5 million. The first three years of the project have already proven a success. While the opening of the first exhibition was delayed by a year because of the Covid-19 pandemic, the jury decided to move the event to the second half of 2020, noting that the museum would have to address the city and region’s needs in a timely manner. “I’m hopeful that, in 2021, we will have returned to our original vision, to take the Biennial forward and explore new models of collaboration, new opportunities and new challenges,” said curator and Vice Chair for Arts and Design Anna-Marie Debonneville. “This is not just a festival about art, but about the future of art and architecture, and I’m hopeful that we’ll be able to deliver a show that is meaningful and that is also truly international, and that can really engage with our neighbors and the world.”\n\n\nThe French Ministry of Culture has launched an investigation into whether the Parisian Louvre has been compromised by foreign hackers, reports the New York Times. According to a report in Le Monde, the", "The next Biennial should be held in 2021, according to an announcement on the Smithsonian’s website. The next iteration of the exhibition, “The Healing Power of Place,” will be presented by the National Museum of Indigenous Arts and History in Washington, DC, in 2021.  The first edition of the exhibition was held at the Smithsonian’s National Museum of African Art (NMNA), in Washington, DC, in 2007. The next iteration, titled “The Healing Power of Place,” will be held at the National Museum of the American Indian, in Boise, Idaho, in 2020.The United Kingdom’s science and technology museum, the National Museum of Westminster, announced that it received a gift of sixty-six artifacts from the National Gallery of Scotland, which is currently undergoing a £13 million expansion. The institution also revealed that its collection of nineteenth-century rare books will be given a major refurbishment, and that it will include more than 1,500 objects from the Scottish Museum, which was founded in 1869, in a new exhibition opening in the autumn of 2021. The new venue will be named The National Institution of Scotland, and will be inaugurated by a biennial of works by artists, including John", "The next Biennial should take place in 2021, according to Griffith, and a new chapter of the Biennial should also begin in 2022. The organization’s board of trustees also revealed that the upcoming edition will be comprised of artists whose work was created in the United States, while the exhibition will return to Los Angeles for a second time when the exhibition reaches the city in 2021.The executive director of the institute, philanthropist Wayne Pacelle, said: “We are really looking forward to this year’s Biennial, which will feature some of the most extraordinary and previously underappreciated work of our time, and this decade of artistic experimentation and experimentation will be the highlight of the biennial’s twenty-fifth edition.We are thrilled that the next iteration of the Biennial will be curated by Mia Freed, the chair of the biennial’s board of trustees and Mia’s husband; Peter Meehl, director of the Los Angeles County Museum of Art; and will feature work by artists whose work is currently understudied or unavailable for exhibition. At this defining moment in the history of art, Mia and Peter are committed to supporting the work of the future.”\n\n\nThe MTA announced today that it will", "The next Biennial should be held in 2020.\n\nThe Art Newspaper has learned that a new €50 million prize will be presented to artist Taras Shevchenko. He will receive the Golden Lion for his work Sofia, which will be on display in the first exhibition of the new Liszt Foundation at the Gallery of Modern Art in Miami Beach in June 2020. The exhibition will feature work by more than thirty artists, including the American artist María Berrada, who was nominated for the prize in 2019 and was selected for his work Antilasia’s Glass House in 2019, and Rendering the Oral History of Alexander Graham Bell.Commenting on the award, Rodrigo Pérez-Villar, the founder and curator of the new Galeria Mondial in Madrid, said: “Taras Shevchenko’s rendering of the history of the automobile, with its many incarnations in architecture, landscape, and sculpture, is the essence of the new Liszt. We are thrilled by his nomination and are confident that his work will be showcased in the first show of the foundation in Miami Beach. The award is immensely gratifying as it means that the work of the past will", "The next Biennial should be in May 2022, the organizers wrote.  The deadline for the 2019 edition was May 24.\n\nThe National Gallery of Art in Washington, DC, has released the list of seventy-six artists and collectives whose works were selected for the 2020 edition of the National Museum of American Art. Titled The Emigrants, the exhibition will feature works from forty-six countries and twenty-six regions and will be hosted by the galleries in partnership with the Smithsonian Institution.The seventy-six artists were chosen by a national jury comprising Steven Brown, director and chief curator of the National Museum of American Art; John D. Hogg, director of the Museum of Fine Arts, Boston; and artist-manager Christiana Bech; and include Margot, Whittier, California: Feminine, Italy: ¤La Femme, Mexico: “Arts,”Spain: María Elena Moser: Music,”Brazil: Margot Hund, France: “Gutsy,”Germany: Nora and Hilde, Switzerland: Nils Stadt, Germany: Hannah Wilke,"]