["The next Biennial should be held in Moscow in 2022, he added.\n\n\nThe Carnegie Museum of Art in Pittsburgh (CMA) has welcomed Charles Widtsoe to its staff. The fifty-seven-year-old biennial curator has been a CMA assistant curator since 2016. He will assume his responsibilities from Jerrold Kohn, who has been promoted to director of curatorial affairs.“Widtsoe’s work, which explores the history of Latinx artists, has been presented in several biennial exhibitions, including the ParaNorman and the Pintor, and has been included in numerous collections, including the Metropolitan Museum of Art’s “Behind the Curtain: Latinx Art in the 1980s” (2017), the National Gallery of Art’s “Charles Widtsoe: From Salvador Dali” (2014), and the John William Pope Collection’s “Widtsoe” (2014).In 2018, when CMA purchased thirty-eight works by twenty-six artists from the Worcester-based dealer John Kander, Widtsoe was appointed curator of Latinx art. He is also a cofounder of the Latin", "The next Biennial should be held in the autumn. \n\n\nThe museum’s collection is currently undergoing a major renovation. The complex, which encompasses sixty-three thousand objects, was completed in 2009 and underwent a major revamp in 2016. The museum is now expanding the exhibition space and is preparing to welcome the public once again. The redesign, which involves the installation of sculptures, installations, and exhibitions, as well as the addition of a modern wing that will house the museum’s collection within the next twelve months, was undertaken in response to the demand for more accommodation and collaboration spaces for the public.The new structure will provide additional spaces for the collection, larger public areas, and the development of an online catalogue. It will also feature an additional level of security for the visitors, who will be able to enter the museum through the museum’s newly expanded entryway. Established in cooperation with the city of Milan and the city’s mayor, Dario Franceschini, the building is being constructed on the site of the former museum of modern art, which opened to the public in 2000 and was decommissioned in 2009.\n\n\nArt Basel, the world’s largest and most prestigious art fairs, will introduce two", "The next Biennial should be held in Hong Kong, in 2020; the first in San Francisco, in 2021.\n\n\nThe Saudi Arabian Ministry of Interior has rejected a request from the United Kingdom to set up a counterterrorism council in the Kingdom. The British prime minister, David Cameron, announced the move in March. He said that the move would help the Kingdom prevent suspected terrorists from entering the country.Saudi Arabia has been a major transit country for jihadists and terrorists entering the Kingdom. In April, a Saudi-led coalition air campaign against the Islamic State group began. In July, the Saudi Interior Ministry declared a policy of \"resilience and solidarity.\" In September, a suicide bomber struck a Shia mosque in the Saudi capital, Riyadh, which killed at least seventy-four people.\n\n\nThe Brazilian Jewish Museum in Porto Alegre, Brazil, has been renamed the Jewish Museum of Santo Domingo. The institution was founded in 1964 by the Jewish philanthropist and politician José Alexandre de Mora, the founder of the film and television company Columbia Pictures. The museum is located in the former Jewish agricultural community of Edificião. The decision was made by the Brazilian state of Minas Gerais, which also renamed the community Stilson", "The next Biennial should be held in 2021. The biennial will focus on the history of art and will feature works by twenty-six artists, including Slawomir Dziewior, Lise Mersch, and Justin Medvedal. The third iteration of the exhibition will be held in 2022. \n\n\nThe National Gallery in London has appointed Tatjana Biczel, who has served as the deputy director of curatorial affairs at the National Gallery since August 2017, as its new deputy director for exhibitions and collections. Biczel will assume her post on November 1.Biczel’s appointment comes amid the ongoing challenges posed by Covid-19. In August, the gallery extended its closure through November 23, the date set by the Royal Shakespeare Company for its winter festival. The move was expected to draw around four thousand visitors to the institution, which has a capacity for only six hundred. The National Galleries, which will continue to operate as usual, confirmed that the event would be broadcast live on the National Geographic Channel. Biczel, who previously served as a consultant for National Geographic’s upcoming expedition to the South Pole and as a curator in several museums, including the National Museum of Art in", "The next Biennial should be held early next year. The site for the event is located at 1362 Professional Photography Road in Bishkek, a suburb of Bangkok, and will be inaugurated by an exhibition of work by the biennial’s first artist, the late Nachtōr Mabie. Other works that will be presented in the exhibition include the work of Hsu Yum, who was an artist-in-residence at the museum for twenty-three years, and his followers’ sculptures, which were transplanted to the venue by the artist. The biennial will also present works by the artists who were the mainstays of the exhibition series, including Hauser & Wirth (1994–2005), Noodler & Rich (2004–2007), and Shapiro (2006–2007) among others.The full list of participating artists is as follows:Harper & Row, LondonT: Loring Mitchell, LondonVictoria Miro, LondonDavid Mamet, New YorkE: Michael Sokolowski, New YorkMark Borthwick, LondonR: Joël & Gere, New York\n\nRetailers in the United Kingdom are facing a major antitrust investigation after a report commissioned by the National Association", "The next Biennial should be held in the same city in 2021.\n\n\nThe Museum of Fine Arts (MFA) in Boston is planning to move the renowned Japanese art museum, founded in 1889 by Hideaki Anno, into a new building constructed by the Japanese architect Kiyotake, which is slated to open in 2021. The museum will also extend the hours of its regular annual exhibition, “Akira and the Others,” which is currently on view throughout the museum. The exhibition was staged in the museum's former space in 2011. The move has faced opposition from some who fear the move will negatively affect the museum’s international reputation.The museum’s board president, Kimerly Rorschach, told the Boston Globe that the museum will not change its current exhibition schedule. “We have a long-term goal to actually open in the fall, and we’ve been working on that for some time,” Rorschach said. “So it’s not like we’re going to change anything this fall. It’s just that we’re moving the show to a different space.”\n\n\nThe British-born, Berlin-based artist", "The next Biennial should be held in the year 2021, and the exhibition should mark the centenary of the foundation. The works should come from the collections of the Musée d’Art Contemporain in Paris and the Museo de Arte Contemporanea in Lisbon. A call for proposals will open on August 29.\n\n\nThe Atlanta Museum of Art (A.M.A.) has appointed Stephanie Schless, who is currently the exhibition manager for the inaugural Biennial Exploration of Modern Art (BAME), as its new executive director. Berthold Schier, who has served as the interim director of the A.M.A. for the last two years, will be responsible for spearheading the institution’s programming for the next five years.“Once again, we are grateful to the A.M.A. for its leadership in securing the outstanding talent and leadership for this year’s BAME,” said director Mimi Gallagher. “Stephanie is truly a leader in articulating the vision and guiding principles of the A.M.A. as a dynamic and thriving collection and showcasing exhibition over the last three decades.”Maria J. Prado, who has served as", "The next Biennial should be at least fifteen linear feet, with the greater part of the building at least twenty-four feet. It should consist of a series of containers, each one containing forty-eight individual works. The construction of the exhibition should begin as soon as possible after completion of the exhibition, with the objective of stimulating and preparing the public for the biennial.”The biennial’s inaugural edition, which was held in February 2019, was widely criticized for being too short. Richard Pink, who curated the event, said that he hoped the new format would “create a different kind of focus, a different kind of vision, and a different kind of experience.” He added that the series would evolve and be a “point of departure” for the exhibition. In a letter published by Steve Scheibler, the director of the Museum of Contemporary Art, New York, the biennial’s founder and curator, the exhibition was criticized for being “too short.” He also claimed that the exhibition was “too focused.” The biennial, which received critical acclaim for its exhibition of work by contemporary artists such as Matthew Wong and Asha Rochman, was also criticized for being", "The next Biennial should take place in 2020 and will include the first works by young South African artists, and will be hosted by the Museums Association (MA) in Durban and the Arts Centre in Pretoria. The 2019 event was staged in partnership with the Museum of Modern Art in New York, the Museum of Contemporary Art Galerie Kishore and Kishore & Associates, and the Museum of Modern Art, New York. The biennial, titled “South Africa in the 1980s,” drew some forty-five artists from twenty-eight countries and territories. To date, the sixty-one works by thirty-four of these artists have been included in the twenty-seventh edition of the Biennial, which will take place at the Kgosi National Museum in Johannesburg from February 20 to March 19, 2020.\n\n\nArtist-run nonprofit the Independent Foundation for African Art (IFA) will pay the African National Congress (ANC) $1 million in order to purchase the artwork of a woman who was the first African to ever win the Nobel Prize in Literature. In recognition of her contributions to African art and to African literature, the organization is giving the prize to Hayley Atwell and the Nigerian author Noma Nwasegb", "The next Biennial should be held in 2021. The institution’s board president, Deborah Levine, said that the theme of the ten-year event would be “spirituality and community, the power of beauty, the rhythm of motion, and the links between the living and the dead.”\n\n\nIn commemoration of the institution’s fiftieth anniversary, the New York City Department of Cultural Affairs (DCLA) has unveiled a new year-round programming initiative that will enable local, state, and federal governments to collaborate and collaborate on programming across a broad spectrum of artistic pursuits. “New York City celebrates its fiftieth anniversary this year with a vibrant, ambitious, and ambitious year-round programming program,” DCLA head Anne-Marie Taylor said. “DCLA is committed to bringing a wide range of programming to New York City, from spectacular outdoor events to the most intimate community gatherings to our artists’ favorite pastimes, from puppet shows to comedies to documentaries. We’ve got great new opportunities to inspire and connect with our neighbors and to build relationships with communities across the city.”Participating cities include Buffalo, Brooklyn, and Manhattan, and will each be able to select their", "The next Biennial should be held in 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Emily Ewing as its new associate curator of contemporary art. She comes to the institution from the San Francisco Museum of Modern Art (SFMoMA), where she has served as deputy director of exhibitions since 2015, and will be responsible for helping the museum to address the cultural and historical gaps across the globe.“We are thrilled to welcome Emily to the MoCA family,” said director Ken Stone. “Her deep expertise as a curator and as a scholar will be a tremendous asset to the museum in our ongoing efforts to rethink and re-create the architectural experiences of California’s Pacific Coast region through innovative and ambitious programming.”Ewing is the author of The Art and Architecture of Modernism: From Modernism to Neo-Modernism (Yale University Art Museum, 2019) and is currently working on a book on the history of modernism, “The Modernist Dilemma: Modernism in the Age of Mechanical Reproduction” (Yale University Art Museum, 2020).Commenting on her new role, Ewing said: “I’m inspired by the museum’s", "The next Biennial should take place at the National Museum of Japan and will be titled “법윝.\n\n\nPhotographer Thomas A. Price, a self-taught painter and sculptor whose work fused deliberately abstract forms and avant-garde materials, has died at age eighty-five.Born in New York in 1937, Price initially studied under the celebrated American artist Harry A. Gilbert, who would later go on to teach at the School of the Art Institute of Chicago and the School of the Arts. His artistic output is as varied as his subject, exhibiting a mastery of the arts and of form that is as timeless as his technique.  “Price’s work is a queer blend of painting and sculpture, pure and simple,” said Naima J. Keith, an art historian and curator. “His technique is like that of the late Frank Gehry: the ear catching, the anatomy of the canvas, the astuteness of the paint.” Keith once compared Price’s art to that of Ingres, Miro, and Lord Dunsany, all of whom Price worked with from the late 1940s to the early 1970s.“Price is one of the great", "The next Biennial should take place in Tokyo in 2021. We will announce more information about the exhibition in the coming weeks.\n\n\nThe National Gallery in London announced today that Ioana Graziano will be its next director. Graziano comes to the institution from the SculptureCenter, where she has served as director since 2015. Graziano will assume her post in March 2020. “Ioana is one of the few directors in the world who has brought her talent, expertise, and vision to bear in a spatial and/or a time-based way that is unprecedented in its breadth and depth,” said director Charlotte Allingham. “Ioana’s work has been central to transforming SculptureCenter into a truly international institution, and I am deeply proud to have worked with her. Her work has inspired and informed us all and we are grateful to her for the opportunity to work with her.”Graziano began her career in the United States as a curator at the Museum of Modern Art. She then joined the National Gallery of Art, where she worked as a research intern in the summer of 2018. She returned to Italy in March 2019, where she continued to work with the National Gallery of", "The next Biennial should be held in the city in the spring of 2022.  It will then be up to the city council to decide whether it should proceed with the construction of its first monument, the Legacy of Ivan the Terrible, in the spring of 2021. The work is scheduled to be unveiled in March 2021. The decision to move the retrospective forty years into the future has been made after Lenore Taylor, head of the exhibition, told the Guardian that the biennial would be marked by “depiction of the past in an extraordinary way.” Taylor said the exhibition would include “apologies and re-apologizations,” “re-creation and redemption,” “divination and augmentation,” and “a vision of the future that takes account of contemporary concerns and dilemmas.” “Ivan the Terrible’s Legacy” will be presented in conjunction with the 2019 Whitney Biennial. The biennial is funded, in part, with a $1 million donation from the estate of the late artist’s daughter, Audrey Taylor.\n\n\nThe Museum of Modern Art (MoMA) in New York and the Sidney and", "The next Biennial should be an international effort to reassess and re-examine the history of the human condition, encompassing an un-dramatic re-creation of the visual arts of the past through the use of contemporary media. “The future of art and of the human condition is at stake,” said Mark Adès, director of the Science Museum in Ghent. \n\n\nThe MCAF Art Museum in Paris has ordered the relocation of more than fifty works by thirty-six contemporary artists, including a series that examines the conceptual and political relationship between art and politics and a large-scale installation that will be mounted in the museum’s grounds in the spring of 2021. The museum, which is currently closed until at least April 13 because of the Covid-19 pandemic, said that the move will allow it greater access to the public, enhance its international reach, and enhance its collection.“The MCAF is one of the major cultural centers in the city of Paris, and the only one that is protected by the government,” said Jean-Luc Bertho, the MCAF’s director and CEO. “With the relocation, we are now able to show our works", "The next Biennial should be held in 2021. It was not immediately clear if the institution was considering an extension.\n\n\nThe Dada Museum in California has received a donation of twenty-six works by sixty-four artists from seventy-eight countries. The donation, made by the late American sculptor Robert Irwin, includes works by seventy-eight artists from forty-eight countries. The work on display is one of the works by the artist in the institution’s collection.The donation was made in honor of the centenary of the birth of Irwin’s late wife, Dorothy, who was a classmate of his and a devoted supporter of his practice. Her gift is particularly significant, the museum says, since it coincides with the exhibition “Anton Kern: A Modern Life” and the initiative “Persistence of Vision.”While the work on display is a work by Donatella Alemani, the creator of the Italian pavilion, there is no doubt that the gift will be of great interest to scientists and scholars in the United States and Europe. It will allow the museum to showcase the works of twenty-six artists that were on the shortlist for the Nobel Prize in art in 2020, including Simone Leigh, David Sal", "The next Biennial should focus on “the future of art and culture in the twenty-first century, as it relates to the ecological crisis.” The twenty-second edition of the exhibition will be held at the Musée d’Orsay in Paris in May 2021. The twenty-third edition, which will be held at the Musée d’Orsay from March 21 to March 28, 2021, will feature work by forty-seven artists, including Alex Hernández, Astrid Schmitt, Monica Zvika, and Richard Avedon.\n\n\nCanadian artist and activist Leila Weefur, whose work grappled with Indigenous knowledge systems, immigrant narratives, and intersectionality, has died. She was eighty-one years old.Born and raised in Montreal, Weefur\u0097who identified as Queer, Feminist, Black, and Black Lives Matter\u0097was drawn to the field of Indigenous art from an early age. She became interested in Indigenous art after encountering it through her mother, a member of a wealthy Jewish family who immigrated to Canada with her family in 1941. She eventually settled in Vancouver with her siblings, where she would eventually grow up. In 1964, she and her siblings", "The next Biennial should be held in 2022–19. The institution has already faced protests from artistic and cultural workers in several cities around the world who accused the arts and culture ministry of trying to appease the Ankara government and push ahead with construction of the 1,400-seat Anadolu Gazet Museum.\n\n\n\n\n\n\nArtist-run space, FAIR, has been awarded $100,000 by the Josef Alberts Foundation in support of its upcoming exhibition “Theatre of Death: Organisms in Motion” at the Aarhus Biennial in Denmark. The organization plans to stage four exhibitions, including one on the circulatory system and another on the evolution of medicine.The foundation gave £100,000 to the Karolinska Institute in Stockholm and the Stockholm Biennial, as well as $100,000 to the Malmö Museum and Art Museum in Malmö, Sweden, for their 2015 and 2016 editions, respectively. Both shows\u0097the “Art of Meditation” and “Theatre of Death”\u0097will be on view until January 25, 2020.The foundation has previously given $200,000 to the Pergamon Museum of Art in London and the Christie�", "The next Biennial should be held at the city-owned museum and not at the museum. The institution would then have the option of moving the exhibition to another location, as long as the new location would honor the museum’s mission.The museum has been closed since March 11 due to a financial emergency. The museum reopened on April 17 with the release of  The Political Sculpture m: The Struggle for Civil Rights, a new study of the civil rights struggle. The exhibition was inspired by Richard Wright’s Toni Morrison: Black Feminist Sculpture (1983). The exhibition consisted of seventy works by thirty-two artists. The works were selected for their “original and distinctive voices” and their “new and original perspectives.” One hundred works were selected for the biennial’s fifty-ninth iteration. Ten of the works will be works that have never been presented before. The biennial’s 100th anniversary will take place in 2021.\n\n\nThe Museum of Contemporary Art (MCA) in Los Angeles has appointed Heather Ahearn as its next director. Ahearn comes to the institution from the Los Angeles County Museum of Art (LACMA),", "The next Biennial should be held in the summer of 2021.\n\n\nThe Neue Galerie in New York, which was forced to make an emergency closure earlier this month after the Covid-19 pandemic shuttered its venue for the Los Angeles Art Museum (LACMA), reopened Tuesday, March 19, after it underwent a major renovation. Designed by the firm Gagosian, the Rosenfeld Building, which houses the museum, underwent a $100 million facelift and reopening of the institution, which is located in an industrial neighborhood of Santa Monica, California, was one of the three goals of the $150 million overhaul.“The renovation was an ambitious project, but it was also necessary,” said museum director Michael Govan. “The changes at the museum are long-overdue, and they will make the Neue Galerie more welcoming to visitors and communities. We are confident that the renovation will prove a transformative experience for visitors to the Neue Galerie.”The rehabilitation of LACMA has been ongoing since the pandemic first hit the US in December 2015, and the institution, which was designed by architect Daniel Libeskind, had made significant progress since its reopening in March of 2017. In addition", "The next Biennial should take place in the fall of 2020. The exhibition will be hosted at the Museo de Cultura Brasileira da Camerada, Rio de Janeiro, and will be co-organized by Grazie Brasileira, Tania Bruguera, and Terra Nova. “We are working hard to make an exhibition that will embody the spirit of Rio,” said María Braga, the deputy director of the Biennial and the director of the Museum do Rio de Janeiro. “The new collection, which also includes works by artists such as Šaže, Florina Mendonça, Susana Cervetto, and Cécile Pape, is a reflection of the spirit of our city and of our city’s history. It is a document of the extraordinary cultural achievements of our generation, and a new beginning that will be a living memorial to the people of Rio de Janeiro.”The inaugural exhibition, “Ricardo Cuiéntara: ‘Feminine,” will bring together twenty-nine works by twenty-nine artists from the city’s different regions. Fifty-two", "The next Biennial should be in June 2020. \n\n\nThe National Museum of Art in Washington, DC, has announced that Sherry Turkle, chairman and CEO of the privately held company Kiewit, has been appointed as its next president. Kiewit currently owns about five hundred paintings from the collection of the late American artist James A. Farquharson, a major leading proponent of Impressionism and a major advocate of the postwar American liberal arts. “Sherry has been instrumental in the development of our museums and our collections,” said museum director James Cuno. “Her research and dedication have made her an ideal selection for this position. In addition to her knowledge of the collections, she brings an excellent work ethic, a keen understanding of how art is made, a keen eye for talent and an ability to collaborate across disciplines and departments.”Born in New York City in 1940, Turkle began her career in the art world as a freelance art director before she began her career as a curator. She began her career with the Museum of Modern Art in New York and currently works as the director of the Museum of Contemporary Art in Chicago. During her tenure at the museum, she curated exhibitions such as �", "The next Biennial should be held in the spring of 2021. The new , planned to be held between March and May, will be organized around the theme “Andrea Pirlo: The Divine Feminine.” Also announced is the development of a new exhibition of work by Lucio Fontana with the inaugural exhibition being held in the spring of 2021. The twenty-fourth edition of the biennial will be held in the summer of 2021.The biennial’s organisers said that the decision to postpone the event was made following an “extensive analysis of the current situation.” The organizers said that the key issues were the date and the exhibition, which was originally set to open in March 2019, and the collaboration between the artist and the contemporary art world, including the “end of the year” movement. The announcement follows the March for Science, which has been held every March since 1972.\n\n\nThe artist, writer, and curator Pyrrha Salter, who was a prolific and intensely personal voice in the feminist and anti-racist movements, has died at age eighty-one. Salter’s work, which spans multiple languages and is considered an essential feminist and anti-racist text", "The next Biennial should take place in 2020. “The museum is committed to providing exceptional exhibitions, programs, and events that reflect both our mission statement and our historical vision,” said David Cameron, director of the museum. In addition to the museum, the city of London’s Department of Culture, Media and Sport and the Department of Transport and Environment also have sites in the city.\n\n\nThe museum in São Paulo, Brazil, has issued an invitation for the 2019 collection exhibition to return to its hometown for a second edition. Titled “São Paulo: The City,” the event will examine the city’s cultural legacy through a combination of art, architecture, and design. The exhibition will take place in the city’s central São Paulo district from November 8 to November 10, 2020.“The first edition of São Paulo: The City was held in the city, in 2014, and was a success,” said Mariana Martins, director of the Fondazione FIMB. “We are actively planning to organize the next edition in the city, as we have done for the last few years. We will see what opportunities there are for", "The next Biennial should be held in Barcelona, in 2020. \n\n\nThe Prince Field Museum of Art in New York has appointed Alice Procter as its next director and CEO. She succeeds Shimon Hammer, who retired last month after nearly four decades at the helm of the institution. “There are many great directors in the world but the extraordinary and singular performance of the past year has shown that Alice is the man for the job,” said Charles D. Griffith, chair of the board of trustees of the Prince. “Her vision for the museum is to be a major force for good in the world, and as a result, I’m excited to work with her to shape the Prince into the next chapter of its rich and important history.” The institution plans to build a new twenty-five thousand-square-foot headquarters in the city’s Hudson Yards development, which is currently under construction, and is currently evaluating the feasibility of opening a new location in the city.\n\n\nThe Museum of Fine Arts (MFA) in Boston has received a gift of more than one hundred works by twenty-seven Belgian artists in its collection. The gift includes works by Maurizio Cattelan, An", "The next Biennial should be held at the Museo de Arte Contemporáneo in San Sebastián, in March 2022; it is currently on hold while the government’s rights watchdog decides whether to renew the temporary license for the exhibition that will run until April 25. The first iteration of the museum’s first exhibition, “Lydia Gray: Forever Young,” is scheduled to open in January 2020; the second iteration of the exhibition is scheduled to open in March 2022. Three other exhibitions—“Feminist History: From Marxism to Feminism” (2019), “Mana Contemporary: Art and Sex” (2017), and “Nina Hendryx: Images of War” (2016)—are currently on display in the “Carlos Alÿs: Photography in Cinema” exhibition series.The exhibition will open in the contemporary art museum in the capital city of Mexico’s Mérida state in March 2020 and will run until January 21, 2021.\n\n\nAs the number of people admitted to the hospital in Surrey, England, continues to rise following a massive fire that broke out at a warehouse in the industrial district on Monday, July", "The next Biennial should be held in 2021, with a 2018–19 run. The biennial will feature thirty-one works by thirty-four artists. The selection will be presented as part of a larger program of exhibitions and talks organized by the museum. “The new exhibition, ‘The Future Is Not What We Descend Upon,’ will introduce Biennial and will address the future of work and what is possible outside of the current model,” said curator Emma Blythe.\n\n\nThe seventeenth edition of the Glasgow Biennial has announced that it will be held at the City Theatre in Glasgow from December 28 to March 12, 2021. The event will also include the first public exhibition by a new artist-in-residence, the Danish artist Jørn Deke Hog, who will be based in the city for six months, and will feature a selection of art from the artist’s collection spanning every stage of its development.The biennial will be hosted by the City of Glasgow, the National Gallery, the National Galleries of Scotland, and the Scottish National Museum and will feature the work of seventy artists, including Scott Sinclair, Li Hsiang-Tai, Kori Zhakey,", "The next Biennial should be held in the fall of 2019. Its online version will open in October.\n\n\nThe Museum of Modern Art (MoMA) in New York has released an unprecedented $10 million gift to the Composition Arts Foundation (CAF), the New York–based nonprofit dedicated to supporting ambitious artists. The $10 million gift comes on the heels of MoMA’s announcement that it will support the “composition arts foundation”\u0097which was founded by billionaire industrialist Lionel Rhoades in 1972, with $8.5 million\u0097in a $100 million gift.In recognition of the foundation’s commitment to supporting the work of underrecognized and underrepresented artists, MoMA revealed earlier this week that it will award $5 million annually to the foundation. In addition, the museum will lend out $1 million to artists and will establish a scholarship program to assist underrepresented artists in New York City.“MoMA’s gift to the composition arts foundation is an unprecedented offering of support for an organization that has made such a remarkable contribution to the field of modern art through its programs for over forty years,” said Mark MacGill, director of MoMA", "The next Biennial should be held in mid-March, but the organizers have already postponed it because of the Covid-19 pandemic. They plan to reschedule the event, dubbed the Biennial of Art, in the spring of 2020.“We are so proud to have been selected as the 2020 winners of the Biennial of Arts,” said Zakaria. “The exhibition will showcase the works and performances that have been selected for the biennial by our panel of artists, curators, and curators’ extended family, and will bring together the best contemporary works at a time that will reflect the themes of the year and reflect the spirit of the year.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is planning to close its doors permanently to the public in April of 2022—a plan that will include the closing of all three of its locations, the Pacific Palisades building, which has housed the institution since 2003, and the Marina del Rey location, which is currently undergoing a $30 million facelift. The announcement follows a $50 million campaign by MoCA’s former board chairman, Haim and Geri Silver, which was launched to help raise funds for the revitalization", "The next Biennial should take place in 2020, and the date will be announced by the AMPAS during the biennial’s March 18–March 21 edition.\n\n\nA group of artists, musicians, writers, and other cultural workers in the Philippines have launched a campaign to recall former president Rodrigo Duterte, who they say is destroying the country’s artistic and cultural heritage by promoting a “dictatorship based on fear and fear of dictatorship.” “What we are seeing now is the political and economic response of the new government to the global crisis,” said Niti Ayala, president and chief executive of the Association of Southeast Asian Arts and Cultures. “We encourage all our members and supporters to send a message to the new government, to the new president, and to the president himself, urging him to end this political act and recognize the cultural and artistic heritage of our country.”In a letter addressed to Duterte, the group wrote: “We are deeply concerned by the statements made by President Rodrigo Duterte regarding the destruction of cultural heritage in the Philippines. We urge you to uphold the values embodied in the Constitution and to uphold the rule of law. To do so, you must recognize the legitimate rights of", "The next Biennial should be held in 2022 and will be directed by the curator of contemporary art, Theobián Carrillo, and will comprise an exhibition of work by forty artists. The exhibition will work with the theme of the first Biennial, “Theology of Life” and will include an open-air performance by the Los Angeles–based group MCA, which focuses on the philosophy of art, architecture, and the natural world. \n\n\nThe National Galleries of Scotland (NGA) announced today that the institution will hold an exhibition of work by artists such as Hal Foster and Renzo Piano in November 2019. The twenty-second edition of the National Galleries of Scotland “Photographs” will open at the NGA in Edinburgh on November 18 and run through November 21.The exhibition will highlight the work of artists whose practice closely follows the contemporary art tradition. The list of participants includes artists such as Davey, Cécile Barba, Frank Gehry, Anton Kern, and Paul Gauguin, among others. The exhibition will feature work by seventy-four artists, including John Constable, Alighiero Celant, Tadao Ando, Léonide Chedid, John Gallas,", "The next Biennial should open in 2020.” The upcoming edition of the Venice Biennale has not yet been announced.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has launched a new digital platform that will allow visitors to view and purchase works by less established artists. The platform, called MoCA Online, is part of the company’s efforts to engage with the millions of square feet of art in the Metropolitan Museum of Art (MoCA), where the institution is currently constructing its new home. MoCA Online will first launch with works by twenty-one artists, including Olu Oguibe, Olu Oguibe Jr., J.J. Walsh, James Turrell, and Tilda Swinton. The next iteration of the platform will feature thirty works by forty artists. The new works will be freely available to view and purchase through the museum’s computer-based system.“We at MoCA are committed to engaging with and fostering the work of these artists, their communities, and the cultural and artistic landscape in Los Angeles,” said Adam H. Weinberg, director and CEO of the institution. “With the launch of this new platform, we hope that this trend can continue to amplify the", "The next Biennial should be held in the following year.”The 2019 edition will be hosted by Nara Pindell at the Museum of Modern Art in New York. The 2020 edition will be hosted by Simon Callow at the Museum of Contemporary Art, Los Angeles.\n\n\nThe Japanese government and private institutions are planning to relocate more than two hundred cultural and historical sites, including a number of popular tourist sites, from the capital to the countryside in an attempt to lessen Tokyo Electric Corporation (TEPCO)’s (Tokyo Electric Power Company) involvement in the city’s air pollution. The relocation plan is part of a $4.3 trillion restructuring that will be implemented by the government in the coming years, and aims to reduce the amount of contaminated water and land around the plant.The new plans were made in anticipation of an eventuality when the plant will be shut down due to the construction of a new building and the shuttering of the old facility. The government is also trying to develop ways to transfer the pollution-causing chemicals, including air pollution itself, to other parts of the country, and to make the environment less polluted.The government is also pushing to shift the focus of the plant, which is a major employer in", "The next Biennial should introduce a new format and re-design, focusing on local and sustainable forms of art and ideas.” It should also consider the possibility of the exhibition moving to a bigger venue, and should present a selection of works that have not yet been exhibited in the US.The exhibition is presently staged at the Museum of Fine Arts, Boston and will run for three years. The exhibition’s inaugural edition, “Art at the MFA,” was held in February 2019.\n\n\nThe Canadian Centre for the Arts (CCA) in Ottawa is launching a major expansion that will add more than 1,200 new works by artists and will offer a new kind of programming. The expansion, which will involve the construction of a new building and a reopening of the CCA, will bring the total number of works in the institution to 11,500.The fourth edition of the CCA, “Art at the CCA,” will take place at the CCA’s new home at 625 Lansdowne Avenue in downtown Ottawa from March 21 to March 23. The expansion will also alter the building’s layout and add more than 8,000 square feet of gallery space, a glassy terrace", "The next Biennial should be held in 2020 and will offer a survey of contemporary art in Europe. The second in 2021 and will be held in Ljubljana.\n\n\nAmerican artist and designer William Kentridge, best known for his American Art series, which depicted a series of tool and fabric works made in his native Kent, Kentucky, and juxtaposed images of objects such as reeds, canvas, and wood, has died at age sixty-nine. Kentridge was born in New York City in 1941. His father owned a hardware store, so Kent moved to the apartment beneath the family’s home. His childhood friend and childhood collaborator John Williams, an American architect and painter, suggested that he paint to see if he could make something out of nothing. Kent later went on to design many pieces for the company. Kent was awarded a MacArthur Fellowship in 1966 and the Louvre Prize in 1977. He would receive his first major solo show in 1981 at the Museum of Modern Art in New York.In 1977, the Ohio Valley Museum of Art in Cleveland commissioned Kent to create a new work from his American Art series. The commission was part of a campaign to create new public art in the Ohio Valley, a region of central Ohio that was a haven", "The next Biennial should be announced soon. The full list of participating artists is as follows: *Leila Aite (Damascus, Syria) *Omar Al-Hussein (Ley, Iran) *Mahamat Essam (Dar al-Ma’mu’an) (Mana, Saudi Arabia) *Anwar al-Kasimi (Wukan, Uzbekistan) *Adam Kholib (New Delhi, India) *Ashraf Kechi (New Delhi, India) *Sabeel Malala (New Delhi, India) *Mohamed Ali (New Delhi, India) *Nina Muhamed (New Delhi, India) *Dirk Walther (New Delhi, India) *Karnail Habibi (New Delhi, India) *Gühren Kheder (New Delhi, India) *Zarina Karimova (New Delhi, India) *Elissa Karimi (New Delhi, India) *Saeed Mughal (New Delhi, India) “Azzam Rashid: Visionary” (New Delhi) *Abdullah Rashid: Art in Perspective�", "The next Biennial should be held at least a decade from now, and ideally two decades. The biennial should offer a collection of selected works that have not previously been exhibited. It should consider the transition from one form of art to another. It should consider the development of a new generation of artists, as well as their contribution to society. We believe, however, that the most important thing, in the next Biennial, is for the artists to participate and to be able to enjoy the exhibition. Our proposal consists of two areas, the artistic and the conceptual. The physical exhibition is the space for the artist. The conceptual exhibition is the space for the public. It is also a space for the artists to be. The work will be installed in the exhibition and will be exhibited at the Biennial. The Biennial will organize the artist-public interaction in such a way that it will be a catalyst for the development of biennial experiences. The artist-public-relations-center will be one of the main focal points for the exhibition. “This year’s Biennial marks a new chapter, and it is an exciting time to attend and participate in the exhibition. The theme of the exhibition is Community. The exhibition will encourage us to", "The next Biennial should be held in Shanghai in December 2020. \n\n\nThe National Gallery in London is planning to move into a new 600,000-square-foot building designed by British architecture firm Gensler in the capital, and is constructing a pilot program in an attempt to get the institution’s tenants to commit to making the move.The National Gallery of Art (NGA) is currently undergoing a major expansion, consisting of ten new galleries and a new building designed by the British firm Gensler. The project, which is expected to cost an estimated £50 million, is part of a wider vision to make the NGA “more globally relevant and relevant to people everywhere.”In order to facilitate the move, the NGA will host three exhibitions a year in the new space, and will offer a variety of programming and public events, including museum tours and group shows, photography sessions, and a children’s museum. Although the institution will not reopen to the public, the new space will be equipped with a museum carousel and a café.The NGA’s inaugural exhibition, “The Future Is Now,” will explore the concept of ‘time.’ It will also present the first official", "The next Biennial should have taken place in the spring of 2020. The organizers chose to push its opening by two years, citing the need to prepare for the coronavirus outbreak.The development, which emerged from a $30 million donation from the family of Joseph and Mary B. Kanders, was made in response to the global health crisis. The Kanders Foundation for the Arts granted the museum $10 million, and the center was founded by the couple with their two sons.The Kanders Center for Painting and Sculpture is housed in the former Joseph Kanders Building and is home to two galleries, a studio, an outdoor sculpture garden, and an exhibition space. The Kanders Building, which was completed in 1987, was converted into a master bedroom at the center. The Kanders Collection is housed in the Kanders Collection, which is comprised of works from Joseph Kanders’s sixteenth-century laboratory in Concord, Massachusetts, which operated from 1972 to 1977, and the Kanders Museum of Art, which is open to the public.\n\n\nThe Whitney Museum of American Art in New York has appointed Keith Yamashiro as its next chief curator. He will be responsible for guiding the museum through its first restructuring in thirty years, which will include", "The next Biennial should be staged in the autumn of 2022. The event has become increasingly politicised in recent years, with the California-based artist Nick Landry’s monument recently unveiled in San Francisco’s Golden Gate Park. The exhibition will feature work by forty artists, including Lou Anderson, Neal Street, and Tanya Williams, in addition to works by other contemporary artists such as Dada’s Janis Joplin, Ernst and Gerhard Richter, and Ed Moses.\n\n\nMediterranean artist Nima Nabavi, who in recent years has focused her work in the region, is moving to New York from Beirut. The Bahraini-born, United States-based artist will launch her first solo exhibition in the United States at the Middle East and North Africa (MEA) Northern California Museum of Art (CalArts) in January 2021, the Los Angeles Times reports.Nabavi first joined the Los Angeles–based artist-run nonprofit the 501st Legion, a direct response to the global refugee crisis, in 2008. Since then, she has exhibited her work at several LACCA shows, including the Venice Biennale in 2009 and the LA+New York Art Museum in 2011\u0097both of which were", "The next Biennial should be called Centre.   The first will be held at the Institut für die kulturenische Akademie der Künste in Amsterdam in February 2021. The 2019 edition, which was staged at the Künstlerhaus in Kassel, will be held at the Norwegian Cultural Centre in Oslo in March 2021. Left Right Gallery, the US artist-run space that ran a biennial of contemporary art in Los Angeles in October 2016, has announced that it will move to the newly renovated and expanded Gallery 22 in the underground mall between Times Square and Pacific Palms. Founded in 2000, the contemporary art space has staged exhibitions of work by artists such as Grace Potter, Keith Haring, and Gerald Lovell, as well as performances by Bruce Pearson, Julie Mehretu, and Marie Brennan. The gallery will be inaugurated with an exhibition of work by Laura Owens, a New York–based artist known for her experimental use of cinema to examine notions of cinema as a medium of domination and the relationship between the artist and the camera. The show is being organized by Mark Levine and Naima J. Keith. The eighty-third edition of the Whitney Biennial, which", "The next Biennial should focus on the history of science fiction in the Americas as well as the history of African art in the Americas\u0097a real concern of the authors and organizers of the exhibition.”Loewe said that the exhibition “will reflect an ambitious vision of the exhibition as a collective project, alongside an interdisciplinary approach to the history of science fiction in the Americas.” The exhibition will also introduce new ideas and approaches to storytelling through art history exhibitions, poetry and fiction series, and film and video screenings.In an attempt to increase the museum’s visibility in Brazil, the exhibition will highlight the work of young, emerging artists, drawing from a selection of twenty-five artists from the Americas, the Caribbean, and Europe\u0097the list includes four from Brazil and the United States, as well as two from South America and the Caribbean.\n\n\nThe Independent and Tallinn-based contemporary arts museum Tallinn Art Museum (TAM) has appointed Asha R. Dey as its 2020 board president. Dey comes to the institution from the National Gallery of Art, Washington, DC, where she has served as a curatorial assistant since 2007. Previously, she served as a curatorial assistant for the exhibition program at the Museum", "The next Biennial should be held at the National Museum of Modern Art (New York), in 2021. The museum is currently developing a new exhibition dedicated to the Argentinean painter Agustín Arteaga. In an interview with the New York Times, Popes Pilar Severin and Íñigo Magi, the organizers of the 2019 event, described their plans to reopen as follows: “We are moving forward to plan a twenty-three-month exhibition program, and a new project for Federico Scalfari’s exhibition ‘The Light of Art’ at the National Museum of Art, Manchester, in 2022. The theme of the biennial is ‘Form and movement.’ We will be talking about the light of art and the motion of the body, and about the human body’s place in the universe.” The art of the body is as relevant today as ever, and the upcoming exhibition “The Body of Christ” will examine the role of the body in the liturgical calendar. The theme of the show is “Power and Presence: Body and the Body of Christ” and will run on view in February 2021.\n\n\nThe Museum of Art in the Arts (MA", "The next Biennial should take place in the summer of 2021. \n\n\nThe Rijksijde, Amsterdam (Rijksijduseum) has announced that it is planning to extend its programming in the Netherlands by a year to 2025. In a statement, the institution said that it “wants to continue to be a voice for the arts in the Netherlands.”The news comes on the heels of the announcement that the Rijksijduseum would receive a gift from the Dutch government, which included the installation of a new work by the artist Mehdi Tobac, Known for his paintings of organic materials such as earth and plants, Tobac was awarded the National Medal of Arts in November.\n\n\nThe Metropolitan Museum of Art (the museum) in New York announced today that it is expanding its representation of the work of the late artist and theorist Noël Carroll. The new exhibition, “Carroll/Noël’s Life and Work,” will open on January 6, 2020 and runs through March 6, 2020. The inaugural exhibition will feature work by both Carroll and his wife, Antoinette Deane, and will be presented by the Met in partnership with the artist", "The next Biennial should be held in 2022.\n\n\nThe Zaha Hadid Studio in London has received a $100,000 grant from the Sanger Foundation to continue its work on the new exhibition “From Mountain to Cloud: Contemporary Art in the Age of Black Power.” The auction, which was held on December 12, included works by more than thirty artists, including Saba Jaʿfar (1932), Richard Avedon (1939), and Mark Duggan (1952). “The majority of the works in this exhibition have been an extension of the current exhibition, from the work of a single artist to the work of a single generation,” said Zaha Hadid. “This exhibition marks the exciting new chapter for the Hadid-designed building, and I look forward to the next installment, which will take place in London in 2021.”The inaugural exhibition, “From Mountain to Cloud: Contemporary Art in the Age of Black Power,” presented works by artists such as Etta James-Kinison (2008), Paul Gauguin (1907), and Jacques-Louis David (1943), and featured works by artists such as Alison Bechko (2012), Jim Jarm", "The next Biennial should take place at the Minneapolis Art Museum, in the fall of 2022. The exhibition will consist of work by seventy artists, including Barcelona-born and French-trained artist Willem de Kooning, who will present a solo exhibition at the museum in December 2020; A.S. Krishnan, who will present a solo exhibition at the museum in December 2021; and Sylvia Mendieta, who will present a solo exhibition at the museum in January 2022. The 2019 edition of the biennial featured work by forty-eight artists from twenty-six countries and twenty-two cities. The 2020 edition will feature works by sixty-six artists from twenty-six countries and twenty-two cities. Artforum has learned that the sixty-six artists chosen to participate in this year’s exhibition will not be included in the forthcoming exhibition at the Musée du Quai Branly, which opened on November 2, 2019, and will instead participate in a new free exhibition at the institution. The decision to cancel the exhibition was made by the organizers, who stated that the upcoming exhibition “does not meet the criteria for our new program.” The Musée du Quai Branly will host", "The next Biennial should be held in March 2020, with a new exhibition opening in April 2020. The inaugural exhibition “Between Time and Space”\u0097a major retrospective of the work of the late Egyptian artist Naguib Mahfouz, a subject of great interest to London’s Tate Gallery and the Museum of Modern Art\u0097was staged by the New Museum in London, the Centre Pompidou in Paris, the Centre National d’Art et d’Histoire in Paris, the Centre Pompidou d’Abbeville-Lautrec in Buckinghamshire, and the Museum de l’Est Moderna in Paris; the exhibition was organized under the leadership of Artistic Director Marta Zivkovic, curator of the exhibition “Between Time and Space” and curator of the exhibition “Reception: Revisited.” Zivkovic will also present an exhibition of work by the late British artist and theorist John Berger and an exhibition of works by the late Russian architect and thinker Anton Chekhov, among others.\n\n\nThe National Geographic Society’s proposed redesign of its headquarters in Washington, DC, has been extended through 2020, the organization announced today. The", "The next Biennial should take place at the Museo de Arte Contemporáneo in Madrid, the Architectural Center in Milan, the Museo de Manila, and the Palacio de Arte Modernas in Barcelona in March 2022. The 2020 iteration of the festival was held in the summer in the city of Lagos and will run from March 15 to March 22. While Los Angeles has been reconfigured by the California Scream Festival the last two years, the city’s Art Institute is still not expected to welcome visitors until late April. The National Gallery of Art in Washington, D.C., has yet to announce any construction schedule for its new home, but it will be located in a historic district of the city.\n\n\nThe Smithsonian’s National Museum of African Art (NMA) in Washington, DC, has released the list of seventy-one artists who will participate in the second edition of the Smithsonian African Art Show (SAAS). The event will take place at the National Zoo from March 18 to March 24 and will feature ninety-eight works, including works by seventy-five artists, including Ann Martin, Sambisa Malek, and Ahmad Malik, among others from Senegal, Columbia, Ghana, Mali", "The next Biennial should take place in mid-March; a presentation of works by artists from the Americas, Europe, and Asia in April; and a biennial of works by painters in the United States in June. In addition to the usual biennial schedule, the first Biennial Exhibition will be staged in the autumn, and the second in September. Dara Stern, Chairman of the Board of Trustees at the Museum of Modern Art, said: “These are exciting times and we are committed to collaborating with our collaborators, including the galleries and activists who have supported Biennial. We hope that this year’s event will be a watershed for the museum.”\n\n\nThe Griffith Art Museum in Los Angeles has received a gift of some twenty-four works of art and design from the Los Angeles–based collector and philanthropist Jordan Budin. The donation includes a selection of work by such artists as Robert Irwin, J. M. Barlow, and Pierre Cardin.“The gift also includes works by pioneering artists as well as pieces that have long been forgotten,” said Jordan Budin. “The collection is a treasure trove of art history and design history. We are honored to host this collection in Los Angeles", "The next Biennial should focus on the cultural and intellectual life of London, with a view to reflect the range and diversity of its people\u0097a subject that is central to the history of the city. Our vision is to introduce a new and contemporary Biennial Experience in the city, to be curated by a group of curators, at the same time as we work to develop new content to meet the needs of a rapidly changing audience.”\n\n\nIn an unprecedented move, the Venice Architecture Biennial has decided to withdraw from a competition announced by the Royal Institute of British Architects (RIBA) to create a new exhibition for the exhibition of work by thirty-nine international artists and designers in the city, in an attempt to distance itself from the controversial project by the controversial British conservative minister, Bernardi, to knock down the Eiffel Tower. The project is being opposed by the socialist mayor of Paris, Anne Hidalgo, who wants the “implicit coalition agreement” that would have seen RIBA host the exhibition fall through and an allied city-state formed between the RIBA and the city government in a bid to ensure the exhibition would move forward. The exhibition, which was to have been curated by British architect Foster Ackermann", "The next Biennial should be hosted at the museum as soon as possible. “The upcoming exhibition ‘Repetition: Art and Politics in the Age of Resistance,’ will address identity politics, the dismantling of the state, and the future of art, and we hope it will appeal to many audiences in the United States and Europe,” said María Berrada, the director of the Museo de Arte Contemporáneo, and Carlos de la Torre, the executive director of the San Francisco Museum of Modern Art.In an attempt to address the crisis, a group of experts led by Virginia Woolf and Richard Avedon published a report in the May/June 2019 issue of Artforum, which predicts that by the year 2020 there will be only 3.3 million visitors to the museum. They argue that the museum’s current schedule—which recently included the exhibition “Thee Inquisition,” a work by the Italian artist Maurizio Cattelan—isn’t working. The next exhibition will focus on the history of the institution.The group’s proposal—which was supported by representatives from fifty-five countries and five continents—acknowledges that the museum�", "The next Biennial should be held in November 2020, said the museum. The indefinite postponement of the event comes amid a political crisis sparked by a series of terrorist attacks in March, when a suicide bomber killed some seventy people in a Manchester concert hall. The artists participating in the event will not be paid until the end of April, and a spokesperson for the Sci-Hub said: “Due to the busy schedule and the series of events that have unfolded since the bombing of the Manchester Arena, we are not expecting any artists to be paid until April. We are still evaluating all options available to us, and will be communicating with our artists through our artists’ panel, our artists’ union, our artists’ associations and our artists’ agents. We are actively monitoring the situation.”The artist’s union, the Artists’ Union, said that the decision was made in “a collective effort with the artists and artists' representatives,” Variety reports. The Artists’ Union is currently negotiating with the newly appointed director of the museum, Reem Malek to secure its future.\n\n\nThe Institute for Contemporary Art (ICA) in New York has hired David H. Koch as its new executive director", "The next Biennial should take place in the spring of 2020. The new theme for the event will be “Painting in the Age of Mechanical Reproduction.” The museum will also be redesignated as the “Tadashi Biennial,” and will have its full collection restored. The Tokyo Metropolitan Museum of Art (TMMo) will be renovated by the Yudachi Group, which bought the institution in 2009. The project is projected to cost ¥5.5 billion (US$5.8 billion).Inaugurating the museum is a new exhibition, “Painting in the Age of Mechanical Reproduction” (Tadashi Art Museum), organized by the Yuzo Takeda Group, that will highlight the work of Japanese artists in the last forty years. The show will open on March 17. Construction on the new museum has yet to begin. The new venue will be inaugurated with a new performance series by the Japanese artist Kiyotaka Hikaru, who will reprise his role as curator of the Tate’s famous “Painting in the Age of Mechanical Reproduction” exhibition. “We are all eager to present our visions of the future as we prepare", "The next Biennial should be held in January 2021. According to the Art Newspaper, the theme of the upcoming exhibition is “Elevation and Change.” Kawai is currently collaborating with Kuiper & Stoll on an exhibition dedicated to the rise of the modernist painter René Magritte. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is working on a new model for institutional engagement that will require its artists to engage with museum collections through collaborative projects. In a report published by MoCA’s board of directors on December 3, the organization found that 70 percent of its annual fee for an exhibition—which had previously been $8 million—would be eliminated in 2021 under the new model. The reduction in funding is part of a $5 billion overhaul of the institution’s internal operations that will also include the reorganization of its visitor experience.“Since the announcement of the 2021 budget, we have been working with our artists, community partners, and staff to understand and implement the new direction and have their input on how we can further optimize our exhibition programming, make long-term plans for our future exhibitions, and engage with our audiences,” said museum director Michael Govan. �", "The next Biennial should be held in the year 2020.”By the twenty-first century, the MFA is an internationally recognized institution. The MFA is currently celebrating its thirtieth anniversary.\n\n\nThe jury that found the 2016 American Sniper film guilty of breaching copyright law was not swayed by a single word uttered by director Clint Eastwood in court on Friday. Instead, the nine members of the jury—who had been deliberating for three days, deliberating for three days, and deliberating for fourteen hours—felt that the film had infringed upon the rights of several artists.The case concerned Calvin Harris, a twenty-nine year old black man who was killed by a white supremacist in Virginia on Saturday, February 14, after the man allegedly shouted “Allahu Akbar” and “God Hates Fags” at a protest in Charlottesville. The man was charged with second-degree murder, but the charge was later reduced to manslaughter by a Virginia court. The jury had been deliberating for more than three months when the jury deadlocked 4-3 on Friday. “I don’t know how you could have concluded that the movie was made in a vacuum and that Clint Eastwood had said nothing to", "The next Biennial should be held in the spring of 2020, and will host twenty-one artists, including Fang Xianmin and Huang Yuchun, along with twenty-six curators and critics. In addition, it will feature a full-length work by the artist-in-residence, artist Marie Redzepi, and will present the first exhibition of work by the artist-in-residence, artist Randa Maria.\n\n\nThe Hollywood/LA County Museum of Art (HollywoodCA) has announced that Yuki Sato will become the next director of the museum. He succeeds Michael W. Smith, who retired in December 2019 after fifteen years at the helm of the institution. “The Haus der Kunst (HDK),” which honors German Expressionist and designer Ernst and Hollein’s creations in collaboration with architect Wolfgang Jahn, and its current exhibition “Toys” will continue, but will focus on the museum’s holdings of artworks. According to the Los Angeles Times, the museum will begin welcoming visitors again sometime this spring. “In his eight years at the helm, he has helped the Haus der Kunst to become a model for a number of", "The next Biennial should be held in 2019, as long as possible. The mode of exhibition is the same as that of the XVIth Biennial, which will be held in Beijing in 2021. The exhibition will be organized as follows: 亜晚低,新科学三段全,拳科学三段陙�里,拳科学事, and 亜晚低限里限里限里, respectively. The exhibition will be held in the historic Exhibition Hall of the Institute of Contemporary Arts (ICA) in Beijing, which is currently undergoing a major renovation. The exhibition will feature the work of forty artists, including Zhang Tianshu, Xin Li, Michael Firestone, and Hsiung-Chih, and will run from February 5 to February 9, 2020. “The future of art and architecture in China is becoming ever more important to us, and we are looking forward to welcoming a new generation of artists and architects in 2020,” said the director, Wang Zhijie, while noting that the new pavilion", "The next Biennial should take place in the latter half of the year, and will be titled “Life and Art.” The theme of the exhibition will be “life and art as full of beauty and humor as the art of the future.” The biennial will be organised as a series of exhibitions across the city. The first exhibition will feature work by artists from the Global South\u0097Africa, Southeast Asia, and Oceania\u0097and will open on September 30. The second, titled “The Power of Mind,” will be presented in the spring of 2021 and will be hosted by the Museum of Modern Art.The Biennial will be supported in its entirety by the Italian Ministry of Culture, the Ministry of Culture of the Republic of Venice, the Ministry of Foreign Affairs, and the Ministry of Education. The exhibition organizers are planning to raise eleven million euros (the top ten donors will each receive a total of twelve million euros), but as of yet no date has been set for the opening of the program. “With the recent increase in the number of galleries that are closing in Italy, as well as the decline of the Italian economy, the events of the past few weeks have really", "The next Biennial should be a celebration of “life and its relationship with art,” said director James Altucher. “There are many areas of art that inspire deep and compelling explorations of life and its relationship with art. We are excited to see what this year’s biennial will bring.”About the Art of the Collection: Drawing on the diverse holdings of the Pérez Museum of Art, the exhibition will examine the evolution of the collection over the past seventy years, from the collection’s founding in 1979 by Luis J. Márquez to its present-day collection, which consists of more than 2,400 works. In addition, it is replete with a collection that spans forty-two languages and will offer an oral history of the collection through an artist-in-residence, Raul Sala, an indigenous artist from the Soé’ma region of Mexico City.The exhibition is divided into two parts: “Forty Years of Art” and “Tomorrow We Will See.” Part 1 will open on October 21, 2020, and will run until November 13, 2020. Part 2 will open on November 13, 2020 and will run until November 19, 2021", "The next Biennial should have a structure that allows visitors to experience the exhibition through the artist and an institution that will have the capacity to create new works. The idea is to have a communal space where artists can develop their practice and have an audience. The exhibition will be inaugurated by an exhibition of works by Cindy Sherman.\n\n\nThe SculptureCenter in Los Angeles has received a $65,000 donation from the Charles and Lucille King Family Foundation. The $65,000 donation comes from the SculptureCenter’s new endowment. It also came from the foundation’s $100,000 Sculpture for Peace prize.The SculptureCenter is a nonprofit organization that supports the development of new works by artists and institutions in southern California through its funding program for artists, including the Los Angeles County Museum of Art (LACCA), the Hammer Museum at UCLA, the Los Angeles County Museum of Art, the Hammer Museum at Columbia University, and the Los Angeles County Museum of Art.The organization also provides support for the SculptureCenter’s work by artists and organizations. For the award ceremony, the organization created a work by Barbara Hambly that will go on view in the summer of 2019. The work, titled", "The next Biennial should focus on “New Imaginations: Contemporary Art and Modernism”\u0097which will open in October 2019 and will consist of ten exhibitions. According to a statement, the third exhibition will focus on the “re-imagining of art through the Latin American/African diaspora.” The announcements of the biennial’s art-world champions are a major boost for the Oscar-winning actor Javier Bardem, who has been promoting his documentary Blackfish, which documents the deadly spill of the neurotoxin N,N-diethyl-oxydiphenylbriphite (BPA) into drinking water and was nominated for an Oscar.The biennial’s curator, Ana Mendieta, stated that the upcoming show will be “a dialogues between artist and viewer, between writer and listener, between poet and philosopher, between critic and critic”\u0097a kind of “section of the past.” The exhibition, which is curated by Miguel Álvarez Barcelo, will feature the work of thirty-one artists, including Alice Aycock, Luis Campos, Gere Kavanaugh, Andrea Adams, Eddie Castillo, Jerónimo De Sous", "The next Biennial should be at least six months after the quadrennial. The next iteration will take place in 2021, adding to the already established theme of the principles of love and friendship.\n\n\nA new group of artists and collectors is raising funds for victims of the Covid-19 epidemic in the United States through the country’s art world, which is suffering from a severe shortage of funds.The Art Fund, an organization that supports the arts through grants and donations, announced that it is raising funds through memberships in an effort to help combat the financial hardships caused by the novel coronavirus. The group is seeking $15,000 from its members and is asking for people to donate works they have in their possession or collections they are working on to be included in future editions of the Fund for Arts.“We are hopeful that the Fund for Arts will be able to raise funds for the Artist Relief Fund this year, and ensure that artists and collectors in the United States are protected in future years,” said David Blumenthal, president of Art Fund and founder of David Horowitz Gallery and an avid collector.First created in 1999, the Artist Relief Fund was started by David Horowitz, the CEO of private equity firm Apollo Global Management, in", "The next Biennial should be held at the city’s Contemporary Art Museum St. Louis in 2020. The first iteration of the exhibition was held in the United States in 2016.\n\n\nThe Museum of Contemporary Art (MoCA), New York, announced today that Andrea Giuffrida, the director of the Simon Laing Center for Art at the University of Rochester, has been appointed its next president. Giuffrida succeeds Daniel H. Weiss, who retired in August 2019 after twenty-nine years at the institution. She will take up the post on March 29.“Giuffrida’s ability to bring together people, ideas, and art of different eras and to grow the exhibition space to showcase exciting work across art and design in a way that allows visitors to immerse themselves fully in the work and design of the museum—a museum that has been a home for art for fifty-two years—and to bring their imagination to bear on the vibrant, timeless art of the future,” said Weiss. “Her work has in part inspired us to take the next step in transforming the center into a museum of contemporary art. My goal is to be able to work with this and future iterations of MoCA to create a", "The next Biennial should take place in Pasadena, California, in 2022. The festival will also host a series of events in the coming years, including an exhibition of work by contemporary artists at the Los Angeles County Museum of Art (LACCA), and a public sculpture garden in Gardena.In a statement, Los Angeles’s Arts and Circulations Commission (AAC) said: “The AAC is grateful to Commissioner Harris for his vision and leadership in bringing the twenty-fifth edition of the Golden Gate Biennial to Los Angeles, and we look forward to continuing this work with Los Angeles’s artists and the creative community of Southern California.”\n\n\nThe Prince George’s Museum of Art in Maryland has received a gift of more than one hundred photographs by artist Alice Aycock, the widow of the late American photographer Charles Aycock. The artist’s gift includes fifty-two photographs that were made in the 1930s and 1940s and was given to the institution by a mutual friend. The friend is the artist’s granddaughter, Marilyn Allen. The gift also includes a selection of photographs from the artist’s series “Photographs and the American Experience,” which explores the relationship", "The next Biennial should be in 2021, with the exhibition to run from March 6 to March 8, 2021.  The full list of participating artists is as follows:\nThe Schülschule, Hamburg\n\n\nThe Schülschule Hamburg, Germany\n\n\nThe Galerie danske Kunstverein Bonn, Germany\n\n\n\n\nThe Galerie danske Kunstfreiburg, Germany\n\n\n\n\n\n\nThe Galerie danske Kunstverein Bonn, Germany\n\n\n\n\nThe Galerie de Brouwerij Steeg, Belgium\n\n\nThe Galerie de Brouwerij Steeg, Belgium\n\n\nThe Galerie des Nations des Soviets, Moscow, Russia\n\n\nThe Galerie des Nations des Soviets, Moscow, Russia\n\n\nThe Galerie des Nations des Soviets, Moscow, Russia\n\n\nThe Galerie des Nations der Künste Berlin, Germany\n\n\nThe Galerie des Nations des Soviets, Moscow, Russia\n\n\nThe Galerie des Nations der Künste Berlin, Germany\n\n\nCurator and filmmaker Robin Soutar, a New York–based artist and educator who drew heavily from the Soviet Union, was murdered on Wednesday afternoon in Moscow. He was", "The next Biennial should be held in the nineteen-twenties, and the first twenty-first. In the twenty-first, the exhibition will be on the city’s waterfront, in the city’s cultural district, and in the city’s historic center. The exhibition will be led by curator and writer-director Martin Hennesy, who will be assisted by curator and arts historian and critic Dorota Ostrovska. The twenty-first will be organized by curator and curator of contemporary art Nari Ward.\n\n\nThe Institute for Art and the Future (IAF) in New York has recruited Barry Scheck to represent the United States at the 75th Venice Biennale, scheduled to take place in May 2019. Scheck will be presented with a Lifetime Achievement Award at the event, which will be held at the Forum in Venice from April 26 to April 29.“Barry is a gifted and talented curator who has been instrumental in forging new pathways in the field of contemporary art and the artist’s practice,” said IAF director Adam D. Weinberg. “With his expertise, passion, and ingenuity, Barry will help accelerate the development of a truly international platform for the collection and exhibition", "The next Biennial should also feature new works by artists whose practices are currently underrecognized and explore issues of memory, memory politics, and memory art. The first iteration of the event, which kicked off in 2001, was held in 2005. The next event will take place at the Brooklyn Museum in New York on September 9–September 11, 2020.\n\n\nThe Museum of Arts and Design (MAD) in New York has announced that it will soon host the biennial Triumph in the Bronx. The inaugural event, which will focus on the history and evolution of American motorcycle manufacturing, will be held at MAD’s new building on East Seventy-Third Street in May. Its first public performance will be the reopening of the museum on August 24.“We are thrilled to open our new space, which will include a café, a mezzanine, and a studio for artist-run events,” MAD director Marjorie Esposito said. “The festival will inaugurate the new space with a retrospective of Herb and Donna Karate’s work, and will showcase a selection of works by artists and collectives that are working today. We envision a future in which MAD’s programming and", "The next Biennial should focus on the role of art in the daily lives of the local communities, and of artists and their practices in promoting and sustaining the local environment, and should establish a new theme: the art of the seventeenth-century. \n\n\nThe Smithsonian’s National Museum of African Art (NMAA) is launching a new digital platform that will allow the public to explore and engage with the collection, exhibitions, and collections of the institution. The platform, named the Moafude, will be available by appointment only and will be led by curator Wayne W. Ashley, director and CEO of the Moafude, a nonprofit corporation established by Ma Dang Park, an African American artist, and his wife, Kim M. Park. The museum will launch the service with a new exhibition, “Nigeria and Art,” at the museum in September. “Nigeria and Art’s ‘discoveries and evolution,’ have profoundly impacted our lives and the lives of our curators, and the Moafude’s mission is to explore and create new narratives of African art through our exhibitions, publications, and programs,” said Wayne W. Ashley, director and CEO of", "The next Biennial should take place at the site of the former exhibition site of the Vittorio Emanuele Palazzo in Turin from September 16 to September 22, 2020. The exhibition will showcase works by thirty-seven artists and will be organized by the curator of contemporary art, Silvia Bertelli, and the curator of architecture, Stefano Martini, from a selection of fifty works.Following the opening of the exhibition this year, the Italian government approved a ten-million-euro redevelopment of the former exhibition space of the Milanese art and design festival, which is centered in the city, Art Triennale. The event will now be hosted at the Palazzo di Rivoli, the old home of Giorno-Palazzo, for eight weeks in 2020.The Art Museum of Turin (AMTI) in Turin and the Museo de Arte Moderno di Turin (MASI) in Rome will also be relocating their exhibition spaces. In a statement, AMTI said: “We are delighted that in the new Italian pavilion the works of Giorno, Palazzo, Tamar and Andrea will be presented in an entirely new way.”\n\n\nThe Museum of African", "The next Biennial should be held at the new Montreux Center for Contemporary Art in Switzerland, according to a statement from the Arts Council, in an attempt to ease the biennial’s financial difficulties and avoid any delays in closing the exhibition.  The documentary film The Perils of Being Human will be presented by the Swiss artist Christian Bürger, who is known for creating works of memory and memory art, and will be staged at the Palais de Tokyo in Paris. The show will be hosted by the French artist Charles Lesch, who will also present the later work Memory of a Young Girl.The König-Bruhl exhibition, which will be staged in the city of Berlin from March 16 to March 18, 2020, will be inaugurated with a performance by Swedish choreographer Marta Kauberg. The artist will travel to Berlin as part of a project titled Astrarium, an amalgamation of art and architecture that aims to reimagine the city’s Pergamon, a UNESCO World Heritage site located in the Central Alps. The exhibition will include a presentation of work by twenty-nine artists who are collaborating on works regarding the exhibition.Among the works that will be featured in the second edition, which will", "The next Biennial should be held in May 2021, and its objective should be to “address the current crisis through an international community-led effort, focusing on socio-political, ecological, and financial solutions.” The show will be organized as a “bio-platform” and will be hosted at the Smithsonian’s National Museum of Art.The public will be invited to collaborate with experts across the globe as they analyze and implement new strategies to reduce the global crisis. The exhibition will also include a special project titled “When Life and Technology Meet,” which will examine how art and technology interact to shape our physical and digital worlds. The first edition of the show, “Art and Technology” (Taft Museum of Art, New York), which was staged in 2016, was canceled after the pandemic began. The show was rescheduled for 2022 and took place in September at the Art Institute of Chicago. The second series, “Life and Technology” (Lincoln Center, New York), was canceled in April and moved to June, and the third, “Art and Life” (New Museum, New York), which was staged in February 2019, was canceled in April and moved", "The next Biennial should take place in the spring of 2021.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, announced today that it has appointed Craig Wright as its next executive director. Wright will serve as general manager of the biennial until January 2021, at which time he will assume the role of director of the Metropolitan Museum of Art, where he will remain until the end of the decade.“We are extremely excited to welcome Craig to the MoCA team,” said executive director Lynne Shea. “His leadership qualities, international perspective, and deep knowledge of the institution make him a perfect fit for this role. We are confident his vision and passion for the Met will result in a strongly enhanced next year’s edition of the biennial, and a new era for the museum.”Commenting on his appointment, Wright said: “We have been working very hard to create a new visionary model for the museum that would give our guests the experience and experience in a new way. By creating an open public space that is accessible to everyone and that is continually evolving, we feel we have created a new kind of center for contemporary art. I look forward to working with our team to develop the framework for an exciting new", "The next Biennial should be held in the Autumn. The event will feature more than 1,500 works by seventy-eight artists from twenty-six countries. For the first time, the biennial will feature works by women.\n\n\nArt historian and curator Balazska Paltseva, a Russian citizen who has lived and worked in Denver, has been selected to lead the 2020 iteration of Art Basel. Its board of directors met in March and selected her from a shortlist that included Ava DuVernay, Ana Mendieta, and Arsht. She will assume her post at a pivotal point in the development of the art world’s relationship with the Denver Art Museum (DAMI), which opened in 1976 and is one of the oldest in the nation.“The board was really impressed by how Selenka took the time to work with the museum’s current roster of artists as well as the artists of the future,” said board president Antti Antonov. “It was clear that she is an outstanding curator, and that she has the potential to further develop the DAMI’s collection with her passion.”Paltseva’s curatorial practice spans photography, sculpture", "The next Biennial should be held at the Munich Academy of Art in Germany in December. In a statement, he said: “I am delighted to extend our support for the region with this new exhibition. The artists involved in the exhibition are representing a very important moment in their careers, which is your chance to see them take part in a new way. It is my hope that the exhibition will prove that the two-thousand-year-old Munich Academy of Arts is still capable of producing works of art of the highest quality.” \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is planning a major revamp of its collection with the aim of creating new opportunities for education and conservation. The new strategy, announced last Friday, will involve the acquisition of more works by artists responding to the current crisis, including a reinterpretation of Elisabeth Künstler’s Bauhaus/Oolite Art exhibition, “One Hundred Years of Painting and Sculpture,” which will open at the institution next month, and will focus on the “art of the future—” a concept that Künstler developed in her 1989 book The Art of Tomorrow.", "The next Biennial should take place sometime in 2020. \n\n\nThe National Gallery of Art in Washington, DC, will unveil a new practice, called the National Proscenium, in 2021. The project will consist of a series of exhibitions, performances, and residencies. Titled “The Proscenium,” the exhibition will be curated by Mary Beard, who has served as the director of the museum since 2008, and will be a “plausible point of departure for thinking through the future.”The exhibition will be hosted by the National Gallery of Art’s new home in the historic Diller Scofidio + Renfro building in downtown Washington, DC, and will be inaugurated by an exhibition of works by artist-activists who are affiliated with the organization, “Pillars of Creation.” The exhibition will include works by artists such as Tunga, Minow, and Hsiao-Chun, who collectively created the Painted Garden; “Arts: The Making of Modernity”; “The Surrealist” (2016); “Theater of Operations: The American Role in the Gulf Wars” (2016); “The Wonderful World", "The next Biennial should be held at the end of October. Wang said the exhibition might also be extended to March, April, or July. If the project is not completed in June, the exhibition will be cancelled and the venue will be moved to another location. Crowds have increasingly been demanding that the museum cancel its spring 2020 event. In March, more than one hundred activists gathered at the museum to protest the exhibition by staging a sit-in, and in March, the museum reopened to the public after months of lockdown. But the demand for the exhibition to be cancelled has not stopped the museum from holding it, and in June, the museum reopened to the public for the first time in two years.According to Artnet, Wang said: “I’m trying to develop and propagate the ideas of the exhibition, which are not limited to the current exhibition, but could also be extended to the next exhibition.”\n\n\nAn exhibition of over seventy artworks by forty-nine artists that were on display at the sixth Venice Biennale in 2012 was stolen last weekend from the Palazzo delle Papesse in Venice. The works, titled The Riddle of Knots, were on display when they", "The next Biennial should coincide with the Paris International Film Festival, which will take place this coming June. In the meantime, the new exhibition, “Behind the Curtain,” will debut at the Biennale di Venezia in June 2020.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines for the permanent collection of the Metropolitan Museum of Art (MoA), which were approved by the Met during its $600 million expansion project and were implemented on Monday. The guidelines outline how the institution will handle the deaccession of works by artists such as Pierre-Auguste Renoir, who died in 1993, and of the careers of artists including Jean-Michel Basquiat, Jean-Michel Kamm, and Robert Rauschenberg.Among the works that will be removed are the work of Robert Rauschenberg, his various solo exhibitions, and the iconic photo of the astronaut Buzz Aldrin and the American flag featuring the American and Russian flags. The guidelines state that the institution will not remove works that are in storage or will be removed from display in the museum, but will direct the artist to identify the works that will be moved.The guidelines were drafted in response to the proposed relocation of", "The next Biennial should take place in Helsinki in 2022.  The theme of the 2020 edition is “The Arts as a Source of Hope.” Art historian and curator María Berrío-Valera has called the theme “incredibly ambitious and challenging.” She added that the work is “designed to explore the boundaries of both art and consciousness in a time of constant change.” Berrío-Valera and the International Center for Art History (ICAM) in Madrid will collaborate with the artists and curators of the exhibition to present an exhibition of work by the artists participating in the exhibition and to present a program of performances, performances and performances, performances, performances, performances, performances, performances, performances. The 2020 edition will include over one hundred contemporary works by seventy artists. The artists making up this year’s exhibition are Joris-Karl Coetzee, João Pereira, Hélio Oiticica, Laura Owens, Lado Rocha, Maria Suárez-Filho, and Józef Rivera. A full list of the artists participating in the exhibition is as follows:\n\n\nPace Gallery has announced that directors Olivier Ferrigno and", "The next Biennial should also include a discussion of the historicity of the Cultural Revolution. It will also include a presentation of a selection of works by the late artist Liu Xiaoming, whose work explores the impact of the Cultural Revolution on Chinese life, and a selection of works by artists who lived in the Cultural Revolution. \n\n\nThe Société des Arts et Progres (SAAP), a French organization that works in the field of art and culture, has announced that it is suing the Austrian government in an attempt to secure the release of forty-three detainees held at the Vienna prison camp. The lawsuit, which was filed in the German federal court on April 2, claims that the authorities failed to comply with international law by holding the detainees in accordance with the terms of a temporary closure agreement signed in December 2019, and that the twenty-six-month sentence that was served to Baha Mousa, a man convicted of attempted murder in Austria in January, was not commuted.“The defendants ​in Austria were not able to prove that Mousa committed the crime,” said Gabriel Lenoir, the lawyer representing the plaintiffs. “The court finds this evidence lacking.”During a hearing in March, a judge found the prisoners", "The next Biennial should take place in 2022, when the exhibition will be relocated to Iceland. The museum will also be rebuilt and reopened as a cultural destination, and will become a site for exhibitions, concerts, workshops, and other events. The museum’s temporary exhibition space will remain in use until the museum reopens in 2021. The excavation work will be completed by the end of 2022.The new museum will be inaugurated at a special exhibition of works by the Icelandic artist Gudmundur Gafni, with works commissioned by three artists: Ílind Espoon, Østebhildar Gudmundsson, and Gílméðr Sigfússon. The exhibition will be held at the museum until March 21, 2024.The new facility will be inaugurated at a special event on the Icelandic landscape, the theme “The Icelandic landscape and its inhabitants,” organized by Erik Bryndemann, director of the National Museum of Iceland. The exhibition will be open to the public from March 18 to March 21, 2024.“This is an extremely important moment in the history of our institution, as we prepare to re-open as an industry hub for a growing number of emerging and established", "The next Biennial should focus on the history of school politics and institutions in the city, and the themes of the exhibition should be related to the students’ aspirations to learn about politics. “We are on the brink of a new political moment,” said Marcel Lanzmann, the art director of the Haus der Kunst, who added that the exhibition should be about “the biennial as a platform to challenge the state, to engage the state institutions.” The festival will be hosted at the Württembergischer Kunstverein Berlin (Württembergischer Kunstverein B) from March 23 to March 25.Participating artists will include TamerMokhtar, of the Pindus, the Museum of Modern Art in Stuttgart; Ahmad Eissa, who created a series of sculptures that explore the ideas of the abstract; and Anwar Raad, who will present his first solo exhibition in Switzerland in 2022.\n\n\nThe National Gallery of Canada announced today that it is preparing to reopen following a $450 million expansion in January 2020 following the completion of an environmental study and will welcome visitors in March. The National Arts Centre in Ottawa announced that it is planning", "The next Biennial should take place in 2023. “The new exhibition will feature the work of more than 150 artists, including many from the Biennials’ countries of Brazil, Spain, and Portugal, in addition to the biennial shows that have previously presented works on the premises of the Biennials,” Miguel Álvarez Guimaraes, director of the Biennials, told Artnet. The new shows will engage with themes of memory, memory of the past, and the relationship between art and memory. As part of the new partnership, the International Biennials (Ib) will collaborate with the local artisans of São Paulo, Largo do Povo, and São Paulo, and will partner with local organizations to promote awareness and appreciation of the art and craft of the local communities in the cities of São Paulo, Largo do Povo, and São Paulo. Though the new exhibition will focus on Brazilian art, the show will also feature shortlisted artists from South America. The biennial will also feature new works by artists from the Americas and the European region. “This is a historic moment for São Paulo, a city of great promise and strategic importance in", "The next Biennial should be held in 2019. \n\nSince a statement published by the artist in a February 2018 issue of Artforum revealed that she plans to leave the Southbank Centre in London in the next few years, the south London institution has been working to transfer its collection, which comprises work by around fifty artists in various stages of their careers, and has been looking for a new home for the collection. In February, a group of artists, including Alison Fair, Marc-Olivier Ferré, and David K. Breslin, launched a campaign to have the collection moved to the University of Oxford, which has an extensive collection of the artist’s work in its collections. The exhibition is currently on view as part of the Oxford Biennial, which is sponsored by the Bournonville Foundation and the Knoedlermans Baroness von Koenig, the former home of the Southbank Centre.The petition that has gained support from activists is led by Ai Weiwei’s granddaughter, Anna Wintour, who told the Art Newspaper that her grandmother would “work tirelessly to ensure that we are given the opportunity to see and hear her work.” She added: “She is a widow, and", "The next Biennial should be held in 2022. Its director, Professor Alexis Jay, said: “You can't have a meeting with a filmmaker every day and ask them to create a work that will be the subject of a Biennial in 2022. . . .Since we are a museum, not a studio, we have to create a work that will be as meaningful for a public and also for the researchers. We are not creating a work for the public to understand and to enjoy, but a work that will create a new understanding of the history of art.”\n\n\nMore than two hundred artists and collectives have signed an open letter condemning the Trump administration’s proposed $2 trillion budget for the Arts and the Media, a $10.3 billion increase from the $1.1 trillion enacted just last year. “We are writing to challenge the President and Congress to seek a balanced, across-the-board, funding increase for the Arts and the Media,” reads the letter, which is addressed to Congressman James E. Clyburn, the president of the Democratic caucus, and to Senate Budget Committee chairman Patty Murray, the committee chair, and is dated April 14.Clyburn said he is", "The next Biennial should be held within the next two years. “Because of the strong interest in the history of art, the museum, and the city of New York, Artforum has decided to partner with Artforum,” said Peter Erskine, director of the Metropolitan Museum of Art. “We are eager to work with Artforum in celebrating the history of art, and to also present works by artists whose practices are new to us.” The New York Biennial will take place in the Fall of 2019.The studio’s new initiative, Artforum Live!, will stage an exhibition of work by fifty-four artists in New York on September 14—the first day of the biennial’s inaugural season. The show will feature work that is in the works or about to be exhibited at the Biennial’s inaugural event, Artforum: Art as Performance, which will return in October, and will include the first exhibition of work by two artists, Hans Larsen and Christopher Woolf. Today’s exhibition commemorates the first exhibition of work by two artists of the new millennium, Artforum: Art as Performance, which will run from October 10 to October", "The next Biennial should take place in the fall of 2020. The Biennial of the British Museum will be held in the same building as the London Gallery of Modern Art (LAGMA), the Institute of Contemporary Art (ICA), and the Tate, which will reopen in the spring of 2021. The Editio Regis biennial is curated by Michel Houellebecq, director of the French/British Museum; Jocelyn-Anne Oostra, director of the Tate; Peter Zumthor, director of the LACMA Museum of Art; and Markus Richter, director of the International Center for Contemporary Art in Munich.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Jessica P. Bock, a curator and educator, as its next executive director. The ten-member board of directors also elected two additional board members: Alex Tse, who provides strategic direction for the museum’s growing collection of colonial, nineteenth-century, and contemporary art; and Artsakh Yalchik, who helps shape MoCA’s programming and public engagement.“In her new role, Jessica will lead the Museum’s transformation to become a more culturally and", "The next Biennial should be held in 2022. \n\n\nThe VIA Gallery of Art in New York is preparing to open a new museum in the city’s Hudson Yards neighborhood, which has been home to several major works since it was redeveloped in 1996, in 2021. The project will be spearheaded by former landscape and urban designer Jonathan Mies, whose studio is currently being represented by Mies + Co., in collaboration with architect and landscape gallery founder Mark Bomback.Located at the intersection of Twenty-Fifth Street and Seventh Avenue in Midtown Manhattan, the new museum will boast 2,200 square feet of exhibition space designed by Bomback and will be situated in a former steel mill and will be designed by the New York–based firm TUCKER & MIES. The project was originally announced in 2018, but it hasn’t been completed. The new institution will be financed entirely by the city, with funding from the Mies Foundation and the Dedalus Foundation.“We are excited to create an open, contemporary space for contemporary art in New York City,” said Matt Mullen, director of the VIA. “The new VIA will present both a new home and a new collection, providing", "The next Biennial should be in 2022. \nDiane Regal-Vega, managing director of the Los Angeles County Museum of Art, said: “The new installation at LACMA is an exciting departure from the Museum’s conceptual and artistic practice. It is a reflection of the muse’s desire to involve all of the surrounding world under the same sky. It is a new kind of world to inhabit. It is an experience to be experienced by everyone. It is art.”\n\n\nThe Tosca Foundation in New York has announced that it will donate $1.3 million to the Visual Arts, Poetry, and Music (VAM) arts and cultural nonprofit organizations in support of their work in the wake of the devastating earthquake and tsunami in Japan. The funds will go toward the acquisition of works by artists from two of the country’s largest arts and cultural institutions, the Tohoku Museum of Art and the Dojo Museum of Modern Art, as well as the installation of work by thirty-seven artists across Japan and the United States.Founded in 2012, VAM has previously donated works by artists such as Rina Banerjee, Yoko Ono, and Hatsumi Kim, as well as", "The next Biennial should be held in 2021; the oldest of the current series, the first was held in 1978.  “The exhibition of the work of a new artist is a very special moment,” said Susana Rind, head curator of the biennial. “In this case, it is Marina Siqueira. She is a remarkable artist and we are honored to have her as part of the Biennial.”The fifth iteration of the Biennial will take place in São Paulo in 2022.\n\n\nThe National Gallery of Art in Washington, DC, has received a gift of thirty-one works by seventy-one artists from the artist’s estate. The works, which were auctioned in a benefaction of $6 million in June, include works on paper, photography, and sculpture, as well as works on paper and photography that were mostly created by Silvestre Barba, Enrico Castelli, Filippo Celant, Raphaela Celano, Andrea Cerciello, Dietrich Cone, André Dufour, Andrea Hernández, Bianca Hernández, Emmanuel Koons, and Jul", "The next Biennial should be held in 2020, and the first in the second half of the century. In a statement issued by the organizers, the biennial will take place across fourteen venues, in Berlin, Kassel, Kassel-Stuttgart, Vienna, and Zurich, and will employ a variety of artists.The theme of 2018 is “Nature vs. Nature” and the theme of 2020 is “The Unfolding of Nature.”The 2020 edition of the biennial will take place at the city hall in Bern, and will feature work by fifty artists from twenty-eight countries. Approximately twenty-three thousand visitors will take part in the event. The full list of participating artists is as follows:ADAM MAYFIELD - On the River,” New York, New York, NY, NYADAM MAYFIELD - Walking On,” New York, New York, NY, NYADAM MAYFIELD - The River,” New York, New York, NY, NYADAM MAYFIELD - The River,” New York, New York, NY, NYADAM MAYFIELD - Walk On,” New York, New York, NY, NYIMERICA HOFFMAN", "The next Biennial should take place at least once a year, and should include a selection of work by scholars from the United States and the United Kingdom and the exhibition should include a biennial introduction by Jonathan Haiduk, a curator at Architecture Research Lab; a presentation of a new work by Hernán Díaz, a professor of architecture at the University of the Arts Barcelona; and a series of interviews, a biennial catalogue, and the exhibition of a new work by Laurence Rutter, a curator at the Renaissance Society.Saunders, who has curated exhibitions at the SculptureCenter in Detroit and the Museum of Modern Art in New York, was appointed curator of the twentieth edition of the Edinburgh International Biennale (EBI) in September. The biennial will take up the themes of sustainability, the environment, and art, and will run from March to October 2021.The biennial will be curated by Helen Cammock, who was previously director of the Museum of Contemporary Art, Los Angeles; Casey Kasem, director of the Museum of Contemporary Art, New York; and Wilfred Owen, a curator at the Museum of Modern Art.Commenting on her appointment, the artist-in-residence said: “It is", "The next Biennial should also take place in 2020. The project group will also be partnering with local art institutions to develop programming and to organize exhibitions. The next edition of the Biennial will be comprised of four stages: Opening Ceremony, Art of the Presentation, Art of the Future, and Art of Experience. The 2019 event was closed to the public, and this year’s event will be hosted only by the São Paulo de Cultura Brasileira (SPBC), which will also host a free event at the Olympic Stadium on January 7, 2020. The changes to the biennial for 2020 were made in response to new developments in the Brazilian arts industry. According to the Art Newspaper, by 2020, the exhibition industry will be able to generate around $1.5 billion annually and artists will be able to earn $1.2 billion.In an effort to diversify the exhibition market, SPBC will sell three new series of works only to the public at the biennial. Titled São Paulo de Cultura Brasileira (2018), São Paulo de Cultura Brasileira (2019), and São Paulo de Cultura Brasileira (2020), the show will feature works from thirty-six", "The next Biennial should take place in the year 2021, with an exhibition of works in the exhibition area of the museum on the first day of the biennial. The next iteration, comprising thirty-six drawings, would focus specifically on the history of the Québec artists. The next was to be held in the year 2022—the first exhibition of works by artists of the Québec region.“This is a very exciting time in our history,” said de Bonvoisin. “With the establishment of the Biennial de Montréal, we are at the beginning of an important and transformative journey, which will explore the history of the Québec artists, and will give the region and the country the chance to understand and grow from the same artist’s artistic legacy.”The Biennial de Montréal will be in the city of Montréal until March 18, 2021.\n\n\nAs part of a deal struck between the Museum of Modern Art (MoMA) and the heirs of the late Whitney Museum of American Art founder H. L. Menelik, the institution has agreed to sell more than two hundred works by African American artists, including John Chamberlain, Lee Greenwood, and Rayyane Gant, as part", "The next Biennial should take place at the Museum of Contemporary Art, Philadelphia (MCA), in 2021. \n\n\nThe National Ballet of Scotland announced that Emily Hall, whose forty-five-year tenure included twelve biennials, has died. Hall will be remembered for her leadership at the institution, which is currently being restored in partnership with the Royal Mint and the Royal Shakespeare Company, as well as for championing artistic experimentation and experimentation.A leading theorist of both modernism—her work has been collected by the Metropolitan Museum of Art, the Museum of Modern Art, the National Theatre, the National Galleries of Scotland, the National Gallery of Art, the Royal Shakespeare Company, and the National Galleries of Scotland as well as by the San Francisco Museum of Art, the Los Angeles County Museum of Art and the Seattle Art Museum—Hall was an outspoken and instrumental advocate of the arts in both Scotland and America. She was especially devoted to the arts in America and was instrumental in the acquisition of seven works by American artist Thomas Mackay (1906–1986) and six works by Japanese artist Tadao Ando (1903–1992), among others.A vocal critic of the National Theatre, Hall said that it has been “better", "The next Biennial should examine the historiography of the mid-twentieth-century feminist movement, with a particular focus on the men and women who shaped its history\u0097including lesbian author and activist Betty Hill, whose work influenced many feminist scholars; Judith Butler, the feminist philosopher, theorist, and critic; and Germaine Greer, an American American art historian and scholar who advocated for a body of work that was both feminist and anti-sexist. “The first year was basically about us as individuals, young women, and the biennial was a project for us as a group,” Yinka Shonibare, a cofounder of the exhibition, told the Art Newspaper. “We are very proud of the work we have done for the biennial, and we hope people will share in our enthusiasm. After the exhibition is over, we will create new work for the exhibition.”The biennial will be held at the New Museum in New York from November 25 to December 15 and will present work by twenty-six artists, including Meg Ryan, Diana Vreeland, Christine Lee, Wangechi Mutu, Nia Long, and James Turrell, among others from twenty-six countries and territories. The", "The next Biennial should be held in 2019, and the first in 2020.” In a review in the February 1971 issue of Esquire, William S. Burroughs wrote: “It is a pity, really, that no other exhibition of the best and most important works is being organized, planned, and staged in the United States in the most prominent and imaginative manner possible. . . . The biennial must first be organized and planned before the biennial can be staged. That is the only way the biennial will be realized, that is the only way the biennial will be taken seriously as a work of art.” The Biennials are commissions that are created by the Los Angeles–based nonprofit organization Artists & Sculptors, and are on loan to the Museum of Contemporary Art (LA) for the purpose of supporting the museum’s collection and enrichment program. The grant program was established in partnership with the artists in order to ensure that the institution would be able to continue hosting important works even if the artists were no longer able to produce them.“We are grateful to the artists and the board of trustees who have chosen to engage in the public program, and especially to the artist for taking the initiative", "The next Biennial should be called the biennial of the deposed: We have one duty in life, to serve those around us. The president continues to promote the rule of law and the rule of law is good. The need for unity is urgent. This is a crisis for all of us who are affected by it.”Announcing the decisions, which were made in the form of a letter dated March 28, the eight founding members of the Federation of American Artists (FA), including Paul Gauguin, Jean-Michel Basquiat, Jean-Michel Léger, Emma Lazarus, Hildegarde Duane, and Robert Irwin, wrote that the decision to pull the works from exhibition venues was made in the interest of protecting the independence of the museums’ curators. “Given the current situation where the ‘Muslim ban’ has been implemented, our curators are acutely aware of the potential for conflict.”Activists have since criticized the move, claiming that the decision to pull works from the event violated international human rights laws. “The FA has been accused of politicizing the issue,” Elad Oresme, a French art historian and campaigner for freedom of expression, told the Art Newspaper", "The next Biennial should be held in the spring of 2022. The biennial will feature an additional forty-three works by thirty-five artists, including Tanya Bonakdar, Domenick Colucci, Carlos Garaicoa, and David Hayashi, all of whom were selected for their work at the annual Art Biennale in 2016.The 2017 biennial was titled Art, Politics, and the Gulf. The exhibition, which was curated by Yayoi Kusama and featured works by forty-eight artists\u0097including Alia Jawad, Beno-Tarnwani, Bianca Henrique, Andrea Graziano, Zoya, Benedict Palazzo Tibaldi, and Juan Araya\u0097was followed by Art, Politics, and the City, 2018, which was hosted by the architects at the Guggenheim; Vision 2019, which was organized by the architects at the Guggenheim; and Art, Politics, and Blackness, 2019, which was organized by artist and curator Jodi Thresher.\n\n\nThe Museum of Modern Art (MoMA) in New York is planning to donate more than 15,", "The next Biennial should see a maximum of twelve works by artists and should take place between March 19 and March 22. The exhibition will include works by artists who have participated in the exhibit in the past and will introduce new collaborations between artists and the Venice Biennale. The biennial will also include projects by the artists within a memorial garden that will be inaugurated by a sculptor and a photomontage.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles‎ announced today that it is turning the institution’s sculpture park into a permanent home for the Los Angeles County Museum of Art (LACMA), a facility slated to open later this year. The museum’s new director, Kaywin Feldman, said that the move will “provide a critical opportunity to test the new technological solutions offered by Google’s artificial intelligence, and to build on LACMA’s collection of world-class contemporary art, a museum that is a model for the future for museums working in the area.”The Los Angeles County Museum of Art (LACMA) is one of the many urban cultural centers undergoing a renaissance as the city’s population continues to swell. According to the Los Angeles Times, the", "The next Biennial should be on the United States,” said the organizer, who added that the event will likely be on this year’s September 22-28 date. Advertisement\n\n\nOn Thursday, the Brooklyn-based nonprofit Artspace Artspace announced that it will create a new $500,000 prize for emerging artists in honor of its 125th anniversary. Titled “Admiral Washington,” the prize will honor the “decisive and visionary leadership of Admiral David H. Petraeus, the United States’ greatest general and the founder of the Central Intelligence Agency.”The organization bought a custom-built, four-thousand-piece bust of General Petraeus at a cost of $8,500 at an auction in September. The bust, which will eventually be installed in the lobby of the Museum of the City of New York, is dedicated to General Petraeus and will sit alongside the General’s award ceremony. Prior to the event, the museum will release an artist’s statement commemorating the birthday. The statement will address the themes of “war, peace, and government,” “the future of America, and the impact of the atomic bomb in Hiroshima,” and “the", "The next Biennial should take place in 2020. The first was held in 1990 and consisted of twenty-nine exhibitions. The last was held in 1997 and consisted of twenty-two exhibitions. The first exhibition was of a collection of popular printed photographs, the second of an exhibition of new works by Kammohan Menon\u0097a first-hand account of his experiences in the First and Second World Wars\u0097the third exhibition was of a painting by Kannu Saundagal\u0097a collection of contemporary work.“As we continue to advance as a society, we are committed to promoting and defending the legacy of Lenin\u0097that is, to defending the achievements of Marxist-Leninist-Maoist revolutionaries and socialists who set the agenda for contemporary art,” Tushar said in a statement. “The theme of the forthcoming twenty-fourth Biennial is ‘Living in a Material World,’ and the exhibition will showcase the history of Indian art, with particular reference to the early and mid-1970s, which is the context for these works. The exhibition will also explore the possibilities of preserving and reinterpreting Marx’s art.”In addition to the upcoming exhibition, the", "The next Biennial should be held in 2022.”\n\n\nThe National Museum of Ireland (NUI Galway) has received a donation of twenty-eight works from the collection of Thomas C. Donohoe. The donation includes works by artists such as Benjamin Britten (1858–2001), Mervyn King (1907–2008), and Francis Bacon (1880–1973). A selection of paintings, photographs, drawings, and sculptures will also be presented at the museum, which is currently undertaking a major renovation and expansion of its grounds and grounds, which are currently undergoing restoration.“The collection is extremely important for Ireland and for the world at large,” said museum director Mary McAleese. “We are deeply grateful to Thomas, who has made so much possible for the NUI, and especially to his mother, Mary McAleese, who has been instrumental in supporting her passion for art since the boys were born.”The National Gallery of Scotland, which also owns the collection, is also requesting that the work be added to its collection. The institution confirmed that it has received the gift of twenty-four works from the collection of Edward Tufnell. The work is currently on display in the exhibition �", "The next Biennial should be held in 2021. The date of the first event was also changed to accommodate the new year. \n\n\nThe Museums Association (MA), the UK’s professional society for museum professionals, has announced that it is pushing back the launch of its next general meeting to sometime in the second half of the year. The announcement comes after a series of events in the United Kingdom and the United States that have raised awareness of the threat posed by the coronavirus.Among those that have been affected by the novel coronavirus are dozens of workers at Britain’s Tate galleries, which were forced to close last month due to concerns over the virus. Although the workers were not infected, they were warned that the virus could be transmitted to the public. Tate director Maria Balshaw told the Birmingham Post that the workers were not told their temporarily closed galleries would be closed for weeks or months. When they were informed they were temporarily closed, some were concerned about their families.“We have received a great deal of communication from staff and visitors since the closures were announced and from professional bodies, including the British Medical Association, the Royal College of Art, the Institute of Arts, the Royal College of Art, and the", "The next Biennial should take place in 2022.\n\n\nThe City of New York announced today that it will inaugurate three new public art commissions in the city, which is currently dealing with its first outbreak of Covid-19. The third will figure prominently in the upcoming 2018-19 season, when it will host the sixty-ninth iteration of the Metropolitan Museum of Art, and the first will be a new public sculpture made of bronze and steel.The announcement follows Artnet News’s exclusive report, “Atomic Clock: The Emergence of Modern Art and Technology,” which presented new data from the World Health Organization (WHO), asserting that the number of people infected with the virus has surpassed the number infected with the novel coronavirus, which is spread mainly by close contact. Between 1.2 and 3.2 million people worldwide are infected with the novel coronavirus, which is also spread mainly by sharing a home or vehicle. The World Health Organization estimates that there are currently more than 3.5 million cases worldwide; of these, around 2.5 million cases are in the United States.The city is trying to contain the spread of Covid-19 by ramping up its use of the city’", "The next Biennial should take place at Haus der Kunst in Munich in 2022. <|endoftext|>On March 22, 2019, the National Ballet in London released a new catalogue for its second edition, “Intermissions: The Art of Intermission,” which debuted at the Musée d’Art Moderne in Paris on April 4 and ran through March 17. Titled “Ascension of the Body,” the work explores how the body—often viewed as the final stage of creation—has evolved into a central theme and the performance inside of a Caucasian glass chamber, a medieval laboratory, became a work of art.As part of the 2019 London Triennale, the production also received a special grant from the National Lottery Heritage Fund to commemorate its 1500th anniversary. The National Lottery Heritage Fund will support a number of special projects, including a biannual exhibition dedicated to the performance in the UK, and will also donate £50,000 to the Royal Society for the Arts.The exhibition, “Intermissions: The Art of Intermission,” will be on view until September 29. The show will also include an exhibition of works by fourteen artists, including Andrew Low, Peter Sellars, Stephan Gier", "The next Biennial should be held at the Museum of Contemporary Art Chicago and will be announced in the spring of 2021.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, announced today that it is again collaborating with artist-run art circles in the city, this time by inviting them to a special exhibition that will open on Thursday, March 26. Titled “What is Life?,” the show will take up questions posed by artists such as David H. Christova and Joan Miró, who are grappling with the same issues as the contemporary art community: “What is life, especially in the year 2185?”“The exhibition is a way for MoCA to introduce the public and local art circles to the work of its artists,” said museum director James Cuno in a statement. “Their achievements and the work of many others is a way to make the Museum of Contemporary Art Chicago a reality.”The exhibition is organized as follows:Thursday, March 26, 2019: “What is Life,” Titled “What is Life?,” is an exhibition that examines the classical elements of life (such as food, drink, shelter, and light and is organized around the theme", "The next Biennial should be scheduled before the inauguration of the new president of Brazil, Jair Bolsonaro. Mr. Sérgio Oliveira, president of the Brazilian Association of Curators, said: “The next edition will be an important step of abandoning all illusions and returning to the real: an action to re-emerge the Brazilian Republic with a new constitution, a new government, and with new institutions.”In a recent dedicated letter, the W.A.C.B. wrote that the upcoming festival should be a “learning experience for the Brazilian youth, a celebration of diversity, an occasion for cultural exchange and coordination,” but “at the same time, it must respect the human rights of the participating artists, the organizers, and the participants.”\n\n\nThe Museu de Arte Contemporáneo (MAS), Spain, has announced that it plans to dedicate a new museum to the late Venezuelan artist María Berrada, and her work, the Formosas, an experimental assemblage that explores the relationship between photorealism and performance. The institution is also planning to build a new museum dedicated to the late British painter Henri Cartier-Bresson, whose vast and", "The next Biennial should be in early 2021, said the architects.   Their proposals were presented at the sixth edition of the London Biennale (LB16), which ran from May to November 2017.The themes for the eight-day event were “Civilisation and Revolution” and “Modernity and Culture” respectively.\n\nFausto Cipolotti, the Italian director of the Palazzo Bernardo, has announced that he intends to leave the Italian cultural institution in September next year. He has been working on a new project for the thirty-fifth edition of the Milan-based fair for two years, and the exhibition will take up the theme of contemporary art and politics.Cipolotti, who has been a director of the Palazzo Bernardo since 2011, said: “I am extremely happy to see the results of the last two years. The project of the Milan Biennale has been a big success, with more than three hundred exhibitions and nearly two hundred performances, and I am convinced that its future lies in the hands of the artists and not in the hands of the institutions.”Cipolotti, who was appointed director of the Italian pavilion in 2011, said that a new", "The next Biennial should take place in 2021, and the 2019 winner will be presented with a Lifetime Achievement Award by the museum in the spring of 2020.The other nominees from the 2020 biennial are Anton Kern, Terence Blanchard, Sam Fine, Pete Townshend,  and Sidney Rorke. Montague will present his scholarly presentation of the Art of War exhibition at the Biennial for the first time in October.This year’s biennial will be staged at the Sennheiser Center in Philadelphia and will be organized as a platform for a number of exhibitions. The exhibition “reinvents our notion of a museum as a center for human experience in order to better understand and address the origins and evolution of conflict and conflict prevention in the twenty-first century,” said museum director John Stein.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has announced that it is delaying the opening of the new exhibition “Beyond the Frame,” which was commissioned by the artist-run group Artadia, until February 6 because of concerns surrounding Covid-19. The show, which will feature works by seventy-four contemporary artists that were either created or", "The next Biennial should be held in the coming months. The full list of participating artists is as follows:Ivan AlbrightYale AgilanMitchell AllensMerry C. AdamsMichael A. AntoniouAllyson BarronMichael KorsMichael KorsMerry C. AdamsMichael KorsMerry C. AdamsMichael KorsMichael KorsMerry C. AdamsMichael KorsMichael KorsMichael KorsMichael KorsMichael KorsMichael KorsMichael KorsMichael KorsMichael KorsMichael KorsMichael KorsMichael KorsMichael KorsMichael KorsMichael KorsMichael KorsMichael KorsMichael KorsMichael KorsMichael KorsMichael KorsMichael KorsMichael KorsMichael KorsMichael KorsMichael KorsMichael KorsMichael KorsMichael KorsMichael KorsMichael KorsMichael KorsMichael KorsMichael KorsMichael KorsMichael KorsMichael KorsMichael KorsMichael KorsMichael KorsMichael KorsMichael KorsMerry C. AdamsMerry C. AdamsMichael KorsMichael KorsMerry C. AdamsAndrew Kellogg Andrew KelloggAndrew Kellogg Andrew Kellogg Andrew KelloggAndrew KelloggAndrew KelloggAndrew KelloggAndrew KelloggAndrew Kellogg", "The next Biennial should take place next month, at the São Paulo Congress Center in Brazil. \n\n\nIn an effort to help the homeless, the City of New York has committed to providing free medical care and food to low-income New Yorkers through the New York City Alliance for the Health and Well-Being of All, or NYCHA, as it is known. Mayor Bill de Blasio signed an executive order on Monday directing the Department of Homeless Services to begin providing emergency health care, shelter, and food to helicopter dropoff locations, including public food banks, within the city. The directive explains that the program will not target individuals due to their religious beliefs, but will work with any individual who resides in the City and is willing to accept food assistance. According to the New York Times, the pilot program is running from November 6 to November 8. The pilot program will last for sixty days, from November 7 to November 10, and will be funded with money from the Homeless Drug Free Coalition. The coalition, comprised of the New York City Alliance for the Prevention of Homelessness (NYCHA), the National Association for the Prevention of Homelessness, the National Association of Realtors", "The next Biennial should be held in 2020. The upcoming exhibition “Between the Sun and the Moon: Venus in the Sky” will be staged in Hong Kong in 2022. The 2018 exhibition “The Green Garden: The Architecture of Life” was also hosted by Hong Kong and Hong Kong Art Museum (HKMO) and will be presented in February 2022.\n\n\n\n\n\nThe Hunt Club at the Museum of Modern Art in New York is moving three years of collection photography to the digital realm. The move is part of a strategy to eliminate the need for an international body to oversee the collection’s transfer to a new platform that will be led by Hong Kong-born curator and entrepreneur Angela Ahrendts. She will assume a leading role in the art museum’s new digital ecosystem, dubbed Digital Horizon, during a forty-day period beginning March 8.“In this transition, we have chosen to align with Angela’s vision and vision for Digital Horizon as she has led the museum through many iterations,” said collector and board president Jonathan Donenfeld. “Her recent work at the museum has been prescient and has inspired us to reexamine the relationship between photography and the arts.”Don", "The next Biennial should take place in 2021, with the art-world calendar shifting to 2020. The next edition of the Berlin Biennale will take place in March 2022. It will take place at a new theme park in Kreuzberg, which is currently undergoing a $100 million expansion. The event will run from March to March 2022 and will be curated by Maren Csirag, the director of the Künstlerhaus Hannover, and Emil Bischof, the head of the Karlsruhe and the Friedrich Rühle institutions, both in Frankfurt. \n\n\nThe French Ministry of Culture and the Louvre have announced that the elusive London-based collective Ghost and the Cockpit will stage an exhibition in the city in 2020. The announcement comes a few weeks after the institution revealed that it would be closed until March 29, 2020, in order to complete the regeneration of its exhibition space.Revelations that the Tate was planning to ceaselessly invest millions into rebuilding its galleries and museum in an attempt to increase its financial viability led to a series of dramatic cuts at Tate Britain, the nonprofit arm of Tate’s board of directors, in December. The Tate’", "The next Biennial should be held in the spring of 2021.  The exhibition will feature twenty-six works by twenty-three artists, including Sun Yang, Peng Fook, and Yinka Shonibare. The theme of the show is “The Great Leap Forward,” and its theme of the Biennial will be “Future Present.”\n\n\nA New York jury found the artist-run nonprofit Art in America guilty of fraud in a lawsuit filed by New York’s Sargent’s Daughters, also known as the Daughters of St. Andrew, over the sale of a painting by Pablo Picasso, The Birth of a Nation, which was commissioned by the family of John D. Rockefeller, the oil baron and the father of Standard Oil, in 1973 and sold to the Daughters for $58,000 last year.The jury also found the Daughters guilty of falsifying records and deceiving the public about the provenance of the work, which was on display in a public-private partnership between the museum and the Rockefeller Brothers Fund in 2008. The partnership was set up to promote the work, which is on display in the museum’s permanent collection, in a", "The next Biennial should be held in 2020.\n\nMany of the biennial’s artists, who include Ali H, David McAllister, Mark Mothersbaugh, and Wong Kar-Wai, are not involved in the current protests. However, the activism of the artists has a particular resonance in the United States. When the artist Mary Oliver was arrested for refusing to leave the White House in 2017, she was released on $2,500 bail and allowed to go home. Oliver has since been charged with one count of obstruction of justice and one count of assault and battery.Oliver’s family and supporters are demanding her release and she is scheduled to appear in court in May.\n\n\nThe São Paulo Biennial de São Paulo (SPB) has announced that Marina Kudacki, the Brazilian who was detained by Brazilian police for nearly three weeks last March in connection with the murder of a fellow artist\u0097Jupp Heymans\u0097was acquitted of the charges on Thursday.While the presiding judge declared that Kudacki was not guilty of the murder of Heymans, the jury was unable to reach a verdict on the obstruction of justice charges because of a lack of evidence. “In order to reach", "The next Biennial should be held in 2021. “We are not interested in overwriting the work of Exalía-Araújo, but we are interested in the fullness of the project,” the Lévy-Hauser and Bacon catalogue director, Anya Sze. “It is a question of how much longer we let these things, and we have no choice but to take part in this process.”\n\n\nThe British Academy today welcomed Daniel H. Pink to its board of directors, which has five members appointed by the Queen, as chairman of the Royal Academy of Arts, the country’s foremost arts institution. He succeeds Ciarán Donovan, who retired in March 2019 after twenty-one years at the helm of the institution.“Daniel is a leading scholar, a scholar with a keen understanding of the key role that music has played in shaping the course of modern and contemporary art, and a thinker whose vision opens up new possibilities for thinking about music and art in the 21st century,” said Diane Hudson, director of the British Academy. “I look forward to working with Daniel to ensure that the Royal Academy of Arts is positioned to make the most of the exhibition calendar in", "The next Biennial should be held in the spring of 2021. It will be curated by an independent committee comprising artists, curators, and researchers from the sixty-five-member board of trustees. \n\n\nThe National Museum of Sex in New York City announced today that it is launching a new, free, online service that will allow visitors to dive into the personal histories of four dozen of its most celebrated sex heroes, including Jane Austen, Emily Dickinson, Rosalind Russell, and Eileen Atkins. The program, called the Sex Historians, will be led by a select group of twenty-one artists; it will run through March 8 and will get underway on March 10. The tour will include a wide range of historical focuses including the voyeuristic fantasies of the Victorian sexologist Charlotte Paine, the erotic myths of Edie Sedgwick, and the controversial works of Frank Stella.\n\n\nFrench President Emmanuel Macron has appointed a new minister of culture, Alice Porn, and a new minister of culture, Filaal Abou-Rahme, as communications minister. The appointments were made on the occasion of a year-end review of French culture, spearheaded by Macron, in Paris on March 14. The review\u0097which was published in", "The next Biennial should be held in March 2020, with a view to the reopening of the exhibition in the spring of 2021.\n\n\nThe Berlin-based arts organization the CAA Berlin (CAA BAM) has received a gift of eighty artworks from the German state of North Rhine-Westphalia (NRW), including twenty-six works by artists such as Konstantin Markov, Alexander Solzhenitsyn, and Herman G. Klint, as well as twenty-seven works by contemporary artists, including Mira Dancy, Málaga, and Derick Almerano.This is the fourth gift of works by the German artist-in-residence, who is a member of the collective oAlber, and it is also the first gift of works by the artist-in-residence in Berlin since he arrived in the city as part of the project 'Berlin in a Day, Berlin 2010: Art in a Day.“This project has been a privilege and has brought us the works of more than fifty artists, as well as the innovative idea of bringing them together in one place in the city,” said Kurt Wieder, the chair of the board of directors of the CAA", "The next Biennial should be released in 2020. The exhibition will take up the themes of biennialism and the visual arts and will include work by eighty-three artists, including Romain Leclerc, Robin Wiesenthal, Alighiero Gigli, and Arsht and Diem, among others, and will feature works in the works of paintings, photography, video, and sculpture. “We are incredibly privileged to be able to present the latest work by these artists in the Biennial of Beauty,” said Carmen de las Casas, the Deputy Director and CEO of Biennial of Art. “These artists are a rare breed, and their contributions to the artistic canon are as important today as they were forty years ago.”\n\n\nThe Victorian Art Museum at the University of Melbourne (VAM) has received a gift of twenty-six works by the American artist and designer Richard Diebenkorn. The gift, which includes works by artists such as Edward Nigma, Richard Avedon, and Zora Arkashian, as well as a selection from the artist’s collection at the Museum of Modern Art in New York, was delivered to the institution by the American collector and collector", "The next Biennial should be held in January 2022 and will be led by the curator-in-charge of the museum, Hisham M. Sultan; the director of the Royal Academy of Arts, the Museum of Modern Art, and the Architectural Association, Anish Kapoor, and will organize a series of interviews with leading figures in the art world, such as Rudolf Bode, Mark Rylance, and Wolfgang Mitte; and will be supported by an endowment from the British artist and collector Anne-Marie Boetsch, who has donated $5 million to the institution.\n\n\nThe Metropolitan Museum of Art (the museum) has appointed Joseph P. McManemy as its next chief curator and chief curator of contemporary art. McManemy will be the second director of the Met since Simon L. Borenstein retired in 2016. He succeeds Robert C. Higgins, who will remain involved with the museum through 2021.“We’re thrilled to welcome Joseph to the Met,” said Mark Doty, the museum’s director and chief curator. “In recent years he has been a pioneer in creating an intimate relationship between the museum and our audience. His powerful curatorial vision and ability to connect with a", "The next Biennial should take place in the summer of 2021. Artforum has reached out to Stacey to see if she can comment on the biennial’s plans and will update this article with her comment.\n\n\nThe Museum of Fine Arts (MFA) in Boston announced today that it is collaborating with Boston Children’s Museum (BMB) on a new interactive contemporary art experience. The project, which will involve rides, storytelling, performances, and artifacts, will be called the Museum of Contemporary Art Connects, and will be launched by the museum on September 10.“This is an unprecedented opportunity to bring together the two organizations at precisely the same time,” said MFA director John Neal. “We are confident that when the experience of both the museum and the BMB reaches an audience of ten million people, an audience of fifty million people, this will be the transformative moment that reveals the future of our collaboration.”The partnership was initiated by MFA cofounder Barbara Hall in a letter to Boston Children’s Museum director Michael Govan in 2009, when Govan served as director of the museum. The letter, titled “My Heart Belongs to You—” and written in a compassionate tone,", "The next Biennial should occur in 2021 and would draw from a selection of works by up-and-coming artists. The theme of the upcoming exhibition would be “Modernity with a Vision.”\n\n\nThe Mehr School of Economics in New Delhi has received a $2 million donation from the Jawaharlal Nehru Foundation (JNF) in support of its new eleven-acre exhibition space, which will be built in the city’s Panchmahal temple in the city’s Mangalore district. The gift was made on behalf of Mr. and Mrs. P.N.S. Pate, the founders of the wealth management company Apollo Global Management, who are also members of the prestigious Oxford’s Lecturers’ Circle, and comes a little over a year after India’s Minister of State for Culture, Suresh Prabhu, announced the opening of several new six-story scholarships in support of contemporary art in India.“The donation is a great success in showing the strong cultural and intellectual legacy of the Mehran’s Mr. and Mrs. P.N.S. Pate, who are committed to the vision and execution of the new exhibition space,�", "The next Biennial should be staged in Tianjin in March 2020.\n\n\nThe New York–based nonprofit Artspace is revamping its sixteenth edition, titled Art Through the Ages, which was held in Hong Kong from April 5 to April 10 and will now be held in Hong Kong from March 30 to March 31. The event will also present a new documentary, “The Future of Art,” as well as a digital platform that will be accessible to the public from March 28 to March 31. In an effort to offer an alternative to the major art fairs in the United States, the organization will have a new online version of the event available on March 29—the fifteenth edition of the event will be held on March 30. “While we have greatly expanded our programming to better reflect the ever-changing cultural landscape in the region, the change to the 2020 event will mean a shift in focus,” said Debra Treiman, the director of Art Through the Ages. “We will be redefining how we present and touch art to better reflect the changing social, political, and cultural landscape.” The redesign of the 2020 event, which will be more like a symposium rather than an", "The next Biennial should take place in 2020 and should be at least twenty-five years from now. Science, Technology and Society (STS), which was established in 1968, is planning to hold a successor exhibition in twenty-third century. However, this year’s event is being pushed back by two years, to 2021. The theme for the fifteenth edition of the Biennial was “Consciousness,” but the exact date has yet to be announced. In an interview with Artnews last month, Bettina Fung, president of the National Museum of China, said that the event would be “around the topics and the ideas of consciousness.” The 2019 edition, which came to a close at Beijing Armory on October 27, was organized in collaboration with the Beijing Art Museum, the Beijing Museum of Fine Arts, and the Beijing Center for Contemporary Art.\n\n\nThe National Gallery in London has announced that it will hold a “sociological and historical research and presentation” of the last century in 2021. The theme, “The Past, Present, and Future of the World: Contemporary Art and the Transformation of the English World,” will be “titled: ‘The World We", "The next Biennial should involve new media and a philosophical approach to the museum. It should feature works from the biennial and from the creative family, including a selection of works that are currently on view in the museum. The exhibition should focus on the life and work of a single artist. “The Biennial was born in the heart of the city; it is now a central institution to the city. We must ensure that the Biennial continues to thrive and prosper as a showcase for contemporary art,” said Nadine Fontana, chair of the Biennial.\n\n\nThe Turkish art historian, scholar, and curator Selin GörmezÇelju, who was detained in France this week on suspicion of espionage over her January 2017 departure from the country, has been freed on $10,000 bail. While the charge of espionage was dropped by a Paris court last week, GörmezÇelju remains in detention and will remain under house arrest until her court hearing on May 3. While her lawyer claimed she would appeal the decision, the artist did not give up her cause.In an open letter dated February 27, GörmezÇelju wrote: “I am not a spy. I", "The next Biennial should take place at the Museum of Modern Art, which is currently planning to reopen in 2021. In the meantime, the institution has begun accepting visitors in the fall.\n\n\nThe Port Authority of New York and New Jersey (P.A.N.J.) has introduced new safety measures for visitors to the New York City Museum of Art (NYC MoMA), including making sure that visitors have access to designated areas such as the lobby and the museum’s permanent art collection.The changes were made after the institution received eight calls about people behaving badly at the museum between October 5 and Monday, October 8, according to Artnet.The authority said that it initiated the changes after receiving complaints from patrons, who claimed that the museum’s security staff did not intervene when patrons were being disruptive and that the museum’s staff didn’t warn visitors about the changes. The authority also said that it increased the number of guards on the museum’s grounds to increase the likelihood that people would behave in a way that would make their way through security, and that it did not have enough staff on staff to adequately police the museum.The authority said that it did not anticipate how many people might be at the museum at", "The next Biennial should take place in the United States in 2022 and will reportedly be curated by a group of twenty-three artists-in-residence at the Museum of Fine Arts in Boston. In the meantime, the full list of participating artists is as follows: Artwork: Venus, Theater, Performances, Audiences, Experiments. Artist: David Adjay, Claudia Annis-Scooper, Alfred A. Knopf, Arthur A. Hoff, Alan A. Hoffman, Laura Hopkins, Holly King, Sarah Loyer, Julia Lyons, Lydia Massey, Cindy McClellan, Linda Marie McClellan, Elizabeth McKim, Hannah Macgregor, Natalie Mitchell, John Macgregor, Jorge Lucia, Josie Moffatt, Lydia Matson, Lillian M. Morrill, Trip Mulder, Pamela Noth, Samuel Oosterland, Samuel Peterson, Paula Wright, David Wallace, David White, W.J. W.", "The next Biennial should focus on art-historical–realist, avant-garde, and post-structuralist (if not altogether post-formal) themes. It will focus on how these ideas and ideas of the past can inform our present and future. The third biennial should be on “intersection of art and technology,” Artforum says. The fourth biennial will examine “the role of art and technology in social movements,” Artforum says.The festival will begin on October 26, with a preview event on October 28. In the meantime, organizers have released the full list of participating curators:The full list of participating artists is as follows:Become an exhibitor: https://www.eventbrite.com/e/baltic-rebirth-tickets-11277244340“The Town Hall, London, UK: from the TeamAlgeria: from the team of Natalia Fortuna, Jodi Pape, Katia Pechacek, Barbara Wright, Skye Harrison, Rachida Hawkes, Laura Owens, and Lara Spurr (with Adam Thomson and Jodi Thompson) "]