["The next Biennial should be held at least annually, and ideally can be as much of an extension of the Gallery as possible. It should focus on an exhibition of new work as much as possible, rather than a collection of contemporary art. The programme of the 2021 edition should be inspired by the work of the director-general, Federico Fusi, and the work of the museum’s first president, Michel de la Barra.“We are convinced that our next edition will be a unique celebration of contemporary art and will be a vehicle for the decision of a new generation of directors,” Mira Pape, the chair of the board of trustees, said. The exhibition will be led by Carlo Cipolletta, who has served as the director of the Museo de Arte Contemporáneo in São Paulo for the last thirteen years.The twenty-first edition of the Biennial, scheduled to open in the autumn of 2020, was canceled due to the Covid-19 pandemic. The board of directors announced that it would reevaluate the exhibition by March 16.\n\n\nThe Thomas Jefferson Foundation announced today that it will donate $1.75 million to the Smithsonian’s Great Hall, the", "The next Biennial should be held in 2021. Although the museum will be closed for a minimum of five years, work will resume as planned in 2021. The 2019 exhibition was held at the newly renovated Museum of Contemporary Art (MoCA) in Los Angeles. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it will reopen in late May for the first time since it closed in March 2019. The reopening, which was launched to coincide with the opening of the Museum of Contemporary Art: The Modern World (MoCA: M) in January, is part of a larger plan to launch more museums and to broaden the museum’s collection.“We are thrilled to re-open with new ideas, new ideas at a time when we are growing more interested in the future,” said MoCA director Kate Mulgrew. “This year’s exhibition ‘Together: Art and Performance’ is a glimpse into the future, and we hope that you will join us in showing your appreciation for the work that is already being done here.”The new exhibition, “NIRIN: The Evolution of an Indian Icon,” will feature works by twenty-three artists,", "The next Biennial should be a celebration of the creative control of art and the contributions of the Brazilian artists who have shaped English architecture. Three artists will be chosen in the first round of the biennial, May 24–May 26, and will be presented with a prize of $100,000.The second round of the biennial will take place in June, June 28–June 31, and July, August, and September, and will feature an exhibition of work by twenty-nine artists. In between, on the same day that the biennial will be inaugurated by a retrospective of American painter William Eggleston’s work in New York, a major exhibition of the work of the Brazilian artists Hélio Oiticica, Domingo Ortegao, and María Teresa Pinheiros will be staged at the Instituto de Arte Contemporáneo Brasileira (A.C.C.F.), the Instituto de Arte Contemporáneo da Rio (ICA), the Ato Cultura, and the Ato Latina.“Art is not just a vehicle for thinking things through and for experiencing things,” said Carlos de Alvear, director of the Ato Cult", "The next Biennial should take place in 2020, and the exhibition’s fifty-sixth iteration will take place in 2021. \n\n\nThe University of California, Berkeley, has appointed Jodi Throckmorton as its next executive director. Throckmorton will succeed Mary Ceruti, who has led the university since 2001 and is currently the chair of the department of art history and the vice chancellor.“I’m thrilled to be working with Jodi this year,” said Ceruti. “She is an excellent leader who has done an exceptional job in the interim to ensure that our programs, exhibitions, and events align with the UC Berkeley values and mission. She has also been part of a number of transformational years, when we experienced dramatic changes in the campus landscape and in the neighboring communities.”Throckmorton’s appointment was made following an appointment that took place on January 27, 2018, when she was hired by UC Berkeley. Throckmorton will succeed Helen Benoit, who has served as interim director of the campus since 2009, when the campus was still being constructed.“I’m thrilled to be joining UC Berkeley and am grateful to be working with the great leadership team and", "The next Biennial should be held at the Academy of Fine Arts, Paris, on November 21–November 24, 2022. The 2020 edition of the conference will be held at the University of Oxford, in the United Kingdom, September 18–September 22, 2020. The 2022 edition will be staged at the National Museum in Athens. The 2019 edition of the conference was held at the Museum of Modern Art, Boston. The 2018 edition featured a new retrospective of the artist’s work, “Nirvana in Black: Biennial” (New York), curated by Melanie Glenberg and curated by Cheng‐Chien Huang.\n\n\nThe German city of Cologne, previously considered a cultural and architectural epicenter for the city, is now home to the world’s largest collection of Rembrandt’s works, the Kunsthalle Potsdamer Straße Berlin. The museum’s holdings include works by the Belgian-born German designer in addition to his studio, and include works by his sister, the Swedish artist Vittoria Rembrandt.Completed in 2008, the Kunsthalle Potsdamer Straße Berlin opened in 2016 and consisted of three exhibition spaces, a concert venue, and a", "The next Biennial should focus on the ecological and social problems of the birch, the evergreen tree. We are currently working on a plan to introduce a new exhibition to the tree in 2020. In the meantime, we continue to work with local artists to collect and record birch and other plants in order to understand how they affect us and our surroundings. We hope that the next Biennial will be a watershed event that will help to realize the vision of the founders of the institution, Leon and Mihai, who envisioned the Biennial as a platform for cultural exchange.\n\n\nThe Kharkiv Biennial is planning to shift its programming to a weeklong event this fall. The move is part of a larger cultural campaign to address the effects of the pandemic—the museum recently launched a digital platform and is planning to start a crowdfunding campaign to help raise funds for the program.The exhibition will also focus on materials culture and the environment and will include new works by forty-nine artists, including Misha Gvasalia, Nadezhda Guseva, Mikhail Gavrilova, Olga Gorchin, Elena Miyaeva, and Valentina Moschino.The announcement coincided with the Kharkiv Art Fair, which took", "The next Biennial should be held at the city’s Brooklyn Museum in September 2020. “The New York Museum of Art is a transformative institution,” said Mark Goldberg, the deputy director and chief curator at the Brooklyn Museum. “It has created new opportunities for artists, artists-in-residence, and scholars to engage with the city and culture in unprecedented ways. The next iteration of the Brooklyn Biennial will include the themes of resilience, immigration, and resistance, as well as the city’s rich history and a broad spectrum of local, state, and national artists.”Since the Brooklyn Museum was established in 1870, its executive director, David Hertz, has led the institution through four successive iterations. The first, dubbed “The Neighborhood Project,” was held in 1999, when a group of artists and activists formed the organization to promote a more inclusive, locally controlled, and democratically elected city government. The second, “The Art of the Incubator,” was held in 2007, when the group presented a series of works by local artists including Kate Crawford, Hans Hofmann, Hannah Newbury, and Diane Arbus. The third, “The Long", "The next Biennial should be held in 2021. In the meantime, the exhibition will continue to be staged at the Athenry throughout 2018, including this year’s event, which was held at the venue until January 22, 2019, for a convenience category. “We are delighted to present the new collection at the Athenry, as the exhibition is one of the most important efforts by the National Gallery in the United Kingdom to present the collection in the first place, and we are eager to continue to work with our newly commissioned works,” said National Galleries director Maria Balshaw. The new exhibition will draw from the work of twenty-six artists, including Anna Atkins, Cécile Bourgeaud, George Bonham, Wolfgang Brätsch, Sacco and Vanzetti, and will be unveiled on March 24.\n\n\nA year after a group of U.S. artists staged a protest in solidarity with artists in the Middle East who were protesting the Trump administration’s military operations in their countries, the artists’ actions were met with a wave of legislation that restricted the use of military force abroad. Among the controversial provisions are the repeal of the Paris Climate Accord, the repeal of the", "The next Biennial should focus on issues of representation and its relationship to identity in the contemporary Brazilian art and the work of a diverse group of artists, including the late Léila Balsamo, the many painters and sculptors who are represented in the exhibition, and the exhibition’s first artist-in-residence, the photographer Juan Paulo Pereira.The exhibition will be organized in partnership with the Biennale Brasileira, which is sponsored by the State of Rio Grande do Sul (BRIC), and will open on September 14.\n\n\nThe São Paulo Biennale has announced that it is suspending the 2020 edition, which was set to begin on July 29, for three weeks, from September 14 to September 15. The postponement was made in order to allow the exhibition space to be freed up for the construction of the exhibition’s new building, which will be completed in the fall.The announcement follows a series of cancelled events and construction works, including the construction of the new museum complex the country will host the event, as well as the reconstruction of the existing exhibition space. The 2020 edition of the Brazilian Biennale will be held at the Kamaraju Stadium—which will be completed this fall and will", "The next Biennial should begin this week and continue through March 2021. The theme of the twenty-ninth Biennial, “Surrealism in Theory and Practice,” will be: “The Role of Art in the Death of Language.” The twenty-eighth Biennial will be dedicated to art and culture in the twenty-ninth century. The twenty-ninth Biennial will be divided into four sections: “Introduction,” “How Capitalism and Human Nature Are Constituted,” “Human Nature in Pictures,” and “Minimal Art,” and will debut at the Fifty-Second Venice Biennale in May 2020. The inaugural exhibition, “Theatrical Surrealism,” will swing between the surrealism of Sykes-Barre, Antwerp, and the Surrealist movement of the 1930s. Its theme, “Theatricality,” will adapt the persona of the artist and will involve him or her in a performance, the performance being a museum. The exhibition will also follow the artist's practice in developing the idea of a museum for the artist and his or her works. The first exhibition", "The next Biennial should be a bit later, and I think the panels that we do now will be a bit later, in 2020 or 2021.”\n\n\nThe National Gallery of Scotland has announced that it has received a gift of twenty-six works by fifty-six artists. The donation includes works that were previously unopened, but will now be displayed in the institution’s new, redesigned, glass-enclosed space on the campus of the University of Aberdeen.The gift includes forty-two works by thirty-five artists, including Charles Atkins, Alexander Calder, Barbara Kennic, Nell Doran, Mary Rosemary Clohessy, Adam J. du Maurier, Peter Sellars, and Richard Estes, as well as twelve works by twenty-nine artists, including John Graham, Carl Andre, and James Turrell.The National Gallery of Scotland has also announced that it is planning to open a new twenty-third exhibition on the Canadian artist Eric Fischl in 2020, and to begin planning for its Canadensis pavilion at the Fifty-ninth Venice Biennale in 2021. The commission for this year’s pavilion was created by the artist and former MFA trustee Rachel Whiteread, who will create", "The next Biennial should be staged in 2021. The first exhibition, “The Art of Food and Drink,” was staged in 2018 and will run until 2020. The museum also announced that it will soon open a section dedicated to museums in the city. The section, entitled “Museums,” will be located in the city’s Central Library, which will be expanded with a new, 300,000-square-foot galleries. Inaugurating the section will be a retrospective of the work of Jill D. Williams and Rineke Dijkstra.The museum also revealed that it will introduce a new service, “Museum Connects,” which will offer visitors the opportunity to view the works of the panelists in the museum environment. The service will launch with a special exhibition of work by the panelists in September. “We are deeply gratified to be able to present the full collection of Jean-Michel Basquiat in the institution for the first time,” said Hugh Macpherson, director of the Biennial and the Biennale de Lyon. “This is a tremendous opportunity for visitors to see the work of some of the most important and influential contemporary artists in", "The next Biennial should focus on modernism, feminism, and the 'other' in an attempt to create a new discourse on the history of art in the twenty-first century. The Prize exhibition was founded by Nadezhda Engel, director of the Fondazione Paolo Cattelan, and Lorenzo Giulani and will run from September 27 to November 22 in Milan. The list of participating artists is as follows: 1. Tarek Atoui, Tunisia2. Nima Bokova, Lebanon3.  Kassandra Boaventura, Argentina4. Susana Bochereau, Bolivia5. Moles Coq, Belgium6. Luliu Cai, China7. Hua Fu, China8. Adriana Cervetto, Italy9. Ezan Cervoni, Italy10. Silke Kathmandu, Nepal11. Judy Guthrie, Oregon, USA12. Justin King, New Zealand13. Hannah McMahon, New Zealand14. H.M. King, New Zealand15. Hannah Mathewson, New Zealand16. Tatjana Lederman, New Zealand17. T", "The next Biennial should be held in March 2021, and the sixth in October 2022. The first show, titled The Body and the Image: Essays on the Body, was staged at the New Museum in 2020, and the sixteenth in March 2022. The 2019 show, titled The Body and the Image, was curated by Margaret Atwood and opened at the Museum of Modern Art in New York in March 2019. The 2019 show, titled The Body and the Image, was staged by Maren B. Rowland and opened at the Museum of Modern Art in New York in March 2019. The 2019 show, titled The Body and the Image, was curated by and opened at the New Museum in New York in February 2019.The 2019 show, titled The Body and the Image, was also curated by and opened at the Museum of Modern Art in New York in February 2019. The 2019 show, titled The Body and the Image, was also curated by and opened at the Museum of Modern Art in New York in February 2019. The 2019 show, titled The Body and the Image, was curated by and opened at the New Museum in New York in February 2019.\n\n\nThe Solomon R. Gug", "The next Biennial should be held in 2020, after the next in 2021, and the biennial will end in 2024. The 2020 edition, titled Episode 202, will focus on a theme of the exhibition: Art and Politics, the 2030s and Beyond, and the 2040s. Other themes to be explored in the landmark exhibition include “Radical Women: Women, Art, and Radical Politics” (2019) and “Black Power: Black Liberation Politics” (2017). The biennial will mark the centenary of the United States’ entry into World War II, with the theme “The End of War?” The twenty-sixth edition of the exhibition will take place in 2019, with the institution’s founding benefactor, Benjamin Harnwell, and the artist Sallah Saied, who is best-known for her work The Screaming Tree, the abandoned Tyrannosaurus Rex Palace in Croydon, London.\n\n\nThe Taub Museum of Art in New York has named Gerald Cohen, the managing director of the Biennial Accelerator, as its next executive director. Cohen comes to the institution from the National Gallery of Art, where he has served as director since 2011. ", "The next Biennial should take place in 2020 and will be hosted by Peter Schäfer Institut für politische und dergalerie Berlin in partnership with the foundation of the city, the city hall, and the museum. It will also be hosted by the Schäfer Institute in the city of Mannheim and will be organized by a committee comprising members of the Renntseigentrieb Berlin (RBD), the city of Mannheim, the Rügenstrasse, and the city of Eindhoven.Artur Griest, former director of the Württembergischer Kunstverein in Kassel, confirmed that the institution will be reopened. He told the Art Newspaper that the restoration of the Victorian building, which was established in 1928 to house the collections of the Pritzker Prize–winning artist Dietrich Hülschläger and the Klaus von Steinbach, was a priority for the institution. However, he said that the restoration of the museum, which has a permanent collection worth €100 million, would take time and would be coordinated by the institutions.At a press conference in Berlin on Thursday, the Rügenstrasse said that the project of the museum was already underway but had been", "The next Biennial should focus on the nationalities of the original works on display at the exhibition, paving the way for the exhibition to return to the cultural center in the future.\n\n\nThe Museum of Contemporary Art (MoCA) New York is planning to open a new exhibition of work by the late Egyptian designer Salah Abdalraqib in the city at the end of this month. The show, titled “period dresses,” will highlight the work of women and will focus on creating garments that reflect the ideals of the 1970s and 1980s, with a particular focus on the feminist and queer movements in America. The show will be curated by artist and former MoCA curators Pia Camil and Joao Cattelan, who were recently appointed as interim directors.“Salah Abdalraqib (1936–2011) is a master of the form and an international master of the human form. The exhibition will celebrate his legacy in the form of a collection of works that bring to light the work of women and men living in the era,” said Museum director Christopher Campbell. “This exhibition also will serve as a platform to consider the legacy of the late Salah Abdalraqib in the broadest", "The next Biennial should take place in 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has announced that two new works by artist Daniel Tupper will arrive in the institution in 2019. The first, a collaboration with David Salle, will represent the exhibition “The Art of Painting” at the museum. The second, a show titled “Diana Alighier/John Alighier” will open at the Salon in 2020. Dated to June 13, 2019 and to March 21, 2020, the works will be installed in the museum’s renovated and expanded galleries.“We are incredibly excited to announce that the first exhibition of the new collaboration series, ‘The Art of Painting,’ will be held at MoCA in 2020,” said Mira  Lorenzo, chair of MoCA’s board of trustees. “This exhibition will bring together a group of work by three of the most celebrated artists of modern and contemporary art, and reflects the current state of contemporary art, with an emphasis on the works of women. It will also set a new standard for presenting important works from the collection.”The first show, which will be held at the gallery", "The next Biennial should take place in the spring of 2021. The show will be connected to the previous five editions of the biennial, which were held in the fall of 2011 and September of 2019, and will be co-organized by the two organizers, the Guggenheim and the Joan Mitchell Foundation.While the biennial will highlight the work of emerging and established artists, the theme of the exhibition will be “Performance and the Arts in the Age of Mechanical Reproduction” and will feature works by a number of artists that have participated in the exhibition. The biennial’s inaugural edition, “Post All,” was held at the Museum of Contemporary Art (MoCA) in Los Angeles in October of 2011 and featured work by twelve artists: Bénédicte Savoy-Westphal, Joachim Spees, Talia Simmons, Sherry Blatnik, Ruby Waxman, Julie and Frank Yary, and Sue Wilson. The exhibition was selected by the biennial’s curators, Ann Mier, John Lesher, and Darla LeBlanc.“The biennial gives us a chance to reflect on the rich visual and performance traditions of our time,”", "The next Biennial should be held in the autumn of 2020, and the exhibition should open in the spring of 2021.The 2019 edition, which was organized by the Seattle Art Museum and operated by the nonprofit Seattle Art Museum (SAM), was canceled in March due to the Covid-19 pandemic. The organization announced that it would move the exhibition from March to June, and signaled its intent to hold a new exhibition in the fall. However, in March of 2020, the museum announced that it would re-open a year early, and the exhibition was rescheduled for September.The eighth Biennial of Modern Art (BAM) was also canceled, and the Biennial of Contemporary Art (BAC) was re-started. The upcoming exhibition will focus on the future of art and design in the Americas. The Biennial of Visual Art (BVI) will be held in the United States in the fall of 2021. “In the wake of the Covid-19 pandemic, we are rethinking our future plans,” said Seattle’s acting director of arts and culture, Debra Iwan. “BVI will be a celebration of the arts and design as we know it, while continuing to support", "The next Biennial should take place in 2022.\n\n\nThe Art Newspaper in New York has received a gift of sixty-three works from the family of John Quaytman, one of the twentieth-century’s foremost painters whose cadre of contemporaries include Pierre-Auguste Renoir, Kathleen Hanna, and Alex Katz. The move is a significant development in the relationship between the artist and his heirs, since most of the works are currently housed in the Nicholas Collection in New York.“Quaytman’s work is of universal interest to us today, and will continue to be so for many generations to come,” said Charles John Quaytman, John’s son and Charles’s husband. “We are delighted to present them at this time to the biennial’s distinguished sponsors, with its invitation to see them in person. We regret that the gift is thirty-one years behind schedule, but we hope that this will be possible with the help of your generosity. We have been working with you for some years to raise funds and to launch a biennial, and we are confident that we can complete the work by the time the biennial opens.”The ninety-one-", "The next Biennial should be held in the spring of 2022. “This is a moment of great change for the city,” said Mayor Rahm Emanuel. “In its fourth year, it is critically important that the Biennials reflect the very best that Chicago has to offer, and keep pace with the city’s ever-changing needs and needs of the city.”\n\n\nThe Tate was forced to cancel a major retrospective of Pablo Picasso’s The Birth of a Nation (1948) after it emerged that some thirty artworks stolen from the museum were on display in the exhibition, Artforum reports.The exhibition, titled “The Birth of a Nation: Picasso and the Birth of Modern Art” and organized by Tate Britain, featured work by sixty-nine artists, including W. J. Cobb (1902–1987), Edward Dell (1920–1989), and Jean-Michel Basquiat (1909–1997).The museum was forced to cancel the show in March 2019 after it learned that thirty works by Picasso’s contemporaries—including René Magritte, Henri Matisse, David H. Koch, and Henry Moore—were on display. The exhibition opened to the", "The next Biennial should take place in 2020. The exhibition already received a special edition of the Dusseldorf Artforum in July 2019. The seventy-ninth edition of the Biennial d'Orsay was held in 2022, and the full list of participating artists is as follows:A.K.W.S. (2018)Art of the Modern Family (2019) Artists of the Future: A.K.W.S. (2018)Art of the Modern Family (2019) Artists of the Future: A.K.W.S. (2018)Art of the Modern Family (2019)Artists of the Future: A.K.W.S. (2018)Art of the Modern Family (2019)Artists of the Future: A.K.W.S. (2018)Art of the Modern Family (2019)Artists of the Past: A.K.W.S. (2018)Art of the Modern Family (2019)Artists of the Future: A.K.W.S. (2018)Art of the Modern Family (2019)Artists of the Past: A.K.W.S. (2018)Art of the Modern Family (", "The next Biennial should be held in 2021 and will be presented by the university in partnership with the National Gallery of Art.\n\n\nThe Museum of Polish Art in Warsaw, which has been undergoing a major renovation project since it opened in 1933, is planning to open in 2020. The museum, which comprises twenty galleries and eight classrooms, will boast of a new entrance and reception area, a reading area, and three floors of exhibition spaces. The new space will also include a museum, a theater, a library, and a café. The renovation will create a modern setting that is 'perfect for the exchange of ideas and ideas at the comparison of many traditions and will also make the museum a great partner for visitors of all ages.”“With the opening of the new museum of Polish art in Warsaw, the National Gallery of Art in Washington, DC, and the Art Museum of Chicago, the Museum of Polish Art in Warsaw has become a global institution,” said Ławdzdzko Rysz, director of the National Museum of Polish Art. The institution has also added twenty-four galleries and twenty-nine classrooms and is already preparing to open the new museum in Kraków, the capital of Poland, in the spring of", "The next Biennial should take place in 2021 and will feature works by up to twenty artists. The show will be held at the New Art Museum Helsinki.\n\n\nAn eight-piece group of artists whose works were featured in the seventy-third Venice Biennale were invited back to Venice in May for a fourth edition, held in the city this time last year, the Art Newspaper reports. The group, which is comprised of Alison Bech and Shih-Sun Huang, is one of the few international artists remaining from the record-breaking event, which was held in May 2014—the fourth edition of the Venice Biennale, “Innovation for an Urban Future”, was held at the Museo de Arte Contemporanea (MAS) in Venice from March 17 to March 20, 2019. The exhibition was curated by Adrian Leckey, curator of art at large and art historian, and was organized in collaboration with the Venice Architecture Biennale committee, which comprises architects, designers, and other cultural and design professionals.The seventy-third Venice Biennale is also believed to be the last exhibition hosted by Sofia and Perrotin, the creators of the popular arts and design program in", "The next Biennial should take place in 2021. “By presenting the work of artists from the Commonwealth, we hope to change the way people think about and experience art and help them understand the true potential of the art created in Australia,” said Cameron. The Commonwealth-funded event will be hosted at Canberra’s National Gallery of Canada from August 5 to August 9 and will integrate some five hundred works from Australia’s major art museums. Curated by Katherine Heath, the director of the National Gallery of New South Wales, the inaugural exhibition will be followed by a biennial in 2022.Rules for the exhibition have yet to be announced.\n\n\nThe National Gallery of Canada has announced the opening of a new digital platform, Nova Scotia Contemporary, that will allow visitors to view and purchase works by artist-in-residence Shih Chien and other contemporary artists across Canada. “It is a challenging time for the gallery, as we closely watch the results of this week’s referendum on independence, and as we work to design a future for our galleries,” said Nia Smith, executive director. “The answers to these questions will shape the future of our art and our communities. We are", "The next Biennial should be held in 2021.\n\n\nEarly this month, authorities in London and France launched a massive manhunt for a serial killer believed to be responsible for the deaths of three people in the city. The case has grabbed the attention of the FBI, which recently released a statement condemning the \"disturbing trend of lone-wolf attacks.\" The British media has also focused on the killer’s connection to Westminster Bridge, where the suspected fifth victim, Khalid Masood, was stabbed to death by a lone assailant on March 22, and Masood’s motivation. While the motive remains unclear, police have said it was likely terror.While Masood was the sole suspect in the attack, police do not believe he was connected to any of the other crimes that happened around the same time. Masood, a 24-year-old British national, was arrested on March 16 on suspicion of murder and murder in relation to Masood Jr., who died from his injuries three days later. The suspect, who was granted bail and is currently being held in a London police station, is scheduled to appear in court on April 1.Authorities have since described the case as “complex and delicate.” Masood was re-arrested on", "The next Biennial should take place soon, and will include the work of over seventy artists from sixteen countries.  In the meantime, China’s Ministry of Culture will organize an exhibition dedicated to Hannah Arendt, the German woman who opposed the Holocaust and advocated for nonviolence, in Beijing in September 2020. Artwork:    Cassandra Cammock’s portrait of a young woman in a spring in the Scottish Highlands, which was published in the March/April 1974 issue of Artforum, was selected by a jury comprising Gerald Schoelkopf, editor of Artforum; Robert Johnson, director of the Tate in London; Linda Roach, director of the Institute for Contemporary Art at the University of Exeter; and Jane Shoyama, an artist based in Hong Kong. The full list of participating artists is as follows: Carlos Alÿs (Spain) Michael Baume (Spain) Cameron Barlow (United Kingdom) *Peter Bell (England) Nicole Chiu (China) *John Chiu (China) *Antonie Chiu (China) *Victoria Chuang (China) *Tian Chen (China) *Karen Cai (", "The next Biennial should take place in the spring of 2021. The theme of the biennial is “An Intersection of the Past and the Present,” and will be the theme of the next edition of the Museum Biennale. The biennial will be held at the Museum of Modern Art, London. The first show titled “Modernism and the Present” will be held at the Royal Academy of Arts in London in January 2021. The show will include twenty works on paper by twenty-four artists, including Arashiyama, Feltrinelli, Filippo Bertotti, Paolo Bodeda, and Andrea Garbuzza.The exhibition’s inaugural exhibition will be “An Open Letter from the French Revolution to the People of the United States” in the spring of 2021. The letter was sent to the United States on July 4, 1775, and addressed to President George Washington and his cabinet. The letter stated that the American colonists were “anti-democratic, anti-British, anti-religion, anti-European, and anti-Christian,” and called for the “United States to be taken from us by force,” which is something that is currently being", "The next Biennial should take place in the city in 2020, with the first exhibition being curated by Adam D. Weinberg. Franz Knaus, the chief curator of the exhibition “Arts and Architecture in Latin America,” said: “We were convinced that this was the moment for the exhibition to become a real cultural success. We had the chance to return to the city of our origin, to re-create an exhibition that would be a cultural landmark, a symbol of art and architecture from Latin America.”The architect responsible for bringing this project to fruition is architect Daniel H. Pristan, the founder of the firm Pristan + Risí, which has provided the major foundations that built the Apellano residence—Plany, the Hirschhorn, and the Ballet—with a portfolio of more than twenty homes. While the Apellano residence, which sits in a richly ornate neoclassical building in the city of San José, is the most recent work to be exhibited at the Biennial, the city of Buenos Aires has hosted many other works by Pristan + Risí. In addition to the full-scale model of the residence, Pristan + R", "The next Biennial should be held in 2020. The exhibition will also be hosted by the Art Bank of the Netherlands in the Netherlands. The twenty-ninth Sundance Film Festival, which will be held at the Scripps Museum of American Art in San Francisco, California, will be held at the Paramount Theater in Los Angeles, California, in 2021.  The twenty-eighth Venice Biennale will be held at the Palazzo Hotel in Venice, Italy, in 2022. The twenty-ninth Melbourne Art and Design Biennale will be held at the National Gallery of Australia in Melbourne, Australia, in 2021, and the twenty-ninth New York Art and Design Biennale will be held at the Whitney Museum of American Art, New York, in 2025. The twenty-ninth Venice Architecture Biennale will be held at the National Gallery of Art in Rome, Italy, in 2021. Following the end of its original twenty-ninth iteration at the Museum of Modern Art in 2007, the longstanding arts institution will now be hosted by the Art Institute of Chicago. The twenty-ninth Venice International Film Festival will now be hosted by the Art Institute of Chicago, which will stage two events: a", "The next Biennial should be held in 2021. \n\nPace is planning to hold a fourth edition of the long-standing Art of Fashion art fair, which was held in the former Leeds Exhibition House in England, in 2030. The 2020 edition featured work by twenty-one artists and was curated by Yana Paskova. In an interview with the Art Newspaper, Matthias Lüpertz, chief curator of the exhibition, said the fair’s future is currently uncertain and that the organizers are working with market researchers to assess the economic impact of the event.CNA, which is affiliated with the state-run Prada, said that the upcoming edition of the fair will focus on “cultur[ing] new ideas and the art of fashion, as in the past, but also on the creative process,” adding that a new section, “Telling Stories,” will be organized in partnership with the arts and the FTS.  Pace’s approach to staging the event in a contemporary cultural space differs from that of most major fashion fairs, which typically feature large-scale exhibitions and focus on collections made by established artists. Although the nonprofit will continue to operate the fairs, it will be", "The next Biennial should take place at the Four Seasons Hotel in Beijing in October 2020, with the first exhibition being “Blood, Sweat, and Tears.” The show will be organized as a collaboration between the two institutions, which will be sharing the same space for an exhibition of work by Hong Kong’s artist-run museums, with a view to creating a platform for the exchange of art and ideas. Executive director of the Shanghai Institute of Contemporary Art Li Fei said: “This was an incredibly challenging decision for us, but it is one that we believe ensures our artists get the most internationally recognized work possible. We hope that this exhibition will allow them to continue their work here in China, and the best way to do that is to incorporate the exhibitions, lectures, performances, and other events of the upcoming years.”The show will also feature works by artists whose work has been on display in China since the 1990s, such as Yun Ji Ning Zhen, Zou Yuan, and Huang Ting. The selection will also include work by artists who are not represented in China, including Ai Weiwei and Renzo Piano. The exhibition is part of an initiative to encourage the exchange of ideas and art between China and the", "The next Biennial should be held in the city next year. In addition to the summary of the exhibition, the event will include a selection of writings by artists such as Marc Chagall, Franz Boas, and Michaëla Borden. The exhibition will also introduce a new program of programming, including a symposium, a lecture series, and a book club.The biannual event, which was established by the National Galleries of Canada in 1991, is supported by backers including the Kellogg Foundation, the National Arts Council, and the Arts Council; the City of Winnipeg; and the Canadian Alliance for the Arts. The National Gallery of Canada is a member of the Association of Arts Canada (AAC); and the National Arts Council is a member of the Council on Contemporary Arts.\n\n\nAmerican photographer and sculptor Peter Martensen, whose (mostly) abstract compositions capture the human experience in expansive, surrealistic settings, has died at age seventy-seven.Known for inventively juxtaposing light and shade, Martensen often depicts people and objects in his studio, often at night, and often in abandoned public spaces. His work is currently housed in the collections of the Metropolitan Museum of Art, the Museum of Modern Art in New York, the", "The next Biennial should be held in the summer of 2022. \n [Update: July 26, 2019] The exhibition, titled Architecture,” has been moved to the Museum of Fine Arts, Boston (MFA) until November 2020. \n\n\nThe Santa Monica Museum of Art has received a $250,000 donation from the David and Lucille St. Laurent family. The gift is the latest in a series of significant donations to the museum. David and Lucille St. Laurent are the parents of two young sons: Robert, 9, and Alexander, 5. The St. Laurents are also major supporters of the institution. The family was invited to the museum by its director, Yvonne E. Hsu, for a family presentation following the completion of a decade-long program celebrating the life and work of the collection. The event was held in collaboration with Museum of Fine Arts Los Angeles. The donation is the culmination of a four-year, $75 million campaign to modernize the museum. The project, which was led by Joseph E. Gilliam Architects and supported by a $50 million gift from the St. Laurents, was commissioned by David and Lucille and included the installation", "The next Biennial should focus on “art and culture, present and future, and the relationship between art and the future.” The exhibition will be organized in four parts. Beginning with “New Art,” the exhibition will present work by twenty-four artists, including Agnieszka Brzezinks, Anna-Sophia Caraccioli, and Lionel Cedeno. The next stage, “Museum Art,” will present twenty-seven works by forty-two artists, including Eisa González, Franz Lenz, and Yuta Mura. In the third part of the series, “In Praise of Art,” will feature twenty-four works by forty-eight artists, including Valeria De Sousa, Rémi Pape, and Fernando Pérez-Pérez. The exhibition will run from March 7 to March 21. “The Goethe-Institut is delighted to present the inaugural series of the Delfina Foundation,” said Marc-Olivier Ruiz, chair of the board of trustees. “The Goethe-", "The next Biennial should be the first time he will be able to see the works in person. He said: “I’m looking forward to it, because the first time I’ve been to Spain I’m a big fan, and believe me, I am still a big fan. That’s why I’ve been working so hard towards getting to know the artists and getting to know the city, and I’m thrilled to be able to see them in person.”Born in the town of Marrakech, Morocco, in 1939, René Magritte had his first art exhibition at the Museum of Modern Art in Paris in 1949, and his first solo show in Rome in 1955. He also created the monumental work Obelix in 1965, which is considered one of the first conceptual paintings. In the years that followed, his work was featured in shows at the Museum of Modern Art in New York, the Museum of Modern Art in London, the Museum of Modern Art in Paris, the Metropolitan Museum of Art, the Museum of Modern Art in Germany, the Museum of Modern Art in Mexico City, the National Galerie of Art in Paris, and the Museum zu Berlin.For the inaugural edition", "The next Biennial should be in 2022. \n\n\nPhoenix Art Museum and Art Museum of Arizona (PAMAZ) has announced its inclusion of a new sculpture by Kate Orsik and Joseph Golden in the museum’s upcoming exhibition “The Invisible Armada” as part of its plan to re-emerge as an ecologically conscious museum. In the painting, a sharply defined line drawn across the canvas is reminiscent of the iconic painting of the same name by Jean-Michel Basquiat. “The Invisible Armada” was inspired by a group show at the museum that explored the contributions of artists and thinkers to the formation of the contemporary African diaspora. The show, “The Art of Disruption” (2019), showcased new works by forty-eight artists working in the fields of literature, art, politics, and the arts.The exhibition will take up themes of the history of African art and the African diaspora, including the story of the work of Kate Orsik and Joseph Golden, and will feature a selection of new works by artists who have been excluded from exhibitions or are currently being censored by the museum. The artists selected for the exhibition include Okwui Enwezor, Nt", "The next Biennial should be held at the Olympic Museum in Rio de Janeiro in 2022. \n\n\nItalian poet-historian and theorist Cesare Prada, one of the inventors of the Italian Renaissance, has died at the age of eighty-eight. He was a professor of Italian literature at the University of Cagli, where he taught for nearly thirty years.Born in Turin in 1921, Prada fled the Nazis during the Second World War and studied at the University of Cagli, where he founded the arts organization Bergamo. As a writer and thinker, Prada was a major influence on Milan's Perrotin and Triennale, as well as on the Italian Renaissance, which took place in the city of Veneto in 1948. Prada also served as a professor of philosophy at the University of Pisa and a member of the Italian Renaissance Academy.In a 2014 interview for The New Yorker, Prada described his relationship with the Italian Renaissance as one of friendship. He wrote: “The Italian Renaissance was, in a way, an Italian-landscape, a place where I could go to dream of being, to be admired, to be loved, to be admired, to be loved. It was also a remarkable", "The next Biennial should be held in 2022. “Eleanor Roosevelt once said that art is the machinery of democracy: The process by which we are made to understand the world, and make sense of it, and it is the machinery of our democracy, and that is why our future is so uncertain,” said Organizers. “We will try our best to get the next Biennial moving forward as quickly and smoothly as possible. We will also continue to support the museum in every way possible.” Forty-six years after the London-based art conservation company Oceanus developed a critical tool for the preservation and research of artworks, the company announced today that it is shutting down the memorial service and the exhibition. The news comes almost a week after Paddle8, an online platform founded by Oceanus and a team of twenty-six volunteers, announced that it would stop running the event. The site will remain accessible to the public during the museum’s temporary closure, which will run from March 15 to March 17, 2020.The closure will also extend to the Paddle8’s next London exhibition, “The American Story.” The show will now be held at the Paddle8 London gallery. �", "The next Biennial should take place in 2021, and the first in 2022. The event will be hosted by the Museen Bibliothèque de Beaulieu in Paris and will be organized as an extension of the biennial that was held in Milan in 2011. The Museum of Modern Art in New York will host the last iteration of the event in 2022. The 2019 event, “The Museum of Modern Art,” drew 175,000 visitors to Beaulieu’s home city of Antwerp.\n\n\nJohn C. Stoschek, the German-born, New York–based curator who curated the exhibition “Theater of Operations: The Gulf Wars 1991–2011,” curated by the same company that produces the current iteration of the Qatar Triennale, and whose London-based NGO, the building charity The Theater of Operations, receives funding from the British government and arms dealers, will be awarded a multimillion-dollar prize at the Fifty-Ninth Venice Biennale in May. “From today, when we commemorate our common history, we will continue to pursue together the interests of art and policy,” Stoschek said in a statement. “Together", "The next Biennial should draw more than 3,000 visitors. “Our aim is to create a space for the continuous reflection and celebration of contemporary art in the Republic of Armenia,” said Armenian curator and chair of the selection committee, Ashti and Karol Sabak. “Our collection spans more than three thousand works and contains a rich repertoire of artworks from the Armenian diaspora.”In the November 2017 presidential election, Hurban received 47 percent of the popular vote and Sasanian received 39 percent. The selection committee considered five works by each artist, but only Ashti and Karol Sabak were nominated for the Nobel Prize.Petrosian also represents Germany, France, and Israel. In a documentary about the Biennial that premiered at Berlin’s Museum of Modern Art in September 2016, he plays a key role in depicting the artworks in a way that allows the viewer to “feel” the artificial connections between the subjects of his exhibition. The exhibition “was born of a realization that the relationship between art and the natural world was becoming more and more complicated,” Petrosian said. “It was a way to bring the ancient materials together with modern tools, and to present the materials", "The next Biennial should take place in 2021, when the next edition of the Biennial will be held. \n\n\nThe Allen Memorial Art Museum in Seattle will reopen to the public on September 22 following a $175 million expansion, which adds a new floor plan, a new exhibition hall, and more rooms. The extension—designed by the Thompson-Onyx architecture firm and consisting of a series of steel tubes—was completed in a cost of $76 million.“This is a very significant milestone for Allen,” said Julian Anne Allen, the board president and CEO of the museum. “The addition of a new exhibition hall, which will now welcome the museum’s largest collection of contemporary art, is essential for our mission of serving as a premier cultural destination for Northwest artists. We are very excited to celebrate the opening of this new chapter with a full exhibition hall and the gallery.”The expansion also brought Allen’s grand opening to the new, enlarged museum on August 21. The museum now boasts a 400,000-piece exhibition gallery, a new location for public programming, and a new Public Art Gallery that will showcase works by emerging and established artists. The renovation and redesign also transformed the museum’s courtyard,", "The next Biennial should take place in 2020, and the first in 2021. The 2018 event, “Architecture’s Place: The Art of Man” was hosted by the Greek Ministry of Culture and the National Gallery in Athens.  \n\n\nThe Museum of Contemporary Art (MoCA) San Diego announced today that it is adding thirteen new works by forty-four artists to its collection through a new initiative it launched in 2018, including eight works by Pablo Picasso, four by Paul Gauguin, and three by Ed Moses. The initiative was established to assist artists whose work is currently on display in the museum, and is modeled after the museum’s own program, “Berlin Gallery: Formed,” which has featured work by artists such as Karl Lagerfeldt, George Applebaum, and Bianca Del Rio.After the exhibition, titled “Avant-Garde and Art: Symbolism and Reality” (2018), when it opened on November 30, the exhibition will be restored in 2019. The program will then return to its original location, which has remained vacant since March 2019, when the institution moved to a new six-acre space in the city of Laguna Beach, California.", "The next Biennial should be organized in response to the ongoing difficulties and challenges that life and safety and governance face in the twenty-first century. The themes of the exhibition should reflect the contemporary concerns and challenges that face our society as it confronts those challenges in an increasingly interconnected world. We hope that this initiative will become the basis for the future development of our collective art.\n\n\nThe Metropolitan Museum of Art (Museum of Modern Art) in New York has received a gift of more than five hundred works from the late Israeli-American art collector Donald and Marian Greenberg. The museum opened its Greenberg Collection in 1979 with a major commission by the late Israeli artist Ado Blum. The gift, an exhibition of twenty-eight works by Blum alongside works by artists such as Elyn Zimmerman, Ralph and Gertrude Stein, and Jean Mondrian, marked the museum’s move from its former home in midtown Manhattan to a new 28,000-square-foot space in the building on Central Park’s northwest corner. Previously, the Greenberg Collection had been housed in an adjacent building in the museum until 1992, when it was moved to its current home on East Seventy-Third Street.“The Greenberg Collection will serve as a model for", "The next Biennial should focus on the creation of a new narrative through art, a new set of questions, and a new point of view. We hope that this opportunity will prove fruitful for the next iteration of the award.”  The next edition of the 89th Venice Biennale (2019) will take place in France from March 23 to March 28. The show will return to Venice for a second edition in November.\n\n\nA group of artists and collectors in the United States are demanding the release of Katy Perry. The protesters, who include Ann Taylor, Larry Achiampong, and Mark di Suvero, have created a video that depicts the artist—who has been imprisoned since October 2019 for stealing a trove of her work and a Nike shoe—staring into the camera lens of a cellphone. The \"Katy Perry: Back to the Source\" video, which was created by the activists Collective Write-Off and Biz Center, was uploaded to YouTube by the group’s owner, Jaye Stephens-Williams.Stephens-Williams, who was sentenced to three years and four months in prison for the theft of 20 works from Perry’s estate in October 2016, was set to receive her $75,000 fine but", "The next Biennial should be held at “the National Museum of Fine Arts” in Paris. “We are working hard to find the perfect venue and, as soon as possible, we are inviting the National Gallery of Art, the Louvre, the Musée d’Art Moderne, and the Musée für Bildung und Technik to take part in the exhibition,” said ‎Vincent van Gogh, who designed the museum. The exhibition will feature works by seventy-five artists from thirty-eight nations and territories.\n\n\nMuseum director Richard Armstrong has been placed on administrative leave after he appeared to intentionally mislead the board of trustees of the Hirshhorn and the Carnegie museums about the condition of their art collections in an attempt to influence their plans to sell the works in the exhibitions “The Truth of Life” and “What Is Art?” to the private collection of the Rockefeller family and the Roche, according to the New York Times.The talks between Armstrong and industry executives involved in the sale of works by Damien Hirst, Thomas More, and Robert Rauschenberg, as well as a number by Pablo Picasso, were held at the Rockefeller-backed Museum of African", "The next Biennial should be held in January 2020, and the event will be hosted in the new reworked Museum of Contemporary Art (MoCA), designed by British architect Sir David Adjay (and a partner of the firm Millar & Pugh).The first iteration of the exhibition was staged at the Museum of Modern Art in New York in the spring of 2019, and featured work by thirty-one artists, including Antony Gormley, Jodi Leonard, Kate Moss, and Maud Sargent, among others who were selected by an international panel, comprising art critics Andrew Ryan of New York Magazine and Helen Grant, the director of the National Gallery of Art, and curator and historian Daniel Libeskind.The exhibition was hosted by the Museum of Modern Art in partnership with the nonprofit the National Endowment for the Arts (NEA), which also asked the artists to participate in the first edition of the Biennial, which was staged at the Getty Center in Los Angeles in 2008 and 2009.The artists who will be featured in the 2019 edition of the biennial are:Audrey Nunn, Benedict C. Johnson, Jeffrey Gibson, Tobias Georgiou, Robert Hewitt, Paul Hamlyn, Rev", "The next Biennial should be set up at the Institut für Kunstbildung der Internationale in Berlin, which will host an exhibition of the work of the same name in October. The Biennial of Modern Art will be held in October. The 2018 edition of the biennial, titled Deutsches Nationalgalerie, was held in the German city of Kassel, and was attended by more than 3,500 people. The biennial, which was organized by the übernationalgalerie, the Hamburger Hafenische Kunstverein, and the Hamburger Akademie Freie Kunstverein, was shuttered on November 24 after a fire at the workshop, which was partially destroyed by the flames, occurred on December 9. The biennial “will not be possible without the tremendous support from the cultural community and the state of Kassel. We are indebted to the hall of governors, the state of Kassel, the Hamburger Akademie Berlin, the state of Hesse, and the city of Kassel.” The work of the exhibition, titled Arts and Life, was originally scheduled to open in the summer of 2020 but was pushed back from", "The next Biennial should be held in 2022. \n\n\nSutton Bonham, the British curator of twentieth-century art who became famous for his long-standing criticism of the postwar aesthetic, has died at age eighty at his home in London. He was the author of numerous books on the art of Paul Gauguin, Henri Matisse, and Ed Moses, and helped shape the early-mid-20th-century emphasis on experimental, photorealistic art.Born in London in 1940, Bonham studied under the legendary Terrence Blum at Oxford University during the latter half of his childhood. He enrolled at the University of Leeds in the United Kingdom, but left for London to study through the school’s history of art department. After earning a degree in art history from the university in the early 1950s, Bonham moved to New York and began his career at the Museum of Modern Art. There, he met his wife, the American artist Ed Moses. Together they began their experimental art-world series “artist projects.”“In the mid-’50s, Bonham and Moses began their ‘Artist Projects.’” In the series’ first iteration, 1955, the duo created works by", "The next Biennial should be held during the first week of December, 2019. “We are delighted to be able to share a new partnership with the city of Chicago and its artists,” said Amy Lee, the director of the Biennial, and Javier Federici, the director of the Metropolitan Museum of Art. “This is an opportunity to create a unique and important work that will enrich the lives of a new generation of Chicagoans. The kind of work that will be presented here will be a reflection of the city’s rich legacy of bringing works of art to the city. We are eager to show this new generation of artists the kind of work the city of Chicago is capable of producing.”The new partnership between the museum and the city of Chicago was established in 2018 through an agreement that had been in place since 1999. The partnership between the museum and the city of Chicago began in the summer of 2016 as part of the construction of the new museum. Inaugurating the new museum is a presentation of the works of the city’s artists, which have yet to be curated, and the newly commissioned work by the Duke and Duchess of Cambridge, which will be staged in December. The museum also recently received", "The next Biennial should be held at the new site on the campus of the Museum of Contemporary Art (MoCA), which is currently being restored, and will take place on July 21–July 26. The exhibit will include work by twenty-one artists, including Hana Benhabib, Black Manta, and Leslie-Anne Harrison, who will be joined by Lily Aldridge Nieves, Bruce Aitken, and Phyllis B. Smith.  \"The time has come for an exciting new wave of artists to emerge in the new Museum of Contemporary Art, to recommence the work of our forebears, and to make their contribution to the museum’s collection and our work around the world,” said Joe L. Miller, director of the museum. The new museum will be completed in 2020 and will open to the public in the spring of 2021.\n\n\nThe British Film Institute (BFI) in London announced today that it is planning to create a new three-year scholarship, which will offer a full-time, full-time, and part-time degree program that will train more than three hundred young curators and filmmakers in the United Kingdom. The new program, which will start in 2019,", "The next Biennial should be held in 2021. The next International should be held in 2022. The next Biennial should be held in 2025. The next International should be held in 2027. The next Biennial should be held in 2019. The next International should be held in 2020. The next Annual should be held in 2021. The next Biennial should be held in 2019. The next International should be held in 2021. The next Biennial should be held in 2019. The next Biennial should be held in 2019. The next Biennial should be held in 2019. The next Biennial should be held in 2018. The next International should be held in 2021. The next Annual should be held in 2018. The next Biennial should be held in 2020. The next International should be held in 2021. The next Biennial should be held in 2019. The next Annual should be held in 2020. The next Biennial should be held in 2019. The next Biennial should be held in 2019. The next Annual should be held in 2019.  The next Annual should be held in 2018. The next Annual should be held in 2019. The", "The next Biennial should take place in the spring of 2020. For the past twelve years, the five-month-long exhibition has been staged at the Museum of Contemporary Art ‎in New York and has been hosted by the British Museum in London.  \n\n\nAlmost four decades after the US-born, California-based artist Ron Gorchov\u0097who is best known for his multi-channel installation works, which are often interspersed with shots of his own face and the Los Angeles riots in 1988\u0097died of cancer on September 16, the Los Angeles County Museum of Art (LACMA) has named John Andrews as its next director.The institution was previously unaware of the artist’s staggering output of two hundred framed photographs, videos, and paintings. The institution acquired them from Gorchov in 1981, when he was still living, and has been collecting them ever since. “Gorchov is an irreplaceable part of LACMA’s DNA,” said LACMA board chair Mike Rice. “Ron was one of the first contemporary painters to create in America, and his work has been collected by LACMA for more than four hundred years. We are very pleased with the", "The next Biennial should focus on the history of the new museum’s construction, and on the institution’s future as a cultural institution. The upcoming exhibition “The Last Days of Modern Life” will include works by Barbara Wright, Phyllis Mead, and Tom Stoppard. The next exhibition, “The Architecture of Steel,” will feature the work of Carlos/Jorge Bocchi, Vito Acconci, and George DeSousa.\n\n\nThe National Galleries of Scotland announced today that it will no longer be able to operate a museum in Edinburgh following a 2018 general election. The decision was made after a referendum, which saw an overwhelming majority of Scots vote to leave the United Kingdom, and was made in light of the Covid-19 crisis.During the campaign, Prime Minister Murray Brown outlined a vision for a new museum in the city, which would draw on the cultural and historic sites that have served as key points of entry for visitors to the city. “I want a new National Museum of Scotland,” Brown said. “A museum that reflects and celebrates the life and creative energies of Scotland.” He added: “It will have the power to shape our", "The next Biennial should take place in March 2022. The 2019 event marked the first time that the program was staged outside of Japan and was organized by the institution. The event was chosen as the theme for its fifteenth edition, which will be held in Hong Kong from March 22 to March 27 and will feature original works by twenty-eight artists.Details about the 2019 festival can be found on the festival’s website.\n\n\nThe Metropolitan Museum of Art has completed its redesign and expansion of the Gallery of Modern Art, which was established in 1980 by both the Met and the J. Paul Getty Trust as a museum dedicated to the art of modernism. The redesign—which combined the Getty’s existing building and reimagined the Getty’s Jubilee Hall and the new Getty Archaeology Museum—is considered one of the most ambitious exhibitions in the history of the institution.“The art of modernism is at once a radical departure from the ways of the past and a universal language of the future,” said Markus Wieder, the director of the Met. “The new construction reflects the museum’s long-term commitment to archiving the museum’s collection in a way that reverses", "The next Biennial should focus on the history of the art and cultural landscape in the Americas and Europe. “After a hiatus, the Biennials will return to the Americas and Europe,” said Renata Dalí, director of the Museo Autónoma de Barcelona.\n\n\nIndia’s Mumbai-headquartered contemporary art museum, the Raja Ganesh Art Museum (RGA), has appointed Rina Banerjee as its next general manager. Banerjee comes to the institution from the New Delhi-based museum, which underwent a major renovation and expansion in 2016, and will assume her post next month.In her new role, Banerjee will be responsible for facilitating the transport and exhibition of the Tata Collection, which comprises works by artists such as Gyanendra Bhardwaj, Auroinder Ganesan, Yadav Gulati and Sohrab Mohebbi, and will also provide programming for international audiences. “Rina has been instrumental in supporting the collection, which has recently expanded to include works by the Barbados-born, Mumbai-based artist Aarti Ghosh’s paintings, as well as for developing and strengthening the RGA’s own collection. She is", "The next Biennial should be held in 2020, and the full list of participating artists can be found here. \n\n\nThe National Gallery of Art in Washington, DC, has received a gift of 77 works by forty-six artists from Qatar. The donation was made by Sheikh Tamim bin Hamad Al Thani, the former head of the emirate, to the institution as part of a deal announced in December 2019. A total of $46 million were involved in the pledge, which also involved the purchase of eighty-two works and the construction of a new building, the National Museum of Art, and the National Gallery of Art.“We are extremely grateful to our benefactors for this magnificent gift,” said Ahmed El Majidi, the director of the National Gallery of Art and the National Museum of Women in the Arts. “This is a particularly significant gift for a local and regional museum that has traditionally focused on the art of women, and through this project, we hope to gain a better understanding of the full range of Arab artists, and the diversity of their practices, both in their art and in their architecture. Our goal now is to build on the gift to realize the institution’s ambitious plans for the National Museum", "The next Biennial should be held in 2022, and the festival’s next edition will take place in the Spanish city of Valencia.\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Kate Mullen as its next director. Mullen, who has been with the institution for more than twenty years, succeeds Sandra Flanders, who will remain on staff as interim director.“In her new role, Mullen will oversee the museum’s sixty-year history, including her tenures at the end of the twentieth century and the beginning of the twenty-first, and will also provide direction and support to a new generation of directors, curators, and staff,” said museum director Matthew Teitelbaum. “Joining the MFA as a board member and champion of the arts is a true honor. We are thrilled that she will continue the museum’s work in fostering a more active, innovative, and collaborative museum.”Mullen currently serves as the board chair of the artist-run nonprofit the Hatch Center for the Arts, where she has organized numerous exhibitions, including the first exhibition of contemporary art by Sarah Polley (2019) and “Carrie and John” (2019),", "The next Biennial should take place in 2020, when the institution will celebrate its fiftieth anniversary.  The show will also feature a retrospective of the artist’s work titled Avalon, and will include a selection of works on paper and a selection of works on paper with pencil. The institution will also be renovated and reopened as an artist’s studio and the courtyard will be transformed into a public space.The commission of the work, which is currently housed at the Museum of Fine Arts in Boston, is the culmination of two years of work by the artist. She first presented it at the National Gallery of Art, where it was exhibited in the exhibition “She Persists,” 2009–2010, and “Avalon’s Fountainhead,” 2012–13, and then at UCLA, where it was presented at the exhibition “From the Fountainhead to the Clouds: Art and the New Art of Autumn” (2013). \n\n\nThe museum’s collection of more than four hundred fifty works by artists such as Robert Irwin, David Salle, and Hélio Oiticica is slated to undergo a major restoration project that will involve the relocation of the collection and the", "The next Biennial should invite ten artists, including Nisha Ganesan, Irsha Bano, and Alex Hirschhorn, to participate in the event. The festival will continue to be held in different locations across New Delhi, the capital of India, until March 20, 2020.The next event, dubbed 'India & Art: A Conversation,' will be held on March 27. It will follow a theme of the biennial, which \"is not about the art of artists but about the changing face of India, its reflection of the world, and will take the viewer on a journey through the inexhaustible and the infinite.\" The next edition will be held at the Delhi Art Gallery (DAG).\n\n\nThe Museum of the City of New York (MoCA) has announced that it will celebrate its thirteenth anniversary next year with a new edition, “An Open Notebook.” The exhibition will focus on the rich, evolving history of American literature with a selection of fourteen new works that were created by twenty-six artists. The event will be held at the museum’s courtyard, between Central Park’s Trumpet Street and Atlantic Avenue, from March 15–March 19, 2020.“The museum is celebrating", "The next Biennial should take place in the spring of 2020. See also: Artforum and Artforum Australia. For full details on the 2020 event, visit the exhibition’s website.\n\n\nThe Los Angeles County Museum of Art (LACMA) has announced that it has acquired the unassuming Los Angeles native John Bergh, who passed away on December 9 at the age of eighty-four. Dubbed the “Father of Modernism” by critics, Bergh was a pioneer of the California Contemporary Art movement and a pivotal figure in the Los Angeles–born art scene.Born in 1937 in Los Angeles, Bergh studied under Frank Stella at the University of California, Berkeley, where he studied under Cesar Palacio at Santo Domingo. He then moved to the Hollywood Hills to live with his brother and eventually attended the University of Southern California (USC), where he studied with Ron Chernow, who also taught at the institution, and worked as a vehicle for his artistic output. In the late ’60s, Bergh began his career as a painter, creating his first work for the Los Angeles County Museum of Art (LACMA), a whimsically decorated", "The next Biennial should be held at a location that will hold a capacity of 10,000 people, with a theme that will be driven by the theme of the exhibition.The museum will also begin inviting visitors to participate in online viewing rooms that will allow visitors to explore and view the works in real time. The spaces will be accessible to anyone with a Microsoft® Surface®, Surface Pro, or Surface Book. The first viewing room will be at the museum until March 15 and will be free for the public. The second viewing room will be open at the same time as the first and will be free for the public from March 13 to March 16. The next Biennial will be at the Museo de Arte Contemporáneo in Madrid in January 2021. \n\n\nThe New York artist-run nonprofit Art in Stations, an initiative that places artworks on display in public spaces across the city, has received a gift of some twenty-six works by thirty-two artists. Among the works donated are works by artists such as Robert Irwin, who was featured in the 2013 Whitney Biennial, as well as Adam Dziewior, who created a series of portraits that were exhibited at the Museum of Modern Art in New York in 2017; John", "The next Biennial should focus on the ethology of the machine: in other words, the ways that machines are entering into and shaping our culture and our world. Our future will be determined by our ability to govern machines, to use machines to further our knowledge and our visions, to use machines to create new worlds and new forms of life. Our future is now.\n\n\nArtist Michael Jordan has announced that he will not be making any more solo exhibitions at the Museum of Modern Art in New York at this time. The move comes amid the controversy over the museum’s decision to close its doors to the public after twenty-five years, and follows a tumultuous four years for Jordan, who is known for his gender-based and sexual-focused exhibitions.Jordan opened his first solo show in Los Angeles in 1994, at the home of the late sculptor George Nakaitinic, a longtime friend and confidante. The show, titled “A World Apart,” featured works by seventy-four artists, including Amy Chesky, Alighiero Cattelan, and Hélio Cipolletta. Within a year of its debut, the show had another show at the Los Angeles County Museum of Art (LACMA), and", "The next Biennial should be held in 2021. Michele B. Irvin, president and CEO of the New York Folk Art Museum and Museum of Art; Curtis Ann Miller, executive director of the Museum of Modern Art in New York; and attorney Fran Lebow, among others from the auction house have signed an open letter to New York governor Andrew Cuomo, calling for the museum to cancel the exhibition “In the Realm of the Arts” (I.M.P.A.), which is scheduled to run September 18–23. The letter states that the protest was initiated by a group of artists who “are concerned about the exhibition’s content and its potential to further radicalize we are concerned about the show’s inadequate and perceived mission.”In response to the letter, Michael A. Kennedy, president and CEO of the Museum of Modern Art, said: “We recognize that the proposed artists’ letter and the protests that have sprung up from it are important and that they are united in their concerns. But the show still infringes on the museum’s own property. The Museums Association (MA) is asking the court to recognize the letter’s right to negotiate without the intervention", "The next Biennial should begin as soon as possible, with the goal of reaching all of the participating institutions by the end of June. A 2019 version of the exhibition will be staged at the Pérez Art Museum in Mexico City in March. According to organizers, the exhibition will include works in the exhibition catalogues will represent at least twenty major European countries, including Italy, the Netherlands, Austria, Finland, and France (as well as twelve countries from the Americas, Africa, and Oceania, including Chile and Mexico).While the show will include more than 1,300 works from thirty-four artists worldwide, the Pérez Art Museum is not planning on hosting the biennial in its entirety. “We appreciate the many voices of artistic talent that will be included in this exhibition, but we do not want the exhibition to become a platform for intolerance,” said Pérez Art Museum director Ana María Alves. “The exhibition will be a unique experience for the guests, and we will prepare the building of a new exhibition that will reflect the show as well as a new way of looking at art.”This year’s show will also celebrate the centenary of the Pérez Art Museum’", "The next Biennial should focus on the recognition of the historical and cultural relevance of Dusanislov, and the exhibition should start with the concept of a museum and then the placement of the works in the exhibition. Dusanislov is one of the most important medieval Czech cities, comprised of several towns and a main square. The city is also known for its famous medieval castle, the Dusan Castle, whose impressive architectural history includes the construction of the largest underground water system in Europe and for the archeological site of the ruins of the medieval town of Krefeld.\n\n\n\n\n\nArt historian, author, and curator Joel Rosenberg, the founder and director of the experimental new media museum Guggenheim in New York, has died at age seventy-eight. In his final years at the institution, he curated exhibitions centered around themes such as the afterlife and the growth of consciousness.In a forthcoming retrospective of his work, Rosenberg will present his catalogued work in the United States before the museum’s recent reopening, “The Italian in the Museum: From the Paintings of Joachim Hobsje to the Modernist Decadents,” in 2021. The show will include twenty-nine works by twenty-", "The next Biennial should be held in the city in 2021. The next exhibition will be held in the city in 2024 and the next exhibition will be held in the city in 2021. The new 57-acre site will house the Museum of Tropical Science. A public celebration of the Biennial will be held at the Global South Forum in Lisbon on November 22.\n\n\nA British artist whose provocative multi-media works grapple with the concept of time and the reality of space has died at age eighty-eight in Paris. Known for combining performance, text, and photography to challenge convention, Wes Noth was considered one of the precursors of the modernist movement. His work, which is often made into movies, paintings, and sculptures, has been collected by the Los Angeles County Museum of Art and the Museum of Modern Art in New York, the San Francisco Museum of Art, and the Sydney Opera House. Born in London in 1932, Noth was raised in Sydney and Paris, and studied at the Academy of Fine Arts in London, the National Film and Television School in London, and the School of the Art Institute of Chicago. He moved to the United States in the 1960s and eventually settled in Los Angeles. His career began with a show at", "The next Biennial should be held in the spring of 2020. Until then, the museum will continue to present the exhibition “The Survivors: The Sexual Politics of Jesus” each year.Woodrow Wilson International, the Woodrow Wilson International Center for Art and Design, and the Woodrow Wilson Foundation will jointly manage the new museum. The new venue will soon boast a dedicated Wilson Collection of contemporary art, with more than 1,500 works by the American artist, and will be located at 500 Fifth Avenue in the heart of Manhattan. The building will be finished in the spring of 2021, and the exhibition will open to the public in the fall of 2021.The center, which will include an exhibition space for exhibitions and educational programs, is one of several initiatives connected to the artist and will be inaugurated by “The Washing Machine” (1979), a program for which the artist installed a watercolor painting on a washing machine. This works was on display in a series titled “Telling Stories,” which opened at the Wilson Museum in January 1979 and ran until March of that year. The show, which dealt with the themes of memory, the body, and the body image, sought to examine the social and psychological effects of pornography.", "The next Biennial should take place in Hong Kong and New York in 2021.Kwame Kwei, director of the Museum of Contemporary Art Hong Kong, declared: “Our next round of Biennials will be organized in collaboration with our international partners, and will take place in Hong Kong and New York in 2021. We need to make the most of the opportunities that are currently there and to think globally about the next stage.”The 2019 edition of the Biennial featured work by seventy-five artists, including Alison-La-Paglia, Agnes Martin, and Roger Negrete, and was held in collaboration with the Poetry and Narratives Program, the Museum of Modern Art, and the Interdisciplinary Center for Contemporary Art (ICCA). In 2020, the 30th edition will be staged at the MCA and will run between December 17–December 21.\n\n\nThe Los Angeles County Museum of Art (LACMA), the Museum of Contemporary Art Los Angeles (LA MoCA), and the Museum of Contemporary Photography (LA MoCA) are all preparing for their first winter on the grounds since 2002. LACMA director Michael Govan announced the initiative, “Staged Present: Seasonality in Art,” at", "The next Biennial should, however, not only highlight the work of recent years, but also take a long-term view of the history of art by combining contemporary and classical concepts. The theme will be “The Historicity of Art,” and the exhibition will involve the restoration and management of the Internationale Bauhaus und Nationalgalerie in Cologne; a new collection of works by the Italian artist Piero della Francesca; and a new cultural institution in the Austrian capital which is currently being built.The exhibition “Kunstmuse im Neue Galerie Bauhaus und Nationalgalerie” will run from May 22 to May 29, 2020 in Kassel. The biennial will focus on the work of the German artist Ferdinand von Humboldt in the 1870s and ’80s, which included work by Frank Könitz, Jan Steger, Hans Maier, and others. The exhibition will include two editions, one for collectors and another for the general public. “However, if we continue our current course, we will not be able to preserve our present ways of life,” Abdelkader told the Art Newspaper.  In order to preserve the future of the", "The next Biennial should open in 2021.” The institution is now accepting nominations for its 2020 edition, which will be held at the museum from January 21 to February 20, 2021. These include pieces by artists from the following categories: B.P.A.I.T. (Biological Anthropology, Ethnography, and Intelligence), choreography (Biological Anthropology and the Instrumentality of the Body), the Anthropocene (Biological Anthropology and the Anthropocene), the Body and Politics (Biological Anthropology and the Body Politics), the Image (Biological Anthropology and the Image), and the Body and Society (Biological Anthropology and the Body Society).Nominations for the next edition of the Biennial are open in the public online portal “Artforum” until January 3, 2021.\n\n\nItalian architect Stefano Domenicali, the architect whose contributions to the development of modernist architecture, including the storied Fabio Castelli and the 1400 city in Milan, will receive the Order of the Italian Empire (Otto di Trisulti) in a ceremony at the Vatican on January 12, 2021. Domenicali is the second Italian architect to receive the", "The next Biennial should take place at the Museum of Science and Industry (MISI), Tokyo, on September 26 and September 29. The museum is currently working on a new visual arts platform to commemorate its one-hundredth anniversary. The new platform will be inspired by the Haida theme, Nanakuli, which will include a series of drawings, murals, artist-built environments, and installations. The exhibition will be curated by Takashi Ishii, a MOSI curatorial fellow, and Kunihiko Takahashi, a MOSI curatorial fellow.The next Japanese pavilion to the Biennial, which is currently on display at the Akasaka Art Museum in Tokyo, will open this fall. The documentary film The Truth About Not Being (Qin Zi) will be presented by the biennial in the fall.\n\n\nThe National Museum of Arts in Washington, DC, has appointed New York–based artist and educator Celine Dion as its next director. Dion currently serves as an adjunct curator at the museum and is the author of numerous books, including Celine Dion: From Scratch (Knopf, 2018), which was nominated for an Annie Award in art this year; Celine Dion: The", "The next Biennial should be held in the spring of 2021. \n\nArts activist and writer Wangechi Mutu, who is facing up to nine years in prison for inciting racial hatred with his provocative paintings, has been stripped of his citizenship by his home country of South Africa. Actor-turned-activist Satya Naidu was also excluded from the 2019 edition of the United Nations Human Rights Council, and while he is not facing any criminal charges, the South African government reportedly suspended his citizenship in January.In a statement, South Africa said: “South Africa believes that the exclusion of Naidu from the 2019 Human Rights Council is consistent with South Africa’s international obligations. South Africa would also like to note that the South African government is committed to protecting the dignity and the security of all South Africans.”\n\n\nItaly and France have agreed to let the Lebanese army repair damage to its southern city of Tripoli following a civil war-torn conflict, in an agreement that will likely ease the country’s economic crisis and ease the country’s spiraling unemployment rate. The agreement, which will require two years of negotiations, was reached between the two countries’ defense minister, Franco di Pietro Parolin,", "The next Biennial should be held in 2019. For the history of the exhibition, the first exhibition was held in 1978, and the last was organized by the National Gallery of Art in Washington, DC, in 2010.  The Biennial de Linège is also planning to restore the former homeworld of the chimpanzee, shedding light on the evolution of Homo sapiens from chimps to us humans. The project, named after the French mathematician and astronomer Jean-Luc Bière, is being spearheaded by the Institut de la Habitation d’Arles (LAC), which is housed on the fourth floor of the Grand Salon des Arts et littoraux in Paris, and is supported by the consortium of archivists, collectors, and art workers Boyer, Dallos, and Mavigné, as well as funding from the French Ministry of Culture.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Avi Arad, a professor of the history of art, as the next director of the institution. Arad joined the museum in 2003 as a curatorial assistant. In 2009, he was promoted to assistant curator, and three years later, he became curator of modern and contemporary art,", "The next Biennial should be held in 2021.\n\n\nEnrique Medrano, the founder and CEO of the private museum Anadolu Arts, has announced that he will give the 2019 edition of the exhibition a $200,000 loan. The institution currently holds the contract to stage the exhibition until March 24, 2020. Its next major work, a painting by João Caumartó, will be unveiled at the institution on April 26.“The exhibition has been running for nearly eight years, and Anadolu has been the epicenter of the museum’s contemporary art.” The museum also recently won the international collaboration award for the third consecutive year. Anadolu Arts is currently working with two teams to present the exhibition: Art Center Miami and Art Miami Gallery. The first is to present the show in Miami Beach; the second in the city of Santo Domingo.The consortium led by late American architect Frank Gehry and his partners Dan Gilbert and Nils Pulver will construct the pavilion, which will be located on the third floor of the museum, in the city’s historic district of Museu de Arte de Miami (MASM), as part of an ongoing exhibition called", "The next Biennial should focus on the 'poetic and physical' relationship between sculptures, as represented in the work of the past, and the present. Should the theme be “Stretching the Limits of Art” the exhibition should take place in the museum’s new building, which will be inaugurated by the exhibition of Biennial 2, “Beyond Margate: The Modern Arts and Hellenic Culture in the Late Classical Period” in May, 2020.Commenting on the biennial, curator and biennial organizer Katja Neeson said: “The Biennial is a celebration of the diversity of the cultural landscape of Biennio, the vibrant history of the museum, and the seemingly infinite possibilities for new and original ways of making art. The exhibition ‘Between the World and Me,’ which will run alongside ‘Between the World and Me,” will focus on the struggle of artists to develop a new way of being at the museum, while ‘The New American Art’ will explore the idea that art has power to heal and transform communities.”\n\n\nByron York, the chief executive of Tate Britain, has announced that the arts organization will be taking over the management of the Tate", "The next Biennial should take place in 2022.\n\n\nMinneapolis’s Architecture Museum is asking the City of Minneapolis to waive the normal permitting process to allow it to remodel the building that houses the institution’s collections of Sidney and Lionel Hampton Ridgelines. The museum is currently working on a renovation of the building that will include the installation of new galleries and the renovation of the main entrance. The process is expected to take six to eight months and will involve the removal of the Radisson Bluemound and the renovation of the buildings’ interior.The art museum is concerned that the city’s Landmarks Preservation Ordinance (LPA) will be used as a tool to restrict the museum’s ability to remodel the building. According to the Art Newspaper, the city’s planning department has told the museum that it has nine months to live in order to extend the construction timeline. The museum is concerned that the delay will hurt its ability to attract and retain the $44 million in annual funding that it needs to operate.The request for proposals for the renovation is in reaction to the city’s decision to take down the Hampton Ridgelines building in April. The renovation", "The next Biennial should come in 2021, and the 2020 edition will be held at the new Los Angeles County Museum of Art.\n\n\nThe prestigious Chicago architecture and design school, Northwestern University, has appointed Leslie Ola-Hood as its next associate dean for academic affairs. Ola-Hood joins the school from the University of Chicago, where she has served as an associate dean for academic affairs since 2015.“Leslie is a highly accomplished and creative scholar whose career spans more than twenty years and spans a variety of academic disciplines,” said Beth Akers, chair of the university’s board of trustees. “Her impressive history and exemplary teaching make her a perfect fit for the role of associate dean for academic affairs and we are excited to welcome her to Northwestern.”Commenting on her new role, Ola-Hood said: “I’m excited to accept the challenge of leading the Northwestern University community into the future with a strong and successful architecture and design program. I’m committed to the Northwestern University community, the university and I, and am honored to have been selected as the 2020 recipient of the William S. Pritzker Architecture in America Award.” She added that she hopes the award", "The next Biennial should be in 2021, the same year the first edition is due to open. The new theme, “Politics and the Arts: The World has Turned,” will be inspired by the work of Hans Christian Andersen. “The World has Turned: Hans Christian Andersen’s Art and Politics” is presented by the biennial’s exhibition architecture and design design, and the theme, which is inspired by images in Andersen’s famous travelogues, is inspired by the work of Oscar Niemeyer and the art of the environment.The exhibition’s proposed theme, “Politics and the Arts: The World has Turned,” is a departure from the Andersen’s usual themes of social justice and work of European modernists. The art of the environment will be represented by sculptor Jadeja Ruiz-Perez, who created a series of interconnected ponds inspired by the works of Hans Christian Andersen. The Pastel, the Sky, and the Sea pavilion will feature paintings by Nari Ward and Andy Warhol; the first installation, “Boys” by Ward and Warhol, will open in the exhibition. The pavilion will also feature", "The next Biennial should be held in 2021, the museum said. For its collection, which comprises work by Patsi Mitchell, Terrie Haggard, Henry Parsons, and dozens of other artists, the museum will work with the Gilded Age Museum at the Smithsonian American Art Museum to mine the country’s prehistoric past. The work in question is a set of four clay tablets dating from the early fifth centuries B.C. and dating to Cobra Period. The museum has previously presented works by Henry Anzai and Patricia Cranach in the United States, but the institution will not have the opportunity to show the works to the public until 2020. The museum said that the 2015 exhibition “came as a great relief to the artists whose works are currently on view. Their sculpture programs, which were not fully realized at the time, were put into motion to reflect the exhibition.”\n\n\nThe Metropolitan Museum of Art (the museum) in New York has accepted a $1 million donation from acclaimed collector and philanthropist Paul Mpagi Sepuya. The gift, which marks the first time the institution has ever given to a collector, comes in support of the collection of a Palestinian", "The next Biennial should begin in the fall of 2022. Da Costa said: “The next year, I hope to continue to serve as an inspiration for others to imagine what a healthy, thriving, and creative city looks and feels like.”\n\n\nThe MFA London, which announced that it is canceling the upcoming exhibition “Unseen: The MFA London” in the interest of protecting the work of the sixty-nine-hundred-year-old museum, has announced that it will cancel the event after all. “The MFA London’s decision to cancel this year’s exhibition is not a political statement, but a decision made in the interest of the art and the work of MFA London,” reads a statement issued by the institution. The museum believes that canceling the exhibition would be in the public’s best interests, and that the move would be in the public’s “interests” to do so.“The MFA London team made a commitment to the artist-collection to make the cancellation of this year’s edition of Unseen possible, and we have done so with a heavy heart,” the museum said in a statement. �", "The next Biennial should focus on the history of the exhibition and its contemporary-issue. The event should also explore the historical relationship between the exhibition and the city of Biennale and how this relationship has evolved over time. When the exhibition closed in 1966, it was still very much a new enterprise and faced many of the same challenges as any of the other events that had been staged here in the prior decades—including the Black Power movement and the AIDS crisis. The Biennial was also dealing with its own legacy of racism, which had been revitalized by the anti-colonial struggle that was waged in South Africa. Recent performances, such as “The Black Years” and “Black Years: From Mandela to Now” (2018), followed the African diaspora to Berlin and the International Black Museum, where they were staged by the same company that produced the works and introduced the exhibition to a new generation of visitors.“Themes and installations of the biennial reflect the legacy of the exhibition, which has been the center of a community and of an international dialogue between Berlin and the region,” said Markus Lügens, director of Berlin’s Fondazione Prada. “The project is a synthesis", "The next Biennial should be held at the site of the former Bahiosco de Roca, in Santa Barbara, California, in 2022, and should be ready for the 2019 edition. The next edition of the Biennial will be held at the ancient city of Palaestra in Greece, on the island of Santorini, in 2021, and will take place at the Witherspoon and Buckerbill Art Museum in Leeds, England, in 2020. The biennial will kick off with a presentation of a selection of the final works of the biennial’s program, and will continue with curatorial and production work by awardees as the museum prepares for its reopening. The show will culminate in a public reception at the Witherspoon and Buckerbill Art Museum on Saturday, March 17, at 7 PM. “We are very excited to welcome the art and artists of the upcoming exhibition to our curatorial team and to celebrate thirty years of the award,” said Sara Eckert, curator of the upcoming exhibition and a former director of the collection. After the biennial, the museum will reopen to the public in the summer of 2022.\n\n\n\n\n\nThe Museum of Contemporary", "The next Biennial should focus on the history of the MFA (and the University Museum of Chicago), which recently received a $10 million donation from the Charles Koch Foundation. The museum has also been working with the University of Chicago on a redesign of its campus. The museum plans to open in the fall of 2020.The museum has previously held a number of exhibitions, including a retrospective of the work of the artist László Axmann (1937–1973), a show about the history of the Black Arts (2019), and “Two New York Restaurants,” a retrospective of the work of the painter Robert Irwin (2019–20).\n\n\nThe Museum of Fine Arts (MFA) in Boston, which was forced to temporarily close for two weeks in December 2019 after it received a major blow to its $300 million endowment, has announced that it is reopening in January 2020. The institution said that the first show it will host will be “The Verne Troyer Collection: Avant Gardes”—a three-show project that aims to reissue thousands of photographs from the artist’s collection that were recently donated by the Museum of Fine Arts in New York.The institution plans to build a new 250,", "The next Biennial should take place in December 2020. “We are currently evaluating our options, and we are determined to pull the plug on the exhibition at the earliest opportunity,” said Mats Lindstrom, director of the biennial. The works on view in the exhibition include work by a wide range of artists, including Hetain Shah, John Ladd, Roald Hoffmann, and Enrico Castotti.Sonia Rojas-Wilson, the biennial’s executive director, said: “This is a time of great uncertainty for the museum. Our immediate priorities are ensuring the financial sustainability of the biennial and assessing the impact of the closure on our artists. However, there are also other considerations that we need to consider. The exhibition will not be finished until at least April 2021, and we need to understand the implications of the closure on our artists and our exhibition designers. We are at a critical juncture, and we will have to carefully consider the ramifications of this for our artists.”\n\n\nThe National Gallery in London is planning to shut down its public exhibition “Blue Period: Contemporary Art in the Eighties,” which has featured works by artists such as John Akomfrah, Robert", "The next Biennial should examine the history of the contemporary art world, focusing on the inter-relationships between art and culture, the arts and and society, and will examine the relationship between the contemporary art world and the art-world culture in general. The last year of the biennial should be devoted to creating a dialogue with contemporary artists and institutions in the United States.”The announcement comes less than two weeks after the museum revealed that it will restore 40 of the 135 works in its collection, which is currently on display in the “Art of the World” series, in time for the 50th anniversary celebration in 2020. The exhibition will take place in conjunction with the biennial, which will run from November 13 to November 17, 2020.The restoration project—which will include the reassembly of artworks by the artists who were represented in the exhibition—will be a collaborative endeavor between the Tate, the British Council, and the British Museum. The installation will be a retrospective of the work of Cy Guinée, Yilmaz Gyorody, Louis Malle, Paul Gauguin, Edvard Munch, Kiki Smith, and Pierre-Auguste Renoir. The exhibition will also present pieces by artists like Agnes Martin", "The next Biennial should be held in the spring of 2021 and will be organized as follows: The Artisanal Workshop . Illumination Events and Displays . Observatory and Performance Art . Once a Biennial, Always a Biennial. The next Biennial will be held in the summer of 2022 and will be organized as follows: The Artisanal Experience. Illumination Events and Displays . The Artisanal Workshop. Artisanal Experience is a series of events organized through the artists, creating a new space for the exploration of the connecting elements of art and life. Originally organized as a series of local, regional, and national exhibitions in the 1990s, the Artisanal Experience was originally conceived as a platform for the art of Southern California to explore ideas of the Earth, the Moon, the sun, and the sky through visionary installations. The first project, Artisanal Experience: Spaceport, was staged at the Venice Gallery in 1998 and was followed by two more exhibitions (Artisanal Experience II: Snowflake and the Stars in 2002) and three books (Artists in Spacetime: The Artisanal Experience, Illusions of the Sky, and Imperfect", "The next Biennial should focus on the role of color in the political life of Hong Kong, and on how our history can be a model for our present and future. It should also consider how art and architecture will shape future interactions between Hong Kong and China, and how the work of artists and architects in both locations can become a means to deepen international understanding and cooperation.” In the past, Arts Council Hong Kong has organized five frequent exhibitions of work by local Hong Kong artists, including Miwa Yan and Haroon Mirza, who are currently on display at the Museum of Modern Art in Seoul.\n\n\nThe Rockpool Arts Centre in Manchester, United Kingdom, has appointed Theresa Keith, who has helmed the venue since 2015, as its new artistic director and chief executive. Keith joins the Rockpool from the Sackville-born, London-based artist-run space the Factory, where she served as artistic director from 2016 to 2018. “I have been working at Rockpool for over a decade now, and have been an advocate since I founded the UK’s first art space, the Garage, in 1994, in a former industrial building in west London, with my partner, Rob, who had just graduated from the University of East Anglia.", "The next Biennial should be held in 2020; the next will be in 2021. The last Biennial will be held in 2022. \n\n\nThe Los Angeles County Museum of Art (LACMA) has come under scrutiny for barring a historian, Yoko Ott, from its exhibition “Cultural Histories,” a major project of the institution’s redesign, which was selected by a jury comprising Jean-François Brindisi, director of LACMA; Alan Sovacoff, head of the CNA; and María Berrada, the director of the Metropolitan Museum of Art in New York. The exhibition, on display in the museum’s new location on West 15th Street, was scheduled to open on September 3.After Ott filed a complaint with LACMA director Rainer and other board members in late September, the museum abruptly canceled the exhibition, which was scheduled to run until December. The museum then cited the delays as the reason for the cancelation, and in a letter to the public, it said that the project “wasn’t ready for prime time.”In a letter to Berrada dated October 6, the museum wrote: “Unfortunately, in order", "The next Biennial should be held in 2022. Nikhil Seth, president of the Winterthur Foundation, told the Art Newspaper: “We are excited by the prospect of working with the Hirshhorn Museum and Sculpture Garden to present a new exhibition of work from this remarkable collection. . . . A fantastic selection of new works over the last ten years. We are confident that this show will engage with and resolve the essential questions that affect our understanding of contemporary art.”\n\n\nThe École des Hautes Études (EHEE) in Paris and the Centre National des Arts et Modernes (CNA) in the city of Antwerp, Belgium, have announced a partnership that will see the Centre National des Arts et Modernes—which was founded by artist Édouard Vuillard in 1972 and has locations in Brussels, Paris, and the University of Antwerp—open its first museum in the city in 2022.Called the Center National des Arts et Modernes (CNAM), the twenty-third iteration of the theme park will be located on the Boulevard des Lorises in Paris and will serve as the venue for performances, lectures, workshops, and other public events. The theme park will also host an exhibition", "The next Biennial should focus on the history of the city, the city’s two museums, and the city’s waterfront. The inaugural exhibition, titled The City of God, will open on November 2 at the Pont de l’Île-Geneva Museum, followed by two exhibitions, The City of Ruins and The City of Light. The next exhibition is titled The Unfinished Business, which will be on view until March 29.\n\n\nThe Institute of Contemporary Arts (ICA) in the City of New York has appointed its first director, John D. Johnson, who previously served as president and CEO of the Metropolitan Museum of Art. Johnson joins the ICA from the New Museum where he has previously held senior positions, including as executive director of the Ammirati Gallery, and from the Museum of Modern Art, where he worked as head of the exhibition department for a decade.“John is one of the most highly regarded and accomplished curators of African American art in America,” said director Michael C. Lissoni. “He developed and introduced new experimental and conceptual approaches to exhibitions in the late 1970s and early 1980s, and his work is reflected in the ICA’s", "The next Biennial should take place in the coming years, and will thus be an opportunity for us to reexamine our relationship with the museum and the spatial arrangements within it, as well as to take into account the changes that are taking place within our own lives.The Museum of Modern Art (MoMA) in New York is seeking a new director, and our search is ongoing. We welcome any and all perspectives, and look forward to this next stage of the search.\n\n\nThe Museums Association (MA) has announced the results of a survey on the exhibition and merchandising industries, conducted by its executive board and a panel of cultural industry executives, in partnership with the Association of Art Museum Directors (AAMD). The results are invaluable for museums looking to improve their business models, increase the viewership of their exhibitions, and prepare for future sales and marketing campaigns.The survey, which was commissioned by MoMA after a group buy and organized by the AAMD, examined the financial, social, and emotional impacts of the current exhibition cycle, the relationship between museums and collectors, and the new merchandising platform, the auction house, and the exhibition industry itself. The results have not only been of great concern to museums, but also to collectors and auction house", "The next Biennial should be held at the New Museum in New York next year, followed by a second in Hong Kong in 2020.The Arts Council, which represents artists in the UK, has also announced its representation of an artist as part of the upcoming biennial. The artist will be presented with an award of $41,000. The awardees include John Barlow, who will be given a $25,000 Lifetime Achievement Award, and Zoe Kaldor, who will be given a $25,000 Lifetime Achievement Award for her work in international art.The biennial was established by the London-based nonprofit Art Fund in honor of its public-policy director, Aya Alibayya, who died last year at the age of seventy-eight. The inaugural event was staged at the New Museum in conjunction with the Art Fund–backed endowment fund Art in the Public Interest, which will organize future iterations of the biennial in partnership with the Tate. The 2019 iteration, which was staged at the Art Fund-supported Turner Prize–winning venue the Institute of Contemporary Arts, London, produced forty-four works by sixty-six artists.\n\n\nArtadia, an Israeli philanthropist and former supporter of artists, has announced that it will give", "The next Biennial should take place in 2021. Read more about the program here. \n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, announced today that it is pushing back the opening of its new museum on the Sunset Strip in twenty-six months. The change is made in order to keep the new museum in the city’s downtown, which has been stalled since it was conceived in 1986.The extension also aims to provide more time for the city’s arts community to come together and make a new kind of museum: one that will incorporate live music, dance, and other events and will serve as a platform for an unplugged world.The extension was requested by architect Daniel Libeskind, who was awarded the MacArthur Foundation’s $10,000 Lifetime Achievement Award last year, and will allow MoCA to prepare for its grand opening in 2022 and the museum’s inaugural event in 2024. In both cases, the extension will allow MoCA to present the newest artworks and the earliest artworks to the city, as it works to adjust its architecture to accommodate the city’s growing culture and needs.·\n\nThe Royal Academy of Arts (RA) in London has received a $50,000", "The next Biennial should have been held in 2019. The organizers cited the need to improve its public programming and its exhibition program as reasons for taking the event off the calendar. The date has yet to be announced.\n\n\nRemo Pampas, the director of the Museum of Modern Art (MoMA), in New York, has announced that the institution has received a donation of fifty paintings and one sculpture from the artist Jasper Johns. The works, which were donated by artist James Cuno, were acquired through an arrangement between the institution and the artist in the interest of preserving the collections of MoMA and the Museum of Modern Art.“The works are extraordinary, and in their class,” said Pampas. “They are works that will continue to inform and challenge us as we continue to consider the legacy of the biennial, and that will shape how we think about the artist’s and his place within the canon.”The works were donated to MoMA from the artist’s private collection. Johns was born in New York City in 1936 and grew up in Brooklyn. When he was fourteen, he moved to San Francisco to attend the University of California, Berkeley, and studied under the celebrated Italian painter Francesco Pal", "The next Biennial should be held in the spring of 2022.The upcoming edition of the biennial, titled “We Are All in the Same Boat,” will feature the work of thirty-seven artists, including Emmanuel Arouet, Akiko Korematsu, Nara Sandoval, Akiko Tagawa, Rintoul, and Hideo Takeda. The show will also present the first Symposium on the Contemporary Art of China.\n\n\nThe Museum of Contemporary Art (MoCA) in New York has appointed Adrienne Edwards as its next director. Edwards, who has helmed MoCA since 1988, has been named director of the Contemporary Art of America (CA) by museum director Joseph Kahn. During her tenure at the institution, she has organized more than 400 exhibitions, including the first solo shows of works by artists such as William Eggleston, Robert Irwin, and Ralph Hopper, and helped the museum become the home of the 1988 Women’s March, the first national LGBT arts event, and the first time the museum held a retrospective of Russian painter Anton Chekhov.“Adrienne has been instrumental in shaping the Contemporary Art of America through her leadership, from her early, hands-on approach to", "The next Biennial should be a celebration of the lasting legacy of the museums built in the city of Bière-des-Neiges (BND), located near Paris, and should be organized in collaboration with the local community. The event should follow the theme “WANT to BE: the exhibition of the current exhibitions and collections of the various cultural institutions in the city of Bière-des-Neiges.”The commissioning committee will be comprised of Stefano Cattelan, director of the Museo e digita in Rome; Matteo Canepo, former director of the Palazzo Giochi in Venice; and Christa McNamara, the director of the Museum of Contemporary Art in London. The exhibition will be curated by Allan Tait, curator of contemporary art at the Tate Britain; Sarah McAllister, director of the National Gallery of Art in London; and Tomäs Jonsson. The event will be held in October 2020.The initiative was launched in 2017 to encourage individuals to create works for the construction of new buildings in Paris. The project received the support of the French Minister of Culture and of Culture, Franck Riester; the mayor of Bière-des-Neig", "The next Biennial should be an exploration of the relationship between art and its environment. The biennial should focus on the interconnections of art and technology through the lens of the current digital revolution. The next Biennial should aim to be a means of reopening the powerful and closed wounds between art and the natural world.”The institution’s director, Régine Wirth, added: “What we’re seeing now is a crisis of the 21st century. But we know that it can’t change. We know that it will never be enough. So we’ve created a platform for a different kind of future, one that rebuilds and recovers something new and new only. We hope that this is the moment for us to finally start to think seriously about the future of art and technology.”The inaugural edition of the Biennial was organized by Joshua Helmer at the Institut Nationale d’Art Contemporain (INAC) in Paris, and took place in the Écrivain Palace. The exhibition was curated by Jacques-Alain Gaillard, director of the Centre Pompidou in Paris; Marcel Prouvé, director of the Museum of Modern Art in Paris", "The next Biennial should be held in 2020 and should include the work of around forty artists, including Aline Borysi, who has been nominated for a Nobel and whose work will be included in the exhibition, along with works by three other finalists: Domenico Cattelan, the Italian government’s list director for Asia and Europe; and Shonya Barozzi, the director of the Art Gallery of the University of Rome.“The themes of the exhibition’s project of ‘Future Art’ and the exhibition of the work of the Biennial’s artists are very different, and the project of the exhibition of the work of the Biennial’s artists is more international,” said curator Andrea Bonanno, who curated the exhibition. “They express different thoughts on the history of art and the exhibition. The themes of the biennial are not the same as those of the exhibition.”In a statement, the Biennial said: “The 2018 Biennial was a success and we are proud to present it to the public again, this time with the new changes that we have introduced: the various partners have been more closely integrated into the event and the programming, better coordinated and", "The next Biennial should hopefully be announced soon.  Thanks to everyone who has been keeping up with the work of our new artists and all the artists that are working in the arts sector. We are committed to supporting the artists and their work and moving forward with various initiatives, especially in the areas of education, culture, and research. We look forward to seeing you at the event!\n\n\nThe American painter John Galliano has died at the age of eighty-three. Galliano was born in New York City in 1932 and grew up in a Catholic family. He studied under Robert Irwin at the School of the Art Institute of Chicago and at the Museum of Fine Arts in New York and attended the University of Pennsylvania and the University of Texas. After graduating in 1951, Galliano moved to Los Angeles, where he began to experiment with painting, drawing, and photography. Galliano quickly established himself in the early ’50s with his first studio, which he used to create a series of workbooks that are still in use to this day. In addition to his own art, Galliano also sold prints, paintings, and prints from his gallery, the Galliano Gallery, to the Fine Arts Museum of Minnesota, which is now the Museum of Modern Art.", "The next Biennial should be held in 2021, with a short-term exhibition of works in 2022. The 2019 event was staged at the Bürenseiterium in Frankfurt and drew some twenty thousand visitors. A selection of work from the biennial’s collection is on view in the exhibition “I Will Not Give Up: Contemporary Art from the Biennial of 1943.”\n\n\nThe Museum of Modern Art (MoMA) in New York has named Vinayakar Susheela as its next executive director. Susheela will be responsible for developing and executing the nonprofit institution’s internal policies and operating procedures, and will oversee the institution’s relationships with artists and organizations. As the director, Susheela will be responsible for the strategic direction and financial performance of the museum. “Vinayakar is an accomplished leader and a dedicated educator who has been critical to the museum’s transformation from a small museum that housed Scandinavian, European, and American art in a neutral location in Manhattan to a larger institution that gathers, presents, and engages with contemporary art,” said Museum director Daniel H. Weiss. “We are deeply grateful for his leadership and vision, which has", "The next Biennial should take place in 2021.Anyone interested in sponsoring a future exhibition should contact the local committee. \n\n\nThe museum of modern art (MoMA) in New York has announced that it plans to introduce new initiatives to help artists struggling with financial stress. In a new program, the museum will offer free financial counseling and other support to artists living in New York City.The work of artist Fuyuki Kawada will be presented as part of the institution’s “Themes of Wealth and Poverty,” a three-part, multiyear exhibition that will open at MoMA in October 2020 and run through January 2021. The show, which will feature abstract drawings, sculptures, prints, lithographs, and installations, is part of MoMA’s effort to reimagine how art can address the systemic forces that shape our lives.“Renewing the Power of Art,” which will include live works by seventy-eight artists including João Pedro, Antony Gormley, and Frank Gehry, will be on view until March 20, 2020. The show will explore how art can be a tool for social change and how artists can use art to address issues of poverty and inequality.“Art is an", "The next Biennial should be staged in the spring of 2021.  The news comes amid a run of three consecutive years of high-profile cancellations due to Covid-19. Last March, the CNA reported that the 2019 edition of Art Basel Hong Kong had been canceled. Since then, thousands of artists and collectors have walked away from the fair, which is held in the United States and Hong Kong.Organizers say that the pressurized environment at the fair is making the coronavirus more contagious. While the virus is spread mainly from person to person, a number of patients have died. In an attempt to contain the virus, Hong Kong has restricted large public gatherings and has placed large limits on travel; travelers from the United States must quarantine for 48 hours, and residents of China must quarantine for two weeks.Meanwhile, the festival’s Hong Kong representative, Yvonne Lam, said: “I feel very happy and relieved. There is no doubt that we were able to gain the understanding and cooperation of artists, collectors, and thousands of visiting curators from Hong Kong in the immediate aftermath of the pandemic and to convey our love and respect for their talent at this year’s event. We are very much looking forward", "The next Biennial should be held sometime in 2020 and will be the largest retrospective organized by Museum of Modern Art in its history. Diedrich Seitz, director of the Kunsthalle Basel and a former head of the Nationalgalerie Karlsruhe, said that the museum had been working on the exhibition for more than a year and had created a new ICA Exhibition with a new theme. “Since the exhibition is a work of art, the Biennial is a unique opportunity for us to think about the history of art, to think about the future of art and to think about the past,” he said.\n\n\nIn the predawn hours yesterday in Bristol, England, a twelve-person team led by British artist Marc Quinn installed a statue of Black Lives Matter activist Jen Reid on a plinth that recently held an eighteen-foot-tall likeness of seventeenth-century slave trader Edward Colston—a monument the artist called a “symbol of resistance.”Quinn reached out to Reid about collaborating after seeing an Instagram post of her posing with the sculpture Colossus of Rhodes, a bronze sculpture of a naked, thirteen-thousand-year-old African king, and asked her to create a work for the pl", "The next Biennial should have been held in 2020, but the organizers decided to postpone it, citing the Covid-19 pandemic as the reason. The biennial, titled “Theater of Operations,” will be held in the United States. In an open letter addressed to the public, the organizers said that a lack of an adequate response from the international community has led the United States to “march toward a military confrontation with Russia” and that the exhibition was “not aligned with the United States’ national security interests.” The letter concluded by calling for the exhibition to be moved to a different location, citing the exhibition as being “at the center of an ongoing dialogue between the United States and Russia.”The exhibition, titled “The Real Story of the Soviet Union” (2018), was curated by Aleksandr Solzhenitsyn. The exhibition was founded by the Russian-American duo Mikhail Prokhorov and Sergey Goto, who were commissioned to create a narrative of the collapse of the Soviet Union and the rise of the Russian people. Solzhenitsyn and Goto were given a great deal of freedom in creating the work, which was part of a larger project that encomp", "The next Biennial should take place at a location yet to be determined.\n\nBy the time the exhibition was completed in 1972, Landes Artist-Institut Berlin, which had started as an offshoot of the German magazine Freie Universität Berlin, had become a pop-up museum. The Modern Art Museum (MAM) in the Zeitgeist district of Berlin was also pushing the boundaries of what was possible with horizontal space, and the Museum of Contemporary Art (MCA) in New York had even more ambitious plans in the works. By the time the museum debuted its first exhibition of work by a black artist in the United States in 1974, the black experience in America was still in its infancy. The only other exhibition of African art in the United States was in 1981, and the only exhibition of Native art in the country was in 1993.While the inaugural show debuted ten works by twenty-five artists, the show went on to host fifty-eight works by sixty-six artists, including artists such as Akiva Elders, Pia Camil, and Hernán Cortés, who collectively won the $10,000 biennial for their work Imagination Games (2005); Sasha Dzegede,", "The next Biennial should be held in 2021. In a statement, the festival said: “We are delighted to continue to collaborate with the artists and the city of Seattle, and to be able to present the next iteration of the Biennial.”\n\n\nThe Margaret and Arthur M. Sackler Foundation, which is dedicated to the preservation and promotion of art and artmaking, has awarded $2.5 million to ten contemporary art organizations in the United States. The grants, which were made in support of the plans to reopen the Sackler family’s namesake gallery in Cambridge, Massachusetts, in the fall of 2020, were made in collaboration with the artists. The organizations are the Oolite Coast Collective, a New Orleans–based collective formed in 2017 to advance the work of African American artists; the African Diaspora Artists’ Cooperative, a New York–based collective of artists; the African American Artists’ Legacy Foundation, a nonprofit organization that supports the work of black contemporary artists; and the Angela and Otto Schlegel Art Museum and the Art Museum Halbstadt, which was established in 1935 in Germany and is affiliated with the Schlegel family.The ten support organizations are Oolite Coast Collective,", "The next Biennial should be held in 2021. The next triennial will be held in 2022. The next will be staged in 2023. The next will be held in 2027. The next will be staged in 2028. The next will be staged in 2039. The next will be staged in 2040. The next is currently being developed by the Tokyo-based firm MAD and will be staged by the new museum in 2020.MAD has been working on the Biennial for ten years and has created an exhibition around the work of contemporary and art-historical artists. The creative team behind the project include: Katsuya Naito, Shigeki Hata, Matsuo Takahashi, Noriwa Inoue, Tina Kato, Shimizu Taimura, and Shunsuke Fujimura, as well as Mitsutoshi Yoshizawa, Hiroshima Ikari, Katsuya Naito, Makoto Miwa, Meyer Lemon, Lorenzo Rondinone, and Anja Niddell. The exhibition will also include a new work by the artist Patricia Otero.\n\n\nThe National", "The next Biennial should take place at least once per year, but can be held any time, in any place, and must be open to the public.  The event will inaugurate the museum’s new research center for contemporary art, “B.I.C.M.E.” (B in Contemporary Art), which will offer more than one hundred exhibitions annually. The center will also host a series of performances spanning four decades, including “Sokken Art” (Spring 2019), “Theater of Operations: Vietnam 1975–1982” (September 2020), and “Mutual Support: Contemporary Art in the Vietnam War” (August 2020).\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it has received a gift of twenty-one works by twelve artists, including Renzo Piano, Robert Irwin, and Dean Kooser, from a benefactor who was instrumental in their acquisition. The donation includes work by the late artist and collector Ron Howard, who is best known for his collection of works by the late Colombian designer Federico Caussano, who was a longtime collector of the late painter Alberto Giacomo.“The gift of works by Ron Howard and", "The next Biennial should include a selection of exhibitions that explore the intersections between art and politics, art and technology, and art and science,” the artist told the Art Newspaper. “It’s a challenge to think about how to be both a lab and a city.” Following the event, the Governor of New York, Andrew Cuomo, signed into law a monument to General Electric (GE), one of the largest polluters of the environment and human health in the United States. The GE-designed monument is slated to be installed in the city of New York in 2021.The Governor’s plan to remove GE from the face of the earth is part of a broader campaign to dismantle the US’s industrial complex and move its operations offshore. According to the New York Times, the industrial state currently employs more than 3.4 million people in the United States and employs more than 55 billion tons of fossil fuels each year. The proposed changes to the landscape are part of a global campaign to dismantle the global economy and the institutions that support it—a campaign that has been spearheaded by activists, artists, academics, and celebrities. Among the institutions that have been targeted are the World Health Organization, the US Forest Service, and the National End", "The next Biennial should focus on “The Origins of Modernity,” the group said. “It will also explore the history of the exhibition, the exhibition’s installation, the publication, the exhibition’s program, the exhibition’s publication, the exhibition’s online presentation, and the exhibition’s sale.”The twenty-first edition of the Fifth Biennial, which will take place at the Museo de Arte Contemporáneo Barcelona from January 20 to January 22, will focus on “Feminine Form as Modern Art: Analysing the ‘80s’s exhibition ,” organizers said. The upcoming edition is slated to be held in September 2020. \n\n\nThe German artist Ulrich Rauschger, who has worked to create experimental works that engage with and challenge the boundaries of modernism, has died at the age of eighty-eight. The work of Rauschger, whose large-scale installations sometimes include hundreds of pieces, including a work on paper, 1961, which is part of the exhibition “La Sculpture” (Spielzeitung: Creators), and his presentations at C", "The next Biennial should begin on December 28 and conclude on January 17.The theme of the upcoming exhibition is “The Next Century:”\n\n\nThe National Museum of Women in the Arts (MoWA) in Washington, DC, has launched a new digital platform, “Artistic Freedom,” that aims to help artists navigate the vagaries of copyright law and the vagaries of copyright and trademark. The platform will provide free legal advice to artists who are affected by intellectual property infringement and will provide links to the copyright and trademark registrants' websites.“We are thrilled to support the hundreds of thousands of artists who are working across the country on their creative endeavors with the help of this platform,” said MoWA director Mary Anne Carter. “We hope that this unique resource will be of value to them, and that it will become a useful tool for some of our fair’s next installments.”The platform will highlight twenty cases each year in which the museum has sought the assistance of the American Institute of Art (AIA), a public policy think tank based in New York, for help in securing injunctions or in dealing with trademark infringers. It will also highlight cases in which the court has granted temporary injunctions", "The next Biennial should focus on establishing a central space for students to engage with the museum’s collection in an individual and group exhibition format. The exhibition should address “the history of art and how it is linked to contemporary life.” The next iteration of the exhibition will be organized as a “grand narrative,” the biennial’s artistic director, Rachida Kanwar, said. The museum will also draw from the work of contemporary artists to create a “new kind of art,” she said, referring to “the art of the present.”The exhibition will be staged in collaboration with a new group of curators, the “Titelaires du Monde: Parisians,” who are affiliated to the National Front party and have called for the dismantling of the institution. The group also wants the museum to organize a “classical ballet” and to add a “French Republic,” a pole-dancing show, and a “Basquiat” sculpture. The institution has since responded by saying that the “titelaires du Monde” will not be relocated to a museum in a planned expansion of the museum�", "The next Biennial should be held in 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has received a $50 million donation from the City of Los Angeles in support of its forthcoming triennial “Feminine,” which will include twenty-two works by fourteen artists, including the French avant-garde artist Marta Quintana, the Italian contemporary artist Paolo Baratta, and the Cuban artist Andrés Manuela. The gift, which was made in partnership with the Los Angeles County Museum of Art, comes on the heels of the city’s announcement that it will lead the construction of the new facility.Curated by Kristen and John Hamblin, the museum’s executive and artistic directors, the exhibition is being organized in collaboration with architect Vincent Dietz, who designed the original museum in 1966, and will take place in two phases: the first being a preliminary design review, followed by a public vote, in March 2021, and the second being a design for the museum, which will open in 2022, and will inaugurate the installation in March 2022.The $150 million renovation of the existing museum is being led by the city, which will construct a new twenty-foot-thick", "The next Biennial should be held in September 2021, the Art Newspaper reports.\n\n\nAn eight-by-nine-thick painting by Denis Frank, whose paintings were often inspired by his travels and his relationships with artists, is currently on display in the exhibition “The Art of ‘Alberto Burri’s’s’ Ambiente Xtra.” The work, titled Alberto Burri’s Ambiente Xtra (meaning “light” in Italian), was created in 1979 and first exhibited in the exhibition “Carmen Carrington: Ready or Not” at the Museum of Modern Art in New York in 1991. It is currently on view at the New Museum, New York; the National Gallery of Art, Washington, DC; the Museum of Modern Art, New York; and the Metropolitan Museum of Art, the Museum of Modern Art, the Museum of Modern Art and the Whitney Museum of American Art, the Whitney Museum of American Art, the Met, and the invitation-only Colloquium della Sera in Venice.In his June 21 letter to the exhibition’s curator of contemporary art, Frank wrote: “I have been concentrating on my paintings", "The next Biennial should be held in 2020. The museum will also continue to be supported financially by a monies licensed by the City of Chicago, which has allocated $9.75 million for the construction of the museum. Krasner’s sister, Mona Kunhardt, is leading a new group, the Krasner Foundation, which has pledged $5 million for the construction of the museum.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it is planning to open a new $200 million arts complex in the city next year. The visual arts center, which will be built on the former site of the old Alameda County Museum of Art (ACM) and will come with a new public gathering space and artist-owned studio, will be called the Museum of Contemporary Art (MoCA). The redevelopment of Los Angeles will mark the museum’s second project in the city, following the construction of the Museum of Modern Art in Pasadena.The redesign of the museum includes the installation of more than seven thousand images by artists and contemporary designers, as well as a rich collection of ancient and modern art, as well as the acquisition of works by artists such as David Salle, Hélio Oitic", "The next Biennial should take place in 2022 and could be the last, but it is not yet certain what the institution will do with the collection. The gallery, which relocated from London in 2007, plans to donate the remainder of the collection to the Tate and the British Library.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has appointed Suzanne Davis as its interim director of curatorial affairs. Davis joins the museum from the Los Angeles County Museum of Art (LACMA), which she has led since 2015. She succeeds Lillian Gish, who departed in the summer of 2019 to take up the post of chief curator.“I’m thrilled that Suzanne Davis has joined MoMA,” said Timothy C. Berry, director of the Metropolitan Museum of Art. “Her passion and expertise, combined with her extensive experience in art making, will ensure that the Met continues to thrive as a world-class art museum.”Prior to joining LACMA in 2016, Davis worked as a curator at the Museum of Contemporary Art (MCA), Los Angeles, where she curated “The New Museum of Modern Art,” an exhibition devoted to contemporary art and inspired by the landmark", "The next Biennial should take place at the Royal Academy of Arts in London in 2021.\n\n\nThe Museum of Contemporary Art (MoCA), Chicago, has appointed Kiki Smith as its next director. Smith comes to the institution from the Museum of Contemporary Art (MoCA) in New York, which she has led since 2016. She succeeds David Kordansky, who retired in 2017 after serving as MoCA’s interim director for seven years.“The institution is thrilled to welcome Kiki to its team,” said Laura DeAngelis, the chair of the board of trustees. “Kiki’s impressive record of innovation and vision for MoCA makes her the ideal leader for our team and our community. Kiki’s leadership, her ability to motivate, and her ability to bring people together are essential to our future success and future vision.”Smith’s first appointment as director was in 2017, when she increased the museum’s footprint in Chicago by more than twenty thousand square feet by more than eighteen thousand feet. In addition, she oversaw the establishment of the park, the Children’s Museum of Chicago, and the American Folk Art Museum. During her tenure, she also championed the creation of", "The next Biennial should be held in Atlanta, and the first South by Southwest, in March 2021. “The state of contemporary art and the biennial are so interwoven, and the themes so rich, that it is no wonder that the many artists who have successfully launched and succeeded from the same space have come to the United States to share their vision,” Bristol told Artforum. The project was established last September as part of a larger initiative with the Smithsonian American Art Museum to create an annual platform for the topic of African American art. Biennial projects have long been conceived as ways to address past racism. But the new platform, created in partnership with the Charlotte-Mecklenburg Art Museum, aims to redefine how a contemporary art biennial will be hosted. “The platforms will focus particularly on the African American experience through a conversation about the African diaspora and an open invitation to engage with the people who have lived, worked, and are living in the African diaspora,” said Elizabeth Truby, the biennial’s executive director, in a statement. While the conversation will be about African American art and the African diaspora, it will also examine contemporary art", "The next Biennial should mark the centenary of the founding of the Royal Academy of Arts in London. This year’s theme will be “Accords of Peace.” The biennial will focus on the history of visual art from the medieval to the present, and will run from March 23 to March 27.The show will bring together around seventy artists, including Maya Lin and Yoko Ono, in an attempt to bring together two themes that are rarely brought together: the history of photography and a contemporary search for meaning in art. Lin described the exhibition as “a way for the artists to understand how photography and the music we love can change not only the world, but how we relate to the world.”Lin told the Art Newspaper that the project initially started as a way to recognize Berlin’s tenacity to explore new ideas and shapes. “We wanted to honor and celebrate the tenacity of the artist to develop new work and to present a new vision.” In 2014, Berlin set up the Biennial of the Arts in one of his own residences in an attempt to raise funds for the museum. He also set up an endowment fund with a sum of $2.5 million to encourage the exhibition of", "The next Biennial should take place in 2020.”\n\n\nThe National Gallery of Canada is expanding its program of free exhibitions, which has been offered free since 1993, with new events that bring together under-recognized Indigenous artists. The new program, which is hosted at the gallery’s new headquarters in downtown Ottawa, will showcase the work of seventy-four artists, including Maureen A. Chang, Nargis Mamosy, Yukon Kim, and Aikila Mankar, and will begin with a new project, “Wiradjuri: A Awakening,” in 2020. The inaugural exhibition, titled “Wiradjuri: A New Beginning,” will feature work by forty artists who hail from seven Cree First Nations in southern Ontario, including Janicekant Mehta, Nita Timu, and Koki Taylor.The new program will be divided into three parts. First, “Wiradjuri: A Awakening,” will open in 2021 in partnership with the Ottawa Arts Council. The second part of the program, “Wiradjuri: A New Beginning,” will open in 2022. The third part, “Wiradjuri: A Bright Shining", "The next Biennial should be held in March 2021.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles announced today that it is restructuring its upcoming edition, “The Museum of Contemporary Art: From the Modernists to Now,” to take place in 2020. This will mark the twentieth anniversary of the museum. In celebration of the milestone milestone, which was established in 1965 by artist Charles and Paul Miebach, the institution will present a series of exhibitions in the month of March.“Charles Miebach and the MCA team are deeply honored to present this version of ‘The Museum of Contemporary Art,’” which offers a unique and ambitious reimagining of how art and architecture will interact as the planet warms and we become more integrated into it,” said David Bonderman, chair of the board of trustees and curator of modern and contemporary art. “Charles Miebach was a visionary and dedicated collector whose passion and ability to think beyond curating and create inspired many a museum director. When we began the museum in the group of architects and curators at the MCA, he was a valued member of the team and we will always have his love and support.”Since its inception, the", "The next Biennial should take place in 2021 and will showcase work of twenty-one artists, including Samer C. Ibrahim, Lujada M. Ijaz, and Qutub Qureshi, among others, in an effort to raise funds for the Universal Fund.\n\n\nThe City of New York announced today that Nicholas Negrete, a Bronx native and member of the 2013 group Porcupine’s first cohort, will receive a solo exhibition at Rockefeller Center in 2020. The artist was born and raised in the boroughs of New York and has lived in Manhattan his entire life. Currently based in Queens, Negrete is currently on sabbatical from the Bronx’s Museum of Art to pursue his own projects. In a statement, the institution said: “We are thrilled that Nicholas will return to the Bronx next year to participate in the third edition of Porcupine at Rockefeller Center. His thoughtful performance pieces, which explore themes of memory, memory politics, and memory narratives, are highly visible and well received in Manhattan.”Negrete’s work will be on display in an exhibition organized by the Manhattan artist’s son, Nicholas Negrete Jr., titled “Illusions: Stories from the Bronx,�", "The next Biennial should be held in October 2020 and will be inaugurated by a presentation of works by contemporary artists. The programme will be curated by Christopher Grant and will include the first exhibition of work by two African artists in the United States since 1943. The first of these works to emerge from the Biennial will be Lara, a series of photographs that features work by several artists, including Michael Kalsu and Emmanuel Osei. After a brief introduction of the theme of the exhibition, the Biennial will feature the works of nine artists. The first exhibition is Agnieszka Rimet (The Body and the Other), Dreamscape, 2018–19, curated by Gustavo Dudamel and moderated by Bob Montgomery. The first Art and Art History Show will be held on Monday, November 12, 2020 and will take place at Albright-Knox Art Gallery in New York, New York, from November 18–November 22, 2020.  The second Art and Art History Show will be held at the Museum of Fine Arts in Boston on November 18–November 21, 2020 and will follow two weeks later. The third Art and Art History Show will be held at the Museum of Fine Arts in", "The next Biennial should take place in 2021.The exhibition, which will feature work by more than 1,500 artists from fifty countries, will also host a special exhibition dedicated to Michelangelo Antonioni. The artist will be represented by his longtime partner Carmel Palladino. The first show will feature Avital Neslin’s work, designed for the show, at the gallery’s new space in the Kunsthalle Basel, which will be inaugurated on February 15. The exhibition will also be moved to the Museum Victoria, Melbourne, and will be open for a limited time only.\n\n\nOn Friday, the US House of Representatives voted to approve a $854 billion federal stimulus package for the US economy. The $800 billion package—which will be voted on by the Senate on Monday—is the largest aid package since the Great Recession ended nearly seven years ago. The legislation, which will also provide $267 billion for the arts and $123 billion for the poor, and will be voted on by the president on Tuesday.The bill—which is collectively referred to as the American Reinvestment and Recovery Act, or RA—is a combination of three pieces: the American Jobs Creation and Reinvestment Act", "The next Biennial should take place in the city in 2022. However, the date has yet to be set for the exhibition, which will include work by 120 international artists.<|endoftext|>Abstract\n\nIntroduction\n\nMariana Kohn-Bourgon, an assistant professor of art history at the University of Denver, has been nominated for a MacArthur Grant for her work The Painted Tree, 2019, which is a study of the Painted Tree, a 100-year-old Spanish colonialist monument in the city of Almendras, in the Santa Fe Mountains, in New Mexico. For the project, Kohn-Bourgon gathered materials from the Painted Tree to create a work that represents the visionary possibilities of painting in the twenty-first century. In the process, she also created a larger vision of the Painted Tree as a site where white Western artists can reflect on their own histories and the history of painting within their own country. Kohn-Bourgon’s work is on view at the Center for Art and Culture in Mexico City until December 18.In this article we will examine how the Painted Tree has become a symbol of Mexican creativity, how Kohn-Bourgon, through her direct intervention, has transformed the", "The next Biennial should be held in 2025. The Art Newspaper reports that Deputy Director Anna Basso, who was appointed to the board in 2016 after Andrea Cimino was fired, called the new institution the “right-hand man” of the international art community.Cimino’s departure triggered a number of changes at the museum, including the relocation of the collection to the Palazzo Iuzzani in Venice, where it remained for nearly a decade, and the opening of the museum’s first exhibition, a seventy-five-foot-long room that displays earlier works by the artist-in-residence, Andrea Pirlo. Cimino’s contribution to the museum’s collection and exhibition calendar has been chronicled by Jean-François Leveille, who curated the exhibition “Tarkovka” (2017) with Cimino and Philippe Starck. Starck curated a retrospective of work by the Italian artist Roberto Castello in 2016, as well as “The Purple And Blue: The Essential Biennial of Galerie Sittard” (2016) and “The Gaze Of The Moon: Robert Mapplethorpe”"]