["The next Biennial should focus on identifying the current state and future of the central and northern half of the city and, with a view to the surrounding area, on the future of the area as an amazing multi-cultural hub. The aim is to present the exhibition in the best possible way and to explore the concepts of 'city as well as a city.”\n\n\nThe National Geographic Society (NGS) in Washington, DC, has announced that it plans to move the ninety-four-year-old Louis Sullivan Pavilion, which has served as the landmark site for the National Geographic Society’s annual Future Islands series, from New York’s Central Park to the Smithsonian American Art Museum. The institution also announced that it will rearrange the building’s outdoor spaces in an attempt to create a more cohesive visitor experience. The redesign aims to encourage more spending and greater social interaction at the museum by streamlining the galleries, adding more rooms for educational programs, and creating greater visibility to the National Geographic Society’s headquarters on the third floor.The redesign is the result of a multi-year campaign led by artist-activists Daniel Kander and Amanda Lee. Kander and Lee collaborated with architect Daniel Birnbaum to create a site-", "The next Biennial should be held in the spring of 2020.\n\n\n\n\n\n\nSara Zebo and Sergei Chemezev, the founders of the Zebo-Chemezev-Goldin (ZGC) gallery in New York, are suing the Louvre in New York City. The suit alleges that the institution breached its contract with the pair by moving the exhibition “Beyond the Frame” (2016), a triennial that includes works by artists such as Tobias Madison, Luca Pica, and Nari Ward, and has also accused the institution of violating the artists’ severance agreements.Also named in the suit are the artist’s agents and the artists’ representatives, and are seeking hundreds of thousands of dollars in punitive damages. The current iteration of the exhibition, which is still scheduled to run August 4–August 6, will reportedly feature work by fifteen contemporary artists from the biennial’s catalogue, including Tarek Atoui, Mariane Boudwish, Lisette Brouwers, Barbara Black, and Ponty Delf, as well as original works and works from the last forty years.“The suit stems from the Louvre’s rescheduling", "The next Biennial should be held in 2020 and it should be located in the city of Biagio, a small town near the city of Florence. The institution, which is housed in an old two-and-a-half-thousand-car garage in the capital, is currently undergoing a €100 million renovation that will include the construction of a new exhibition space and the reconfiguration of the museum in order to ensure a more organic and immersive experience.The next edition will focus on the work of Italian painter-designer Paolo Barbera and will be organized as follows:1. From Landscape to Architecture: How Barozzi and Hooper Contributed to Architecture of the Floating World,1926–19352. From Architecture to Landscape: The Two Barozzi Quartets, 1931–19543. From Landscape to Landscape: The Noguchi Quartets, 1949–19634. From Landscape to Landscape: The Robert Rauschenberg Quartets, 1958–19635. From Art to Art: The Barozzi Family, 1967–19746. From Art to Art: A Comparison of Picasso and Zeppelin, 1958–19637. From Art to Art: The Art of Baro", "The next Biennial should take place in 2021 and is expected to be held at the Paris-Haut-de-Seine. “This year’s experience Biennials brings to the city of New York is a strong asset,” said David Ha, president of the biennial’s board of trustees. The institution is currently working through a revamp of the museum that will include construction of new galleries, classrooms, a café, a restaurant, and more spaces for the public to come together. The work is being led by architect-collector Mario Tepper and will be inaugurated by a new series of lectures, a symposium, a panel discussion, and a public sculpture garden.\n\n\nAs more than six hundred American and international artists converged on New York City last week to protest police violence, the focus of the protests has shifted from the killing of Mike Brown and Eric Garner to the political system and racism in America. The campaign has been spearheaded by the artists themselves, who are collaborating in solidarity with other activists to draw attention to a range of social issues, from police brutality to climate justice to immigration and austerity.Organizers of the January 28 and 29 events, organized as the #BlackLivesMatter movement,", "The next Biennial should be held at the Haus der Kunst, Munich, in March 2020.The Fair de France will take place at the Hotel de Ville de Lyon in France in March 2021, and the Festival of Arts will be held in the Swiss Alps in March 2022.\n\n\nAmerican Ballet Theater conductor Peter Sellars has died at age fifty-eight at his home in New York following a yearlong battle with cancer, Variety reports.A prolific writer, the composer, who began his career in New York but shifted to Paris in the early 1960s, earned a reputation as one of the world's most influential twentieth-century composers through his portrayal of the complexity of human experience. In his own words, the work of a \"lithograph’s muses are in harmony with the universe.”Born in New York City in 1938, Sellars graduated from the city’s prestigious Cooper Union with a degree in music in 1962. He began his career as a baritone in a band in New York’s Greenwich Village in 1965, but shifted to Paris in the late ’60s and soon took up residence in the Louvre. He began his work in the Fantôme Albert in 1971, the De", "The next Biennial should be held in 2020. (Full disclosure: I am a member of the committee that selected the site for the exhibition.) The Biennial will also return to New York in 2021.  After the show is closed, the Biennial’s executive director, Agustín Arteaga, will serve as a guest lecturer at Columbia University in New York.\n\n\nThe Pennsylvania Academy of the Fine Arts (PAFA) in Philadelphia is encouraging artists and arts professionals to create new ways to benefit from the expulsions of forced migrants, refugees, and other immigrants. “While the PAFA has a long history of championing creative practice internationally, in recent years our programs have focused more especially on building relationships between local communities and institutions,” said John Carri, the museum’s board chair. “We believe that creative practice is the vehicle for the spread of ideas and knowledge, and that the most effective way to help shape and expand the public understanding of art is to help artists and their creative practices think about and develop new ways to think about their craft and their craft works.”The institution is also urging arts professionals to consider creating new work in support of immigrants. “The PAFA", "The next Biennial should be held in 2021 and will follow the same format as the current one, with the exception that the site will be relocated and a new exhibition curated by curator Mehdi Sarrar. The event will also include a new program of lectures, workshops and other programming. The Biennial will be hosted in the basement of the new ICA Berlin building, which will rise on the ground floor of the existing museum, and will open in the autumn of 2021. The new location for the exhibition and the biennial will be a mix of existing and new exhibitions, installation, educational activities and events. The ICA Berlin has also commissioned the artists to create new works for the event. Through a series of interviews and videos, the artists will present their experiences from the exhibition, which will be hosted at the ICA Berlin until February 22, 2022, and will feature work by several hundred artists from across the globe.The exhibition will feature work from seventy-five artists who are participating in the exhibition, including Richard Alpert, William Eggleston, Oskar Eustis, Tarek Atoui, Adam Pendleton, Mihai Pirodkar, Faisal el-Khoury, Evelyn Pope,", "The next Biennial should be held between March and June. The first Biennial was held in 2010 and the second was held in 2012. In addition to the usual exhibitions, the first Biennial included a 'First Steps' exhibition that was open from January 25 to February 28; a “Big Picture” exhibition that presented work by artists such as Damien Hirst, Toni Morrison, and Sofia Coppola; and a “Longing for a Home that Remains” exhibition that was organized by the French collector Nicolas Sarkozy.\n\n\nThe Museum of Modern Art (MoMA) in New York has announced that it is nearing completion on a $350 million renovation to its glass-enclosed Edward Hopper–designed building, which opened in 1921 and is one of the most recognizable symbols of the institution’s collection, that will include the museum’s first-ever two-car garage. The museum’s current design calls for a typical glass fronted building, but the institution plans to tap the urban landscape of the Museum Row across the street to create a new, glass-enclosed visitor experience.“The glass-enclosed museum is a timeless and defining element of MoMA,” said museum director", "The next Biennial should be held in 2021, and the twenty-fifth iteration will be held in 2022.A statement from the Biennial said that the early planning of the event was influenced by the current political situation and that the exhibition would be held in stages. The exhibition will involve the exhibition of new work by artists from the entire region, with a view to reflecting the urban landscape. The Biennial Foundation will assume responsibility for the construction of the exhibition venue.The seventeen-thousand-square-foot exhibition will be inaugurated by the artist Marina Pascual—a pioneering artist whose work explores notions of community, migration, and the body—in the United States. The artist will present her first solo exhibition at the Biennial in Vienna in 2020. Her works will also be included in the London development Biennial, which will open in 2022, and will be included in the fifty-ninth edition of the Warsaw Biennial, which will open in 2024.“In my practice, I have always been interested in the visual arts,” Pascual said. “This was especially the case in the late 1980s, when I first began to experiment with new kinds of installations. In the early 2000s, as a curator in the department", "The next Biennial should focus on new international approaches and new conceptualizations of architecture, with a particular focus on the history of the art and architecture in the Americas and Europe, and be held in the Americas. In the coming years, the Biennial will aim to introduce new concepts and concepts with the aim of developing the art of the twentieth century.”\n\nThe Museum of Contemporary Art (MoCA) has set a new global goal for its annual retrospective—launched in February 2019—which it says will “strengthen our relationship with the artists we admire.” According to the New York Times, the new initiative aims to foster an “abstraction-free,” “unfettered,” and “inclusive” artistic dialogue between the United States and Mexico. The exhibition will take up themes of the relationship between artists and their communities, the role of the artist in shaping public policy, and the relationship between Mexico and the United States.“Together, we will be able to move beyond the biennial to the future,” said Mary Anne Carter, director of MoCA. “The new partnership’s signature project will focus on how we as a society—and as a country", "The next Biennial should be held in 2021.  Afterward, a new exhibition of works by the Artist-in-Residence, selected from the biennial’s guest list, will open until February 22, 2022. The twenty-fifth Biennial will be convened in 2022.\n\n\nThe 2015 Museum of Contemporary Art (MoCA) in New York has announced that it is planning to close its doors to the public in the spring of 2021. The museum was forced to postpone the opening of its new space, “Tucson & Arizona,” in the city of Tucson until December 2021 due to the Covid-19 pandemic. During its construction, it also had to relocate the exhibitions and a number of special projects, including its first-ever solo exhibitions by the artist-in-residence, the American sculptor David Salle, and the curator and educator Nancy Stein.The gallery formerly known as the State Theater, which also houses the Museum of Modern Art, was founded in 1956 by the artists who would later become the first trio of co-owners of the Chicago-based studio of artist-in-residence Edward Brennan, Carrie Mae Weems, and Kathy Ault. In 1981, the eight artists who", "The next Biennial should be ready in March 2021. In the meantime, the museum is working on a new exhibition dedicated to the African diaspora and is in the process of developing new programming to highlight the artists and their work.\n\n\nFresh Paintings For The Museums. London: Rhodes Gallery and Tate (RGH) and Tate Modern (TMT) announced today that they are teaming up to create the largest number of works for the museum to-date, bringing together thirty artists from twenty-four countries. The partnership, dubbed the MUSE’s Rhodes for the Future, will offer some twenty thousand works by twenty artists in forty years.“This is an unprecedented year for museums, and for the field as a whole, with the coronavirus pandemic and the Brexit vote,” said David Nell, director of the Tate. “The announcement of this partnership is a great moment for museums, as we work together in an effort to secure the best possible futures for our artists and our collection, and to create impactful and symbolic exhibitions that tell the future and the past in photographs. The partnership with RGH and TMT’s artists is an unprecedented opportunity to connect", "The next Biennial should take place at the Museum of Modern Art, where the audience will be able to witness the first performance of the new project by the Albright-Knox Art Museum in Buffalo, New York, and at the Metropolitan Museum of Art in New York. The new exhibition “The Future Is Present: Contemporary Art from the Midwest” will open on January 22 and will be open from January 24 to February 28.\n\n\nThe Museum of Fine Arts (MoFA) in Boston has launched the careers of three new curators: leila anwar, clare lee, and jason mitts. In their first solo exhibitions, “The President’s Body and Other Stories: Painting the Donald’s Head in a Nutshell” (2019), “The Artist as Narrator: Painting the Body” (2019) and “Beyond David Adjay: A Story of Art” (2019), the curators present a diverse range of work that tackles intimate narratives in painting and sculpture, drawing from their own practices and those of contemporaries. In a general assessment of contemporary art, the show concludes: “Towards a better, more just, and more tolerant world.”", "The next Biennial should be held at the Palazzo di Beppo (Italy) in April 2020. The theme “The Work of Art in the Contagious and Second World Wars” will be based on the work of the late Italian artist Gio Ponti, a cofounder of the eponymous Italian collective the Ceremonial Angels, and will examine “the art of memory, the work of memory, the art of re-creation, the process of memory, and the concept of memory.” The full list of participating artists is as follows:Abraham KoonsAbbey AlpertAbbey Alpert GalleryAbbey Alpert FoundationAbbey Alpert Foundation (Spain)Abbey Alpert Foundation (Australia)Abbey Alpert Foundation (Brussels)Abbey Alpert Foundation (London)Abbey Alpert Foundation (London)Abbey Alpert Foundation (New York)Abbey Alpert Foundation (New York)Abbey Alpert Foundation (New York)Abbey Alpert Foundation (New York)Abbey Alpert Foundation (New York)Abbey Alpert Foundation (New York) Abbey Alpert Foundation (New York) Abbey Alpert Foundation (New York) Abbey", "The next Biennial should take place in the summer of 2022.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Deborah Jay Wilkins as its new associate director of contemporary art. She will be responsible for guiding and promoting the curatorial leadership of the institution, which hosts nearly three hundred exhibitions annually.“At this critical juncture in our country’s history, it’s imperative that MoCA remain a center for creativity and experimentation in art and design,” said Mike Lieberman, MoCA’s executive director. “In fact, it’s the only museum in America that has a permanent collection of the artist’s work. As we continue to transform our campus and our community through a reimagined campus, through a reimagined collection, and through a reimagined community, we hope that Deborah will play a crucial role in cultivating the museum’s future vision and ensuring a future for our curatorial team.”Jay Wilkins joins the institution from the Los Angeles County Museum of Art (LACMA) where she has served as deputy director for the past six years. At LACMA, she helped organize the museum’s reopening in April and helped", "The next Biennial should be held in the Spring of 2020. Rikard Hausmann, chair of the curatorial department at the prestigious Art Basel, said the institution had already been working on a new collection for the series, which has been taking place on the grounds of the Hausmann Art Museum since 2000, since 2013, and is now planning to move its events into the new building.The museum said the new building will be completed by the end of 2020 and will include fourteen new exhibitions and twelve new programs. The museum will host two additional exhibitions per year that will be based on the works of the artists whose works are featured in the exhibition. The 2019 and 2020 editions of the series, held at the museum, respectively, featured works by various artists including Alexey Kotsenko, Aruwai Genda, Ekaterina Iarok, Mark-Paul Meeg, Panayiotis Petropoulos, Jinny Potts, and Kirsten Teitelbaum.For the 2020 theme, the museum will use a combination of the work of artists such as Alexander Calder, Claudia Cattani, Gianfranz Farina, and", "The next Biennial should focus on the way in which art history is experienced as a universal language that can be understood and understood by anyone. Art history can be a universal language, but art history is also an instrument. The instrument must be made accessible to everyone. It must be made accessible to anyone who wants to hear it—to touch it, to see it, to hear it, to imagine it, to be it.”In a letter to the organizers of the biennial published by Artforum in 2002, Harrison wrote that the new program would be “designed to be an extension of the work of those who have lived their lives in service to and as part of each other’s lives.” In addition to presenting the work of artists whose work is currently under copyright, the Biennial will include readings, discussions, and tours that bring together the collection at large and will create new opportunities for artists to work in collaboration with other Artworld/Berlin-based organizations.“We are very much looking forward to the exhibition of this year’s exhibition, which will mark the centenary of the first exhibition at Berlin’s Staatsgalerie,” Harrison said.\n\n\nArt © Dusan Tadej", "The next Biennial should take place in 2021. The next MFA in Los Angeles will be staged in 2022. The next Museum of Contemporary Art (MCA) in New York City will be staged in 2023. And this year’s edition of the Venice Architecture Biennale, which will be hosted by an entirely different venue in the city next April, will take place in Helsinki in 2021. The list of participating artists is as follows:ArtistsPace 1: The Ellsworth Pollock ProjectArtistsPace 2: Zoë Edward JohnstonArtistsPace 3: Lionel Araya-FernandezArtistsPace 4: Dario Cattelan, Bartók Etheridge, and Hiroshima.artistsPace 5: Suellen González, László Nemtsov, and Günther von BraunPace 6: Harold O. WilsonPace 7: Thomas J. PriceArtistsPace 8: Theodoros PapaniciusPapanicius9:  Rory MulliganPapanicius10: Zoë NesvignesPapanicius", "The next Biennial should be held in December 2020. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has released its 2020-21 season, titled The City of Brazil, in support of the ongoing work of artists. The documentary filmmaker examines the ins and outs of the city, and the economic, social, and political conditions that made it such a popular setting for artists to work.Ahead of the exhibition, CAMERA spoke with Yun-Wei Huang, an independent curator based in Los Angeles who has worked with Biennial staff members for more than a decade and who is currently the executive director of the Metropolitan Museum of Art in New York, about their work. From 2001 to 2014, Huang served as a contributing editor to the March issue of Artforum.com. He has also written for publications such as Artforum, Artnet, and Artforum: Volume 17. His new book, Art in Action: Social and Political Art in the Late 1980s (Yale University Press), was published this month by the Yale University Press.Kamil Laursen and Gerhard Richter have been commissioned to create The Floating Berlin Architecture of Life (Yale University Press) for the exhibition, which", "The next Biennial should be held in September 2019. The Glasgow Biennial (2019) is currently on hiatus while the National Museum of Scotland (2019) and the Scottish National Gallery (2019) are both restored. The National Galleries of Scotland will present the first exhibition dedicated to the life and work of Queen Victoria at the Royal Albert Hall in London in March 2020. The National Gallery of Australia is working on a new era-rounding exhibition featuring work by twenty-one new artists. In a letter to the public, the museum said that the new theme will be “A Retrospective of Visuality,” reflecting the Commonwealth Art Galleries’ desire to celebrate the legacy of Victoria, an act of independence from the United Kingdom. The move comes amid the presidential campaign, during which Donald Trump campaigned on a promise to pull the United States from the agreement, and his administration’s transition to the Republican Party, which has promised to tear up the Paris Agreement and launch trade wars against China and Mexico. The change in theme comes at a delicate time for the climate, with most of the world now locked in a catastrophic global climate emergency due to climate change.According to the International Council on the Preservation of Victoria, the change in theme", "The next Biennial should be released in 2020.\n\n\nThe California Museum of Art (CMA) in California, which celebrated its sixtieth anniversary this year with an exhibition dedicated to the late Japanese director Akira Kurosawa, has announced that it is bringing Koki Maeda and Hideki Hasegawa to the CMA for a new retrospective. The show, titled “Koki Maeda: The Eternal Specter,” will run from March 22 to March 28.Treasured works by the late Japanese director Akira Kurosawa, currently on display in the museum’s permanent collection gallery, will be featured in the exhibition. The curatorial team will attempt to use the works’ interconnectivity with contemporary issues to explore the relationship between artists and the cultural landscape and the relationship between Kurosawa and his work. The curators will also attempt to understand how a man whose style was rooted in myth, Western art, and the modernist movement in Japanese art, and whose legacy was immensely influential in the shaping of the CMA’s collection.“Koki Maeda: The Eternal Specter” will feature contributions from artists such as Hideki Hasegawa, Aoki Akira, and Yasuhiro", "The next Biennial should take place in the spring of 2021. In a statement, the Institute for Contemporary Art (ICA) said: “The new chapter of the Biennial will be a joint project between Europe and the US, with a view to the theme of our next event: ‘In Praise of Evil.’ We are thrilled to participate in the exciting exhibition, ‘Biennial: Time and Space,’ which will take place in the form of a combination show with a selection of works from the Institute’s collection. The selected works will be presented in a combination of experimental and conventional ways.”\n\n\nThe museum’s staff and supporters have launched a petition in support of a new arts center in the city of Buenos Aires. The signatories call for the establishment of an artist’s residency in the city. The petition reads: “Argentina has the potential to become the next Venice, or at least, to become the most important curator-driven city in the world.”The petition asks the city to invest $25 million into the city’s arts and culture, and $100 million in the region, and to create a new arts center that", "The next Biennial should take place in 2022. Commenting on the upcoming iteration, the event’s artistic director, Khaled al-Asiri, said that it will not be “the final word” in the series, but will continue to explore issues of 'immortality, politics, and the difficulties of the body through various mediums.”\n\n\nThe British Film Institute (BFI) in London has appointed Kaya Scudder as its new chief executive officer and director. Scudder comes to the BFI from the London-based production company Paradise Garage, which she was involved in for over a decade as a vice chair. She will assume her new role on October 2.“Kaya’s leadership and vision for the BFI is internationally important and will enable us to continue to provide a platform for the highest quality British films at a fantastic value,” said BFI director Maria Balshaw. “Kaya’s arrival marks an exciting and challenging time for the film industry. She is a leading member of the BFI’s curatorial team and has built her career around the merging of filmmaking and visual art, which has served as the basis for her engaging and poignant work.”", "The next Biennial should be held in 2022 and “should include a reflection on what is different between the city and the city’s surroundings, and how these differences affect our lives and the way we see the world.”\n\n\nThe Detroit Institute of Arts (DIA) announced today that Jacquelynne Durbin has been appointed as its next president. DIA’s board of trustees added that the fifty-three-year-old artist was chosen for her “unique vision, enthusiasm, and ability to connect with and shape the DIA’s community.”Durbin will officially take up the role in January 2020. She succeeds Nicole Behar, who has served as the institute’s president and CEO since 2013.“Jacquelynne understands the challenges and demands of running an institution of such stature and stature’s long-term growth, and along with the leadership team, she has the potential to further the DIA’s mission of connecting people and cultures,” said board president Mark H. McGhee. “Her leadership style, authenticity, and ability to bring people together have been instrumental in the DIA’s transformation from a community college to a state", "The next Biennial should be held in 2020. “This is an exciting time for art and the wider community to consider the immense legacy of the Brazilian painter and sculptor João de Freitas,” Daniela Pessoa, director of the Guarani Museum, wrote in a statement. “Had de Freitas’s work been made accessible to the general public and had it been exhibited in a timely fashion, we could have enjoyed his physical presence, his warmth, and his wisdom. I am proud to have been involved in the Biennial and to have been part of his remarkable life.”\n\n\nTwo artworks owned by the Koch brothers, Charles and David, have been restored to their family by the San Francisco Museum of Modern Art (SFMoMA), which was forced to pull the two works, a pair of Edward Hopper–designed studio apartments, from the museum after the owners raised concerns about their safety. The Marcos and Diego Preciado, which were acquired by the museum in 2014, were featured in “Edward Hopper: The Art of Painting” (2018), a presentation of the artist’s artworks that was curated by David Winton, the director of the Davis Museum of Art in", "The next Biennial should be in 2020, the Museum’s current incarnation is currently undergoing a major renovation, and the first exhibition will be up in the fall of 2021. \n\n\nCiting the museum’s longstanding commitment to diversity, the Whitney Museum of American Art in New York announced on Wednesday that it will increase the representation of African American, Asian, and Native American artists in its collection by twenty-six percent. The announcement comes amid an ongoing campaign against institutional racism and police violence, led by activists, politicians, academics, and artists, and coincides with Black History Month.“Cultural appropriation is a form of violence that erodes anti-blackness, and cultural appropriation perpetuates the violence against Black people,” said Rachel Schneider, executive director of the Whitney Museum of American Art. “This is a very challenging topic for artists to confront and one that requires an expansive and inclusive view of the world. We are grateful for the dedicated, dedicated scholars, artists, activists, and other cultural workers who are working to educate the world about the intersections of race, art, and culture, and to challenge cultural appropriation as a form of violence against Black people.”The announcement follows a legal challenge by a group of artists,", "The next Biennial should be held in 2020.\n\n\nThe Museum of Contemporary Art (MoCA) is planning to shutter its doors permanently in March 2020, citing revenue losses related to the ongoing global health crisis. The announcement follows reports that the gallery has incurred losses of $4.5 million in the first three months of the year and expects a $1.3 million loss in the fourth quarter.Following consultation with MoCA’s board of directors, board chairman Larry Gagosian and curator David Kordansky, the museum decided to suspend operations through March 25, 2020, and re-open in May. The announcement coincides with the opening of “Avatar: The Last Airbender”—the fifteenth exhibition in the multiyear, eight-day-long celebration. “We are acutely aware of the precarious situation many art institutions are in, and our board members have spoken openly about this for months, emphasizing the importance of community engagement and giving advice to artists as they navigate this difficult period,” Gagosian and Kordansky said in a statement. “The board took note of their advice and took immediate action, consulting with the curators and the board to understand their thinking and to provide additional insight on how art", "The next Biennial should take place in 2021.\n\nThe City of New York announced on Monday that it is raising the funds for the construction of the $1 billion Modern Art Museum (MA) in Chelsea. The project, which was originally supposed to begin construction in the fall of 2019, has been dogged by delays since the museum was founded in 2015.In a letter to visitors, Mayor Bill de Blasio said: “This is an incredible undertaking, requiring both the strength and vision of millions of people. But it is achievable. We have an opening date that is within our budget and within our schedule. We have the funds to construct the museum as quickly as we can, with the funds to create the museum as we have envisioned the museum to be built—with the funds to make it possible for everyone to have a sense of place in the museum, to have their voices heard.”The project, which also includes the building of two new public spaces in Chelsea and the renovation of the former site of the Greek Theatre, will be funded with $1.2 billion in bonds issued by the city’s economic development authority, which was created to oversee the renovation of waterfront properties in the city. The bonds, which have a ten-year maturity,", "The next Biennial should be held at least six months after the November 2020 general election. \n\nThe Contemporary Art Museum Hamburg (DBK) has received a gift of fifty-seven works by the artist Leonor Antunes in its collection. The work, titled Leonor Antunes: Art of Art, exhibits fifty-seven works by the artist, who is known to history for her abstract paintings, which range from the surreal to the metaphysical.“The work is a unique departure for Antunes, who has been primarily a painter in the past, and is a synthesis of her own practice and aesthetic development,” said manager Joachim Neumann. The collection also includes works by the Brazilian artist Claudia Aparicio, and the Romanian artist Andrée Chedid, who were among the works acquired by collector Dieter Graf before they died. “We are extremely pleased to welcome these works back to the collection, if only to see how they will look in a new light,” Neumann said. The works were originally on exhibition until 2016, when they were moved to the museum’s collection. The works were on display until the fall of 2016, when they were transferred", "The next Biennial should take place in 2022 and the inaugural in 2020. The exhibition will cover a variety of artistic and intellectual topics such as the existence of images in the visual arts and their relationship to art, the anthropological and aesthetic history of art, the role of art in our everyday lives, the extent of the visual arts, and the evident links between visual arts and the biennial. ART Biennial will be curated by Hiromi Iwasaki and Hiroki Youzawa. The program will also be organized by the Japanese artist.• The fiveteenth annual BICYLL Expand-Up will take place in Manhattan on October 24–28. The event is designed to present a wide-ranging, interdisciplinary exploration of the idea of expanding the potential of the body through art, music, and dance. The event will feature over forty contemporary artists, including Koki Tanaka, Mark di Suvero, Joëlle Adam, Tanya Gavrilova, and Noelle Hauser. It will also include a special exhibition dedicated to the art of collaboration.“We invite you to celebrate the fifty-seventh anniversary of the BICYLL with a celebration", "The next Biennial should be in 2020. The next Dangdai Biennial should be in 2021. The next Hoya Biennial should be in 2022. The next Art Basel Hong Kong should be in 2021. The next Artforum Hong Kong should be in 2021. The next Artforum São Paulo should be in 2021. The next Artforum Istanbul should be in 2021. The next Artforum Tallinn Art Festival should be in 2021. The next Artforum Nantes should be in 2022.\n\n\nThe National Gallery of Art (NGA) in Washington, DC, has announced that it is reopening to the public next week following a $25 million expansion designed to enhance the museum’s accessibility and enhance the NGA’s collection by adding more than 2,500 works by contemporary artists. The reopening is slated to begin on Thursday, March 22, and will run through April 26. The reopening coincides with the thirteenth edition of the National Museum Biennale, which will be held at the NGA from March 21–March 29. The event will also include a collection opening on May 2, and will feature more than 500 works by forty-seven artists.", "The next Biennial should be held in 2022.\n\n\nThe Museum of Contemporary Art (MoCA), California, has released a statement about the collapse of the proposed fifth edition of the Venice Biennale, which was set to take place in February 2022. The museum’s longtime chairman, Evelyn Rothschild, stepped down from the helm of the institution in February after she found herself embroiled in a controversy over a proposed redesign of the museum’s Grand Canal Pavilion. While the pavilion was being redesigned, Rothschild was embroiled in a legal fight with the Bay Area’s Department of Public Works over a $1.5 billion renovation of the former Pacific Electric station in downtown Oakland.The announcement of the redesigns was made after a three-month review, which concluded that the pavilion should be redesigned as an extension of the museum, which will expand to more than 1,500 square feet, to the east of the existing museum, and the pavilion should be redesigned to extend the museum’s footprint, taking advantage of the city’s expansion of the Embarcadero. The museum will also create a new 250,000-square-foot wing of the museum that will serve as a research center and", "The next Biennial should be held at the Museum of the Modern Art in New York in the spring of 2021.\n\n\nThe Zepp Museum of Art in New York has announced its representation of the Italian artist and essayist Lucio Fontana. Fontana’s works are often characterized by a philosophical and political bent, and are often compared to Marx’s concepts of the general and the particular, the surreal and the transcendent, and the sublime and the mundane.Born in Capodimonte, in Turin, Italy, in 1936, Fontana moved to Rome in 1943, where he studied at the Institute of Modern Art before he enrolled in the Art School in Turin in 1948. He enrolled in the School of Art and Design in Rome in 1949, where he studied under Giacomo Lippi. Fontana also did his master’s thesis at the School of Art and Design in 1949, and his first book, The Future Is Present, was published in 1975. In the same year, the Italian author Rimini Pavoli, who had attended the school of Art and Design in Rome, wrote an essay for Artforum about Fontana’s aesthetic. The work's influence continues into the contemporary art world. In an essay", "The next Biennial should address the belief among many in the art world that the practice is on the decline, and that the number of visitors will continue to decline as the work of the poet and playwright enters the nineteenth century. The theme of the next edition should be “Creative Destruction.” The event should also include the exploration of the historical roots of modernism and its relationship to ecological catastrophe.“We are deeply concerned by the circumscribed and subtle way in which the debate over the future of art has been conducted throughout the years,” said Arne Glimcher, president of the European Cultural Foundation and chair of the European Commission. “This new generation of European cultural figures must be given a platform to present their vision of the future. . . . The future belongs to the citizens of the European Union. We are ready to act in solidarity with their voices.”\n\n\nUri Mendelblit, the Israeli-born, Canada-based curator, artist, and educator, has died at age ninety-two at his home in Jerusalem. He is survived by his son, Ari. In 2014, the Los Angeles Times reported that a final exhibition of his work, “Mendelblit: Selected", "The next Biennial should take place in the spring of 2021, with the exhibition marking the first time that the Japanese artist Ai Aiwa has staged a retrospective in Tokyo. Hideaki Takahashi will assist the Biennial in the documentary department. The biennial will move to the Noguchi Museum in Osaka in 2020.\n\n\nThe museum’s newest acquisition, a collection of seventy artworks from the artist’s Dadaist-inflected manifesto The Imperative, now closed. The exhibition, titled “The Future Is Present,” and was curated by Alysona Andrea Burga, an associate professor of art history at the University of California, Los Angeles. The work, which is on display in an exhibition that will open at the museum next month, commemorates the seventy-fifth anniversary of the publication of a manifesto, “The Future Is Dada,” that outlined a vision of a future in which art and philosophy would remain connected through the work of human collaborators, as illustrated in images that include Marcel Proust’s The Future Is Present (2015), Simone Leigh’s The Butcher (2018), and Paul Gauguin’s The Death of the Body,” which was also shown", "The next Biennial should focus on how the museum’s collection and exhibition-making practices are reflecting and responding to the changing cultural landscape. The exhibition should also consider how the museum is preparing for a changing museum environment and how artworks and exhibitions will be presented. It should reflect the current needs of the museum and reflect the priorities of the organization.”The next edition will take place in the museum’s new buildings, which are being designed by the architects MCH Group and GK Group, in the city of Rotterdam. Titled “On the Edge of Tomorrow: Contemporary Art in the Arab World,” the exhibition will feature works by twenty-four artists, including Hisham al-Shaykh, Adam Koutsouk, Ashraf Ismail, Nima Nabavi, and Wanadoo Haidara.The Biennial is curated by Kader Attia, the CEO and director of the Abu Dhabi-based Abu Dhabi Museum of Art, and will run from March 6 to March 9. The exhibition will focus on the history of Egyptian art and international art through a combination of interviews, digitization, and archiving and will run concurrently with the biennial’s fifty-fifth edition, “", "The next Biennial should be held at Bayard Rustin’s new home in the Arts & Culture Complex in Boston, which is being constructed by the same team as the former Armory. The exhibition will unveil a selection of new works by twenty artists and will feature the work of eighty-three. It will be organized in collaboration with the Smithsonian American Art Museum in Washington, DC, and will open in 2020. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles and the California Institute of Technology (Caltech) announced today that they have reached an agreement to collaborate in the city of Los Angeles. The partnership between the two institutions will combine the museum’s current collection with that of former CEO and chair of the museum, John Akomfrah.“This unprecedented partnership marks a turning point in the museum’s history, as it becomes the first institution in the United States to offer free, publicly accessible, online exhibitions directly to the public in collaboration with two of the world’s leading digital artists, Ai Weiwei and Richard Feynman,” said Richard Levy, chair of the museums’ board of trustees. “This is an historic day for the arts and technology communities. The MoCA", "The next Biennial should have been held in June, but was postponed due to the Covid-19 crisis. It is currently slated for completion in July. The Festival will be held in Hong Kong, Beijing, Shanghai, Shenzhen, and São Paulo from March 21 to March 24, 2020.\n\n\nThe London-based arts organization the Royal Academy of Arts (RA) has received a $10 million donation from the Museum of Fine Arts (MA) in London and the Royal Shakespeare Company (RSC). The funding will create the impetus for RSC to invest $25 million in the institution, which is currently undergoing a $100 million expansion that will include the development of a new building to house the collection of Laure Adams, the chief curator of modern and contemporary art at the RSC and the author of The Art of Accomplishing: Contemporary Art from the Eighteenth Century to the Present (2019).The RA’s new headquarters will be located on the ground floor of the museum, which is currently being redeveloped by the Henry VII Society and the Tate. The organization will designate the area as a “place of permanent collection.” The new building will be designed by the Y-group consortium and will be built at a", "The next Biennial should take place in 2020 and will be themed “humanism and the design’s relation to modern life.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has received a $10 million donation from the Nelson-Atkins Family Foundation. The funds will enable the organization to launch a new three-year scholarship program that will focus on the visual arts and will focus on issues such as financial literacy, musical literacy, and the arts and humanities, among others.“The sale of the museum was a natural extension of our long-standing support of the arts,” Michael Nelson, executive director of the foundation, told the Los Angeles Times. “The gift is a paradigm shift for a museum that for decades has focused on the museum’s relationship with its collections, on preserving art, and on artistic excellence. This new scholarship program will ensure our future vision of a museum that transcends tradition and that is always seeking to create new opportunities for exploration.”This new scholarship program will launch in 2020 and will involve the transfer of two hundred works, including work from the foundation, the Los Angeles County Museum of Art, and the Monterrey Art Museum in Nicaragua. The works", "The next Biennial should be held in 2022–2023. The exhibition will aim to advance the understanding of urban planning in the country and to promote the work of the local artists and institutions.\n\n\nPrivate philanthropies, such as the DonorsChoose program and the DonorsChoose2  program, have launched several new initiatives that will help the world’s poorest and most vulnerable.  The DonorsChoose program was established by DonorsChoose, a private foundation established by a group of developers in New York to give back to the arts through various donors’ initiatives, and the DonorsChoose2 program was created by DonorsChoose and the National Endowment for the Arts (NEA) to give back to America’s communities by giving grants to micro-grants and to educate about the power of the arts.In a statement, DonorsChoose said: “Together we have created a new way for artists to support the arts through their philanthropic giving that empowers them to make deeper connections with their communities through art, and for our philanthropists to support projects that help artists realize their dreams of working in the art and culture industry. We are thrilled that DonorsChoose and", "The next Biennial should be in 2020. \n             \n\n\nThe Bechtel Museum in London has welcomed Elizabeth Blake to its ranks as its next director. Blake currently serves as a founding curator at the Museum of Modern Art (MoMA) in Manhattan, where she has helmed the museum for thirteen years. During her tenure, she has curated exhibitions such as “Plains of the Adriatic,” 2013, which explored the relationship between Greece and Venice; “The Mediterranean: New Sculpture, ” 2009, a major retrospective of work by the Italian artist Lucio Fontana; and “Pyrrhon-Tabor: On a Stormy Sea,” 2009, which honors the sculptor George H.W. Bush.Blake also serves as a curator at the Museum of Contemporary Art (MoCA) in New York, which she helmed from 2010 to 2017, and as a curator at the Museum of Contemporary Art, Los Angeles. She has five international exhibitions planned for the Bechtel Museum and will begin her new role in January.\n\n\nThe Art Newspaper has announced that Michèle Brisson, who has been the director of", "The next Biennial should be held in 2021, and the exhibition should take place at the Guadalajara Museum of Art, Mexico City, in 2021. “The Grand Budapest Hotel (2015)” and “Surviving Eight Years in the Grand Budapest Hotel (2017),” which were part of the inaugural exhibition, were also nominated for the 2021 prize.The first-ever José Andrés Prize for Prints, Art, and Architecture, which was awarded by the Josef Alberts Foundation for Contemporary Art, was also selected. The prize was established in 2013 by José Andrés, an acclaimed artist and film director, and the artist Markus Biedermann, and will be presented at a ceremony in Barcelona on November 12.According to the Art Newspaper, the prize jury comprised Arturo Rodriguez, the director of the Museo de Arte Contemporáneo de Barcelona; Javier de Iñigo, director of the Museo de Arte de Barcelona; and Nuria de Almena, director of the Museo de Arte de Madrid. The jury was made up of Jorge Fernández, director of the Museo de Arte de Madrid, and Hernán Díaz, director", "The next Biennial should take place in the summer of 2020. The date to be chosen will be decided by the Institute of Contemporary Arts Hamburg, which is currently working on a new extension to the theme.\n\n\nThe Santa Monica Museum of Art (SMA) has received a $1.5 million donation from the Art Fund of the Greater United States, an organization that supports arts institutions across the United States. The gift, which will allow the institution to open a new two-story, 400,000-square-foot, museum called the \"Art of the Future—and the Art of the Past.\"Established in 1996 by Donald and Roberta Griffith, the fund, which is managed by a team led by architect Joe Premo, gave the museum $1.3 million in support of its construction. The museum employs around one hundred people, and has been without a director for fourteen years.“For twenty-seven years, the Griffiths have championed San José’s role as a global leader in art,” said Roberta Griffith. “They have helped create the San Francisco Museum of Modern Art and the Bay Area Museum of Art, and have fostered the resurgence of the local art scene and contributed to the museum’s", "The next Biennial should be held in the spring of 2021. The next Art+BizExpo should be held in the fall of 2021. The art fairs will take place in Tokyo, Hong Kong, Venice, New York, and San Francisco.\n\n\nThe Pérez Art Museum in Mexico City has set its 2018 budget at $16.9 million, which was raised by a pledge of $3.5 million from the Pérez Foundation (Pérez Foundation) and the Ricardo and Ana Alvarado family. The funds were used to move the museum from its current location in the Pérez de la Reforma to a larger space in the complex.“This is the most important year for the Pérez Art Museum since it began as a foundation in 1998, reorganized the institution in 2004, and relocated the museum to Mexico City in 2009,” said Youn Sze, Pérez Foundation’s president. “The museum’s new headquarters will make it even more centrally located and will provide an ideal exhibition venue for Pérez Art Museum exhibitions, exhibitions, publications, and other programming.”The Pérez Art Museum will remain closed this fall as it continues", "The next Biennial should be held in 2021.”\n\n\nOperations at the historic Pantages Museum in Paris have been suspended until March 13 due to the ongoing health crisis in Syria. The French Ministry of Culture confirmed that the five-year-old institution, which houses some 5,000 artifacts from the medieval period, is closed until further notice.The suspension, which coincides with a global health crisis caused by the coronavirus, is part of a French government plan to mitigate the health crisis by defunding the فDaɪd Museum , which aims to be an international museum dedicated to the ancient city of Palmyra that was also destroyed in a massive explosion in June 2015, and by encouraging the conservation of archaeological sites.The Pantages Museum was founded by Georges Kremer in 1989 as a permanent home for French modernism. It expanded to a larger building in 1992. The museum is currently home to 3,600 artifacts from the medieval period. As of March 15, it had 945 items on display. The museum has been closed since March 13, when it reopened to the public following a partial refurbishment.\n\n\nArt historian Aziz Ansari is launching a new independent organization, the Center for Art Research (CAR), to", "The next Biennial should focus on human rights issues, particularly in the areas of labor, homelessness, and economic and financial inclusion, and will be held in late spring/early summer, according to an opening statement by the exhibition’s curator, Bénédicte de la Bruyère. The biennial will also include an open-aired pavilion on contemporary art and the history of photography, which will open in early July, and some thirty other major works.Preserving the Landscape in the City: 2017–2010 by John Hendersbach (2019)Spring/Autumn: The Power of the Sun, The Stars, and the Sea, 2019Long Summer: The Power of the Earth, The Moon, and the Moon, 2018The Solid Gold of Venus, 2018, Kunsthalle Oberammer, GermanyTate & Andrews, 2017“This exhibition was created in collaboration with the city of Berlin, the city of Halle, and the European Commission, whose mandate is to nurture and promote the art of sustainability in the city of Berlin, in collaboration with the artists and designers who are active in the local community, and by the public,” the artist said. “It is an acknowledgement of the city�", "The next Biennial should be held in 2021.   ·\n\n\nArchitecture and design historian and MacArthur Fellow, Asha Rauch, has announced that she is leaving the University of Pennsylvania to become the next dean of the School of Design. A scholar of design, Rauch will take up the post in March 2020 and will oversee the academic year as usual.“I’ve long admired and respected Asha Rauch as a scholar, a thinker, and a friend,” said scholar Naomi Leonard. “Her intellectual and emotional intelligence and energy combined with her attention to detail and ability to project a sense of creativity and imagination into practice defined her as a truly remarkable and visionary leader.”Rauch previously served as dean of the School of Design from 2006 to 2011 and as a professor at the School of Arts and Design from 1992 to 2001, when she became dean of the College of Design. During her tenure at the School of Arts and Design, Rauch oversaw the development of the school’s Master of Fine Arts program, oversaw the development of the school’s School of Design’s Design Research Lab, and was instrumental in expanding the school’s visual arts program.Comment", "The next Biennial should be held in the spring of 2020.\n\n\nThe Dalles Museum of Art in Oregon, the Oregon Shakespeare Festival in California, and the Bluegrass Festival in Kentucky are among the more than one hundred arts and cultural organizations that have issued statements in response to the coronavirus outbreak. The first round of statements, which were issued by Mayors Gary Locke of Portland, Robert Cordy of Louisville, and Matt Paul of New Orleans, have been published in both print and online. “We are working hard to determine the best possible date and are monitoring the situation closely,” Kentucky Governor Steve Beshear said. “As we evaluate the best way to begin the recovery, it is important to remember that the initial coronavirus outbreak began on March 23, 2017 and ends March 16, 2019.”A second set of statements, addressed to county health officials by the American Civil Liberties Union of Oregon, calls for a national emergency. The statement points to a number of reasons why the United States should stop mass-sharing and social media use and instead focus on more direct interventions, such as universal health care and universal basic income.\n\nThe British artist and activist Caroline Aitken has received a", "The next Biennial should be held in 2020, the artist told New York Magazine in an interview last June. However, Polson believes that the Biennial “will always be an experiment, an invitation to the other side of the city, to the other side of the world, and through that, to other places, other people, other stories.”\n\n\nThe Edith Cowden Foundation and the New York Public Library (NYPL) have announced their collaboration to commission works by the late New Orleans–based artist Edith Cowden and her family. Curated by Whitney Museum of American Art senior curator Christine Sexton, The Cowden-Seymour Collection will premiere at the Whitney in December 2018.The Cowden-Seymours were members of the seminal Texas-based collective the Black Cross, whose members include the group’s founding members, George and Mary, who are buried in Saint Charles Parish in New Orleans; Edith’s husband, the late designer Ralph Edward Cowden; and her daughter-in-law, the late screen actress Gloria Gaynor (born and raised in New Orleans). For the past decade, the Cowden-Seymours’ collections have been housed in the Edith", "The next Biennial should begin in October and conclude by March 2020. The theme will be “The Future Is Present,” and the exhibition will consist of three exhibition halls: one in the capital city of Nagoya, a second in the countryside near the city, and a third in Nagoya. The first exhibition hall will be inaugurated by a presentation of the “Hiromasa Noguchi Biennial,” which will present works by both Noguchi and Ueda. The second exhibition hall will feature the first work by Noguchi, a thirty-one-foot bronze sculpture by Yoko Oishi that will be unveiled at the exhibition and will be on view through September 30. The third exhibition hall will be inaugurated by “Namie Oishi: I, N, and Shadows,” which will take place in the former Cardiff Biennial Hall, the former home of the Welsh Royal Commission for Wales, in Cardiff, Wales, on September 26–October 2, 2020.\n\n\nSculptor and curators George Lucas and Lawrence Kasdan have been named cochairs of the twenty-fourth edition of the International Pop-up Museum (IPM), being held in the Sofia Bi", "The next Biennial should be hosted by the institution in 2021. Mautz, a curator and educator, said this year’s edition explored “how art and culture intersects with the human body, its effects on health and well-being, and the environment,” and that it was “an exciting and challenging exhibition that also made a very strong statement about the role the museum plays in the city of London.”\n\n\nArtist-run performance spaces are finding themselves increasingly in conflict with the cultural establishments they purport to serve. Since the end of the global recession, arts institutions are struggling to balance the need to survive with their long-standing mission of serving the community. The situation has gotten so dire that some have even resorted to cutting ties with their former allies. “We Are Not Cuts”, an exhibition organized by the New Art Dealers Alliance to combat the opioid crisis, was canceled at the Javits Center in Atlanta in February. The event, which featured forty artists—Tania Bruguera, Zoya Corral, Coop De Mercea, Brandon Schoelking, and Linden Lalonde in collaboration with the newly founded New York Performance Space Collective—was supposed to", "The next Biennial should focus on “The Blue-Eyed Dolphin” (1987), a project by the American photographer David Sirlin, whose first exhibition at the Biennale in 1981 included the first screenprint of Edward Thomas’s first book, The Blue-Eyed Dolphin, published in 1977. “The Blue-Eyed Dolphin: An Exhibition of American Life” (1993) included a solo exhibition from the artist’s collection of 1960s and 70s experimental photography, “The Steadicam Model” (1995–96).In addition to the biennial, the university will create the new biennial–level program for Visual Arts & Design, which will aim to share the art and design of the century with a more diverse array of audiences. The program will also introduce new scholarship and experimental programming that will engage with issues of cultural identity and the nature of creativity. The inaugural program will open in 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has announced its representation of a new work by artist Shawn Johnson, who was awarded the National Gallery of Art’s Lifetime Achievement Award in 2003. The installation, titled The Number One, was created with a group of six", "The next Biennial should be held in 2020. \n\n\nThe National Gallery of Canada (NC’) in Ottawa has appointed Tanya Blum as its next director and CEO. Blum comes to the institution from the University of Toronto, where she serves as a research curator and has organized numerous exhibitions, including “On the Road to Civilisation” (2017) and “Delirious: The Trouble with Surfaces” (2017). She also serves as director of the Simon Fraser University Art Gallery.“Tanya Blum’s appointment to the National Gallery of Canada is a strong signal of our commitment to the work of the future generation of leaders,” said National Gallery of Canada director and CEO Russell Field. “The board appreciates her commitment to developing and strengthening the gallery’s collection and the museum’s program. We look forward to welcoming her to the museum and observing her leadership role in developing the gallery’s exhibitions and programs over the next twelve months.” Blum will assume her responsibilities at the National Gallery of Canada on January 14, 2020.\n\n\nThe Betancourt Family Foundation in Paris has received $1.1 million from the French Ministry of Culture in support of", "The next Biennial should take place in 2020, but organizers are still working on a date.\n\n\nA group of artists and collectors have launched a campaign to have the Solomon R. Guggenheim Museum in New York City renamed. The campaign—which relies on the help of individuals and groups across the globe—aims to remind the institution, which recently underwent a $1.4 billion expansion, that the Guggenheim is a national treasure.“At this moment of great uncertainty for the museum, it is critical that the Guggenheim Museum and the city of New York recognize that their relationship with the Guggenheim is an important part of the national story and legacy,” said Christine Weinberg, a senior staff attorney at the Whitney Museum of American Art, and Whitney Biennial curator.In addition to naming the institution after the late collector, the campaign is asking that the city choose the Guggenheim’s longtime president, Klaus Schwabe, as the new director and that Schwabe serve as a curator at the institution until the end of his term. Schwabe, who stepped down from his post on June 1, will assume the helm of the museum on August 31.A statement issued by the campaign reads:", "The next Biennial should take place in the first floor of the Windmill Art Museum in Portland, Maine, in 2022. According to Artnet, the event will be accommodated by the show’s designer, the late Richard Avedon, as well as curator and architect Nick Turse, and will be inaugurated by a solo exhibition of the artist’s works, “Performances of the Early Modern Period” (2017), which was on view until March 23, and an exhibition of the artist’s works in association with the Museum of Modern Art in New York in 2018. \n\nThe Hirshhorn Museum and Sculpture Garden, which has been temporarily closed since May because of the Covid-19 crisis, has released the schedule for the 2019 edition of its eventual “Diversity of Form: From Bodies to Totems”, which will take place in the university’s main building on August 28–April 16. The schedule is divided into five themes, including “Totems” (2019), the history of the Greek and Roman worlds, the Greek and Roman world—especially in the late third century CE—and the early and late", "The next Biennial should focus on the history and evolution of the use of photography in the twentieth-century, and should involve a combination of contemporary discussions of the history of photography and a re-conceptualization of the history of photography as a historical medium.”The biennial will be housed in the Museo de Cultura Artes in Madrid and will be curated by the artist-run nonprofit group Arteseca Muertifilm.\n\n\n\n\n\n\nLASALLE, Alabama--The Alabama Arts and Heritage Commission announced today that emerging artist-in-residence D.J. Cunningham will receive the Governor’s Award, given annually to an artistic force in the state, in recognition of his work in creating a new institution to showcase the work of contemporary artists. Cunningham, who grew up in the Alabama panhandle and is a native Alabamian, is the founder of the nonprofit Art Institute of Alabama and served as the commission’s inaugural director for the Birmingham Museum of Art (BMA), which is currently undergoing a $450 million expansion. He is also working on a book, “The Artist in Residence,” which will be published by the BMA in February 2020. He will receive $", "The next Biennial should take place in 2021, and the 2020 edition will take place in 2022.  The 2020 edition will be based on a story of forty-nine-year-old Maureen and her relationships with her younger siblings.  The twenty-first will feature contributions from thirteen artists, including Adriana El Rossi, Gabriella Ferrer, Nia Germain, Kamille Liao, and Pilar Cavalcanti. The 2020 edition will be augmented with an extra-curricular program focused on women artists, which will be organized in partnership with the Regional Council for Women’s Languages (RCWL), as well as a retrospective of the work of a half-dozen artists, including Amara Bruguera, Freya Moberg, and Arundhati Bhattacharya.\n\n\nTokyo’s Tate museum announced today that it will open its first new branch in the United States, in the city of Edgewater, New Jersey, next month. The new museum, which will be named the Tuka Museum of Art, will be located in a former industrial building on the ground floor of a building designed by French architect Jean Nouvelle, and will be inaugurated by an exhibition", "The next Biennial should be held at the Museum of Modern Art in New York at a date to be determined, in 2020. The exhibition will consist of thirty retrospective‐style exhibitions, each presenting a theme. The first exhibition, “Simple Life: The Promise of Life in a Garden,” will open on September 2 and run until September 24. The second exhibition, “Biennial at the Museum of Modern Art: Women, 1948–1965,” will open on September 10 and run until September 20. The third exhibition, “The Biennial of Modern Art: The Art of the Present,” will open on September 14 and run through September 21. Artist Biennials Biennials are an annual event that aims to offer insight into the themes, themes, and subjects that have shaped our collective and collective experience in contemporary art. In order to facilitate the creation of the biennial, the Museum will begin a new challenge: creating a biennial in a museum that is both relevant and responsive to the zeitgeist. In order to facilitate the fulfillment of the biennial, the program of exhibitions, residencies, lectures, workshops, and other events will evolve. Further, the biennial’s theme will shift", "The next Biennial should be held in the autumn of 2020, with the exhibition scheduled for the end of March.The final edition of the biennial will take place in the spring of 2021.\n\n\nThe National Galleries of Scotland announced today that the sixteen National Gallery of Ireland (NGA) buildings on the island of Mull, in the Clyde, have received a gift of 132 paintings from the National Galleries of Scotland. The works are works by Edward Hopper, Robert Mapplethorpe, James Turrell, and other prominent artists. The gift, made by the NGA and the Scottish Rite, includes works on paper, lithography, photography, and collage.“In celebration of the National Galleries of Scotland’s centenary, the National Galleries of Ireland have presented the National Museum of Ireland with its lifetime achievement award, the National Galleries Lifetime Achievement Award, which will be presented at a special exhibition at the National Galleries of Scotland in August 2021,” said National Galleries director Carole Walker. “The National Museum of Ireland has always been an institution that tells the story of Ireland through the works of a select group of artists, and this special gift enables the NGA to continue to tell the story of", "The next Biennial should take place in the Leipzig University, in May 2020. The National Museum of Contemporary Art in Brussels will be inaugurated in May 2021. The 2019 edition, titled “The Metamorphosis of Man,” was held in London, and will open in the capital city of Belgium on September 7.\n\n\nThe Jewish Museum in New York has hired Ariel Guggenheim and David H. Koch as curators for “The End of the World as We Know It.” The prominent contemporary art collectors, who were embroiled in a legal battle with the Louvre over a contract that would have given the Louvre access to the works of fifty-six famous clients, including Pablo Picasso, Guggenheim, Hauser & Wirth, Thomas Heatherwick, and Robert Irwin, are collaborating again—this time on a collection of twenty-nine works, each dating from the 1920s to the 1980s.The exhibition, which is being organized in partnership with the Museum of Modern Art and the Louvre, will focus on the “end of the world as we know it,” an argument that has petered out of fashion as more and more of us have transitioned to digital technology and the internet.", "The next Biennial should be held in Leicester in 2022, and the first in New York in 2024. The museum is currently planning to create an exhibition dedicated to the history of the inter-war years in the United Kingdom.  The biennial will be led by curator Míchel Ghebaly and include the work of seventy-nine artists.\n\n\nThe National Gallery in London announced today that David Schinella, a British-born Belgian-American artist, has won the Prix d'Artiges, a prize presented by the National Arts Council. Dubbed the National Contemporary, the Artist Award is named after Schinella and commemorates the performance of his work at the Tate Modern in London in 2009. After receiving the award, Schinella said that he was inspired to create the work in 2009 by the contemporary art of Belgium, which he described as “an ideal mixture of craft and imagination.” Schinella will be presented with the award at a ceremony at the National Gallery on Thursday, November 30. In addition to receiving the Prix d'Artiges, the National Arts Council has awarded Pierre et Marie Curie, Mary Beard, and Max Beckmann the Prix de l'An", "The next Biennial should be held in 2022, and the first in January 2020. The petition, which calls for a new exhibition titled “Theater of Operations: The Gulf Wars 1991–2011,” was signed by more than 1,500 people.According to the Art Newspaper, the tireless efforts of the petitioners are not over. “We are hopeful that the new exhibition will draw attention to the original objectives of the exhibition, and to our desire to see it continue,” said Alexander. Andrea also said: “I’m not sure why these commissions are not being made more like a museum, but I think that’s where the real harm is going to be.”The artists who will represent the jury at the upcoming exhibition are: Halil Altındere, Huseyin Ayhan, and Alireza Barba, who have created works that challenge “the centrality of the Gulf in the collective memory of humanity,” according to the Art Newspaper.\n\n\nAlberto Bernabei, the director of the Museo de Arte Contemporáneo (MAS), in Milan, has announced that the museum will reopen in November next year,", "The next Biennial should aim to produce works that demonstrate the interdependence of art and theory across contemporary and pre–modern cultures, and to encourage the global distribution of conceptual art.”During the exhibition, which will run from February 6 to February 8, 2019 at the Beijing Art Museum, China, the artist-led project will be curated by the artist Zhang Yu and will focus on the evolution of Chinese art from its creation to the current state. Zhang will also present works by various female artists, including Dietmar Bech and Susanne Sze, and will present a selection of works by poets and activists.Commenting on the upcoming exhibition, Zhang said: “I am excited to present work from the '50s to the present and the future. The exhibition will focus on the emergence of new concepts through the Re-emergence of Art movement and the 2020–21 exhibition will be a manifestation of the theme ‘Art and the Future.’”\n\n\nThe Museum of Contemporary Art (MoCA) in New York has appointed Sharon King the next director of the museum, which recently celebrated its sixtieth anniversary. King joins MoCA from the Metropolitan Museum of Art, where she served as director for sixteen years. She succeeds", "The next Biennial should be held in October 2021.\n\n\nThe French government has begun expanding the country’s social security system, implementing a new system of benefits and benefits check-ups, which will be implemented across all of France within the next two years. The program, dubbed economic relapse prevention (EPR), will involve working with French-based companies to help companies implement more efficient care and reduce the amount of waste in hospitals.According to the French daily newspaper Le Figaro, the government estimates that the policies will reduce the country’s COVID-19-related deaths by 14 percent by 2022. However, since businesses are still not required to report how much they are preparing to spend on health care, and companies have yet to be allowed to participate in the program, the government is predicting that the number of deaths that will be prevented could be much higher.France’s new social security system was established as part of a deal with the European Union in 2015, which saw France break from the US and Canada in order to join the bloc. The country’s new health care system will be implemented in two stages, in 2020 and 2021.The first phase consists of providing 1.2 million citizens with one-time cash subsidies of up", "The next Biennial should be held at least twice a year. The first, which was originally scheduled to run from March 16 to March 17, 2019, was rescheduled for June 4 to June 7. The second, which was originally scheduled to take place from June 16 to June 23, 2019, was rescheduled for July 26 to July 28. The 2019 biennial is titled “AiPT: The Intersection of Existentialism and Politics.” The theme of the festival is “Why Art?” It will kick off with an exhibition of work by Joël and Martine Marcos at the Arcimboldi Gallery in Milan and will continue with a series of lectures and performances by artists, scientists, and other experts.The 2018 edition, which was curated by Ermanno Carlucci, featured presentations by Marcelo Bertolotti, Sara Cwynar, Lydia Cooper, Julia Salerno, and Oodie Abell.\n\n\nThe Pennsylvania Academy of Fine Arts (PAFA), a contemporary art center in Philadelphia, has appointed Emery Swallow as its next director. Swallow comes to the institution from the Museum of", "The next Biennial should be held within the next few years at an appropriate location in the city\u0097this may include a museum, a public garden, or a park. The construction of the Biennial, which will be timed with the annual Women’s March, is expected to cost an estimated $12 million.The Biennial will be inaugurated by a daylong celebration of the centenary of the birth of Trotsky, the founder of the Communist Party of Russia, which was established in 1924. The Communist Workers Party (CWP) will also direct the festivities.Inaugurating the exhibition, which will include works by fifty-five painters from Russia, the former Soviet Union, and Central and South America\u0097a selection of which will be presented by artist Orsi Sarkis\u0097will be a documentary by journalist and filmmaker Natalia Gritschhofer on the contemporary situation in Ukraine, the country that was annexed by Russia in 2014 and which is currently struggling to rejoin the European Union. The documentary will include interviews with activists, researchers, artists, academics, politicians, and residents of the region.The exhibition will also be a retrospective of the work of Mikhail Gorbachev and Tacita Altmann, who was", "The next Biennial should be held in 2020. \n\n\nThe Museum of Contemporary Art (MoCA) in New York is preparing to reopen to the public in early 2021 following a $450 million expansion that is expected to create more than 1,500 additional gallery spaces. The overhaul, which is part of a $1 trillion overhaul of the city’s public realm, will also include the construction of a new $220 million public library, additional parking, the redesign of the Central Library, and the expansion of the public’s access to the arts.“The Museum’s architectural and design team, led by architect Susan Johnson, has delivered a new and exciting era for MoCA,” David Ha, chair of MoCA’s board of trustees, said. “The expansion includes new galleries, a new public plaza, and a new elevated public library. It also adds thousands of square feet of floor area to our existing galleries, and advances our mission of empowering artists and creating meaningful public experiences. The new spaces give MoCA a new sense of purpose and make MoCA a city landmark. We are really excited about the future of MoCA and what this new chapter will bring to our community.”\n\n\nThe National", "The next Biennial should focus on 'the new colonial dimension of culture, as well as the representation of indigenous forms of art, landscape and architecture in the exhibition space.”\n\n\nThe London-based nonprofit Art Initiative has elected seventy-three artists to its board of directors. The initiative is a platform for collaboration, education and advocacy focused on environmental and social justice issues. It is also a platform for artists to connect with and receive funding from organizations working for social change.“This is an historic year for our network, for the organization, and for the city of London,” said John Reynolds, director of Art Initiative. “The board has a responsibility to oversee the work of the seventy-three artists whose nominations were selected, and to ensure that they continue to flourish in the context of the city and the wider world.”A full list of the seventy-three artists can be found here. The full list of trustees can be found here.\n\n\nThe Washington Art Museum (WMA) in Washington, DC, is launching a new initiative that will give local, state, and federal governments access to over nine million photographs from the private collection of American photographer Vincent van Gogh. The initiative, called Vincent van Gogh Archive, was", "The next Biennial should be held in 2020.\n\n\n\n\n\nPace: João Pires Espírito Santo, Rio de Janeiro, Brazil, 2019. Courtesy of the artist and Rio de Janeiro’s Akitio Partners.\n\n\nThe twentieth edition of the Beijing Biennale, curated by China’s State Administration of Cultural Heritage and organized by Peking University, has announced the opening of four new platforms for international exchange, including a digital-only, biennial exhibition about the 70th anniversary of the Soviet Union’s victory in World War II.The new platforms—Altmetrikus, the International Center for Contemporary Art, the London-based London-based museum, and the London-based annual exhibition of contemporary art—were established as part of a project to engage with the themes of the exhibition in London and to present works from the contemporary collection in the United States. The project also introduced the new platform to the China’s National Museum of Contemporary Art in Beijing.“In this first edition of the National Museum of Contemporary Art, we are delighted to present our work in partnership with Peking University, which is in the process of establishing a new contemporary art museum in Beijing. Peking�", "The next Biennial should be in 2020, which would mark the centenary of the end of the First World War.\n\n\nLondon-based photographer Mary Ellen Knypha, known for capturing moments from everyday life, has died at age sixty-eight. Her death was confirmed by her partner, Mary Ellen Knypha, who wrote on Instagram that the artist was \"living her life with incredible energy and humor.”Born in London in 1942, Knypha studied at the School of the Art Institute of Chicago before moving to the London School of Economics in the UK in 1948. Returning to the US in 1967, she enrolled at the University of California, Berkeley, then enrolled at the Museum of Fine Arts (MFA) in New York and the Art Institute of Chicago in 1968. In 1971, she moved to the Eastern District of New York, where she began her series “Perfect Strangers,” 1972–76, which took place in a series of abandoned buildings, including the Brighton Art Workshop, the Art of Manliness, and the Art of the Impossible. A collection of photographs and prints by Knypha, which were published in the October 1972 issue of Artforum, is currently on display in the Haus der Kunst, Berlin", "The next Biennial should be held in the spring of 2020, and the first single-day exhibition should open in the fall of 2020. The 2020 edition will take place at the Museo de Arte Contemporáneo in Madrid, and will highlight the work of forty-six artists.\n\n\nThe Baltimore Museum of Art (BMA) announced today that it has received a gift of over one hundred works by thirty-one talented contemporary artists\u0097including a half-dozen in the first three months of its collection, which was founded by BMA curators and director Nadine Boesky in 2007. The gift includes twenty-six works by artists from twenty countries\u0097including fifty-one works by the Vienna-based artist Karl Lagerfeld, the Venice-based artist Mihai Mavic, and the Hamburg-based artist Helge Schmidt, all of whom are represented by the BMA in New York.“The gift also includes twenty-three earlier works by artists who were not previously included in the museum’s collection, including a work by Ada Lovelace and a work by a collaboration with Anna-Sophie Shepard that was not included in the museum’s collection for more than twenty years,", "The next Biennial should take place in Tokyo in 2020. \n\n\nThe Museum of Contemporary Art (MoCA) in New York has announced that it plans to shutter its space in the basement of the institution, which was established in 1974 by Donald and Adeline Griffith in order to make way for the construction of the six-story, 150-seat Jacobs Building, in the city. According to the New York Times, the building will be completed and ready for the public in 2021 but will not open until at least 2022.The building, which was completed in 1991 and is one of the oldest active works in the United States, will be relocated to a new, sixty-meter-high, glass-enclosed exhibition space on the ground floor of the Griffith building, which will encompass the museum and the Jacobs Building, and will be completed in 2022.The structure will also feature a larger main concourse, a larger public courtyard, and a new, twenty-five-thousand-square-foot auditorium. The facades of the two buildings will be reconfigured. The Griffith building will feature a sculptural reconstruction of the Griffith–ISG building, completed on the same site in 1973, and will be flanked by two new pavilions. The exterior", "The next Biennial should commence in 2020.The exhibition will be organized in two stages: The First Stage will take up the themes of the twentieth century, including the history of the emerging creative and intellectual currents, while the Second Stage will remain closed until March 21, 2020. The presentation of the works will proceed according to the theme. The show will be held in the eighth Biennial in the spring of 2020.The opening ceremony will take place at CNEAM in Paris on February 25.The opening of the exhibition will take place at the ArtPlace in Grenoble, France, in the spring of 2020.\n\n\nThe Cleveland Museum of Art (CMA) has released the first of a planned series of exhibitions dedicated to the life and work of John Aksel. The first show, “A History,” will open at the CMA in May 2020 and will be followed by “Aksel: A History,” in the fall of 2020. The second show, “A Future to Believe,” will open in the spring of 2021 and will be followed by “Aksel: A Future to Believe,” in the fall of 2021.The sponsorship agreement between the CMA and the artist’s estate", "The next Biennial should take place in 2021, according to organizers.“The international reputation of the museum has been significantly enhanced by the collection of work by well-known and unknown artists, which includes the collection of work by artist-in-residence, and biennial works,” said Anuradha Swamy, the chair of the museum’s board of trustees. “The museum has developed a reputation for being a progressive, forward-thinking institution and we are proud to serve as the next Biennial Pavilion in India.”The 2019 biennial, “The Egg,” presented work by the new generation of Indian artists, including Narayan, Sujatha, and Ahlu Khan. In a survey of their work, the exhibition featured work by Kanwar Pandey, Kamala Ghose, Jagdish Singh, Sohrab Moosa, Krishnagiri Majumdar, and Hannah B. Hassan. The exhibition also featured work by Sonia Bhandari, Guadalupe Rosales, and Wangechi Mutu.\n\n\nThe Hirshhorn Museum in Washington, DC, has received a gift of two rare works by the late American artist Dorothy Chandler", "The next Biennial should take place in 2021 and will be hosted by the museum in the city of Cambridge, Massachusetts. A design by the artist will be chosen by the curators of the exhibition.The biennial will also include a number of exhibitions and talks which will be organized by a group of artists, including German artist Barbara Finke and Swiss artist Ralph Nader, and will be curated by a panel of writers, including Joachim Fischer, Irène Halbach, and Arthur Schell.“The exhibition is a creative response to the tensions of the twenty-first century; an attempt to create a new history of our world based on the scientific method and the history of our species,” said Stefan Wagstaffe, chair of the committee. “It is also an important occasion for a new and important exhibition in the Museum Art History. We are confident that this exhibition will inspire, challenge, and delight the audience and will be an ideal platform for the exhibition of the next Biennial.”The selection of the biennial’s subjects is influenced by the biennial’s theme “The Future of Life,” which is a reference to the Universal Declaration of Human Rights, signed by nearly 200 countries and eleven", "The next Biennial should be held in 2020. \n\n\nThe Museum of Contemporary Art (MoCA) in New York has appointed Anoeta Konkol as its new deputy director of development. Konkol comes to the institution from the Museum of Contemporary Art (MCA), where she has served as deputy director since 2014, and will assume her responsibilities in early December.In her new role, Konkol will report to director James L. Cooper and will oversee the development of the museum’s thirty-six-acre campus and the academic program at the institution, which was founded by Italian immigrant artists Gio Ponti and Gio Ponti-Sorondo, who also designed the new building.The move comes as MoCA moves into its first phase, which will involve the construction of a new building on the campus, and is part of a larger plan to modernize and diversify the museum’s holdings, which currently comprise sixty thousand objects. According to the museum, the restructuring will ensure that the collection, exhibitions, and programming is a “more appropriate fit for the times.”In addition to the work of the museum’s curators and experts, the institution will add two hundred thousand works by contemporary artists", "The next Biennial should be held in 2020, and the next Triennale in 2021. By far the most anticipated venue for the next biennial is the Museum of Contemporary Art, Los Angeles (LA MoCA), with its 2018 edition, “Theater of Operations: The Gulf Wars 1991–2011.” The Art Newspaper reports that the exhibition will open with a presentation of artworks by twenty-four artists, including Michael Choe, Gabriel Faus, Patricia Jess, and Zoya Jalili.The Art Newspaper also reports that the artworks will be organized around themes that include the current global security crisis, the Gulf War, and the United States, and that the artists will present a “contemporary” view of the conflicts that have characterized their respective locations.\n\n\nThe Metropolitan Museum of Art in New York has hired Jakob Nielsen as its new associate curator of twentieth-century art, replacing Julián Zuccaire, who left the museum in 2018 to head the Museum of Modern Art, and is currently seeking his replacement. Nielsen will be responsible for developing and presenting new work by artists working in the twenty-first century, a central function of the museum.“The Met’s mission is to provide an opportunity for", "The next Biennial should be held in New York in 2022. The exhibition will also continue to be organized by the artist, and will include the first-ever solo exhibitions of work by a black artist in the United States. The exhibition will also feature work by artists from the African continent.\n\n\nThe Museum of Modern Art in New York has appointed Kerstin Brätsch as its next director. Brätsch comes to the institution from the Centre Pompidou in Paris, where she has served as the Paris-based director of development since 2014. She succeeds Adrian Ghenieç, who retired in March after a decade at the helm of the institution.“Kerstin Brätsch is an accomplished and highly-regarded curator who has demonstrated strong leadership qualities in both the international and curatorial fields,” said Hishammuddin Hussein, chair of the board of trustees of the Institut Politen-messe. “We are delighted to welcome her to the Museum, and look forward to the next chapter of her distinguished career.”Brätsch, who curated five exhibitions at the institution since 2016,“delivers a contemporary and compelling point of view that", "The next Biennial should take place in the city in 2022.\n\n\nThe Bakura Museum in Nigeria has created at least twenty-two new jobs for women and girls and is expanding its existing staff of twenty-six. The newly created positions were established as part of a $12 million reconstruction project in the museum, which recently received a $8 million grant from the National Endowment for the Arts (NEA), and will begin in February 2022.“This year’s inaugural biennial was ambitious and a success, and we are very excited about the future,” museum director Chris Wu said. “The new opportunities for women and girls are vital to the future of the museum, and we’re committed to supporting them both and supporting a strong and vibrant Bakura.”The biennial, titled “Bakura: A Story of Women,” was directed by Hanna Kasabayi and took a retrospective of the life and work of Thadmann Kweku, a Nigerian author and activist who was a key member of the country’s feminist underground. A former journalist, Kweku led the Nigerian Writers’ Club (NWC), the Nigerian Women’s Federation, and the National Union", "The next Biennial should take place at the Art Museum, Chicago (AMC) from May to December 2020. “The concept of the museum is to showcase everything that is new, to discover and explore, and to aspire to,” said the museum’s director, Robert Lieberman. “The biennial is not merely a continuation of AMC’s summer series, but a project in which we interact with our collections and visitors in a new way, examining the ideas and processes around the exhibition and its exhibition in a given season.”The AMC biennial will feature a diverse selection of works, including works by artists such as John Elway, Michael Church, Tracy Clark, and Chris Ware, as well as works by new and established artists. The biennial will also be led by curator and curator of modern art, Peter Wächtler, who will curate a biennial exhibition dedicated to the work of the late American artist Sigmund Freud.\n\n\nAn international team of artists, architects, technologists, and curators led by British billionaire Richard Desmond, a longtime supporter of British arts and a founder of the sub-Saharan African arts organization the Sankofa Art Foundation, have won the 2019 Grant Awards", "The next Biennial should be announced in the fall. Artists for the first time will be recognized as a part of the new program. The program will organize studio tours, residencies, and book signings and will focus on creating opportunities for exhibitions of work that are not collaborative. The biennial will also include a residency program that will draw from the work of local artists and will encourage the sharing of works. Awardees will be selected by an independent jury comprising artist representatives and five of the awardee’s collaborators, art director Pieter Anne-Marie Oosthuijsen, arts professionals Nari Ward and Dara Ward, and Michelle Mulvey, the executive director of the Biennial of Arts.\n\n\nThe Sacklers, the Sackler Foundation, and the Cleveland Museum of Art (CMAC) have announced that they have entered into a twelve-year partnership with the London-based charity the Wind Fund to produce two-hundred, one-hundred, and one-hundred-thousand-watt performances of works by artists who have been excluded from the thirty-three-year-old organization’s annual prize show, “Off the Wall.”The partnership is part of the", "The next Biennial should be held in 2022.  The museum has since been awarded a $10 million contract by the government of Prince Edward Island to organize a biennial for the province. Located in Port Hardy, a former salt-works community in West Surrey, British Columbia, the institute will be guided by a board composed of local artists and will present twelve exhibitions a year. The five-year program will run from February 28 to March 4, 2022.  \n\n\nThe Royal Canadian Museum (RCM) in Toronto announced last month that it will shift all of its programming in a year\u0097from April to June. The controversial move has raised concerns about the future of the institution’s collection and its holdings of some of the world’s most important artworks, including works by Pablo Picasso, Jean Dubuffet, Claude Monet, and Ed Moses.The museum also announced that it would postpone the exhibition “The Role of Art in Society,” which was scheduled for May 21 to June 2, and that it will now celebrate its fiftieth anniversary in October. The exhibition will be reopened in June 2020.“We are very excited about the future of the collection at the museum,” said museum", "The next Biennial should showcase the work of more than thirty artists, including the London-based artist John Kilian and Nari Ward, whose multi-million-dollar solo exhibitions at the Museum of Modern Art and the Broadhurst Institute in London attracted tens of thousands of visitors last year. Also scheduled are new projects by Yoko Ono, John Paul Jones, and Ada Lovelace.The 2020 edition will be staged at Monet Gallery in London, the Museum of Modern Art, the Commissioned Gallery in New York, the Design Museum in London, the National Portrait Gallery in London, the Serpentine Gallery in London, and the Tate Modern in London.\n\n\nOn August 7, the Gujarat government passed a bill that will require state-run museums to make in-principle conversions of artworks into energy efficient units. The legislation was passed by the state assembly in Ahmedabad and is part of a larger, ten-year strategy to cut emissions in the state. According to the Hindustan Times, the new law requires that 75 percent of the state’s art institutions increase the energy efficiency of their exhibition spaces and 43 percent of their collections by 80 percent. If the target isn’t met, the art institutions will be required to", "The next Biennial should be held in 2020.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles—the site of the largest contemporary art museum in the United States—has received a gift of forty-six works from artist-activists and collectors Arline and Joe Lidzi, which arrived at the institution from the private collection of John Baldessari in May. Located in the collection are works by such notable artists as Robert Irwin, Adam Clayton, and Robert Irwin Jr., among others. The donation includes works by artists as diverse as Kris Panza, Josef Alberts, and Mary Beth Edelson.“We are incredibly proud to present these works to the Los Angeles Museum of Art,” Lidzi said in a statement. “They are a tribute to the visionary commitment by Baldessari and Lidzi, who together have dedicated their lives to developing and translating the ideas and insights of contemporary art. We are privileged to have these works in the collection of a visionary collector.”Since its founding in 1968, the museum has been dedicated to the study of the art of the twentieth century, expanding to include a gift of works by artists from the end of the 1960s until the onset of the global pand", "The next Biennial should be held in 2020, and the institution will unveil the first phase of the programme, titled Keepsake, in early 2021.The exhibition will include works by thirty-eight contemporary artists, including Heidi L. Levin, Sam Gill, Andrew Kreps, Kimberly Laszlo, Rich Glanville, and Fergus McCaffrey, and will feature biennial entries by artists from the last twenty-four years. The exhibition will be held at the Art Institute of Chicago (AIC), which opened in 2017, and will run for twelve months in 2020.“The new biennial will change the face of museums in Chicago and will redefine the role of the museum,” said David Karp, the director of the AIC and the curator of the exhibition. “This is a unique and transformative moment for museums, one that opens up new avenues for thinking about the role of art and its relationship to the city. We are excited to see what the new iteration of the Biennial will show.”The biennial will also introduce new concepts to the exhibition and new ways for visitors to engage with the exhibition. The program will be divided into three parts: the inaugural exhibition, “The Dangos: Below", "The next Biennial should focus on the role of culture in shaping public policy. The Arts Council has been asked to organize a public forum for the public to hear and discuss the regional and international artists currently represented in the exhibition. The World Biennale’s 2020 edition will take place at the Hammer Museum in Los Angeles from February 20 to February 23.  The 2020 edition will also include new and original works by up-and-coming and established artists.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Trina Thompson as its next director. Thompson will be the first African American to lead the institution in more than thirty years and will take up the post in January 2021.“The addition of Trina Thompson to MoCA, the largest arts organization in the United States, marks a moment of great change for our community and nation,” Michelle J. Bonta, president and CEO of the nonprofit organization, said in a statement. “Trina will make a distinguished and important contribution to navigating the complex and challenging world of contemporary art and museum design, and to continuing the institution’s mission of celebrating contemporary art through forward-thinking exhibitions and educational programming.”During her tenure at", "The next Biennial should take place from November 2020 to March 2021 at the Palazzo dalla Turin, the Italian Renaissance Museum, and the Museo d’Arte Contemporáneo in Milan. The next edition will be staged in the autumn of 2022. The upcoming edition will be held in the city of Rome from November 17 to November 21, 2022.\n\n\nThe Museum of Modern Art (MoMA) in New York has released the list of the fifty artists who will engage in the museum’s 2019 edition, “Between a Rock and a Hard Place: Art in the Age of Black Power,” which is being staged at the museum from March 13 to March 20. The event will be closed to the public and will culminate with a solo performance by Blondie and Aminé Taylor, the artists who formed the group Black Sheep in 1995. The event will mark the museum’s centenary and will be inaugurated by Madonna’s “Alma and the Witch,” a performance that is part of MoMA’s 150th Anniversary celebrations.’Between a Rock and a Hard Place: Art in the Age of Black Power’ will also feature", "The next Biennial should take place in Moscow, which will be followed by an exhibition in St Petersburg, in the spring of 2019. The 2020 edition will be staged at the Gagosian, the New Museum, and the Whitney Museum of American Art, New York.The European Union also announced that it will invest nearly $8 billion into the arts in the next four years, with the funds going to arts and cultural organizations, as well as academic and research institutions. The funds will be used to increase the financial and administrative support of artists and support their creative activities. The funding will also support the Digital Single Market Strategy, the Commission for Cultural Heritage and the Digital Economy, and the Biennial of Modern Art, which was launched by Jean-Claude Juncker and Jean-Marie Le Pen in Paris in 2017. The 2020 edition will be hosted by the Gagosian in the United States.\n\n\nHannah Wilke, director and CEO of the Museum of Modern Art (MoMA), has announced that she plans to resign from the museum in November 2020. She will take up the post of director of the Metropolitan Museum of Art in New York and will begin her tenure in January 2021. “From the moment I began to", "The next Biennial should be held in 2022.\n\nThe exhibition will feature the work of twenty-five artists from fifteen countries. The artists selected for the biennial are a mix of European and North American artists, including Christo, Karsten Küngera, and Christina Maeguer. The exhibition will also feature a selection of works by the twenty-three artists represented in the first edition of the Artist-in-Residence. The 2018 exhibition was held at the California Institute of the Arts (CalArts).\n\n\nThe National Geographic Society’s plan to publicly display a new work by a controversial artist whose practice focuses on the natural world and the environment has been put on hold amid the investigation into the death of a New York High School student who was swept away by a freak wave while on a field trip to the Hudson Valley.The artist’s employer, the Charles Darwin Foundation, has canceled the exhibition, titled The Mists of Avalon, which was set to open this fall in New York, and is demanding that the exhibition be put on hold while it conducts an independent review of the institution’s use of a private jet owned by the foundation for a new work by the artist.The organization’s board of", "The next Biennial should name a director and a board of trustees in accordance with the recommendation of the seventy-five-member board. The board will then have ninety days to write a statement of intent with the City of Chicago. The City Council will then have ninety days to act on the statement of intent. The question of selecting a successor for Lou Gehrig is still being decided.\n\n\nThe Museum of Fine Arts (MFA) in Boston announced today that it is creating three new positions specifically for people with disabilities. In a statement, the museum said that the three positions are part of the museum’s “commitment to supporting people with disabilities in their time of need.”MFA director Nicholas Cullinan said: “Hoping to strike a balance between supporting people in the core who are essential to the museum’s mission and supporting people who are marginalized or excluded in the museum’s community, we are pleased to announce that these three positions will be filled by people with disabilities. The role of the curator is to facilitate the museum’s conversation with people with disabilities, while the role of the art historian is to explore the legacy of art on people with disabilities.”The positions were created as part of", "The next Biennial should be held at the Museum of Fine Arts in Seattle, which will also host a new exhibition devoted to women artists next month. “The museum has made enormous contributions to society over the years, and we are committed to making more in this way,” said Allan Kiefer, chair of the board of trustees. “We are eager to continue to show the work of contemporary artists in our collection, and to engage with the neighborhood and surrounding communities through exhibitions, programs, and other events, by engaging with our neighborhood and community through the arts.”In addition, the board of trustees received a gift from Thomas J. Jones, the CEO of the Los Angeles County Museum of Art, to support the Biennial’s arts and culture. Jones gave the board of trustees a unique gift, a personal tribute for which artist Patricia Albrecht will design a figure of the late artist-devotee Jean-Michel Basquiat. \n\n\nThe National Gallery of Art in Washington, DC, has appointed Elizabeth Gilbert as its next director. Gilbert joins the Gallery from the Smithsonian’s National Museum of African Art in Washington, DC, where she has served as interim director since March 2019. During her", "The next Biennial should take place in 2021. While exhibition organizers will not comment on whether the exhibition will be relocated, the new space will be completed by the end of 2020.\n\n\nA new survey of contemporary art and architecture in the US finds that almost half of Americans don't know much about the history of their city. In the survey, conducted by the Art Newspaper, the Washington Post, and the Artnet, more than 2,300 people were surveyed and asked a series of questions about their favorite American architectural style, landscape, and architecture, and found that only 37 percent had heard of the full range of twentieth-century American architecture, and only 36 percent identified with their state.Nearly six in ten (59 percent) people don’t know enough about contemporary art to rate it highly; only 12 percent say it has a lot to teach us, and only 16 percent say it’s very important. Only four in ten (43 percent) people think that art is important enough to warrant a high rating.The findings highlight the challenges and challenges faced by museums and cultural institutions in the 21st century. While the survey found that 66 percent of people recognize the value of art in their community, only 37 percent have had a meaningful experience with other", "The next Biennial should have been held at the very earliest possible point in time. Instead, it was pushed back because the organisers feared that the event would draw too many visitors and that it might cease to be a major cultural attraction. They also admit that they made a mistake by calling off the show, which was supposed to draw around one million visitors to the city. “The exhibition was never meant to be completed,” said Leelu A. Williams, the executive director of the museum. “The design for the exhibition was never intended to be completed, and we regret that the exhibition was never built.”The London-based company that created the exhibition, the London-based design agency , designed the pavilion, which featured works by more than 300 artists. The first phase of the exhibition, “Art in the City,” was inaugurated in September 2019 and ran from March 21 to March 25. Its second phase, “Lights, Camera, Prints, and Signs,” was staged in May 2020 and ran from June 1 to June 5. The third phase, “Museum Telling,” was unveiled in May 2020 and ran from June 3 to June 7. ", "The next Biennial should be held in the quarter-century of its creation. The first exhibition was staged in the early years of the twentieth century in the form of a fifty-two-foot-long, forty-one-meter-high sculpture garden. The second was staged in the late 1990s in the city of Tohoku, Japan.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles has appointed Mary Clare Ober’s Autumn/Winter 2020 exhibition, “In Defense of Everything,” as the permanent exhibition’s first project, with the institution welcoming visitors to the museum once again in 2021. The retrospective, which will be on view March 14–March 22, will explore the concept of defense through the works of twenty-four artists who used art as a means of reparation, responding to the reintroduction of the body into social and political life in the United States following the pandemic.The retrospective’s curators, whose work spans five decades, include Kurt Hollein, Prada, and Sohrab Mohebbi, as well as fourteen other artists. The exhibition also features artworks from museums, including a sculpture by Monir Shah, an abstract piece by Taima Sarsour", "The next Biennial should be held in the Fall of 2020. For more information on the design and the biennial, please visit “Art, Design, and Design”.\n\nThe National Museum of Women in the Arts (MoWMA) in Washington, DC, has appointed Jillian Greenberg, the executive director of the National Council on the Arts, as its next executive director. Greenberg will be responsible for implementing new policies and guidelines for the organization, which comprises twenty-seven museums and is funded through annual fees ranging from $5 million to $75 million. “We are thrilled to welcome Jill to the MoWMA family,” said Marc Glimcher, president and CEO of the National Council on the Arts. “Her history of thoughtful leadership and her proven track record as an advocate for arts education and outreach are perfect for our cultural and civic mission.”Prior to joining MoWMA in 2011, Greenberg was executive director of the Museum of Modern Art, where she coordinated the exhibition program for the museum’s “Art of the Contemporary” series, helped develop contemporary art exhibitions and launched the Museum of Women in the Arts’s annual Women’s History Month celebration. During", "The next Biennial should feature a selection of works by the artists who have had the greatest impact on the history of art in India, and will take place in the biennial halls of the institutions that share a cultural heritage and are located near each other. The platforms will include a presentation of the works by the artists in conjunction with a special lecture on their contributions to art history.The exhibition will also introduce new filmmakers and new ways of engaging with artists through the exhibition and digital platforms. The biennial will be a platform for the artists to showcase their work as well as the impact of the artist-run spaces in their communities. It will also include new programming by the artists and a new series of essays by the award-winning novelist and scholar Harjant Gill. \n\n\nAn eighteen-foot-wide (5.5-meter) mural painted by the Brazilian Salvador Dalí in the tiny town of Pereira, in the northern state of Minas Gerais, Brazil, has gone viral online. The work, titled Dalí and the Painter, (Dalí and the Painter), has drawn the attention of local officials and artists who have sought the mural’s removal. The townspeople who commissioned the work—which was", "The next Biennial should be held sometime around the end of the year. \n\nThe Princeton Art Museum and Noguchi Art Museum in New York have announced that they have entered the final stages of a $50 million renovation and expansion project, which aims to improve accessibility and enhance visitor experience by adding new galleries, classrooms, an open center, and a public garden. The $12 million expansion of the museum’s main building, which is currently being completed, will begin in 2021, during the institution’s 75th anniversary. The new spaces will be designed by the New York–based firm Arup and will be inaugurated by a new exhibition called “Telling Stories,” which will feature the work of forty artists, including El Salvador Díaz, El Salvador Miranda, and Billie Tsien, and will be inaugurated by an exhibition titled “A World Apart.” The program will be led by Patricia Brown, who was named the museum’s interim director this month.Brown said: “The renovation is part of our long-term plan to ensure that the Noguchi Art Museum has the tools it needs to continue to develop and thrive as a cultural and natural history museum, and to make sure", "The next Biennial should take place in 2021. \n\n\nSince the beginning of the year, the German city of Bonn has been conducting public art exhibitions, as well as numerous concerts, films, and other performances, as part of a campaign to coincide with the anniversary of the Third Reich, and to raise awareness of the Nazis. The Bonn Biennial was launched by the Bonn Democrats Party in 2017, and was organized in cooperation with the Center für Art und Ersatzgesellschaft (Cf. Ersatzgesellschaft) in Bonn; the Kielische Beobacharum, a political museum in Bonn; the University of Bonn; and the University of Bonn-Düsseldorf.In addition to the public art events, the city of Bonn is organizing a bio-campaign, meant to reach as many people as possible, with a goal of raising $53 million, in support of the event. The exhibition will consist of 120 works by twenty-nine artists, including Mark Gert, Klaus-Axel Müller, and Wolfgang Augsburger, and the works will be on view until September 1, 2020. The campaign will be led by S", "The next Biennial should be held in 2020.\n\n\nThe Museum of the City of New York, which is preparing to reopen in June, has made the first major change to its general admission policy to address the coronavirus, introducing a new three-day window season. The institute’s general admission prices will remain the same, but the number of people admitted will rise from five hundred to seven thousand.The change was made in part to prevent the coronavirus from spreading to other parts of New York City. Visitor numbers at the institution have declined by as much as 35 percent since March, and the number of people using the museum has plateaued. The opening of a new version of the museum, called the Creative Academy, in July is expected to bring an extra twenty thousand visitors to the city. The move has also been made to fix a loophole that allows the coronavirus to enter the country through visitors from China. Several other major institutions, including the Metropolitan Museum of Art and the Bronx Museum of the Arts, have yet to commit to opening.\n\n\nThe Museum of Modern Art (MoMA), in collaboration with the National Endowment for the Arts (NEA), has awarded $8 million to fourteen artists who are working on new works", "The next Biennial should take place in the Fall of 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has launched a new digital platform that will allow visitors to view the work of twenty-six current and future artists in real-time. The platform, called the DAILY LIFE Visuals Center, will debut in September. “The DAILY LIFE Visuals Center is a unique platform that will allow the public to explore and experience the work of twenty-six artists over the course of six months, providing a unique view of their careers and visual art,” said museum director Catherine Roach. “This is an unprecedented way to open an exhibition. We are convinced that this unique platform will become a new window into the artists’ lives.”The artists chosen for the platform are Angela Amedeo, Aline Bruguera, Dinesh Agrawal, Annette Biczel, Kamel Baden, Yinka Besi, Togadia Bannu, Yuli Bulandi, Sarah Banks, Amy Chesky, Paula Cooper, Anish Kapoor, Craig Clauser, and Winona Deenan. The biennial will highlight the work of twenty-six artists and", "The next Biennial should be held at a location that will have the necessary facilities to support the exhibition, including an area for the audience to rest and to have access to the museum. The date of the twenty-fifth will be announced in the coming weeks.\n\n\nOn Saturday, the Italian city of Venice and the Italian government announced that they have reached an agreement to help the Italian arts and culture company Scotiabank reduce its carbon footprint by 40 percent by 2022. Under the Agriculture and Fisheries Modernizatión (AGMF), the city and the government of Venice, along with Scotiabank, have pledged to jointly invest €1.2 billion ($1.5 billion) over the next five years in sustainability initiatives, including by reducing waste, improving the supply chain, and promoting local production. The initiative will also include the creation of a supervisory board composed of one Scotiabank executive and one Italian culture minister, and will prioritize the reduction of energy use in the city.The accord, which was reached through a series of meetings between the two ministries, aims to cut the company’s emissions by 28 percent below 1990 levels by 2022 and will include a number of ", "The next Biennial should be for art and architecture in 50 years, and will be inaugurated at the city’s Art and Architecture Museum (SAM), dedicated to modern and contemporary art and architecture. “The years ahead are full of promise, and this exhibition reflects the hope that these years hold for the city,” said Mayor Randall Woodfin.\n\n\nThe City of New York has hired Adam Gopnik as the next deputy director of the Department of Cultural Affairs. Gopnik will be responsible for overseeing the development of the city’s cultural assets, including the Metropolitan Museum of Art, the Museum of Modern Art, the Bronx Museum of the Arts, and the Bronx NYPL. He will take the position in January 2021.“Adam Gopnik is an outstanding young curator with extensive experience in contemporary art from the Bronx who is passionate about creating experiences for New Yorkers,” said commissioner of cultural affairs Kristin Buono. “We are excited to see where he takes us next year. A true visionary, he is an ideal fit for this role, given his extensive experience and ability to bring ideas to life through experimentation and experimentation.”Gopnik will be working closely with the board of trustees to shape a", "The next Biennial should be titled “The Great Convergence” and will be held at the Center for Media Studies, Vienna, from December 7 to December 12, 2020. \n\n\nThe Institute of Contemporary Art (ICA) in Paris and the Fleur-de-Lis Festival announced plans to merge. While the announcement was made on Wednesday, on Thursday, the two institutions were still debating the merger. The merger would involve the merging of the two organizations, which together make up the ICA. The announcement of the merger came amid a restructuring of the ICA. \n\n\nThe Museum of Contemporary Art (MoCA) in New York has appointed Christina Cadetsi as its new associate curator of contemporary art. She will be responsible for developing programs and curating for MoCA’s upcoming exhibition “The Future Is Present: Contemporary Art from the Silver Hammer,” which will run from March 25 to March 30, 2021.“Cadetsi’s approach to curating contemporary art has been central to the museum’s move to New York and a hallmark of her curating career,” said director Neal Benezra. “Over the last few years, her work has been featured in shows", "The next Biennial should be held in 2021. The Museum of Contemporary Art (MoCA), Chicago: Originally scheduled for 2020, the Museum of Contemporary Art will return to the city in 2021. The reopening will be part of the city’s centennial celebration. The museum’s opening will coincide with the centennial. Additionally, the Museum of Modern Art has chosen to open its new branch in the Sherwood Forest in 2021. The Kiwanis Residence Center in Brooklyn: Originally scheduled for 2021, the Kiwanis Residence Center will now be open in 2022. Ishikawa Museum of Art, Japan: Originally scheduled for 2021, the museum will now hold the first exhibition in the 2020s under the new name 'L.A. Contemporary, 2021.” In a statement, the museum said: “The history of the museum is full of contrasts between idealism and reality. It is an extraordinary collection of modern architecture in Los Angeles. . . . In order to find a way forward in the ongoing critical process of remodeling and rebuilding, we welcome the opportunity to open that collection in 2022.”\n\n\nThe Museum of Modern Art (MoMA) in New York", "The next Biennial should be held in 2022.    The artist-run platform Tilt Brush, which was cofounded by Brandon Tartaglia and Nick Pandolfi in 2009, announced on Wednesday that it is co-sponsoring a new biennial to continue the work of Pablo Picasso, Michelangelo Antonioni, and Irène Atget, among others. The project, entitled ART  and curated by American painter-sensation Mark di Suvero, will be held at the Museum of Modern Art in New York and will run from September 9–September 11, 2022. “The Tilt Brush Artist Series is a tribute to the early artists whose powerful and influential works inform the exhibition and the biennial, as well as the artists who have shaped the series,” said Angelica Harrison, president and CEO of the biennial and the Biennial Museum. “The series is a way for artists to connect and to feel part of the city. It invites them to think about art as a city.”  The biennial’s inaugural edition, which kicked off on August 3, 2019, was met with rapturous reception as the three artists—Picasso, At", "The next Biennial should be held in 2020, according to an announcement by the organizers, who praised the institution’s newly created position of Director of the City of New York, and noted that the new director is responsible for ensuring the institution’s future success.While the panelists acknowledged that the new role was “challenging,” and that “they’re excited to work with the city to further enhance the biennial experience,” they said that the decision was not meant to “prevent or lessen the City’s responsibilities as the institution’s director,” but to enable the institution to “do more with less.” The museum will need to raise an additional $300,000 to reestablish its budget and reopen for the 2020 event, which will run from March 15 to March 21.\n\n\nThe New Museum in New York City has hired Julie Siffert as its new arts and culture curator. Siffert will be responsible for bringing diverse, experimental, and often experimental works by established and emerging artists, and will be based in Harlem, where she will be supervised by curator Christopher Woolf.“Julie brings a wealth of experience in the creative", "The next Biennial should focus on “Eve of Destruction: The Inevitable Fall of Man,” a presentation of new research into the origins of the term “Eve of Destruction” by evolutionary biologist and anthropologist Elissa Anders, curator of contemporary art at the exhibition “The Science of Art,” and artist Max Beckmann. The next exhibition, “Unnatural History: Art and the Origins of the Natural World,” will take up the theme “In Defense of the Natural,” and will be held in the new museum’s newly renovated building in November.\n\n\nThe Art Newspaper in Japan has revealed that the next issue of its publication, which was originally scheduled for March 14, will be postponed again. The weekly magazine will be released in the United States on March 21, and is currently working on a special feature on the latest artworks by Japanese Dadaist Yuji Fujii.The event will now be held March 23–March 26. The date for the Japanese edition has yet to be announced. \n\n\nThe 2018 edition of Art Basel Hong Kong was postponed due to concerns surrounding the coronavirus. The fair, which was slated to run from March 19–March", "The next Biennial should be held in 2022.\n\n\nThe City of London is planning to alter the City Hall landscape by moving the Museum of London, the National Gallery, and the Tate to a new site across the Thames. The plan was first announced in 2017, shortly after Tory mayor Sadiq Kahn announced that he would personally oversee the renovation of the city’s two largest public spaces—the city hall tower and the city clock, both of which are located in the City of London.In a letter sent by the mayor to the public on Wednesday, May 24, the mayor writes: “I am writing to you today to say that I am not prepared to see this through to 2020. And to set out in detail the steps that will now be needed to bring about such a change.” He continues by outlining a number of steps that the city will undertake in order to make the 23rd iteration of the annual biennial “livelier, more vibrant, more international, more inclusive, more inclusive for everyone.”Among the city’s suggested changes are the relocation of the National Portrait Gallery to a new location on London’s South Bank, the expansion of the Park Viewing Rooms, and the refurb", "The next Biennial should be set up within the next two years, the organization announced. The event will be on view around December 14, 2020, and will showcase work by forty-eight artists from thirteen countries. The first Biennial will be held in London in March 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Kathryn Edin as its next director. Edin currently serves as the director and CEO of the Los Angeles County Museum of Art (LACMA). She succeeds Marciano Morgenstern, who has served as deputy director since 2015, and will take up her new responsibilities in January 2021.“We are thrilled to welcome Kathryn to the LACMA family,” said David Childs, the curator and head of the LACMA art collection. “Kathryn brings a wealth of experience, knowledge, and proven ability to build upon Marciano’s legacy of delivering world-class exhibitions and programs. We are confident that she will continue to champion the program and our artists in concert with Marciano’s vision and leadership.”This program, which has generated $2 billion for the institution in a five-year cycle, boasts thirteen Academy Award–winning artists, including", "The next Biennial should be in 2022. The date for the venue, which is currently being renovated, has yet to be announced. \n\n\nThe American Ballet Theater (ABT) in New York has appointed Peter Green, who has served as the company’s artistic director since 1997, as its next director. He will take the helm from Mike Greenberg, who was appointed as executive director last May and has since led the company through a tumultuous decade. During his tenure, Greenberg has overseen a dramatic expansion of the company’s footprint, bringing its current theater to twenty-four locations and expanding the company’s production schedule by more than three hundred percent.Green’s first act as director will be to lead the company through the fourth annual--known as the Budget Tour, which will run from March 14 to March 16. During his tenure, Green has expanded the company’s production schedule and introduced new works by Richard Diebenkorn, Robert Rauschenberg, and Diane Arbus. He has also introduced new genres such as the ballet of the Paris Opera House, as well as contemporary works such as American Ballet Theater: A Modern Opera, 1911, by Martha Graham, and American Ballet: The Musical, 1947", "The next Biennial should be held in 2020. “An exhibition of the work of König, Kunsthalle Basel, and the Exhibition at the Museum of Modern Art in New York has announced that they will be taking their works back to Basel, with the caveat that the museum will be closed for a period of ninety days. The move is expected to be made in the coming weeks, and the first show, titled “Kunsthalplein,” will open at the Museum of Contemporary Art, Los Angeles (MoCA) on September 7. The show will be followed by an exhibition of König’s multi-million-selling works at the Basel Art Museum in 2022.Institutions wishing to stage the exhibition include the Museum of Modern Art in New York (MoCA), the Museum of Contemporary Art, Los Angeles (MoCA), the Museum of Contemporary Art, New York (MoCA), the Museum of Contemporary Art, New York (MoCA), and the Museum of Contemporary Art, New York (MoCA).The museum is not planning to shutter its doors entirely. The museum—which recently announced its intention to hold a limited edition of the artist’s works next year—is", "The next Biennial should be held in the spring of 2020.\n\n\nThe Cologne Biennial, which is currently on hiatus due to the coronavirus, has announced that it will resume in the spring of 2021. Its new theme, “Justification: From the Existence of God to the Existence of Man.” The organizing committee members cited the upcoming exhibition, “Between the Sun and the Moon: The Future of Creation,” as the reason behind the postponement.Featuring paintings and sculptures by twenty-seven artists from Morocco, Tunisia, and other African countries, the exhibition’s seventy-third edition, “Between the Sun and the Moon” will feature contributions by forty-five artists from the Middle East and North Africa. The biennial’s curators also explained that the theme of the twenty-second edition, “From the Sun to the Moon,” was originally “justification,” but was changed to “hope.” The sixty-fifth edition of the exhibition will take place at the Museum Bergamaschi, Milan, from March 22 to March 27.\n\n\nThe Italian government is planning to give $585 million to the survivors of the devastating tsunami that", "The next Biennial should be held at least once a year, and should be organized with the participation of the local communities of the city of Barcelona. This will provide an opportunity to display the amazing diversity of artistic traditions that have been developed in the city over the past twenty years, while highlighting the central role of the arts and culture in inspiring and mobilizing social action. “The city of Barcelona’s artists and cultural workers have been transformed since we began this work nine years ago,” said Andreu, who is also the director of the Biennale de Barcelona. “They are now at the stage of receiving a new federal funding package for their annual activities, which includes a further five years of support. The next editions of the biennial will be held in 2021 as well as 2021 as the 2020 Barcelona Olympics. The next venue for our biennial is the Museum of Modern Art, where we will present the sixteenth edition in 2024. I look forward to working with the artists, collectors, curators, and institutions of Barcelona, and am convinced that the future of the city, and of Barcelona in particular, lies in the city’s future.” \n\n\nThe museum that attracts more than 1.2", "The next Biennial should have a theme that commemorates the first and last years of the exhibition. We hope that the theme will not only be a reflection of the themes of the previous years but also of the upcoming years.”The festival has faced financial troubles in recent years. In February 2018, it announced that it would be forced to close its doors indefinitely. President Donald Trump cited the financial difficulties as a reason for terminating the contract of artist-in-residence Ed Levine, who has served as the Biennial’s final artist-in-residence since March 2019, after he failed to secure the necessary funding for the event. The artist was scheduled to take up the post in March.\n\n\nThe National Art Museum (NAW) in Washington, DC, is planning to begin accepting visitors beginning on Monday, March 22, 2020. According to the Washington Post, the institution—which has been closed since March 14 due to the Covid-19 pandemic—is participating in the reopening of other local, state, and federal museums and cultural institutions across the city.Visitors will be able to enter the museum through two separate entrances: one on the north side of the museum, and the museum’s current visitor entrance on the", "The next Biennial should focus on issues of memory and memory in art and how this affects our relationships with the past and the future. We have much, much work to do.” The 2019 event, titled “Collections,” will include work by thirty-eight artists, including Alberto Barbera, Adriana Iannone, Araceli Vasquez, Rylan Clark, Cecilia Vicuña, Alessandra Zingaretti, Mamara Zingaretti, Leyden Wijers, Tina Wijers, Ayesha Zulfiqar, Andrea Sytsma, Luzia Tunga, and Arthur Zuijmen. \n\n\nThe National Gallery in London has issued a statement condemning a recent publication in which a team led by American designer Igor Škovitzki divided the human body into two distinct parts: the head and the body. The introduction of the proposed division into two parts was made in the book The Body Divided: The Modern Body & the Art of Body (2017), which explores such divisions as plasticity, division, and empathy. Škov", "The next Biennial should take place in the summer of 2021 and will also introduce the first guided tours of the site. The exhibition will be an attempt to re-create an exhibition space for the upcoming exhibition and will include the work of six artists: Malawian artist Rebecca Ngawangu, Yoruba artist Kiki Warhol, Algerian artist Arar Bakri, Tunisian artist Salah Sultana, and Chinese artist Zou an.\n\n\nThe Agora Milano in Venice, Italy, has received a gift of twenty-two paintings by Simone Leigh, whose skill and commitment and commitment to the Arts have made her a master of the Modern and Contemporary art. The works by Leigh, who has had solo exhibitions at the Museum of Modern Art (MoMA) in New York, the Museum of Modern Art (MoMA) in London, and the Museum of Modern Art (MoMA) in Los Angeles, are part of the Museum’s collection of works that have undergone major restoration in Italy, including her famous “Art of the Past” (2017) at the Museum of Contemporary Art, Los Angeles, and her “Atlas” (2018), which is a massive painting that measures 5,900 feet across", "The next Biennial should be hosted in the city’s Museum of Contemporary Art, where it will feature work by a group of artists from the United States and many other countries. It will also include the first solo exhibitions of work by artists from Brazil, China, and Mexico. Artforum will announce the artists and their titles for the 2019 edition in the coming weeks. For more information about the upcoming exhibition, and to register to attend on September 9, visit the Festival’s website.\n\n\nThe National Gallery of Art (NGA) in Washington, DC, has received a gift of twenty-four works from ArtPrize. The auction, which launched last week, was held at the institution’s new headquarters in downtown DC. The works, which were selected by the NGA’s judges, were selected from a pool of nineteen artists who were nominated by a jury comprised of Todd Binion, director of the National Museum of African Art in Atlanta; Joseph K. Walsh, director of the Robert Rauschenberg Foundation in New York; and Adrian Wojnar, director of the Art Institute of Chicago. The twenty-four artworks will be exhibited in a new exhibition, “The Future Is Present: Artists and", "The next Biennial should be held within two years. \n The institution has hired German architect and urban designer Ediger Percival to design and live-work at the museum. Percival will work with Howard Brown, the chief curator and director of the Biennial, to establish an exhibition space for the exhibition of the exhibition “Secrets of Our World” (2019). The show will be a collaboration between him and Hoa Nguyen, the director of the Biennial. \n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Jennifer Zullo as its next director. Based in Los Angeles, Zullo will lead the institution through its multi-year reopening, which will be followed by its Summer/Fall 2019 release of the new Kenneth Williams–designed exhibition “Are We In The Same Place?,” which will be presented by Bruno Latour. She succeeds Christopher Wool, who retired in February 2020 after ten years at the helm of MoMA.“After an extraordinary tenure, I’m incredibly excited to embark on a new chapter as director of MoMA,” Zullo said. “I’m committed to the Art of the Week program, building", "The next Biennial should be held at least ten years from now.”\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Laura Aguilar as its interim director, effective immediately. Aguilar will be responsible for overseeing the museum’s public programming and general operations until a successor is appointed. In her new role, Aguilar will work closely with the board of trustees, which is made up of Andrea Berlind, Michael Collins, Vito Acconci, and Thomas Campbell, and will take up her new responsibilities on March 8.“Laura has been a visionary leader of MoMA since she was named the institution’s interim director in March 2018,” said board president Daniel H. Weiss. “Her expertise in and commitment to supporting our artists and mission make her uniquely qualified for this critical role. She will continue to play an integral role in transforming the museum into a vibrant, international cultural destination.”Aguilar previously served as the interim director of the Metropolitan Museum of Art in New York from January 2019 to January 2021. During her tenure, she oversaw an expansion of the museum’s public art program and oversaw the museum’s transformation into an artist-in-residence program", "The next Biennial should focus on the work of artists of the Pacific Northwest, focusing on the history and development of the art of the American West, particularly in the Pacific Northwest. The exhibition should reflect the diversity of the Pacific Northwest, and should begin with a conversation about the Pacific Northwest through a history of the region.”The 2017 tour, which was curated by the Seattle-based curator Dave Davies, began in the Pacific Northwest with a presentation of work by artists such as the late Norman Rockwell, who depicted the region in a wide-ranging, multihued painting titled Culver City, 1998, that was painted in his own backyard; and then moved to the interior, to the Honokamalai Indian Reservation in Washington State, to paint the interior of the reservation, including the artworks of local artists such as J. Frank López Rivera, who created the landmark work Dreams of a Grandmother, 2000, which is on view in the exhibition “The Art of the Grandmother” until September 24.The twenty-two-city tour will run in both English and Spanish through the end of March 2024. The full list of participating artists is as follows:Ceína Barroni,", "The next Biennial should include a survey of the contemporary art of the Americas; a presentation of a selection of works by an emerging or established artist from the Pacific and Atlantic Oceans; and a discussion of the possibilities of art in the twenty-first century.”The 2018 event, titled Biennial of the Americas, was held on December 3–January 3 at the Palawan Cultural Center in Manila. The winning artists are: Alejandra Iannone, Saúl J. Arantes, and Jaroslav Reznik. The 2019 edition of the event will be staged at the Palawan Cultural Center in December 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that a group of artists and activists have created an online petition in protest of the museum’s sale of their works, and the institution’s relationship with the controversial Dakota Access Pipeline. The petition reads: “As artists and activists, we are concerned about MoCA’s current collection policies, as well as about the museum’s association with the Dakota Access Pipeline.”The petition is organized by the activists Artists for a Democratic Statement on MoCA’s Sale of Art and the Dakota Access Pumps, a group that", "The next Biennial should begin on April 23 and conclude on May 25. The first, scheduled for March, was canceled due to the Covid-19 pandemic. The second, originally slated for March 31, has been moved to May 23–March 26. The third, originally slated for March 27–March 31, has been moved to May 29–March 31. The fourth, originally scheduled for March 12–March 20, has been moved to May 25–May 28. “We are acutely aware of the impact that the Covid-19 pandemic has on our team and our community, and we are actively working to minimize impact on our artists and on our exhibition programming,” the Biennial’s director, Rebecca Duarte, said in a statement. “We are also actively working with our stakeholders to support them through this challenging time.”Duarte said that the theme for the 2020 iteration of the Biennial is “Living Together, ” “And Where Do We Go from Here?” The exhibition will feature works by seventy-three artists, including Jo (Jen), Jova (Jova Solter), and Sauscha (Sauscha Solter), and", "The next Biennial should be held in 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has announced that it is reopening to the public on January 4, 2021, after being closed since March 20, 2021. Its reopening will coincide with the opening of the museum’s first new work since 1999, the work of Australian artist Emily Hall. The exhibition will open with a reception for artists and staff at the museum on January 5, 2021. The event will be followed by a public tour of the museum on January 7, 2021.“MoCA is reopening with more optimism than ever,” said David Karp, who became director of the museum in November 2017. “We are creating a new model for a museum, one that will emphasize both long-term strategic vision and an architecturally ambitious collection, both of which are core tenets of the successful long-term plan for the Art Museum. We are rethinking our future not only to accommodate future needs, but how we think about the future and what we want the museum to become. We will continue to innovate and grow with new and different ideas for the Art Museum, and will continue to present works that tell the extraordinary stories of our time.", "The next Biennial should be held in the spring of 2021. Koenig’s request for an extension was granted last year. On Tuesday, February 15, the institution announced that the work would be returned to the artist on March 8.When the exhibition was first organized in 2010, Koenig was not the artist selected by the British–born artist Theo van Doesburg, the director of the Biennial Museum Stuttgart, but was instead selected by a committee chaired by Heribert Koenig. Van Doesburg had commissioned Koenig to create a new work for the exhibition, which was originally titled “Theater of Operations,” which examined the history of the conflict between art and war. Since the exhibition was moved to a new location in 2013, it has returned to the Museum Stuttgart.Since the show was canceled in 2015 amid the ongoing conflict in Ukraine, Koenig has continued his residency at the museum. He has been a member of the board of trustees of the Biennial Museum Stuttgart since 2018 and has had exhibitions at the museum. The deadline for the next exhibition will be March 23.\n\n\nCanadian artist and philanthropist Katherina Beck has been named the recipient of the", "The next Biennial should take place in 2022. Artforum is distributed by S&S Media, Inc.A year ago, the Biennial of Modern Art (BMA) in New York staged a program where two hundred artists were invited to present their work in January and February. The exhibition was curated by Barbara Steinman and featured work by artists like Arnold Basel-Banerjee, John Gaeta, Olga Gallalva, Margot and Patricia, and was organized by Frederick Kreuger and Paul Mpagi Sepuya and Kathryn M. Bradley. Last year, the BMA collaborated with the New Yorker on a special exhibition at the Museum of Modern Art titled The Bonacci Mystery, and in 2013, the museum created The Biennial Experience, a series of performances, screenings, lectures, and workshops that drew from the museum’s holdings. \n\n\nThe Hirshhorn Museum and Sculpture Garden in Washington, DC, has hired Sara Fogle as its first director. Fogle comes to the institution from the Smithsonian’s National Museum of African Art, which she has led since 2011, and will assume her post on January 6, 2021.", "The next Biennial should be held in 2020. The twenty-first—which will be hosted by the Institute of Contemporary Art in Paris in 2022—is currently on hold due to a lack of funding. The question of whether the exhibition should be held in the capital, where some six million people are expected to visit the museum each year, has been debated for years. While the institution is committed to holding the exhibition in the city, it has stated that it wants to evaluate the proposal for its economic and logistical feasibility and will assess the feasibility of holding the exhibition at a later date.If the institution decides to hold the exhibition, it will be in competition with the Tel Aviv Museum of Art for a deal worth $1 billion. The deal, which will also include the construction of new galleries and the construction of a new museum, is expected to be completed by 2021. The Tel Aviv Museum of Art, which has been operating on a limited basis since 2013, has said that it will remain open until the end of the year.\n\n\nThe artist and activist Hetain Akram, a Bangladeshi American, was charged with hate crimes following an attack on a Muslim woman by two white men in New York City last month. The incident, which took place", "The next Biennial should take place in Frankfurt in May 2020.  The exhibition will be held in conjunction with the biennial to which it is affiliated, the Milan Biennale.\n\n\nThe Palestinian artist Walid Raad, whose work embodies the struggle of the Palestinian people to defend their homeland against Israeli occupation and dispossession, has been selected as the winner of the New York City Artadia Award. He will receive $6,000 in support of his residency at the Art Institute of Chicago and $5,000 in support of his work in the United States.Born in Jerusalem in 1977, Raad first studied at the School of the Art Institute of Chicago under the tutelage of Abdullah Oweis, who later taught at the University of Pennsylvania, where he received his Ph.D. in 2006. His work has been exhibited at the Javits Center, the Grant Museum, the David K. Paul Getty Museum, the Museum of Modern Art, the Metropolitan Museum of Art, the Los Angeles County Museum of Art, and the Solomon R. Guggenheim Museum. The honor was presented by New York City Mayor Bill de Blasio and was also presented to the Israeli artist Yair Hochner, who is currently incarcerated for war crimes", "The next Biennial should take place in 2021, according to a statement by the Council of the European Union.  Although neither the new art nor the organizers of the biennial are named, they are believed to be based in the Netherlands and Germany and were not connected to the local government in any way. The committee will be comprised of representatives from six Member States: Belgium, France, Italy, the Netherlands, and Poland. “This is an unprecedented tragedy,” said Commission president Jean-Claude Juncker. “I express my deepest sympathy to the family and friends of the victims of yesterday’s terrorist attacks. We hope that the next Biennial will be an indelible experience of the museums in Brussels. We call for a new dialogue between the collections of the museums and the city of Brussels, in order to address the challenges and challenges that the art scene faces at the moment.”For the biennial’s inaugural edition, the organizers delivered a virtual reality version of the event, called “Wonder of Wonder,” in collaboration with the City of Brussels, the National Museum, and the Louvre. The theme of the event was “Art and Memory; Politics and Religion; Technology"]