["The next Biennial should be held in 2022. A 2019 survey by the British artist and curator Mary Beard, who was invited to present a project for the show, labeled the program “dead,” a phrase that describes a state of suspended animation. For the next iteration of the exhibition, Tate will take on a new theme. The 2020 edition will focus on the role of the artist in shaping cultural narratives. The 2021 edition will be curated by Việt Nam, the Vietnamese American-Italian biannual winner of the Turner Prize, and will run from March 21 to March 22.\n\n\nThe New York City Department of Cultural Affairs (DCLA) announced today that it is expanding its efforts to support and retain the architectural and design work of American visual artists by inviting them to present interdisciplinary projects and exhibitions at the museum. Among the proposals being presented are projects with the city’s cultural and design staff and the public, such as “Pulp Fiction: The Art of Fiction,” a group exhibition at the DCLA’s Design Center and “Visual Art: How Design Affects Life” that will take place at the museum on November 16–December 3, 2020, and “Alan Ducat:", "The next Biennial should be held in the spring of 2022. The exhibition will focus on women artists and institutions. Curator Monica Caputiña-Borjas will serve as the inaugural curator. “The Biennial is not only a history of the artist’s present, but also an exploration of the history of the present,” Caputiña-Borjas said in a statement. “Our theme this year is the history of the contemporary museum. We will not only present the best contemporary art from around the world, but will also engage with the creative and technological accomplishments of the museum’s visitors and the world at large.”The 2020 edition of the Biennial featured work by more than 500 artists and institutions, including a performance by Russian designer Oksana Gostin (Her and Her Children), a painting by French sculptor Cézanne-Louis Danil, a sculpture by the Russian artist Anna Federovskaya, a film by the Swiss filmmaker Paul Haggis, a documentary by Mark Rylance, and a documentary about the Valdivia Trujillo–designed exhibition space the Guggenheim in Venice.\n\n\nThe British Museum in Paris is set to", "The next Biennial should take place in 2020, he said.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is overhauling its collection of nineteenth-century art in an attempt to prevent future exhibitions and memorabilia sales from being compromised by the coronavirus. The institution’s collection was recently selected for a major exhibition at the San Francisco Museum of Modern Art (SFMoMA), which opened on August 19, and is now undergoing a reopening of the museum.In a letter published by the museum on August 5, MoCA director Marc Glimcher wrote: “The future of the collection is at risk due to the violent onset of the Covid-19 crisis. ... The future of MoCA is at stake. . . . Our primary goal should be to ensure that the future exhibitions and purchases of the collection are safe. If we do not do this, the future exhibitions and purchases of MoCA will be compromised.”In an attempt to reduce the risk of further sales to the public, the institution is capping the number of exhibitions it will present at any one time at one venue at a time. Purchases of works on loan from the collection will be suspended through August 19, and exhibitions in the collection will", "The next Biennial should focus on the history of modern art, with a focus on the history of photography. The exposition will also consider how photography has affected and transformed the art of the present. The theme of the 2020 event is “Photography: From Its Origins to Now” and will be announced soon. The 2020 event will be held at the Architecture Museum in Prague, the Museu de Arte de Prague, the National Museum of Photography in the Czech Republic, and the National Museum of Humanitarian Aid in Prague. \n\n\nThe Gill Gallery in London announced today that it is moving the fourth edition of the Gill Awards, which have been held at the Gill since 1932, from February 19–March 7, 2020, to March 13–March 15, 2020. The move follows the announcement of a new partnership between the gallery and the National Poetry Library. The event, titled “From Virgil to Kafka: The Gill Awards” and curated by Loris Gackenbach, will be held at the National Poetry Library in Kingston, UK, and will award $50,000 in prizes on February 19–March 21. “The Gill Awards’ importance remains", "The next Biennial should be held in 2020; the next might be relocated to a different city, but the theme might still be the same—'Eco-Socialism,” Kamala Harris, the director of the Smithsonian’s National Museum of African Art, told the Art Newspaper.The panel that chose the theme for the 2020 event, which will kick off on January 16, was made up of Arash Fayez, director of the Alabama Museum of Art; François Julien, director of the Pont des Arts et Lettres in Paris; and Yinka Shonibare, the director of Pyeongchang Art Museum in South Korea. The two finalists were Shimon Al-Shirazi, the former head of Sudan’s Sudanese Embassy in France, and Zoya Ndzube, the director of the Fondazione Cinéma. The 2020 edition of the festival will be held at the city of Nairobi’s African National Museum (ANM), the capital of Kenya\u0097the Nairobi Arts and Culture Festival already confirmed its participation. The first edition of the event, held in 2015, took place between February 21 and February 23 and featured the work of", "The next Biennial should be held in 2020, and the twenty-first in 2021. The biennial will be hosted by the museum in partnership with the Noguchi Administration, the Pérez Art Museum Los Angeles, the Griffith Museum of Art, and the Getty Museum. It will also feature the work of Mana Contemporary Art, the Pérez Museum of Art, and the Los Angeles County Museum of Art. The first episode of the new series will be a retrospective of work by Lucio Fontana, which will take place at the institution in October 2020. The biennial will also feature a new selection of artworks by the likes of Hammer, Michelangelo, Mondrian, and Pérez Art Museum Los Angeles artist Cristina Conte. The 2020 event will mark the fifty-fifth anniversary of the museum. “The museum is already a major draw for visitors to Los Angeles, and the 2017 theme of the biennial was ‘Where are we?’ We are still finding the right balance between capturing the spirit of our city and the possibility of building a museum that is both a space for dialogue and a place for reflection,” said museum director Christopher Howard. The choice of the P", "The next Biennial should be held in 2020, according to the museum’s president, Amada Cruz. The institution has announced that it will hold a media preview of the 2020 edition at the Santiago Bernardo Reina Sofas in March.\n\n\nWritten by: Christopher Jones, editor and curator; Charlotte Côté-Löve, curator; and\n\nAdam Edwards, adjunct curator.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Thomas Heather as its new interim director. In his new position, Heather will oversee the operations of the museum and provide leadership as it transitions to a new director, Gail Simmons.“We are thrilled to welcome Thomas back to the Museum of Contemporary Art as he is a passionate and talented leader in our work,” said Museum Director Elizabeth Anne Fusi. “He is both experienced and talented, and has demonstrated an ability to expand both the scope of the works we do and our ability to connect with our communities and partners. His work has given us a wonderful opportunity to think about art as a tool of empathy, collaboration, and change.”Prior to joining MoCA in 2012, Heather served as a curatorial assistant at the", "The next Biennial should be held in 2021.\n\n\nThe Museum of the City of New York has appointed Katherine Teitelbaum, who has served as a curator at the museum since 1983, as its next director. She succeeds Carol Brown, who has helmed the museum since 2002.“Katherine has been instrumental in our transformation from a city-funded institution to one that is able to operate as a nonprofit entity without financial support from the city and continues to thrive,” said city council president Gale A. Brewer. “Her vision, commitment to diversity, and ability to bring diverse audiences together to present exceptional exhibitions and events set the standard for how we think about and present art in our cities.”Prior to joining the museum, Teitelbaum served as a curator at the Serpentine Galleries in New York and has been the curator of contemporary art in the gallery space the Museum of Modern Art in New York since 1999. The gallery closed in 2012 after a decade of serving as a venue for work by artists such as Richard Diebenkorn, Mark di Suvero, and Adam Pendleton.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Gavin Brown as its next director and CEO. He", "The next Biennial should be held in the autumn of 2021. The inaugural edition, which opened in March 2020 and ran until March 22, 2021, featured collaborations between twenty-four artists, including James Turrell, Yelena; Guarana Gunnars, Tobias Karlsson, Katherine Lambert, and Vincent van Gogh.The 2018 edition, which was curated by Pia Camil, featured Organizations such as Badr Hariri, Naved Abbas, Ebony Ishaq, Mirwaiz Alireza, Pindar Shani, and Herb Solow. The biennial’s prize, awarded in November 2018, was Waleed bin Nasser. The Hong Kong–born, New York–based artist gained recognition for creating works that were both large-scale and experimental works in a project for his 2015 exhibition “Alter Image: A Biennial for Art and Life” at the Hong Kong Biennale. The exhibition was nominated for a Grand Prix in Asia, an award at the Venice Biennale in the United States, and the Prix Meret Oppenheim in Germany.The 2019 edition,", "The next Biennial should take place in March 2019. The 2019 edition will be titled “HELOBILLE,” a reference to a famous scene in the film Fargo. The California-based artist will create a new work for the event, which will be held at the Art Institute of Chicago (CAIC), Chicago. The biennial will be hosted by the artist and will be organized by a team comprising John Baldessari (director of the Hammer Museum), Kathryn Biggs (director of the Los Angeles County Museum of Art), and Ebony Mitchell (professor of art history and art history at Columbia College Chicago).“This is a time of huge change,” said Baldessari. “The question now is how we respond to it. What sort of art, what sort of politics, what sort of future can we create for ourselves and our planet. That is the question of the biennial, and that is the question of the series.”\n\n\nA group of artists and collectors are urging the Swiss government to create a new digital platform for museums and artworks, which currently lacks an international coalition and relies on a small network of experts to advise them, in an attempt to", "The next Biennial should take place in 2021, though the date has not yet been set.\n\n\nThe Smithsonian’s National Museum of African Art (NMFA) in Washington, DC, announced today that it will no longer host the controversial exhibition “The Death of Black Power: American Art and Black Liberation” next month. The move follows a wave of protests against the show, which examines the legacy of black liberation theology, and has drawn condemnation from politicians, including President Donald Trump, who have described the museum’s exhibition “an affront to freedom of expression.”In a letter addressed to museum director Daniel H. Weiss, the institution’s board of trustees, which advocated for the exhibition’s cancellation, said that “the current exhibition, ‘Death of Black Power: American Art and Black Liberation” constitutes ‘a flagrant repudiation of the lifeblood of our country, the ‘Black Power’ movement.’”The letter further argued that “the show has been an abdication of the role of the museum to challenge and apologize for the radical ideas and revolutionary art of the ’70s and ’80s, and has been a sellout", "The next Biennial should be held in 2020. The institution has since been asked to provide a list of forty artists who will participate in the event. The full list is as follows: Artists: Alberto Barba, ArgentinaGiancarlo Ferro, SpainRaffaella Castellani, ItalyTania Bruguera, ItalyRicardo Martínez, SpainJavier Acosta, ColombiaHélio Otero, SpainMaximilian Marché, GermanyJorge Fernández-Campos, SpainAntonio Gomes, SpainEva Pape, ItalyLorenzo Pollak, ChileOrlando Cuevas, SpainUmar Farid, IranValeria Rosales, MexicoHazel Levey, MexicoChris Maritz, USAAmanda Palmer, United StatesHerbert Simon, United StatesJadelless Wilson, Texas\n\nThe second edition of Art in the City, scheduled to run between June and September 2020, has been postponed due to Covid-19. The fourth edition of the celebration, to be held in October, was also put on hold. “Billionaire collectors are rallying to protect their businesses from the pandemic,” said Stewart Andrew,", "The next Biennial should take place in Tokyo in 2020. \n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles (MCA), has hired producer Olu Olu as its next director. Olu will be responsible for overseeing the development and execution of a new master plan and for developing and implementing new programs that will engage with current and future issues and opportunities within the cultural landscape.“Olu’s experience and expertise provide a key platform to engage with issues and challenges that affect our city and region, and we are pleased to have her join our team,” said John McCarthy, director of MoCA. Olu is currently the Deputy Director of The Works, an organization dedicated to the advancement of the art of contemporary art. In her new role, Olu will oversee programming that reflects and reimagines the MCA’s mission.“We are incredibly proud of the work that Olu has done to shape the Museum’s mission and legacy, and are grateful to our grateful partners and supporters,” McCarthy added.\n\n\nThe Los Angeles County Museum of Art (LACMA), which was forced to evacuate its staff and the public from its location on Wilshire Boulevard in Venice on February 15, has", "The next Biennial should be on January 3, 2022. In a statement, the exhibition said it is “focused on the life of a woman, not the life of a man, and we are happy to continue this topic with a new exhibition that reflects the convergence of pleasure and sorrow.”\n\n\nThe SculptureCenter in New York has been awarded a $1 million donation from the Saratoga Foundation. The gift comes from a grant made by the Sculpture Shop of the Henry Luce Foundation to begin with a gift of $500,000 in support of a teaching and research center dedicated to the study of the human body and its relationship to the environment. \"The gift is an incredible honor to be able to make, and to continue the work of, the great Henry Luce, while continuing to create with the same dedication and enthusiasm that he taught us to create,” said Sara Mone, senior vice president of the Henry Luce Foundation. Commenting on the gift, Kate Carnell, president and CEO of the Henry Luce Foundation, said: “The grant enables the SculptureCenter to continue to advance its mission to support and foster the work of our distinguished", "The next Biennial should take place in 2020 and the biennial will continue to run through March of 2021. In both cases, the exhibition will be staged at the Art Institute of Chicago (AIC) in partnership with the Chicago Architecture Center (CAC) and the Segal Gallery of Art in New York.Chris Williams, the executive director of the Biennial’s board of trustees, said: “We are thrilled to collaborate with the CAC and the Segal Gallery of Art to present the inaugural Biennial, and we look forward to many beautiful years ahead. We thank Nara M. for her leadership and vision both as a curator and as a fellow curator, and we wish her and her team well.”\n\n\nAs New York City heads into Phase 4 on Wednesday, April 19, and as the city braces for another massive dust-up over whether or not the controversial Dakota Access Pipeline—the controversial, $3.8 billion project that would have subjected North Dakota’s Bakken and Three Forks oil fields to dangerous construction and transport—can go ahead, a group of cultural organizations has launched an online petition.Led by the New York Department of Cultural Affairs (DCLA), the group said it wants the state", "The next Biennial should be held in 2019, and the Flemish Biennial will be held in 2021. The Swedish Biennial will take place in 2022.The Biennale of Venice, which will be held in February 2022, and the Frieze Art Biennial, which will be held in March 2022, have yet to reveal exact dates for their 2020 editions.\n\n\nThe São Paulo–based UOVO Biosystems (UPOVO) has announced that it is expanding its partnership with the New York–based nonprofit, Shelter, to include new initiatives that will address climate change and the environment. The organization will now receive up to $65,000 every year for two years from the wealth of the organizations that created the first version of the São Paulo Biennial.“In the face of climate change, we have to move forward,” said UOVO CEO Sara Zebroš. “The work of UPOVO, which has been done since 2006, is housed in our own archives, and is preserved as a treasure trove that will help us face this crisis together.”UPOVO’s new initiative, “Climate Refugees,” will involve the organization receiving funds in the 2020", "The next Biennial should focus on the history and contemporary-art production of the former capital of the Berber people; it should also consider how their traditions are being threatened by the global spread of Salafism and religious extremism, and should consider how to provide a platform for innovative and experimental artistic practice in their cultural space.”\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Ron Gorchov, a longtime director of the Brooklyn-based nonprofit the Pushcart Center for Native Art, as its new deputy director and curator. Gorchov comes to the institution from the Brooklyn Museum, where he has served as an assistant curator since 2008. He succeeds Marc Glimcher, who announced last month that he is stepping down from his post after twenty years to pursue new opportunities and to prepare for the 2020 reopening of the Brooklyn Museum.Gorchov succeeds Ian Katz, who served as director of the Brooklyn Museum from 2011 to 2016, and will begin his new role on January 6, 2021. “The museum has a long history of critically engaging diverse, ambitious, and experimental art projects, and in recent years has become a model for how museums should be run,” said Gorchov. “By collaborating with", "The next Biennial should aim to establish a new level of international cooperation between the Museum and the Biennial, and perhaps to promote the work of young artists. A revised exhibition schedule, curated by a group of US and international artists, will be presented at the 2020 exhibition.The 2020 Biennial will take place at the New Museum, New York, from October 26 to November 1, 2020. The full list of participating artists is as follows:Alexey & Boryzgirena (Russia)Alan Collins (United States)Alexey & Anna (Australia)Alberto Cuevas (Mexico)Aruna Dua (India)Mona Eshwari (India) Aleksandr Gabl (India)Bhenji Gal (India)Stephen Gough (United States)Kelly Garbutt (United States)Emma Gal (Italy)Jasmina Gonçalves (Brazil)Zinaa Gallego (Brazil)Louis Godin (France)Hélio Gomes (Spain)Brian Gibson (Canada)Caroline Grant (United States)Stefan Grosch (Germany)Kiki Gallery (New York)Artists:Claudia Iglesias, B. Álvaro & H. Gomes (", "The next Biennial should take place in 2022.<|endoftext|>Tupelo, Mississippi–born, Los Angeles–based hip-hop artist, producer, and educator Tupelo, a.k.a. Tupelo Auto’s (TAA), is suing the Tate Britain and the Los Angeles County Museum of Art (LACC) in an attempt to secure the release of her son, who was taken from her and her family by the Los Angeles Police Department (LAPD) in September 2016 and died of his injuries three weeks later.In a complaint filed on December 31 in the Southern District Court of the Northern District of California, which also accuses the LAPD of violating his rights by using excessive force and violating his civil rights by depriving him of his constitutional right to counsel, the family claims that the institution failed to protect their son by not deescalating the situation and by failing to properly supervise Olu Olu, who was the officer’s partner at the time.The complaint also alleges that the LAPD and LACC violated the rights of their son by withholding exculpatory evidence relating to the case and by failing to properly train officers on de-escalation techniques and how to properly use a Taser. The lawsuit seeks compens", "The next Biennial should consider themes of the past and present in a light most relevant to the biennial’s mission, with the objective of creating a sense of historical progression, of the works of the year as a whole and of the significance of the work in question.”The 2019 event will be held at the Brooklyn Museum in New York, and will run from April 14 to April 21.\n\n\nThe Israeli Ministry of Culture has announced that it is planning to allocate $1.1 billion for the construction of new museums and cultural sites in the country. The funds will be dispersed through three categories: design, construction, and management.In a presentation titled “Museums: The Future of an Important Israeli Artifact,” presented by Culture Minister Miri Regev at a ceremony at the National Museum of Israel in Jerusalem on November 26, the minister said that the funds are needed to “fill the gaps,” particularly in the field of contemporary art, and that the country must invest more in its human and cultural capital. She added: “These new funds will be a signal of the government’s commitment to strengthening the cultural sector, recognizing the importance of the field in Israel’s ongoing campaign to build", "The next Biennial should be held in the first quarter of the next year, with the aim of identifying the most important principles and guiding the development of the exhibition in the next twenty to thirty years, and I look forward to working with the artists, curators, and writers of our time.”The exhibition will be staged in the same building as that of the Museum of Modern Art (MoMA), and will inaugurate a new multi-million-dollar, seventy-one-thousand-square-foot museum, the Museum of Contemporary Art (MoCA), that will house the collection of artists from the Guggenheim and the Metropolitan Museum of Art. The museum, which is currently undergoing a $1 billion expansion, is currently working on the design of a new Guggenheim museum and is expected to open in 2023.\n\n\nThe Arizona Museum of Art (AZMA) has received a gift of twenty-four works by the late Lebanese artist Walid Jumail, who was known for his dramatic photography exhibitions that combined dramatic color photography with geometric illustration and textured miniatures in order to create surreal and haunting images.The gift includes works by artists such as Rima Khalili, Yassir Arafat, and Fadi Al", "The next Biennial should have been held in 2019, but was postponed because of the Covid-19 pandemic. The next will be held in 2023. The third will be staged at least once a decade. The fourth will be staged at least once a century. The Fifth will be a biennial of art that was founded in Düsseldorf, Germany, in 2006 and has a current output of fifty works. The Seventh will be a memorial that will be staged at least twice a decade, and will be curated by an American artist and directed by an American director.The Eighth Biennial will be held in the autumn of 2021. The Ninth will be staged in October 2022.The Tenth will be a biennial of new art that will be curated by an American curator, and will be curated by an American curator. The Eleventh will be an exhibition of fifty artworks by the artist Joe Sacco at the Museum of Modern Art in New York.Sacco was born in New York City in 1952 and moved to Los Angeles in 1969. In 1971, the following year, the American Museum of Natural History in New York staged his Tuscan solo, Tuscan Color, at a time when the institution was", "The next Biennial should select a chair and will announce the schedule, which will run from March 15 to March 22. The theme will be “Intersection of art and technology.” The 12-person jury will consist of Andreas Kähler, director of the Academy Museum Frankfurt; Oliver Pfennig, head of the University of Mainz; and Olivier Verlet-Barré, director of the same institution in France.\n\n\nThe Bechdel test, which has historically been considered the gold standard in the art world, has been \"debased\" by a newly organized organization that will test artists on their ability to write narratives that reveal their own anxieties and difficulties. The organization, called the Bechdel Test Center, will be housed in the same building as the Museum of Modern Art in New York and will be staffed by two staff members. The center will be modeled after the famed Cooper-Hewitt’s Studio in Harlem and will be cofounded by Charles and Julia Bechdel.“We felt it was important to start this project with a positive perspective and an open mind,” said Julia Bechdel, who succeeded her father as the organization", "The next Biennial should focus on the role of the National Museum of the African Diaspora (Namdi) in the West, and Iwan Wiradjuri’s work on the African diaspora.  From January 22 to January 25, 2020, the museum will stage six exhibitions, including a solo show of works by Wangechi Mutu (2019) and a show of Wangechi’s work on paper. The exhibition will also include a short film by Wangechi’s son, Ntsaba Wangechi; an excerpt from an interview with David Wilcock, the British novelist and playwright; and a biennial of contemporary artists in conjunction with the London-based artist-run space The Library Street Collective (LSC).Wangechi’s first exhibition at the museum in 2019 was a retrospective of his work Locks, a series of seven photographs depicting the interior state of a lock in an African country. In the exhibition, Wangechi described his studio as a “microcosm of African art.” In the film The Hand in My Pocket, Wangechi draws from his own personal experience to explore the malleability and mobility of the African diaspora", "The next Biennial should take place in 2020. The institution has also launched an online catalogue, “Behind the Curtain: A Biennial History,” which can be ordered from www.arthist.org.\n\n\nThe New York Public Library (NYPL) has confirmed that the Henry Luce–designed building will soon house the Museum of the African Diaspora (MAD), the premier contemporary art museum in the African diaspora. Located in the former location of the Empire State Building in Harlem, the museum will host  “Feminine (and) Eclectic” exhibitions, including the first of the six-part series “Africa’s Story: From God to Man” (2019–20) and the 2019–20 season.The Henry Luce Foundation, which was founded by Henry Luce in 1943, announced the opening of the museum’s new location in Manhattan last month. Designed by sculptor and historian Monica Gold, the Henry Luce Foundation also hosts regular programming and serves as a research center for artists and art historians. The museum will be inaugurated by a live performance by African American artist Janet Jackson, who is currently on a solo exhibition at the Henry", "The next Biennial should be held at Liverpool Art Gallery in about six months. According to the Daily Mail, the artists chosen for the event are:Celeste Alberts, GermanyTheresa Anders, GermanyChristos Simonos, GreeceTheodore Rauch, GermanyTatsuya Sadao, JapanTaku Uchida, JapanHow To Apply: Phantom Works (3) will receive $1,500 for a pair of works by Kate and Tatsuya Sadao in the next edition of the biennial. Photography projects by Nicholas Hootyk and Nathan Kornhauser will each receive $750 for a set of eight photographs.This year’s inaugural Biennial will take place at the National Gallery in London from December 28 to January 6, 2020. In addition to the biennial, the exhibition will include a performance by Natalie Merchant; a reading by Sam Smith; and a film by Joel and Ethan Coen. Organizers said: “This is an exciting time to make a new Biennial, and we are thrilled to note that each of the artists chosen for the event will be able to call themselves a modern", "The next Biennial should be held in 2020, when Istanbul’s construction could be completed, and the museum would reopen. The Turkish pavilion was a gift from the governor of Istanbul, Taner Küftürkün, to the city of Istanbul in 1976. The Istanbul Museum of Art, established in 1923, has named Muda Tosun as its next director. Tosun will take the helm from Nursel-1, who retired in March 2019 after a decade at the helm of the institution, in 2020. Tosun will assume his post in July.“After observing and participating in the development of the Biennial, I feel it is the right time to leave the director’s chair and return to teaching and research at the University of Tartu, where I will continue to serve the museum with enthusiasm and excitement for the next two years,” said Muzamil. Prior to joining the Ohio State University as a professor of art history in 2013, Tosun worked as an independent curator and taught at the University of Tartu for two years before she and her husband, Arsht, opened the museum in 2014. The couple", "The next Biennial should be held in 2022, and its curator should be a Swedish artist, the committee said. The new exhibition should follow a theme “studying the relationship between art and politics, ideology and philosophy.”The biennial’s inaugural exhibition was curated by Krister Står, who is best known in Sweden for his photographs. Art historians and art critics were selected by the committee for their qualifications and expertise. This year’s event will focus on the relationship between art and democracy, the relationship between art and science, the relationship between art and philosophy, the relationship between art and politics and religion, and the relationship between art and philosophy and artists.\n\n\nThe Denver Art Museum (DENMA) has received a gift of more than six hundred works from a collection that includes works by Hildegarde and Pierre-Antoine Béchard and Pierre-Marie Béchard. The donation includes works by artists such as Édouard Vuillard and Édouard Dupuyt, whose painstakingly detailed paintings and collages embody an aesthetic that is both playful and haunting.The gift includes seven works by artists whose work has recently come to the attention of the museum: Amichai El-Chaim,", "The next Biennial should be on the whole triennial, and its themes should be set in the Golden Triangle, the center of which is the Golden Gate. How could the thirteen participating artists have accomplished this? The greatest gift the biennial will be able to give the public is to recognize the genius and creativity of the original triennialists. We hope that this exhibition will also introduce the public to the \"lost art\" of the Golden Gate. \n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles has appointed Julie Christensen as the new associate director of the institution. She will be responsible for the care and management of the Golden Gate, the Los Angeles Memorial Museum, the Metropolitan Museum of Art, and the California Institute of Technology (CalArts), and will take up her new post in January 2020.“Julie is a talented and dedicated administrator who has been instrumental in the development of the Museum of Contemporary Art’s collections and collections teams,” said board president Robert Cipolletta. “Her future plans for the museum are highly ambitious and require a truly strategic plan; one that incorporates a long-term plan to the environment, a long-term strategy for reimagining and rebuilding the museum,", "The next Biennial should take place in 2021. At a June 12 press conference at the Durslade Museum in London, Gilligan said: “I am thrilled to be working with the talent, the artists and the staff of the prestigious British Museum.”\n\n\nThe Biola Institute for International Contemporary Art (Biola) has announced that Victor Wang, a Chinese artist who is best known for his multidisciplinary performance installations, will be featured in its seventh edition in the city of New York next year. Wang’s work, which explores both the concept and the physicality of modernism, was selected for the project by a committee of curatorial and performance scholars.“Wang’s work is a synthesis of modernism and contemporary art from both sides of the Atlantic,” said John Vassallo, chair of the Biola team and director of the Durslade Museum. “Inventing new modes of art production, with a deep understanding of the history of art, he creates entirely new works.”Wang’s installation “Capital,” 2007, was made in collaboration with artist and collaborator Ching-Chien Huang and was staged in the Biola Arts Center", "The next Biennial should be held in 2021, the artist said. \n\n\nThe National Gallery of Art in Washington, DC, is planning to move its twenty-third edition, “Taking the Stage: Art in the Age of Color” from April 18 to April 21, 2022. The exhibition will now take place at the Maryland Institute College of Art (MIA), in Annapolis. The move follows the announcement of the twenty-first edition of the National Museum of American Art, which is currently on view through November 28. The twenty-fifth edition of the Metropolitan Museum of Art, which opened on January 21, 2022, will be on view in 2022. “The Met is planning to move this year’s exhibition from the third to the fourth,” said Peter W. Muth, the museum’s director and chief curator. “But this is in keeping with the museum’s long-term strategy to present more diverse exhibitions, both large and small, in the United States every year.” An appropriate venue for the event would be the Washington, DC, area, the capital of the United States’s largest metropolitan area, making the event more accessible to diverse audiences.", "The next Biennial should open its first stage in early 2021.\n\n\nThe Museum of Fine Arts (MFA) in Boston is preparing to welcome visitors back to the institution for a second edition of the Biennial, dubbed the Boston Arts Festival (BAC), in early 2021. The event will take place in the former Charlestown Navy Yard, which is being turned into the new home of the Massachusetts Museum of Contemporary Art (MMCA), and will also include a series of public programming. “This year’s BAC will be an ambitious and compelling reimagining of the contemporary American landscape, both in terms of the new spatial possibilities and the story of American art,” said director Adam D. Weinberg. “The breadth and depth of the curatorial team’s philanthropic and curatorial expertise and their inventiveness in driving new scholarship and exhibitions across disciplines and disciplines of art make them ideally positioned to represent the diverse visions of Boston and the city of Boston.”While the event will feature a number of new works by artists and curators in the Boston area, including Anna Atkins, Ben Aïssa, and Julia Cooke, the focus will be on American art from the late 1800s to the present.", "The next Biennial should be held in the fall of 2020. The 2019 event, “The Time of Our Death,” was held at the National Museum of Fine Arts in Brussels.\n\n\nThe Montgomery Art Museum in Alabama has appointed Tara Hampson as its next director. Hampson comes to the institution from the Alabama Department of Arts, Culture, and Tourism (ADAC), where she has served as the chief curator of the museum’s permanent collection since 2016. She succeeds Holly Craddock, who retired in May after fifteen years at the helm of the museum.“Tara has been instrumental in the growth and evolution of the museum, which has become one of the most visited cultural destinations in the Southeast,” said ADAC director Mary Ellen Smith. “Her dedication and passion for the Montgomery Art Museum and her ability to motivate and inspire others to pursue careers in cultural philanthropy and advocacy have made her the perfect fit for the current challenges and challenges the museum faces.”Hampson comes to the museum from the Kemper Museum of Art, where she has served as curator of modern and contemporary art since 2009. She has also worked as a freelance curator and writer. During her tenure at the museum, she collaborates with the", "The next Biennial should focus on the history of the city’s largest tenant, the Metropolitan Museum of Art—its current exhibition “WALL-E” is replete with archival material created in the museum’s former iteration, the Metropolitan Arts Center, on the Met’s campus. “The bottom line is that these are historical works and they should be housed in museums, not sold,” said Henry Rosenberg, the museum’s director. The Met also recently announced plans to sell the work, which depicts a building that once housed the Museum of Modern Art (MoMA), but was converted into a private museum in 2009.The Met, which has struggled since it was founded in 1892, has recently faced backlash for removing a work by Polish surrealist Janusz Klimczyk, who remains incarcerated in a US federal penitentiary in Texas, from its Twitter feed in an apparent attempt to silence him. The museum has since been criticized for allowing the “black hole” to enter the museum through a ventilation shaft in one of the building’s galleries. The work, that was on display in “WALL-E”\u0097a show on black holes and the field", "The next Biennial should take place in 2021. The upcoming exhibition, titled “Sometime,” will be organized as follows: The ten-year retrospective will present the work of seventy-six artists, including Ivan Albright, Jean-Michel Basquiat, Marie Antoinette Bénétière, Japanese artist Yukiko Nara, Italian sculptor Stefano Manfredi, Juan Carlos Pérez-Villar, and Arturo Toscanari.The biennial will be a collaboration between the central public-serving institution and the Museum of Contemporary Art (MoCA), Los Angeles. The institution will host a retrospective of Raquel Rodríguez from October 2020 to December 2021. The exhibition will be organized as follows: The ten-year retrospective will follow the adventures of a young art student named Raquel Rodríguez, who is now famous for her intricate, geometric, and saturated paintings. The exhibition will include two new works by Rodríguez and will incorporate the themes of the past and present. The exhibition will be followed by a retrospective of the artist’s work at the Museum of Contemporary Art, Los Angeles,", "The next Biennial should be held at the Museo de Arte Contemporáneo in Madrid in 2022. Mullen and his collaborators are currently working on a new version of the exhibition, which will be at the Museo de Arte Contemporáneo, until March 11, 2024. Artforum has reached out to the artists participating in the upcoming exhibition.\n\n\n\n\n\n\nSara Cwynar, the deputy director of the National Museum of African Art in Washington, DC, has been appointed interim director of the Harry S. Truman Presidential Library and Museum. “The Truman Library and Museum is a unique public gathering space in the nation’s capital,” said Jennifer Corrigan, the executive director of the National Foundation for the Arts. “Cwynar’s appointment is a strong signal that the museum is ready to welcome visitors of all backgrounds and identities.”Cwynar comes to the museum from the Metropolitan Museum of Art, where she has served as deputy director of development and community engagement since 2016. During her tenure at the museum, she worked on the Truman’s reopening in December 2019 and helped shape the organization’s exhibitions program. She also organized", "The next Biennial should be hosted at the Architectural Foundation at the University of Oxford, which was forced to cancel a seventh edition of the exhibition after it received more than fifty death threats. The Museum of Modern Art (MoMA) in New York and the Tate in London also announced that they are planning on continuing with planned trips to the Middle East and China. Mike Kelley, the director of MoMA, said that the corporation is still evaluating the safety and ecological effects of its travels and is waiting for the results of a new US study, which will focus on the effects of travel on the environment, before making a decision.\n\n\nThe National Endowment for the Arts (NEA) is reforming its grantmaking process in order to make it more responsive to the needs of the arts and cultural sector. It is also planning to give $1.25 billion to arts, education, and conservation in the next four years. “The future of American arts and the nation’s creative economy hangs in the balance,” said NEA director Deborah Cullinan. “We will be asking ourselves hard questions about how much more we need to do to support the American arts while also adapting to an ever-changing world.�", "The next Biennial should be held in 2021, and the 2020 edition will be staged in 2022. Tad Smith, director of the Contemporary Art Museum St. Louis, said: “The museum welcomes the opportunity to design and develop a new institution that will reflect the cultural and historical significance of the city of St. Louis. It’s a great honor to be able to cooperate with the City of St. Louis and partner with the artist community.”\n\n\nGerman Chancellor Angela Merkel and French President Emmanuel Macron at the end of a joint news conference at the Elysee Palace in Paris, France, on August 12. Photo: Jodi Throckmorton/European Pressphoto Agency Angela Merkel and French President Emmanuel Macron at the end of a joint news conference at the Elysee Palace in Paris, France, on August 12. Photo: Jodi Throckmorton/European Pressphoto Agency\n\n\nThe Museum of Contemporary Art (MoCA), Chicago, has announced that Paul Graham has been named its next president and CEO. The seventy-one-year-old actor and philanthropist has led the museum since 2009 and has donated $25 million to the institution.“Paul’s commitment to the Museum makes him a leader in the field", "The next Biennial should be held in 2020.<|endoftext|>The video will start in 8 Cancel\n\nGet daily news updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nA man who attacked a police officer with a rock in the UK after he tried to remove Donald Trump’s face from a memorial for war dead was charged with attempted murder, the BBC reports.\n\nThe incident occurred at the site of the former Tate Modern in London on Monday, November 4, when the officer tried to remove a statue of General Sir Robert Moseley, a British colonialist who supported Donald Trump’s presidential campaign.The incident occurred as the memorial to the thousands who died in the Iran-Iraq War, which is being rapidly renovated, was being moved. The rock, which hit the officer in the head, fractured his skull and he is currently recovering from a broken jaw. In a statement, the Met said: “We take incidents such as these very seriously and we take a number of our officers and staff seriously. They are all facing disciplinary action. I can assure you that we will take all steps within our power to protect them.”The attacker", "The next Biennial should be held in 2021. \n\n\nThe Museum of Southern Art in Nashville, Tennessee, has appointed Dawnne Blunt as its new director. She succeeds Jennifer Teets, who retired in February 2019 after a decade at the helm of the institution.“Dawnne will be an energetic, hard-working curator who will continue to develop and strengthen an international community’s understanding of the art of her region, as well as the museum, with an eye toward the future,” said Whitney Museum of American Art director Sue Vertschule. “Her dedication to the museum’s history and vision is second to none, and we are looking forward to working with her.”Blunt comes to the museum from the Los Angeles County Museum of Art (LACMA), where she currently serves as associate curator of contemporary art. She was previously the curator of modern and contemporary art at the Hirshhorn Museum, where she oversaw the renovation of the historic building in 2018, and worked at the Getty Villa in Venice for four years, from 2006 to 2008.Commenting on her new role, Blunt said: “We at the Museum of Southern Art are thrilled that Dawnne is joining the Museum, to its", "The next Biennial should be in the spring of 2021; the third in the fall of 2022.\n\n\nThe Arts Council, the UK’s professional body for visual arts, has released the list of seventy-four artists who will receive a prize at the upcoming Arts Biennials in September. The 2020 prize—which will be presented by artist Vinnie Bagwell—has yet to be announced. The artist-inventors were chosen from a pool of ninety artists who were nominated by an independent panel comprised of artist-inventors Richard Anagnos and Paul Mpagi Sepuya, and art historian and critic David Parker.The seventy-three-year-old biennial will be staged at London’s Tate Modern from September 29 to October 3, 2020. The 2019 prize—which was presented by artist Joanna Haydon—was presented at the Theatre of the Oppressed in London from September 22 to September 26, 2019. The artist-inventors selected for the 2020 prize are Haroon Mirza, Sam Smith, Selenis Hawi, Zoya Santos, Aisha Roldan, El Sayaneh, Ima-Abasi Soltan, and Rinesweser Laxminarai.", "The next Biennial should take place in the fall of 2021. The timepiece will be made of local materials in order to better preserve the Catalan culture. The exhibition will be organized in the same way as the contemporary art fair, the first being a special section called the \"Selected Works,\" which will focus more specifically on the works that have been selected. The selected works will be presented by forty artists and will be presented in a retrospective format.The museum will also be taking a quantum leap in its programming. First, the museum will be inaugurating a new digital platform, called the Biennial Archive, which will allow visitors to easily access the works of selected artists and their worklists. The platform will be powered by an Open Data Portal, which will allow anyone to build and showcase their own installation. The project will be hosted by the Museum of Modern Art in New York and will be led by Fernando Cardoso, the director of the Museo de Arte Contemporáneo, Madrid; Aurelio Cienfuegos, the chief curator of the Art Museum in Madrid; and Víctor de la Fuente, the president of the Museo de Arte Contemporáneo.A", "The next Biennial should take place in September 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed former curator of contemporary art Manuela DeSousa as its next executive director. DeSousa will succeed Maren Boesky, who departed in the summer of 2019 to lead the Metropolitan Museum of Art, and will assume her responsibilities at the museum on November 26.“I’ve been a fan of Manuela’s work since I first saw her on Project in a Studio in New York in the early 1990s, and I’m excited to see where she takes the museum next year,” said MCA director Marc Straus. “In an age where museums are increasingly disconnected from the people they serve, with ever bigger online collections, and with increasing financial pressure to present artificial worlds, we feel the need to create more inclusive and accessible spaces for our audience. She has the vision and the energy to make MoCA a leader in contemporary art.”DeSousa comes to the museum from the Museum of Contemporary Art (MCA), where she has served as a curator of contemporary art since 2009. She is currently a research curator at the Skirball Cultural Research Group", "The next Biennial should be held in the spring of 2021. The biennial’s inaugural edition, which was held last year, featured the works of twenty-six artists, including Louise Bourgeois, James Turrell, Robert Irwin, and Nancy Spector.\n\n\nThe Metropolitan Museum of Art in New York has appointed Rachel Holley as its new director. She succeeds Catchy Allan, who stepped down after eighteen years at the museum on December 31, 2019.“Rachel has been a visionary curator and architect of our collections, our exhibitions, and our programs for thirty years, and we are grateful for the work she has done to shape the museum’s landscape,” said Museum Director Christopher Knight. “Her commitment to the Met, to the educational mission of the museum, and to art and art history as a whole is legendary.”After a decade at the helm of the museum, Holley became the first director to lead the institution since the late director David Sound, who led the museum for twenty-six years, took the helm of the Whitney Museum of American Art in New York.\n\nThe American Alliance of Museums (AAM), a coalition of more than two", "The next Biennial should be held in October 2020.\n\n\nThe Institute of Contemporary Arts (ICA) in London announced today that it is planning to shut down its three-year, $9 million annual hackathon, which it calls the \"hub of creativity, innovation, and engagement,\" in early March, following which it will invite new works by the queer and trans-identified (LGBT) community. In a statement, the organization said: “The Museum of London is already coping with the impact of the coronavirus, and the emergency funding for the ICA is in really tough shape. We had hoped to continue with our programming, but with the coronavirus outbreak continuing to worsen and the financial situation getting worse, we have had to make the difficult decision to pull the plug on the ICA.”The ICA currently has four full-time employees and two part-time employees working on display at the ICA, which is located in the city-owned space of Stratford-upon-Avon, in its museum space. The ICA’s next event will take place in February 2022, when the museum will close for a month to commemorate the 150th anniversary of the Battle of Waterloo. ICA director Ashman Levine", "The next Biennial should be held in the autumn of 2020. The inaugural exhibition, “Deep Language: An Exhibition of Contemporary Art,” was inaugurated by an exhibition of works by artists such as Sara Benitez, Tanya Benitez, Stéphane de Lorger, Carol Arquette, Yale Cooper, Michael Douglas, and Olivier Assiston. The 2019 edition was held in the United States and featured works by Mara Conde, Michael Newson, Eleanor Beardsley, André Bazin, Christo, Michelin-Tessitiani, and Jean-Michel Basquiat.The 2020 edition will be held in New York City and will be organized by the New Arts Center and will include the stages of “Expansion and Change” (The Arts and the New Economy) and “Self-Reflection” (The Arts and Society). The biennial will be themed the “life and soul of a person” and will be held at the Museum of Modern Art. Its first public event will be a reception and reading of the museum’s", "The next Biennial should be held in the spring of 2020. \n\n\nThe Metropolitan Museum of Art (the Met) in New York is planning to build a new library dedicated to the life and work of American painter Charles Drew. The extension of its collections, which currently hold more than 1,500 works, will add more than 1,500 works by twenty-six artists, including Willem de Kooning, Frank O’Hara, Erma Bombeck, and Billy Bob Thornton, and will involve the construction of a new 13,000-square-foot gallery and new workshops for museumgoers.The creation of the new collection, which will span three levels, is part of a larger $170 million expansion plan that includes the building of the museum’s new Spanish-language press, a new research center, and a new public area in the museum. The museum plans to open a new 75,000-square-foot Rivera Gallery in the fall of 2020, but the project is still at an early stage and the timeline for opening is still unforeseeable.Among the works added are works by Josée Vicu, Sargent’s Hirvana, and Robert Irwin, among others from a group of forty-eight", "The next Biennial should be held at the National Museum of Art in Washington, DC. The museum will be inaugurated with a public screening of the exhibition “Welcome to the Table: Biennial Two” on September 17.The upcoming exhibition “Year of the Tiger: The Art and Politics of Tiger,” will feature work by twenty-five artists. The biennial will also present work by artists from the Horn and Mammoth tribes, of which fifty-one were selected at the inaugural event, which will be held at the Museum of Fine Arts in Boston, Massachusetts, on September 10–September 14.\n\n\nThe Arts Council in Berlin announced on Tuesday that it will provide $20 million in support of cultural and creative enterprises in the city through a capital campaign known as Berlin Yearbook, which will run from March 29 to March 31, 2020. This year’s edition, “Berlin Yearbook: 2019,” was organized by the German-based nonprofit organization Berlin-Life and will be hosted by the Berlin Art Museum. “All possible measures are being taken to minimize the impact of the lack of a new budget on cultural and artistic institutions,” said Ciarán Fin", "The next Biennial should be held in the spring of 2021. For more information, visit Artforum’s special section on Art and Art History. The Art of the Photographs Series has awarded $10,000 to the winner of its 2019 biennial award. The prize was established in honor of the late illustrator and photographer Robert Mapplethorpe. In addition to the $10,000, the prize will include a series of drawings and prints by Mapplethorpe and a selection of his photographs. “This is a very exciting time to announce the recipients of the Art of the Photographs Series,” said Jeffrey M. Pfeifer, president and CEO of the Robert M. Stern Foundation. “The awardees represent a wide variety of artistic practice and have a distinguished history. The biennial will be a great opportunity to learn from and interact with the artists whose work we choose to highlight in the series. The biennial will create a listening space for the artists and will allow us to look at the work of artists in a new light.”In addition to the $10,000 prize and the biennial, the Tate has pledged $6 million to support the", "The next Biennial should take place in 2020. The project is currently being coordinated by the Universitat de Girona, the Università d'Italia, the Centro di Studi Consulata, the Università di Stabile, and the Università Duomo; the exhibition will initially run from November 15 to November 20, 2020. The full list of participating artists is as follows:\n\nArchitecture and design\n\nArts and design\n\nBaltimore: “What does it take to build a community?” Art and design\n\nBaltimore: “What does it take to build a community?”\n\nBernardo Bruguera: IKON: A Legacy of Modernism”“The City of Light: The Architecture of Light”“Reality Is Fragmented: A Future Present”“Tomasz Klimczyk: A Space for Truth” The Perfect Storm: A Modern Rehearsal of the World”\n\n“The Culture of Death,” the upcoming exhibition at Tate Britain, will feature works by twenty-six artists from thirty-nine countries and will open in London on", "The next Biennial should be held in the fall of 2020. “The work commissioned by the Diplo Fund is a particularly poignant and multi-layered installation ‘Transhumanism’s origins show its relevance today,” said Mark Collinge, director of the Biennial and chair of the board of trustees.“By following the Diplo Fund’s work and our long-term goal of programming the biennial in our homes, we hope to add enough new work to the 2017 project. We are deeply honored by the Diplo Fund’s support this year.” \n\n\nThe New York–based nonprofit group Art for America (AFA), an arm of the New York City Department of Cultural Affairs (C.A.N.), has requested $5.4 million from the Siggraph Art and Design Conference in San Francisco to improve its offerings in the wake of the Covid-19 pandemic. The organization said it hopes to draw up to 125 designers from across the country to New York in March to discuss how their designs can be applied to the city’s public spaces.“Covid-19 has made clear that the art world is not immune from the virus", "The next Biennial should take place in 2021 and will be hosted by the Museum of Contemporary Art Atlanta and curated by Loring Randolph.\n\n\nMerry Watson, the former director of the Maryland Institute College of Art and the College of Art, Maryland, and the author of numerous books on American art, including Untitled, (1977) and Untitled II: Art and Politics (1993), died on March 4 at age seventy-two. She was one of twenty-three women to have served as director of the nineteenth-century institution.Born in Rome in 1937, Watson relocated to the United States with her husband, artist Raymond Watson. During a time when the civil rights movement was in its infancy and women was still lacking the right to vote, Watson began writing for a variety of publications. She was the recipient of several awards, including a National Book Award in 1978 for her memoir Art and Politics, (1978), an NADA Edition of the Book of Abraham in 1986, and the Hugo Boss Prize in 2000. Her art has been collected by the Metropolitan Museum of Art, the Museum of Modern Art, the Whitney Museum of American Art, the Museum of Modern Art, the San Francisco Museum of Modern Art, the Metropolitan Museum of Art,", "The next Biennial should take place in the spring of 2021. It is also looking forward to the development of a new series of exhibitions and performances that will reflect the theme of the next biennial: “Love and romance,” the artist said. The opera house was closed in January 2019 due to the Covid-19 outbreak, but reopened in March. In March, a group of American artists, including Joe and Gere Kavanaugh, staged a live performance entitled “Deus Ex: Human.” The performance, which was staged at Rockefeller Center in New York, featured performances by Donatella Versace, Alan Bennett, Richard Diebenkorn, and Robert Rauschenberg. Commenting on the performance, the artist said: “The role of the sculpture in this art film is to incorporate the work of many artists in a single space. The curators of the biennial are the ones who make the finest art, and the pieces that are put together are the best artworks that have ever been made. The art of the performance is to incorporate the performance of many artists in a single space.”\n\n\nThe Neue Galerie in Munich announced that it is planning to open a new", "The next Biennial should be a celebration of the work and achievements of the past year, especially the exhibition “Wu Tang” (2019). We hope that this year’s edition will provide a new opportunity to engage with the themes and the art created in our exhibition.\n\n\nVincent van Gogh (1854–1940) was a close friend of both Thomas and Charlotte Brontë, who became close friends in the late 18th century. However, the couple was not friends with the elder Brontë. Van Gogh, who was in his mid-forties at the time of their marriage, was a self-described recluse who was at the time living in Amsterdam. In an interview for the inaugural issue of the Art Newspaper, van Gogh explained, that he was in love with the elder Brontë, whom he married in 1872, but questioned their relationship with the younger: “I don’t think I was getting much younger, and I don’t think I was happy about it.”Brontë, who would later marry her second husband, Pierre-Auguste Van Gogh, and the two became close friends. However, a bit of a rift", "The next Biennial should be held in 2022. The National Gallery of Canada has created more than one thousand new jobs for women and young women, and invests more than $130 million annually in the careers of women and under-represented artists.  In celebration of our achievements, we are releasing new Statistics on the Gender Pay Gap, which will focus on the pay gap between men and women across all industries and occupations. “We are thrilled to be able to share this project with the country and the world,” said Lise Eliot, director of the National Museum of Women in the Arts. Commenting on the initiative, Kate Crawford, deputy director of the National Gallery of Canada, said: “As we continue to become more accustomed to each other, to the ways of our world, to our experiences, we learn things that are helpful and interesting in each other, and we bond over shared experiences. We are grateful for the extraordinary work of our talented and committed staff and the generous support of our generous donors.”\n\n\nThe Oxford Art Museum (OAM) in the United Kingdom has named Mary Anne Fishbach as its next director. Fishbach will assume her post in March. She succeeds Edward Graves, who", "The next Biennial should focus on the relationship between art and science and explore the possibilities of art and science. The next exhibition should focus on the history and evolution of the art that represents a particular scientific project. And the next exhibition, for instance a showing of Biennials, should be a special exhibition.”The World Health Organization has also called for organizations working with HIV/AIDS to be given more support, including access to funds, resources, expertise, and technical assistance. The organization also announced the launch of an emergency fund of $6.5 billion for the global fight against the virus. In a statement, the WHO said: “The new Global Fund for HIV/AIDS (GBI-18) is a unique and innovative instrument for supporting the global fight against HIV/AIDS. It will provide emergency relief, including direct financial assistance to people and organizations facing immediate crisis, and will provide a platform for the global community to come together to address the global challenge of HIV.”\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed artist-in-residence Michael Barry as its next director. Barry, who most recently served as a curator at large for the Museum of Modern Art (MoMA), ", "The next Biennial should be in November 2021. \n\n\nThe Museum of Fine Arts (MFA) in Boston announced today that it is moving the architecture-themed exhibition “The Architectural Story of the Future” from March to November. The new date for the show is November 27. The new program will be hosted by the MFA, which will officially open at the new Modern Art Museum in January 2021, alongside the new Winship Center for Architecture and Design.“The MFA’s architecture program is driven by a quest to develop a deeper understanding of the world we live in,” said MFA director Jonathan Salant. “We are eager to take advantage of the close collaboration and international cooperation between the MFA and the Museum of Fine Arts, and the MFA’s existing international exhibition program, to create a greater understanding of the MFA’s exhibition program.”Salant said the renovation and modernization of the museum will help MFA advance its mission to represent the interdisciplinary legacy of the architect-designed arts through an exhibition-driven architecture-centered exhibition program. The restructuring will also help the museum better understand the cultural and historical significance of the building’s history and will allow it", "The next Biennial should have a designated location and will host an exhibition of the work of the work of the same artist in the city. The exhibition will also include a documentary about the artist, the Biennial, and the exhibition. The Biennial will be organized as a public space that will draw visitors to the city and offer them a chance to see the work of the artist in person for the first time. The work of the artist will be on display in the exhibition, entitled Jiang Xiaodong: From Time to Time , which will open on March 17 and run until March 19. The exhibition will also have a digital part that will be accessible on the museum’s website.“Although I have worked in the field of art for many years, I am particularly excited to be presenting a contemporary work by the artist Jiang Xiaodong,” said Ji-Won Park, chair of the board of trustees. Wang will be presented with the Biennial’s Gold Medal in the form of a commission by the artist, who was awarded the award in 2014.\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Paula Soltan as its next director and CEO.", "The next Biennial should be held in the summer, with a view to the autumn. The programme will highlight the work of contemporary artists, drawn from the wider art world, and will be curated by a group of artists led by the artist-in-residence, Eliza Curran. The winner of this year’s award will be announced in the spring. \n\n\nLincoln Museum curator and educator Elizabeth Wegman, the first African American woman selected to lead the prestigious Frieze Art Prize, has been appointed as the next director of the Massachusetts Institute of Technology (MIT). Wegman comes to the institution from the Charles Eliot Cooper Center for Photography at Columbia University, which she helmed from 2011 to 2013. She succeeds Sabrina Borthwick, who retired in January 2019 after a decade at the helm of the center.“We are thrilled to welcome Elizabeth to Lincoln as we work together to reimagine how to use our fields’ strengths and our diverse worlds to advance the social, political, and aesthetic well-being of communities,” said Frank Pimentel, the director of the center and the Whitney Museum of American Art. “In challenging the boundaries of what it means to be an artist and how it", "The next Biennial should take place in 2020 and will be hosted at the San Francisco Institute of Technology (SFIT), with a series of exhibitions curated by artists and activists across the country.The biennial will highlight the work of contemporary artists, with a focus on African American, Latino, and female artists. The theme will be “beauty and beauty” and will be the theme of the second exhibition, “Beauty and Death,” which will be held at the Museum of Modern Art (MoMA). The new shows include “Coming of Age: The Art of Blackness in Art Deco,” which will be the first exhibition dedicated to the modernist movement in America; “Black Power: Art and Politics in the Age of Black Power” (2019), a museum retrospective dedicated to artists such as Urs Solmakhampo, Tommie O. Smith, and Tracey Winstead; and “Stalinist Painting: Four Iconoclast Cubist Constructions,” which will feature works by Simone Leigh, Ethel Waters, and Elizabeth Peyton Smith, among others. In addition to the exhibit on Art Deco, MoMA will stage a number of other programming that will be organized", "The next Biennial should be attached to the Museum of Contemporary Art (CAFAM).”The project has been in the works for nearly a year, and the institution announced that it was considering the reopening of the museum on March 18, 2020. However, the move has caused major disruptions to the biennial’s programming, including for the artists who will be participating in the 2019 edition.\n\n\nThe Smithsonian American Art Museum in Washington, DC, has announced that it is currently closed due to the Covid-19 pandemic. In a release, the museum said that the closure is precautionary and that the institution will reopen when it is safe for visitors to resume exploration of the resources of the Smithsonian’s collection.According to the Washington Post, the National Museum of African Art in Washington, DC, has reopened after it temporarily closed for a week due to the Covid-19 pandemic, but the institution is still assessing the health of its temporary visitors. The National Museum of Women in the Arts in Nashville, Tennessee, also reopened on Wednesday after it experienced a temporary closure for three weeks. Museum director Nina Rosenblum told the Washington Post that the institution is preparing for both long-term and temporary visitors, and will decide", "The next Biennial should be presented by the Serpentine Gallery in London next month. The 2019 edition of the Biennial, which was held at the Museums Laboratory in Düsseldorf from March 3 to March 8, will be staged at the Palais de Tokyo in Paris in May.The 2019 edition of the Venice Architecture Biennale was announced by Venice-Cambridgeshire Council in a statement on March 6, marking the fourth edition of the exhibition. The exhibition was organized by the Ministry of Culture and Science and was supported by the €15 million grant from the Italian government. Originally scheduled to run from March 15 to March 19, the exhibition was postponed due to the Covid-19 pandemic. “We are grateful to the Government of Italy for this very important contribution to the future of the Venice Architecture Biennale,” said the festival’s director, Daniela Catellani.The event will again be presented in Milan in May. The 2019 edition of the Barbican Biennial, which was launched by the British artist Richard Eyre in partnership with the Royal Shakespeare Company, will be held at the London 2012 Festival in May. The theme of this year’s event is “", "The next Biennial should be held in 2020.\n\nAll the while, the institution has been working to restructure its exhibit-viewing experience to better reflect the collections and exhibitions now in the collection. The change is reflected in the exhibition format, which now consists of a series of films about the work of one artist, rather than a portfolio of work from the artist. Titles of works that are in the collection and will return to the collection include “The Book of Life” (2019), “The Artist’s House” (2019), “Longing and Death: The Art of Julio César Karré” (2019), and “Ikon: The Art of Kathy Reginald Mather” (2020). The exhibition was originally slated to open in the spring of 2020 and will open in the fall of 2020.\n\n\nThe Metropolitan Museum of Art is planning to cancel the next edition of the Museum Open. The decision has been made in accordance with a letter from the institution’s board of directors, which was sent last week, and was made in response to the concerns raised by New York–based artists and institutions, including the Museum of Modern Art, the Whitney Museum", "The next Biennial should take place in 2020. \n\n\nThe Metropolitan Museum of Art in New York has received a gift of ten thousand photographs by Herbert Bayer, a German immigrant who is known for his pioneering work depicting human figure. The gift included seventy photographs by the artist that were taken over a twenty-year period, from 1954 to 1963, and of which forty-six are currently on display in a solo exhibition at the museum.According to the New York Times, the museum is hoping the works will help it decide whether to restore or sell the nineteenth-century novelist and painter Adam H. Schiff’s photographs, which were stolen from the collection of the German collector Hans Frank Schleicher, and which were on display in a retrospective of the artist’s work titled “Adam H. Schiff, Jr.,” in 2015.Schleicher and his lawyer, Werner Szeemann, were able to secure the return of the items after the museum refused to return the six works that had been recently exhibited in the exhibition “Hegel & Adam” on April 5, 2019, which was organized by the German curator Peter Dreher in collaboration with photographer Wolfgang Kruijswijk,", "The next Biennial should take place in 2020 and will be hosted at the Museum of Contemporary Art, Miami Beach.\n\n\nThe Metropolitan Museum of Art in New York has appointed Lorne Brown as its next director. Brown will take the helm from director Michael Richards, who has led the museum since January 2019, and will assume his post in the fall of 2020.“After a thorough search, the board unanimously decided to appoint Lorne as the next director of the Met,” said board president Christopher Bedford. “Lorne has been instrumental in the museum’s transformation from a private, nonprofit organization\u0097managed by a board of directors\u0097into an institution with the potential to impact the trajectory of the museum’s five-decade history, and our collection and education mission.”Brown first joined the museum as a member of the editorial staff in 1987. He has served as director of the Met’s School of Arts for the Arts since 2013 and as deputy director of the museum since 2018. Prior to joining the museum, Brown held senior positions at the American Civil Liberties Union and the Center for Digital Art.Commenting on his new role, Brown said: “I’m thrilled to begin this new chapter with", "The next Biennial should be held at the Palazzo Crocato in Venice in September 2022. The event will showcase the work of more than 1,500 artists, including Gonçalo Roca, Sergi Palma, Umberto Pedrosa, and Ramin Lahl.The third edition of the Biennial will be held at the Museo del Parque di Venice, Venice, in March 2024. The event will take place at the historic Venetian Town Hall. The theme for the fifth edition of the exhibition will be “Painting in the Digital Age.”\n\n\nLehmann Maupin, the London-based contemporary art museum, has launched a new digital initiative to help keep its collection online through the pandemic. The initiative, “Lethbridge,” will provide visitors with free access to the museum’s exhibition catalogues, with proceeds benefiting the arts.“We are writing to urge other cultural institutions to join us in supporting the many artists whose work we value and whose work we wish to see continue,” said Sarah Bryant, director of the contemporary art museum. “As you consider the challenges of this new world, we ask that you consider the value of supporting artists who", "The next Biennial should be held in 2022.\n\n\nThe National Museum of Scotland is planning to move the collection of Roman Catholic monastic orders and their followers in the Church of Scotland from its current location in Edinburgh to the National Museum of Scotland in Cardiff. It also plans to open a new 21,000-square-foot exhibition center in the city in 2020.The institution made the announcement in a statement issued on August 3, saying that the move is part of its “commitment to ‘decolonize’ the collection. “In order to make this possible, a new organisation has been created, the National Museum, and the collections have moved to Cardiff. We look forward to welcoming visitors to the new National Gallery and to being able to present the collections in the new National Museum.”The move was first reported by the Art Newspaper. Discussions about the future of the collection have been ongoing for some time. In a 2015 interview, Robert McAllister, the former director of the National Museum of Scotland and a vocal critic of the institution at the time, called the collection “inevitable” and said that the move “will enable us to open up the mind and heart of Scotland to the world.�", "The next Biennial should take place in 2022.\n\nThe Thai artist and curator, who is known for her immersive mural installations that emerge from the Vietnamese stock, will receive the $5,000 Seagull Biennial for Art and Art History Award for his work The Fateful Cycle. The competition jury voted 6-1 against the work after it was presented as part of the exhibition “The Fateful Cycle: Essays on Illusion and the Future of Illusion” at the National Museum of Art in Bangkok.The jury was comprised of the artist, the jury chair, and the Thai architecture and design curator, Sukhacham Paine, and awarded the prize to Nuh Chanwai Phinanawut, who will be chosen by a jury comprising artist Sukhacham Paine; Kathrin Hsuan-min, director of the National Museum of Art; and Kuei-Shen Chai, director of the National Museum of Fine Arts. The other finalists for the prize were Blankensdorf, the London-based artist who was nominated for his installation Sumac, which was staged at the Tate Britain in London; Hurai Phan, the first Vietnamese-born artist to win", "The next Biennial should take place in 2022. It will be hosted by the Museum of Contemporary Art Shanghai and will be organized in conjunction with the upcoming exhibition “Art in Transition” at the Museum of Contemporary Art Beijing. This exhibition will include works by twenty-eight artists from thirty-six countries, including Belgium, China, France, Germany, Italy, the Netherlands, Russia, and Sweden. “The gallery is committed to keeping gallery members and visitors in touch with their inner needs,” Bruce Gilmour, the gallery’s director, told the Art Newspaper. “It is a great honour and privilege to present the new installment of Kunsthalle Basel in Berlin. We hope that you will join us and enjoy this exhibition, which will be a landmark exhibition for the gallery.”While the Biennials will be focused on contemporary artists and their work, they will not be—or be perceived as—unconnected with art history. The inaugural exhibition, “Art in Transition,” will be on view until January 23, 2022, and will include works from the forthcoming “Greater New York Art Decade” (2019–2020) and “Sun, Wind, and Rain: A Contemporary", "The next Biennial should be held in the autumn of 2020. The auction house has also been working on the premiere of new works by artists such as Adam Goodall and Vincent van Gogh in the fall.\n\n\nThe Haus der Kunst (German Museum of Art) in Munich has announced the winners of its two-part biennial, “In the City,” which focuses on the social and political effects of urban life, and “The Village,” which will examine the interdependence of art and culture across urban environments. The 2019 edition featured work by forty-four artists, including Daan Roosegaarde, Gretta Guerrero, and Matisse and Chagall, and was presented by Director Harald Szeemann.The exhibition was curated by Florian Heuss. The Haus der Kunst was founded in 2001 by Harald Szeemann and Klaus-Peter Beckmann. The museum is located in a former cattle pen and is a major cultural attraction in the city of Munich. A UNESCO World Heritage Site, the museum is now home to the Kunsthalle Band, an exhibition space, and the Kunsthal Charlottenborg, a concert hall. In 2018, the Haus der Kunst won", "The next Biennial should be held in 2022. \n“As we work through the challenges of healing in a complex and changing world, we can look to our past to guide us forward,” said Hannah Barlow, director of the Institute of Contemporary Art, London. “The exhibition of Andy Warhol’s photographs is an important moment in shedding light on the images we see in our classrooms, in our offices, and in the world around us. This exhibition should be a moment of reopening, of engaging with the past for the first time.”The first edition of Artforum’s Art in the Schools was held at London’s Tate Modern in January 1973. The year before, the group met its first student group at the school. “There are many things that people have held dear to me as a child but I never thought that they would be the things that were made for me, and for so many children, the first thing they saw in their lives was Andy Warhol’s photographs,” said Janet Egan, the institute’s first director. “They have remained with us through the most difficult of times, and I hope that they will", "The next Biennial should be held in 2020. The museum is currently drafting a new set of guidelines for exhibitions featuring both the entire body of the artist’s work and a selection of his treasured works that will be opened before the end of the century. The first exhibition of work from the new collection will open in the museum in 2020.\n\n\nThe National Gallery of Canada in Ottawa has received a gift of more than one hundred works by contemporary artists such as Johannes Holbein, Léa Segal, François Truffaut, and Markus Lüpertz, who have been donated by the National Arts Foundation (NAF) to the institution.The donation includes works by Kosuke Hikasa, David Kline, Chaédria Huey, Noël Carroll, and Masha’s husband. The museum had hoped to acquire the works by 2020 but was forced to delay the goal after the Covid-19 outbreak began in earnest.The donation coincided with the opening of a new exhibition, “Birds and Comics,” and the reopening of the National Museum of Canadian Art in Ottawa. The National Gallery of Canada will also inaugurate the new museum in the spring of 2020. The National Gallery of Canada in London", "The next Biennial should be held in 2022. With the number of artists that have participated in the ongoing exhibition reaching an incredible nine thousand, there is no reason why it cannot be held. The city’s art institutions have launched a campaign to raise $150 million for the museum, and the Biennials are available for schools and any other organizations that wish to present their works. \n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles has appointed Sarah Schock as its next director. She has been named interim director for improvements and partnerships with the Los Angeles County Museum of Art (LACMA) since February and will assume her post in May.“Sarah brings a wealth of experience and knowledge in a variety of disciplines to our museum, including curating, programming, and fundraising, and her leadership has been instrumental in the museum’s development over the past four years,” said director Mitch D. Berridge. “Her success in shaping a future vision for LACMA is a testament to her ability to see the future and her ability to prioritize the critical priorities of LACMA. We are grateful to have her as director, and are confident she will maximize the museum’s potential as a modern and contemporary art", "The next Biennial should be held at the Museo de Arte Contemporáneo (MAS), the Museo del Trabuco, and the Museo de Cultura Ricordiano (M-C), which is housed in a former mill in the town of Santa Fe, in the central state of Piedras, in the province of Piedras, in the southern state of Guanajuato. “The exhibition is a step toward building a new and independent museum that will reflect the spirit of the city of Guadalajara, and be accessible to the public,” said Marcos de Jesus, president of MAS.  “The new museum will be designed by renowned architect Bernardo Beller, partner of the great architect Alfredo Celant. It will be built on the campus of MAS, in a historic building that was built by the university. In addition, the new museum will offer a collection of contemporary art from the region and the world.”The current exhibition is a continuation of the 2015 exhibition “Yale Architecture: From the Renaissance to the Present” (2015–16), which was organized by the Yale University Art Museum and the Metropolitan Museum of Art in New Haven", "The next Biennial should be held in the summer of 2021. Facebook Twitter Pinterest Tony Cuno, the founder of the biennial and the curator of the 2009 exhibition “The Secession of South Africa.” He will also lead a biennial of works by the Slovakian artist Stanislav Salm. The 2019 event, which was co-organized by the artist Kadeisha Brown and the contemporary art historian Tomasz Klimczyk, concluded with Lissitza Karloši’s work Caracas: A Portrait of a Woman in the City.\n\n\nThe Center for Contemporary Art (CAC) in the Netherlands announced today that it will open its Leiden office—which has served as the home of the exhibition-centered CAC for the last five years—in December of 2021. The center will remain closed until March of 2022, when it will reopen as part of the city of Leipzig.The institution, which has two locations in the city, is currently undergoing a major expansion, which will see the opening of the CAC alongside two exhibitions, “The Telling of The National: Art from the 1980s” (2019) and “Wiradj", "The next Biennial should be on paper, on location, and be completed by late spring or early summer. In order to ensure the exhibition’s sustainability, the exhibition will be remodeled and expanded through the use of prefabricated structures, manufactured materials, and the exhibition’s collection.\n\nFollowing the Paris-based collective’s decision to cancel its upcoming exhibition “Venus: Celebration of Life” in March 2019, the organization has announced that it will begin the construction of a new exhibition space in the city of Villebon. The new venue will be built on the banks of the Mississippi River in an area that will be filled with new works by contemporary artists.Located on the northern end of New Orleans’s Van Gogh’s hometown, the new space will offer three hundred square feet of exhibition space to the collection of Alex Katz, Shih Chieh Huang, and Lev Leviev. “This is a moment of great change,” Katz, a twenty-nine-year-old Chinese American artist, told Artnet. He added: “I’m extremely excited about the exhibition’s opening and the new partnership with the Van Go", "The next Biennial should take place in 2022. But, as Sophie and I have said many times, we are not looking to move into the future.” The first exhibition of the new collection, “Curtis Irvine” (2019), was hosted by the United States Military Museum in Quantico, Virginia, and was organized by the Museums Association.The new biennial’s curators are Sally Kohn, Andrew Kreps, Jonathan Olmstead, Michael Redmon, and Karen Tappy. The exhibition will feature work by thirty-seven artists, including American painter Charles Atkins, Brazilian painter Ronald Martinez, and Polish sculptor Andrzej Wojtyla.The show will also include a “secret history of men’s fashion” and the “ancient art of love.”\n\n\nThe intersection of art and politics is now more expansive than ever, as political and cultural figures grapple with the possibility that the nuclear deal between Iran and six world powers—the United States, Russia, France, Germany, China, and Britain—is about to be violated. The stakes are high. As the Guardian reports, the deal is", "The next Biennial should take place in the autumn of 2022. The first iteration of the exhibition, titled “HORSEMEN,” was staged at the Stratford-on-Avon, England, Biennial in 2007.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has released the list of seventy-four artists who were included in the Fifty-Ninth Venice Biennale, which opened on May 27 and runs through October 20. The exhibition featured work by more than 1,600 artists, including William Eggleston, Allan Nolen, John Akomfrah, Charles Dietrich von Kleist, and Anita and Henry Higgins, and will feature the work of eighty-three artists from fifteen countries.The artists chosen for the exhibition were announced last week, and the full list is as follows:Akram Ateşmüzüz, IstanbulArtists: Taner Kureishi, IstanbulArtists: Ophelia Benitez, MoscowArtists: Roberto Ceccarelli, RomeArtists: Jean-Pierre Demy, ParisArtists: Kazuko Fujii, TokyoArtists: David Leonhardt, CaliforniaArtists: Mikhail Landreth, LondonArtists: Kip Th", "The next Biennial should be organized as a series of events that will take place across the city, focusing on local issues and reflecting the various Italian and Italian-American communities in New York City. The theme of the fifth edition is “Italian-American Communities in New York City” This year’s edition will focus on how the cultural sector—both the city and the region—provides economic and social support to communities and will invite the voices of forty-four artists, including Anselm Kiefer, Daniel Orellana, Adam Pendleton, Walter Rosamond, and Michael Kohler, as well as artist-activists Anne-Marie and Jodi Thoren, and Domenico De Bonis, who was the first to stage a retrospective of Italian-American art in New York.In a statement, the Biennial said: “The fifth edition of the Biennial, ‘Italian-Americans’ , was organized in conjunction with the city of New York and the entire city of New York in celebration of the creative and cultural history of Italian Americans and the first edition of the Biennial was a watershed event in that history. The vision of this year’s Biennial, which reflects the spirit, history", "The next Biennial should take place in the United Kingdom in 2022.  The next edition of the Biennale will be held in the French city of Cannes in 2020 and will be held in the same venue, next year. The theme of the 1991 exhibition “Feminine” will be reworked for the third time since the event’s inception in 1987. It will also be the theme of the 2019 edition, which was held in Chicago, and will be the theme of the 2020 edition. The 2019 edition of the Biennale attracted 1.2 million visitors and featured work by sixty artists, including Andrew Kreps, Rirkrit Tiravanija, Tanya Van Winkle, Steven Turner, and Edward Simeon.\n\n\nThe United Kingdom’s cultural sector is reeling from the coronavirus, which has killed at least 176 people and caused more than 8,800 to be infected—the majority in the UK, where the outbreak began in Fife, Scotland, and spread to other parts of England and Wales. According to The Guardian, the number of cases in the country has risen to 7,300, with an additional 3,000 people infected in the counties of Durslade,", "The next Biennial should be held in 2021.\n\n\nLondon’s Tate galleries are preparing to reopen next month following the completion of a major overhaul. The London galleries will welcome visitors to Tate Modern, Tate Liverpool, Tate Thrift, Tate Sculpture Garden, Tate Victoria, Tate Modern, Tate Liverpool, Tate Modern, Tate Liverpool, Tate Thrift, Tate Victoria, Tate Modern, Tate Modern, Tate Liverpool, Tate Modern, and Tate Modern Contemporary.Artists Richard Diebenkorn and Richard Bevan designed the overhaul, which involved the removal of twenty-five works, including the work \"Welcome to the New World\"—1990–1991, which was commissioned by Diebenkorn, and the work Black Sea: From the Sea to the Sky—1937–1948, which was commissioned by Bevan.Other works that were removed include a reconstruction of the life of the Egyptian pharaoh Ramses II and his pharaoh-s-and-queen-from-the-Giza dynasty, the work The Queen and the Queen’s Son, featuring sculptural creations by Bevan, and the text from the Koran, which was commissioned by Diebenkorn. The restoration of the Tate’s collection", "The next Biennial should also feature a retrospective of the work of the artist-movement Thee, and will take place in his home country of Switzerland, which has been working to organize a new exhibition of work by the project of the artist-movement Millennium and the artist-cartographer Richard Avedon.Developments in the exhibition, “The Shape of Things to Come” (2019), and the exhibition of the work of the artist-cartographer Arturo Di Alba, “Suspicious Fish,” (2019), are scheduled to take place in the exhibition hall in Zurich from May 7 to May 14.\n\n\nThe Art Newspaper (AON) has published an article that explains the astronomical astronomical new astronomical data that is being collected by the Japanese Space Agency (JAXA) to determine the precise orbits of the planets.“Asteroids are frequently used as symbolic representations of the universe,” the article reads. “But in order to determine the exact orbits of the planets, the JAXA will have to collect and analyze data from every planet in the Solar System and from all the stars in the Milky Way.”In order to determine the orbits of the planets, the J", "The next Biennial should take place in the spring of 2020. “We are currently in the process of researching this ideal year for the 2020 exhibition, and are optimistic that the next edition, our best-ever exhibition, will become one of the most important events of the year.”\n\n\nThe Birkbeck, University of London, in England, has appointed John Hilson as its next director. Hilson will assume his post in January 2021. He succeeds Adrian Wootton, who departed the institution in July to become director of the New Art Museum; and will take up his post in January 2022.“The appointment of John is a major step in the ongoing development of our contemporary curatorial program, and I am delighted that he will lead us through this next stage,” said Adrian Wootton. “Birkbeck is a remarkable institution, a unique hub for the studies and exhibitions of contemporary art. John will be an important asset to the future of our collections and programs, and as we approach the end of this decade, I look forward to working with him to make our collection and program as diverse and inclusive as possible.”Hilson currently serves as the director of the museum at large, which opened in", "The next Biennial should take place in 2020 at the same venue.\n\n\nThe Italian architect and educator Paolo Bertani has died at age seventy after a yearlong illness. He was the sole survivor of the architect’s group, and the first partner of the contemporary FP Group, which Bertani founded in 1928. Bertani was also a founder of the School of Architecture at the University of Cagli, where he led the development of the modernist school’s monochrome pavilions, the Prada pavilions, and the Patekon pavilions. Bertani’s art has been collected by the LACMA Museum of Modern Art and the Metropolitan Museum of Art.Bertani was born in Piedmont, in the southern province of Sardinia, in 1928. His father was an architect and his mother was a teacher. Bertani went on to study at the Institute of Architecture at the University of Cagli, but retired in the 1960s because of the disease. He then enrolled at the School of Architecture at the University of Naples, where he continued his studies, but returned to the University of Cagli in 1982 to study at the School of Art. He taught at the School", "The next Biennial should be held not more than ten years from now. Any decision regarding the future of the exhibition should be based on the public's opinion and should not be influenced by outside considerations. \n\n\nThe first museum dedicated to the work of artist-in-residence Vijay Mallya in India has opened in the capital city of Mumbai. Titled The Artist Is Present, the museum will display the work of forty-four students and four professors from the prestigious Mumbai Design School (MDS), as well as twenty–five works by M.A.I.N. (Managing the Intellect and the Environment), a group that Vijay Mallya started in the early 1990s, in its exhibition space.“The MDS is a watershed in the history of Indian art, and will play a central role in the trajectory of my own history and career,” Vijay Mallya told the Art Newspaper. “I was a professor at the MDS, which is an independent institution, and have had the privilege to work with students and students’ groups that have gone on to become influential and important in their respective fields. I am delighted to have been able to share my experiences with them and to introduce them", "The next Biennial should be held in December 2021. \n\n\nThe European Union has agreed to compensate struggling museums and cultural sites in Poland for the damage caused by a massive fire that broke out at the Mazowiec Museum in Warsaw on December 10, triggering massive evacuations and destroying the building.The energy-hungry building, which houses some thirty thousand artifacts from the collection of the Polish city of Lublin, consumed an estimated 22,000 kuna (equivalent to about eight thousand barrels) of natural gas and was burning when it was brought under control by firefighters. The accident, which took place shortly after the museum reopened on January 5, coincided with protests against President Andrzej Duda over plans to rewrite the constitution to extend his power and increase his authority over local governments.On Monday, the European Court of Human Rights ruled that the government had intentionally allowed the fire to spread and awarded the victims of the accident, as well as the Polish state, around $4.5 million in damages.\n\n\nMuseum director Jan Szymczyk told the Art Newspaper that the building, which hosts more than ten thousand works by the prolific Polish artist Wojciech Braszczak and was completed in 1985, had housed many of the", "The next Biennial should take place in 2022.\n\n\nThe Institute of Contemporary Arts (ICA) in London is planning to open its new space, the Biennial Gallery, in the City of London, on March 22, 2021. The five-acre, twelve-glass space will be inaugurated by a solo exhibition of work by artist Astrid Schuetze, whose installation will be followed by a solo show of work by artist Seth Littman.“The inaugural show will include works by the newly commissioned Mina El-Khoury, and will explore her conceptual relationships to the exhibition “Sitting On The Sky,” as well as the exhibition “Marco Pizzello.” The show will be hosted by the artist, producer, and director Mario Puzo, and will be followed by a presentation of work by the artist’s son, Felix Puzo, a painter and sculptor based in Italy.Inaugurating the museum will be a presentation of work by the artist’s son, Felix Puzo, a painter and sculptor based in Italy. In the exhibition “Marco Pizzello,” Felix will present a major retrospective of his work in a building that", "The next Biennial should be an amalgamation of the highlights and the most recent exhibition, in order to provide an opportunity to articulate the most urgent issues that confront us, and to sustain our interdependence.”The legacy of Biennials is a complex web of interlocking experiences and contributions that is woven into a fabric that shapes how we think about the world. During its fifty-eight-year history, the biennial has included more than eighty exhibitions, including “Mana Contemporary” (1986), “Ateliers du Cinéma” (1987), “La Bibliothèque en vogue” (1989), “The Animations of Pippa Evans” (1991), “The Snakes of Daniel H. Pink” (1997), and “Monumental Art: A Retrospective” (2001). Following the publication of “Monumentality: A Retrospective” (2004), the exhibition was moved to the Museum of Modern Art in New York and is now housed within the exhibition series “Art” at the American Alliance of Museums. The exhibition series “Art” is one of the categories that comprise the annual “Artforum", "The next Biennial should be held in Alumna, New York, in 2021.  “The world has changed and our cultural institutions have become more and more complex, but our lives and work are not,” said Mark Lynas, director of the New York Museum of Art and the Museum of Modern Art, and the founder and CEO of Lynas & Associates. “It is only in our power as a society that we can continue to live and work in such remote and remote, technological versions of the past.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced that it is working with the descendants of Orientalist Frank Lloyd Wright to create a new public artwork, a monument to the visionary American architect and educator. The work, titled “Lloyd Wright and the Space Between,” will rise in the city’s Central Park, and will be made of twelve thousand reclaimed pallets and will sit in the park alongside the existing Wright-designed Frank Gehry–designed Furthurst Tower.In a statement, Museum director Amy Goodman and chief curator Mark Engstrom said: “We are honored to collaborate with the Wright family to create a new monument to", "The next Biennial should be held in 2020. The next edition of the event will be held in Norway in 2021. The biennial’s next edition will be staged at St. Botolph’s in London, in 2021. The upcoming exhibition of work by the artist’s daughter Guadalupe Rosales will take place at the Art Gallery of New York (AGO) in 2021. The next exhibition of work by the artist’s granddaughter Elizabeth Ann Collins will take place at the Metropolitan Museum of Art (Museum of Modern Art) in New York in 2021. \n\n\nThe Hirshhorn Museum and Sculpture Garden in Washington, DC, has received a gift of 113 works by the artist Laura Aguilar from the artist’s son, Robert Aguilar. The institution also revealed that the sculpture Garden of the Gothic in New York City will receive the work of the same artist in 2022. New York’s Martha Graham-Dixon Museum of Art and University of Pennsylvania’s Max Hetzler Garden will receive the work of Aguilar in 2021. The full list of recipients is as follows:Laura Aguilar , Cro-Magnon, SpainWalter Godlewski, ", "The next Biennial should take place in the spring of 2019. \n\n\nThe Guildhall Art Foundation in London has welcomed the newly appointed deputy director, Lina El-Maria, as its new director. El-Maria, who previously worked as a curator at the New Art Museum and as the founder of a private art-collecting and collection space in Miami, will take up the post in June.Founded in 1886, the Guildhall Art Foundation (GALL) comprises twelve museums and galleries that have been supported by a long-standing relationship between the foundation and the Metropolitan Museum of Art since 1992. The organization currently has more than 1,500 works by fifty-six artists, including the French Impressionist Pierre-Auguste Renoir, the Spanish painter Juan Manuel Caballero, the German painter Ann-Sophie Bayer, and the Brazilian painter Leonardo da Vinci. “Lina is an experienced and talented leader who has the vision and ability to deliver on the GALL mission,” said Elizabeth Fitzgibbon, GALL’s director. “I’m sure she’s excited to work with us and to continue to build on the foundation’s legacy of innovation and excellence, which", "The next Biennial should be this March, with an aim to explore the medium of art through a multitude of artists and a variety of mechanisms. I look forward to hearing from you all and to seeing how you all respond to the first exhibition.\n\n\nThe Astana Centre for Contemporary Art in Kazakhstan, the country’s largest arts complex, has received a $1.5 million gift from the Rothschild family. The Russian architect, Ksenia Astana, and her husband, Mikhail Astana, have offered to donate the Soviet-era building’s archives to the Rosling family, which has significant holdings of the Kupka Valley. The gift includes the entire archives of the Astana Gallery and the Astana Museum, which were founded in 1964 by Kupka leader Leonid Kupka, and the Astana Museum’s collection, which includes nearly three hundred objects, including paintings, drawings, photographs, and recordings.Built in 1941, the Astana Museum was completed in 1964, and the Astana Gallery—designed by the Russian architect Arkady and Boris Podobed—opened in 2002. The museum had been under construction since 1963. Its first owner, the German couturier Carl Zeiss, donated the building in 1964", "The next Biennial should take place in the autumn of 2020, at which point the first exhibition will take place in early 2021. As it stands, the museum is only preparing to open to the public in July 2021.The show will be divided into two parts\u0097part I, which focuses on contemporary art and design, and part II, which will explore the history of art and design. The biennial will also present both a retrospective of the work of various artists and a new exhibition series. The new stages will be inaugurated at the Biennale d'Art Moderne in Milan, Italy, on January 27, 2020 and will run until March 30, 2020. The exhibition will consist of forty-two exhibitions and the opening will be on March 22, 2020. The show will be inaugurated with “Contemporary Art” in a new exhibition titled “Building Buildings,” which will feature installations by Sara Cwynar, John Akomfrah, Claudia Brugotti, Jane Birkin, and Julia Clarke. This exhibition will run until March 29, 2020.The biennial is the second such event in Europe and the United States. The first, which was", "The next Biennial should be in 2022. The next Art Biennial, which will be held in the United States, will be in 2023. The last Art Biennial in Europe, which was held in the Czech Republic, was in 2021. In 2020, the last Art Biennial in the United Kingdom, held in March 2019, was canceled due to Covid-19. The next Art Biennial in the US will be held in 2021. Art and Design New York, whose current location is in the East Village, is continuing to operate for “art and design”, but will require a new location for its biennial. Benjamin Telles, a curator and writer who lives and works in New York, said: “The real question is whether design is going extinct in the US. I don’t think it is. Design has survived the pandemic, and I think it will survive the pandemic. I think the survival of art and design is a question for art historians, not the future of art.”\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Kate Bartlett as its next director. In her new role, which is funded by the $29 billion", "The next Biennial should focus on the ongoing evolution of the European Left, and especially on the development of new theoretical perspectives, an intention that is shared by most of the projects in the collection, including the recent work on agitation and collective action in the Los Angeles riots, and the exhibition “Feminism, the Crisis of Men, and Violence” (2013–14), which was organized at the Black Flag colony in East London and trialed in the United States.The biennial is also considering the installation of a “Branislav Radek” portrait, an experimental work that explores the role of men in contemporary leftist politics, in a show featuring a selection of Radek’s photographs. The package will be presented through a collaboration between the Museum and the artist-in-residence, Abdellatif Kechichev, who will create a “pretext” for the exhibition. Kechichev is currently a lecturer at Palazzo Donatello in Venice, where he teaches at the Institutnasio de Arte di Storia (A.I.S.), the Institutos de Cultura Latinoamericana (ICA), the Institutos de Cultura Latinoamer", "The next Biennial should take place at the Kunsthalle Basel in March 2020. \n In addition, the National Museum of the African Diaspora, which is located in Washington, DC, has released the following statement regarding a recent exhibition that addressed contemporary art and identity: “The National Museum of the African Diaspora is deeply concerned about the exhibition, ‘Architecture and Identity: The African Diaspora’, which was organized as part of the 2017–18 National Geographic Society–sponsored ‘Commission on African Diaspora’’ . . . and is dismayed by the exhibition’s sad conclusion: ‘Architecture and Identity’’ was never meant to address the full range of contemporary art and art history. Rather, it was an attempt to present the artwork of a single artist as a whole, in order to create an atmosphere of hope and inspiration. The exhibition was never meant to be a platform to undercut the very foundation of contemporary art.” The third edition of the National Geographic Biennial will take place at the Harvard University Art Gallery in Cambridge, Massachusetts, in March 2020.\n\n\n\n\n\n•\n\n•\n\nAndrea Giunta, a human", "The next Biennial should be held at the Museum of Contemporary Art Los Angeles (MCA), in 2020. MCA director and CEO Loring Randolph has previously stated that the museum will not be closed until at least March 31. Following a series of delays, the Biennials at the Museum of Modern Art and the Whitney Museum of American Art will return to the streets of Los Angeles, Los Angeles County, and Santa Monica on April 5 and April 7 respectively.\n\n\nThe Museum of Contemporary Art (MoCA) is launching a new online feature that will allow visitors to view the holdings of the institution at one convenient location. The platform will debut in the fall of 2020.“An important goal of MoCA’s curatorial program has been to make the collection as accessible as possible to our community,” said MoCA director John Schaffner. “The new online viewing rooms will allow us to do this and do it very effectively. The new biennial viewing rooms will provide a more personalized experience and allow us to bring every piece of the collection to you at one convenient site.”Schaffner confirmed that the new platform will enable visitors to view the contemporary art of the museum at no additional cost. The biennial viewing", "The next Biennial should be held in 2022.ŜThe best exhibition of the year will be the new exhibition ‘Postcolonial’ that explores the intersections of political, social and cultural issues in the twenty-first century,” director Rebecca Black said in a statement. “We are thrilled to finally be able to present this work at our amazing new location in downtown Los Angeles. The new spirit and a new vision of the museum makes it the ideal platform for this work. We are incredibly excited to collaborate with the local community, the city of Los Angeles and the world to create work that celebrates the rich and the 'postcolonial,” Black said.The fifty-third edition of the Neue Biennale will open at the Institut für Internationale und Internationale Berlin in March 2024. The exhibition will also be hosted by the Institut für arabischische und früheren Gesellschaft in Frankfurt in May 2024.The exhibition will follow the theme “Postcolonial” of the upcoming exhibition “Postwar in America” and will feature the work of forty-four artists. The exhibition will also feature the works of forty-five contemporary and pre-postcolonial artists.\n\n\nThe Allen", "The next Biennial should take place in January 2021. The exhibition will be curated by Mr. Kwon, and will be led by Ms. Park.\n\n\nThe W.K. Kellogg Foundation in Kansas City, Missouri, has created a new $70 million endowment to support the creation of the W.K. Kellogg Sculpture Garden in the city’s Historic Arts District. Designed by Mies van der Rohe and built by Gensler and completed in 1971, the sculpture garden is one of the largest works of architecture in the country and is considered a core part of the city’s public art.The foundation is donating $50 million to the project and will make a $25 million grant to the city for the construction of the garden. The gift will be divided between the foundation and the city. The Kellogg Sculpture Garden will be located in the heart of the city’s historic Lawrence Park on the northwest corner of Columbia Pike and Jackson Street. The garden will host more than 1,500 works from the collection of M.J. Taylor and Nell Dorr, as well as new works by contemporary artists such as Richard Diebenkorn, Eric Fischl, and Gene Kluger", "The next Biennial should open in June 2020; the first in March 2021. The initiative was created by the Museum of Contemporary Art Los Angeles (the museum), the Consortium of Contemporary Art Chicago (the conference), and the Arts Council of the United Kingdom (the council). In the fall of 2019, the consortium presented the first edition of Biennale Los Angeles at the Los Angeles County Museum of Art; the event received an award from the Kate Halsey Foundation in October 2019.The 2019 exhibition was curated by Sasha Hennessy, director and CEO of the Kate Halsey Foundation, and was inspired by a trip to Venice, where Kate, as part of a project of the Kate Halsey Foundation, and the SculptureCenter in Los Angeles are collaborating on an exhibition of work by artists such as Ralph Bernstein, Mary Boone, and Gilles-Marie Guarani.In a statement, the Kate Halsey Foundation said: “We are thrilled to be collaborating with the SculptureCenter, the Consortium, and the Arts Council on this exciting project. We believe the exhibition will be of significant interest to our current and future generations and we are eager to see what the artists create in the exhibition.�", "The next Biennial should aim to place the exhibition within one of the city’s most prominent cultural institutions: The Sculpture Garden at the Museum of Modern Art, designed by Walter de Maria and designed by the architect Feodosio Cipolletta. The second exhibition should focus on the life and work of the artist-in-researcher, Peter Zumthor and its influence on contemporary art. \n\n\nThe Wujin Soocho Museum of Art in Seoul announced today that it has received a gift of twenty-seven works by twenty-two artists, including four by the aforementioned artist-in-researchers. The works, which were donated by artist-in-residence and alumni, will be displayed in the museum’s third exhibition “The Future is Present: Contemporary Art and the Struggle for Democracy” in December.The works were donated by the alumni in recognition of their contributions to the institution’s promotion of contemporary art and their continuing dedication to exploring the Chinese tradition. Among the works that will be displayed are Young Man in the Sun (1964), a contemporary installation by the artist-in-residence, a monochromatic, close-up work that uses photography", "The next Biennial should focus on “situating contemporary art within the global context of the historical era\u0097this is an era of unprecedented social, political and ecological challenges\u0097and how art can play an important role in addressing these challenges.”\n\n\nThe Museum of Contemporary Art (MoCA), Boston, has announced that it is reopening to the public on September 9 after it closed permanently due to the coronavirus pandemic. It will remain closed until January 14, 2021, at the earliest. Following extensive refurbishments in both inside and outside of the museum, the museum’s collection will return to its original location on the ground floor of the old Kendall Square, at 8 East Boston Street.“This is an unprecedented crisis for the art world, and MoCA’s curatorial team was made up of the finest minds in America, Europe, and Asia,” said museum director Hugh Johnson. “Their work and passion for these past eighteen months has been dedicated and extraordinary, and we are very much looking forward to seeing what they will create in their new environment.”The museum will celebrate its reopening with a retrospective of the work of twenty-six artists, including Alex Katz, Grace Coddington", "The next Biennial should be held at the Montreal Museum of Fine Arts, the Ottawa Museum of Fine Art, the Toronto Museum of Art, and the Ottawa Art Gallery. Last year, the festival hosted eleven artists, including Jean-Michel Basquiat, Aruwaleg Atiya, and Roger Mey, among others from the UK, Spain, and Mexico. The event screened a collection of works by forty-four artists at the Biennial, which closed in March. The full list of participating artists is as follows:Artists Presented by Institutions:The Art Gallery of Ontario (Toronto)Peter Blum Gallery (New York)Artists Presentations:Theater Triennales: The Contemporary Art of England and WalesArtists Presentations:Artists Presentations:New York (2016)Artists Presentations:Artists Presentations: London (2016)Artists Presentations: Paris (2016)Artists Presentations:The Art of Walter de Maria: Lectures from the Art Museum of IowaCity (2016)Artists Presentation: Artists Presentations:The Barber Museum, New York(2018)Artists Presentation: The Art of Michael Collins: Lectures from the Museum of the Fine", "The next Biennial should have a venue for a studio audience and should be able to create a mini-biennial in the form of a physical exhibition. There should be a space for the performance of the exhibition. We should be able to achieve this through the Academy’s Creative Economy Framework and the engagement with the local communities.\n\nA group of thirty-eight artists, including Joao Podedà, Carlos Eduardo, and Madeline Ahern, as well as the Gaza-based collective C.A.R.E.N., announced they are collaborating to produce a new series of exhibitions dedicated to women artists, titled “Cœya Artística,” which will launch in the city of Acapulco in the southern province of Oaxaca in October 2020. Inaugurating the event is an exhibition of work by the artists Mara Boesch, Yolande Balsom, and Fabiana Balsom, as well as an open-air installation by the artist-activist César Morales titled “Viva Femina,” which will open in the city of Madrid in October 2020.“It is a great honor to present our first project together,” said", "The next Biennial should be held in the spring of 2020, with a 2,500-person selection of works. The exhibition will also include a biannual film-short competition, a collection of works by influential artists and a twenty-first-century history of art.Commenting on the upcoming exhibition, MoCA director and CEO David Guggenheim said: “The biennial is meant to be the culmination of Biennial 1, and the event will be inaugurated by a series of career retrospective exhibitions that will celebrate the work of several luminaries, including Richard Avedon, Georges Apostu, Felix Corleone, Stanley Donwood, David H. Koch, Robert Irwin, and Yukio Mishima. We are proud to present artists who have had the opportunity to engage with MoCA, and in recognition of their achievements, we will extend the program to 2019.”\n\n\nPicasso’s work The Nude in the Mirror, 1955, will finally be exhibited at the Venice Biennale in May. The exhibition, which has been on the web since April, will now be held at the Art Biennale in May, along with a selection of work by artists whose work was selected from the exhibition. It", "The next Biennial should be held in 2022.\n\n\nThe Museum of Arts and Design (MAD) in New York has appointed Randa Farah as its interim director. Farah has been the head of the museum since 2016 and has led the institution since March 2019. She succeeds Susan Egan, who retired after a decade as director in April 2019.“Randa gives us a new voice in the museum, a new vision, and a new path,” said Margaret Flanagan, vice chair of MAD’s board of trustees. “We are incredibly excited to welcome her to MAD, and to continue to build on the museum’s rich legacy of celebrating women and celebrating artists.”Farah joins MAD after serving as head of the Los Angeles County Museum of Art (LACMA), where she helmed the institution’s inaugural season, from March 2019 to March 2021. During her tenure, she oversaw the reinstallation of the museum’s new galleries, oversaw the development of its online collections, and oversaw the museum’s reopening in March 2021.“Randa’s appointment is a tremendous boost to our diverse staff and our exciting plans for the future,” said director", "The next Biennial should be up on the second floor of the Museo de Arte Contemporáneo, in Lisbon, by the end of the year. Since the exhibition space was converted into an academic conference venue in 2014, a number of exhibitions have been shown there, including “Classical Arts and the Modern World: From Pisan to Monrovia” (2015) and “Classical Myth and Modern Life: From the Renaissance to the Present.”The show, which was organized as a joint project of the Museo de Arte Contemporáneo and the Universitat Politècnica de Lisbon, was dedicated to the history of the art in Italy from the Renaissance to the present. In the past, the gallery has presented exhibitions on Italian art from the Ottoman Empire to Italy, and from the 1930s to the 1970s, it screened films and other Italian artworks. In 2006, the show was chosen as the theme of the thirty-fourth Venice Biennale.\n\n\nThe Edinburgh Art Gallery (EAG) has announced that it will reopen next week after a temporary closure due to Covid-19. The museum announced on Friday that it is still assessing the extent of the", "The next Biennial should focus on the relationship between technology and the body and the relationship between art and science, and on the contemplative practice of art. It should offer tools to humanize technology and to challenge the notions of technology and the body.”\n\n\nThe Art Newspaper reports that the Museum of Art in San Francisco is considering shutting down its popular virtual reality (VR) museum and moving its exhibition spaces online. The move is part of a larger plan to overhaul the museum, which was created in 1982 and remodeled in 2017, in order to make the space more accessible to the public and to prepare the institution for its eventual closure.“We need to think about things in terms of what will be there for the next fifty years,” said museum director Neal Benezra. “We don’t want to ship that museum, either physically or intellectually, out of town. We’re not going to be able to take that museum anywhere, and I don’t know anyone who’s going to be able to take that museum anywhere.”The plan was developed in response to the demand for more immersive experiences in San Francisco. The museum is currently remodeling a portion of its existing building, which is currently", "The next Biennial should be held in 2020. For the first time in its history, the exhibition will be hosted by an indigenous artist. Cítémica, a Navajo artist who lives in the Oneida Nation, New York, will also be represented at the exhibition. The agency will be collaborating with indigenous artists to create the first-ever biennial of Native American art. The exhibition will be curated by artist and educator Agustín Arteaga, who will be assisted by Nandi Mabas and Trisha Brown, and will run for two weeks, May 18 and May 19, 2020. \n\n\nThe Museum of Fine Arts (MFA) in Boston announced that it is expanding its oversight of the Pfeifer Foundation’s new sculpture, “The Prize of Peace: From Prayer to Peace,” a new multi-million dollar monument dedicated to the nonviolent resistance to the United States’ aggressive war policies in the Middle East and Central Asia.The new project, titled “The Prize of Peace” and funded by the Pfeifer Foundation, was commissioned by the Massachusetts delegation to the United Nations General Assembly in New York in 2016. The piece, which was created with $110 million from the", "The next Biennial should take place in Hong Kong in twenty-six months.  Harriet Finney, head of the biennial, said: “It is a massive undertaking and a real test of our skills. It took us four years to raise the money to produce this year’s exhibition and to bring the biennial to Hong Kong. The next Biennial will be the most challenging yet. I thank everyone who has supported us in making this exhibition possible. The next Biennial will transport us to a new place, in a new way, and will be a landmark event in our history.”The exhibition will feature work by forty-six artists, including Haig Hsu, Anthony Kent, Dario Pincus, Naomi Terrell, and Nomaa Van Dijk, and will run on the same date, March 18–April 6, 2020. The 2019 edition, which explored the theme of infinity, was held in Lisbon, Portugal.\n\n\nThe Metropolitan Museum of Art in New York has announced that the fourth edition of the Whitney Biennial, “I Want You” will open on September 13 and run through the end of the month. Titled “How Can I?,” the event will", "The next Biennial should include...Art of Modern Life: The Art of Rembrandt’s Third Series, 1936–1973, which is on view until March 31, 2019; and Antique and Modern Art, 1947–1975, which is currently on view until March 31, 2019. Additionally, the museum will hold two exhibitions in 2019 for the both the Ebony and Ivory Coast, and a special exhibition at the Cadillac Museum of Art in Auburn, Alabama, in 2021.\n\n\nThe inaugural edition of the Museum in the Arts (MCA) in New York City, which was held last year and kicked off on Saturday, March 3, kicked off with a bang after it closed on Friday, March 2, in anticipation of the start of the new academic year. The event, titled “The Open,” was organized by the MCA as part of its campaign to raise $5 million for the museum’s redevelopment and construction. The funds will go toward the construction of a new 550,000-square-foot building for the institution—which will remain closed—and the renovation of the former Oolite Arts building adjacent to the museum.Inaugurating the first exhibition was a 360-", "The next Biennial should aim to redress the imbalance between the artistic and the social prairies.”Sarita and Chandrasekhar will chair the exhibition, “Live and in movement: The exhibition and the community,” which will debut at the Saatchi Gallery in Dubai on March 23. The exhibition, which will include forty works by the artists featured in the series, will be organized as a “virtual art-world” that will allow the audience to experience the works via Google Glass and virtual reality headsets. The virtual world will also feature a live performance by the artist, who will share her art with the public for a limited time only. The exhibition is sponsored by the Saatchi Foundation and the Saatchi-Hudson Foundation and will run concurrently with the twenty-third edition of the New York City Biennial, “The Future Is Present: Art and the Embrace of Experience”—both of which are currently on view at the Museum of Modern Art in New York.\n\n\nThe Massachusetts-based nonprofit Artscape has announced that it is terminating its relationship with the New York City Department of Cultural Affairs (CADA) for “Objectionable Behavior” after the agency failed to", "The next Biennial should be held in 2021. \n\nThe British artist Patricia Field’s monumental sculpture The Liberator, a bronze sculpture of an effigy of Winston Churchill, will be restored to its original, unfashionable state and displayed in the exhibition “Pier of the Sea,” at the British Museum from June 13 to June 16, 2020. It will also be relocated from its current exhibition space at the London Gallery of Art to the new exhibition space in the museum.The exhibition will feature forty works from the artist’s collection, including A Conceptualization of Media: History and Art in a Conceptualist Biennial (2017), Visual Culture in the Era of Marx and Engels (2017), and The Role of Art in History (2016). The work of the exhibition’s twenty-four artists will be organized in two categories: “Artist and Architecture” and “Artist and Historian.” “Pier of the Sea” is an installation, a work of art, and a concept. The sculpture, a bronze statue of Churchill, was commissioned by Field, who lived and worked in London, England, and was erected in the sea", "The next Biennial should focus on the development of a new set of important work-related narratives, focusing on the inter-connectivity between work and life, culture and art, and performance and performance art, as well as on how this—a critical but often overlooked period in art history—has arisen through the interplay of humanity and nature.”\n\n\nThe San Francisco Museum of Modern Art (SFMoMA) has appointed Mary Ellen Thomas as its new chief curator. Thomas arrives at the museum with extensive experience in modern and contemporary art, including her three decades as a curatorial assistant at the Whitney Museum of American Art. She will take up her post in January 2020.“We are thrilled to welcome Mary to SFMoMA and are confident her knowledge and expertise in the field will be instrumental in helping shape and maintain the museum’s collection through this challenging and transformative time,” said SFMoMA director Rona Nelson. “Her passion and passion for the art and her ability to relate to our community feel particularly meaningful and essential as we work to honor our icon in 2020.”\n\n\nAfter the California-based nonprofit Arts4Kids suffered a devastating fire that destroyed both of its buildings on Friday, February 13, the Los", "The next Biennial should be in 2021, and the exhibition should take place at the newly renovated Museum of Modern Art in New York. The first exhibition on the revamped museum will be “The Limbic Role: The Art of Childhood” in 2020, and the second will be “Autobiography: Self-Portraits in a Digital Age” in 2020.The new exhibition will comprise ninety photographs by twenty-six artists, ranging from the Caribbean to Europe, and will also introduce the museum’s first collection of works in the English language. Among the works that will be presented are works by artists such as Charles A. Ramsey, Leonor Carus, Werner Gielen, and Paul Gauguin. “The action of the exhibition is to re-create the experience of the first exhibition in this very modern museum,” said photographer David M. Irvin, who added that the first exhibition was “the first time a major work was exhibited in the United States. I’m enormously excited about this second show, and am looking forward to seeing how the artists respond to the first exhibition.”\n\n\nThe Sydney Museum of Art has welcomed two new members to its board: Kieran Hill", "The next Biennial should be held in Tokyo in 2021. The exhibition will be relocated to a different venue in Tokyo, the Shizuoka Museum of Science, where it will stage a retrospective of the award-winning work of the same name curated by the same artist in 2020. The museum will be inaugurated by the Japanese artist Ikkyu Saeki and will be able to accommodate fifteen thousand visitors.\n\n\nNew York’s Metropolitan Museum of Art (MoCA), which was forced to move the exhibition “The Traps of Art” and the catalogues for the first time in its history due to the coronavirus, has announced that it is working with the National Gallery of Art in Washington, DC, to expand the exhibition. The expansion will allow the museum to showcase more works by the artist-in-residence, Lévy Gorvy, and will include new installations by artists such as Barry Hannah, Janice Johnson, and Yinka Shonibare.  The expansion of the museum’s holdings by the Smithsonian Institution in Washington, DC, follows the recent closure of the exhibition “Barnyard,” which was staged by the SculptureCenter in New York in June and July, and the", "The next Biennial should be held in the spring of 2021, and the 2019 edition will be held in the autumn of 2021.\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Stacy B. Turner as its next director. Turner joins the museum from the MFA, where she has served as director since 2014. During her tenure at the museum, she has helped shape the institution into one of the most culturally relevant cultural institutions in the city as it has expanded to include more galleries and has established new programming.“Stacy has been instrumental in the museum’s transformation from an online-only institution into a destination that offers globally recognized contemporary art, inspiring stories of artists and their work, and a profound sense of community,” said Meg Lanthier, chair of the museum’s board of trustees. “She has been instrumental in transforming our exhibition program, our education and engagement around contemporary art, and our relationship with our audiences, and she has been instrumental in guiding us through every phase of our development.”During her tenure, Turner helped the museum make significant progress in moving away from its current location on Massachusetts Avenue, which is now home to the Peter and Paul Paul Barnes Sculpture Garden and the Charles", "The next Biennial should take place in 2020, and the first in 2021. Both are scheduled to open at the São Paulo Biennale, located in central Brazil, and will feature work by seventy-five artists, including Adriana Andujar, Erick Barajas, and Tasyu Umar. The theme of the first edition was “The Way We Live,” and the exhibition was curated by Nada Dall'Artista and Helene Dieterich.\n\n\nThe Metropolitan Museum of Art in New York has appointed Andrew Kremer as its next chief curator. In his first public role as director of the museum, Kremer will oversee the museum’s engagement with the artists and cultural community. He succeeds Daryl Sutton, who has helmed the Met since 2011, and will begin his tenure on January 31, 2021.“Andrew Kremer is a curator, scholar, and educator who has made a significant mark on the Met’s collection, its exhibition program, and its artistic program for nearly twenty years,” said Marian Geller, the Met’s director and chief curator. “He brings an exciting perspective to the museum: from an academic perspective, he has the opportunity to integrate", "The next Biennial should be held in 2020.  The artist will be asked to create a new work inspired by the new Space, which is currently under construction in the city’s Haus der Kunst Building, and will be paid $30,000.\n\n\nDavid Koehler, a Connecticut-based artist and educator, has won the 2019 Pulitzer Prize in criticism for his article \"The Terror of What Happens Next: War, Politics, and the Struggle for Beauty in Japan in the Second Sixties.\" Koehler’s essay, published in the May/June issue of Artforum, examines the work of Kojima, Miyazaki, and Sawai and the transformation of the dark-horse visual art award into an award for visual art history.Koehler was selected for his work The Terror of What Happens Next, an exploration of the ontological uncertainty of the form in relation to aesthetic and political reality. “I’ve long been interested in the’Terror of What’s Next,” Koehler writes. “The central insight of this essay is that of an unfinished, yet not yet completed, work. I do not mean, of course, that it is a work", "The next Biennial should focus on the Global South—the vast global network of people and places that are not being addressed by the issues and their solutions that are currently being presented in the exhibition. “Our show will focus on the possibility of a new world order, one that is connected not only by a common need to exist—but also by a deep and abiding love for this world.”\n\n\nThe Cannes Film Festival announced today that Joan Miró will return to the annual event next year, along with Cécile Du Preez, Adam Dallaglio, and Paul Mpagi Sepuya and will present the first edition of the festival, “The Promise,” on May 26–May 29. The film festival was founded by a group of French producers in 1985 and has been held in Paris since 1992. This year’s edition will take place at the Palais de Tokyo in Cannes, France, and will run on May 29–May 30.The festival’s inaugural Sundance season was marred by the tragic death of Michael Jackson in 2012. In an attempt to honor the late king, the organizers had planned to stage “The Promise” at Cannes’s Palais de Tokyo", "The next Biennial should be held in 2020. As the museum is currently closed until November 26, the Sophie “Kahn Gallery” in the city of Berlin will serve as the venue for the fifth edition of the Deutsche Biennale. The exhibition will be organized as an open-ended project, launching with a free public event at the museum on September 22 and running through January 31, 2021. The first edition of the Berlin Biennale, “The Genius of Franz Joseph: From Sensation to Reality” (2016), will be held in February. The second edition of the Berlin Biennale will be held in March. The third and the fourth editions of the biennial will be held in the summer. The Berlin Art Museum (BAM) will host the fourth edition of the Deutsche Biennale in April. “In this year of celebration, we are planning a new series of events,” said Frankfurter Allgemeine Zeitung editor in chief Stefan Füllen, who added: “We are also working on new exhibition programming designed for mass audiences. The fairs will be a good platform for that, and I expect they will show the best of the best, as in", "The next Biennial should be held in 2021–20, at the same time as the thirty-fifth Venice Architecture Biennale. The project, which will take place on the island of Calabar, in the bay of Cagayan, is a collaboration between the Philippines and the United States, in collaboration with local partners and institutions. The exhibition will be organized as a celebration of the country’s 150th anniversary of its independence from Spain, with the theme “Avalon 1.0: From Diaspora to Nation.”  David Cayetano, president and CEO of the United States, said: “We are thrilled to collaborate with the Philippines to promote and celebrate the art of our time through the art of our past. We hope that this exhibition will be an example of the arts and architecture of the future.”\n\n\nBrazilian artist Pablo Picasso, whose monumental paintings and sculptures often involve surreal and fantastical worlds and often embrace the power of the raw material and the absurd, has died at the age of eighty-eight. Much of his output—including the legendary work The Crucifixion of Christ—remains classified, but the artist’s widow, Cara,", "The next Biennial should be held in 2021.\n\n\nThe Australian Museum of Art (Aum) in Canberra announced today that it is now accepting submissions for its next edition, titled “We Are All One.” The project will examine the idea of solidarity and the importance of art and cultural institutions in fostering social change, and will provide a platform for artists and conceptual thinkers to collaborate and share their creations.The exhibition will be organized as follows: Art Anecdote:\n\n· Art in the Age of Trump’s**\n\n· Art in the Age of Man’s*\n\n· Art in the Age of Art’s*\n\n\nThe Kunsthalle Basel has announced that it will suspend its December fair in February 2020 and reissue the second edition of the Basel biennial, “Art in the Age of Trump” in March 2020, due to issues with the coronavirus. The announcement follows a report by Artnet in which a survey of the current state of art and culture in China was canceled in February due to the virus. The report also excluded major art fairs and art-world events that have scheduled major events and raised questions about the safety and efficacy", "The next Biennial should be held in 2021.\n\n\nThe Haus der Kunst (German Museum of Art) in Munich has announced the opening of a new digital platform that will allow visitors to view and purchase artworks through its digital and physical stores.Launched by the German Nationalgalerie (DLB), the platform will allow visitors to explore and buy works on the Haus der Kunst's website and at its physical locations (including the Museum für Kunst und Art, Berlin); at the retail locations (DRM-free stores); and on the Haus der Kunst’s website and at its retail spaces.The platform will also include an interactive auction catalogue and a digital map of the Haus der Kunst’s holdings. Visitors to the Haus der Kunst will be able to see the works that are currently on display in their galleries, review works they may want to view, and submit their own photos and videos to the platform for the public to view.A selection of the works currently on display in the museums will be shown on the platform. The works that have never been on display before are included in the special exhibition “The Structures of Modern Life: Photos, Videos, Texts, and Paint", "The next Biennial should take place in 2020. The destination will be a combination of the following themes: “The Mummies” (third view); “The Modern Mummy” (first view); “The Cadaver” (second view); and “Death and the Mummy.” The final exhibition, “The Last Mummy,” will be drawn by artist Susanne Hornig, curator of the exhibition, and will be presented by the German director Ursprung Bächli, who was invited to participate by the German Ministry of Culture and the Ministry of Education. The exhibition will be on view until January 20, 2020.\n\n\nThe Los Angeles County Museum of Art (LACMA) has received a gift of more than seventy artifacts dating back to the 1960s from the estate of actor George Takei. The donation includes a set of Levi & Co., a work by artist Matthew Barney, three original works by artist Wayne Woolsey, and an assortment of other works.The donation was made by actor Alec Baldwin, who was shortlisted for the Oscar for Best Supporting Actor for his portrayal of George Takei in the film version of Ride the Lightning (2014), and his friend and business", "The next Biennial should have opened in 2020, but was postponed due to the Covid-19 pandemic. The twenty-eighth will be held in 2021, and the twenty-ninth in 2022.“I want to thank everyone who has been part of the development and design communities in the City of New York and the state of New York since I’ve been in business,” said grand marshal Daniel Quinn. “I’m ecstatic to launch the next year with a new vision and a new set of ambitions.” The next iteration of the Biennial will take place at Rockefeller Center in New York from March 8 to March 10, 2021.The 2019 iteration, titled The New York City Experience (TIE), was held at the Metropolitan Museum of Art; the 2020 iteration, “The New York City Experience: The Future Is Present,” will be held at the new Donald and Edsel Trump-designed Trump Plaza in midtown Manhattan on the Lower East Side. The venue will boast a gated entrance and will host live music and performances from March 15 to March 16.TIE will be followed by TIE: The New York City Experience,” which will be held at the", "The next Biennial should take place in 2021. [Update: April 4, 2020] The 2018 edition of the event, “Avenir,” was canceled due to Covid-19, and the 2019 edition, “The Turning Point,” was shortened.\n\n\nParis’s Lyon Art Museum has received a gift of more than 1,500 works that were stolen from its collection in the city of Rennes in France last week. The art has since been found and returned to the institution, which is currently working to determine the provenance of the works, reports the Art Newspaper.The crime involves an incident that unfolded on December 8, when a group of tourists in a car in Saint-Rémy-de-Provence boarded a metro train from the Louvre to the Louvre. Upon arrival, the group was handed a booklet that contained the works of eighty-five artists. It also included an instruction sheet with directions for the theft.The thieves left the works in a storage area in the museum, which houses a monographic collection of more than 6,000 works by nineteenth-century French artists. The author of the booklet was the same person who provided the authorship and the works for the instruction sheet", "The next Biennial should be held in 2021. \n\nThe Voice of the People, the United Kingdom’s public art organization, has announced the launch of a new digital platform that will allow the public to connect with artworks and artists through a variety of diverse means, including by way of Twitter, Facebook, Instagram, Tumblr, Pinterest, and YouTube.“The Future Is Present,” will soon be available as an app for both iOS and Android devices. It will connect with around one hundred artists and will receive a daily stream of twenty-four hours of live programming, curated by the artist and organized by the artist. The platform will also host curated collections of work from the artist’s previous shows and will feature personal Twitter messages from the artist.“The Future Is Present is a platform for us all to connect with artists and their work,” said Karima Akram, director of the biennial. “It will also enable us to talk about the future more broadly, to talk about art and creativity and about how art can help us now and in the future.” Artwork and artist interactions will also be presented through interactive virtual events, such as the exhibition “The Future Is Present: VR"]