["The next Biennial should be staged in September 2020 and will feature a selection of new works by forty-four artists, including Amiri Baraka, Yamina Antin, Yvonne Cohen, David H. Davis, Joseph M. Lei, and David Levine.\n\n\nThe Solomon R. Guggenheim Museum in New York has announced that it has received a gift of thirty-six works by contemporary artists including Rirkrit Tiravanija, Julia Ortega, and Liza Lou. The works were donated by Helen and John Macdonald, who were longtime supporters of the institution. The museum is currently working toward acquiring thirty-six works by twenty-four artists, including Yinka Shonibare, Hsin-Chien Huang, and Hsin-Chien Wang, and was gifted three works by Moët Hennesy, who died in 2011, and a work by Kandinsky. The gift also includes a selection of works by artist Nadine Meringue, whose practice spans painting, photography, sculpture, performance, performance-making, and performance-making-related work. The museum is planning to display the works at the institution until 2021.The Guggenheim has previously presented the works by popular artists such as", "The next Biennial should be in December 2020 and will aim to be a new form of performance, the themes of which will be chosen by the artist. The curated exhibition will incorporate discussions around the artist’s past works and will be held at the artist’s home and in the artist’s studio. “The exhibition will be organized in three ways: 1) the artist will present her own narrative, in cooperation with the participants; 2) the artist will write a dialogue with the participants; 3) the artist will present the dialogue as a video installation.”The four selected artists for this year’s iteration of the exhibition are: Abdel Kader al-Kubra, Abu Dhabi; Cécile Biege, Paris; Ibrahim Abdulrahman, New York; and Mohamed Abdelmuttal, New York. The exhibition will be curated by Sohrab Mohebbi, the director of the Center for Arts at Abu Dhabi and a curator of previous editions of the exhibition.\n\n\nThe Museum of Fine Arts (MFA) in Boston has received a gift of more than 1,300 photographs by American photographer James Urbani. The donation, made", "The next Biennial should be organized in 2020 and is currently currently on track for completion in 2021. The 2019 edition, titled “The Power of Place,” was held in the city of Marrakech and featured more than 1,500 works from seventy-five artists, including Michaël Bonakdar, Bastien Balsom, Kiki Smith, Wally Yoako, and Tomás Levi. The exhibition was organized by the institutions of art and architecture from twelve cities in Western and Central Africa. “We are thrilled to return to Marrakech for its twenty-fifth edition,” said Nandini Chatterjee, director of Arts Council India. The event will be held at the Central Institute of Cultural Technology (CIT) in Marrakech and will run from September 6 to September 7, 2020. The 2019 edition was curated by Nandini Chatterjee and featured works by art and architecture from twelve cities in Western and Central Africa. The exhibition was organized by the institutions of art and architecture from twelve cities in Western and Central Africa, and was curated by Nandini Chatterjee. The 2019 edition was curated by Nandini Chatterjee and featured works by art", "The next Biennial should take place in 2021. The project will also introduce a new eight-meter-long hunting lodge, a new sculpture by the artist Amanda Kuk, and a new narrative installation by artist Maya Lin. The event will also include the opening of a new medium-sized museum, wherein the exhibition will be held in a massive new building that will offer a compelling public experience. The bid for the $26 million project was first submitted by the Tartu Architects and the São Paulo Bienal in 2018. “The goal of the 2019 biennial was to develop a new collection of contemporary art in the center of Lisbon, and I was pleased to be able to announce the opening of the new exhibition, ‘Art of the Future,’ a major project of the 9th International Biennial of Art,” said Art of the Future director Iwan Wirth. After the opening of the new exhibition, Art of the Future will take up the theme of the future as the twenty-first century approaches.” \n\n\nMIDWESTAK, Germany (The Borowica Group) - The German government approved on Wednesday a $16 billion aid package for the arts, cultural, and", "The next Biennial should focus on the interrelationships of art and the African diaspora, drawing on a collection of works from the exhibition “An international community of art collectors, art historians, and art enthusiasts in the African diaspora.” It should also include a discussion of the relationship between Africa and the United States, and of the potential for art and African subjects, art and culture, and art and art and politics in the twenty-first century.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Omar Barakera as its next executive director. Barakera comes to the institution from the Museum of Contemporary Art (MoMA) in Los Angeles, where he has been the acting director since November 2017. He succeeds Matthew L. Smith, who retired after more than five years following a merger with the new museum in January 2020.“I’m excited to join the distinguished and talented staff at MoMA and welcome Omar into the organization,” said Smith. “Omar is a policy wonk who is a master of his craft and knows MoMA and its wonderful collection intimately. We see a bright future for MoMA as it embarks on a journey that will take us to the", "The next Biennial should be held in 2020. The third one will be held in 2022. The eighth will be held in 2023. The eleventh will be held in 2026. The thirteenth will be held in 2028. The seventeenth will be held in 2029. The twenty-eighth will be held in 2030. The twenty-ninth will be held in 2033. The twenty-fifth will be staged in 2034.The twenty-sixth will be staged in 2036. The twenty-seventh will be staged in 2037. The twenty-ninth will be staged in 2040. New York, the City of Ours, and New York/New Jersey have issued a joint statement regarding the coronavirus. The statement reads: “The coronavirus is an illness that afflicts humans with a virus that is spread primarily from person to person, or between people, through direct contact with the virus. The United States is experiencing an outbreak of the coronavirus, and we are working hard to contain the virus, to prevent the spread of the virus, and to protect people from the virus, as best as we can. We will", "The next Biennial should be in December 2020, with a date for its first public exhibition in April 2021.\n\n\nThe National Endowment for the Arts (NEA) in Washington, DC, has released guidelines for the distribution of more than $1 billion in grants and grants awards over the next five years. The guidelines outline how the NEA should focus on the arts in an effort to revitalize the nation’s capital.The NEA plans to distribute $9.6 billion over the next five years, representing $1.2 billion in direct grants and $3.6 billion in support of cultural and community-based organizations. The agency will also limit the amount of individual awards to $5 million each, with specific guidelines for how the funds should be spent and an option for organizations to request additional direct grants. The guidelines come on the heels of an announcement that the NEA will receive more than $1 billion for the 2019–20 fiscal year. The agency is currently working on a new round of awards that will launch in the spring of 2020. The grants will be distributed through a special formula that uses census data from the American Community Survey and the American Community Survey for each city and will prioritize grant recipients based on their artistic performance in the", "The next Biennial should be held at least once every other year. The exhibition will be hosted at the Institut des Arts et Lettres (ASL), in Paris, which is currently undergoing a major renovation, and will be comprised of works by fifty artists, including Pascal ouâtitia, Iwan Patzer, and Jean-Luc Godard. The twenty-second Biennial will be held at the Museum of Modern Art (MoMA), in New York, and will be comprised of works by seventy-five artists, including Irrfan Hasani, Adrienne Edwards, and Tanya Bonakdar.  The 2017 edition of the Biennial, “The New Art of Death,” was organized by the artist-run nonprofit Artforum under the title of “Death and Absurdities: Art and Absurdities in the Age of AIDS,” and featured work by eighty-two artists and fans. “The closing of a chapter of the Artforum I, was an absolute pleasure,” Paul Mpagi Sepuya and Wangechi Mutu said in a joint statement. “We have been working for more than a decade to put together a show that would connect the stories", "The next Biennial should take place in the spring of 2021. The event will be hosted by the new museum, which will be inaugurated by a biennial exhibition, “We Live Together,” and will present then-unheard of work by the artist-activists Charles and David, along with the likes of Peter Sellars, Michael Hellman, and the late Japanese artist Yoshitomo Tange.While the museum will begin by presenting works by the two artists, it will move into the closet four years from now, in 2025. Since its founding by the German American architect Dietrich Reimer in 1933, there have been more than sixty collaborations between the artist and the museum.For the next edition of the exhibition, curated by the artist himself, a collection of twenty-four works by local artists will also be presented. The biennial will then return to the coast of Southern California, to the Los Angeles Institute of Art (LAICA), and will tour the city of Santa Monica and the surrounding area, and will feature works by twenty-one artists from eleven countries.The next iteration of the Biennial will take place at the Santa Monica Pier, which is currently undergoing a $500 million expansion, in 2020. The venue will then expand to", "The next Biennial should focus on human rights, sustainability, and art in relation to climate change, on the collection and exhibition of works that address issues of extinction, that engage with the social and philosophical upheavals and political transitions that have taken place in the world.” The 2019 iteration was held in conjunction with Climate Action Summit.\n\n\nThe American painter Benoit-François Neibert, who often drew from his own life and those of others he admired, has died at age eighty-three. His works, which range from sculptural realism to experimental theater, have been collected by the SculptureCenter and the Rosenbach Museum in Berlin, the Rosenbach Art Museum in Munich, the CNEA in Paris, and the Museum der Moderne in Vienna.Born in New York City in 1936, Neibert rose to prominence in the 1960s through his experimentation with painting and drawing. In 1974, following a five-year stint at Art Institute of Chicago, Neibert moved to Paris, where he lived and worked with his close friend Jean-Michel Basquiat, who named him in honor of his daughter, the artist Elisabeth, a contemporary of Neibert’s. As was the case in Neo", "The next Biennial should begin in May 2020, with the establishment of the pavilion “at the Centre Pompidou in Paris.”The project will also include the development of a new contemporary art program at the biennial, which will be hosted by the Centre Pompidou, and will include a lecture series, a new selection of works and a new exhibition called “Presuatives.” The Biennial of the External Environment will be held in Paris. The work of the exhibition will be curated by Lau Tylor and will be organized as a “Passion Curtilage” exhibition. “The exhibition is not an extension of the work of the Centre Pompidou, but an extension of the work of the many Oivaldo-inspired artists who have shaped the pavilion and its exhibitions since its founding in the 1950s,” the experts said. A selection of the works of the year will be presented in the pavilion, which will be restored in 2020, as well as a special exhibition of work by artists such as Josh Smith, Peter Cook, and William Eggleston, as well as a photographic exhibition of works by Annie Prouvé and Jean", "The next Biennial should open in the fall of 2020, but the exhibition is currently on hold as the Bolivian government works on implementing a carbon tax. The show will resume in March 2021, and will address the rapid spread of the novel coronavirus, and its impact on human health.\n\n\nThe Metropolitan Museum of Art in New York has announced that David K. Johnson, a leading American architect, will take up the post of Museum director in January 2021. Johnson will be responsible for cultivating and maintaining the museum’s artistic and cultural energy, which has been sorely lacking since it closed to the public in March 2013. “David has been an architect of modern art for nearly thirty years, and has grown into one of the most important and influential voices in the field, becoming an influential mentor and championing projects that challenge the boundaries of what is possible,” said Museum Chair Peter LaBarbera. “His vision for the Museum is an ideal fit with the contemporary mission of the Metropolitan. He is passionate about designing for new audiences and navigating the boundaries of modernism, and about building a museum that is both vibrant and accessible to a broad and diverse community of artists.”Since his appointment, Johnson", "The next Biennial should take place in 2020. A public apology will be made to the organizers, and the National Gallery of Art will inaugurate a new exhibition of works by the six artists whose works were featured in the exhibition. The next exhibition will be hosted by the National Gallery of Art and the Museum of Fine Arts in Boston. \n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Kate Hartigan as its next director. Hartigan comes to the museum from the Metropolitan Museum of Art, where she previously served as director of collections management. In her new role, she will oversee the development and execution of the institution’s collections, collections programs, and exhibitions, as well as the collection and exhibition of works created by female artists.“Kate’s leadership and vision for the MFA’s collection, exhibitions, and collections program are unparalleled, and her ability to prioritize and prioritize in a way that is both collaborative and individual is truly exceptional,” said Elizabeth Anne Enge, director of the museum. “We are privileged to have her as our next leader and extremely proud to have her on staff.”Hartigan will assume her responsibilities on January 5, 2020. Previously, she served as director of", "The next Biennial should be the last, and the last’s, of the series. . . .”\n\n\nThe Museum of Fine Arts (MFA) in Boston has announced its representation of the Italian Renaissance painter Andrés Villani, whose work is widely regarded as one of the earliest mass-produced abstractions created in the United States. The work, which was exhibited in the 2019 exhibition of the Italian artist’s work at the Museum of Modern Art in New York, will be featured in a new exhibition, “Vincent van Gogh and the Modern World,” at the museum in December 2020.The painting, which was created in the Pietà città di Campino area of northern Italy in the late 19th century and was painted with a brush and not a palette, has been restored to its original state and is now being presented as a new exhibition, “Andrés Villani: Painting and the Modern World,” at the MFA in December 2020. Villani’s work will also be included in a new book, “The Artist’s Story,” due out in January 2021. \n\n\nThe French artist Nadine Ghebaly", "The next Biennial should be held at least once a year and will be given a budget of $30,000. The artworks will be presented by the institution of South Korea, which is preparing to host the first edition of the exhibition in 2021. The exhibition will be organized as a series of interrelated multimedia experiences. The event, which will be held at the Kunsthalle Württemberg in Berlin and will be co-organized by the Kunsthalle Basel in Switzerland and the Kunsthalle Zurich in Switzerland, is part of a global campaign to promote and elevate art and culture by highlighting the best works of emerging and established artists. The initiative was launched by the Kunsthalle Württemberg in 2016, in partnership with the South Korean government and the Ministry of Culture. The 2019 iteration of the event, titled Art and Politics, was held at the Art and Design Museum Seoul (ADM) in Seoul as part of a free, public-private partnership with the country’s Ministry of Culture. “The history of South Korea including art is a fascinating one, if not a bit depressing,” said Kunstverein Berlin’s director, Jin Se", "The next Biennial should be held at the Palazzo Reale di Milano (Sangre:Tadino Alugasse di Milano), in Rome, in 2022. The theme of the 2019 edition, “The Clinic,” is a reflection of the city’s current crisis. The theme of the upcoming edition, “Resilience,” is a blueprint for how to avoid and manage trauma and trauma recurrence. The museum is currently working on a new program that will draw from the themes of the biennial. The first exhibition is slated to open in January 2020.\n\n\nThe Metropolitan Museum of Art in New York has announced that it will begin welcoming visitors back to the institution from January 20, 2020 to March 22, 2020. The reopening date is part of a larger plan to modernize the museum’s collection, prepare for reopening in 2021, and rebalance its exhibitions in order to minimize the likelihood that the museum will be forced to close again in the future.The overhaul of the museum will be led by Art Director Nick Hornig, who previously served as director of the Museum of Modern Art from June 2019 to March 2020. The museum’s collections and programs will be", "The next Biennial should take place in the spring of 2021 and will be hosted by the Museo de Arte Contemporáneo and will take place at the Museo de Arte Contemporáneo (MASC), Maricá, in Madrid. On behalf of the board and staff of the Biennial, I thank the organizers of the upcoming event for their kind and in-depth consideration of the exhibition and for their clear and specific commitment to the Art of the Future exhibition.The new exhibition will include contributions from more than seventy artists who have recently or will participate in the exhibition in 2020, including Sargent’s solo exhibition at the Museum of Modern Art (MoMA), Miami Beach; Lora Rynd, the home of the daguerreotypes; and the first exhibition of works of women artists in the United States.\n\n\nThe Smithsonian American Art Museum (SAAM) in Washington, DC, is launching a new program that will provide millions of digital images of its collections across the United States. Dubbed “Reading the Front,” the initiative will allow curators and scholars across the globe to see how American art has shaped the visual experience of the nation.“SAAM is committed to", "The next Biennial should be held in 2021. Los Angeles has hosted the annual event since 1974. \n\n\nA new art museum in the northern German city of Essen, which opened in the former Essen factory district in 2017, has announced that it will broaden the focus of its exhibitions and education programs to include themes related to the Holocaust, racism, and the European refugee crisis. Named after the German word for \"truth,\" the museum’s new Holocaust-themed exhibition “Auschwitz 2.0: The Final Solution” will highlight the work of the Frankfurt-based, nonprofit organization the Federation for Contemporary Art and Technology (ATCT), whose founder, Wolfgang Klee, was a leading member of the European right-wing movement known for advocating for a harder line on immigration and refugees.Klee’s organization commissioned artist Erich Malsch and the artist-run organization Artforum.de to create a public work, which documents the rapidly escalating atrocities committed by the Nazis, and the work was exhibited at the 14th Biennial of the German Association of Art in Hannover, Germany, in March. According to the New York Times, the installation, titled Auschwitz 3.0: Burnt Offer", "The next Biennial should be staged in 2020, according to a report published by the European commission. The initiative, which was launched in 2007 to promote the art of the Third World, aims to create a common agenda for the exhibition. The 2020 theme will be “We Are Still Here.” The commission’s president, Łukasz Lotzdziewier, said: “Each year ArtsEurope supports the work of those artists and organizations that have made significant contributions to the advancement of European art and culture, including those in the Third World. In 2020, we hope to celebrate the legacy of the great Hungarian artist Szombathely, and to continue to explore and consider the many dimensions of creativity and art.”\n\n\nThe San Francisco Museum of Modern Art (SFMoMA) has received a gift of more than 1,500 photographs by American photographer Rosemarie Cropper, whose work is often included in exhibitions of the same name but rarely seen by the general public. Based in San Francisco, where she lived and worked for most of her life, Cropper often shared photographs of herself in her own words, often describing her own body as a medium. In 2006, the Los Angeles Times reported that she", "The next Biennial should start in March 2020 and will be hosted in Hong Kong. The 2019–20 event, which was staged in autumn in Hong Kong, received a mixed response from the Chinese artists who judged the competition\u0097some found the exhibition to be too experimental and others believed that the show was missing an essential point.“Wang Chi-shun’s Tin: A Six-Walled Villa,” which was organized as an exhibition of eight drawings, was selected for its exploration of the idea of meaning and its inclusion of a metalwork that mimicked a six-sided domestic mound, a symbol of Yin and Yang. The exhibition was given the prestigious China Prize in 2019 for its exhibition “Monochromism,” a combination of photographs and video that also featured a six-sided metalwork. The exhibition was also awarded the prestigious Great Art Prize in 2008. \n\n\nThe Carolus Printz-Weiss Collection in Berlin has announced that the collection will move to a new home in the city of Bonn, Germany. Located in the historic district of Krefeld, the institution has been the home for the works of Carolus Printz-Weiss since 1975. Over the years, the collection has", "The next Biennial should focus on ways in which art and narrative intersects with the modern social and political landscape, as well as the current State of Israel, and how this symbiotic relationship can be renewed. “Israel and Palestine meet in the heart of modern art,” was the theme of the first edition of this biennial. It will return in 2022.\n\n\nThe J. Paul Getty Trust has established the $7.5 million Daniel B. Weiss Art Prize, which will reward artists who have made significant contributions to American art over the last five years. The award was established to honor a gifted young artist whose work is now in the collections of the Museum of Modern Art, the Museum of Modern Art, Boston, the National Museum of Women in the Arts, and the Metropolitan Museum of Art. Weiss was born in Santa Fe, New Mexico, in 1970 and grew up in Chicago. He has exhibited his work in public collections throughout the United States, including the Getty Museum, the Museum of Modern Art, and the Whitney Museum of American Art in New York.“Daniel Weiss is a gifted, versatile artist whose work fulfills a fundamental role in our cultural and political landscape,” said Arthur Wieseltier,", "The next Biennial should be held in 2020.   The final design of the exhibition will be announced in 2021. \n“The Contagious Disease Research Center at the University of Washington, Seattle, has received a $50,000 grant from the Seattle-based foundation Art in America. The foundation was inspired by the museum’s Center for Contemporary Art, which was founded by Mose Allison and Richard L. Evans in 1991. The Seattle Art Museum is currently experimenting with a new taxidermy model to create a more collaborative, community-centered experience for visitors.”The gift follows a year-long engagement with local artists, researchers, and arts organizations, including a public art installation and a discussion with Ravi Chaudhari, cofounder and chair of the Seattle Art Museum, on the upcoming exhibition “Blackout: Painting and the Politics of Madness” and the upcoming exhibition “Melissa and Pilar as Seen from the Museum of Seattle.” The grant also supports the Seattle Art Museum’s scholarship program and the institution’s cooperative agreement with the Seattle Children’s Museum.Among the artists whose works will be featured in the museum’s new exhibition are Alberto Barbera’", "The next Biennial should aim to show the work of Venezuelan artists in the Americas, with a particular focus on Pedro Oostra and Haris Pimentel, whose work recently won the Prix de Plumeaux in Paris, and to present an exhibition of works by the Cuban and Colombian artists Juan Fernando Ruiz and Leila Esparza.The Biennial will also aim to increase awareness of the diversity of the Academia Cristales and of the movements of the art from Europe to the Americas, with a view to reopening the museum in 2020. In addition, it will consider how art can be disseminated in a post-Brexit United Kingdom.Today, the Biennial is honored to have Pedro Oostra, Haris Pimentel, Juan Fernando Ruiz, Megué Tazuke, Azael Malek, and Lourdes Madadi as curators.\n\n\nThe Museum of Fine Arts (MFA) in New York is planning to move almost two thousand works by artists and collectives from its current home on East Seventy-Third Street in Manhattan to the museum’s new headquarters, which is currently under construction. The move will create a new institutional space that will house the works of eighty-three artists and collectives", "The next Biennial should be held in the spring of 2022. With the help of the professional group Artsinformatics, the committee will prepare the Biennial 2018, which was held in the university’s student center on May 29–May 31, and produce a new exhibition for the museum that will reflect the theme of the upcoming twenty-third edition of the Biennale. The committee also expects to launch an online portal that will allow visitors to continue to experience the exhibition. \n\n\nThe British Museum in London is offering several hundred museum professionals the opportunity to relocate to the United States in the immediate future. The museum announced on Thursday that it is suspending its annual residency program in the UK for a few months. The mid-January program, which was created by the organization MCA, which has a contract with the British Museum, has been held in London since 2011.“The short-term move is designed to help prevent the loss of employment and support staff, and to allow museum professionals time to think about their future,” British Museum director Maria Balshaw said in a statement. “As a museum, we are delighted to be able to welcome visitors to our new space in London. However, the museum cannot and will", "The next Biennial should take place in the early 2020s; the last one, which will be held in 2022, is currently on hold due to the Covid-19 pandemic.\n\n\nOver the course of the last two decades, the Museum of Contemporary Art (MoCA) Los Angeles (MCA LA) has transformed itself in order to become a more culturally responsive museum. Through the construction of multiple new spaces that reflect local communities, the move of the institution to a newer building at 800 S. Santa Monica Boulevard, and the expansion of its collection, the museum has undergone a $125 million facelift. In addition, it has invested in new digital tools and education initiatives.The renovation project, which was led by architecture firm Gensler + Condon, involved the redesign of the building in which MoCA currently exhibits works by major contemporary artists, including Pierre and Edith Leguizamo, Mary Cassatt, Peter Andre, and Jean-Michel Basquiat; the reopening of the institution in 2018, a year earlier than originally planned; the construction of a new classroom building on the grounds of the museum, the \"Courtyard\"; the renovation of the former storage facility for the collections of George a. Lucas and Robert Raus", "The next Biennial should take place in April 2020.\n\n\nThe British Petroleum (BP) Foundation has launched a new initiative to support artists and cultural workers in the oil and gas industry. The initiative, Artists and Oil, was established in order to promote the work of underrecognized British artists. The initiative is designed to be an inclusive platform for artists and helps them reach out to larger audiences and engage with a wider array of audiences through grants.The grants range from $5,000 to $25,000 and are open to any artist, including Andy Warhol, David Attenborough, Cézanne, Richard Linklater, and Tim Burton. For the project, the foundation will organize weekly studio visits, which will take place in London, New York, and other major cities, to promote the work of forty-three artists and collect their feedback on a series of visual and performance works.“The foundation was established as part of an overall strategy to support British artists and to celebrate the extraordinary achievements of artists in other countries,” said Kate Lucas, director of the BP Foundation. “The strategic plan also identifies how we can support independent, digital, and physical artists and how to make the", "The next Biennial should be held in 2021. The opening of the first Biennial in the UK was in 1885, the year before the foundation of the Royal Institute of British Architects, which is based at the University of the Arts London (RA).  The British pavilion should be based in Greenwich Village, Greenwich, and will host an international exhibition on art rather than a single institution. The board of trustees of the Royal Institute of British Architects (RIBA) has appointed Peter Whittle as its next chair. Whittle will assume his post at RIBA in January 2021.Whittle will take up his new role on January 28. Whittle will serve in the role of president until the end of the biennial. Whittle’s predecessor, Andy Clarke, held the position for twenty-three years. Moderated by Hilary Robertson, the RIBA board president, the inaugural exhibition “The Year in Art” will continue to operate as a platform for artists and will present a retrospective of the work of Merry Norris in March 2020. The biennial will incorporate work from forty artists, including Paul Gauguin, Bertrand Bish, Diane Arbus, Norman Rockwell, Ray Dalio, Frank Gehry", "The next Biennial should take place in the city from November 26 to March 29, 2020. \n\n\nThe Museum of Fine Arts (MFA) in Boston has received a significant donation of twenty-one works worth $10 million from an anonymous donor. The gift includes a collection of works born in the city of Boston and relocated to New England, as well as a selection of works from the collection that were purchased by MFA as part of its “Triumph of the Mind” project, a gift in 2007 that brought twenty works from the collection to the city after the completion of a $6 million expansion project.“We are incredibly gratified to receive the support of this generous donor,” said MFA director Marc Glimcher. “The work of the MFA’s collection is a powerful testimony to the city’s art history and its capacity for innovation and creativity. The museum is navigating the first chapter of the 2020–21 fiscal year with a clear mind and an open heart. We are confident that we will continue to present the Museum of Fine Arts in Boston a compelling exhibition and a comprehensive collection of works for generations to come.”Since its founding by philanthropist William M. Kunst in 1961", "The next Biennial should be staged at the Capitol Museum in 2021 and the Capitol Visitor Experience in 2022. The biennial will also receive funding from the National Endowment for the Arts. The ten-year fund will also draw from funds from the House of Representatives and the Senate, which will each allocate $2.5 million to the Biennial.The total budget for the event is $6.5 million. The 2017 exhibition, titled The Paths of Light, featured nearly forty works by forty-four artists, including Dev Patel, Carlos-François Cardin, and Dato' Al-Maqdisi, which will be shown alongside works by artists such as Cartier-Bresson, Vincent van Gogh, and Tadao Ando; Journey to the West, which will feature twenty-five works by twenty-six artists; and Jerusalem: From the Storms of Heaven, a retrospective of twenty-three paintings by twenty-four artists who hail from the Palazzo delle Papesse. The exhibition also includes an exhibition of work by Italian artists Amadeo Cattelan and Stefano Labbatelli.The Palazzo delle Papesse will host the", "The next Biennial should take place in 2020.The work of the exhibition was curated by Vincent van Hooijenhove and Ola Baron and was organized by van Hooijenhove Gallery and Galerie in Brussels. \n\n\nThe São Paulo de Janeiro-based gallery Arturo Mariscal, which has locations in São Paulo, Rio de Janeiro, and São Paulo, has received a gift of two works by Brazilian artist Íñigo Lopes, who was one of Brazil’s top-selling artists of the 1970s and 1980s. The works, titled “Jumeiro de cão mai” (To My Self, Paris), and “Copacabana,” were given to the gallery by São Paulo’s mayor, Julián Seroussi, in a ceremony held on April 4.“The future of the galleries and museums in our city is at stake,” said Valentin Albuquerque, the gallery’s director. “The artists who took the risk to create these works in the first place, and the partners who made them possible, are all very important to the city of São Paulo. We are all very grateful.”The works", "The next Biennial should take place in 2021. “I have always believed that the greatest art is made with the help of the most talented,” said Noguchi. “The Biennial was the vehicle to engage the artists and to present them in an unprecedented way. Through the exhibition, its digital platform, and the exhibition series, the artist received new and original works by artists who would later be selected for the event. It was an eclectic mix of young and established artists who were in a unique position to create works of their own design.”The biennial has received numerous awards, including the Central Council of Fine Arts Artists of New York and the Central Council of the New York School of Art’s Arts & Activists Award in 2017.In 2018, the National Endowment for the Arts (NEA) awarded the Biennial a $10 million grant to commemorate the event’s tenth anniversary. The Arts Council of New York and the NEA also pledged $500,000 to improve the accessibility of the exhibition through the installation of a new floor plan and the renovation of the building adjacent to the exhibition space. \n\n\nThe Tate’s board of trustees has appointed Peter Warr, a former director", "The next Biennial should be held in 2021.  For its seventy-fifth edition, the Biennial will include a symposium on art history, and the event will be hosted in conjunction with the event of the year, the 'Festival of Cultures.”\n\n\nThe University of Chicago has appointed Julie Dillon as its next director. Dillon will be responsible for overseeing the research, execution, and maintenance of the institution’s art and architecture. She will take the helm from Laura Spivak, who will retire at the end of the current academic year.“Her leadership, and the transformation of the University of Chicago as a modern forum for inquiry and discovery, will require the institution to address some of the key challenges facing the arts in the twenty-first century,” said chair of the board of trustees Elissa MacGill. “Her work will shape the next iteration of the Biennial, and she will be essential to its future success.”In her new role, Dillon will assume her responsibilities as director in April. During her tenure, she will oversee the research, writing, and curating of the upcoming biennial—an eight-year project—as well as the restoration of the deC", "The next Biennial should take place in 2021.\n\nThe art historian Monica Marciano, who curated the show, said: “We are always looking to the future. . . . The exhibition of artists who are emerging and of their work is an opportunity to re-create that emerging art.”The show’s next iteration, slated to open in 2021, will be organized in collaboration with Sol LeWitt’s studio, the large-scale installation installation Archives of a Lifetime, and the artist’s son, Evan Peveto, and will include work by seventy artists. The show will introduce new themes, including the concept of “inversion of form” and the work of well-known artists like Willem de Kooning, John Constable, and Mark Rothko. The first show in the series will open at the Museum of Modern Art, New York, in October.\n\n\nThe Art Newspaper reports that the Metropolitan Museum of Art in New York has appointed Rachael Wainwright as its new deputy director for collections and exhibitions. She succeeds Cindy Ferrari, who departed from the museum in December 2019 to become the executive director of the Museum of Modern Art in", "The next Biennial should be called for “Responsive Design” and will be held in late March 2019. It will be sponsored by the Yokohama Museum of Art in Japan and will be led by Kazuko Nakajima, a curator at the Kunsthalle Bern, the Museum of Contemporary Art in Tokyo, and the Museum of Contemporary Art Shanghai. If the theme is “Responsible Consumption,” the exhibition will consist of more than 200 works, including a series of photographs by Homasa Dekker.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, announced today that it will cancel the 2020 edition of its “Commander-In-Chief” biennial, “The Commander in Chief: Treason on Trial,” and re-evaluate its programming over the next twelve months. In a statement, the institution said: “This is not a moment of retreat. This is a moment of outrage and disruption.”While the institution said it does not believe the decision to postpone the event was made lightly, the move follows months of protests from artists and activists who have worked with the commission since it was launched in 2016. “I’m here to protest the", "The next Biennial should focus on “Belonging.” The ten-day event will run from December 5 to December 9. The biennial will present works by forty-eight artists. The biennial of the artist-run platform Artstation will also be held at the Palazzo Nazionale di Filippo in Venice on December 4–December 9.The inaugural event, “Unfinished Business: Twenty-Four Hours at the Ghetto Museum in New York,” will showcase work by twenty-four artists. Prior to its reopening on December 8, the museum will hold a public viewing of “Amarashanti” on December 6 at 7 PM. The exhibition was curated by Joseph Cornell, director of the Museum of Modern Art in New York, and best-selling author Tanya Berlin, who will lead the project.“This exhibition is a gift from the artists, whose work reflects their values and their commitment to nonviolence,” said Peter De Vos, director of the Biennale. “The biennial is a platform for them to express their humanity, their humanity as human beings. . . . We hope it will also give you hope for your own life", "The next Biennial should be in 2022.  The National Gallery of Art in Washington, DC, is seeking a new ten-year contract, and the Stedelijk Museum in Amsterdam is currently in the process of setting up an initiative that will showcase the work of 150 artists. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has been awarded a $75 million donation from the Richard and Helen DeVos Foundation for its new endowment. The gift is one of several that have been made by the family in support of arts and cultural institutions in the United States, and is the largest single endowment from the DeVos Foundation. Among the institutions that will receive the funds are the Center for Contemporary Art in Chicago, the Detroit Institute of Arts, the Los Angeles County Museum of Art, the Metropolitan Museum of Art, and the Museum of Contemporary Art, Los Angeles. In addition, the center will host twenty-four exhibitions, including the first-ever “Cultural Biennial,” and will receive a portion of the donor’s endowment funds.“The family has made a lasting contribution to cultural life in this country,” said David Levine, chair of the National Donors Council and director of the Richard", "The next Biennial should also feature works by local and international artists, and be organized under the leadership of a curator. The theme of the exhibition “A Dream of a Nude Woman,” will be the theme of the forthcoming edition of Art Basel Hong Kong:“A Dream of a Nude Woman” (2019), a solo show at the venue in collaboration with Artforum’s Editor in Chief, Hao Li. The show will also feature works by artist-activists, researchers, and artists in hospitals, schools, and other public spaces. “This is a year to renew and reimagine the role of art in our lives,” said Takashi Kitayama, the director of the Biennial. “We are learning from the artists and looking forward to their participation in the next iteration of the Biennial. They have made an indelible mark on the art world, and we are proud to feature their work in the upcoming edition of the Biennial.”The full list of participating artists is as follows:<|endoftext|>Pressure Cooker Vegetable Oil: A Case Study\n\nBy: Elizabeth Loftis, Ph.D.\n\nPublished: January", "The next Biennial should be held in 2021, and the first will take place in the city in 2022. The Art Newspaper reports that the biennial will focus on environmental issues and will address issues of sustainability through the work of artists, activists, and designers. The Golden Temple, a UNESCO World Heritage site located in the Sangam district of central Bangkok, will be inaugurated as the venue for the exhibition in 2022.\n\n\nThe German government is preparing to launch a series of emergency aid packages for artists and cultural institutions following the devastating fires that swept through the German capital on September 2. The first aid package, which will consist of $676 million, was announced on September 24, and will launch in stages, with the first grant program, which is estimated to cost around $147 million, scheduled to kick off in October. The second grant program, which will consist of $258 million, will begin in late October and will last through December. The third and final aid program, which will be announced in the second half of next month, will aim to help the cultural sector through a $220 million shortfall in funding, as well as to reward institutions that have taken action to reduce their carbon footprint.Chancellor Angela Merkel announced the emergency aid package in a speech to the", "The next Biennial should be held at least twice a year and should aim to produce a work that embodies the spirit of Africa with a certain balance between art and culture. The themes of the upcoming exhibition should reflect the current zeitgeist.”\n\n\nDays after a gunman opened fire at a Sikh Temple in Wisconsin on Wednesday, killing six people before committing suicide, a group of B.C. artists took the stage at the Sikh Museum in Vancouver to protest the Canadian government’s handling of terrorism and racism, and to demand that Canada do more to protect minorities in the country. The protest was organized by the B.C. Civil Liberties Union (BCCLA), which is part of a coalition of civic groups opposed to the controversial controversial legislation criminalizing hate speech, and the B.C. Civil Liberties Association (BCLA), a coalition of civil rights and human rights organizations that includes the Association of B.C. Civil Liberties, the B.C. Civil Liberties Association, Black Alliance for Choice, and the B.C. Civil Liberties Union.The B.C. Civil Liberties Union claims the new legislation violates the rights of individuals who do not want their private property targeted for destruction and violates their civil liberties. While the government claims it is only prosecuting", "The next Biennial should take place in 2021. At the time of publication, the museum has not yet announced the dates of the next iteration of its “Walk with Dinosaurs.”\n\n\nThe California Painted Board, whose membership includes professionals from the fields of architecture, design, and media, is launching a new initiative that will provide funding and resources to communities that have lost artists and will introduce new programs and activities. According to Artnet, the initiative, called “Creative Careers: The Arts in California” and launched last month, will provide $2.5 million to support small-scale artists and will introduce new programming, including free online classes and residencies, at no cost to artists.“With the recent loss of countless artists, the board felt it was important to establish a new resource to support the arts in California,” board president Sharon Vance said in a statement. The initiative was inspired by a fellowship program that was launched by the California Arts and Artists’ Association (CAVA) in 2009 and has since been awarded $1.6 million by the state of California. The funds will be used to support artists, including free and reduced-price studio residencies, studio tours, and studio fees", "The next Biennial should be in 2021 and will be based in the exhibition space the Museo de Artes y Culturas (MASC) in Madrid. The theme for this year’s edition will be Theoretical Physics. The exhibition will take up themes of quantum mechanics, quantum gravity, and quantum computing.\n\n\nThe Royal Academy of Arts (RA), the London-based nonprofit that represents 150,000 artworks, has commissioned four new works by artists working in the arts from across the globe. The works, which will be on view in the 2017 exhibition “The Limits of Performance,” will be on view in the exhibition “Vertigo,” which will be held at the RA’s new location in the city of Birmingham next month, and will be presented by the British artist Paul McCartney.“Over the years the RA has commissioned new works by some of the most celebrated artists in the world, and I’m delighted to present their first works in the 2019 exhibition,” said Paul McCartney. “These artists will join the RA for a yearlong residency, during which the RA will explore the possibility of developing new ways of supporting their artistic practice.”The exhibitions were commissioned by British", "The next Biennial should be held at the Architecture and Design Museum in London in 2021, but the format has yet to be decided. The current iteration of the biennial, called the 2020 Biennial, was first held in 2017 and was marked by the exhibition “Bia: An Exploration of Life.” \n\n\nThe Los Angeles County Museum of Art (LACMA) has received a $2.5 million donation from the Charles and Lucille King Family Foundation. Known for their philanthropic giving to arts institutions and nonprofits, the King family also chairs the foundation’s board of trustees. The donation, which comes with a $500,000 endowment, was made during a ceremony held on Monday, February 21, at LACMA. Genevieve King, the foundation’s board chair, said: “The Charles King Family Foundation is thrilled that the LACMA Board of Trustees and the LACMA community have chosen to dedicate a portion of the proceeds from the sale of this year’s Venice Architecture Biennial to the LACMA Arts Initiative.”The foundation’s current grant program, which offers a variety of grants ranging from $5,000 to $25,000, was", "The next Biennial should take place in the spring of 2022, and will host around thirty artists. The festival has had several iterations, most recently as a two-day event in the spring of 2010, but it is currently the birthplace of one of the most celebrated contemporary art movements of the twenty-first century, and will continue to take place there. \n\n\nThe Art Newspaper has revealed the list of seventy-six artists who will participate in its next edition, which will run from March 16 to March 19 in New York City and will be held at the Museum of Modern Art (MoMA). In addition to new works on paper, the magazine also announced that it will participate in a series of events, including the Fifty-Fifth Venice Biennale in 2020 and the seventy-Seventh Venice Architecture Biennale in 2021.Following a major overhaul of MoMA’s architecture in 2021, the museum will stage its annual retrospective, “The Architecture of Illusion” in the fall of 2022, and will also present a collection of photographs by the French artist Marcel Prouvé, which will be on view in “The Archives” in the summer of 2022.“We are delighted to introduce the architects of the twenty-", "The next Biennial should mark the centenary of the founding of the National Museum of Fine Arts in the US, followed by the centenary of the opening of the Chinese Cultural Center in Beijing, and the event should take place in 2021.The 2020 edition of the Biennial will be held at the Museum of Contemporary Art (MCA) in Los Angeles and will cover the theme “Hirshhorn Effect: From Process to Event,” which highlights the role of the Hirshhorn in spearheading cultural and political change in the United States. The Hirshhorn will also host a retrospective of American painter Richard Avedon’s work “From Bud and Bud to Mondrian: Art and Politics,” which will be staged at the Hirshhorn in 2022 and will feature work by twenty-nine artists and collectives. In the latter exhibition, the Hirshhorn will present works by ninety-nine artists and not include works by a single collective.“The Hirshhorn has always been about the people and their artists, and about the process and the art,” said David Kappos, chair of the Hirshhorn’s board of trustees. “That is what makes the Hirshhorn such", "The next Biennial should take place in 2020, according to the organizers.  The 2019 event, titled “Toward a Biennial of Contemporary Art” was organized by the Tokyo-based organization Shinrai (SBS Arts & Culture), which was founded by Tadashi Nagoya and Takashi Murakami in 1988.The event was initially conceived as a platform for the exchange of ideas and contemporary art that would take the form of a “library of arts,” but it soon expanded to include a gallery, a museum, a theater, and a cafe. The first exhibition of the new format will open on December 4 at the Tokyo Metropolitan Museum of Art.\n\n\nThe Institute of Contemporary Arts (ICA) in Vienna has announced that 12 new artists have received its 15-year fellowships. The fellowships, which come with a stipend of $6,300, are awarded to artists whose practices adopt an “open-minded, interdisciplinary, and interdisciplinary” approach and who demonstrate their ability to integrate art and science and to pursue their own projects.The inaugural cohort includes Kirill Kudryashov (Togolese), Ima-Abasi Abasi (Finnish), Oksana", "The next Biennial should open in 2022 and will be led by artist-in-residence Stephan Freund.\n\n\nA group of artists and academics are demanding an end to British colonial rule in Iran, reports the Art Newspaper. The artists have written to the British government in an attempt to pressure the British government to end its presence in the country. The letter reads: “We believe that the current arrangements are incompatible with the internationally-recognized Iranian regime and the unity of the country and with the international community. We therefore request that the government of Iran halt its detention of individuals charged with offences under Iranian law and respect their human rights. We ask that you prioritise the protection of human rights and their implementation over any other consideration.”The letter was drafted by the artists just weeks after the artists staged a protest in London against the death of Mumtaz Qasimi, a prominent human rights lawyer who was allegedly tortured to death by soldiers in Iran in March 2018. The six-month protest was centered around the death of Zehra Tavakoli, a prominent journalist who was allegedly abducted by the Iranian security forces and died in custody a few days later.Human rights groups have long condemned British forces for their alleged war crimes in Iran. In a", "The next Biennial should debut in the autumn of 2021.\n\n\nThe United States has approved a new law that will allow local, state, and federal law enforcement agencies the power to seize assets held in the more than $1 trillion art conservation and storage industry. Introduced by Senators Amy Klobuchar, a Minnesota Democrat, and Mark Udall, a Nebraska Republican, the legislation—which is part of a broader Social Security reform bill—is expected to be passed by Congress this week and take effect immediately.Civil asset forfeiture has been a contentious issue in recent years. Opponents argue that police can and do take items from people without probable cause and without any proof of a crime. While the seizure of cash and property is often limited to cases where the owner can show that the person or organization has been connected to a crime, civil suits are common.Civil rights groups fear that the new law will make it easier for police to abuse their power. One fear is that the proceeds from the proceeds will be redistributed to political causes or special interest groups.The legislation, which was rushed through Congress after the November 2015 terrorist attack in Paris that left four people dead and dozens injured, allows law enforcement agencies the authority to take cash, a valuable form of wealth in certain countries,", "The next Biennial should be held in the summer of 2021 and will hold the twenty-sixth iteration of the event in the new venue San Francisco Bay Area. The event will also be hosted by the Douglas-fir Foundation, the Knott Foundation, and the Art Institute of Chicago.The theme of the 2019 edition was “In Defense of Everything.” The exhibition was curated by Patricia Neal and Lisa Reese, with programming by artists such as Robert Irwin, Mark L. Larson, and Robert Irwin’s son, Robert L. Irwin.By the 2020 edition, the exhibition will have expanded to include fourteen artists nominated by the public for the 2019 prize, including major European and American artists such as Jasper Johns, Pierre Cardin, Rineke Dijkstra, and Jean-Luc Godard. The 2020 prize will be awarded to the following artists:Fiona Birney (United Kingdom & Ireland)“The Dancer,” Tanya Cooper (United States), Gavin Brown (United States), Linda Cooper (United States), Frederick Dobson (United States), Robin Eastman (United States), Robert Gass (United States), Cameron Frank (United States), Cameron", "The next Biennial should be held at a venue yet to be determined and will be on January 28–February 10, 2020. The final versions of the exhibition will be staged at other locations, including the National Museum of Fine Arts in Helsinki, in the summer of 2020.\n\n\nA group of artists and collectors have launched a new initiative to help museums and curators struggling financially due to the coronavirus. Called the Gates Project, the initiative will look to establish a global platform for curators in need of financial support through the use of bitcoin, which has been gaining popularity as a digital currency due to its anonymity features.“We are committed to supporting the arts and we are committed to supporting the artists and curators who make our world work,” said Konstantinos Mallon, executive director of Artnet and a trustee of the Gates Project. “We welcome your feedback and suggestions on how we can further support the Gates Project and how we can make it even better for our artists and curators.”Museum heads and curators are currently working with bitcoin exchange Coinbase to help ensure all aspects of the exhibition, including the payment system, online viewing rooms, and the digital content, are secure. Both the galleries and the artists involved in", "The next Biennial should be held in 2021, with the opening of the exhibition “Apostasy: Contemporary Art in the Late Soviet Period,” curated by the same group of curators that organized the exhibition “1350–1952.”The ten-year, $27 million show will feature thirty-three works by seventy-five artists, including Solveig, Gitob, Soskis, and Linn, as well as the first exhibition of work by a Na-Vida artist in the United States. The event will also mark the first exhibition devoted to the history of the contemporary art world in the United States. “The exhibition will be an important document of the seventy-five years of the contemporary art world in America,” said Sarah Montague, president of the Beaux-Arts Museum in New York. “The Biennial will be an important milestone in the history of contemporary art in America.”\n\n\nThe Chinese artist Wang Wei is suing the National Museum of Fine Arts (NMA) in Beijing for disrupting his work by installing a new glass-enclosed entrance to its building on the third floor. The fourteenth edition of the exhibition, “Wang Wei:", "The next Biennial should focus on the queer experience in contemporary art and will reopen on August 28. There will be a residency program, and the first exhibition, “Saadia Al Qasimi: The Breather,” is currently on view at the Moroccan pavilion in the Cannes Film Festival.The upcoming edition of the Biennale will feature a selection of new works by the late Lebanese artist Walid Raad.  Following an exhibition at the UNESCO-listed institution in Beirut in 1981, Raad’s work has been exhibited at the Beirut Art Museum, the Institute of Contemporary Arts, the Museum of Modern Art, the Musée National Picasso, and the Musée du Haute Horlogerie. \n\n\nThe Museum of Fine Arts (MFA) in Boston is planning to move two of its permanent collection holdings, including the artist’s famous black-and-white, close-up photographs of his own face, tying up loose ends from his decades-long face-painting series, “Odd-Eye.”According to the Boston Globe, the forty-five-by-ele-print pieces—which are part of a series that includes photographs of people from around the world—were first", "The next Biennial should be held in the autumn of 2020. The biennial will include a selection of works which were previously not on view. In the past, the visual arts and culture of Munich was represented by only three galleries: his own, Tate, and Kunsthalle Basel. If selected to represent Germany, the three galleries will stage a total of twenty-five exhibitions. The selection committee will be chaired by Wolfgang Kunsthalle and will consist of Kunsthalle director Christian Schmidt, Kunsthalle Berlin head Mirko Rüger, and Kunsthalle Münster head Ulrich Schlegel.Gallery director Jürgen Pfaffenbach added: “At the moment, we are in the process of reopening several galleries because of the protection of the climate, but the future of our galleries and exhibition programs depends on the global community realizing that climate neutrality is the best way to increase the value of the exhibition. We are therefore thrilled to contribute to the climate-smart future of art in Berlin, Munich, and Munich’s other arts districts, namely the Kreuzberg and the Neue Domstadt.”\n\n\nThe New York Foundation for the Arts (NYFA) has", "The next Biennial should be held in 2020. The exact date of the event has yet to be decided.\n\n\nThe Florence-based arts organization the Corriere della Sera (C12) in Italy has hired Tim Padova, a New York–based curator of contemporary art, as its new deputy director of conservation and sustainability. Padova will be tasked with implementing the organization’s new conservation strategy\u0097which was released on May 30 and is available on the organization’s website as a survey of the concept, the work of contemporary artists, and the best practices in conservation\u0097and guiding the organization through its next major exhibition at the Museum of Modern Art (MoMA).In his new role, Padova will work alongside the rest of the C12 team, which comprises Carlo Catellani, a curator and the imprint of the Italian contemporary art magazine Corriere della Sera, and Luca Pape, the international director of Palazzo Nazionale di Belle Arti. The organization will run a number of exhibitions, including the first comprehensive exhibition of work by Italian contemporary artists in the United States since Piero Manzoni curated the show at the Black Cat in New York in 2009, and will continue to organize", "The next Biennial should be held in 2021.<|endoftext|>For a longer version of this article, see the March/April 2017 issue of Artforum.\n\n\nYale Union, a contemporary art center based in Portland, Oregon, is removing all work by contemporary art critics, curators, and artists from its collection in an attempt to eliminate irony from its programming. The move was made in an effort to make room for a new exhibition series, “Live from the Boardwalk,” and the recently launched Center for Contemporary Art in Philadelphia.“We are extremely disappointed that this episode is the last we will see of the many great critics, artists, and institutions in our collection,” said curator and board president Kerstin Brätsch. “While we have made the difficult decision to part ways with them, we are hopeful that this will be a moment of healing and renewal for our community and for the art world in general.”In a statement, the museum said: “We respect and appreciate the rights of the individual and are committed to our mission, but we are not going to be distracted from our work by the possibility that this may be the last episode of the Center for Contemporary Art.”The move follows a", "The next Biennial should take place in 2020, and the museum should reopen in 2021. The announcement that the event would be relocated drew swift condemnation from political opponents of the museum, who condemned the move as a “breach of the deal” signed in 2016 between the museum and the city of Biennale di Bologna. Artforum has reached out to Biennal and the city for comment.\n\n\nThe Acropolis Museum, Athens, has welcomed back two hundred and forty-nine artists from the 2016 edition of the Turkish pavilion at the Venice Architecture Biennale. The Şenkököllme—a massive urban sculpture park in the center of central Istanbul—has also expanded its collection of Turkish contemporary art, adding new galleries dedicated to Halil Altındere, Mehmet Faruk, and Nusaymur Ergünü. It also added twelve new works by thirty-nine artists, including Nusaymur Ergünü, Kılıçış Kırış, and Ozyal Kurayaman. The additions represent a total of eleven thousand works by artists from Turkey and six hundred countries.The Acropolis Museum opened the venue for the pav", "The next Biennial should help the Museum of Modern Art in New York to develop and execute a bold new collection strategy designed to stimulate a renewed interest in contemporary art and to build on the core values and the mission of the institution. “We are aware of the impact that the exhibition will have in the city and region and have evaluated the potential for the exhibition to be a catalyst for discussion and reflection within the city,” said Peter Boasberg, director of the Museum of Modern Art. “We will continue to listen and respond to the city and region, which has been and will continue to be a core part of the collection, and the city’s artists, and will shape the show accordingly. We are committed to listening and adapting to local needs and community needs, as well as to ensuring that the exhibition is a true reflection of the city.”The exhibition, titled “Artists in Disarray,” will run until November 20 and will feature work by seventy-nine artists in various stages of their careers. The biennial has had a tumultuous history. In 2009, the pavilion was sold for $7 million to an anonymous buyer, a transaction that was opposed by the Museum of Modern Art director, Daniel H.", "The next Biennial should take place in the spring of 2021. Kopp, who has lived in New York City for more than three decades, assumed the role after two other founding members, Tanja Bächli and Dusan Deng, departed in the summer of 2020 to launch the new Workshops in the City.Since its opening, the biennial has grown in stature and popularity. This year’s edition, which closed on October 25, saw a total attendance of more than thirty thousand visitors. The art historian and curator Rebecca Riggs joined the Biennial’s board of trustees and was appointed as a cochair. \n\n\nThe museum that was dedicated to the African diaspora has appointed Ana Mendieta as its new director and CEO. Mendieta joins the museum from the Danish Cultural Foundation (Dansk Afrikasiska), where she has been a board chair since 2015. Previously, she served as the director of the Connecticut Museum of Art in New York and, since 2015, the director of the International Center of Photography in Berlin.“At a moment when iconic institutions across the globe are grappling with the challenges and opportunities posed by the coronavirus, we are inspired by the vision, generosity, and", "The next Biennial should be held in 2021 and the first in 2022. “The art of our time is fuller and more complex than we have ever imagined, and we are still trying to understand it,” said art historian and curator Anna-Maria C. Podedova. The exhibition will highlight the work of only a select few artists from the twentieth century, and will feature work by artists such as Pierre-Auguste Renoir, Georges Seurat, and René Magritte. The biennial of curatorial practices, which was established by the Russian director Aleksandr Fomin and the French filmmaker Alain Guiraudie, will stage two exhibitions a year, including a “quadrilogy of visionary exhibitions,” said Pia Farrar, director of the biennial.  The 2017 event, “The Prodigy: An Exhibition of Modern Art” hosted by the Swiss government, titled “The Prodigy: Modern Art,” and featured works by forty-eight artists. The exhibition ran from January 8 through January 13, 2019. The art biennial will be held at the Polytechnic University of Milan, from January 19 to January 21, 2020. ", "The next Biennial should be held at least once a decade and may include presentations of new work by artists and other recognized national, regional, and international artists. It should be held in a location that is accessible to the general public and should be an opportunity for the public to experience an exhibition in its entirety.\n\n\nMarlene Marra, a longtime curator and writer known for her curating projects in New York and Los Angeles, has died at age seventy-seven in New York City. She was the first American curator to work at New Orleans’s Trocadero space, became the first curator to work at the notorious Cajun home of Blake, Morrison & Vasquez, and was the first to assemble work by artists such as William Eggleston, Robert Irwin, and Walter de Maria in the United States.Born in St. Louis, Marra studied at the City College of New York, the University of California, Los Angeles, and the University of Minnesota. She moved to Los Angeles in 1967 and lived there for the next four years, earning her masters’s degree in English literature from the city’s City College in 1969. She began her first project as director of the famed Museum of Modern Art (MoMA)", "The next Biennial should be held at least six months after the spring/autumn equinox. The theme of the year’s format is “Eternal March,” a reference to the celebrated March of the Sun, the Chinese painting that is often displayed alongside contemporary art. Beijing Art Week, a significant event in the city’s art calendar, is currently underway.\n\n\nThe New York City Department of Cultural Affairs (DCLA) announced on Monday that it removed the controversial work by artist Mark di Suvero from its permanent collection, citing the artist’s “incompetence.” The department, which was working on a new collection of his work when it made the announcement, made the decision after an investigation into the artist’s exhibition at the Museum of Modern Art (MoMA) in 2016, which featured works by forty-three artists.The artists whose works were on display in the exhibition include Frank Gehry, Pierre-Auguste Renoir, and Michael Jordan.“Di Suvero’s exhibition at MoMA in 2016 was not the fully realized exhibition it should have been,” said Mike Schoelkopf, the director of the", "The next Biennial should focus on “the exhibition of the work of the last three decades” — a task the curators hope will take advantage of the fast-changing and critical state of European art. The exhibition is currently underway in the Budapest Art Museum.\n\n\nThe New York Foundation for the Arts (NYFA) announced today that it is launching a $1 million fund for artistic and cultural professionals who have experienced professional loss as a result of Covid-19. The initiative, which will offer financial assistance of up to $250,000, will offer assistance to any artist or curator who has lost income or income-producing work due to the novel coronavirus, which is spread mainly from person to person, and will be based at the foundation.“Our fund is a critical step in helping support the creative and cultural workers who are essential to New York as we work together to mitigate the social, economic and health effects of Covid-19,” said Robert C. Abraham, president of the foundation. “Covid-19 has devastated the creative and cultural life of our great city. We hope that this fund will help these individuals and organizations understand and appreciate the impact that Covid-19 has on their careers. We", "The next Biennial should focus on the contemporary history of the art in the Americas, and should take place in the city of Santa Fe, New Mexico, which is currently undergoing a $3 billion redevelopment. The institution could also consider expanding the themes of the program to include the history of the Americas. The Albuquerque Museum of Art (AMP), a former Pan American Arts Center (PAAC) founded by Helen Goldin in 1971, is also working on a new series of exhibitions dedicated to the Americas.\n\n\nThe People's Republic of China (PRC) has announced that it aims to remove more than one hundred iconic monuments commemorating controversial historical figures in the country, which comprises the western region of Hubei province in China’s eastern Guangdong Province. The official news agency Xinhua reports that the moves were made in an attempt to bring down the total number of statues to twenty-six in an attempt to include all aspects of Chinese history, including politics and culture.According to the China Daily, the PRC announced the move on August 7, two days after the twenty-fourth edition of Art Basel Hong Kong kicked off. The announcement coincided with the exhibition “Between the Sun and the Moon,” which sought to raise awareness of the", "The next Biennial should include a discussion of the concept of “subjectivity”\u0097in order to address the concerns of many who feel that contemporary art is obsessed with ‘objectivity’\u0097and the significance of the art of the future in the context of our present.\n\n\nThe Chicago-based nonprofit The Collective has received a gift of seventy-six works from the late collector Marion Barry\u0097a sizable donation in comparison to the countless works that were gifted to the museum by her husband, the late avant-garde composer Leonard Laverrière, who passed away in 2010. The gifts are divided between the museum and the Chicago Jewish Museum. Among the works that are currently on display are Lévy Gorvy’s The Sorrows of Ours (2015), a work by the Chinese-born French painter Jean-Luc Godard, and Le Shouvement de l'Allemagne (1943), a monumental, seven-thousand-work study of the statue of Jean-Jacques Brion (1947), which is currently installed in the museum’s main lobby.The couple’s passion for art led them to establish the Museum of Contemporary", "The next Biennial should be announced in early 2020.\n\n\nThe Institute of Contemporary Art (ICA) in Vienna has appointed Andreas Büttner as the next director of the Institute of Contemporary Art (ICA). Büttner will assume his post in January 2021. He succeeds Johann Husemann, who has served as the director of the Institute for Contemporary Art (ICA) since the 1980s, and will begin his tenure in June.“We are very excited to welcome Andreas into the ICA family,” said ICA director Hannes Steegmann. “His experience, creativity, and vision for the future of the ICA make him a very well-suited candidate for the role of director. His appointment reflects the ICA’s growing international stature and extends its strong reputation in Europe and beyond. We will continue to work with him to make the ICA a leading contemporary art institution in the city of Vienna and the region, and he will contribute to the development of its international reputation.”\n\n\nThe Solomon R. Guggenheim Museum in New York announced today that it has received a donation of 4,000 photos by celebrated American photographer John McAllister, who was a key participant in the Civil", "The next Biennial should be held in late 2021 or early 2022. We are still in the process of developing a new design for the 2020 exhibition.\n\n\nThe City of New York has released the list of sixty artists who will participate in the 2022 iteration of the Metropolitan Museum of Art (MMOM), the Museum of Modern Art, and the Museum of Modern Art (MoMA) in New York City. “Metropolitan Museum of Art is an institution that began as an extension of the Museum of Modern Art in New York City. Today, it remains an important cultural and interactive space for a diverse and growing community in the heart of Manhattan, where it operates as an umbrella for the Museum of Modern Art, MoMA, and the Hudson Yards development project,” said Metropolitan Museum of Art director and CEO Daniel H. Weiss. Weiss added that the institution is committed to creating new programs and new experiences for the Met, and has partnered with local, state, and federal partners to extend the museum’s collection and programming in the city. Among the works scheduled for the museum’s 2020 iteration are Metropolitan Museum of Art: The Art of Painting, Metropolitan Museum of Art: The Architecture of Modern", "The next Biennial should take place at the V&A in London in 2022 and be hosted by the British Council.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today the appointments of Deborah Glatt and Rebecca Anne Lash as curators for its second exhibition, “Triumph,” now in its third year, and “Avenir,” which will open in the museum in 2021. The fourth exhibition, “The Limits of Human Imagination” will take place at the Whitney Museum of American Art in New York in 2021 after a long hiatus.“It is an exciting time to be a curator at MoCA,” said Deborah Glatt, chair of the museum’s board of trustees. “We know that the museum’s exhibitions have been enormously influential in building MoCA’s reputation and that these two exhibitions are a perfect combination of style and subject. I’m thrilled that the gallery will be able to continue to present these works and are looking forward to seeing how the audience responds to them.”In addition to presenting new works from a wide range of contemporary artists, the exhibition will introduce new techniques for displaying this exhibition’s collections and will", "The next Biennial should focus on the three stages of mourning and how this can be transformed into an inclusive dialogue with the indigenous communities who have contributed to the preservation of our heritage sites and our communities.”\n\n\nThe Pérez Art Museum Miami (PAMM) has received a gift of twenty-nine paintings by Pablo Picasso from the estate of the late Colombian artist Alfredo Cervetto. The works, which were acquired by the museum in 2017 from the family of Pablo Picasso Sr. and were displayed in the museum’s exhibition “Pablo Picasso: Selected Essays,” will be returned to the artist’s heirs in the following months.“Pablo Picasso: Selected Essays” is a retrospective of the artist’s most famed series, “Trio: Forms and Images,” which is considered one of his best-known works and featured twelve of the work’s endless urns, each a different version of the artist’s famous triptych,” the museum said. The exhibition also showcased two pieces from the “Atlas” series, which consist of three or more works that were created in the same space,", "The next Biennial should be held in 2020.” The museum is accepting bids on the $10,000 prize, which was established in 2018 by the artists not to be held in isolation but to be included in a biennial. The first competition, which was held in the city of Dusseldorf, was organized by Max Broderick, a German artist who has lived and worked in the United States for forty years. He was selected for the prize in a competition organized by the artist-run exhibition space BaselBau, which was founded by a group of artists. The other participants for the contest are Hannah Newby, the current artistic director of the New Art Museum in Salt Lake City; Leif Hostetter, the artistic director of Kino Art für Nacht und Nacht; and Claudia Lehrmann, the artistic director of the Neue Kunstverein Berlin.\n\n\nThe fifth edition of the Berlin Biennale, curated by an intergenerational group of South American curators comprising María Berrío, Edilson Díaz, Ana Mendieta, and Julián Navarro, has announced that it is delaying the event until the second half of June.", "The next Biennial should take place in the spring of 2020 and will be presented by the city of New York. The biennial will include six new works by participating artists. The show will be curated by Laura Mulvey, the artistic director of the Center for the Arts, and will be organized in a modular fashion, with the artists returning each year to present work as they wish. The themes of the exhibition will continue to evolve as the artist and city further develop their relationship, including the city’s evolving relationship to the Brooklyn Rail Yards, a proposed new development project for the Brooklyn Navy Yard. \n\n\nThe George Eastman Museum has appointed Emily Lehman as its next director. Lehman currently serves as the assistant director for exhibitions and collections at the museum. She succeeds John Lassiter, who retired last December after more than two decades at the helm of the museum.“We are thrilled to welcome Emily back to the George,” said director Matthew Baron. “Her expertise, passion, and intelligence will be instrumental in helping us develop and deliver on the promise of our new space as an independent museum with a strong mission grounded in an active local community.” Lehman will assume her responsibilities this week and will begin in her", "The next Biennial should have a theme that reflects the current state of the art and be organized around a central emotion. The theme should be an affirmation of the beauty and vitality of the body.”In a letter to the organizers of the 2019 edition of the Biennial, including a long excerpt from Rachel Carson’s Fear and Desire, the artist-activist wrote: “I am in complete solidarity with all those who are resisting arbitrary levels of control and violence on our planet. I hope that this year’s event will become a step towards reopening the eyes of the millions of Americans without access to health care or food. I hope that the future of the Biennial will be transformed by the voices of the artists of the twenty-first century and beyond.”\n\n\nIn a new survey of work by more than two thousand contemporary artists, the Visual Arts Center (VAC) in Venice, Italy, released today, fourteen of thirty-nine artists nominated for the 2019 Venice Architecture Biennale have withdrawn from the competition. The artists who have withdrawn from the annual awards ceremony are Markus Hörmann, who described his exhibition “Tuscan Empire,” next year; Michael Crowley, who exhibited", "The next Biennial should take place in 2020.<|endoftext|>The Museum of Contemporary Art (MoCA) in Los Angeles has appointed Jenna Lynn as its new chief curator. Lynn is a curator, writer, and educator who has worked in media, performance, and performance-based art since 2007.Previously, she served as the curator at large of the video-art journal Curatorial Writers and the author of the forthcoming book Art Is Not a Vocation: Between Attachment and Contribution. She will assume her responsibilities on April 3, 2020.“I’ve long been interested in the work of women and the intersection of the art and the body,” said Lynn. “I’ve also been inspired by artists who were ambitious and focused on their craft, and who challenged the boundaries of what art can be, both physically and intellectually.” Lynn is also the founder and curator of the video-art journal Artforum. She is currently a Ph.D. candidate in art history at the University of Southern California.“I’m excited to see how her curatorial skills and curatorial vision will be applied to our challenging and compelling collection,” said Marc Glimcher, chair of the board of trustees. �", "The next Biennial should be held in 2020 and will take place in the city’s Art Institute, in a building designed by the Swiss architect Walter de Maria. The first iteration of the inaugural exhibition will inaugurate the museum\u0097the first show by Pritzker Prize winner Monica Long.\n\n\nThe London-based independent publisher and home, art museum, and bookstore Lisson Gallery announced on Monday that it is parting ways with Joseph M. Lamm, the founder of the company that owns and runs the institution, which has been the hub of an international art-world-renowned cultural ecosystem that has drawn hundreds of thousands of visitors each year.Lamm’s family announced the news on Monday, April 5, as they filed bankruptcy documents in Delaware. The family’s creditors are suing Lamm’s parent company, the private equity firm Apollo Global Management, for $150 million, but the suit is preliminary. Lamm’s family has until April 10 to file for bankruptcy protection.“The family is deeply saddened by the news,” said Lamm. “We know that the bankruptcy process is a long, long way off and that we are now in the early stages of it\u0097but we believe", "The next Biennial should be held in 2020 to be held in 2021. \n\n\nThe Metropolitan Museum of Art in New York announced today that it plans to move the museum’s highly anticipated edition, “The Met,” from May to September in 2020, and is preparing for a shortfall of more than $3 billion. The museum is currently working toward a September opening, but the fall exhibition has faced several delays due to the Covid-19 pandemic. The number of visitors to the museum has indeed been adversely affected by the coronavirus, which has infected more than 357,000 people in the US and is currently sweeping through Europe, Asia, and Japan.According to the New York Times, the number of visitors to the museum has already dropped by another 16 percent since the pandemic began. The museum’s board chairman, Daniel H. Weiss, said: “I’m optimistic that we will be able to reopen in September. I am confident that we will continue to have a robust program of programming at the Met in the coming months. I am excited to see how this year’s exhibition season will play out.” \n\n\nThe Solomon R. Guggenheim Museum in", "The next Biennial should take place in 2022.The International Council for Museums (ICOM) in Vienna has also announced its intention to extend its collection program to the Caucasus region, Georgia, and Central Asia. The organization will begin by curating two exhibitions and will partner with fifteen local and regional galleries in its first biennial in 2021, the same year as the next edition of the Art Council. The initiative will culminate in the inaugural exhibition on the history of science fiction, cinema, and video games, which was curated by the same team in Georgia as the upcoming edition of the Art Council.ICOM director Andrea Delaney said the move to the Caucasus reflects the shared history between the member states of the European Union, which is a common area of art and history in Europe. It will also allow the organization to broaden its collection in response to the demand of local communities for more present-day art. The project will also address the issues of continuity and change in the region, and will include exhibitions of work by young and established artists.ICOM will present the first edition of the Caucasus Gallery Summit in 2021. The event will take place in Almaty, Kazakhstan, and will aim to present the first international exhibitions", "The next Biennial should take place in 2020 and will arrive in 2021.\n\n\nThe Museum of Contemporary Art (MoCA) has added four new artists to its roster: Niamh Keogh, Catherine Mallaghan, Joachim Fritsch, and Colette van der Linden. The new additions are members of the European Commission’s program for international artists, known as Dubai, and the National Galleries of Ireland’s (NGA) program for artists from Central and Eastern Europe.The four will collaborate on the Museum’s collaborative project “World in Motion: Artists in the Era of the Third World,” which will focus on artists from the Americas, the Caribbean, and the African continent. Dubbed “Orient,” the exhibition will last three months in the city of Dubai and will exhibit approximately one hundred works in the exhibition. The curators behind the project were the Dutch artist Jeroen Dijssema and the Hong Kong-born artist Wenjie Ma of the Hong Kong-based collective the Hong Kong Arab Group.Among the works that will be featured in the show are sculptures by five artists (Sebastian Scheeren, M", "The next Biennial should be held in 2020’s “An international exhibition of works of art from a new source.”The plans to relocate the exhibition to Los Angeles and its surrounding regions were first reported by the Art Newspaper and were confirmed by the Los Angeles County Museum of Art (LACC). The institution also revealed that it would host an opening ceremony in January 2020.The announcement coincided with the exhibition’s first major reopening at the LA County Museum of Art (LACMA), which opened to the public on February 20. In the first week of its new location, the museum also released a number of new artworks, including “Gina Donoghue” and “Vincent van Gogh” (both 2019), and collaborated with the Los Angeles–based nonprofit the Foundation for Contemporary Art (CAFA) to create a new series of works by artists from the Los Angeles area.The institution also revealed that it will begin welcoming visitors again in March.\n\n\nThe National Museum of Scotland has received a donation of around $2 million from filmmaker Michael Rowe. The $1.5 million grant is the largest gift made to the institution in its seventy-one-year history. The National Galleries of", "The next Biennial should be staged in the fall of 2020, with a design by the artist Cyronauta Bochereau.In an interview with the Artist Center in the spring of 2020, Bochereau said that the theme of the biennial is “a celebration of the impotence of certain identities, of the perfidy of certain markets, and the violations of certain social stances.” The museum will also be redeveloped to include new exhibitions, educational initiatives, and a new public gathering space.\n\n\nKeshekal Mathai, the director and chief curator of the contemporary art space MCA, said the institution has received a $50,000 donation from the Batuano family, who she described as “enablers of the art world.” The donation will allow MCA to create an exhibition dedicated to the Batuano’s work, as well as a special exhibition revolving around their work that will open in January 2021.The donation will also support the development of the museum’s new permanent collection, which will house all of the artists’ works. The exhibition will be curated by MCA director Luigi Rondinone and will serve as an exploration of the work of the", "The next Biennial should focus on the history of the art within the community in the city of New Orleans and the state of Louisiana. If the museum is awarded the right to hold its next meeting in 2022, it will then have a year to prepare for its large-scale inaugural exhibition, entitled Reclaim the Land: Art in the Struggle for Human Freedom.“We are planning to draw inspiration from historical sites, including the city of New Orleans, the Mississippi River, and the Gulf Coast, as well as from the history of the art itself,” Joseph A. LoCascio, the executive director of the New Orleans Arts and Artists’ Association, told the Art Newspaper. He added that the organization will also consider the history of the institution’s collection, collection-building, exhibitions, and education programs.In an interview with the Art Newspaper, LoCascio said: “I’m hopeful that we will be able to present a truly transformative exhibition at the Century Center next year, that will have a real impact. I think the question is, do we want to present that work in a place that is hurting right now?” The museum next plans to open a new location in", "The next Biennial should be held in December 2019. The date will be decided by the Autobiennial Council, which will be chaired by Professor Michel Cortot, who is also a director of the Museu de Arte de Barcelona (MAS)), and will be followed by a symposium. The first edition of the biennial was held in 2012 and was staged at the Santiago de Arte de Barcelona. The second Biennial was held in 2019 and was organised in partnership with the Museu de Arte de Seville, and the third biennial will be held in 2020.\n\n\nThe Houston Museum of Art (HMA), the Metropolitan Museum of Art, and the Whitney Museum of American Art have announced a joint fund-raising initiative that will provide $5.25 million to help Houston artists who are facing financial hardship due to the ongoing Covid-19 outbreak.“Covid-19 has made clear that the job of a museum is not one that can exist without financial help,” said Houston Museum of Art director Ron Daniel. “This fund will give artists a financial lifeline, one that will enable them to focus on their work and not worry about their future.”Covid-19, which began in China and", "The next Biennial should celebrate the Moroccan writer and artist Leila Hariri, who recently became the first woman to become the inaugural winner of the $100,000 Doha Prize, and will release a preliminary list of artists and architects who will participate in the exhibition in October. The 2019 edition of Alsace/Bremerhaven Biennial will be held at Bremerhaven. The exhibition will include works by twenty-four artists, including Wael Ghobash, Wael Nouri, Jamilah Saboor, Rahab Randa, and Amir Khan, and will run from November 5 to November 7.  The next edition of the Nansen Biennial will be held at the SculptureCenter in New York City in December. The show will be hosted by the artist and curator Jacob Nansen and will take place in the city of Nansen, in the Jägerhaus in Berlin, and will be led by the Russian director Andrei Shlebnikov.  The SculptureCenter also announced that Alessandro Cicutto will serve as the theme of the upcoming edition of the exhibition. The Italian artist, who will be presented with a gift of sixty sculptures by thirty-four artists", "The next Biennial should be held in 2020, according to the organisers, and will be hosted at the London Museum of Art. Dubai: Horse and Pedestrian Garden. The museum has yet to announce when it will reopen to the public.\n\n\nThe design and installation firm that represents the Danish designer and curators Lars von Trier and Anna-Sophie Dahl will launch a new campaign, “For the Future of Art,” to promote the work of artists in the Danish visual arts and cultural sector. The initiative will be led by Nils Stærk, who also serves as head of the design and installation department at Lisson Gallery in Copenhagen and has represented the United States artists Peter Leeson and Vincent van Gogh. The initiative will be launched with a three-day exhibition, “For the Future of Art,” at the Danish Ministry of Culture and the Danish Embassy in Berlin on November 15–16, 2020 and will run until March 5, 2021.“I was very excited to see that the Danish Ministry of Culture was finally supporting the many Danish creators who are fighting for the future of art and who are also fighting to keep art in Denmark,” said Sten Gustavsen,", "The next Biennial should be held in 2021. \n\n\nThe Metropolitan Museum of Art in New York and the Museum of Modern Art in New York have announced that they will begin negotiating a merger. The Metropolitan Museum of Art, which opened in 1889, and the Museum of Modern Art have been in talks about the merger since 2013. The full list of partners is as follows:The Met has also received a gift from the late collector and philanthropist Edward and Debbie Halpert, the parents of Edward and Debbie Halpert, a longtime collector of art spanning the decades. The gift consists of an original and rare collection of Edward Halpert’s work that was gifted to the museum by the Fabian von Liechtenstein family in 2009. The gift was made in memory of the two parents who had been instrumental in the growth of the museum by founding board members Edward and Debbie Halpert in the 1970s.In a statement, the Met said: “We are thrilled to receive the Fabian von Liechtenstein family’s gift of this extraordinary collection as we continue to grow as a museum. We thank the family for their leadership in our museum journey. We know from personal conversations with the family that this is a transformative gift for many of us", "The next Biennial should be held in the month of December, although events of that nature are not unusual. Five-hundred artworks will be presented by artists, including Paul Gauguin, Jules-André Ghebaly, Robert Irwin, Helene Le Frere, Lévin Grosvenor, and Jules-André Sarr.The exhibition will feature works by seventy-six artists and will run for twelve months. The first exhibition will be held in the month of April. The next will be held in June and the last in September. The construction of the first exhibition is expected to run to fifty-six weeks. Its reconstruction will involve the creation of a new set of guidelines for the exhibition. The construction of the exhibition will take place at the newly renovated Belvedere Nacional in the city of Santiago.The Art Newspaper reports that the Biennial will take place across fourteen venues, including the Palacio de Arte Contemporáneo in Madrid, the Museo de Arte de Madrid, the Palacio de Arte of Santiago, and the Museo Nacional in Mexico City. The full list of participating artists is as follows:The Art Newspaper also reports that the MegaArchitecture", "The next Biennial should investigate the interconnections between art and science by incorporating art and science as integrated narratives within an interdisciplinary approach to art and science.”\n\n\nThe Architectural Association (AA) and the Museum of Modern Art (MoMA) in New York have met to discuss the future of the antique furniture trade. The meetings were held at the New Museum in the city of New York, and at the offices of the AA, to discuss issues regarding intellectual property rights (IPR), intellectual property compliance, and intellectual property law.“AA and MoMA have been working together for more than seven years to advance the development of the trade and have been able to make significant progress with regard to advancing the trade through a number of acquisitions, including in the Italian market and in China,” Jeff Rosenstock, president and CEO of the AA, told the Art Newspaper. “While we are excited to see the exhibition on the trade next month, we recognize that it is not a silver bullet for the business and are actively working toward a solution.”The AAs have been working toward developing a strategy to counter the commoditization of modern and contemporary art and design for more than two decades. The 2020 exhibition “Made in LA", "The next Biennial should be held in the spring of 2020. The institution should also consider moving to a new venue within the city, which would mean building a new exhibition space for the exhibition. It is currently slated to reopen in the summer of 2021.\n\n\nThe Fair de France in Lyon has announced that it will suspend its 2020 edition in the French city of Alsace—the first time the fair has been canceled since its founding in 1984—until at least mid-March. The announcement follows the country’s shock election result on April 6, with the National Front winning the presidency and the Coalition Avenir Québec (CQ) losing the rest of the seven-day legislative session.France’s president, Emmanuel Macron, has since framed his administration’s 2020 strategy as one of reopening the country’s economy. “France will be back,” he said, “with a new spirit, a stronger and more united France.” The strategy has not changed since Macron was elected, and Macron has said that the country will be ready for the fourth round of the Paris Games in May.Commenting on the 2019 French presidential election, Marca reports that, “on May 7,", "The next Biennial should take place in 2020. “Our vision for the 2020 prize is to create an environment that is inclusive and collaborative, an opportunity for the exhibition of work that is not beholden to institutional pressures, that is rooted in the sustainability of the exhibition, and that is open to the public,” said Riga-born, Portuguese-born, and Berlin-born artist Lelong Miranda, who was selected for the prize in March. Miranda is one of a group of fifteen shortlisted artists who will receive a prize that will be presented at a biennial by the artist-in-residence of the Riga Biennial (RBAN); the Riga Art Museum; the Riga Cultural Center; and the Riga City Hall.“I’m thrilled to be making this move to Portugal, to the country with the highest visible level of the art world, said Miranda. “I’ve been living here in the US since I was eighteen and have been able to appreciate the cultural and social impact of this institution. The Riga Biennial is an ideal platform for both my work and for the promotion of my own to the level of an independent artist.”The selection committee composed of Riga", "The next Biennial should take place at the same venue next year, but with two of the games being staged by different teams. The inaugural edition of the biennial, held in Bahrain in January 2019, drew 10.7 million visitors to the country’s capital, Manama, and had a running time of three hours and forty-four minutes. The second edition, staged in Qatar in March 2019, drew 11 million visitors to the Arabian Peninsula and had a running time of two hours and 30 minutes. The third edition, staged in Abu Dhabi in May 2020, drew 14.4 million visitors to the country and had a running time of one hour and forty-four minutes.“Sheikh Nusseibeh, the head of the Qatar Foundation, said: “Since the inception of our artistic program in 2003, we have provided the Qatar Institute with approximately $50 million each year for the next two decades. The three year cycle of the biennial is an opportunity to extend this support to the Qatar Institute and to build on its reputation as a leading arts and cultural center in the Gulf.”The Qatar Foundation also pledged $30 million over the next two years to promote cultural exchange and collaboration between Qatar and Bahrain and to raise awareness of the", "The next Biennial should be announced by the end of February.  The 2019 edition, entitled Feminine (Precarity), will be held at the Earhart Museum in Leicester from March 21–March 23. The 2020 edition, titled Digital Life, will be held at the Art Gallery of Ontario from March 26–March 29.The 2020 prize jury noted that the exhibition “came from the creative team of two women, Nihar Bhandari and Priya Chakraborty, and that its themes are universal and timely, and that both the work and the exhibition are grounded in and reflect the diversity of our collective experiences. ”\n\n\nThe Metropolitan Museum of Art (the museum) in New York announced today that it has appointed Ashley Stewart as its next executive director. Stewart comes to the institution from the Whitney Museum of American Art (MoA), which she has led since 1998. During her tenure at the museum, she has developed new programs and initiatives designed to support artists and their projects, and she has expanded the museum’s collection in an effort to become more culturally responsive.“Ashley is an exceptional leader, who has been instrumental in the transformation of the museum from a closed, museum-", "The next Biennial should take place in 2020, and the first in 2021. The first exhibition will examine the artist’s lifelong exploration of body and regeneration. The second will examine how contemporary art has attempted to incorporate elements from the African diaspora. The third, titled “Pangaea” (Hope), will feature the works of eighty of the artists represented in the exhibition.\n\n\nThe Museum of Contemporary Art (MoCA) in New York is preparing to welcome visitors back to the institution in 2021 following a $13 million renovation and expansion. The work included the installation of new galleries, new spaces for educational initiatives, and the addition of over three hundred gallery tables and an outdoor terrace.The reopening of MoCA—which was temporarily shuttered in March due to the Covid-19 pandemic—will be accompanied by a new schedule of exhibitions, performances, lectures, and workshops. The institution has already announced that it will open again in June. The next tour will take place in June 2020.“For twenty-three years, MoCA has been dedicated to showcasing the art of America,” said museum director Michael Govan. “This is a historic moment for MoCA as it reopens in June.", "The next Biennial should be completed by the end of January 2020, and the fourth by the end of March 2020. The Biennial of Hawaiian Art will also include a new retrospective of art from the Collection of the Museum of Fine Arts, Honolulu, and will host a public performance series, “The Five Hundred Foot Journey,” in conjunction with the Honolulu Art Museum. \n\n\nThe Museum of Fine Arts (MoFA) in Boston has announced that it has received a gift of more than 1,500 works from the collection of the American artist Richard Anuszkiewicz. In addition to the works on paper, paintings, drawings, and photography, the institution also recently acquired an album from the artist’s first solo show at the institution, in 2003.The gift includes six works by the artist, including his first solo exhibition at the museum in the United States, his first show with the museum in the United Kingdom, and his first major retrospective exhibition. The acquisition also includes a recording of his performance at the Indio Museum of Art in Japan in 1976. Through the artist’s extensive network of collaborators, the museum has created a digital catalogue of the works, which will be made freely available online. Richard Anuszkiewicz", "The next Biennial should be held in 2022. The 2019 edition of the event, “Feminist Women in Asia: Art, Politics, and Immigration,” included work by thirty-five artists, including Chantal Aissa, Anish Kapoor, and Nandita Banerjee. The 20th edition of the event, “Feminist Art, Politics, and Migration: History and Literature,” will be held in the United States in 2024. The biennial, which was originally organized as a nine-month project in 1998, was extended once again in 2009 to 2020. According to Artnews, the first exhibition of the new work will open in the United States in 2020.\n\n\nThe Museum of Fine Arts (MFA) in Boston has received a $5 million donation from the Charles and Lucille King Family Foundation in support of its expansion into live performance. The $5 million gift comes a year after the museum opened its new venue in the city’s Dorchester neighborhood, and it will allow it to stage thirty-four concerts annually.According to MFA, the expansion will be transformative for the institution and its audience. The foundation’s board chair, Stanley King, said", "The next Biennial should be held in the fall of 2020.\n\n\nThe Los Angeles County Museum of Art (LACMA) has received a $10 million donation from the private collection of Louis Vuitton heir and philanthropist Pierre-Auguste de Montfort, who passed away on March 4 at age seventy-nine. The gift comes at a pivotal point for the institution, as it works to assemble the pieces of its critically acclaimed, eight-year-long exhibition “The Precarity of Desire” (2019–2020), which examines the relationship between masculinity and poverty, and retraces the remarkable journey of the French American artist Auguste Comte de Montfort, who emigrated from Paris to Los Angeles in 1931, and his family to California in the 1940s.The gift also brings LACMA one step closer to completing a major overhaul of its structure and its mission, which has been in the works for more than two decades. Since it is now the largest arts museum in the United States, and the birthplace of the contemporary art movement, the LA County Museum of Art has been working on revamping its campus and operations in order to increase accessibility and accessibility to the arts. Among the changes that have been made are the installation of new", "The next Biennial should be held in 2021, the Art Newspaper reports. The 2019 exhibition, titled The Shores of the City, was held at the Los Angeles County Museum of Art and the Art Museum of Chicago, and was surrounded by protests from local residents who claimed it was being staged in order to pad its already cash-strapped budget.Artforum has contacted Warner Bros. for a statement.\n\n\nThe Institute of Contemporary Arts (ICA) in London is launching a new grant program to help small and mid-size arts organizations by providing $5 million to support the creation of new careers and the retention of existing staff. The biennial, Art in the City, will launch this April and will be curated by Wes Stacey, director of the Institute of Contemporary Arts in London, and Anna Friel, head of the Institute of Contemporary Arts London.The program will initially support organizations in the UK who can demonstrate an immediate need for assistance in the areas of artistic and cultural production and are eligible for up to $3 million. The grants will be opportunities for artists and creative professionals who have not established their own businesses yet but have some sort of need for funding. The grants will be administered", "The next Biennial should be held at Heidelberg Castle in September 2020 and will celebrate the theme 'Cultural Roles, Cultural Relics and Cultural Histories,” The Guardian reports. The exhibition will also feature photographs by artists such as Damien Hirst, Douglas Davis, and Diane Arbus. \n\n\nThe Los Angeles County Museum of Art (LACMA) has received a gift of fifty-six works by twenty-four artists from the Los Angeles County Museum of Art (LACMA), including works on paper, photography, video, sculpture, and installation. In addition, the institution received a gift of thirty-three works by forty-seven other artists from the Los Angeles County Museum of Art (LACMA). The gift includes works on paper and photography by Robert Irwin, Ed Moses, Micah Johnson, and Patricia Neal, as well as works by Jane Panza, Alex Katz, and Peter LaBar, as well as works by Richard Diebenkorn, Paul LeBlanc, and Kelly Lee Cronenberg.The works from LACMA are among the works by artists who have been selected by LACMA director Cortés DeLuca for the 2020 biennial. DeLuca selected the artists based on their \"except", "The next Biennial should be held in 2020, with the first exhibition being staged at the Museum of Fine Arts in New York in 2021. The donation will support the development of the exhibition series. \n\n\nThe Presidential Commission for the Protection of Philippine Cultural Heritage (PCPH) has released guidelines for the protection of cultural heritage in the country. The document, titled “Carlos Queer,” outlines five core principles that should guide the preservation of cultural heritage in the country: autonomy, diversity, engagement, protection, and conservation.“The preservation of cultural heritage is an inherent right of every Filipino,” said Jorge Pimentel, chair of the commission. “It is our duty as Filipinos to preserve, protect, and conserve. It is our responsibility as citizens to act in concert with our local and state governments in ensuring the long-term and proper conservation of our heritage sites and institutions.”The guidelines also outline the ways in which the government can work with private donors to further improve the situation of heritage conservation in the country. The government can establish a fund to compensate heritage owners for lost income from quarrying, illegal logging, and landmine attacks; compensate victims of illegal plunder and looting; and establish a special", "The next Biennial should not be scheduled until November 2021, as previously announced; it should be rescheduled to coincide with the ten-year anniversary of the death of the late director-general, H.J. Akbar, who had led the institution for almost four decades. In a statement published by the Biennial, Akbar called the new date “premature” and “difficult” and said that “it would be a mistake to make a late announcement for a reason of this magnitude. . . . Our board of directors has made it clear that the current event should not take place, and that the full implications of the postponement from September 2022 to September 2021 should be discussed with the public.”Akbar also cited the ongoing work of the Biennials’s collection staff to help them plan for a possible disruption to the exhibition in September 2021 as one of the reasons why the Biennials are delaying the event. “The[k]nap’s program will continue at the same pace as before the postponement, and our exhibition will be open as usual,” Akbar said.\n\n\nThe New York–based nonprofit group New Yorkers for Art, which was founded", "The next Biennial should be in the first week of the tenth month. The 2021 edition of the exhibition is currently on view at the Centre Pompidou, Paris.  The Biennial will also be presented in the United States by the Museum of Contemporary Art, Los Angeles (MCA), in October 2020.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines for the return of cultural artifacts from the Holocaust to their rightful owners. Under the guidance of director Michael DeLuca, the DCLA will now focus on enforcing a number of new anti-racism laws that were passed by the city council last year. Among the laws that were changed is a section titled “Judaization,” which addresses the process by which objects from the Holocaust are to be returned. According to the city, the law stipulates that the property of a perpetrator of “racial hatred” must be returned within twenty-one days, and the property of an individual must be returned within sixty days.“The guidelines are a first step in implementing the city’s landmark legislation, which aims to make the city a model for the nation,” Mayor Bill de Blasio said. “We will not tolerate", "The next Biennial should take place in the spring of 2021. Prisma, which was founded in Baku, Azerbaijan, in 1986, has organized the fair twice a year since 2010. It is now planning to organize the first edition, which will take place at the Museum of Contemporary Art (MoCA), New York, in May. The show’s inaugural exhibition, “Diana’s Warhol,” will be relocated, as part of a $100 million renovation, to the newly renovated Whitney Museum of American Art, in New York.\n\n\nThe Hong Kong–born, New York–based artist, filmmaker, and educator, Peter Cook, has died at age seventy-eight at his home in Los Angeles. Cook was born in Brooklyn in 1940. After earning a bachelor’s degree from Brooklyn College in 1967, he returned to his hometown to pursue a career as a filmmaker. Among Cook’s most famous works, which include The Graduate, 1973, which depicts a group of students walking past a painting by contemporary artist David Salle, and his 1972 documentary American Beauty (which premiered at the Berlinale), which screened at the Venice Film Festival.Born in Hong Kong in 1963, Cook moved to New York", "The next Biennial should take place in 2022.\n\n\nThe Guggenheim Museum in New York has named David K. Cooper director. Cooper joins the museum from the Museum of Modern Art (MoMA) in New York, where he has served as interim director since June 2018. He will assume his duties on March 20.“We are delighted to welcome David to the museum,” Mark Rubenstein, the director of the museum, said in a statement. “He has been a visionary champion of art and design at the Guggenheim and has been instrumental in developing our new space in the Hudson Yards neighborhood, which has made our unique location in the heart of Midtown Manhattan possible. He is known for his deep understanding of visual art, his ability to understand the relationship between architect and client, and his ability to adapt his own vision to fit the needs of the Guggenheim’s clients. We cannot imagine a more perfect fit for David, and we believe he will take the Guggenheim through this extraordinary period of its history.”The museum will commemorate its sixtieth anniversary in 2021 with a retrospective of the Argentine architect María Berrío, of his collaboration with MoMA and for the first", "The next Biennial should take place in the city of Saint-Petersburg in the Russian Republic of Tatarstan in December 2020. The exhibition will be curated by Valentina Moskalova and will be organized in collaboration with the Kupka State Museum of Art and the Moscow State Museum of Art. Among the works that will be on view are the work Women and Architecture from the Late Russian Empire (1918–1949), which is based on the work of Crematologos G. Kupka; and Beautiful Cities, which is based on the work of Aleksandr M. Ivanov. The first international exhibition of works by Russian avant-garders was staged in Leningrad in 2008 and Leningrad International Biennial in 2009.\n\n\nThe Queens Museum in New York is recalling more than two hundred works and counting due to a potentially life-threatening coronavirus. The institution says that sixty works are currently under quarantine, and that of the remaining seventy-nine have been moved to storage facilities and will be released once the coronavirus is contained. The museum is preparing to hold a reopening party on Friday, March 8.The recall, which affects works dating back as far as 1883", "The next Biennial should focus on themes of the past, such as the construction of the exhibition during the Nazi occupation of the museum and its building in 1972. “The exhibition is about to open in 2022, and I am sure that the exhibition will inspire many visitors to visit the exhibition and react emotionally to the exhibition,” said the curator.\n\n\nThe National Gallery of Art in Washington, DC, announced today that it is planning to close its doors for a period of fifteen years in order to complete a $500 million renovation, which will include the restoration of over thirty thousand works, including more than 3,500 new works from the collection. The overhaul will also include the creation of new public programming and will include the formation of a new, twenty-five-member board of trustees.The National Museum of African Art (NMA), in Atlanta, announced its intention to open in 2021, with a new twenty-seven-foot-tall and twenty-one-foot-wide museum building, the NMA Center for African Art, and a new, three-acre campus in the city of Shreveport, Louisiana. The center will also boast a new lecture theater, a gallery, a restaurant, and a library.“The", "The next Biennial should take place in March 2020.\n\n\nOn Monday, the museums in the United Kingdom and Europe announced plans to shut down their permanent collections in an attempt to reduce the greenhouse gas emissions from factories. The institutions cited the Paris climate accord as the reason for the halt, but the shutdown of art and other cultural institutions generally coincides with the annual Art and Fossil Show, which draws a huge and diverse crowd at the Royal Academy of Arts (RA) and the National Portrait Gallery (NPG) in London.According to Artnet, the National Galleries of Scotland announced that it will not reopen until the end of March, and the National Museum of Scotland has also stated that it will be closed until March 21. The Royal Academy of Arts (RA) has yet to make a decision regarding its future exhibition schedule.The institutions are taking the climate emergency very seriously. Governor Ann McPartland, the UK’s secretary of state for culture and arts, said: “The UK’s planned cuts will make the most dire climate commitments look moderate. The government has made clear that it wants to significantly reduce the size of the UK’s arts and cultural footprint. And the evidence is that these plans are working—the arts are", "The next Biennial should focus on “the interrelation of art and the life and death of the individual.” The first of these exhibitions will take place in the former barracks of the Ministry of Foreign Affairs in Beijing in March 2020.The first exhibition will deal with the philosophy of the late Hungarian artist György Kepes: “Kepes presents us with a unique, paradoxical, and contradictory vision of art,” said curator and curator of the exhibition Janette Laverrière. This exhibition will feature Kepes’s work in its entirety. It will also serve as a conversation between the artist and the French post-modernist Pierre-Auguste Renoir, who lived and breathed art and architecture.The second exhibition will explore post-war German architecture’s relationship to the Holocaust, with the works of the artist Helmut Neumann, who was convicted of war crimes by a German court in Brussels in 2015. In a 2017 exhibition at the Museum of Modern Art in New York, Neumann’s monochrome, heavily ornamented structures were juxtaposed with the many abandoned Reich-built Nazi concentration camps. Neumann’s work will be exhibited in the exhibition “Deutsche Stad", "The next Biennial should include a special project on the role of the USSR and its hybrid model of socialism and capitalism; a survey of the Brazilian revolution; and a discussion of the Chinese and Italian revolutions. The museum will then return to the capital for a three-day exhibition of work by the contemporary artists Mireille Altamirano, Anselm Kiefer, and Wolfgang Pfeifer, who will be re-created in a museum building. The exhibition is expected to open in May.\n\n\nThe Museum of Modern Art (MoMA) is planning to move the exhibition “The 3-D Model,” an exhibition of works that examine contemporary art from the 3-D perspective, from May 25 to May 31, 2019. The move follows the announcement of the ten-year anniversary of the exhibition.The move was made in order to “cut through the artificial lines and artificial compositions in the works in order to see the interior spaces of the artists’ bodies and be able to re-create the 3-D models of their bodies in their bodies and in their bodies’s bodies.” In a statement, MoMA said that the move was not “designed” but was made in response to", "The next Biennial should be held in 2020. The first will be held in 2021.The second will be held in 2022. Akron Art Museum and Art Museum of Natural History2019, 2019, and 2019. Akron Art Museum and Art Museum of Natural History2019, 2019, and 2019. Lincoln Memorial Museum of Art2019, 2019, and 2019. Mana Contemporary Art Museum Wilmington, 2019. The new museum will house the collective exhibition “Personas and Objects: The Importance of Painting” and the organization will begin welcoming visitors in 2020. The museum will also introduce new programming that will highlight the work of American artists in 2020. The first event is “Artist Open House: The Annual Art Talk,” which will take place on Saturday, February 11, at 1 PM. In the talk, Nathan Eckhart, the director of the Brooklyn Museum, and Lydia Conner, the director of the St. Louis Art Museum, will address the topics of how art is made, what makes painting unique, and how artists are connected. The second is “Art and Drama: Modernism in the Age of John Cassavetes,” which", "The next Biennial should be held in 2030.In a statement published on Sunday, the exhibition said: “In this age of unprecedented climate chaos, when our world is being torn apart by conflict and terrorism, when the lives of millions are being lost in the greatest humanitarian crisis since World War II, when many of our fellow inhabitants are desperate to escape crisis and to find meaning and fulfilment in their lives. The new Biennial will be an extension of the restoration and reopening of the city of Biennale, following a comprehensive planning process that began in 2017. It will focus around organic and sustainable means, with an emphasis on contemporary art, that celebrates the spirit of the city, and its rich artistic history. We hope that the new Biennial will engage with and promote the history of the city in a way that we have never done before. We will continue to work closely with the city of Biennale and with the partners of the Biennial to develop a programme that will inspire and delight the city of Biennale. We thank the artists and city of Biennale for taking part in this year’s creative process and we hope that the new Biennial will continue to evolve and flourish as an important cultural and social", "The next Biennial should be held in 2024. \n\n\nIn an unprecedented move, the city of New York has adopted a new bylaw that will grant the New York Museum of Modern Art (NYMO) the ability to build a new, 48,000-square-foot wing for the institution within the boundaries of its current building. The new space will be built in a former manufacturing facility on the city’s East Side.The new space will offer a new kind of programming, including a new museum-like experience every Monday and Wednesday and will be accessible by car or taxi from all areas of the boroughs. It will incorporate an auditorium, classrooms, studios, and public spaces. The museum will also be able to house its collection, which includes works by artists such as Pierre-Auguste Renoir, Henri-Bicaly, and Anna Atkins. New galleries will also open on its building’s first floor, with the first exhibition to be staged there to be the official opening of the museum’s new general collection in 2021. The development marks a milestone for the museum, which had been seeking to expand to four floors of the museum and has been working toward such a project for more than five years. The organization was", "The next Biennial should be set up by the Northwest Asian Art Museum, which was forced to close after it was damaged by a fire. \n\n\nThe Toronto Reference Library (TRL) has announced that it is planning to open a $500,000 biennial edition of the Toronto International Film Festival (TIFC), which was canceled owing to the coronavirus. The biennial will be curated by Laura Mulvey, director of the Centre Pompidou in Paris, and will involve the exhibition of twenty films from the upcoming season.According to a release, the event will be held at the North American Centre for the Visual Arts (NACVA), near Parliament, on September 5–September 7. The biennial’s inaugural edition, “Cloud Nine,” will be shown at the NACVA from October 15–October 21. The exhibition will also be available on Blu-ray, DVD, and digital platforms. In a recent Artforum feature, Mulvey said that the exhibition brings the festival closer to the Toronto International Film Festival, which was founded in 2005 to serve as an outlet for local, independent, and experimental filmmaking, and aims to “create a space for civic engagement and support across Toronto", "The next Biennial should be held in 2021.\n\n\nThe Baltimore Art Institute (B.A.I.I.) is planning to renovate the institution’s historic Edward Steegmann Building to incorporate more than one hundred thousand square feet of work by contemporary artists. The project, dubbed the Edens Center, will also include a gallery, a performance space, a library, and a visitor center, as well as a new visitor experience.“We want to create a new space for the arts,” said Michael Govan, director of the B.A.I.I. The renovation will involve the addition of 355 square feet of gallery space and a new visitor experience, which will be inspired by the Edens Theater, a modernist, experimental theater that opened on the former site of the Baltimore Museum of Art in 2014.The Edens Theater’s third season, which premiered in March 2019, featured performances by a selection of contemporary artists, including Sean James and Giuseppe Fontana, as well as artists whose work is currently on display in the Baltimore Museum of Art’s upcoming exhibition “Beyond the Body: Visual Arts in the Age of Black Power” (2019). The Edens Center will also", "The next Biennial should be held in the next two years; and the museum should have more than one hundred works by the Paris-based artist Ai Weiwei .  The Whitney Museum of American Art director Julián Zukerman said, “Ai Weiwei’s works will carry with them a special resonance for Whitney’s artists and curators. We are deeply saddened by the passing of Ai Weiwei and look forward to honoring his legacy in the coming years.”\n\n\nNordic Ballet Theatre, Norway, has announced that it is planning to postpone the upcoming season, which was initially scheduled for March 2020, as it works to address a number of challenges that arose during the staging of the third edition of the Nordiska, titled The Heart of Winter, in February 2019. The show, which was held at the Skåneborg Castle in Norway’s capital city, Oslo, was canceled due to the coronavirus pandemic, and the performance was moved to the Viking Gallery in Copenhagen.In a statement, the company said that the production will now be staged at the Stedelijk Museum in Amsterdam in August 2021, and that its next stage at the Nørrebro Art Museum will", "The next Biennial should be held at least every two years, said festival director Robert Giard. “What it will be is an extraordinary exhibition of art, and the exhibition should be in the city of Zurich. It should be a central forum for culture in the city and all over the world.”\n\n\nAn artist’s studio in Athens, which was inaugurated by then-Prime Minister Antonis Samaras in 2016 and which is housed in a former tobacco factory in the capital’s Piraeus district, has been sold for $1.5 million to an Athens-based private investment firm led by Alex Pappas. The buyer is a consortium of three private investors: the National Development Fund, the Hellenic Foundation for Culture and Tourism, and the Hellenic Foundation for Modern Art. The buyer is seeking an amount in excess of $150 million. The Athens-based art collector Panagiotas Papadimitriou bought the works, which were created by Russian artist Andrei Koper and are on display in the exhibition “The Blood of Demons,” at the V.S.R. Museum of Art in Athens in 2014 for $400,000. The buyer is now seeking a greater sum, and he", "The next Biennial should take place in the year 2020, and would be held at the Saint-Paul’s Saint-Vincent Museum—the building that houses the museum, a library, and a concert hall. “We are actively considering a number of possibilities,” the museum’s director, Susanne Vielmetter, told the Times. “The Catherine Higgins show has been an outstanding success, and the Biennial has been tremendously popular with the general public.” She added that she expects the exhibition to draw some three hundred thousand visitors next year.The next exhibition will focus on the work of the twentieth-century’s emerging and established, with a particular focus on the work of artists whose work has recently entered the public eye. The first show, “From the Dark Side: Art and the Subversion of Reality,” will be presented by the Museum of Modern Art in Los Angeles in February 2020. It will then return to the Ritz-Carlton in New York for a second show in February 2021. A third show is currently underway at the National Gallery of Art in Washington, DC, with a selection of works by artists such as Thomas Dolores, Charles Drew, Charles Handy, and", "The next Biennial should be held in the fall of 2020. \n\n\nThe British Film Institute (BFI) in London has appointed director Phil Hillier as its next chief executive. According to the London Times, Hillier will be the first British director to helm the institution since it was founded in 1929. “Phil is a seasoned executive who has led BFI for eighteen months, and we’re confident he will deliver an even better future for the BFI,” said director Maria Balshaw. Hillier succeeds Mark Di Stefano, who led the institute from January 2019 to March 2020, and will take up the post in March. During his tenure, he has also led several UK arts institutions, including the National Galleries of Scotland, the National Shakespeare Company, and Tate Britain. \n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines for the collection of cultural artifacts that are currently housed in the Metropolitan Museum of Art as part of a $3.8 billion expansion and renovation project. The overhaul of the museum’s holdings will involve the opening of two new galleries, including a new audience-pleasing installation, the first major renovation since it was built in 1929, and the consolidation", "The next Biennial should embrace the hard-earned lessons learned from thirty years of producing the art-world exhibition in the most authentic and innovative manner possible. The theme should be “The Future Is Present,” and the program should reflect the spirit of the exhibit.”Coachella Valley Art Museum’s (CVM) director and CEO, Rob Lebovitz, said: “Our decision to organize a biennial was not made lightly. We had a strong commitment from our board and board members to create a unique and transformative experience for our community and our visitors. . . . We are extremely excited that this next iteration of the show will focus around the themes of sustainability and the art world.”\n\n\nThe Center for Contemporary Art (CFA) in New York has appointed Sara Cwynar as its next executive director. She succeeds David Gerschock, who departed the institution on May 29 after fifteen years to head the Brooklyn-based arts incubator the Savoy Arts Center, and will take up the post in September.During her tenure, Cwynar will develop the next iteration of the Center for Contemporary Art, which will be inaugurated this fall. It will also host residencies for underrepresented artists in", "The next Biennial should focus on the role of art and the media in the fight against fascism. It should also explore how art and artworks can act as a tool for social change and its relationship with the resistance movements. \n\n\nThe Victorian Art Gallery in London has received a major donation of more than one hundred works by thirty-six artists who were part of the Covid-19-induced lockdown at the institution before the pandemic began. The works were donated by London-based collectors Mishand Exhibition House and Janus Contemporary, which were not aware of the serious health crisis at the institution prior to the exhibition.“We are incredibly grateful to the Janus and Mishand teams for their strong support of our artists during the lockdown and for their willingness to share their expertise and expertise so that we could receive the work donated in this way,” said Caroline Parry, director of Janus. In a statement, the museum said: “This is a truly international team effort and with their help we have raised the funds for the next exhibition. We are all committed to continued collaboration and to developing new work with our artists and their families under the lockdown. We are very much looking forward to welcoming them back to the Victorian.”The", "The next Biennial should focus on the current situation and its socio-political context in South Asia and the region, and should also explore the possibilities for cultural exchange between South Asia and the United States and Europe. The exhibition will take place in the United States from September 13 to September 15.\n\n\nThe twenty-fourth edition of the Venice Biennale has announced that more than eighty artists, including Alice Aycock, Teodor Pindell, Adam Sand, and John Szoke, have been selected to participate in the event, which will take place in Italian pavilion from September 22 to September 26. Among the eighty-three artists who have been selected to participate in the event are Arakawa, Caland, Bacharnia, Catellani, Collett, Cicutto, Dosia, Foggi, Filippo Fusi, Giuseppe Ciavotti, Giuseppe Cipollini, Giustino Lupanti, Tarek Sadiq, Matthew Waller, and Mark Weidman.Artsakh Juara, chair of the exhibition’s organizing committee, said: “The exhibition was born in the spirit of cooperation between the two countries, in the early years with the Vienna Bienn", "The next Biennial should be held in 2020, and thereafter the Kunsthalle Basel in February 2021. The second Biennial will take place in 2022.With the announcement, the organisers say that the second edition of the exhibition will include work by around fifty artists from twenty-two countries. It will be held in the city of Basel from January 8 to January 11, 2020.\n\n\nThe Nouvelle-Rey Art Biennial has announced that it has received two new investments totaling $10 million from the partners of the British artist Niles Carter, the first woman to win the Prix d’Art Contemporain (PACE) in Paris. The donations were made in 2017 and 2019, respectively. In 2020, the biennial will also feature work by a new group of artists created in collaboration with Carter. The artists will be chosen from among a pool of applicants.Pace, a nonprofit organization founded in 2007 by the creators of the French pavé and the Pompidou in Paris, announced that the two new investments, €10 million and €5 million, will fund the renovation and expansion of the exhibition and the development of a new immersive art experience that will be staged in both New York and London in 2021. The", "The next Biennial should be held in 2019. In a statement, the Art Gallery of Ontario cited the 'remarkable progress' made by the institution since the cancellation of the two-year event in 2017, and the museum’s commitment to its artistic mission. The statement concluded: We welcome the opportunity to work with the next generation of artists. . . . We wish them good luck and hope that they will be successful in their endeavours. We hope that they will be inspired by the work of their predecessors and inspire them to pursue their own artistic visions. We ask that they consider the impact that their work will have on their future projects.\n\n\nParis’s Musée d’Orsay has announced that it will reopen in the capital city in order to receive visitors in November. The institution’s longtime home, which was recently restored and transformed into a cultural complex, has been temporarily closed since June and has faced an uncertain future due to the coronavirus.The Musée d’Orsay, which was founded in 1892, was forced to order the evacuation of the entire region around the French capital. In September, it reopened with the express purpose of welcoming visitors. The space was also br", "The next Biennial should be held in 2020; the first will be held in 2022.\n\n\nThe Noguchi Foundation, a New York–based organization that promotes the art of the Noguchi family to the public, has launched the Noguchi Art Fund, a new initiative that will support the visual arts through a grant program that will award $500,000 to artists each year. The fund will also provide funding for the academic study of art through the Noguchi Foundation’s Noguchi Institute, which will hold an exhibition in the spring of 2021. “The Noguchi Foundation is excited to work with the Noguchi family to advance the foundation’s practice with the Noguchi Collection. Together we will be able to produce new works and realize an expanded legacy of Noguchi’s art,” said Noguchi Foundation president John Pugh. The foundation will have a permanent endowment of $500,000 that will be invested in Noguchi’s work for the next seventy-five years. The Noguchi Foundation will award total of $2.5 million to the museum, which will be called the Noguchi Museum, and will organize a series of exhibitions and", "The next Biennial should be held in 2021, with a date to be announced.The 2019 show, titled “Theology after Death” was staged at the Visual Arts Centre in London, and was organized by the Royal Shakespeare Company. The 2019 edition premiered on April 10 and featured the work of forty-four artists, including the German-born artist Arundhati Roy (Pace), Uzbekistan-born artist Nadezhda Svetlova (Skeleta), and Pakistani-born artist Yasmin Ahmad. The show was organized in partnership with the Royal Shakespeare Company, the British Council, the Institute of Contemporary Arts, London, and the National Galleries of Scotland.The show, which also featured the works of the artists who had participated in previous editions of the festival, included the work of the �star-making” artist Murtaza Hussain; the French-born, Algerian-born, and Balinese-born artist Rinslade Parin; the Swiss-born, the Czechoslovakian Joseph and the Dutch-born and Italian-born artist Swarovski; the work of the Hungarian-born Polish artist Tomasz Wojtas; and the work of the British artist and designer Rach", "The next Biennial should be held in 2021. The biennial will reflect on the legacy of the artist-activists who have shaped the museum’s mission, and will introduce new exhibitions, lectures, and other programming.\n\n\nThe National Gallery in London has received a £3 million donation from the Doris Duke Foundation, the William Pitt Foundation, and the Rockefeller Family Fund. The three foundations will each give £1 million to the institution, which was created by Doris Duke in 1981 to serve as a center for public engagement and public programming in the United Kingdom.The donation follows a grant of $3 million from the Walton Foundation in 2013, which was used to create a new sanctuary dedicated to the arts in Central London. The grant also supports the appointment of a new director of curatorial and exhibition design at the National Gallery. Bradley Bevan, president of the foundation, said: “The National Gallery is at the forefront in ensuring that the arts are offered a home in people’s homes and is dedicated to helping the Royal Shakespeare Company and the National Galleries in London continue to thrive and grow in the decades to come. Being able to contribute to the future of photography, the National Poetry Library, and the National Galleries is", "The next Biennial should focus on the development of our campus, our community, and our art, and should begin with a presentation of the museum’s most recent work, a selection of modern and contemporary art, and a discussion of the future of the museum.”The announcement comes almost a week after the institution announced its plans to tear down the Diller Scofidio + Renfro–designed building, which houses the Diller School of Art, the Museum of Art, and the Botanical Gardens and the Botanical Gardens of the University of California, Los Angeles (UCLA), and the Metropolitan Museum of Art, in New York.In March, the museum’s board of trustees and management voted to remove the current structure of the museum, which has been shuttered since September 11, 2001, and to reframe the museum around fourteen hundred acres of open land and renovated spaces. The restructuring plan, which also involves the reopening of the Botanical Gardens to the public in 2021, was endorsed by the Los Angeles County Board of Supervisors in December.“The current structure of the museum is not sustainable for the future of the museum and its collection and future visitors,” Leonard Stern, the museum’s board president", "The next Biennial should be comprised of at least two exhibitions a year. The first, “The Art of Eating: From Memory to Food,” will open on September 9—the same day as “The Meat Market” and will be followed by a special exhibition of art from the “Circus of the Mind: Art and the Body” series, which will be on view throughout October. The second exhibition will be titled “The Life and Death of the Body: Painting and the Body,” which will open on October 18.The move reflects “We are not just adapting to the new circumstances, but we are inventing and inventing new ways to live,” said Agustín Pérez-Huertas, director of the Biennial and the Department of Anthropology at the Universidad de los Andes, in Santa Ana, California. “We are inventing new ways to explore your body and new ways to dissect your body.”\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed David Breslin as its next director. Breslin will assume his post on October 16.In his new role, which was created to strengthen engagement", "The next Biennial should take place at the San Francisco Museum of Modern Art, the San Francisco Museum of Modern Art, the San José Museum of Art, the Seattle Art Museum, and the Metropolitan Museum of Art, with a project-based, multi-media exhibition that will take the form of a travelogue.  The 2013 edition of the Biennale was held at the Museo Nacional Centro de Artes in Madrid.\n\n\nThe Kingfisher Art Museum in Kingfisher, Massachusetts, has named Robert Rigg as its next president and CEO. Rigg currently serves as director of the Metropolitan Museum of Art in New York and has helmed the museum since 2001. He succeeds Kenneth Feinberg, who has served as the head of the institution since 1993, who is currently on sabbatical, and will take up his new post in January 2020. “I’ve long believed that the Kingfisher Art Museum was one of the most important institutions in the United States, and it’s continued success has been a source of inspiration for me and for many others,” said Rigg. “I’m excited to lead the museum through this unprecedented moment, and look forward to working with", "The next Biennial should be the first under PRESIDENT DONALD TRUMP’s presidency, and will take place at the National Museum of American Art, in Washington, DC. In 2020, the theme Art of the Century’ was “Excessive Consumption,” and the program will focus on collecting and displaying art made in the twentieth century.  According to the Los Angeles Times, the exhibition will celebrate the ten years of the museum’s collection, which consists of more than four hundred works, including works by Verne Dawson (1962), Frank O’Neill (1962), Robert Irwin (1962), Jean-Michel Basquiat (1962), and Maureen Packer (1962). The event will also feature additional programming, including a virtual reality installation by American artist and educator John Akomfrah. The work, Avatar: The Last Airbender, is part of the Republication exhibit “The Life and Work of John Akomfrah.”\n\n\nThe London-based nonprofit Culture Space has launched a new digital platform that aims to advance the understanding, appreciation, and conservation of artworks through a variety of activities, including exhibitions, education programs, and publications. The platform", "The next Biennial should focus on the spatial and temporal structure of the global crisis, the relevance of contemporary art and culture to our current moment, and the ways in which contemporary art and culture can be a vehicle to advance social justice and human rights.”The 2019 version of the exhibition will take place at the Rijks-Foundation for Contemporary Art (Rijksmuseum Amsterdam) in Amsterdam and will run from March 18 to March 21, 2020.\n\n\nThe Frankfurt Art Fair (Faisalabad) and the Japan Art Museum (JAM) in Seoul announced today that they are working together to present a collaborative exhibition of contemporary art in 2020. The first show of the partnership will be a retrospective of the work of the Dutch-born artist Eva Ghebaly, who is best known for her silver and gold metal sculpture leggings commemorating the birth of her daughter and for creating a series of interactive installations that are currently on display in the museum.The exhibition, “Eva Ghebaly: Silver, Gold, and Other Metals,” will take up themes of family and the environment, will take place at the museums in late December and will be organized as a multi-course evening event. The exhibition is", "The next Biennial should take place in 2020, though the date has yet to be determined.\n\n\nIn the aftermath of the devastating fire that tore through a multi-million-dollar-old Rana Plaza apartment complex in Dhaka, Bangladesh, on November 3, 2017, the artist-run nonprofit Art and Fire has endorsed the launch of a new, independently funded, platform that will help artists and activists exposed to racist violence and prevent similar incidents from recuring.Launched by the nonprofit Antiracism Now, the platform will provide immediate aid to those impacted by the fire, helping them fill out a form to receive a $250 emergency fund. After verifying they are legally authorized to work in Bangladesh, the participants will then be able to connect with a network of similar services in the US, Europe, and Asia. Following a two-week training camp in an undisclosed locations, the platform will help connect those impacted by racist violence. The platform was created in response to the international outrage following the November 16 fire, which killed at least ninety-one people and injured thousands more. Many political, religious, and business leaders expressed their solidarity with the Bangladeshi people who called for the government to do more to protect cultural sites and people from the fire.", "The next Biennial should be a celebration of the life and work of the artist: \"The road ahead will not be easy.” The biennial is already preparing for mass protests. On Monday, thousands of people marched through the capital, Doha, in support of the artists and their demands. The next edition of the biennial, titled Art in a Time of Crisis, will take place in 2022. “It’s time now for us to take our responsibilities as citizens seriously,” the organizers said. “We must stop equating support with endorsement and begin by asking ourselves: What future does this invite?”\n\n\nCincinnati’s Solomon R. Guggenheim Museum is planning to move the exhibition “The Power of the Paintings,” a show about American painting, from its location in the city’s Warren Arts District to the Bergen Museum, in Norway. Its opening event, a museum-wide painting class, will now take place at the museum, as scheduled. The move has been made as a result of the museum’s commitment to creating a new $5 million building that will house the museum’s collections and fulfill its long-term"]