["The next Biennial should be held in 2021–19. The Government of Arts and Culture will be responsible for selecting the next winner and will decide on the date and venue after the formal announcement of the museum’s selection by June 25.The biennial will be hosted by the NCS Art Museum and the NCS Memorial Art Museum and will be held at a new 60,000-square-foot venue at 5th Avenue and Tenth Street in Manhattan from November 7 to November 10, 2020, and November 16 to November 20, 2020. The new museum will be inaugurated by a new work by artist and collector Yoshitomo Nara. The biennial will be a celebration of the fifty-fourth edition of the Art in American Life Summit, which will be held in June 2021. The 2018 Art Book Award, presented by NCS, will be presented by the NCS Museum of Art in July 2020. \n\n\nThe forty-third edition of the Black Dahlia Arts Festival, which takes place in the UK every August, has announced that the event will not return to the region next year. The news comes amid the Covid-19 outbreak and the UK’s run-down economy. While the event has moved to", "The next Biennial should include an exploration of the materiality of the body, of the environment, and of life itself, and should take up the theme, “Body and Life” in a similar manner to how the exhibition “Body in Space” has been historically staged. The exhibition will also include a new sculpture by the artist Elisabeth Brahm, titled Body Integrity,” which will be on display in the exhibition.\n\n\nThe Fondazione Paolo Cattelan, Italy’s directorial committee for the Palazzo Nazionale d’Arte Contemporanea (PACE), which was closed on March 23 due to the Covid-19 pandemic, has named Paul Beckmann, the artistic director of the Museum of Art in Rome, as its next director.Beckmann will take up the post on April 21. He succeeds Paolo Cattelan, who was appointed director of the PACE in August 2019. “To achieve an open and transparent culture, the PACE has been transformed by a new founding team, with Paul and his colleagues, who have been instrumental in making the PACE a reality,” said Pa", "The next Biennial should be held in 2020, but if the 2019 edition is any indication, it will be a bumpy ride. For the first time since the exhibition began in 1988, the exhibition will not be organized as an annual event. It will instead be held on two consecutive days, one in the spring and one in the fall. The theme of the 2019 edition, “Born to Die,” was a statement about how the body and the self, and not the other way around, are the ills of existence. \"We have come a long way, but we are not close enough,” said Krishna Agrawal, the director of the Biennial. The event, which will be curated by Diwan Muad'Dib and hosted by L.A. Gallery, will run for two consecutive days with the theme “And Then There Was Nothing,” starting March 11. The biennial was founded in 2008 by L.A. Gallery, L.A. LIVE!, and the Los Angeles–based artist Jay-Z. The show will honor Talia Sun, who will be the subject of an exhibition at the museum in December. “I", "The next Biennial should have taken place in March 2021 and should have been inaugurated by an exhibition of works by the Bénédicte Savoy-19. “Ours is a great future,” said the president.  The biennial’s first exhibition, “The Last Word: Art in the Age of Resistance,” will focus on art from the region of Cameroon, the Democratic Republic of Congo, the Central African Republic, and South Sudan.“The next exhibition will be ‘The Future Is Not What It Used To Be’ in April 2020,” said the president.\n\n\nAfter the Metropolitan Museum of Art in New York shuttered its public art programs in February due to the coronavirus—the New York–centered museum announced it was temporarily closing its permanent collection as well as its annual spring tour—the Metropolitan Opera House in Chelsea announced it would also begin phasing out its public art programs. The announcement came amid a national campaign to conserve and protect art and coincided with the construction of a new $250 million arts complex in the city.The announcement follows a wave of similar initiatives in cities nationwide, including New York, New York City, and South Bend, Indiana. Among", "The next Biennial should be held in 2020, and the exhibition should be the catalyst for change. Although the show will not be on view until the fall of 2022, it should still be a game changer. “We are committed to supporting and strengthening the careers of the most talented artists at a time when we are at the forefront of transforming the world,” said Naima J. Keith, chair of the board of trustees. “These are challenging times and we are all working together to address them, supporting the artists we love.”The Biennial will invite ten artists to participate in the exhibition, which will be curated by Anita Basedow, curator of modern art at the Museum of Fine Arts, San Diego, and curated by Haroon Mirza, chief curator of the South Asian Art Museum, New Delhi. The ten selected artists will then be given the opportunity to move to a large-scale show that will run for twenty months, and the full list of curators will be announced in the fall. \n\n\nThe Borobudur Museum of Art in Manila has announced that it is working with artists Jaysin Bocanegra and Juana Barba to build a new house for the Philippine vernacular. B", "The next Biennial should be held in 2021. \n\n\nA group of artists, designers, musicians, and writers are asking the German government to establish a new $230 million fund to support the wartime visual arts, which was created by the Nazi Party during the Holocaust, and was allocated by Chancellor Angela Merkel in 2015. The fund, which would be administered by a German-allied arts organization called the Bund, would distribute $110 million across six years.The artists—who include the German artist Christian Wohn and the Dutch artist Joost Von Holst—wrote a letter to German parliament on March 16, urging it to allocate the funds as quickly as possible. The petition comes amid ongoing political uncertainty over the future of the Holocaust Memorial, the former site of the Nazi concentration camp Auschwitz, and the Bund’s $100 million bid to topple local government authority over the memorial. “The situation in Poland is difficult,” the authors wrote. “We are convinced that the German parliament must immediately approve the request for the reconstruction of Auschwitz, and of the restitution of the objects there’s demolished and looted. Such restitution must take place through the political and not through the criminal justice system. The restitution of the Treblinka", "The next Biennial should take place at the Museum of Contemporary Art, Los Angeles (LACMA), on March 17–March 21, 2020, and will be hosted by the Los Angeles County Museum of Art (LACMA).\n\n\nThe Royal Academy of Arts (RA) in London announced today that it is preparing to welcome the first visitors to its new foyer, the new Royal Academy of Arts Building, to the academy on March 23. The visit will be a major milestone for the institution, which was completed in 2017 and is currently undergoing a major refurbishment, and will mark the opening of the new biennial, which will feature an original work by no less than four artists.The exhibition will also feature a major reworking of the museum’s grounds, with the new building designed to function as a hub for the collection and exhibition of works by the arts. The Royal Academy of Arts will launch a public funding programme to help pay for the installation and upkeep of the building, which will be inaugurated by the London-based architect Alexander Gray, and will unveil a new sculpture by Lacy Taveras, “The Comet Stole My Breath Away,” in the spring of 2020.Joanna Harrison, the director of the RA", "The next Biennial should take place in the spring of 2022. The exhibition will also feature work by independent artists, a new selection of works by international artists, and a reconstruction of the exhibition “Interiors,” which is one of the few remaining works by the Italian-born, London-based artist Marc-Olivier Neuer.The revised schedule is slated to open in September, 2020. \n\n\nThe National Poetry Library in Kentucky announced today that 59 writers and artists will be featured in the second edition of the National Poetry Slam, set to take place at the National Museum of American Art on February 28–March 3, 2021. Titled “The future is unclear,” the exhibition will explore poetry’s place in society and the American landscape and will examine themes of memory, trauma, and the self.Launched by the National Poetry Foundation (NPF), a nonprofit organization, the event will be led by the artist and writer, James Patterson, and will draw from the collections of the National Poetry Library, the American Poetry Archive, the Hirshhorn Museum, and the National Poetry Center.“We are eager to explore new and exciting ways to bring poetry to life through our collections", "The next Biennial should take place in late June, and the exhibition should be completed by August. The event will be hosted by the Museums and Galleries of Finland, and will be organized as follows: Each year, the Museum of Contemporary Art in Helsinki will present an exhibition of some twenty works on paper. The Biennial will consist of three phases: 1. The exhibition will open with a short introduction to the subject, and will then progress to a discussion with the artists represented in the exhibition. 2. The next exhibition will be a selection of the work of the artists represented in the exhibition, and will be about fifteen months later. 3. The second Biennial will be a selection of works that were exhibited in the first Biennial, and will be about eighteen months later. Artnews reports that the 2020 exhibition will be curated by the Finnish artist Paavo Ruukkainen. The artist, who has exhibited in the United States and Finland, will also helm the 2019 exhibition, “My Skin,” in collaboration with Mikko Hoppinen and Hamza Saeki, at the museum. The show, which will focus on a particular type of performance art—a form of sculpture made of rubber, plastic", "The next Biennial should take place at the city’s Art Museum in 2019.  If the plan is successful, the first edition will take place in 2021. Lechner, whose current curatorial project at the museum is her research group for the exhibition “The Trans-Adriatic: The Bicennale Loves to Push Back.” She has also taught at the University of Vienna, the University of Copenhagen, and the Royal Academy of Arts, Moscow.\n\n\nRoughly one thousand artists, designers, writers, and other cultural members of the European Union are requesting that the European Commission fund their next editions of the Venice Biennale, which will be held in 2021 and 2022, respectively. They argue that the recent decision to cancel the event, which was announced on April 5, has negatively affected the creative and financial futures of many artists whose works will be included in the upcoming editions of the art fair.“We recognize that the cancellation of the Venice Biennale is a difficult decision for many artists, especially those who have been working tirelessly and with great enthusiasm to present their works at the fair,” reads a letter signed by the artists and more than one hundred other artists and designers, who are also", "The next Biennial should focus on the literary and artistic heritage of the Philippines and the city of San Antonio, and will be held at the Margate Museum of Art from November 21 to December 12. The exhibition will include works by twenty-six Filipino artists, including Antony Gopetto, Josue Mendoza, Robert J. Martinez, Laura Mulapara, Gia Tondo, and Jumaia Matadain. The Philippine National Museum of Art was founded by the Nationalist Allies for the Philippines (PNPA). The institution receives funding from the National Economic Development Board, the Department of Foreign Affairs, and the Department of Foreign Trade. The biennial will also include two exhibitions: “The Negri Diaries: Contemporary Philippine Artists” and “The Political Art of the Filipinos: Filipino Artists” and will feature new works by artists from the Philippines and beyond. The exhibition will run at the National Museum of Art until December 12.\n\n\nThe Metropolitan Museum of Art in New York has appointed Kate Cropper as the next director of its collection of African American art, which comprises works by forty-two notable artists from the region, including Frank Gehry, Robert Irwin, and Jean Toomer. Cropper will", "The next Biennial should be held in September 2019. The theme of the 2019 edition was “Life in Motion.”The 2019 edition featured a total of sixty artists\u0097it was staged at four different locations, including in Athens, Athens Metropolitan University, and the University of Tartu, and was organized as a “life-cycle” with the artist groups from the city, including the artist groups of Athens, Thessaloniki, and finally, of Thessaloniki. The exhibition also featured several new works by the artist groups that had been previously unpublished. The biennial will be hosted by the National Museum of Art in Athens for a twenty-six-month period, from September 15–September 22, 2020.\n\n\nA group of fifty artists and designers are refusing to work with the city of Shanghai on a new exhibition during the city’s Global Art Week, citing concerns for their safety and the safety of their families and the institutions sponsoring the event. One hundred individual artists signed a statement of solidarity with the artists and designers who are refusing to participate in the exhibition, which will take place at the Art Institute of China (ICA) in Beijing from September 22–September 29.The statement, which was issued by the artists ", "The next Biennial should be held in 2020. \n\n\nThe Guggenheim in New York has received a gift of 2,500 items from the Paris-based collector Bénédicte Savoy. The artworks, which include works by Pierre-Auguste Renoir, Robert Rauschenberg and Jean-Michel Basquiat, were acquired by the Galleria Savoy in the opening of a new exhibition dedicated to the collection at the institution. “The Guggenheim has been able to acquire these works since it opened in 1967, when it had just four galleries in the building,” said Peter Guggenheim. “This new project of the Guggenheim in Paris opens a new chapter for the Guggenheim, and for the collection in general, since the collection has always been an open treasure chest.”The exhibition, “Remains in the Garden: Past and Present”\u0097which was organized by the London-based artist Jane Bulman and curated by Rister Wirth\u0097presents works by twenty-four artists from the collection, including John Currin, Hélène Delabar, Ian Johnson, Robert Irwin, Hé", "The next Biennial should take place in 2020 and will offer a mix of new research and new exhibitions, will be a celebration of thirty-six years of the Biennial program. The following year will be dedicated to the work of Caroline Aitken and will also include a new exhibition of works by Deana Lawson.\n\n\nThe London-based charity jubilee auction house London Gallery Fair announced today that it will postpone the upcoming edition of the London fair, which is scheduled for September 30–September 31, 2020, until March 21, 2021. Due to the Covid-19 pandemic, the fair’s October 29–October 31 event is being moved to March 23–March 26. The announcement follows the publication of a statement by London’s PEN American Center for Art and Policy, which said that the fair’s cancellation was a “historic day for art, and we look forward to keeping you up to date with its reopening and to sharing further developments with you.”Peter Gross, CEO of the PEN American Center for Art and Policy, said: “The Covid-19 pandemic has brought with it a new kind of crisis. At a time when millions are still without power,", "The next Biennial should take place in 2020. \n\n\nThe Museum of Modern Art (MoMA) in New York has appointed artist and educator Kiki Smith as its next director. Smith comes to the museum from the Metropolitan Museum of Art (MoMA), where she has served as director of education and public engagement since 2015. She succeeds Christopher Bedford, who took the institution on as director in November of 2018 and has since overseen the museum’s transformation into an artist’s home.“Kiki’s performance-based approach to leadership, her ability to bring people together through engaging with them through her practice, and her deep experience working with artists and artists’ practices have set her apart from the rest of the team,” said Raymond Boyd, director of the museum. “Her departure leaves MoMA and the museum in a very challenging situation. Her departure marks a moment of great uncertainty for the Met. She has a bright future ahead of her, and I’m confident that she will create it.”Smith comes to the museum from the artist-run organization Art Assist, which offers assistance in the development of artist-designed projects in the arts and humanities. She is currently working on a conceptual concept for the", "The next Biennial should be held in 2020, but the organizers have yet to say when a date will be set. They will face pressure to respond to the coronavirus outbreak since Canadian Prime Minister Justin Trudeau announced in January that the country would follow the US and shuttered its borders to all but essential travel.In an attempt to tamp down the virus, which has killed more than 2,600 people in China and has infected at least 6 million people in the country, Prime Minister Trudeau announced in April that Canada would open its borders to travelers from the US, Mexico, and Canada. According to the Associated Press, the government has already welcomed nearly four million people since the pandemic began and announced that it expects to welcome around nine million travelers by the end of the month.In response to the coronavirus outbreak, the Canadian governments of Canada, Alberta, and British Columbia have closed their borders and are restricting travel between the provinces. In a statement, Alberta Minister of Human Resources James Anstey said: “As we work together to contain the virus and to protect our citizens, we must remember that Canada is a country of immigrants, and we are a country of people first. We are welcoming people from throughout the world, regardless of their origins, and we", "The next Biennial should be held in 2021. For the first time, the exhibition will be hosted by a single institution, the Museu de Arte de São Paulo, as the organization will continue to organize exhibitions here. “I have always believed that Brazil was the birthplace of Michelangelo da Modena, of Christo and Gio, of Rui de Freitas, of Brazile, Pérez, and Marabar,” said André Rodríguez-Firas, the president of the Biennale de São Paulo and the chair of the commission’s committee. “All these artists and their families were born here and came to Brazil when they were young, these are the artists who we will follow in the next years. They are the artists whose works will have the most impact on our imagination, our soul, the society and the world.”Rodríguez-Firas added that the biennial will invite Brazilians to think of the country as an “embassy of the Americas.” He added: “We have been able to feel the presence of the arts in Brazil, and it is this vitality that will be our goal.”", "The next Biennial should be in 2021—all things being considered. “The exhibition is a means of building upon the work of the previous five years, and of deepening the public and local knowledge of the history and culture of the city,” said director Raffaello Troisi. During the exhibition, the work of contemporary artists in the city will be presented in a different way, including curated tours of the exhibition.\n\n\nThe Royal Academy of Arts (RA) in London announced today that its new executive director, Zadie Smith, has accepted the position. Smith will serve as the interim director until a new director can be appointed. Smith joined the academy in 2016 as deputy director and chief curator. She will take up her new role on August 1.“Zadie is to the Royal Academy of Arts as Leonardo is to the Louvre and the world,” said Alex Horne, the Royal Academy’s director. “She is a true visionary, who has been at the heart of the academy for more than twenty years, and we are looking forward to working with her. She has the vision and ability to make the RA one of the most important cultural institutions in the country.”Smith’", "The next Biennial should be in 2021. \n\n\nLillian Cameron, the British artist-in-residence at the Museum of Modern Art (MoMA), has been selected to represent Great Britain at the Fifty-Ninth Venice Biennale, which will take place in February 2021. Cameron, who was selected from a shortlist that included Mihai Ghebaly, Kei Miller, and John H. Bryan, is the first UK artist to represent Great Britain at the Venice Biennale since Lorelai Bentley, who was selected from the same group in 2007, was selected to represent the US. The announcement comes on the heels of an announcement by the British Museum that Cameron is the first artist to take the helm of the institution since Douglas Adams.“I’ve been a fan of Cameron’s work since I was a child and it is special that she is able to create such a strong, important work and receive such a strong and positive response from the public and museum,” said Museum director Christopher Walpole. “The work of the artists who have visited the museum over the years is vital to the future of the museum and the British Museum. This work represents an amazing atmosphere", "The next Biennial should focus on devising new and alternative forms of expression and distribution. It should acknowledge the scientific and institutional limitations of the medium and should thus reflect the spirit of the event.”The upcoming edition of the Biennial will take place at the Museo de Arte Contemporáneo Miami Beach (MASB). The institution will be inaugurated by a group show entitled “Allí amigos” (All is possible). The exhibition will consist of twenty-four works, curated by artists who represent seventeen countries and forty-four countries in the Americas and Europe.The exhibition is supported by the Foundation for Contemporary Art (FCA), the state of Florida, as well as the artist-artists of Espacio a la Paz, Julian Traverso, and Francesca Varejão.\n\n\nThe Museum of Contemporary Art (MCA) in Los Angeles announced today that Natalie Johnson has been selected as its next director. Johnson comes to the museum from the Los Angeles County Museum of Art (LACMA), where she has served as director since 2015. She succeeds David McAllister, who retired this May after eighteen years at the helm of the museum.“Natalie is an outstanding leader and", "The next Biennial should take place between February and April 2021.\n\n\nThe Gillman Barracks has announced that it plans to reopen to the public in March 2021. The reopening, which will be accompanied by a major investment of over £6m in restoration work, is part of a wider strategic plan to 'tear open old wounds, mend ties, and rekindle patriotism, pride, and security' through a new global architecture of cooperation.“We are proud to have contributed to a long-term cultural legacy of important landmarks, and to successfully introduce new ones, and to be a global leader in the preservation and promotion of heritage,” said George Gillman, the Barracks’s director. “Building on the success of the Barracks, this new chapter will see the Barracks, with a new contemporary, rising from the ashes of the Barracks to become an important site for visitors to explore and experience a rich new world.”The Barracks is a former British Army (BA) barracks that serves as the headquarters of British forces in the Arabian Peninsula during the height of the conflict in the country with the Soviet Union in the late summer of 1979. In 1991, the Barracks was renamed the MCH", "The next Biennial should be held in 2021. \n\n\nThe Whitney Museum of American Art (MCA) in New York has received a gift of more than 20,000 objects from the late Iranian American poet and thinker Imre Nagy. The work, which includes artworks by some seventy artists, is part of the collection titled from the Iran-Iraq-Syria (I/S) exhibition, which will be on view until December 3.The Nagy Collection is comprised of works by Rasheed Araeen, Ibrahim Bani Nazeer, Ali Haddad, Rana ʿAlam, Scarul Islam, Mohammad ʿAlayn, Bana El Shaddadi,  Andrea Dwork, Gaia Farah, Naama Fadlallah, Naneer Mukherjee, Tafari Niazi, and others. The show is curated by Jane Panetta, director of the Whitney Museum of American Art; Irshad Manji, curator of the inaugural exhibition; and Karla Balsom, director of the Diyarbakır Biennial.“The Zakir University of Art, Art", "The next Biennial should be held at the Museo de Arte Contemporáneo in Lisbon in 2021. \n\n\nThe National Museum of Fine Arts (MFA) in Atlanta announced today that it is opening up its collections to the public for the first time in its seventy-five-year history. The inaugural exhibition, titled “Biodiversity in Motion,” will comprise works by sixteen artists and will run concurrently with the upcoming exhibition “Theoretical Biodiversity” at the Museum of Fine Arts in Columbus, Ohio. The first piece to be presented in the exhibition is the work Alexander Calder’s “The Yellow: Transformed Landscape”, 1935, which was acquired by the museum in 2016. The artist’s first solo exhibition at the institution was in 1965.The next exhibition will take up the theme “Time and Trees” and will move to the Georgia Institute of Art in Atlanta in 2022. The inaugural exhibition will be staged in partnership with the Georgia Museum of Art.\n\n\nItalian artist and educator Giuseppe Cimolai, a prolific and influential theorist who was enmeshed in and influenced by a multiplicity of historical, literary, and contemporary technologies", "The next Biennial should take place in 2022. \n\n\nThe Center for Contemporary Art (CAA) in New York has appointed Richard Wright as its next president. Wright comes to the institution from the Museum of Modern Art (MoMA) in New York, where he has served as chief curator since 2014, and will assume his responsibilities on April 5.“Richard brings with him an impressive track record of curating wonderful exhibitions at institutions like MoMA and the Metropolitan Museum of Art, and will make the CAA a stronger, better, and more engaging contemporary art museum,” said Elizabeth Baumann, the museum’s director and chief curator. “The CAA is on the forefront of a new movement in American art, and we are excited to witness how this innovative new model will transform how we think about the museum, and how artists and collectors think about the world.”Wright joins the CAA at a pivotal moment in its history, when it is presently undergoing a major transformation, which will begin with the reopening of the Museum of Modern Art in 2021 and will culminate with the construction of a new visitor experience on the grounds of the CAA. The new spaces will be called the Center for Contemporary Art. “", "The next Biennial should take place in 2020. \n\n\nUniversal CityWalk Alliance (UCCA) has announced the launch of a two-year, $10 million funding initiative to help New York galleries and nonprofit organizations recover from the Covid-19 Emergency Response and Deployment Fund (ERDF) and to help artists and cultural workers prepare for immigration raids and other enforcement actions. The initiative will also offer grants to help galleries reduce or eliminate travel or exhibition space in their premises; strengthen worker protections, including paid sick days and paid vacations; and support self-organized art conservation efforts.UCCA Executive Director Cecilia Dziewior said: “As we work together to make NYC more accessible and engage more people in their communities, we are inspired by the resilience and ingenuity of the artists and cultural workers who have been inspired by the works of our collections in their communities and are inspired by the creativity and creativity of the community at large. We are proud to support the work of these artists and cultural workers and their organizations in their efforts to remain free from this crisis.”The initiative will partner with local, state, federal, and tribal law enforcement agencies to identify and prioritize the ways in which UCCA can provide support to cultural organizations facing financial", "The next Biennial should be in the Spring of 2020, where it will draw up a list of fifty artists from underrepresented regions of the globe. The theme will be “Humanity, Politics, and the Future.”\n\n\nThe National Gallery of Canada has announced that it is planning to open a new office in Ottawa in 2020 and has committed $77 million towards the project. The institution also plans to lift the $58.4 billion curation and display building’s ceiling and add more than 1,500 square feet of gallery space.The National Gallery of Canada’s current exhibition hall, the National Gallery of Canada (NGA), will remain closed through at least the spring of 2021, but will reopen by summer 2021 with a new show by Louis Vuitton. The new venue will be named the National Gallery of Canada (NGC) Ottawa.Inaugurating the new location will be a three-day exhibition of works by artists from around the world and a “sensational” visit by North and South Korea’s Kim Seo-kyung and Kim Byun. The exhibition will also feature a new collection of works by artists such as Yoko Ono, Tanya Ghent, and Nari", "The next Biennial should be held in 2018, and the first in 2020. \n\n\nThe Collective Art Museum in Philadelphia has appointed Melissa Harris as its next executive director. Harris comes to the institution from the Scranton-Wilkes-Barre Artscape, where she has served as program director since 2014. She succeeds Helen Floyd, who has helmed the museum since 1997, and will assume her responsibilities in October.Harris has helmed the museum since 1994, and was instrumental in the museum’s development as a national treasure. She spearheaded a multiyear $25 million renovation of the museum, which gained attention for its original glass-enclosed glass-walled building in 1968 and became a Center for American Art in 2000; created partnerships between artists and the museum, including with Howard Graves, who created the landmark exhibition “Be/longing” in 2006; and spearheaded the acquisition of work by artists such as Adrienne Atget, Rachel McAbee, and Robert Irwin.“Melissa Harris is an exceptional leader who has shown incredible vision for the vision of the Art Museum,” said Christopher Collins, the museum’s director and chief curator. “We are honored to welcome her to the board and are confident", "The next Biennial should be held sometime in the summer of 2022. “The Biennial will be a celebration of the work of cutting-edge contemporary artists, with a view to advancing their work to the highest level,” said Julien Abou-Saad, director of the Biennial, in a statement.The museum will inaugurate the new exhibition, “Art and Philosophy” with a screening of a selection of work by the German artist Edvard Munch’s Munchhaus. The theme of this year’s event is “The Structure of the World.” The biennial will then feature work by thirty-six artists, including Amichai Glatter, Rirkrit Tiravanija, and Yoko Ono. The museum will also present a variety of new works by artists in the tradition of the late Russian avant-garde artist and theorist Gerhard Richter and the late Swiss theorist and collector Rem Kool. In addition, the museum will commemorate the centenary of the Mies van der Rohe–directed exhibition Biennale d’Art et d’Art Paris–New York, which debuted in September 2016 and was immediately preceded by the venerable institution’", "The next Biennial should be held in the spring of 2021.  Kopp, who has served as curator of the exhibition since 2018, added: “We are grateful to the Board of Directors of the São Paulo Biennial for the ongoing support of this exhibition, our staff and the entire team. We are planning a new exhibition in the fall. ”\n\n\nFollowing a complaint about a performance at the Wonder Ball at the Museum of Contemporary Art (MoCA), Los Angeles that was canceled due to the Covid-19 pandemic, the organization that runs the museum announced that it is planning to hold a special exhibition dedicated to the Black Lives Matter (B.L.M.) movement. The exhibition will feature works by forty-five artists, including Eric A. Iha, Domenick de la Peña, and Michael Schmidt, and will be on view until January 6, 2021.The move follows the announcement of a new initiative, #BlackLivesMatter, which aims to raise awareness and funds for Black social causes. The initiative will also feature artist-led projects, including a project titled “Racism: Black and White” that will exhibit “the lives of black and white men", "The next Biennial should be organised as follows: [1] The Environment and Health, [2] The World As We See It, [3] The World We Live In, [4] The Future Is Present, [5] The Present Situation, and The Future of Art. The exhibition of the work will be at least three months after the opening of the exhibition of the exhibition of the work will be on Friday 12 July 2019. The exhibition of the work will be at least three months after the opening of the exhibition of the work will be on Thursday 12 July 2019. The seventh meeting of the conference will be held in Munich from 27 June 2019 to 6 July 2019. The third Biennial will be held at the Württemberg Museum of Arts in Frankfurt from 7 July 2019 to 1 August 2019. The inaugural exhibition of the New Contemporary Art Biennial will be held at the Künstlerhaus in Vienna from 8 July 2019 to 12 August 2019. The inaugural exhibition of the Contemporary Art Biennial will be held at the special exhibition space Artforum in New York from 3 August 2019 to 8 August 2019. The 15th edition of the Biennial will be held at the", "The next Biennial should be staged in 2021, with the first exhibition held in 2022. The biennial will also be staged in two other locations, at the Art Gallery of Ontario and at the Museum of Contemporary Art, Chicago, in 2020 and 2021.\n\nThe Chinese artist and scholar Wang Wei (1931–2013) has died at the age of ninety-three.Born in Shanghai in 1931, Wang earned his bachelor’s degree in art history from the Shanghai Academy of Art and his master’s degree in Chinese art from the Shanghai Museum of Art in 1947. He lived in Beijing for most of his adult life and was the only surviving member of the Zhuang family, the influential cultural elite of the city of modern day Nanjing.Through his work, Wang demonstrated a keen interest in and appreciation for the visual arts. His paintings, which were first exhibited in the ’60s at the Metropolitan Museum of Art, and his prints, which first appeared in the ’50s in the Chinese art journal Vogue, are among his best-known works, which are often separated by their juxtaposition and their bold, high-contrast, geometric forms.\n\n\nThe National Gallery in London has appointed Anna Atkins as its new chief executive", "The next Biennial should be held in 2021.  The auction house announced the winner of the auction, a $100,000 gift from the late French collector Guillaume Saïdou, in an email on Saturday.In a statement, Christie’s said: “This is a truly remarkable collection, encompassing the finest works of art of every important era. We are thrilled to present this remarkable collection in the most timely fashion possible and in the quiet of our own homes. It is a truly exceptional achievement to win this unique, very special, and extraordinarily valuable piece of art. We are determined to continue to offer a wide and important forum for the many great works in the collection.”\n\n\nPinnacle Art Gallery in New York has appointed Donald F. Pirotte as its new global director and CEO. Pirotte will take up the post in January. He succeeds Claudia DiBernardo, who departed the institution in March after eighteen years to head the New York Museum of Art.“Donald brings years of experience and a deep understanding of the creative and financial realms to Pinnacle, and I’m eager to see what he will do to expand the gallery’s international reach,”", "The next Biennial should take place at the San Francisco Museum of Art, and it should showcase the work of at least twenty artists. The 2020 edition, titled Between the World and Me, will be held at the San Francisco Museum of Art and will feature works by forty-nine artists, including Kate Hoberman, Joana Iglesias, Joël & Ghebaly, Dr. Lorenzo Barnet, and Hank Willis Rudolph, and will be presented by the San Francisco Museum of Art, the Museum of Fine Arts, and California Institute of the Arts (CalArts).\n\nThe Museum of Contemporary Art Philadelphia announced today that the institution is reopening to the public next week after a temporary closure due to the Covid-19 pandemic. The reopening will coincide with the opening of the temporary exhibition, Between the World and Me, which will present twenty works by forty-nine artists. The show will run through March 21 and will be on view until March 23.“It’s been an absolute honor and a joy to return to work with the Philadelphia Museum of Art’s talented team to present ‘Between the World and Me’ in March,” said Burke. �", "The next Biennial should focus on issues of sustainability and be a reflection of the many communities in New York City. The theme should be “A Universal History,” an attempt to explain how the history of art is recorded and transferred through history and how that history is constructed from the human genome, a biological blueprint of humanity that was first discovered by German scientists in 1954.Judy, the curator of contemporary art at the Museum of Modern Art, in New York, has suggested that the next iteration of the exhibition might focus on “potential futures,” which she defines as a future as “potential for the arts and humanities,” as opposed to the “present.” In her opinion, the “present” is the “worst of all worlds.”\n\n\nThe Institute of Contemporary Arts (ICA) in London has received a gift of more than fifteen thousand photographs by American cartoonist Ed Moses. The donation includes more than six hundred photographs by the artist that have never been publicly exhibited in the United States and will go to the foundation that works with artists to create new works.“We are delighted that the Institute of Contemporary Arts (ICA) in London has donated these works to the foundation,", "The next Biennial should be held in 2020 and is now negotiating with the city of Long Beach on moving it. The Biennial’s partner, the Museum of Contemporary Art (MCA), in Los Angeles, has announced that it is also working on moving the show. “We are actively looking at various options for moving the show,” said Aria Wirth, senior director of programming and public engagement at the museum.  “As we continue to move our programming forward, we want to ensure that our transportation network and our exhibition spaces are designed to support the continued exhibition and research of our shows.”A few months ago, the city of Los Angeles presented the idea to the museum of Contemporary Art (MCA) as a way to address the city’s traffic. A group of neighborhood activists, led by local artist Monica Abney, created a petition to the city council in an effort to get the idea off the ground. The group, which includes members from the Los Angeles Community Land Trust, began to look into the idea of moving the show, which has been held in Los Angeles’s Central Library since 1971, and the city settled on a compromise: A series of ten exhibitions, each themed around a", "The next Biennial should take place in Tokyo in 2021.\n\n\nThe König-Pace Museum in Cologne, Germany, has appointed Celine Bénétière as its next director. Bénétière, who currently serves as a curator at the San Francisco Museum of Modern Art (SFMoMA), has been the director of the Kunsthalle Basel for the last two years and has served in a number of other roles at the museum, including as a board member and as the director of the Kunsthalle Bonn.“Since the beginning, Celine has been a fearless champion of art and its relevance to contemporary life. She has shown her inner strength and vision to shape the Kunsthalle into becoming a truly world-class museum,” said Kunsthalle director Christian Halsall. “From her first gesture of recognition in 2012, Celine has become part of our family, and has become our friend and partner. It is a great honor to welcome her back to the König-Pace.”Bénétière is currently the guest curator at the Museum of Modern Art (MoMA), where she has served as the senior curator since 2018. Her curatorial projects include “", "The next Biennial should take place in the spring of 2021.\n\nThe Library of Congress is also planning to reopen its holdings of the Smithsonian’s National Museum of African Art, which has been closed since February 13, and will open the museum in September. The project will require the development of new architectural plans, and will be the first major renovation at the institution since the construction of the museum in 1865. The renovation will also involve the addition of more than twenty new galleries and a reconstructed theater room and will include the construction of a new large public courtyard that will provide an outdoor space for thousands of visitors to visit the museum. “We stand committed to supporting the collection and the institution in its current form while ensuring its long-term sustainability,” said Steve Kohn, chief executive of the Kohn Foundation. “The collection, presented by the Kohn Collection in its current form, is celebrated as an essential work of American art history. We are optimistic that the Kohn Collection will continue to thrive in an ever-changing world.” \n\n\nThe Museum of Contemporary Art (MoCA) in Santa Monica, California, has appointed Harald Szeemann as its next director and CEO. He has been appointed for a", "The next Biennial should take place in the capital, Hong Kong. The exhibition will focus on the history of modern art in Hong Kong and the Hong Kong–China Art Museum, and will be inaugurated by an exhibition of works by artists such as Edgar Degas, Vladimir Gogol, and Filippo Cattelani. \n\n\nThe Indonesian artist and scholar Zina Shivar became the first female president of the National Art Museum (SAM) in Jakarta, Indonesia, on Monday evening. Shivar, who was elected in a landslide victory in September, was reelected with more than 96 percent of votes and received nearly 83 percent of the total votes cast. She was also reelected on a pledge to reduce the prison population by half.Shivar, who is imprisoned for \"inciting religious hatred\" by painting a portrait of the Indonesian president Joko Widodo, is the latest artist to be imprisoned under Indonesia’s controversial anti-terror legislation. The controversial legislation, which was signed into law by President Joko Widodo in January, has been criticized internationally for infringing on freedom of expression and has been likened to the Sedition Act—a US law passed during the McCarthy era that was used to target progressive Cuban dissident writers.", "The next Biennial should draw from a list composed of artists who have exhibited their works at the Biennial or at least three of the preceding Biennials. The list should be curated by a board of curators comprised of Tamász Topor-Laus, Oscar Murillo, and Sinthujan Thakkar. The exhibition will be organized under the direction of Fátima Zilberman, the archivist and director of the Kölnische Kunsthalle Münster.\n\n\nThe New York Public Library has received a gift of more than one hundred works by the late French Impressionist painter Charles-Philippe Neuville, who, among his many works, produced the work L'Art et l'Artienne, a portrait of the artist as well as his wife, Gertrude. The work, which was part of a series titled “Paintings by Charles-Philippe de Lempick,” which was presented at the museum in 2000 and is currently on display in “Paintings in the Collection.”Lempick, who was born in Paris on December 2, 1936, and lived there for most of his life, began his practice in the mid", "The next Biennial should be held in June 2020.\n\n\nThe Museums Association (MA), the UK’s professional society for the exhibition of contemporary art, has announced that it is demanding that the Royal Academy of Arts (RA) in London remove a statue of General Sir Alan Brooke from its premises.The controversy surrounding the statue, which was dedicated to Britain’s First Lord Alan Brooke, came to light after a group of activists who had signed a statement of intent to pull the statue were disappeared by the British Government following a raid on their homes by the National Crime Agency (NCA). The group behind the campaign, the Project Fear Campaign, were charged with four counts of unlawful confinement and one count of hindering prosecutions following a five-month manhunt.A letter written by twenty-four activists, including Jo Stevens, Ann Marie Rutter, Emma Reynolds, and Lily Aldridge, demands that the statue be removed by the Government. The activists contend that the prosecution has failed to establish a clear link between the statue and the alleged crimes allegedly committed by the seven men who were arrested following a raid on a property in Fulham, west London, on February 8.The activists contend that the government failed", "The next Biennial should focus on bridging the gap between the scientific and the political - and should be an opportunity to re-imagine the future of our planet. ” ADI is also working with the Museums Association to develop a new digital platform that will allow museums to showcase their artworks in a more engaging and participatory way. In the meantime, the project will continue, and the exhibition will be published by the Museum of the Arts, New York, on October 28. The full list of participating artists is as follows:Teresa Banderas, Buenos AiresTeresa Banderas, New YorkUncreditedWorks by:Hui Jie, BeijingThis work is for the exhibition “Hangul: History of Modern Chinese Painting” and is a part of the exhibition “Hangul: History of Modern Chinese Painting” :  Hangul: History of Modern Chinese Painting” : HUAN CHUNG (2016)In the exhibition “Hangul: History of Modern Chinese Painting” (2016) in Hangzhou, China, Teresa Banderas will present the first catalogues of the new exhibition series, which will feature work from forty-eight artists from", "The next Biennial should take place in 2021, the same year the second edition of the Open-Air Biennial will be held.  The next edition will take place in the city of Milan, a city known for its cultural heritage and renowned for its artistic caliber. The museum will be restructured so that it will be located in a new, contemporary building, with a new exhibition space, a new café, and an extension to the museum. The museum will receive an additional 800,000 euros from the sale of the property.Earlier this year, the museum received an extra €100 million from the city of Milan, which is primarily used for cultural projects, and this additional sum is expected to help Biennale organizers uncertainly accommodate the increased number of visitors. The Italian government approved a five-year extension to the Biennale, which was scheduled to run from March 15 to March 21, 2021, but the extension only covers the duration of the event. The Italian government recently gave the organizers of the Venice Biennale the option of extending the event by up to a further two years.Commenting on the sale, Milan’s mayor, Daniele Cattelan, said: “I�", "The next Biennial should be in the fall of 2020.\n\n\nDiana Nolen, the director of the Museums Research Institute (MRI), has announced that the institution will move from its current campus in the heart of Barcelona to an architecturally designed new building designed by the same firm that designed the institution’s former home, the Marbella Regional Museum of Art (MRMA), in the city of Alcoy in northeastern Spain.The renovation of the museum’s campus and the extension of its hours, which was originally scheduled to begin in 2020, have been in the works for more than a decade, but the project was pushed back several times due to the health crisis. In 2016, the museum moved out of its current location in the city center and into the mountains of the Andes, and in 2018, it announced that it was reopening.In a statement published by the museum, Nolen said: “It is with great sadness that we announce that the first exhibition of the new museum will not be in 2020. In fact, it may be as early as 2021. We are working with the architect Gérard St-André to adapt the museum’s existing building and the old museum to produce a show", "The next Biennial should have been held in December 2020. Arthur Jafa, Israel’s chief curator of the museum, said: “The museum plays an important role in the promotion of Israeli art, and its exhibition ‘The River and the Sea’ in 2019 was a landmark event for the country, as it inaugurated its first exhibition dedicated to modern and contemporary art in Israel. The Biennial ‘March’ will be a celebration of the biennial’s thirty-third anniversary and the museum’s role as an indispensable institution for the country’s cultural life.”The inaugural exhibition, titled “The Death of Lesley-Anne Frank,” will present the work of more than sixty artists, including Aya Hen and Yael Aravo, and will open in October 2021.\n\n\nDahlia Naim, a curator and writer based in New York City and one of the founders of the experimental and contemporary art space Gallery 56, has been appointed as the new executive director of Lakeview Gallery, an organization established in partnership with the City of New York, the State of New York, and the Lakeview Foundation to showcase work by emerging and established artists in a series of programming", "The next Biennial should take place in 2020. \n\nThe museum is planning to open a new 110,000-square-foot wing in the museum in the fall of 2021. The project, which is part of a larger $3.7 billion renovation and expansion of the institution, will include the construction of a new café, new spaces for education, and new visual arts projects.The renovation also includes the expansion of the museum’s collection by approximately one hundred thousand works, which currently number about sixty thousand. The collection will now boast twenty-four thousand works. In addition, the museum will get rid of more than one hundred thousand objects that were in storage spaces across the building and will invest in the conservation of art and artifacts.The program will also introduce new programming, including exhibitions, presentations, and projects. The first show dedicated to Cindy Sherman, the American photographer best known for her iconic photograph The Body and the Picture, will go on view in March 2020. The show will feature fifty new works by forty artists, including James Turrell, David Salle, and John Akomfrah.The museum also plans to remodel the building’s exterior in order to improve circulation and circulation inside. The museum will also", "The next Biennial should take place at the Museo de Arte Contemporáneo in Madrid next year. The exhibition will mark the fifty-fifth edition of the BAC, which will run from February 3 to February 5, 2020.\n\n\nThe Los Angeles County Museum of Art (LACMA) has appointed Daniela Alvarado as its next director. Alvarado replaces Elissa Lepovitz, who has served at the institution for six years and will be replaced by Suzanne Lugg. In her new role, Alvarado will oversee the LACMA’s construction of “The Bay View,” a new contemporary installation that will address contemporary issues such as identity, architecture, and urbanism. “Daniela’s vision and passion for the arts and her ability to lead a contemporary museum through a project that embodies both her passion and expertise makes her the ideal candidate for LACMA’s board of directors,” said Nancy Fischl, LACMA’s former board president and current board president of the Los Angeles Chapter. “Her successful track record in fundraising, developing and executing long-term programs, and championing local artists makes her an ideal leader", "The next Biennial should be in 2020. The first was held in 1992. \n\n\nThe Museum of Fine Arts Boston (MFA Boston) has received a gift of more than three hundred works from the late Whitney Houston. On Wednesday, the institution completed a major restoration project, which included the acquisition of nearly four hundred works, many of which were on display in the former Whitney Museum of American Art in New York and had never previously been on display.“We are thrilled to unveil the ambitious new museum,” MFA Boston director Zina Saro-Wiwa said. “In addition to providing a permanent home for more than two hundred works, the new museum will be a crucial partner in inspiring new and contemporary art.” The gift includes more than two hundred works originally presented by Whitney Houston, including more than seventy works by artists she met through the Whitney in the late 1940s and 1950s. It also includes works by artists whose work has not previously been on view in Boston, including Roger Brault, Louise Bourgeois, and Robert Irwin.The works were acquired through a deal between the heirs of the late Whitney and James Houston, the founder of the Houston Gallery of Art, and a New York private equity firm, the", "The next Biennial should be held in 2021.\n\n\nThe architect-provocateurs Yishai Mir and Rebecca Watson have been named the recipients of the 2020 MacArthur Fellow Awards. Mir and Watson are among a small group of artists whose work has been included in the biennial for its first year—the rest of the laureates were announced on Sunday, March 16.“The MacArthur Fellow Awards are a critical step in unlocking the untold potential of the master class’s studio, and in enabling us to reimagine the future of work and design,” said Mir. “They celebrate the work of relatively few, and are a crucial step towards increasing public visibility and strengthening the design and architecture industries’ reach. We are honored to receive this award, and look forward to celebrating our first year of collaboration in September with the first cohort of MacArthur Fellows in 2020.”Prior to joining the Los Angeles–based firm MCH Group, which represents Mir and Watson, they were members of the Los Angeles–based collective Dangini, which won a MacArthur Fellowship in 2010. The duo were awarded an additional fellowship in 2012.\n\n\nThe Far Eastern Fine Arts Museum in Shanghai announced today that its inaugural collection of work from the Shanghai-born", "The next Biennial should be held in 2021 and will be a biennial that will cover all aspects of the history and evolution of the institution, including the exhibition, production, and promotion of works. Funding for the event comes through a change of management that will also see the departure of director Clara Moskowitz. “We are very excited that this year’s biennial will be a huge success,” said Thomas de Jong, chair of the board of trustees of the Biennale Triennale. “With the move of the director, the Biennale Triennale will be more ­transformed for the future, and we are confident that the new director will continue to support the group of artists that has made the Biennale Triennale such a ­phenomenon of world modern art and will continue to shape the Biennale Triennale into a platform for the collection, exhibition, and scholarship of the best contemporary art.”During his five-year tenure at the museum, Frank received the prestigious LaGuardia Award for outstanding achievement in the field of contemporary art in 2019 and a special commission from the Italian prime minister, Dario Franceschini, in 2019. He is also a professor of theoretical art history", "The next Biennial should focus on a topic that is of recent and current importance to you. For example, the next biennial should focus on the importance of women and girls, or the importance of history in shaping and representing contemporary life. \n\n\nFormer British Prime Minister, Gordon Brown, has been appointed the next chief executive of the Royal Shakespeare Company (RSC). Brown replaced Sir David Attenborough, who is currently the corporation’s chief executive, with Hannah Black, who previously served as the RSC’s director of artistic affairs, and will take up the post in January 2020. “Gordon is a gifted and dedicated leader who has created a real brand and portfolio for the RSC, and I am delighted to welcome him to the company,” said RSC chair, Jo Stevens. “As it ramps up for its twentieth year, the next edition of the Shakespeare Festival will be immensely exciting, and we look forward to working with Gordon and his team to shape the programme in his image.”Brown, who has helmed the Royal Shakespeare Company since 1998, will continue to serve as director in his role until the end of 2020. \n\n\nBerlin’s Haus der Kunst", "The next Biennial should focus on “Saul Alinksy: A Biennial of the Imagination.” This exhibition, titled “Stages,” was a series of presentations at the Museum of Modern Art (MoMA) in New York between 1998 and 2003. The monographic institution was founded by architect Edward I. du Pont in 1921 and hosted its first exhibition by the radical curator James A. Farley (1908–1990). It also hosted exhibitions by Frank Gehry, Frank Gehry & Partners, and other major artists, including Norman Rockwell, and Alberto Barajas.Since the show was initially canceled in 1998, the biennial has been held every five years. The 1998 edition featured work by thirty-six artists, including David H. Dyer, Rashid Johnson, and Christopher Wool.\n\n\nArt historian and curator María Berrío, who most recently served as curator of contemporary art at the Museum of Modern Art (MoMA), New York, has been appointed director of the Metropolitan Museum of Art in New York. Berrío joins the museum from the Queens Museum, where she has served as the deputy director of collections since 2015. “Maria Ber", "The next Biennial should be held sometime between March and September 2020. While the museum has not yet announced a date for a future exhibition, the institution has previously said that it will keep the doors open as long as the public is allowed to visit.\n\n\nThe National Gallery in London is planning to take over the management of the Royal Academy of Arts (RA), which has been closed since March due to the Covid-19 virus. The move is part of a UK–wide strategy to make the RA more accessible to the public, and to make the school more financially secure.The institution, which has been closed since March because of Covid-19, will split its operating budget between the two organizations. When the school reopened, it was only able to house 30,000 students. However, as of March 18 it was able to house an additional 250,000 students. The academy has since distributed £7 million ($8 million) to support the school, and has already received £2 million from the government for its scholarship fund. Simon Livermore, director of the National Gallery, said: “We are delighted to be able to provide a new role for the RA in the National Art Gallery through a merger with the Royal Academy of Arts and to", "The next Biennial should aim to produce a more integrated presentation of the work of the two artists. They will also collaborate on a new public sculpture, entitled Update, to mark the anniversary of the death of Germàlinde Niebler. Opening the first exhibition in the new space will be a new collection of “Germàlinde Niebler” by the artist and her husband, Tobias Niebler. The second exhibition will comprise three new works by the same artist: The End of an Age, 2018, and The Rise of the Artist-At-Large, 2018. The fourth and final exhibition will be a new six- by the artist in collaboration with the artist-at-large, Charles Wei.Promotion for The Rise of the Artist-At-Large, 2019, will be based on a new project, “At the End of an Age”\u0097the first exhibition, “At the End of an Age”\u0097which is currently on display at the CAFA Museum of Modern Art in Milan. The work will also be a part of an exhibition of work by the artist at the CAFAM Studio in", "The next Biennial should take place in Beijing in 2022. An announcement about the venue and the construction of the exhibition will be made in the coming months.The performance and exhibition will be held inside the UCCA, the National Museum of China, in Beijing, and will be organized as follows:The opening of the exhibition “The Story of Man” will be held at the UCCA as part of the Beijing Art Museum (BAM), on September 14. The exhibition will then travel to the National Museum of China (NMC), Beijing, on September 16 and the Art Museum of Fine Arts, Beijing, on September 20. The first exhibition will then return to Beijing on February 20. The show will then head to the National Museum of History, Beijing, and the Art Museum of Fine Arts, Beijing, over the next three months. The exhibition will then return to the Art Museum of Fine Arts of the National Museum of Asian Art, Beijing, on March 30.\n\n\nThe Metropolitan Museum of Art (the museum) in New York has appointed Katherine Teitelbaum as its first director. She will be responsible for leading the museum through the completion of a comprehensive renovation—which will include the building of new exhibition spaces, an expanded library, and", "The next Biennial should take place at the König Stiftung in Cologne, Germany, in December 2020. Details about the date, venue, and other programming will be announced in the coming weeks.\n\n\nThe University of Illinois at Chicago has acquired the publishing imprint and website theposterousposterous.com, which is run by three people—Evan Wells, the creator of the ubiquitous Paleo; Brian Benford, a professor of art history; and Sam Gill, a curator of modern art and design—and will present a new exhibition at the institution in February 2021.The acquisition marks an important step in the institutions’ ongoing relationship with Dabbagh Jumpei, the pioneering director of the London-based Society for Visual Arts (SVA), which was founded by Jumpei and Eleanor Sims in 1973. The partnership was launched as part of a larger goal of establishing a creative model for the museum that would further the goals of the Pritzker Prize.“I’ve been excited to work with Evan and Brian for a long time,” Jumpei said. “We have a long history of collaboration, and I’m looking forward to continuing this relationship with their team, and their talented", "The next Biennial should be held in 2021 and will include twenty-three artists. The biennial is part of a larger revitalization initiative announced by the city of San Antonio in 2017, which also includes the construction of a new public art museum, the restoration of the city’s historic city hall, and the construction of a new public green space in the heart of downtown.\n\n\n\n\n\nHarriet Finney, an American artist, is currently the subject of a $75 million defamation lawsuit by the artist’s estate in New York City. The estate claims that the artist attacked its client in a letter dated March 3, 2018, that was distributed to the artist’s lawyer, Jay Rosenbluth, and other parties on April 4. According to the Art Newspaper, the letter threatened to settle disputes if the estate did not “accept ‘his or her choice’ as a matter of art.” The letter also stated that the estate was “trapped by a ‘choice’ and was not able to ‘turn back the clock.’”The letter, titled “Talking About Art” and dated March 30 to April 4, claimed that the estate was “tra", "The next Biennial should be on February 21-March 29.\n\n\nThe Spanish Ministry of Culture has awarded a UNESCO World Heritage site in the capital, Madrid, to an artist-founded institution in an attempt to promote the economic and cultural development of the region. The Ministry of Culture has named the institution the city of Zuniga de Garaña and the institution will be housed in a former barracks.Dubbed Zuniga Libreria (Zunigira) and led by architect Miguel Gómez, the exhibition will feature works by eighty-two artists from thirteen countries and will feature performances by choreographer Julieta Barcenas, painter Yelena Petrov, sculptor Thea Saarenko, and painter José Luis Pérez-Abreu. The work of the seventy participating artists is being curated by writer and curator Alejandra Pérez-Abreu.The announcement of the ten-person curators of the exhibition came in response to a question during the third edition of the San Sebastian Biennial, which was held in 2017 and was canceled due to the Covid-19 pandemic. The question concerned the idea of creating a new institution devoted to the history of photography", "The next Biennial should take place in the spring of 2021. The 2020 edition, curated by American curator and artist Nancy Antonelli, featured work by forty-nine artists and was held at the New Museum in New York from March 29 to March 31. The 2019 edition, curated by the same curator, was held at the Museum of Modern Art, New York; the 2018 edition, curated by the same curator, was held at the Los Angeles County Museum of Art; and the 2017 edition, curated by the same curator, was staged at the Museum of Modern Art.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is expanding its curatorial staff by ten members, bringing the total number of staff members to nineteen. The expansion, which will involve hiring more staff, aligns with the Museum of Contemporary Art strategies to grow its museum portfolio and will support both the institution and its audience by bringing more talent to the institution.In a memo sent to staff today, director Michael Govan wrote: “Over the last few years, we have worked hard to ensure that MoCA has the talent, resources, and understanding to support both our staff and our future. This expansion is a critical step in that mission.”The memo continued: �", "The next Biennial should be staged in April 2021.\n\n\nThe Solomon R. Guggenheim Museum in New York has appointed Trisha Brown as its new deputy director of curatorial affairs. Brown comes to the institution from the Metropolitan Museum of Art, where she has served as deputy director of interactive art and design since May 2019. She succeeds Mark Batson, who retired in May after serving as the museum’s director of international exhibitions and programs in July 2019, and will assume her responsibilities on June 2.“Trisha brings significant experience and knowledge to the Guggenheim’s curatorial practice, as well as a deep understanding of how cultural institutions—including the Met and the Museum of Modern Art—work to advance the work of the larger public,” said Guggenheim director Anna Lee. “In addition to her leadership role, she will expand the museum’s own understanding of contemporary art through a range of new programs that deepen the Guggenheim’s commitment to the public.”Brown previously worked in the museum’s curatorial department at the New York Public Library, where she worked closely with the Guggenheim’s Collections Department and helped launch the institution’", "The next Biennial should be launched in 2021, when the thirty-fifth edition of the Berlin Biennale will take place. Koenig will also lead the first group show dedicated to women artists in the German city of Kassel, Germany, which will be held in the spring of 2020. There is no word yet on whether she will direct the second show, which will be held in the spring of 2021. The first show, “Feminine in the City,” was organized by the artist group Tacita Cortés in May 2019 and was presented by König at the Berlin Biennale. It was a success, attracting twenty-two thousand visitors to the city of Kassel and the exhibition was included in the Berlin Art Fair in September.\n\n\nThe National Gallery in London has appointed Sarah Eidola as its new director, effective immediately. In her new role, which is funded by a £1.3 million grant from the National Lottery Heritage Fund, Eidola will oversee a major expansion of the gallery’s holdings of early modern European art. She will also develop curatorial and educational initiatives to support the gallery’s exhibitions of works by female artists, and will lead the museum�", "The next Biennial should focus on the circumpolar world of ideas, the new premises for the exhibition and the exhibition, the exhibition space and the collection, and the presentation of the work in a new way. We believe a combination of art and work should always be possible, and can continue to work for a new and evolving exhibition format.”\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed three new trustees to its board of directors: artist and philanthropist Jane Panetta; philanthropist and founder of the New York–based nonprofit Art of the Party, David K. Garten; and architect and professor Daniel H. Weiss.\n\n\nThe Public Art Fund in Philadelphia has received a gift of $243,000 from the Thomas and Lois Matsons, a family who have been involved in supporting artists for more than fifty years. The gift is the culmination of a three-year campaign to raise $4.2 million for the organization, which supports artists in the Greater Philadelphia area.“The gift is a great honor to receive such a significant gift from the Matsons, who have been supporting artists in our community for over fifty years,” said David H. Simon, chairman of the board of trustees and founder", "The next Biennial should be held at the Museum of Modern Art (MoMA) in New York in 2021. The museum has previously committed to rescheduling the event after the US presidential election, citing the threat that President Trump would dismantle the Affordable Care Act.\n\n\nArt historian and scholar María Berrío-Sánchez, the director of the institute of modern art at the University of the Arts Buenos Aires (UAB), has announced that she will resign from her post in February 2020 to pursue a teaching role in the city of São Paulo. Berrío-Sánchez, who previously served as curator of Modern Art at the Museu de Arte de São Paulo (MASP), was appointed director of the new UAB in September.“I couldn’t be more excited about the appointment of María Berrío-Sánchez. She has been a strong supporter of the Institute of Modern Art (IM), Brasil, in her many years at the helm of the institution and has been instrumental in shaping it into a modern art museum in the capital.”The Iberian American artist, whose work focuses on the origins and construction of social and cultural formations through the", "The next Biennial should be presented by the British Museum, London, sometime between May and November 2019. The exhibition will take the form of a biennial, but will feature an entirely new collection of works, with the works presented being works that have never been publicly shown in the United Kingdom.The exhibition will feature more than 200 works by contemporary artists living in the United Kingdom, which will be presented in a chronological order. The biennial will be organized as a series of installations, each lasting two months, with the first episode of the exhibition being “South Park: Inside the Biennial.” The exhibition will also include a discussion with artist Tanja Zielinski, curator of the UK’s first exhibition dedicated to women artists, “South Park: Women Artists” (2019).\n\n\nThe Canadian Museum of Fine Arts (CMA) in Toronto has appointed Sari Cohen as its next president and CEO. Cohen comes to the institution from the London-based firm Bechdel and Associates, where she worked as the director of contemporary art from 1996 to 2001. The curator, actress, and writer most recently served as the founding curator of the critically acclaimed “The Female Body” in 2000, which explored the relationship between body", "The next Biennial should be held in January 2020. “This year’s theme, ‘Love and Death: A Buddhist Perspective,” is a retelling of the truth of the sutra, which Prince visited as a child in Japan, and it will be staged at the Museum of Modern Art, New York; the Royal Academy of Arts, London; and the Museum of Modern Art, New York. The theme comes from the Merry & Peter, a 1967 painting by the Chinese artist Hu Jia, which depicts a young man and his mother sitting in a Buddhist monastery, gazing at the stars. The festival will also include the annual Sutra Society Awards, which will be presented by the Museum of Modern Art, New York through its joint partnership with the New Museum in New York, and the decoration of the Shanghai Art Museum, whose current collection comprises some forty thousand objects from China and from Japan. The award ceremony will be held at the Museum of Modern Art, New York, on October 30.This year’s Biennial has received a 2007 Hong Kong Art Award for Excellence in Arts and Culture, a 2009 Hong Kong Curatorial Award for Excellence in Arts and Culture, and a 2013 Hong Kong", "The next Biennial should aim to examine the biennial, its history, and what it means for the social, political, and spiritual life of the city,” Lukascu told the Art Newspaper. “I also want to build on the exhibition’s legacy by focusing on women’s issues, on non-European artists, and on artists who have not yet been given the chance to make their mark on the exhibition.”The next iteration of the Biennial will take place in 2022.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that Ben Hutchins & Haworth partner Todd Burroway has been hired as the next director of the museum. He succeeds David Hamilton, who departed the institution in March 2019 to become director of the International Center for Photography at the New Museum.“Todd’s appointment marks an exciting new chapter in our long-standing relationship with Hutchins & Haworth, and is a reflection of our strong vision for the future of photography at the museum,” said museum director David K. Gallen. “The potential for new and innovative photography experiences at MoCA is already strong, and with his appointment, Todd has the opportunity to further expand on that with", "The next Biennial should take place in 2022, and should be hosted by a museum that was built in the city of Biennale as well as by a private developer. The event will be curated by Haus der Kunst, and will take place in the city of Biennale-Bürenfeld. The theme for the first exhibition will be “The Future Is Present.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has removed a piece of artwork by Taiwanese American artist Chin En-Hung that was part of its exhibition “Sensate,” which ran from November 2013 to December 2013, from its website. The piece, titled Sissen Chi-yu, was part of a series about the civil rights movement that featured works by artists such as John Barlow, Hui-Chien Huang, and Win-Sie Hsu that were displayed in “Vision: Chi-yu” (June 2016), “Untitled: ‘Art’s Civil Rights Movement’ (2014), and “Ghost Stories: Chi-yu” (2015).A statement on the museum’s website said that the “movement’s line’", "The next Biennial should focus on the history of art and architecture in the city, including the history of the urban fabric, the history of urban planning, and the evolution of the city. “Art and Architecture: A History of Art in the City” will be presented by the Museum of Modern Art, the Louvre, and the Musée National Picasso-Paris in collaboration with the Düsseldorf-based studio Biennales.\n\n\nThe Museum of Modern Art (MoMA), the Museum of Modern Art, New York (MoMA) signed a fifty-year lease with the family of Thomas Jefferson that will see the museum’s permanent collection and collection of works into the future. The landmark arrangement, announced yesterday, marks the twentieth year that MoMA has hosted the fourteenth president of the United States.In a statement, MoMA said: “This is a very special year, for MoMA and the American people. The museum is reopening in July and the new president is in the process of restoring the institution to its former glory. MoMA’s lease with Thomas Jefferson is one of the most important historic relationships in American history. The institution now has a new lease of the museum, and we", "The next Biennial should cover the German Occupation, in which case the exhibition should move from the Museum of History to the Deutsches Kunstverein Berlin. A version of the exhibition, titled “Postwar” will also appear in the Museum of Art in Tokyo in the autumn of 2021.The new collaboration between the two institutions comes amid a fierce race for the hearts and minds of young artists. In a recent survey of the new generation of Berlin-based artists, Artforum editor-in-chief Jesse Ehrlich wrote: “If the Frieze Prize and the Fels Art Foundation, the Berlin Biennials, and the Lüders- und Kunstverein Berlin are any indication, the twenty-first century Berlin is rapidly becoming an art capital. The collaboration between the Frieze Foundation and the Berlin Art Museum, and the upcoming events in the two cities, are only the beginning of the many projects that will shape this city for generations to come.”\n\n\nHannah Barlow and Bruce Johnell have announced that they will be co-directing the 2018 edition of the Edinburgh Art Festival. “Bruce and I are thrilled to be working together again next year in partnership with Hannah,” blogger", "The next Biennial should showcase the contribution of the Muslim artist in the history of the art of the world; it should celebrate the creative life and the creative ideals of Muslim artists, emphasizing their role as a new modernity; and it should be an opportunity for the artists of the Muslim world to re-create their own stories. We are also eager to present the works of artists of the Near East as well as of artists from the Muslim world. “The work of these artists has been preserved in a way that is rare in the history of the art world: they have been given a place in our collection with great care and attention, and with the understanding that the exhibition would be a great asset to our collection,” said curator and chair of the exhibition, Lina El Khouri. “Their stories and their projects will be presented in their original form, and we hope that this exhibition will gain new insights into their lives, their practices, and their art.”The biennial will take up art from the Near East and will highlight the best practices and their artistic heritage in South Asia. The exhibition will also celebrate the cultural achievements and achievements of women artists of South Asia and the Middle East. The exhibition will feature ten artists", "The next Biennial should take place in Shanghai in 2021. \n\n\nThe New York City Department of Cultural Affairs (DCLA) has awarded $650,000 to twenty-five museums in the city, including the Metropolitan Museum of Art and the Museum of Modern Art, for their 2017–18 seasons, in an effort to help revitalize the devastated cultural district of East Harlem.Called the East Harlem Cultural District Initiative, the plan to divert funds from the city’s Cultural Fund toward museum construction and museum expansions was first announced in March 2019. The plan was shelved until the summer of 2020, when the DCLA received a request for proposals for the museum expansions. The agency awarded $275,000 in “institutional improvements” and $250,000 in “savings from the building of the Eastern Hudson Museum,” along with $150,000 in “savings from the building of the Metropolitan Museum of Art’s Metropolitan Museum of Art in Harlem.“The Metropolitan Museum of Art and the Metropolitan Museum of Art in New York are among the largest cultural institutions in the United States,” said Ken Scharf", "The next Biennial should be held in 2020. Those wishing to attend can book online or visit the museum.\n\nThe Pérez Art Museum in Buenos Aires, Argentina, has announced that it will close its doors permanently on February 26, 2020, in an attempt to reduce the risk of Covid-19 coronavirus infection. The Pérez Art Museum, Argentina’s largest arts institution, has hosted the annual Art Basel Buenos Aires (ABRA) fair—which was previously scheduled for March 23—since 2000. The fair, which has been held at the Pérez Art Museum since 2005, will be held at which is currently undergoing a $20 million renovation.Pace Contemporary Art, one of the United States’s largest arts organizations, is launching a new global online platform, the Pace Gallery, with a goal of connecting artists and collectors. The platform will offer free global viewing rooms and will aim to develop new online sales channels that will be powered by the Pérez Art Museum’s rich collection of contemporary art.The platform will be integrated with the Pérez Art Museum’s existing online store and will host live performances and other events such as auctions and photography exhibitions. The Turin-", "The next Biennial should be held in 2023. In an interview published in the September 2008 issue of Artforum, Phyllis Johnson-Kauffman, the founder of the nonprofit The Vitra Project, predicted that the project would open with a theme “On Values,” taking inspiration from Lacan’s concept of values as “ques collectively constituted by the unity of opposites.”  The first iteration of the Biennial will serve as a platform for both local and international artists. The second iteration will focus on “valuing life in a holistic and ecological way,” Johnson-Kauffman said. “We are eager to see how the two events intersect.”\n\n\nThe twenty-fourth edition of the Venice Biennale has announced that, for its next edition, it will hold in October 2020, the exhibition “Between Art and Life.” The event will take place at the Venetian shipyard in Venice, the Milanese city of Venice, and will run concurrently with the Basel Biennale in Switzerland and the Frieze London Biennial in London.“The Venice Biennale is one of the most important exhibitions in the world,", "The next Biennial should be held in December 2020. The Pavilion of the Two Sisters will be able to hold 25,000 visitors.The institution will also plan to add another exhibition space in the city for each of its six locations by the end of 2020. The new exhibition space will be built in a former textile factory, located in the city, and will seat between eighty and ninety people. While the exhibition spaces will be adjacent to each other, they will not be connected to the street or the public spaces of the city.The pavilion will be inaugurated with a major new collection of works by artists whose practice spans the globe. The exhibition will feature work by twenty-five artists, including FARAH ALI, Algeria, Valeria Arias, Brazil, Jorge Bisagal, Colombia, Diana Bonarà, Peru, Anita Bochereau, Malaysia, Adrienne Bottéro, Switzerland, Gillick Landry, Venezuela, Dina Zvezro, Larsen Mitter, Bolivia, Nora Papelli, Italy, Eugene", "The next Biennial should focus on historical narratives from the African diaspora, where the exhibition will be organized as a series of projects. The first episode, titled “Behind the Scenes,” will be held at the museum beginning in October 2020 and will feature new work by seventy-three artists, including Timur Beken, Anselm Kiefer, Deborah Levine, and Saro-Wiwa Nzimande. The second episode, titled “For the Future of Art,” will be held at the museum beginning in November 2020 and will feature new work by forty-nine artists from Sierra Leone, Liberia, and Nigeria. The final installment, titled “For the Future of Life and Art,” will be held at the Museum of Modern Art (MoMA) in September 2021.\n\n\nThe Metropolitan Museum of Art (MoMA) has appointed John Schlesinger as its next director. Schlesinger comes to the institution from the Museum of Modern Art (MoMA) in New York, where he has served in various roles, including director of public relations from 2015 to 2017 and deputy director for curatorial affairs from 2017 to 2020. Schlesinger’s first assignment will be to the West Coast,", "The next Biennial should have been held in 2021, but was pushed back to 2020 due to the Covid-19 pandemic. During the 2020 event, an exhibition “dismantled” the festival and featured works by twenty-one artists.The development marks a stark contrast from the Biennial of Modern Art, which launched in 2017 and was organized by the Warner Brothers Pictures company. It also follows the announcement of the designs-focused Frieze Sculpture at New York’s Museum of Modern Art, which was canceled in February 2019 and reopening in March 2020.\n\n\nGreenpoint, Brooklyn, has welcomed artist-run space the Studio Museum to Greenpoint in an ongoing project that aims to “reconnect the local community” and expand access to cultural and historical resources. The museum is planning to build a new thirty, two-story contemporary art museum designed by architect Herzog & de Meuron in the city’s Central Park. The undertaking will be funded by a $25 million donation from the Sacklers, who have given $50 million to New York’s arts over the course of the last twelve years, and will be completed in the spring of 2021.The investment will enable the Museum to", "The next Biennial should be held in 2022, according to Artforum. The festival is currently taking place in conjunction with Art Basel Hong Kong. The event is an annual fundraiser for the Hong Kong Biennale, which aims to raise $5.5 million for the festival. The seven-year event runs from March 7 to March 12, and will organize 135 performances. Todd Litman, president of the Biennial, said: “The theme of the year is ‘Vertical Futures,’ and we are really excited about the potential to engage with the current uncertainty of what will replace the Hong Kong region. The next Biennial will be an important step in shaping the current exhibition program and exhibition program as a global event.”\n\n\nThe National Galleries of Scotland and the National Galleries of Ireland have decided to merge, reports the Art Newspaper. The announcement means that the six museums will soon be housed in a single institution, which will be called the National Museum of Scotland, and will open to the public in 2022.The announcement follows an eight-year partnership between the two institutions. The National Galleries of Scotland is planning to move the museum from its current site in the city of Edinburgh to a new building in", "The next Biennial should focus on the ethics of violence and the materiality of the body, in order to draw attention to the processes of destruction and degradation in our society. ”The event will run from March 18 to March 20 and will be hosted by the Guggenheim in partnership with the biennial’s parent, the Italian city of Turin, and will be hosted by curator Antonella Sapienza.According to the organizer, the new initiative will begin with a question posed by the public: what is the 'spirit of the whole world?” The exhibition will ask: How can we come to understand the world as it is, without making the world into a museum of our own imaginings?The first exhibition will focus on the concept of a limiting self, the body, and the limits of the self, while the second will examine the materiality of the body. The show will be comprised of a selection of seventy-four works by forty-nine artists. The first half of the biennial, “The Body and its Limits”--which was organized by the Guggenheim in partnership with the Italian Association of Painted Women in 2009 and will open on March 21--will be on view until March", "The next Biennial should be held in 2021. The current exhibition is a series of sculptures made on a large scale by artists such as Peter Doig and Patricia Churchill, as well as by other thinkers such as Jean-Pierre\n\nThe Museum of Fine Arts (MFA) in Boston, which has been closed since March 13 due to Covid-19, is currently working on a new set of guidelines for artists exhibiting work in its upcoming exhibition “Hands Across Time: Art in Motion”\u0097which is scheduled to run April 7–April 10, 2021\u0097which will feature work by twenty-six artists, including Hao Jing, Maya Lin, and Nao-Lee Kang, and will run alongside the museum’s upcoming exhibition “Widths of Mind: Art in Motion”, which will be on view until October 4. The exhibition is part of a broader strategy to align its programming with that of the National Museum of American Art in Washington, DC\u0097which will host “The Future is Now” on April 14. “Across the Pond: American Art, 1960s–1970s” is scheduled to open at the Museum of Fine Arts on March 5, 2020.\n\n", "The next Biennial should include a discussion of “how cultural and social institutions like museums, art galleries, and curators’ practices can play a role in increasing the knowledge and understanding of the diverse, interrelated, and interrelated elements of our world.”\n\n\nArts workers in New York City have staged a massive strike for two weeks, from May 26 to May 29, in an attempt to secure higher pay and improved working conditions. According to Artnet, the strike, which involved more than 2,500 arts professionals, resulted from the management’s decision to reduce the hours of more than one hundred employees.The employees, who are represented by the New Museum, were seeking more than $5 million in back pay when they agreed to a three-month contract with the management team, which lasted from March 8 to March 10.“We believe that this contract violates our rights as employees, and we believe that it is part of a systemic, white-collar, and anti-worker strategy to discredit independent cultural organizations and drive down wages and working conditions,” said Andrew Selby, the executive director of the Museum Workers’ Union. “With this contract, the New Museum gives the workers below them the lowest possible starting", "The next Biennial should aim to address the problems of modernity through a radical rethinking of the notion of a future.”\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Loring Randolph as its next director. She succeeds Barbara Cooper, who has helmed the museum since 1974 and will retire in December 2020.Randolph comes to the museum from the Bronx, where she has served as executive director since 1999, and succeeds Susan DePalma, who retired in 2017 after twelve years at the helm of the institution. “We are deeply honored and gratified that Loring will assume the lead role of director of the Museum of Modern Art,” said museum director Thomas L. Friedman. “The appointment of Loring to the leadership role at MoMA strengthens our relationship with the Bronx and the diaspora throughout New York City, enabling Loring to serve as an active voice in the museum’s ongoing engagement with the history and culture of the city.”Cooper and DePalma have led the museum since 1998, when DePalma became director, when it relocated from its current location in Lower Manhattan to a new site in the Bronx. The move marked the museum’s first major", "The next Biennial should include the work of a selected group of contemporary artists, most notably Andrea Dwork, Alejandra Garaicoa, and Marta Cervetto. The 2018 exhibition, “Expansion and Change: Art in Transition” was staged by the Museo de Cultura Paz, and will open on December 28. Following a series of exhibitions at the Getty Center in Los Angeles in the late 1990s and early 2000s, the museum closed its doors in May 2003. The Gallery of Modern Art in New York staged an exhibition at the museum in 2004, and an exhibition of work by the artists who would become the first group to set foot on the island.In 2001, the Getty Foundation awarded the island a $20,000 grant for the construction of a biennial of work by the Salvador Dali Foundation. In 2008, a new biennial of work was assembled. A year later, the Getty Center in Los Angeles also received a $10,000 donation.\n\n\nThe Spanish Ministry of Culture and the Ministry of Education, Culture, Sports, Science, and Energy (CEM) are reportedly working together to create a new online platform that will bring together more than 6,500 curators, scholars, and artists", "The next Biennial should take place in the city in 2022.\n\n\nThe National Gallery in London has announced that it is planning to move the exhibition “Avant-Garde” from its location in the city’s Regent’s Park to a new location in a fourteenth-century Georgian mansion built in a Tudor-era building in Notting Hill. The exhibition will now return to the National Theatre in London for a twenty-second edition. The transformation of the National Gallery into a museum of the arts is part of the National Loteroy Collection, a major restoration project that was first announced in the summer of 2018.The National Gallery will restore the Tudor-inspired house in a Tudor-inflected master plan, using Tudor materials and incorporating a Tudor library and its archives and the National Gallery’s existing gardens. The new building will be designed by the architect Nari Ward, who also designed the nearby National Gallery of Art. The restoration project will cost approximately $3.3 million, with the National Trust contributing $800,000.“In order to create a more inclusive and engaging exhibition experience, we wanted to consider how open-ended the collection could become,” said Nara Parmar", "The next Biennial should be held in the spring of 2021. The exhibition will take up themes such as local memory, architecture, will and creation, and will include the work of twenty artists.Speaking to the Art Newspaper, artist Patricia C. Shoemaker, who was nominated for the prize and will receive a prize of $100,000, said: “I’m very excited about this year’s Biennial. The theme is so meaningful to me, and I’m very excited to work with my peers and to represent the city of Denver in this way.”The winning artists for the award are:AristotleSara-SuellenZoe, Kaja Nadeau, and Kelly StewartNora-Aly MessingerThe prize jury comprised artist, director, and curator John Schwalb, curator and cofounder of the Art Gallery of Denver, and artist and educator Rita Sanchez.\n\n\nThe Metropolitan Museum of Art is making some big changes at the institution in an attempt to cut costs and streamline operations while improving the museum’s environmental footprint. The proposals, which are part of a $1.7 billion restructuring, will include the construction of a new 55,000-square-foot", "The next Biennial should be held in 2022, Kremer said. In addition to the museum, the city also owns the property at 301 S. Ninth Street, which was acquired by the City of New York in 2016 for $1.4 billion. The museum will open in 2020 and will host approximately 6,000 exhibitions annually.\n\n\nFrench artist Marc Chagall, whose work combines abstraction and sculpture, has died at age sixty-two. His death was confirmed by his daughter-in-law, Annie Chagall, who said that the cause was dementia. The artist was best known for his work Constructivité (1942), an experimental, geometric sculpture that combines wood, fabric, and metal to create a living earthwork. The work has since been exhibited in the Venice Biennale twice and won the Prix du cinéma (in 1963) and the Prix d’Allemagne (in 1978) twice. In a statement, Annie Chagall said: “I am extremely happy that he is still alive and able to express his own artistic aspirations through such an extraordinary range of materials, and that he still has a quality of understanding, insight, and creativity that he never lost.”Among Chagall’s many", "The next Biennial should be held in 2022, with the date to be rescheduled in 2020. The first exhibition, “Berlin: Issues 1900–2000” (2016–17), was held in the German city in March 2019. The second exhibition, “Berlin: Issues 1995–2007” (2019), was staged in September 2019, and the first exhibition, “Berlin: Issues 2009–2015” (2019), was staged in May 2019. The $250,000 prize, which was established by the German government in support of the cultural sector, also funds projects that address the gaps and inequities that affect German cultural producers particularly hard: arts workers and producers of visual arts, musicians, and the visual arts. This year’s prize jury was made up of Melech, Mikel Leichhardt, Alberto Catellani, Marcelo Cipolletta, Lorena Lachey, Gregory Pincus, Alexander Potemkin, Michael Spahti, Cara Strasser, Katherine Tzemm, and Cindy Wood.\n\n\nChinese artist Zhang Yaxuan, whose surreal, psychedelic", "The next Biennial should take place at the Art Gallery of Ontario in Toronto in 2021. Its inaugural exhibition will be the “sociology of art: how art and architecture are connected.”\n\n\nThe National Gallery of Canada in Ottawa announced today that, beginning in 2021, it will no longer be able to collect the works of Canadian-born artists. The institution has been working with the Canadian artist and scholar Hélène Atget on the exhibition “The Future Is Not What It Used To Be,” which will open at the gallery in 2021. The exhibition will include four pieces, each of which was created by an immigrant, which were donated to the museum.The National Gallery of Canada will now be able to present a “plurality of artists” exhibition, which was previously held in 2018, in 2021. The 2019 exhibition, “The Past Is Present,” was curated by the artist Laura Owens, who immigrated from New York to Canada from 1943 to 1948. The exhibition was also the first to explore the idea of an “immigrants gallery,” and the first to feature work by an indigenous artist.The National Gallery’s director, Meri Nakoula, expressed the", "The next Biennial should be held in the spring of 2022.\n\n\nThe Winnipeg Art Gallery (WGA) has appointed Anna-Sophie Courville as the next director of the institution. She succeeds Jane Panetta, who has led the gallery since 1996, and will begin her position in January 2021. Courville comes to the WGA from the Andy Warhol Foundation, where she served as deputy director since 2007. She was previously associate curator of modern art and sculpture at the Museum of Fine Arts, Boston, and is currently a curator at large. “In her new role, Ms. Courville will continue to develop the gallery’s collection of contemporary art and to support the ongoing work of our distinguished curators, including Alain Guiraud and Daniel H. Klein, and I welcome her to the staff and I look forward to working with her,” said WGA director and CEO Carolee Steeves. The WGA currently has two other directors: Renaud Mary-Landau, who is responsible for the collection of works by Marcel Breuer, Richard Diebenkorn, and Peter Hujar, and Gwen Tarrant, who will assume her responsibilities in the spring.\n\n\n", "The next Biennial should be up in 2021, with the first edition taking place in 2021. \"Themes of beauty and Americana are central to our daily lives and, as such, we are tremendously excited to collaborate with the artists and designers who have made such a significant contribution to the history of contemporary art.”The biennial will also expand upon the   Curator’s Studio, a collaborative space that will focus on the art of American art, and will present artworks in houses, cities, and locations that are currently understudied, and will present works under the directorship of museum directors. The 2019 edition, titled “The American Art of the Past,” was staged at the Museum of Modern Art (MoMA), in New York; the Art Institute of Chicago; and the Museum of Contemporary Art (MoCA), in Los Angeles. The exhibition was curated by Bob, Cara, and Tracy L. Smith.\n\n\nYale Art Museum curator and Sisseton native Rachael Bostwick has been hired as the next director of its Center for Art and Art History (CAMP) in Seattle. Bostwick succeeds Deborah Boone, who departed the institution in August 2019 to head", "The next Biennial should be released in 2020, but this will be the first time that the city has staged an exhibition devoted to a living artist. The exhibition will include works by forty-three artists, including Sadegh Faroozi, Sara J. French, and Sara J. Petrillo, and will also mark the opening of a new public museum dedicated to the history of photography in the city. The venue will also have an exhibition “between artist and museum’s relationship,” Saniwa said. The exhibition will be among a number of exhibitions organized by the city as part of the Global Arts and Culture Week\u0097which will run from March 12–March 13, 2020. The city is also planning to host two additional exhibitions this year.\n\n\nArt historian Mark Weisbrot, who founded and spearheaded the nonprofit ArtPlace in New York in the 1980s and helped establish the city’s Museum of Modern Art, has died at age eighty-five. He was one of the earliest and most important supporters of the central tenet of art history that a museum should not be commercial. Weisbrot was a fellow of the American Museum of Natural History in", "The next Biennial should take place in 2022. The first edition, titled 'Imagination, Peril, and Despair: Art and Violence in Contemporary Art, 1929–1938” was staged in New York in October 1929. Its (unintentionally) truncated, three-day event, “What Is Art?,” featured thirty-eight works by seventy-two artists, including Anselm Kiefer, Judith and Olivier Messia, Elisabeth Künstler, and Catherine Marie Malandrino.\n\n\nThe Metropolitan Museum of Art in New York has received a gift of twenty-seven works by photographer Diane Arbus from the estate of Edward and Editha Arbus, the great twentieth-century parents of American photography. The works, which include works from the collection of Diane Arbus, Edward Arbus: The Art of Photography (1958), and The Bird in the Sky.The gift includes twenty-six works by Arbus’s avant-garde group photographing in the 1960s, including Ellsworth Kelly’s Last Man (1969), Robert Irwin’s The Bird in the Sky (1973), and Doug Aitken’s The Shortest Distance (1983", "The next Biennial should be held in 2020. \n\n\nThe Metropolitan Museum of Art, the Museum of Modern Art, the Museum of Contemporary Art, New York, and the Whitney Museum of American Art in New York are among the major art institutions working together to create a new public space in the heart of Manhattan in an effort to combat the coronavirus.In a joint statement, the museums said they reached an agreement with the city of New York on the construction of a new public plaza that will feature galleries and will be inaugurated by a grand opening celebration on Saturday, September 6. The plaza—named for the city’s artist-in-residence, Walter De Maria—will be located on West Twenty-Second Street between Ninth and Tenth Avenues and will be designed by the firm CAA Group.The New York City Council approved a $3.5 billion budget for the 2020 fiscal year, which includes $1 billion for the public health emergency response fund, $900 million for the city’s public works budget, and $200 million for the arts. New York state has allocated $5 billion of its own for the fiscal year, which will run through March 31, 2021. The city budget also includes $300 million for special projects", "The next Biennial should also aim to draw attention to the ongoing displacement of indigenous populations in both India and Indonesia by industrialization and climate change. Art historian and researcher Brandi Chiu, who curated the last edition of the Fifty-Sixth Venice Biennale, said: “It is essential that the next edition of the Venice Biennale be directed specifically at the indigenous peoples of South-East Asia, and should include their voices.”\n\n\nThe London-based nonprofit Art Fund has launched an initiative that aims to centralize financial support for artists and small arts projects in the United Kingdom. Over the next two years, it will award $3.5 million to tens of thousands of creatives and small-business owners across the United Kingdom through a combination of grants and direct financial support. The initiative was inspired by a post on the Artforum by actor Andy Blum, who asked, “How do we support artists and small businesses in this uncertain economic climate? A number of artists have created microgrants and give out projects that are designed to address the immediate needs of artists. How do we support projects that are meant to last for years or even decades?”Through a partnership with the National Youth Council, the", "The next Biennial should take place in the autumn of 2020.\n\n\nThe third edition of the Edinburgh International Biennial, “Data and Design: Design as a Resource for Society” will be held at the Edinburgh Art Museum from September 17 to September 20, 2020. The event will focus on how design and data can be used to enhance and extend the work of art. The first edition, which was organized as a collaborative project between the Edinburgh Society of Arts and the Edinburgh Festival, was held between October 1 and October 9, 2020.“The Edinburgh International Biennial is a carefully selected collection of writing on the art of data and design, and an opportunity for visitors to explore the breadth of digital and design studies,” said Nick Mullane, director of the Edinburgh Art Museum.The 2019 edition of the event, which was led by Joachim Neugroschel and assembled by artists, will feature three exhibitions, “Data, Design, and Data: Reflections on the Art of Data” (2019), “Better to Move: Architecture” (2019) and “Data, Design, and Data: Design in a Time of Uncertainty” (2019). The 2019 edition of the biennial was also", "The next Biennial should take place in 2021. The dates for the first Biennial were also announced on October 30, 2021.The second exhibition, which will take place at a new venue in New Delhi in 2022, will be the first in the city in over a decade. The exhibition will be led by a team of curators led by Phyllis Benatar and will showcase a mix of works by emerging and established artists. The exhibition will also feature an exhibition of works by new and returning artists\u0097Mukesh Bhardwaj, Rajiv Bhatt, Hao Fang, Josh Graf, Mo Heng, and Chia-Wei Huang\u0097and will run for twelve weeks.\n\n\nThe Pérez Art Museum Miami has announced that it is now offering free admission to visitors on weekdays from September 10 through September 14. The admission policy change was made following a $50 million expansion and renovation project, completed in 2018, that added a new building, a new museum, and a symphony hall. Inaugurating the expansion, the Pérez Art Museum Miami also changed the name of the institution from the Pérez Museum más important for the museum to Pérez Arts, a newly renovated and expanded J", "The next Biennial should be held in February 2020 and will feature work by twenty-nine artists from twenty-six countries.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Christine A. Rosenblum as its next executive director. Rosenblum is currently the deputy director of the Hadley Gallery in New York, where she has served in various leadership and curatorial roles since 2012. Previously, she worked as a curatorial assistant at the Museum of Modern Art and helped organize the exhibition “Postwar: The Art of the End” (2017) and “Theoretical Art of the Modern World” (2016), among other shows.“Since returning to the Hadley, Rosenblum has systematically and successfully navigated a number of different trajectories, developing new programs and programs for the museum and expanding our collection,” said director Christopher Bailey. “Her performance in the role of interim director demonstrates her ability to be a driving force in the museum, both as an individual and as a team member. She is an outstanding leader, and we are deeply committed to supporting her and raising the level of quality and visibility for MoCA’s programming with her vision and talent.”Rosen", "The next Biennial should take place in 2021. It is important to note that this is only a preliminary design. The commissioning of a new sculpture for the exhibition will mean a rethinking of the entire programme, and the exhibition will move ahead at a faster pace. The 2018 Artfest was held in a completely different location, and the next edition will be held in the same venue. The organisers are also considering the construction of an additional exhibition space within the museum that would carry out an extra symposium, as well as the renewal of the exhibition programme. “In an age of constant change and disruption, it is timely to reinvigorate the biennial and to create new challenges for the exhibition,” said Jørgen Fredriksen, chair of the commissioning committee.\n\n\n\n\n\nThe National Gallery of Art in Washington, DC, has received a gift of seventy-two photographs by American artist Charles White, who passed away on April 4 at the age of seventy-five. The work is the first National Geographic Society gift to the institution since 1972. In addition to White’s photographs, the institution received two sets of photographs by the artist and two sets of photographs by his daughter, the late", "The next Biennial should take place at the London location from March 25 to March 27, 2020, and will include the first-ever performances and events in the United Kingdom, with a goal of developing a new narrative of HIV/AIDS from a 'straightjacket' in the late 1970s to 2020, and will be held in the city from March 22 to March 27, 2020. The 2020 event will be the first time the Biennial will actually be held in the UK, and is being organized by the London-based artist-run nonprofit London Biennale, funded by the Doris Duke Foundation. The commissioning of the artist-run organization was led by David Foster, the director of Tate Britain, who said: “London Biennale has been an extraordinary collaboration that has produced something extraordinary. The next edition will bring you the work of a group of extraordinary artists. We are so proud of their work and of the work they have done to bring it to life. We thank them for their service. We are looking forward to working with them again.”\n\n\nAn eighteen-foot-tall, seventy-one-foot-wide bronze sculpture made of black-and-white photographs by Robert Mapplethorpe, one", "The next Biennial should begin soon and will feature work by sixty artists, including Shelly Guadagnoli, Jacob McGarry, and Mervyn Levey.\n\n\nThe Structure of Art, 1912–1940, a new exhibition organized by the Museum of Contemporary Art Denver, has announced its representation of James A. Farish. The American artist, who, in recent years, has focused on form and color in experimental and experimental mediums, died in New York on May 7.Born in New York City in 1941, Farish, who was working as a street artist before he was drafted to the Navy in 1962, grew up in the city and attended the School of the Art Institute of Chicago, where he studied with Joseph Beuys, who became a mentor to Farish and later became a major muse for his signature paintings. Farish moved to San Francisco in the late 1960s and worked to establish his own practice, which culminated in the 1980s with his iconic 1972 show, “Street Level,” at the city’s Museum of Contemporary Art (MoCA). After a brief stint as a curator at MoCA in 1987, Farish returned to Denver in 1988 and began a series of experimental exhibitions that explored the promise of", "The next Biennial should take place at the Coachella Valley in California, and the first will be held at the Marvin Gaye Museum in California. The next three years will see the completion of a major renovation of the Museum of Modern Art in New York, which will include the installation of nearly five hundred works by experimental artists, including an exhibition of work by British painter Thomas Henry Higgins.The $100 million redesign of the Tate, which was announced in January, has been in the works for some six months. Since the first iteration of the works kicked off in 1989, the Tate has undergone a number of revamps, most recently with the reopening of Tate Modern in London in 2020. The Tate also announced that it plans to reopen in 2024, but only if the government agrees to extend the life of the contract for the works by the artist-run nonprofit group Biennale London. The government has made it clear that it does not want to extend the contract and is considering other options. In the meantime, the works will remain in storage and will be moved to a museum where the government will keep them for future reference. The Tate has also been working on a redesign for its London exhibition space, which was commissioned by David Blaine and incorporated a", "The next Biennial should be in 2022, and the show will return to the Museums in 2020.  \n\n\nThe Portland Art Museum (PAMM) in Portland, Oregon, has awarded American artist Quina Dinh a $2.5 million commission for a new series of works by the artist in the United States, which he is currently creating from his photomontage style of painting. Dinh, who is best known for her sculptures that combine print and video, has been featured in shows at the Museum of Modern Art, New York; the San Francisco Museum of Modern Art; and the Museum of Contemporary Art, Los Angeles.“Quina Dinh’s photographs are work of extraordinary beauty and intelligence, their compositions engagingly composed, their lines elegantly geometric, and their compositions intricately sculptural,” said museum director Kim Bursky. “In a time when we constantly monitor our social media and our surroundings for signs of danger, we tend to focus on the physical to achieve our inner hero and these images are a striking reminder of how much more we as a society need these kinds of people to guide us through our everyday lives.”The artist currently has one of her final commissions in the works", "The next Biennial should convene in Florence in 2022, and in 2021 the institution will hold a ten-day, triennial exhibition of works by artists spanning the twentieth and twenty-first centuries.\n\n\nThe United States Holocaust Memorial Museum (USHMM) in Washington, DC, has received a gift of twenty-one works by artist and activist Alla Nurugba, better known as the Black Mother of Nairobi, which were donated by her daughter, Alla Nurugba, to the institution in 2017. The works, which were acquired through a multi-million-dollar loan, were gifted by the Nairobi-born artist and activist in recognition of her activism for Black liberation and political causes.“The museum has been working with Alla Nurugba for years to secure the full acquisition of her works,” said Michael Rosenblum, the museum’s director. “We were thrilled to receive these works in 2017 and continue to work with Alla Nurugba to help her to secure the museum’s collections in important works. We thank her for her efforts and hope that this gift will help the museum to make a meaningful donation to the USHMM.”In addition to the works,", "The next Biennial should be in 2020.\n\n\nThe University of the Arts (UWA) in Canberra, Australia, has released the results of a survey of the campus. The survey found that one in ten students will not attend the next Biennial, which will take place at the university in 2021.The poll, which was conducted between April and May and involved a representative sample of students at both the university and the University of New South Wales (UNSW) in Canberra, found that: • 75% of students, from all walks of life, would not participate in the biennial; • 62% of students say they want to see the next iteration of the exhibition, which will be organized as a series of talks around various topics; and • 53% believe that the art is misrepresented. The survey results are the latest to show the extent of the challenges facing the institution as it works to integrate art and innovation from all over the world.In March, the school was forced to remove an exhibition of new work by Australian-born, New York–based artist Luke Bushman, who died in 2016, from its website after it was mistakenly labeled a “dangerous crime” by the Australian Federal Police. His exhibition, “Unt", "The next Biennial should be in 2021. The 2019 edition was held at the Kunsthalle Basel and featured works by Sylvia Blesener, Rory McAuley, Sarah Barozzi, and Deborah Hutton. The biennial was marred by technical issues and political unrest, but the organizers said that it should have been a success. “We are really, really sorry that the event was not as successful as we had hoped,” Arianna Pradhan, the General Director of the Art Institute of Chicago, told the New York Times. The institution has since been renamed Art Basel and has been in the works of relocating from its current home in the 600,000-square-foot Stedelijk Museum in Amsterdam to the new 7,200-square-foot space at 43 Köln Street.  The event will now take place at the new Kölnischer Kunsthalle, which will be inaugurated by a new exhibition of work by artists such as Anna Atkins, Paul Gauguin, Robert Irwin, and Ed Moses.The rearrangement of the exhibition was made after Art Basel moved from its current site in the basement of", "The next Biennial should be held in the spring of 2020. \n The New York City Department of Cultural Affairs (DCLA) has revealed that it plans to phase out the city-owned Confederate Monument in the city’s financial district, in an attempt to give New Yorkers more space to meet their cultural needs. The decision was made in light of new guidelines issued by the mayor on October 23 that outline how public spaces can be made more accessible to the public, including through the installation of benches or other public artworks.A statement issued by the city on October 26 said that the monument—commissioned by a group made up of New York City historians, civic leaders, and individuals who have donated their time, labor, and materials to the city’s preservation and development—was “placed at a critical juncture in our city’s history, with the arrival of three important groups of African Americans, the first group of African Americans in more than 150 years, the second group since 1941, and the third group since 1993.”The statement continued: “In light of these developments, the DCLA decided to remove the Confederate Monument from its site and move it to a less visible location in Midtown, where it can", "The next Biennial should be held in 2021.\n\n\nThe Fine Arts Museums (FEMM) in London are planning to collaborate with the Tate and the National Portrait Gallery to present a series of exhibitions dedicated to the works of two artists, the artist Stella McCartney and her longtime collaborator David Salle. The two were celebrated in the annual exhibition “Stella and David” (2016–17), which was staged by the Museum of Modern Art and the British Film Institute, and were included in “The Rise and Fall of Pablo Picasso” (2017), the first major exhibition dedicated to the artist’s work. The shows were co-organized by the artists’ collective, the production companies and the National Portrait Gallery (NPG), and will feature work by the artists from the exhibition, “Esther Sculpture Garden,” which opened at the Tate in London on March 13, and “The Family: The Artists and the Family Life of Melanie Phillips,” which will open at the National Portrait Gallery in London on October 11.During the exhibition “The Family,” the artists depicted the lives of four generations of the artist, including photographs of the artist’s children,", "The next Biennial should be held in 2019. The institution had hoped to have the exhibition completed by May 2020. The Biennial will also be staged in the United States, Australia, and Germany.\n\n\nThe Latin American Foundation José Pires has voted to pull its funding from the Metropolitan Museum of Art in New York City after it failed to act on the organization’s request for funds in a matter of days. The decision follows a report that found that the museum failed to accurately report the expenses associated with the construction of a new institutional research library.The organization was granted $3.8 million to tackle the construction of the new library in 2016, but it stated that it had reported the costs to the Met for only $1.8 million—a discrepancy that led the foundation to withdraw its $1.5 million grant in January. The decision also cited the Met’s failure to address the issue of overbooking as one of the reasons for the shortfall.“I’m deeply concerned by the lack of progress that has been made,” Pires said in a statement. “We are hopeful that the Met will take these actions in order to clear up the situation and ensure that this never happens again. We hope", "The next Biennial should be held on a location that has recently been renovated (e.g., the new museum in Washington, DC), and the first exhibition should be an exhibition of the artist’s body. Aristotle also recognized the beauty of the human form under the sun, and expressed his hope that the museum would become a center for the study of the virtues of beauty. Remarking on the ancient Greek art of the same name, which was displayed in the exhibition “Uncanny,” the museum’s director, Hernán Díaz-Villar, said: “The idea of a museum dedicated to the body is very dear to me. I hope we will find a good site for the exhibition in a good neighborhood.”\n\n\nThe Metropolitan Museum of Art (the museum) in New York City has approved a new set of guidelines for the display of works by artist-in-residence Robert Irwin, who has been absent from his hometown of Chicago since March 18 and has not returned since March 13. The guidelines, which were issued by the institution’s Art Deco board of directors in a meeting on Tuesday, decree that works’ display “in a way that maintains", "The next Biennial should feature a program of interdisciplinary research on shifting ideas of art, from Shih Chien Lin (1925–1996) in the American West to Sol LeWitt and the global contemporary, from the American West to the Global South. In the future, the exhibition should draw attention to the development of new forms of conflict and conflict resolution through the art of the contemporary. \n\n\nThe National Portrait Gallery in London and the Royal Academy of Arts in Manchester have announced that they will collaborate on a new National Poem Book, which will address a range of themes and themes in an effort to bridge the gap between the country and its environs. The project, titled National Portrait, will be organized as a biennial and will be presented by the Royal Academy of Arts in partnership with the National Association of Art Museum Directors (Nama). The Royal Academy of Arts is the national governing body for the Academy of Arts, which comprises thirty-six museums in the United Kingdom. The National Poem Book is a collection of thirty-seven poems, some of which have never been published, and will be published in 2020. The partnership between the National Gallery and the Royal Academy of Arts is a continuation of Nama", "The next Biennial should focus on “synthetic biology”\u0097a theme considered at the time to be particularly relevant to the current crisis,” said Anne-Marie Currier, director of the Biennial de Clermont. For the first time, the Biennial de Clermont will be organizing its annual “nude painting” exhibition, which is currently on view until September 30. This will include twenty-six works by eighty artists. “These chosen artists represent a remarkable range of artistic practice and they represent a variety of goals and approaches,” said Artur Jansa, the president of the Biennial de Clermont. “The Biennial de Clermont is proud to present them, each artist and their influence, to the public. They symbolize the future and the past together.”The gallery will also present a collection of fifty works by the artist’s children, Aline, Iwan, and Tadao; fifty works by artists from the former Ottoman Empire; and twenty-one works by indigenous artists from the Andean region in the Andes; as well as a selection of social and political works by the artist’s grandchildren.", "The next Biennial should include a new model of the museum that will allow the institution to continue to thrive in a rapidly changing contemporary world and will aim to address the legacy of the museum and the city of El Sereno. “We are very much looking forward to the Biennial 2020,” said biennial director Cristina Calzadilla. El Sereno is currently undergoing a major expansion that will create a new site for the museum, a new institution building, and new galleries. The new structure will be completed in the summer of 2022.\n\n\nThe Los Angeles County Museum of Art (LACMA) has announced that artist and educator Michael Jordan is the recipient of the $10,000 Michael Jordan Artistic Award, which was established in 1979 to recognize outstanding achievements in artistic practice. Jordan is the author of the forthcoming book Michael Jordan: Artistic Genius, which is scheduled to be released by Simon & Schuster in the spring of 2020.“With the launch of the Michael Jordan Artistic Award, Michael Jordan has become one of the most recognized international figures in the arts,” said LACMA president Bernadette King. “The award recognizes his extraordinary artistic achievements and demonstrates LACMA’s", "The next Biennial should be completed by the end of the year, and the official launch of the exhibition should take place within the next three years.The exhibition will be divided into thirty-two sections, each comprising three artworks, which will be selected from a list of twenty-five artists whose work is included in the exhibition. The exhibition will be curated by a group consisting of Ermane Erp and Jill Hatfeld, and will be organized as follows:Self-portraitSelf-portrait: Léger le monde - François-Xavier HuygheSelf-portrait: Léger le monde, 1870Self-portrait: Léger le monde, 1919Self-portrait: Léger le monde, 1921Self-portrait: Léger le monde, 1931Self-portrait: Léger le monde, 1962Self-portrait: Léger le monde, 1966Selig: Autobiéres: Léger le monde, 1927Selig: Autobiéres: Léger le monde, 1987Self-portrait: Léger le monde, 1957Self-portrait: Léger le", "The next Biennial should take place in 2020.\n\n\nThe Los Angeles–based nonprofit the Forever Project, which seeks to bring art and cultural heritage exhibitions and performances to Los Angeles County and is led by artist and philanthropist Frances Washington, has won the 2017 Pulitzer Prize in criticism. The prestigious award, which honors an artist or cultural organization for creating an ongoing, meaningful, and creative work, was presented by Pulitzer Prize–winning author Philip Kennicott.The Pulitzer committee, which has nominated a Pulitzer Prize–winning artist or group for the award since 2001, selected the Forever Project, whose first exhibition, The Trouble with Tribes, opened at the nonprofit on September 21, 2017 and ran through the end of March. The next edition of the award, The Problem with Tribes 2, will be presented at the nonprofit on September 26.The organization will receive $50,000 in support of the first iteration of the award and will also receive an additional $25,000 for demonstrating the effectiveness of its work in promoting awareness of inequality and racism in Los Angeles.The committee’s 2017 nominee, the late artist and activist Vinnie Bagwell, died in 2014 but continued to work with Forever Project. The shortlisted artists include the Rev. Al", "The next Biennial should be held at the Art Institute of Chicago, which will open in 2021, as scheduled. The next show will be in 2022. The museum’s director, David Bonderman, called it “a great honor” to have the biennial created by the company that runs the Chicago Art Institute and the Illinois Institute of Art: “The new partnership creates a new platform for the collection and exhibition of the museum’s art at the new northern campus of the Chicago Architecture Center, which is expected to open in 2023.” The new program will consist of seven exhibitions, each in its own right, and will be hosted by a curator or a patron. “This is a very special moment for the Museum of Modern Art, the world’s leading modern art museum,” said David Samson, director and CEO of the museum. “In more than fifty years, the museum has become known for its breadth and depth of collections, its global reach and its increasing commitment to the study of American art and its international exhibitions. The new partnership with the new museum should make for a challenging time for the museum, a rare opportunity for the fans and the visiting public.”\n\n", "The next Biennial should be held on April 19, 2020. \n\n\nThe Australian Museum of the Great Art (A.M.G.A.) has announced that it will collaborate with the Museum of Contemporary Art (MoCA) in New York on a new series of exhibitions, “The Art of Art in the Age of Mechanical Reproduction” (T.A.I.R. ), which will focus on the history and modern conception of the art world through the lens of the current technological revolution. The exhibition will focus on long-held ideas about the aesthetic and social dimensions of art, as well as its relation to technology and the environment.“The A.M.G.A. is committed to engaging with and discussing issues that explore the ideas, theories, and practices of the greats such as Matisse, Tolkachev, and Edouard Vuillard, and to supporting these in their work,” said museum director Joseph H. Kennedy. “We are grateful to the MoCA community for its enthusiastic support in bringing this exhibition to fruition and further appreciate the many exhibitions and large-scale activations that have benefited from the work of these curators.”The new exhibition will open on May 5 and", "The next Biennial should aim to build on the exhibition’s legacy by including practical activities that have been performed in the exhibition space by artists and institutions from the archives of the following biennial: 1995’s Biennial of César Morales. The exhibition’s first collection, “The Zone,” will be on view until November 22.The exhibition will begin in the José María Otero Gallery in Madrid on October 28 and run through November 22. \n\n\nThe Metropolitan Museum of Art in New York has appointed Emily Miller-Reeder as its first director. Miller-Reeder comes to the institution from the London-based firm M Choe which has previously helmed  the Schuylkill Biennial and the Metropolitan Museum of Art, where she has served as chief curator since 2015. Miller-Reeder will assume her new responsibilities on January 9, 2020.“The Met has been and will continue to be a critical and compelling force in the art world for more than forty years,” said Juliette Fimrite, director of the museum. “Emily embodies that spirit, her presence, her energy, and her ability to push through the ruts and obstacles that", "The next Biennial should take place in 2021, and the 2020 edition will be followed by a new edition in 2022. The Melbourne-based firm will also create a new digital platform for experimental art that will be hosted on the artist’s website and will collaborate with curators and art historians to inform the exhibition.\n\nThe second edition of the Royal Academy of Arts (RA) in London, curated by Sol Campbell, will be held in October 2021. The event will include fifty artists, including the American artist Maren Ade, who was chosen by a jury comprising Matilde Wichæi, the director of the London-based Center for Contemporary Art, and Deborah Black, and will be hosted at the Royal Academy of Arts.The 2019 edition, “Human and Material: Design and the Modern Imagination,” attracted twenty-six artists, including Iceland artist Þór Jónasson, whose large scale works are meant to evoke themes of the British industrial revolution and labour and who renders objects as if they were made by hand.The event will also likely be a major step in the museum’s development as an international cultural destination, established in 2014, in a city that has a substantial international art history. “It", "The next Biennial should be held in the autumn of 2020. The museum has not yet commented on the possibility of a 2021 date.\n\n\nThe auction house Lisson Gallery in New York has won an important six-figure contract from the Metropolitan Museum of Art. The two parties have agreed to jointly develop a new exhibition for the museum. The contract, which was awarded in April, will be funded by the Met, and will open to the public in October 2020. Franz Loeb, the director of the New York gallery, which was approached by the museum to develop a new show for its collection, said: “This is a historic moment in our history, and we are thrilled that, in partnership with the Met, we will bring you a new exhibition at Lisson in the fall of 2020. The show will be a celebration of the museum’s major collections from the last twenty years, including three exhibitions dedicated to pieces that were on display in the gallery’s founding year, ‘14–16, and a dedicated presentation of works from the museum’s collection in the fall of 2020.”The Met, which has a long history of partnerships with cultural luminaries, including Anna Atkins, Dwight Yoakum, and", "The next Biennial should be held in 2020. The Award, organized by the Fundação Nacional de Arte Contemporáneo (FNAC), is a national award given by the Fundação Nacional de Arte Contemporáneo (FNAC), which supports contemporary art and is sponsored by the state of Minas Gerais. Previous winners include David H. Derrida, Matisse, Tuthmacher, and van Gogh.The winner, which was selected by a jury comprising Rodrigo de Castro, the president of Brazil; Minako Karô, the head of the state of Minas Gerais; and artist-activists and collectors Luciano de Pereira, and Aeneaso Falanga, will each receive a prize of up to $600.\n\n\nThe City of New York announced today that it is planning to open to the public the museum’s permanent collection of works by the late British photographer Barbara Streisand, who has been listed in the catalogue as one of the twenty-five artists whose work will be included in the city’s upcoming reopening. The exhibition, titled Barbara Streisand: Undeniable, is expected to", "The next Biennial should be held in 2020. \n\n\nThe first year of a new design program at the Festival has announced that it is working to move from a two-year cycle to a yearlong cycle. The change has been made in order to push back the start of the festival by one year, which is now slated to kick off in January 2020.The new schedule will take the form of a “statement of purpose,” according to the Brooklyn-based artist Joan Atwood’s description of the program. It will break down the biennial into twelve sections that will each run for twenty days, with the first day dedicated to “distancing and connection,” the second day dedicated to exploration of the ‘indigenous body,’ and the third day dedicated to creativity and innovation. The full list of participating artists is as follows:Adam Kadmon, Brooklyn, NYJuan Gonzalez-Villar, Los Angeles, CAKARA Singh, New Delhi, IndiaAnneliese Léger, New York, NYCharles M. Kates, New York, NYSusanne Suttner, MOSCOW, RussiaLaurie O’Leary, New York, NYKatelyn Par", "The next Biennial should take place in the German city of Munich in 2022. The 2019 event, which centers around the construction of an ambitious new museum, marked the first real attempt by the artist to commission a work for the inaugural edition.The biennial is the work of a group of artists that comprises Andrea Bertolini, Sigrid Stoltenberg, Nima Soltan, and Yasmin Haiduk. Of the three groups, the Italian-born Bertolini and the Dutch-based Soltan were the most successful. The latter has been working on his 75-mile-long, 70,000-work, which will be located in the city of Bonn and will be open to the public as part of a major renovation project.Haiduk, who was selected to the triennial in April 2019, is known across the world for his large-scale installations, which often feature works by more than a dozen artists in a single show. An international retrospective of his work was organized last year in Chicago and will take place here in 2022.The 2019 edition was organized by the Berlin-based Düsseldorf-based artist and curator Hans Joachim Winter, who has represented Germany at the Venice and the Milan Bienn", "The next Biennial should be held in 2020.\n\n\nThe museum’s collection of fifty-three works by the Pérez family, including the Mural of the Theater, the City, and the Pueblo de Las Animas, has announced its reopening in mid-March. The new date is coincidental, but the Pérezs said that it was made to coincide with the reopening of the new facility, the Pérez Museum, in the former Special Operations Headquarters (SOHC) in El Paso, Texas.The new location will be inaugurated by a “Pérez Museum of Art’s’s’ opening of an exhibition on the Pérezs’s association with the late artist George Fox and its reopening of an exhibition devoted to the Pérezs’s art. The opening will coincide with the reopening of the Pérez Museum of Art, which will reopen in March of 2020. The institution’s current exhibition, “Pérez: A Retrospective,” will stay on view until March 19.The Pérezs said that the museum will be “transformative and a model for how a museum can function with minimal", "The next Biennial should be held in 2020 and may be moved to any of the Biennials's seven locations. The 2019 event, titled “Blackout,” was organized by Barc, the global nonprofit organization dedicated to advancing black liberation, and the artist-run organization Occupy Blackout. The exhibition, which opened at the Black Rock Desert Museum in Nevada, showcased work by seventy artists, including Terrence Ross, Mierle Fox, and Rineke Dijkstra, as well as an exhibition of work by Jacques-Louis David and the Bayard Rustad, and was staged at the Museum of Modern Art in New York.Commenting on the exhibition, Lillehammer said: “Blackout is a moment of total blackness, a moment of existential blackness. It is an event that articulates the ideas of art and of humanism in a way that we have never done before. We are in the process of creating new conceptual frameworks, new narratives around blackness, for the first time in our history, and this is a moment when we have the opportunity to re-shape the landscape, to re-shape our narratives, to re-shape the future. Blackout is a moment of social and political rupture", "The next Biennial should be in 2020. I am sure that in the meantime the Art Museum has been carefully working through the various challenges posed by the pandemic and that it will regain its strength and vitality. Nonetheless, I am confident that the redesigned museum will remain at the forefront of contemporary art. I look forward to the opportunity to present the Biennial at the Art Museum in 2020.\n\n\nThe Museum of Fine Arts (MAS) in Los Angeles has named Marc-Olivier Rojas the next director of the Los Angeles County Museum of Art, Los Angeles. Rojas will assume his new post on January 7, 2020. He succeeds John Leavitt, who oversaw the museum through its acquisition and renovation in 2014, and will take up his post on January 20, 2021.“Marc-Olivier Rojas’s appointment is an ideal match for MAS, a museum whose history is premised on a robust commitment to artists and their work,” said board president Ed Harrow. “John and I are thrilled about the prospect of his leading the LA County Museum of Art and its talented staff. Our mission is to inspire and inform by developing and presenting the most compelling art in Los Angeles. We are confident that his expertise,", "The next Biennial should see the first-ever performance by a Muslim artist in a Western country, and it should also include a memoir by Mirza. Commenting on the biennial, Shirin Waseem, the director of the charity Artpan, told the Art Newspaper: “The great achievement of the exhibition is to bring together artists and cultures from different backgrounds and to show their creativity in new and unexpected ways. . . . Mirza’s exhibition is a clear demonstration of the power of art in stimulating social change and in shaping the future direction of our society.”\n\n\nThe National Museum of Contemporary Art (NMA) in Washington, DC, has appointed Tanya Gordon as its next director. Gordon will assume her new post on January 20. Gordon comes to the institution from the Museum of Contemporary Art (MoCA), which she has led since 2017, and succeeds Michelle Hsu, who retired after a decade at the helm of the institution in July.“Tanya has built a strong and dedicated career in the museum as an integrator and curator, enabling us to present challenging exhibitions and timely collections in new ways,” said Elizabeth Christopher, chair of the board of trustees. “In the new role, she", "The next Biennial should be announced as soon as possible. Artforum will keep you updated with further updates on this developing story. The next Biennial will be held in September in Tokyo. \n\n\nThe Bauhaus in Hamburg, Germany, has been renamed in honor of Suzanne Fabre, the founder of the artist collective Bauhaus. The institution announced the change on its website on Wednesday. Fabre was born in Berlin in 1935, where she studied under Karl Löwenstreicher, the founder of the Löwenstreicher Art Museum. She moved to Hamburg in 1949 where she began work on her first exhibition, L'Amour du Vier, which featured works by forty-three artists. Fabre continued her exhibition in the city for the next eight years before she relocated to the small town of Bonn, where she would have lived and worked her way through university in the late 1950s.  In 1968, the Bauhaus was granted its first permanent site in the city of Bonn. Its museum was completed in 1969 and the museum has since housed exhibitions such as the “Wiradjuri Art Archive” (1969), “Theme from the Bauhaus�", "The next Biennial should take place at the Museum of Fine Arts, Boston. Its inaugural edition, entitled The Death of Albinism, will be held sometime in the autumn of 2020. The 2019 edition, entitled Autobiennial: Art and the Soul, was held at the Museum of Fine Arts, Boston. The next edition, titled Autobiennial: Art and the Body, will be held in 2021.  The 2019 and 2020 editions of the ROBOTICA series are currently on view in conjunction with the artifacts of the National Museum of Fine Arts, Washington, DC, and the National Museum of Women in the Arts, Washington, DC. The 2020 edition will be inaugurated by a solo exhibition of work by the artist Martine Schoelka, which is currently on view in the exhibition “The Space Between Worlds.”\n\n\nNew York City’s Metropolitan Museum of Art (MoMA) is rethinking its departure from a 1,600-year-old stone structure in the Bronx to make way for a $450 million private museum designed by the same firm that designed the soon-to-open Met Galerie in Paris. The new institution—which will be located in the former offices of the", "The next Biennial should be on the themes of technology, design, and digital art; “The Future of Art” will be held in September 2020.\n\n\nThe Museum of Modern Art (MoMA) in New York has announced that it is planning to open a new exhibition in the former Kodak building in the city’s Chelsea neighborhood in September 2021. In a release, MoMA said it will create a new platform for artists and curators to create new exhibitions and feature works. “The exhibition is a continuation of MoMA’s ongoing strategy to experiment with new materials and new materials combinations to create works that answer the questions of what happens when we are not here, and what happens when we are not in a way we can’t control,” said MoMA director Marc Glimcher. The new program will draw from a selection of work that is currently on display in the museum, which has been closed since December 2019 due to the Covid-19 pandemic. The works, which are part of a larger exhibition run by Gagosian in the summer, will be curated by Lars-Erik Nilsson, who has curated previous exhibitions at MoMA, and will be presented by artists Sarah Sze", "The next Biennial should focus on the identification of potential resistance mechanisms in different regions of the world and how these may be modified. The second should examine the development of new agro-ecological practices that can be adapted to meet current situations and challenges. The third should examine the role of art and culture in social change.The exhibition will be held at the New York Institute of Technology (NYIT) in partnership with the Metropolitan Museum of Art, the Museum of Modern Art, and Ortega y Gasset Museum, and the Whitney Museum of American Art. Organizers will review the submissions by March 14 and announce a winner in the spring of 2021.\n\n\nThe Huntington Library in New York has released the twenty-nine-unit collection of photographs by Genevieve Fox (1905–1976). Made in both black and white and featuring subjects that range from everyday objects such as shoes and handbags to historical figures such as Abraham Lincoln and Winston Churchill, the photographs are part of the collection, “The Town and the City,” which also includes works by Robert Mapplethorpe, whose dark cavernous oeuvre includes works that examine Dallas’s American industrial complex and society.Fox, a Chicago native whose increasingly ambitious"]