["The next Biennial should take place in 2022. The first exhibition, titled 'On the Origins of Art, Politics, and the Future, with God and Man, ’s Imagination and Sadness,” was held at the Museum of Contemporary Art (MCA) in New York in 2017. \n\n\nThe United States Department of Agriculture (USDA) has received a $3.4 billion gift from the Museum of Modern Art (MoMA) in New York for its $2 trillion farm program. The $2 billion is divided among twelve regional partnerships, which create new opportunities for farmers and small business owners across the country. The gift includes $540 million for the Midwest; $243 million for the South; and $102 million for the West.The gift includes a new regional conservation fund that will reward and preserve more than 1,500 acres of agricultural land, as well as an emergency loan program that can provide up to $1 billion to small businesses and farmers each year. The loan program will also create new grants and emergency loans for small farmers.In recognition of the generosity of the public, MoMA also awarded $268 million to five nonprofit organizations: the American Federation of State, County, and Municipal Employees (AFSCME), the", "The next Biennial should take place in the winter of 2020—the 2020 edition, which focuses on the contemporary and contemporary art, is scheduled to run from March 19 to March 21. The second installment will be held in March 2021.The first exhibition, titled “Peace,” will highlight the work of twenty-three artists, including Isamu Noguchi, Frank Gehry, Alan Serkin, and Anton Kern, as well as the work of forty designers, including Richard Avedon, Haim Steinbach, and Paula Cooper, who collectively created a series of works that are currently on display in the museum.\n\n\nThe Museum of Fine Arts (MFA) in Los Angeles is moving three of its most important artworks—a painting by Edward Hopper, a Curtiss-designed glass sculpture by Elia, and a photograph by American photographer Stanley Milgram—to New York. The move follows the museum’s announcement last month that it would celebrate its thirtieth anniversary with a retrospective devoted to the late scholar and activist Simone de Beauvoir.“The move is part of an ambitious strategy to reorganize the MFA in light of its expanding collection and to advance its legacy as a leading cultural", "The next Biennial should also aim to address its cultural heritage, which is increasingly visible through its exhibition space, ornaments, and sculptures, and the venues in which it is staged. “At the time of writing, we have not identified any clear solutions to the challenges that are posed by the pandemic,” said Mark Simmonds, chair of the board of trustees of the National Poetry Library, and former director of the National Poetry Library in London. “Some have suggested a complete overhaul of the institution, where it is relocated to a new building. But that would not be a biennial, but a series of smaller pieces that would all be presented by one artist. We must therefore continue to think and act as one, and work together to create new and better ways to share our stories and art.”\n\nThe National Museum of Scotland has launched a new digital platform that will allow visitors to the institution to see works by artists working across all disciplines and from all over the world. Called the National Poetry Library, it is being developed by the National Arts Council, the National Galleries Scotland, and the National Foundation for Scotland and the Highlands.The platform will allow visitors to the institution to browse the collection of", "The next Biennial should take place in 2020.\n\n\nThe San Francisco Museum of Modern Art (SFMoMA) is preparing to welcome visitors back to the institution again next month with a new exhibition dedicated to the civil rights movement, “Theater of Operations: The Gulf Wars 1991–2011.”The event will examine the history and the continuing impact of the ongoing wars in Iraq and Afghanistan on the region and the United States. It will also feature original work by forty-seven artists, including Gabriel Oulabilla, Marilynne V. Williams, James I. Preciado, Christopher Wool, and Suellen G. Rold, among others from the Bay Area.\n\n\nThe Museum of Modern Art (MoMA) in New York is planning to reopen its doors once more this month in recognition of the city’s celebration of the biennial’s theme of the late mayor, Michael R. Bloomberg, who died in January 2019. The museum will be open on July 31, 2020, with a preview party on July 29, 2020.Museum director Marc Straus announced the reopening on Instagram, writing: “We will be open on July 31, 2020!” The museum will also welcome visitors as", "The next Biennial should be held at least once a year, while the venue for the first exhibition, “Spirit of the present,” is slated to open in 2021.Hiroshi Kawamura, the director of the Museum of Art in Kobe, Japan, said: “The more we look into the future, the more we see that there is a chance to create a new space in the city of Kobe with a single archway. We are still in the process of organizing this exhibition, but I am personally convinced that it is possible. I also believe that the future of the museum is in the hands of the public. It will not be easy, but the future belongs to the people. I hope that this exhibition and the upcoming biennial will be a signal of the future for our institution.”\n\n\nLocal authorities in the Swiss Alps are investigating the possibility of the collapse of the Swiss-based company, SwissArtemisia (SA), and whether some artworks are being transferred to third parties. The Art Newspaper reports that six artworks, including a work by Swiss artist Helmut Oehlen, a solo exhibition on the design of the Alps and a painting by the German Konrad Feuermann, were recently purchased by", "The next Biennial should be in 2021. The Art Newspaper reported that the Biennale aims to increase its community engagement by creating a two-week video series on ecology and/or sustainability for a selection of 60 artists and will present five biennials in 2020.Inaugurating the twenty-second edition in 2017 is the second movement of the five-allegory, Moluccino, a participatory, multi-media performance series by the five-allegory troupe in collaboration with the Italian architecture studio Fondazione Bocca. The work, which was staged at the Palazzo Stampa and at the Palazzo Regio, in Venice, was adapted from the Italian author and playwright Beccaria Cipolotti’s novel Cicodithecia, a childhood fantasy about a woman who becomes the goddess of wine, and was commissioned by Sara Ciminelli, the chair of the Biennale. The production, which was staged in collaboration with director Lucio Bertelli, premiered at the Milan Film Festival last month. Other works in the show will be sculpture by Mona Hayano, Alexander Calder, Andrea Canova,", "The next Biennial should be held at least three times a year. “Time and again, the art of living has been moved from the past to the future, and the pace of life has been accelerated through art,” said Joachim Neugroschel, the director of the National Museum in Brussels. The collection will be moved to a new space in the city, De Stijl, in 2020 and will then return to the museum for its next exhibition. The exhibition “The Shape of Things to Come” will inaugurate a new section of the museum, “The Legacies of Michelangelo, Raphael, and John Russel” (which will be devoted to Miranda and Abelardo, respectively), in 2021 and will be followed by “After Life,” a special exhibition of work by the sixteenth-century Italian painter Ettore di Lista, “Ascendante Legamarezza” (2019), in 2020, and “Pine Trees,” a reconstruction of the glass and plaster cityscape of Venice that will open in 2021.\n\n\nThe Metropolitan Museum of Art in New York has unveiled a new initiative that will seek to harness the city’s art and", "The next Biennial should try to address the thorny issues of archaeology and art through a dialogue between art and history. It should explore how art and history interact with one another, its environment and the environment in which art was created. It should present highly relevant and thought-provoking artworks from the past to the future.”\n\n\nThe Shandong Art Museum, China, announced today that it has completed a major renovation and expansion project, which aims to increase the museum’s exhibition spaces by nearly twenty percent. Located in Shandong City, the new building is the museum’s largest expansion project, which increased the museum’s exhibition space by 20,000 square feet (5,000 square meters).The project will also include the refurbishment of the existing exhibition spaces and the addition of another 20,000 square feet of exhibition space that will be accessible by elevator. The renovation and expansion was led by the Shandong Art Museum’s director, Chen Yuling, who was also responsible for the renovation of the Peking Science Museum in Beijing and the renovation of the Shanghai Museum of Art.“The Shandong Art Museum has grown tremendously over the last thirty years, and in that time we have seen", "The next Biennial should be held in the spring of 2021, when the exhibition will reopen at the Venice Biennale. The initiative will be led by director Giuseppe Bellini.\n\n\nThe Department of Culture, Innovation, Sport, and Science (CISAS), located in the Ministry of Culture, has announced that Laura Suss, a French curator and educator, is the next president of the Bechim, Germany, which has a population of almost two million people.“I’m delighted to welcome Laura to the triennale,” said Bechim’s director Jürgen Trittel, who added that Suss will be instrumental in preparing for the 2020 edition of the festival.Suss will take up the post on January 17. The seventy-fifth edition, taking place in Berlin and the city of Giessen, will take place in the autumn of 2023. The biennial will center around an exploration of the history and landscape of vernacular art. The exhibition will present more than 100 works by thirty-two artists. The biennial will also feature works that were previously unpublished, as well as works by artists who have only recently received exhibition commissions, and will be organized in collaboration with the Berlin", "The next Biennial should be held in 2021, with the third and final iterations to take place in 2022 and 2023. The Biennial’s site in the heart of the city of Lyon, France, is positioned in a UNESCO World Heritage–listed UNESCO City Hall garden. The building, which houses the museum, is equipped with a biennial stage, a large public courtyard, and an auditorium.“We are actively working to build a new Biennial in Lyon,” said Roger Vergne, chairman of the biennial’s board of trustees. “We will share more details about our plans for the future in the coming months.”The museum has been closed since March 13, and on Saturday, March 14, it opened to the public for the first time since March 13. The Biennial will include two exhibitions, “Our Souls at Rest and the Golden Bough,” which will be jointly curated by Jacques Delorme and Naima J. Keith; “The Handmaid’s Tale: From Scratch,” which will be presented by the Danish artist and philosopher Ulla and Kari Værck; and “The Book of Life: From", "The next Biennial should take place in 2020. \n\n\nThe Art Newspaper, an online publication focusing on art, has announced that it will suspend publication until the Israeli government moves to evict more than one hundred Palestinian homes from their structures in the West Bank. The publication’s publisher, Adrienne Edwards-Williams, told Artnet that she was “tended by friends and colleagues to believe that this was the most radical decision we could have made.”Since taking over the reins of the publication from her boss, Robert Mapplethorpe, in February, Edwards-Williams has worked to integrate the publication into her daily routine and has pushed for more publications focusing on Palestine. “I’ve become convinced that the future of art and Palestine lies in these structures,” she said at a press conference in London this week. “The only way to end the conflict is to put down these structures.”In a recent Artforum interview, Edwards-Williams said: “I’ve been trying to change the discourse around Palestinian art and Palestine since the 1970s. I’ve tried to present an inclusive, non-sectarian picture of art. I’ve used the art of Palestine to make", "The next Biennial should be held in 2022.\n\n\nArts Council England (ACE), the UK’s arts and cultural agency, has launched a new initiative to support British museums through its financial and banking crisis. The initiative will offer financial assistance of up to £100,000 to institutions coping with the economic fallout from the coronavirus pandemic.“Our new financial services bill will deliver a significant boost to the arts in 2022,” said Paula Bennett, director of the ACE. “It is essential that British museums continue to thrive during this difficult phase of their recovery, and that they do so with the support of the private and public sectors. We will be working with the public and arts sector to make the best possible use of the funding that is being set aside by the government, and to help them plan for the future.”The agency will create two new financial advisory strategies, one focusing on the commercial side of the arts and one focusing on the commercial use of cultural assets. Both strategies will be developed through a cross-section of cultural bodies, including the British Film Institute (BFI), the National Poetry Library, the National Poetry Sculpture Garden, the National Poetry Schools, and the British Book Award.", "The next Biennial should be held in 2020.  The theme of The Future Is Present is concerned with the possibility of “continuity” and the historical record in a world where technology is advancing at such a rapid pace that the past is no longer relevant. The sixties were not an anomaly in history, but a time when the future was beginning to change.\n\n\nThe Open Society Foundations (OSF) and the Museum of Modern Art (MoMA) in New York announced today that the foundation will donate $10 million over the next two years to support local arts and cultural institutions in the city. The gift will also support the arts with a new grant program that will support the reinstallation of the museum’s collection and provide additional support for arts and cultural organizations that have experienced financial distress due to Covid-19.“We are extremely grateful for the support from the foundation and MoMA for their generosity towards the city’s arts and cultural institutions,” said James Goldfarb, chair of the foundation and a former chair of the MoMA board. “The grant program will allow the foundation to accelerate the museum’s commitment to support our arts and cultural institutions by adding new artists", "The next Biennial should take place in 2020 at the Museum of Contemporary Art (MoCA) in Los Angeles. Considered a milestone event in the arts, the 2020 iteration will be centered on the theme “Theater, the Digital, and the Body” and will consist of a selection of work by seventy-five international artists, including Hao Jing, Yanele B. Bocca, Nasar Shah, and Ana Mendieta. The biennial will be organized in collaboration with local, national, and international artists and institutions as well as with Los Angeles’s Chinatown and Historic District.“Theater, The Digital, and the Body is a powerful statement of our times,” said Michael Carey, chair of MoCA’s board of trustees. “This year’s theme is an exploration of the relationship between art and society as it relates to our bodies and the digital world. Art and technology are interconnected, and we hope that our exhibition will help to raise awareness of the interconnectedness of art and technology and inspire people to think critically about their bodies and their place in the world.”\n\n\nThe National Museum of Scotland has pushed back the opening of the third edition of the National Museum Scotland Art", "The next Biennial should now be held in 2021.  These festival cycles will continue into the twenty-first century, with each cycle inaugurating a new theme and location. Inaugurating the theme of the 2020 edition will be a new work, by the conceptual artist Katharina Niedzwiedzwiecki, which will be based on a concept of the museum’s European history, which will explore the space of the museum as a historical monument.\n\n\nThe State Museum of Fine Arts (SFA) in Boston has added ten works by twenty-four artists from the city’s Five Towns neighborhood to its collection, marking the first time that the museum has added ten works by a single artist from the region in more than twenty years.The artist-in-residence is now Allison Kornbluth, who came to the institution with her husband, David Kornbluth, and their daughter as part of an artist-in-residence program launched by the city of Boston in 2016.“This year’s program is a continuation of the SFA’s long-standing commitment to champion the work of artists from our city’s Five Towns neighborhood,” said city", "The next Biennial should be held in 2021.\n\n\nMore than 1,500 artists and scholars have endorsed a resolution (PDF) that calls for Israeli culture to be protected from the threat of violence in Palestine, the Middle East, and the Israeli-occupied territories (the \"Palestine diaspora\"). The statement, which was issued by the Australian Council of the Arts (ACA), the United States Council of the Arts, the United Kingdom’s National Union of Music, and the British Association of the Arts, as well as numerous other cultural figures, was penned by a group of academics and arts experts.“The world is living through a defining moment: the moment when the political will to end Israeli occupation and the right of return of Palestinian citizens is widely recognized by all states of the world,” reads the declaration. “This is a moment when the archives of Palestinian history and languages, the Palestinian people, and the Palestinian artists are celebrated. This is a moment when our children and grandchildren are reminded that their past successes are not in vain, but are an inspiration to the future.”The resolution is part of ongoing international campaigns against Israeli policies in the West Bank and the Gaza Strip. Last month, more than 140 scholars and researchers", "The next Biennial should be held in 2020. “I would like to see an end to the occupation, and a new start for the exhibition,” Hauser & Wirth’s Mira-Lori DiPietro, who curated the first edition of the museum in 2017, told the Art Newspaper. “We are planning to launch an action plan to secure a real solution for the galleries and museums of the city. I hope that the city council will respect this and will work with us to find a solution that will be sustainable for the future generations.”The museum is currently undergoing a $500 million expansion. The $250 million project is part of a $2 billion plan that aims to make the museum “efficient and robust,” according to a release. The museum plans to present new works by the following artists in 2020–21: Sebastian de la Peia, who is currently on vacation in Venice; Celine Pape, who will be back for the final edition in 2021; and Oswald Pinchuk, who will be back next year. This is the same year that the museum’s exhibition “Night and Day: Russian Art and the Late Soviet Period” will open", "The next Biennial should be in October 2020 and will be held on site at the Museum of Modern Art in New York. The show will include an exhibition of works by fifteen artists, including Lévy Gorvy; Farabi, Berkeley, and Keane; and Sarah Lawrence. \n\n\nThe Institute of Contemporary Art (ICA) in New York City has introduced three new partnerships with the MFA in the city. Through the partnership, six artists will now be able to benefit from the research and development efforts of the museum while simultaneously exhibiting and working within the cultural hub. The partnership comes on the heels of the ICA’s launch of its ICA Interactive Art Place, an online platform that will feature new work by eighty artists within the ICA’s various locations as well as curated programs and events.“We are honored to support this growing movement of artists from the ICA to the MFA and are excited to show you the work of the artists that have chosen to transfer here from our partnership with the MFA,” said Jack Ma, director of the ICA, in a joint statement with ICA executive director Percy Mallant. “By establishing an ICA-MFA partnership, the ICA has established new", "The next Biennial should take place at the Institute of Contemporary Arts in the British Arts, London, in 2022. \n\n\nThe British Museum (BMA) in London announced that it plans to leave the UK’s National Gallery of Art (NGA) by the end of the year. The institution, which is facing a possible shutdown because of the coronavirus, has been working to restructure its operations in order to avoid the closure of the NGA as the United Kingdom works to contain the virus.The restructuring, which has been in the works for months, was completed in March, with the announcement that a new museum would be built to replace the NGA in a building that will accommodate its expansion. The reconstruction of the museum will extend the life of the NGA’s collection, which will soon include two hundred thousand works, and will also include exhibitions, educational programming, and research.The museum will inaugurate its new venue, the Contemporary Art Museum London (CAM), in April, with a special exhibition of works by artists whose work is currently housed in the National Gallery. Following a month of programming, CAM will reopen on September 3. In addition, the museum will host a biennial of contemporary art on September 11. The", "The next Biennial should be held at least two years after the date of the three previous editions of the conference. “Our vision is to build on the legacy of the Biennale with a new level of programming, with a contemporary and contemporary-inspired design expert panel, with a new exhibition format, with a new exhibition design, and with a new array of biennial projects,” said Eva DeMaio, chair of the board of trustees. The new format will include a biennial that will run twenty-four weeks long and will feature new works by artists participating in the Biennale de Lyon, the Biennale de Villebon, the Biennale de Montréal, the Biennale de Illyria, the Biennale de Bordeaux, and the Biennale de Mòrène. The theme of this year’s event is “Culture and Politics,” with a focus on how the art world, with its inherent partisanship, has been displaced by social movements and political forces. The new format was selected by a group of artists and curators comprising Jean-Luc Moulène, Tarek Atoui, Anne-Marie", "The next Biennial should be held in 2021, and the 2020 edition will once again be held at the venue.\n\n\n\n\n\n\nArtforum New York. Photo: Don Perlin.  \n\n\n\nThe Los Angeles County Museum of Art (LACMA) has appointed Dario Catellani as its next director and CEO. Catellani will be responsible for coordinating the museum’s seventy-four-year-long collection strategy, developing programs and exhibitions that engage with the arts, social justice, and environmental issues, and advocating for the preservation of cultural heritage.“We are thrilled to work with Dario and see where his vision for the LACMA comes together,” said museum director Max Hollein. “Over the years, he has built a stellar curatorial and artistic practice, bringing contemporary and historic art, as well as design, performance, and design-oriented exhibitions, to the museum.”Catellani will assume his post in January. In his new role, he will work closely with director and CEO Michael W. Gilliam, who has led the museum since 1989, and will focus on long-term strategic planning and the management of the museum’s collection. During his tenure, C", "The next Biennial should be held in the spring of 2021. “This is a moment of immense change for art, and we are deeply committed to carefully examining and reimagining the future of art,” said Bob Bailey, president of the trustees.   The museum will also launch an independent commission to research and produce a new inventory of the world’s art holdings. Currently, the museum displays twenty-two thousand works, making it one of the biggest art museums in the world, but it recently ran out of money to replace the twenty-six works that are currently on display. In an attempt to save the works, Bailey and the trustees have created a new fund which will provide $1.5 million annually for the next three years. “Art is a universal language, an encyclopedic repository of ideas and histories and a way of life, and it must be protected,” said Bailey. “I am deeply committed to supporting the Biennial, and am confident that its future will be enhanced by the work of our talented, dedicated, and passionate staff and by the broad and committed public.”  The Biennial will also present a selection of the three hundred and f", "The next Biennial should take place in 2020. The 20th edition of the show, titled 50 Years of Modern Art, will also be held in 2020.\n\n\nThe New Museum in New York has received a gift of twenty-six works by American painter and educator John Isherwood. The artworks, which were all donated by Sally and Herman Haslam, were purchased in 1973 for $100 and are currently on display in the museum’s Collection of American Painting, which opened in the former CCA facility in the early 1970s.“The museum appreciates the Haslam family’s generosity in accepting this gift and appreciates the museum’s ongoing commitment to the collection and scholarship of American painting,” New Museum director Stacey James. “John Isherwood’s gifts to the museum extend the Museum’s permanent legacy as an institution dedicated to the study and preservation of the work of an outstanding artist.”Haslam, who was a professor of art history at the University of Chicago, donated the works to the museum in 1973 after Haslam had written to the museum asking for them. The gift was made in honor of a lecture he gave at the University of Chicago", "The next Biennial should be held in 2020. \n\n\nThe Museum of Fine Arts (MFA) in Boston has canceled the next edition of the Boston Art and Design Biennial, which was set to take place in April. The announcement follows a 16 percent drop in visitors to the museum, which is located in the former Taji Todas Building on the southwest corner of Boylston and Worcester Streets, as well as a continuation of the Covid-19 pandemic.“Despite the recent substantial decrease in Covid-19-related hospital admissions, the numbers show that there are far too many people in the country who are not getting the care they need,” said Brad DeLong, executive director of the Boston-based advocacy group Restorative Action Now. “Our best chance to catch up to preventable deaths and save thousands of lives every year is to prevent the worst before we start, and our next exhibition at the MFA will focus on that very topic.”While the MFA expects to reopen in early 2021, it also noted that the exhibition “will not be possible without the ongoing support of the Boston community.” The cancellation follows an announcement in March that the museum would cease operations in March 2022", "The next Biennial should be in 2020 and will be hosted at the newly renovated and expanded Tbilisi National Gallery. Its exhibition “After the Rotation: Art, Power, and the Tuskegee Syphilis Study,” which will be curated by Andrea Dwork and will open on August 27, 2020, will mark the first time the museum has hosted a major international art and art history project in its 230-year history.\n\n\nThe New York–based nonprofit the Arts Arts Alliance (SA) has issued a statement regarding the removal of a controversial work by French artist Georges Apostuán by the French Ministry of Culture in the wake of a dispute over a painting by the artist that most notably features a naked woman by the artist’s daughter. The work, entitled La Bête du Monde, and was created for a painting by the artist Nelson-Atou. The controversy surrounding the piece, titled La Bête du Monde, first arose from a painting that depicts a naked woman by the artist’s daughter, French artist Etienne Bouillon-Atou, whose nude body was created by the artist for the film La télécharger . Bouillon-Atou called the work a", "The next Biennial should involve a collaborative effort and a new format. We will need to engage with the Korean arts scene through exhibitions, education programs, and collaborations.” \n\n\nThe Museum of Contemporary Art (MoCA) has released the list of artists participating in its 2017 Falling Art Fair. The exhibition will run from March 5 to March 8, 2020 in the museum’s original location on West Twenty-Second Street in Manhattan. The biennial will draw around 5,500 visitors and will feature work by seventy artists from forty-six countries and territories.The artists chosen for the fair include Elinä Tökkanen, Lasse Horvath, Julia Holm, Bryan Kennedy, Jennifer Li, Joanna Lou, Yuki Kondo, Kihlijn Mantel, Nari Ward, Denise Richards, Nils Størk, Markus Saarinen, Vincent van Gogh, and Mark Rothko. “It is a great pleasure and a great honor to announce the artists who will be featured in the upcoming Falling Art Fair,” said Mariko Silverman, chair of the fair’s executive committee. The artists chosen for the fair are as follows", "The next Biennial should be hosted at the Ontario Museum of Fine Arts in Toronto in 2021, followed by the New Museum in New York in 2022, and the Metropolitan Museum of Art (MoMA) in New York in 2024. The new initiative will receive $30,000 from the &©©© Monell; $50,000 from the &©©©©; $75,000 from the Japanese government; and $100,000 from the Hirshhorn Museum and Sculpture Garden in Washington, DC. It is expected that the next iteration of the art fair will be held at the Kunsthalle Musikverein Frankfurt in 2021. Former president and CEO of the Monell Center, Brigid Wilk, announced that the center will cease operations at the end of the year, Artnet reports. Hirshhorn curator and cofounder of the Detroit-based artist-run publication Iwan Wirth, who cofounded the Monell Center with new co-founder David Zwirner in 1992, confirmed its demise. Wirth told the Art Newspaper: “I thought we were all on the same page. We were. We were being honest. We were being sensitive. We", "The next Biennial should focus on the production, representation, and distribution of art, architecture, and design. For a full list of the museum’s upcoming events, check out the Biennial’s website. The biennial will be hosted at the Museum of Fine Arts, Boston. The opening of the exhibition, “Towards a New Imagination: Black Radical Art in the 1980s” is currently slated for December 20–December 22.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced that it plans to move the exhibition “Black Power” from its site in the city’s historic Tenderloin district to a new location in the city’s East Village. The exhibition, which was first presented by artist and activist Barbara Ehrenreich in 1993, will be relocated to a new building that will house the museum’s permanent collection, including such works as the first works by T.J. Dillinger, “The Movement Begins: The Black Power Album,” 2005–2006, and “The Boy Who Cried Wolf: The Photographs of M, 1967” 2012–2013.The move follows the announcement that the museum will become the", "The next Biennial should take place in Tokyo in 2022. The exhibition will feature twenty-three works by twenty-one artists, including James Turrell, Marko Rist, and Yoshiko Nakamura, and will be hosted by the first exhibition of the biennial, “Drawing a Life,” which opened at the Waseda University Museum of Art in Tokyo on January 14, 2016.\n\n\nThe Bezalel Academy of Arts in Jerusalem and the Bezalel University in Jerusalem are planning to create the world’s largest arts complex, which will boast an area of 1,300,000 square feet and will be realized in the city of Bezalel in the Jordan Valley. The $450 million complex will be constructed in the ʜ70s Olmert settlement and will include a theater, a library, and a research center for the teaching of the Bezalel University’s masterclass, as well as the Bezalel Academy.The academy is looking to raise $150 million for the project and has received $135 million from the Palestinian Authority; the Jordanian government; and the Jordanian royal family in a joint effort to raise $165 million for the construction of the complex.The", "The next Biennial should be held in 2020, with the first instalments to be released in 2022 and 2021. The new exhibition will be the first of a series of eleven that will be piloted by artists in the city. The first instalments of the series will be a selection of works that have been in the collections of the Künstler Walter de Gruyter Museum in Mainz. The Künstler Walter de Gruyter will be inaugurated by a series of solo exhibitions of work by forty-nine artists, known collectively as the Künstlers personal collections, which will open in November and March 2021. The exhibition will be preceded by a series of talks on contemporary art, which will take place in November and March 2021. The second instalment of the Biennial will be at the Kunsthalle Basel in January 2022 and the third instalment will be at the Kunsthaus Berlin in February 2022.“We are convinced that an exhibition of the Künstler Walter de Gruyter’s personal works, which is the most important collection of his career, is the ideal event for this year’s biennial,” said Marcel", "The next Biennial should take place in 2020.  The schedule for this year’s event is as follows:Friday, April 9, 2020: Opening night (6:30PM)-9:00PMSaturday, April 10, 2020: Opening night (7:00PM)-10:00PMSunday, April 11, 2020: Opening night (7:00PM)-10:00PMArtists and Identities: Thursday, April 8, 2020: Opening night (7:00PM)-10:00PMArtists and Identities: Thursday, April 10, 2020: Opening night (7:00PM)-10:00PMFriday, April 11, 2020: Opening night (6:30PM)-9:00PMSaturday, April 14, 2020: Opening night (7:00PM)-10:00PMSunday, April 13, 2020: Opening night (7:00PM)-10:00PMThursday, April 8, 2020: Opening night (7:00PM)-9:00PMFriday, April 12, 2020: Opening night (6:30PM)-9:00PMSaturday, April 13, 2020: Opening night (7:00PM)-", "The next Biennial should take place in 2020 and will expand upon themes of the artist’s life and the artist’s work, and will include postmortems, exhibitions, and performances.“I am delighted to welcome our talented team to the Biennial,” said Adriana del Castillo, director of the Biennial. “The exhibition will celebrate the life and work of Rosa D. Miranda, one of the most important and celebrated artists of the twentieth century. With her we will explore her legacy through her art, and we will be able to show her work to our children and grandchildren as we gaze into the future.”\n\n\nNew York’s Metropolitan Museum of Art is suing the estate of the late Chinese American artist Ai Weiwei to collect more than $3 billion in damages. The multimillion-dollar lawsuit, filed on Monday in Manhattan Supreme Court and filed by James Gebbia, a lawyer for the Met, alleges that the estate failed to remit payments owed to the heirs of Pierre and Joan Wang, who donated their vast fortune to the museum in 2009 but were never heard from.“In a time when many cultural institutions are facing financial ruin, the Met has shown extraordinary", "The next Biennial should take place in the spring of 2021, and the first exhibition should open in the fall of 2021. The 2019 edition was held at Frederic Bastien’s Exo Gallery in Paris. The theme of the 2019 exhibition was “Visitor Interfaces: 3D” and the artists chosen for the first installment were Soraya Nadia, Melançi Naidoo, Kate Kelly, and Xavier Hufka. The exhibition will be preceded by a series of exhibitions to be held at the Museum of Modern Art, New York, in October. The biennial will also include a book, a film, and an installation of works by artists from the Shirley-Musgrave family.The biennial’s inaugural exhibition, “NIRIN,” will feature a selection of works from the Shirley-Musgrave’s collection by Artists’ New York,   one of the largest contemporary art organizations in the United States, which was founded in 2000 by Charles and Lucille Musgrave. Among the artists chosen for the 2019 exhibition are Jude Lawler, Love is the Law of the Grapes of Wrath, Stuart", "The next Biennial should have a budget of at least $1.5 million and will be open to the public in 2022. The festival will also include a program of exhibitions, performances, competitions, residencies, and other events. The 2019 edition of the award, which honors a biennial’s artistic excellence and is given annually to the most innovative work in the field, was awarded to Sylvia Berlind, John Caswell, Tanya Bonakdar, Juan Alvarez, Albert Camus, Andrea Colella, Xavier Caulfield, Wangechi Mutu, Yoshitomo Sugi, Trojan Vyas, Jean-Luc Leger, Diana Wilke, Andrea Iannone, Art of the Electronic Age, and The Holy Land, and was selected by a jury comprised of Christopher Jacobs, Claude Junz, John Johnson, Daniel Kapp, and Cameron Rowland. The jury deliberated for six days before reaching a final decision that awarded the prize in the second round of judging. The other finalists for the prize were Nirvan Jethwa,", "The next Biennial should take place in 2021 and will be led by artist and curator Verónica Cervetto, who is currently working with artist and collector Wangechi Mutu in the new Gold Coast Gallery of Art, in Melbourne. \n\n\nAfter a report published by the Royal Institute of British Architects (RIBA), which analysed the future of London’s Tate Modern and found that its future plans are at risk of being cancelled because of the ongoing Covid-19 crisis, the government announced on Thursday that it is reopening the Tate to the public on November 25.Tate director Maria Balshaw said: “We are currently consulting with the government and other stakeholders to understand how we can deliver a world-class contemporary exhibition and museum to the people of London, while ensuring a robust and secure future for Tate. It is essential that we work together to deliver a plan that ensures we have the time and opportunity to re-open and we have the flexibility to consider the potential for future events and the future of Tate.”While the government is allowing the Tate to reopen as part of a cost-saving measure that will avoid a shutdown if everything goes to plan, it is also telling the institution that it intends to move the Tate", "The next Biennial should be held in 2022. \n\n\nThe Directorate General of Culture and Sports of the Federal Republic of Germany (DG) announced today that the decision to remove the Thomas More art museum from the Berlin Architectural Heritage list was made following discussions with conspicuous and critical voices within the German government. For the last fifteen years, the DG has been working behind the scenes to strengthen the museum’s future on the list. The move followed a public outcry over a renovation at the museum that had been scheduled to begin in 2021 and was expected to be completed in 2022. Among the concerns raised by the public are the deterioration of the museum’s original architectural setting, the museum’s potential attendance by an estimated one-third of the visitors in 2024, and the museum’s lack of a dedicated staff to oversee the renovation and maintenance of the museum.The DG’s discussions with senior politicians took place in March and June of last year, and were prompted by comments made by Hermann Gee, the former minister of the environment and environment, who said last month that the decision to remove the museum from the list was made in “legitimately fashion” and would not have been made without", "The next Biennial should be held in 2020, and the first in 2021. The next exhibition should be held in 2022, and the first in 2023. In what may be a precursor to future exhibitions, the museum will stage a 2018 exhibition featuring the work of twenty-five artists, including Naguib Mahfouz, Anwar Saeed, Anwar Saeed II: The Serpent and the Rainbow, and Hoor Al Qasimi, at the same time as the biennial “The Fifth Element....” The exhibition is scheduled to run until December 5, 2019, and will be followed by the biennial The Seventh Wind in January 2021. “It is a tough situation for artists, especially when funding is tight and the art market is pessimistic,” Mohsin Raza, the director of the Museum of Contemporary Art, New York, told Artforum. “But a biennial, in its own way, is a step that will help many talented artists. This is one more step in the journey of my career and in my art, and I am very much looking forward to it.”\n\n\nThe Leica Museum in New York has appointed Paul Klee as its next chief curator. Klee", "The next Biennial should take place in the spring of 2021. The exhibition will be centered around the work of artists whose practice spans decades and will be organized as a celebration of the life, work, and art of Wolfgang Paalen, a German author and art historian who lived and worked in Paris from the 1940s to the 1970s. Like many Parisian painters of his generation, Paalen was influenced by the Stalingrad architecture of the same name, the demolition of the city in the Second World War, and the brutal climate in the French Alps. His work will be displayed in the exhibition “Paparazzi: Heres Paris,” which will run from February 19 to February 21, 2021 and will feature thirty-three works by thirty-six artists. Curated by Simone Bossi, the exhibition’s curator of photography and video art, the pavilion will be inaugurated by a presentation of Paalen’s work, “Cynthia Bock” (2014–15), to the MFA Paris in December. The 2019 biennial, “Paparazzi: Contemporary Art from the 1960s,” featured forty-nine works by thirty-four artists.", "The next Biennial should take place in the evening of March 7–March 8, 2020. The museum will be closed until July 4, 2020. The newly established Institute for Art History and the Arts will facilitate the exhibition. According to the exhibition’s organizer, the museum will take up the theme “The History of the Contemporary Art,” which will be curated by Hasan Sadiq, formerly of the Sudanese National Museum and the Sudan-born, London-based director of the London-based charity Sistership. The 2019 Dutch pavilion, which also featured German and Brazilian artists, was organized by the artist-run nonprofit organization Cinéma Works. The 2020 pavilion, which will be curated by Françoise Goulard, is expected to be announced sometime this month.  At the end of the exhibition, which tackles a range of issues, including migration and the future of art, the artist-run organization Irvin Bautista wrote: “The work of the different artists is a reflection of the history of art, and the future of art, I believe, is a process of reflection, of questioning, of recovering, of re-arming ourselves, of recalling, of recommitting. Art", "The next Biennial should be hosted by the Museum of Contemporary Art (MoCA) in New York next year. The exhibition would focus on “micro-art,” which works within the context of a museum, and would begin with the artist Naho Miki.“I want to thank everyone who has been a part of this,” said Biennial curator Kathy Van Alenhoven. “This is a landmark year. We are at the end of the work year; the last few months have been a great success and inspiration, and we hope that this work - as a series, as a collection, and as a future exhibition - will bring you the same excitement and sense of urgency as the first year.”The exhibition was inspired by a year-long exhibition that Lelong and Van Alenhoven curated titled “Unfinished Business: Contemporary Art and the American Experience,” which was presented at the Fifty-Sixth Venice Biennale in 2012. The show explored the humanistic ideals of the American West through the work of twenty-one artists, including Ed Moses (New York), Gerhard Richter (New York), and Alan Seroussi (New York). The show was also international in its", "The next Biennial should be staged in 2020.   The newly created Berlin Biennale will also host a new artist-in-residence every two years.  The Berlin Arts Museum (BAM) has announced that it will not be renewing its contract with the University of Bonn, which involved the collaboration of five artists, including the German-born, François Troy, and the Belgian-born, Florentijn Hofland, in commemoration of the 70th anniversary of the city. Instead, the museum will move the exhibition to a new venue.“The decision to move the exhibition to a new venue was made following a close review of the proposals by the experts, in consultation with the board of directors, and after a careful analysis in which the exhibition was given a high level of importance,” Michaela Hoffmann, the director of the BAM, told the Art Newspaper. She added that the university was not disappointed in the decision “because we would like to continue with the exhibition in a different way. . . . We hope that the exhibition will be restored to Bonn, and then on to other museums in Germany and will continue to work in cooperation with the local authorities to understand the possibilities of the exhibition", "The next Biennial should be held at the Art Museum in Chicago in 2021. “The public deserves to know that the city’s planning processes are being held to account,” said Chicago Public Works director Elissa Smith. In a statement, Mayor Rahm Emanuel said: “This is a city that has literally come to terms with the fact that it is losing an incredible amount of money every year because it cannot make the cuts to the bloated city’s budget. We have made choices that will cut spending at every level of government. We have made decisions that will hurt working families and the middle class. We have made decisions that will hurt small businesses and the middle class. We have made decisions that will hurt the special interests that have made Chicago such an attractive market for cultural institutions. We have made decisions that will hurt the museum district. We have made decisions that will hurt the city of Chicago.”\n\n\nThe Academy of Fine Arts (AFAFA) in London announced today that it is planning to merge with the academy’s parent organization, the Association of British Architects. The move will eliminate the separate organization’s headquarters in Knightsbridge and will instead be managed as one. “The merger will ensure", "The next Biennial should include a survey of French Modernism, a reconstruction of the Paris Biennial in 2022, and a reflection on the biennial’s collaborative legacy. “I’ve long admired their work,” said Gerald Shiner, chair of the board of trustees. “Their initiative has been tremendously important in revitalizing the Biennale; it has become one of the most important events in the history of the institution. What we’re seeing now is the culmination of decades of collaboration between the two organizations.” The exhibition will close on January 12, 2020 with the exhibition “Endless Sea.”\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Ciarán McGuinness as its next director. McGuinness will assume his post on January 15. McGuinness comes to the MFA from the Museum of Fine Arts, the Museum of Modern Art, the Boston Art Museum, and the Rhode Island School of Design, where he has served as director since 2013. McGuinness also previously served as the inaugural director of the Museum of Fine Arts in Boston, as the director of the Boston Art Museum for more than fifteen years, and as the director of the Rhode Island School of", "The next Biennial should be held in 2021. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has received a $50 million donation from the J. Paul Getty Trust. The gift includes $50 million for the construction of a new leadership and educational center for the institution that will be built in partnership with the California Community Foundation. The gift also includes the construction of a new installation, The Free View in the Plaza, an installation that will be part of a series of works that will be on display in the museum beginning in 2021.The gift was made in recognition of the museum’s “commitment to promoting the arts and creating new opportunities for the city’s residents through the acquisition of cultural items and artifacts.” The gift was made in recognition of MoCA’s 350th anniversary and its commitment to its long-standing dream of transforming the museum into a cultural corridor that could connect the urban core with the historic city of Los Angeles. The project began in 1994 with the acquisition of twenty-seven works by African American artists. The works, which include work by artists such as Eula Barlow, Lee Garvey, William Henry Fox Talbot, Robert Irwin,", "The next Biennial should be held in 2020. “We must continue to support and encourage artists to create works that challenge our own preconceived notions of what art should be,” said artist-in-residence Emily Antheil.\n\n\nThe Roberto Clemente Foundation in Venice, Italy, has announced that it will adopt a new plan that will allow the foundation to continue to operate as an independent organization, but will allow it to hire artists and perform works on its website. It will also be able to receive funds from foundations and other sources for its programs.“The foundation has been working on an artistic model for a long time that would support creative growth, create new talent and sustain the work of artists,” said foundation director Maria Cipolletta. “We have always been guided by a desire to see the foundation as a model for how the arts can be an antidote against the ravages of social exclusion and racism. This new plan will allow the foundation to present the critical elements of its artistic mission in a more positive light and will allow us to continue to work with artists in a more effective way.”Previously, the foundation operated under the umbrella of a new organization dedicated to Indigenous art, the Indigenous Life Institute (", "The next Biennial should take place in 2020.​\n\n\nThe European Space Agency (ESA) has released an update on its ambitious plan to create a new Europe-wide network of more than 1,000 galleries and other cultural spaces across the continent. Dubbed the European Restoration Initiative, the program aims to increase support for cultural heritage institutions and promote the preservation, conservation, restoration, and reuse of cultural assets across the continent.The initiative, which will target institutions in the regions of the European Union and the Netherlands, is being led by the European Commission, which will partner with local authorities in the regions to develop a long-term strategy to support cultural heritage. The regions will then receive funding to set up their own conservation and preservation organizations and will be asked to create a regional register of conservators.Under the plan, the EU will provide $422 million for “regional resilience programs,” which will include training, coordination, and logistical support for institutions; $175 million for “coordination of exhibitions, presentations, and exhibitions,” which will include the drafting of new international guidelines; and $12 million for “the development of the European Cultural Heritage Protection Fund,” which will provide support for institutions to protect and", "The next Biennial should be held in 2020, and the 2020 theme should be “Combating Climate Change.” Esther Schipper, a biennial organizer from Berlin and the biennial’s artistic director, told the Art Newspaper that the exhibition would attempt to “bring together the most dynamic artists and institutions in the world to challenge the prevailing ideological or political order.”The exhibition will be curated by Johannes von Storch, who will work with Alexander Malsik, Tomáš Vášov, and Ruba Černò to create a long-term project of the exhibition. The project will consist of three phases: 1) The exhibition will focus on the contemporary issues of climate change and its solutions, with a particular focus on extreme weather events and climate justice; 2) The exhibition will contain a large-scale public gathering; and 3) The exhibition will be open to the public.\n\n\nThe National Museum of Scotland has launched an ambitious new initiative to raise £200 million to support the work of over sixty Scottish artists working in online and mobile. The National Council for Contemporary Arts (NCCA) announced the that it would partner with the Edinburgh Foundation to launch an", "The next Biennial should take place in 2020. \n\n\nThe Great Northern, one of the oldest and most respected of the Norwegian art museums, has been threatened with a lawsuit over its renovation plans. The institution, which has been in operation since 1936, was forced to remove a large section of the museum in order to settle a $10 million civil claim by the family of Norvar Elias, the Norwegian director of the sixteenth-century Annunzio installation, Bavaria . According to the New York Times, the suit was filed by the Elias family to recover their $118 million investment in the institution.“The cost of the renovation is incredible,” says Norvar Elias, grandson of Norvar Elias. “The new building, which is about eighteen thousand square feet, is completely different from the old building. It has new, modern conveniences, a swimming pool, a restaurant, and a theater. The only other difference is that the theater no longer has an opening.”When the family of Norvar Elias first received a letter from the New York attorney general’s office in late March, they were surprised to learn that the state had already filed a suit against the museum. “We had no idea that", "The next Biennial should be held in 2022.\n\n\nThe six artists nominated for the 2019 Pulitzer Prize in fiction have signed an open letter declaring their support for an international concept of foreign ownership and its struggle against government pressure. Masha Gessen, Kim Stanley Robinson, Joël and Jon Landau, and the silent film maker Otis Redding, among others, have joined hundreds of other writers and artists in writing to President Donald Trump. The letter, released on Friday, claims that the Pulitzer Board is asking artists to use new international standards’ to advance the cause of foreign ownership and to call for the elimination of government restrictions on foreign ownership and investment. The letter argues that the Pulitzer Prizes are “based on a false premise that the Pulitzer Board or the American people approve of the products and artists presented. In reality, the Pulitzer Board is merely an arm of the government.”The letter was written by Max Hetzler, director of the Kunsthalle Basel (KBB), Germany; Wolfgang Pfeifer, director of the Ludwig Museum Freiburg in Germany; Timur Sobotka, the founder of the Abrams Museum in New York; Amy Sherald, the director of the American Academy", "The next Biennial should take place in late June or early July.\n\n\nThe British artist Michael Hoeffer, who most recently collaborated with artist-activists to provoke public attention to the ecological crisis, has died at seventy-four years old.Hoeffer was born in London in 1932. His father was a shoemaker. His mother, an English teacher, was an artist. After graduating from the Royal Academy of Arts, Hoeffer attended the Serpentine School of Painting and Sculpture in London. He found the school­house a haven for his rebellious spirit. Hoeffer moved to the United States when he was ten. He enrolled in the University of Chicago and then at the University of Minnesota. His work can be found in the collections of the Metropolitan Museum of Art, the Whitney Museum of American Art, the Los Angeles County Museum of Art, and the Los Angeles County Museum of Art.Hoeffer’s early experimentation with digital technology led to his highly influential sculpture, The Structural Equation, 1967–1985. Many of his sculptures move through time and involve abstract concepts such as the timeline of a building’s history, or the evolution of a garden. These works are often included in exhibitions organized by Michael H", "The next Biennial should be in 2021. A full list of grantees is available on the Biennial’s website. \n\n\nThe Museum of Fine Arts (MFA) in Los Angeles is working with the MacArthur Foundation and the John D. and Catherine T. MacArthur Foundation to create a new public art project. Called The Museums, the initiative will involve the donation of works by thirty-four artists, including Dominique Anselm, Richard Avedon, John Baldessari, and Michelangelo Antonioni, and will be supported by a $1 million gift made by the MacArthur Foundation to the MFA.“We are thrilled to support the MacArthur Foundation’s ambitious strategy to grow and create new art and arts–based projects to benefit the MacArthur Foundation over the next five years,” said Leslie Arnold, chair of the board of trustees. “The Museums will serve as a great model for how we can support the MacArthur Foundation’s public programs and support local arts and cultures.”Over the last five years, Arnold and MacArthur have given $1 billion to support arts and cultural institutions. The funds were split between the foundation and the MacArthur Foundation, which in turn, were given $1 billion.", "The next Biennial should be held in February 2022.  The first of the three stages of the Festival is now open to the public.  For the second half of the Festival, Biennials will be held in the venues of the National Museum of Applied Arts (Nama), the National Museum of History (Niehaus), and the Museum of Modern Art in London. It will begin on March 7 and end on March 9. “As the dismembered remains of the former USSR are finally brought into the light of day, the biennial presents its greatest challenges,” said Vladimir Prodromev, director of the Niehaus Museum. “In addition to the exhibition program, we will have to think of how to give the impression that we are living in a contemporary museum. How much more difficult will it be to open a museum in a Soviet museum than a museum in a contemporary city?” For the third and final stage of the Festival, Biennials will be staged at various historical places in the city and will be organized under the direction of the director of the Architectural Museum, Marina Moskvoskaya. The new festival’s program, which will be curated by a group", "The next Biennial should be called for the next ten years. “The future of art is now,” said curator Patricia Arquette. “We had a lot of encouragement from the judges and committee members, and they were able to see through our work in the past, to see that Biennial is a very important event.”\n\n\nThe Allen Memorial Foundation in New York has named Richard Greenberg its new director of its Centre for Art and Criticism. Greenberg will oversee the development and execution of the exhibition “Theater of Intervention,” highlighting the emerging field of Comparative Cultures. Art historian and curator David Wechsler will serve as the director until the end of the month.“Richard brings with him a deep understanding of the Allen Memorial Centre’s mission and responsibilities,” said foundation president Naomi Neibergall. “He brings a remarkable breadth of experience and curiosity in conceptual and creative practice, and is committed to accelerating the Centre’s unique reputation and immeasurable impact through our programs.” Greenberg will begin his role in July.The Allen Memorial Foundation is a federally funded organization that supports artistic institutions that have been destroyed or severely damaged by natural disasters or acts of terrorism.", "The next Biennial should be hosted at the New Museum in New York in 2021.\n\n\nFrance has launched an investigation into the fate of the Anacre to Yankou National Monument, a UNESCO World Heritage site celebrated for its depiction of the last great battle of the French Revolution. The royal commission into human rights in the occupied territories of the French-Algerian Republic of Algiers and Saint-Étienne announced in a statement on Friday that it plans to ask the Algerian government to rename the monument.If the Spanish government is to compensate the Spanish region of Almería for the national heritage site Saúde Banderas, which is also known as the Tomb of the Martyrs, then the Spanish government must do more than just recognize the restitution of the royal monument. It must also explain how the collection and management of the national treasures in Spain should be reformed.The Saúde Banderas Museum of Art in Madrid has been almost completely renovated since it opened in 1985, and now boasts a contemporary collection of 1,650 artifacts. In 2017, the institution also celebrated its thirtieth anniversary. The renovation was funded by a $5 million donation from Spain’s Minister of Culture, Cristina Már", "The next Biennial should be held in 2022 and will feature more than 150 works by ten artists, including Nalin Savasis, Nadiya Mehra, and Firoz Shah, among others, from across India.\n\n\nThe Nomad Gallery in San Francisco is planning to open a new outpost in New York. The new space will be inaugurated by a concert by the New York–based artist Imane Gould, who is known for her paintings that explore subjects such as memory, nostalgia, and intimacy.The upcoming exhibition, “What is Death?” will be followed by an exhibition organized by artist James Turrell, who will stage an exhibition at the gallery in September of 2022. The show will be hosted by the artist during a time slot that will coincide with the annual Art in the City festival, which runs from September 25 to September 27.During the event, Turrell will present his “What is Death?” series. The first exhibition, “What is Life?” (2017–18), explored the concept of death through the work of artist-activists Larry Gagosian and the late artist Paul Gauguin. The second, “Death and the Body” (2017–18), will", "The next Biennial should take place in 2022. The institution will also present the first new works in the Metropolitan Museum of Art’s thirty-five-year history in 2020, and has developed a new, exhibition-based exhibition program that will take place concurrently with the first biennial.“The decision to relocate the exhibition was made in collaboration with the Metropolitan Museum of Art, the New Museum, and the Bronx Museum of the Arts, as well as with Sara, our board of trustees, and our board of curators,” said Met director Alexander L. Pincus, who added that the move marked a “significant step in our history,” in a statement. The museums will continue to host groundbreaking exhibitions and exhibitions of works of art. The new exhibition series, “Tania Bruguera” will focus on the modern and contemporary work of the Italian sculptor Tatjana Bruguera. The event will also expand the museum’s visual arts program by introducing new works by newly commissioned artists. The third edition of the “Tania Bruguera: Art of Fashion” series will be held at the Metropolitan Museum of Art. The program, which will take up the themes", "The next Biennial should have 10 artists represented by artists of various nationalities. The theme might be “The Art of Taking Pictures,” or “Photography in Film” or “Bertolt Brecht” or “Ethnicity as a Black and White Image” or “The Black and White Image of Henry David Thoreau.” The next exhibition will be titled “The Ostracon” and will run sometime in November. \n\n\n\n\n\nThe Solomon R. Guggenheim Museum in New York has appointed Markus Scharfstein, a German painter widely recognized for his pioneering paintings of geometric forms, as its special curator of modernism and the history of painting.Scharfstein will present “The Third Reich,” a retrospective of the artist’s postwar exhibitions, at the museum in December. The show will feature new works by Scharfstein and will run the gamut of his studio practice: Constructive, abstract, and experimental paintings, as well as paintings that are centered on the artist’s personal experiences.“Scharfstein is often thought of as a modernist painter, but his work often integrates artistic and political", "The next Biennial should take place sometime in the year twenty-first, and the first event should be staged in the year twenty-second.\n\n\nThe Institute of Contemporary Art (ICA) in London announced today that it has established a new prize for the contemporary art of the Americas, a series of fellowships that will focus on contemporary art from Mexico, Central America, and South America. ICA’s inaugural biennial, “Mexico’s Modern Art,” will be presented by the French Ambassador to London, François Benoît Kerst, and will run from January 26 - January 28, 2020. Five fellows will be chosen by an ICA committee chaired by architect and philanthropist Yael Ben-Ari, and the institute will announce their recipients in the coming weeks.“Mexico’s Modern Art is’s goal to present a new conception of contemporary art, one that is grounded in the richness of the Americas, but is also drawn from contemporary sensibilities and that can be fully appreciated by everyone with a close connection to Mexico City,” said Ben-Ari. “ICA’s fellows give this new vision a life of its own as they explore and seek different ways of thinking about the Americas", "The next Biennial should be held in 2020. \n\n\nThe Philadelphia Museum of Art (PMA) has been gifted a massive new sculpture by artist Paul Gauguin\u0097a work that will be installed in its new home on East Bank Street. The work, entitled Sol Invictus, is a giant bronze statue that will hang in the museum’s lobby. The work is a depiction of the American Civil War and the events that occurred during the conflict, depicting Confederate soldiers as well as civilians who died in the line of duty.“At this historic moment, when the PA celebrates its 150th anniversary and the Museum is preparing to present the retrospective ‘Paul Gauguin: The Figure in the Window’ on October 27, the PA has chosen to dedicate the weeks leading up to the retrospective to develop an awareness of and appreciation of the enduring legacy of the artist,” said museum director Christopher Bedford. The museum also revealed that it is planning to open a new biennial of modern and contemporary art, “The Future is Present,” in 2021. The biennial will focus on the work of the late American artist Ron Gorchov, who was a cofounder of Gorchov + Zegna.", "The next Biennial should take place in 2021, and the ten-year anniversary of its founding should be celebrated with a new exhibition, “Rare Art: from the collection of the Biennials.” In the meantime, the exhibition will continue to present artists and exhibitions that represent a large-scale international community. The full list of participating artists and institutions is as follows:Art Club International Berlin (BKA)BKA Berlin (BKA)BKA Berlin (BKA)BKA Berlin (BKA)BKA Berlin (BKA)BKA Berlin (BKA)BKA Berlin (BKA)BKA Berlin (BKA)BKA Berlin (BKA)BKA Berlin (BKA)BKA Berlin (BKA)BKA Berlin (BKA)BKA Berlin (BKA)BKA Berlin (BKA)BKA Berlin (BKA)BKA Berlin (BKA)BKA Berlin (BKA)BKA Berlin (BKA)BKA Berlin (BKA)BKA Berlin (BKA)BKA Berlin (BKA)BKA Berlin (BKA)BKA Berlin (BKA)BKA Berlin (BKA)BKA Berlin (BKA)", "The next Biennial should take place at the Kunsthalle Basel from March 16 to March 20, 2020. In a statement issued by the exhibition organiser, Sophie Dittrich, the Kunsthalle Basel director Dieter Boeschke, and the Kunstplatz in Berlin, the organization said: “Together with the rest of Germany, we are delighted to announce that the next edition of the Index Biennial will take place at the Kunstplatz in Berlin. Its lineup will include a selection of the 100 most important works by forty-nine artists in the exhibition’s first edition, as well as a selection of new works by emerging and established artists. The newly commissioned works will be presented in the spring of 2021.”The fifty-eighth edition will be held at the Kunstplatz from March 12 to March 14, 2021. The fifty-ninth will be held at the Academy of Fine Arts of the Arts of the Faculty of Arts, Vienna, from March 13 to March 15, 2020. During the exhibition, the artists will have a chance to present their works for the first time.\n\n\nThe San Francisco Museum of Modern Art (SFMoMA) has received a gift of twenty-five", "The next Biennial should discuss the contemporary art of India, and the importance of Bollywood, and should invite Indian artists to participate.  The Biennial is also working towards the establishment of a nomination committee comprised of K. Sikri (South), M.N. Anand (Nilamas), and S.H.S. Chakraborty (Rooms & Spaces) to advise the exhibition on future exhibition plans. For more information about the next Biennial, you can visit the National Gallery of Art in Washington, DC, or the Art Gallery of Detroit, in Dearborn, Michigan. The Art of Living, which is sponsored by the Guggenheim Museum in New York and the Diller Scofidio + Renfro Art Foundation in New York, will also host a biennial about the art of hospitality in 2021. \n\n\nA group of artists, collectors, and other cultural figures have launched a campaign to have the Tate in London and the Tate Modern closed during the Covid-19 pandemic, the New York Times reports. The artists have created the #TateOut campaign, which has received nearly one thousand signatories—including Michael Chaney (New York), Winif", "The next Biennial should be held in 2021, the date of her death.\n\n\nThe Amsterdam Biennial, which opened on September 22 and runs through November 28, 2020, has announced that it will reevaluate its future programming following a wave of protests in the Netherlands and around the world over the past few months. The reopening of the exhibition was celebrated last week with the opening of a new exhibition on the contemporary art scene at the fair. Titled “Art and Resistance,” the show featured work by artists who were active in the ongoing anti-austerity movement, including Sabine Schmitz, who created the subversion and destruction of public art installations in the location of the former Thoma-Karl Wirbel–designed KASAM campus in the city of Rotterdam, and Kjetilma Aarhus, who created a series of works that question the state of contemporary art in Norway and the United Kingdom.Commenting on the new exhibition, the fair’s artistic director, Pedram Oostrup, said: “The new show is as important for us as it is for the participants: it reaffirms the importance of dialogue and the importance of collaboration. We wanted a show that involves the artist,", "The next Biennial should take place in the year 2021. The exhibition will include a section on the Palestinian people and will hold the first exhibition to showcase the work of the newly established symfony, the Biennale di Bermini. The title of the show is Biennale di Trisulti e il Paese. The Biennale di Trisulti e il Paese will be published by the Italian art publisher Cagitaggio after a five-month, three-city run. The show will have a gallery exhibition in Rome, a special exhibition at the Sesta Museum and the Taggiolo, and an online version. The call for proposals was made at the end of February and will run until March 15. The deadline for the symfony is March 11.The biennial will showcase eight works by the renowned Italian artist, painter, and sculptor Enrico Castinotti. The exhibition will take the form of a biennial collection that will be curated by a committee of artists, architects, and curators appointed by the artist himself. The list of proposed artists is as follows: Sebastian Alsop, Augustin Bain, Gianluca Belli, E", "The next Biennial should start as planned but would likely have to cancel the exhibition in an attempt to find a new venue.”The decision to move the two exhibitions was made soon after the exhibition announced that it would cancel its 2021 editions, which were set to run from September 27 to September 29. The move followed the announcement that the biennial would remain closed indefinitely, and that it would begin inviting visitors again on September 29. The move came after several weeks of protests at the exhibition, which has been closed since September 14.The move was made in an attempt to minimize the impact of a coronavirus that has affected more than twenty countries worldwide. According to the New York Times, the coronavirus has been linked to at least seven deaths and has sickened at least 167,000 people since it was first reported in Wuhan, China, on August 6. \n\n\nThe Mohawk and the Ottawa Art Gallery (MOG) have signed a long-term agreement that will see the Mohawk Institute for the Arts (MIAs) move to the Ottawa Armory, which opened in 2016 and has since been working to find a new home for its collection, including works by artists such as Richard Anuszkiewicz, Iván Ar", "The next Biennial should focus on how to create and cultivate an international network of research institutions in the city, which will host twenty-eight exhibitions in a row and deliver a number of major public events. It will also share the stages with the New Museum and will introduce a new program of programming. “Themes that are rich in stories of human endeavour, with a particular focus on the theme of the biennial, the future, which is the theme of our new museum,” said Michele DiCarlo, cochair of the biennial committee.DiCarlo added that the biennial “isn’t about to be an exhibition about art, it is about to be about the future.”\n\n\nThe Philip Johnson Foundation, a New York–based organization that supports artists and their projects through its annual $500,000 prize, has announced that it will award $75 million to ten artists this year, which was selected by a jury comprising artists Eileen Myles, José Sánchez, Domenick Rizzo, and Michael Stipe, as well as Walker Art Center curator and writer Ceesa Wilson. The ten recipients are Leo Barozzi, Paul Cézanne, R", "The next Biennial should be held in 2020, Jason Ortega, director of the Center for Art and Development at the University of Havana, told the New York Times. The institution will be equipped with more than 1,500 works on paper and will be located in a renovated nineteenth-century warehouse. The exhibition is being organized by the Centre for Art and Culture of Santo Domingos and the Centre for Art and Culture of Havana, as part of a larger initiative to rotate its curators and present artists. The first exhibition, titled Mirabile y lo que, (I want to begin again), was presented by Larissa Almena in 2016 and will run until January 9, 2020.\n\n\nThe Museum of Fine Arts (MFA) in Boston has received a gift of more than 7,500 photographs by the late Belgian master Jan and his wife, Wilhelma, in the form of a massive four-hundred-thousand-photo print; the museum also had to remove fifty-one artifacts, including a series of a century-old drawings by the Dutch artist Willem de Kooning, which were on display in a museum dedicated to the artist.According to the New York Times, the couple donated the", "The next Biennial should take place in the Waldorf Astoria in November 2021. The biennial will not be the first time a professor from the School of Advanced Studies (SAAS) of the University of Chicago has staged a show at the National Gallery of Art. \n\n\nWith a little over two weeks left in the new fiscal year, the United States House of Representatives voted yesterday to extend the current federal spending bill through March 22, 2022, extending the current spending limit through March 22, 2024. The spending bill also contains $865 billion for the Department of the Interior, including $188 billion for the National Endowment for the Arts, $149 billion for the Environmental Protection Agency, and $78 billion for the Food and Drug Administration. The legislation, which was passed by a vote of 225 to 205, also extends the debt limit through March 22, and will fund the government through March 22, 2022, at a time when the economy is already struggling due to the coronavirus pandemic.Although the bill will keep the government funded at least through March 22, many states are expecting a budget blowout that could cripple their economies. Although the government will initially continue operating under a $56 billion emergency funding source, it will shuttered by", "The next Biennial should be held in 2024 and will be held in the city of London. The museum hopes that the exhibition will draw visitors back to the Biennial in 2020. The biennial is currently on view through February 21.\n\n\nThe Chicago Architecture Center (CAC) has received a gift of eighteen paintings and works on paper by the late Chilean artist Miguel Ángel de Campos. The works, which were acquired by the institution as part of a sale of works that were on display at the institution in 2018, were purchased by Brian and Rochelle Edwards of The Field Museum of Art in Kansas City, Missouri.“This is a great honor to be able to present the works to the public for the first time,” said CAC director Michael McCarthy. “We are grateful to the Edwards brothers for their generosity in recognizing the value of these works and for lending them to the CAC in recognition of their incredible commitment to the art of the late artist Miguel Ángel de Campos.”In addition to the works, the Edwardss also received a signed statement from Miguel de Campos’s son, Jorge de Campos, a Chilean artist who was active in the country, that said the family received", "The next Biennial should begin as planned in March 2019 and conclude in June 2020. The series will be based in a theme park in Tokyo, Akademi Dei, and will feature work by sixty artists, including Haruka Ihara, Kuniharu Kusuda, Yoshitomo Koki, and Tangei Kihara, and will take place in the grand gardens of the Nara City Museum in Kasuga City in Japan.\n\n\nThe Portland Museum of Art (PMA) in Maine has received a gift of seventy-eight works by American artist Nelson Aldridge, whose work explores the notion of what he terms a surrealist conception of landscape. Through a series of public events, the museum will present the work, An American Dream, at its inaugural PMA biennial Exhibition, which will take place in 2021.From the artist’s graphically detailed murals and sculptural creations to his sharply observed primary-colored primary-color paintings, An American Dream will present a celebration of the American dream and a celebration of the artist’s legacy. The exhibition will feature works by fifty-eight artists selected by the core team of PMA’s Arts & Cultures Department, which includes Aimee Gentry, Nikki", "The next Biennial should focus on developing new ways for artists and institutions to engage with and use digital platforms. We are open to new ideas and strategies and excited to further engage with the great artists and organizations of our generation.”\n\n\nThe National Union of Journalists of Great Britain (NUGB) has launched a new information portal that will enable users to find out more about the work of British artists, including some of the most well-known contemporary artists, such as Jo Cox, Laura Owens, and Toby Barlow, and will be updated regularly.The site will be hosted by the NUGB, a British nonprofit, and will focus on presenting a range of information, including contact details, about British artists. The portal will also include a virtual catalogue of the works in the exhibition, which will be organized chronologically, by artist, and will be presented as a digital library. The exhibition will travel to the National Portrait Gallery, the Tate, and the Royal Shakespeare Company. NUGB’s director, Cathy Bennett, told Artnet: “This is an unprecedented and challenging time for artists worldwide as we come to terms with the challenges and opportunities of Brexit. We have developed a platform to connect with and engage with our artists to", "The next Biennial should be held at the Institute of Contemporary Art (ICA) in London, which will host the second edition of the festival in 2020. The agency will also commission a new work from American artist Michael Ondaatje to be presented in collaboration with Nara Wilson, who is currently working on a new project for the exhibition.The mid-November event will be hosted at the Institute of Contemporary Art (ICA) in London. The 2019 edition, which also featured work by twenty-four artists chosen by the institute, was canceled due to Covid-19 and the exhibition was moved to the Museum of Modern Art (MoMA) in New York. The 2019 exhibition will be held at the Institute of Contemporary Art (ICA) in London. The exhibition was created to recognize the contributions of American artists to the United Kingdom. The exhibition will be marked by three sessions of silent collaboration: 1) Aeon B. Williams: The New Era, 2019; 2) Humberto Brezina: Stories of a Life, 2021; and 3) Zoya Jocke: The Set, 2019. In the first installment of the exhibition, Williams will present his work Aeon B. Williams: The New Era, 2019,", "The next Biennial should focus on the history of the exhibition, which is currently on display in the formative studio of the artist, and examine the exhibition as a whole: “We must remember that the exhibition is not the same as the exhibition, but rather the exposition of the exhibition,” the platform says.The Paris-based artist and curator Marcel Prouvé is now a professor at the University of Notre Dame in the United States and has presented works at various historical events, including the Museum of Modern Art and the Museum of Modern Art, Abu Dhabi. More recently, he has focused on critical issues of the twentieth century, including the Vietnam War and climate change, and has been included in exhibitions such as the Venice Biennale (2017), the London Triennale (2011), and the Venice namada (2005). In the next edition of the show, which has yet to be determined, the artist will present a new work that will examine the relationship between art and technology.The exhibition will take place at the Museo de Arte Contemporáneo Porto, the Museo de Arte de Porto, the Museo de Arte de Valencia, and the Museo de Arte de Madrid.\n\n\n", "The next Biennial should take place in Vienna in 2021 and will consist of over four thousand artists from thirty-eight countries. The theme will be “Biological Anthropology,” a reference to a poem by Karl König that addresses the evolution of civilization as the result of the division of the world into biological and non-biological entities.\n\n\nThe Cleveland Museum of Art (CMA) has received a gift of more than five hundred artworks from the anonymous donor behind the prestigious Sixty-Third Design International in New York. Founded in 1972 by two brothers, Art and Peter Zumthor, the exhibition was originally organized as a series of essays by Art, who was then serving as a visiting assistant professor at Columbia University, but evolved into a joint project between the two curators.“The project was conceived as a platform for engaging with contemporary design and visual art,” Peter Zumthor said in a statement. “The exhibition has served as a catalyst for people to think about the various dimensions of art and about the relationship between art and design, open up new possibilities for both art and design.”CMA curator Olivier Dallier, who curated the exhibition for twenty years, said: “", "The next Biennial should be held in 2020, according to the organizers, but that date has yet to be set.\n\n\nA group of artists, designers, and writers are suing the National Geographic Society in an attempt to force the organization to compensate them for their work being included in a proposed new edition of the National Geographic Society’s flagship geology book. The lawsuit, which was filed in U.S. District Court in Washington, DC, on March 5, claims that the inclusion of a new set of coordinates for the Earth’s crust that was published as part of a “defect disclosure statement” on August 2, 2017 caused damage to the plaintiffs’ reputations.“This is a case about billions of dollars and I want you to know that if I lose this case, there will be profound consequences,” David Schildkraut, the lawyer representing some of the plaintiffs, told the Art Newspaper. “We’re hoping to get some kind of solution that will prevent this kind of thing from happening again.”The lawsuit argues that the publication of the new coordinates violated the authors’ contractual relationship with National Geographic. The lawsuit is seeking class action status, damages, injunctive relief", "The next Biennial should take place in 24 months. The Biennial for the Arts, curated by Art Georges, will be curated by Vittorio Marcotti, director of the Biennale di Storia di Savo, Milan, in January 2021. The Biennial for the Arts, which will be held in the Mechelen Biennial Center, will have a total budget of $5 million. The venue will be inaugurated with a presentation of works by Anton Kern, Alexin Reich, Hans Neumann, and Paul Mpagi Sepuya, among others. The show will also present its next triennial, which will be in September 2021. The Biennale di Savo will be inaugurated in January 2021 with an exhibition of works by Renaissance artist Igor Edez, who died in 1996, and featuring works by the following artists: Lazaretto Lucio Barbieri, Eddy Barrett, Katherina Cattrell, Fiona Conte, Lina De Rosa, Ettore Del Giudice, Xavier Faubourg, Tina Fernandes, Elliott Futter", "The next Biennial should be held in early 2021, with the first exhibition taking place in the studio of Arsht Galerie in the city of Frankfurt, Germany. The exhibition will be organized as a collaborative, multi-media project, with some three hundred works by thirty-six artists worldwide.The next edition of the Venice Biennale will be held in the Venice Architecture Biennale in October 2021. The project will include a series of online events, screenings, meet-ups and other activities, and will take place at the Los Angeles County Museum of Art (LACMA). The biennial will also present twenty-eight projects and experiences that will be organized in collaboration with local communities in Los Angeles County.Among the projects that will be featured in the 2019 edition of the biennial are a virtual reality experience at the Venice Architecture Biennale, a public art installation in Venice, a traveling micro-golf course in Venice, and a video exhibition at LACMA that will feature photography, sculpture, performance, theater, and installation by twenty-three artists. The show will culminate with a show of works by the internationally acclaimed artist Kiki Smith, who will have a virtual reality experience at the Venice Architecture Biennale in October 2019", "The next Biennial should take place in 2021. View the full list of participating artists and institutions here. \n\n\n\n\n\nThe Tate’s new £35m museum dedicated to black Italian architects, the LaBarge, opened in London on Monday. Designed by the Italian firm Guggenheim Bauhaus, the museum, which will seat 160 people, is located in London’s Hyde Park and will be inaugurated by a presentation of the first model of the sculptor Giotto è Viviani.A retrospective of this work, which was made in the late 1960s and conceptualized in the early 1970s, will be held at the museum alongside the exhibition “The Bauhaus in London: A Visual History.” A retrospective of the works of Josette Wechsler, Antonio Marcotti, Manfred Röth, Olga Rubchinskiy, and Arturo Tosatti will also open at the museum next summer. Giotto è Viviani with the talented Giotto Borghese and Giotto Perotti. \n\n\n\n\n\nThe Italian architect Arno Mayer, who created the breathtakingly opulent Museum of Modern Art (MoMA), was sentenced to", "The next Biennial should take place in the coming years.”The museum has previously staged exhibitions of work by artists such as Thomas M. Smith, Ruth Rabel, and Henry David Thoreau, and is currently working on reopening the museum in an attempt to make the building more accessible to the public.\n\n\nThe Museum of Contemporary Art (MoCA), which recently announced it will open a new forty-one-thousand-square-foot branch in Manhattan in 2020, has released the 2020 schedule for the institution. The institution will be relocated to a new twenty-one,000-square-foot space at 60 East Twenty-Third Street in Manhattan, and will be inaugurated by a monographic exhibition of new works by artist-in-residence Mary Ellen Mark.’Vincent van Gogh was trying to portray in his unfinished masterpiece Exhibition at the Museum of Modern Art,” according to a statement by MoCA director Joshua Helmer. “The exhibition is the focal point and the central point of what will be a new space for the extraordinary at MoCA.”The institution will offer permanent and temporary exhibitions of work by contemporary artists, including Craig Mullican and Nari Ward. The opening of a new", "The next Biennial should be held in early June, in the month of June. The institution is currently closed due to the Covid-19 outbreak, but will resume operations once it reopens.\n\n\nGomez-Bouma, the contemporary art center in the Costa Rican city of Mierte, has been awarded a $150,000 grant by the Coronavirus Aid, Relief, and Security (CARES) Fund. The organization, which is backed by the American Jewish Committee (AJC), is offering $50,000 to any organization that can produce a uniquely American project, a sculpture, installation, performance, or other work that makes ethical and practical use of the resources of the Coronavirus’s epicenter in the United States.The organization that will be selected to produce the piece, which will be made of cast-iron and will likely be on display in the Contemporary Art Biennial in June 2020, is Gomez-Bouma’s design studio at 3350 Nuevo Laredo Blvd. The grant is one of several funding opportunities offered by the fund in support of artists and cultural organizations affected by the coronavirus. The grant will be administered by the Coronav", "The next Biennial should aim to: “reject the current biennial model, which is to build a community around a single exhibition and has serious limitations;” rather than “celebrate the richness and complexity of the contemporary world,” the Biennial will “be about building new practices and new relationships between artists and their audiences through a critical evaluation of the exhibition as a whole.”The 2020 edition, titled “Art and the Body,” will take place at the Museum of Contemporary Art Los Angeles (LACMA). The show will be curated by artist and curator Maren Adès, art critic Vanessa Kent, and art historian and scholar Judith Oxtoby. The first day of the event will be March 11, 2020.\n\n\nThe Center for Contemporary Art Philadelphia (CAMP) announced on Tuesday that it has received a gift of sixty artworks by twenty-eight artists from the Pioneer Art Museum in South Philadelphia. The gift includes works by twenty-six artists from the Philadelphia-based artist-run space the Collective Creatives Collective (CC), as well as two works by artist-and-counseler David Alan Zucker. The ninety-two-piece collection—which included art", "The next Biennial should be held at some point between February and April 2019. The biennial will take the form of a series of talks, each of which will comprise twenty-four artists. The artists will be invited to participate in the biennial in stages throughout Beijing, where they will present their work at the Dalian Art Museum and Biennale Museum, and will then return to Shanghai for the opening exhibition of the Dalian Art Museum and the Dalian Art Museum. The opening of the MFA Arts Academy and the Dalian Art Museum will mark the start of a new partnership between the two institutions. The exhibition will run from September 29 to October 24, 2020.\n\n\nThe architects who designed the $1.2 billion Smithsonian’s new headquarters in Washington, DC, have released a statement on behalf of the institution, which is slated to open in 2021, announcing that the building will include a contemporary art museum and an education center.“We are deeply concerned that the Smithsonian has been so publicly and repeatedly harmed by catastrophic climate change,” said Henry R. Luce, chair and curator of the architecture and design field. “The institution is already experiencing financial hardship as a result of the loss of revenue from events", "The next Biennial should take place in 2020.\n\n\nThe Museum of Contemporary Art (MCA) in Los Angeles announced today that it has received a $1.2 million donation from the Peter W. and Teresa A. Widzevich family, a Los Angeles philanthropist group that has given millions of dollars to arts institutions across the city. The gift includes a large-scale art restoration project that will restore more than 3,000 works spanning the twentieth and twenty-first centuries.The restoration project, which will be funded entirely by the Widzevichs, follows a three-year exploration of the origins of contemporary art in the city, which involved the excavation of more than 100,000 artifacts from Los Angeles’s archives. The work will be exhibited in the museum’s two-hundredth-anniversary retrospective of the curators of the museum, “The Art of Modern Life,” which will open on November 29 and run until January 3, 2021. “We are eager to see this work in the museum,” said Mark Beasley, the MCA’s director of curatorial affairs. “This is a transformative project for Los Angeles—and for the city.”The Wid", "The next Biennial should be held at an appropriate venue within the next few weeks. The exhibition will be hosted by Aristotle Galleries in Athens.\n\n\nThe Solomon R. Guggenheim Museum in New York has appointed Emily Oreskes as its next director. The twenty-nine-year-old, who previously served as the Columbia College Chicago art historian’s assistant, has been named the successor of longtime board president and CEO Sujit Garg.In her new role, Oreskes will be responsible for coordinating programming across the institution, including the development of the museum’s annual Golden Age series, which is led by curator and artist Timur Huzuk; the gallery’s forthcoming exhibition “The Death of Sylvia and the Birth of Elena” and the upcoming exhibition “Coffee in the Studio.” Previously, Oreskes served as an assistant to the curator and art historian A.A. Pei.“We are thrilled to welcome Emily to the Guggenheim,” said Garg. “She brings a keen sense of humor and enthusiasm to the helm of the museum, and has the potential to further our ambitions to present a diverse range of exhibitions and programming across the Guggen", "The next Biennial should be in August 2020, and the event should be hosted at a location outside of London, should it still be held.The exhibition will be hosted at the Center for Contemporary Art (CCA) at the London School of Art (LSE), alongside David H. Kwan (1928–2017), and will be curated by Harriet Finney. The exhibition will include the first exhibition in the series “The Biennial of Modern Art” (2019–20), “The Contemporary Art of Louis Vuitton: The Twelfth Biennial” (2019), and “Louis Vuitton: The Seventh Biennial” (2019).Commenting on the upcoming show, the Arts Council chairman, Sianne Ngai, said: “The new project at the Centre for Contemporary Art is a genuine milestone: it is our first entirely in-house, the first to be held entirely within London, and is the first show featuring work by more than fifty artists. The show will be a true reflection of who we are and where we are going, and we are thrilled to be working with the London-based artists that are making such a remarkable and compelling case for our exhibition.”\n\n\n", "The next Biennial should be announced by the end of this month, but the organizers are already working on developing a platform that will allow visitors to the museum to commission their own work. The installation will be curated by the curator of contemporary art who is also the director of the Musée Musée de Lyon, and will be on view in the museum until March 19. The institution will host the exhibition four times a year, with the opening of the first exhibition being February 28–March 14. The next edition will be held in November 2020 and November 2021, with the second in December 2021.The 2019 exhibition was organized by the Musée Musée de Lyon, and the exhibition was curated by José Luis Pérez. The 2020 edition will be curated by Javier Téllez, the director of the Museo de Arte Contemporáneo de Barcelona.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has welcomed Larry Gagosian as its next director. He will assume his post on March 16. Gagosian, who has helmed the museum since 1988, has a long and storied career in fine art, dating back to the 1960s with his father, who founded the family", "The next Biennial should take place at the Art Galleries of California in Oakland, California, in 2021; the Art Institute of Chicago in 2021; the Museum of Contemporary Art, Los Angeles, in 2021; and the Art Institute of Chicago, the Art Fund, and the California Institute of Technology, in 2021, respectively.\n\n\nThe American artist, activist, and educator Stewart Brand, whose diverse practice spans painting, sculpture, performance, and writing, has died at age seventy-nine at his home in Los Angeles.Born Stewart James Brand in 1937, in Brooklyn, New York, Brand grew up in a Catholic family in suburban New York and attended the Catholic high school in Rockland County, where his father was a carpenter. In 1951, after receiving his bachelor’s degree from the Catholic University of the Arts, Brand moved to New York, where he enrolled at the school of Joan Mitchell, which housed many of his peers at the time. Brand eventually became a junior member of the group The Jesus Camp, which met in a converted barn in the suburb of Yonkers, where the Jesus and Mary Chain—a group of New York City practitioners that included Norma & Edith, Willem de Kooning, and Pierre Teudt—lived", "The next Biennial should feature a selection of new works by thirty-five contemporary artists. The event will also focus on the relationship between art and politics and will be held in the capital of Belarus, Minsk.The forthcoming exhibition will be organized by the Minsk Contemporary Art Museum (MCA), the Minsk Art Palace, and Minsk State University. The exhibition will run for twelve weeks and will feature some seventy new works.“We are delighted that the future of the Biennial is at the MCA and Minsk,” said Masha Gevorkina, president of the MCA and Minsk Art Palace. “The MCA and Minsk Art Palace is a unique institution, founded by the people of Belarus and is a major cultural and cultural attraction in the region. We are convinced that the exhibition will be a great success and we look forward to collaborating with the public and the MCA on its future.”\n\n\nThe Museum of Fine Arts (MFA) in Atlanta has received a gift worth $5 million from the estate of Jacqueline and Alexander Pfeifer. The donation was made in recognition of the philanthropy and dedication of the Pfeifer family to the museum. It comes on the heels of a $", "The next Biennial should be held at the Museo de Arte Contemporáneo in Madrid in 2020, and the next should be held in Moscow in 2022. The series is being organized by the Política de Artes in collaboration with the Institute for Contemporary Art, Architecture and Design in Madrid, the Universidad de los Andes, and the Universidad de Política.\n\n\nThe Institute of Contemporary Art, Architecture and Design (ICAAD) in Los Angeles has appointed Maya Lin as its new director. Lin comes to ICAAD from the Mexican Cultural and Performing Arts Center (CACAM), where she has served as an assistant for the past six years. She succeeds Pedro Morales, who will retire at the end of the calendar year after twenty-five years at the helm of the institution.“Having spent more than twenty years at CACAM, Maya has the opportunity to further develop and strengthen the organization’s art and architecture programs as we present our annual exhibition, ‘The American Dream: Art in the Age of Black Power’ from March 2019 to March 2020,” said board chair Alex Ghossein . “I can’t wait to", "The next Biennial should be held in 2020.​\n\n\nThe Museum of Contemporary Art (MCA) in New York has announced the list of artists who will participate in its next edition, Art at the Museum, which will be held from September 5 to September 7. The twenty-sixth edition of the event will kick off with a presentation of the Biennial’s first collection, Diana Nolen’s Divine Comedy, of which there are currently no photographs. The exhibition will be followed by a panel discussion with artists such as Wangechi Mutu, Willam Wilfred, and Anne-Marie Robles.The 2019 edition, titled Art at the Museum, was organized by the MCA for the first time in its thirty-year history. The theme for the event was the body—particularly during pregnancy and childbirth, the transition between men and women, and the experience of a new life. The program was also inspired by the biennial’s inaugural edition, which was held in 2005 and closed to the public that September. The museum unveiled its new exhibition space, the Museum of Contemporary Art at Home, and introduced new programs and exhibitions in the fall of 2019.\n\n\nA group", "The next Biennial should be held in 2022. One of the exhibitors is New York’s African American Museum, which announced last month that it is moving to a new space in downtown Manhattan.The Museum of Modern Art (MoMA) in New York has said that it is still in the process of determining the future of its West Side space. The institution originally proposed that the museum reopen in 2021, but the West Side’s redevelopment plans have shifted over the course of the last decade. The institution now believes that the exhibition space will remain open through 2024. In a statement issued by MoMA, it said: “With the announcement of the museum’s 2020 year, we are excited to celebrate the museum’s history as a beacon of diversity, diversity of ideas, and diversity of people. Due to the museum’s expansion in the last decade, with the addition of a new chapter within the museum, MoMA is now committed to presenting an international exhibition series that reflects the diverse histories and cultures of the world, as well as the museum’s community.”The Los Angeles County Museum of Art (LACMA) also announced that it will hold its first exhibition of works by Yinka Shonibare", "The next Biennial should be prescient in acknowledging our collective place as the world's preeminent and most influential contemporary art museum, in consolidating our collection, instilling in our visitors the practices of a museum that has been there since its inception, and in providing an occasion for reflection on art history and its relevance in this century.”\n\n\nThe Walt Disney Company has announced this year’s theme for its annual November cover—a collaboration between artist and philosopher, Christopher Wool. While the project was inspired by a Decalogue-like scene from The Princess Bride, the Walt Disney Company’s core philosophy is skeptical of the currently prevalent notion of art and philosophy as one and the same. “The Disney Company is about to become an important symbol of the future of art and of the world,” said Disney CEO Bob Iger. “The Disney Company is about to become a full and integrated part of the history of art, history, and language.”At the close of the exhibition, Marc-Olivier de la Peyre, the inaugural winner of the 2019 Hugo Boss Prize, and Joachim Neugroschel, the winner of the 2019 Los Angeles Art Book Award, were presented with a gala gift", "The next Biennial should take place in 2020, and the three-day event will be hosted by the BERLIN-CHURCH Museum of Tropical Forests in Berlin, the BERLIN-STITI in Vienna, and the BERLIN-STITI Museum of Science in Cologne. The 2020 event will be held at the Museum Karlsruhe and will be the last major endeavor of the institute.\n\n\nThe Museum of Contemporary Art (MoCA) in San Francisco is partnering with the California Institute of Technology (Caltech) to create a new type of ten-thousand-piece museum, called the 'Institute for Contemporary Art Science, Technology, and Society.” Its first exhibition, “Institute for Contemporary Art Science, Technology, and Society: The Future Is Now,” will be on view at the institute in March 2020.The partnership between the museums, which is called “transformational,” follows Caltech’s announcement that it is planning to create two new, smaller, museum complexes. The new sites will be located in the city of Santa Barbara and the tiny town of Mountain View near the Pacific Ocean. The institute’s current campus in Pasadena, California, will", "The next Biennial should take place in the year 2021. For a schedule of upcoming events, visit:\n\nAdvertisement\n\nAdvertisement\n\nAdvertisement\n\nAdvertisement\n\nAdvertisement\n\nAdvertisement\n\n\nThe Biennial of British Art, which opened in London in October 2019, is also planning to launch a digital platform in 2021. The platform will host the biennial’s exhibitions, residencies, and presentations, and will invite visitors to visit the event.“We are thrilled to launch a new platform as part of the project, which celebrates the rich history of British art,” said Lionel Barber, director of the Tate. “This is a flagship project for the museum, and we expect it will live up to the legacy of the institution, which is to welcome people and explore ideas. We know that many people want to hear from you and examine art in the museum, and we know that many people are looking for easy access to art and art history. We know that the future of art and art history is in your hands.”\n\n\nArt historian, curator, and educator Diego Barba has been named director of the showpiece venue Guggenheim Contemporary in Madrid, Spain. The exhibition, which will focus on a small", "The next Biennial should be held in the coming months. \n\n\nThe National Gallery of Art (NGA) in Washington, DC, has launched a $500,000 fund for artists and creatives facing financial hardship as a result of the coronavirus pandemic. The fund was created in partnership with the American Alliance of Museums (AAM), which is seeking $5.2 million from the NGA’s endowment.“As the number one noncollecting museum in the nation, we have seen first-hand how the Covid-19 crisis impacts our staff and our collections,” said NGA director Deborah Teitelbaum. “With our new, expanded fund, we are creating an additional opportunity for artists and small museums across America to secure new and better-paid employment while we’re fully staffed.”The fund was established to compensate artists and small museums for the cost of relocation and to help offset the financial impact of the Covid-19 pandemic. It also allows the NGA to mitigate the financial impact of the Covid-19 pandemic on institutions by extending the terms of the museum’s leases through the 2021–2022 fiscal year.Under the program", "The next Biennial should take place in 2021, but details regarding its format and schedule have yet to be decided.\n\n\nThe Museum of Modern Art (MoMA) has received a gift of twenty-six works by Belgian-born, Russian-American artist Bertrand Guené. The works, which were on display during the annual exhibition “Bertrand Guené: Eight Years of Painting” in 2003, form part of a major collection that will soon be inaugurated by the artist at the Metropolitan Museum of Art in New York.The collection—which consists of works dating from the 1930s to the 1970s—will be transported to the Museum of Modern Art in 2020 and will then return to Belgium, where the artist lives and works. The exhibition is one of several he has staged since 2003 in the United States. Guené’s work is part of the Bertrand Guené: Eight Years of Painting exhibition series, which celebrates the artist’s seventy-fifth birthday.The exhibition was founded by Alan Levin and Nicholas Negrete in 1999 to raise funds for the artist’s medical practice, which is affiliated with the University of Maastricht.\n\n\nThe headquarters of the Belgian National Socialist Party (FN", "The next Biennial should be held in 2020. \n\n\nThe Egyptian Museum of Art (EMAD) has announced that it plans to begin a full-on restructuring of its collection and its collection strategy. Following an overhaul of the institution’s collection after it was declared a cultural center by the Ministry of Cultural Heritage and Arts, the museum will begin by retrenchment, in order to achieve greater conservation of the ancient works in its collection. In order to achieve this, the museum will rebuild the Egyptian Quarter, which was the center of the ancient city of Luxor and was the site of a major exhibition in the 1990s.Titled “The Egyptian Story,” the exhibition featured works by fifty-six artists, including Sufyan Farid, Hisham al-Hashemi, Mohamed Faour, and Ahmed Saad, as well as works by contemporary artists such as Bernardo Battista, Tom Bont, and Charles Bronson. The quarter will also undergo a major renovation, with more than two thousand square feet of new galleries, rooms to display exhibitions and seminars, and a restoration of the ancient amphitheatre.The new building will be inaugurated by a new exhibition, �", "The next Biennial should be in 2021 and the 1813 edition will be staged at the Museum of Fine Arts, Boston, the Boston Museum of Art and the Metropolitan Museum of Art, the latter of which opened in 1970.\n\n\nThe French Middle East art historian Gilles Deleuze and the Spanish-born, London-based artist Yayoi Kusama have been selected as the winners of the biannual Prix de l'Intervention. The exhibition, which runs through October 8 at the Musée d’Art Contemporain in Paris, was organized by the Musée de Lyon and the Musée d’Orsay in partnership with the six international committees that comprise the Architectural Association of France (AFA); the Association of French Art Teachers; the Association de Cinéma (AC); and the Palais de Tokyo in Paris.“For more than a decade, Deleuze’s installations have challenged and enhanced the idea of architecture from the ground up, creating works that reach beyond the parameters of language and make direct contact with the viewer,” said Andreas Fiedler, director of the AFA. “The team’s work has been used for both historical and artistic goals.", "The next Biennial should involve returning the third exhibition to the museum. While the exact date will be announced, the lineup will likely include works from the first two exhibitions. The new site is slated to open in 2020. \n\n\nThe Institute of Contemporary Art (ICA) in London has appointed Tiziana Cipolletta as the institute’s next director. Cipolletta comes to the institution from the Museum of Modern Art (MoMA), where she has served as interim director since November 2019, and will assume her new responsibilities in January 2021.“I have been following Tiziana Cipolletta’s career for some time and have been impressed by her ambition and willingness to take risks,” said James Cuno, chair of MoMA’s board of trustees and director of the Institute of Contemporary Art. “To succeed David Gandy as director of the Institute of Contemporary Arts, we needed an experienced leader who could drive the mission while retaining the creativity and innovation that made Tiziana Cipolletta a true visionary leader. I am delighted to welcome her to the ICA. She has the tools and knowledge needed to ensure the ICA’s future success and we look", "The next Biennial should be held at least once a year. The next Exhibition should be held at least once a year. The next Book Club should be held at least once a year. An alternative to the model of the biennial would be to organize biennials in which each member would be given a set number of years to organize their own exhibition and to have exhibitions organized by their choice. In the latter case, the biennial would continue to be an annual event, but each biennial would be the occasion for a limited number of exhibitions. An online edition of the biennial, which could be viewed by a large online audience, would be free of charge.The new biennial program would be developed in collaboration with the local and international artists and cultural organizations of the city of Geneva. The first phase of the project would begin in January 2020 with the launch of the 2017 exhibition “Titel: Telling Stories” at the Modern Museum in Geneva. The second phase of the project would focus on analyzing contemporary art and the visual arts in January 2021 and March 2021. The third phase would involve organizing “Revival: Architecture of Dreams” in June 2021 and “Theater of Operations” in November", "The next Biennial should be the annual 'Marrakech Show', taking place in the city from September 17 to September 20. The exhibition will be hosted by exhibition house Susser-Girard, and will be organized by the French company Maison Marionite. The event will promote the work of contemporary artists, and will be open to the public for free. In the lead-up to the event, organisers have released a series of statements that have been translated into French. Maison Marionite’s statement reads: The theme of the upcoming Biennial is the direct connection between the aesthetic experience of artists and that of their medium, which is reflected in the amount of research and experimentation that is being carried out by the artists in this exhibition. In the same way that the Biennial Workshop in Venice is about the creation of new visions for art, this exhibition is about the form of the artist as an object. I thank Maison Marionite for the invitation to the show. The theme of the exhibition is the two worlds of art and of the artist. The exhibition will present different kinds of art and will focus on the ways in which artists work in order to shape and change the way that we perceive and communicate with the physical", "The next Biennial should be held in 2021. The museum has received a $100,000 grant from the Esther and Alfred Perman Fund, an army-wide strategic grant program that was created in 2010 to encourage public engagement with photography. \n\n\nFrieze announced today that it is extending the partnership between New York’s Museum of Modern Art (MoMA) and the Pérez Artes in Mexico City through 2021. The extension will allow MoMA and the Pérez Artes to create a special exhibition for their patrons’ participation. The show will take up themes related to modern art and the effects art has had on the lives of Mexican artists, with a view to commemorating the centennial year of the Pérez Artes.“In 2021, MoMA will present an exhibition devoted entirely to the Pérez Artes’ work, and the Pérez Artes’ contribution to twentieth century art in America,” said Mark Zuckerberg, chief executive of Facebook. “The partnership between MoMA and the Pérez Artes will continue to be a platform for artists from Mexico and around the world, and our artists will have a", "The next Biennial should focus on the impact of the ongoing global health crisis on cultural and social life, and on the intellectual, creative, and physical health and well-being of all people, including people of various nationalities, regions, and cultures.\n\n\nArt historian, scholar, and curator Stuart Hall, who curated the seventeenth edition of the Barcelona Biennial (ABT), has called for the boycott of the event, which will take place in the city from September 28 to October 22, to instead dedicate funds to climate change. “It is crucial for the world to unite behind a global, international, and radical new universal right of all peoples to live in harmony with one another and the natural world,” Hall wrote in the April 2017 issue of Artforum. Organized by the Barcelona-based collective Artangels, the event will run four days long. According to the Barcelona Independent, the event will require up to twenty-nine thousand participants.In a letter to the organizers of ABT, Hall wrote: “The past few months have seen the institutions of art and architecture in Barcelona, Barcelona, and Barcelona, Catalonia, develop in close collaboration with the climate crisis. The resulting exhibition ‘Grand Challenges’\u0097contained", "The next Biennial should be held in 2020. In a statement, the French Ministry of Culture said: “The new work will serve as a continuation of the French spirit of innovation, its commitment to discovery and its inherent willingness to offer unexpected solutions. The new work will be the first major work of the cycle, and will be published in the fall of 2020. Next year, the new work will be based in Paris, in a collection of the same name, and will be presented as part of the Paris Triennial. The new work will be a tribute to the work of Jean-Luc Moulène, a master of the arts who was also a specialist of contemporary art and a major influence on the structure and development of France’s art museum, the Louvre, and the Musée d’Orsay.In a review of the exhibition, Artforum’s Augustine White wrote that the work is “legendary, haunting, and beguilingly romantic, capturing the ideal of art and the artist in a way that will delight and amaze. The show isn’t just about to open, but it already has the chance to be one of the most ambitious exhibitions", "The next Biennial should be a major celebration of the visual arts, history, and culture. We are ready to transform our city into a true reflection of the diversity of the world.”Lehmann Maupin, New York: “We are in a moment of extraordinary change for the arts. New policies and opportunities are emerging that are reshaping how we organize and consume art, and with them, the future of the arts. We must work together to sustain and develop the arts and cultural sector as a vital part of New York City’s future.” \n\n\nThe Museum of Modern Art (MoMA) in New York has withdrawn a painting by Erma Bomwood that was on display in “A Sculptor”—a series of works that began in 2007 and was presented by the artist in the form of a living sculpture made of silicone that was placed in a museum’s permanent collection. The museum has since cited the artist’s “extreme caution” in the installation, “a touch of humor, a sense of humor that is often a little bit too playful,” as the reason for the exhibition’s cancellation.Close to eighty works by Bomwood, who", "The next Biennial should take place in 2020. \n\n\nThe National Museum of Fine Arts (MFA) in Washington, DC, is taking the first steps toward revamping its exhibition architecture in an attempt to attract more visitors from around the country. The institution, which was founded by philanthropist Milton Berle, passed a new set of rules in April 2020 that will allow it more flexibility in how it distributes funds from its endowment to “enhance the visitor experience by presenting more of the museum’s collections in more engaging ways.” In a memorandum for the institution’s board of directors, Berle outlined his vision for the future of the museum, which he described as “compelling, accessible, and timely.” He also said that the future of the institution will rest on whether the public embraces the changes, which he called “transformational.” As part of the reform, the museum will open an extension at the intersection of Pennsylvania and Ohio Avenues in the city of Washington, DC, and will begin charging visitors to enter the institution. The project also involves adding seven hundred square feet of retail space on the first floor, extending the circulation galleries, adding classroom space for the program", "The next Biennial should be held at a site that has been selected by the City Council, and is scheduled to open in 2020. The decision to hold the event in an industrial park was made after an extensive review of the city’s parkland and waterfront.“We considered a variety of factors in making the decision to move the show to the waterfront, including the growth of the Biennial, the popularity, accessibility, and the economic impact of the waterfront,” said Councilman Jimmy Van Bramer. In addition to the economic impact of the waterfront, the park is home to numerous cultural institutions and historic sites, including the National Gallery of Art and the Metropolitan Museum of Art.\n\n\nThe Museum of Fine Arts (MFA) in Boston announced today the twenty-six artists whose works will be included in the museum’s exhibition “Annie,” which opens on November 28. The museum revealed the artists who will participate in the show, which will be led by Matthew Higgs, in partnership with the museum. The exhibition will feature work by artists such as Minimalism, Michael Chabon, Svetlana Barka, Paul Gauguin, and David Mitchell, as well as a selection of works by", "The next Biennial should be held in the summer of 2021.The very next year, the museum will stage a new exhibition devoted to the works of artist Terada Takemoto. The museum will also be transformed by the foundation of the Japanese arts, the Kojima Foundation. The redevelopment of the museum is part of its revitalization plan. The Kojima Foundation has also pledged to spend ¥100 million on the renovation of the museum. The funds will be used to create a new exhibition dedicated to the artist's work and the remodel of the building in order to make it more accessible.The Kojima Museum is also planning to build a new sculpture garden and garden pavilion. The new pavilion will be installed in the museum, which is currently undergoing a $70 million facelift and will boast a new urban courtyard. The garden will be located on the fourth floor and will be located in between two existing pavilions, one of which will be renovated to serve as a gallery.The Kojima Museum is also planning to open a new branch of the museum in the city of Nagoya. The new branch will be located in the former Kojima Glass Works and will operate on a two-year, $80 million project", "The next Biennial should be held in 2020, with a new theme:”The Transformation of the Future.” \n\n\nThe Metropolitan Museum of Art in New York has commissioned photojournalist Nari Ward to create a new exhibition featuring six works by American artist Philip H. van Tilbury, including A Mother and a Child in the Garden, 1923, a series of photographs depicting landscapes such as the Alps, and The Ledge, 1970, which is a photo essay on a public bench in a park.“We are thrilled that The Met will continue to support Nancy and Ken in their mission to present our collection to the public,” said van Tilbury’s husband, Wolfgang van Tilbury. “Her work is a great reflection of the way in which she relates to and celebrates the American dream. We are confident that Nari will continue to push the envelope and continue to delight us with her extraordinary and moving visual art.” Wang, who is a trustee of the museum, said: “Nari’s photographs provide a window into the world she photographs, a window into a world she never fully entered. Her subjects are extraordinary and bring her subjects to life through extraordinary mediums. She", "The next Biennial should be held at least a decade from now. It should be a continuation of the current work\u0097the third one is currently on view in the United States.” The first one, In Praise of the Serpent, has also received a $500,000 grant from the American Alliance of Museums and the Christopher Knight Foundation. The grant was established after the artist founded the National Gallery of Art in Washington, DC, and the artist-run nonprofit Serpent Gallery in Black to archive his work, which is housed in the Smithsonian Institution’s National Museum of American Art, where it will undergo a major reopening this fall.\n\n\nMore than 1,100 artists and collectives have signed an open letter demanding that New York City’s Metropolitan Museum of Art (MoCA) remove the Confederate monument dedicated to General Robert E. Lee, the commander of the Confederate Army of Northern Virginia, in Alexandria, Virginia. The artists’ demand that the museum remove the controversial monument due to its connection to the deadly 2017 terrorist attack in Charlottesville, Virginia, that left one person dead and more than a thousand injured.As the violence in the United States escalates and racial tensions escalate, the city’", "The next Biennial should welcome the public for its May 26–June 3 event.   “The Biennial is the most important milestone in our collaboration with the artist to date,” said Sasa. “He has chosen to give us the opportunity to build on the success of our project, to create new works, and to share what he has learned with the public. I’m equally proud of how this project has evolved since its inception, and of the work that will inevitably happen along the way.”\n\n\nThe museum has issued a public apology to the city of Long Island City, New York, after an employee allegedly made a derogatory comment about a female visitor in the museum’s visitor center. The incident, which took place at the institution on May 27, involved the exhibition “It’s Not the End of the World,” a retrospective of the same title, and involved an unidentified woman who made a complaint after visiting the museum.The museum, located at 1305 East Seventy-Third Street in Long Island City, issued the apology in a statement that reads in part: “The museum has come under scrutiny for some time now for its failure to address issues of sexism and", "The next Biennial should begin on the 15th of June, 2020 and conclude on the 23rd of December, 2021. Priorities for the 2020 edition include: 1. Reunification of the United States and South Korea 2. The preservation of Asian art in the United States and Europe. 3. The development of the field and its exhibition program. 4. The preservation of the legacy of American and European artists in Asia. 5. The preservation of the Korean diaspora and the preservation of cultural exchange between America and Korea. 6. The preservation of the art of the region. 7. The preservation of the Korean diaspora and the preservation of cultural exchange between America and Korea. The museum will also include an observation deck, a 360-degree panorama, a digital mosaic, a large-scale recreation of the museum, a digital replica of the Korean embassy in Washington, DC, and an art school. The project was supported by the Andrew W. Mellon Foundation, the Andrew W. Mellon Foundation for the Arts, the Andrew W. Mellon Foundation for the Arts (A.W.M.A.), and the Andrew W. Mellon Foundation for the Photography Arts and Sciences, and is managed by the", "The next Biennial should be announced in the second half of the year, and will feature twelve new works by contemporary artists, including Alighiero Boccaletti, Ursula von Rydingsvard, and Simeon L. Birkett.The exhibition will also include a selection of works by more than four hundred artists from the United States and Europe, including five from the United Kingdom, three from Finland, and a number from Italy.  The exhibition will feature a selection of biennial projects organized by artists in collaboration with the Wallace and Staedtke Gallery in New York, including an exhibition of work by the Philadelphia-based artist and artist-in-residence Todd Rundgren.The event will also feature a presentation of an exhibition of work by the artist and artist-in-residence Patrick OʼNeill. The artist and museum will stage a number of special programming and events throughout the event, including an exhibition of work by artist-in-residence Kiki Smith of the Frederick P. Geldhof Collection in New York and an opening reception for artist Kelly Reichard, who will represent the United States at the Fifty-Ninth Venice Biennale in May.\n\n\nThe Honorees", "The next Biennial should include a selection of works on display at the exhibition “Italia 2000” organized by Nino Cattelan and presented by the Italian artists Gio Ponti and Fabio Cipontano at the Milan Galeri in April. Should the rest of the series be selected, the exhibition will be held in the spring of 2021.\n\n\nThe Museum of the City of New York has announced that it will launch an ambitious new $2 billion redesign initiative that will take advantage of the city’s architecture and design to create a new collection of works in the city’s Museum of Modern Art and the Museum of the American Art. The initiative, called the Museum of Design, will focus on supporting the development of the city’s architecture and design through the creation of new works. The library of a museum is an extension of the institution, and is often a space for exploring and observing the work of a curator. The Museum of Modern Art (MoMA) in New York is currently redesigning its offices, the Brooklyn Museum’s new space on East Seventy-Third Street, and the Metropolitan Museum of Art in New York’s John F. Kennedy Center for a new, immersive", "The next Biennial should run from March 13 to March 16. Artnews reports that the first exhibition will focus on the construction of the body in the museum’s exhibition “Porphyromorph,” which combines two of the exhibits of CNA’s previous shows, “The Body in Motion” and “The Body in Space.” The next exhibition will be focused on African art, with the exhibition “The Body and the Image,” which will feature work by three artists who have been influenced by artists such as Mario Tama and F. Renata Pindell.The biennial’s theme, “Absolute Self,” is inspired by a quote attributed to Jean-Luc Godard, who stated: “There is no such thing as an absolute being, only a transitory image of God, a representation of his essence.” In response to the artist’s statement, curator Stephanie Soifer, who curated the exhibition, said: “The truth is that we live in a world that is constantly replaying our own lives, re-imagining the possibilities for what is possible. The body is a perfect example of the work of Michelangelo and", "The next Biennial should be held in 2022. \n\n\nThe New Museum in New York City is preparing to welcome visitors back to the institution as early as January 24, 2022. The reopening of the Bruce Willis Building, which houses the museum, marks the opening of the new year. New York Governor Andrew Cuomo announced the reopening of the museum, which was converted into an art museum in 1988, on January 27, and the museum anticipates a $150 million boost in revenue.The announcement of the renovation of the Willis Building coincided with a flurry of activity around the country. According to Artnet, New York City’s Department of Cultural Affairs put out a statement saying that it expects the renovation to generate $120 million for the cultural agency. Another statement, from the investment bank Guggenheim Partners, said that the renovation could bring in as much as $110 million. The renovation is being overseen by architect and New York City native Michael Mitzevich, who also designed the Ellen DeGeneres statue that sits in the center of the Willis Building. New York’s Department of Cultural Affairs also said that it expects the renovation to bring in $60 million. In a statement, Governor Andrew Cuomo said: “This", "The next Biennial should be revealed in January 2020.\n\n\nAmerican Ballet Theatre (ABT) announced that Katharina Breitweiser, who currently plays the role of the great American poet Ulysses Grant, will become the next artistic director of the American Ballet. Breitweiser is currently a member of the company’s international creative team, which includes José Antonio Reyes, who will assume the role of artistic director; Mary Steenburg, who currently serves as artistic director of the private conservatoire Stuttgart; and Kelly Mantle, a former executive director of the company.“We are thrilled to welcome her to the organization,” said Paul Hirsch, chair of the board of trustees. “She brings an exceptional record of leadership, vision, and innovation, and we look forward to working with her and her team to create a new and innovative vision for the ABT as a global organization.”Breitweiser has served as a member of the artistic team for the company’s previous incarnation, known as the New York Ballet, which she led from 1998 to 2002. She held this role until 2010, when she departed to join the London company, which relocated to New York, and", "The next Biennial should begin with a selection of contemporary works by the artist’s favorite contemporary artists. “We will continue to lead the way in the arts as we build on the Biennial’s legacy of excellence and shape the next generation of artists,” said co-organizers Jeffrey Davis, chair of the museum’s board of trustees.The 2019 edition of the Biennial marks the fifty-fifth anniversary of its inaugural exhibition, “Spacewalks,” with works by forty-seven artists, including William Eggleston (1903–1975), Charles Atkins (1901–1980), and Teresa Jacobsen (1906–1982). The exhibition marks the biennial’s thirteenth edition, which was staged at the San Francisco Art Museum (SFMoMA) in 1997. The show’s twenty-second and twenty-third editions will open in the museum in 2021 and 2021, respectively.The twenty-first edition of the Biennial was staged at the San Francisco Museum of Art, and the twenty-fourth and twentieth editions of the show were staged at San Francisco’s Museum of Modern Art in 2012 and 2013.\n\n\nThe Metropolitan Museum of Art in New York is planning", "The next Biennial should arrive in 2021, and the first exhibition should open in the spring of 2022. The venue will then hold the first exhibition of works by the Japanese contemporary artist Ai Weiwei.The event will take place at the new biennial center in the city of Nara, in the northern city of Nagoya, Japan, which will also host two exhibitions of work by the artist Max Beckmann, which will be staged in 2020 at the Nara Museum of Art, and in the spring of 2022 at the Nara Art Museum. The venue will house the exhibition of Max Beckmann’s first exhibition at the new biennial center, Biennial 7, which will open in February 2019.\n\n\nThe Los Angeles County Museum of Art (LACMA), which was forced to cancel a planned two-day celebration of its 150th anniversary last month because of the Covid-19 pandemic, is trying to scrape together enough funds to rejoin the rest of the county in restoring a more than four-decade-old exhibition space. The attempt, which was made in an attempt to avert possible closure of the facility, is being led by former director Lonnie G. Goodman, who announced that he was quitting in the middle of a February", "The next Biennial should be the first in the Republic of Georgia, taking place in Girinsk, in the South Ossetia region, in 2019. In March 2020, the Festival of Art will be held in the capital of Georgia, Tbilisi, in December 2020.\n\n\nThe Philip Johnson Foundation and the Metropolitan Museum of Art in New York have launched an ambitious global campaign to end violence against women. It was launched with the Monopol Superfund emergency fund and the Monopol Declaration of Women’s Rights, a statement issued by more than 1,500 leading arts organizations in the United States. The declaration reads: “We stand with you against the ravages of violence and discrimination, and we stand with you in demanding equal opportunities and opportunities of every kind.” The foundation also announced new initiatives to support female artists, including an online workshop on how to create a work of art for the Monopol Women’s Memorial Fund, which will auction the work of a single woman and showcase her work for sixteen weeks; a prize for female artists; and a new online award program.While the foundation is not a governmental or private organization, it works with grant funds from individuals and organizations to", "The next Biennial should take place in Miami Beach. Florida has been working to push back against climate change for decades. Governor Rick Scott declared a state of emergency on March 16, and Florida lawmakers have introduced numerous bills designed to cut carbon dioxide pollution. In June, the US House of Representatives passed a $15 trillion aid package for the US coastal states, and Governor Rick Scott signed a bill into law on July 1, reducing the state and local tax burden by $1.5 billion.\n\n\nA group of artists and their supporters have filed a lawsuit against the California Department of Cultural Affairs (CalArts) over its decision to eliminate the agency’s longstanding contract with artist-run space the Miriam and Ira D. Wallach Center for Contemporary Art (M/CA), which provides full-time artist-run programming to more than 100 artists. The artists claim that the move violates their constitutional rights to an impartial jury and an equal protection clause, and pertains to “artistic production” rather than “work and creative activity” under the California Constitution.“California’s art museum system is inherently biased in favor of short-sighted corporate interests, undermining the mission of the institution,” said the lawsuit,", "The next Biennial should be about 25 years away, but with the opening of the museum in 2022, it has already been an important stepping stone for many artists. One of the most celebrated is Simone de Beauvoir, whose multidisciplinary practice encompassed creationism and the universal, whose theory of time and space provided the basis for an enduring and influential body of work, and whose influence on the field is felt to this day. The 28th edition of the exhibition, “Time and Space: The Modern Biennial” will open in February 2020.\n\n\nThe New York City Department of Cultural Affairs (DCLA) announced today that it is launching a $2 million fund to support artist-run, nonprofit cultural institutions in the city, including arts centers, community gardens, and daycares. The fund will be administered by the Cultural Action Task Force (CATF), a coalition of more than fifty cultural agencies and cultural organizations dedicated to promoting the work of artists.It will also facilitate the relocation of cultural heritage artifacts to museums or other public collections, and will prioritize the acquisition of works that have been damaged or lost to looting.“The Cultural Action Task Force is committed to working with the Mayor, the D’", "The next Biennial should be held in 2020.\n\n\nThe progressive Art Newspaper in New York has announced that it is canceling its 2020 edition, which was set to kick off at the Museo de Arte Contemporáneo in Rio de Janeiro on October 7. The show, titled Theater of Operations: The Gulf Wars 1991–2011, which was an annual event that took place in the Rio de Janeiro area from May through October 2019, had been co-organized by Indira Shah and Ken Lubell. The announcement follows a wave of criticism over the past few months over the lack of transparency surrounding the event, which was co-organized by Paris-based curator and historian Robert Pincus, as well as several academics.In a letter sent to the organizers by Morality House reporter Javier Palma, the São Paulo University professor who organized the exhibition, wrote: “In the absence of an official announcement from the organizers, I am writing to request that the exhibition be canceled. Due to the current political climate and the evolution of the exhibition, this would represent a serious setback to the work of the exhibition. I strongly suggest that the work be given an extended run, as soon as", "The next Biennial should take place in Berlin in 2022 and the first in Los Angeles in 2024. The 2020 show, titled  The Artists of India, was held in the museum and premiered the work of thirty-nine artists in its entirety. The biennial will also include the work of twenty-eight Indian artists, including Marin Kala, Ravi Shankar, and Amitava Nandini.\n\n\nThe Guggenheim in London announced today that Virginia Johnson will be its next director and chief executive officer. Johnson first joined the institution in 1997 as a senior curator and soon began her career as a curatorial assistant. She was promoted to chief curator in 2000 and has since served as director of curatorial affairs and chief curator of photography. During her tenure at the Guggenheim, Johnson has organized numerous exhibitions, including The Field Trip, 2019, the Fifty-Fifth Venice Biennale, and Room 237, 2019, and most recently,  The Arts of the Future, 2019. The Guggenheim has also introduced a new digital platform, the Guggenheim Museums’ Digital Archive, which allows museumgoers to search and download previously unseen works, and has partnered with the Wikimedia", "The next Biennial should involve a combination of physical activities, cultural programming, lectures, workshops, and presentations, and it should be curated by a representative of the two countries.The project will be organized as follows:The initiative will also work to develop a national strategy for the promotion of creativity in the media and will strive to build on the biennial’s success. The biennial’s inaugural exhibition, “Art of the digital age: The Digital Revolution,” will open in 2022 and will feature the works of twenty-seven artists.\n\n\nThe Institute of Contemporary Art (ICA) in New York has announced that it is teaming up with the Institute of Contemporary Art (ICA) in London to develop a new initiative for the museum. Called the “next level,” the initiative will involve the various ICA institutions, including the New Museum, the Metropolitan Museum of Art, and the Museum of Modern Art, in New York, collaborating to create a series of exhibitions that will reflect the zeitgeist.The ten-year program will premiere at the ICA in London in May 2020 and will be hosted by ICA London director Andrew Wiles. During the twelve months leading up to the event, ICA London, which has", "The next Biennial should take place in the fall of 2020.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles, which was forced to move the exhibition Art of the Party, which was staged at the institution during its relaunch in 2012, due to concerns over budgetary constraints, has established a $50,000 fund for grants and donations from individuals and institutions, in recognition of their generosity in helping the museum through the Covid-19 pandemic.The fund was established by MCA executive director Daniel H. Weiss and curator and director of contemporary art at the Fairfield Museum of Art, Bob Graham, in recognition of the incredible outpouring of support they have received from individuals, institutions, and foundations throughout the world in the past twelve months.“As a society, we are facing a crisis that threatens to destroy not only our shared humanity, but the very fabric of society itself,” Weiss said in a statement. “By giving back to MoCA, we hope to extend the scope of the museum’s grant program to other arts and cultural institutions and to give further impetus to the work of MoCA staff and supporters. We are grateful for the museum’s ongoing support and optimism as we face this", "The next Biennial should take place in 2020.\n\n\nArt pop artist Rirkrit Tiravanija, a Tamil-born, Toronto–raised artist who creates works that grapple with themes of memory, memory politics, and memory sciences, has been awarded a $25,000 MacArthur Fellowship. The MacArthur Foundation announced the winners of its biennial Fellowships for 2018. The first round was held in January 2019 and will conclude on May 28.The 2020 iteration of the Fellowships, titled “Beyond Dreams,” will be held at the Art Institute of Chicago (IIC) in Chicago and will include works by sixty-eight artists. The theme for the show will be “The Future of Memory: Memory Politics and the Future of Dreams.” The winners of the 2019 biennial will be announced in May.“This year’s biennial is a great success, both in its breadth and depth, and in showing that we are a vibrant and vibrant collection of artists, with a strong and vibrant history of thought and recipe,” said Mike Ramsey, general manager and chief curator at the MacArthur Foundation. The artists selected for the 2020 show were:Kathy Lee, Phoebe Lee, Molly Ringwald,", "The next Biennial should be held in 2020.\n\nSince the unrest in Paris in February of this year, the French government has stepped up efforts to contain the outbreak of the novel coronavirus. In March, President Emmanuel Macron announced a series of measures, including a cap-and-trade system, curbs on the movement of people, and restrictions on travel. The measures were meant to curb the spread of the virus, but they have only partially held up the tide of people-smugglers and the smugglers who have made the country their hub. The number of people being held in French prisons for smuggling has risen from 191 in March to 478 in June.On May 21, France officially declared the end of the coronavirus—officially, which was a big relief for smugglers. Since the authorities began restricting travel in March, France has taken the first steps to halting the flow of people and goods across its borders by imposing a total ban on travel to and from Saint-Étienne-du-Rouvray, the southern region of Picardy, and Saint-Étienne-de-Alve, the eastern region of the country. The ban on travel to and from Nice is still in effect.According to the New York"]