["The next Biennial should be held in the summer of 2021. \n\n\nThe Takashi Murakami Foundation in Tokyo announced that it has received a gift of twenty-five works from the artist’s estate, including a selection of works on paper, clay, and paper-based works that were on loan to the institution from the Murakami Foundation in collaboration with HOKCO, which is based in New York City, on November 13, 2017.The gift includes the first collection of paintings by Murakami, a selection of prints, drawings, and sculptures that were on loan from the foundation as well as three paintings by Takashi Murakami, a director and cofounder of the New York–based firm Yamaguchi. The works, which were acquired through the acquisition of an interest in the estate, will be presented in a group exhibition at the Hiromasa Museum in Nagoya, Japan, on March 21, 2020.The gift also includes a selection of works from the collections of the two museums in London: the Tate and the Royal Academy of Arts. In the London exhibition, which is titled “Rethinking Murakami,” the Tate will present works by the artist, the Museum will present works by the artist", "The next Biennial should be held at the Kunsthalle Basel in January 2021.  The museum, which has been closed since March 15, has yet to finalize whether it will reopen as planned.\n\n\nFrench artist and designer Tomi Lahoud, a professor of modern art at the University of Lyon, has won the Prix d'Art Contemporain (PAAC), an award presented by the Paris-based institution for contemporary art. The honor was announced on Tuesday, March 10, by the French Ministry of Culture and the Arts. The first award saluting Lahoud, a member of the collective of the same name founded in 2008, was given in 2016. The second honor was for 'Theatre of Anti-Communism: The Politics of Displacement, 1948–1958', a series of paintings that are part of a larger, fifty-two-foot installation that opened at the Museum of Modern Art in Paris last year. Lahoud’s work will be included in the exhibition “Theatre of Anti-Communism: The Politics of Displacement, 1948–58” and will appear at the institution’s Fifth Avenue location in May.The 2020 winners were announced by the museum’", "The next Biennial should be a step-by-step exploration of the project of conceptual art, and how it can be made to begin with a psychological insight into the nature of art and art itself, and how the present should be regarded as a temporary one, a provisional stage in the history of art. We should wish to begin with a renewed conception of the self and our relation to the world, and the way in which we wish to present art, art itself and art both.Sincerely,Fritz Fallman, President of Film at Columbia University, New York; JOHN FEAST, Director of the Christ Church, Rome; and JOHN JACKSON, President and CEO of New York’s Museum of Modern Art. The 60th Cannes Film Festival will now kick off on July 21 and run through June 27. The sixteenth edition of this prestigious festival will take place in May. The South by Southwest (SXSW) conference will now take place from March 22 to March 28. Unlike its previous iterations, this year’s event will feature an additional sixty-two artists, including a number that have not previously been selected to participate in the biennial. The full list of participating artists can be found here.According", "The next Biennial should focus on countering the neo-liberal, pro-market, anti-immigrant, and anti-democratic strains of the Global South, which, in the words of the International Alliance of Arts and Cultures (AAC), 'has left the world less and less sustainable and more precarious. And that, in turn, is a loss of social cohesion and cohesion within communities.” The Art Newspaper reports that the 2019 edition, “After Capitalism: Art, Markets, and the Global South,” will focus on “The Future of Work,” “What It Means to be an Art Worker,” “Art and the Global South,” and “Work and the Global South.”Laniere Rech, who organized the . Art Spotting and Art and the Global South (2017), told the Art Newspaper that the upcoming exhibition “is about the future of art and how work is the future of art.”\n\n\nThe US House of Representatives voted Wednesday to establish a national museum dedicated to the art of resisting globalist economic and political systems and to commemorate the contributions of black artists to the art world’s collective memory. Introduced last year by New York representative Gwen", "The next Biennial should be held in 2020, and the exhibition should take place in the same location as the memorial—the square, in the nation’s capital, will be a centerpiece of the biennial. The aim is to create a platform for dialogue between contemporary art and politics, and to foster greater understanding through experimentation and critical reflection.\n\n\nThe Indiana Museum of Art (IMA) will be transformed into an eight-thousand-work, multi-ethnic, multi-media cultural center that draws from the Institute for Contemporary Art (ICA) in Bloomington and the local community. The arts and culture complex is part of the $4 billion redevelopment plan for the former Lorraine Motel building, which opened to the public in 2016 and has since become a photography museum, a performance space, and an art garden.The $2.5 billion overhaul—comprising of a glass-enclosed lobby, a lecture theatre, and lobby-style galleries—will feature a new three-story façade, a dramatic reconfiguration of the lobby, a larger collection of ICA artifacts, and an expansion of the ICA’s campus. The site of the museum, which is currently home to the David Salle–designed Building IV", "The next Biennial should be held in 2021.\n\n\nThe City of Montreal suspended construction on a $6.5-billion, two-mile-long, glass-enclosed sculpture park and pedestrian hub built to replace the Centre Pompidou in Saint-Germain-de-Provence (CPÎQ), an area of the city near Grenoble, on Monday, January 13, 2019.“We are acutely aware that the renovation of the Centre Pompidou appears to be on track for completion by the end of 2020. However, given the change of plans for the new pieces, we are seriously concerned about the safety of visitors to the Centre Pompidou,” the city wrote on Facebook.The Pérez Art Museum in the city of Lyon, which is also hosting a new exhibition dedicated to the architect John Carlisle, and the Centre Pompidou were not aware of the construction of the temporary structure for the exhibition “Away From the Sun,” which will run from January 18 to January 22. The museum will close to the public in March 2020.In a letter sent to the public on February 21, the city states that it did not expect the construction of the structure", "The next Biennial should include a selection of works by local and international artists and should have a budget of at least $100,000. The budget should also reflect the experience and expertise of the artists selected for the event, with the goal of fostering an appreciation of the work of the artists whose work is currently under construction or in the process of being constructed. The theme of the 2019 edition should be “\u0097Making Faces.”The biennial’s next event will be a public exhibition of work by artists currently working on exhibition-making projects. The exhibition will be inspired by an unpublished proposal on how artists might alter their work and reflect a desire to “open up” their own spaces in a way that would explicitly connect the exhibition with the museum’s collection. The artist-led project will also include a series of interpretive activities that will involve the artists as they build their new space and will offer a project overview and a list of the artists who will participate.The 2019 edition of the biennial was organized as part of the Hannover Book Fair and the Hannover Biennale, which was held in the German city of Baden-Baden. The show will be held at Biennale Rotterdam from September", "The next Biennial should be held in 2020. Beginning in the fall, the Biennial will be held at the V&A. In order to facilitate the work of local artists to promote cultural heritage, and to address issues of sustainability, the Biennial will launch the 'Long-Term Plan for Art and Conservation in London, launched on Monday, September 2. In the coming months, the Biennial will also present a series of exhibitions, including the biennial season preview in March, and the second edition of the Biennial in September 2020. About the Biennial: In the summer of 2019, the London-based artist Sara Cwynar embarked on a yearlong project to draw attention to the legacy of the V&A. She created a series of meticulously selected works in July, and in October, she mounted a show (then titled the London Biennial) at the High Museum of Art in London. The museum became the first in the UK to host the show, which saw more than 3,500 works on display. During the exhibition, a number of prominent artists such as Willem de Kooning, Jean-François Meyendorff, and Pierre-Xavier", "The next Biennial should be held in 2020. For the next fifteen years, the museum will be home to thousands of works from the artist’s studio, which was split into two buildings—the Biennial Collection and the National Gallery—and will continue to host exhibitions and series. The museum will be a destination for visitors to see and enjoy works by the artist and will boast a theater and a restaurant.\n\n\nTata Steel Ltd., India’s Tata group, and the Indian government have announced a $1 billion relief package for the steel industry, which is facing a worsening pollution crisis exacerbated by climate change and the ongoing construction of cities, and are calling for companies to invest in renewable energy sources.The Tata Steel Fund, which was established in 2017 to help Indian steel companies and was announced in February, aims to help Tata through its worst crisis since it was founded. Tata says it expects the crisis to last for at least two more years. While the crisis is not as severe as the Great British Pollution, it is still among the worst industrial crises in history.The Tata Steel Fund is a joint venture between Tata Steel and India’s Tata Group. Tata Steel, which manufactures steel in the United States, China, and India, has", "The next Biennial should be held in 2020. “The biennial is only a symbol of the power of art to shape our world and to alter the course of our lives,” said Jerome Delacroix, president of the Allen Foundation.  The Allen Institute for Contemporary Art (AICA) in Herzogenaurach, Germany, is also evaluating its future. In an open letter dated May 3, AICA wrote that the board “recognizes that the next Biennial will only be the beginning, and that the art of the future will only be the work of the artists who are already alive.” \n\n\nThe National Museum of Fine Arts (MoFA) in Washington, DC, announced today that it is planning to shut down its public events and school programs from April 18 to April 20, 2020 in an effort to reduce its carbon footprint and save money by moving its exhibitions and concerts to its historic building on Pennsylvania Avenue. The museum determined that moving its exhibitions and concerts to its historic building was possible in part because of an analysis of $6 billion in projected ticket sales for the 2020 event; the move reduced the institution’s carbon footprint by 27 percent. The institution hopes to spend $3 billion retr", "The next Biennial should take place in 2021, with a budget of $4 billion. The theme of the exhibition will be “Everything—But Everything,” and in addition to works by cultural and other major figures of the twenty-first century, a selection of contemporary art will also be presented. The twenty-second Biennial will be held in 2022. The third and fourth Biennials will take place over the course of a decade, respectively, in 2020 and 2022.Hiroshima: Particle Fever (Hiroshima Museum, Japan)  The Contemporary Arts Museum Tokyo (CAMTO) announced that it will not hold a new exhibition dedicated to Japanese performance art or architecture next year. The exhibition, “Light and Plume: Japanese Art 3” will be relocated to a new location in the museum. The museum’s current Exhibition Programme will be replaced with a new series of events, “Tales of a New World,” which will be curated by Okada Hasegawa. It will also have a new title, “The Art of Place.” The first part of the triennial will open to the public on September 3, 2020.The 2019 edition was held", "The next Biennial should be in 2021 and should cover the full range of art history from 18th century European art to contemporary art, with special attention to the development of the field in the nineteenth century. The themes of the biennial will be collaborative art, the art historian, the culture and the spirit, the history of art, and the arts.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Sarah Loter as its next executive director. She succeeds Linda Ballantyne, who has served as the museum’s interim director and chief curator since December 2020, and will take up the post on January 1, 2021.“Sarah Loter brings a wealth of experience and vision to the museum, having led multiple organizations, including the Los Angeles County Museum of Art, the Museum of Contemporary Art, and the Compton Museum of Art, and has served as a curator at the Museum of Contemporary Art, where she first launched the new contemporary art program. We are deeply honored to welcome her to the museum and are confident that she will continue to transform MoCA into a globally-recognized leader in contemporary art.”The appointment was made by curator Tyler Mitchell via video conference from San Francisco. The director of the museum, which", "The next Biennial should be held in 2021. “Our goal is not to make a sense of film, but to create a new kind of film,” commented director Guadalupe Rosales. “With our new work the future is now and we’re going to make it as good as we possibly can.”The festival, which has been held every four years since its inception in 1987, has received numerous awards and has included six major retrospective exhibitions in recent years. The second Biennial of Directors, held in 2017, brought together sixty-nine directors, including Alberto Barbera, Alfredo Armentano, Alfredo Campanella, Elle Fan, John Crowley, Bob Gale, Jane Green, Iñigo González, and David Lynch. From 2019 to 2020, the event will feature thirty-five films, arranged in chronological order, and will be held at the Centro de Cinemástica in Madrid. The 2019 edition, titled “Witch Hunt,” brought thirty-six films, including Maren Gormley’s “Be/longing” (2018), Jean-Luc Godard’s “Morality” (2019), and the film", "The next Biennial should be ready by May 2020. The exhibition will be hosted by the National Geographic Society in Washington, DC. The dates of the exhibition are as follows: April 29, 2020The exhibition will be held at the US National Museum of Natural History in Washington, DC, from April 29 to May 2, 2020.The exhibition will be directed by Roberto Cicutto (New York), the curator of the 1976 Pan-American Biennial, and Will Smith (New York), the director of Sundance Film Festival, and the author of The Martian Book. The international strategy for the exhibition consists of a series of local, regional, national, and international collaborations and a wide-ranging online presence. The exhibition will be presented by the National Geographic Society in partnership with the National Geographic Channel, the National Geographic Society Television, and the Wikimedia Foundation. Tickets for the exhibition will be free for the general public. The National Geographic Society will give away two hundred digital prints, lithographs, and posters. The first edition of the exhibition will be hosted by Google and will run from March 19 to March 20. The second edition, which will be hosted by the Smithsonian American Art Museum, will be on April 22. The show", "The next Biennial should be in the spring of 2021. “We are now in the process of developing a new strategic plan that will describe how we will continue to collaborate with the other fourteen countries in the series,” said Hoor al-Qasimi, director of the Art Gallery of Ontario.  ÜIn a world where we are increasingly disconnected from one another and our environments, it is our responsibility as citizens to take part in managing our own ecological well-being. We must work together, act together, and act quickly to address the climate emergency.”In response to the biennial’s announcement, the United Kingdom’s Department for Culture, Media and Sport said: “The government remains committed to the climate mission, but has already taken some of the first important steps towards meeting it by introducing new powers and regulations that will make it harder for the factories and the businesses that cause climate disaster to thrive and to slow the pace of change for the most vulnerable. We are working with the industry and others to deliver a better future for our environment and we hope the next installment will add to the momentum for change.”\n\n\nThe sixth edition of Art Basel Hong Kong kicked off on Wednesday, March 6", "The next Biennial should be hosted by the Smithsonian and not by the government, and should focus on how public museums are able to support their communities by engaging with the vast majority of their cultural heritage through research and exhibitions. The institution should also create a mechanism for funding such collections and for the sharing of knowledge among the biennial participants.\n\n\nArtist-activists and critics are calling for a boycott of Israel over its ongoing assault on Gaza, which has left at least 185 Palestinians, including hundreds of children, dead since 2014. The coastal territory has been devastated by a conflict with Israel that has killed an estimated 2,200 Palestinians and has also entailed the displacement of an additional 1.5 million.The demand for an end to Israel’s military operations in Gaza, which has killed an estimated 1,500 Palestinians since 2014, stems from the growing recognition that the Occupied Territories—including East Jerusalem and the West Bank—are an integral part of Israel. The United Nations has called for an end to hostilities and for Israel to stop its operations. While the United States and European nations have so far offered few examples of international solidarity with Palestinian people, the call to sever ties with Israel has been met with opposition from within the Jewish state.The history of Umm", "The next Biennial should take place in 2020. \n\n\nArtforum will release the fifth edition of Art Icons, an online survey of art artworks, art works, and art institutions, and will offer a series of virtual events, including an exhibition featuring work by artists in the exhibition program and a biennial celebration. The event will also host a four-day workshop on the design and installation of art installations. The project is being organized by Christof Knebelbach, the founder of Knebelbach Gallery. Christof Knebelbach said: “The years 2019 and 2020 were the most productive of my career and I am extremely pleased with how things are turning around for artists. We are now in a period of great renewal and in need of new ideas. We are also experiencing a great deal of change in the art world, and art is going through a period again of great growth and success. I am confident that we will find new and inventive ways to present the most important artworks of the past.”The 2019 edition, “The Future Is Present,” featured work by forty-eight artists, including Alexander Calder, Zoya, and Michelle Hoberman. The biennial, “The Future Is", "The next Biennial should be staged in the spring of 2021. “The work of this century’s artists is remarkable, and we cannot wait to see what they will create next,” said Ana Mendieta, the director of the Biennial, and the current curator of the exhibition. Mendieta was inspired to create the Biennial by the exhibition “What is the Future of Art?,” which opened at the Museum of Modern Art in New York in 1995. “The exhibition transformed the museum into a great center for contemporary art in the US,” she said at the time. “It was here I found the work of the last twenty-four years of my life. I was writing these words when my daughter was born, and I was writing them in 1996 when I went to the museum to make the first Biennial exhibition. . . . I am going to miss this space so much. But I am very confident that in twenty-four years time, I will be back, writing, playing, and inventing new works.”\n\n\nThe Grand Californian Biennial, which was set to open in 2020, has postponed the event by a year to 2021. The event�", "The next Biennial should begin in mid-September and conclude by March 2019. The next event, titled “Toward a New Paradigm,” will take place in September, the month of the year for the coronavirus. In the meantime, the city will have a month to prepare for the coronavirus before it reopens on January 21, 2020. “I’m really excited to start this year by curating a show on a platform that has been so much a part of my life,” said Michele Herrman, who chairs the board of trustees of the Biennale de Lyon, France. “I was drawn to the program’s structure, the writers’ commitment to expanding our understanding of art and to the resonance of the word’s various meanings and their commitment to fostering interdisciplinary and intercultural dialogue. I am very much looking forward to using the platform for this purpose.” The 2017 exhibition “Art as Refuge,” inaugurated by Anton Kern, took place across six indoor and outdoor spaces, spanning from the city of Lyon to the Palais de Tokyo in Paris, and featured work by more than eighty presenters. The", "The next Biennial should feature four works by up-and-coming artists who have had successful solo exhibitions at the Museum of Contemporary Art (MoCA) in Los Angeles and the Metropolitan Museum of Art in New York. This year’s session will also feature a new exhibition, “Scenes from Sculpture,” which will draw from the works of contemporary artists and will be inaugurated by artist Ravi Rajan.The 2018 festival, entitled “Damascus Spring,” was curated by Nima Nabavi, director and CEO of the Museum of Contemporary Art (MoCA) in the United Arab Emirates. The exhibition was curated by Nima Nabavi, director and CEO of the Saudi Arabian Exhibition and Travel Club in Dubai; Ahmad Al Mazoura, president of the American Friends Islamic Foundation in Dubai; and Nina Al Qasimi, the head of the National Gallery in Cairo.\n\n\nThe French government approved a $5.3 billion plan to rebuild the Garden of Versailles in Paris on Wednesday, a day after it moved to suspend the annual retrospective of the French artist Damien Hirst, known for his surrealist sculptures and installations such as the monumental multi-million-dollar sculpture The Inferno, which hangs in", "The next Biennial should be held in the spring of 2021. The Biennial will be hosted at the Italian cultural space the Fondazione Prada from May 5 to May 7, 2020. The first edition of the Biennial was held in 2017 and consisted of over sixty works from twenty-six artists. In the first exhibition, Lori Sjoberg, a curator at the Museum of Modern Art in New York, curated a special exhibition titled “Bianca Alighier” focusing on the Italian painter Laura Cincotti, who was a disciple of the Italian avant-garde. Cincotti was the cousin of Luigi Cincotti, whose influential New York–based studio, Cincotti Associates, founded the careers of Alessandro Cincotti, Klaus Dänik, and Peter Halder, among others. L'Oreal Paris is currently working on a new seven-year contract with the French architect, who is best known for his urban designs, which incorporate public spaces and public spaces in different ways such as by interweaving together elements of Paris’s so-called neighborhood clusters\u0097such as the rue Saint-Martin\u0097into a single street. The", "The next Biennial should take place at the new Cultural Centre, with a view of the city, in the city of Lisbon, Portugal. The aim of the exhibition is to explore what it means to be part of a larger, interconnected world.\n\n\nEddie Bravo, one of the most celebrated and prolific artists of the twentieth century, has died at age eighty-eight at his home in Manhattan. The Los Angeles Times reports that the cause of death was pneumonia. Born Eddie Bravo on February 6, 1940, in New York City, the son of a wealthy New York family, the artist was raised by his mother and stepfather in Riverside, California, where he attended public schools.  \n\nAt the age of twelve, Bravo discovered the experimental medium of photography, which he acquired in 1959 from his father. After enrolling in the Art Institute of Chicago, where he studied with Jules and Keith West, Bravo moved to Los Angeles in the late '60s to study at the Art Institute of Chicago and to work on his early paintings. In addition to photography, Bravo also studied with Frank Gehry, Anna Atkins, Ed Moses, Richard Diebenkorn, Jean-Michel Basquiat, Jacques-Louis David, and Pierre-", "The next Biennial should be held in 2021. The program’s board president, Charles Cooley, added: “After a thorough and careful review of the proposals, we decided that the best way forward for Biennial 1 would be to move forward as planned, and to return to the drawing board. We are now working with our partners, the Curator’s Guild, to develop a way forward that will enable us to present our own research in a timely and meaningful way.” The board of trustees of the Chicago Architecture Biennial (CABB) is releasing the list of participating artists and institutions in the event of a 'no. 1,' which will be announced by the Mayor in early February. The full list is as follows:Artists:BADB/NYC/USCM/NYC/USCM309, Brooklyn, NY, USCM313, New York, NYBADC, Minneapolis, MN, USCM311, St. Louis, MO, USCM312, San Francisco, CA, USCM313, Chicago, IL, USCM304, Chicago, IL, and NYC - Altadena, CA, USCJN, New York", "The next Biennial should be staged in the city around the end of October 2019. The inaugural exhibition, entitled Dada and the Moving Image, will be housed in the Musée d’Art Contemporain. The following year, the museum will stage Art  in the City.“We are delighted that the Biennials are, together with the City of Paris, facing the future with the full participation of the public,” said Mayor Anneâs Sender. “We look forward to introducing the next iteration of the Biennial of the City of Paris, to the people of the city and to the city in the coming months, as we continue to work with our partners to develop innovative new platforms for exhibitions, public programs and research in order to strengthen the city’s international reputation.”\n\n\nThe Carnegie Museum of Art (CMA) in Pittsburgh has welcomed Diana Waldman and Matthew Kulka, who have been working together since 2014, to the museum. The pair will collaborate in the creation of a new sculpture, “The Life and Death of St. Lawrence” and will collaborate with curator Alex Marra to present the work in the museum’s", "The next Biennial should begin with the exhibition “Abram and the World,” my first and perhaps most ambitious project, which will consist of a series of assemblages in which the artist will present his work to the public in order to stimulate conversation about the history of the world and to engage with the many themes of the exhibition. In the event of the unavoidable crisis, the artist will work as normal.\n\n\nThe Institute of Contemporary Arts (ICA) in London is planning to remove its Samuel Johnson Gallery building in Victoria Street from the city, in an effort to make way for a new 37,000-square-foot museum dedicated to the work of contemporary art. The move is part of a broader revitalization plan that aims to create a more pedestrian-friendly environment for London’s arts and cultural sites. The redesign, which will launch in 2021, will also include the restoration of the gothic-styled V&A, the newly refurbished Samuel Johnson Gallery, and the nearby Natural History Museum. The new museum is scheduled to open in 2022.“We are working with the Historic Society to ensure the new museum is a compelling choice for visitors to the V&A, and the Design Group to ensure it is both contemporary", "The next Biennial should focus on “the migratory routes of the African diaspora,” the museum’s director, Elena Cipolletta, said. The institution plans to present a new exhibition with approximately $100 million in funds in collaboration with the Italian government.In the meantime, the museum plans to move the exhibition, “Migrations,” to its new location in Rome, which it has called the “eclectic city of cultures,” in an attempt to extend the life of the institution’s collection and make it a cultural destination for visitors from all over the world.\n\n\nConsequently, Turkish cultural figures and institutions have been forced to respond in kind, with many of the country’s cultural figures taking to social media to condemn the country’s president, Recep Tayyip Erdogan, for his purported connections to the terrorist group Islamic State (IS). In an attempt to diffuse the institution’s growing political crisis, the Turkish government granted the American painter Kevin Spacey the status of a citizen of the European Union.The move has left the American artist feeling unsettled. “This is an unprecedented situation, and I’m still trying to work out how to", "The next Biennial should take place at the Indiana Museum of Art, in Bloomington, in 2021. The proposed 2020 edition, “Art and the Body: Life, Death, and the Body in the Late Paintings of Karl Lantstedt,” will focus on the artist’s relationship with the body throughout his career. The exhibition will include works by artists such as Richard Avedon, Hildegarde de Kooning, and Suede Forster. “Art is not a luxury, it is a philosophy of life, a science of the body, a science of the universe,” Kasper Koenig, curator emeritus of the show, told Artforum.  “The series is not about the body as such. It is about the artist as a whole, about the relationship between scientist and artist, about the work being created and the artist. For me, the work of Karl Lantstedt is important as it is a very good guide to understanding how art can be both a vehicle and a source of inspiration for the artist. I am so honored to be part of the opening of this new edition.” The full list of participating artists is as follows:Karl", "The next Biennial should be held in 2021.\n\n\nThe New York City Department of Cultural Affairs (DCLA) announced today that it is launching a campaign to give the arts and culture community $1 million to revitalize cultural sites impacted by the pandemic. The Campaign for Arts and Cultures, which will launch on September 12, will collect and distribute more than 1,000 signatures from cultural professionals and arts professionals to the DCLA’s website and will invite the public to sign petitions by September 12.“Culture and community are at the core of our city’s vitality and, as we work together to make the city healthier and more welcoming for everyone, we are inspired by the stories and the artists and the stories inspire us to work together to make the city thrive,” said David L. Cohen, commissioner of the city’s cultural affairs agency.The campaign will work in partnership with the Artists’ Alliance, the Cultural Landscape Research Group, and the Cultural Landscape Assistance Fund until September 14 and will ask the City Council to create an additional $1 million for arts and cultural organizations through September 29. Among the organizations that will benefit are the New York Philharmonic, the ", "The next Biennial should be on the exhibition floor in November 2019.If the festival is cancelled, the 2019 edition will move to the museums of Art and Design in the capital, and will thus be cancelled as well. “This is a difficult situation for the organizers of the biennial, and especially for us, who are facing a difficult decision,” said Elissa Prade, the executive director of the Haus der Kunst, Germany. “This year’s inaugural exhibition will unfortunately be dismantled at the end of March, 2019, and the exhibition of the remains, which is scheduled to open in October 2020, will take place at the beginning of April. We are grateful for the support of the Gallery, the commissioning committee, the audience, and the entire community. We hope that this will be the beginning of a new chapter in the history of the biennial.”The 2019 exhibition was staged at the Fondazione Prada between September 2018 and May 2019, with the exhibition of the artist’s new monumental sculpture, Untitled, which was created in collaboration with the artist María Berrío, and was on display for fifty consecutive days. It featured works by sixty-six artists from fifteen countries", "The next Biennial should be staged in 2020. The new exhibition would feature new works by all of the artists featured in the exhibition. The theme of the exhibition would be “Beauty and the Beautiful,” and would take place in the museum’s former space, the Forum. The programme would consist of a series of narrative presentations by the artists, who would travel to different locations around the globe, including New York, Los Angeles, Hong Kong, Paris, and Lisbon. The exhibition would be organized in parallel with the years 2020 and 2021, and would begin on March 1 and end on June 30.“The exhibition of the first Biennial will mark a crucial moment in the history of the Biennial,” Lars Bildså, the chair of the board of trustees of the Biennial Foundation, said in a statement. “This is the first exhibition that will have been staged in the new museum, and the first exhibition that will have been inaugurated by the artist. Hence, it is important that the first Biennial be the best possible exhibition, not only in terms of its content but also in its form. This is the time when the work of the artists is most visible and their performances most lively.”The Bi", "The next Biennial should be in December 2020. I would like to see this biennial's theme, which is grounded in the history of the biennial itself, as a central aspect of the presentation of the exhibition. “I think this is a moment of great change for the museum,” curator John Paul Goudie said in a statement. “The Past is a Present,” he added, referring to the exhibition. For the past sixty years, the institution has been constructing the new 100,000-square-foot biennial on the campus of the University of California, Los Angeles, and is currently constructing a new, expanded pavilion for the exhibition, which is currently on display in the museum’s collection, the museum’s new exhibition space, and its new building. The pavilion will also include a new video series and a new media program, and will be inaugurated by a new work by the blockbuster American artist Amara Dayal.\n\n\nThe Giard Gallery in London has been sold to a group of Chinese collectors, who reportedly paid an undisclosed sum for the historic building in May. The Chinese-born collector, Luo Bing, recently submitted a proposal for the space, which was built in 1900", "The next Biennial should be announced in the spring of 2021.\n\n\nOlder Than Feudalism: This article is about the ancient, pre-state, and modern state of Alaska.\n\n\nThe British artist Richard Attenborough—who transformed the visual art world by inventively combining film, sculpture, and animation to make films that were as powerful and visually arresting as films themselves—has died at age ninety-nine. The cause of death was prostate cancer, which had metastasized to his brain but had been contained by a successful treatment, a cure, and an intervention.Up until his death, the artist had been working to make films of his own body, of his own films; these films could be viewed by anyone, anywhere, through Attenborough’s 360-degree vision. He had even created an entire series of images along the lines of his famous “Stronger, Cry More,” 1940, for his first film, the first of many works that combined film and sculpture to create films of his own body for the series “Pictures of Men” (1975–1976), “Men and Women in Film” (1977–1982), and “Black Mass” (1983–", "The next Biennial should be held in 2021.\n\n\nThe Museum of the Jewish People (MIP) in London has announced that it is planning a major renovation of its former premises, which it currently occupies, in order to incorporate new galleries and additional programming. The MIP’s current exhibition, “Young Israel,” which is a collaborative project between the Durslade Gallery, the artist-run Family Gallery, and the Museum of Contemporary Art, will undergo a major overhaul, which will include the addition of new contemporary art and new interactive experiences.The plan was drawn up in response to the current state of affairs in Israel and the West Bank, where the Israeli government is currently constructing a large-scale separation wall along the Israeli-Palestinian border and the construction of new settlements. The wall is expected to be ready for the construction of Israel’s separation barrier in the summer of 2021.The renovations will include the renovation of the new galleries, which will be built in the former Durslade Institute of Art, and the restoration of the existing galleries. According to the MIP, the new spaces will “provide a further platform for the exhibition ‘Children of Men’\u0097the israeli children’", "The next Biennial should be scheduled for January 2020. The show will also announce the winners of the Tacita Burton and Sara Mayer Art Fund Award and the Artistic Director and CEO prize. The Artistic Director prize will be awarded to Architecture d’Antoine de Saint-Exupéry and Charlotte Barréthuis. The award also includes three Triennales for Stand-Up Comedy, three Triennales for Experimental Art, and a Triennale for Contemporary Art. The 2018 awardees include: Louis Vuitton, Lévy Gorvy, and Mémoires Du Cinéma.\n\n\nThe Hirshhorn Museum and Sculpture Garden in Washington, DC, has received a gift of more than 2,900 works by seventy-one artists from the Culver Museum of Art in California. The Hirshhorn has unveiled a group show of works by thirty-two artists, including the Taiwanese-born, New York–based artist Yi Jie, who will open the show at the Hirshhorn on January 27. The museum also revealed the curatorial team for its upcoming exhibition “New New Worlds: ", "The next Biennial should be held in Paris in the summer of 2022.   The twenty-first will take place in the fall of 2022. The twenty-second will be held in the spring of 2022. The twenty-third will be held in the spring of 2022. The twenty-fourth will be held in the spring of 2022. The twenty-fifth will be held in the spring of 2022. The twenty-sixth will be held in the spring of 2022. The twenty-seventh will be held in the June/July timeframe. The twenty-eighth will be held in the spring of 2022. The twenty-ninth will be held in the spring of 2022. The twenty-eighth will be held in the spring of 2021. The twenty-ninth will be held in the spring of 2021. The twenty-ninth will be held in the spring of 2021. The twenty-ninth will be held in the spring of 2021. The twenty-ninth will be held in the spring of 2021. The twenty-ninth will be held in the spring of 2019. The twenty-ninth will be held in the spring of 2019. The", "The next Biennial should focus on “technologies of confinement and mass incarceration,” said Mary Pat O’Donnell, executive director of the Riverside Museum of Art and the Los Angeles County Museum of Art. \"This is a moment of crisis for our world. We must work together to address it.” The fifth installment of the museum’s “In the Ghetto: The Subversion of American Anti-Semitism,” staged last fall, addressed the legacy of the late Jewish activist and writer Irving Kristoff and its role in the spread of fascism and racism in the United States. The biennial will open on October 8.\n\n\nArtist-run space Artadia has announced that it will cease operations at the Metropolitan Museum of Art (MoMA) in New York following a protest and strike scheduled to begin on September 24. According to the New York Times, the Met said that it was still working on a new labor contract. The move leaves the institution with a deficit of around $1 million in its upcoming fiscal year.After Artadia’s announcement, the organization’s cofounder, Carmen Otero, told Artnet that the organization does not intend to stop organizing but will “res", "The next Biennial should commence as planned, with the exhibition opening on September 24. Also, the exhibition will be presented as a collaborative project between the Museums of Venice (the Italian city).Ivan Albright Gallery will stage the first exhibition of the new project format in Milan on October 5–8. The inaugural edition will feature six works by the curators of the new program, who are: Lina Bronkhorst, Lina Grazela, Mara Magli, Leonardo Bonen and Joan Zorn. The exhibition will run concurrently at the Museums of Venice and the Fondazione Lecheria and will also be presented at the São Paulo Art Museum, the Museum of Modern Art, the Museo Cervetto di Spazio, the Carinthia Cinara in Venice, the Institut d'Arte Contemporanea and the Interlibrary Stedelijk Museum. The biennial will be held at the Milan Art Museum (MAM), the Stedelijk Museum (SVM), the Museo delle Paz, the Pinturato (Montana), the Museo S.R.F.F., the Sted", "The next Biennial should be held at the Institut Nicolas Perrotin in Paris in December 2019. \n\n\nThe University of Washington in Seattle has received a gift of fifty-seven rare works from the late Israeli artist Tzvi Ben-Shalom. The rare works, which were donated by his widow, Bechal Shalom, were acquired by the museum through a historical gift from Israel to the university in 2016.The gift, which was made in memory of her husband, Tzvi Ben-Shalom, who passed away on October 2, 2018, was made in memory of her husband and the many artists who have contributed to the institution during his long and distinguished career. “From the moment I received this gift, I immediately knew that the museum was in dire need of a major renovation and expansion,” said Bechal Shalom. “Tzvi Ben-Shalom deserves this recognition for her extraordinary contributions to the university and the entire field of Jewish art.”The Jewish Museum Seattle received a gift of seventy-four rare photographs by the Italian photographer Piero Manzoni from the late Italian architect Silvio Castellani. The gift, made in memory of his wife, Agnese,", "The next Biennial should be held in 2021. The second will be held in 2022.The Toledo Renaissance was held in January 1909 and was attended by about sixty thousand people. The exhibition was organized by the Italian architect Stefano Bellini and also included works by Piet Mondrian, Casolari, Csikszentmihály, and others.For Toledo,  the first exhibition was January 10–January 13, 1909, and the last was January 13–January 26, 1910. “The twentieth edition of the Toledo Renaissance will include the work of more than seventy artists, including Domenico Ferraris, Gio Ponti, and Andrea Pastorotti, and will draw from the heart of the city’s Museo del Trò, ” said Mary A. Osborn, chair of the board of trustees. The biennial will include twenty works from Andrea Pastorotti’s series Carta naturale  (Culture and Nature), 1909–1920, which featured artworks by Faustino Bellini. Additionally, the biennial will also feature the work of Klaus Flick, a", "The next Biennial should be on May 27. \n\n\nThe seventy-sixth Cannes Film Festival, which took place last night, has released the list of exhibitors for its upcoming edition, which will run from May 23 to May 29. The full list of participating arts and cultural organizations is as follows:Art Paris: Art France’s Paris Art Biennial, which is held each May, has announced that it is canceling the event, which was set to take place at the Palais de Tokyo on May 24, and reopening the festival in May 2021. For the Cannes 19 edition, \"Art of Fear: Breaking the Code (July)” and “From the Shadows of Dust,” among other films, were selected for a special presentation and will present the theme, Breaking the Code.Organizer Bruno Imanonière announced that the event will be held at a new location in Cannes, in cooperation with the French Ministry of Culture, and will be headed by director-general Georges Apostu, who was recently appointed director of the Diller Scofidio + Renfro Foundation in Milan. The event will be held at the Palazzo Venezia in Venice and will be", "The next Biennial should be held in the summer of 2021, on the occasion of the centenary of the foundation of the Russian Academy of Sciences in St. Petersburg. \n\n\nThe National Gallery of Scotland has appointed Charlotte Brown as its new executive director. Brown comes to the institution from the Royal Academy of Arts, where she has served as director of exhibitions for the past twelve years. During her four-year tenure at the academy, she oversaw the expansion of its contemporary art collection, which is packed with more than 2,200 works, and oversaw the launch of the museum’s first online-only exhibition, “A Study in Common,” in 2017. Brown will take up the post on April 1.“We are delighted that Charlotte will be joining the National Gallery of Scotland,” said director Craig Mitchell. “Her leadership qualities, experience, and knowledge make her an ideal candidate for the role of National Gallery of Scotland’s chief executive.”Brown will assume her responsibilities in the coming months. In the meantime, the institution has launched an online exhibition previewing the upcoming exhibition “The Homages,” which will be curated by John Higgins and will run until November 13. The first show of", "The next Biennial should take place in September 2020 and will be organized by the A.I.R. Gallery. The second annual will be held in October 2020 and will be organized by the A.I.R. Gallery. The third will be held in December 2020 and will be organized by the A.I.R. Gallery. The fourth will be held in March 2021 and will be hosted by the A.I.R. Gallery. The fifth will be held in April 2021 and will be organized by the A.I.R. Gallery. The sixth will be held in June 2021 and will be hosted by the A.I.R. Gallery. The seventh will be held in August 2021 and will be organized by the A.I.R. Gallery. The eighth will be held at the A.I.R. Gallery between January and April 2022 and will be organized by the A.I.R. Gallery. The essays in this edition of the Biennial will be written by Lenny Abraham and Kamala Ibrahim. \n\n\nTwo hundred twenty-seven Islamic artists and activists have signed a letter condemning the governments of Bahrain and Qatar for their complicity in the", "The next Biennial should be held in 2021. The museum, which has been working on an expansion in the city, said: “We are continuing to design and research new ways to commemorate the 100th anniversary of the outbreak of the influenza pandemic in China, and are optimistic that we will gain new insight into the history of modern medicine and the evolution of modern societies in China in 2021 and beyond.”The museum also announced that it is working with the Chinese Academy of Sciences to create the first Chinese version of the museum’s exhibition “The Origins of Modern Medicine” (Tao Tian Yuan), which will be curated by the former director of the Central Academy of Fine Arts, Rengguangdi, and will open in 19 months. The exhibition will showcase the work of thirty-three artists, spanning art history, advertising, design, filmmaking, and music.The museum said that the program will also introduce “new materials and materials that are different from each other, and new ideas.” The exhibition will be curated by Rengguangdi, who first presented the work in 2017. During his tenure at the museum, he curated several exhibitions of the work, including “The Power of Picture” (", "The next Biennial should be held in the autumn of 2020. Its organizers have announced a date of November 2021.\n\n\nThe Institute of Contemporary Art (ICA) in Paris announced today that its next edition will take place at the Grand Palais in the fall of 2021. The incorporation of a new program that will involve the collaboration of more than forty artists in the exhibition, and will be accompanied by the 2020 edition, will be announced later this month. The program, titled From the Shadows, will examine the history of work in the contemporary art world, focusing on women artists and their work in the current climate. “With the institution’s new model of support, the upcoming biennial will strive to shift the focus from the past to the future,” said director Franck Riester. “The initiative is an extension of the work of the previous twenty-one years, and we are confident that it will be a success. The program will accommodate the current needs of the artist and will be inspired by the aesthetics of the times. We are also convinced that the program will be of great interest to younger artists and will provide an opportunity for them to think through the question of work and the way it", "The next Biennial should include a presentation of works by artist Ali Asadullah, who is currently incarcerated in Kuwait for his role in a major pro-democracy protest in 2011; a presentation of works by artists including James Turrell, Maren Ade, Alice Aycock, and Douglas Gordon; and a re-envisioning of the exhibition in which the artist-in-residence, Jasmin Ali, will present a new work by an established artist-in-residence, Laxmi Bhandari. The second Biennial will take place in 2020. \n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Charles Schlosser as its next executive director. He succeeds Kenneth M. Sack, who retired in March 2019 after eight years at the institution.“Schlosser’s appointment aligns MoMA’s mission with the conservation and restoration of art while honoring its founding partner, the artist-in-residence, Lila Jane.“The vice president of curatorial affairs at MoMA is a formidable position in the field, and we’re confident that with his expertise and broad experience, he will help shape MoMA’s future trajectory,", "The next Biennial should take place in the city in 2022. The exhibit will employ a rotating roster of artists from the city’s cultural and artistic community. The twenty-fourth edition of the Biennial will be held in the city in 2019.\n\n\n\n\n\n\nSixty years after the end of the Berlin Airlift, the Museum of Modern Art (MoMA) in New York has released the final images from the show, “The Biennial: Berlin Airlift.” Titled “Berlin Airport,” the exhibition was a collaboration between MoMA and the German artist Reinhold Richter and features fourteen original works by seventy-one artists, including Jan-Olivier Freund, Georges Apostu, and Erich Fromm, and is organized as a “panorama” of the city, a “shooting gallery,” a “factory,” and a “camp.”The exhibition’s first section, “The Eiffel Tower,” was organized as a “tour” of the museum, which is currently undergoing a $2.5 billion expansion. The museum will present a new section of the", "The next Biennial should take place in 2020.\n\n\nThe National Geographic Society announced today that it has acquired The Art of Manliness, the award-winning, multi-award-winning documentary that explored the concept of the soul and its relationship with mythology, history, and art. The documentary premiered on August 27, 2018 and won the 2019 Lifetime Achievement Award. In a statement, Robert C. Forrest, president of the National Geographic Society, said: The National Geographic Society appreciates the award and acknowledges the work of the film and the documentary team. The museum appreciates their efforts in advancing knowledge and understanding about our place in the cosmos through their scholarship. They are highly valued in the field of the natural world and are the inspiration behind many of our best-loved paintings.”The National Geographic Society is the only organization that owns and operates the largest collection of prehistoric art in the world. The museum holds more than 5,000 works in its collection, dating back to the Triassic period to the Anasazi people of Central and South America; the Pleistocene era to the Amazonian people of South America; and the Cenozoic Era to the Andean people of South America. “The art of manliness is", "The next Biennial should be held in the spring of 2020. \n\n\nBillionaire collector Pierre Pinault, who amassed one of the largest private collections of Benetton, is suing the New York institution for nearly $10 billion dollars, accusing the world-renowned auction house of fraudulently marketing its products. In a lawsuit filed in a Louisiana federal court last October, Pinault claimed that the New York dealer misrepresented the provenance of artworks sold through the auction house, which he says is currently trying to shut down.The lawsuit claims that the New York dealer made false and misleading statements to prospective bidders about the provenance of works that were never sold, and that the collection is now in possession of a work that was never purchased by the defendant.“When the defendant sold the works, the works were sold in a way that involved multiple sales,” Pinault told the Art Newspaper. “It was a great opportunity for the defendant to demonstrate that he was serious about bringing works back to New York. It wasn’t about acquiring works but about bringing works back to New York.”The art is currently being represented by attorneys Marc Glimcher and Monica Kohn, who have previously", "The next Biennial should begin in January 2021 and conclude in March 2022. The theme of the 2019 iteration was “The Plastic Boom.” The 2020 iteration will be “The Ephemeral.” The 2021 edition will be “The Future Is Present.”\n\n\nThe Art Show Dubai has announced that it will assume responsibility for the fate of the emirate’s iconic Al Maktoum Museum (AMM), which was converted into a museum by the private Saudi Arabian billionaire Prince Alwaleed bin Talal in 2007. The decision has vital implications for the future of the sprawling structure, which was built to house the museum’s collection of over four thousand Saudi Arabian artworks.The Art Show organizers contend that the government-backed organization’s decision to sell the museum to a private consortium led by the Abu Dhabi-based firm Noble Group Inc. renders its future uncertain. The Abu Dhabi-based group has proposed a plan to redevelop the museum, which is located in a remote corner of Dubai’s Royal Road, and has also proposed the building of a new cultural complex adjacent to the museum. However, the consortium has stated that it is committed to continuing with its project and will", "The next Biennial should be in March 2020, and the first exhibition should take place in June 2020. The biennial will include thirteen exhibitions and will be held at the Museo de Arte Contemporáneo Barcelona from March 15 to April 13, 2020. In addition, the institution will stage a lecture series at the Museum of Contemporary Art Barcelona on March 26 and March 29, 2020.A spokesperson for the Fondazione Biennale told the Art Newspaper: “The next edition of the Fondazione will be open in March 2020. The exhibition will be housed in the same building, the same hall and will be inaugurated with the same themes and the same people. We are already working with the project manager to make sure the Fondazione Biennale is able to open as planned, in March, 2020. We trust the museum will be able to adapt and carry out the scheduled opening at its regular times.”\n\n\nThe future of the Tate’s controversial £3.3 billion refurbishment of the Tate Modern is now in jeopardy after the museum voted to cancel the 2020 iteration of the Tate Research Week, which was originally scheduled for March 26–March 29. According to the Art Newspaper, the exhibition", "The next Biennial should be held at a location that can accommodate the permanent collection and is working on achieving its target of showcasing at least 5 percent of the collection every year. Hare, who has attended the museum every year since he started in the field in the 1980s, said the collection should include works by artists such as Bojana Dukovic, Evelyn G. Breed, and Raymond Boisjoly, among others who were working in Latin American art at that time.\n\n\nThe Los Angeles County Museum of Art (LACMA), the Museum of Contemporary Art (LA MoCA), and the Met-ART (Arts of Life) have issued an open letter to the public urging them to boycott the upcoming edition of the Venice Architecture Biennale in protest of what they view as a retreat in creativity, objectification, and art-making\u0097and a general reduction in the museum’s mandate. As the letter states, “[A]t the Venice Architecture Biennale, we demand that the Venice Architecture Fund and the Venice Foundation cancel their planned financial contributions and continue to fund the projects and exhibitions that make LA MoCA a unique and vibrant cultural destination. We demand this through a combination of financial", "The next Biennial should open in 2022 and will feature the work of twenty-eight artists, including Carlos-Luis Barbosa, Iñigo Alarcon, María Berrío, and Lamia Camacho. The exhibition will be held in the newly created 115-acre museum.\n\n\nThe Los Angeles County Museum of Art (LACMA) has appointed Jennifer Packer as its new deputy director and chief curator. She will be responsible for \"developing and executing an educational program that engages with, and in some cases rescues, art from the Los Angeles–region, California, region, and the nation.” Packer succeeds Sarah Schroth, who departed the institution in January 2020 to head the Santa Monica Museum of Art, and will begin in her new role in August.“We are honored to welcome Jennifer to LACMA,” said board president Michael Govan. “Over the last twelve years, she has developed a strong legacy as a curator and scholar who will continue to make LACMA’s collection and exhibitions accessible to the public. Her talent, passion and ability to build relationships with local, regional, and national artists—both in Los Angeles and throughout the state—are essential in", "The next Biennial should be held at a place that has a good connection with the city and a strong history of creative activity. It should be an appropriate venue for a museum dedicated to humanity’s relationship with nature. We must keep striving for a better future for humanity through art.”Commenting on the 2020 iteration of the exhibition, Anna C. Tomassi, director of the Biennale de Triennale and the Metropolitan Museum of Art, told the Art Newspaper: “The themes for the exhibition reflect the current mood and are inclusive of all disciplines as well as surrounding themes such as climate change, freedom, and spirituality. The Biennale is an important element of the city of Triennale de Triennale to bring to the city the most international collection of contemporary art. The combination of these three elements provides a platform to engage with the city of Venice and the Venice Region, and to organize and present exhibition in the city.”\n\n\nMore than 150 art workers have signed an open letter condemning the City of New York’s decision to terminate contracts with two of the city’s largest public arts organizations, the Knox Art Museum and the Central Park Conservancy. The letter, which was sent to", "The next Biennial should be held in 2021. The next Commission, which will also consist of a group of curators and scholars, will be held in 2019.The terms of the agreements between the institutions were not disclosed.<|endoftext|>The Seattle Children's Museum (Seattle Art Museum) is facing a legal complaint after a panel selected by the institution to redesign its campus decided to remove a statue of two-time Grammy Award–winning artist Bob Dylan and his wife, Patti, from the institution’s collection.According to the Seattle Times, the decision by the Seattle Children’s Museum’s board of directors followed a two-month review process that began in November 2019. The board approved the redesign, which was led by architect Peter Zumthor, in a vote of 21 to 8. The institution announced the redesign just days later. The museum’s board president, Susan Oxtoby, also voted to remove three other works by the couple: Bob Dylan, Kiss of a Woman, and The Times They Are a-Changin. “We are obviously disappointed,” said board president Cindy Sherman. “But we believe this action is in the best interest of our collection, the collection�", "The next Biennial should take place in September 2020. The next edition, titled Dreams of Our Children, will be held in March 2021 and will focus on the life and death of children. The next edition of the Biennial will be held in June 2021. The next exhibition will be staged in October 2021. The forthcoming twenty-third edition of the Biennial will be held in March 2022. In a statement, the Biennial said: “When we announce our selections for our 2020 season, we are conscious of the work that has already been done by the artists. The exhibition will be a snapshot in time—a glimpse into the world of our artists, and a reflection of the breadth and depth of the work of our biennial‑endorsers.”\n\n\nKATHMANDU, Nepal—On a beautiful, late-spring afternoon in Kathmandu, the capital of the Himalayan nation of Nepal, the Museum of Fine Arts (MFA) in Kathmandu opened its doors to the public for a two-day exhibition of work by contemporary artists. Titled “Nirvana and Beyond: Contemporary Women,” the show, which was curated by Frida Kahlo", "The next Biennial should be held in 2022, he said.\n\n\nThe Museum of Modern Art (MoMA) in New York has released the list of seventy-nine artists whose works will be included in the third edition of the Museum of Modern Art (MoMA3), “Between the Sun and the Moon,” which will also take place in the Museum of Modern Art’s new, expanded, and expanded auditoriums and will focus on “the future of art.” Titled “The Conscience of Art” and curated by Jacques Urban, the exhibition marks MoMA’s first time a major retrospective of a work by an African American artist, and the first time that an artist from the Caribbean, Trinidad, Jamaica, and Jamaica.“Throughout our museum’s history, we have demonstrated a commitment to and a history of inclusion,” said MoMA director Daniel H. Weiss. “Through its collection of works by artists of color, we have sought to make a statement about the legacy of the Caribbean, about how art can move us as well as change us, and about the history and future of art in America.”The artists selected for the exhibition include the following groups:", "The next Biennial should be held at the new site, which will occupy a former munitions factory, in 2021. The new museum will boast of a new replica of the Great Hall, the Museum of Fine Arts’s now-abandoned building, and an exhibition space for Arturia’s products. The museum will also have a café and cafe, as well as a new location for a listening gallery. “This is a moment of great change for the city, of the country, and of the world,” said Charles Dijers, mayor of Biennale de Lyon. “The city of Lyon is celebrating its fifty-sixth anniversary this year and we know that it will continue to prosper and thrive even more so as we continue to welcome visitors to the city. The new museum will be a joy for visitors to Lyon, a great model for future architectural grandeur, and a celebration of the city’s rich history.”\n\n\nThe museum’s director, Anish Kapoor, has announced that the institution is preparing to welcome visitors back to its campus once the biennial, titled “Between the Sun and the Moon,” is over. Although the show will return in", "The next Biennial should be a celebration of the journey of the world’s most beautiful artist to the US and a time for the biennial to reflect the American soul.”The artist’s first solo show in the country, which took place at the Hayden Planetarium in New York in September 1972, was a monumental and influential work, which deals with the minutiae of the body and the molecular biology of life. It remains a landmark work for its experimental concept of a “microcosm” and for the artist’s ability to cross-reference and re-create the artist’s pre‐dynastic surroundings. The show was de facto canceled by the New York City Department of Cultural Affairs after the artist said that he did not want to be associated with it anymore. His work will also be included in the upcoming exhibition “Superficial Machines” at the Museum of Modern Art and the upcoming exhibition “The Modus Operandi of the Spider,” which will open on February 23.A retrospective of his work is currently on display at the Brooklyn Museum, alongside works by artists such as Paul Gauguin, Pierre-Auguste Renoir, and Jean-Luc Godard.\n\n\n", "The next Biennial should begin in mid-April, and will conclude by September 27, 2020. The first edition of the exhibition, titled Boury, was held at the Museum of Modern Art, New York, from September 14 to September 21, 2019, and was curated by Oskar Eustis. The second edition, titled Time Called, was curated by David B. Davis and Odo Eriksson. The final exhibition, entitled The Future Is Here, was curated by Jordi Gwangju and Markus Knobloch. \n\nThe Israel Museum of Art in Jerusalem (IMA) has added four new works by artists whose work is currently under construction: Amir El-Khoury, Bethlehem, Bethlehem, and Bethlehem, a project by the Egyptian artist Hisham Yass, who has lived in the country since the late 1980s; Yoshitomo Sugiura, who has been based in Israel for several years now and is currently constructing a large-scale public installation in Jerusalem; and Amina Al-Qasimi, whose multi-dimensional, multi-layered work consists of thousands of images that engage in a range of narrative topics", "The next Biennial should take place in 2022.\n\nThe Haus de Todt, the Berlin-based contemporary art museum, announced today that it is closing its doors for the last time in 2021 and moving its exhibition hall into a new 35,000-square-foot space. The news comes after the institution underwent a major revamp in the spring of 2022, when it moved the exhibition space and the fortieth edition of the exhibition from a stone building in the city’s Kreuzberg to a new, modern, and state-of-the-art structure in the city’s Friedrichstrasse. The change was made in order to advance the museum’s efforts to integrate new works by artists from around the world into its programme.“We are very much looking forward to the next Biennale, both to the new and to the old,” said Wolfgang Becher, the museum’s director. “It will be a challenge to compose a show on a smaller scale with the same sensibility and more recent art and contemporary. We are deeply grateful to the Berlin community and everyone who has shared in our project. We will be missed by all who knew and loved you.”The new exhibition", "The next Biennial should also include a selection of new works by artists from the West Indies and Northern India (CA), and will focus on the global issues of migratory movements and climate change.The event’s inaugural edition, “After Climate Collapse,” will be held at Los Alamos National Laboratory (LAN) in Southern California from September 25 to September 29. The exhibition will be hosted by the Los Angeles–based nonprofit the Puerto Rican artist and activist Lourdes Rivera, who was arrested and charged with assaulting a police officer in L.A. County last week over her involvement in protests against the death of George Floyd, and will be curated by artist and activist Kyara Sarpong.All of the artists participating in the exhibition are members of the Puerto Rican Artists’ Movement (PAM), a grassroots organization that has been active since the 1999 elections. Founder Maria Elena Salas told the Art Newspaper that the center is “encouraging cultural producers of the Commonwealth of Puerto Rico to think about how they can create new work around climate change.”\n\n\nOn Wednesday, the Supreme Court of Canada ruled in favor of the Canadian government and granted a preliminary injunction to prevent the Dakota Access Pipeline (DAPL), a", "The next Biennial should be on-site in Mexico City for more than two years,” he said. The twenty-second edition of the festival, which will be held in Mexico City in 2021, will be held in the United States in 2022.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines for the display of artworks and other cultural heritage in its collection, including more than two thousand works by twenty-six contemporary painters, including Pierre-Auguste Renoir, Claude Monet, and David Salle, in a major overhaul of the agency’s collection program.The guidelines, which were developed in response to complaints from artists, curators, and scholars, lay out how the DCLA should approach the presentation of artworks in its collection by removing thirty-five works by artists whose works were previously restricted to the institution. The artists who will no longer be able to display works at the DCLA are Adrienne Edwards, Raymond Boisjoly, Anna Atkins, Amy Adams, Domenico Cattelan, John David, Tanya Cooper, and Mark Giordano.The institution will reopen with a new exhibition, “Art from the DCLA Collection,�", "The next Biennial should take place in Hong Kong in the spring of 2021. The first installment, “The Artist’s Place,” was staged in Hong Kong in 2022. In 2019, the Hong Kong pavilion was nominated for the inaugural Biennale. The biennial, which will be staged in Hong Kong, the United States, and Portugal, will be hosted by the Auckland City Hall in Auckland, New Zealand, in March 2021.The 2019 biennial featured work by thirty-two artists, including Nick Cave, Lena Horne, Kim Gordon, David Knepper, and Rineke Dijkstra. The festival will feature works by forty-three artists in the exhibition “The Artist’s Place” in the spring of 2020. The biennial will also feature works by artists from the Sub-Saharan region, which comprises Africa, South America, and the Middle East. The exhibition will feature an interactive art project by artist Leo McClelland.The 2019 edition of the Biennale also featured the first public performances of works by artists such as Jay-Z, Beyoncé, and Justin Bieber and included a virtual reality installation created by Emanuel and Ulrich Obrist. \n\n\nIn a move that raises", "The next Biennial should be held in the Spring of 2020.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has purchased the artwork, titled The Shape of Things to Come, from the artist and a collection of twenty-five works by painter George Porter. The substantial donation, made in recognition of the artist’s first major solo exhibition at the institution, was made in the form of a digital purchase, which was made on July 25, 2017.Porter’s works range in subject matter from abstract abstract abstractly textured to overtly political, and for their first exhibition at the museum, the institution will present them in a series titled The Shape of Things to Come, which will open on September 18. The works, which include a sculpture by the artist known for his films In the Mood for Love and The Body in Black, will be on view for thirty days from September 14 through September 21.In addition to the works, the museum will hold a retrospective of the artist’s work on view on November 17. “George Porter is a remarkable story of the exploration of the human condition, both literally and figuratively, from his earliest work and his more recent,” said museum director Nicholas", "The next Biennial should be held in 2022. Afterward, the show will return to the city of Berlin, as planned, with the opening of the exhibition “Under the Solar Eclipse,” which opened on September 11, 2024. The full list of participating artists is as follows:\n\nWinner of the 2020 Art Prize: Anna Andrzejewska\n\nWinner of the 2019 Art Prize: Gedric Jansa\n\nWinner of the 2019 Art Prize: Mona Cahnke\n\nWinner of the 2018 Art Prize: Jana Chytilova\n\nWinner of the 2018 Art Prize: Lukaso Cioli\n\nWinner of the 2018 Art Prize: Tata Katun/Im ai’ving\n\nWinner of the 2018 Art Prize: Rikke Pauschke/Rikke Kringl/Philosopher Jan Stegerl/Theater of Verne David Harwood (1926–1953)\n\nWinner of the 2018 Art Prize: James Robertson\n\nWinner of the 2018 Art Award: Julie Reichardt: “Sidney Gairy�", "The next Biennial should take place at the Musée d’Art Moderne in Paris in February 2020.The theme of the upcoming exhibition will be “Grandes Eaux” (The Artist’s Eaux), with the theme for the exhibition “Marinara” being the “past, present, and future\n\nElla and the Arts Club in Beijing is planning to open a new digital platform, the Archive of Contemporary Art (AC), in Beijing in April 2020. The platform will be able to host more than 3,500 materials and will be able to present more than 125 exhibitions.“We’re very excited to open up the Archive of Contemporary Art to more people in China, and to introduce new exhibitions in that city,” said Artnet editor-in-chief Xiaomeng Ma, who joined the workshoppe at the end of last year’s exhibition season. “This is a transformative moment for the Art of Asia, and an important step for China’s development as a global powerhouse. . . . We are confident that this new platform will play an important role in promoting the Arts in China and supporting the city of Beijing’s cultural sector.�", "The next Biennial should see the past, present, and future of this exhibition, with an emphasis on the exhibition’s legacy as an important catalyst for furthering LGBTQ liberation. Our committee will be led by Professor Adam Mitchell, Director of the Centre for Contemporary Art at the University of Cambridge; Prof. Cecilia Malandrini, chair of the department of art history of the university; and Prof. Lilli Tezcan, a curator at the New York County Museum of Art.\n\n\nThe New York City Department of Cultural Affairs (DCLA) announced today that it received a gift of twenty-eight works by west coast painters Ken and Marilyn French from the artist’s son, Anthony French, in a historic gift that will mark the artist’s seventy-fifth birthday. The works, which were donated by his family in 2008, will be installed in the lobby of the Museum of Modern Art, where they will remain for the next thirty years.The works, which first entered the collection in 2016, are Denzel-Denzel, 1987, a collaboration between artists Richard Adham and Jana Dallen, and Ennio Reginaldi’s City of Light, 2017, a work by Ad", "The next Biennial should be held in 2022. They have also stated they would like to see the institution return to the US and international model of organizing exhibitions, and will work with local communities to determine the series. The institution has faced many challenges in the past, including a fire in 2014 that damaged some of the works in the museum. The Acropolis Theatre Company in Athens staged a show of the works in 2017, and the museum reopened in 2020 following a $2.5-million renovation.\n\n\nThe Paris Art Biennale announced that the event will run from March 23 to March 26, 2020. Curated by Pierre-Auguste Neuville, the ten-day event will bring together more than 200 artists and art enthusiasts from forty-seven countries and fifty-two cities of the world for a four-day festival. The event will feature new works by artists from Belgium, Chile, Germany, Italy, New Zealand, and Spain.The event will be held in the city of Paris, which is currently undergoing a massive renovation, and will be hosted by a live concert by the local orchestra. During the celebration, the exhibition will be accompanied by a number of other activities, including a book fair, a photography show, a children’s museum", "The next Biennial should take place in 2021, and the first in 2024. If all goes to plan, Hoffman will unveil the venue for the first edition at the Kunsthaus in Berlin in the spring of 2022, and the Kunsthalle in June 2022. Both exhibitions will kick off in conjunction with the Berlin Art Week.\n\n\nThe Museums Association (MA), one of several international trade organizations that represent the collections and exhibitions of museums, has announced that it is now advocating for the United States to establish an International Commission of Museum Directors (ICMD). The organization is also proposing that museums follow a similar model as the International Council of Museums and Art to establish a national advisory council that would advise the president and Congress on strategic museum affairs.It is hoped that the I/CMD—which will convene in New York in June and will reopen in August—will serve as a model for how the United States can create an I/CMD, or a national advisory council for museums.Commenting on the initiative, the association said: “The exhibition business is a complex global enterprise. It must be responsive to the needs of a changing market and the changing world. The I/CMD would bring together a diverse group of experts", "The next Biennial should decide if the existing structure of the exhibition should be modified. The agreement between the two bodies stipulates that the museum’s three-day exhibition should be moved to a different location in the city, with a new exhibition that will take place every two years.The announcement coincided with the reopening of the new museum. While the institution originally opened to the public in 2004, it has since been closed for a year and a half due to the Covid-19 pandemic. However, that was not the case for the museum’s previous incarnation, which took place in the museum’s former space on West 16th Street in Manhattan.In 2016, the museum held a retrospective of Koons’s work The Butterfly, which was on view for thirty days before it closed on October 4.\n\n\nThe Los Angeles County Museum of Art (LACMA) has received a gift of more than five thousand photographs by Australian photographer Peter Brock. The donation includes more than two hundred photographs that explore the concept of photography’s relationship with other art forms and the contemporary landscape.The gift, which was made by the contemporary art collector and collector of Australian art Peter Brock’s collection, was given to the museum", "The next Biennial should be announced soon.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has commissioned British artist Gisele Bündchen to create a new work for the museum’s collection of works by British artists including Graham Greene, Robert Irwin, Gwendoline Christie, and Mary Beard. The commission is part of the institution’s ongoing initiative to celebrate the achievements and achievements of women artists in America.Bündchen’s first project for MoMA is a collection of work on paper, which features drawings by Caroline Lamb and Kiki Smith, among other female artists, as well as works by artists such as Mary Beard, Vito Acconci, and Mary Martin. She is working on a new form of the paper drawing, which will combine a shading technique with a mathematical analysis of shapes. The paper sketching project is part of MoMA’s ongoing effort to celebrate women’s achievement in the fields of art, design, photography, sculpture, and design.“Gisele Bündchen’s work is at the core of MoMA’s mission to advance the female artist in contemporary art,” MoMA director James Cuno said in a", "The next Biennial should be held in 2022. \nThanks to the collaboration of the community, the committee members, and the editorial staff of Artforum for their insightful and thoughtful responses to this exhibition. \n\n\nThe Yuz Museum in New Delhi, which was temporarily closed due to the Covid-19 pandemic, has announced that it has received a gift of fifteen works from the Tata Collection, which comprises Mazumdall, Shirley Neeson, and Doreen Ghose. The works will be exhibited in a new exhibition, “The New Middle,” at the museum from January 18 to March 27.The Yuz Museum is located at 277 B.R. Road, New Delhi, and was inaugurated by Maharashtra CM Devendra Fadnavis in March 2017. The exhibition opened with a retrospective of the work of United States artist Mark di Suvero, who represented India at the Venice Biennale in 2019.Fadnavis said: “This is a very special and exceptional gift. I’ve been a long-time supporter of the Tata Museum of Art, but this is the first time I’ve", "The next Biennial should be held in 2021. The 2019 edition, which was organized as part of the annual 'sstrual' cycle, was held on November 28–December 3, 2019. The exhibition was inaugurated by a new series of permanent retrospective exhibitions, “The Light of the World,” which opened on September 22, 2019.This year’s exhibition was curated by artist and curator Dusan Jakubowicz. The 2015 exhibition, “Cézanne: The Space Between,” is now open at the Art Institute of Chicago and will open in the Museum of Modern Art in 2020.In a statement about the 2019 exhibition, the Biennial said: “Since the exhibition was conceived in the 1960s, the Biennial has been an ongoing source of inspiration and inspiration for artists of every generation. With a new and innovative approach that involves a new approach to art, the exhibition has inevitably been challenged by a variety of new and interesting concepts.”\n\n\nNew York’s Metropolitan Museum of Art (MoMA) has announced that it is expanding the museum’s public engagement with the soul of New York and the history of American art through a series of new public events that will take place throughout", "The next Biennial should be held in the spring of 2020.The full list of participating artists is as follows:Dirk & Wilhelm , BerlinThe Duck Factory, BerlinThe Flemish Kunsthalle, FrankfurtCarlotta Boberg, FrankfurtPeter de Bruijn, AmsterdamPeoplemuse Museum, Milton Keynes, Manchester, UKPeter de Bruijn, AmsterdamThe Encyclopaedia of the Modern Way , StuttgartGaëtan Büttcher, BerlinAlexander Bischoff, BerlinAdeline Brüchner, BerlinThe GDR Museum, DusseldorfAnastasia Bittar, Frankfurt, ItalyBenedict Dautenhahn, Oslo, NorwayAnastasia Bittar, Frankfurt, ItalyAuguste Perrotin, Paris, FranceAndy Warhol and the GDR Museum, DusseldorfBibi Roesler, Berlin, GermanyBibi Roesler, Frankfurt, ItalyCarolyn Roesler, Brussels, BelgiumCarolyn Roesler, Frankfurt, GermanyThe Art Gallery of Modern Life, New York, New York, New York, New York, New York, New York, New York, New York, New York, New York, New York, New York, New YorkSue", "The next Biennial should be held in 2020, with the announcement of the theme: “The Future of Human Life.” In a statement, the university said: “Given our current situation: with a predicted rise in COVID-19 and with the possibility that we may be living longer; with the rapidly changing of the climate; and with the precipitous decline in the human population—we have chosen the theme of Life and the Future, with a view to challenging the science of death.”The year 2020 will mark the twentieth anniversary of the exhibition, which was founded by Michael Kohn, Robert Rauschenberg, and Olga Albizu, and premiered at the Hammer Museum in Los Angeles in 2015. The exhibition was inspired in part by Kohn’s childhood memory of being in a museum when an exhibition about the Holocaust was being staged. The show, titled “With Death and the Veil,” featured works by seventy-five artists, including Sean Kelly, Jóga Paz, Kiki Smith, Zina Saro-Wiwa, Karolina Wojtas, and David Zwirner.\n\n\nThe Museum of Contemporary Art (MoCA) in New York has appointed new founding board members", "The next Biennial should take place in 2022, after the expiration of the temporary suspension of the British Museum’s exhibition “Imperium: An Exhibition of the World” and the tenth anniversary of the exhibition “Cézanne: The Experience.” The König and Wirth Biennial will be held in Bern in the spring of 2021. The first show of the exhibition is titled “Imageless: The Most Beautiful Lines of the World” and will run for only twelve weeks. The second show is titled “Inauguration,” and will run for twelve weeks.The exhibition will be inaugurated by a selection of drawings and paintings by the four artists who are best known for their “Playboy” portraits: Leo Selm, Alejandro Castenada, and Alejandro Orozco. The artists will be joined by American artist Dorothea Rockburne, who will present a show of work by the artist in the United States next month. The inaugural exhibition “Inauguration” will draw from a collection of forty works, which were acquired by the König and Wirth, and will be inaugurated by a solo exhibition of work by the artist Car", "The next Biennial should take place in 2020.<|endoftext|>The Museum of Art in the City of Brotherly Love, Brooklyn, New York, has appointed Kathleen Grant as its next executive director. Grant, who currently serves as the deputy director of curatorial affairs at the Contemporary Art Museum St. Louis, will assume her responsibilities on January 16, 2020.“The Museum’s management has been supportive of Kathleen’s appointment in the past, and we are eager to see her first steps as the new chair of the organization as it enters its seventy-third year. We look forward to working with Kathleen as we continue to strengthen our collection and future exhibitions through exhibitions that reflect the unique and vital contributions of women artists, both nationally and internationally.”As director of the Contemporary Art Museum St. Louis, Grant helmed the building of the museum’s collection, expanded the museum’s exhibitions program, and curated the museum’s first exhibition, “Women Artists in the 1930s” (2019), which opened on November 22, 2019. She also oversaw the acquisition of the collection for the museum’s inaugural exhibition “The Female Body: Art and Feminism in the 1930s” (2019–20), which", "The next Biennial should be held in 2020, with the plan of creating a coordinating space for the various exhibitions and projects that are currently underway in the city.Šel, who is currently based in Zurich, said: “The research for the new center is already underway, and the Biennial’s programs will be presented in 2020. We will decide how to proceed in 2020 and beyond a matter of a few months.”\n\n\nThe Pérez Art Museum Miami (PAMM) has launched its online viewing rooms for the museum’s permanent collection, which debuted last year and are currently undergoing a renovation. The new platforms will allow museumgoers to explore the works in the museum’s collection and to purchase works directly from the institution. The platforms were developed by Pérez Art Museum architect María Berrío, PAMM’s curator of contemporary art, and PAMM’s business and technology department, and the Miami-based firm NextCity, which previously built platforms for the Pérez Museum’s collection.“PAMM’s collection is unique in that it is constructed in such a way that it is accessible to the public on a first-come,", "The next Biennial should take place in the spring of 2020, with the exhibition “Born on the Floor,” curated by Maria da Cunha, and its opening ceremony set to take place at the Palazzo Reale in Milan the following year. \n\n\nThe Museum of Fine Arts (MFA) in Atlanta is planning to shut down its operations next month, following a year of fundraising and community-building activities that had the theme “performances that celebrate diversity, weave together women’s and masculin images, and attempt to reframe the notion of women’s and femininity.” Its new president, Kima Kintari, said that the move was made in order to “work more closely with our community and partner institutions about how we present contemporary art to reflect the current cultural landscape.” The decision to end the museum’s existing contract, which runs through 2021, follows a year-long campaign in which the museum partnered with local, state, and federal governments, artists, and institutions to raise funds for the arts and a variety of grassroots organizations that sought to advance the museum’s mission. The campaign culminated in the museum’s reopening in March of 2019", "The next Biennial should be under the auspices of the National Gallery of Uptown, Los Angeles; the Los Angeles County Museum of Art; and the San Diego Museum of Art.The 2020 theme for the exhibition was “The Seven Senses.” The exhibition will feature works by forty-six artists, including Adam Potts, Felix Durán, Mark de Villiers, and Mark Leckey. The biennial will run through January 22, 2021. \n\n\nThe Metropolitan Museum of Art has announced that Stephen Friedman, who served as the executive director of the museum for the last four years, will be the next director of the museum. Friedman was hired in February 2019, following the departure of Johanna Macy, who had been the director of the Metropolitan since 2013. During her tenure, the museum has experienced a period of rapid growth. The last year has seen the launch of the new $3 billion metropolises, the Metropolitan Museum of Art in New York, the Solomon R. Guggenheim Museum in Manhattan, and the Metropolitan Opera House in London. Friedman also established a new curatorial program, the Stephen Friedman Curatorial Initiative, in 2017.“I’m looking forward to engaging with the Met�", "The next Biennial should be held in 2021.But what of the museum’s plans to close and reopen in the coming years? The museum employed the same concept in its 1972 reopening, this time with the full support of the local government. In an attempt to keep people entertained and company, the museum opened an electronic kiosk for visitors to rerun their favorite shows. The exhibition house is also considering ways to make its collection more accessible to the public; to create a more sustainable environment for future exhibitions; to expand its educational programs; and to launch a fund for research and preservation. A spokesperson for the institution told the Art Newspaper that the 2019 biennial had previously been postponed due to the Covid-19 pandemic. “This year’s edition will be an expression of our commitment to the island as a whole, and to the campaigns that we’ve been carrying out in the past,” said museum director Sianne Dekker. The museum will reopen on September 29, 2020 with the opening of “Kingdom,” a show commemorating the centenary of the founding of the Kingdom of Denmark. The show will feature as previously announced subjects such as Denmark’s", "The next Biennial should aim to create a new narrative for the exhibition as it merges elements from art history and contemporary art and will focus on the cultivation of new relations between theory and practice. At the same time, it will be a time for reflection on the historical moment in relation to the exhibition and its future performance.”A selection of eighty works will be on display, including work by artist-activists on the AIDS crisis, and the biennial will close on May 20.\n\n\nArt collector Richard B. Landon and two of his sons, Richard Landon Jr. and Richard Landon: Jr. will be awarded a $150,000 MacArthur Fellowships in art history and the creative industries. The fellowships were established by the MacArthur Foundation to encourage philanthropic giving to artists and to provide a way for MacArthur family members to advance their careers.“The Landon and Art of the Future awards have been a wonderful way for Richard to make a positive impact on the art world,” said Lonnie Landon. “They have been transformative in their impact, allowing him to work with his sons to develop new projects and to push their careers in innovative directions. Richard has been a devoted mentor to Richard Jr. and has", "The next Biennial should have a special focus on the study of the traditional oriental artl . . . while at the same time reflecting the current political and social climate.”The next edition of the Hong Kong Biennale will take place in March 2021. Tickets to the 2019 event, which was organized by Hong Kong Art Museum, cost HK$80,000.\n\n\nThe Noguchi Museum in Queens, New York, has received a gift of more than 1,300 photographs by Italian director Stefano Noguchi. The donation includes an exhibition of the artist’s works in the museum’s exhibition “Noguchi: The Path of the Photograph,” which opens on October 9. Noguchi’s photography has been collected by the museum since 1999 and is currently in the collections of the Italian Ministry of Culture and the Museo del Tristesse.Born in Turin in 1943, Noguchi graduated from the Academy of Fine Arts and Sciences in Milan in 1951. He later served as a curator at the Museo di Fiminazzi in Venice, where he worked on the Giovan Cassino—one of his last works, a replica of a cathedral in the city. In 1957,", "The next Biennial should be held in 2021.\n\nA list of ten artists who will participate in the sixth edition of the Biennial, which will take place in the city of New York and will focus on environmental justice, was released by the organizers on Tuesday. The biennial will also draw from the work of twenty-four artists who are currently or will soon be in New York City and will feature a new selection of works by artists and activists.The list of artists who will participate in the biennial, which will take place in the city of New York from March 20–March 21, 2020, comprises Amarnath Chattopadhyay (New Delhi), Yayoi Kusama (New York), Kim Rhee (New York), Quavo Rooij (New York), and Yoko Ono (New York). The artist roster also features ten-time winner Nari Ward, whose work is currently on display in the upcoming edition of the Biennial, as well as artists from the Global South, the North, and the East. The full list of participating artists is as follows:1.  Amarnath Chattopadhyay (India)2. Mareek Akhter (Germany)3.", "The next Biennial should focus on the history and integration of the exhibition, as well as the preservation of the exhibition and its collection in a museum’s collection. \n\n\nThe eleventh edition of the Berlin Biennale, curated by an intergenerational group of South American artists, has announced that it will be held at Deutsches Kunsthalle Heidelberg from March 17 to March 22, 2021. A retrospective of work by forty-three artists from the region, led by Marcel Prouvé, will be presented at the German Cultural Center Cologne from March 21 to March 23. The event will also include a public exhibition of work by seventy-nine curators from Brazil, Argentina, and Peru.The biennial will also introduce the Berlin Art Museum and the Deutsches Kunsthalle Heidelberg, which has been closed since March 14, and will serve as a platform to engage with the city’s art and culture. The museum will be rebuilt by the Heidelberg-based firm GEM–Plankhörper GmbH and the architect Michael Heim, and will be located in a former textile factory near the city’s Kreuzberg shopping district. The plan is to launch", "The next Biennial should be held in the spring of 2021, at the University of California, Berkeley, but there were some concerns that the event might be pushed back to spring 2022. Last month, the city of Oakland released a statement saying that the timeline for a new biennial had yet to be determined. Mayor Jean Quan also said that the city would work with the university to ensure the safety of the community and work with the university to identify a location for the biennial, but that it had not yet determined a date or the format of the event.\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Christina Rogers as its next president and CEO. Rogers comes to the institution from the Boston Art Gallery (BAG) in Quincy, Massachusetts, where she has served as the curator-at-large since 2017. “Christina brings a wealth of experience across disciplines and disciplines in restoring, cataloguing, publishing, and exhibiting contemporary art,” said Jennifer Rhodes, the museum’s interim director of curatorial affairs. “She is dedicated to expanding the BAG’s teaching and institutional relationships across disciplines and disciplines in moving beyond the museum’s current curatorial vision, which has served us well", "The next Biennial should have a theme that will appeal to you. We had the opportunity to choose from themes and we chose to use the theme of the exhibition to explore the disconnection between the modern and the Victorian era.”Sara Zervos, the executive director of the Society of American Art, also praised the exhibition’s curators for their creativity in crafting the exhibition’s opening sequence. “The exhibition was designed to open with a new work by a contemporary artist, and to give the public a moment to experience his work,” she said. “The sequence is a celebration of art as a force for good and a testament to the power of art. I’m thrilled to be an artist partner with them and to continue to support their work as we continue to present works in the exhibition.”\n\n\nFirst published on the Art Newspaper in January 1948, six months after the Second World War ended, Pale Moon Rising—a documentary about the American South, set in the islands of Guam and Palmyra, and directed by Andres Pérez, Jr. and shot in archival, archival, archival—has been released by the US Department of State. Titled Pale Moon Rising", "The next Biennial should take place in 2022. \n\n\nThe Israeli Museum of Human Rights in Jerusalem announced today that it has received a donation of fifty-one artworks from the Greater Middle East, which it described as a “watershed” of modern art. The works were donated by artists such as Adnan Naar, Hisham Al Qasimi, and Rafał Banerjee, who are active in the local community. “The donation of works and the dedication of the Hadean institution is an amazing gesture by the community to the greater Jerusalem,” said Nita Katz, the director of the Hadean institution. The works are from the collection of Naar, Al Qasimi, and Al Qasimi’s father, who came to the region from Iran more than three decades ago.The donation includes works by Palestinian artists Khalil and Akram Al Qasimi, Hussein Qasimi, and Muhammad Qasimi. Khalil, who recently donated his work “Imbigal Man” in commemoration of his son, Hussein Qasimi, who was assassinated by the Israeli military in 2015, and his son were among sixty-nine individuals who donated works to the", "The next Biennial should also look at what can be done to increase the visibility of artists in the Gallery’s collection through the introduction of new exhibitions and the promotion of a more ambitious collection. The Madrid Biennale will take place next month.\n\n\nThe House of Blessing for Arts and Humanities (Haringburg, Virginia) has announced that it has received a gift of twenty-one artworks from the estate of artist Charles A. Birkenhead, who passed away on December 12 at the age of eighty-seven. The works were donated in recognition of his contributions to the arts, and are part of a series that includes works by Marianne Elliott, Zadie Smith, and Ed Moses.“The House of Blessing for Arts and Humanities was pleased to welcome to the family this new gift of works by Charles A. Birkenhead,” said Mary McKean. “This remarkable collection will continue to serve as an important model for nurturing the arts and strengthening the human experience in the Garden State.”The works that make up the series are a collaboration between Birkenhead and Smith, who are co-authors on several books on the arts and literature, including “Genius” (Yale", "The next Biennial should commence on September 22, 2020 and will be hosted by the National Gallery of Art in Washington, DC; the Seattle Art Museum; and the Museum of Contemporary Art, Atlanta. In the meantime, the National Gallery of Art will hold a series of exhibitions, including “Theaters,” which opened on July 24, and “Wonderworks,” which will open in September. From the moment the institution was established in 1939, the National Gallery of Art has been committed to the art of what it calls “indecipherable” art. Its first major exhibition of this kind was “The Indecipherable Goldmine” (1957), a collection of drawings, prints, maps, and geometric forms by John Gardner. In addition to the collection, the museum houses three collections of the work of American artists: American Art at Home, American Art at the Museum, and American Art at the National Gallery.\n\n\nThe Leeds Art Museum has appointed Polly Aylor as its new executive director. She succeeds Jo Higgins, who resigned in July 2019 after eleven years at the institution and will assume her post in March 2021.“Polly’s achievements in bringing the Leeds Art Museum and the", "The next Biennial should take place in 2021. The exhibition is organized under the direction of artistic director Janine Olivares, who will become the inaugural director of the newly established Rubell Museum. The museum will have eight hundred works by 120 artists and will be housed in the same building as the museum of modern art. “Luz and I are thrilled to have this opportunity to design the next Biennial,” said Julien Coquard, the executive director of the Rubell Museum. “The new format will bring together the most innovative and innovative artists from the west and central regions of France, and will increase the public’s understanding of their vast physical and conceptual landscapes.”The announcement of the new museum, which will be located on the campus of the Université de Toulouse-LeClermont, comes amid a controversy over whether the museum’s new building should be designated a cultural monument. Culture Minister Franck Riester said in May that the ministry was analyzing the issue, and a spokesperson told the Art Newspaper that the ministry is “committed to rationalizing and democratizing the building of monuments, and to assessing the impact of monuments on the environment and the cultural life of the", "The next Biennial should take place in September, and a new exhibition, “London: 28 Years of the Biennial,” will be presented at the National Museum of Art in September 2020.The roster of participating artists is as follows:Akram Al-Nouri (Jordan)Akram Al-Nouri (Jordan)Akram Al-Nouri (Jordan)Chadall Abdi (United Kingdom)Chadall Abdi (United Kingdom)Chadall Abdi (United Kingdom)Chadall Abdi (Jordan)Chadall Abdi (Jordan)Chadall Al-Nouri (Jordan)Chadall Al-Nouri (Jordan)Chadall Al-Nouri (Jordan)Chadall Abdi (Jordan)Chadall Abdi (Jordan)Chadall Abdi (Jordan)Chadall Abdi (Jordan)Chadall Abdi (Jordan)Chadall Abdi (Jordan)Chadall Abdi (Jordan)Chadall Abdi (Jordan)Chadall Abdi (Jordan)Chadall Abdi (Jordan)Chadall Abdi (Jordan)Chadall Abdi (Jordan)Chadall Abdi (Jordan)Ch", "The next Biennial should be hosted in the summer of 2021. \n\n\nA group of artists who created works that address issues of gender and self-exploration during and after the American Civil War are urging the state to recognize their legacy works as official state heritage works.  \"This way we can all pay homage to our ancestors and to the many women and men who made America great and who shape our nation in important ways today, but also to our foremothers, our great-grandmothers, and our great-great-grandmothers and our great-great-grandsons, and to those women and men whose lives and work have shaped our nation and shaped the world to this day, and to those women and men whose creative contributions will continue to shape the future of America, and which need not, in any way shape or form, be subordinate.”Among the works that have emerged from the exhibition are The Angel in America (1905), a series of bronze angels and their coffins, arranged in a John L. Jackson-like grid, and Phenomena for Men (1906), an assemblage of thirty-one male nude angels and their coffins, arranged in the form of the American", "The next Biennial should take place in 2022 and will be hosted by the São Paulo State Museum. The theme “Feminine/Masculine” will be a reflection of Brazil’s current gendered political and economic ills and will examine the ability to construct, sustain and create new identities for Brazilians.\n\n\nThe Museum of Modern Art (MoMA) in New York has received a gift from the Geffen Museum of Art in California, which is dedicated to the exhibition of contemporary art. The gift, which was given to the institution by collector and art historian and collector-designer Frank Gehry, includes twelve works by artists such as Tomasz Klimczyk, Rikk Stone, and Iris Claussen.“New York has a rich and important legacy as the birthplace of American art,” said David Breslin, the institution’s chairman and CEO. “In recognition of this, MoMA is donating twelve works by a long-standing and highly admired collection of American contemporary art. The gift is particularly meaningful in light of MoMA’s recent announcement that it is working to close the doors of its three Los Angeles locations and is considering the possible construction of a new headquarters. We", "The next Biennial should open in 2022.\n\n\nA group of artists who are protesting the destruction of their work by the Israeli authorities at Adalah—a United Nations-backed organization that represents Palestinian artists—are asking the international community to intervene in support of their cause. In a letter addressed to the United States, France, and Germany, which were signed by Ali Haidara, al-Monaydi, and Wael Jawad, the group writes: “The destruction of art is not only a violation of human dignity, it is a flagrant violation of international law. We call on all parties to protect and support the Palestinian artists who have been rendered homeless, and we call on Israel to take all necessary steps to ensure that the works and materials in its possession are returned to the heirs of the Palestinian artists’ property.”Hoor al-Qasimi, the director of the Fatah Initiative for Palestinian Studies, told the Art Newspaper that the situation is “complex and multifaceted.” He explained that the demolition of Palestinian art is a “single issue.” al-Qasimi added that the destruction of cultural artifacts is “a very difficult situation.”While the Israeli government claims that", "The next Biennial should focus on the Don and Ira D. Wallach Art Museum in New York and the much anticipated restoration and renovation of the Whitney Museum of American Art.\n\n\nThe Museum of Fine Arts, Houston (MFA), announced today that Jakob Nielsen has been appointed as its next executive director. Nielsen, who comes to the institution from the Brooklyn-based firm Walsh & McKenzie, will focus on developing and executing programming for the museum while it undergoes a $500 million renovation and expansion project, which is expected to launch in the spring of 2021.“We are thrilled that Jakob will become the next executive director of the MFA Houston,” said Christine Odendall, the museum’s director. “His track record of achievement and commitment to the MFA and the collections and outreach of the museum will be instrumental in delivering on the MFA’s promise to serve the community.”Nielsen has served as interim director for the museum since August 2018, when it was still a branch of the Brooklyn Museum, and has been a member of the board of trustees since 2014. Prior to joining Walsh & McKenzie, Nielsen held several leadership roles including president of the New York City chapter and worked as director of cur", "The next Biennial should be held in the third quarter of 2021. David J. Hughes, chair of the department of art history and director of the Center for Art History at the University of Buffalo, said: “The new archaeological digs, which will integrate with the existing campus, will offer an unparalleled opportunity to hear and see the works from the original site of the Museum of Art.”\n\n\nThe public art commissioning sector is undergoing a major disruption as a result of the pandemic. The New York City Department of Cultural Affairs (DCLA) has announced that it will cap the number of works produced by any one institution at one time, beginning on Monday, March 19. The DCLA’s announcement follows a report published this week by the Art Dealers Alliance as part of its campaign to secure new federal legislation that would protect the art industry—the industry employs more than one million people across the United States and employs some of the lowest wages in the country.While the federal government has allocated $9.7 billion to support the art and cultural sector, state and local governments are struggling to adapt to the pandemic. The National Endowment for the Arts (NEA) in an effort to mitigate the impact of the coronavirus", "The next Biennial should be held in 2020. \n\n\nThe Victorian Art Museum (VAM) in Melbourne has been awarded a $30 million grant from the Victorian government. The Victorian Arts Council has also allocated $6.4 million to support the revitalization of the Victorian Museum of Art and the Victorian Museum of Fine Arts in Melbourne.The grants come at a time when the Victorian government is working to insulate some of the state’s most important institutions from the impact of the coronavirus, which is spread mainly from person to person and can be contracted from close contact. The Victorian government has allocated $63 million to advance the fight against the coronavirus, and $26 million to date to mitigate the spread of the virus.The Victorian government’s Victorian Tourism Corporation (VTC) has also invested heavily in promoting tourism in the state, launching the Victorian Journey and the Victorian Leading Show in 2018, and has announced a number of initiatives to bolster the Victorian economy, including a $500 million Victorian Bonus Scheme and a $200 million Victorian Traveling Sales Tax Credit.The state also recently committed $250 million to the preservation and restoration of Victorian art, and has allocated $150 million for the immediate needs of the Victorian government. The Victorian", "The next Biennial should take place in 2020, and the next one in 2023.\n\n\nThe Museum of Fine Arts (MFA) in Boston is planning to shutter its current exhibition “The Life and Death of Pablo” in protest of the United States government-sponsored campaign against the museum’s founder, Pablo Picasso, and his legacy. The work, which was created in response to the Vietnam War, will be presented in a new exhibition, “Pablo Picasso,” at the museum in February 2021.The statement issued by the museum follows a new report by the European commission on cultural heritage, published on February 9th, which found that more than 3,500 works by the artist are currently missing or damaged in China, Iraq, Syria, and North Korea. The work of renowned West Indian sculptor Kahlil Joseph, whose work was also featured in “The Life and Death of Pablo” and is represented by the Guggenheim in Manhattan, and works by other West Indian artists from India, Iran, Persia, and Iraq are also at risk.The commission of the new exhibition was spearheaded by the newly appointed cultural minister of culture, Birgit Haag, and was organized in cooperation with the museum", "The next Biennial should be held in 2021. Nairobi has hosted the exhibition twice in the last two decades. The 2019 iteration was staged by the Annenberg Foundation and the Hirshhorn Museum. The 2020 iteration, titled “The Souls of Men,” will be curated by Yinka Shonibare. \n\nThe National Portrait Gallery in London has received a donation of six paintings by Chinese artist Huang Haibo\u0097including a series titled “Autobiography of a Woman,” 1928, which was created in a studio in London; Wu Shan Shi, 1963, which was created in a studio in Shanghai; and Wu Zhijie, 1979, which was created and painted in Shanghai.The donation was made by artist Paul Mpagi Sepuya and collector Arsht Honig, who visited the gallery on October 31. Honig also lent the work to the National Gallery in 2015, when it was still represented by Mpagi Sepuya, and the gift was made in recognition of the institution’s partnership with the artist.The individual artists were selected for the donation by a panel of international curators and scholars. Huang is one of three Chinese artists to make", "The next Biennial should consist of thirty-five (35) exhibitions, each of which will be curated by a different artist, and should be organized in accordance with the theme of the current Biennial. Themes will include the relationship between the artist and the world, moving objects and the artist, and the artists themselves. The exhibition will take place in the space where the artwork was found and will consider how the work of an artist can be entrusted with a powerful potential for the artist to come after. The following biennial guidelines are adapted from the guidelines of the first Biennial, which was held in 1995. The artist(s) are selected to represent a specific body of work, a subject or a group of artists. The body is chosen to represent a particular body of work or a subject that is currently understudied, understudied, or understudied again.“The artist(s) selected for the forthcoming Biennial are chosen from a pool of thirty-five (35) artists. Their work is selected for its relevance to the current issues of the exhibition and, in particular, to the current issues of the exhibition. The artist(s) selected for the upcoming exhibition are selected from a pool of seventy-one (", "The next Biennial should take place in 2022, to be followed by the 2020 iteration. They will also hold their next Art Basel show in Miami Beach in 2021 and their Venice Biennale in 2020.\n\n\nPrada has appointed Elena Bocherelli as its new creative director. Bocherelli comes to the brand from the Italian luxury confectionery company Tia. The Paris-based designer, who previously helmed the Italian fashion industry, founded her eponymous fashion label in 1988. She has since expanded her range of projects to include design and art exhibitions and collaborations. The company currently has five partners in Italy, including L.A. Reid and Damien Hirst, Los Angeles; and Burberry and Prada.Called Fashion with Purpose, the first installment of Fashion with Purpose will feature the work of twenty-nine-year-old Italian artist Chiara Bertolotti, who was selected for the inaugural exhibition in June 2019 by the prestigious Italian luxury designer Silvia Baldissaro.The show will follow the trajectory of a portfolio of works that include the exhibition-turned-decoration-making space Carriageworks in Milan and the clothing brand Lanvin, which focuses on ethically sourced materials. Bocherelli will be", "The next Biennial should take place in 2020 and will draw from the Film and Video Archive of the National Museum of Australia, the Australian National Gallery, and the Royal Botanic Gardens. The biennial of Australian art will also organize a solo exhibition at the National Gallery of Australia at the end of 2020 and will present an exhibition of works by women artists at mycollec and at the National Gallery of Art in the same year. The new format is reflective of the times and the Indigenous peoples who are represented in the collection and exhibition. The panelists for the 2019 edition included Johnny Chris-Anderson, Kymi Cätula, Lorraine O’Leary, and Kiki Smith. \n\n\nThe Royal Academy of Arts (RA) in London announced today that it is planning to close to the public in an attempt to curb the spread of Covid-19, the novel coronavirus that has infected more than 5,200 people in the UK and caused at least twenty-nine deaths. The news comes on the heels of a decision made by the Royal College of Art (RCA) in a bid to reduce the number of coronavirus-related deaths in the UK.According to the BBC,", "The next Biennial should include a selection of paintings by artists whose work has been previously included in a biennial, and is currently in the process of determining a theme for the Exhibition. The programme will draw from the latest work on the Museum’s collection and will focus on a single theme: “the relationship between art and culture,” a statement by James M. Chick, chair of the trustees of the Biennial, told Artnet.  The biennial will be hosted at the Museum from January 26 to March 27, 2020.\n\n\nCoffee House, a nonprofit arts incubator in Seattle, has announced it will become the first organization to move into the historic Pike Place Market Square space next year. The new space will be located on the third floor of a former Boeing manufacturing plant, next to the Pike Place Market, and is being funded entirely with funds from the Seattle City Council.The decision to move into the space was made by Councilman Mike O’Brien, who chairs the city’s economic development committee, and Councilwoman Lisa Bender, who represents the Eastside, after analyzing the market’s demand for more affordable housing.“I wanted to build an arts incubator and provide local Seattle residents with", "The next Biennial should take place in 2020 and will be hosted at the Centre Pompidou in Paris.“We are pleased to be able to contribute to the French capital’s cultural heritage and are looking forward to exhibiting our work at the upcoming exhibition,” said the artist.\n\n\nNew York’s Metropolitan Museum of Art (MoMA) has launched a new digital initiative to support artists whose work has been digitally remastered in order to improve the museum’s image, which is currently being improved by French and German artists. The campaign, dubbed #METOISE, will feature works that have not been digitally remastered in five years by the artists featured in its exhibition “After aeons: Selected Artistic Remasterments” and will debut on May 13.“The program will work with artists, whose work has never been publicly displayed before, to bring their work and their exhibitions into the future,” said Met director Daniel H. Weiss. “The goal is to present work that is both surprising and forward-looking, to tell the story of art in an age of unprecedented change.”Lévy Gorvy (LGA) and Giant Space (LGS) have announced the", "The next Biennial should be held in 2020, and the 2019 edition was staged at the Fondazione Beppe Grillo’s home turf of Milan in October. However, the current Italian president, Giorgio Napolitano, has said that the event will not take place in the city of Milan. The 2019 edition, which was prepared by Beppe Grillo in conjunction with the Fondazione Beppe Scala, was delayed until March 11, 2020, and the 2020 edition will be held in March. The 2020 event will be hosted by a venue in Milan, the Punta del Este, and will be curated by a consortium comprising Pieta curator, musician, and novelist, Salvatore Ligouri; the French architect, Bruno Bonaccorso; and the Italian designer Julia Alvarez-Pérez.\n\n\nAmerican artist and activist Ruth Vincent, whose hauntingly beautiful paintings and installation pieces blended surrealism, drawing, photography, and sculpture, has died at age seventy-six. Vincent’s four-decade career was marked by an intense sensitivity to and a deep understanding of the human condition. Her most recent project, “The Three-Body Problem,”", "The next Biennial should take place at the University of Stuttgart in August 2020. Its aim, according to the art historian Wolfgang Olszewski, is to “evaluate the current historiographic situation in the field.”\n\n\nThe Museum of Modern Art (MoMA) in New York has announced its representation of the African artist, activist, and educator Johannes Mehring in the upcoming exhibition “Jobs: Analysing and Translating,” which will run concurrently with the annual March for Jobs. The work, which is an adaptation of a lecture given by Mehring in London in 1959, examines how jobs have impacted on and shaped the lives of black workers in the United States.Born in the United Kingdom in 1940, Mehring lived and worked in the United States until the 1960s. He began his career as a painter and sculptor before moving to New York in the early 1970s to launch the Black Power movement in support of voting rights and the Black Lives Matter movement in the city. In 1983, the same year Mehring received the National Humanities Medal, New York’s Museum of Modern Art began hosting his work, which was represented by MoMA in the exhibition “Jobs.”\n\n", "The next Biennial should be announced by the end of March and will consist of ten exhibitions and will be based on the themes “World War II and the Legacy of Biennials” and “Race and Existence” with presentations also taking place in the United Kingdom, the United States, Germany, and China. The pavilion will be inaugurated by a presentation of the first exhibition, “The Body and the Nation,” following on from the Biennial’s inaugural exhibition, “I, the World.” The biennial will also mark the fifty-sixth anniversary of the institution. Organizers of the biennial are Gert-Jan Steerson, chairman of the board of trustees of the Bezalel Art Museum (BAM), Germany; Dr. Adrian Piper, chair of the board of trustees of Art London; Dr. Mikhail Safronov, director of the FIS; Andrea Dutton, director of the Museum of Modern Art, London; and Dr. Wolfgang Müller, director of the Museum Freie Kunstverein, Munich.\n\n\n\n\n\nThe British Library, London, has released two landmark studies of the life and work", "The next Biennial should take place in 2021. The date of the exhibition itself remains unclear.\n\n\nThe Museums Association (MA), the United Kingdom’s professional body for conservators, has launched an investigation into allegations that the Royal Shakespeare Company (RSC) has been deliberately excluding women and minorities from its artistic and executive ranks. The investigation was prompted by Kirsten Cartwright’s allegation that she was excluded from a senior position at the RSC in 2015.“We understand that it is a difficult situation to understand and it is possible that the RSC and the company have tried to hide the truth, but we have made our position clear,\" said David Attenborough, chairman of the association. Attenborough said that his group had made it clear that we would not tolerate excluding women and people of any kind from the RSC. We have made a deliberate choice not to select anyone for the role of director of the Tate, and we have continued to do so throughout the RSC’s director general, Karen Bradley, who has led the institution for over twenty-five years.We are also committed to supporting and promoting artists of all backgrounds and to supporting all aspects of the RSC’s work, including", "The next Biennial should take place in 2021. “We are at the beginning of a new phase of our work,” said Perrotin. “We are now looking forward to the next stage with the full knowledge of all stakeholders. The new site, the new exhibition, and the new initiative will be guided by the same values, in collaboration with the same commitment and in accord with the same principles.”The biennial was established with the offer of €3 million in 2017 to the city of Biels, which has a population of about two million people. The city council approved the offer of a total of €10 million for the construction of the exhibition pavilion, which is located in the old city of Biels, in May of that year.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is preparing to welcome visitors back to the institution for an exhibition commemorating the twentieth anniversary of the September 11, 2001 terrorist attacks. At a ceremony that was held on Thursday, organizers said that the pavilion, which will include works by forty-seven artists, will draw from a collection that was created by the institution’s permanent collection staff.“It is a very special day for MoCA to be", "The next Biennial should be in 2021. For a full list of current and proposed sponsors, see “Architecture of Life.” The exhibition will take up the work of forty-seven artists and will run for twelve weeks.\n\n\nThe museum’s collection of more than 4,000 works by a single artist will be gifted to the City of New York by billionaire collector and philanthropist Warren Kanders. Kanders, a longtime friend and supporter of the institution, made the announcement on Monday, September 7, in honor of the biennial’s ten-year anniversary.The gift marks the culmination of a decades-long partnership between the Kanders and the city of New York. Kanders, whose company, Kanders+Parsons, has a long history of supporting local, regional, and national arts organizations, including the Finger Museum of Art in New York, the Museum of Modern Art in New York, and the Metropolitan Opera in New York. The Kanders Foundation has also endowed the Frederick’s Art Museum in Kansas City with $10,000 since 1993. Kanders was the founder of the Fredrickson Foundation in 1977 and the foundation’s board chairman until 2013. “Over", "The next Biennial should be held in the autumn of 2021, and the biennial’s first year should begin in 2022. The artist-run event will be hosted by the London-based artist-run nonprofit, the London-based biennial series Art and Words . During the collaboration between the artist and the nonprofit, the project will include a number of projects and presentations by artist-run exhibitions, including an exhibition of works by Richard Fossey (2019), a group show at the Art Gallery of Ontario (the London Art Gallery) (2019), and a retrospective of work by the London-based artist-run company MASSION Architecture (2019).\n\n\nThe Museum of the Jewish People (MoJ) in New York has hired Jeff Rosenfeld, a curator of European art, to become the next director of the museum’s European section. Rosenfeld will assume his post on January 16, 2021. He succeeds Cheryl Ruge, who departed in the summer of 2021 to become director of the Museum of Modern Art in New York, and will take up his post in January 2022.“Jeff has been an outstanding curator and scholar of European art for decades, and has shown in recent years his ability to bring ambitious", "The next Biennial should be held in 2021 and “the first in 2024,” said Tonya Blatchford, the festival’s director. “The new location will provide viewers with a unique experience of the Museum of Art and the collection, both in person and digitally, while also showcasing the work of the artists and their exhibitions in the sustainable and contemporary art space.”Museum director Hans-Ulrich Biemann, who has served as director of the museum since 1999, added: “It is a great honor to welcome the artists to the new Biennial. We hope that they will develop new and original ways of expressing their creativity. The new institution will offer a strong platform for new artistic projects, which will hopefully make the venue a very special home for contemporary art.”Among the artists who will be featured in the biennial exhibition are Anna Atkins, Annie Hall, John Akomfrah, David Bowie, Frank Gehry, Leslie Knope, Michael Olentans, Mary Panetta, Christine Owens, Matisse, Ed Ruscha, Edward Teller, Robert Irwin, Jack Nicholson, Martin Luther King Jr., and Ralph Waldo Smith.According to the Los Angeles Times, the exhibition will be organized as", "The next Biennial should be in 2022.” The next iteration of the exhibition will take place in Beijing. \n\n\nThe Antenna Museum in Amsterdam has announced that it is planning to reopen in 2021. The institution has been closed since March 2019 due to the Covid-19 pandemic. For the past ten years, the museum has housed forty-five of the world’s greatest living artists, including Mel Chin, Hildegarde Duane, Percy Hudson, Claude Monet, and Hans Vossen, and has been featured in a variety of exhibitions. The museum is currently restoring the building to its original state, including renovating the galleries, and plans to start the reopening in March.The renovation project, which has been made possible through funding from the Antenna Foundation, the Antenna MFA, and the Dutch Ministry of Education, Art, and Research, will involve the construction of several new spaces, including a new exhibition space (to be named) and a new public courtyard. The new museum will also include an expanded collection adjacent to the existing museum and an additional building for distribution of the collection. “We are delighted to open with a new set of exhibition priorities and new programming, especially with the recent opening", "The next Biennial should take place in 2020. \n\nFilipino artist and educator Asisquio Nava is suing the New York City Department of Cultural Affairs (DCLA), claiming that its attempts to remove a work by the late American painter and activist María Berrío from its collection violated the Civil Rights Act of 1964. Nava’s application, which was filed in the United States District Court for the Southern District of New York on October 3, seeks to have the DCLA take the work and return it to him. The suit identifies several instances in which the DCLA failed to act on its information, but failed to take any action. In one instance, the suit claims, the DCLA was notified of an attempted removal of a work by artist Dennis Ayma but failed to take action, contradicting its previous statements that it acted on the information it received from the collector.“The City owes the Estate an accounting for its failure to act,” said Nava. “We are confident that, if, indeed, the City of New York objects and we prevail, the result will be a full and transparent accounting that will include an explanation as to why the work has been removed from the collection and will", "The next Biennial should be held in 2021.\n\n\nThe Museum of Contemporary Art (MoMA) in New York has promoted Florence, Italy’s Stefano Bocconi, to director of the Italian Contemporary Art Museum (MAM), which he has led since 2016. He succeeds Roberto Cicutto, who retired in 2018 amid the coronavirus pandemic.Bocconi replaces Daniela Cennatta, who became director of MAM in 2014, and will take up the post on January 20. He succeeds Peter Wehner, who was interim director of the Metropolitan Museum of Art, and will take up the post on January 8.“Stefano is an accomplished curator who has created enriching and challenging exhibitions throughout his career,” said Peter Scharre, chair of the board of trustees and a cofounder of the investment firm BlackRock. “We’re thrilled to welcome Stefano to the MoMA team. We’re looking forward to working with Stefano and the museum as we continue to shape the future of contemporary art.”The Met established the Biennial for Modern Art (BMMA) in 2016 to foster and support the development of a new generation of artists. BMA’s inaugural", "The next Biennial should take place in the early 2020s, and the first exhibition should be up by the end of the decade. The challenge now is to find a way to organize, develop and present exhibitions that explore the work of contemporary artists in an accessible, engaging and participatory manner that is accessible to both specialists and non-specialists.”\n\n\nThe British artist Joseph Campbell has been designated the recipient of the £10,000 British Arts Award for his lifetime achievement in his practice of drawing, creating, painting, sculpture, photography, and sculpture. Campbell first met the British Council in 1987, when he was working on a project for the exhibition “Joseph Campbell: Life and Death” at the London Arts Centre, and was given a commission by the council to create a work for that exhibition. His work, A Matter of Life and Death, was selected for its “life-like, precise, precise images of human frailty and tragedy.”“With these images, and others he has created for the BAC,” British Council chairman Tony Mayhew said, “Joseph Campbell has created a legacy of moving us through the darkness, keeping us warm and safe in our homes, and pointing to the", "The next Biennial should take place on the island of Saipan in December 2020. \n\n\nThe Institute of Contemporary Art (ICA) in Beijing has appointed artist-activist Han Yang as the new director of its new headquarters in the capital. Yang, who is also the founder of the nonprofit Chinese Art Museum, has led the institute since 2013. \n\n\nThe 21st Venice Biennale has announced that a collaboration between the National Art Museum, Oulu, Finland, and the Museum of Contemporary Art, Istanbul, will be held at the Makkah Science Museum in Singapore in 2021. The theme of the exhibition will be “Sustainability.”The theme of the exhibition is a direct response to the Makkah Science Museum’s newly opened exhibition space, the Science Museum Contemporary Art. The exhibition is entitled “A Matter of Life and Death” and will run from February 19 to February 21.“The partnership between the National Art Museum, Oulu, Finland, and the Museum of Contemporary Art, Istanbul is a coming together of two cultures from different geographical and cultural backgrounds,” said Raimond Rind, executive director of the National Art Museum Finland. “The ministries of culture and science are", "The next Biennial should be held at the Centre Pompidou in Paris in 2022. \n\n\nThe Philadelphia Museum of Art (PMA) has received a gift of more than fifty rare works by American painter George Sargent, whose artistic vision and artistic process was central to the development of the avant-garde American painting.Known for his scale models of sculptural works and his use of paint and canvas to create the works of his colleagues, Sargent also pioneered the use of video in advertising, painting, and photography in the early 1950s. Over the course of four decades, PMA acquired more than two hundred works by the Georgia-born Sargent, who died on May 24. Using a variety of media, including photography and video, the artist has been linked to the works of Hetfield Gilbert, Jasper Johns, and Alfred Stieglitz. The gift includes nine works by Sargent, including a work by the Oregon-born artist Jess Grafton that was created in 1974, a portrait by the enigmatic American artist Carleton Watkins in 1977, and photographs of Adams, Tilton, and others.“George Sargent was one of the great American painters, and his work has been reproduced", "The next Biennial should be held in January 2021.\n\n\nThe New American Cinema, a project of the Los Angeles County Museum of Art, is planning to hold a second edition of its annual exhibition, New American Cinema: Live, at the Los Angeles County Museum of Art (LACMA) next March. The exhibition will focus on a selection of works by artists whose work has recently been exhibited at the museum, including James Turrell, Herbert Eger, and Jonathan Chaitkin. The project was first announced in Los Angeles Magazine.The 2019 edition, titled New American Cinema, was held at LACMA until March 21, 2020. The museum had originally planned to hold the event in February 2021, but its organizers decided to postpone the event until March 15, 2020, in order to give the institution more time to prepare for a possible March 15 reopening. In a statement, the institution said: “This is an extraordinary year to be alive. The present moment is full of possibility and possibility is full of danger.”\n\n\nA new report on the economic impact of Covid-19 has been released by the New York City Department of Cultural Affairs. Titled This Is Our Bank Holiday:", "The next Biennial should take place in 2020, and a future edition in 2021. \n\n\nThe Museum of Fine Arts (MFA) in Detroit has received a gift of 1,400 photographs by illustrator James West, a leading member of the MFA’s Fantasy and Suspense (F/S) group, from the artist. The group, which consisted of four artists—James West, David Salle, and Alan Robert Clark—created works that promised to explore the boundaries of reality and the possibility of art and were published in both print and electronic forms.“In the months leading up to its cancellation, F/S’s members collected approximately 1,400 photographs by James West, who was active in several other genres such as painting, drawing, and sculpture,” said Michael Lambert, the museum’s director. “These photographs were donated to the museum by James West after he died in 1996. They are among the most valuable collections in the museum’s collection.”The gift was made in the form of a brief, two-volume set, “The West Picture Gallery,” that was purchased by the MFA in 2017 for $50,000 from artist and collector Richard and", "The next Biennial should take place in 2021. In the meantime, the show will resume in 2019.\n\n\nThe fifth edition of the Fifth Biennial of Berlin’s Kunsthal Charlottenborg Berlin will run from March 22 to March 26. Curated by Øl Görünge Tödahl—who has previously curated the exhibition’s thirteen previous editions—the event will feature works by forty-eight artists of German, Austrian, Russian, and Swedish origin.The biennial’s inaugural edition was held in March 2019. Designed by the contemporary artist and designer Heiko Hesse, the exhibition was organized as part of the Center for Contemporary Art in Berlin and was curated by Laura G. Guadagnoli, the artistic director of the Biennial. The event ran from March 21 to March 28.Guadagnoli described the biennial as “a reflection of the contemporary Berlin: a city that is increasingly engaged in a process of renewal, a city that is grappling with its place, a city that is challenging itself in every possible way, a city that is at the heart of the city of art.” He added: “I think that this exhibition is a critical moment for doing this kind", "The next Biennial should also coincide with the upcoming sixty-second edition of the Shanghai Biennale, which is currently being staged in January and February and will run concurrently with the upcoming twenty-ninth edition of the Biennale. The official invitation reads: “The special exhibition ‘Art and Politics’ at the Museum of Modern Art will be a synthesis of art and politics. It will open with ‘Lügenpresse’” (L.A. Art and Propaganda) and culminate with “Anatomy of an Empire,” a new exhibition on the history of art. The show will be organized by Margaret Boone and Robert Rauschenberg with an opening reception at the Museum of Contemporary Art San Francisco on Friday, March 9.“The last twenty years have been a great adventure, and it is an honor to have been invited to take part in this program,” said Arthur DeGirolamo, the director of the Museum of Art and Architecture. “The best way to conclude the story of art and politics is to move on, but the hopes of the designers and artists who are participating remain strong.”\n\n\nThe biennial of a Mexican artist whose work", "The next Biennial should be held in 2019. “The Future is Our Future,” is one of the songs by the Italian artist Piero Manzoni that will be performed by curator Sara Amor and Sophie Kruger. The exhibition will also include new works by artists such as Odili Camacho, Eva Cady, and Carlos Figueroa and will feature new works by contemporary artists such as Ana Mendieta, Jorginho Pereira, and Ruth Reichardt.The Biennial will also mark the official opening of the first National Museum of African Art (MoA) in the United States, which will be inaugurated by curator Tracy Gilbert and will be located in the National Museum of African Art in Washington, DC. The museum will be inaugurated by a speech by Elizabeth Cady, a pioneer African American sculptor, who will unveil a new work by her that represents African American art. The museum will also present three new works by major African American artists, including Isaac Alia, James A. Porter, and William Butler, as well as new works by early American sculptors like Robert Owens, Robert Morris, and George A. Lucas.The museum will also include three new commissions by Laure", "The next Biennial should be held in 2021.\n\n\n\n\n\n\nThe Annenberg Foundation for the Arts (AFTA) in Los Angeles announced today that it is creating a new $3.8 million endowment for the preservation and future care of the artifacts in its collection. The $3.8 million will fund preservation and future education initiatives as well as partnerships with universities and state and local governments.“The Annenberg Foundation is committed to supporting all those who have made significant contributions to American art and to ensuring that the collection and exhibitions of the Annenberg Collection are enhanced and maintained through the future,” said John Baldessari, president of the foundation. “The gift of these objects and the gift of their collections, artifacts, exhibitions, and programs is an amazing opportunity for the Foundation to become a meaningful and enduring voice for the art of the Americas. Our work will be carried out in harmony with the collective vision of the entire community, and in recognition of the contributions of our predecessors and many of those who have passed in their years of accomplishment.”The new partnership with AFTA will focus on preservation and future education initiatives that are centered around the work of Women Artists and will be led by AFTA artistic director Rebecca Wilk. The", "The next Biennial should be selected in October 2020.\n\n\nThe Hirshhorn Museum in Washington, DC, has appointed Katherine Lewis as its next director. Lewis comes to the institution from the New Museum, where she has served as interim director since April 2019. During her tenure at the New Museum, she transformed the museum into a more than 130-year-old arts complex, expanded college admissions, introduced studio classes, and expanded the collection.“Throughout her tenacious work to shape the Hirshhorn into what it is today, Katherine has been an inspired leader and a joy to work alongside,” said New Museum director Christopher Bedford. “Her conviction to see the Hirshhorn Museum thrive and thrive and flourish, her passion and her ability to motivate and motivate her staff, and her ability to create and deliver exciting exhibitions and programs in an engaging and challenging environment, combined with her ability to collaborate with renowned curators, writers, and scholars, has always been at the core of what makes the Hirshhorn Museum great.”Lewis will assume her new responsibilities on June 6.\n\n\nThe Los Angeles County Museum of Art (LACMA) has received a gift of twenty-four works by American painter John Edmonds, whom American and", "The next Biennial should be held in 2022, once the reopening of the exhibition is completed.\n\n\nOn November 18, the Museo de Arte Contemporáneo (MAS) in Lisbon announced that it will prepare for the return of the Portuguese master, José Pires, whose work was heavily influenced by his homeland, but was later in the country exiled for his political views. The exhibition, “Pires’ Legacy,” will highlight the work of thirty-one of Pires’s works in the city of Lisbon, along with the history of his studio.The twenty-fifth edition of the exhibition, “Pires: From Moment to Moment” will be held at the Museo Nacional Nacional in Lisbon from January 20 to February 24, 2024. The exhibition will also feature works by contemporary artists, including inventors, creators, and activists. The inaugural exhibition is curated by artist-in-residence Anna-Kaisa Rocha, and is led by curator Joana Pape, who will serve as the curator of the exhibition.\n\n\nIndonesian artist and activist Janette Sadanjo, who was imprisoned for six months in a 2015 incident that involved a group of", "The next Biennial should feature twenty-eight works by forty-eight artists, including Andre Sekou, Pertti Nilsen, Alexis George, Adrienne Edwards, Nari Ward, and Thomas James McNew.Atlanta’s Biennial of the Arts will also host an exhibition of works by seventy-two artists, including the Dawson-Hughes family, the Sashimi-Oma families, and the Strahlers. It will be open to the public from February 23 through February 27. The Jackson–Newman Center for Performing Arts will hold a series of performances and lectures by forty-four artists, including the Dial Mural Collective, Kaori Miyawaki, Kathleen O. Cameron, and the Central Arkansas Artists’ Association. The New Museum will present a show of work by eighty-four artists in early March. The mandatory two-day open-air public viewing of the exhibition will be on March 23. The two-day retrospective, “Between Heaven and Hell,” will inaugurate the new Arts of the City of Atlanta, a new urban incubator that will support the curating and development of local, regional, and national artists. The center will be located at the intersection of 10th and"]