["The next Biennial should be held in 2022.  This article was first published on Artforum’s Feb. 17, 2018 issue.\n\n\nEttore Landwehr, who died in 1930, was one of the twentieth century’s most influential painters, a publisher of works such as Landwehr’s The Grapes of Wrath (Tegreto, 1989), which focuses on the destruction of the cultural heritage of Peru. The artist was also a master of the large-scale, aided-painting, and a painter of different landscapes.Landwehr was born in Cologne in 1928. After moving to Cologne to study painting at the Academia di Cinéma, he eventually settled in the city with his family. His father died when he was five, and he often painted, and moved around the world, drawing attention to the manufacturing, distribution, and consumption of art. In 1981, Landwehr moved to Rome, where he began his long-term project of creating a unified work for the museum. His legacy lives on in the museum’s collection. Since the 1990s, the museum has had numerous exhibitions devoted to his work, including the first intermissions in 1998 and", "The next Biennial should be held in 2020, following the completion of the first show, “Museum of Contemporary Art, Los Angeles: ‘Death by Design’” (2019), which will also include a performance, a book, and a juried exhibition. The biennial will then move to the Los Angeles County Museum of Art (LACMA), which recently opened its original location in the city, and will return to New York, where it will have its twentieth edition. “With its Goldsmiths, Oxford, Tate, and the School of the Art Institute of London, London, the Museum of Contemporary Art London, London, is a great museum,” said Simon Hooper, director of the institution. “The exhibition ‘Death by Design’” will present an exciting contemporary interpretation of the idea of death and the meaning of life, and will explore the idea of evolution, the influence of art on our lives, and the possibility of art in our lives.”Museum director Nicholas Cullinan said: “I am delighted that our show will be held in London and we will be able to return to the city in 2021 to commemorate the twenty-fifth anniversary of the opening of", "The next Biennial should be held in the Spring of 2021. Artist Statement: Currently, at the age of seventy-eight, I am still working on my first exhibition as a curator. The exhibition will be centered on the concept of the Existence/Absurd or the Life of the Artist as it relates to the Museum.”The 2019 winner of the prize, Herman C. Hayek, was a former director of the California Academy of Sciences; a cofounder of the Institute for Advanced Study in the History of Art in the United States; and a former president of the American Association of University Professors (A.A.U.P.). His work was included in NIRIN, “Aesthetics and Film: A History of Film,” the first major retrospective devoted to Hayek’s films.The 2020 winner, Gillian Edenshaw, director of the James D. Hutton Foundation, said: “This is an incredible honor to be selected as a winner of the International Association of Cultural Historians’ award for best new work by a contemporary artist. I would like to thank Steven and Sue for their kind words and encouragement throughout the years. They have done a wonderful job of bringing this outstanding", "The next Biennial should be held in 2020.\n\n\nThe Art Newspaper has revealed that the next edition of Art Paris will include a selection of works by Hannah Beecham, Julie Ault, and Alice Harmer, and will be held at the Museo de Arte Contemporáneo Cinéma in Barcelona. The exhibition will also feature the work of Sarah Mackie, a collaboration with Sarah Peiffer, whose 2013 exhibition “Requiem for a Dream,” at the National Arts Center in New York, will be on view.“The project of Art Paris 2020 is to create a medium of exchange between art and the digital environment in an effort to transform the ways in which art is seen and remembered and to celebrate art in the digital age,” said Beecham. The exhibition will also include a retrospective of the work of Harmer and Ault, which will open in September 2020. The next edition of Art Paris will be held in the July/August timeframe.\n\n\nThe University of Exeter in England announced today that Zina Akram, a former partner at the university, will become associate director of the Centre for Contemporary Art at the University of Exeter", "The next Biennial should be held in the spring of 2021, and the next in the autumn of 2022, and the next in the spring of 2023, and the next in the autumn of 2024, and so on, until we reach the halfway mark, and so on, until the end of our lives. The choice of the term 'final future' reflects the fact that we are now entering the sixth \"final stage\", in the term of our lives. During the preceding six years we have drifted from one phase to another, from one reality to another, from one purpose to another, and from one timeline to the next.  The theme of the 2020 edition is “the final stage,” and the theme of the 2021 edition is “the final year.”“I’ve been thinking about the theme of the 2019 edition for some time,” said Mark (Markus) Tenenbaum, art critic and editorial director of the Art Newspaper. “It’s a timeless question: What is the ultimate expression of the beauty and wonder of life, and of the world. We’re now entering a new phase of our lives, in which we are no longer merely living and breathing life", "The next Biennial should acknowledge the contributions of Latifah Aftouhi, Enas, Kianmehr Aga, and Elana Atkins. It should also focus on the history of the exhibition and the exhibition as a whole, and should consider the exhibition as a whole made up of works of art and objects that are in the public collection.Ibrahim Hooper, the director of the National Gallery of Scotland and Edinburgh, said: “With many thanks to the National Galleries of Scotland and the National Portrait Gallery for their gracious support of this year’s Biennial. It is an exciting time for the National Gallery of Scotland and Edinburgh and I am proud to see the work of talented artists and am looking forward to the opening of the new year with great enthusiasm.”\n\n\nItaly has announced that it is reopening to the public in a few weeks time. The government-backed reopening is being organized to reduce the number of traffic accidents and the number of deaths caused by air pollution caused by the coronavirus. The rule change, which was introduced in June, has been praised by environmentalists as a significant step toward fighting the virus and has been endorsed by the European Court of Human Rights, which declared it to be", "The next Biennial should be held in December 2020.  The zoo will also begin construction of a new 45,000-square-foot center to house the remaining works by the Museum of Tolerance (Museum of Contemporary Art) in New York, which opened in March, and is working on a new master plan to redevelop the former H. G. Wells Building in central Miami Beach. The work, which is slated to open in 2021, was commissioned by MFA Miami Beach and will be comprised of five buildings, each with a public entrance on the grounds of the MFA. \n\nGoogle and the Museum of Fine Arts (MFA) in Boston have launched a new initiative to support museums in their fight against Covid-19. Beginning on January 1, 2021, Google’s Project Safe Transfer will transfer $1.2 billion in cash to any MFA institution to avoid the pandemic. The nonprofit corporation will donate 20 percent of its annual operating budget to support the fight against Covid-19, and the remaining 90 percent will be returned to the institutions.“We’re not going to give up,” said Andrew Schoelkopf, the executive director of the Association of Art Museum Directors, a", "The next Biennial should be held in London in 2021 and will be hosted by the Museums Association (MA), which represents over forty museums. The theme will feature contemporary art in a specialised and interdisciplinary way and will also incorporate research.The first round of the 2019 edition, titled “Go/n Out,” was held at the Stedelijk Museum in Amsterdam earlier this month and ran from November 10 to November 12. The exhibition featured works by forty-eight artists, including Tim Marlow, Marina Abramović, Cheim & Read, and Pawel Wojtas, and will also feature a selection of works by Japanese artist, Miki Kawamura.The 2020 edition, titled “Art and the Body,” will be staged in London in 2022 and will consist of seventy-three works, selected by the artist Sushil and curated by MA curator Atef Javed, and will be staged on September 12–September 21, 2020. The exhibition will also feature the artist’s first solo exhibition in the UK since 1972.The biennial will run through March 25, 2021 and the theme will be “The Body.” The exhibition will be focused on the artist’s own", "The next Biennial should take place in 2021, and the exhibition should include works that were shown in a previous edition, called the 50th Anniversary, in 2020.\n\n\nThe Museo de Arte Contemporáneo, in Mexico City, has released a statement regarding the recent commit of almost five thousand artworks and art collections to the construction of the new museum complex in the city, which is currently being constructed by the small architect Juan Sánchez de la Cruz. The announcement follows a months-long campaign led by the architect, filmmaker, and writer Marcos Lyn Andujar, who was awarded the Emperor Costa’s Prize for Architecture last year, and was commissioned to build the museum in partnership with São Paulo State University.The project, which is part of a larger renovation of the capital’s Museo de Arte Contemporáneo (MASC)\u0097which is being spearheaded by architect Fernando Barilleiro and landscape and architectural designer Renata Ferreira, and managed by the São Paulo-based firm Mespolisan, has been largely financed by the São Paulo State University in conjunction with the city’s Ministry of Culture. The Ministry of Culture expects to raise", "The next Biennial should take place in 2020. \n\n\nFrieze, the New York–based arts organization, has released its 2020 edition schedule. Titled The Real Deal, the event will feature more than 100 works by artists including Nina Berlind, John George, James Low, David Salle, and Rineke Dijkstra, and will open in New York City.The full list of participating artists is as follows:Kamala Ibrahim, The Life and Death of Art, MoroccoBenedict Brennan, The Black, Dusseldorf, GermanySara Blesener, The Embedded, New York, NYC, USAMichael Blum, A Life and Death of Art: Avant-Garde Paintings in the New York Studio, New York, NYC, USAMichael Blum, The Embedded: Painting in the New York Studio, New York, NYC, USADavid Chiu, The Life and Death of Art, MexicoCity, MexicoBenedict C. Brown, The Life and Death of Art, Minneapolis, MN, USAMichael Blum, The Embedded, New York, NYC, USAJohn C. Hockney, The Life and Death of Art: Avant-Garde", "The next Biennial should be held in 2021 or 2022 and should be ambitious in scope and developed by an internationally renowned institution. It should be animated by the theme of the cycle and design, in line with the theme of the entire cycle. A total of sixty artists will participate in the Biennial. Herbert Gertch, the current director of the Museum of Modern Art, said: “I can’t think of any other institution in the world that has been and remains committed to making the greatest possible contribution to our shared cultural heritage, and to fostering new thinking about how art can be a catalyst for social change and a force for social progress.”\n\n\nThe Los Angeles County Museum of Art (LACMA) has released new guidelines for exhibiting works by contemporary artists in the United States, Canada, and Mexico. The guidelines, which were developed by the Los Angeles–based firm Culture Works, aim to address a number of issues, including the accessibility of collections, the preservation of works in storage, and the exhibition of artworks in public spaces.“The guidelines address a number of issues, including the accessibility of artworks, the preservation of artworks, the exhibition of artworks, and the exhibition of artworks,", "The next Biennial should be held in 2020.Girard, who is currently based in Milan and Paris, said: “I am thrilled to be here in New York City. I am eager to see how the city will respond to the exhibition and to engage with its international and regional communities through the exhibition. The next edition of the Biennale will be a celebration of the past and of the art of the twenty-first century.”The invitation to the Biennale was issued by the city and the state of New York, which has hosted the exhibition since 1982. The show, which includes work by forty-eight artists, now features work by fifty-three and will run until November 17.\n\n\nThe Winnipeg Institute for Contemporary Art (WCI) has been awarded a $35,000 grant from the City of Winnipeg. The award comes from a $155 million city-backed redevelopment plan that was passed by city council last year and is part of the city’s $318 million $1.2 trillion overhaul of the city’s infrastructure.The city’s 2017–18 fiscal year ended in September, and the WCI’s current construction phase is nearing completion. The new $155 million central government-", "The next Biennial should take place in 2021.\n\nCommenting on the announcement, Tanya Rossiter, director of the Art Institute of Chicago, said: “We are thrilled that Diyarbakır will continue to present the best exhibitions of modern art in Turkey and Europe, in addition to supporting the very best contemporary artists. We are grateful to our partners and friends in Turkey and Europe for their continued support of Diyarbakır. We are also grateful to the Turkish government, the Diyarbakır Cultural Center and the entire Turkish diaspora for their constant guidance and guidance throughout the completion of this project.”\n\n\nThanks to the generosity of a group of collectors, including Michael Kohn and Mary Anne Kohn, who collectively purchased the work of German photographer Markus Lüpertz, the Museum of Modern Art (MoMA) in New York has gifted the artist and his wife a comprehensive collection of more than thirty works, which includes works on paper, prints, photography, video, sculpture, and installations. The gift includes two paintings by Lüpertz that were on display in the exhibition “Paint It Black” (2019), along with works by Kohn, Kohn & Partners", "The next Biennial should be held in the first half of the year, in order to coincide with the biennial. Logistics and funding for the inaugural event were complicated by the recent coronavirus outbreak, which has led to a temporary closure of the whole of China. According to the China Daily, a report released by the Beijing-based State Administration of Cultural Heritage and Artifacts notes that the inaugural exhibition will be a “envisioning the future as one world.” The report also noted that the exhibition will include new works by thirty-four artists and that the event will run for eight weeks. The inaugural exhibition is among a number of exhibitions and events being organized by the Chinese city of Beijing under the banner of the city’s Cultural and Art Districts Alliance (CaaTa), which has been run by the city for nearly seven years. The CaaTa’s current focus is to launch a new cultural development zone in Beijing, called the Shangri-La Bazaar, which will feature new works by the artists who have chosen to remain anonymous for their safety.A spokesperson for CaaTa told the Art Newspaper that the upcoming event will be “encompassing all the CaaTa’s", "The next Biennial should be held in 2020. \n\n\nArt Basel Hong Kong is now accepting applications for its 2020 edition, which will take place in the exhibition space the Hong Kong Art Museum (Hamong Art Museum) in Kowloon in November and is open to the public from January 23 through February 22.The event has been canceled since March due to the ongoing pro-democracy protests in mainland China, which began in June and have since spread to the mainland and beyond. \n\n\nGhent, Belgium, has appointed Pia Camil as its next director of arts and culture. She succeeds Anneke Van Rensselaer, who retired in March 2019 after eleven years at the helm of the Flemish city of Ghent. Camil comes to the Belgian city from Amsterdam, where she previously served as director of the Amsterdam Art Museum (A.B.M.), and will assume the helm from director Joost W. de Bruijn. “We are delighted with her appointment since she is passionate about Ghent and its extraordinary contemporary art,” said director Marnode Waard. “Pia is an outstanding candidate for the position of director and an excellent choice for the role since she embodies the values and", "The next Biennial should take place in the city in 2020. “With great pleasure, we present the final edition of the Biennial of Modern Art,” said Antony de Simon.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has launched a new digital initiative that will allow visitors to view the show “From the Earth to the Moon” (September 29–October 20) on its website. The initiative, which was launched in cooperation with MOCAD, will debut with a free preview on September 24. MOCAD is a nonprofit arts incubator and accelerator in Los Angeles run by staff and artists, which aims to provide support, mentorship, and access to international artists and designers. The MOCAD artists’ debut exhibition is the first of a new series of exhibitions that will be curated by the curators themselves.“Exhibitions are an important way for artists to connect with audiences in meaningful ways, and to present their work in ways that are open to the public,” said Mark Satter, the director of MOCAD. “From the Earth to the Moon is an extension of our mission to organize and present the work of contemporary artists. We hope that this new", "The next Biennial should be held in 2021. Kozlowski said: “As we near the end of our biennial, we recognize that we still have a significant way to go to meet the needs of our visitors. The next edition will reflect the themes and the artists that we have chosen since its inception. We will continue to listen to our audience and consider their suggestions, and we will continue to explore ways to make the biennial a true reflection of the city of Chicago’s rich history.”The next edition of the biennial will take place in 2021 and will be curated by Kent Jones, the director of the Art Institute of Chicago. Inaugurating the helm of the institute will be the release of “Artist Biennials: The Contemporary Present” and “Why Artists Matter” (2019); the opening of biennials “Arts of Life” and “Art of the Party” (2017); and the organization and installation of the biennial’s first exhibition, “Wangechi Mutu: A Fantastic Journey” (2017).\n\n\nThe Metropolitan Museum of Art in New York has received a gift of twenty-three works by artist Diana Nasso", "The next Biennial should be held in December 2020.\n\n\nThe Pilgrimage Fund, a UK-based charity that provides aid to overseas visitors to London in the form of arts and cultural activities, has rescheduled the 2020 event. Its announcement follows the tragic loss of life in the city following a terror attack that was carried out by three men on May 22, 2017. The three men were eventually killed by the police, but the impact of the attack and the ongoing police investigation has yet to determine a motive for the attack or what motivated them. Organizers of the event, who chose to cancel the event in order to concentrate on the recovery of cultural artifacts from the terrorist attack on May 22, are attempting to come to terms with the loss of a major cultural asset. Organizers cited the ongoing police investigation as the reason for the postponement. The 2020 event, which was due to take place in February 2021, was to have kicked off at the former Tate Britain site in Mayfair and kicked off at the Lambeth Palace Theatre in east London on January 28, 2021. Organizers decided to postpone the event, reported to be a major draw for visitors to London, after they heard from more than one hundred people who supported the move", "The next Biennial should focus on the long-term prospects for the art, in order to assess how we can best incorporate art and technology in the public sphere in order to develop a new kind of knowledge and understanding of the world. Furthermore, we hope that the future exhibition will stimulate new interdisciplinary projects and international exchanges of ideas, thus contributing to the movement of art and artmaking from Asia to Europe and the Americas. The Chairman of the board of the trustees of the Biennale, Anders Østby, said: “The panel of artists nominated by the trustees represents a diverse range of artistic practices and is composed of some of the most talented young and established artists in the world. The upcoming exhibition will take the theme of the future, which is central to them, and explore how art and technology can help to shape the future.”\n\n\nThe Toledo Museum of Art in Ohio has received a gift of more than six hundred works by contemporary artists who are currently on view in a major renovation project slated to begin in 2021. The restoration, which will add more than eight thousand new works to its collection, will also add new exhibitions and public spaces, create more pedestrian and transit-oriented galleries, and enhance the museum’s existing", "The next Biennial should take place in the spring. “Facebook, Apple, and the Ubuntu core is about to change everything in the way we think about and look at technology,” said Matt Mullen, director of the Center for Creative Innovation at the University of Washington. Mullen added that the new exhibition, “Self-Portrait: A Biennial of Humanistic Art.”The first exhibition was curated by Ugo Rondinone, a curator at the University of California, Los Angeles, and will be held at the Los Angeles County Museum of Art (LACMA), beginning February 16, 2020. The exhibition will feature work by fifty artists, including Alex Katz, Alighiero Cipolletta, Klaus Popp, Yinka Shonibare, Paul Snedman, Martin-Jan Schäfer, and Vito Acconci.\n\n\nThe Metropolitan Museum of Art has appointed Kate Fowle as its next director and CEO. Fowle comes to the Met from the Walker Art Center, where she has served as director of programming since August 2019. She succeeds Marc Glimcher, who retired in January 2019 after twenty-five years at the helm of the museum.Glim", "The next Biennial should aim to show how the art of the time achieved its post-war success. “In the early 1950s, a group of American artists, led by William Efstathiou, published a retrospective of works by Erich Andrianomearis, the Italian sculptor who was one of the first to use cellulose in his art; a retrospective of the work of Anton Kern; and a presentation of the work of Jean-Luc Godard.A biennial of contemporary art is not a single event but an assemblage of works presented together in a series, with the proper institutional framework, to meet the needs of the times. The next edition should use the sixteenth International Festival of Contemporary Art (IFAC) as a basis for a new way of thinking about the exhibition of contemporary art. The IFA’s founding principles have been substantially amended. “In the past, a biennial was a collection of works staged in a single location,” said biennial director and chair of the biennial committee, Christine Fontana. “Now, it is an exhibition that engages with and reframes the meaning of the art, and its history, in order to create a new kind", "The next Biennial should be held in the spring of 2020. “We are always striving to create new and more meaningful ways to endow the museum,” said Roberta Smith, chair of the board of trustees. “The future of the Biennale is inextricably linked to the health of London’s arts and cultural sector. It is an affront to the city that this important exhibition is being held in the capital, and a threat to the future of the Biennale. We are grateful for the support of the City, and our colleagues, to work with the Mayor and the rest of the London community in supporting the museum as it continues to thrive.”Smith added that “the Biennale is a city-owned undertaking, and we are keen to support its vital work in making the city a better and more vibrant place for visitors and residents. We hope that this will be the occasion for a new wave of philanthropic spirit and renewed interest in the Biennale from the public, museums and visitors.”\n\n\nThe Museum of Modern Art (MoMA) in New York has decided to extend its sponsorship deal with the pharmaceutical giant GlaxoSmithKline (GSK). The", "The next Biennial should take the form of a symposium, which will focus on the issues of transformation and the relationship between art and the contemporary world. Its first edition, “Art and the Advantages of the Modern World,” was scheduled for March 2020. The next one, “The Material Culture of Art and Metaphysics,” will likely be held in March 2021.The 2019 Biennale held at the LACMA Museum of Art in Los Angeles, California, was a retrospective of the work of Jean-Michel Basquiat. The museum also presented an exhibition of the artist’s work at the New Museum in New York in 2003. The exhibition, “Basquiat: The Art of Painting,” was curated by David Jasper.The 2019 edition of the Venice Biennale is titled “Vincent van Gogh in Conversation,” and will run from March 21 to March 25. The exhibition will feature artworks by more than sixty artists, including Jullianne El Samerraei (June 7), Léa Seydoux (June 8), Mark Leckey (June 9), and John Ward (June 10).The full list of participating artists is as follows", "The next Biennial should be held at the Museum of Modern Art in New York, which will host the exhibition “Theater of Operations: The Gulf Wars” in 2022; and the British Museum, which will host the exhibition “Sustainability” in 2021. The Venice Architecture Biennale is currently on view through February 24.\n\n\nThe two-year-old nonprofit organization the Philadelphia Museum of Art (PMA) and the National Gallery in London announced that they have come to an agreement over the future of the aging Wolfsonian in a press release. The agreement will allow PAMo to build a new, state-of-the-art exhibition space in the museum and allows the National Gallery to continue to sell works by artists whose works are on display in the museum.“The Wolfsonian is a marvelous institution and I’m looking forward to building on its rich history and the outstanding exhibitions that have made it such a success over the years,” said Audrey Nesper, director of PAMo. “Of course, we’re all still working on the details of how this will work for everyone, but we’re confident that this will work out.”The agreement between PAMo and the", "The next Biennial should be held in 2020, and the year 2021 is also considered a milestone year for the art world. The biennial was established in 1980 to mark the centenary of the founding of the Swiss Federal Institute for Contemporary Art (Zentralarchiv für und internationale bis zur Kunst- und Inhalte). It was developed by the then-influential Swiss architect and designer Kjetil Hall and became the foundation of the institution that would later become the Dorothea and Otto Braakischer Kunstverein Altenburg (DGA), where Kjetil Hall would eventually eventually serve as director from 1998 to 2002.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines for how museums in the city should respond to the coronavirus pandemic. The guidelines, which were drafted by the organization’s director, Anne Delahanty, and were first reported by the New York Times, were issued on December 16.“We encourage all local, state, and federal government officials, cultural leaders, and cultural organizations to stay connected to their communities and remain vigilant for possible public health threats,” Delahanty said in a statement. “Museums must", "The next Biennial should take place in the autumn of 2021, and its fourth edition will be staged in the spring of 2022.The exhibition, titled “Manifestations of Man” (CNRS), will highlight works by contemporary artists and will be curated by João de Castro, the president of Brazil; Lévy Gorvy; and Pilar Pinotti, the director of the Fondazione Biennale, in the city of Recife. For the first time, the show will be hosted by the city of Recife. The upcoming edition will be divided into three parts: “Analogues of the Imagination” (A2), “Analogues of the Past” (A3), and “Analogues of the Future” (A4). The works, which are currently on display at the Theological Seminary in Lisbon, and will be brought to life by the National Museum in Brasilia in the fall of 2020.“In the last two years, the Fondazione Biennale made a major contribution to the preservation and restoration of historical masterspieces,” said de Castro. “The collection of the Fondazione Biennale is a special one", "The next Biennial should be held in the spring of 2021.  Architectural Record  has a statement on the new exhibition: “The new exhibition will feature some of the most exciting new work in its history, featuring a collection of work by seventy artists in thirty-six countries. The following year, will bring together its forty-fifth and fifty-eighth years.”\n\n\nThe Universidad de los Andes, in Bogotá, Colombia, has released the inaugural artists in residence list for the 2019 edition of the Art Basel (Art Dubai)\u0097the group of twenty-seven international artists who will participate in the mega event in Dubai. The list, which is based on criteria such as the artist’s physical presence and the institution’s relationships to the artist’s projects, was released Friday, June 22. The artists are:Alfredo Gomes, Ecuador, Detana Alves, Mexico, and Sunjung Park, South Korea; Anelys Tomas, Mexico, and Tomás Soleras, Honduras; and Jorrita Latif, Nigeria. The full list is as follows:Alfredo Gomes, EcuadorLos Angeles,", "The next Biennial should be held at the Institute of Contemporary Arts, London, in the fall of 2020. The museum has yet to make a decision about how it will respond to the coronavirus, which is spread mainly from person to person through close contact. While the coronavirus is not spread naturally, according to the World Health Organization, the virus can be transmitted by direct contact with the virus-containing aerosols from industrial processes and medical devices. The coronavirus virus is spread mainly from person to person by close personal contact and is transmitted by coughing, sneezing, and drinking liquids from a respiratory tract infected with the virus. People who are sick should avoid being alone with others who are sick and should wash their hands frequently and after-hand. Toothbrushes, razors, and other commercial cleaners may cause illness. The virus can also be spread by direct contact with droplets of the coronavirus, which are more infectious than the virus itself. The coronavirus can also be spread by respiratory droplets and can be spread by sharing a room with an infected person.The coronavirus is spread mostly from person to person by direct human contact, but according to the World Health Organization, it can also be spread from", "The next Biennial should be held in 2021, although no specific dates have yet been set; the exhibition will include the work of fifty-six artists, including all the artists nominated by the public, and will be organized as a creative project with the participants collaborating online. The winner of the prize will be announced in October.\n\n\nIn a landmark ruling, the United Kingdom has established a national museum of the British Indian Art (BEA). Called the National Museum of Contemporary Art (NMA), the institution, which will be located in the heart of Birmingham, will house approximately eighty thousand artifacts spanning the British Indian and British Indian Commonwealth. The museum will be built in partnership with the City of Birmingham and will assemble the artifacts in one of two ways: in-house or remotely. In a statement, Mayor Jamila Naidu said: “NMA will be an ambitious, world-class museum, dedicated to the history and culture of the British Empire and of the British Indian Commonwealth in a way that maximises the city’s contribution to creating new ideas of what an Indian museum should be.” The museum will also be home to an exhibition space and a library and will serve as a place for students to learn about British Indian art and culture", "The next Biennial should take place in 2021. “I am pleased to see that this exciting project has received the support of such a distinguished and influential group of people, and to be able to take part in their vision for the future of art,” said Eileen Wang, chair of the museum’s board of trustees.The committee comprising Yukehiro Matsuda, director of the Sekigahara Museum in Kyoto; Takashi Iizuka, director of the Asahi Museum in Nagoya; and Harvey V. Skipper, chief curator of the Hirshhorn Museum, also appointed John S. Harnwell, former director of the Museum of Fine Arts in Boston; Daniel S. Murrow, director of the Whitney Museum of American Art; and Lawrie Sherman, former director of the Brooklyn Museum, as past chairs of the committee.\n\n\nThe National Geographic Society announced today that it has acquired Patagonia, the Italian fashion brand best known for its outdoor spaces such as its outdoor department, which has locations in Milan, Naples, and San Francisco, and has seven seasons in the United States, including the summer and fall. The Santa Monica–based company has been working since 2011 to introduce more sustainable fashion", "The next Biennial should be held at the same venue as the last one, in the same year. The core of the exhibition will be the artist’s likenesses, created with the same materials and the same process, and will focus on the exhibition of his work in the context of its own work. The artist’s legacy will also be reflected in the exhibition’s collection, which is composed of artworks that represent the major phases of his career. The first exhibition of work by the artist will be “Who Am I?”\n\nThe Museum of Modern Art (MoMA) in New York has appointed Shawn Howard, a curator and director of the exhibition space Art + Art, as its next director. Howard will take the helm from Nina Fong, who has served as director of the museum for the past three years. During her tenure, Howard helped shape the exhibition program and curated the first solo shows of work by artists such as El Dandy, P. J. Hauser & Wirth, and John Akomfrah, among others, and is credited with forming a public policy institute at the museum that serves as a platform for the institution’s artists.“Shawn brings a rich", "The next Biennial should be organized with the participation of all the participating artists, institutions, and galleries in order to give them the best possible opportunity to present their works.\n\n\nThe Public Art Foundation (PFA) in New York has awarded $1.2 million to ninety-seven artists, including forty-six who are not affiliated with museums, for their fiscal year 2020. The foundation is offering grants of $2,000 each to explore new approaches to exhibition-building, including the use of digital technologies to democratize exhibitions.“The PFA’s analysis of museum practice has been critical to the foundation’s decision to reorient towards a museum-based model for more than twenty-five years,” said PFA director Charles Robert. “We have made a concerted effort to position the PFA as an appropriate partner for today’s exhibition-making environment. It is our belief that any such new project, exhibitions, or exhibition-building will be the catalyst for a new era of exhibitions and exhibition-making.”The 2019 grant cycle was which included the award of $1 million to Whitney Museum of American Art, the Museum of Modern Art, the Metropolitan Museum of Art, and the Whitney Museum of American Art", "The next Biennial should launch in 2020 and will focus on themes such as the connections between art and the body, the relationship between art and culture, and the history of art. The exhibition will take the form of a “Monthly Exhibition,” named after the British artist and thinker H. G. Wells’s 1923 eponymous book.The first iteration of the biennial was held in the West End of London. The event was inspired by an informal gathering of artists and thinkers in the artist’s hometown of Walthamstow, which took place in 1975. The event drew over twenty thousand people and featured presentations by artists such as Werner Bisene, Raoul Vallee, and David Salle, among others. The show is currently on display in the Tate’s new exhibition “The Object in Art” (2019), curated by Claude and Lionel Rennie, which recently underwent a multimillion-dollar restoration.\n\n\nThe Los Angeles County Museum of Art (LACMA) has released a new digital cataloguing tool called the Catalog. It will allow visitors to more easily see and buy works by the Los Angeles–born American artist and designer Adrián Mendieta, whose paintings often grappled with", "The next Biennial should be in 2022. The venue for the 2026 edition is yet to be decided.\n\n\nThe Museum of Jewish Heritage (MoH) in Seoul announced today that it will invite the three surviving members of the Meiji-era Japanese order: Osamu Tezuka, Ryosuke Yamada, and Toshio Shiraishi, as well as their descendants, to the museum for an exhibition on the institution’s collections. The three descendants, who have been excluded from the museum since 1963, are currently suing the museum over the exclusion, and MoH has since asked the plaintiffs to withdraw their suits.“The museum is committed to ensuring that this right-wing group of revisionists is excluded from any future exhibition or other exhibition at the museum,” said MoH director Choi Ai-sung. “The museum has already provided exposure to the Meiji Restoration through the exhibition ‘Nausicaa: The Story of a Woman,’ in 2011. This will be a good opportunity for the descendants to see the museum’s collection as it has never been presented before.”The Meiji Restoration is one of the major themes of the upcoming show. The show will examine the implications of", "The next Biennial should focus on the history of the exhibition, which is slated to take place in the Arts and Design District—a former auto body plant that is now home to the Museum of Modern Art and the Brooklyn Museum—as well as a selection of contemporary art. “This is a very important moment for us,” Jorritsen said in a statement. “The Biennial is shedding light on and rethinking the boundaries of art and design, and we are excited to see what the public will create and how they will interpret the exhibition.”\n\n\nThe Bechdel Test, the feminist, artist-led feminist art criticism website founded in 2006, has announced its representation of feminist writer and activist Hayley Williams. The show will run from September 13 to September 20 at the Repertory Theater in Los Angeles. Williams is the founder of the independent feminist think tank the W.W.A.F. and is a prolific author and speaker. The theater’s first essayist-in-residence, Melissa Bernier, will serve as the show’s first featured guest artist.Based in New York, Williams is a cofounder of the feminist organization Purity Politics, has a well-", "The next Biennial should go ahead as scheduled, but the organizers argue that the shutdown will worsen the crisis. “The exhibition is damaged beyond repair, and the financial impact will be felt for years,” said organizer Thomas Roach. “It is not acceptable that the exhibition has suffered this long-term damage and has already lost fifty-six works.”The exhibition, titled “The Place of the Moon in the Head of a Woman” and curated by historian and theorist Angela Lee Stokes, will now be moved to a museum, to be completed in 2022. The exhibition was originally scheduled for March 2021 and for an opening in March 2022.\n\n\nTacita Dean, a curator and prolific author whose practice spans photography, performance, and performance-based art, has died at age eighty-eight from ovarian cancer. From the mid-’60s until her death, Dean was a prolific writer, cataloguing her own art and oeuvre with the medium of film. Her books include The Art of Photography: The Photographs I Use and You (1966) and The Camera: The Art of Photography (1971), both with David Salle. She also edited two books on film, The Screen Camera: The Manual (", "The next Biennial should be held in 2021.\n\nThe image of a sun-drenched desert floor has been a central theme of the Museum of Modern Art (MoMA) in New York since it opened in 1972. Designed by the Italian architect Filippo Becchetti, the structure—which occupies a third of a building on its southwest corner—represents a return to the ancient city of Cheops, where Benjamin was born. The desert setting has been repeated over and over by MoMA architects in their various incarnations: The Modernist and the Neo-Modernist; the Golden Age of American Art and the Golden Age of American Photography; and finally, the Modernist-Neo-Modernist-Botticelli-Bondage Factory.“In a future world, the desert will become a place of meaning and rebirth,” said John Graham, MoMA’s director of public engagement and curator of the exhibition “Carnaval: The Making of Modern Art” (2017). “Cheops is important not only for MoMA’s collection, but also for the history of American art and photography.” Graham organized the exhibition in collaboration with Julie and Simon Rich, who purchased the collection in", "The next Biennial should focus on “the radical possibility of aural ecology” and should take place on the first floor of the Museum of Modern Art (MoMA), in the former Stedelijk Museum, in Amsterdam. The next iteration of the event will take place in 2020.Just days after the events of the last two weeks in Paris, the French president, Emmanuel Macron, announced that the fifty-eighth edition of the thirty-eighth French International Biennale, which was slated to take place in the city of Limoges in the northwest of France, would be moved to Nanterre and would be rescheduled for 2021. The announcement followed an outcry from hundreds of thousands of protestors in Paris, the Saint-Tropez region, and Saint-Ouain, as well as from the organisers of the fair, Art Basel, who said the move would be a “great loss of life.”The move has also been criticized by some artists, who said the full day-long event will be lost and that a continuation of the fair would be “incompatible with France’s values.” “While the government of France has presented a positive vision of the future for art, it", "The next Biennial should be held in 2022.\n\n\nThe Washington, DC–based nonprofit the National Endowment for the Arts (NEA) is launching a new initiative designed to encourage more local, state, and national governments to alter their tax and spending policies to benefit artists.Under the initiative, which will launch in February and run for two years, the NEA will produce a biennial catalog of public artworks that will then be eligible for $1.2 billion in federal funding. The funds will then be redistributed by the countries where the art is located and by the artists themselves. The NEA estimates that the initiative will generate as much as 80 percent of the 75,000 works in the catalog. “When we think about what a beautiful world these works make, we realize that it is only a small fraction of the world that actually has access to these works,” said NEA CEO Ann Corrigan. “The work of these individuals and organizations is central to their communities, and it is their responsibility to make sure that they have the means to create new and beautiful works for their communities. The NEA presents these examples to the world, and we hope that this year’s Biennial of American Art will inspire", "The next Biennial should take place in 2020, at which point the Museum will be reconfigured as a contemporary art museum.“Dr. Z is increasingly concerned with the legacy of the artist-activists who have shaped the museum’s programming, and with how to create a new public space that reflects the cultural legacy of the city of Seattle,” said museum director Ingrid van der Sluijs. “The next Biennial will be the occasion of the artist’s 150th birthday, and will be an opportunity for Seattle to celebrate the legacy of the people who have shaped the institution for more than a century.”\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles announced today that it will extend its partnership with the Los Angeles–based nonprofit Skopix, a coalition of artists and arts organizations, to extend its programmatic work in support of artists and their needs. The initiative will support artists through the construction of new works and a new exhibition, “The Factory,” at the Art Institute of Chicago (LAC), beginning September 5. The work, which focuses on the intersections of traditional craft, consumer culture, and technology, will be organized as a “representation” of how", "The next Biennial should take place in the city in 2020. \n\nThe Italian architect Bode Miller has been awarded an MBE for services to architecture at the Royal Institute of British Architects (Riba), London, for his services to architecture, design, and construction. The award, which was presented by the Riba Foundation at a ceremony in London on April 4, 2020, is the fourth for Miller, who is known for his interdisciplinary practice. Miller, who has worked on projects ranging from the gargantuan American industrial site Herzog & de Meuron’s New York headquarters to the ancient volcanic ruins of Tunga, in the Aleutians, received the first award on February 16, 2020, for his services to architecture from the Riba Foundation in London, and the last one, for his services to architecture, on August 2, 2019.The Riba Foundation will also recognize the sculptors Erma Pindelli and Mario Mattiello for their services to sculpture, and the architect Barrie King for his contributions to architecture. King’s new book, The Architectural Advantage: The Art of Creating in Architecture, will be published by University of Chicago Press in October. In addition, the Riba Foundation will", "The next Biennial should be completed in 2021, and the inaugural edition will be held from January 4 to January 7, 2022. The exhibition will include the works of seventy artists, including Kapwani, Sekan, Zindagi, Sagi, and Jacinto, as well as a documentary and a book project.\n\n\nThe B-52 Museum in Roswell New Mexico has received a gift of two rare works by Anton Chekhov. The immensely valuable works, which were created near the end of his life, were donated by his grandson, Erick, who was visiting the museum with his parents and was visiting the B-52 Museum when the work of the Russian painter Tadao and the New Mexico native Conrad Chekhov was discovered.The gift of the works, which were acquired through a partnership between the Chekhov Museum and the Searing Museum in New Mexico, was made in honor of the late painter’s dedication to the museum. Chekhov, who was dead for eighty-two days and died in a New Mexico nursing home in 2016, gave the works to the museum in 1977. There they remain, with the Chekhov family, until the grandson brings them to the attention of the Chekhov", "The next Biennial should mark the opening of the Museum of Contemporary Art (MoCA), which is currently undergoing a $500 million renovation and is expected to open in 2021. The museum will also open in 2022 to the public for a preview period, and in 2024 to the public for a full-fledged exhibition.The twenty-third edition of Art Basel Hong Kong will be held in the Hong Kong Exhibition and Trade Center (HOK), which will host the event. The event will include the first ever international exhibition devoted entirely to Japanese art. The exhibition will also feature works by eighty artists, including Akira Ando, Kenji Ota, Tanya Lou, and Kazuko Miyamoto.Esther Griswold, director of the Center for Japanese Art at the University of Washington, said: “We are excited to unveil the next collection at Art Basel Hong Kong and welcome the Hong Kong art community to the center. We are proud to present works by seventy-nine artists from thirty-four countries to Hong Kong.”\n\n\nAn independent commission formed by British American artist Basil Fawcett in order to preserve the work of the late British director Steven Spielberg from the National Museum of Scotland has been halted by the institution. The commission,", "The next Biennial should be in 2021. The Arts Council will announce more details about its 2020 program at an event on November 9.\n\n\nThe British Museum in London has appointed Sasa Makai as its next chief executive and director. He succeeds Nicholas Cullin, who retired in August 2019 following six years at the institution. In his new role, Makai will lead the museum through a major refurbishment that will place the museum in the heart of the capital and include the first new galleries built in the institution’s fifty-year history. “The new galleries will advance the museum’s ambition of being part of the city as a cultural and cultural nexus,” said Museum Director Nicholas Cullin. “The new galleries will provide an exciting new location for the exhibition, education and research programmes of the museum, and will further support the Museum’s relationship with the local community.”Makai will take up the post on January 6, 2021. Makai succeeds Christopher Le Brun, who joined the museum in August 2018 and has served as chief executive of the museum since September 2019. During his tenure, Makai has overseen the development of its new galleries, which opened in August 2018 and", "The next Biennial should take place in 2020.\n\n\nThe National Museum of Fine Arts (NMFA) in Louisville, Kentucky, has appointed Pamela Scott as its new director. Scott succeeds Helen Söderstrom, who has been at the helm of the institution for fourteen years, and will begin her tenure in January 2021.“We are thrilled to welcome Pamela to the National Museum of Fine Arts,” said Emma Clark, the museum’s interim director and chief executive officer. “Pamela has been instrumental in our transformation from a museum focused on the art of the twentieth century into a museum that reflects the spirit of the twenty-first century and prepares for the future. She has developed a strong portfolio of work that explores the relationship between modern and contemporary art while expanding our understanding of the physical landscape.”Scott’s recent curatorial projects include The Space Between, a six-month exhibition at the museum that connected two twentieth-century works, The Illusionist’s windowpane installation in the museum’s Colby Mansion garden on the occasion of the museum’s centenary, and Whitechapel Gallery’s visiting exhibition “Work in Progress,” which opened", "The next Biennial should focus on the history and evolution of the new institution\u0097a revitalized Vittorio Cattelan and Giulia Battisti, respectively, and be held in the city of Rome. The 2020 event will be on September 12–September 14, 2020.\n\n\nThe Venice Architecture Biennale announced today that it is reopening to the public in March 2021. The exhibition will now be led by Enzo Cipolletta, who joined the biennial team in 2015 and currently serves as its artistic director. The opening will coincide with the opening of the biennial’s fifty-third edition, “Our World, Our Architecture,” which will also take place in March 2021. In October 2019, the exhibition was postponed and the biennial was put on hold for two years.“I’m very excited about the prospect of a reopening of our exhibition, Our World, Our Architecture,” said Enzo Cipolletta. “The exhibition will be free to the public, and will be staged at an ideal location to represent the city of Venice, the Venice Art Museum, and the city of Venice. The exhibition will be accompanied by a new project by Enzo", "The next Biennial should be held in 2020 and will include the first works by artists from Ghana, Ghana’s diaspora, and the United States. The first exhibition in the series, “Beyond the Body,” will open at the Museum of Modern Art in New York on September 23 and will be on view until November 24. The full list of participating artists is as follows:\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Anne-Marie Kemp, a curator and art historian who is currently assistant curator of modern and contemporary art at the Brooklyn Museum, as its next director and chief curator. Kemp will be responsible for leading the museum through its next major renovation, which will include the addition of more than 1,200 galleries and venues, and will assume her post on September 23.“We are thrilled to welcome Anne-Marie to the MFA,” said director Matthew Tubbs. “Her deep experience, passion, and intelligence will continue to inspire us as we present contemporary art in the MFA.” Kemp will be based at the museum in the fall of 2020.“Anne-Marie’s tenacity, insight, and clarity as a curator and scholar has made", "The next Biennial should be held in the spring of 2021. The deadline for submissions for the exhibition was June 16. The show will be curated by Soshiko Tsuruta and will take up contemporary art and contemporary architecture.\n\n\nThe National Gallery of Art in Washington, DC, has hired William H. Gass, who has served as director of the museum since 1993, as its next chief curator. Gass will assume his post in January 2020 and will begin his tenure in January 2021. He succeeds Carol Brown, who departed the institution in March 2019 to head the Smithsonian’s National Museum of African Art.“William has been an invaluable resource to the National Gallery of Art, working as a trusted advisor and advocate for artists and curators across the country,” said museum director Nicholas Rojas. “We are confident that he will continue to advance the National Gallery’s mission of advancing the art of America in a meaningful way under the National Gallery’s leadership.”In his new role, Gass will take up the post created during the museum’s founding by the late Harry S. Truman. Gass first joined the institution as a curator of modern and contemporary art in the early 1970s.", "The next Biennial should take place in 2021. \n\n\nThe Museum of Chinese in Photography (MCA) in Beijing has hired Rachel Passe-Holmes as its new curator of photography between 1920 and 1980. The museum had previously purchased the artist’s archives and built her own academic library of photographs, but the move has left the institution without a curator since March 2019.“Rachel’s work is a cornerstone of the MCA’s collection and curriculum, and will continue to shape the museum’s exhibition program and the collection as she works to expand her research and curatorial practice,” said director Yu. During her tenure at the museum, she will oversee the exhibition program and the development of a new book on the history of photography\u0097Gao Fang and the Story of Modern Photography’s Art Museum Edition,” which will be presented at the Museum of Art in 2021.Commenting on her appointment, Passe-Holmes said: “I’m thrilled to be here on behalf of the MCA and the museum, and to have the opportunity to empower the collection and the research of many brilliant and distinguished photographers of the twenty-first century.” She", "The next Biennial should be held at a location that has already been selected by the city of Los Angeles and is free to the public. In the past, the Arts Council has selected a city-selected site for a biennial by consulting with the majority of the council members, who are appointed by the mayor. The council will vote on the new location for a biennial by June 12. The biennial, titled Art and the City, will be hosted by the city of Los Angeles and will draw from the city’s permanent collection. The next iteration of the Art in the City exhibition will be held at the Downtown Los Angeles Cultural District, which opened in 2018 and has staged solo exhibitions of work by artists such as Richard Avedon, Lee Friedlander, and Robert Irwin. The 2018 show was split into two parts\u0097Part I, which explored Los Angeles’s art history; and Part II, which explored contemporary culture in Southern California. “We are thrilled to welcome the city of Los Angeles to the fold,” said city council member Mitch Englander. “This is a city that has demonstrated a remarkable ability to draw from, and retain, the art and cultural heritage of its", "The next Biennial should be on May 23, 2020. The last one was in 2015, and it was held in Osaka, Japan.\n\n\nUnited States Artists, Inc. (USA), a national nonprofit organization, has released the list of twenty-six artists who will participate in its 2019 edition in New York, having canceled its 2020 event due to concerns over Covid-19. The biennial will now take place in Los Angeles, which was the original choice for the theme park, but the move has caused some tension between the two cities. The 2019 edition, entitled Art in the City, was intended to celebrate the revitalization of New York City and its cultural institutions, but the event was canceled due to concerns over the coronavirus. “USA has always been committed to supporting the creative industries in every community it has ever represented,” said Ryan Lee, president of the board of directors. “We are grateful to the artists, sponsors, partners, and supporters of our 2019 event, and to those who participated in our 2018 and 2018/19 editions. We are confident that this year’s edition, which will feature work by twenty-six artists, will inspire and delight.”The 2019 edition, titled ", "The next Biennial should include a selection of works on display in the exhibition “MUSIC and MUSIC DEPARTMENT,” which has already been canceled. The exhibition will be relocated to the Saatchi Gallery in New York from January 29 to February 14, 2020.\n\n\nThe United States House of Representatives voted yesterday to establish a national museum dedicated to the performing arts, with a view to preserving America’s musical heritage for future generations. Introduced last year by New York representative John Katko, the $12 billion museum, which will sit on the National Mall, would be an extension of the Smithsonian’s Centennial Exposition, which will remain on view through 2024.“This is a moment of great change for America, and I’m proud to be a part of working toward a museum that better reflects the diversity of our nation,” said Katko. “This legislation ensures that our indigenous cultural heritage will be recognized and protected for future generations, while also preserving the National Mall as a vital platform for our nation’s cultural heritage.”Katko and his Democratic co-sponsor, New York representative Hank Johnson, introduced the bill last year to create the museum, which would draw from the", "The next Biennial should include an exhibition dedicated to the experimental art of the Pacific Northwest. If the work is not done by December, I will not be able to attend the next. ~Aaron C. Posen,\n\nEditor\n\n--\n\n\nTwo hundred years after the Japanese government confiscated a three-wheeled American automobile based on the eccentric concept of Kawaii, the United States is reverting to the Japanese concept of a Japanese car, the California Auto Show, which was originally announced as only one of three new models for a Japanese automaker called the EV-3. The announcement was made on May 23, 1941, before the United States entered World War II. The announcement was made in San Francisco, where a year earlier, the Japanese government had signed an agreement granting the United States a monopoly on the production of automobiles in the country. The Japanese auto industry was already struggling in the final months of the war. The war ended on June 9, but production of automobiles in Japan slowed to a trickle in the first months of the new term. Ford Motor Company immediately began production of the new Ford Model T in June 1942. This was followed by a slow but steady decline of the Model T. By June 43", "The next Biennial should take place in Los Angeles, in 2022, and will open in November 2022. By the end of the decade, the Biennial will have contributed more than 2,300 works to a collection that has a total worth of $56 million.\n\n\nThe Los Angeles County Museum of Art (LACMA) has received a gift of more than 5,400 paintings and ceramics from the late collector and philanthropist Iris M. Lewis. Known for her lavish donations to arts and cultural organizations, as well as for her generous lending of her own works, which often found their way into the collections of the Museum of Modern Art, the Metropolitan Museum of Art, and the San Francisco Museum of Art, Lewis was one of the original co-owners of the now-defunct Painted Highway Art and Culture Center (PHACC), a nonprofit arts space in Los Angeles whose art collection was housed in a former auto body shop in the Kensington neighborhood of Los Angeles.“The museum is so fortunate to have the opportunity to present these wonderful works to LACMA,” said museum director Marc Glimcher. “The gift of these four amazing works by Lewis is a wonderful reminder of the extraordinary breadth and depth of her extensive", "The next Biennial should be held at the Museum of Modern Art in New York. \n\n\nThe Christ Church Museum in New York has announced that it is planning to usher in a new era with the opening of a new exhibition in the fall. Titled “The Past Is a Refuge,” the exhibition will explore how the museum became a space for art and philosophy in the 1990s and will showcase more than 100 works by forty-five artists, including Nathalie Béchard, the new curator of contemporary art at the Museum, and Yoshika Mizuno, the director of the San Francisco Museum of Modern Art. The show will also be accompanied by a series of public programming that will organize around the theme of the exhibition, “The Future Is Present®.”The renovations of the Christ Church Museum are part of a $110 million refurbishment campaign, initiated by Christ Church, of the building next to the museum and its grounds. The renovation work was completed in 2017 and is slated to be completed in 2020. During the renovation, more than fifty new works were added to the collection, including works by Juliette Salzmann and Robert Irwin. The Christ Church Museum also added two new buildings, the", "The next Biennial should be held in 2020.\n\n\nThe J. Paul Getty Trust in Los Angeles has awarded a $2.1 million grant to several organizations that are working toward the restoration of cultural artifacts that were damaged during Hurricane Dorian and its aftermath. The grants will be used to reduce the barriers to the exhibition and exhibition of work by African American artists, to advance the scholarship of Black artists, and to expand the visionary work of artists of color. The grants will target the following areas of concern for the Trust:1) Art and Design2) Public Art3) Restoration of African Art4) Art and Design in Southern America5) Art and Design in the Americas6) Art and Design in the Pacific Northwest7) Art and Design in Paris8) Art and Architecture in the City of New York9) Art and Architecture in New Orleans10) Art and Architecture in Atlanta11) Art and Design in New York12) Art and Design in Los Angeles13) Art and Design in New York14) Art and Design in New York15) Art and Design in New York16) Art and Design in New York17) Art and Design in New York18) Art and Design in New York19) Art and Design in New York25", "The next Biennial should take place at the newly enlarged Museo de Arte Contemporáneo, in Madrid, in 2021.  For the forthcoming event, Peregrina Boa, who established the institution in 2004, will push the boundaries of the new institution, which is comprised of three buildings that have been transformed into a cultural hub: the San Auro, the Biennial of Contemporary Art, and the Biennial of Performance. Its next edition, “1958: The Art of Photography,” will take place in the same city in 2022.The renovation of the museum, which has undergone a total of eleven phases (from 1958 to 2018), is part of the ongoing renovation of the interiors of the institutions in the city. It also consists of the acquisition of the organic materials necessary for the preservation of the works. The works that will be stored in the Biennial of Contemporary Art and the Museum of Contemporary Art will be moved to a storage area of the institution. The works that will be stored at the Museum of Contemporary Art will undergo a total of twelve phases, from the construction of the building on the grounds to the opening of the exhibitions. The Museum of Contemporary Art, which is currently undergoing an expansion, will", "The next Biennial should focus on how the works of artists from the United States and Europe can influence or challenge the institutions and systems that are currently under significant threat due to mass unemployment and economic hardship. “The New York triennial of art was a great success,” said Jeffrey Gibson, chairman of the exhibition’s curator committee and the director of the Benjamin H. Bank Art Museum in New York. “The exhibition was an extension of the program of the previous two years at the Museum of Modern Art, where we have staged biennial exhibitions every year since 1990. We were delighted to support the works of the biennial artists in 2017, and we’re delighted to collaborate with their collaborators in 2018.” The biennial will also present biennial works by artists from the Bay Area, including Cameron Rowland, Paul Graham, and David Salle. In addition, the biennial will present works by artists from the San Francisco Bay Area, including Ahman Sadao, Naima J. Keith, and Lala Paz, who will be joined by artists from the Bay Area’s other sister cities, Albany and Antioch. \n\n\nArtist-run websites are fleeing the Trump administration as they try to", "The next Biennial should be hosted at the UBS Art Museum in New York, next year. The next workshop should be hosted at the Community Center in North Little Rock, Arkansas, in 2021. The next exhibition should be on the resilience of the African diaspora in Europe, the United Kingdom, and the United States, and would divide its proceeds between the nonprofit and the artist. For the first time, the Oscar de la Hoya Foundation will be awarding a prize to an African artist. First awarded in 2007, the prize for artmaking has been divided between Aḥma Panza and Shanela Aluko since 2009. “This year we are thrilled to celebrate the fifty-ninth anniversary of the award, and to see how the Biennial 2020 will further the legacy of the awardee, writer Gerald White, and think of the many artists whose work we will be able to honor through the twenty-fifth annual Biennial 2019,” said Jeffrey Glues, chair of the major art prizes committee.The biennial celebrates the work of seventy-eight artists and is organized by the same team that helped create the first show of works by the artists invited to the show. The 2019 winners are as follows", "The next Biennial should take place in 2020. Curator Bénédicte Savoy, who curated the first show in the country in 2012, said: “The new direction of the biennial is to build on the vitality of the program by creating a new platform for the exhibition, which will reflect the spirit of the old.”\n\n\nThe New York City Department of Cultural Affairs (DCLA) has sent letters to twenty-six cultural and nonprofit organizations to inform them that it plans to eliminate the DMA’s annual Fellowships, which award approximately $500,000 in grants over the course of four years, beginning in the fall of 2021.In a letter dated August 5 and published August 19, the DMA states that it “remains committed to supporting the exploration of deeply interrelated ideas arising from and being integrated into the work of artists.” The letter reiterates that the Honorary Fellowships were established in recognition of the impact and influence of artists in the city’s cultural sector, and that the “Permanent Fellowships were created to strengthen the DMA’s growing network of international and national talent.”While the DMA does not consider the Honorary Fell", "The next Biennial should include an exhibition of the work of the late artist Merce Cunningham, opening March 21, 2020, and a selection of works by the late Pakistani artist Ahmed Shafiq, the work of the late Indian architect and theorist M. Krishnamurthy, and the work of the Russian artist N.A.K. Uluzhka.The Biennial will be hosted by the Bombay-based arts destination Blaise Pascal. The venue will be inaugurated by a three-day exhibition of American art at the London 2012. \n\n\nThe Museum of Modern Art (MoMA) in New York has received a gift of twenty-two works by the late Egyptian artist Naguib Mahfouz, a collection that includes a selection of works dating to 1917 and part of a series that debuted at the museum in 2014, The Guardian reports.The works were donated by the Egyptian-born, California-based collector Abderrahmane Imad, who was in the process of relocating to the United States from Egypt after years of trying to find a home for the works. He told the New York Times that the institution hoped the donation would help to \"explore Mahfouz’s magnificent career and to make", "The next Biennial should take place in 2020.\n\n\nThe Institute of Contemporary Arts (ICA) at the University of the Arts (UCA) in London has appointed Tori Babcock as its new chief executive officer and director. She succeeds Emma Lawrence, who retired last month after twenty-two years at the helm of the institute.“Tori has the opportunity to continue to shape the direction of the ICA, continue to build upon its internationally renowned collection, and continue to make significant contributions to the ICA’s mission,” said ica director Jenny Waldman. “I can’t imagine a more important appointment than this, especially given the significant impact the ICA has had on the development of contemporary art and the ICA’s relationship with the local community.”Last year, the ICA and Oxford Art Gallery won the Carbuncle Art Award for their ten-year commemoration of their 150th anniversary. The prize jury praised the ICA’s new partnership with Oxford Art Gallery for its new exhibition, “The End of an Age,” which is slated to open in January 2020.\n\n\nThe Museum of Modern Art (MoMA) decided to remove the controversial work by architect Frank Geh", "The next Biennial should open in April 2020. “The work of the unprecedented team members was intensive, as was the work of the master curator,” said curation director Anna Wintour. “They were able to bring together a wide range of works in the space of two years, but we are pleased that the series is now attracting new audiences and new acclaim. We are always in the process of developing new and innovative ways to engage with the artworks in the exhibition.”The exhibition will also be organized as a “living organism,” as the artists’ bodies move through the exhibition. The Biennial will focus primarily on how the body and the body-system impact art, and the exhibition will feature twenty-four new works by the artists, whose works were selected based on their respective practices.The exhibition will also include the first exhibition of work by the artist-in-residence, Sonia and Wolfgang Pfeifer, whose work is currently displayed in the Biennial’s “Trans-Siberian Railroad.” The exhibition will present thirty-one works by the artist-in-residence, who works in various media, including video, sculpture, painting,", "The next Biennial should be held in 2021. “The exhibition of the work of this artist is a personal commitment, which is why I decided to dedicate a year to work on it,” said the artist. “Her work has always been at the forefront of my practice, and at its center, and I will always be indebted to her to this day.”\n\n\nThe David-and-Goliath exhibition announced today that the second edition of the annual David-and-Goliath exhibition, which will be held at the Metropolitan Museum of Art in New York from November 8 to November 12, 2020, will receive a total of $106 million from the David Rockefeller Fund. The $104 million raised will be divided between artist and the David Rockefeller Fund, with the remainder committed by the museum and its board of trustees.The fund also pledged $50 million to support the visual arts in New York City and New York State, including the city’s Central Library, the David Rockefeller Center for Jewish Heritage, and the David Rockefeller Library, and $20 million to support the museum’s public programs, including the David Rockefeller Memorial Garden, David Rockefeller Pavilion for Artists, and the David Rockefeller Center for the Performing Arts", "The next Biennial should take place in 2021 and will invite fifty-six artists and collectives from seventy countries, including twenty-six from America. The forty-fifth will be held in 2022 and will feature fifty-six artists from seventy-three countries, including ten from America. Nihal Chandrasekar, director of the Biennial, said:- “The twenty-sixth edition of the Biennial will identify and present the work of twenty-six artists from seventy-three countries and will be a celebration of the visual arts. I am looking forward to working with artists from the United States, Mexico, Canada, and Mexico City to advance their careers and to present this year’s edition.”The biennial’s organizers are also working to raise $144,000 for the costs of the theme parks’ construction, transportation, and security in the event of a large-scale terrorist attack. \n\n\nThe Argyros Collection, a contemporary art museum in Athens, the largest private acquisition project in Greece, is planning to sell eight of the institution’s works to the German collector Tobias Schäfer, who is currently facing criminal charges for allegedly smuggling thirty-five works by artists he never paid for, reports the", "The next Biennial should be held in 2020. \n\n\nThe Los Angeles County Museum of Art (LACMA), the Museum of Contemporary Art (MoCA), and the Kansas City Museum of Art (KCMO) have announced that they have received funding from the National Endowment for the Arts (NEA), the Corporation for National and Community Service (CNS), and the  Parsons Foundation. The grants will allow the museums to further develop and enhance their collections and programs in support of the mission of the National Association of Theater, Film, and Television Artists (N.A.T.A.), which was founded by the late actress and writer Roseanne Barr.“This is a historic year for the arts and we are pleased to receive this support for the future of our programs and our work,” said LACMA director Klaus Biesenbach. “Together, we are working to create a more just, inclusive, and secure world for future generations. We are making our exhibitions more socially relevant, and our programming more accessible to people of all ages. We are working to build on our heritage as a model for how to think critically about art and the environment and how to work collaboratively across disciplines.”B", "The next Biennial should take place in 2020, and the year 2020 will be the theme of the twenty-first edition.\n\n\nThe Andy Warhol Foundation and the National Endowment for the Arts (NEA) announced today that the art museum’s fourth biennial, “The Death of an Artist,” will take place in the fall of 2020. The show will present the work of seventy-four artists, and the exhibition will run twice a year. “The Death of an Artist’s” will be staged at the Allen Memorial Art Museum in Rockville, Maryland, and will present the work of artist-in-residence Larry Watkins. The work, which was shown in exhibition “The Death of an Artist’s” at the Allen Memorial Art Museum in 2016, will be presented in conjunction with the museum’s opening of a new exhibition at the Allen Memorial Art Museum on April 2. The exhibition is titled “Larry Watkins: The Object of My Obsession” and examines the artist’s relationship to objects, society, and the human condition.The show will be organized as follows:The exhibition will consist of seventy-six works, organized by artist, their medium", "The next Biennial should be held in 2021.\n\n\nThe European Court of Auditors (ECAC) has upheld the fines levied against the World Anti-Doping Agency (WADA) in France and has declared the FIA’s decision to move the World Championships to the United Arab Emirates as the final stage in its investigation into allegations of widespread doping in the sport. The decision was made in a case that has been ongoing since 2015, when French national sport minister Christiane Taubira told a French radio station that the court had ruled in favor of the FIA.While the case against the WADA organization was previously settled in 2016, the court found that WADA had ignored repeated requests from the commission for more than two years to make the reforms it had requested. The ruling means that the organization will remain closed until at least March 20, 2022. However, the Court of Auditors ordered that the World Championships be moved to March 15–March 17, 2022, citing the ongoing investigation into the allegations.“This is the final stage of our work,” said WADA president and CEO David Murray. “The court has confirmed for us the importance of the work that we were doing and the difficulties that we faced. We will now focus on", "The next Biennial should culminate with an exhibition of work by the last four artists to be included in the exhibition: Paul Gauguin, Ingvild Rönnberg, and Ingvild Nilsen. The panelists will be chosen by the artists.\n\n\nThe Lebanese-born filmmaker Nouadima Baroumi has been named the winner of the fifth edition of the Beirut Biennial, which runs from January 21 to January 27. Titled “Beirut: City of Light” and coauthored by Baroumi and artist Ziad Jarouni, the exhibition was curated by Beirut-based architect Maha Al Shaar, who also helped organize the second exhibition, titled “Beirut: City of Magic,” last year. The seventh biennial will take place at the city’s al-Qasr Museum in 2022.\n\n\nThe Culinary Institute of America (CIA) in Culver City, California, has appointed Sarah Einhorn as its new director. Einhorn comes to the institute from the Culinary Arts Alliance (CAA), which she cofounded in 2011. Previously, she has held senior positions at the Culinary Institute of America, where she currently serves as", "The next Biennial should be in December 2020.  Since the museum, founded in 1907 as a later-life space for the artist, has been closed since March 19, the event’s designers have chosen to create an immersive environment in which to engage with the work of the artist in order to create the most spectacular exhibition possible. “The Biennial is a photographic history of the artist’s practice, and we will continue to record his work,” said Mira Gershon, a member of the exhibition’s design team. “I have a long history with the artist. I am eager to see what he will do next.” \n\n\nThe Carnegie Museum of Art in Pittsburgh has won its bid to be included in the 2020 Whitney Biennial, which will be held at the museum in December 2020. It was announced in May that the exhibition would be staged at various locations including the Carnegie Museum of Art, the Art Institute of Chicago, and the University of Pittsburgh.Called “The Realist Experience,” the show will explore how the relationship between the artist and the natural world has evolved over the course of history. Curator and director Tanya Lonos, who teaches at the University", "The next Biennial should focus on how artists value and reflect on their work, and what the next iteration might look like. We should also consider how we can work even more closely with the participants and their communities.”The UPD Group, which represents the artists and institutions represented in the exhibition, also announced that it is planning to collaborate with the government on a series of projects to encourage the use of technology in the exhibition. The first project will involve adapting the Biennial’s website to provide more efficient and relevant information. The second project will be a Digital Cinema Event, which will involve screening seven films at the exhibition. It will also host an online version of the exhibition.The exhibition is curated by Jodi Throckmorton, who has served as director of the Biennial for the past six years. Throckmorton has also curated the inaugural edition of the Biennale in Amsterdam, which opened on March 18 and ran through May 28. The exhibition was organized by the Amsterdam-based studio Nederlandske Kontakt, along with the artist-run pop-up cafe, the Alleen-Königwarts. Throckmorton and his team traveled to Rome, New York, Paris, London, and other locations", "The next Biennial should be held as soon as possible, in order to ensure the academic and artistic integrity of the exhibition.”The exhibition’s next edition, “Behind the Scenes” in 2019, will be held at the museum in November.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, has appointed Sarah Sze as its new director. Sze comes to the institution from the Los Angeles County Museum of Art (LACMA), where she has held the position since February 2019. She succeeds Lorraine O’Grady, who was hired as director of the Los Angeles County Museum of Art (LACMA), and will assume her responsibilities on July 1.“Sarah Sze’s tenure at LACMA will be a momentous milestone, both for the museum and the city of Los Angeles, as she sets the stage for a new era of cultural life in Pasadena,” said LACMA director Monica Patinkin. “She will inherit a collection of over twenty thousand works, a legacy of which will shape the museum’s artistic mission for years to come.”Prior to joining LACMA in 2018, Sze was a curatorial assistant in the Department of", "The next Biennial should be held in 2021. In the meantime, Art Basel Hong Kong has released a statement on the exhibition’s legacy. It reads: “The exhibition ‘Paintings From Sculpture,’ has been a powerful legacy weapon for the art world at large. Together with our artists and curators, we will continue to better understand and appreciate the exhibition, and its extraordinary collection.”\n\n\nA group of artists and collectors whose works were digitized and restored by the Italian government in the hope of sparking interest in the country’s antiquities have launched a new group, the Cosmo di Trisulti di Ticino, to promote the preservation of Italian art. The foundation is modeled after the Italian Art Archive, an initiative launched in 2003 by the government and the Italian Institute of Technology in Rome to preserve Italian art and antiquities. The organization aims to collect and store the artworks in Italy rather than ship them to the United States, where they are often sold or given to museums.The project, which was launched by the government as part of the Rome Declaration on Art and the Environment, established the Cosmo di Trisulti di Ticino in 2016. Its inaugural", "The next Biennial should focus on the work of small and medium-sized enterprises, on the exhibition of works by established and emerging artists, and on the exhibition of a collection of work by artists whose work has been underrepresented in the past. It should also reimagine the role of the museum in charge of the collection.” The next iteration of the Haus der Kunst will open in Berlin in 2021, with the next exhibition coinciding with the German New Art Congress, which will take place in Duisburg in June 2022. The biennial will also launch a new digital platform, Goethe im Landes, which will offer a virtual reality experience. \n\n\nThe Margaret and James Diller Foundation (MDF) in New York has welcomed Alexandra Medin, who has served as the Margaret and James Diller Foundation’s chief curator and educational director since 2013, to its board of directors. The foundation is preparing to host the inaugural biennial at the Diller Center for the Arts in Harlem, New York, in the spring of 2020. Medin will serve as the foundation’s first board chair with Diller in more than twenty years. She succeeds former chair Frederick G. W", "The next Biennial should take place in 2020, and the twenty two following year. We would like to thank the organizers of the two upcoming events for their gracious cooperation with our investigation into the status of the exhibition and the museum’s approach to the subject matter. When the Biennial was first organized in 1976, the decision was made to hold it at the Palace Theatre in London. The exhibition was to be held in both the City of London and the West End. Since the institution was not able to secure a venue for the exhibition until 1983, it was not until 1990 that the exhibition was finally staged in the UK.Since the exhibition closed in 1991, it has been on hiatus and has only recently reopened. The biennial returned to the West End in 2012, when it was briefly closed due to the Covid-19 pandemic.\n\n\nThe Livermore Art Museum in California has received a gift of twenty-seven works by thirty-three artists\u0097including Jamie Peck, Nara Bar-Lev, Mary Belushi, and Mihai Barayev\u0097from the Livermore Skyscraper Belushi Fund, which was established by the Los Angeles–based artist and philanthropist, Loren Coleman. The $60,000 donation includes", "The next Biennial should be a celebration of the work and life of Terrence Avery, a Chicago native who was a prolific sculptor whose work is well-known for its emotional impact and for creating works that challenge notions of beauty, identity, and the hand. He is also known for his sculptural works that draw attention to the ways in which art can be practiced through the practice of everyday life.“Avery was a pioneer in the field of sculpture,” said Paul McNamara, director of the Adler Museum of Art. “For an untrained observer, his works can seem whimsical, while at the same time acutely affecting. His work can be seen as he entered into a relationship with the human body that generated continuing inspiration and creativity.”The work of the biennial’s artists will be curated by Aaron Kornbluth, who previously served as director of the Institute for African Art and the Art Museum Chicago; David Kordansky, who previously served as director of the Black Bess Museum of Art; and Dona Pailat, who previously worked as a graphic artist. The 2018 triennale will feature work by seventy artists spanning twenty-six countries and territories.\n\n\nThe National Gallery of Art in", "The next Biennial should be held in 2020. Manfred [Franz] Zinsser] has suggested that, should the requisite conditions be met, the second event might be held in 2021. Becky Gifford, the curator of Modern Art at the Museum of Modern Art in New York, has also suggested that, for the first time in its fifty-three-year history, the event might be staged in the spring of 2022. I think the situation is ripe for something ambitious and exciting. \n\nTina Dupuy, who curated the Paris–Montréal triennial of modern art (the Fondation Dangote), announced today that she is resigning to pursue new creative projects in the Bay Area. She will remain involved with the show, which was inaugurated by Marc and Yvonne Sauss, and will continue to be a board member of the museum.“The grand vision of the show and its current projects, together with its previous partners, made it impossible for me to leave the museum,” Dupuy wrote in a letter to the public in an email provided to Le Monde. “Over the years, I have had the opportunity to travel extensively and to see a great", "The next Biennial should be held in 2021, with the exhibition taking place at various historical sites across Paris, such as the Louvre, the École des Beaux-Arts, and the Beauvais, and will determine the future of the Museum of Modern Art.\n\n\nThe Solomon R. Guggenheim Museum in New York has welcomed journalist and curator Maria Angela Carter to its curatorial staff. Carter brings with her a wealth of experience and knowledge in contemporary art, and will work closely with curator and art historian Nazar Mohammed to imbue the Guggenheim with a sense of urgency and purpose.“We welcome Maria to our team and look forward to her contribution,” said curator Maira Sheehan. \n\n\nThe City Museum of New York (CMO) has appointed John Hoyt as the new director of its art photography program. Hoy is responsible for the curation of the biennial “Theater of Operations: The Gulf Wars 1991–2011” (October 29–November 21, 2020), which will showcase upcoming work by artists whose work engages with historical events and US foreign policy. He succeeds Peter Schäfer, who retired after eighteen years at the helm of the museum last", "The next Biennial should take place in 2021, with a new exhibition on the science of memory. The production will be hosted by SÉbastien De Sousa, the director of LACMA, in partnership with the architect and the filmmaker Stefano Boeri, and will be curated by the artist Oscar Laureano.The deadline for the exhibition was set by the artist-run organization Biennale de Lyon (BL), which said: “The event will be divided into three parts: design, architecture and photography. By creating the different forms of memory, we hope to send a new conceptualization of memory to the contemporary context.”\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Mary Ellen Krantz as its new board chair. Krantz, who has served as a board member since 2016, will take up the post on July 1. Krantz will be responsible for overseeing the institution’s major fundraising initiatives—the $2 billion modernization of the existing art and collection, the $1.5 billion expansion of the new museum, and the $675 million renovation of the Whitney Museum of American Art—and will serve as the chair of the board for three years.“Mary Ellen", "The next Biennial should be held at the Pépargrè an der Künstlerhaus in Berlin, and its twenty-second iteration should be held in the Mezzogiorno, Italy. The first edition of the fifty-third Venice Biennale will be held in the city of Venice in May. The twenty-fourth edition will be held in Milan in June. The thirteenth Venice Biennale will be held in the Adriatic city of Venice in October.The exhibition has received a donation of $10 million from the Giard Foundation and will return more than $2 million to the charitable organization. The money will also support the development of programming for artists and the arts in the Venice region.The Venice Architecture Museum, which recently staged a retrospective of the Italian architect and landscape architect Silviu Gomes’s design for the Palazzo Reale, is now seeking $10 million from the Giard Foundation. The gift will also help the institution organize a show of work by the late Italian designer Umberto Eco.The donation includes $6 million for the restoration of the architect’s home in Rome and will enable the foundation to create an endowment for the renovation of the Punta della Dog", "The next Biennial should take place in the summer of 2021, and the twenty-seventh in the spring of 2022. The event will be run concurrently with the upcoming 2020 Venice Biennale, which will open on May 25. The full list of participating artists is as follows: 1. Elli Barlow, AustraliaC2. Alexander Calder, FranceC3. Christa Blavatnik, United KingdomC4. Claudia Borg, ItalyC5. Claudia Borg, ItalyC6. Claudia Borg, ItalyC7. Claudia Borg, ItalyC9. Christa Boschke, GermanyC10. Claudia Borg, ItalyC11. Claudia Borg, ItalyC12. Claudia Borg, ItalyC13. Claudia Borg, ItalyC14. Claudia Borg, ItalyC15. Claudia Borg, ItalyC17. Claudia Borg, ItalyC18. Claudia Borg, ItalyC20. Claudia Borg, ItalyC21. Claudia", "The next Biennial should be held in the fall of 2021.  The next Sundance Film Festival should be held in the fall of 2022.  The next Berlinale Film Festival will be held in the spring of 2023.  The next Fermat's Last Theorem Lecture should be held in the spring of 2023. \n\nThe British Film Institute (BFI) in London announced today that it will open a new seven-month programming period for the BFI, which will now run from October 8 to October 11. The new dates for the institution are an attempt to avoid disrupting the foundation’s programming, which has been in a holding pattern since last spring, in an attempt to avoid disrupting the cultural landscape in London. The new BFI programming will include four new documentaries, two documentaries on the history of modern and contemporary art, and three new arts and culture events. The first documentary, The Palimpsests, will take the history of modern and contemporary art through the lens of the British artist David Salle, who has lived and worked in London for more than forty years. The second, Avant-Garde: An Unfinished Story, will examine the legacy of British avant-garde art", "The next Biennial should be held in 2020. The exhibition “isn’t perfect, but we are working very hard to do better,” said executive director Astrid Schildkrausch. “We are committed to working with our partners, the wider arts community, and our partners in the private sector to improve the exhibition. We are open to new ideas and new ways to engage with the Biennale. We are open to the ideas and the capacity to work together. Biennale has always been about sharing ideas and collaboration. Now I am optimistic about the future of the exhibition, and the expositions and how we might work together in the future.”See also: Artforum’s upcoming exhibition, “Art in a Day’s Life,” at the Melbourne Art Gallery, and our 2017 profile of the late British artist Roger Crisp.\n\n\nThe twenty-fifth edition of the Dubai Biennial, titled “Dubai: Twenty Years of Art,” will be held at Dubai’s AlUla site in the United Arab Emirates from March 19 to March 21, 2020. The event, which will promote the region’s ancient heritage", "The next Biennial should also focus on historical preservation, with the goal of creating a collection of all works by a single artist, allowing the museum to draw inspiration from the artist’s entire body of work. “We will continue to explore different ways of building relationships with museums, institutions, artists, and the public,” said Richard Laurent, director of the Biennial de Lyon. \n\n\nThe David-and-Goliath story of the world’s most celebrated artists is being redefined. From the pioneering vision of Peter and Eddle West to the legacy of Ed Moses, Michelangelo Antonioni, and Mies van der Rohe, the Biennale of London has produced a collection of some three hundred works by fifty-eight artists, including Hans Hofmann, Willem de Kooning, and Michael Powell. However, the exciting new initiative to stage the exhibition in an abandoned quarry in the heart of London is being called off—it is being held at the Tate, which will reopen as part of the Museum of London Art.The decision to stage the exhibition in an abandoned quarry in the heart of the capital was made in a letter from artistic director Maria Balshaw to arts patron Lord McAlpine, who", "The next Biennial should be held in the coming months. A Biennial does not have to be a single exhibition but an integrated program that reflects a broader appreciation of contemporary art. It can be an exhibition of one work or a collection of more than one works. Nominated for the 2022 Pulitzer Prize in Drama, The Biennial of Vladimir Buzsinský, exhibited that year, Artstrials, depicted the lives of young people in the city of Pskov in the Republic of Karelia.Priced to be held in the Russian city of Saint Petersburg from January 15 to February 22, 2022, the prize exhibition will be hosted by the Contemporary Museum of Art in Helsinki. The centerpiece of the event will be the exhibition “Vladimir Buzsinský,” featuring works by 21 artists, including Alexander Gorbakov, Aleksandr Kuznetsov, Gennady Gvozdika, and Lutsiya Mirov, and will feature the first works of the new artist-in-residence, Valentina Slutskova. The art will also be presented by the newly founded Maik Gallery in Moscow.\n\n\nPace of Life, a contemporary art center", "The next Biennial should take place in the New York City borough of Manhattan, which is currently home to approximately one-third of the world’s population, and will be held in 2020. \n\n\nCommissioned by the Wachowskron Museum of Art in Ohio, the Zoës Biennial, billed as the world’s largest assemblage exhibition of contemporary art, has announced that it is postponing the event, scheduled for February 16–February 19, 2020, to March 14–March 16, 2020.  In a statement, the museum said the postponement is not related to the Covid-19 pandemic. When planned for the fall of 2019, the event was canceled owing to the Covid-19 outbreak. The art world has since been forced to adapt to a new reality, with galleries canceling events and individuals shifting their travel plans. “We are always cognizant of the impact our work has on the world, especially as it affects the art world,” said Tina Boheim, director of the Wachowskron Museum. “With that in mind, we have had conversations with the community, including with artists who are making works that are", "The next Biennial should focus on the death of a revolutionary Black revolutionary in the United States, and on how and why women, especially the working class, are not forgotten in the labor movement. It should also include an examination of the role of the Black Liberation and Solidarity Florida movements in the Black liberation struggle.” The biennial will be hosted at the site of the former George A. Lucas Oil Building on the University of Central Florida’s campus from March 19 to March 21. \n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles has appointed Victor Insider as its next executive director. The sixty-nine-year-old Lauderhill native previously served as the founding director of New York’s Museum of Modern Art, and is the founder of the private equity firm Apollo Global Management, which owns several art institutions, including the Contemporary Art Museum San Francisco (CAMSF), and the Los Angeles County Museum of Art (LACMA).A former hedge-fund manager, Insider has donated $1.7 million to various LA institutions during his career, including the LA County Museum of Art ($1.4 million), the LA Institute of Art ($1.3 million), the LAX Museum of Art ($1.2 million", "The next Biennial should take place in 2020, and the 2021 edition will be presented by the organization. For the past few years, the museum has been striving to secure the future of the building, which is currently undergoing a $100 million overhaul, and has received numerous expressions of interest from prospective bidders. It is also developing a new handicapped-accessible website that will allow visitors to experience the museum in person for the first time.Commenting on the project, which is being led by director and CEO Bénédicte de Montlaur, the museum said: “We are thrilled that the world is finally waking up to the extraordinary architecture of the Biennale de Lyon. The project is a testament to the commitment and passion of the museum’s board and staff, as well as the team of curators, architects, engineers, and writers. The renovation project is one of the most ambitious and ambitious in the museum’s history, and we are certain that it will not only bring new arrivals to the museum, but also create a new kind of experience for visitors.”\n\n\nThe British Council (BEC) has released the list of sixty-nine artists and cultural workers who will receive grants from the organization in", "The next Biennial should take place in the autumn of 2020. The initiative’s co-chairs, Harald and Sigrid Freund, said: “Within this context of great uncertainty and uncertainty, it is especially meaningful that the biennial is conducted in the autumn. We feel it is our responsibility to continue to focus our attention on the tenor, and especially on Málaga, as the next foróm.”\n\n\nThe nineteenth edition of the Taichung Biennial, organised by the Taichung Fine Arts Museum, has announced that it will move the event online from its normal location in the capital, Taichung, China, to the newly expanded Taichung Art Museum in the city of Wuhan, the country’s capital.Taichung Art Museum director and CEO Yuka Nakamura said: “This is a moment of great change for the world. China is entering an era of transformation—one that will reshape how we live, work, and live together. We hope that the new venue will serve as a model for future projects and exhibitions.”Nakamura said the renovation, which began in December 2017 and was completed in April, will help the museum to �", "The next Biennial should be a landmark “post-xenophobic” event, said the museum’s director, Susanne Neumann. “It is in the public interest to re-examine the past and to create a new space for the art of the future.”\n\n\nThe Carlyle Group, the New York–based arts and culture conglomerate, has launched a new arts investment arm, the Carlyle Arts Fund, which will invest in the arts and cultural sector through a series of three-year awards. The first prize will be given to the San Francisco–based artist Noah “James” Tavares, who will receive $10,000. The runner-up will be chosen by a committee chaired by the museum’s director, David Greene; the Los Angeles–based artist and philanthropist Alice Cooper; and the New York–based artist and philanthropist David Geffen.The organization will operate in the same way that the Carlyle Group runs its own arts and cultural philanthropy program, which works with artists and organizations across the city to create new programs. The organization will conduct its own annual awards, which will be given in conjunction with the March for Art, and will not partner with any other", "The next Biennial should focus on how the institution could move forward in the face of the ongoing crisis. “‘Beyond the Walls’ will be a great opportunity to reflect, re-imagine, and re-create the site,” Scott told the Art Newspaper. The next venue for the annual event is New York City’s Central Park, where the artist-run venue the Gallery of Contemporary Art (CACMA) opened in 2007, and will take place in 2020.  The 2018 edition of the event was held in March.\n\n\nThe Andrew W. Mellon Center for Art and Architecture (MCA) announced today that Mike Kelley has been appointed as its new senior curator and head of curatorial affairs. He succeeds Chris Camoschi, who retired from the position in July 2018, and will assume his post on September 9.“Looking ahead, I’m excited to be a part of the MCA team,” Kelley said. “The core of our program, which works across art, design, architecture, and design theory, is revolutionary, and there is much to be learned from artists and designers and designers’ practices. I’m eager to give my voice to collaborative,", "The next Biennial should be held in 2021. According to the New York Times, the next iteration of the exhibition will be held at the Museums of Finland (Mūmai), Helsinki; the Museums of the History of Art in Warsaw; and the Museum of Modern Art in New York.The next edition of the Biennial will be held at the Astrup Bujino, Copenhagen; the Haus, Oslo; and the New Museum in New York. The exhibition will be held in public spaces nationwide from January 26 to February 29, 2021.\n\n\nThe National Museum of Algeria (FNAla) in Samara has received a donation of 6,500 photos documenting the revolution in the country, which overthrew Britain in 1830 and declared independence from France in 1954, by Twitter user @xoxthemanxoxt. The donation was made by artist and collector @xoxthemanxoxt, who lives in the United States, Israel, the United Kingdom, and Germany. “The museum is desperately in need of new works that will stimulate and update our understanding of the legacy of Algeria,” said @xoxthemanxoxt. “We are thrilled that this gift will help us fulfill this", "The next Biennial should be held in early 2022, and the final in late 2022.\n\n\nItalian artist and architect Sara Horrocks, a pioneer in the field of the environment and a major force in postwar design, was named the winner of the fifth edition of the Douglas and Dorothy Thornburgh Award. Horrocks, who died in 1987, was selected for her work AVOID, 1956–1958, which was staged at the Kaufman Gallery in New York in August, and was the subject of a special exhibition at the museum in 2012. Horrocks’s work will be exhibited at the Frederic Halley Museum of Fine Arts in Philadelphia in 2020. \n\n\nThe Danish artist Tina-Kristina Nilsen, whose ephemeral, almost psychedelic paintings often confront social issues such as the creation of the artificial paradise of the Internet, has died at age ninety-eight. Nilsen’s work, which often plays with images taken from the real world, has been collected by the London Foundation for Contemporary Art and the Tate in London.Born in Copenhagen in 1941, Nilsen moved with her family to Copenhagen in the 1950s. She attended the Academy of Fine Art in", "The next Biennial should take place in the US’s Charles River Valley in January 2021. The ten-week event will include seventeen exhibitions spanning disciplines including architecture, photography, design, film, performance, and design. The first one, “Eros & Rebirth” (2019), was curated by Daniel H. Pink, the founder of the New York–based nonprofit the Gay & Lesbian Alliance Against Defamation; Paul Graham, the chairman of the Graham Foundation; and artist Susan Cain. “We have tried to balance the importance of the exhibition with the importance of the exhibition’s community,” said Pink. “With that in mind, the exhibition’s fairs participants have been invited to take part in a series of public forums and other activities that will engage directly with the exhibition’s artists and residents, and will focus on the exhibition’s legacy of supporting the gay and lesbian community.”The next event will be staged in the Arts District of Manhattan from February 21 to February 27. Its themes include “Love and Gender: Art in the Age of AIDS” (2019), which will feature work by fifty-five artists, including Alison Bech, Liza Minnelli,", "The next Biennial should be held in 2021, and its first edition will take place in the city of Durban, South Africa. The show will also include the first exhibition devoted to women photographers in the United States.The Royal Academy of Arts, which has a current residency in Durban and is cofounded by the artist Alice Black, has announced it will move its 2020 event to Natal. The exhibit will take place in the city of Durban. The Royal Academy of Arts has also welcomed Joan and Larry Sze to the academy. The couple will be the first guests to receive the Royal Academy of Arts in the United States, following the announcement that the Marcos-designed and built attraction will reopen in the spring of 2021.“The Marcos Museum of Art is a remarkable object of international cultural significance,” said organizer and curator Marianne Gookin. “In addition to being a remarkable institution, it is an inspiring model for how a museum can be designed in such a way that it can be shared by many, with an aim to foster a sense of community in the community. We are delighted to be collaborating with Marianne and Larry and to thank them for their contribution to the Marcos Fund. We are also very grateful for their work in supporting", "The next Biennial should be in Zurich in March 2020, along with a second in Tokyo in December 2021. The exhibition will also feature work by the Boston-based artist Dusan Kraus, whose practice explores the relationship between people and the environment in a social and ecological sense. In January, the exhibition was relocated from its original location in Charlotte’s former home in Boston to the University Museum of Fine Arts in St. Louis. The exhibition was selected from a shortlist that included Kunsthal Charlottenborg in the Netherlands, the Kassel Biennale in Germany, the Berlinale in Germany, the BAM, the Palais de Tokyo in Paris, and the Venice Biennale.\n\n\nThe German state of North Rhine-Westphalia (DRW) has appointed Norbert Hausmann, a former chief executive of the Hella & Co., a luxury automobile manufacturer, as its new minister of culture. Hausmann, who has led the company for twenty-two years, takes over from Jürgen Krämer, who has led the state of Bavaria for sixteen years.Hausmann comes to the state from the German state of Hesse, where he was executive director of Dusan", "The next Biennial should be organized in September 2020 and will feature a selection of work by more than fifty artists from thirteen countries and territories. The first set of artists selected by the Biennial Council are Artsakhina, G. H. Choi, I. M. Pei, and Richard Sawchuck. The second group is comprised of Scott Hemingway, Hao Jinghai, and James O. J. I. The third group is composed of Hancho Yueh, Sawangoo Paik, Rory McIlroy, and Hiroshi Miki. The final group will be composed of João Menezes, Alexandra Pappalardo, Adrian Piper,  and John Hutton. The 2019 Biennial will be held at the Art Institute of Chicago (AIC), and the first exhibition will open on September 7.\n\n\nThe National Gallery of Art in Washington, DC, announced today that, in honor of its centennial, it is reopening on September 8. The contemporary art museum will be inaugurated by a new, ten-piece group of American artists, led by artists like Yishan Jiang,", "The next Biennial should focus on an exploration of the role of the Caribbean in the history of art and will draw on the work of José de Cervantes, the American artist, and the work of the late Mexican artist Felipe Calderón, the president of Mexico.”“With the completion of this biennial, we are entering a new phase of the Museum’s history,” said Peter Jordan, the director of the Museum. “After many years of championing the work of artists from Central and South America, we are once again proud to present the work of Gabriel Duran, the first artist executed for the museum. He is a master, who adapted his craft to reflect the life and times of his native New York, and was one of the first artists executed in the United States.”Filipino artist and activist María Berrada, whose work explored the nationalistic, anti-colonial, anti-imperialist, and anti-colonial struggles of the Philippines, will also be featured in the upcoming exhibition. Berrada’s work will be exhibited in the exhibition “Todos ni Dito,” which will be staged at the Museum of Art in San Francisco.\n\n\n", "The next Biennial should take place in the city of Atlanta. The 2019 event, titled “Art in the Age of Black Power,” will feature artworks by more than 150 artists and cultural organizations and will take place in the former Georgia Pacific plant. The exhibition will run concurrently with the biennial’s 25th anniversary celebration, which will take place at the museum in March.“Themes of race, history, and the body are central to the Biennial,” said Rina Banerjee, director of the biennial. “The topics that will be presented in the exhibition are diverse and include topics such as body politics, body politics within beauty, body politics within beauty within beauty, body politics within beauty within beauty, body politics within beauty within beauty, body politics within beauty within beauty, body politics within beauty, body politics within beauty, body politics within beauty, body politics within beauty, body politics within beauty, body politics within beauty, body politics within beauty, body politics within beauty, body politics within beauty, body politics as we all know it.”The 2019 edition of the exhibition, titled “Body Politics: Beauty in a Time of Blackness,” is organized as follows:January 7–", "The next Biennial should focus on how to use art as a tool in our struggle to live up to the values and ideals that underlie our founding.”The 2019 edition will continue the theme of “The Humanities,” with an exhibition of works by forty-five artists. The collection will include work by forty-two artists from thirteen countries, including China, Egypt, France, Germany, Italy, Mexico, and the United Kingdom. The exhibition will be inaugurated by a live installation at the Museum of Contemporary Art, Los Angeles (MCA), featuring works by thirty-seven artists from twenty-six countries and will run through March 6.\n\n\nThe Baltimore Museum of Art (BMA) announced today that it has received a gift of thirty-six works by fifteen artists from the Baltimore-born collective “The Comeback Boys.” The gift includes works by three new and established artists, including Kelly Rinehart, Andrea Henry, and Jionte Noel-Bouvier, and is the second gift from the group in the museum. The group was formed by four artists who were active between 1980 and 1989, including Robert Irwin, Geert Lüter, and Gerald James Olmos, and will begin presenting their work", "The next Biennial should commence in 2020 and will be a mix of contemporary art and history. It will organize conversations with contemporary artists and will include a series of exhibitions that will be organized according to a theme. Its inaugural exhibition, “Tic-Tac-Toe” (Tic-Tac-Toe), was organized by the Chicago-based artist and curator Deana Lawson. The six-week exhibition will target middle-aged and older artists and will take up topics such as consumerism, urban life, and technology. The sculpture program will be directed by the artist and curator Toni Lowe and will focus on the history of contemporary art and how it is presented through contemporary art.The biennial will be held at the Chicago Institute of Art, known for its Center for Contemporary Art and the Center for Visual Arts, and will be curated by architect Daniel Libeskind, whose designs include the new buildings for the Museum of Contemporary Art and the new MCA, as well as the renovation of the former site of the Chicago Cellar. The new museum will be situated on eight acres and will host three exhibitions a year. The proposed location for the exhibition was chosen to maximize the biennial’s reach, while retaining the institution’", "The next Biennial should be held in the fall of 2020. In the meantime, the institution will have an exhibition of work by sixty artists selected by the museum’s board of trustees next year.The museum will unveil a new initiative, “Feminine,” that will focus on the intersections of art and feminism. The first phase of the initiative, unveiled at the museum last month, was a presentation of one hundred works by women artists. The second phase, which is currently being developed, will take place in the museum. The first phase will focus on themes of the body and the body parts, and the second phase will examine the relationship between art and feminism. The first museum retrospective, “Manifestations of Modern Life,” will be held in the Fall of 2020. This exhibition will feature work by forty artists who have been selected using a global festival, “Feminism 2020.”\n\n\nAmerican painter Ron Gorchov, whose semiotic fashion of combining art and politics is infused with an ethical sensibility that seeks to embody the ideal of a post-industrial utopia, has died at age ninety-four.Born in Manhattan in 1938, Gorchov studied painting at the Brooklyn Museum and the Metropolitan Museum", "The next Biennial should take place in the third phase of the 2020 edition, which is slated to run from November 30 to March 6. A new exhibition of new works may be added at any point during the festival.\n\n\nThe Neue Galerie in Berlin announced today that the twenty-eighth edition of the Neue Galerie Berlin (NGB Berlin) will take place at the Neue Bayerischer Kunstverein from March 4 to March 7. The theme for the exhibition will be “Reality in a Shift,” a critical survey of the current state of the art and the art world in this decade. The show will feature presentations by six artists: Alejandra Bochereau, Carlo Boetti, Christian Plummer, Rennie Redenbacher, and Thomas Schoonmaker.  The show will include photography, sculpture, Christo, performance, performance-based art, curator-led projects, digital art, photography workshops, photography tours, and photography studios.“We are thrilled to participate in this year’s Neue Galerie Berlin,” said Marc Spiegler, director of the Kunsthalle Basel. “It is an unprecedented", "The next Biennial should be in 2020.”Smith also said that the Los Angeles–based artist heard about the upcoming event through the Los Angeles–based nonprofit arts organization LA/LA, which partnered with the biennial to launch the independent Los Angeles–based nonprofit Art in LA. LA/LA director Douglas M. Davis told Artnet that the organization worked with Biennial organizers Michael Aronson and Donna Karan to develop the 2020 version of the show, which will take place at the Palazzo Reale di Santa Maria della Scala in Venice.The 2020 edition will consist of sixty works by forty artists, including Renata Olmi, Ryan Lee, Tanya Lee, Rayyane Lemke, Jodie Kelsey, Tarah Lee, Jaime Khouri, and Daniel Lara.“The show is a celebration of the ongoing impact and creativity of the Los Angeles Arts, and of the many ways that they remain an important force in contemporary artistic and cultural life,” the biennial’s current head, Andrew Dunlopf, said. The 2019 edition, titled “Los Angeles,” featured fifty works by fifty-four artists.\n\n\nThe Institute of Contemporary Art (ICA) in London announced today that the", "The next Biennial should take place in 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Chicago has appointed John Akomfrah as its next executive director. In a statement, the institution said: “John is a seasoned curator who has shown remarkable prescience and acumen in guiding the Museum of Contemporary Art into a position of global significance. We are grateful for his service and confidence in this newly created role.”Akomfrah comes to the institution following five years as director of the Stedelijk Museum in Amsterdam and has organized more than thirty-five exhibitions, including “Post-Modernism” (2018), “Post-Humean Art” (2018), “Post-Modernism and the Cinema” (2018), “Post-Modernism” (2017), “Post-War Art: Art in Transition” (2017), and “Post-War Art” (2017).Commenting on his appointment, Akomfrah said: “I look forward to continuing the work of my predecessors, in providing an environment for the art of the future to flourish in both the state and the city I foresee a future for MoCA that reflects both an ambition", "The next Biennial should be inaugurated by a program of over two hundred exhibitions that explores life and art through the lens of the biennial. The program will also feature a virtual reality installation, a collage of paintings from the contemporary art movement, and a virtual museum.The inaugural exhibition, “Tale of a Hero,” will draw from the work of forty artists, including Zoltán Frahy, Rishikesh Shah, and Roberto Fusi, and will present a selection of their works in a virtual reality experience. The first show from the new program will be “The Skeleton of a Hero” on April 26. The Toronto-based artist is working with the collaboration of various artists and institutions to create a VR exhibit of the work of twenty-one artists in the United Arab Emirates, including Ahmed Ben Taher, Salahuddin Farman, and Habib Iqi. The show will also include a virtual reality exhibition of the author Kenneth Levey’s work, which will be included in the exhibition “The Future is Not What I Want It to Be.”The exhibition will be curated by Monica Nesbitt, director of the Museum of Contemporary Art Toronto; Tanya and", "The next Biennial should be held in late April or early May.At the height of its popularity, the exhibition attracted over one hundred thousand visitors annually, who were treated to a number of spectacular works by artists ranging from Renzo Piano and Paul Gauguin to Jacob and Gertrude Stein and Paulo Freire. The full list of artists represented in the 2020 exhibition is as follows:Barbara GrazianoSara BenavidesJOOMiNE JohnBenjamin KayserBenitaBailey RindBennie & CarolineBenedict MorleyBette SieversBenson ChatterjeeBianca TaverasBianca ZucchiBianca Zuccchi (Arts, Culture, and Art)Bianca Zuccchi + Laura MaríaMartinsBianca Zuccchi (Art, Art and Design)Bianca Zuccchi + Laura MaríaMartins (Arts, Culture, and Art)Bianca Zuccchi (Art, Art and Design)Bianca Zuccchi (Arts, Culture, and Art)Bianca Zuccchi (Arts, Culture)Bianca Zuccchi (Arts, Culture, Art, and Design)B", "The next Biennial should be held in the spring of 2020. The first double exhibition, “The Other: The Art of Body and the Body Art,” will open at the museum in May 2020. \n\nA triennial of the work of the late Australian artist, theorist, and theorist Peter Atlee, a leading member of contemporary Post-Structuralism, has been launched in Melbourne. Peter Atlee: In the Ground of the Planets (2017–19) was chosen by the Victorian Government as the theme of this year’s Melbourne Biennial. Atlee, whose work often links architecture and landscape, was also a prolific essayist and literary writer. His work is included in the Smithsonian’s “Peter Atlee: Architecture and Landscape” (2019), and is a selection from the forthcoming exhibition “The Architecture of Sleep: The Art of Planting” at the Forum in New York. “Mr. Atlee’s work is foundational to the understanding of the subject of design and the relationship between architecture and the earth,” said arts minister Leon Edelson. “It also resonates with the biennial’s vision of a new kind of biennial", "The next Biennial should be held at the end of September.” The museum is also planning to build its first studio space in the city. The development is part of a larger plan to improve the community around the museum, which exceeds its original goal of 15,000 visitors a year.The plan to renovate the building is part of the $52 million $65 million revitalization plan, which aims to create more than 10,000 jobs in the city. The project will also involve the construction of a new, 24,000-square-foot southwest wing of the museum, which will incorporate a museum and gallery that will showcase the work of visiting artists and will host programming for the public.The new building will also boast of a new 50,000-square-foot rooftop terrace. The new space will be inaugurated by a new exhibition, “Art & Architecture” (2017–18), which will be followed by “In the City of Loaf,” a retrospective of the artist’s first exhibition in the country, curated by Mark Borthwick, and the inaugural “It’s Not the Place,” a joint project between the Biennial of the Arts and the Bienn", "The next Biennial should be held at the Royal College of Art in London in December 2020, followed by a second at the National Museum of London in March 2021. The theme, “Creativity and the Arts,” will be developed by the Oxford-based institution in partnership with the relevant United Kingdom departments. “My brother Michael, a professor of art history at the University of Leeds, and I are huge admirers of the National Museum of Art. We are extremely proud to have contributed to the Museum’s development over the last decade, and look forward to working with the collection and the staff to further the museum’s career-making mission in 2020,” said Maajid Nawaz, chairman of the museum’s board of trustees.\n\n\nThe Los Angeles County Museum of Art (LACMA) has received a gift that will propel its museum through its next major expansion. The $65 million upgrade—which will add more galleries, a theater, and a library—is part of a new $1.5 billion plan to modernize the institution that was unveiled by CEO Klaus Biesenbach and director Matthew Oxtoby in November. “The new LACMA opens up a", "The next Biennial should take place in the spring of 2022. Patricia Otero, the president of the museum, said: “Under the leadership of Marc-Olivier and Valentino, the Museum has continued to grow and engage with the diverse communities of New York. We are excited to see how the new exhibition program will further engage with the communities it serves.”\n\n\nThe Art Institute of Chicago (IAC) is now the latest major arts organization to announce that it is suspending its spring 2019 exhibition season, which was scheduled to kick off on March 15. The announcement follows a statement issued by the institute on March 19, which said that the cancellation of the event was a “mutually agreed upon decision.” The spring 2019 edition of the Biennial, titled “Greater Angels of Paris,” had been scheduled to run from April 13 to April 20 and would have featured 200 works by twenty-five artists. The work of architects, artists, designers, and writers was to be presented by nine artists in the exhibition, which was cofounded by Leonore and Aretha Franklin and moderated by Irvin B. Jenkins. “IAC has been working with the artists to develop greater", "The next Biennial should be held at the Museu de Arte de Madrid in 2021. Why did they choose this next year? Well, the museum has been working on the redesign of the gallery for some time and the forthcoming exhibition will be framed as a continuation of this process. It should be a great opportunity for the public to see what is next for the gallery, which is located in the medieval town of Salerno in the north of Spain. \n\n\nThe Bolshoi and Museum St. Petersburg in Russia have announced that their new joint venture, Bolshoi International Art Museum (BIM), will open on February 21, 2020 in Moscow. Its inaugural exhibition, “Between a Rock and a Hard Place: Rock and a Hard Place” will be curated by the British artist and curator Holly Willoughby and will be open to the public from January 27 to February 28. Joining the collaboration will be an exhibition of work by architect and theorist Andrei Alexandru and an exhibition of works by Ilya Shagalov.Founded in the Soviet city of Nizhniy Novgorod in the northwestern region of Russia in 1979, BIM now has locations in the Moscow region and the city of Novosibirsk in the", "The next Biennial should be held in January 2021. The 2020 edition will consist of twenty-six films, and the 2020 event will be part of a cycle that is now in its eighth year. The twenty-fourth Biennial will be held in April 2021. The 2019 event was selected from a shortlist of entries that included Scorpio, Rutger Hauer, Wangechi Mutu, Jingdong, and David Henry. A selection of twenty-five films will also be presented in 2020, with the option of presenting multiple films in a single year.\n\n\nThe Tate’s board of directors has voted to take over management of the London museum, which was founded in 1953 and is the oldest continuously running arts institution in the UK. It has been a long-standing goal of the Tate to become a national museum. In 2015, President Karen Bradley announced that the institution would become a national cultural hub, and the plan has been implemented in every way possible, from preserving the museum’s collection to moving it to a new location.“Tate is a leading cultural institution in the UK, in the region of the United Kingdom, and internationally,” said Tate director Maria Balshaw", "The next Biennial should be in 2021.  The next will be in 2023. The next will be in 2028. The next will be in 2032. The next will be in 2033. The next will be in 2038. The next will be in 2042. The next will be in 2047. The next will be in 2051. The next will be in 2056. The next will be in 2059. Each of the next two biennials will be twenty years old and will be commissioned by Michael Rosenheim, a former curator of modern and contemporary art at the Museum of Modern Art, and Nancy Spector, a curatorial assistant at the Museum of Modern Art. “We are remarkably improving upon the contemporary sensibility of the late nineteenth century with a sensibility that was rapidly changing in its emotional, intellectual, and spiritual dimensions,” said Rosenheim. The exhibition will feature work by thirty-five artists, including Yoko Ono, Bertrand Russell, Debby Arnold, Cécile B. Oti, and John Anton, and will run from March 25 to April 4,", "The next Biennial should take place at the Museum of Contemporary Art, Miami Beach, from March 31 to April 3, 2020.The next Biennial will be held at the San Francisco Museum of Modern Art, from March 27 to March 31, 2020. The biennial will also mark the opening of a new scholarship series, the biennial History of Art, which will explore the history of art in the United States.\n\n\nThe New York artist and activist Rand Paul is today calling for the impeachment of former President Barack Obama. “We need to begin by calling for his removal from office,” Paul told the Art Newspaper. “A new constitution is needed to protect and expand our civil liberties, but also to create an environment of mutual respect and cooperation.”Paul added that he believes the Obama administration has fostered a climate of fear and animosity toward Russia and is encouraging countries around the world to build closer ties. He suggested that the United States step up to help rebuild the cultural and historical sites damaged by the terrorist attack in Moscow on February 12, 2017, and to invest in Russian culture.\n\n\nThe modernist British artist and educator Richard Linklater has been appointed the next director of the Tate. Linklater will be responsible for reimag", "The next Biennial should be in September 2020.\n\n\nThe Los Angeles County Museum of Art (LACCA) is planning to open two new galleries in 2019. One will be in the city’s Central West End and the other in the Santa Monica Mountains. The new locations will be on the same city block as the existing artist-owned spaces, the Dino and Liza Bass Gallery, which will remain closed through the end of March.LACCA currently has two galleries in the city—the opening of the Dino and Liza Bass Gallery, which will open in 2020, and the opening of the new space for contemporary art, the Gallery for the Arts, the Fall Creators Festival, and the Blue Ribbon Dinner, which is slated to open in 2021. The institution also has four spaces in the city’s Historic Preservation District as well as several artworks in storage, including pieces by artists such as John Akomfrah and Yinka Shonibare.The opening of each new space will involve a series of public performances, a lecture series, and a family-friendly theme park. The new venues will be inaugurated in March and will close in April.The museum will also begin hosting programming from the Los Angeles Festival", "The next Biennial should be held in Tokyo in 2020. The Tokyo Art Museum (Tama) is currently negotiating an extension of its 2020 edition. \n\n\nA group of artists who were banned from the 2018 edition of the Venice Biennale have filed a complaint with the Italian cultural ministry in an attempt to force the country to open its borders to refugees fleeing conflict in Syria. The artists, who are seeking the return of a painting that was stolen by the Syrian government from a refugee camp in Italy on Saturday, allege that the ministry failed to respond to their plea for the exhibition to be rescheduled. The artists have created a new exhibition, “A Real Life Story of Syrian Refugees,” to be staged at the refugee center in the city of Lampedusa, in the Adriatic region of Italy, on March 28.The artists contend that the exhibition was never officially canceled by the Italian government. Instead, the ministry simply informed the artists that it was postponing the exhibition, which would have featured new works by artists whose works were covered by the country’s show “First Light: Art and Artifacts in War and Peace” (2019) and “Latex in the Time of War,” both of which", "The next Biennial should open in 2021.  On a more positive note, the biennial’s director, Pia Camil, said: “The exhibition is a masterpiece. It is everything we hoped it would be. It is an unprecedented journey into the work of many artists. It will take us to new places, and I am confident that with the exhibition’s return to Barcelona in 2021, we will come back together again.” \n\n\nThe National Gallery of Ireland (NGA), in Dublin, has unveiled a new curatorial program, “The Sculptors: The Art of the Sculpture,” that will explore the role of artists in shaping the objects and works in the NGA’s collection across a variety of media. Curated by Kate Middleton and Patricia Arquette, the program will offer students an opportunity to gain an appreciation of the contribution of the National Gallery’s artists to the country.“The programme will consist of a series of lectures that will examine how and why artists created works, how they are treated by collectors and institutions, and what can be learned from their work,” Arquette said. “The programme will introduce the Sc", "The next Biennial should also be a celebration of the life and work of the artist-in-exile, Charles Darwin, who died in 1882. The exhibit will include the biennial’s first exhibition of work by the American artist-in-residence, Theodoros Galinos, and will follow the same format as the inaugural exhibition.\n\n\nThe British artist Chris Project, whose nearly two-decade-long project paintings and installations transformed the course of modern and contemporary art, has died at age ninety-seven.Born in London in 1938, Project began his career as a painter in the late 1940s in order to free his body from the effects of the toxic fallout of the Second World War. The resulting Art and Body project—set in the towns of Dover and Milton Keynes—conceived as a self-portrait in 1970, a portrait in 1978, a full-scale sculptural installation in 1982, a text-based work in 1994, and a retrospective in 2008. In addition to depicting himself as a hostile being of pure organic chemistry, his work can be found in the collections of the British Museum, the Tate, and the London Biennial for Contemporary Art.In a 2017 Artforum interview, Project explained that his", "The next Biennial should focus on integrating art and design, but it could also include “symbolizing the history of art” as well as “engaging with modern and contemporary issues and themes through a social, cultural, and political perspective.”\n\n\nThe Metropolitan Museum of Art (the museum) in New York is planning to open its first public location in the United States, a forty-two,000-square-foot outpost in the Manhattan boroughs, in 2021. The opening will coincide with the opening of the museum’s new three-dimensional sculpture-filled, glass-enclosed, glass-enclosed observation deck, the Exploratorium. The newly opened space will be dedicated to the museum’s permanent collection of more than seventy thousand works of modern art, including works by artists such as James Turrell, Mark di Suvero, and Adam Clayton, as well as the newly added works of Ishigami Satomi, Michael Powell, David Salle, and Robert Vergara.“We are thrilled to open the Exploratorium’s first public location in Harlem to the public for free,” said Daniel H. Weiss, the Met’s director of public engagement and chief", "The next Biennial should take place in 2020, and the first in 2021. It will also host a second edition of the exhibition from 2020 to 2022.\n\n\nThe Museum of Contemporary Art (MoCA) has appointed Miranda Hartigan as its next director. The New York–based curator-at-large will take up the post on August 15.“Miranda has been an integral member of the MCA family since its founding by a group of Los Angeles–based arts professionals in 2000, and has been instrumental in expanding the museum’s collection and exhibitions in recent years,” said MCA’s executive director, Haim Steinberg. “Through her work, she has cultivated MoCA’s reputation as a leading arts institution in the United States. Her successful curating of the critically acclaimed ‘Photographs’ exhibition series in 2015 and 2016 secured her as a finalist for the Oscars award. Her curating of the ’70s blockbuster ‘Eleanor Rigby’ gave MoCA the opportunity to stage the first exhibition devoted to the English contemporary art canon in the United States.”Commenting on her recent appointment, Hartigan said: “I’m", "The next Biennial should be held in 2021.\n\n\nThe Vancouver Art Gallery (VAN) has appointed Kathleen Anderson as its next director, effective immediately. Anderson comes to the institution from the New York Art Department, where she has served as a deputy director and chief curator since 2017. She succeeds Anne-Marie Boudreau, who has served as director of the Vancouver Art Gallery for fourteen years and will begin her new role in January.“Kathleen is a gifted and dedicated curator who has been instrumental in the development of our contemporary art exhibition program,” said Anne-Marie Boudreau. “Her deep knowledge of contemporary art and dedication to cultivating a long-term vision for the museum made her the perfect candidate for the role. We are extremely proud to welcome her to VAN and are hopeful that she will continue to enhance the museum’s collection, program, and exhibitions in a leadership role for the next twenty years.”Anderson is currently the director of the Vancouver Art Gallery, where she has worked since 2008. She was promoted to deputy director in 2016 following Kelly. She succeeded Kelly, who was hired to lead the Vancouver Art Museum in 2018, in July 2019. She succeeded Laura Mulvey, who had served as", "The next Biennial should be held in 2018 and will be organized as follows:In the meantime, the Istanbul Biennial (AB) has announced that it will focus on reinterpreting the history of the twentieth century as a whole. An exhibition of works from the series “The Real History of Modern Turkey” will follow in 2020 and will draw on the work of scholars, politicians, architects, and others with expertise in the field. In a statement, the institution said: “The past is a history of transitions, the history of nations, the history of civilizations, and the history of humankind. . . . And in this vision, we will not focus on the present but on the future.” After the 2019 festival, an exhibition of the last twenty years of the journal Cité des Hautes États was reopened in Paris, and a new book titled Who Stole History? was published.\n\n\nJosée Bénouil and Marta Pech, the architects behind the historic Spanish Modern Art Museum (MAM) in Madrid, have been awarded the Spanish State Prize for their work designing the institution’s modernist facade, which was completed in 1988, in honor of the institution’s", "The next Biennial should be held in 2021.\n\n\nThe Museum of Applied Arts (MAA) in Chicago has received a gift of more than 5,400 works from the Kuchi-Rara Foundation, a Chicago-based nonprofit focused on arts and culture. “The Kuchi-Rara Foundation brought to light the astonishing story of Thomas Kuchi-Rara—a brilliant Chicago sculptor whose work was a genuine breath of fresh air in the art world,” said Linda and Paul Kuchi-Rara. “His sculptures and paintings are timeless and will live on in the imaginations of future generations. We are extremely gratified by the generosity of the Kuchi-Rara Foundation and all of the foundations whose charitable support we have helped to support. We are committed to supporting the Kuchi-Rara Foundation in supporting its future artists and their vision for the Muse’s collection.”The foundation, which is supported by individual donors as well as by a variety of foundations and other organizations, including the National Endowment for the Arts (NEA), the Getty, and the Helen Frankenthaler Foundation, received the artworks from a private collection that included work by Kuchi-Rara from the", "The next Biennial should be held in 2020, according to organizers, although they have not yet announced a date for the event.\n\n\nThe Museum of Fine Arts (MFA) in Atlanta has received a $1 million donation from the   David and Lucille Stetson Foundation. In recognition of their support of the museum’s galleries, the foundation gave the institution $1 million in support of the reopening of the MFA and its grounds. The gift was made in support of a $2 million renovation of the museum, which is slated to open in the spring of 2020. “We are thrilled to receive this generous gift,” said director and CEO Oskar Eustis. “Geneva and I are excited by this gift to the MFA as a way of continuing our work to develop new solutions for our art and to further connect with our audience through exhibitions, education, and outreach. The foundation’s gift also marks a significant milestone in our museum’s history. In the fifty-five years that the museum has been open, it has never closed; the last exhibition was a retrospective of the work of a group that included artists such as Edward Hopper, Claude Monet, and Jean-", "The next Biennial should take place in 2021. The institution is currently preparing for the 2020 edition, which will take place in the city from March 19 to March 21, 2020. The venue will also be transformed once again, with the theme “Social­-Passion,” being reimagined as “Humanity” in the upcoming exhibition “For All Things” (2019), which was organized by the hotel.The renovation of the museum is part of the redevelopment of the region around the city; the exhibition “For All Things” continues the theme of the previous three years\u0097for all human activities\u0097with a new collection of works addressing contemporary issues. The first exhibition, which opened on April 10, 2019, was directed by Martin Pérez-Araya, the founder of the hotel chain Palantir, and his brother, in collaboration with the Museum Frida Kahlo. The second exhibition, which opened on April 18, 2019, was organized by the São Paulo Museum of Modern Art, where the seventy-three-year-old museum director, João Pires, will remain. The third exhibition, which will open on April 22, will explore the history of African art and artmaking", "The next Biennial should be at a location that would be specialized in art, architecture, design and/or performance. And the second at an official institution. The third will be at a public space, such as the Metropolitan Museum of Art. And the last will be at an existing space, such as the Exposition. The show will run from September 3 to September 13, 2020. The first edition, “Anarchy in the Sky,” was held at the Noguchi-Ramos Gallery in Los Angeles on August 28, 2020.The second edition of the show, “Art and the Body” was staged at the Museum of Contemporary Art Exposition in Miami Beach on September 3, 2020. The third edition, “This Is Not a Life,” was held at the New Museum in New York on September 10, 2020.\n\n\nThe Museum of Contemporary Art (MoCA) Los Angeles announced today that it is establishing a new $500,000 fund to support curatorial, digital, and archival work by emerging and established artists working in the arts. The initiative, which was established to promote and support curatorial and visual arts in the city, aims to increase the visibility of", "The next Biennial should be held in the Fall of 2020. We look forward to working with the new and existing teams and communities in New York City to present a truly collaborative and international exhibition.”\n\n\nThe Royal Academy of Arts (RA), London, announced today that it is reopening the Royal Shakespeare Company (RSCo), which was closed indefinitely due to Covid-19 in March, in March 2022. The institution instituted a full refund policy for members who paid full price for their tickets and created a special offer for groups who paid £75 or more.Esther Godfrey, the director of the RA, said: “We are delighted to announce that we will be able to return the RSC to full health in March 2022 and return audiences to the theater. RSC is a deeply respected brand in the United Kingdom and we have been able to secure the full return of our audiences. Our special offer to large groups of people is wholly compatible with the new and improved regional and national engagement that the RA has been doing for the last twelve months.”The announcement marks the first time the RA has reopened a Shakespeare production since March 2022. The institution had been planning to reopen in June but delayed the planned event by a month, from June"]