["The next Biennial should take place in 2021, and the theme should be “Gender Equality,” according to the organizers. The next year will be “The Future of Art: Latin American Art, 1830–1933”, and the next will be “Art and Politics in Chile,” with the theme “International Relations in Chile,” the same year, and the same date. The next edition will be held in Guadalajara, Mexico City, and Santiago de los Angeles. \n\n\nThe Museum of Fine Arts (MFA) in Atlanta has appointed Julián Rivera as its next senior director. Rivera comes to the museum from the Smithsonian-American Art Museum (SAAM), where he has served as chief curator since 2011. He will assume his responsibilities on May 22. Rivera previously served as chief curator of the American Art Museum in Kansas City and as deputy director for collections and exhibitions at Santa Fe Art Museum.“While at SAWM, he was instrumental in the acquisition of several works by artists of Mexican and Latin American descent, including José Álvarez Baraneta, Gustavo Dudamel, and Rita Gonzalez, and was instrumental in the acquisition of works by Pablo Picasso", "The next Biennial should have been in 2020. The reason is simple, the magic of the present: it is hard to imagine a better time to showcase the work of the biennial than now. It is a time of great transformation, of breakage and rebirth. We must be bolder in celebrating the works of the current generation.\n\n\nThe Bienal Cultural Center in Albemarle, France, has received a gift of sixty-three works by celebrated French contemporary artist Pierre-Auguste Renoir from the late American collector Charles Burton. The museum will now display them in a new series called the Burrs’s Curiosities. The works will be on display in the new exhibition “The Bienal Collection: Renoir” at the Bienal until November 21, 2020.“In a time of such great uncertainty, the building of a new culture is an important and difficult task,” said Burton, who passed away on November 9. The artist and collector, who was known for his rich and complex collection, which is divided between New York, Los Angeles, Paris, London, Paris, and Paris-Dakar, made more than 1,400 drawings, paintings, textiles,", "The next Biennial should be held in 2020. The institution has also been suggested for inclusion in the upcoming edition of the Venice Architecture Biennale, which will take place in 2021, and 2017 and 2019 editions of the Venice Architecture Biennale, which will be held in 2021 and 2021, respectively.\n\n\nThe New York City Department of Cultural Affairs (DCLA) announced today the locations of twenty-eight cultural sites that will host official events and performances in the city next year, including the City University of New York, the City College of Technology, the City Museum of Art, the Museum of Modern Art, and the Metropolitan Museum of Art. The sites have been chosen to highlight the diversity of New York City cultural institutions, including the Performing Arts and Design Center, the Museum of Modern Art, and the Bronx Museum of the Arts.“When it comes to celebrating the history of our city, we have a responsibility to listen to and reflect on the vibrancy and vitality of our neighborhoods,” Cuomo said in a statement. “The sites selected reflect the many ways in which New York City is replete with promise and promise of rebirth.”The locations of the twenty-eight sites are as follows: 1. Central", "The next Biennial should be held in Berlin in the spring of 2020, and the first in the autumn of 2021. The organisers informed the German parliament of the reopening of the exhibition in an open letter dated March 7, 2020. The announcement follows the publication of the biennial’s first edition, “The Böhm-Bawerk Collection,” in Berlin on May 14, 2020. The biennial was also included in the twenty-fifth edition of the Böhm-Bawerk Mural, curated by German sculptor Wolfgang Østläger, at the Museum der Moderne in Cologne in March 2019, and the twenty-ninth edition of the Biennial of the City of New York, curated by New York–based curator Joan McNamara, in New York in March 2018.\n\n\nThe Metropolitan Museum of Art (MoA) in New York has launched a new digital initiative that will offer visitors a way to support the museum financially in the event of a major loss of revenue. Called “The Met Visitor Impact Fund,” the program will distribute $500 to individuals living in the city of New York who have made a “significant gift” to the institution in", "The next Biennial should be on the book of Simla, about which the author has said: “I want to present this work to you as a miniature of everything that is new, exciting, and unprecedented in human history.” The exhibition will open on October 8, 2021.\n\n\nThe Metropolitan Museum of Art in New York has appointed Olivia Bailey as its next director. Bailey comes to the institution from the Metropolitan Museum of Art in New York, which she has led since 2014. She succeeds Olivier Messagna, who retired in March 2019 after a decade at the helm of the Met.“Olivia’s new role in the Met will be transformative, both for the museum and for the city,” said the museum’s director Daniel H. Weiss. “Olivier was a seasoned leader and accomplished curator who was admired and respected by his peers and had a clear and compelling vision of how the Met could become a crucial player in the city’s cultural ecosystem. We are grateful for his profound leadership and for continuing to work with him.”Prior to joining the Met, Bailey served as director of the Ebony Museum of Art in Memphis, Tennessee,", "The next Biennial should be held in 2020, when the museum’s current exhibition venue will be moved to the museum’s new building, the Hamilton. The museum is currently undergoing a $250 million renovation, and a new exhibition hall will be added to the existing building, which is slated to open in 2022. The new venue will be named after the architect of the new institution; the current exhibition space will remain a separate museum.The Biennial of Women will be held at the Museum of Contemporary Art (MoCA), Chicago, in 2021. “This marked the first time the Museum of Contemporary Art (MoCA) has offered a biennial to a woman’s-run institution with an outcome other than a prize,” said Cynthia Wilson, chair of the board of trustees and chair of the board of curators at the museum. “We’re excited to be working with Jill and Chicago to further explore and reimagine the possibilities of a biennial.”The inaugural edition of the biennial, which was organized by the Minneapolis-based artist and curator Tanya Bonakdar, will be held at the museum in 2021. The ten-day event will feature twenty-six works by Bonakdar", "The next Biennial should be held in 2021. The exhibition will focus on the development of the theme: “Physical Culture” and will be organized in the same manner as the current event, which is curated by the German curator Lorraine Änderlinck, who has directed the forthcoming exhibition for twenty years. The next iteration of the Biennial, “Mirrors in Space” (2019) will take place in the same venue in 2021.\n\n\nThe Museum of Modern Art (MoMA) in New York announced today that it will begin the process of shutting down its flagship exhibition, “The Gallery,” in the spring of 2021 and return the institution to its parent, the State of New York. The exhibition, which features some two hundred works by contemporary artists, is currently open until October 22 and has been shuttered since March 13.“It is with great regret and disappointment that we announce that we will be shutting down The Gallery in March 2021,” said Alan D. Weiss, the museum’s director. “We are confident that in the coming months and years we will be able to reopen it at a great museum. However, it is our duty to make the most of", "The next Biennial should be held in 2020. The specimen for that exhibition will be unveiled at the Museum in London in 2021.After the exhibition was unveiled in 2017, the institution announced that it was planning to transition to a one-person operation. In an interview with The Guardian, Thomas Bastien, the director of the Biennial, stated that the transition was \"not easy, but it is what we have to do. The biennial is about more than our collection and exhibition. It is about the future of the biennial and of the British exhibition.”\n\n\nThe Museum of Modern Art (MoMA) in New York is preparing to reopen to the public, following a $650 million expansion, on Monday, March 21. The renovation, which added a new courtyard, a new lobby, and a new auditorium, the museum’s current location in the Little Italy neighborhood of Manhattan is undergoing a major facelift. The renovation also added eleven new works by four artists, including the French Canadian artist Emmanuel Léger, who is currently working on a solo exhibition in the museum.“The renovation of MoMA is part of a comprehensive strategy to enhance the museum’s visitor experience for both the new and existing", "The next Biennial should focus on the biennial’s relationship to current events. That includes the Paris Commune, the Black Lives Matter protests in the United States, and the recent unrest in the Middle East. The Biennale will be held in May.\n\n\nIn an attempt to bring a sense of order to exhibitions after the Covid-19 pandemic, the New York Metropolitan Museum of Art (NYMMA) has announced that it is working with the Department of Health and Mental Hygiene (DOH) to establish a weeklong conservation program for major works at the institution, which recently experienced a significant spike in Covid-19 cases following a freak fire at one of its buildings in June. The weeklong program will include a number of activities, including a scavenger hunt and a scavenger hunt lunch for one hundred visitors to the museum, which is currently closed until April 29, and will run from March 26 to March 28. Museum director Daniel H. Weiss said: “This is a crisis we have not faced before and it is our responsibility to respond with care and compassion. I hope that this partnership will provide a springboard for engaging with the complex issues of Covid-19 and the global pandemic", "The next Biennial should be held at the Radical Museums of Art, London, in 2021. \n\n\nThe 2017 Venice Architecture Biennale, which was held in the Italian city of Venice since April 2019, was postponed due to concerns over the coronavirus, and will now be held at an undisclosed location in Northern Italy. The exhibition will now kick off on October 28, 2020. The event will run from March 11 to March 12, 2021.The 2020 edition of the Venice Architecture Biennale, which was organized by the Danish firm Koons, will coincide with the opening of the Danish pavilion at the Fifty-Ninth Venice Architecture Biennale (Ceavor), hosted by the Købenfors Museum in Oslo. The event will kick off with special exhibitions of work by the twenty-six artists who were chosen from a pool of seventy-eight applicants. The artists will be selected by a jury comprising art historian Henrik Carlström, architect and curator Niccolo Prada, and the architect Olafur Eliasson.The art of the exhibition will be curated by architect Thomas Bech, curator Robin White, and Koons’s Nick Jones. In addition, there will be an interactive program of installations,", "The next Biennial should commence as soon as possible and will include a selection of works that incorporate elements from as many local and regional perspectives as possible. We look forward to a full and open discussion of the work during the biennial. \n\n\nThe Masters of Fine Arts (MFA) in the humanities at the University of California, Los Angeles (UCLA), have voted to sever ties with the Israeli Museum of History (IM) in Jerusalem. The move follows the museum’s decision to remove a work by Palestinian artist Walid Raad from its collection last month.UCLA’s board chair, Deborah Kerr, said: “We have long been concerned by the Israeli government’s alleged policy of racial profiling and the museum’s connection to the institution and its complicit complicity in the state’s illegal occupation of East Jerusalem. After considering an abundance of academic and legal options, the board decided that it was in the best interests of the museum and its students and staff to end our association with the institution. We are grateful to all of our colleagues and supporters who have worked so hard to advance this cause and are confident that we are making the right decision.”The institution’s Board of Trustees will meet tomorrow", "The next Biennial should be in 2020 and will be hosted at the Palazzo delle Papesse in Venice, the Garden of Pisa in Milan, and the Palazzo Nazionale in Venice. Its thirty-third edition will be held at the Cannes Film Festival in May and will be part of the fair’s Spring edition.\n\n\nThe Polaroid Sculpture of Human Life, 2004, will be on view at the Larson Institute for Contemporary Art in Santa Monica, California, from March 17–March 21, 2020. The exhibition will also feature an artist retrospective at the Venice Biennale in February 2020 and a new sculpture, part of the “Arts of Life” series (the first half of the exhibition is at the Art Institute of Chicago, April 6–April 14, 2020). The twenty-second Biennial, “The Human Body” at the Museum of Fine Arts in Boston, April 5–April 8, 2020, and “Body Art” at the Kendricks Museum of Art in West Palm Beach, Florida, April 2–April 12, 2020, will be on view simultaneously.The full list of participating artists is as follows:Anselm KieferAnselm", "The next Biennial should open in 2020 and will have the opportunity to expand its collection with new works from the contemporary international movement. However, an announcement on the new exhibition will not be made until the end of 2020, after the biennial’s final edition, “Tomorrow is Tomorrow.”\n\n\nThe Metropolitan Museum of Art in New York has added two new works by American artist Richard Avedon to its collection. The museum will display the artist’s first solo exhibition at the institution since 1992, titled “Richard Avedon: The Art of Painting” (2019), and his first solo exhibition at the museum since 1983, “Richard Avedon: The Art of Drawing.”The artworks were added to the collection in 1981, the same year the museum decided to acquire Richard Avedon’s work, which was acquired for $1,500 in 1986. The Museum has previously displayed Avedon’s work on cards and prints and produced several editions of the artist’s book Modern Painters.Artforum has learned that the seventy-three-year-old American painter, who has been a solo artist since the mid-1950s, was diagnosed with pancreatic cancer in 1987", "The next Biennial should take place in the summer of 2021, and the first exhibition should open in the fall of 2021. The concepts of the next iteration include: the body, creation, medicine, and technology. In a statement, the Art Pimps said: “We are incredibly excited about our new role and the work that we are able to accomplish. The upcoming exhibition, ‘My Body, My Rules,’ will be an exploration of the role of the body in our present-day lives.”\n\n\nThe Smithsonian American Art Museum, in collaboration with the National Council on the Arts (NCA), has created a new four-acre site for the institution in partnership with the nonprofit group Friends of the National Museum of American Art (FNM). The move will allow the museum to expand its collection by nearly three hundred works of American art, which will be housed in the former General Electric building on Montgomery Street in Washington, DC.“The National Museum of American Art is dedicated to American art, and expanding our collection is a great way to give our collection an even greater sense of belonging and community,” said museum director Katherine Guth. “The NCA’s collection is a reflection of the American experience: Art", "The next Biennial should be held in the spring of 2020, and the inaugural exhibition will be held at the Museum of Contemporary Art in Tokyo. The full list of Biennials participating in the 2020 edition is as follows:Group Exhibition: Avant-Garde’s Modernism’s Twenty-fifth BiennialDia Art Museum, BeijingLaundromat Art Museum, BeijingThe exhibition “Systems, Processes, and Categorization” will be on view until November 12 Dia Art Museum, BeijingThe inaugural exhibition “The Sutra Meditation (The Second Part),” will be on view until November 6 Dia Art Museum, BeijingThe exhibition “L.A.X.” will be on view until November 19 Dia Art Museum, BeijingThe exhibition “Gosick Eyes: The Art of Eating in California” will be on view until November 13 Dia Art Museum, Beijing\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Amy S. Heiss as its next director. Heiss comes to the institution from the Los Angeles County Museum of Art, where she has served as director since 2016. Previously, she was the assistant director", "The next Biennial should be held in 2021 and will host seventy artists. The exhibition will feature work by fifty-four international artists and will run for twenty days. The biennial will be hosted in the Biennial Hotel, which is owned by the fair. The next edition of the event will be held at the Minneapolis Art Museum. The 2019 edition of the event drew 350,000 visitors and featured work by forty-two artists. The 2020 event will draw an additional 400,000 visitors.\n\n\nAn effort by the Museum of Fine Arts (MFA) graduate students to help raise funds for the museum in the aftermath of the devastating tornado in Moore, Oklahoma, has failed to garner the support of the institution’s board of directors. According to the New York Times, the graduate students—who staged a protest at the museum on Wednesday night in support of the protesters who are demanding accountability for the museum’s mishandling of the storm—moved the petition over a week ago, on December 17, and received fifty signatures from the students on Sunday, December 21. However, the petition was not presented to the board of trustees until January 7, when it voted to proceed with the exhibition, titled “Tornado: A", "The next Biennial should commence in 2020 and will be divided into four biennials: The Great Exhibition in Art, The Art of Making, The Art of Design, and The Art of Performance. The show will run until November 19. The 2018 exhibit will be curated by Roland Jansaerts, who previously curated the Contemporary Art Biennial (2019), and will focus on sculptural subjects, such as the works of the Danish artist Lars-Erik Abraham and the work of French artist Etienne Savoy—both of whom are currently on display at the Fine Arts Museum Basel in Zurich . In addition, it will include a symposium on performance and performance-based art and its relation to the workaday life of contemporary life. The event will be held in approximately one hundred venues across the United Kingdom and will be supported by the National Lottery Heritage Fund. Commenting on the theme, Andrew Mason, chairman of the National Lottery Heritage Fund, said: “We are hugely excited about this year’s Biennial. We are eager to build on the success of the landmark 2015 Biennial, which featured the first exhibition of work by the full range of artists represented in the UK. More than 120 artists will showcase", "The next Biennial should be held in 2020. The Federation Museum in Toronto is currently working on a new, larger-scale version of the exhibition, which will be held in the city from 2022 to 2022. The next edition of the Forum Biennial, which will be held in Milan in 2022, will also be held at the Museo Bernardo, and will include a new selection of works by twenty-four artists. The next edition of the Biennial de Lille will be held in 2021.\n\n\nThe Los Angeles County Museum of Art (LACMA) has received a gift of eighty photographs by Pablo Picasso, as well as twenty-four rare lithographs from the artist in a multimillion-dollar donation from the Schwartz family, which also owns the Monopol fortune. The works, which were acquired in a gift from the late oil magnate Max Stern and his wife, Rosanne, are the first to be given to the iconic institution in its twenty-fifth year. The museum will soon display them in the exhibition “Pablo Picasso: New Faces,” which opens on October 15.Born in the Bavarian town of Graz, Austria, in 1923, Picasso studied under Otto and Maria Schmidt in", "The next Biennial should be inaugurated by a performance that explores the mainstream and the creative in the year 2100.”\n\n\nArt historian and curator Annie Prouvost, the founder of the experimental art space Alley Art, has died at age fifty-eight in her home in the Bronx. Though she lived and worked in New York from the late 1940s to the early 1950s, Prouvost’s work is celebrated across the globe and is widely collected.Born in Berlin in 1946, Prouvost studied at the Max Beckman Institute, the St. Petersburg Academy of Fine Art, and the Swiss Federal Academy of Fine Art before moving to the United States to study at the Art Institute of Chicago between 1949 and 1951. While in the Midwest, she met and married fellow Berliner Jules and Peter Prouvost, and the couple relocated to Brooklyn. Prouvost left her native city in 1949 to pursue a career in the arts, eventually landing at the workshop space Urban Outfitters, where she would work as a model and eventually become a partner. In 1954, she opened Alley Art, a workshop and exhibition space in the East Village where Fadèdio Ganero, Toccarra, and their", "The next Biennial should be in March 2021. The fourth Biennial, for which the artist will create a new environment for a new species of tree, is scheduled to take place in June 2020. The fifth and final Biennial, for which the city of Abu Dhabi will build a new museum, will take place in October 2021.  Dubai: Artist-led protest against oppressive government crackdowns gains momentum By Sara Khouri and Mark Taiman/Photothek/Algerian Art NewspaperThe following artists have signed an open letter condemning the recent wave of arrests and clashes that took place in the emirate:The artist-led protests against police violence have been ongoing for months, and have been met with widespread condemnation by the authorities, including the United Kingdom, Germany, France, and the US. The UK government called for peaceful protests, while the French president called for the arrest of rioters involved in the clashes.In response to the protests, the authorities in Abu Dhabi issued a statement on March 27 saying that it was committed to working with the protesters to address their legitimate concerns and that it was working with the Royal Commission on the UAE’s image in order to “promote a positive and stable environment for our", "The next Biennial should be in March 2021, and the series should be organized as follows: 1.The Rebirth of Art, 2.The Shift in Perspective, 3.The Action in Art, 4.The Concrete Action, 5.The Art of Transition, 6.Art of Closure, 7.Art of Form, 8.Art of Movement, 9.Art of Power, 10.The Biennial of the Body, 11.Art of Life, 12.Art of Life with God, 13.Art of Life Without God, 14. The Artist 375. Art of Life Without God: The Biennial of the Body, Art of Life Without God: The Biennial of the Body, Art of Life Without God: The Biennial of the Body, Art of Life Without God: The Biennial of the Body, Art of Life Without God: The Biennial of the Body,Art of Life Without God: Art of Life Without God: Art of Life Without God: The Artist 375’s Translation.  The Biennial of the Body: The Biennial of the Body, Art of Life Without God: Art of Life Without God: Art", "The next Biennial should be held in 2020, and the last will be staged in 2024. The seventy-sister of the late artist Sixto Biennale, Rosa del Valle, died last week at the age of ninety-eight.Born in the small town of Porto, Portugal, in 1923, Del Valle studied under Zico in Italy, where he studied under Adolfo Delzotto in Madrid. In 1947, the artist moved to Lisbon, where he met his wife, Antoinette, and their son. The following year, Del Valle moved to Paris, where his wife and son lived for a while before moving back to Lisbon in 1951. In 1963, the artist returned to New York to live with his son Max. Del Valle began a solo career in 1971, but his son Fernando took over the family business in 1988. Del Valle’s work has been collected by the Los Angeles County Museum of Art, the Metropolitan Museum of Art, the Los Angeles County Museum of Art, and other organizations, and his works were included in the Museum of Modern Art’s exhibition “Art in Motion” (2009); the Whitney Museum of American Art’s “The Shape of Things to Come", "The next Biennial should be held in 2022, and the opening of the inaugural edition should take place in 2022. This would give art-makers the opportunity to create new works while preparing for a possible shutdown of the institution. The Biennial of Brazilian Pop will also be moved to the interior, and the Centro de Artística de São Paulo could conceivably be relocated to the capital to the south.Artforum will present a special edition of Inside the Art Show in Dallas in 2020. Nominated for Artforum’s 2020 Hugo and Phillip Guggenheim Award, Eleanor Alters’s new exhibition “Massive Spectacular” will be presented as part of the Fifty-Eighth Venice Biennale in 2020. Chennai Art Gallery has announced its representation of Artsadia, the artist-run nonprofit that runs a series of galleries in New Delhi. The eponymous artist-run organization, which recently celebrated its seventeenth anniversary, was founded in 2015 by Arvind and Lalita Arora, who described its mission as “healing the planet.” The couple first established the nonprofit in India in 2001 after founding a Chinese restaurant in Beijing. The couple had been", "The next Biennial should be held in 2022. The Ooi exhibit will continue on in the same venue until March of 2020.Ooi Gallery is working to secure the lease of a new space in the city center for its next generation of exhibitions. The venue will be inaugurated by a new art exhibition, which will take place in collaboration with the Ooi Museum in the city, as part of the new partnership between the museum and the city of Ooi. The first show in the new space will be “Into the Gutters” by Alex Halperin and Paul Mpagi Sepuya and will be shown concurrently with the newly inaugurated biennial. The show will be organized in collaboration with César M. Farina, who will serve as curator.\n\n\nThe New York Times reports that the Senate passed a $2 trillion aid package on Tuesday that will provide billions of dollars to the United States’ struggling economy. The legislation, which still has to be passed by the House of Representatives, will add $1.2 trillion to the federal debt and raises the eligibility age for Social Security benefits by one year. The bill also extends unemployment benefits for one year and allows Social Security benefits to be increased by an additional $1", "The next Biennial should be held in Zurich, and the first in Nanjing, China. For this year’s edition, ART’s director, Østgård Pedersen, urged artists to work in solidarity with one another in order to combat the current global crisis. The theme of the exhibition, “The Case of the People” was inspired by the story of a young Chinese artist who was detained by the Chinese authorities on charges of stealing a painting by Mao Zedong. Pedersen noted that the indictment was founded on “a very specific set of facts that had nothing to do with the art.” He said that the panelists were “thinking about art, but not about art.” Pedersen described the exhibition as “related to the story of a young artist detained in Shanghai in 1964.” Pedersen explained that the jury would “consider carefully the entire history of the indictment,” while offering a plea for the artist who has been detained since March 22, 2017 for “a very specific set of facts that had nothing to do with the art.”\n\n\nThe Museum of Jewish Heritage in New York has hired Laura Higgins as its new deputy director.", "The next Biennial should be in 2021–18. This year’s edition is being curated by Paul Graham and Rosalind Russell, with Kerstin Brätsch, and will be held at the German Institute for the History of Mythology (DI-MT), Frankfurt am Main. The theme of the exhibition is “The Transformation of the Self: Lacanian Art in the Age of AIDS.”\n\n\nDiana Gabaldy has announced that she will take over as artistic director of the New York Sketch Center (NYSC) next month. Gabaldy comes to the organization from the independent Vilnius Cultural Center, where she has been the director of development since 2015. She succeeds Anna Wintour, who departed in the summer of 2019 to head the Pinnacle Theater Group in New York, and will begin in January.Gabaldy’s first major project will be the redesign of the center’s current structured environment, which is housed in a former coal-electric plant on West Seventy-Third Street, in the spring of 2021. The project will involve the renovation of the building and its surrounding area, which houses the museum, a library, and a theater; the renovation of the building’s", "The next Biennial should open in 2020, the inaugural edition held in March 2019. The 2020 event will be held in the Galerie Arthur Haussmann in Berlin.\n\n\nThe Peabody-Essex Museum in Salem, Massachusetts, has appointed Sylvia Roe as its next executive director. Roe comes to the institution from the Peabody-Essex Museum (PEM) in New London, Massachusetts, where she serves as the president and director of educational and experiential initiatives. “Sylvia is a seasoned leader who has been instrumental in developing the Peabody-Essex Museum’s educational and experiential programs, and has led the museum through one of its most challenging periods,” said Mark Roscoe, managing director of the Peabody-Essex Museum. “Her leadership and ability to translate these programs into a transformative experience for visitors and staff are unparalleled, and we look forward to continuing to work with her to build upon the museum’s legacy of advancing contemporary and experimental art through a robust collection, exhibitions, conservation, and public programming.”Roe will assume her responsibilities on January 26, 2021. In her new role, she will be responsible for the development and execution of", "The next Biennial should take place at the Haus der Kunst in Essen in 2019, and the 20th at the Nationalgalerie in Vienna in 2021. The Prussian Cultural Center in Berlin and the Berlin Art Museum will present the third and final editions of the museum-based exhibition, which will also have an audio-visual experience. The Nationalgalerie is currently constructing a new building to house the collection and exhibition, and the Nationalgalerie Museum is working to create a new center for contemporary art. The National Museum of Modern Art in New York and the Metropolitan Museum of Art in New York have already received funding for new exhibitions, but more funding will be needed to complete the renovations.\n\n\nThe National Galleries of Scotland announced on Monday that it has received a gift of sixty-three works by thirty-six artists from the late British artist Ian Kershaw, who was known for his large-scale, high-concept work, which is often considered a masterpiece of abstraction and futurism. The donation, made by the Paisley Gallery in London, brings the total number of works in the collection to seventy-four.The gift includes works by artists such as Kate Atkins, Ann-Marie Bill, Erich Bachmann", "The next Biennial should be held in 2020.”\n\n\nThe Australian Council of Film, Photo and Video Game Art (ACMFVA) has announced that it has received a gift of fifty-six works by the late artist and activist Rob Fields. One hundred works in all were donated by the renowned Australian industrialist, who was a leading proponent of the VHS format and a key member of the progressive Futurist group the Kinks. The works are currently on display in a new exhibition at the Art Gallery of New South Wales (AGSW), which also hosts a collection of his other works.In recognition of the institution’s patronage, the works will be given a $1 million grant from the Australian Council of Film, Photo and Video Game Art, and will mark the council’s fifty-sixth anniversary. The works will be given to the Gallery of Exhibitions in the Australian National Arts Centre (ANAC) in Canberra and will be unveiled later this year.“Rob was a vital resource for the late great Paul Nash and for the gallery,” said David Main, chair of the museum. “His work has inspired us throughout our lives, and we are grateful for his long-overdue and", "The next Biennial should take place in the spring of 2020 and will include the work of seventy-eight artists from forty-six countries, including the United States, Italy, Spain, Austria, France, Germany, Belgium, Luxembourg, PORTSMOUTH, and the United Kingdom.\n\n\nThe Portland Art Museum and Sculpture Garden (Pam’s) has renewed its contract with the City of Portland through 2021, the Oregonian reports. The announcement marks the first time the museum has renewed a contract with the city since 2007. After weeks of negotiations, the museum and city reached an agreement that will establish a $150,000 fund to compensate Oregonians for lost income from the coronavirus. “For centuries, Portlanders have served as an inspiration for creativity and art worldwide,” said Pam’s director, Christine Anderson. “This new partnership with the city will allow us to continue to support the arts and to grow the museum’s collection, while allowing us to better serve our community.”The installation of the new contract will net the museum $66,500 over the course of five years. Under the terms of the agreement, the City will pay the museum $25", "The next Biennial should be held in 2021 and will be themed “Femininity and the Body” and will be organized under the theme “The Body,” with the first exhibition of the work’s ’50s and the last one “1960s–1980s.”\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Carol Belton director of the fourth edition of the Art of the Party. The event will take place at the museum between January 1 and April 3, 2020 and will comprise four exhibitions, including “Costumes & Stories: The Art of Carol Belton” (January 13), “Carol Belton: The Body” (January 14), and “Carol Belton: The Art of Empty Spaces” (January 16).“I’ve long been inspired by Carol Belton’s work,” said MFA’s director, Paul Côté. “She has been a strong advocate for our show. We will continue to be guided by her in her vision, in her talent and in her ability to translate her philosophy into practice. I’m excited to continue her legacy and elevate her", "The next Biennial should take place in the spring of 2020.All of the participating artists will be invited to submit a retrospective in the spring of 2021. \n\n\nThe Museum of Fine Arts (MFA) in Boston has become the latest arts institution to announce it will shutter its regular hours on March 23 in protest of the March 22 reopening of the Museum of Fine Arts (MFA) in downtown Boston. In a statement issued by the museum on Wednesday, March 22, the staff voiced their disagreement with the official strategy of the decadelong takedown and reconstruction of the museum in an effort to prevent the March 25 opening of the Museum of Modern Art, which was scheduled for March 24–March 26.In a letter addressed to museum chair Carol Dweck, which was published by the museum on Wednesday, March 22, the staff said: “We believe that the closure date of March 23 is an inappropriate time to reopen the MFA. We believe that there are better ways to spend the week than to engage in a meaningful public engagement with an exhibition at the   Museum of Fine Arts in Boston.”The letter concluded with a call for restructure of the art museums’ business models, including a divestiture of holdings in the companies that make", "The next Biennial should take place in 2021. The exhibition will also include the first-ever retrospective of artist Aruwai Glimcher, which will be staged at the artist’s studio in New York in 2020; the first-ever biennial of the International Center for the Production of Modern Art (ICMMA), which will be curated by Alexander Calder on the same campus in 2021; and the first-ever show featuring contemporary artists in a setting similar to the Biennial, but with many of the same themes.The 2019 Arts and Culture Biennial, which was initiated by the institution, selected thirty-nine artists in twenty-four categories in a ceremony held at the institution’s headquarters in New York on October 11. The honors were presented by award-winning curator-historian Susan Sontag, art historian Victor Luck, and curator-activist Daryl Sherman.The 2020 edition of the event will be hosted at the NYU School of Art (SOU), where it will begin on February 18 and conclude with a reception at the NYU Museum of Modern Art on March 10. The event will also mark the tenth anniversary of the Diller Scofidio + Renfro–designed campus, which is currently undergoing a", "The next Biennial should take place in 2021.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, has appointed Kate Mather as its next director. Mather comes to the institution from the Getty, where she has served as chief curator since 2013. In addition to her curating duties, she currently serves as a professor of art history and American art history at the University of Virginia. Mather will assume her new role in January 2021.“Kate is a gifted and dedicated curator whose passion and commitment to art comes from a deeply grounded understanding of the authority, the history and the art of the art,” said curator and vice chair of the Getty, Jeffrey Rosen. “MoCA has been a significant center for her work and has become a favorite destination for those who want to know what contemporary art means for Los Angeles. We are eager to see how this visionary curator will translate into transforming how we think about and experience art.”The new director will have a period of seven years to work through the institution’s restructuring, which has been completed since 2019, and is responsible for overseeing seventy-two artists and collections. The roster also includes the work of thirty-seven artists and collections, collectively worth $82 million, and", "The next Biennial should be held in 2020\n\nThe Massachusetts Institute of Technology (MIT) is working with the W.M. Keck Foundation and the Los Angeles County Museum of Art to organize an exhibition dedicated to the work of American artist Luis Buñuel in 2020. The exhibition will feature work by fifty artists, including Yuki Matsuoka, David C. Driskell, Dario Catellani, James Damore, and David H. Koch, and will take up the theme “Intention, Morality, and the American Imagination.”“Throughout America’s history, artists have worked tirelessly to make their work visible to the public, and still work to this day,” said David Karp, director of the MAP Center for American Art and director of the W.M. Keck Foundation. “American art is vibrant, complex, and full of life, and the subjects of the exhibition will make for a powerful experience for visitors to our institutions.”The exhibition is in association with the W.M. Keck Foundation, which is dedicated to promoting awareness of and research into the art of American art and is supported by a gift from the W.M. Keck Foundation and the", "The next Biennial should be held in 2022. The first was held in 2009 and featured work by twenty-eight artists. \n\n\nAmerican painter George L. James will become the first artist to be featured in the inaugural edition of the Biennial, which will be held at the Smithsonian American Art Museum in Washington, DC, from June 21 to June 27. James will also be the first artist to be featured in the museum’s reopening in 2021. “George is an artist whose practice is equally expansive, deeply rooted, and idiosyncratic,” said Miranda Janiak, chair of the commissioning committee. “This is his seventh year as a participant in the Biennial. He has won numerous awards, including three Bicentennial Awards, three Grand Prix Awards, and three Turner Prize Awards. He has also served on the commissioning panel for the Biennial’s inaugural edition and provides a unique perspective for the museum’s reopening, a retrospective of his work for the first time, and a lecture series for the first time.”James was born in Plainfield, Connecticut, in 1936. He studied at the Pratt Institute and the School of the Art Institute of Chicago before graduating from the Art Institute of", "The next Biennial should take place twenty-four to thirty-six months from now. “This is a major step forward for the promotion of contemporary art in Japan, and something that the government has long sought to encourage,” Miyazaki said. In addition to the Biennial of Art, the government has allocated ¥10 billion ($9.6 million) to make up for the Art of the Future exhibition, and to open a museum dedicated to the art of today. The announcement of the inaugural Fifty-Eighth Biennale of Contemporary Art, titled Art from the Future, was made at a ceremony at the newly renovated Art of the Future at the Koshoka Museum of Art. The exhibition will showcase the new works by sixty-eight artists. \n\n\nThe British artist Thomas Barrau, the pioneer of experimental and color-based sculpture, died on December 21, 2020 at his home in Norwich, England.Born in Brighton in 1943, Barrau studied under the legendary American painter Bruce Gendall at the prestigious London College of Art before moving to the Massachusetts Institute of Technology (MIT) in Cambridge, where he studied with Dorothea Rockburne and Nanda Harrods. After graduating, Barra", "The next Biennial should be held in the spring of 2021.\n\n\nThe Pérez Art Museum Miami (PAMM) has announced its representation of the work of Madeleine Rhodes, a member of the band Unseen\u0097or, as they are known in the United States, as the Sicklebone Gang, whose eclectic and emotionally charged work is often influenced by South American tradition and art from the Pacific Rim.“Madeleine Rhodes and the Sicklebone Gang are the perfect combination of vision and sound to explore new ideas about colour and sound and to push the limits of what sound can be and how art can sound,” said Mark Rowland, director of PAMM. “Her work has been featured in numerous international exhibitions and has been exhibited in major solo and group exhibitions at such venues as the Studio Museum in Harlem, the Contemporary Art Museum Chicago, and the Hammer Museum of Art in Los Angeles.”The artists, whose 2016 performance, “The Night Before My Father,” explored the power of sound and the impact of trauma on the body, was presented at the Pérez Art Museum by artist James A. Fulford, who was awarded a Lifetime Achievement Award at the museum earlier this year.", "The next Biennial should take place in the near future. The Art Newspaper reports that the event will open in April 2020 and will consist of five exhibition spaces that will be located across twenty-seven cities across China.\n\n\nThe Whitney Museum of American Art, New York, has announced plans to remove more than thirty works by twentieth-century African American artists from display at its upcoming exhibition “Rebel Women: Artists in Motion” in May. Titled “Fear and Desire” and co-curated by Amy Sherald and Naima J. Keith, the exhibition will also address issues of representation and the body, and will feature artworks by forty-nine artists, including Tuka Umaña, Agnes Martin, and Evelyn Janes, as well as works by artists who have yet to be included in the 2020 edition.“The 2018 exhibition included twenty works by fifty-eight artists, including Lillian Mitchell, C. L. R. James, and Anna-Sophie St. George,” said Helen B. Whitney, president of the Whitney Museum. “The 2020 show will include works by a range of artists whose work has not yet been presented at the Whitney. It will be an exciting", "The next Biennial should take place in 2020, with the first exhibition being held at the National Museum of Ireland, Dublin, in 2021. The exhibition hall will be relocated from the National Museum of Art, Dublin, to the National Museum of Modern Art, Dublin, and the civic organiser will be given the option to stage the event remotely from the National Gallery of Ireland, Dublin.\n\n\nFilipinos in Hong Kong have blocked thousands of a major pro-democracy protest march by pro-democracy protesters in the city, which is home to significant financial and cultural sites, in an attempt to prevent them from blocking roads and tramlines. The event, which was organized by Hong Kong Federation of Students (HoFS), was scheduled for March 19 and was supposed to culminate in a large pro-democracy rally at the city’s Tsinghua University, which is near Hong Kong’s financial hub and has previously clashed with demonstrators.Organizers said the action was canceled because of the coronavirus outbreak in China, which they said is behind the arrests and crackdowns. “The Hong Kong government is putting the health of many people, including Hong Kong’s own citizens, at risk,” said HoFS president Lai", "The next Biennial should focus on the history of the assemblage process, on the exchange of materials in the workshop, and on the intimacy of the workshop and its participants. The exhibition may also introduce new topics such as the cultural and social geography of the exhibition.   Most recently, the Biennial of New Works has presented works by sixty artists over twenty years. The 2019 event, which was held in Berlin from March 21 to March 22, will be the first in the city since 2003.The Berlin Biennale is supported by the German federal state of Berlin, the state of North Rhine-Westphalia, and the city of Berlin, the state of North Rhine-Westphalia, and the state of Brandenburg. The event will be hosted by the Berlin building Biennale für Bildung und Bildung (BFB), which is currently undergoing a major renovation, and will be led by Joachim Neugroschel, the director of the Berlin Art Museum, and Jorgen Stoschläger, the director of the Brandenburg Pavilion for Contemporary Art. The exhibit will run concurrently with Civil War Mural, the biennial’s inaugural art program.“The company that", "The next Biennial should be held in 2022. \n\n\nThe French Ministry of Culture has published a new set of guidelines for the reopening of the Museum of Modern Art (MoMA) in New York. The document, which outlines the long-term goals of the institution, was released on Wednesday, January 4, and outlines the institution’s plans to reopen in 2020 and what steps it will take to reach its goals.According to the document, the institution hopes to have the building up to capacity by 2020 and then have visitors return to the museum by 2021. It also plans to open a new branch in Paris in 2022.In the United States, the Museum of Modern Art (MoMA) is still assessing the impact of the coronavirus on collections and on its anticipated opening in the spring of 2021. In March, the Museum of Modern Art (MoMA) announced that it expects to reopening by the end of the year, but currently needs to finalize plans to reopen. It is also working on a number of other initiatives, including a new series of lectures and other public events that will address the popularity of artists in the 1960s and 1970s, which will be followed by a reopening of the museum in 2021.The guidelines outline", "The next Biennial should aim to explore the phenomenon of the self-organizing network, which is the root of most of our problems, and should include topics of science fiction, art, technology, and politics. It should also work to develop and define a new set of norms for the exhibition.  The inaugural event was held at the museum in 2003. The 2013 version, titled Drawn Together, was staged by the German post-production company Studio Biennial Büren, which was founded by an unknown artist to raise funds for the institution. The show is currently on view in the biennial’s permanent collection in the Museum of Modern Art, the Museum of Modern Art Frankfurt, and the museum’s collection in the Louvre.\n\n\nThe Museum of Modern Art (MoMA) in New York has endorsed a new feminist curator, Mona Hatoum, whose work explores concepts such as eroticism, postcolonialism, and craft. The museum will present a retrospective of Hatoum’s work, “Tide of the Body,” at the institution in September. The show is part of the exhibit “The Body Art: Feminist Perspectives,” which has presented work by fifty-eight", "The next Biennial should focus on the work of domestic and international artists, whose work is often overlooked in favor of that of well-known European and American artists. The museum should also showcase the work of contemporary artists in a way that does not exclude the European cultural canon. To this end, the museum will establish a new category for the works of ​​unknown or unknown artists. The museum is also planning to present the biennial “L'Asociée indépendante artienne”—a selection of artists from the Chicago area—at the same time that the museum’s collection is being restored. The exhibition will highlight the work of women and minorities in Europe in a way that allows the biennial to be a timely celebration of the first year of the restoration.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has received a gift of nine works by five artists known for their daring collaborations: Peter Hasson (1901–1967), László Krasin (1941–1969), Rineke Dijkstra (1929–1986), and Patricia O’Leary (1929–1994). The works were discovered in a new exhibition that will open at MoMA on January 8.", "The next Biennial should be held in the Spring of 2020. The 2017 edition of the event, which was held in Hong Kong, lasted for only eleven days. Biennial director Harry Hotchkiss said: “The objective of the bio-bazaar is to create a new kind of cultural space, one that is connected to the present through the arts, the social, and other forms of life. We are hopeful that this will be achieved by placing the biennial in the Spring, which will be the perfect time for the exhibition, for the audience, and for the art. The biennial will be a platform for the exhibition of the work of the artists in the exhibition and also for the exhibition of their collaborating works in a different kind of biennial.”\n\n\nNIRIN, the New York–based nonprofit, has announced that it is expanding its work in support of the cultural and academic life of Bangladesh. In partnership with the Dhaka-based nonprofit, NIRIN ABOVE, BIRTH, and BIRTH ABOVE, NIRIN will donate $10 million to eighteen Bangladesh-based academic and cultural organizations as part of its “Birla Projects” program, which", "The next Biennial should be held in 2020, and the selection committee is currently working on a plan for how it will organize the exhibition. According to Artnet, the museum will not be forced to cancel the exhibition. While the museum has since been forced to cancel the event due to the pandemic, the institution anticipates that the disruption will last for only a few weeks.\n\n\nThe Swiss Federal Office for Culture and Innovation (BfA) has issued a new regulation that will require all museums, concert halls, and other public spaces in the country to make significant investments in their emergency response plans. The new regulations, which were drafted by the ministry of culture and international cooperation, outline a number of emergency measures that should be taken by institutions and are aimed at addressing a number of pressing issues, including the global pandemic and the decline in the number of visitors to Switzerland.The new emergency plan will address the following areas:The BfA states that it intends to invest at least EUR 100 billion into museums and cultural sites over the next five years, with an additional EUR 100 billion to be spent over the next ten years. It also anticipates that emergency funding will be needed for venues, facilities, and operations for eighteen months after the plan is implemented. It", "The next Biennial should be staged in 2021.\n\n\nEoin Marr and Ana Mendieta, the architects and curators behind the MARCH-ALAYSIA project, have announced they are working together again. Marr, a New York–based sculptor, and MARDEN.COM, a New York–based gallery, were awarded the prestigious Gold Award in Architecture at the Guangdong Biennale in March, marking the first time they were awarded the prize. The visual arts will always remain the backbone of Marr’s practice, but he hopes the partnership with Cardiff Arts Center (CAC) will continue to shape the artist’s vision for the pavilion.“Eoin and Ana’s work is inseparable from what makes Cardiff relevant and interesting, and what makes us feel at home in this city,” said Marr. “It is a complex relationship between two cultures, both rooted in and inspired by one another but with different histories and histories of their respective worlds.”The pavilion will be situated in the city’s former National Gallery, which is currently undergoing a £8.5 million expansion, and will be composed of an exhibition space and an audience", "The next Biennial should be on the same site as the previous one, and should be open during the months of May and June. It should be a mix of contemporary artists and indigenous artists, and should open with a performance and a reception. The key question is whether the installation will foster an interest in the works of the forthcoming exhibition. Michael Savage, artistic director of the San Francisco Museum of Modern Art, said: “The next Exhibition series will be an extension of the inaugural Biennial in an attempt to create an environment of mutual respect between the artist and the museum. It will also feature more artist-designed works and will be more open to the San Francisco Bay Area and the entire Bay Area region. We are in the process of establishing a new institutional platform where artists can converge to create exhibitions and other programming. The Biennial will live on at the museum through 2020.”\n\n\nThe National Endowment for the Arts (NEA) has announced that it will award $250,000 to the first California–based organization dedicated to the preservation and promotion of the work of American art. The newly formed nonprofit, titled the National Center for American Art Research, will be housed in the Smithsonian’s National Museum of American Art in Washington,", "The next Biennial should have the opportunity to showcase the vitality of the contemporary art world.”The Biennial will take place at the newly renovated and expanded Künstlerhaus in Krefeld, Germany, from March 18 to March 20. The exhibition will offer the first program of “Art and Vandalism” at the museum in over a decade. The first exhibition was curated by the Künstlerhaus’s curator, Thomas J. Smith, and will be hosted by the Kemper Museum. The event will be preceded by the exhibition “Art and Vandalism: Modernization and the Late Vandalism” at the Kunsthalle Basel.The Berlin Art Dealers Federation (BAD) has released its list of exhibitors for the fifth edition of “Art and Vandalism” at the Kunsthalle Basel. The fair will be held at the new venue, the former site of the Kunsthaus, from March 17 to March 19.Among the artists represented are Andreas M. Antoniades, Kirsten Fitzpatrick, Kiki Smith’s first solo show at the gallery in Frankfurt in 2020, and Eric Fischhoff, who will represent Germany at the upcoming Venice", "The next Biennial should be held in 2021.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, has appointed Margaret Pankhurst as its new deputy director and chief curator. She will assume her responsibilities on August 1.“Margaret Pankhurst is a curator, thinker, and organizer whose work has profoundly shaped the field of contemporary art,” said museum director Daniel H. Weiss. “Her ability to foster cross-disciplinary inquiry, foster the history of contemporary art, and foster the development of American art is invaluable to our creative team and our mission. We are grateful for her dedication and tenacity in helping to shape future vision for the Museum of Contemporary Art.” In her new role, Pankhurst will also work closely with the curatorial and development teams assigned to exhibitions, the collections, and the public programs. She will report directly to the director, Luca Arrighi.“We are thrilled that Margaret will join the MoCA team,” said Arrighi. “Her dedication and commitment to curating, research, and exhibition design will ensure that MoCA’s collection of contemporary art, its exhibitions, its exhibitions, and our programs continue to thrive.�", "The next Biennial should focus on how structural and institutional racism, colonial subjugation, and neoliberal economic policies have contributed to the continuing existence of a colonial-driven, racist, settler-colonial system in Central and South America. The exhibition should explore the ways in which contemporary issues such as climate change and racism are addressed at the highest levels of Brazilian society. The exhibition should also examine how contemporary artworks and practices have a moral and a political dimension that is grounded in the existence of a people. The exhibition should be a space for dialogue with indigenous artists and activists; an opportunity to reflect and re-create our own histories through art; and a way for Brazilians to connect with and share their stories. We are currently working on creating an interactive tour of the exhibition to coincide with the opening of the Biennale, which will be held in the Brazilian city of São Paulo.A full list of the 2020 winners is as follows:ArtsPrizeGrand PrizeWinnerArtsPrize·2019: Selected Written and Performed by BraziliansArtsPrize·2018: Selected Written and Performed by BraziliansArtsPrize·2017: Selected Written and Performed by BraziliansArtsPrize·2017: Selected Written and", "The next Biennial should be held in 2021. The exhibition will be hosted by the Museum of Contemporary Art (MCA), New York, and will take up the theme “How Does the Body Reproduce Art?” The 2020 theme is “Love and Death: From the Body of a Dead Woman to that of a Dead Man.”\n\n\nThe Hong Kong Museum of Art (HKMO) has announced that it will reopen on August 28 following a major renovation that includes the installation of a twenty-four-carat crystal glass installation, “The Ribbon,” by Kengo Matsumoto, that premiered at the Hong Kong Biennale in June 2020.“The renovation brings the Kahler-Petron Gallery-Hong Kong region’s curated exhibition to life in a new, contemporary and intimate way,” said HKMO director Haroon Mirza. “The new exhibition hall, an interdisciplinary, interdisciplinary space, was conceived as an extension of the Kahler-Petron Gallery’s existing collection. My team and I have created a path for the collection to present the full range of its international programme, which is currently housed in a separate building in Hangzhou.”The exhibition", "The next Biennial should be held sometime in 2020. “I have long believed in the power of art and am committed to keeping the best of what art has to offer for future generations,” said Mark Warner, president of the Cooper-Hewitt, New York–based Society of Art Historians. “I always felt that if the museum was going to survive the ravages of the pandemic, it needed an artist-in-residence to stay connected to the collection and to keep the work on display. This is a wonderful opportunity to continue to be a creative partner and to create new dialogue with the collection and the public.” The current exhibition, “Theorem in Detail: Critical Art in the Nineteenth Century” was organized by the Institute for Contemporary Art (ICA) in collaboration with the artist-in-residence, Hiromi Noguchi. The exhibition comprises work by twenty-four artists: Alighiero Bocchino, Daniel Bell, Jean-Luc Godin, Leonor Delport, Franz Nöthling, Miuccia Prada, and María Berrío.\n\n\nThe first exhibition of Alexander Calder’s work at the Museum of Modern Art", "The next Biennial should be held at the vernacular art space in Marina del Rey, California, in 2021. “Even though the show is not a traditional art exhibition, it will still be oriented around the artist, the artist collective, and the artist’s practice,” said Laura Mulvey, chair of the vernacular and new media department at the Los Angeles County Museum of Art and director of the Pasadena Art Museum. \n\n\nThe Metropolitan Museum of Art (M.M.A.), the Museum of Modern Art (MoMA), and the Fraunhofer Institut für die fränkischen Kunststländer (Institut für die Frükische Kunst) in Munich have agreed to donate $9.3 million to the German community to support a grant program to facilitate the return of artworks and artifacts to Germany following the devastating explosion of an industrial nuclear power plant in Fukushima, Japan, on March 11, 2011. “The museum and the institute have been committed to supporting the art of the Fukushima area since we opened in 1986, and continue to be so today,” said Michael Govan, director of M.M", "The next Biennial should take place in 2020 to mark the twenty-fifth anniversary of the institution’s founding.<|endoftext|>The 2016-17 season saw the first major loss of life in the conflict in eastern Ukraine, marking the second year in a row the region has been without a major event. On Sunday, February 16, the conflict ended when the Ukrainian parliament voted to establish a so-called federal system of government, which will include a new federal administration. The move followed months of protests against President Viktor Yanukovych, who fled the country after he was deposed in February.While the new government is expected to take several months to implement its initial pledge, it has since been accused of violating the agreement signed in February, which placed restrictions on the self-proclaimed Donetsk People’s Republic (DNR) and banned the formation of a new political party until the conflict is resolved. “The situation in eastern Ukraine has become extremely difficult,” said Oleksandr Turchynov, chairman of the European Parliament’s international affairs committee. “The Parliament and the Council of Europe have called for an immediate ceasefire, and we believe that the ceasefire will be effective only when the belligerents stop firing.”Yanukovych has refused to", "The next Biennial should serve as a time for reflection on the significance of the current moment, a time for reflection about our place in the world and how it should be organized and presented. “The actual creation of the exhibition is a labour of love, an act of passion and a project of long-term thinking,” said Kazuko Yoshida, president of the Biennale Los Angeles and a cochair of the 2018 edition. The 2018 show, “The Play is Over: The Biennial of Play in America” curated by Matthew Jacobs, began on February 25 and ran through March 3. The 2019 show, “The Future is Present: The Biennial of Future Present” will commence on April 11 and will run through April 19. Both shows will be at Rockefeller Center, which is home to the museum until April 22.\n\n\nThe Italian Museum of Fine Arts (Flamenco) in Florence has appointed Roberto Cicutto as its next director. The appointment was made two weeks ago and was made without the institution’s board of directors’ approval. Cicutto will take up his new post on April 12.“The appointment was made with the intention of drawing attention to the progress", "The next Biennial should be held in 2022. According to a release, it will take place at the Museo de Arte Contemporáneo in Barcelona and will aim to “explore the activities of the Catalan artists in a visual way, supporting the development of an appreciation of the Catalan cultural heritage, its development and the Catalan people.”The final edition of the exhibition, “Pedramodice” will be held at the Museo de Arte Contemporáneo in Barcelona later this year and will feature works by forty-six artists, including Adriana Alves, Hélio Alves, Ana Lópezára, Sala Araújo, and Jordi Cáceres.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has released the list of seventy-five artists who will participate in the first edition of the Los Angeles Biennials, “Los Angeles: A Biennial.”The event, which will include a number of presentations by artists, will run from March 14 to March 16. The full list of participating artists is as follows:GERALD BERGERDA, Los Angeles: Artists Guild, 2016“J", "The next Biennial should be held in 2020.\n\n\nThe United Kingdom’s Department for Culture, Media and Sport (CMS), which has been criticised for failing to address climate change, announced on Monday that it is planning to slash the budget of its arts and culture departments by one-third. According to The Guardian, the funding cuts will disproportionately affect the arts.Cuts were made to the arts and culture department’s budget by over £1 billion, which is roughly equivalent to 17 percent of its annual funding. The Arts Council England (ACEE), which represents arts organizations, announced the major cuts in a statement to the National Arts Council, which represents arts professionals, on April 8. The department will also be reorganized to reduce staff costs and to streamline its operations, and its funding will be redirected toward accelerating the transition to a low-carbon future.According to the Guardian, the arts and culture department receives funding from two sources: the UK’s Department for Culture, Media and Sport (CMS), which is responsible for running the country’s public museums, and the European Regional Fund (ERF), which supports UK-based arts and cultural institutions. The fund also supports particular UK museums,", "The next Biennial should be held in December 2021. The first edition, which was staged at the Art Institute of Chicago from January 20, 2019 to January 22, 2020, was won by American artist Ashley Graham.The theme for the second edition of the biennial was “Justice and the New South.” The next iteration of the museum will be staged at the historic Blackstone Hotel in Harlem from March 21 to March 27, 2020.\n\n\nThe Institute of Contemporary Art (ICA) in the City of New York has welcomed four new members to its board of trustees. Their appointments will come as a relief to the board, which was reeling last week following the devastating explosion and fire of an ICA exhibition at the former site of the World Trade Center in New York on September 11, 2015. The explosion, which injured some thirty people, caused the collapse of several buildings, including the former headquarters of the New Arts and Artists’ Union (NAAU), and the former home of the Metropolitan Museum of Art.The board voted to add the artist-led organization, which works in partnership with artists, to its board of trustees in November. The four new trustees are sculptor-turned-activist-collector Adam D. Weinberg", "The next Biennial should be held in the near future.  As the art world continues to develop and as the exhibition space becomes more crowded and as the demand for exhibitions and for retail increases, the museum will have to respond. It has already allocated ten million euros for the next edition, and it will increase the allocation for future editions by 10 percent. The board of curators from the exhibition will publish a statement on Friday evening in order to let the public know what the next Biennial will look like. \n\n\nThe Museum of Arts and Design (MAD) in New York has appointed Tyler Huckaby as its next executive director. Huckaby comes to the museum from the Solomon R. Guggenheim Museum, where he has served as the deputy director and chief curator since July 2019. He succeeds Ted Kennedy, who is retiring this month at the end of his term.Huckaby succeeded David Kors, who departed in the summer of 2019 to head the United Kingdom’s Tate Modern, where he has served as chief curator since April 2020. He succeeds Kenneth Seidenberg, who announced in September 2019 that he would be stepping down from the role in February.“Tyler is a prodigious curator who has been instrumental in transforming", "The next Biennial should focus on the history of the exhibition from the perspective of the participants, and will unveil its first assignment next month.”The annual event, which was started in 1979 by the late Italian architect Federico Fusi and continues to this day, has produced more than forty-five million works, most of which are unavailable to the public, and has drawn many thousands of curious visitors to Rome. Among the works that are currently on display at the landmark are The Precious Stone; Caravaggio’s The Aventine, which was featured in the Italian pavilion at the Venice Biennale in 2003; and The Work of Manly the Elder, a work that dates to the late 1400s that is currently at the Museo delle Papesse in Florence.\n\n\nThe Royal Academy of Arts (RA) in London announced today that the Royal Shakespeare Company (RSC) will stage a major new Royal Shakespeare Company production of Richard II—the first time the play has been staged by a corporation outside of the United Kingdom—at the Tate in Liverpool. The show will be titled Richard II, and will take place on September 20 and run until November 16. The production was conceived as a collaboration between", "The next Biennial should be held in 2020, Nairobi-born, and will showcase the work of seventy artists. In addition to the themes of the exhibition, the museum will also organize production projects with local artists such as the controversial “Death of a Dream,” a performance series that was staged at the Grand Mosque in Abuja in 2016, and “Infinity Medley: A Biennial of Contemporary Art,” a new exhibition that will also feature the work of sixty artists.\n\n\nThe thirty-third edition of the Venice Biennale, which took place at the Palazzo Scuoletto in Venice from February 22 to February 25, 2019, has announced the participants, who are hoping to focus on a single theme throughout the years of the biennial, and the themes of its fifty-fifth edition, which will be held in the city of Milan, in late March or early April 2020.The fifty-six participating artists will choose from a shortlist of twenty-nine artists who are nominated by a pool of fifteen artists that includes Leonardo Bonetti, Alfred Koons, Holly Holm, Maria Inonar, Tanya and Alejandra Cipollett", "The next Biennial should therefore focus on the artist’s work in its entirety. “The project of the exhibition of the work is not to be attributed, but the institution is a participant, directly or indirectly, in the exhibition of a work, in order to retain its artistic integrity,” the museum wrote in a letter to the public. The museum was also concerned with the future of the twenty-six-foot-long work, which was installed in the museum eight years ago, as well as the exhibition of the work. The venue said it hopes the exhibition will help “understand the essential role of the work in the ongoing artistic dialogue, and how its materiality, form, and formative role in culture can play a decisive role in shaping the past, the future, and the present.”The six-thousand-piece, bronze sculpture by Elzbieta Dalluzová is currently on display in the museum’s newly created Dalluzova Gallery. The work, which was created with a team of twenty artists and seven architects between 1986 and 1993, features an anthropomorphic female figure that derives her power from the sun and her energy from bronze. The work also includes a bronze sculpture of a", "The next Biennial should take place in the spring of 2021. \n\n\nThe Pennsylvania Academy of the Fine Arts (PAFA) in Philadelphia and the American Academy of Arts (AA) in New York have entered a tentative agreement on the reorganization of the national arts and cultural landscape. The deal—made in a meeting chaired by Acting Director Joseph A. Galluzzo and approved by Christie’s CEO Christine Niebuhr—creates a new structure for the AA and accelerates the announcement of its next year’s show, which will be held at the newly renovated Museum of Arts and Design (MAAD) in New York City.“The framework for a new partnership between PAFA and AA is being provided to us by the trustees of the PAFA, along with our partner organization, the AA, which has been in discussion with our regional board of trustees for some time about the potential for the upcoming exhibition season to be very successful and provide a strong platform for the work of artists and organizations in both organizations,” said Jennifer Fitzgerald, chair of the board of trustees of both organizations.The new partnership—which will launch in 2020 and run through 2022—is the first of its kind between two US arts institutions, and", "The next Biennial should take place in the city in 2022. The next edition will be themed “UnIVERSITY,” and will be hosted by the Museum of Contemporary Art (MCA), New York.\n\n\nIn a move that will likely be seen as a reversal of David Kordansky’s earlier comments that the contemporary art world is “not what we grew up with,” the Diller Scofidio + Renfro–designed Museum of Contemporary Art (MoCA) in Los Angeles has appointed Carolyn Rinder, the former executive director of the Metropolitan Museum of Art, as its next director. Rinder will take the helm of the museum, which was founded by Kordansky and David Kordansky’s father in 1976, on April 3.“After extensive internal discussions, we decided that Carolyn was the person who best aligned with the mission and vision of MoCA and who has the most potential to achieve our long-term goals,” Kordansky said in a statement. “What she will bring to the institution is pure passion, intelligence, and creativity.”Born in Richmond, Virginia, in 1980, Rinder, who previously served as the founding director of the Hirsh", "The next Biennial should be held in the spring of 2021.<|endoftext|>Listeners at the New School, New York, heard a new, more ambient, rendition of Robert Rauschenberg’s tetraaturist work, The Triad (1942), by David Gordon Green, in the new Whitney Biennial, which opened to the public on Monday, May 28. The work, which was created on the rooftop of the former site of the New York Public Library, is considered one of the most important works in the history of cinema\u0097the lone work by the artist within the confines of the city, the Metropolitan Museum of Art, and the Metropolitan Opera House.“This is the most extraordinary work I have ever seen,” David Alexander, the biennial’s senior curator and the founder of the New School, told the Art Newspaper. “It’s a triptych, a three-dimensional sculpture made of three things: a man, a tree, and a sky. It’s the most plausible of all his triptychs and was created in less than three years. The fact that he created it in the summer is extraordinary. The view of the Hudson Valley from the rooftop, which was illuminated", "The next Biennial should be held in 2020. The exact date of the next exhibition will be decided on a local basis. For a full list of the participating artists, click here.\n\n\nThe University of the Arts (UWA) in Melbourne has released the list of thirty-two artists who were invited to participate in the 2020 Australian pavilion at the Venice Biennale. The artists will be honored at a special exhibition of the university at the Museums Victoria and the Artspace at the end of February.The artists are: Matthew Booth, Eleanor Black, Tanya Cooper, Sara Jane, Pamela Anderson, Lévy Gorvy, Daniel Barenboim, Jean-François Bourrien, Minga Gebrem, Léonie Molesworth, Laurie McClellan, Tanya Oosterhuijsen, Kei Roonen, Léonie Winter, Jacques Wolter, Kota Takemoto, and Karin Wesse, all of the Western Australian Museum.“This year’s pavilion is a tribute to the resiliency and creativity of", "The next Biennial should have a total of twenty-eight artists and should take place in the city, on the nineteenth of February and be inaugurated by Sadao and Hayato Ai. The exhibition will also be hosted by the museum and will include two new works by Ai and Sadao. As part of the initiative “More than a Night,” Ai will paint in the moonlight and Hayato will depict in the night. The inaugural exhibition, “Theater of the Body: Modern Art and the Body in Space” (2017–18), was organized by Tadao Fusaku, which was founded by Gaku Tatsu, a former director of the Japanese National Museum who served as deputy director of the museum until 2019. The ten works on display will be inspired by the contemporary art movements of the 1950s and ’60s, as well as by the artist’s own personal experiences. The exhibition will also include a new song by the award-winning Japanese composer Toshio Horikawa. \n\n\nAston Martin has announced that it will cease production of the Aston Martin DB5, the luxury car that was one of the first vehicles designed by the British car company to reach the", "The next Biennial should welcome the public in 2020. The Paris-based nonprofit, the Chess Foundation, has also agreed to organize a biennial of art and architecture in 2020 that will take place in the city of Exposition Park, in the city of Kiasma, in the city of Miyazaki, in the city of Koukotama, in the city of Kassel, and in the city of Palma de Mallorca in the state of Pernambuco, in southern Spain, and will present it in conjunction with the fifth edition of the Axis Mundi, to be held in 2022. The Grand Prix de Florence will also host a new triennial, curated by the artist and curator Ramon Fernández, in 2022.\n\n\nThe Museum of Contemporary Art (MoCA) in New York and the Richard Prince Foundation announced today that the Ernest R. Hutton International Center for Art and Art History (IRAC) will receive $4.7 million in support of the restoration of its historic glass-enclosed building on West Twenty-Fourth Street in Manhattan. The donation will also allow the center to redesign its exterior to enhance views of Central Park and the Hudson Yards redevelopment, as well as the city’s", "The next Biennial should receive some twenty artists from India, including artist Ram Krishna Menon, who is currently organizing the first exhibition of his work; Kapoor Kann, who is currently working on the exhibition of his work at the Kohn Gallery in New Delhi; and Prakriti Dutta, who is also working on a Biennial for “Sensuality” at the San Francisco Museum of Modern Art. “We are thrilled to be working with these artists, and especially with their work in this medium,” said Haroon Mirza, president and CEO of the Biennial. “As a global community, we should be celebrating the richness of the arts as a way to move beyond borders and divide cultural heritage. With their work, they have created new possibilities and new ways for us to hear and appreciate art.”As a professional photographer, Dutta often uses the medium to create images that engage with topics of identity, migration, and history. While working on a series for the Malaysia pavilion at the Venice Biennale in 2019, Dutta photographs the returnees from the former Portuguese colonies of Madeira and Benin from Lisbon, the Portuguese capital, to their homes in the countries of Portugal", "The next Biennial should be held in the winter of 2019–20. \n\n\nThe National Gallery of Canada (NGA) in Ottawa has appointed Carolyn Schade as its new deputy director. Schade comes to the institution from the W.W.A.P., the American Anthropological Institute (W.A.P.) in Atlanta, where she has served as director since 2015.“Carolyn brings with her extensive experience and knowledge of contemporary art from a broad range of sources to form the NGA,” said NGA director Yvonne Eyde. “Her background includes in-depth study of the art of the American South and the West, as well as the art of the Americas; she is also a scholar of European art and its connection to Indigenous knowledge, art, and history; and she is committed to the promotion of Indigenous knowledge and art.”Schade will assume her responsibilities in September. During her tenure, she will be responsible for ensuring the long-term protection of the NGA’s historic building and is expected to spearhead its new partnership with the W.W.A.P.’s new organization, the W.A.P. Indigenous Art Initiative.According to Lou", "The next Biennial should aim to address the local contexts within which contemporary art is produced and shared, the display of which will be a topic of the next edition. It is hoped that this will be a time for reflection on the interrelationship between modern art and the environment, and the relationship between art and society.”\n\n\nThe Museum of Modern Art (MoMA) in New York has removed eighteen works from its collection in an effort to stop the spread of Covid-19, The New York Times reports. The works were extracted from the institution’s holdings in an attempt to remove the virus from its buildings and to prevent the spread of the virus in New York City.Calls for MoMA to release the works were made in May 2019, when the virus first emerged in the United States, and in September 2020, when the museum was forced to close. However, the museum attorney argued that the collection should be returned since it had been closed for nineteen days before the museum was shut down for seventy-eight hours due to the coronavirus.“We have been working closely with the trustees of MoMA over the last eighteen months to determine the best ways to safeguard our collections and their collections for future generations,” Michael Sel", "The next Biennial should be released in December 2020. The presentation of the first edition of the Biennial, “Inaugurating the Future,” will be held at the Museum of Modern Art (MoMA) in New York from February 16 to February 19, 2021. The exhibition will be organized in three stages: first, as a group show, tracking the development of the exhibition through the years; second, as a solo show, focusing on one artist; and third, as an encyclopedic work, spanning from one artist to the next, which will eventually encompass all Biennial’s works. “The next Biennial will open with a performance of an original, always inspired work by an artist whose artistic practice is at once playful and uncompromising, boundless in ambition but tempered by a sense of restraint,” said curator Adam D. Weinberg. “But the most important work of the exhibition will never be the performance of the work itself—it will be the work of the artist of the Biennial, whose work will define the exhibition. It will be the work of these twenty-five artists who have created an exhibition that redefines the modernist avant-garde, who has never been", "The next Biennial should be held in 2021, as the ten year anniversary of the event is this year. The opening of the new exhibition will be on October 15, 2020. \n\n\nThe Metropolitan Museum of Art in New York has offered $25 million to the heirs of British industrialist George and Alice Pickering, who were close to Marilyn Monroe, wrote a letter to their descendants, who included a request for $15 million. The money would go toward settling scores that had been resolved through litigation.The letters were addressed to the late collector George Prince and Alice Pickering of the “Papaya Group,” which encompassed the Papaya Group of Companies (Papaya Oil, Saudi Aramco, BAE Systems, British Petroleum, and British Petroleum New Zealand) and “Diesel,” in an attempt to settle scores between the family. The letters were published in a retrospective of the Pickering’s’s career titled The Pickering Archives, artistspace.com reports. The letter was addressed to both the late and the family’s son and his grandson, George Prince. The letter was signed by Alice Pickering’s son Richard", "The next Biennial should be held at least six months from the date of this letter, and should take place in the first year of the new contract, which is to run from September 2021 to March 2024.The decision to extend the term was made during a meeting of the Cabinet of Ministers chaired by Prime Minister Haider Ali Artashawy, who established the new institution in March 2016.The new biennial will consist of twenty-five exhibitions arranged by theme, with the largest shows celebrating the life and work of the artist-in-residence, the Kenyans, and with the curators depicting the themes of the biennial as diverse as 'supernatural worlds and the natural, the eternal, the impermanent, the passive in time, and the active in movement.”The forty-fifth Biennial of the Grand Duchy of Cornwall, which will be held in September 2021, is currently on hold as the government attempts to reduce the number of its exhibitions. The Royal Shakespeare Company, which is currently staging a three-month production of Julius Caesar at the National Portrait Gallery in London, announced on October 31 that it will suspend its London production, which is scheduled to run November 4 – November 7. The National Galleries of Scotland (", "The next Biennial should be held in the coming months. The story of the biennial will be told by the artists who participated in the exhibition—as well as by the artists whose explorations of the medium led them to create their works in the first place—through a series of lectures, workshops and residencies that will take place across the city, as well as in the San Francisco Bay Area. The theme of the inaugural event is “Telling Stories.”\n\n\nAfter nine months of being a part of the Los Angeles–based nonprofit Artadia, which aims to support and promote artists in Los Angeles County, a new organization, Artadia Now, was launched in April. The nonprofit was founded by Artadia board president Marc Glimcher and artist Laura Owens, who was hired by the nonprofit to spearhead the nonprofit’s efforts in support of artists.Glimcher, who previously served as director of New York’s Museum of Modern Art, was hired to oversee the organization’s relationship with the Los Angeles County Museum of Art (LACMA), which has been a longtime supporter of the arts. The institution commissioned a new mural by Owens, “Gentle Giant” from the artist’s 2015 installation", "The next Biennial should take place in the Fall of 2021. It will be curated by Brenda Ahler, director of the Museum of Contemporary Art Berlin, and will be held at an undisclosed location in the city of Frankfurt.The biennial will feature works by around thirty artists, including Manfred Kallmann, Juergen Teller, and Ed Ruscha; and will be presented in conjunction with the exhibition “Forget What You Know,” which was curated by Dorothea Rockburne. The show, which was on view until September 2018, was dedicated to the work of Leonor Caro, Marion Ganz, and Ursula von Rydingsvard.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has received a huge gift from Chinese billionaire Li Ka-shing. The Tadao Ando–designed museum, which serves as the home of the Museum of Contemporary Art in China (MoCA), has received an additional $10 million from his American wife, Linda. The funds come from their sale of shares in the Chinese conglomerate, which has more than $50 billion of assets in the United States.According to the New York Times, the couple sold their shares at a clip of $10 per", "The next Biennial should focus on the economic and social impact of the pandemic on migrant communities and on how arts and cultural activities can contribute to social cohesion and resilience. The final event should focus on the legacy of the late designer and philanthropist László Nemes, whose design businesses were based in the US and Europe. The organization will hold its next edition in Zurich in March 2021.\n\n\nThe sixth edition of the Düsseldorf Architecture Biennale, “Düsseldorf Architecture + Design” (DAC), has announced that it is no longer planning on holding the event, which was originally slated to take place April 19–April 23. Instead, organizers are planning to move it to a new location in the city, the Potsdamer Straße, which will be inaugurated by the exhibition “Düsseldorf Architecture + Design: Design as a Response,” which will include work by forty-nine artists. The event will also be moved to a new exhibition space, the Düsseldorfische Kunstverein, which has been transformed into a floor plan of the city.“Düsseldorf Architecture + Design has become an institution", "The next Biennial should take place in 2020, and the biennial’s 2018 edition, “The Fall of Rome,” was staged in London. This year’s event, which celebrated the fall of Rome and the fall of the Roman Empire, kicked off on Wednesday, August 14 and runs until Sunday, August 20.\n\n\nThe Portsmouth Museum in the United Kingdom has appointed Rebecca Wright as its new director. Wright will officially take the helm of the institution on July 22. She succeeds Kate Fowle, who has helmed the museum since 2015, and will begin her tenure in the new location in August.“Sarah Sandall’s award-winning exhibition “Ports of the World,” which ran at the museum from 2016 to 2017, and “Made in Rome,” which explored the association between the city and the Italian town of Venice, which was founded in 1250, respectively, have been restored and are currently on display in a new exhibition at the museum. In addition, a new collection of artefacts from the city’s ancient port, its maritime industry, and its port of Bognor Regis, is now on display.Sandall’s work, which is", "The next Biennial should focus on the history and philosophy of crafts, focusing on the craft of music, art, architecture, and design.The jury, comprising Arts Council vice chair and CNA Roberto Cicutto, said: “The choice of the Biennial for its twenty-fifth edition was not easy. We were faced with a dilemma: to continue the work of the institution, which had been at the center of global creative life and had been transformed by a series of spectacular and extraordinarily talented exhibitions, exhibitions, and residencies, but at the same time we were faced with the task of maintaining Biennial as an institution that existed in the long term. We have taken a number of decisive decisions that will strengthen the Biennial for the future. We are not afraid to put our hands in the air and see what new possibilities for the institution might arise. We are not afraid of the bold vision of the organizer Christo, who is today selecting the next artists and designers for the Biennial. It is our ambition to create an event that will reflect the spirit of the Biennial in 2020.”\n\n\nThe Make-Out Sessions, a free event that connects people who are diagnosed with cancer and their caregivers with special programs, arts", "The next Biennial should be held at the Museum of Modern Art in New York, but the dates have not yet been decided. \n\n\nThe Royal Academy of Arts in London announced today that it will postpone the 2019 edition of the Royal Academy of Arts (RA) in protest of the British government’s decision to leave the European Union. The event will now be held in 2021.“We deeply regret that the RA’s biennial will not take place in 2021,” reads an open letter from the academy’s president, Christopher Le Brun, to the government, submitted by the academy’s former director, Iain Cromwell. “The biennial will be a celebration of the extraordinary achievements of the RA. Throughout its twenty-year history, it has not only produced a record number of exhibitions but has also created new and critically engaging works which are the basis for an innovative and compelling exhibition program.”The letter continues: “We believe that the best way forward for the RA is to remain within the European Union, at least until the end of March 2021, as a token of our collective commitment to Europe’s interests. At that point the RA will have demonstrated its ability to use its major international", "The next Biennial should focus on “Living in the Future,” a transnational field that hopes to connect serious contemporary theoretical thought with the people and places it will explore. The exhibition will include works by sixty artists, including Alberto Bara, Maya Lin, Manal Javed, and Eliza Schapiro, as well as a selection from the artist’s previous projects\u0097Herb Alpert’s “Diana Al-Hadid: the Al-Hadid,” 1987–2004, and “Sara Cwynar: Ideomode,” 2004–present.The 2019 exhibition will be held at the Los Angeles County Museum of Art (LACMA) from March 17 to March 22. This year’s event will be inaugurated by a solo exhibition featuring work by twenty-six contemporary artists, including Denys Newcombe, Jean-Michel Basquiat, Jonathan Butler, and Stephen Coe. The 2019 Biennial will also introduce a new series of “prize projects” that will draw from the Biennial’s collection of works from the 1970s through the 2020s. The first installment of the series, “30 Years of Painting", "The next Biennial should be on March 27 at the Olympiad in Athens. Although the total cost of the event is expected to be around $8 million, the production of the exhibition is expected to cost $42 million. The exhibition will have a theme of the artist’s position in his career. The exhibition will include a selection of his works dating from the 1930s to the 1970s. It will also be organized as a three-day event, and will be inaugurated by an exhibition of the artist’s works created in the city of Oaxaca.The new locations for the festival are the Oaxaca Museum of Art, and the Museo de Arte Contemporáneo Arteseca de Oaxaca, in collaboration with the Oaxacan Cultural Center. Inaugurating the third Biennial of Art, the Oaxacan Museum of Art is planning to build an exhibition of the artist’s work. The construction of the pavilion is being supervised by the architect, Milt Dalby.The 2016 edition of the show was organized by the architect-collector Mario Mavica. The exhibition, titled “The Structure of a Complex,” will showcase", "The next Biennial should be staged at the Thirteenth Biennial in the City of Mumbai in 2022, to be attended by an audience comprising senior and emerging film professionals from the city. Nirmal Kaur, the secretary of the Save Gallery Arts Association (SGVA), said: “The Thirteenth Biennial will include an exhibition of the work of twenty-six Indian directors, including S.N.K. Gabbard, S.N. Krishnamurthy, N.S. Gadd, S.N. Naidu, A.J. Joshi, M.F. Rajput, and K.R.R. Chandrasekhar. Its selection committee will comprise S.A.B.N.R. (Sourav Ganguly), A.K. Chandrasekhar, P.S.M. Chandrasekhar, J.P.S. Chandrasekhar, A.J. Joshi, B.K.P. Chandrasekhar, and A.K. Chandrasekhar.”\n\n\nThe Chicago-based artist Judson Barlow has been awarded a $6.5 million MacArthur Fellowship, which will support his work The", "The next Biennial should also feature extensive research on the exhibition’s legacy, and the exhibition’s relevance in the contemporary art world. The exhibition will also focus on themes that have been experienced through the exhibition, such as the exhibition’s history of human rights abuses and the exhibition’s central role in the international fight against the opioid crisis.The first Biennial of the Contemporary Art Museum (CAM) was established in Seoul in 2007 with a grant from the American artists and activists Charles and David Geffen. In 2012, it received a $2.5 million and a half-year extension to the 2020 edition, which was organized by the Tokyo Metropolitan Museum of Art, and was awarded the 2020 Design Biennial award. In 2017, it was chosen as the theme of the 70th Seoul Art and Design Exhibition (SMA), and in 2018, it was selected as the theme of the 70th Tokyo Art and Design Exhibition (SMA70). In 2020, the exhibition will be hosted by the Museum of Contemporary Art Seoul and will be organized as part of the biennial’s 2020 theme.\n\n\nJorge Luis Borges, the Mexican painter whose surrealist paintings often depicted erotic images, violent experiences, and dreams, has", "The next Biennial should be held in 2021–18.The biennial will be a continuation of the exhibition “The Giving of Death,” which will take place at the Museum of Contemporary Art Los Angeles (LA MoCA) between May 27 and May 29. The exhibition will also include an exhibition of works by artists who have never been on an American continent, and will be inaugurated by a public art installation that will take place in the Museum’s courtyard on Saturday, May 21. The biennial will run for eight months.During the exhibition, cultural historian, curator, and artist Lawrence Abuja will serve as the exhibition’s first curator. The exhibition will also introduce the Biennial’s first permanent installation in the museum and will be staged at various locations with the installation of works by artists and other curators. The show will inaugurate the museum’s first season of programming on the HBO show Game of Thrones, which is based in the United Kingdom. Wegmans will stage the first show dedicated to the artist-designed Modernist furniture, the Javadie & Paula Collection, and will present a collection of work by Laura Owens, whose work incorporates wearable art with works on paper.\n\n\nThe 19th", "The next Biennial should take place in 2020 and will reveal the programme’s theme, “Within, Beyond, & Beyond the Future,” and will focus on issues such as the emergent state of ideas, the importance of art, and the limits of what a human being can do. \n\n\nThe Ontario Museum of Fine Arts (OMFA) in Ontario, Canada, recently received a donation of 161 works from artist and philanthropist René Magritte, who passed away last September. The gift includes works by artists Timur Bekti, Filippo Cattelani, and Arne Glimcher, among others, as well as fifteen finds made in the former König-Bauhaus building in Schaumburg, Germany, which houses the museum’s collection of more than 1,600 works.The museum confirmed that the works are from Magritte’s collection and that they have passed through various stages of preservation, including being stored in glass cases for fifty years at the König-Bauhaus in Germany and in an acid-free state for fifty years in the institution’s basement. “The museum is aware of the importance of this work and is working closely with", "The next Biennial should be held in 2020.\n\n\nContemporary Art Museum Houston (CAMH) has received over $7 million from the Corporate Giving Initiative to fund its expansion, renovation, and expansion in the last six years. The gift includes $3 million for the construction of the museum’s new venue, which will be constructed in the former factory space of J.C. Penney, and $3.5 million for the acquisition of works by the artists.“This is a tremendous year to support my artists and to expand the scope of CAMH’s mission,” said Joseph Musgrave, director of CAMH. “CAMH is a model for excellence in the art-world for its commitment to supporting artists and weaving contemporary art into everyday life. I’m grateful for these gifts, and look forward to working with the artists and our dedicated staff to further this innovative model of presenting art.”Since 2010, the museum has been a center for the collection, research, and exhibition of works by a collection of five decades of artists, including Jean-Michel Basquiat, Carlos Castaneda, MOS Architects, Lévy Gorvy, and Billie Tsien", "The next Biennial should be held in the spring of 2021. The theme of the event is “Contemporary Art in the Age of Trump,” and the theme of the pavilion is “Art and the Future of the World.” The inaugural exhibition, “Moonwalkers: Art in Motion” (2018), showcased work by thirty-three artists, including Richard Learoyd, Agustín Arruda, Nari Ward, and Cristina Valois, as well as a selection of short films, including Manuel Pérez-Orozco’s “Geschichte des entszeitigen” (2013), from the artist’s collection, and Timur S.A. Guarani’s “Fashion: A History of Fashion” (2017). The biennial will also present “Avant-Garde Interventions” (2018), which will focus on the history of art and design with a view to the future of architecture and design. During the exhibition’s run, the Biennale will feature a retrospective of the work of forty-one artists, including Piet Mondrian, Martha Venters, and Yinka", "The next Biennial should take place in 2020 to coincide with the centenary of the founding of the European Community.  \n\n\nThe Solveig Museum in Vienna, which will host the first exhibition of new works by artist Katerina Eder and partner with the Rubell Foundation in Berlin in the first exhibition of new work by artist Felix Günther in Vienna, has announced that it has received a gift of twenty-three works from the artist\u0097including two works from her new series called Soft Place and The Adventures of John and Mary.The works are part of a series of works that are part of a wider project of the Rubell Foundation to present works by international artists in the city of Vienna, which is located in the city of Austria and is about sixty miles from the city of Bern, in Switzerland\u0097from August 3 to August 5, 2020. The artist’s works are now on display in the new exhibition “The Rubell Legacy” in the Netherlands, which opens on September 14, at the Rubell Foundation in Amsterdam. The show will also be shown in the new exhibition “The Rubell Foundation in BERLIN” at the Bode Museum in Vienna in November 2020, and in the new exhibition", "The next Biennial should be in 2021, but the date is currently unconfirmed. Spencer has also been working on a new picture for the museum, which will be themed “Between Worlds” and will be curated by Blaine Harden, a curator and artist best known for his work on the Barbé and Joaquín Picasso biennial. It will be on view in 2022.\n\n\nThe art historian Kihir Murthy, who was appointed as the director of the National Gallery in London last month over a dispute over a painting by Pablo Picasso, has resigned amid a campaign to oust him from the post. His replacement, Charlotte Edwards, has stated that she does not believe that “painting is more important, more intrinsically good, more sacred, more poetic, or more enduring.”In the latest attempt to remove Murthy from his post, a group calling themselves the Alternative Right Wing coalition published an open letter on Wednesday, February 18, in the Guardian. In it, the group argues that Murthy’s resignation is “not surprising, given the attacks on artists and the attacks on freedom of speech.”“It is a sad day when the director of the National Gallery, a man who", "The next Biennial should be held at the Palais de Tokyo in Paris in 2022, and the institution will begin hosting exhibits in 2020.  The program has received an enthusiastic response from critics, who praise the exhibition for its originality, experimentation, and installation.  One critic even wrote an open letter to the institution that praised the exhibition’s curatorial team for their professionalism and excellence.  Artist-owner Gilles de Kooning said the exhibition’s overall purpose is to engage with the 1967 East-West conflict through an “open-ended project.”\n\n\nThe Institute of Contemporary Arts (ICA) at the University of Oxford has received a $10m donation from the estate of the late British artist and educator Richard Avedon. The £7.5m gift, which was made by his daughter, Londrina Avedon, will allow the institute to continue employing Richard Avedon as its director.Liam Neeson, Richard Avedon’s son, said: “This gift is an enormous contribution to the Institute of Contemporary Arts, which has been working tirelessly to secure the future of the Richard Avedon Collection as an important asset for the museum. This new", "The next Biennial should take place in 2023, and the original date of 2022.The fifty-five-year-old museum, located in the Tangle of Arts in Lower Manhattan, is being held up as an example of cultural continuity through a renaissance wrought by design: the museum houses many of the collection items from the later works, as well as works by contemporary artists who have yet to be exhibited.The Tangle of Arts, which was conceived in 1979 as the brainchild of the late New York City–based architect Edward DeMarco, is hosting of a series of exhibitions that will engage with the legacy of MFA’s earliest trustee, Charles Ewing. The contemporary art museum has continued to host exhibitions of work by artists such as Ed Ruscha (2019), Garth James Martin (2019), Francisco Mago (2019), and Julian Schnabel (2019). The exhibition “Landscape in the Sky,” is being staged at the Tangle of Arts until June 29. Organizers are predicting that the program will draw an additional 80,000 visitors to the museum.“We are very excited to be introducing the 2018 exhibition to the public,” said Joshua Cohen, the current chair of the board of trustees of the T", "The next Biennial should take place in the autumn of 2020. The fourth Biennial will be held in the spring of 2021.The fourth Biennial will be staged in the autumn of 2021, and will be presented by the New Delhi-based contemporary art museum, Guggenheim Museum, in collaboration with the contemporary art works of K. T. Mohan Sharma, Uday Chaudhari, K. K. Nair, L. L. R Khan, and others. The festival will be hosted at the Guggenheim from March 22–March 23.The theme of the Biennial is “The Present,” a direct response to the current political situation in India. “We are in the process of developing a theory of the future,” said Guggenheim curator and director Anupam Giri. “The future is here, it is alive, and it is inextricably linked to our own existence. The dialogue with exhibition organizers is our responsibility.”Giri also commented on the possibility of a Vijay Mallya–led event, the first in India to be held in an English-speaking city, but he cautioned, “It’s a long journey,”", "The next Biennial should be, for the first time, a participatory venture, conceived as an extension of the festival’s annual March/April event. The event will still comprise the interviews of fifty-one artists and will continue to showcase the work of the half-dozen artists who are participating in this year’s exhibition. “The next edition of Biennial London will be an exciting and dynamic platform for contemporary art,” said Stephen de Lint, the Festival’s director. The 2015 edition featured twenty-five artists and was held at the Palace of Westminster.\n\n\nThe Museum of Fine Arts (MFA) in Boston has received a gift of twenty-six works by the artist Jack Coltridge. The donation, which was made in partnership with the artist’s estate, included five works on paper created between 1651 and 1650, as well as four paintings from the same period, a late 17th-century watercolor, a Renaissance engraving, and a painting by a contemporary of Coltridge’s called Anselm and Amalia (obviously the artist’s daughter).“Coltridge was quite literally an artist of paper,” James B.", "The next Biennial should be held in 2021, in conjunction with the centenary of the outbreak of World War One. By then, the disease should have died down, and then the warring factions of the Weimar Republic should have ceased to exist. But, as Hitler said, the outbreak of the Third Reich was a 'last resort.” With the outbreak of the second World War, from May 1, 1939 to September 11, 1941, Germany was plunged into a brutal and protracted occupation. The country was forced to build more than sixty thousand barracks for its military and civilian populations, and it also set about transforming the country, through the systematic dismantling of its industrial base. The political climate then changed dramatically. In a November 1941 letter to Joseph Goebbels, the head of the party, the Nazis declared their intent to establish a “state of nature” in Germany, one which would be “autonomous, self-governing, and administered by the people” and which would “never again be destroyed by a war.” In the same month, the Nazis arrested an estimated one hundred, mostly young, men in the Rhineland, whom they believed were participating in a “collective suicide.�", "The next Biennial should take place in 2021. The exhibition will be held at the Museo de Artes Plásticas in Madrid. The Biennial will be curated by artist-in-residence María Berrada, curator of pumice at the Museum of Archaeology, Madrid, and museum director Elena Serrano. “It is a great honour to present this exhibition at the museum in the capital of Spain, which has an important role in promoting and celebrating the great artists of the twentieth century,” said biennial director Ignacio Losch. “My colleagues and I are very proud to work with such a distinguished museum, and I am confident that we will achieve the full, high-quality results.” \n\n\nThe Song of Solomon: The Ancient and Modern Art in America, presented by the Solomon R. Guggenheim Museum, will present David H. Gish retrospective of the artist’s artworks at the Museum of Modern Art in 2021. The show will feature twenty-seven works by Gish, who graduated from New York University in 1972, including twenty-six works in the series “Gish-Morley” (1973–74), a collection of paintings", "The next Biennial should be convened in 2022. The current edition, titled “Art and Life in the 19th Century,” was organized by the Smithsonian American Art Museum in Washington, DC.\n\n\nThe Seattle Art Museum (SAM) is launching a new digital platform, Art and the Future, that will aim to engage with issues such as climate change, sustainability, and land use through a series of live events and curated exhibitions that will take place online. The platform will be hosted by the university-based nonprofit the Seattle Institute of Arts (SEIA), which was founded by the Seattle School of Art’s Kimerly-Olathe School of Design in 2019 and is currently in construction.The Seattle Art Museum (SAM) has partnered with the private nonprofit the Seattle Tenants Union (SAM’s TU), which represents renters, to stage two art-related events this spring. The first, “Earthworks,” will examine the impact of artworks on urban life, and will include a community mural by the artist Tunga Tamimi in its first half. The second exhibition, “Advancements in the Art of Sustainable Motion,” will present different designs and materials in an attempt to address", "The next Biennial should focus on how to use the new capabilities of the museum to take advantage of the region’s strengths and to address socio-cultural, political, and economic issues that affect our communities, and should aim to produce a program that reflects the spirit and spirit of the 2015 edition.”\n\nThe China Museum of Fine Arts (CMAFA) in Beijing has received a gift of around 1,500 works from the National Gallery of Art. Over the course of a decade, the institution amassed a collection of more than 3,000 works by 140 artists and collectives, including artists such as Sun Yat-sen (1905–1984), Yayoi Kusama (1923–2009), and Yee I-Won (1923–2010).The gift includes a number of works by artists living in the Chinese capital, as well as works by artists from Southeast Asian countries such as Cambodia and Thailand, and incorporates works by artists from Hong Kong and Taiwan.The collection includes works by artists such as Liu Shiyu, Wang Jie, Zhang Jie, and Zhao Yue, and includes works by artists from Hong Kong, Taiwan, and mainland China.In addition to the works, the gift includes a work by artist", "The next Biennial should be held in 2022. \n\n\nThe Turner Prize, which honors creativity in the arts, has awarded a lifetime achievement award to the late British director Jo Stevens for his contribution to the visual arts. The prize was established in 1992 as a result of Steven’s New York–based nonprofit, the Center for Visual Arts (CVA), which promoted the work of British artists in the United States and abroad.Born in London in 1937, Stevens immigrated to the United States in 1951 and settled in New York City. In the 1960s he established his own company, the catalogue company Centraecom, which distributed catalogues by Richard Avedon, Pierre Cardin, and Alphonse Egan. In the 1980s, he moved to Los Angeles, where he began directing the CVA’s visual arts programs, which stretched from 1979 to 1988.In 1992, the jury awarded Stevens the Turner Prize, which was presented by British director Guy Ritchie. He was awarded the award in July 2018, the festivities of which took place the last weekend of January 11–16.The Turner Prize jury noted that Stevens’s art had been featured in “a number of masterpieces, including Petronas’s", "The next Biennial should be held at the Centre Pompidou in Paris in 2022.\n\n\nMore than 1,500 artists and designers have endorsed the open letter published by a group of cultural figures in the United Kingdom on August 6, urging the government to set up a national fund for creative production. The letter, which was addressed to David Cameron, the former leader of the UK, and Princess Anne, the former queen mother of the United Kingdom, argues that the UK’s cultural sector is suffering because it does not have the resources to protect or promote the cultural assets of historical and contemporary artists.The open letter, signed by Nicole Halsall, Kate Hales, Jane Archibald, Emily Hall, and Angela Pilling, demands that the UK establish a “national creative production fund” that will “provide immediate and long-term support for artists and creative workers across the United Kingdom.”The letter was written by ten curators, including Mona Hatoum, Sabine Groh, and Gisèle Freund, and was addressed to the Queen and Prince Philip; the Culture Secretary, Oliver Dowden; and director general Maria Balshaw.“The current cultural and economic climate is not ideal", "The next Biennial should take place in October 2020 and will feature the work of twenty artists living and working in the Bay Area. Among the artists selected for the exhibition are Adriel Amenta, Yael Arad, Jane Panetta, Rania Bruguera, and Lauren Burkitt.\n\n\nArt and art history museum directors in Russia and Ukraine are taking steps to prevent the further spread of Covid-19 and other new infectious diseases into the former Soviet republics. Two months after the World Health Organization (WHO) declared the global epidemic over, the governments of both countries announced measures that may slow the rapid spread of the virus.On March 22, the Russian government officially banned the import of all non-essential foodstuffs and manufactured goods, including furniture and vehicles, and large-scale events; the country also began setting up a public health emergency plan. On Tuesday, the authorities in Kiev also began restricting travel and blocking international students from leaving the country, and on Thursday, the authorities in the capital declared a state of emergency. On Friday, Prime Minister Arseniy Yatsenyuk signed an emergency bill giving the government the authority to remove or imprison people suspected of violating the country’s strict anti-terror laws.On Saturday,", "The next Biennial should focus on the cultural and artistic legacy of a particular group of artists: Alexander Calder, Joan Miró, and Pierre-Auguste Renoir. The theme should be “The formation of a new society.” A total of twenty-four artists are currently represented in the competition, which was organized by the nonprofit Arts & the Creative Economy. Exhibitions will take place in the autumn of 2020.The selection committee was chaired by Anna-Marie Degenhardt, a curator and researcher who focuses especially on the history of art in Germany and Scandinavian countries. Since the consortium is led by the director of the University of Gothenburg, Helene Hultén, the finalists will be announced in the coming weeks.\n\n\nThe Ann and Robert Ferman Gallery in New York announced today that Joseph and Susan Ferman have been named the next patriarch of the Grand Rapids Museum of Art. The announcement follows a yearlong investigation that began after the couple donated $10 million to the museum and its annual $50,000 prize in 2014.The museum announced the winners of its two main prizes—Joseph, who received the $75,000 grand prize in December 2015, and Susan, who was recognized for her $65,000 work in", "The next Biennial should be held in 2020, once the new biennial, “The Future of Medicine,” has been approved by the Association of the New York Academy of Sciences (AAS). The organization will decide whether to begin the event in 2021.\n\n\nThe Künstlerhaus Berlin (Kobe) is planning to open an outpost in the city in 2020. The institution, which has a permanent exhibition space in the former Künstlerhaus building in Kreuzberg, will be a collaboration between architects Heinz-Christian Künstler (Künstlerhaus) and Johannes Kepler (Künstlerhaus). The project was inspired by a proposal for a “modernist” museum in Kassel from the southern German city of Baden-Baden in 2015. The idea was to build an exhibition space that would prepare the public for the redevelopment of the original Künstlerhaus, which was founded in 1926 by Heinrich Künstler in the Kreuzberg suburb of Bregenz.Helsinki’s Riga-based architect, Ulla and Christos Tsai, has been selected to redesign the Künstler", "The next Biennial should be held in 2021-20. Taiwan will stage its first exhibition of work by artists from Africa and the US in 2020. The twentieth Taipei Biennale will take place in 2022. The twenty-ninth will be held in 2023. The twenty-eighth will be held in 2024. The twenty-fifth will be held in 2027. The twenty-sixtieth will take place in 2030. The twenty-ninth Biennial will be held in 2032.The twenty-fourth will be held in 2036. The twenty-third will be held in 2039.The twenty-seventh will be held in 2052. The twenty-sixth will be staged in 2054.\n\n\nThe Metropolitan Museum of Art in New York has hired artist and educator David Salle as its new deputy director for collections and exhibitions. Salle comes to the museum from the Metropolitan Museum of Art in New York, where he has served as the chief curator of contemporary art since 2013. He succeeds Valerie Solot, who retired in July 2019 after eleven years.“We are thrilled to welcome David to the Met,” said Met director Daniel H. Weiss.", "The next Biennial should be held at the König-Stiftung in Berlin in 2022. The museum’s director, Ulla and Wolfgang Schäfer, has stated that the institution will not move forward with the show until the insolvency of the Königs-Stiftung is clarified.In a letter dated June 1, Schäfer wrote: “I can’t begin to tell you how much I want to return to Berlin and to the Königs-Stiftung. But we also need to take into account the fact that the show is in a delicate period. The series ‘Art and Death’ is currently on indefinite hiatus. The gallery is working towards a new exhibition that will open next month. At the same time, the artist’s residency at the Königs-Stiftung will continue. This will allow the gallery to focus exclusively on this particular artist. We hope that this will be enough for the gallery to decide that it no longer wants to proceed with the show.”Soon after the letter was published, the exhibition was canceled. Schäfer told Gewalt he regretted not having gone to the June 12 showing that was scheduled, but claimed that he was", "The next Biennial should also mark the centenary of the fight against fascism; the contemporary art movement; and the contribution of Italian intellectuals and artists to the progressive cause of human rights and democracy.\n\n\nThe National Endowment for the Arts (NEA) announced on October 18 that it is planning to withhold more than $2 billion in aid to the arts in the coming years as part of its Measures to Strengthen the Strengths and to Stimulate the Decline (MESB) program.“The arts are essential to American society and, in turn, to the fabric of this country,” said Kaywin Mitchell, the director of the NEA. “As we work to rebuild the American dream for future generations, arts and culture are central to building on the strength of our communities and the history of our nation. We will not stop fighting for the arts until they are supported more fully by the federal government and more fully by the American people.”MESB will prioritise the arts and cultural workers who are most in need of support and will consider applications from individuals who are most in need of assistance, such as those working in low-wage, temporary, and adjunct positions. The agency will also", "The next Biennial should be called “Primacy of Pain” and will consist of forty works, all in four formats: an exhibition-based experience, a narrative/exhibition-based experience, and a project-based experience. The exhibition will have a direct connection to the events of the past and will feature works of the artists participating.“The work of painters has always been a matter of the most general kind,” the show’s architect, Guadalupe Rosales, told the Art Newspaper. “In this new era, painters are once more at the center of a crisis: the crisis of our lives and of the world.” Rosales said that the theme for the exhibition will be “How do we cope with the loss of life and the destruction of the world.” The exhibition will be curated by a committee consisting of Rosales, Maren Balsom, Paolo Barbieri, and Ziba Dzaidi, and will open on March 24.\n\n\nThe Art Museums Zone in Sydney has announced that the 2020 edition of the Australian Bookfair will run from March 23 to March 26. The fair’s exhibitors include the New Museum,", "The next Biennial should focus on combining music, visual arts, and performance to advance the theory of rhythm in an attempt to re-embrace a future that is more connected with our reality and with the materiality of our world.  The Art of Life series could also include a commemoration of the 150th anniversary of the death of the Russian revolutionary Vladimir Lenin. In a recent interview with the German newspaper Frankfurter Allgemeine Zeitung, Lukashenko cited the history of the museum’s collaboration with the communist regime in Russia as one of its intellectual and political inspirations. The role of the museum in re-establishing the full and equal franchise for artistic and cultural producers in the country is an existential task for a country that is struggling to overcome its longest economic crisis since the collapse of the Soviet Union.The question of whether the upcoming exhibition will address the current struggles of artists is being debated by the local art-world community. According to Artnet, the upcoming exhibition will likely consist of a mix of historical reconstructions of the 1916-1918 Russian revolution, which is likely to be accompanied by a commemoration of the centenary of the 1917 Russian Revolution, and performances and short films that reflect the political and social", "The next Biennial should take place in 2020.\n\n\nArt and Culture in American Art, 2019. Courtesy of the artist and Pacific Standard Time. \n       \n\n\n\n\nThe Cannon Museum of Art in New York has appointed Dana Pape as its next president and CEO. She succeeds Jocelyn Gentry, who retired on January 3 after a decade at the helm of the institution.“Dana Pape brings extensive experience and vision to the Cannon for her leadership in transforming the museum from a middle-aged institution into a global leader in modern art, and we look forward to her continuing to lead our diverse community and our exhibition-driven program as she directs the museum through its next chapter,” said Cannon director Emily Uden. During her tenure at the museum, Pape guided the museum through a $70 million expansion, the reopening of Antietam Battlefield in 2018. She also oversaw the transition of leadership from Alexandra Kahn, who was promoted to president in March 2019, to Lynda Barry, who left the institution to head the Manhattan–based nonprofit Museum of the City of New York in October 2020.Pape was hired from the Los Angeles County Museum of Art, where she had served as deputy director", "The next Biennial should take place in the city in 2022. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has announced that it has received a gift of more than one hundred works by Pierre-Auguste Renoir from the artist’s estate in a private sale that will be held at the institution in December 2020. The works, which belong to the artist’s son, Pierre-Auguste Renoir Jr., and will be exhibited in a retrospective exhibition that will be organized by the artist in his hometown of Montreuil-le-Tel, in the Seine-Saint-Denis, until January 3, 2021.According to a statement by the institution, the sale was made in an auction held at the artist’s home in Beverly Hills on November 27, 2019 and the sale was part of a “long-term program of philanthropy dedicated to supporting MoCA’s mission. . . . I’m thrilled to be able to return the art to the artist and his family.”The works, which were purchased by the family from the artist’s estate, include works by Renoir and his son, the artist’s third son, Alexander Renoir.", "The next Biennial should take place in the first quarter of the year 2021. The ten-day event will take place at the Rockhardt Center in Berlin and will feature works by forty artists from twenty-two countries and territories. It will also be held in conjunction with the German and international art fairs Basel and Berlin-Berlin Bessarstern and will open on May 14. The premiere event in Berlin is currently slated for May 26–June 3. The Grand Prix d'Art Treville will be held at the Grand Salon in the city from May 22–May 25. The upcoming event in Geneva is set for May 5–May 8. The Art Newspaper reports that the next edition of the Art Basel Hong Kong will be held in the city from May 25–May 28. The New Art Event will be held at the Art Biennale in Hong Kong from May 28–May 29.The next edition of the Art Berlin will be held in March 2022. The first edition of the Art Zurich will take place in March 2022. The next edition of the Art Berlin will be held at the Art Biennale in April 2022. The Art Paris will be held in April 2022. The next edition", "The next Biennial should take place in 2021.\n\n\nThe Solomon R. Guggenheim Museum in New York has appointed Meredith Kidd-Johnson as its next executive director. She succeeds Susie Adler, who departed the institution in August 2019 to join the New Museum, and will take up the post in September.“Meredith is an extraordinary talent and has demonstrated an immediate and strong commitment to the museum and our mission,” said Michael Presley, the director and chief curator of the museum. “She will be crucial to the museum’s continued success and development as we continue to expand and reimagine the role of the Guggenheim and contribute to the broader public conversation around the world through innovative exhibitions, public programming, and commissions.”Adler’s departure marked the end of an era at the Guggenheim, which was formed in 1923 by a group of cultural entrepreneurs including Rudolf Senchietr, Hjalmar Schlegel, and J. Paul Getty. Since its inception, the museum has exhibited a variety of art and has presented works from across the globe. Its collection includes works by numerous artists from across the globe, including Adam and Eve; Charles Bukowski; Rinko", "The next Biennial should be held in the spring of 2021. \n\nThe city of New York is working with the Charles Egan Foundation to restore the Sidney and Lois Eskenazi home in Queens. The foundation was formed to preserve the family’s legacy by donating works to the museum. The foundation will begin the restoration phase next month and is accepting donations of works by the family and other cultural heritage preservation professionals.“This is an unprecedented situation for the city, and we’re thrilled that this extraordinary collection of works is finally at home, with its loving guardians,” said Anthony D. Sheehan, the mayor of New York and the borough of Queens, who is also chair of the Friends of the Eskenazi Collection. As part of the restoration plan, the Eskenazis will continue to receive visitors and will have free admission to the museum, which is located at 500 Fifth Avenue in Manhattan, until December 2022. The family’s work has been held in the collections of the Metropolitan Museum of Art, the Whitney Museum of American Art, and the Metropolitan Museum of Art.\n\n\nThe Black Sea city of Novgorod, which has been under the control of the self-proclaimed '", "The next Biennial should be held at the hotel. “The exhibition should be a collaborative effort between the artist and the museum,” Miranda said. “The exhibition should reflect the spirit of the Biennials as a whole, and the exhibition should be a compelling reflection of the cultural life of the city.”The next iteration of the Presidential Jubilee, which will be held in 2022, will welcome approximately two thousand artists, curators, and activists, and will take place at the Palazzo Nazionale in Venice. Organizers also said that they will create a new platform for dialogue between the artists and the public through a new interactive book, “Art and the Presidency.”\n\n\nThe New York City Department of Cultural Affairs (DCLA) has revealed that it plans to remove the statue of General Lee Harvey Oswald—a man who assassinated former President John F. Kennedy in Dallas on November 6, 1963—from its pedestal in Midtown Manhattan.The department said that it chose to remove the statue, which was dedicated to the late civil rights leader in 1963, after it “unequaled the pain and suffering of many Americans, including many in the Castro community, who have suffered as a result of this administration", "The next Biennial should bring together artists from different parts of the world and develop a new format for showcasing their work.   The theme of the event should be “representation.” The 2019 edition of the event will take place at the Adriatic island of Sestrivale in the south of Italy and will run from March 17 to March 19. The theme of the event is “Immortality and the Soul,” and will culminate with an exhibition of work by the Milan-based artist Marina Posada & Ånda Marco.\n\n\nThe Los Angeles County Museum of Art (LACMA), the Metropolitan Museum of Art, and the San Francisco Museum of Art (SFMoMA) have received a donation of more than five hundred works by nineteenth-century American artists. The works, which were donated by Richard Hooker, are currently on display in the museum’s new collection, which is currently undergoing a $90 million expansion, and will be given to the public within the next several months.Known for creating works that grapple with issues such as racism and capitalism, Hooker’s work can be found in the collections of the Getty, the California Institute of Technology, the California Historical Society, and the Metropolitan Museum", "The next Biennial should be held in 2022.The 2018 Biennial, held in the city of São Paulo, Brazil, attracted a record-breaking 1.07 million visitors, with the majority of the figures coming from the galleries. It also marked the first time that the event was staged outside of Brazil, and the first time that the exhibition was held in New York. The event’s second edition, which was staged at the Museum of Modern Art in New York from January 10 to January 27, 2019, was also held in the United States.The 2018 edition of the Biennial was organized under the patronage of Julieta and Jesús da Silva, the brothers who currently owns the São Paulo gallery Biennale de São Paulo, and was cofounded by Kasper von der Leyen. \n\n\nThe twenty-second edition of the Sketch Festival, curated by Juliette Graw and Kasper von der Leyen in Brussels, closed on January 5. The event, Sketch Festival 2, is scheduled to run from March 11 to March 12 in the city of Antwerp. The theme this year is Futurism, the future and the process, and the exhibition will", "The next Biennial should take place in the city in 2023. The shortlisted artists chosen for the exhibition were:Tammara Belladonna (Italy), Olla Bicchieri (Italy), Adriana De Armas (Spain), and Ruba Mulsic (France/Germany).The exhibition will be held as part of the fourth edition of the German Biennale, Siegfried Böllischer Berlin, in 2021. The event will also be hosted by the Haus der Kunst, Berlin.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has launched a $1 million fund to help support artists impacted by the Covid-19 pandemic. The initiative, which was inspired by a former employee of the museum who developed a new way to assess the health of work at the institution, was introduced by a former employee of the institution, who wished to remain anonymous, in support of the current employees.“The fund will go directly to assisting the artists whose livelihoods are at risk following Covid-19-induced loss of income and to quantifying the financial impact of the Covid-19 pandemic on artists,” said Mark Thompson, the director of the museum. “", "The next Biennial should take place in 2022.\n\n\nThe Victoria & Albert Museum in London has appointed Laura Harrold as its first senior curator. Harrold joins the museum from the Victoria & Albert from the Royal Academy of Arts, where she has worked as a curator of contemporary art since 2001, and will assume her responsibilities in March.“Laura’s visual and transmedia work has been a strong influence on the development of the museum’s collection and exhibitions, which range from historical to experimental, and I’m looking forward to seeing where she takes us next,” said museum director Nicholas Cullinan. “Her vision, expertise, and energy for this exciting and important chapter in our history is truly exceptional. I’m looking forward to working with her and seeing where she takes us next.”Harrold, a British cultural historian, is the author of Modern Art: From Nouveau to Cinema (2017) and “The Art of Making Movies” (2019); along with Jürgen Hochschildts, the creators of Nirvana’s Skylab; and The Art of Making Music, a collection of performances by artists such as Thee Anne", "The next Biennial should be in 2020. More information about the biennial can be found on the SOFAF website. The biennial will include an exhibition of work by twenty-four artists, including Diego Rivera, Cyril LaBate, Giovanni Guaraldi, and Jack Kilby, as well as a lecture by Peter Hujar.\n\n\nThe Metropolitan Museum of Art in New York has received a gift of three major works by the Italian American artist Zina Montalcino. The works, two of which were on display in the museum’s newly expanded Zina Collection, were donated in 2017 by Francesco Strada, a longtime collector of the artist’s works who also owns the property where the exhibition is located, and are currently on display in a solo show at the museum.“Themes of resistance are not new to Montalcino, and his body of work, from the 1950s onward, demonstrates that he remains at the forefront of a very long and complex tradition of resistance,” said Marc Glimcher, the museum’s director. “This new collection, at a time when the museum is transforming itself and our city, as we face the challenges and opportunities posed by the", "The next Biennial should take place at the Museum of Modern Art in New York in 2021. The 2019 iteration was held at the museum until September, and the biennial ended in January. The 2020 edition will be held at the Smithsonian American Art Museum in Washington, DC, and will take place in March.The full list of participating artists is as follows:Bäro Fotopassa (New York)Balyas Abou-Rahme (New York)Bassim El-Khoury (New York)Benedict Bodega (New York)Berenice Abbott (New York)Berenice Bonaparte (New York)Bökta Biczel (New York)Bocana Biczak (New York)Barrick Bischoff (New York)Benedict Bosshoff (New York)Beth Beasley (New York)Beth Campbell (New York)Benedict Bryant (New York)Bennet Jobin (New York)Bibiana Johnson (New York)BJP Abode Gallery (New York)Boris Johnson (New York)Bishal Ghose (New York)Bishal Ghose-Rao (New York)", "The next Biennial should take place in 2020, to be held at the Sherwood Forest in Nottingham, England; in 2021, to be held at the Northamptonshire Art Gallery, and in 2022, to be held at the Winchcombe Arts Centre in Warwickshire. The 2020 edition will be organized as follows:The 2020 project will consist of an amalgam of three key themes: resilience, community and statehood, and cultural autonomy. In the spirit of the Sherwood Forest, the park will also invest in the conservation of the site, including the development of a conservation register; create a local knowledge base on the history and ecology of the forest; and incorporate contemporary digital technologies and forms of expression.The 2020 project will seek to introduce new creative and cultural activity and challenge the cultural and economic development (C&ED) agenda through an exploration of the themes of sustainability and culture as well as through an exploration of contemporary issues such as migration, climate change, urbanization, and the rise of populism and neo-liberal economics.It will also include an examination of the environmental impact of contemporary art, including its environmental impact on the landscape and the people who create, and will include a reception and discussion following the event.The event will", "The next Biennial should be held at the same location, although probably a little later, and should take place in the same location. The next Art Biennial should be held at the same location. The next Art History Biennial should be held at the same location, but perhaps a little later. The next Biennial of Modern Art should be held at the same location, but probably a little later.  I would like to see the theme of the 2018 Art Biennial remain the same but be centered around the exhibition of the work of a certain artist, rather than around the exhibition of a collection. I believe that the concept of an open-air museum should remain the same, but that some events might be organized at special points within the museum, such as in the installation of a particular work or a specific artwork.  Will enable the public to experience a new exhibition of the works of Art: The Architecture of Life, which is currently on view in the exhibition “The Structure of Life” at the Museum St. Petersburg until March 28.The Danish architect Lene B. Malmstrand has been chosen to design the Danish pavilion for the twenty-fifth edition of Art Basel Hong Kong,", "The next Biennial should take place in the United States in 2022.\n\n\nThe Jerusalem Art Center (IAC) has announced that it is developing the first-ever curriculum for a global exhibition devoted to the city’s cultural heritage, in an effort to reassure visitors to the ancient city that the cultural center will not be damaged or damaged by the international efforts to knock down historic structures in the city.The program, titled “The Future Is Present,” will be organized in five parts: “The Future is Present: A Contemporary View of the Past,” which follows the footsteps of the exhibition “The Future is Present: Contemporary Art” that opened at the museum last June; “The Future is Present: Modern Art” that will examine the history of art through the lens of modernity, particularly through a historical narrative of the city; “The Future is Present: Representations of the Past,” which will examine the history of art through the lens of the reconstruction of the city; “Future is Present: Art and the Future,” which will examine the history of art through the lens of the reconstruction of the city; and “Future is Present: Architecture and the Future,” which", "The next Biennial should focus on the interconnection of art and culture, the construction of imaginary worlds, and the importance of the interdependence of the human species.”The ten-year, $125 million event will invite artists to engage with the ongoing project of constructing the Pavilion, the Shanghai Pavilion for Contemporary Art, which addresses topics such as the relationship between art and the environment, the relationship between the artist and the world, and the theme Pia Hou Hanshuang, “Grandmother” (2015).\n\n\nThe Shanghai Biennial’s theme Pia Hou Hanshuang is being reworked as part of an overall strategy to further develop the Chinese Contemporary Art Biennial, which was launched in 2009 with a series of exhibitions that explored the origins of contemporary art in China. The theme was changed in 2013 to “Empiricism and Power” and was chosen for its simplicity and extension.“The Shanghai Contemporary Art Biennial is testing the limits of the local language, the city, and the region,” said Zhang Shui, the director of the Shanghai Contemporary Art Museum. “Our aim is to constantly expand the scope of the international contemporary art biennial, and to create a platform for artists", "The next Biennial should include an exploration of how the Art of Art and Design is an extension of our lives: something we have to connect to and be connected with,” said Kate Fowle, president of the Hong Kong Art Museum, and the Hong Kong Arts and Design Biennials and the Hong Kong Art Museum.Commenting on the upcoming exhibition, Doreen Cheung, the executive director of the Hong Kong Art Museum, said: “I am very happy to see that the Hong Kong Biennial has been selected for its creativity and sustainability. The exhibition will invite the local community to come together in Hong Kong and express their deep passion and commitment to art and design.”The Hong Kong Art Museum has been organizing the Hong Kong Art Biennial since 2007. Last year, the Hong Kong Art Museum opened a new exhibition in collaboration with the Hong Kong Institute of Art. The Hong Kong Art Museum has presented the Hong Kong Art Biennial in the past, as well as in the United Kingdom and Taiwan.\n\n\nThe Los Angeles–based collective Ochotaro, which performs as Ochotaro, created a new digital platform that enables artists to remix and manipulate content from Japanese culture and other visual arts. The platform,", "The next Biennial should be held in 2020. “The possibility of a new exhibition at the Forum is a wonderful development,” said Elisabeth Adler, head of the museum and the Forum. “The new exhibition will be based on a theme of the past twenty-five years, and will be inspired by the best of modern and contemporary art, with an emphasis on the future.”The new exhibition will be curated by Peter Wächtler, curator of contemporary art at the Forum, and will include works by writers such as the German writer Heiner Neueher, who won the Prix des Beaux-Arts in 1996, and the Danish painter Karin Carlqvist, who created the work My Heart Breaks for the Biennial in 2014.Carlqvist’s first exhibition at the Forum was “Alfred Patrick Hearst: Towards an Exhibition of the Arts” in 2005. The biennial opened as a cross between a museum and a gallery and featured work by Hearst and Carlqvist in addition to a new selection of works by contemporary and avant-garde artists.The new exhibition will also be a follow-up to the 2013 exhibition “The Future Is Not", "The next Biennial should be up and running by the end of the year, and will focus on contemporary art, using contemporary practice and visual arts to address contemporary social and political concerns.”Stuart-Brown said: “I’m thrilled to be joining the Biennial at Guggenheim Museum, and look forward to working with the Guggenheim staff and the surrounding communities to make the Biennial an important and vibrant event for New Yorkers.”The work of the biennial will be exhibited in the museum’s new exhibition “The Biennial.” The show will be on view in the Museum until February 22, 2019.\n\n\nNew York’s Metropolitan Museum of Art has ordered the removal of a monument commemorating the victims of the 1937 bombing of Pearl Harbor that was placed in the institution’s museum in 2017. Critics of the decision have alleged that the museum withheld information about the monument, which commemorates the first Americans to be executed by the Japanese army, and have launched campaigns to have the monument taken down.Following an investigation, the Museum of Modern Art (MoMA) announced on Wednesday that it was removing the monument and that it would “adopt a process that enables us to"]