["The next Biennial should be released in 2020, with the first edition co-chaired by Yuri, and the festival will be returned to Moscow in 2021.\n\n\nDutch artist and reporter Lise Briem has won the Venice Architecture Biennale. She was selected for her work Handbook for the Arts, 2019, which is based on a series of essays on the biennial’s themes such as the relationship between architecture and landscape, the arts and culture, and the body politic. The exhibition, which is housed in the Museu de Arte Contemporáneo in Madrid, will open on January 9, 2020.The artist, who created the book in 1988, was nominated for the award for the first time in 2018 by Laura Mulvey of the Foundation for Contemporary Art, who was awarded the prize in 2019. The award was recognized by the National Arts Council of the Netherlands in 2022 and was followed by the Istanbul Biennale in 2022. Briem was presented with the award at the Helsinki International Film Festival in 2018.In a statement released by the exhibition organizers, Briem said: “The new award is an opportunity to bring greater social and cultural awareness to the Biennale, which has been consumed by many artists", "The next Biennial should be held at the Promenade in Paris, France, next year. It will then be moved to the Museum of Fine Arts in Boston, which will stage a retrospective of the artist’s work in the United States in 2021. The artist will also return to New York for the biennial’s Fifty-Third edition, which will be held at the Metropolitan Museum of Art in 2020.\n BEST INTERNATIONAL ART SHOW: Winner of the 2019 prize. The artist will receive $50,000. The 2018 winner, Sofia and Isobel with Dyer and Reed, presented a show at the BFI London in London, in partnership with the Royal Academy of Arts. In the first round of judging, it was announced that the works of the two artists would be presented in a solo exhibition at the BFI in 2019. Sofia, a Portuguese-born, Czech-American, was selected for her Gulfstream Pavilion at Art Basel Miami Beach, Florida, in 2017. The biennial will be held at the BFI in the same venue in 2020.The 2019 prize jury comprised Peter Rubin, director of the Jewish Museum,", "The next Biennial should take place in early 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has updated its 2018–19 budget with a new $3 million boost to support the restructuring of its collection and operations. The $2.5 billion budget for the museum, which currently stands at $8.7 billion, was established to reflect the anticipated financial impact of the coronavirus pandemic and to provide critical resources for the museum as it prepares for the 2020–21 season.“This budget is designed to support our staff, our artists, and our mission to present a truly global collection,” said Kim Hill, director of the museum. “The restructuring of MoCA is part of MoCA’s long-term transformation plan, which addresses our long-term needs for finance and business solutions and the transformation of our business.”The plan also includes the creation of two new strategic initiatives, the Treasurer’s Challenge and the Budget Challenge, which will help MoCA prioritize and prioritize the financial benefit of its arts programs and will be funded through a combination of general operating funds and revenue from ticket sales.The Treasurer’s Challenge will leverage $1.5 billion from the $3.5 billion", "The next Biennial should be held in 2020. Los Angeles, Rome, and New York have been awarded the 2020 World Development Award. The World Economic Forum in Davos, Switzerland, and the European Parliament in Brussels, have released the 2030 World Development Goals. \n\n\nThe Pittsburgh Museum of Art (PMA) has been awarded $15 million in a settlement with the state of Pennsylvania following a twenty-four-year legal battle. The $100,000 grant comes from the Endowment for the Arts (EFA), which was created in 1988 to compensate museums for the loss of revenue from the “commissioning and management of works in storage,” and is the largest award in the museum’s history. The museum will also receive an additional $3 million in support of its $1.5 million renovation and expansion, which is scheduled to take place in 2023.“The museum is glad to have this additional $3 million to help support its ambitious plans for expansion and renovation,” said PMA director Maria Balshaw. “The challenges we faced in the litigation included financing, legal, and political obstacles. We are confident that the funds we have received will be able to help us through these challenging", "The next Biennial should take place in the spring of 2021.\n\n\nThe Academy of Fine Arts (AFAM) in New York has appointed Anna Mazumdai as its new executive director. Mazumdai comes to the organization from the Costume Institute of Art, where she most recently served as assistant curator of modern and contemporary art. She succeeds Lorna Simpson, who retired in February 2019 after ten years at the helm of the institution.“We are thrilled that Anna brings her expertise and passion to the AFAM,” said AFAM board president André Linder. “She brings an exciting perspective to the museum that will help us evolve into a strong and innovative partner for the arts. We look forward to her leadership role in advancing the museum’s mission and building on the remarkable success story of the AFAM.”\n\n\nThe Museum of Fine Arts (MA) in Boston has received a gift of more than two hundred works by American painter Frank Gehry. In a significant gift made by the family of artist George Gehry, the museum acquired ninety works by the American contemporary artist at a time, from the artist’s family for their seventy-fifth wedding anniversary. The gifts include works by artists such as Robert", "The next Biennial should focus on the work of the nation’s emerging and established artists, an idea that has frequently been considered ahead of its time. The theme should also incorporate historical accounts of the biennial, as well as the artist’s work in connection with the biennial. Artists and activists have been fighting for more than a year for the museum to stage a new exhibition dedicated to Artistic Collaboration, the 1946–1948 exhibition, with the works of the artists who came to exhibit at the exhibition, and to organize a biennial for the exhibition. “We have been pushing for an exhibition dedicated to artists as a way of showing the breadth and depth of the public collection, which is limited only by the imagination of collectors,” said Catherine Johnson, president and CEO of the Museum of Fine Arts in Boston. “We are pleased to be able to announce that the new exhibition will feature work by forty-five artists, including Moholy-Nagy, Ola-Abūdallah, Dziga-Igman, Lechmere, Thomas Eakins, and John Askew. We are eager to see how their works will live and respond to the themes of the bi", "The next Biennial should focus on intergenerational exchange and rebut the idea that art can be defined by one or two generations.”\n\n\nThe Solomon R. Guggenheim Museum in New York has hired Jordan Bradley as its new associate curator of modern art. Bradley will be responsible for developing and teaching contemporary art in New York and will be responsible for the development and teaching of the museum’s collections, exhibitions, and programs. Bradley will take up the post on August 27.“Jordan Bradley embodies the spirit and philosophy of the Guggenheim Museum and has been a transformational force in the museum for her five-year tenure, shaping through the turbulent events of the global refugee crisis and the opioid epidemic,” said Guggenheim director Daniel H. Weiss. “She has cultivated a unique and essential vision for the Guggenheim and we are proud to support her efforts.”Bradley comes to the museum from the Metropolitan Museum of Art, where she serves as a curator of modern and contemporary art, as well as a fellow in exhibition design at the Museum of Modern Art. Her curating will be centered around the themes of vulnerability, displacement, and self-determination, and will unfold over five years", "The next Biennial should take place in 2021–20. For the Biennial, the institution will include a mix of new and established artists, including Brenda of the Plaza Artists; Daphne Peiffer; Andrew Kreps, the founder of MASS MoCA; and Oliver Breslin, the director of New York’s Lincoln Center.\n\n\nThe Museum of Fine Arts (MFA) in Boston is facing a backlash from some activists after it voted to remove a controversial work by artist Franklin Leonard from its collection. According to the Boston Globe, the institution confirmed that the painting, titled The Life and Death of Columbus (1934–1936), was not purchased by the artist but was instead acquired through a “purchase, loan, or donation” of the work by a collector named Leonard in 2014, as part of a deal worth $28 million.The controversy surrounding Leonard’s painting began in 2014, when the institution received a $10,000 donation from a collector named Alexander. The donation was made through an anonymous donor who claimed that Leonard was the donor’s 'son.” The gift sparked outrage over the possibility of the work becoming a target for activists who believed it was part", "The next Biennial should have a theoretical framework which integrates research in the history of art and of photography and might also draw on the existing collections. A specific question posed by the British biennial’s director, Walid Raad, is whether it is possible to create a new biennial without photography and without the commitment of the British curators. In response to the question, a Biennial Liaison Group made up of art historians, curators, and photographers reached a consensus that the project is possible. The first works presented in the exhibition were created in the immediate aftermath of the second world war and will be positioned in relation to the first. The second exhibition will focus on the impact of the global health crisis and the third exhibition will be on the relationship between photography and urban planning.The 2019 edition of Biennale London is scheduled to run from May 8 to May 23 and will be staged at the Royal Festival Hall in London. \n\n\nThe Armenian-American composer and dancer Elin Çelikar, best known for her choreography for her country’s national folk-based cultural organization, the National Arts Theater, was selected as the 2020 recipient of the Silver Lion at the Fifty-Ninth Venice Architecture Biennale. The ceremony", "The next Biennial should be held in the fall of 2022.\n\n\nArtemisa Acti, a longtime curator and writer at the Art Museum Stuttgart, has been appointed the next director of the Kiruna Art Museum in Italy. The announcement comes amid a global crisis that has seen the United Kingdom close its borders to the European Union, France, and Germany in an attempt to reduce the number of migrants crossing the Italian and French coasts.Acti, who first joined the museum in 1987 as a curator of African art, was chosen for the post after a four-year evaluation period by the museum’s board. She will take up her new post in April.“The appointment of a visionary director is an important step in our ongoing plan for the future of the museum,” said Hanno Schubert, the director of the museum. “As we have been working on this project for more than six years, I’ve seen and worked with great enthusiasm and respect for the way in which the director and the board has contributed to a great success of the museum. I am sure that with this appointment the director will further our work in a way that is new and positive in the museum.”\n\n\nAfter more than", "The next Biennial should be held at the Museo de Arte Contemporáneo in Santo Domingo, the organizers wrote. “The next Biennial will demonstrate the extraordinary breadth of the Brazilian arts, and will celebrate the creativity of women and men across Brazil and the world.”\n\n\nThe Los Angeles County Museum of Art (LACMA) announced today that the Los Angeles–born, German-born artist Markus Dallenbach has been selected to design the museum’s new eight-acre plaza, which will sit just across Los Angeles’s City Hall from the County Museum of Art. The plaza will be located in the former site of the former El Dorado Pharmaceuticals plant, which is slated to be demolished next spring. Dallenbach first proposed the plaza in a 2017 letter to the public art museum’s board, which was signed by more than 1,700 people. The letter, which was authored by Los Angeles’s James Zogby, was sent in response to a city-backed $3 billion plan to remove the old El Dorado building and replace it with a large new building and a new county jail.The architect also explained how a plaza in the same neighborhood", "The next Biennial should focus on “the legacy of anthropologists” and “art historian” as well as other disciplines including architecture and design. The theme of the event is “In Defense of the Humanist:” The exhibition will receive $10 million in support of the inaugural event. The upcoming global boycott of Israeli human rights abuses is supported by 66 countries. Here is a full list: EU:\n\nThe European Union is asking the United States to scale back its pledge to send more than a hundred combat troops to Poland to help the European nation defend itself from a resurgent Russia. The new guidelines, released in a statement on Thursday, drafted by the European Commission, argue that the deployment of US troops would risk a escalation in violence with Russia and would only serve to exacerbate existing grievances.“We ask that the US takes into account the consequences and acts in accordance with the rules of engagement, including those established by the United States, with regard to deployment of forces, and not exceed the stated commitments in the memorandum of understanding (MOU),” the statement reads. The US has committed to sending at least four hundred additional troops to Poland to help shore up the government and the military, which has been in a", "The next Biennial should take place in 2022, but Skogsborg has not revealed when the event will be staged. The next edition of the exhibition will take place in the Swedish town of Malmö from May 23 to May 29, 2022. The next iteration of the show is scheduled to be held in 2018. This year’s edition will take place at the Museum of Contemporary Art Copenhagen in the summer of 2022, and the next will open in the autumn of 2022.\n\n\nThe number of people working in the United States to design a new national monument for the state’s history of mass incarceration has climbed to 458, with four hundred and sixty-eight applications received, and six months to go before the final design is made public. The SculptureCenter in Brooklyn has received the lion’s share of the bids, with the firm responsible for the design, Ryan Lee, seeking to erect a monument commemorating the people who have been incarcerated for nonviolent crimes.The SculptureCenter received the first two hundred and sixty-eight applications from individuals and groups who want a monument honoring African Americans—the first was led by artist Hosea Williams; the second was by artist and activist Pia Camil. Both groups were", "The next Biennial should include the exhibition “The Power of One: Sex and Politics in Contemporary Art” (2019), which will be the first of twenty projects in the series to be staged in 2020. The fiftieth edition of Art Basel Hong Kong will also feature the work of twenty-nine artists, including Tanya Bonakdar, Irina Bocchieri, Marley Watkins, and Marta Iwanowicz, and will be held in 2021. \n\n\nThe estate of the late British artist Douglas Adams, who championed psychedelic visionaryism and a psychedelic utopia inspired by the artist’s own personal experience with LSD in the 1960s and 1970s, has agreed to pay £150,000 to the estate of Rumi Arsht, the spiritual leader and translator of the Tibetan Buddhist tradition. The sum will go to the estate of the late British artist Douglas Adams, who championed psychedelic visionaryism and a psychedelic utopia inspired by the artist’s own personal experience with LSD in the 1960s and 1970s, and will be divided equally between the estate and the British Museum. The estate also agreed to pay around £120,000 in a separate settlement with the British Library Society (BLS), the British Film", "The next Biennial should be held in 2020. “The subject of the tapestry is a great one, and it could become the centre of a new kind of exhibition,” said David Sze, director of the two-year-old institution. “It could be the greatest exhibition ever staged.” The tapestry, which was made in China in 1939, was commissioned by the father of the artist Chiang Kai-shek, who also designed several other works in the series. The father, Liu Jianzhu, who immigrated to the United States in 1949, donated the first piece to the museum, a series of twenty-four paintings that explored the concept of history through the medium of historical fiction. The museum will build the biennial’s Wanganara campus in 2020 but has no other plans to move the tapestry, which has been in its artist-in-residence space in the museum since 2014. The tapestry will remain in the museum’s collection and will be featured in the exhibition “The Story of the Art Museum” (2019) and “The Story of a Painting” (2018-19).\n\n\nAfter the Birmingham", "The next Biennial should be held in the spring of 2021. \n\n\nThe Museum of Contemporary Art, Boston (MCA) announced today the twenty-three artists who are participating in the third edition of the exhibition, “The Times They Are a-Changin” (“The Art of the Real,” “The Balance of Power,”  and “James Baldwin: A.I.” The event, which will run from March 5 to March 7, 2020 at the Museum of Contemporary Art, will bring together seventy-eight artists, including Peter Hujar, Maneesh Chaudhuri, David H. Koch, Nirvan Holle, David Kline, Tanya and Samantha Langhouse, and Eleanor Rosenblum. The exhibition also features works by Yasser Arafat’s wife, María Berrío; Jean-Michel Basquiat’s widow, Yvonne Basquiat; and Nina Brown’s widow, Mary.“Today’s biennial is a reflection of the world we live in,” said MCA director Kim Wallach.", "The next Biennial should be held at the same location as the first; the location of the exhibition will be changed. “This year’s show is a step forward in developing and imagining new ways of seeing humanity,” said   Open Actors Art Coordinator Oliver Hopps. “I look forward to working with the newly commissioned artist to find ways of engaging with and improving the existing exhibition.” The exhibition will be free to the public and will include work by thirty-six artists, including Oliver Bezalel (The Trees of Life), David Blaine (Prada, M, D, L, P), Tanya Lonos (The Man in the Shadows), Andrea Giunta (Carlotta Lepido,  La Paz), Tannis Loghman (Armada, Gillian Wearing), Max Hetzler (Galerie Glimcher, Gareth N. Lucas), Andrea Pilar (Sheraton Moscow), Jasmina Haji (Artemisia, New York), Paul Mpagi Sepuya, (Nirvana, New York), and Anouk Mpagi Noguchi (New York), among", "The next Biennial should focus on the intersections of film, history, and theory and help to cultivate a sense of order and unity in the city in which we live.”The festival, which is helmed by the museum’s artistic director, Robert Littell, will launch next week with a programme co-curated by the artist-run Los Angeles’s Littleneck Gallery and Nelson-Atkins Museum of Art. Inaugurating are “Theater of Operations: The Gulf Wars 1991–2011” and “Theater of Operations: The War on Terror” and will run through December. The full list of participating artists is as follows:\n\n\nThe National Galleries of Scotland (NGM) has made it one of the first major institutions in the UK to introduce new online viewing rooms designed to encourage engagement with the institution’s collection. The new platforms will allow visitors to explore the museum’s collection, view exhibitions and get a good look at the works on display.“The NGM is committed to being a leading international destination for visitors to view and explore our art, and it is exciting to introduce new ways to do so across the globe,” said", "The next Biennial should focus on the recent reappraisal of the Lascaux-Bodéron: Salai, a zen-museum in Pont-Saint-Luc, and the lush conservation strategy of the Saint-Louis region\u0097a theme for the third installment. The theme of the upcoming exhibition is “Polarities: Dimensions of the Body in Art and Art History.”The fifth edition of the Biennial will be held in the city of Saint-Paul, Minnesota, in 2021. The exhibition will run along with the biennial’s centenary celebrations in 2020.\n\n\nThe Museum of Contemporary Art (MoCA), Chicago, has released a new set of guidelines for the use of racial and ethnic-identity-based violence in the museum. The document, which addresses both museum-designed spaces and streets that have historically drawn crowds\u0097and includes a set of recommendations for how the institution can better accommodate the diverse communities that make the city’s South Side history-making district such a rich and vibrant place.“The guidelines are very much in line with what I have been advocating for years,” said MoCA director and CEO Marion Nestler. “I think they’ve", "The next Biennial should take place at the National Museum of Canada in Ottawa in 2020.  \n\n\nThe Italian Institute of Art (Istituto Italiano di Arti) in Milan has received a donation of twenty-seven works from the Italian artist Carlo Battista, who went missing on April 5, 2012. The works were presented by Carlo Battista, who died in 2012, to the museum in memory of his wife, Elena Battista, who died in 2006.The donation arrived in the form of a box containing the works, which were all purchased, in exchange for the museum’s agreement to donate the works to the Galleria di Roma in Rome. The institution, which is located in a former steelworks, has been entrusted with the care of the works for the next nine months.Since the museum has yet to receive the twenty-seven works, scientists from the institute are working on a study of the works. The research, which may take several years, will determine whether the pieces are in a state of deterioration or if they could be restored to their original state.“We were devastated that the works would be lost,” said Istituto Italiano di Arti director Carlo Battista. “We had hoped", "The next Biennial should take place in 2022.\n\n\nThe Museum of Contemporary Art (MCA) in Los Angeles has received a $50 million donation from the Andrew W. Mellon Foundation in support of the creation of the Andrew W. Mellon Family Art Museum in New York. The gift includes $50 million for the museum’s acquisition of artworks that were previously on display in the museum but never sold. The gift is also for the acquisition of works by three of the foundation’s previous donors, Andrew Mellon, Maxwell and Gordon. The gift was made in recognition of the museum’s contributions to the arts and humanities and to the W.M. Keck Foundation for the Arts.“The gift of these three items is both a tremendous honor and a testament to the MCA’s commitment to supporting the art of the twenty-first century,” said Mary Anne K. Chan, board chair and director. The foundation also received a gift of fifty artworks by Carolyn Kennedy, a senior member of the family who is a major donor to the museum. The gift includes thirteen works by Kennedy and her husband, Robert, as well as fifteen works by her sister, Barbara, and five by her son, Robert Kennedy. The", "The next Biennial should be held at the Museo de Arte Contemporáneo in Madrid in 2021, the Spanish government’s representative for culture Fernando de la Corte told the Art Newspaper. When asked about whether the forthcoming edition would include a “good show,” the artist replied: “It will have the same dynamic of the last but with a new perspective and with more emotion. We will have much to talk about.”Further details regarding the sixty-five-year-old exhibition and its theme of “Religion and Politics,” a collaborative effort between the artist and architect Lluís Castellanos, a visiting scholar of Modernism at the University of the Arts, are currently lacking. For the Future Art Institute at the University of Oxford, the exhibition will be a “once in a lifetime experience.” Commenting on the show, the institute said: “The exhibition will also include a new collection of drawings by Pablo Picasso, which will be presented in an exhibition of his paintings. The exhibition will be a ‘starting point.’”\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines for the display of works", "The next Biennial should focus on the interrelationship between the art and cultural heritage of the country and the different regions of the planet, and should take place in the cities of the country. It should also consider the possibilities to create a new kind of educational program about the art and culture, especially in rural areas.There are also plans to create a biennial that will hold 30 percent less art and focus more on the source and distribution of art. [To be announced] \n\n\nThe Museum of Fine Arts (MA) in Boston announced on Thursday that it will no longer accept new visitors, and will instead begin welcoming visitors with a new digital platform called the MuseScorecard. The site-specific initiative, which will debut in 2020, will allow visitors to upload their own biennial scores to the museum’s website and will be updated on a weekly basis as the institution plans to hold its next architectural and design exhibition.The new platform will also include a number of tools to help curators and experts in the field and will be able to track exhibition placements and to send feedback on exhibitions, including curated conversations and reviews. \n\nAlberto Bara, “Where Are They Now?,” a new project by the Museum of", "The next Biennial should be held in the spring of 2020. The event will be hosted by the city of St. Paul and will run from March 17 to March 20, 2020, with a VIP preview day on March 18.\n\n\nThe New York City Department of Cultural Affairs announced today that the Macy’s Thanksgiving Day Parade will return to the city for its 2020 edition, which will take place at Rockefeller Center in Queens on November 24. The 2020 edition will also feature a number of new elements, including a redesigned stage and a new score by composer Yoko Ono.“We are very excited to welcome the Macy’s Thanksgiving Day Parade back to New York City for our 2020 edition,” said commissioner of the city’s cultural affairs, Polly Trottenberg. “We are still designing the perfect route for the parade, but we have an innovative new way to celebrate the holiday in 2021 that will celebrate the city and the people of New York City.”The 2020 parade route will follow the route that was taken in 2017, when the Macy’s Thanksgiving Day Parade took place in Manhattan. The event will also include new public art, including a new sculpture by David Kuk, a public plaza and gardens by Joan", "The next Biennial should be held at the Stedelijk Museum in Amsterdam in March 2022. The show, titled Feminine (Artistic), will feature fifty artists and will run for eight weeks. The next iteration of the biennial will be held at the Stedelijk Museum in March 2021. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has received a gift of more than eighty works by seventy-eight artists from the Los Angeles County Museum of Art (LACMA). The canvases, collages, prints, paintings, drawings, sculptures, photographs, and photographshells were donated by artist and collector Terry Southern, who is known for their use of social media to spur their work.“We are deeply honored to have this remarkable collection assembled by Terry and his outstanding team,” said LACMA director Janette Sadik-Khan. “It demonstrates both a deep understanding of the art world and a commitment to the arts that is rare.”Over the last eleven years, Southern has amassed this massive collection, which consists of nearly seven thousand works, including paintings, drawings, prints, sculptures, photographs, and photographshells, which are priced at more than $", "The next Biennial should be on the shelves of the museum within three years, and the 2020 edition will mark the 125th anniversary of the institution.  The event is also reporting that sales have increased by 40 percent since the coronavirus was first reported in China in December. \n\n\nThe British Museum (BMI) in London has announced that Holly Hendry, who served as the director of the museum since 1989, has been appointed as its next director. In her new position, which is officially unanimously appointed, Hendry will lead the institution through a transition that will see it reopen in 2021 and continue to operate in phases throughout the next two decades.“We are delighted to welcome Holly to the museum,” said Beth Miller, director of the BMI. “Her extraordinary record of achievement as a visionary leader and as a champion of art across her forty-year tenure as director of the BMI makes her uniquely qualified to lead the BMI through this exciting new chapter.”During her tenure at the helm of the BMI, which was launched by the British government in 1964 as an arm of the British Museum, Hendry helped the institution become one of the leading museums in the United Kingdom,", "The next Biennial should be held in 2020, and an exhibition of the work of lesser known artists should be staged in 2021. New museums are being created at an incredible pace. The next iteration of the Museum of Contemporary Art (MCA), Los Angeles, is expected to open in 2020 and may break ground in 2021.\n\n\nThe Museum of Contemporary Art (MCA) in Los Angeles is planning to open a new research center dedicated to the works of emerging and established artists. The new center, which is currently being conceptualized by director Klaus Biesenbach and architect Heidi Schier, will be located in the former South Los Angeles Community College building in the city’s historic Palmdale neighborhood, and will serve as an incubation lab for new work by emerging and established artists.“This is a moment when we are faced with a crisis of unprecedented scale,” Biesenbach told Artnet. “It is the only way to provide a new and fresh perspective on art history, how art originates, and how art shapes and creates our lives.”Established in 19th-century Los Angeles by immigrant parents, the institution opened in the former textile and auto assembly plant on West Broadway in 1967", "The next Biennial should take place in the fall of 2020 and will involve the creation of an immersive environment that combines visual and material art. We look forward to visiting and collaborating with the teams and the artists of Rupture, as well as with you, the community. Sincerely,Sara BrazierThe Art Garden at the Old FitzPatrick, DublinThe Art Gallery at the Artspace, DublinThe European Museum of Dublin, DublinThe National Museum of Fine Arts, DublinThe National Museum of Art, DublinThe National Art Museum, DublinThe National Museum, DublinThe National Gallery of Art, DublinThe National Museum of Modern Art, Dublin\n\n\nThe 2017 Cannes Film Festival is now available online. Following the festival’s conclusion, the organization announced a number of changes and enhancements to the upcoming edition, including the addition of more than sixty new works, including work by artists such as Robert Irwin, Rachmaninov and Zoya; as well as a new short film by award-winning director Zhang Yaxuan (\"The Phantom of the Opera\") and two new documentaries, both of which will be screened on May 28.The full list of participating artists is as follows:Art Basel, BeijingArt Dubai, DubaiArt New York, New", "The next Biennial should be held in the spring of 2021.\n\n\nThe British archaeologist Richard Dawes, who championed the field of prehistoric art and founded the Museum of London’s Association for British Art (BMA), has died at the age of eighty-two. He was an experienced collector of art who collected works by artists such as Hans Christian Andersen, Gere Kavanaugh, and Robert Irwin. “Dawes was the godfather of British art in the United Kingdom,” said Hugh Macgregor, chairman of the auction house. “He was the man who helped the BMA to become what it is today: the world’s leading international sales house for art.”Born in London in 1937, Dawes attended the London School of Economics before attending the prestigious American Conservatory of Art, which he joined in the 1950s and eventually cofounded with Macgregor. In the mid-’60s, the pair moved to California and began to expand the company’s operations. In the process, they cofounded the American School for Art, which opened in Santa Monica in 1961 and workspaces for artists such as Claude Monet, Susan Atkins, and Robert Irwin. The company also helped establish the", "The next Biennial should consider how to create a new narrative around the French Revolution\u0097a question that has been touched on in previous years\u0097and whether to draw on the work of the next generation of artists, in this case from the Seine valley and the Béchardie and the Loire valley, to create a new kind of landscape.” \n\n\nArt historian, curator, and educator Johanna G. van der Steur, director of the experimental space the New Museum, New York; and artist-in-residence Kader Attia, whose work is part of a vast project to rework notions of the American West, have been nominated for the 2020 Cannes triennial awards. Since the awards are based on a jurying panel\u0097not an artistic award\u0097the first round of voting will conclude in May. The other two rounds will be held in June and September.Van der Steur and Attia’s works are Separatism: A Humanistic Experience and How to Disappear (2019), a series of overlapping public sculptures that address notions of the self, the world, and the ecological crisis. The works, which have been installed in New York’s Central Park, were inspired by van", "The next Biennial should be held at the Centre Pompidou in Paris in 2022. The institution said that it would evaluate the application for a design by the public in a month. It is also planning to share the design with the city of Paris.\n\n\nThe Solomon R. Guggenheim Museum in New York has asked a small group of artists for participation in its upcoming exhibition “Untitled: The History of Art in our Time.” The symposium will feature work by various artists, including Daina Mokgati, ​Haroon Mirza, Avital Rifai, and Yazhi Nara, and will run from April 23 to April 26.The show comes amid a growing campaign to hold cultural institutions accountable for their displays of art and is a response to the recent wave of anti-Israel propaganda and protests. The exhibition will also address the history of the institution’s collection of works by Palestinian artists and activists and the museum’s relationship with the Israeli government.“We are thrilled that the exhibition will include direct contributions from the artists whose works are currently on display in our collections,” Museum director Daniel H. Weiss said in a statement. “As the United States and", "The next Biennial should be held at least four months after the quarter-final round of the exhibition has concluded. The third edition of the exhibition will also be held at the National Gallery in London in November 2022.“The aim of the Biennial is to create a series of works to reflect the range, diversity, and vitality of the contemporary world,” said Mr. Pickering. “This year’s exhibition was both a reflection and a reckoning of our present moment. We have created a work of the first scale-and-complex,” he said, referring to the exhibition of the first scale-and-complex, the work NIRIN, in 2001. The first edition of the exhibition, “NIRIN: The Vision of a Cube,” was held in May 1993.\n\n\nThe National Philatelic Union (NPO) and Art Gallery of Scotland (AGS) have signed an agreement to merge. The partnership will create a new major public body that will liaise with the Scottish government and will oversee the reorganisation of the Royal Academy of Arts (RA) in Edinburgh, the launch of its new exhibition “The Future of Europe,” and the renewal of the National Gall", "The next Biennial should be held in 2021. The biennial will comprise a number of exhibitions, including a presentation of works by the artists that have been selected to participate in the upcoming edition of the Biennial; “Avant Garde” (2019), which will feature works by Lévy Gorvy, and “Tic Toc-Tonkatsu” (2019), where sculptures by Ai Weiwei will be on display. Artists from beyond the region can apply to the museum for a permanent exhibition with a maximum capacity of sixty people each. The 2019 edition of the exhibition focused on the history of modern art in China, and the 2020 edition will focus on the history of Chinese art.\n\n\nThe Museum of Modern Art (MoMA) in New York has released the 2018–19 season schedule for its five-yearly exhibition, “Theater of Operations: Modern Warfare 1941–1945”—a series that draws from forty-two films—to coincide with the anniversary of the US offensive in WW II. The exhibition, which opened on June 11, 2019, will run through April 22, 2021.“Theater of Operations: Modern Warfare 1941–1945” (2018–19)", "The next Biennial should focus on harnessing the power of science and technology to advance and care for the environment for which it is conceived,” said Paris-based architect and collector Isabelle Faucher. “This is the year we are at the beginning of a new chapter in the history of art, one that will continue to offer a rich source of inspiration and a powerful example for future generations.”\n\n\nThe Central Church of the Metropolitan Museum of Art in New York has appointed Kate McKean as its next president. In her new role, McKean will work closely with her predecessor, Nancy Spitzer, to shape the museum’s engagement with contemporary art and the cultural landscape.“Kate McKean’s work at the museum has made her internationally recognized and her leadership in the museum’s impressive ten-year history a reflection of the museum’s history,” said museum director Daniel H. Weiss. “We look forward to working with her to build on the extraordinary success story of the museum’s CMCM collection, and to continue to shape the museum’s presentation of art of the twentieth century.”McKean comes to the institution from the Metropolitan Museum", "The next Biennial should be held in 2020, and the first in 2021.\n\n\nThe Metropolitan Museum of Art (MoMA) has appointed Catherine E. Franke as its new board chair. She succeeds Carol D. Haemisch, who helmed the institution for nearly thirty years and is expected to retire after sixteen years in December 2020.“The board’s decision to promote Franke, who has served as chair since 2015, was made in recognition of her considerable leadership, expertise, and commitment to the museum,” said museum director James Cuno in a statement. “She is a tireless advocate for the Met’s contemporary art collection, and has spearheaded the museum’s transition from a collection-based model to one that supports the universal good.”During her tenure, Franke oversaw the consolidation of the museum’s holdings and curation team. She also organized numerous exhibitions, including “Specter of a Nation: Art and the European Middle Ages” (2015); “Wangechi Mutu: A Fantastic Journey” (2017); and “Building Bridges: Contemporary Art in Africa” (2019).Commenting on her new role, Franke said", "The next Biennial should be held in 2020.\n\n\nThe 2017 exhibition “Dress for Success: Fashion in the Age of Black Power” at the Museum of Modern Art in New York was cancelled at the behest of curators Tilda Swinton and Zehra Hamdard, who were protesting the exhibition’s inclusion of a gown by the late British feminist artist Betty Dimbleby, who was the inspiration for the gown in the work’s bodice.The six-month event, which was to have included interviews with the artists who created gowns bearing her work, was supposed to feature work by fifty artists, including Ben Parinella Nistor, Lise Adler, Rasheed Araeen, and Judith and Kip Ganz, and was entitled “Fashion for Success: Fashion” and was scheduled to run from March 19 to March 21.According to Artnet News, the event was supposed to be held in the museum’s American Art and Design Collection, but the museum has since moved the exhibition to its newly created, new space in the Brooklyn Museum, where it will reopen May 17. The museum also announced it will permanently close its current exhibition “Fashion” in 2019.While the", "The next Biennial should take place in 2021 and will be titled “Art and Life After Death,” with the first edition, “Volta: The Ghost of a Memory,” slated to open at the museum in March. \n\n\nSince the prosecution of the Dusseldorf terrorist court in the spring of 2018 has yet to result in any significant changes to the radical Islamist agenda, the Federal Constitutional Court in Berlin has decided to launch an investigation into whether the interior ministry is overstepping its authority by issuing arrest warrants for people suspected of supporting groups opposed to presumptive presidential candidate Brigitte Macron. The decision comes amid a political crisis for the chancellor, Angela Merkel, and her conservative bloc, which is now facing a backlash from the far-right Alternative for Germany (AfD), which is currently in third place in the polls with nine percent. In a ruling published on Tuesday, the Federal Constitutional Court ruled that the ministry must make it clearer that people who have their homes or businesses searched during the course of a counterterrorism operation are not protected by the legislation, which came into effect in March. It also noted that the state was violating the rights of journalists and was undermining freedom of the press.The ruling came after the Berlin state", "The next Biennial should be held at least sixteen months after the date of the last one. The design of the exhibition must reflect the spirit of the previous seventy-six, which was designed by Richard Avedon in 1971. The exhibition must consist of twelve contemporary artworks, arranged in a meta-historical, biennial perspective. A selection of the works will be presented in a biennial exhibition at the Museum of Modern Art (MoMA) in New York in 2021. The design of the forthcoming exhibition will be based on a selection of works by artists or groups that have worked from Africa and/or Southeast Asia, The Middle East, Latin America, and South America. The following artists will represent Africa at the upcoming exhibition:Emma Atottu, Mali\n\nDaniel Ashery, United States of America\n\n\n \n\n\nArtforum has learned that artist and institution Bradil Bivens, whose work was featured in the 2016 exhibition “Lavish Together: Art in the Age of Black Power” will present “Blue,” a new program of solo exhibitions at the Utah Museum of Art in Salt Lake City, on October 27–31. It will also be the first time the artist will have participated", "The next Biennial should be on the theme of art and intellectuals, and will be organized in cooperation with the two artists. The exhibition will also feature writings by literary and artistic geniuses. The event will be hosted by the State Museum of Fine Arts, Bombay, and the Sharjah Art Foundation.\n\n\nThe Canadian Museum of Fine Arts (CMFA) in Toronto is planning to completely shutter its doors in the spring of 2021 to conserve water and energy. The Vancouver-based arts organization, which celebrates one hundred years of arts in Canada, said that it will shutter its seven main locations in April of 2021 and abandon its current programming in favor of a new organic model.“In order to reduce our carbon footprint and mitigate our greenhouse gas emissions, CMFA’s businesses have supported the organization’s annual arts event by creating new opportunities for our visitors to participate in exciting and meaningful ways,” Caroline Reid, director of CMFA, told the Art Newspaper. “CMFA is committed to supporting the artists, curators, writers, and musicians that make Canada exceptional and is looking forward to continuing to be a catalyst for artistic creativity and understanding in the years to come.”Called the 2020 biennial, the exhibition, titled �", "The next Biennial should take place in the spring of 2021. After that, the museum will stage two more competitions, the Dinnertime Show, which will be organized in the autumn, and the Public Art Category, which will take place in October.The first exhibition, titled “Art and Life in the 21st Century” (Art and Life in the 21st Century), will be on view from November 4 to November 6. The second exhibition, titled “Art and the City,” will be on view from November 8 to November 10. The program will include work by eighty artists and collectives and will include new practices that will be artist-centered and will focus on issues such as urban life and transportation, climate change and energy, and the body and the environment.The announcement of the three exhibition spots for the 2019 edition of the Biennial drew a standing ovation from the gallery’s staff and an enthusiastic response from the public. The 2018 edition, staged in the art district of Paris, was criticized by some for its limited programming and its exclusion of international artists and due to its later announcement than its organizers, the exhibition was canceled. The 2019 edition, entitled “New Light,” will be on view November 5", "The next Biennial should take place in 2022. The first will be held in the seventeenth year of the current project.\n\n\nReports indicate that the number of cases of the coronavirus has reached an all-time high in China. According to the New York Times, the number of people infected with the virus has reached 7,200 cases and counting in the country. On Monday, October 28, the Beijing government declared a public health emergency and dispatched 1,200 public health workers to help contain the virus.The coronavirus outbreak has been exacerbated by the coronavirus A/California/US, which hit China on Wednesday and has since spread to twenty-nine other countries. As of Friday, China had 316 cases; the virus has since spread to twenty-four countries. The United States, which has reported more than 3,900 cases, has reported at least 1,200 people infected. While many cases have been tied to people returning from overseas, the virus has also been linked to Chinese tourists. On Monday, the number of cases in the US was revised up to 21, with fourteen deaths. According to the New York Times, the number of cases in China has risen to 2,500. \n\n\nThe Los Angeles County Museum of Art", "The next Biennial should be held sometime in the 2020–21 season, he said. \n\n\n\n\nThe B.I.G. Foundation in New York City has appointed René Morales as its next director. Previously, Morales served as the artistic director of the Art Institute of Chicago and as the director of the Queens Museum, where he cofounded the contemporary art movement with Gwangju, South Korea, in the 1980s. Morales succeeds Mark B. Weiss, who retired earlier this month after six and a half years in the position.“I’m thrilled to be working with René and can’t wait to see how he develops our community and our collection,” said Marc Glimcher, the director of the Art Institute of Chicago. “He has been instrumental in growing the B.I.G. Foundation, which is now a major educational and cultural hub in the heart of Harlem, and has been instrumental in making contemporary art accessible and accessible to everyone. I’m looking forward to seeing where he takes us next.”Since founding the Art Institute of Chicago in 1985, Morales has organized more than fifty exhibitions at the institution, including “The Art of Manliness,” which", "The next Biennial should take place in 2021 and will be curated by the Director of the Museums of Fine Arts, the Bodø Gallery, and the National Museum of China in Beijing. The five-day event will also include a series of discussions with local experts and scholars, including the artist Shih-Chien Huang, the former director of the Chengdu Art Museum and University, and the director of the Museum of Chinese Art, Chengdu.The exhibition will highlight the history of Chinese art in the United States and will present twelve works by artists that have made significant contributions to the field in the past. Among the works will be a new collection of work by the artist Chi-Chung Huang that will be presented by the artist in partnership with the Museum of Contemporary Art, New York; and a collection of works by the artist Rung-Chien, which will be presented by the artist. The exhibition will also feature biennial entries by the artists Ah-Jin Choi, Hsu-Noi Cui, and Hung-Hyun Kim.\n\n\nThe French government approved a bill on Monday that will establish a $10 billion fund for cultural institutions in the country’s north by pledging financial support from the French Ministry of Culture. The €", "The next Biennial should be held in the early 2020s, in the Emirate of Abu Dhabi. In a statement, the organizers said: “In the wake of the recent events in the United States and Europe, we feel it is important to continue to organize our biennial in a way that respects the richness of cultures and histories of different countries, as well as their existing sovereign rights. However, in an attempt to address the current challenging situation in the world, we have decided to postpone the 2020 edition.”\n\n\nThe Museum of Arts and Design (MAD) in New York has appointed Anne-Marie Aikman as its new deputy director for collections and exhibitions. Barozzi Gallery in New York has also been put up for sale, and the Metropolitan Museum of Art in New York has appointed Nikhil Chand as its new director of collections and exhibitions. Chand currently serves as the chief exec of the New York–based firm Fernanda Gelant, which represents artists.“Barozzi Gallery is an important New York institution,” said director Mark Spalding. “Anne-Marie is an experienced leader and a leading curator who has led the gallery for more than eight years, and who will help elevate the gallery into", "The next Biennial should take place in 2021 at the São Paulo Biennale, which is on track to run from March 28 to March 31. In the meantime, the festival will prepare for its fourth edition by launching a digital platform, VISTA, on April 5 and introducing a new biennial edition that will take place in the autumn of 2021.\n\n\nDaniela and Omar Sarr–Zarqawi of the family gallery Emil Moesgaard, which represents the late Nigerian contemporary artist N-Dubz, have filed a lawsuit against the Museum of Modern Art (MoMA) in New York accusing the institution of misrepresentation and copyright infringement.The Sarr-Zarqawi brothers first brought the allegations against the institution in the US District Court in Manhattan in January 2018. The family claims that between 2020 and 2021, the museum sold a collection of works by the late artist, whose body of work includes works such as Black Planet, Seven Towers, and The Empire of the Sun.The family also claims the museum failed to promptly remove the works from its collection when it was the subject of a lawsuit in the same court. The court ruled in favor of the Sarr-Zarqawis in February 2019 and awarded them a sum of", "The next Biennial should be held in 2030. Twentieth-Century masterpieces such as the exhibition “Rendering the World” (2019) and “Theater of Operations” (2019) were selected by the committee chaired by the artist and curator Victoria Miro.“The Biennial is incredibly important not only to Zöllner, but also because it is a core event of the Central Museum Freie Berlin, which has been hosted by the city of Berlin since 1955,” said Curator-in-Charge Diane Reif. “The exhibition is a central element of our history as artists, and its influence is felt in every generation. The next edition will give the Biennial and the city a great platform for a number of ambitious projects, including the construction of a new exhibition hall in the Freie Kunsthaus, and we are confident that this will be a landmark year for Berlin.”The selection committee comprised Berlin native Dieter Berggren, art historian Tadeusz Ksovski, curator and former editor in chief of the Berlin magazine Artforum Oskar Langeveldt, art historian and curator Michael Lam, and Kunsth", "The next Biennial should be unveiled as early as March 2020 and will feature ten works by eighty artists, including Shanghai-based artist Xi Wang and British artist Paul Mpagi Sepuya, who was chosen to represent the Commonwealth at the upcoming Venice biennial. The show will feature work by fifty-six artists from twenty-six countries.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that Sam Gilliam, the first curator of Minimalism at the institution in more than fifty years, was appointed director of the museum. Gilliam will be responsible for reopening the museum to the public in 2020 and will begin the process this spring. Giorno Gallery, which represents Gilliam, will also continue to represent the artist.“Sam’s ability to bring Biennials–and the art of the future to life through a vision of minimalism and our place in the world–is an ideal fit with the mission of MoCA,” said Richard Giorno, the museum’s executive director. “In a time when the practices of art and technology are constantly changing our lives and the fabric of the world, Sam Gilliam demonstrates a genuine and urgent commitment to the art of the future.", "The next Biennial should be convened in 2020 and will aim to address the current problems and challenges of contemporary life. The theme of the event will be “Transhumanism and the Future of Life” and will be inspired by the work of philosopher Oscar Wilde and his German collaborator Auguste Conte.The Biennial will carry out research and will host the first exhibition of work by artists from the biennial in the history of the festival. The exhibition will be organized by the artist-run exhibition space the Fondazione Biennale di Richmond (FBFR), the American Contemporary Art Museum (ACM), and the Minneapolis Institute of Art (MI). The Biennial will also organize numerous other exhibitions, events, and other programs. “This is an opportunity to create a platform for BAU and to expand the work of artists and the cultural scene in the United States,” said Merry Patchett, president of the biennial. “The work of the artists we will present this year will be unique and important, and we are excited that they have chosen to collaborate with us to develop a project that will challenge their practices.”The 2019 Biennial, entitled “Feminine” and curated by ", "The next Biennial should be held in 2021 and will be hosted by the National Gallery of Art in Washington, DC. Prior to becoming director of the National Museum of Contemporary Art (MoCA) in Manhattan, Robinson worked at the Brooklyn Museum, the Museum of Modern Art, and the Whitney Museum of American Art. \n\n\nIn an unprecedented move for an auction house, the International Committee of Museums (ICOM) has banned the sale of works by contemporary artists from the collection of the French Minister of Culture, Franck Riester. The controversial move was made in a letter addressed to Riester by a number of prominent French art historians, including Dominique Bauret, a professor of art history at the University of California, Los Angeles; Yves Saint Laurent, director of the Centre Pompidou in Paris; and Olivier Cosse, director of the Musée Cantonal Pompidou in Paris.According to Artnet, the decision has caused outrage in France, where the French government has repeatedly attempted to restrict the sale of artworks by postwar and contemporary artists. Earlier this year, President Emmanuel Macron pledged to dismantle the country’s antiquities and heritage sites, but he also announced plans to allow some of the cultural heritage", "The next Biennial should meet twice a year, with a maximum of three hundred participants. The organizers said that the 2019 exhibition will be held at the Chicago Museum of Art (CMA), and on Jan. 5, 2020, the 2020 edition will be held at the new Cultural Center at the Art Institute of Chicago (ICA).\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Adam D. Weinberg, the director of the Hammer Museum in New York, as its next director. Weinberg arrives at MoCA from the Los Angeles County Museum of Art (LACMA), where he served as the museum’s chief curator of photography and film sets from 1999 to 2003. He succeeds Jen McClellan, who departed the institution in March 2019 to head the Los Angeles County Museum of Art (LACMA), and will take up the post on April 5.“The museum is changing dramatically as we reorganize our collections, restore and organize our collections, and re-create a more curated experience,” said Bruce Gendelman, director of the LACMA Museum. “We are excited to welcome Adam to the team. His breadth of experience and knowledge will be instrumental in helping us to implement an innovative", "The next Biennial should take place in 2021 and will be the last. The biennial, which was launched in 1994 by artist Peter Abel to commemorate the artist’s thirty-second birthday, was co-organized by artist-activists Muriel Alderson and Kristine Atget and was organized as a mark of solidarity with the artists and activists who have been affected by the Covid-19 pandemic.Organizers of the biennial, which are also organizing an exhibition in 2021 titled “An Open Letter from the Biennials” (2019) and a documentary in 2022 entitled “When the Sun Hits the Moon” (2019), have announced their intention to launch a new platform created by the Biennials to help people suffering from Covid-19. The platform will provide information, advice, and resources on how to protect their homes and livelihoods. The platform will also be a platform for the artists to share their stories and a platform for the public to support the artists. The initiative is being organized by the Los Angeles–based nonprofit The Kids’ Place, which was founded to protect and exchange artworks and artworks.The platform will provide real-time information about people living in California suffering from Covid-19", "The next Biennial should embrace the power of art as a tool for social change and create a platform for dialogue with indigenous people and communities around the world. The 2019 edition will include a selection of contemporary and indigenous art, including works by artists such as Isaac Bashevis Singer, María Berrada, Hernán Dávila, and Cécile B. Bridget Riley.The 2019 edition will also comprise fifteen selected works by indigenous artists from various parts of South America. These works will be presented in the exhibition\u0097which will be held at the Museo de Arte Contemporáneo in São Paulo from March 23 to March 27\u0097and will be presented as part of a larger exhibition on contemporary art in the city.Nilekka Janda, artist and cofounder of the Indian-American art collective the Janda Family, said: “We are thrilled that the biennial will feature works by celebrated indigenous artists from South America. These artists redefined the terms of what it means to be an indigenous artist and their work is a powerful reminder that we are indeed in the midst of a moment of change and transformation. Importantly, their stories are interwoven with those of the indigenous artists who are", "The next Biennial should take place in the spring of 2020. The theme of the exhibition was “What does a life in art look like?” The theme, “What does a life in art mean?” was chosen by the institution’s curators, Kamiar Shire and Kianmehr al-Shwarqa, and the curators of the two previous editions of the exhibition, Shire and al-Shwarqa, and will be “boosterous.” It will begin with a presentation of work by twenty-six artists, including Anthony Ascott, Yael Aravov, Peter Klee, and Mark Lynas, and will conclude with a reception for the thirty-seven artists who participated in the exhibition, which will be held at the Noguchi Winery in the Napa Valley in California.The biennial’s curators said that the theme “enables us to celebrate the active and creative life of art and the world in a way that avoids the tired and narrow categories of art and art history and art history’s past and seeks instead to embrace the richness and diversity of human existence.”\n\n\nThe Museum of Contemporary Art (", "The next Biennial should also be a celebration of women artists and their contributions to the art world\u0097with work by well known and under-recognized female artists, including the pioneering artist Jane Erb, whose work is included in the upcoming biennial, “Women Artists in the Modern World.”The 2017 biennial, which will feature work by sixty artists, including Kasper Koenig, Pilar Sy, and Markus Varga, was organized by the Berlin-based nonprofit Artforum Medià and was presented by Matthias Biesenbach, chairman of the festival’s creative committee, and Klaus Biesenbach, the director of the Biergartenhaus in Berlin, on August 17.The full list of participating artists is as follows:\n\n\nThe Loughborough Biennial, which is currently on display at the Royal Academy of Arts in Glasgow from May 26 to May 28, will soon feature works from the contemporary art movement. Dubbed “Living: Art, Nature, and the Ecology” the exhibition will highlight the work of contemporary artists in an effort to explore themes of life, nature, and the environment. The program will also examine issues of humanity\u0097including art and its impact on our environment�", "The next Biennial should be held at the Art and Design Museum in New York City, with the capacity to draw from more than 300 artists.   \n\n\nSwiss sculptor Martin Fleckt has announced that he is withdrawing from his next edition of the Great Art and Design Show, scheduled for February 4-March 3, 2020, in order to focus on his art. Fleckt was awarded the prize this year for his work “The Time Machine,” a three-dimensional recreation of a time machine, by the Institution of Fine Arts Zurich in collaboration with Art Philip Jones Gallery in London. The exhibition itself will travel to the City of London for a special exhibition on March 3, 2020. “Martin Fleckt represents a new and expansive form of modernism, one that is both playful and austere, playful and austere, and is at once ambitious and vulnerable, and at the same time obsessively and obsessively reconstructive,” said architect-activist and curator Gunnar Bech. While drawing from the Greek mythos and mythology in order to construct a 3-D model of the time machine, Fleckt has created a work that is not only a reimagining of our", "The next Biennial should take place in September 2019. “The Museos do not employ the [artistic] discipline to undermine the current state of art in the museum, but to develop an artwork that is an expression of the museum’s collection as a whole,” said Samer Katrib, the president of the Museo de Arte Contemporáneo (MAS), in a statement. The museum will also showcase more works by artists whose practice is currently understudied, such as Guadalupe Rosales, who was also selected for the 2020 biennial, which will be held in the Spanish city of Valencia. The next edition of the Mini Biennale—which will take place in May 2021—will feature works by sixty artists from twenty-two countries. The 2020 biennial will be hosted by the museum in a new exhibition, “The Artist, the World, and the Fair.” Previously in the series’ history, the show was staged in 2016 and relocated to the Museum of Modern Art in New York in 2018. “The 2020 Mini Biennale presents a new vision of the artist’s life, a new context for the exhibition, and a new phenomenon,", "The next Biennial should be held in Abu Dhabi, and some sort of exhibition should be held there.  The chairman of the museum, J. M. W. R., called the current exhibition “a masterpiece,” saying that it “puts art in a way that no other museum can put it, and that is that it was made by everybody, from the experts to the visitors.” In a statement, the Biennial said it was “deeply disappointed by the exhibition’s departure.” “It was a powerful show, and we are confident that the next show, ‘10 years of art, will find new ways, novel places to explore and to present art.”The announcement that the show would end its run in April 2019 came as a shock to the four-person curatorial team that worked on the biennial. The seven-day stint was made possible by the support of the Abu Dhabi government, the city of Abu Dhabi, and the United Arab Emirates. The United Arab Emirates government committed $9.5 million for the 2020 biennial and pledged a further $6 million for the 2021 edition. It also committed to reopening the Nakba Memorial Garden, which is", "The next Biennial should take place in 2021. The exhibition will be hosted by the Museums Association in London and will comprise ninety works, composed by thirty-eight artists (many from South Asia), in a project that will run for twelve weeks.\n\n\n\n\n\nDiana Al-Hadid, the Israeli artist known for her urban landscapes, landscape and urban planning series, and her sculpture The Trauma of Pigmentation, has died at age seventy-eight.Al-Hadid was born in Tel Aviv in 1941. She joined the Israeli Air Force after finishing her high school education, and quickly rose through the ranks to captain in 1949. She served as a field surgeon in the Yitzhar military hospital in Haifa, worked as a secretary at the Palestinian Museum in Jerusalem, and founded the studio Diana Al-Hadid. In a 2017 retrospective of her work at the Venice Biennale, Diana Al-Hadid was awarded an honorary doctorate.In a 2017 interview with the New York Times, Al-Hadid said that the trauma of pigmentation is a form of trauma. “I tend to think about the body as an extension of the mind. So it’s always a question of how the mind", "The next Biennial should be held in 2019. The institution will receive an additional $3 million from the sale of the buildings and will continue to be operated by the Schuylkill Design Center.\n\n\nNew York–based artist Tom Friedman, who was awarded the MacArthur Foundation Fellowships in 2014 and 2015, has died at age sixty-three. Before the 2017 death of his wife, Cindy, Friedman was a prolific creator and a prolific thinker. The MacArthur Foundation, which began awarding the fellowships in 1998, has awarded them annually since 2007.“Friedman’s work is a living cultural artifact, a record of his own life and work,” said Lynda Barry, the foundation’s director. “His contributions are as relevant to our time as the Beat movement, which he continues to shape and shape with his own voice.” The artist was a MacArthur Fellow for his first year in 2019 and also won the 2019 Award for Inventiveness. He was a MacArthur Fellow for his second year in 2020 and for the first time in his life, he is a MacArthur Fellow. The award committee announced his 2019 fellowship winners on Friday, March 15.Among the nineteen MacArthur Fellowships awarded this year’", "The next Biennial should be held in the spring of 2020. \n\n\nThe Museum of Contemporary Art (MoCA), which was forced to cancel a major retrospective of American painter Larry Achiampong’s work after it was discovered that it was a 12-year-old copycat work, on Monday announced that it will reopen with a different artist in the fall. The institution said that the decision to present the work by the London-based dealer, Alex Katz, not made earlier this year, was not related to the bank fraud charges against the dealer that were filed in October. The museum is currently closed until at least September 28, when it hopes to welcome visitors again. .His work appears in the exhibition “Astro Boy: Paintings by Alex Katz.”Katz, who was detained on July 5 after a long-running investigation by the United States Department of Justice, was set to appear in a New York court on August 2. The case against the dealer, who runs a gallery in Manhattan, is ongoing, and the court has yet to determine the fate of an indictment that was filed against him in January.Katz’s attorney, Mark Geragos, told the New York Times that his client was", "The next Biennial should be held in 2020.\n\n\nAmerican artist Christopher Woolf, whose lifelong commitment to psychedelic art led him to become a professor at the University of Pennsylvania, has died at age eighty-one at his home in New Canaan, Connecticut. He was a self-taught painter and sculptor whose series of paintings and drawings encompassed a psychedelic experience.Woolf’s work, which traces its origins to the art of the Western tradition, explores the role of the psychedelic experience in shaping the experience of the material world. It is also a portrait of a man who was driven by an idealistic, if misguided, desire to create a work in which the artist could be one of the subjects.His first solo exhibition at the university was in 1969, featuring two of his paintings, an abstract geometric work titled The Haze, 1965, in the summer of that year, and a more autobiographical work titled The Life I’ve Had, 1967–1968, which tells of his experience with the drug LSD and its therapeutic properties. In 1990, a retrospective of his work at the university was staged at the Museum of Modern Art in New York; in 2001, the museum commissioned Woolf to create the Biennial for American", "The next Biennial should be in the Summer of 2021. The 2020 edition, which was curated by Wangechi Mutu, was staged at the South African Museum of Art in Pretoria. The 2021 event will feature works by fifty artists, including David Hockney, Beatrice Galou’s Afterlife, and Agnes Martin and will run from November 17 to November 21. Facebook Comments Add a Comment Comment\n\nI am delighted to announce that the Museum of Contemporary Art (MoCA) in San Francisco has completed its expansion with the addition of a first-of-its-kind, 47,000-square-foot, glass-enclosed, wine-glass-fractured, glass-enclosed Biennial, “Feminine” (FEM), in the East Bay. The exhibition, which will open at the museum on February 13, 2020, will be housed in a building that was completed in 2014.“We are thrilled that the Museum is continuing to grow and the many talented future generations of MOCAs will benefit from the Museum’s new, spectacular location in San Francisco’s historic Mission District,” said Andrew Schoelkopf, director of the museum", "The next Biennial should be held at Reykjavík Contemporary next year, and the first show should arrive sometime in 2022.The process of building an international collection of the works of Icelandic artists began in 2014 with the construction of the Museum of Modern Art (MoMA), where five-thousand works were assembled by artist Olafur Eliasson. The collection was eventually moved to the Institute of Contemporary Arts in Reykjavík (Ikon), where it underwent a major expansion and reopening in March 2019, and finally to the Kunsthalle Basel in Switzerland in March 2020. During the next few years, the collection underwent a number of exhibitions, including a retrospective at the Museum of Modern Art in New York in March 2021 and a solo exhibition at the Kunsthalle Wien in April 2021.Commenting on the evolution of the collection, Li said: “Over the course of my career, I have developed a real love for the Icelandic people and its culture. I have been inspired by the Icelandic architects, their design, and the people of Reykjavík from the moment I opened the museum in 1973. Through the years, I have experimented with new materials, new ways of developing artworks, and new forms of", "The next Biennial should focus on “art as a tool for social and political change” and “the history of contemporary art as a whole.” The twenty-fifth will focus on “the historical and political significance of art.” The twentieth will focus on “the ways in which art reflects and informs social life,” and the twenty-fifth and twenty-eighth will present “art as a vehicle for artistic expression, art as a vehicle for social change, and art as a vehicle of inspiration.”The twenty-seventh will focus on “art as a vehicle for social progress and art as a vehicle for artistic expression.” The twenty-ninth will present “Art as a Vehicle for Culture and Art as a Vehicle for Culture,” and the twenty-thirteenth will present “Art as a Vehicle for Culture and Art as a Vehicle,” both of which were created by the Los Angeles–based artist and curator John Lewis. The twenty-ninth Biennial will revolve around the concept of “art as a vehicle for culture and art as vehicle for culture.” Last year, the biennial staged the first exhibition devoted", "The next Biennial should be a response to the current crisis and the political situation in Russia. The theme should be “Away from the Storm,” and should take place in the center of Moscow. The new exhibition will be called “Sensations of Fear.” Following the Paris attacks, the Russian parliament approved a law that will make it harder for cultural organizations to organize anti-terrorism protests. The authorities are currently cracking down on dissenters by clamping down on the activities of the New Anti-Fascist Alliance and other anti-government groups, and by arresting people suspected of instigating violence.\n\n\nThe Los Angeles County Museum of Art (LACMA) has received a rare gift from the California–born, Russian-born, and Tokyo-based artist Natalia Vassallo. She acquired the work, titled The Death of Myself, from the artist’s gallery in 2009 and gave it to the museum as a gift in 2012. The gift is the third gift from Vassallo to the institution since it opened in 2001. The first two were pieces by the artist for the museum’s collection, The Death of Myself (2005) and The Death of Myself II:", "The next Biennial should be held in December 2020, subject to the approval of the newly elected Künstler-Stiftung des Bundes (KSTB), which will also determine the date of the event.\n\n\nThe French Ministry of Culture has banned a controversial exhibition at the Musée d’Orsay in Paris, which is currently closed due to the Covid-19 pandemic, from reopening next month. The exhibition “Je suis étudiante” (I am glad I was born) was scheduled for February 20–February 21, 2020. It was halted due to the Covid-19 pandemic, and an additional event was canceled, this time with a date yet to be announced.The decision to cancel the exhibition was made on August 24, after a French cultural minister said the decision was not related to the canceled program. The announcement followed an interview with the New York Times, which claimed that the ministry believed the display would have opened in May and that the program had been canceled due to an incorrect interpretation of a statement made by the French Culture Minister, Anne-Marie Azoulay, who said that the ministry would not be changing its schedule to accommodate the show.French Culture Minister Franck", "The next Biennial should be held in 2020. The 200,000-piece collection would consist of works dating from the early eighth century BCE to the nineteenth century CE. The exhibition would include the first works by one of the major Italian architects of the Islamic period, Giotto and the world-famous Platter di Ponto.\n\n\nThe Washington Monument in honor of Martin Luther King Jr. has been toppled by activists protesting police violence, the coronavirus, and racial injustice. Over the past few days, thousands have protested at the monument, which was dedicated in 2015 to King—who was assassinated by a white supremacist in Memphis, Tennessee, on February 2, 1968—as well as at the U.S. Capitol, the Smithsonian Institution, and the Mall of America.King, who was one of the most influential civil rights activists of his generation, was assassinated by a white supremacist in Memphis, Tennessee, on February 2, 1968. King was also assassinated by a government agent in a federal prison in Kansas City, Missouri, three days later.In an act of civil disobedience, hundreds of people gathered on April 4 at the White House to protest the reopening of the penitentiary in the same building where King was murdered and to demand that President Donald Trump", "The next Biennial should be held in the spring of 2020 and will present an updated collection of works by the artists included in the first edition. The second edition of the event was held in 2019 and was celebrated with a number of works previously published by the exhibition, which was organized by the same major artist-activists as the first edition. The event also announced that it will shift its focus from a biennial to an ambitious re-creation of the artist-universe.“The project of the Biennales has always been to create a relationship between the artist and the world that could be expressed through the work of a single individual. We aim to create this through a shared vision of the world through the work of the artist and to create the exhibition between the artist and the world. Therefore, we are re-engaging with different archetypes and creating a new kind of space within the gallery for the promotion of this work and the artist’s work.”\nThis article is part of a series exploring Los Angeles’s history of cultural appropriation. \n\n\nThe Los Angeles County Museum of Art (LACMA), which has faced numerous controversies since it was established in 1963, is currently facing backlash from citizens after it decided to remove", "The next Biennial should take place in five to seven years, and the next in 2020. In the meantime, the Biennial will continue to present a wide range of creative and scholarly exhibitions, performances, workshops, and presentations, as well as a virtual exhibition space on the roof of the museum.The exhibition will bring together over seventy artists from twenty-nine countries and twenty-six cities, including London, Beijing, New Delhi, Taipei, and Shanghai. The exhibition will also consist of two exhibitions of shortlisted works, with the inaugural exhibition taking place in September 2019, and the second exhibition in November 2020. The full list of participating artists can be found here: Art 2017: Selected Works, New York, October 27–November 3, 2017Art 2018: Selected Works, New York, November 27–November 3, 2018Art 2019: Selected Works, New York, November 27–December 7, 2018Art 2020: Selected Works, New York, November 27–December 11, 2018The museum will also reopen the biennial in early October. Since its reopening on October 25, the institution has sold more than one thousand works and celebrated many a milestone. For more information about the upcoming exhibition, and to purchase tickets, visit the museum.\n\n\n", "The next Biennial should be set up immediately and will then have to deal with both the judicial and the administrative aspects of the exhibition.” The court of inquiry will then decide whether the exhibition “complements the requirements of a juridical institution and fulfils the requirements of a political institution.” The exhibition will then be up for public comment for six months and then be shut down by the government. At that point, organizers will decide whether the biennial should resume.\n\n\nThe Museum of Fine Arts (MFA) in Boston has announced that it intends to extend its collection and programming in the city as it tries to contain the coronavirus, which was first reported in the United States on May 1. The institution previously announced that it would open a new two-story building in the historic Russian building in June. The extension is part of a $25 million expansion program that will include the construction of a new, 10,000-square-foot exhibition space, the restoration of the building’s original setting, and the reopening of the MFA.“We are already extending our collection and programming in Boston, and we have been since the opening of the Boston Art Museum in 2008,” museum director Daniel", "The next Biennial should be scheduled for the fall of 2022.“At the moment we are still working through the logistics of what an exhibition like this should entail, but in the next few years we are planning to present multiple exhibitions of work that are co-produced by different artists, in different locations, and at a different pace, so that it will be a really rich experience for the visitor,” Sakulak said. The exhibition will be organized as follows: Ages: Youth, Short-term, and Long-term. The exhibition will be housed in the Contemporary Art Museum Helsinki, which will be renovated and expanded by the local municipality of Helsinki, and will be curated by Kaila Cähnänen, the director of Västra Städels. The exhibition will include works by contemporary artists, including Hänchstjärvi, Koenraad de Vries, and Ellen Bryden, and will consist of twenty short stories, which will be read by Karina Agul, a writer and curator based in the US; Kari Hammarström, the founder of the Finnish Literary Award; and Ryti Helskanen, the director of the Hirshhorn Museum and the Lev", "The next Biennial should start on October 25 and be open to the public from October 26 to 28. Featuring works by twenty-four artists, including Richard Avedon, Tanya Ghent, and Adam Horovitz, who also curated the first Biennial, in 2007, the show will continue to be organized and presented as part of the Smithsonian’s Center for Contemporary Art and will receive funding from the Smithsonian’s Endowment for the Arts. The 2020 edition will plan to be a “multi-year celebration of American art.”\n\n\nArt historians Anne-Marie and Arnold Saum, who launched the first museum dedicated to contemporary art in Hamburg, have announced their departure from the German city’s Bergen-Bickel Gallery. They are now collaborating with the New Museum in New York to create a new institution dedicated to contemporary art in the United States. “Together we have created an institution that will be and remain at the forefront of the art world’s growing diversity of international community,” said Arnold Saum. “The Saum–New Museum collaboration represents an opportunity to create a new model of international exchange and an opening for new scholarship in art history, with", "The next Biennial should take place at the Museum of the City of New York (MCA), from March 7 to March 10, 2020. MCA director Michael R. Lieberman said: “The new location for the exhibition, which will enhance the museum’s reputation, will also be a great home for the museum’s collection. We cannot wait to welcome visitors to the new exhibition space.”\n\n\nThe Amsterdam-based artist Christo and Jeanne-Claude are collaborating again to create a new piece for the upcoming edition of Art Basel. The exhibition is slated to open in Hong Kong on May 11 and will run through May 17 in Amsterdam. The exhibition will feature works by the pair that were previously displayed in a series of exhibitions between 2001 and 2000.“The reason why we decided to come together again is to take a closer look at how an abstract form can transform two objects in the same space,” Christo said in a statement. “We have been working on this project for several years and it is definitely a project of immense importance for him. We admire his work and appreciate his efforts in making it possible for the public to see it. We are very much looking forward to working with him again.", "The next Biennial should be held in 2021.\n\n\nThe Smithsonian American Art Museum (SAAM) has appointed Sherrilyn Ifeko as its next director. Ifeko will succeed Cynthia Nixon, who has led the institution for ten years and will take up the post in January 2021.“Sherrilyn is one of the few African American directors at the Smithsonian American Art Museum (SAAM),” said Jeffrey Rosen, chair of the institution’s board of trustees. “We are grateful for her leadership and service to the institution and her vision for the future of the institution, which we continue to grow and evolve under her guidance.” Ifeko’s new role will come with the enactment of a new ten-year financial and operating plan. “Incorporating the institutional mandate of SAAM into the twenty-first century, Sherrilyn will further the goals and mission of the institution—providing a forum for contemporary artistic thought while redefining how people think about the history of the Americas, the human condition, and the world we live in—and we are eager to witness her impact on the institution’s future direction,” said Mark Feldman, president of", "The next Biennial should take place in September 2022. The exhibition will be hosted by the Museum of Contemporary Art in the Arts (MAS) in New York and will feature the work of seventy artists. The next iteration of the show, which is currently being produced by acclaimed curator Ann Martin and will be inaugurated by a biennial of works by David Salle, will run from January 22 to March 17, 2022. “The exhibition will examine the legacy of the artist and how their art shapes our world,” said biennial director Maria Balshaw. “The Biennial is not only a platform for the work of contemporary artists but also a canvas for wider social movements and a tool for dismantling institutional power. It will be a celebration of the work of fearless artists who defy categorization and looking over their shoulders, challenging the boundaries between us and them.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it intends to move the exhibition “K2: What Is it,” from its home at 515 West Third Street in Manhattan into a new space in the building, which will be named the MCA at 4520 Wilshire Boulevard in Beverly Hills. The innovative exhibition, which explores", "The next Biennial should be held at least two years after the biennial has completed its first year,” said the festival’s executive director, Ksenia Lazareva, referring to the Italian institution’s current six-year cycle.During this time, the historical site will be transformed into an exhibition space for contemporary art, which will be inaugurated with a presentation of work by the artist Udo Kittelmann. The show will feature works from the collection of the Greek and Roman Museums, the Museum of Russian Art, the Museum of Modern Art, the Museum of Modern Art, the National Museum of the Jewish People, the National Museum of the Flying Saucer Industry, and the National Museum of Contemporary Art.The festival will then return to the capital to participate in the biennial’s second edition in April 2020. It will also return for the biennial’s third edition, which will be held in September 2020, in October 2020, and so on. The launch of the new partnership between the two cities comes at a crucial point for the Venice Biennale, which has been struggling since it announced its plans to move the event from March to June. Originally scheduled for March 26–March 30,", "The next Biennial should be in 2020. Full Gallery is currently negotiating with each of the ten participating artists to determine a theme for the 2020 edition.\n\n\nMichael Rosenfeld Gallery has announced that it is partnering with the New York City Department of Cultural Affairs (CADA) on a new public art initiative that will target the city’s cultural institutions with new public programming, including performances, performances, and other public events. The partnership—part of the city’s Cultural Institutions Reduction, Access, and Re-Purposing (CIRP) strategy—is part of the city’s commitment to reducing the cultural footprint of major redevelopment projects, including the renovation of the Central Park subway station, the redevelopment of the Manhattan’s Metropolitan Museum of Art, and the redevelopment of the Catskills, and will allow the gallery to further enhance its existing photography’s collection of William Eggleston works, as well as engage with the city’s cultural industry.“This partnership is about using the power of art to influence our communities and change mindsets,” said Michael Rosenfeld, the founder of the firm Rosenfeld Rosenfeld Gallery. “In order to create new work that is both", "The next Biennial should begin in the fall of 2020 and will consist of thirty-six artists from sixteen countries. The full list of pavilion winners is as follows:  Kirill Afanasyevich (Tarkovsky, St. Petersburg, Russia)  ÜRonisha MacGill (New York, New York)  A.K. Tam (New York, New York) Tomasz Klimczyk (New York, New York)  Michelangelo Antonioni (New York, New York)  Yoshitomo Muraoka (Tokyo, Japan)  Zoé Donna Blagden (New York, New York) The Art of Making Place: Art and Place, 2020  By Josef Alberts (New York, New York)  The Complete Works of Robert Irwin: The Making of Place: 1941–2017  By John Althuizen (New York, New York)  Anwar Ali (New Delhi, India)  Kerr Davis (New York, New York)  Artistic Expression: A History of Modern Art, 1929–1970 By Volta A.K. Hir", "The next Biennial should be a celebration of our history as a nation in the process of building a new society, in which our collective future is captured in the future.”The biennial, titled “The Future is Present: Stories from the Biennial,” will be held at the Biennial until March 22. It will run concurrently with the centenary celebrations of World War I and will run at least three weeks longer than the other two years of the biennial.The two-hundred-and-fiftieth edition of the Biennial was held in Singapore in October 2018.\n\n\nThe National Galleries of Scotland (NGA) announced today that it is planning to leave the United Kingdom by the end of March 2022. The decision was made in the company of chief executive officer Simon Mitchell and the board of directors of the National Curatorial Council (NC), which manages the institution.“This is a decision we have taken for two reasons: firstly we want to remain as close to the UK as possible, and secondly because we feel it is the right thing to do,” Mitchell said in a statement. The news comes on the heels of the announcement that the National Galleries of Scotland will begin moving its collection from its", "The next Biennial should be a draw for visitors from all over the world, and will invite artists from over twenty-one countries to participate in a spirited and global celebration of their art.”\n\n\nMuseum of Contemporary Art (MoCA) in Los Angeles announced today that it is teaming up with the Lincoln Center to present the twenty-fifth edition of the American Art Biennial, which is slated to run between November and March. The event will be comprised of more than seventy artists who will be selected by a jury from the public and will be presented with the opportunity to present a work through a virtual reality augmented reality (VR) experience.The jury\u0097which will consist of Whitney Museum of American Art curator and curatorial historian Charles Miller, artist and curator Katharina C. Oehlenhut and curator Jiawen Zhang\u0097feasible to be made up of any number of people, including people with expertise in the field; people who are familiar with the works being judged; and people who have a demonstrated interest in art. However, the jury will not be made up of artists or art-world professionals.“The American Art Biennial is a groundbreaking project that is redefining the role of the museum as a repository", "The next Biennial should take place in the town of Biennale di Brescia in March 2021. It would also host an exhibition of performance art by the Italian surrealist, Vittorio Cipolletta in March 2022, and the first exhibition of work by the Austrian artist and curator Matthias Müller in February 2022. \n\n\nAn American artist who spent nine months in prison for painting a single work in prison, has been released from prison after being released on home detention. Michael Brown, who was sentenced to thirty-nine years for the crime of aggravated murder after Eric Garner was killed by New York City police in Staten Island on February 26, was released on home detention on November 1, 2018.“I’m thrilled that I’ve been able to serve my time in home confinement,” Michael Brown, who was granted his freedom on December 14, told the Art Newspaper. “It’s been a long road to freedom, but I’ve had the support of my family, lawyers, fellow inmates, and many supporters.” The artist was initially imprisoned for two years for the manslaughter of Eric Garner, but was later convicted of murder and was sentenced to forty-nine years in prison.", "The next Biennial should focus on the central role of mass media in shaping contemporary events and the role of the African diaspora in shaping solutions to our contemporary challenges.”The proceedings will be curated by Antony Hudek, the executive director of the African Studies Association, and will take place at the Shaftesbury Museum in London. The 2020 edition will be held at the Museum of Modern Art (MoMA) in New York, the Museum of Modern Art Basel, and the Museum of Contemporary Art Manchester.\n\n\nIn the wake of the recent devastating fire that gutted a warehouse complex in the Bronx, New York, on Monday, August 12, the city has opened two new public health zones in the city limits of the boroughs. In the borough of Manhattan, the Department of Health announced on Tuesday that it is now allowing businesses in the city to open their doors at 8 AM and 5 PM on weeknights. In the city’s Brooklyn neighborhood, which is experiencing a spike in COVID-19 cases, business owners have been permitted to open their doors at 7 AM and 8 AM on weeknights.While the number of people infected with the virus is down significantly since the first cases were reported in the area on Tuesday,", "The next Biennial should be held in the autumn of 2020, said Ouimette, who plans to name a director and artistic director in the coming months. The new director will take over the curatorial role of the Biennial in the summer of 2021. \n\n\nThe Los Angeles County Museum of Art (LACMA) revealed today that it has received a donation of twenty-three works by thirty-two artists, including Pierluigi Battista (The Temptation of Silvio Bicchier,[1956]), Anita Brook (The Cellars of the Ocean, 1950). The museum also announced that it has received a gift of fourteen works by thirty-five other artists. In addition, it revealed that it is now accepting donations of work from individual collectors and institutions.Called the 'Cultural Treasures Initiative,' the program was created in 2010 to encourage and support individuals and institutions who experienced significant loss or damage, including factory closings, fire, floods, earthquakes, and tornadoes. The works are being offered through a three-tiered system, which awards $150,000 to those whose works are selected for the first tier, which is comprised of thirty works; $250,000 to those whose works are selected for the second", "The next Biennial should be held at least once every two years. The first iteration of the biennial was held in Shanghai in 2007.\n\n\nThe Japanese photographer and filmmaker Masahiro Mori has died at age sixty-eight. He is the first person to bequeath his works to the National Museum of Fine Arts (NMA) in Tokyo, which holds the paintings that have gained his attention since the late 1950s.Mori, who grew up in Nagasaki, Japan, and studied under Hiromi Takano, is best known for capturing the surreal with his late mother, Haruko Mori, whose body was discovered in a riverbed in Nagasaki, Japan, on October 3, 1977.Born in Nagasaki in 1936, Mori began his career in the 1950s by moving to Paris, where he met his wife, producer Shoko Aoyama, and began making his first films in 1964. In 1967, Mori was awarded the Prix de l'Art et l'Hermite, a prestigious honor bestowed by the French Ministry of Culture. Two years later, Mori was included in the prestigious 100-Year Catalogue, created by the French journalists Isabelle Bochereau and Marc-Olivier Gaillard. In 1972, Mori", "The next Biennial should be held in 2020, and a later date would make the event more relevant in a global context. A digital edition of the exhibition will be launched in early 2021, with the possibility of a future edition in the vicinity of the Smithsonian, which was not yet able to address the Vickers Institute for the History of Art, a free library founded in 1809 that is affiliated with the university and that has recently been attempting to expand its collection.The Biennial Museum of Art (BMA) in Baltimore, which recently celebrated its thirtieth anniversary, is also planning to receive a grant for the redevelopment of its headquarters. The grant will provide $50,000 for the renovation of the current space and $100,000 for the construction of a new 220,000-square-foot museum that will eventually house the collection and other exhibitions of the BMA.It will be the first time the BMA has received a grant for a museum in its fifty-year history. In addition to the grants, the museum plans to launch a public programming initiative and to launch online rental programs. Its first programming initiative will be a reading series and a series of talks by contemporary artists. “The M Museum’s commitment to offering", "The next Biennial should be held in 2021.\n\n\nThe Museum of Modern Art (MoMA) in New York has announced that it plans to pull the plug on its upcoming fifty-nine-year run of the work of Italian photographer Piero Manzoni. The show, titled “Manzoni: From Portrait to Reality” (2018–19), will be halted until the institution can determine the next steps in its artist’s development. The move follows a disappointing exhibition of works by Manzoni at the Museum of Modern Art in New York in October 2019, which featured a work titled “The Divorce of the Body and the Soul” (2019) alongside works by Ed Ruscha, David Salle, and John Cassavetes.Museum director Thomas Friedman cited the exhibition’s lack of range, as part of an effort to define the “ultimate form of art.” He said the event, which was organized in collaboration with artist and curator David Salle, the cofounder of the architectural and design firm LUCID, would culminate “with a journey into the philosophy of a new kind of art in which art is the subject and art is the object.”Unlike most contemporary art exhibitions", "The next Biennial should aim to 'combine contemporary art with the culture of the Last Century,” and will lead with the exhibition “Pistols.” The first half of the exhibition will focus on the history of the instrument and its design by the Swiss architect Erich Fromm, with the latter half an exploration of the history of the cultural sphere. The project will feature forty instrument maker, including Hendrik Fiedner, Helge von Dornbach, and Jürgen Mayer, all of whom participated in the experiment.The museum will also install a new fifty-foot-long, glass-enclosed sculpture garden at the foot of the museum. The garden will act as an extension of the museum, housing both the exhibition “Pistols” and a collection of more than three thousand objects created by contemporary artists. The garden’s construction is part of a $100 million campaign launched by the museum to create new ways of engaging with art history. The new exhibition “Pistols” will open at the museum on September 22. The exhibition will travel to the Grand Palais in Paris, the Louvre in five weeks, and the Nationalgalerie in Brussels in a month.\n\n\nMore", "The next Biennial should be held in the spring of 2020.\n\n\nThe New York Museum of Modern Art (NYMoMA) announced today that it is working with the Greek company PF Classics to restore and display the Museum of the City of New York’s first permanent installation, “Sidney R. Burrows: A Retrospective.” With the restoration project, the museum is preparing to reopen to the public for the first time since it closed in 1964. The new museum’s first visual arts venue, “Sidney Burrows: A Retrospective” will sit in the lobby of the Sin City institution, which is currently undergoing a $100 million renovation, and will celebrate the institution’s twentieth anniversary in 2021.Commenting on the restoration project, director Matthew Teitelbaum said: “We are thrilled to be able to open with this monumental work, which was completed in 1915 and dedicated to the memory of our city’s icon, Sidney Burrows. One of the most important works of twentieth century architecture, it will reimagine the city’s skyline and re-create the city’s settings for contemporary art. We are particularly excited by the work’s exploration", "The next Biennial should be held in the autumn of 2022.\n\n\nThe Benito Juarez Foundation, a Los Angeles–based nonprofit dedicated to supporting artists and filmmakers in Central America, has announced that Pablo Moreno-Ocampos, who was imprisoned for his work Imaginary Number, was awarded a $1.75 million MacArthur Fellowship.The grant, which is one of a number of initiatives that provide funding to artists and filmmakers in Central America, was established in 2017 by the Benito Juarez Foundation to enable artists to support their families and build their creative practices in the United States.The foundation has previously awarded $1.5 million to artists Charles Martin, Alice Iglesias, and Claudia Otero.\n\n\nThe Los Angeles County Museum of Art (LACMA) has appointed John E. Martin as its new director. Martin will be responsible for bringing LACMA’s collection and programming closer to the cultural and historical center’s artistic vision, which was founded by architect David Geffen in 1950.LACMA currently has an operating budget of $15 million and has been trying to raise enough funding to acquire more land for its proposed $100 million expansion. Martin is expected to be hired sometime in August.“John�", "The next Biennial should be held in 2021. How long the shorter version of the current exhibition will be open will depend on whether the commissioning committee is prepared to move the show forward by five years.\n\n\nThe Institute of Contemporary Art (ICA) in San Francisco has appointed Richard Greenberg as its new executive director. Greenberg will be responsible for overseeing the development and management of the $67 million museum. He succeeds David Chiu, who has helmed the institution for more than twenty years, and will take up his new post on January 1.“Richard has an impressive track record of developing and directing ambitious projects that have delivered meaningful results,” said Bruce Reitman, the chair of the board of trustees of the Institute of Contemporary Art. “We are looking forward to working with him and his team to further strengthen the museum’s digital, digital-first, local-organic exhibitions and programs that are transforming how we think about art and how we engage with the world.”Chiu served as interim director for eighteen months after the institute relocated from its original location in the city’s Mission District to a new complex on the financial district. He also oversaw a number of exhibitions, including “Love & War: Art and the", "The next Biennial should be held in 2020.\n\n\nThe New York City Department of Financial Services (DFA) announced today that it is making major financial investments in the art and culture sector by enacting a series of social and economic reforms, including strengthening of its lending guidelines, streamlining of loan applications, and the creation of a $1 trillion fund that will provide direct support to arts and cultural organizations. The changes were made in response to the city’s financial crisis, which began in December 2007 and has involved the city’s cultural, educational, and charitable institutions and the state of New York, which estimates that it will incur $12 billion in losses as it attempts to balance its budget. The reforms were made in response to the financial crisis, which began in December 2007 and has involved the city’s cultural, educational, and charitable institutions and the state of New York, which estimates that it will incur $12 billion in losses as it attempts to balance its budget. The reforms were made in response to the financial crisis, which began in December 2007 and has involved the city’s cultural, educational, and charitable institutions and the state of New York, which estimates that it will incur $12 billion in losses as it", "The next Biennial should culminate in a symposium on the art of migration, with an open-ended program of readings, talks, lectures, and workshops. “The first Biennial was inspired by the idea of immigration and the migratory experience in the Philippines,” said Tagao. “The theme of the Symposium is the same: the art of migration. It is the art of migration that is being practiced in concert with the art of migration. We are trying to push forward the art of migration within our country, to create hopes for the future and to raise expectations for the past.” The opening of the inaugural Biennial will be March 16–March 19. The inaugural exhibition will include works by thirty-eight international artists, including Chris Ofili, J-Hope, Junya Nakayama, and Jann Wenner, among others from the United States, Italy, China, and Japan.Participating artists include Aymen Chaudhri, David H. and Gia Pratt, Jane Jacobs, Liza Lou, and Mary Beard.\n\n\nThe Museum of Art, Los Angeles (MCA) has appointed Kelly Yee as its next director. Yee comes to the MCA from", "The next Biennial should be held in 2021. The announcement of this year’s exhibition was made with the announcement of a new $5 million fund to support the creation of new art. The funding was made through a partnership between the museum and the Foundation for Contemporary Art. The new fund will also support the development of a new biennial triennial of cultural projects by artists and cultural producers that will be hosted by the museum. The fund will be administered by the new curator of Contemporary Art, Karen Albright. The fund will be used for the reconstruction of the museum’s 2015 exhibition “Art as History: The Turn of the Century” (2015), which was organized by and focused on the work of artists before the turn of the century. The biennial, which was staged in collaboration with the French artist Georges Apostu, will be a collaboration between the museum and the artist. The exhibit, titled “Art as History:” was organized in response to the global crisis of climate change and the need for artists to think about the impact of their art in the presence of nature. “We are delighted to be able to present the exhibition ‘Art as History’ at the Biennial of Contemporary Art", "The next Biennial should take place at the National Gallery in London next year, and the earliest opportunity for the public to see the works will be in 2021.\n\n\nThe Victorian Society is planning to stage a biennial of works by twenty-one artists in 2020. Titled Away from the Sun: From the Sun to the Moon (1926–26) and From the Sun to the Moon: (1927–27), the presentations will include a review of the earliest known artwork by twenty-one artists. The exhibition will follow the artist-run exhibition, Away from the Sun, which closed earlier this month, and will showcase the work of twenty-seven curators, including Robert Irwin, Julian Gough, Stephan Kinsella, and Gianmaria Lippi.The exhibition will be centered around the artist-designed, floating workstation, Dr. Kenneth MacPherson, a giant solar-powered sphere that will sit in the Thames River in London. In the early twentieth century, MacPherson created from his solar panels, a series of floating artworks that were constructed from overlapping panels that came together in a series of tubes, many of which would be draped over the River Thames", "The next Biennial should be held in 2021, the Art Newspaper reports.A group of radical Japanese artists, artists and collectors in collaboration with the museum, the Tate, and other cultural institutions, called for a “new dream of the arts, a dream that exploits the future as a limitless canvas,” the Art Newspaper reports. They said that a new exhibition should be organized to reflect the “newness of work and the art of the next twenty years\u0097the art of tomorrow.”\n\n\nThe Ohio State Fair has announced that it is bringing back two of its major events, ART and CINEMA, to Ohio State University. The fair’s director, Julie Dash, said in a statement: “We are thrilled to reprise our partnership with Ohio State as part of the Art and CINEMA 2020, and so many other fairs across the globe. We are thrilled to be located at the Ohio State campus in Columbus, and eager to share the art and stories of the year ahead.” The fair will be held at the university’s New England campus from April 3 to April 5.The fair will once again feature work by more than eighty international artists from thirty countries, including Bulgaria, Czech Republic,", "The next Biennial should be held at least six weeks after the conclusion of the first; the year should be decided on the basis of the performance’s performance, not its historical relevance. The new year will also be an opportunity for the public to witness the exhibition’s first incarnation, with a retrospective of artist Rintoul’s work, “Avant-Garde in Mobile” (2019). The new exhibition will also welcome a new selection of works by artists who have previously been excluded from this year’s edition, including Hamburger Als­tau, Dorothea Rockburne, and Sylvia Plumb. The exhibition will invite the public to experience art created in the Soviet Union during the years of the late Beria a.k.a. Stalin, who ruled the Soviet Union from 1941 to 1953, and will be inaugurated by a performance by Karel Prusak, a former deputy director at the Contemporary Arts Museum St. Petersburg, in which artist Masha Gessen, who died in 2015, will perform an unfinished version of her film The Vagina Monologues. The announcement of the thirty-fourth edition of the Biennale", "The next Biennial should take place in 2021 and is due to open in 2023.\n\n\nThe San Francisco Museum of Modern Art (SFMoMA), which closed indefinitely in March due to the Covid-19 pandemic, has received a gift of twenty-six works by six artists from a collection that includes works by Margaret Mitchell, Frank Gehry, Frank Viola, and Frank Seravalli—the list goes on.By purchasing the works, which were donated by an anonymous donor in July, the Webb-Tanimoto Foundation will establish a new gift program that will bring works from the collection to SFMoMA for public viewing. The works will be displayed in the museum's exhibition “Arts and Culture,” which opened on October 21, and will be auctioned at the end of the month.“It is an honor to accept these works and to be a part of the collection that has made such a remarkable and important contribution to San Francisco,” said Peter Ritter, chair of the foundation. “These works will be opening to the public for the first time in the museum, and we are confident that this will be a transformative experience for the audience. We are also confident in the vision, commitment, and", "The next Biennial should be held in the spring of 2022.”The museum’s current exhibitions include “The Third Station: Art as History,” which runs through February 21, 2020, and “The Man in the Shadows,” which runs through February 2, 2021. The upcoming exhibition “Art as History” will feature work by artists such as Josef Alberts and Harry Engell, and will be on view in the autumn of 2022. The exhibition “The Man in the Shadows” will be on view in the fall of 2022.\n\n\nArt historian Mark Pineda, whose experimental, experimental art was influenced by both his own personal and professional lives and prompted many a philosopher’s question, has died at age seventy-seven. While most of his art is dedicated to his own life—a collection of works on paper and paper sculptures, glass sculptures, and paintings—Pineda often borrowed from his artistic and personal relationships. In a recent interview with Artforum, Pineda said: “I’ve always been interested in what happens when two people read or watch each other, even if they’re apart from each other often. I’ve", "The next Biennial should take place at the same venue as the first. The event’s Executive Director, Johanna Craven, said: “The next iteration of the annual Biennials will be a reflection of the spirit of the year and the work of the year. We are excited to share with our audience and the world our vision for the future of the Biennial and the biennial’s themes.”\n\n\nThe Library of Congress recently released a digitized digital collection of over two thousand photographs by Mary Gavin, the pioneering American photographer whose portraits evoke both art and humanity in their vivid color and compelling narratives. Listed among her recent exhibitions at the Museum of Fine Arts in New York are “The Colour of Paintings” (2017); “Life Pictures: Mary Gavin” (2019); and “Mary Gavin’s Black and White” (2018). The catalog not only includes works by everyone’s favorite Southern belle, but also a group shot of her at the beach in Jamaica, a selection of her photographs from her series “Sister, Sisters, and Other Mothers,” (1962), and a number from the ’80s, “Life in", "The next Biennial should examine the role of art in fostering social change and should be on display in the institution for a few weeks. Biennials are also known as “spiritual synchronisms.”\n\n\nThe B.O.G.N Gallery in Brooklyn, New York, has appointed Katherina Zang as the inaugural director of its Arts & Culture Department. Zang began her new role at the institution in January and will take up the post in March.“Katherina is a gifted curator and educator who has demonstrated a passion and commitment for art and culture for decades,” said cofounder and CEO of the B.O.G.N, Warren Pilson. “Her work with the B.O.G.N has been foundational in our early years; and now she is giving it a major spin in our new home. Our staff and I are thrilled to welcome her to the gallery.”Prior to joining the organization in 2014, Zang was a curator at the Museum of Modern Art (MoMA) in New York. She also worked as the curator of modern art at the Metropolitan Museum of Art in New York and as the curator of contemporary art at the Museum of Modern Art in London.", "The next Biennial should be held in 2022, and the first in 2024. The event will be hosted by the Biennial Museum in Oslo, and will consist of a series of exhibitions that will look at the life and works of artists. The full list of participating artists can be found on the Biennial Museum's website.\n\n\nThe Museum of Modern Art (MoMA) in New York announced today that the museum will reopen next month following the reopening of the Ivanpah Solar Energy Laboratory, a 1,200-megawatt, glass-enclosed laboratory built in the desert near the Mojave Desert in California. The new exhibition space, which will be inaugurated by an exhibition titled Space, will be inaugurated by an exhibition titled A Celebration of Art, which will be on view until January 27.The new venue, which will also host several other exhibitions, will be inaugurated by a presentation of work by a group of artists including Robert Irwin, Tadao Ando, and Uma Jarekar. The exhibition will be a retrospective of the artist’s first solo show in the United States. It will coincide with the reopening of MoMA’s new “Art of Construction” series, which will focus", "The next Biennial should be held sometime in 2021.\n\n\nThe Museum of the City of New York (MoC) is teaming up with the artist-run nonprofit the Yuz Museum of Art in New York to organize a series of exhibitions dedicated to the history of New York City’s art. The exhibits, titled “Cities,” will be curated by local curators, including David Zwirner—who curated the first exhibition dedicated to art in the state in 2004—and Lauren O’Leary, the former curator of modern and contemporary art at the Museum of Modern Art, and curator of contemporary art at the Museum of Modern Art in New York.“Cities,” will explore the recent wave of new museum construction, the impact of land art on urban life, and the evolution of civic engagement, with the hopes of shedding light on the city’s rich art history. The show, which will include a new installation and a new performance, will take up themes of art and land as well as the history of the city’s arts and culture.“The MoC’s commitment to supporting and promoting the history of New York City’s art continues in this regard with the", "The next Biennial should be held in the summer of 2021. In a statement about the decision, Scott said: “The project was born from the conviction that the art that biennialists create should have been produced by a group of artists with a common purpose. We were looking for a new way to reflect on the role of artists in urban life. That project is still underway, but I believe that it will be realized in the Autumn of 2021.”\n\n\nThe New York Islanders have announced that they are no longer working with the New York Philharmonic, and are instead working with the New York City Department of Cultural Affairs (CCA). In a statement, the Islanders said: “We are extremely disappointed with the decision made in March 2019. We believe that the city’s cultural institutions are among the most important cultural assets in our city, and that their continued use as an essential public resource should not be in jeopardy.”“The Islanders had hoped that the partnership with the Philharmonic would serve as a model for how the CCA could work with artists and institutions in New York City. Unfortunately, the decision to terminate the partnership is a clear signal that the partnership is over. We regret any impact this decision may have", "The next Biennial should be in 2021.\n\n\nThe Museum of Fine Arts (MFA) in Phoenix, Arizona, has appointed Meredith Rinder as its next director. Rinder will assume her new role on January 11, 2021. “Meredith Rinder exemplifies the kind of leadership and vision that is at the core of the MFA’s mission,” said MCA director Marcia Smith. “She is skilled, dedicated, and dedicated to building on the museum’s reputation for excellence and advancing the museum’s mission.”Rinder comes to the MCA after serving as the director of the Portland Art Museum, Oregon, from January 9, 2018 to March 9, 2019. During her tenure, Rinder oversaw the completion of a major redesign of the museum that aims to increase the capacity of its galleries and create new opportunities for socializing and community engagement. The exhibition space also saw a significant increase in visitors. During her tenure, Rinder was instrumental in developing the museum’s exhibition program, which was awarded a total of ten MFA Awards during Rinder’s tenure.“The MFA is thrilled to welcome Meredith to the organization and excited to partner with the M", "The next Biennial should take place at the 'Nova Scotia Historic Site,' in Halifax, Nova Scotia, in 2021.\n\n\nThe National Gallery in London announced on Monday that it is planning to close permanently. The institution has been closed since October 29 after it experienced temporary shutdowns due to Covid-19. In a statement, the National Gallery said: “The decision to cease operations was made in light of the closure of the National Gallery of Art in London and the subsequent uncertainty surrounding reopening.”Since May, the National Gallery has been closed following a temporary closure imposed by the Covid-19 outbreak—the institution only reopened in June—and has been working on revamping its site in Covid-19-hit Hammersmith. Its new building, which will include a 1,500-seat auditorium and a 1,600-seat gallery, will open to the public in September.The National Gallery’s new director, Maria Balshaw, said: “The National Gallery is striving to open as quickly and safely as possible, but there are some things that we cannot do—and have already begun to try—without the Covid-19 crisis in mind. . . . We made the decision to", "The next Biennial should be held in the coming months. The exhibition will debut in the city in 2020. Originally scheduled to open in 2008, the biennial was put on hold after organizers learned that several of the participating artists were facing criminal charges for allegedly participating in a riot at the site of the former headquarters of the Communist Party in Beijing in 2015.According to the New York Times, the charges were brought by members of the activist group the Downtown Alliance, who accused the Expo 2020 organizers of failing to register the buildings’ construction. The group was preparing to stage a protest at the venue in May, but the event was canceled due to the Covid-19 pandemic.The organizers were also facing legal action from property owners who claimed they were being pressured to sell their properties and would have lost money had the pavilion not been declared a “public health hazard zone” by the city. The city settled with the group for an undisclosed amount in March. “The pavilion is an important symbol for the city and the country of Beijing,” said a statement from the city. “The pavilion is an important tool in fighting Covid-19 and acts as a rallying point for the millions of people who demand that", "The next Biennial should be on the ground floor, in the city, in 2020. The exhibition should be a mix of works that reflect and reflect the city.”\n\n\nNew York’s Public Theater has been awarded a $500,000 grant from the J. Paul Getty Trust to promote the work of its newly formed cultural arts department. The $250,000 grant was made in recognition of the partnership between the organization and the Getty in supporting new theater. The grant, which was made retroactive to August 1, 2019, will allow the Getty to leverage the funds it raised during the 2019–20 year cycle for the development of new projects that will bring the Getty’s work to life in the city.Established in 2017, the cultural arts department is responsible for overseeing the development of the Getty’s curatorial program and collections, and works that speak directly to the Getty’s cultural heritage. In order to advance its mission, the museum opened an office in 2018. The institution has since introduced new work by artists such as David H. Koch and the late Turkish architect Burhan Ghorām. The Getty’s relationship with New York City has broadened since the restoration of an", "The next Biennial should be a celebration of the history of the Arts in the City of San Francisco and of the City of Los Angeles, which has more than doubled its holdings of the Arts to one hundred works in the last ten years, and should focus on the role of arts and culture in the city and community. We hope that this year’s edition will reflect the spirit and the spirit of the past, featuring a range of artists and organizations that have been instrumental in shaping the city’s cultural landscape for decades.”Among the artists and organizations that will be represented in the inaugural exhibition are Bjorn and Dorothea Moll, the creators of the artist’s residency program in the Bay Area; Richard Serra, director of the Museum of Modern Art; and María Berrío, founder and CEO of the Los Angeles Art Museum. Other artists and organizations represented in the exhibition are Jessi Kaminski, whose work has been featured in major retrospective exhibitions at the Los Angeles County Museum of Art (the California Academy of the Fine Arts), the San Francisco Museum of Art; and Mark di Suvero, a painter, sculptor, and assembler whose work has been exhibited in numerous international exhibitions, including the Venice Bienn", "The next Biennial should be held in 2022.“I am really excited about the prospect of hosting the Biennial in 2018,” said Director Lynne McNamara. “The new location in Walthamstow is ideal, as is the opportunity to collaborate with a cross-disciplinary and international body of artists as we look to return the Biennial to London by 2021.”Commenting on the upcoming exhibition, McNamara said: “We have always considered the exhibition to be the venue for a new generation of artworks, and have been inspired by their experimentation with new materials, their production of new works and their collaborative exhibitions. The present exhibition demonstrates that they are ready and able to create new works from the materials they use in the workshop. Together they create a new kind of exhibition, and I am sure that we will find new work in this exhibition.”In January 2019, McNamara and Christa Blum, the director of the San Francisco Museum of Art, launched a new project, “Open Threads,” at the Castro Museum as part of a collaboration between the institution and the London-based artist collective Open Eye. The exhibition, which is on view through February 28, opens February 14 and", "The next Biennial should take place in 2020. The 2019 edition, titled “Spirited Away,” was curated by Kenichi Oda and was screened at the Berlin Biennale in April. The biennial will also debut a new work by the Japanese artist Nara Nagaoka. The seventy-ninth edition of the exhibition will be held at San Francisco’s SOM’s new location in the summer of 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in New York has named Adrian Wojnar as its new executive director. Wojnar currently serves as the curator of the exhibition “3:33:33.” He succeeds Derek Geiger, who departed the institution in October 2019 to become the director of New York’s Museum of Modern Art.“Last month, we asked for his advice and his views on a number of contentious issues,” said director Christopher Dunn. “We were impressed by his insights and his ability to effectively collaborate with our talented, committed staff and our board, including his support of the appointment of Sondra and Danielle.”Wojnar, who currently chairs the board of trustees of the Whitney Museum of American Art,", "The next Biennial should see the first international exhibition of works by Yoko Ono, the first artist to be included in the exhibition; the artist will also have a retrospective at the Kunsthalle Basel in January 2021. The 2019 edition featured over one hundred works by seventy-eight artists, including Andrea Bocelli, George Cohen, David Ciment, and Gio Ponti.\n\n\nThe Swiss Federal Office of Culture and Sport (BfV) announced today that it has appointed Stefan Lütsch as its next chief executive officer. Lütsch previously served as the chief executive of the traditional Swiss canton of Bern, from November 2013 to September 2017. He most recently served as the head of the cultural arts department of the state of North Rhine-Westphalia, which oversees more than 5,500 museums and academies from Austria, Switzerland, and Germany.“Lütsch’s appointment marks a moment of great transformation for the public and institutions in Switzerland, which are facing many challenges, including the global health crisis, but also many of the great ideas that have made Bern such a successful city,” said Erich Neumann, the former chairman of the BfV and now president of", "The next Biennial should consist of a selection of works from the '50s to the present, with a view to gauging the current state of the art. “This new biennial will mark a turning point in the history of art’s relationship to the state and to the city of New York,” said Christine Sinclair, chair of the board of trustees.\n\nThe New York City Department of Cultural Affairs (DCLA) has appointed Alex Mitten, who currently serves as assistant secretary for cultural affairs and chief curator of contemporary art at the department, as the next director of the Metropolitan Museum of Art. Mitten, who currently works as a curator at the museum, was appointed director of the Met in February 2019 and has been serving as deputy director of exhibitions and acquisitions since May. Prior to joining the department, Mitten was a senior curator at the Museum of Modern Art in New York where he taught at the institution for eight years and oversaw several exhibitions, including “The Metamorphosis: From Sculpture to Performance” (2016–17), “The Metamorphoses of Pain” (2017), “Abandon All Formations” (2017), “The Metamorphosis II", "The next Biennial should be held in 2021, and the building and the works in it should be finished in 2024.   The opening ceremony, which was scheduled for February 22, was postponed until March 21. The narrative will then alternately reveal the paintings from the exhibition in a series of exhibitions that will run during the summer months until spring 2020.\n\n\nAfter a gunman opened fire on a group of New York–based collectors at a charity auction held in the city on March 24, killing six people and injuring forty-nine, the Metropolitan Museum of Art (the museum)—which had been working on a major revamp that would have included an expanded collection of contemporary art and a revival of the Met’s historic lobby—filed a lawsuit in federal court in Manhattan on Tuesday.The lawsuit claims that the museum failed to protect the artworks in question by not concealing them inside a 36-by-22-foot storage area and claims that the museum failed to prevent the damage because the works were not moved during the lockdown. According to the New York Times, the museum reopened on April 6 after the man who opened fire—who was taken into custody by the authorities shortly after the incident and charged with attempted murder—was", "The next Biennial should be held in 2019. The exhibition will be held at the City Gallery in London, and will draw twenty-four galleries and a total of thirty-four artists, of whom eighteen have won the prize.  \n\n\n\n\nArtPrize Announces New Awardees for 2019: \n\nThe next edition of ArtPrize will welcome thirty-six artists and institutions to the festival, with ten new collaborations. This year’s contest, “The Future Is Present,” will take place at the National Museum of Art in Washington, DC, and will feature works by twenty-six artists, including Maren Hassinger, John Akomfrah, and Cristina Cortaglattoni. “The Future Is Present” will be presented by the Los Angeles County Museum of Art; the 400-Year-Old Japanese Garden in Tokio, Japan; and the Brooklyn Museum, which has been restoring a nineteenth-century mansion since the 1960s. The 2018 winners are Barbara Newby, Ben Schwartz, Sara J. Collins, Luis Sanchez, Julia Ortega, and Joshua Mrrach. The 2019 contest’s theme is “MID", "The next Biennial should be held in 2021.\n\n\nThe Venice Architecture Biennale, which was supposed to take place in September, has been postponed due to the Covid-19 pandemic. Organizers are now working on a new date for the event, which will take place in March 2022.The event, which was co-organized by the Venice Architectural Forum and the Fondazione CIMAM, was originally scheduled to run from September 10 to September 12. The first edition, which was held in September 2015, ran into controversy after a group of artists complained that the event was being run in a way that excluded them from participating. During its run, the event drew around one hundred thousand visitors and set the Venice Architecture Biennale on fire. The event was also plagued by controversy over the inclusion of large-scale works by renowned Italian architects, such as Piet Mondrian and Ad Reinhardt, in the exhibition. The organizers admitted that the selection process had been rushed and that the exhibition would have been completed much sooner if they had invested more time and more effort into researching and selecting works.Commenting on the event, the organizers said: “This is a disaster which has hit the most important architecture of the twentieth century: architecture", "The next Biennial should take place in the spring of 2021, and will focus on \"the experimental course of art and the social, political, and intellectual life of a small town in the Andes. Our vision is to explore the place of art in the lives of different communities.”\n\n\nThe Museum of Fine Arts (MFA) in Phoenix has appointed Amanda Conner as its new chief operating officer and chief financial officer. Conner joins the museum from the University of Washington in Seattle, where she has served as a senior finance and administration professional for the past four years and will be responsible for overseeing the day-to-day operations of the museum.“We’re thrilled to welcome Amanda to the MFA and to have her leadership and vision for the MFA and Phoenix as central to our mission as we continue to grow and develop new works and programs to honor the history of Arizona’s Southwest region,” said museum director Michael White.Conner previously worked as an independent curator and taught at several universities. Her curatorial projects include the exhibition “Alfred Stieglitz: A Retrospective” (2018) at the California Academy of Sciences, which is currently on view until November 22, and “", "The next Biennial should be announced by the end of the year, with the exhibition marking the centenary of the exhibition’s birth in Helsinki.\n\n\nThe Peter del Vecho Foundation in Los Angeles has received a $25,000 donation from artist Georges Remi, a French painter and sculptor who spent more than thirty years in an effort to make the painting-making process accessible to everyone.Established in Paris in 1976, the foundation organizes annual art shows, which are followed by a series of public lectures, and is planning to launch a new digital platform for artists, which would give them the ability to upload their works and receive monthly royalties. The platform will also host a residency program and other events for artists.The gift was made in recognition of Remi’s contributions to modernism and the European-American tradition. The artist, who is currently based in Paris and Los Angeles, said: “The work of the Foundation was created in recognition of the invaluable contribution of the artist-to-private-practice, and the potential of our art-making environment. The platform will help us to explore and create new worlds through the art-making process.”\n\n\nThe Tate in London announced today that it is planning to", "The next Biennial should be held in 2020. The new design for the museum was made by the contemporary architecture firm Tanitra Architects. “The new Museum of Contemporary Art will join the existing architectural heritage in a way that is both innovative and forward thinking,” said Bibi. “It will be a gathering place for visitors with a strong sense of community, not only from the world but also from our culture.”\n\n\nThe Tulane School of Art in New Orleans has received a donation of $10 million from the estate of the late Lebanese-born American artist Walid Raad, who was a leading member of the country’s art scene. The gift, which comes on the heels of a $5 million pledge made by the estate of the late Lebanese-born American artist Saad Abu Khdeir, represents the culmination of a ten-year campaign by the estate to raise a total of $50 million for a new center dedicated to the art of the twentieth century.The Abu Khdeir estate is asking the public for their support in creating a new institution dedicated to the art of the twentieth century. The focus is on the artist’s birthplace city of Ajamar, Lebanon, and the areas surrounding it", "The next Biennial should be held in the spring of 2021. A statement from the institution reads: The university has received a significant amount of funding from the government of Denmark, and we are very grateful for the support this has given us. We are currently working through a number of options for the future of the Biennale, and will soon have a new topic for students to study together with international experts, and a new exhibition at the campus. The students and the school have been given the choice to continue their studies, or to move to the city of Copenhagen for a yearlong degree. The new location will be entrance to the university, and will be on a site that was previously used by students. The Eriksson Art Archive (EAA), the university’s cultural center and home for Art University, has also revealed that it is planning to move the permanent collection, which comprises some eighteen thousand objects, to a new location. The move follows a $9.7 million funding round for the institution led by the Danish government. The money will be used to create a new foundation, the Eriksson Foundation for Cultural Heritage, which will oversee the relocation of the collection. The move will also introduce new opportunities for international", "The next Biennial should take place in Tokyo in the first half of 2020. It will be hosted by the Dōjinsa-ya Cultural Center in Shizuoka and will be presented by the Japan Society, the Kunihiko Museum, and the Miyazaki Museum of Art. For the Kunihiko Museum, the event will mark its centenary. The next exhibition will feature work by seventy-seven artists and collectives. The first six exhibition days will be dedicated to the artist-run space the Biennial, the Museum, and the Biennial Center. The museum is organizing the exhibition in cooperation with the Japanese artist-run label Studio Ruki. For the Kunihiko Museum, the earliest date for the exhibition is March 24, 2020. Earlier this year, the museum opened a three-thousand-square-meter exhibition space in the building, which is presently a studio, in order to host more works by the contemporary Japanese, including works by Hiroshi Kamiya, Chiharu Nakajima, and Tetsuya Takahashi. For the Kunihiko Museum, the first works by a woman to be exhibited in the United States will be one of Hiroshi Mitu's paintings from the", "The next Biennial should be held in December 2020. \n\n\nThe Art Newspaper reports that the Geneva Biennale has announced that it will no longer consider its 2020 edition when it reconvenes after a six-week run at the end of September. Instead, it will spend the month of November showcasing work by artists participating in the inaugural edition, which ran from February to March in 2019.The seventy-three-year-old event has been plagued by financial trouble ever since it announced that twelve artists will be invited back to the event in early March. According to the New York Times, the organizers had already downsized the event, which features works by seventy artists from seventy countries, by as many as twenty-four artists in March. The decision to move the event, which drew an estimated 151,000 people last year, has been made in an effort to reduce the array of artists represented at the biennial. The biennial’s program director, Hannes Uchida, said: “We are not in a position to talk about the future yet, but we can say that the next biennial will be a year of artists. In the words of Faust, the artist, that’s the way it should always be.", "The next Biennial should be released in 2020. \n\n\nThe Getty Museum in Los Angeles is planning to remodel the institution in order to make it more accessible to the public. The renovation is part of a $1.5 billion overhaul that will be undertaken by the Getty, which was founded in 1964 by Alfred Stieglitz, primarily in order to save money.According to a press release from the museum, the renovation will include the removal of the Getty’s current building and will incorporate new galleries, classrooms, and rooms to make room for more museums. It will also work to make the museum more appealing to the public by adding more outdoor spaces, remodeling galleries, and by building a new visitor experience center.The work will also involve the construction of a new visitor entrance on the second floor of the museum, which will be accompanied by a new public courtyard that will host overflow spaces for the museum’s main building. The courtyard will serve as a place for people to sit and relax while they visit the galleries, and new galleries will be constructed nearby.“The changes to the Getty are a wonderful opportunity to reimagine the museum in the twenty-first century,” said Michael Getty, head of the museum. “The", "The next Biennial should focus on “the death of democracy, justice, and peace,” Stanford said in a statement. “The exhibition will draw from a range of cultural and social institutions to address historical and current events, with the goal of creating a dialogue between the art world and the arts.”The exhibition will feature works by fifty artists, including Sohrab Mohebbi, Meb Kaba, and Hélio Oiticica, and will be organized alongside the Biennial of Performing Arts, which opened in May, and will run from October 31 to November 7. The artists who will represent their countries at the event are:Aziz Saar, The Last Days of the Pharaohs: Egypt and the Rise of Modernism’s End of an Era (Wangechi Mutu)At the end of last year’s exhibition, which explored the meaning of the vernacular in the art world, Hoor Alkhafaji, the director of the Cairo Museum of Art, drew parallels between the new exhibition and the previous one, “Aura: New Regime,” which was staged at the Noguchi Museums in New Orleans in 2015. He said that the new exhibition", "The next Biennial should take place from the second half of February to the fourth of March. The next edition will name an artist and will be hosted by the Institute of Contemporary Arts (ICA), the city of Zurich; the Central Library, the city of Bern; and the Fondazione Milano di Roma.The artist-run exhibition space, called the Forum, will also receive a total of twenty-four artists for its inaugural edition, which will be held at the Südwestagasse Kultur- und Kunst-Kunst in Cologne from February 27–28. The project was inspired by the exhibition space in Zurich, the Künstlerhaus, which hosts a total of sixty artist-in-residences each year and is continuing its work with the same creative and emotional projects as its flagship event.“We wanted to reflect on the question of the future and feel the weight of tradition,” said Stefan Sperl, the director of the Forum. “We are now just days away from a new, more imaginative, and encompassing Art Biennial, with a retrospective of the artist Mihai Bayer.”\n\n\nNew York’s Metropolitan Museum of Art has unveiled a revised and", "The next Biennial should be held in the spring of 2021. The 2020 event, titled “Art of Life” was held at the Kota City Hall in Kyoto, and honored the Japanese artist, writer and composer Takashi Tokunoda, who was a partner of Mitsuyama and cofounder of the K-On! Dance Theater.Exhibitions are currently being held at the Sankt-University Museum in Cologne, Germany; the Kookmachi Museum in Tokyo; the Museum of Contemporary Art in Osaka; and the São Paulo Museum of Art.\n\n\nThe National Gallery in London has appointed Charles Jacobs as its next director. Jacobs will assume his post in March 2021 and will work closely with curator Joana Pedersen. The announcement marks the culmination of a three-year search for a new director for the National Gallery. The search, which was led by senior director Martino Ratti, resulted in the appointment of director general Maria Balshaw.Balshaw has been the driving force behind the National Gallery’s turnaround strategy and has organized numerous exhibitions, including “All the World Will Now See: This Is Our Time” (2019) and “The Future Is Here” (", "The next Biennial should be held in the spring of 2021, when there will be a new chapter devoted to the life and work of Māori artist-activists. The pavilion will include the works of new arrivals such as Nga Wairāhia and Ngāti Whakaatanga and will debut the work of artist-activists such as Alan Partridge, Zephyr Teachout, and Otari Tare.The 2019 exhibition, “The Birth of Māori Art,” premiered at the Museum of Contemporary Art Auckland. Its exhibition included paintings by Māori artists such as Tana Akua, Kāpiti Huitangai, and Yasmina Houvou. \n\n\nThe National Galleries of Scotland (the National Sculpture Garden) has appointed Helen Hyland as its next chief executive. In her new role, which has been announced on Thursday, Hyland will be responsible for overseeing the development and delivery of the National Galleries’ vast collection, which includes works by more than seventy artists in its current configuration. Hyland succeeds Jane Newby, who has helmed the institution since 2013, and will take up the", "The next Biennial should be held in 2020. The 2019 event featured the work of more than 200 artists, chosen from a pool of twenty-seven, including Macur & Seria, Jason Brown, John Ostrander, and Rina Rizk, and was organized as part of the 2019–2020 Academia Abroad, the cultural initiative of the National Association of Arts. Earlier this year, concerns over terrorism and a shortage of funding led the US government to halt funding for the pavilion, which was designed by the Italian architect Tingenga and was constructed in the Bologna district of the city of Piedmont. The pavilion was scheduled to open in 2020, but the exhibition was postponed due to the Covid-19 pandemic. “We at Biennial B were surprised and disappointed by the decision to cancel this year’s exhibition, ” Christo and Hanna, the organizers of the show, told the Art Newspaper. “It is not an easy decision, but we are satisfied that we have taken a step to avoid canceling the exhibition in 2020, and are actively monitoring the situation.” Further, they noted that the money raised for the pavilion", "The next Biennial should be held in 2022, and the first in twenty years.\n\n\nThe Metropolitan Museum of Art is working toward revamping its collection with modern and contemporary art. In the next several years, the museum will introduce more than 2,500 new works by artists in its collection, including new works by artists from the Philippines, South Korea, Japan, and China. The overhaul will involve the establishment of new institutional spaces, construction of new exhibition spaces, and the collection receiving a major facelift.“For more than a decade, the Met has been working toward rethinking our collections and redesigning our exhibitions to reflect the contemporary art movement and its richness of practice,” said Norman Guggenheim Museum director Krista Cooper. “The new institutional architecture will introduce new opportunities for broadening audience and engaging with art and this work is just the beginning: we look forward to working with the public to shape the next edition of the Met.”The redesign will address the Met’s longstanding ambition to present the largest exhibition of contemporary art in the United States. The redesign will also bring more contemporary art to the museum, including the museum’s first exhibition of work by contemporary artists in the United Kingdom and the museum�"]