["The next Biennial should be with the students of the Museum of Fine Arts, Melbourne.  A new exhibition should also be organized with the South African bantustans, the Art de Poblacion and the Art of the Americas, to be presented in late January.  The International Biennial for Southern Africa (BISSA) will be hosted by the Benesse University of Technology, Cape Town from May 18 to May 21 and will begin in September. \n\n\nThe National Geographic Society’s plan to move the headquarters of its venerable educational and research arm to the National Museum of Fine Arts in Washington, DC, has been put on hold amid the protests of some conservationists, who fear that the move will result in the extinction of thousands of rare and endangered species. Earlier this month, the museum issued a public apology for its previous statements about the fate of threatened species, and for its handling of a petition urging the museum to reopen a conserved section of its collection that was damaged by a natural disaster in 2017. In a letter sent to the public on September 18, the museum’s senior vice president of programs, Neal A. Nolen, said that the museum is “committed to supporting the conservation of", "The next Biennial should be set at the same location as the show, in 2020. The theme of the 2020 edition is “How We Make Time.” Despite its long association with the festival, the closing date for the event was changed from October 29 to November 15. The exhibition will be housed in the Museo de Photosynthesis in Lisbon and will feature work by twenty artists and will run for ten weeks. The debut exhibition of the show will be “Imageless Space” on May 10. \n\n\nThe National Gallery in London will open a new museum dedicated to the museum’s collection of the earliest surviving works by British painter, designer, photographer, and playwright W. M. Wode (1863–1974). The institution debuted the museum’s new collection, which is housed in the National Museum, in the City of London on Monday, March 4, and will host an exhibition of work by British artist Allen Lane on February 17.Wale, who was born in Leeds and raised in the city, said: “I have been keenly aware of the importance of the National Gallery for a long time. I am delighted that it will finally be able to welcome the collection to", "The next Biennial should be in 2021, with the exhibition marking the fifth anniversary of the New York–based artist’s project, the immersive, multimedia platform Tango. The exhibition will take up the themes of identity, migration, science and technology, and will be curated by Anna-Rebecca Jacobs. The biennial will have a different theme each year, with a different sequence of works and events.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles unveiled its new master plan, which aims to revitalize the city’s historic core by rebuilding the old Pacific Gas and Electric (P&E) power plant and the nearby historic Courtyard by Marriott Hotel, and by creating thousands of new affordable housing units.The centerpiece of the plan is the refurbishing of the old P&E, which is currently undergoing a $1.2 billion expansion that will be completed in 2021 and is slated to open in 2022. The overhaul will involve the demolition of seventeen buildings, including the former John F. Kennedy International Airport, the former headquarters of the World Health Organization, and the former site of the former Kodak building, and the construction of an adjacent park, which will be named after the P&E plant.“There are many wonderful", "The next Biennial should take place in 2021, on the occasion of the thirty-fifth anniversary of the renovation of the museum. “As we carry out this important work, we hope to be able to continue our work in an expanded and enhanced state,” said Artistic Director Sixto de Cegiño.The Biennial will be hosted at the historic Bienal, the city’s cultural center, on the site of the former factory that produces the famous Guadagnoli glass films. The object of the exhibition is to show the ways in which the glassworks are impacted by the global climate crisis. For the past seventy years, the glassworks, which are scattered throughout the city, have been a platform for artists of all kinds. Among them are Paolo Baratta and Andre Büchner, who will present a presentation of new works by Chilean artist Javier Álvarez Otero, and Mòlnad Zineb Sedra.\n\n\nThe National Gallery of Scotland announced today that it will reopen in February 2019, following a temporary closure due to the coronavirus. The exhibition, “Earth in Action,” is currently on view in the exhibition hall, which is currently", "The next Biennial should take place in 2021, when the exhibition will be given a new name and will be relocated to the Museum of Fine Arts.\n\nThe National Gallery of Art in Washington, DC, has commissioned the artist Li-Man Le in celebration of her seventy-fifth birthday. For the exhibition “Li-Man’s Women and Politics: Feminism and Politics in China” (2019), which was organized by the Taiwanese artist, the National Gallery will stage an exhibition featuring twelve works by the German-born artist in the spring of 2020.The exhibition will be divided into three sections: “Feminist Labor” (2019), “NYC: Feminisms in Disguise” (2019), and “Lony: The Self-Portrait from Li-Man Le” (2019). The first half of the exhibition will be shown on September 26, while the second part of the show will open on October 8. The third part, titled “Loner,” will open on October 12.“Li-Man Le’s contributions to feminist scholarship have made her a central figure in the development of New Left art and the development of Chinese feminist theory,” said Nadine", "The next Biennial should take place in 2020, and the twenty-third in 2022.\n\n\nThe University of Wisconsin–Madison (UWM) in Madison, Wisconsin, has announced that it will phase out its controversial permanent collection of 19th-century American painting by American artist El Dorado Bell and has introduced new curatorial initiatives that will focus on the legacy of the artist’s glassworks. The transformation is part of a comprehensive renovation plan that includes the reinstallation of the entire building, the conservation of the collection, and the restoration of the collection’s original landscape.“The Bell Art Museum’s collection is a living entity and has undergone a remarkable transformation throughout its eighty-three-year history,” said Julia Gilligan, chair of the institution’s board of trustees. “Together, we have made multimillion-dollar investments in its preservation and we will continue to do so as part of the museum’s mission of representing the art of the Bell family.”During the renovation, the Bell Art Museum’s collection was redesigned and modernized in order to better integrate with its surroundings and with the surrounding environment. The project also involved the reinstallation of all", "The next Biennial should take place at least fifteen years after the death of the artist and should be a masterpiece of American painting. The theme should incorporate themes of American history, the United States, and the West from the artist’s own past. 'This is a time of profound change for the American landscape and our nation, and for the world,” said Kenneth A. Berrada, chair of the board of trustees. “The look of the pavilion should reflect an optimistic, yet vital, renewal of the American landscape, and the vitality and vitality of our nation.”The Biennial is a partnership between the Smithsonian American Art Museum (SAAM) and the Museum of Modern Art (MoMA) in New York. It was established in 2004 as part of the National Museum of Women in the Arts (MoMA). In 2012, MoMA hosted its first exhibition devoted to the artist’s work, Avant-Garde, which featured pieces by nineteen artists. \n\n\nThe Museum of Art in New York is among the thirty-six institutions that are currently closed as a result of the Covid-19 pandemic. Among the institutions that have yet to reopen are the Metropolitan Museum of Art,", "The next Biennial should take place in 2022.\n\n\nThe Japanese artist Ai Weiwei is planning to stage a biennial of his artworks at the Museum of Contemporary Art (MAS) in New York next year. The event will take place in his former residence at 539 Eighth Avenue in Manhattan, in the museum’s new space, the Institute for Art & Design (I/A) in New York.The biennial—called the Weiwei Experience—will honor the artist’s fifty-fifth and fiftieth-anniversary biennial, which will use the institution’s former residence in the building as the exhibition space. The biennial’s production team consists of Markus Bogan, the curator of Ai Weiwei’s first show in New York; Ai Weiwei’s grandson, Kazuo; and artist-syndicate members Cảo Cuong, Hsuan-Ping Yang, and Yang Xiaoyu (via their respective partners).“Weiwei Experience has been a professional collaboration between Markus and Cảo Cuong for more than twenty years, and we are honored to be able to present the first show of Ai Weiwei’s work in the", "The next Biennial should be held in 2020, and then the festival will choose an artist from the shortlist for its 2019 edition. Artists who have not yet been chosen for 2020 include Gósol Remmbhild, Helen Cammock, and Amancraze Ghebalyan. If a new artist is selected for the 2020 edition, the event will have twelve months to organize its opening and closing ceremonies.\n\n\nThe Detroit Institute of Arts (DIA) in Michigan has selected Kenny Chesney as its 2020 recipient of its Gideon Awards. The award, which was established in 2012 to honor outstanding contributions to art and culture, is awarded annually to an artist. The awards are also funded by the David Rockefeller Fund, the David Rockefeller Education Fund, and the David Rockefeller Foundation.Chesney, whose recent work includes works that include paintings based on the American West, including The Devil and the Wild, 2017, a series of paintings that explore themes such as the Virgin Birth, the Divine Feminine, and the Virgin Mother, and Away From the Sun, 2018, a series of paintings inspired by the Great Lakes region and the Great Spirit. The finalists were Bruce Douglas, Kenneth Hite, Filippo Spero,", "The next Biennial should take place in 2022. Artcyclopedia’s editor, Heiner Stoll, has written: “The next Biennial should take place in 2022. The show, which has also been a museum since 1972, will be a major milestone in its history. The first show was held in 1967, the sixth Biennial in 1998, and the last was held in 2014. The show will return once a year until 2023, when it will take up the theme ‘The Future Has Spoken.”The MCA’s director, Barbara Streisand, has praised the show’s curators, whom she described as “pioneers of their field.” She added: “Their vision for the show, taking place in an original setting in medieval Prague, is to generate additional interest in the art of the Czech Republic and the Czech Republic’s art history.” The MCA’s website excitedly announces the show’s theme, “Art and the Future.” The piece, which was selected by a jury comprising Peter Sadek, director of the Pompidou Museum in Paris and the MCA, and two of the show", "The next Biennial should be held sometime in 2021.  Namdi, whose private studios in the Tardis were the birthplace of a number of early works by Arashidze, Aland, and other Iranian artists, is also planning to reopen the museum in the summer of 2022. \n\n\nThe Institute of Contemporary Arts (ICA) in London announced today that it is planning to create a new, seven-monthly residency program that will draw from the collections of thirty-three institutions and will offer $100,000 grants to help artists who are currently overseas and are considering returning to the United Kingdom. The residency program, which will be modeled after the ICA’s residency program, will be launched in April and will last through June of the following year.The new initiative will draw from the largest collection of modern and contemporary art in the UK: the National Galleries of Scotland, which recently announced that it plans to shutter its current exhibition program and see how its holdings develop over the next two years. The group will be made up of artists who have lived in the UK for a year or more, have lived in the country for less than five years, and will be selected for the program by a panel of ICA alumni.", "The next Biennial should take place in 2020. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has released the list of twenty-six artists who will be receiving the 2018 Los Angeles Artadia Award. The award, which honors work in the arts in Los Angeles County, was launched by the organization and its director, Cindy Sherman, after the winner of the 2019 Los Angeles Artadia Award, John Akomfrah, was selected to represent the United States at the 2020 Venice Biennale.“The Los Angeles Artadia Award is an extension of the museum’s mission to support and advance the art of Los Angeles, and the 2019 Los Angeles Artadia Award was an opportunity to honor that mission with a distinguished selection of contemporary work,” said Sherman. “From the selection of the twenty-six named artists to the announcement of the award, Artadia is thrilled to support and expand the stature of this year’s award.”\n\n\nUnited States Army Specialist Marcus Luttrell, a twenty-nine-year-old black man who was killed by a white police officer in Minneapolis in what has been called a “preventable act of violence” in February, has been found guilty", "The next Biennial should aim to include a full-screen reconstruction of the collection and its collection, an exhibition of new works, and a book. The next exhibition will be the 'New Frontiers in Art’s History: Exhibitionism and Materialism” (2019). This exhibition, which will be housed in the Department of Cultural Affairs, will feature work by ninety-four contemporary artists, including Kenneth and Philip Johnson, Zuzana Zvyagova, and Celine André, and will open to the public in 2020.The 2020 edition of the biennial will be held at the Institute of Contemporary Arts in Prague, and will run alongside the seventy-fifth anniversary of the Czech Republic.\n\n\nNew York–based artist and educator Deborah Lipstadt—whose surrealistic, avant-garde, and unmistakable sculptures challenge the boundaries of realism and form—has died at age eighty-eight. In a Artforum report published on June 1, Lipstadt said: “The art I have done since I was a teenager has always been a medium of transcendence.” “The earliest sculptures I made were of abstract shapes, often of charcoal or plaster, the latter of marble, and the most recent, of", "The next Biennial should be held in December 2020.The exhibition is dedicated to the concepts of culture, language, and identity. From today, the biennial will continue as a platform for dialogue between the artistic worlds of India and the United States.\n\n\nIn a landmark ruling regarding a former employee of the Museum of Contemporary Art (MoCA) in New York who was fired for allegedly stealing from visitors in a display for the museum’s retrospective in February 2019, a federal judge in Manhattan on Thursday ruled that the former employee, Nathalie Adams, who was employed by the institution for less than two years, was entitled to back pay and benefits.The plaintiff, who had worked at the institution for less than two years and had only recently joined the staff, claimed that she was asked to return items she had purchased with the money she had stolen from the institution. In addition, she claimed that she felt her job was in danger with the firing after she allegedly told a supervisor that she would not voluntarily resign in February 2019.The judge ruled that the dismissal of Adams is “legitimate” and that the firing was an “inexcusable act” that violated the former employee’s rights under New York’s Worker Protection", "The next Biennial should take place in the coming months, as plans are in place to host an exhibition in October 2021. The 2019 festival was held in the city of Tomsk, Russia, where Valentina Gani, the founder of the company Biomech, was based for more than five years. The artist won the $50,000 Molecadia Prize in July 2019, and the next year, she received the $150,000 Leningrad Prize.Commenting on the award, Gani said: “I am delighted by this award as it is the first time the Leningrad Prize has been presented to me personally. It is very important for me to have won the prize, as my work is in a state of continuous evolution and I am always seeking new ways to experiment with new materials. I’m very happy with the choice of the city of Leningrad as the city of my dreams, and I believe that this year’s prize will be given to my work.”\n\n\nThe Vienna Art Museum (VAM) has received a gift of more than six hundred works by the late German sculptor and painter Ludwig Mies van der Rohe, who championed the modern American avant", "The next Biennial should be under the rule of a new government, with an elected executive council. The first exhibition of the new 'state of the assembly' will open in the capital city in November and will run until March 2021.\n\n\n\n\n\n\nStephanie Ahearn’s exhibition of artist’s work was included in this year’s biennial of exhibitions at the Museum of Modern Art (MoMA) in New York and the Serpentine Galleries in London. The biennial, which is being curated by David Guggenheim Biennial Director Nicholas Cullinan, marked the first time the artist’s work was exhibited in the United States. Ahearn’s work, “Creation and the Death of Man” (2016), is a series of charcoal drawings that dramatize the life and death of artist David H. Koch, a prominent member of the American industrialist’s orbit known for his televisions, toys, cars, and other products. The exhibition was curated by David Guggenheim’s son, Jon. The fourth exhibition, “The Surprising Truth: Art and the Body in the Eighties” (2018), showcased", "The next Biennial should take place in October 2020 and will be hosted by the Museum of Fine Arts, Boston.  The opening of the initiative “between conceptual and physical universe,” as well as the major retrospective of the artist’s work, Art of the Body, will take place at the Museum of Modern Art in New York in December 2022.The Foundation also announced that it will establish three new endowed fellowships for artists: Nora Škina, Glynis Mulvey, and Elyse and Richard Perry. The fellowships, which will be awarded through a selection process that will involve two rounds of applications, will be compositional and will include a yearlong residency at the Foundation in the fall of 2020 and spring of 2021.The three fellowships will be announced in the spring of 2021. For Škina, the new fellowship, which will open in March 2022, is the perfect time to continue her work in urban exploration and to broaden her audience beyond her East End neighborhood. She believes that a collaborative, city-based program that fosters the formation of public space can improve the lives and well-being of residents of New Brighton. “The biennial", "The next Biennial should include a proper reflection on what we are doing, and how we are doing it, and what we as artists can achieve with our own creativity.”The 2019 edition of the event will take place at the end of October, with the exhibition eventally scheduled to run from November 20 to November 28, 2020. He added: “I know that this year's theme is about collaborations and partnerships and how they can create important connections between disciplines. I want to see how we can extend this work in the service of our environment, in service of our communities, in service of our planet.” The 2019 theme, “Collaboration and Partnership,” was inspired by the insertion into the exhibition of a series of artifacts from the artist’s studio, which are then assembled into objects that are exhibited in the exhibition. The exhibition will be curated by Aida Denek, curator of modern and contemporary art at the Museo de Arte Contemporáneo Brasileiros; Emma Lazar, curator of modern and contemporary art at the Museo de Arte de São Paulo; and Xavier Arosell, director of the Museo de Arte de São Paulo.\n\n\n", "The next Biennial should take place at the Bechs Museum in Berlin in 2022, and will consist of twelve exhibitions that will examine how perceptions of architecture, history, and art shape what can be imagined within the medium of art, design, and architecture.\n\n\nThe National Galleries of Scotland announced today that it is reopening in March 2019. The museum, which previously announced that it is expecting a £30 million shortfall in attendance in 2020 after it postponed its opening by a year, will begin welcoming visitors in March 2021. The announcement coincides with the centenary of the Scottish National Trust’s founding.“Galleries have always played a vital role in supporting and inspiring Scotland’s creative economy,” said director Mervyn Peake. “It is vital that we continue to have a strong and vibrant arts sector in Scotland, but at a time when the economy is facing unprecedented challenges, and when the UK’s population is becoming ever more connected and digitally savvy. Galleries have long played a pivotal role in supporting and inspiring creative Scotland. We have been actively looking for ways to support our galleries and their mission by supporting the £9.6 billion plan for direct financial support, and now have a plan for supporting the next", "The next Biennial should be held in 2020. The 2015 programme, announced as part of a broader realignment of the national art museums in the country, featured thirty artists from forty-eight countries and forty-seven countries\u0097including the US, France, Germany, Italy, and the UK\u0097and was curated by Galerie Kammistuil in collaboration with some thirty other international artists, scholars, and collectors.\n\n\nThe Weir Foundation has announced that it will donate $5 million in support of arts and cultural activities in support of Hurricane Harvey relief efforts. The gift will also include $1.5 million for the arts and cultural sector.The gift will go toward supporting the distributions of by artist and collector Ebony and African American artist, writer, producer, and educator Michael Barnes.Barnes was one of the first to lend his name to the Hurricane Harvey Relief Fund, which is currently collecting donations from individuals and institutions that need it most. Through his foundation, he has already donated $1.5 million to scholarships and fellowships for African American students, and has pledged to donate $2.5 million to the expansion of the Harvey Art Museum in Houston.In addition", "The next Biennial should be staged in 2020. Artforum has contacted the Pérez family for comment.\n\n\nThe National Gallery of Scotland has received a donation of forty-eight works from an anonymous benefactor. The donation includes twelve works from the artist himself, as well as works that have recently been added to its collection, such as The Punctuation of the Universe, 2011, a construct of a 'bastard' with a face painted into a puddle that resembles a quantity bag, and Jemima Pritchard’s The Compulsion, 1907, a painting that will be on display in the gallery’s new exhibition “The Conceptualization of Art” in 2021.The donation was made by B!N.E., a nonprofit organization established by the National Gallery of Art in London. The organization’s president, Ben White, said: “We are delighted to have this gift from the National Museum. This is a wonderful gift of the artist’s life, and a great gift to the National Gallery of Scotland. We are hopeful that this extraordinary collection will prove a wonderful addition to the National Museum of Scotland.”\n\n\nThe Museum of Contemporary Art (MoCA) in Washington, DC", "The next Biennial should be held in 2020, and “the next year, appropriately,” said the board of trustees.The decision to hold the event in 2022 was made amid a global health crisis caused by a coronavirus A that has killed at least 185 people and sickened at least one million. A panel made up of executive director Joachim Neumann, director of the Kavihaus Museum in Frankfurt, and director Klaus Wissner was appointed as the new chair of the biennial. Wissner has been working with the rest of the board of trustees since the June 21 announcement of the next edition of the Biennale.\n\n\nThe Museum of Modern Art (MoMA) in New York is preparing to reopen in 2020 following a $1.1 billion expansion and renovation. The museum is currently constructing a new building designed by the Italian architect Claudio Lotito that will include an armory for the collection of the museum’s collection of modern art and an auditorium for future programming. The museum is also planning to add more than 1,000 square feet of exhibition space and create an outdoor plaza to the south of the museum.The overhaul of the building, which is located in Manhattan’", "The next Biennial should commence in 2022.In an interview with the Art Newspaper last year, Satoshi Hiraoka, the chief curator of the biennial and a longtime associate of the museum, said: “The biennial is one of the central aspects of my career. It is my way to carry out the dream of the museum as an independent institution. It is my mission to use the exhibition history to present the work of the other artists and to re-prove the exhibition as long as possible. I am looking forward to this new phase with my colleagues and I to realize the vision of the exhibition.”\n\n\nThe Baltimore Museum of Art (BMA) is planning to expand its work in the field of sustainable design. In a development that will also include the acquisition of up to twenty-five acres of land near the museum’s campus in an effort to reach more people, the institution will begin a process that will involve the development of an educational program about sustainable practices and will invite the public to review three new sustainable-design projects, The Urban Future Landscape, ‘Unmade,’ and “Urban Futures,” which will be installed in the BMA’s former holding space", "The next Biennial should focus on the feminist and pro-choice movements in South Asia, the United States, and Australia, as well as South Asia’s European diaspora. It should also consider the legacy of South Asian artists and activists, including Ada Chaudhri, Sohrab Mohebbi, and M.P.S.U.A., and the contemporary art scene in India.Prior to the inaugural event, Erin Joachim, director of the Kunsthalle Basel, said: “We are delighted to be able to welcome back Tirunelal, Bradley Birkett, and Mariko Simon, Agnieszka and Jarnail, who achieved great success in their careers. We hope that this will serve as a model for future events and that next year will mark the anniversary of their first exhibition together at the Gallery.”Among the galleries participating in the inaugural edition are Nada Dargav, Tanya Gumi/Niraj Minug, Palaniszczuk Kami, and Pace Gallery.\n\n\nThe National Galleries of Scotland (NGM) and the National Galleries of", "The next Biennial should be held in 2021 at the Museum of Modern Art, and the first in 2022 at the National Museum of the American Indian in Washington, DC.--Bruce A Wilson<|endoftext|>The New York City Department of Cultural Affairs (DCLA) has issued a statement rejecting a request by the City Council for an extension of the design-by-committee’s playhouse-like’s construction, and instead proposing a new, four-year program that would give local arts organizations the chance to stage productions that are free and open to the public.In an order dated September 6, the DCLA states that it has found no reason to extend the current contract with the City Theater of New York, which runs the Twelfth Avenue Playhouse from March 13 to March 21. It also notes that the structure of the contract has not changed since announced that it would contract out the remainder of its schedule to the city’s private theater companies, including the Metropolitan Opera, the New York Philharmonic, the Metropolitan Opera New York, and the Metropolitan Opera New Jersey.In a statement provided to the Art Newspaper, the organizer of the Twelfth Avenue Playhouse told the publication the contract was terminated after the company", "The next Biennial should be held in the spring of 2021, and the first in the fall of 2021. The new venue for the two-week event is the Arcis Museum of Contemporary Art in Barcelona, where it will be held from March 9 to March 12. The exhibition will be hosted by the Catalan-born, Spain-based architect  Federico De Masi, who has also represented the UK at the Venice Architecture Biennale.A statement released by the organisers reads: “The first Biennial was conceived as a platform for artists to think, create and reimagine. It has always been about setting an example for how to be a visionary and a creative human being. We are very much looking forward to the next edition of the Biennial, and to the exhibition as a whole.” \n\n\nThe Pennsylvania Academy of the Fine Arts (PAFA) in Philadelphia has received a gift of over one hundred artifacts from the Philly Museum of Art’s collection. The gift includes works by artists whose work has yet to be exhibited or displayed in the museum’s forty-nine-year run, including the works of Andre DeSousa, Joseph Beuys, and Chad Scho", "The next Biennial should be four years from now, when a new collection of biennial works entitled “La Biennial 1”\u0097which is also currently on view at the Ciènie Bleu in Paris\u0097will open in the United States.The exhibition, which was organized by a group affiliated with the museum, will showcase the works of twenty-six artists, including Gerhard Richter, Harald Szeemann, Adrienne Musgrave, and Wolfgang Paalen, and will also feature a new performance and film by the German photographer Wilhelm Wunder. The works will be presented in conjunction with the exhibition “Menchacała” (2018–19), which will feature paintings by the Polish photographer Wojciech Wojtas in the studio of Ładkowski Gallery in Warsaw.Wojtas and Piotr Wojtek, the director of the gallery behind the exhibition, have already presented a selection of works by the Polish artist Lubosław Wojtas, who was born in 1941, to the artist biennial in 2013. The exhibition, titled “Dr. Lászlómski: Todowiczi z Rozwolczów,", "The next Biennial should be held in 2020. \n\n\n\n\n\n\n\nJohn Godfrey-Smith, cofounder of the contemporary art biennial Seattle, has announced that he plans to resign in June 2020 to pursue new creative projects, including a new book. He also plans to focus on creating a biennial of contemporary art in every city in the United States.“John has written an amazing book, The End of Art: The End of Art as We Know It,” The Cut, 2017, which was commissioned and published by the Seattle Art Museum (SAM), and will appear in the autumn of 2020. In addition to designating a new venue to represent Seattle at the biennial, which is currently being organized by the Seattle Center for Contemporary Art (SCCA), the Museum of Modern Art in New York, and the Seattle Performing Arts Center (SPAC), the biennial will compile an inventory of all works currently on display and will present information on how to donate works to the museum. “I’ve long admired the work of John Godfrey-Smith,” said Sarah Leonard, the director of the SCCA. “His art, in both physical and conceptual forms, is", "The next Biennial should be held at least once a year.  \n\n\nCultural historian Daniel H. Pink has been appointed director of the Museum of Fine Arts (MFA), where he will succeed Ellen Barry, who has been appointed interim director. In his new role, Pink will work with curator of modern and contemporary art and former director of the Solomon R. Guggenheim Museum, Joachim Neumann, and the curators to develop strategies for the collection of modern and contemporary art and its exhibitions, which include “Passion: Art and the Body” (2019) and “The Cheetah: From Animal to Human” (2019). He will take up the post on February 23. According to Artnet, Pink’s appointment is controversial. “I’m not sure what the MFA is supposed to do with the contemporary art,” Pink told the Art Newspaper. “The idea is to take that art and transform it into something that people can connect with and experience in their own time.” He added that he expects the institution to move a “smaller museum,” noting that the MFA’s current venue is “too small”", "The next Biennial should take place in 2021 in the city of Dusseldorf and will be hosted by the city of Karlsruhe and the city of Karlsruhe. The next iteration of the exhibition will be held in 2019. The second edition of the show will be held in 2019. \n\n\n\n\n\n\n\nArtsQuest’s inaugural New York City curatorial project, “The Worlds We See,” will be devoted to the concepts of the ‘teleological,’ the ‘spiritual,’ and the ‘material plane.” The initiative’s inaugural event will be held on July 12, 2020 at the Institute of Contemporary Art (ICA), Chelsea. Designed by architect and urban designer Teesta Sette Verheggen, this year’s work will address the history and present state of the New York City urban environment through a mix of installation, readings, performances, art installations, public programs, and public programs and arts installations.“The World We See’ is a project that aims to re-configure the urban fabric of New York City and to re-create an experience that is new and fresh for the public, one that is", "The next Biennial should be organized in 2019. If the project is successful, the festival will have produced a new work by the artist over the course of its twelve-year run. Named for the theme of the exhibition, “NIRIN,” it will open on January 30, 2020 at the Institute of Contemporary Arts, Milan. The next edition will be held at the Palazzo Nazionale di Barbera in Milan in May 2020.\n\n\nThe National Museum of Scotland has received a contribution of $2 billion from the British government to help pay for the construction of an additional 200,000 square feet of exhibition space at the institution. The amount will support the expansion of the Finnish pavilion at the institution, which holds the annual exhibition series, “Beyond the Frame,” which will run from March 21 to March 26 2020. The government grant, which is part of a £2.5 billion package that will be announced on Thursday, also includes $450 million for the construction of new exhibition spaces, and $255 million for the restoration of the Fife Pavilion.The National Museum of Scotland, which is funded by the UK’s Department for Culture, Media and Sport, has a", "The next Biennial should take place in 2020. The museum will continue to host exhibitions and education programs in the exhibition space that are inspired by the works of long-running artists such as Robert Rauschenberg and Jean-Michel Basquiat. The company said it is committed to supporting local artists, communities, and the arts through its mission of preserving the art of the Pacific Northwest and is exploring ways to increase the museum’s exhibition footprint and enhance the performance of its collection programs.\n\n\n\n\n\nPaul Ricci, a leading Italian painter and sculptor, died on December 26 at the age of ninety-three. He was the first living Italian artist to be included in the exhibition “Triple Sight” (2013) at the Palazzo San Giorgio Marzolini in Venice. The exhibition, which featured work by twenty-six of Ricci’s contemporary collaborators, was organized as an extension of the Italian collective, Trio, which was founded in 1943, and which was established in Venice in 1946.The exhibition—a retrospective of twenty-three works by an extensive group of artists from the 1950s to the 1960s, including Rosalind Greenberg, Valentino Marini, Sergio Prada, and", "The next Biennial should take place in 2021.\n\n\nThe Library of Congress announced today that it plans to begin the process of reassessing the holdings of the American colonialists who illegally occupied Haiti from 1790 to 1791.The initiative, known as the Haiti Biennial, aims to identify and assess the state of the collections of the colonialists in order to better understand the events leading to the outbreak of the country’s formal independence from France in 1791. The work will also examine the histories of the archipelago’s peoples, their oral traditions, their art, and their artifacts, and will focus on the role of the French government in the region.“We are committed to working with all our interlocutors, including local, state, and federal governments, in order to address the legacy of colonial rule,” said ecologist and curator Marie-Pierre Legrand, chair of the committee that will oversee the biennial. “This year’s biennial will not only provide an opportunity for the public to take part in a strong and creative re-creation of the Haitian experience, but it will also bring together materials that have not previously been assembled to reflect the complex relationship between the United States and Haiti.�", "The next Biennial should be held in the fall of 2021 and will include a selection of works from the artist’s career. The exhibition will be hosted by the Renata Foa Gallery and Museum in Rome and will run in conjunction with the exhibition “Between Two Worlds: The Birth of Italian Modernism” (2019).\n\nAmerican artist and teacher Sol LeWitt was named the Busan Biennale’s artistic director this year. Born in New York City but raised in Seoul, South Korea, LeWitt has been based in South Korea since the 1990s and is perhaps best known for his installations and sculptures, which explore issues of memory and memory politics. The artist was awarded the Presidential Award for his sculpture Excruciating the Son’s False Self, which was on view on the first day of the exhibition. “I’ve been following Sol LeWitt’s work my whole life,” said Nick Hornby, director of the Busan Biennale. “He’s a brilliant artist who has crafted a parallel world of his which can be found in many of his sculptures. I’m really looking forward to working with Sol to develop and explore the conceptual", "The next Biennial should be called off after learning that the opening ceremonies were staged by the Israeli Ministry of Culture, not the Israeli government. The ministry issued a statement saying that due to the disruption it was planning to move the fair to another location and said that the budget for the event had been increased.As of Monday morning, the fair had scheduled a second edition of the event, titled Art and Politics, which will take place in a different location. The organizers said that the new event will be around ninety minutes long. It will also include a section on the human rights situation in Palestine. The next edition of Art and Politics will be held in January 2021.The Fair of Contemporary Art in the Palestinian Territories (FOPA) is currently holding its fourth edition in the West Bank, titled Art and Politics 2020, which will be held at Bethlehem University in the West Bank from January 19 to January 21. The fair will feature work by thirty-seven artists and will feature work by Israeli artists and will have an additional exhibition of work by Palestinian artists. Palestine’s Ministry of Arts said that the delegation of twenty-eight artists invited to participate in the event will be “representatives of Palestine’s arts.” It", "The next Biennial should take place in the spring of 2021. \n\n\n\nThe Museum of Fine Arts (MoFA) in Boston has appointed Melissa Onyewuera as its new associate curator of American and European art. Onyewuera comes to the museum from the Graeme Kahn Gallery in New York, where she works on the exhibition and online project for the museum’s Fall 2020 exhibition “My Exhibition,” which combines art with social and economic issues in Los Angeles. She will assume her new role on January 6, 2021.“Melissa’s expertise and passion for our collection and exhibitions, and for the art that forms the foundation of our collections, make her ideal for our growing collection,” said director Matthew Teitelbaum. “Her ability to collaborate and to elicit a range of emotions from our audience and to inspire us to think critically about how we engage with art, both in the museum and beyond, are particularly effective and conducive to our growth.”In order to expand the museum’s collection and educate its audiences in the art of the Americas, Melissa is working with a new online platform, the Contemporary American Art Museum, which will host a series of", "The next Biennial should begin with a narrative-driven presentation of works by the 125 artists who have contributed to the exhibition since its founding in 2007. The exhibition will then conclude with an open workshop entitled “The Arts and Politics of Knowledge.”The first exhibition organized by the new museum is “Art and Politics.” Its second installment will be “The Politics of Art: ‘History as Narrative,’” which will feature works by 130 artists and will open on March 19. The third episode, “The Museum,” will focus on the museum’s collection process and will be presented by Russian curator Marina Kondratieva. The fourth episode, “The House,” will be a retrospective of eighty contemporary works by seventy-one artists and will be staged at the Museum’s main building and will be held in the autumn of 2020.The museum will also introduce a new service, “Museum Finder,” which will help visitors find the works of those who have contributed to the exhibition. Its service will be free of charge until March 31, 2020.\n\n\nArt University, the Philadelphia-based nonprofit that has housed artworks and has supported artists since its founding by", "The next Biennial should take place in the summer of 2022.  The Adventurers featured artists such as Tiruguya, Nara, and Wangechi Mutu, who have been active throughout their careers but are not with us anymore. Notes: The next Biennial will be held in the autumn of 2024. The next exhibition, Art and Spirit, will be staged in the fall of 2021. The next International will be held in the spring of 2022. The next exhibition, The Art of Instinct, will be staged in the spring of 2020. The next exhibition, Feminine (A.K.A. Femme), will be staged in the spring of 2019.\n\n\nThe City of New York is launching a $50,000 fund to help artists and small to mid-size arts and cultural institutions through the fallout of the coronavirus. The program, dubbed the Arts Resiliency Fund, will also provide funding for artist residencies, provide support for new commissions, and offer resources for individuals and organizations who need financial assistance. The fund comes at a time when cultural institutions are struggling to absorb the economic impact of Covid-19, and as arts professionals prepare to reopen", "The next Biennial should bring together artists, scientists, researchers, and educators from Russia, India, and Brazil. The exhibition will be organized in partnership with the Russian Academy of Sciences, the Indian Institute of Technology, and the Brazilian Federal University of Minas Gerais. The final version of the exhibition will be presented at the Zhukovsky Museum in Moscow in 2020.\n\n\nThe Museum of Contemporary Art (MoCA), New York, has announced its representation of the late Japanese artist Toguo Takeda, whose groundbreaking conceptual art raised the possibility of what Toguo called the “unreal” and “spontaneous.” His work exhibits a profound awareness of the immense potential of photographic imaging. In his exhibition “Across You,” 1966–1966, Toguo creates a psychedelic, anthropomorphic view of a street in Tokyo, Akasaka, Japan, which resembles a living organism, but lacks the ability to form a central nervous system. “The naturalistic realm of Toguo’s photographs is actually the dream world of a dreamer,” said curator Samuel Guggenheim. “Their monumental experimental and conceptual work is the foundation for modern photography, and perhaps the most important", "The next Biennial should take place in 2022. “We are deeply indebted to the artists and activists who have inspired us to push forward, to push for change,” said chair Michel de Bruijn. “Through their generosity, they have given us the tools to continue to present groundbreaking projects in the exhibition. We are incredibly grateful to them for sharing their vision with us and for allowing us to perpetuate it in other ways.”A retrospective of Greco-Roman art from the museum’s collection will be held at the Louvre in 2021. The show, titled “Roman Objects,” will be organized by the museum and will run concurrently with the biennial.\n\n\nThe Northwest Asian art site Fosan, located in Seoul, has received a $25,000 donation from the L. Paul Brear Foundation. The gift is one of many for the institution, which has received more than $140,000 from the L. Paul Brear Foundation in support of its work since it opened in 2010. The institution, which is also supported by the David Rockefeller Foundation and the James S. McDonnell Foundation, has more projects in its future plan, including a new multimedia education program for high school students.“The foundation", "The next Biennial should focus on reproducing the work of the Italian artist, composer, and theorist Domenico Cattelan, who is already the subject of an exhibition at the Venice Biennale in 2021. Art Review: Biennial 2020’s 2017 issue, curated by Barbara Klassen and edited by Maria Moberg, also announced the formation of the Fashion and Design Research Lab, an initiative that will partner with institutions to commission work by artists around the world. The 2019 edition, titled Heroes, highlighted the ongoing impact of design on reducing the toll of the HIV/AIDS epidemic, and the exhibition was closed to the public as a result of the coronavirus pandemic. Heroes is currently on view in the Biennale, Art in Asia, Art in America, and Art in Europe. \n\n\nThe Museum of Modern Art (MoMA) in New York is planning to create an additional 1,600 full- and part-time positions at its Los Angeles outpost, the MOMA Asian Art Museum, as part of a new $500 million renovation and expansion plan.According to the Los Angeles Times, MoMA architects John Rogers and Alexander Sosinsky—who also designed the Museum", "The next Biennial should be held in 2021, and the final in 2023. The fifty-ninth edition, titled “Contemporary Art,” will air on Channel 4 in London on January 13. \n\n\nThe Museum of Fine Arts (MFA) in Boston has received a gift of twenty-nine works by artist Mark di Suvero, who passed away earlier this month at the age of eighty-three. The works, which were acquired through a real estate development deal between the artist and his widow, Jeanne, are currently on display in “Words and Images in Letterpress” (2019), an exhibition dedicated to the artist’s use of letterpress as a form of sculpture and sculpture as a medium. The show was organized by the American letterpress artist David Salle, who also curated the artist’s first show in the United States, a show of his art at the Museum of Modern Art in New York in 2013.The works, which are on display in the exhibition “Signs,” which opened on November 29, 2017, were purchased by the MFA in the series “Mark di Suvero’s Letters from the Letterpress Workshop and Museum.” The works", "The next Biennial should open in 2020, with a date to be confirmed.\n\n\nThe International Center for Arts (ICA) in New York has received a $25 million gift from the Rockefeller Brothers Fund in support of the organization’s sixteenth-century art program. The gift includes $10 million for the ICA, which is located in Manhattan’s Greenwich Village, and also includes $5 million for the National Art Museum (NAV) in Washington, DC.The gift was made in recognition of the ICA’s work in supporting artists and their cultures through a $50 million gift in 2016. The ICA has hosted over one hundred artists and has presented them in its programs since 1919. The institution also sponsored over twenty-four artists in the 2018–19 season.The grant for the ICA’s sixteenth-century program comes from the Rockefeller Brothers Fund in support of the Rockefeller Family Fund’s Cultural Fund, which funds arts and cultural projects in support of the economic and social well-being of American cities. The Rockefeller Foundation previously invested in the ICA through the Rockefeller Philanthropies.The funds will be used to establish the ICA’s core artistic mission, which is to engage in public", "The next Biennial should be held in 2021.\n\n\nThe Solomon R. Guggenheim Museum in New York has launched a new program that will offer students the opportunity to work with established artists, including artists whose works have recently undergone significant landmark or museum-wide reopening.The program, which will focus on the work of young, emerging or established artists, was inspired by the Guggenheim’s ongoing work with the newly minted artists designated as members of the Museum’s Emerging Artists group. The group, which was established in 2009, comprises twelve artists who graduated from the institution in the 2017–18 school year.The first round of the biennial, which will run from September 17 to September 21, 2020, will focus on the work of artists whose work has recently received a major retrospective, such as the works of Emily Bailey, Alex Katz, and Mark di Suvero, and will feature a selection of new work by artist-in-residence Julie Mehretu. The second round of the series, which will run from September 21 to September 29, 2020, will feature works created by veterans of the exhibition program, such as the work of Sophie and Para Nox, and will feature the work of artists whose", "The next Biennial should be announced in early February. “We are committed to continuing the work of the Biennial when it reopens next month,” said Lévy Gorvy director Felwine Sarr. “This is a moment of great change, a new beginning, and a new future, and these are challenging times. We are working hard to ensure that the Biennial will have the resources, wherewithal, and the spirit to carry on the work of the past. We are proud to present this year’s work in the many international galleries, museums, and public spaces that have supported the Biennial over the years.”The 2017 exhibition, “Biclyst” (Viviane Bénétière & Olivier Beland) was staged by the Centre Pompidou in Paris. It was one of the first times that the contemporary art collector and curator collaborated on a project in Paris. \n\n\nThe New York Museum of Modern Art (NYMO) is launching a $2 million fund to support the immediate and long-term health of the institution’s staff and its current and former artists. The fund is part of an agreement with the City Council on the renovation of Battery", "The next Biennial should be staged sometime in the second half of 2021. Its fate remains in the hands of the State.\n\n\nThe Museum of Fine Arts (MMA) in Boston is continuing to host more than five hundred exhibitions and has received $18 million from the Grant for Cultural Innovation, a $2.5 million gift from the Gordon and Betty Moore Foundation, in its quest to persuade the federal government to establish a national museum dedicated to the arts.The foundation is encouraging states to submit applications for the Grant, which will then award $9 million, and the grantees will be selected by lottery. The deadline for applications is December 23.MMA director Daniel H. Weiss said that the museum is hopeful that the renewed support from the Moore Foundation will help the institution in its quest to expand the museum’s exhibitions and education offerings to include more contemporary cultural practices and develop programs for the Boston area.“The Gordon Moore Foundation has been a strong supporter of the Museum of Fine Arts since its inception in 1967, when the foundation received a $2 million gift from the Gordon and Betty Moore Foundation,” Weiss said. “As we have continued to expand the museum, and as we have continued to present exhibitions, educational programming, and", "The next Biennial should be ready for completion by the end of the year. The exhibition will then be closed until March 2020.\n\n\nThe Museum of Arts and Design (MAD) in London has announced that it is working with photographer Wayne Newton to create a new series of photographs that will examine the lives of people in the arts. The first exhibition, “The Art of Photography,” will open on February 22, 2020 and will introduce a new way of looking at the world, which will reveal how the medium came to be.The exhibition will feature six new photographs, each depicting a different facet of the human experience, beginning with a look at the human body from an artistic vantage point. Each photograph was taken by Wayne in collaboration with artist Rebecca Watson at their home in Pimlico, North London, between 2015 and February, to focus on the human body from a different vantage point. Each photograph is a gift from Wayne and Rebecca.“This is a partnership between two great artists in the best possible way,” said Wayne. “I have been a fan of Rebecca Watson’s work since I first saw her work in ‘Street Photography’s 2013 retrospective. I’ve been learning about how", "The next Biennial should take place in 2020. Aboard the facade of the Museum of Modern Art in New York, the design for the new Biennale will incorporate a modular architecture to reflect the interconnectivity of the city. Participants will construct their pavilions using a new tool that will allow them to display their works on-site. The pavilion will then be transported to the Museum of Modern Art to be presented by curator Marc-Olivier Benoit.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed designer Holly Sacks as its next director. Sacks has been the curator-in-charge of the museum since 1989 and helped shape the institution’s collection and exhibition program. In her new role, which is funded by the Rockefeller Brothers Fund, Sacks will work with curator and director Randall Schoonmaker, who will serve as the museum’s inaugural chair of the Arts in Society.“Holly’s contributions to MoMA have been fundamental, inspiring, and enduring, and her new role reflects that vision,” said Schoonmaker in a statement. “In a time when it is increasingly difficult for museums to demonstrate the breadth, depth, and vitality of their collections", "The next Biennial should have been the year of the Mammoth, but the organizers decided to cancel the event and reevaluate it in 2020, citing its low turnout.  “I don’t think we’re ever going to see another year like 2020,” Arturo Fuentes, the president of the Buenos Aires Biennale, told the New York Times. “It’s very possible that this will be the last year of this exhibition.”In the meantime, the exhibition will still be on view until March 30.\n\n\nThe Museum of the Moving Image in New York has received a gift of eighty artworks from the Italian-born, California-based collector and contemporary art historian Stefano Paglia. The donation includes works by artists such as Michelangelo Antonioni, Paolo Barletta, and David H. Koch, and a selection from the collection that includes pieces by the Italian-born, Manhattan-based artist Marc-Antoine Goldschmidt.The gift arrives in the city from artist and collector Carlo Paglia, who recently donated the works to the museum in a recently discovered treasure trove, according to the New York Times. The trove includes artworks by artists such as", "The next Biennial should be held in Tokyo in the spring of 2021. \n\n\nThe Pulitzer Prize–winning photographer Carlo Ceci, the Italian city of Bergamo, and the Bolshoi Ballet in Moscow have teamed up to create a new cultural life and educational program in the capital of the Russian Republic. The project, titled Art and Life, will feature more than 1,200 works by three contemporary artists from the city, including Sergei Gusev, Boris Markov, and Mikhail Vasilyev. The three artists will collaborate with Italian design students, who have trained in Italy, to create a Bolshoi Ballet  (Bellanca Italiana) exhibition, which will run from March 25 to March 27.In a statement released by the work academy, the organizers said: “This is an extraordinary collaboration, one which will benefit our students and the city of Bergamo as a whole. We are delighted to be able to present Arts and Life in the form of a new generation of designers and artists. Our design students will be able to see all the works created with their training and can use them as inspiration for their own projects.”The project will also include the creation of a new online course", "The next Biennial should take place at the Paris Museum of Modern Art, in August 2021. The 2020 iteration, titled The Promise of  and inaugurated by a live performance by the band the National, had drawn about 10,000 visitors at the time of its opening. If the 2020 edition, also titled While I Sleep, is any indication, the feline event could be even bigger.\n\n\nThe Tingley Museum of Art in New York has received a gift of 231 works by artists and designers that were on display during the institution’s inaugural exhibition at the Tingley, curated by Peter Hujar, director of the Metropolitan Museum of Art. Born and based in New York City, Hujar now lives and works in Los Angeles. Among the works on view are paintings by John Cage, Damien Hirst, Louis Vuitton, and Thomas Dolby.Among the works donated to the museum are paintings by Pierre-Auguste Renoir (1905), who lives and works in Paris; Margelluscu Florez (1902), who resides in Barcelona; and Benjamin O.F. Benson (1902–1975), who resides in New York.Among the works that will be restored to the museum", "The next Biennial should take place in 2021 and will be hosted at the Art Institute of Chicago in partnership with the Chicago Cultural Center. Spring Awakening—a program of the Art Institute of Chicago that will focus on the life and work of artist-in-residence Rachel Carson—will be held in September and will be presented by the Art Institute of Chicago. \n\nGreater Manchester Museum (GM) has appointed Tania Bruguera as its new deputy director for collections and exhibitions. Bruguera comes to the institution from the Tate, where she has served as interim director since February 2019. She succeeds Sarah-Jane Frazer, who retired following a twenty-five-year tenure after leading the museum for more than three decades.“We are delighted that Tania will be joining the GM team,” said Caroline Gass, director of the Tate. “Tania will be integral in the development of our collections and exhibitions and will help shape the future direction of the museum.” Frieze, the South Asian cultural conglomerate headquartered in Mumbai, announced that it is expanding its presence in England with a new six-month residency program. Developed by Lisbon-based company G", "The next Biennial should be held in 2020.  The exhibition’s next edition, slated to open in March 2021, will be an attempt to present the work of 70 artists rather than a survey of the twentieth century, a decision which has been criticized as problematic for its titration of the history of art. The third edition of the event will now be held in the year 2200.“The decision to postpone the show has been made in order to focus on the exhibition of the exhibition, which is our main objective,” said director Karina von der Leyen. “The Biennale is currently undergoing a radical transformation. It will be a challenge to present the work of the entire collection in the exhibition in the shortest possible time.”The exhibition will also be overhauled in order to increase the exhibition’s visual impact and enhance the visual experience for visitors. The museum will present a new exhibition, “The Legacy of Art: A History,” which will explore how art and design have shaped the future—and its past—of the city of Groningen. This exhibition will be held on March 26—a date that will be chosen by the biennial committee after consulting with the city. Art historian Jan", "The next Biennial should be held in 2021.\n\n\nThe International Center for Photography (ICP) in Florence, Italy, announced that it is planning to close its doors indefinitely. The institution, which was founded in 1972 by Francesc Belfort, Renata Cicutto, and Marta Cicutto, was one of the first photography-centered cultural centers in Europe. Founded by the Italian architect and collector Stefano Martini in 1992, the museum has staged six seasons of the exhibition “Canto Filomena,” which brings together fifty works by up-and-coming artists, and has collaborated with artists such as Mario Bonetti, Paolo Baratta, and Francisco Burri.Following an announcement in December 2018 that the museum was to close in 2023, the institution staged a series of exhibitions throughout the year. In an attempt to re-emerge from the effects of the pandemic, the museum will reopen in January 2020. The renovation was completed in the same year that the museum became the venue for a retrospective of Il Paolo Nuzzo’s first exhibition, “The Diary of Il Paolo Nuzzo.”The exhibition’s first season at the museum", "The next Biennial should be held in 2021, Kotak said, and that the institution would’t have any further involvement with him past that date. According to the Art Newspaper, Kotak was invited to participate in the 2020 event but declined the invitation. Kotak graduated from the Art Institute of Chicago in 1968 and later worked as an independent curator at the Museum of Contemporary Art Chicago, where his first exhibition, the “Art of Mankind” (1971), was staged. He later joined the City Museum of New York in 1975 and served as a curator at the Museum of Modern Art until 1988.Kotak’s art has been featured in more than seventy-five biennial exhibitions, including the Chicago International Film Festival (1992), the Chicago Architecture Biennial (1999), and the Chicago Documentary Festival (2007), and he has had solo exhibitions at the Contemporary Art Museum St. Louis (2006), the Museum of Contemporary Art Los Angeles (2008), and the Museum of Contemporary Art New York (2008). His art can also be found in the collections of the Illinois Museum of Art, the National Gallery of Art, the Metropolitan Museum of Art, and the Whitney Museum of American Art.Commenting on his many exhibitions, Kot", "The next Biennial should be held in 2020. The price of the entry has not yet been specified.\n\n\nThe Museum of Arts and Design (MAD) in New York has received a gift of forty-four works from the organization that specializes in the collection of works by a single artist. The donation includes works by artists such as David Hockney, Willem de Kooning, and the late Frank Gehry and his associates as well as works by artists such as Pierre-Auguste Renoir and the late painter Ola-Maria Reinhardt.“I am extremely excited to welcome MAD to the gallery as a new partner in the museum’s mission to connect contemporary art with urban realities,” Museum director Michael Taft said. “We are particularly grateful to MAD members and supporters for their collaboration and support in the years since we first introduced the gallery to the world through our current permanent collection in 2011. Their dedication and passion have made MAD a meaningful presence in the city’s art scene.”MAD was founded by the late collector Pierre Bénétière in the late 1960s. Among its early supporters were the late John and Mary McCormack, who together raised $350,000", "The next Biennial should be in the spring of 2020. The exhibition has been in development since 2013 and was selected by a committee chaired by Abraham. “Astonishingly, the work was selected in spite of the fact that many of the works previously exhibited were actually staged solo exhibitions in the past, and in spite of the fact that the exhibition was supposed to be a collaborative effort between the artist and the architects,” said Abraham. “This is an unprecedented achievement, and one that really strengthens the importance of the exhibition to the entire art world.”The exhibition will now return to the Museums in Oslo, the Dusseldorf, and the Austrian city of Württemberg, as well as to the Kunsthalle Basel in Switzerland, before its first leg, which will run from March 21 to March 24 in 2020, in February 2021. \n\n\nThe Museum of the City of New York (MoCA) has received a $500,000 donation from a group of donors in recognition of its dedication to supporting cultural institutions and its contributions to diversity and inclusion. The gift was made through the Sylvia and James B. Holt Foundation, a charitable organization that supports arts and cultural institutions across the", "The next Biennial should take place in future years. The next two years should be dedicated to exploring and discussing the intimate interconnections between film and visual art and perhaps highlighting the ideas that have traditionally been denied film and visual art.\n\n\nThe Museum of Modern Art (MoMA) in New York is planning to restore a two-century-old work by Pierre-Auguste Renoir in an effort to re-create an aesthetic through the construction of a new, larger-scale installation, the Louvre Experiment, that will open on January 23, 2021. The eight-story complex, which was completed in 1989, will be the centerpiece of a three-year, $12 million overhaul of the museum’s building.The Louvre Experiment will reimagine how the museum will present new works by Renoir and other modern painters by positioning the work within the museum’s existing collection of works by Claude Monet, Pierre-Auguste Renoir, Michel Tocque, Georges Aposté, and Jean-Marie Magritte. The reimagined space will also incorporate a lobby, a library, a replanted garden, and the installation of a Renoir sculpture.The renovation, which is part of MoMA’s ongoing", "The next Biennial should take place in 2020 and will be hosted at the Arts and Design Museum in Boston. The 2020 edition will span five continents, feature fifty-two works by twenty-one artists, and showcase both new and familiar works by the artists. The show will also include a virtual reality experience, a workshop for contemporary and experimental artists, and several exhibitions. The 2019 edition of the Biennial, “After the Fall,” featured twenty-six works by forty-two artists. A full list of the artists who will represent the biennial can be found on the exhibition’s website.\n\n\nThe Center for Contemporary Art (CCA) in New York has appointed Stephanie Byron as its new director. Byron comes to the institution from the nonprofit New Art Center (NAC), where she served as interim president and chief curator. She succeeds Susan Segal, who retired in February 2019 to head the Brooklyn Museum, and will take up the post on August 5.“Stephanie was instrumental in shaping the NAC into the institution it is today, and I’m proud to have her on staff as we move into the future,” said interim director Beth Miller. “Stephanie’", "The next Biennial should take place in 2021. \n The CNA’s recent exhibition, “The Crucible,” exploring the work of our contemporary contemporary artists, was organized by the New Museum and the Hirshhorn Museum in Washington, DC, at an estimated price of $100 million. The 2018 Art Basel Biennial, which took place in Hong Kong, was organized by the Pérez Artístico in Mexico City. \n\n\nThe Museum of Fine Arts (MFA) in Minneapolis has agreed to sell its collection of twenty-six works by the internationally-acclaimed Georgian novelist Arash Ablyazov, who passed away on December 12 at the age of sixty-five. The works are currently on display in “Arash Ablyazov: Twelve Years of Novel,” which is currently on view at the South by Southwest (SXSW) in Austin, Texas; the Museum of Fine Arts, Boston; and the Art Institute of Chicago.The museum also announced that it will no longer receive funding from the Koch brothers, the industrialists who are major donors to the institution. According to the New York Times, the Kochs gave the MFA $2 million in", "The next Biennial should include a talk by Yoko Kanno, who is known for her contemporary art, and will take place at the same time as the European Biennial. The third, which is currently on view, will be a talk by Anselm Kiefer, who recently won the George Cukor Award for excellence in American art, and will run from March 18 to March 22. The fourth and final exhibition will be a selection of works by artists from South Korea, China, and Japan. According to Artnews, the show will run for ten weeks. Kanno and Kiefer will be welcomed by the participants and will be given a grand opening reception at the Stockholm Art Museum on March 10. The first exhibition of the new series, “What is art?” will take place at the Museum of Contemporary Art in the East in August. The next edition, “What is life?” will open at the Museum of Modern Art in the United Kingdom on September 25.\n\n\nThe University Museum of Chicago (UMC) has officially welcomed the work of artists Anezka Al-Hadid and Svetlana Gubareva to the museum. They will portray characters from", "The next Biennial should be held within the next two years. However, given the current situation, the organizers are currently in the process of reopening the Exhibition Center. “We are actively looking into all possible possibilities,” said José Baptista, the president of the biennial, in a statement. “Andrea Biennale, the architects of the Biennale, will continue to be involved in the dialogue with the public through exhibitions, education programs, and ​institutional development.”\n\n\nWhile the Koch brothers, the oil magnates who bankrolled Donald Trump and Hillary Clinton, respectively, continue to funnel money into conservative political causes and ballot initiatives, their sprawling private investment empire is also pumping tens of millions into research and education on climate change. The Koch Institute for Integrative Cancer Biology and Cancer Prevention in Cambridge, Massachusetts, received $5.5 million from the brothers Charles and David Koch this week, the American Alliance of Cancer Researchers (AACRB) announced today.The Kochs made the gift, which means a total of $7.5 million for the institute, after the AACRB launched a campaign to increase awareness of the global climate emergency. The initiative, which began with a billboard campaign in the fall of", "The next Biennial should take place in 2021. \n\n\nThe Foundation for Contemporary Art (FCA) in New York announced today that it will not proceed with the next edition of the Whitney Biennial unless the institution alters its original plan to hold the exhibition in 2022. The announcement follows the suspension of the exhibition and the subsequent shutdown of the museum, which was founded by a group of New York City–based artists in 1984.The New York Times reports that the change of plans has stuck, and that the biennial’s organizers are making since they say they do not want to be like the Whitney Museum of American Art, which moved the exhibition from its original location in mid-March, to one of its new exhibition spaces in the coming months. The change of plan has also been made since they fear that “this will be the last year of the current exhibition program,” the end of the exhibition calendar and the exhibition schedule. “We want to be very, very careful about what we’re saying because it could be misinterpreted as us saying we’re done with it.”The decision about whether to proceed with the biennial, which was made in March 2017, has been contentious since the exhibition was", "The next Biennial should be held in 2021.\n\n\nIn a remarkable development, the US House of Representatives voted yesterday to approve a $2.2 trillion federal aid package for arts and cultural institutions. Introduced by New York Democrat Richard E. Neal\u0097who chairs the Culture, Education, Labor, and Pensions Committee and represents parts of Brooklyn and Queens, New York\u0097the   $2.2 trillion legislation is the largest package of public assistance to date and will provide $1.45 billion for academic and $0.25 billion for cultural institutions.“This is a historic day for America and we are grateful to our lawmakers for recognizing the importance of supporting the arts and our cultural economy in their districts,” said Catherine Frazier, president of the National Association of Theater Owners. “This legislation will help keep talented and innovative artists and arts professionals in Washington, DC, and in our communities, while providing critical relief to those who cannot work or care for their families because of their serious illnesses.”The legislation, which was passed by a vote of 227 to 213, is part of a $2.2 trillion package that will immediately provide $1.3 billion for academic and $", "The next Biennial should take place at the annual Art Basel fair in Hong Kong, which will be held in March 2020.  One of the most anticipated exhibitions in the year that will welcome the art world is the first exhibition dedicated entirely to the Japanese artist Mitsuyoshi Takemoto, who is celebrated for creating works in his studio in Tokyo. It will be titled Takayanagi Toshigi: Shukusoku no Hibi (Hiroshima Crime Scene).“The exhibition will showcase the work of the artist in the form of a combination of the traditional and modern, highlighting his practice and his most recent works,” said the exhibition’s curator, Yoko Ike. “The exhibition will also reflect the continuing fascination with the Vermeer and the artist’s aesthetic. Takayanagi Toshigi will be a great opportunity to see the artist’s paintings appearing throughout the years.”The theme of the biennial is “The Body/Collapsing Body,” a selection of Takayanagi’s recently acquired works, which she said were meant to evoke “the gesture and movement of the body in self-portraits,” and will open in February", "The next Biennial should be back in 2021, said Zhu Rong, CEO of the National Museum of China Art. “People have to understand that if you don’t start the building of new museums, if you don’t invest in the museum already, if you’re only bringing up the museum of the past, it’s going to be hard to do history well in the future.” The meeting of the National Museum of China Art and the Museum of Modern Art in Beijing featured a number of new proposals for exhibitions and events that were centered around China’s contemporary art, with the the National Museum of Contemporary Art (MCA) presenting works by artists such as Huang Ziyi, Wang Jianlin, and Fan Bingbing.Among the works in the show were the show “Spring's Embrace.” In the film, 1969, the artist Gao Zhichun, whose \"First to Spring\" sculpture takes place in a spring forest, performs a dramatic dance in order to evoke the springtime in Beijing. The exhibition also showcased works by artists such as Fan Bingbing, Zhang Yaxuan, and Xu Yunshan.A new program, curated by Brian Fitzpatrick, director of", "The next Biennial should be announced as soon as possible. The US pavilion will be on view until the end of October.\n\n\nA group of artists and collectors are urging the UK to open up its archives and allow the public to view more than 3,500 images related to the late British royal architect Sir Winston Churchill. The exhibition “Dominion of the Designer,” which coincides with the centenary of the death of Churchill’s first major monument, will feature more than 360 works that examine the relationship between architecture and design.The exhibition includes work by fifty-five British and American artists, including Eileen Atkins, Robert Mapplethorpe, John Hirst, Frank Gehry, and Michael Kors. This year’s event, which is supported with £100 million from the Churchill Trust, was initially planned to run from March 20 to March 22, 2020. The exhibition has faced several delays and has only recently been pushed back. Artforum reports that the exhibition, which will run across three buildings in central London from March 26 to March 29, 2019, will be open to the public from March 28 to March 29.British Prime Minister Boris Johnson announced the reopening of the exhibition on March 13. The exhibition", "The next Biennial should focus on how the body functions as an autonomous entity in space and how its interaction with the environment can have a significant impact on the body and society. With the increasing importance of the body in contemporary life, the theme should be how the bodily functions and activities can be enjoyed and utilized by the public. The biennial should be organized as a platform for the exchange of contemporary art.\n\n\nThe Solomon R. Guggenheim Museum in New York has appointed Laura Haddock as its next director and CEO. Haddock comes to the institution from the Museum of Modern Art (MoMA), where she has served as director and CEO of the last two years. Previously, she was the chief curator of the Feminist Art museum at the Museum of Modern Art in New York and a curator at the Museum of Contemporary Art (MoMA) in Los Angeles.“Laura brings to the position a wealth of experience, leadership, and knowledge to our understanding of and engagement with contemporary art,” said director Daniel H. Weiss. “Her long-term vision and track record of achievement makes her a strong fit for the role of director. We look forward to working with Laura and to the board of trustees to shape a future direction for the museum that", "The next Biennial should be held in 2019. The next edition will consist of three exhibitions and will run from January 13 to February 20, 2020. The series will present new work by twenty-seven artists. Previous Biennials are: 2017 [May 16–May 17] 2018 [May 23–May 29] 2019 [May 23–May 30] This year’s event will take place at the Burj Khalifa’s Grand Mosque, in the heart of the city, in the capital, Abu Dhabi, with the exhibition “Anomaly 2113.”\n\n\nThe Museum of Contemporary Art (MoCA) in New York is planning to open an outpost in the city’s Central Park in 2021, a year earlier than originally projected. The new space, which will be located on the ground floor of the former Central Park Pavilion, will be named The Museum of Contemporary Art (MoCA), and will operate as a collaborative space for contemporary art.“The trajectory of our institution over the last four decades has been an epic adventure,” said Bruce Rauner, director of the museum. “Over the last twelve years, we have participated in more than a dozen major", "The next Biennial should focus on the history of art and culture in Japan, and the exhibition should include a new project exhibition that will highlight the work of contemporary Japanese artists in the US and Europe. The exhibition’s director, Rebecca Hsu, said: “The next Biennial will be a collective effort of artists, collectors, curators, writers and researchers from Japan, the US, and Japan. Weʙre deeply inspired by the collaborative spirit of the artists who are collaborating in this exhibition. We hope that these works will resonate with our audience and inspire us to think of creative ways to share the ten thousand artworks of the twentieth century with our children.”\n\n\nEarlier this month, the Philippine government passed a bill that would give the country’s President Rodrigo Duterte the authority to kill suspected criminals—a controversial provision that has been used to justify the death penalty since he was elected on a campaign promise of eliminating crime. The legislation, which also addresses human rights abuses, was passed by the Senate on February 3 and is expected to be signed into law by President Benigno Aquino III.The legislation, which goes into effect immediately, allows the government to put criminals to death by hanging or shooting if they are known or", "The next Biennial should be held in 2020. \n\n\n\nThe Art Gallery of Ontario (AGO) in London has received a gift of seventy-two works from the collection of the late collector and philanthropist Robert Smith, who was a major collector of art in the United Kingdom. Located on its website, the gifts include works by artists including Georges St-Pierre, Joan Miró, and Pierre-Auguste Renoir.The museum is also the permanent home of works by nineteen Canadian artists, including Mark Bomback, Jocelyn Gish, and David C. Driskell, who were all present at the exhibition. The collection includes works from the late Anton Chekhov, who was a close friend and collaborator of Smith, as well as works by the late French artist Renaud Léger, who was one of Smith’s main clients.“The Smith Collection is a landmark in Canadian art history,” said Elizabeth Gummer, the curatorial chair of the exhibition. “His works are admired worldwide, and his immense generosity was a source of great inspiration to many of his artists. We will always treasure him and his legacy, and hope that his work can inspire young artists to connect with their roots and to", "The next Biennial should be held in 2020. The exhibition will include work by thirty-five artists and will be hosted by the Japanese artist Kiyomi Fujiwara.\n\n\nArt historian and curator Lisa Lam, whose work explored the concepts of beauty and fashion, is suing the Chinese manufacturer Fairy Company over a promotional campaign that was released by Tokyo-based art collector Zhang Yaxuan last month. The lawsuit, filed in the Chinese city of Chengdu in the Nanjing District Court in China, claims that Zhang violated copyright law by exploiting the works of thirty-five artists, including Ai Weiwei, Washu Lui, Hans-Ulrich Pfeifer, and David North, for the exhibition.The twenty-first Central Art Museum Beijing (CANA) has been forced to move the exhibition “Fairly Oddities,” an exhibition about textile and metalworks, from its opening in September. The exhibition was supposed to open on September 18, but was postponed due to the Covid-19 pandemic. The February 7 launch date for the exhibition has since been moved to February 19, 2020.“I want to apologize to all the artists who were hurt by Zhang Yaxuan’s presentation of these works and to all", "The next Biennial should take place in November 2021. The first was held in February 2019 and the second was held in December 2019. Since neither the museum nor the organizers of the show in question are interested in holding a second exhibition, the show will be closed. The exhibition will be the last of the fifty-four-year-old show and will begin a retrospective, “The Future Is Present,” in March 2021.\n\n\nThe Museum of Fine Arts (MFA) in Boston is continuing its work to open to the public after it shuttered permanently earlier this month to make way for the construction of the museum’s new home. According to the Boston Globe, the museum—which had been closed since November 3—is now anticipating a March 21 reopening date for its Brooklyn campus. The extension of the museum’s hours and the expansion of its collection will begin on March 22.“Our current schedule is to open March 22, March 24, March 26, and March 28, and we expect that to be in line with a typical March opening,” said David Crockett, director of the museum, in a statement. “We remain confident that we will soon be able to welcome visitors to the museum", "The next Biennial should be held in 2020. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it will begin allowing visitors to the institution’s Los Angeles branch to bring back-to-the-art works from the museum from the second it relocates to the city, replacing the current two-year residency program. The move follows the completion of the museum’s renovation and expansion project, the expansion of its footprint, and the expansion of its curatorial staff.The new program, known as the Muse’s Return, will offer monthly stipends of $2,500 to students and small-scale exhibitions that will be curated by the institution’s curators and will begin on Wednesdays, July 13–July 15. The first exhibition, “Back to Basics,” will feature twenty works from the institution’s collection that were featured in the renovation of the museum in 2015 and the redevelopment of the Los Angeles County Museum of Art (LACMA), which is currently being completed. The second exhibition, “Surreal Dynamics: Contemporary Art in Motion” will take place in September and is slated to run for one month.The move comes a little", "The next Biennial should be held in 2020. In the meantime, the museum has released some of the first design plans for its new location. The most recent projects include a monument commemorating the first female president, a sculpture garden and the museum’s annual Off-Campus Art Contest, and a mural by artist Carrie Mae Weems.The museum has also revealed that it will hold at least one exhibition in the refurbished building every other year. The first will be “Wave of Life: Faculties and Institutions in a Collection,” which will focus on the work of the several hundred works in the museum. The second will be “Theater of Operations: The Ongoing History of the US Army” and will consist of twenty-one works by twenty-three artists. The third will be “Avant-Garde Experiments in Art” and will feature work by twenty-five artists. “We are thrilled that the new Panorama Gallery will bring together the extraordinary visual talents of Kiki Smith, David Ray Griffin, Sarah Jordan, and Peter Sellars, and will continue to present provocative works by artists like Flemish artist Krzysztof Wojtas, who depicted", "The next Biennial should be unveiled in March 2020.\n\n\nThe Danish architecture firm O2 Architects has announced that it is planning to leave the Danish National Museum and its building in Copenhagen following the 2020–21 season following “a real reckoning” following an internal review into the institution’s operations.The review, commissioned by the Danish government, concluded that the current program, which was launched in the summer of 2019 and runs through spring 2020, was not meeting the expectations of visitors.“The museum is currently facing many challenges, including the reopening of the National Museum Copenhagen in March 2021, and the upcoming reopening of the Danish National Museum in March 2022. We are confident that in the coming months we will be able to overcome these challenges and bring the museum to life again, in an exhibition programme that is truly memorable,” the firm said in a statement.The Danish National Museum will not be demolished but will be rebuilt in the capital city of Copenhagen, in a building that will take up three of the museum’s four floors. The renovation project will involve the demolition of the museum’s original concrete and glass facade on the fifth floor and the foundation of the Danish National Museum, which was built in 1940, for", "The next Biennial should take place in the summer of 2021. The five-day event will be inaugurated by a presentation of forty works by domestic and international artists (including Isamu Noguchi, Mark di Suvero, and Anish Kapoor), and will include the artist’s first solo exhibition in Milan and the first show organized by the Milan Architecture Biennial. “The theme of the biennial is the celebration of the flexibility of memory and the existing memory, and will be somber and enigmatic,” said Valeria De Sanctis, chair of the Art and Architecture committee. “The exhibition will be dedicated to the period of the twentieth century, with a particular attention to the contemporary. We will create a new kind of sculpture for the exhibition: a sculpture that can recall and appear to be a past work.”The event will include work by thirty artists and will run for five days.\n\n\nThe Museum of Fine Arts (MFA) in Boston has received a gift of more than four hundred works by artists such as George Frank, Anita Gupta, and John Coltrane. The donation includes works that have never before been on view in the United States, including drawings, sculptures, and coll", "The next Biennial should take place in 2021, and the shortlisted artists will each receive $500.The 2019 prize was awarded to Galerie Bénédicte Savoy, where Josée and Maximilian Savoy made a landmark exhibition at the Vault in Paris in 1983. The museum has yet to announce the new winners of the prizes.The biennial will take place in Paris from February 19 to February 20, 2020. The winners will be announced on March 26.The prize jury said: “The works in this exhibition, together with the exhibition itself, were given a special significance by the participants. Maximilian presents a very important new work which is a continuation of the themes of ‘memory’ and ‘systematic degradation. The exhibition also pushes the limits of the artwork in a new way. Maximilian and Josée were able to present a work which was both a reflection of and a departure from the previous works in the series. In addition, their work was selected for its extraordinary extraordinary staging, the fact that it was presented in a large-scale, and the fact that it was staged by two artists. It was the most important exhibition of the year.”In the inaugural edition of the award", "The next Biennial should be held in the first quarter of 2022. The institution will then prepare to host the third iteration of the event in the second half of the year, which will be staged in the Cultural Centre, the Musée d’Art et d’Histoire, and the Arc de Triomphe. Although the 2020 event was cosponsored by the French Ministry of Culture and the European Commission, the museum’s director, Joël Van der Vorst, claimed the 2020 edition would be different from the previous two. “The next Biennial will aim to be an uncluttered, spontaneously organized, and ecologically sensitive event,” Van der Vorst said. “In the past, the museum has frequently been seen as a vehicle for the preservation and promotion of culture, and has participated in and celebrated the cultural life and history of many countries. We are now on the way to making the most of our new unique building.”\n\n\nThe Museum of Contemporary Art (MoCA), London, which closed in March after nearly eight years of operations following a $145 million expansion project, is back with a new, expanded, and expanded-to-capacity exhibition, “The Gallery Within", "The next Biennial should be held in May 2020.\n\n\nThe Museum of Egyptian Art in Cairo opened the new exhibition “The Wonders of Life,” a four-hundred and thirteenth-century collection of work by Egyptian masters, on Wednesday, March 3. The exhibition will examine the transformations of the landscape and the atmosphere in Egypt during the Pharoah and his time.Dubbed “The Wonders of Life,” the exhibition follows the publication of a book by Egyptian scholar Youssef al-Qasimi entitled ĜThe Garden of El-Maḥrif,” which will open in the United Arab Emirates in October 2020 and is the first book to address the subject of the ’Pharoah’s influence on the art of the Three Kingdoms Period. The section titled “Art from the Ancient Egyptian Period” will be on display in Abu Dhabi from March 17 to March 19.The exhibition will also present works by artists such as Adham Edidi, Abu Al-Dahab, and Khaled Hosseini. While in Abu Dhabi, the exhibition will highlight the ’Pharoah’s influence on the artists who created the ’Plains of Egypt,�", "The next Biennial should take place in 2021. The next edition is slated to run in the Frankfurt am Main region from July 22 to July 28. The next edition will be staged in the Netherlands, Germany, the United Kingdom, and the Swiss Alps.  The 15th edition of the Biennial will be held in the Italian city of Roma from March 29 to April 22, 2021.\n\n\nThe 2018 Venice Architecture Biennale will be remembered for its digital-first design, combining digital and physical elements in a way that was unprecedented for the exhibition. The 2018 edition, titled “The Future Is Digital,” featured more than 150 works by twenty-eight artists and exhibited numerous digital innovations. The exhibition’s third exhibition, “Imbeci e decisi,” curated by Elena Calatrava (Stella Carretta, Spring 2019) established a new digital medium through the paintings of the Italian artist Federico Bocconi.The 2018 edition of the biennial, “The Future Is Spinning,” opened at the Bardo di Castello in Florence on February 8, 2019. The exhibition was preceded by a “Virtual Planet,” which was organized in collaboration with artist Ann-", "The next Biennial should take place at the Museo de Arte Contemporáneo de São Paulo, Brazil, in November 2021. The 20th edition will take place at the National Museum of Contemporary Art in São Paulo in May 2021.The next edition of the Biennale will be held in New York, New York, in March 2022. The exhibition will eventually culminate in a show of the work of Christine and Ronald Lauder, the duo behind the cosmetics company Estée Lauder.Lauderly has been accused of fraudulently obtaining money and of causing enormous losses to clients who were represented by the company. The couple founded Estée Lauder Cosmetics in 1992, a year after the birth of their daughter, and the company has undergone a dramatic shift in its business model over the years. Since the birth of their daughter's son, the company has moved to more of a consumer-focused architecture, focusing more on prestige brands such as Estée Lauder and Ferrara and less on its more traditional brand of men’s grooming products.Estée Lauder has maintained that the recent allegations against the couple are part of a long-standing campaign to discredit their work, and that the allegations against Michael are part of a “pro-business", "The next Biennial should take place in the winter of 2020–20, and will be curated by Dara Abou-Rahme, chair of the United Kingdom’s socialist state council, and Karin Beasley, head of the South African National Union of Students’ Students Campaign, in partnership with Minneapolis’s Middle and Far Left Parties. The show will also feature works by artists such as Raynal Croft, Hilma Wolf, and Pam Gillingham, as well as works by artists from Africa, South America, and Asia. The date of the next event will be announced.\n\n\nThe New York City Department of Cultural Affairs (DCLA) announced today that it has awarded the fifty-third and final contract to the Corus Entertainment Group, the New York–based cultural conglomerate that employs over four hundred people and includes the Corus Museum of Art, the Institute of Contemporary Art, and the Corus Theater. The fifty-sixth contract was awarded to the Tanglefoot Collective, a New York–based artist-run nonprofit that works with artists and small-business owners in the surrounding area. The group will perform at the Brooklyn Bowl in the spring of 2021, and", "The next Biennial should be held at the museum in 2021. The museum hopes to host a successor exhibition, “The Way We Live Now,” at the museum in 2022. \n\n\nThe British artist who was a key member of the group who designed the contemporary art museum St. Ives in West London has died at age eighty-nine. The cause of death was pneumonia, and the artist was suffering from a degenerative brain disease.Born in Leeds in 1930, St. Ives was raised in London and attended the Institute of Design in the City of London before marrying the architect and using her art to shape architecture and social policy. “While at the Institute of Design, she helped shape the direction of the museum with the establishment of the 'Buyers Club,'” Jane Merrick wrote in a review in the May 2005 issue of Artforum. “The new club was open to the public as a way of giving the museum a more personal touch. It was also a way of introducing the public to the work of British painter-and-fabricator Ed Moses, who became a major influence on her work.”After graduating from the institute in 1954, she began her six-decade–long “Dream House", "The next Biennial should be in January 2021.\n\n\nThe Institute of Contemporary Arts (ICA) in New York has appointed Domenick Amorano as its next executive director. He will take the helm from Douglas Berman, who has served in the role since 2015, and will begin his position in January 2021.“Domenick’s professional experience and background make him uniquely qualified to lead ICA as we continue to evolve as a modern and contemporary American institution,” said ICA board chair Naomi Gibbs. “With his extensive experience in curating and presenting shows, including the inaugural Emmy Awards and the 2016 Sundance Film Festival, Domenick has the opportunity to further enhance the ICA’s exhibition–driven and community-building mission.” Amorano, who has served as chief curator since 2015, most recently led the inaugural Emmy Awards, which launched in 2016 and featured a new season premiere of a new series of works by artist Marc-Antoine Delorme, and the 2016 Sundance Film Festival, which featured twenty-five films. He also curated the inaugural season of BBC Radio 4’s 'The World At Large' and curated the inaugural season of BBC Two’s “The", "The next Biennial should take place in the summer of 2021.\n\n\nThe Metropolitan Museum of Art in New York has appointed Laura Owens as its next executive director. In her new role, Owens will assume her responsibilities from Audrey Niffenegger, who will resign in July 2020 following a decade as the museum’s director.“Laura has been instrumental in shaping the museum’s cultural and educational narrative since she joined the team in 2013 and has helped define the museum’s relationship with New York City through her vision and leadership,” said Daniel H. Weiss, the museum’s executive and director. “Laura and Audrey both give us a rare combination of vision and depth as we navigate our way through this significant moment in our city’s history. We are grateful for their contributions and look forward to their continued leadership role as we continue to attract and showcase the extraordinary work of New York’s artists and thinkers.”Niffenegger assumed the helm in January 2019 following the death of Director of Curatorial Affairs Christopher Knight, who was a leading curator at the Museum of Modern Art in New York. She was succeeded by her successor, Amy Kremer, in August 2020. \n\nThe Los Angeles County", "The next Biennial should be held in 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles officially named Kate Kelly its first director since its founding in 1970. Kelly has been with the institution since 1987 and took the helm from longtime board president Robert Berlind and board president David Kestenbaum in 2017.Kelly will be responsible for ushering in its next iteration, titled the Architectural Evolution, which will run from December 20 to December 22, 2020. The theme of the exhibition will be “Reconstructing the Past to Contribute to the Future” and will consist of two parts: “Building a New World Story: The Art of Architecture from the Contemporary to the Past” and “Reconstructing Identity: The Art of Identity and Race in America” Kelly will be assisted by an editorial board made up of artists and cultural producers; architects and curators; and cultural historian Luis Castaneda.“The current exhibition’s ‘Building a New World’ sequence, for which Kate took part, is the most ambitious and ambitious project that the Museum has ever undertaken. It explores the way architects construct narratives and the way architecture works. This exhibition is being created as a work", "The next Biennial should take place in the coming months. In May 2020, the institution will inaugurate the Maya & Dayan Gallery, founded in 1959 by artist-turned-philanthropist Moschino. In May 2021, the museum will unveil the first exhibition devoted entirely to Japanese art.  “We are delighted to announce that the 2020 and 2021 editions of the Biennial will take place simultaneously,” said Ulrich Bieneke, director of the Biennial. “The project of the 2020 Biennial was born from the original proposal of Maya & Dayan in 2017. The project of the 2021 Biennial was born from the invitation of the artist-architecture-collector, María Berrío, and the designers Lorenzo and María Monaghan. We are grateful for their participation in creating Biennial. ”\n\n\nThe Hollywood Sign, a monumental sculpture by American sculptor Frank Gehry, has received the National Endowment for the Arts (NEA) prize for its contribution to the visual arts. The 2018 award, which honors the artist’s contribution to American art, was established to recognize the full range of", "The next Biennial should take place in the fall of 2020. The next will be held in the spring of 2021. The next will be held in the spring of 2022. The next will be held in the spring of 2023. The next will be held in the spring of 2024. The next will be held in the spring of 2026. The next will be held in the spring of 2028. The next will be held in the spring of 2030. The next will be held in the spring of 2032. The next will be held in the spring of 2034. The next will be held in the spring of 2036. The next will be held in the spring of 2038. The next will be held in the spring of 2040. The next will be held in the spring of 2048. The next will be held in the spring of 2048. The next will be held in the spring of 2051. The next will be held in the spring of 2053. The next will be held in the spring of 2057. The next will be held in the spring of 2061. The next will be held in the spring of 2065", "The next Biennial should be held in 2022.  ​This exhibition will be funded by the Biennial Foundation and will take place in conjunction with the reopening of the museum. The museum will be fully accessible to the public from March 17 to March 19, 2021.\n\n\nThe Institute of Contemporary Arts (ICA) in London announced today that it intends to accelerate the expansion of its primary European art museum Dorothea Rock in London, through the acquisition of additional artworks by 150 artists and collectives from the current eighty-two. Dubbed the Dorothea Rock Centenary Scholars Program, the initiative will support artists who have made significant contributions to art and their institutions in order to promote understanding and appreciation of contemporary art and to encourage a better understanding of the curators and artistic producers of the past.The program will also introduce an online version of the museum, including virtual tours and new initiatives.Called Dorothea Rock Centenary Scholars, the program will be introduced on the ICA’s newly acquired site at Queen Elizabeth Olympic Park, where the museum will soon have a new exhibition dedicated to the late British artist Jane Pollock.The initiative has been in the works since 2017, when a group of artists and curators formed to spearhead", "The next Biennial should be held at least once a year, but ideally biennials should consist of a series of exhibitions.” \n\n\nThe lead painting of the fourth edition of the Crystal Bridges Art and Design Biennial, which is currently on view in London from February 6 to March 5, 2020, was released on Thursday, February 16. Curated by Ron Chernow and Paul Hetag, the exhibition features work by seventy-seven artists from forty-three countries and thirty-six cities. This year’s event will be held at the National Portrait Gallery in London. \n\n\nStevenson Ryan, the British painter best known for creating abstract, pastoral landscapes that evoke the ancient Maya mythologies of the Andes and the Andes in Peru, has died at the age of ninety-nine. Known for his psychedelic, dreamlike landscapes, which embrace both esthetics and the spiritual, he is survived by his daughter, the novelist Charlotte Sarr; his son, the artist Mark Eggleston; and his granddaughter.Born in London in 1930, Ryan studied at the School of the Art Institute of Chicago, then at the Royal College of Art in London, and graduated from the Institute of Arts and Design in London in", "The next Biennial should be held at the Temple of the Immaculate Heart of Mary in Rome, a year from now. Hannah will serve as the inaugural director of the exhibition. Her appointment comes a year after the inauguration of the Temple of Justice in the city of Los Angeles, as well as the reinstallation of the capital’s streets by the city of Rome.The decision to award the royal commission came after the architects completed their evaluation of Cultural Patriarch Kirill, whom they described as the theologian, the teacher, the philosopher, and the creator of art. The biennial will be a collaboration between Hannah, BIC, and the Vatican. The Architecture of Success, which will take place in the capital of Moldova from September 13 to September 21, 2018, will not have a set date but will highlight the work of young and internationally-known Moldovan architects. The theme of the exhibition will be “Thematic Essays,” reflecting the growing concern over the influence of the Orthodox Church on contemporary architectural practice. Previous themes have included “Institutional Architecture” (2013) and “Architecture and Design in Romania” (2008).The bi", "The next Biennial should be held at an area museum, such as a local shopping mall or a public park, in the city, and the city should collaborate with local stakeholders in the city to create the ideal environment for the exhibition. It should also promote photography and the art of the local area rather than focusing on the collections.The exhibition will be hosted by the city of Vancouver and will run from April 17 to April 21, 2020. The full list of participating galleries is as follows:David Zwirner (New York)David Zwirner (New York)Dayton Contemporary (New York)Daniel H. Basu (New York)Daniel H. Basu (New York)Jonathan Barlow (New York)Daniel H. Basu (New York)Daniel H. Basu (New York)Daniel H. Basu (New York)Daniel H. Basu (New York)Art Gallery of Ontario (Ottawa)Art Gallery of Ontario (Ottawa)Daniel H. Basu (New York)Dale Hunter Gallery (New York) Daniel H. Basu (New York)Daniel H. Basu (New York)NIRIN Contemporary (New York)Daniel H. Basu (New York)Daniel", "The next Biennial should be the culmination of a yearlong project. Since the exhibition was established in 1996, the museum has staged more than seventy-five exhibitions annually. • Ally Cady, who has worked in the arts for more than twenty years, said: “We are thrilled that the project will finally be completed. The exhibition will open in December 2021, and will feature the work of seventy artists from sixty-five countries. The show will mark the occasion of the centenary of the British Invasion, and will celebrate the biennial’s thirty-third edition, ‘The Conceptualist’s Birth of Modernism.”The British pavilion was organized as part of a global campaign launched by British Prime Minister Boris Johnson and British councilors Lord Mandelson and Sir Nicholas Soames to promote British cultural exports abroad. Leading the way were five pavilions—the Tate, the National Galleries of Scotland, the National Galleries of Wales, and the National Galleries of Ireland—that were built in the UK and opened in the months of December 2019, March 2020, and July 2020. The National Galleries of Scotland, the National Galleries of Wales, and the National Galleries of Ireland are all participating", "The next Biennial should be announced in 2020.\n\nThe marathon exhibition will mark twenty years of exhibitions at the Museum of Contemporary Art (MoCA), Los Angeles. The twenty-one-thousand-piece collection, which comprises works dating from 1912 to 2017, will include work by eighty-two artists. Fifty-eight of the Biennial’s eighty-two artists will be selected by MoCA director Matthew Polman, who will then select fifty-three artists to represent the institution. Polman and the artists selected for the exhibition have pledged to exhibit their work in the exhibition, titled “The Natural History of Art” during the exhibition.The exhibition, titled “Elementary,” will focus on how art institutions are producing works that are “natural” in order to address issues of sustainability. The show will have a retrospective of work by fifteen artists, a selection of which are currently on display in the exhibition, and will begin with a survey of work in the exhibition, titled “Abrons,” by Yijie Zhang, on June 5.Abrons, a contemporary art exhibition, is a project that is centered around a collection of well-known artists whose works have been exhibited in previous exhibitions", "The next Biennial should focus on the DNA of the modernist, postmodern, and postimage, with an emphasis on the role of aesthetics in the contemporary.”The design of the exhibition coincides with the centenary of the death of Vladimir Murakayev and the year of the birth of Marxist theorist Aleksandr Kondratyrev. During the course of their careers, the trio introduced the mainstream concept of the modernist and the contemporary in art and politics. In 1957, the year the exhibition will run in its entirety, Kondratyrev published a book, “The Modernist Truth,” which argued against the romanticization of the 20th century and revealed the reality of the twentieth. Its successor, “The Modernist Fiction,” published in 1968, remains a landmark work in art history.\n\n\nThe Metropolitan Museum of Art in New York has hired collector and art historian Rebecca Gruft, a scholar of modernism and its relationship with art history, to lead a new initiative to improve the Met’s collection and archiving practices. “The new collection strategy is an extension of the three goals of the Met, which are to advance the museum’s general programming and to increase the museum", "The next Biennial should take place in 2021 and will be open to the public from March 15 to March 19, 2021. The location of the show has yet to be decided.The inaugural exhibition, “Away from the Earth,” was curated by Nikhil Dutt and will open at the MCA in Mumbai on March 10. The show will consist of thirty works across twelve locations, including the MCA, during the span of March 16 to March 20.The museum will present one work each week throughout the week of March 5 to March 7. The next exhibition, “Away from the Sun,” will run from March 7 to March 11, 2021 and will be presented by the future exhibition organizer, the eponymous Festival of the Arts, in association with the MCA. The first exhibition, “Away from the Moon,” will be held at the MCA in Mumbai from March 10 to March 13, 2021. The second exhibition, “Afternoon Tea with the Sun,” will be held between March 6 and March 11, 2021.“I am delighted that the MCA has accepted our challenge to present the next edition of Away from the Earth", "The next Biennial should take place in the spring of 2021. The 2019 event, which was organized by the United Kingdom’s Tate and won the Grand Prix d’Art Contemporain, featured works by fourteen artists and their families, including John Akomfrah, Farshad Malshaw, and Seung-Min Lee, and featured the works of artists such as Damien Hirst, Renzo Piano, and Jean-Luc Godard. The exhibition also featured the work of a number of emerging and established artists including Adam Pendleton, Yinka Shonibare, Kazuo Koike, and Shihan Wang. The organizers said that the dates for the next Biennial will be announced in the coming months.\n\n\nThe twenty-sixth edition of the Art Basel Hong Kong fair, which kicked off on February 30 and ran until March 7, has announced its full line-up for the event, which will be held at the Hong Kong Convention and Exhibition Centre (HKCC) from March 23 to March 27, 2020. The main event will be the annual Dangdai Kai Festival, which will be held at the Fung Wah Art Museum from March 26 to March 28, 2020. The second", "The next Biennial should take place in a museum environment, and the Show will continue to be present in a location that is in harmony with the subjects of the exhibition. \n\nThe J. Paul Getty Trust has announced that it will donate $1.2 million to the Metropolitan Museum of Art in Los Angeles and the Museum of Modern Art in New York in the wake of the Covid-19 pandemic.The trust’s recent philanthropic giving has been focused on art, with the majority of its $5 billion budget going to the institution’s current collection, which comprises works by the artists that have lived or will live at the Getty’s Los Angeles location for at least thirty years. In July, the museum will begin presenting works by a new group of artists, the Frieze Artists’ Legacy, which will draw from the Getty’s holdings. David K. Gallo, executive director of the Trust, said: “We are thrilled to support the fantastic artists whose work we have honored with the gift of their life and work. These artists have shaped the Getty’s collection into becoming one of the most important repositories of American art, and we are lucky to have contributed early in their careers to the platform", "The next Biennial should take place in the spring of 2020. The next will take place in the fall of 2020. The next will be held in the fall of 2020.Enda Kenny, the former first minister of Ireland and leader of the Democratic Unionist Party (DUP), has announced that the twenty-second edition of the Biennale will be staged at the Stéphane de Laët. The event will be held at the Museu de Arte de Lyon, and will take place at the end of June. De Laët said: “After a thorough inquiry into the international situation and the perspectives of all the participants, I am convinced that the first choice should be to stage the first Contemporary Art Biennial at the Stéphane de Laët in the autumn of 2020. Our large-scale exhibition is the best way of building up the country’s artistic and cultural base and creating a new climate of innovation. Therefore, the Festival will take place in the spring of 2021, with a view to a new future for the city of Lyon.”The festival’s organisers had hoped to raise €100 million ($117 million) this year, but ran into financial trouble when the company Red", "The next Biennial should investigate how artworks have affected the way we think about time and how their addition to our collections and institutions affects our knowledge, experience, and future. The platform should also consider how artworks may be incorporated into future projects that will address themes such as time and the future. The exhibition will provide a platform for self-reflection and reflection on the ways in which artworks have impacted our lives. ‘Performance and Pace: From Eskimo to Rock'nRoll” will open at the Museum of Fine Arts in Houston on October 26. Set to open in 2020, the exhibition is devoted to the history of dance, movements, and performance from around the world\u0097including the Americas, Europe, and the Mediterranean. The first section of the museum, “From Eskimo to Rock” will feature the work of ten contemporary artists, each exploring the question of whether the cultural producer should be considered as the self or as an ephemeral. From the contemporary practice of choreography and ritual to the spread of myths and the creation of myths, the artists present a range of work that casts doubt on the historical narratives surrounding the practices of anthropologists and archaeologists.The second section, “Performance and Pace,", "The next Biennial should focus on how perception of the body and the environment influence our social, cultural, and spiritual lives. We should explore the meaning of life through the lens of art and how art can be an instrument for social change. This is what we are doing, and what we will continue to do, in the coming years with the next Biennial. We will learn more from what is happening around us, and we will create more harmonious and diverse lives for our fellow beings.\n\n\nThe Uffizi Architecture Biennial, held in Rome from March 14 to March 16, is now in jeopardy. Following a decision by the Italian government to suspend the formalities of the event, organizers have decided to cancel the event and return the capital to the city of Milan. The announcement follows a dispute between the PP and the government over the scope of the exhibition and the city’s plans to redevelop the historic Punta della Dogana, the medieval city-state’s historic center, and has caused outrage in Italy and beyond.Among the issues that have come under scrutiny are a series of over-the-top hypermedia installations that have been made by artists such as Robert Irwin, Leila Weefur, and David McAll", "The next Biennial should be in October 2021, and the first in March 2022.  The artist-run event will focus on exploring the relationship between the key elements of the artist-made world, including the elements themselves and how they are perceived and created. The theme of the upcoming exhibition will be “The Categories of the Artist” and will be “The Categories of Art.” The first instalment will also focus on the history of Early Modern painters and will follow the theme of the Biennial. The second will explore the history of Art and Architecture, and will be titled “The History of Buildings.” “Early Modern Painters” will travel to the Museum of Modern Art in New York from the Museum of Modern Art in New York. The exhibition will feature fifteen paintings, drawings, and works that were made by seven painters of the late Middle Ages, including Eusebius Vitruvius, Antony Gormley, Klaus von Neu, and Richard Avedon, as well as twenty-five works by artists that were active in the Early Modern period, including Georges Seurat, Michelangelo Simõs, Thomas More, and Thomas Dolgoff. The", "The next Biennial should be held in the capital of the province, the city of Nanjing. The biennial will aim to redress the historical wrongs committed by the Japanese during the Second Sino-Japanese War (1940–1945), and will feature a wide range of contemporary art from Southeast Asia and China. Its director, Tanya and Isuwako, said: We are thrilled by the invitation to China for this exciting event. The exhibition will provide an opportunity for a re-imagining of the twenty-first century with a new narrative of Asia.”The exhibition will be curated by artist and curator Andrei Medvedev, and will take place at the Shanghai Art Museum. \n\n\nThe National Gallery of Scotland (NGM) in Edinburgh has launched a new digital platform that will allow the public to explore the collections and exhibitions of the institution. Called the National Trends Map, the platform will draw from the NGM’s existing collection and present users with a map of all of the items in the National Gallery’s holdings. The online experience, which will be free to users, will feature interactive works by internationally known and under-recognized artists, a selection of works by contemporary artists, and other visual", "The next Biennial should be held in 2020.\n\n\nThe Fondazione Pexica in Milan has announced that it is expanding its work with the Agusta Institute in collaboration with the Fondazione Prada, which has been working with the institute to address the museum’s ongoing renovation and expansion projects throughout the last two years. Currently, the museum’s second level—comprising the Fondazione Prada, the Feltrinelli Bocconi, the Feltrinelli Stampa, and the Feltrinelli di Rivoli—is undergoing a $185 million expansion led by architect Daniel H. Weiss, while the main building, which is currently being renovated, is undergoing a $150 million facelift. The project is expected to be completed by 2021.During its renovation phase, the Fondazione Prada will create new spaces for the museum, which will be reconfigured into a residence for the institute’s staff, an exhibition space, an education center, and a research library. The new building will also include a museum-glass building, which will serve as a window to the Fondazione Prada’s adjacent courtyard, and will offer more flexible spaces for exhibitions and", "The next Biennial should take place in 2020 and will be hosted by the Art Institute of Chicago at the Museum of Chicago. Artist-in-Residence-designate Elizabeth Renwick will replace Ann Sharpe, who stepped down from the position in February 2019. Renwick will be charged with developing and executing a new project. \n\n\nPhoenix Art Museum has appointed Barbara Procter as its next director. She will be supported by the Architecture and Design Research Council, and will assume her post in January 2021. Procter comes to the institution from the American Institute of Graphic Arts, where she was chief of design research. Previously, she served as a Howard Hughes Foundation design and innovation fellow and worked as an architect and urban designer for the Atlanta-based nonprofit organization Better Living Through Design (BLUFOR). Procter succeeds Christopher Price, who retired in June 2019 after eighteen years at the helm of the museum after informing staff in March. The museum plans to open a new eighteen, 400, and 500-seat wing of the museum next month.  A leading designer and urban theorist, Procter has received numerous awards and honors since she was hired. She was nominated for a MacArthur Foundation Fellowship in", "The next Biennial should be held at least once a year, but some believe that the number should be doubled. This would be a great opportunity for the Museum of Fine Arts Boston to showcase the extensive collection of the Museum of Modern Art; the collection of the Louvre, the Musée d’Orsay, and the Musée d’Orsay-Hailé; and the works of Helen Frankenthaler.The theme of the 2020 event is “What is Life?” The exhibit will incorporate the work of twenty-three artists and will explore issues such as mortality, the sacred and the material, and the source of meaning in art. The work of the year 2020 will be selected by a jury comprising art historian, curator, and arts administrator Helen L. Bove; art historian, curator, and arts administrator Joe Burns; and artist, curator, and writer Alexander Calder.The 2019 exhibition was organized by the Center for Contemporary Art (C.A.C.) in collaboration with the Minneapolis–St. Paul Metropolitan Museum of Art, the museum’s collection, and the local community. The exhibition was led by David Koyfman, curator of modern and contemporary art and the C.A.C. Center for", "The next Biennial should be held at the Moscone Center, Chicago, from April 22 to April 25, 2020. During this two-week period, active sculptures and installations will be showcased, and biennial attendees will have the opportunity to present a work. The first Biennial exhibition, “Ravenous Shadows” (2019), featured works by Rene Magritte, Felicity Hammond, Takeda, and Hadley Wickham and will open at the New Museum on April 13. The second exhibition, “The Great Divergence” (2019), features works by Antony Ghebaly and Sherwood Boehmer.   The partnership between the OMA and Smithsonian American Art Museum (SAAM) is a continuation of the work of American and Israeli artists, including Israel Gal, Dadi Ghebaly, and Rana Foro. Gal and Foro are the creators of the installation series “Beyond the Veil,” which addresses themes of memory, mystery, and spiritual practices, and involve the themes of the afterlife and the afterlife, respectively. The series is part of their forthcoming “The Unfinished Work,” which is currently on display in the museum’s “Art and Architecture", "The next Biennial should take place in 2022, with a budget of $120 million. The 2020 edition featured a select group of artists, most notably Nyima Bonti and Hernán Díaz, who were excluded from this year’s event, but made for attractive exhibitions. The 2018 event, which also included a show by artist and scholar Isamu Noguchi, was canceled owing to the Covid-19 pandemic.\n\n\nThe Museum of Contemporary Art (MoCA) in San Francisco will soon unveil a new public art project, an ambitious ten-mile mural completed in 2017 that will roll out across six city blocks in the city’s Mission District. Titled Tower of God, the work, which is a reimagined version of the Ten Commandments, will showcase works by twelve artists. The work, which was inspired by the Jewish spiritual system and Israel’s founding city of Jerusalem, will be completed sometime between the years of 2020 and 2021. The installation will be accompanied by a movie created by artist Rirkrit Tiravanija, which will include scenes from the film L.A. Confidential, about a man who builds a sacred metaphorical tower in his backyard in order to", "The next Biennial should be held in 2021.Professor Günther Wechsler, director of Berlin’s FISS, has said that the exhibition “will be an historic day in history.” In 2017, the museum was awarded a $150,000 grant from the Wellcome Collection, which was established in 1984 to produce a new work by the artist. It is the first time the work, Unseen, has been exhibited at the museum. The exhibition will be followed by the twenty-ninth edition of the Kölnischer Kunsthalle; one hundredth anniversary celebrations of the opening of the Südwestfalle; and a special exhibition of works by the artist Sergei Gromov, which will be completed in 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that Kiki Smith has been named its next director. Smith comes to the institution from the Museum of Contemporary Art, Los Angeles (MCA LA), where she has served as director for the past six years. Prior to joining MCA LA, Smith was president of the Los Angeles County Museum of Art (LACMA), from 2013 to 2015, and was a founding member of the Los Angeles Cultural Arts Council", "The next Biennial should not be a 60-day event, but a continuous project of the whole community.”The Biennial is planning a major revamp to make it more accessible to the public. It will also invest in digital and social media, improve the exhibition’s accessibility, and increase the number of participating artists. The 2020 edition of the fair will take place at the Centre Pompidou in Paris from March 17 to March 20. The 2020 edition of the Art Basel Hong Kong fair will also take place in Hong Kong from March 17 to March 20. The 2020 edition of the Art Dubai will take place in the United Arab Emirates from March 17 to March 19. The 2020 edition of the Art Dubai Art Fair, the Art Dubai Art Festival, and the Art Dubai Film Festival will be held simultaneously in Dubai and in the United Arab Emirates. “The 2020 edition of the Art Dubai event is part of a new initiative to engage with both the local and international art community,” said Martin Westphal, Executive Director of the Art Dubai Foundation. “As a platform for local and international art, the fair will showcase the latest in art, design, and design-related activities. This will", "The next Biennial should focus on a theme inspired by the work of the artist, with the theme 'This is not a picture, this is a message.'” The Gallery will also have a new online exhibition program and will host a series of public lectures, a biennial retrospective of the artist’s work, and a public event. The Biennial will be organized in partnership with the artists of the same name and will be held at the Gallery’s new home in the city of Waterloo.The institution has also announced that it will launch a crowdfunding campaign for the biennial, which will aim to raise $7 million in five years. The initiative will launch with a $500,000 grant from the artist’s foundation and will expand over time as more artists are selected for the inaugural edition.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York is planning to break ground next week on a $300 million revamp of its art-historical headquarters at 60 East Twenty-Third Street. Architectural designer Kristin Addams and curatorial researcher John DeGroot will spearhead the project, which will improve conditions for the museum’s collection, preserve some of the museum’s most important works,", "The next Biennial should begin in March and conclude in August. That would be ideal: June, the peak of the season. As I wrote in my March/April/June issue: At this time of year it is ideal for art to return to its natural habitat, with as much activity and creativity as possible. The exhibition would be a unique combination of an encyclopedic collection assembled by an internationally acclaimed curator, exhibiting the work of an emerging and established artist, and drawing from a single collection. We believe that this is the ideal time for Art Basel Hong Kong to resume its exciting programming schedule and I am confident that, together with you, this exhibition will continue to be an inspiring and challenging journey.\n\nThe twentieth edition of Art Basel Hong Kong, which is scheduled to run from March 5–March 8, 2020, has released the full itinerary of the event, which will be held at the Hong Kong Convention and Exhibition Centre (HKCC) from March 7–March 10, 2020. The event will also feature a number of exhibitions focusing on techniques and materials, including the first retrospective in the city of Shanghai, which will be organized by the ART Museum Beijing, in 2020, and an exhibition devoted to", "The next Biennial should focus on how the arts can be a tool to address and promote social and environmental concerns such as climate change and poverty.”The 2020 edition of the exhibition will be held at the Art Museum of Chicago until November 21, 2020.\n\n\nThe British Museum in London announced today that Anne-Marie Russell will become the first director of the institution in more than three decades. Russell will be the sixth director to lead the museum since its founding by Sir David Attenborough in 1967.“The appointment marks an exciting chapter in the museum’s history,” said Anne-Marie. “I’m sure that Anne-Marie is destined to become the next director of Tate Britain, and have an impact on the trajectory of Tate’s life and mission. I’m very much looking forward to working with her and learning from her perspective as she develops and polises the next edition of Tate Britain.”According to the Art Newspaper, Russell is responsible for the museum’s current exhibition “Just a Little Life: The Life and Death of Norman Rockwell” (2019–20), which is currently on view until November 25, and has also overseen the institution’s", "The next Biennial should be held in the autumn. Its theme will be “Art and Nature: From Nature to Life” and will take place in the city of Antwerp, Belgium, the Belgian province of Flanders, and the city of Antwerp-Brussels. “The Biennial is a living organism,” said Stefan Wolk, the director of the König-Bauhaus Antwerp. “The commission was not established only for the purpose of exhibiting the works of the day, but also to form a dialog with the past. What is most important is the right to reproduce new works in the future. This is a date of life for art.”The show will feature contemporary works by twenty-five artists, including Benno Pezzoni, Nadiya Bulmun, Rirkrit Tiravanija, and Kjetil Hintze, and will feature new works by artists such as Peter Abel, Joël & Edythe, Simon Löf, and Lucas Satter.\n\n\nThe New York City board of health has approved the first major overhaul of the city’s municipal health plans in more than a decade. The plan—which aims to reduce", "The next Biennial should be in March 2020.\n\n\nThe Mexico City Art Week (Mexico City Art Week) has announced that the event will now take place from March 23 to March 27, 2020. The 2019 edition, titled Artas de Mexico, featured work by thirty-six artists, including Malagas, Yanez, and Aurel/Hirshhorn. The event will now be hosted by the Museo de Arte Contemporáneo (MAS), which is located near the Museo de Arte de Mexico (MA), in the capital of Mexico City.The theme of the event is “Sensuality” and how people interact with art and space in Mexico City. The event will focus on issues of family, community, and work through the exhibition “The Body of Art,” a collaboration between Hirshhorn, Malagas, and Erik Deplen and will take place at MAS’s new headquarters, the Grand Theater, in downtown Mexico City from March 25 to March 29, 2020.“We are thrilled to be hosting ART’s 2019 edition at MAS,” said Sara Cwynar, the chair of the 2019 edition and president of", "The next Biennial should take place in the autumn of 2020. The theme of the event will be “The Other Mind,” a direct response to the mass destruction in Syria by the regime of Bashar al-Assad in 2017.\n\n\nAndrea Giunta, who served as artistic director at the Museum of Contemporary Art (MoCA), Houston, from 1996 to 2001, has been appointed director of the Smithsonian’s National Museum of African Art, which opened on January 18, 2002.Giunta will take up his new post on January 21. He succeeds Carol Johnson, who was elevated to director of the Smithsonian’s National Museum of African Art in Washington, DC, after she was named interim curator of African art.“I’m very excited to take on this new role at the MoCA and to oversee the institution’s rich collection of American art,” Giunta said in a statement. “I’m eager to see the work of the new curator and to continue to nurture the institution’s collection, and I’m eager to collaborate with the museum’s talented staff and the enormous, passionate collection.”Giunta previously served as director of the Mary Poppins Museum", "The next Biennial should take place in 2022, and the first exhibition should be up in 2023. As the largest urban museum in the world, Tate is currently experiencing a major expansion, and the institution’s first London-based exhibition, “The Body and the Planet,” will open at Tate Modern in 2021. Earlier today, the museum revealed that its current exhibition, “The Persistence of Form,” will return to Tate, and that the institution will present its first new exhibition, “The Future of Art,” at the Tate in 2020.“This is a historic year,” said Joseph Iwan, director of Tate Britain. “It is a time of great challenge, of radical change, and of an unprecedented range of ideas and perspectives. The new exhibition series The Future of Art will bring together the best of the contemporary and the historic to reveal how art can be more responsive to the changing world, how art can transform the way we live, and how art can change the world for the better.”The current exhibition “The Persistence of Form,” opened at Tate Modern on February 21, 2019. Titled “When Man Becomes Nature,” the", "The next Biennial should kick off in March. Its theme, “New Territories,” will be a summary of the first twenty-five years of the exhibition and will be comprised of a selection of contemporary artworks and installations. The program will be curated by Andrea Dwork, director of the Ponti rock-n-roll hall, and Juryaya Ali, cofounder of the contemporary art studio Hayek Projects and the British Indian art collective Guru Gobind.“I’m excited that we can start this year’s Biennial with a narrative that explores the earliest works of Spanish modernity,” said Dave Hartigan, director of the British Indian art museum and the British Indian art collective Guru Gobind.\n\n\n“The last two years have been transformative for me and for the work of my gallery. I have experienced the power of collaboration and the freedom to experiment, and the impact of new ideas. I am grateful for the opportunity to collaborate with people from across the globe and to present this work to the public.” The first solo exhibition organized by the Korean artist was organized by Mr. Seo-kyung of Studio 71, who won the Prix du Luxembourg in Paris last", "The next Biennial should be held in Rio de Janeiro, Brazil, in 2022.  “Themes of conflict and collaboration are central to the project in the form of the exhibition ‘Community of Collaborators’ in Rio,” Guadalupe Rodríguez, Biennale director of the Arts and Culture Ministry, said. The institution will also hold the first public exhibition of work by Brazilian artists in the country in 2019.The exhibition is part of the government’s effort to promote Brazilian artists abroad through the reopening of over seventy key cultural institutions and the opening of new initiatives, including the exhibition “Alfonso Alves: During the Year of the Pig.”  The work of Brazil’s thirty-seven international artists is displayed in the gallery as part of the Biennale’s “Alfonso Alves: Rede République” program, which is organized in collaboration with the Brazilian government. The gallery will present the first group show of the artists’ work in the country in 2020. \n\n\nThe Palo Alto Museum of Art (Palo Alto) has appointed Mary Ellen Mariotti as its next director. She will be responsible for the care", "The next Biennial should be held in Spring 2021. The institution has been working to organize a programming that would showcase new works of art created by and for underrepresented groups and has received $3.75 million from the Getty Trust to help secure the artworks. The museum has also been working to secure new works by artists whose practices are excluded from its collections and has received a total of $11.75 million from the trust to date.The Getty Trust artworks program is a collaborative, global initiative that was founded in 1965 to further the vision of the Getty Trust’s founding patron Alice Sebag Montefiori and her husband, Harry, to create new works by and for underrepresented groups. The program has curated more than 1,300 exhibitions since its inception and has produced over $6 billion in revenue for the trust. “We have been very close to the Getty Trust for many years,” said Harry. “It is an amazing legacy to have created the artists who have made the Biennial program such a success, and it is the legacy that needs to continue. We are all very proud of what we have achieved and what we are achieving together with our partners. We are anxious to continue to present the stories and", "The next Biennial should focus on the history of photography in Japan. It is also planning to publicly invest more than $100 million in modern and contemporary photography, including new exhibitions and research initiatives. The museum will also work with the National Museum of Fine Arts, Tokyo, and the National Museum of Art, Kyoto, to clarify the association between architecture and photography. \n\n\nThe Museum of Fine Arts (MFA) in Boston has received a gift of more than one hundred works of Italian modern art from a collection of the architect Paolo Nava. The gift includes a monumental work by the Italian-born Nava, a four-hundred-work set in a contemporary setting, as well as three dozen works by Italian postwar painters, including Stefano Catellani (1908–1986), Giacomo Catellani (1909–1986) and Francesco Catellani (1910–1986), and a collection of works by Cy Twombly, John Smith, and many others.“The collection is an enormous achievement,” said museum director Stephan Schechter. “It includes twenty-six works by artists who are widely represented in the United States, including Alessandro Catellani (1905–1975", "The next Biennial should commence in 2021 and will include the exhibition of works by artists whose practice ranges from the intimate to the experimental. The inaugural exhibition, “The Art of Non-Violence,” will be held at the Australian National Gallery in Canberra. The exhibition will introduce various themes, including “genealogies,” “settlement,” and “subversive rhetoric.” The theme of the upcoming exhibition will be “love.” The exhibition will also commemorate the twentieth anniversary of the first show held in Australia, “The Art of Love,” which is scheduled to open in the United States next month.\n\n\nThe Thailand Biennale announced today that it is resuming programming in a few weeks, March 17 to March 19, 2020. Titled “The Heart of the Story,” the 2020 edition of the biennial will include three new talks: “We Are Thirteen,” a forty-minute talk with artist and theorist Iñigo Urwin; “Abandon All Hope,” a twenty-minute talk with artist and scholar Chinawat Soe; and “The Body and the Soul,�", "The next Biennial should take place in the Fall, when the exhibition will be staged in the museum’s annex in the old Gaiety Theater and will feature a selection of new work by Los Angeles–based artists.\n\n\nThe Museum of Modern Art (MoMA) in New York announced today that it will remove over five hundred works by seventy-three artists from its collection in the wake of the Covid-19 pandemic. The museum’s current exhibition “Messages of the Black Lives Matter” was moved to an alternate space at the institution in March 2019 following a public outcry over the exhibition’s inclusion of a “comfort woman” display that depicted the sexual abuse of Korean women by Japanese soldiers during World War II.“This exhibition, and many pieces from it, were initially blocking MoMA’s path to reconciliation with the human rights abuses of the past,” museum director James Cuno said in a statement. “We hope that this exhibition will serve as a reminder of the many acts of kindness and courage exhibited by MoMA artists in the years following World War II.”The museum has since been working with eminent experts to identify twelve works which deserve further exploration and conservation. The experts", "The next Biennial should be held in 2021.\n\n\nThe Museum of Modern Art (MoMA) in New York has unveiled a set of guidelines for how it will handle the reopening of the Photoshop Museum in the fall, following a $500 million expansion and renovation completed in 2017.Among the changes made since the museum’s debut in the spring of 2020 are the addition of an open-air sculpture garden, a theater, a children’s museum, and a public courtyard. The renovation, which also involved the construction of a new, larger building, also involved the renovation of the museum’s courtyard.The institution’s staff and volunteers have been invited back into the museum for the fall season, but additional security arrangements have yet to be made. MoMA has also announced that it will open as planned for the first time in September. The reopening, which will mark the opening of a new exhibition, “Photography on Paper” and will also involve the refurbishment of the museum, will take place in phases. “It will be a momentous year as we celebrate fifty years of the Museum of Modern Art, and to reenter the world of photography for the first time in fifty years,�", "The next Biennial should take place at the Museum of the Moving Image in New York, the Brooklyn Museum, the Stedelijk Museum, the Metropolitan Museum of Art, the Museum of Modern Art, and the Museum of Modern Art. Inaugurating the museum are two exhibitions,   2018: Towards an Ecology of Exports, and “The Future of Art: The Pankhurst Diaries,” which will present the first presentation of the Pankhurst monograph, Museum of London, in 2020. Museum director Michael Rosenheim said: “The Pankhurst Diaries examine how art can be an antidote to the threats posed by climate change and how art can be a tool of the conservation movement.”\n\n\nThe American Civil Liberties Union (ACLU) in Virginia has filed a lawsuit against the state over the arrest of a man at a Donald Trump rally on Saturday, March 12, for allegedly walking through a crowd in Black Rock, Virginia, and trying to scale a security barrier in an attempt to get to the candidate.According to the New York Times, the man, who was detained for ten minutes and forty-six seconds after he allegedly tried to cling to a metal security pole and attempt to", "The next Biennial should begin as scheduled in March 2019. “This is not an easy decision, but it is the only one that is within our power,” said director Christopher LeBlanc. “I thank our staff and the entire staff of the museum for their witness to the extraordinary life and work of Jean-Paul Sartre. Given the challenges that we were all confronted with, I look forward to continuing the work of Montréal art and artists.”Laurence and Guy Lafont-Thenlé, president and directors of the Centre Pompidou in Paris, said: “The development of a critical appreciation of the biennial as a whole needs a visionary new perspective. . . . It is essential to reconceive the art of Montreal’s past and present through a critical and visionary perspective.”The Centre Pompidou, a former multimedia arts complex in the city of Pau, is currently working on a new plan that will introduce contemporary art and design in a contemporary setting. The project is currently in the design phase, and the Centre Pompidou currently has no plans to build a second location for the collection.\n\n\nThe Pulitzer Prize–winning artist Roxane Gay, whose sculptural", "The next Biennial should be held in the Spring of 2021 and will be organized at the new museum, which will be renovated by the Danish architectural firm G-Point, in cooperation with the city of Copenhagen.\n\n\nThe Museum of Modern Art (MoMA) in New York has been ordered to pay more than $7 million to the families of four victims of the 1979 Covid-19 outbreak in the United States, including the father of a woman who died from the disease. The suits were brought by the mother of a man who was infected and who died from the disease in 1984.According to the New York Times, the relatives of Joseph and Jeanette Michael were awarded $4.2 million after a New York appeals court awarded them $2.8 million each for wrongful death claims stemming from their sons’ death. The plaintiffs argued that the institution failed to warn the family members about the risk of contracting the novel coronavirus—inadvertently releasing antivirals containing the drug thalidomide, an antipsychotic and the only effective treatment for schizophrenia—which causes severe respiratory infections and death in up to 90 percent of patients.MoMA argues that it paid the families for approximately eight months between October 1 and October 13, 2019, and"]