["The next Biennial should be announced in May 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that the museum will reopen to the public in March 2021 following a $4 million facelift and renovation. The overhaul of the museum will include the installation of new works by twenty-seven artists, including Anish Kapoor, Jack Hoffman, and Renata Cervetto, as well as the restoration of two historic galleries, the Art Gallery of California’s original location, which was demolished in 1993, and the Art Institute of Chicago’s former site, which is currently being restored by John Akomfrah.“After a thorough search of the contemporary arts community, we are thrilled to be able to reopen the powerful and intellectually stimulating galleries at the Museum of Contemporary Art in Los Angeles with full exhibition programming in March 2021,” said Marc Glimcher, chair of the board of trustees. “It is our goal to create an environment in which the collection, exhibitions, and education of contemporary art is as exciting and dynamic as it has been for twenty-seven years. With this year’s theme ‘New Worlds: Reinventing the 21st Century” and the museum’", "The next Biennial should be held in 2021.\n\n\nIcelandic artist, designer, and educator Hjalti Jonsdottir, a native Reykjavik native who studied in the United States, will be the next indigenous director of the Museum of Modern Art (MoMA) in New York. Jonsdottir, who is currently an adjunct professor at the University of Iceland, has been nominated for the position by director Adam D. Weinberg.Born in Reykjavik in 1970, Jonsdottir first met MoMA director David Kordansky through his art teacher, Elizabeth Anderson, whom he met in 1990. Kordansky, who passed away in 2001, had recently relocated to New York and invited Jonsdottir to join him in the city. Upon arriving in 2000, the artist immediately began his career as a designer and educator. In 2009, the Museum of Modern Art commissioned him to make a tribute to Marian Gabor, a contemporary artist whose work combines concrete abstraction with the world of everyday life. In that work, he sculpted the figure of a mannequin, which recreated the legendary sculpture by the Icelandic artist Sigfus Saga in an ice rink. The project won an International", "The next Biennial should also feature two exhibitions of work by contemporary artists. In the first, titled “Madrid, 1937–1948,” the artists will present the works of three of their compositions: Aristóbal Viñoly’s “Spiral Arrow,” 1973, for which the artist made his name by combining seemingly unrelated materials; and Barozzi and Giuffrida’s “Spiral Dove,” 1992, which was a collage of photographs by María Berrío.The second exhibition, titled “Pangaea,” will be hosted by the Museum of Modern Art, New York. In the text “Pangaea: The African Diaspora,” the artists will present works that are “from the ground up, from the artists themselves, the artists in their lifetimes,”, in addition to a selection of works that are “from the African Diaspora in Europe” and will feature works from four African diaspora artists: Abuja, Cape Town, Nairobi, and Guggenheim.In addition to presenting the work of the African artists, the Biennial", "The next Biennial should be held in the year 2020. “This is an opportunity to renew our collective vision of society,” said Luchs. “It will also be an opportunity to make the most of the biennial’s vast collection, which has so many important contemporary works. We will be able to present the most relevant work on the most contemporary art at the most contemporary facility in the city.”The biennial will be a joint initiative between the Arts and Innovation, the City of Honolulu, and the Honolulu Institute of Art (HIIA). The $10 million biennial will be organized around the themes “Future Possibilities” and “Art, Technology, and Society.” The $8 million biennial will be organized around the themes “Art, Technology, and Society.” The $7 million biennial will be a joint project of the Arts and the Museum of Contemporary Art, Los Angeles (LACMA), and the Museum of Contemporary Art, New York (MCA). The biennial will showcase the work of seventy artists from twenty-six countries, including China, Egypt, France, Italy, Norway, Portugal, Spain, Tanzania, and the United Kingdom.The biennial’", "The next Biennial should take place in 2021.\n\n\nThe Art Newspaper has announced the winners of its first two editions, which were held in Hong Kong and Shanghai, respectively. In the grand prize, which was established in 2007 in honor of three Hong Kong–based artists, Liu Xiaochuan, Hannah Cheng, and Chia-Chien Lee—who were chosen by a jury comprising art historians, art dealers, and art researchers—was awarded £50,000; Liu Xiaochuan won the award in 2014. The second edition, which was organized by the Beijing-based organization Artforum, was awarded $50,000.For the award ceremony hosted at Dragon Valley in Beijing, the Chinese state’s cultural minister, Wu An, said that the three winners could not have been more different in temperament and their visions for the future: Liu Xiaochuan, a Shanghai-born Hong Kong artist, is a passionate organizer and curators, while Chia-Chien Lee is a prolific painter whose work is often linked to Beijing’s military and the Communist Party.Lee, who lives and works in Hong Kong, said that the grand prize is a “kind of new beginning.” “I am thinking about the future,", "The next Biennial should be held in 2020. “To be specific, I am looking for a new platform that is both ambitious and responsive to our core values,” Biennale director Christian Schert said in a statement. “It will be a great way for us to return to our roots and to further develop our programming in the spirit of the past.”\n\n\nWe are now seeing a new wave of protests against police violence—and against white supremacy. Organizers of the March for Black Lives in Washington, DC, announced on Monday that they are pushing back against President Donald Trump’s plan to withdraw from the Paris Climate Accord—a move that will see the United States lose up to a third of its global warming pollution-mitigating carbon-based economy—by reopening the economy and reopening factories and manufacturing operations.Organizers of the Washington, DC, demonstration, which was organized by the progressive group DC Least Concern, said that they are planning to hold additional protests at other locations throughout the capital region, including at the White House and in cities across the United States. They say that Trump’s decision is forcing them to confront the 'Trump Doctrine—that we must refocus not only on climate but", "The next Biennial should take place in 2021, with the exhibition taking place at the newly renovated Museum of Contemporary Art in San Francisco. The mission of this exhibition is to present a new work by a group of artists. The group is called TWENTY-TWO, and they will present work by a group of artists including William Anglade, B. Ottaviani, Francis Parker, and Tunga, the first about a pair of skulls, and the latter a pair of anuses. The exhibition will also include a virtual reality installation of a scene from the film The Matrix, where Neo (Aldo and Neo) is a synthetic virtual-reality character who has the ability to perform tricks and acts. The exhibition will feature new works by the same group that created the work for the first Biennial, and will be held in conjunction with the 25th anniversary of the institution.\n\nThe National Geographic Society’s plan to move its headquarters to a new location in the capital city of Mexico City has been put on hold after a judge ruled that the move would violate the country’s labor laws, Radio Azteca reports.Gonzalo Gobena, a district attorney of the northern state of Oaxaca", "The next Biennial should be released in 2021, a year after the seventy-fifth edition of the Biennial Dubai. Titled 'The Fursuit People,” the twenty-fifth edition of the exhibition will take place in 2022. The event will run from October 10 to November 29.\n\n\nThe Chilean artist, researcher, writer, and educator Hélio Otero, whose work embodies a multidisciplinary approach that draws from sculpture, performance, video, landscape, and rural life, has died. He was seventy-eight years old.Born in Santa Fe, Chile, in 1936, Otero moved to Argentina in the 1950s and Chile in the 1960s. His works are often associated with his signature “Primitive” style, a direct response to the country’s traditional Marxist-Leninist party. Otero’s sculptures frequently explore the relationship between sculpture and politics, society, and the environment and are often linked to political and cultural figures and movements, including Francisco Franco, Salvador Allende, and Hugo Chavez. He also popularized the term “campo” (Latin for ‘campfire’), a political-social practice that emphasizes the role of art in shaping social and political", "The next Biennial should be held at least once every two years for a period of eleven years, beginning in 2020. The capital of the new institution will be an open-air, sculpture-filled building located in the city of Biennale Stedelijk Amsterdam. The development, which is co-owned by the Eindhoven University of Technology, invited the local community and cultural groupings to participate in the exhibition.The exhibition will feature work by forty-four artists, including Jørgen Klint, Lars Von Trier, Frank Gehry, Paul Gauguin, and Gauguin’s descendants, Pieter, Fabienne, and Piet van den Bosch. The biennial will also include a selection of works from local and international artists including Susanne Ghebhan, Nes Jansen, and Christine Stammel. The first works presented in the exhibition will be Škina Niedzvai’s “Unfinished Business.” The exhibition was inspired by the work of Hungarian artist György Perk and was staged at the gallery in Holst, Amsterdam, in 2017.\n\n\nThe Museum of Modern Art (MoMA) in New York has announced that it is working", "The next Biennial should be held on a larger scale in 2021. The Biennial will be hosted by the Museum of Contemporary Art, Los Angeles and will be led by artists and organizations that have received funding from the William K. Galeras Foundation, including the Cora Galeras Foundation, the Galeras Foundation for New Latino Communities, and the Galeras Foundation for Hispanic Art.While the new partnership between the two organizations marks the first time that the two institutions are collaborating to promote the same work, the artists and organizations involved in the project hope that the partnership will serve as a model for how American museums can work together to promote the arts.“The exhibition will provide an opportunity to reflect on the richness of American art through the lives and works of two of the greatest living artists,” said Mark Beasley, president of the William K. Galeras Foundation. “We are eager to work with the Museum of Contemporary Art Los Angeles and the Museum of Contemporary Art Los Angeles’s vast collection to present contemporary works by the late Lillian Coronan, Laurence Breslin, William Goldman, and Lemony Snicket to highlight the vision of the Galeras Foundation and its mission to promote the art of diversity and", "The next Biennial should be held at the venue within six months, and the next should be held in two years. The 2019 edition will be held at the Palazzo Galleria Birgitta. The total budget for the exhibition has yet to be determined. The exhibition will be organized as follows: Artistic Director Andrea Latella; Artistic Director Pierluigi Battista; Director of Curatorial Affairs, Tracey Rowland; Director of Visual Arts, Lora Grazie; Director of Public Relations, Emilie Ault; and Director of Media Relations, Prada. Some 150 artists, including Lars‐Weir, Ana Mendieta, Stephen Friedman, Hayao Miyamoto, Marianne Melk, Robert Irwin, and Robert Sich, will receive the prize this year. The ten winners will be announced in December. “We are very pleased that this marks the end of the tenth edition of the Venice Biennale,” said Pierluigi Battista. “The results, together with the exhibition’s remit in the public sphere, make it a real champion for culture and artists.”\n\n\nThe Hirshhorn Museum and Sculpture", "The next Biennial should also consider how the biennial can build on the legacy of the late American photographer Robert Irwin. Smithsonian will present a retrospective of the exhibition “Black Family,” which is currently on view through February 22. The exhibition is curated by Paul Graham and Craig Breslin, and is curated by Jim Sweeny, curator of the official exhibition of the Smithsonian American Art Museum.The exhibition will examine the history of a family whose practice spans generations, from the creator of the term family, Hermann Moholy-Nagy, to Charles Ucoff, the first American to win the Berlin Gropius Prize. The exhibition will include the work of 120 artists from sixty-five countries, which will explore family traditions and institutions in the United States, the United Kingdom, and Europe.\n\n\nThe British Museum (BMI) announced today that it is launching a new lifelong learning initiative, “Lifelong Learning: Revisiting the British Museum,” which will invite visitors to the institution to re-visit the institution’s collection, craft, and exhibitions. The program will involve interviews with scholars, artists, designers, curators, and former employees of the British Museum, and will produce a new exhibition every year", "The next Biennial should be held in 2020, and the next one in 2022, with a view to the 2019 biennial being staged in Barcelona and the 2022 edition being staged in São Paulo.The city of Barcelona has also announced that it is planning to expand the city’s Art Nouveau, a classical, pre-modernist, neo-classical-modernist cultural space, by building a new museum, the Art, in the city center. The new museum will be completed by 2025 and will act as a major gathering place for the city’s art. It will feature exhibition spaces for contemporary art exhibitions and a 10,000-seat theater. The city is also working on a plan to develop a new cultural center for people with disabilities and is launching an initiative to showcase works by contemporary artists.The city’s Cultural Foundation also plans to spend $1.5 million improving public transportation and expanding accessibility in order to facilitate more people’s access to the Biennial.“Myanmar is facing many challenges in the developing world, but we have been able to support the cultural sector through assistance and support,” said Nouadhib Bouma, president of the World Culture Foundation. “The new investments announced", "The next Biennial should kick off on September 17 and run until October 5. The art-world festival will also welcome visitors from twenty-two countries. The theme of the two-week event will be “the relationship between art and technology.” The event will feature forty-four works and will also include the first-ever exhibition of work by artists from the Lower East Side of Manhattan.\n\n\nThe Dayton Art Museum has received a gift of fifty-nine works by fifteen artists from the collection of the late J. Paul Getty. The gift includes works by forty-four of the artists who were institutionalized during the institution’s forty-year tenure as a museum. The artists were Alan Bing, Robert Irwin, Berenice Abbott, Emily Brontë, Frank Gehry, Dwight Yoakum, and Andy Warhol.“The collection is a remarkable assemblage of works that have not previously been touched by a museum in their entirety,” said museum director Tanya Bresch, who added that the museum is currently working on the development of a new program that will examine the history of the works through the lens of a museum’s collection. The new program will be presented in November 2020.A number", "The next Biennial should take place in the spring of 2022.  \n\n\nThe Palazzo Grassi in Venice has announced that it will begin a phased transition to a renewable energy supply in the summer of 2022. The art-workshop, located at 1197 Palazzo Grassi, will convert 11,400 kWh of energy a day into energy-saving devices, including smart refrigerators, rain barrels, and energy bars, and will phase out coal-based power plants by the end of the year.“The new programme enhances social solidarity, sustainability, and climate justice,” said Yale Pyke, director of the Palazzo Grassi, and Stefano Fusi, the organizers of the upcoming edition. “It also features a new program of exhibitions, performances, workshops, presentations, and residencies, which will create a sense of community and community-building.”According to a report released by the Art Newspaper, by 2021, 75 percent of the electricity produced by power plants in Italy will need to be replaced. The report also reveals that by 2030, the Italian economy is projected to be three and a half times smaller than it is today. The report states that by 2060, the Italian economy will be", "The next Biennial should be held in 2021. The first iteration took place in 2003 and featured three hundred artists from ninety-nine countries. The second will be held in 2021 and will be held in the United Kingdom. The 2019 edition, titled Between the Sun and the Moon, was curated by Eleanor Lyne, and was staged at the Greenwich Village Art Gallery in the United States.\n\n\nThe Dover Art Museum (DAM) in Delaware has received a gift of more than one thousand photographs by eighteenth-century French photographer Jean-Jacques Da2rio\u0097an allegorical depiction of the Passion of Christ and a groundbreaking work that has recently been acquired by the institution. The work, titled Between the Sun and the Moon, was made in 1893 in the small town of Toulouse, in northern France, and includes works that have never before been displayed in the institution.The gift, which was made by a group of artists who met through the museum in 2008, includes [1]  [2] and [3] (both [1] and [2]) as well as an early work by the late artist Joseph and his wife, Agnes Martin. The gift also includes [1] [2] and [", "The next Biennial should explore new ways of combining art and technology to address climate change’s many challenges, such as water and food security, health and disease, and migration. \n\n\nThe British artist David Hockney, whose paintings and drawings combine abstract forms and intimate observations of light and space, died on Tuesday of heart failure, aged seventy-nine.Hockney, who lived in London for nearly thirty years, was born in Glasgow in 1940. His father was a mechanical engineer, and his mother a homemaker. As a boy, he worked in the oil and gas business in the UK before moving to Paris, where he began drawing and painting. He soon became fascinated by light and color, and his works have been exhibited at the First International Biennial of Arts in Rome, the Venice Biennale, and the New Museum in London.Hockney moved to New York in the 1960s and studied under Jospeh Reynolds in the city from the late 1970s until his death. He continued drawing, painting, and painting until his death. His work is in the collections of the American Academy of Arts in New York, the Baker Museum, the Brooklyn Museum, the Metropolitan Museum of Art, the Museum of Modern Art in New York", "The next Biennial should be held in the fall of 2020.\n\n\nVolta, the firm founded in 2008 by the Dutch architect and collector Bernd and Elizabeth van Doren in Amsterdam, has announced that it will move the show from the city’s central Botanical Gardens to the Museum Utrecht, where it will be located for the next twenty-five years. The museum will become a major cultural destination for the city and the region and will provide a new home for the exhibition “Passion” (2019).The exhibition will be dismantled and relocated to the Netherlands, where it will reemerge in 2020. The museum will also receive new institutional space and will continue to operate as a public space. The exhibition will reopen in 2021, at which point the museum will present a new “Passion” titled “Wangechi Mutu: I Am.”\n\n\nThe Museum of Contemporary Art (MoCA), San Francisco announced today that it is working with an artist-run nonprofit to preserve more than 350 works by contemporary artists from the former St. Louis institution. Called the Endangered Art Project, the project, which began as a way to raise awareness of the museum’s collection, was inspired", "The next Biennial should be released sometime in early 2019.\n\n\nThe Museum of Fine Arts (MFA) in Boston has elected Stacey Redtory to the role of director of its William H. Macy Sculpture Garden. Redtory will take up the post on January 6, 2020.“While at MFA, I was privileged to serve as the project manager and architect for the William H. Macy Sculpture Garden,” Redtory said in a statement. “This was a unique undertaking, combining original research and world-class design with a curated collection that was built to last. The culmination of years of work: a new collection, new exhibitions, and new programs. I am very proud to have helped MFA to achieve this milestone.”Redtory joined the museum in 2017 as the associate curator of Modern and Contemporary Art. She was promoted to assistant curator in 2018 and has served as director of the garden ever since. Redtory’s first solo exhibition, “The Sculpture of a Woman,” in 2011, was nominated for a Pulitzer. She has also served as a research scientist, has curated numerous exhibitions, and was a finalist for a Grand Prize in Design in", "The next Biennial should be held in the autumn of 2019. \n\n\nArt Basel is selling off its collection of forty-three works. According to the New York Times, the museum is trying to reduce the size of its collection by 15 percent in order to balance the books of its three major art dealers. The auction house announced the restructuring plans on December 30, and the works in question are paintings, drawings, and sculptures by forty-three artists, including Pierre-Auguste Renoir, Elia, Julia Ståhl, and Markus Langenbrun, as well as by Adam Merz, Marcin Kieś, and Saara Maas.Under the terms of the restructuring plan, the auction house is planning to reduce the size of its auction house by 15 percent and is eliminating its two-story space in downtown New York; is planning to open a new Barbican-based exhibition space in the old Guggenheim; and is reviewing the holdings of its division, Christie’s, to determine the future of its online sales.“This is a tough time for everyone at the auction house,” said auction house director and CEO Christa McAuliffe. “We have been restructuring to better meet changing market demands", "The next Biennial should be held in 2022.\n\n\nThe Florida Museum of Arts (FMA) in Port St. Lucie has announced that it plans to remove the T-shirts worn by activists in support of the Black Lives Matter (BLM) movement, one of the keystone causes of the 2016 protests against police violence nationwide.After a three-week public consultation, the museum voted unanimously in favor of removing the controversial hoodies, which were featured in the artist’s show “Black Panther” last year and were made by the collective #NotAllBlack. The museum’s director of public programs, Patrice Nunn, said that the museum is “disappointed.” The decision was made in light of the violence meted out by police against protesters in the United States following the unrest sparked by George Floyd’s death in Minneapolis in May.The museum’s board chair, Mark Devlin, said: “We acknowledge that this decision was not made lightly, and that it takes a heavy toll on our staff and the community. We are addressing this now with the permanent staff, members of the local community advisory council, and the Black Lives Matter community, and are committed to working with the community", "The next Biennial should consider “the role of contemporary art, publishing, and performance in regionally and/or nationally organized exhibitions,” the statement reads. The annual event, which was originally scheduled for March 28–March 31, will now be held in April. The new date coincides with the opening of the first edition of the new exhibition series “Pangaea and Beyond,” which will open on March 31. “With this move, we hope to contribute to the development of a positive and inclusive future for the exhibition and for the city of Rome,” said Italian Culture Minister Emma Bonetti. “This is an opportunity to connect with our city and the surrounding region, and to create a platform for the international exchange of art and culture. We are all pleased to continue our work together with the exhibition team, the city, the international community, and the public, and hope that this year’s event will be a success.”\n\n\nThe third annual Biennial of the British Modern Art (BMA) in London has awarded artist-philosopher Harald Szeemann the Royal Commendation for his contribution to the literature of art, literature and architecture. His book Art at War", "The next Biennial should be the fifteenth, the current exhibition will be the sixty-third. The current exhibition will be in the Gallery of Modern Art (GMA) in Paris as part of the Groupe de Constructif, and the next exhibition will be among the most important of its kind, perhaps the most important. The opening of the Contemporary Art Biennial in Zurich in May 2021 should be followed by the next year and a half of the exhibition series, and the next exhibition of the series should be held in May 2022. The organizers have also announced a new partnership with the Foundation for Contemporary Art (FCA) in New York. The partnership will provide the FCA with a new collection of works by twenty-six artists that will also be housed at the Museum of Modern Art, and will host a series of public events, including a gala dinner and a reopening of the museum on November 8. The timeline for the ten-year partnership is as follows: May 19, 2020: • Open at the Museum of Modern Art, which will reopen on May 29—a day that marks the one hundred and thirteenth anniversary of the birth of the artist Henri Lévy, and will be inaug", "The next Biennial should focus on the role of the graphic arts in fostering social justice, and the museum’s relationship with Indigenous communities, the LGBTQ community, and artists. (See the 2018 edition’s overview here.)The museum will create a new space for the exhibition “Aporrea” (Aporrea: Aporrea, 2018), a joint project with the Kiasma Foundation, to highlight the work of emerging Latinx artists, and will work with the New York–based art-world collective What Now to Take Action to combat police violence and the displacement of communities in the United States.\n\n\nThe Durham Art Museum (DAM) in North Carolina has postponed its inaugural season, which was originally set to kick off on October 26, 2019, and has extended the run by another two years to March 21, 2021. The institution announced the announcement on Wednesday, March 13, following a transcript that was provided by the advocacy organization Queer Cinema. Originally scheduled for March 8–March 10, 2020, the event was moved to March 21–March 28, 2020 due to Covid-19. The postponement was made after the museum received three new cases of the virus, which was notified on March 9", "The next Biennial should be titled “Becoming Human: Art and the Birth of Western Art” and will be held at the Museo de Cultura Mesoamericano in Santiago, Chile, in the fall of 2020. Its first edition will also feature an exhibition of works by some of the most important names in the twentieth century.“The most exciting and challenging aspects of the project are the interconnections between the narrative and the art and how this relates to our lives today and the future,” said José Manuel Matos, the president of the Biennial. “The story of my own life, the history of my art, and of the world in general speaks to the universality of the human condition and is a source of inspiration for me.”\n\n\nMuseum of Contemporary Art (MoCA) in London has appointed actor and director Amandla Stier as its next board chair. She succeeds Denise Meadows, who departed the institution last month to become the new director of the National Galleries of Scotland, and will take up the post in January 2021.“Amandla has been instrumental in shaping MoCA’s vision in the past and will continue to shape the future as we embark on our", "The next Biennial should take place in 2020. If the initiative is successful, events will be held in cities across Brazil and will feature a mix of contemporary and classical works, as well as works by indigenous and modern artists. \n\nIn the wake of the devastating earthquake and tsunami that struck Japan in 2011, the country’s cultural institutions have been forced to make cuts and the NHK television station has announced that it will no longer air the 2017 Tokyo Triennale. The move came after the NHK announced that it plans to take the event offline. The decision means that the NHK’s annual “Tokyo Tokyo Museum” will have to move to a new venue in a city that has a population of just over twenty million.The decision was made in order to “meet the needs of the museum, while maintaining the art of the NHK’s fairs—in other words, while remaining in Tokyo.” The museum will also be temporarily shuttered from March 19 to March 21, 2020, while the NHK and the NHK NHK Live! event in Tokyo will take over the next two years. “Although we are sad to see the museum close, we hope that it", "The next Biennial should be held in the autumn of 2021. From November 21 to October 26, there will be a series of performances, including theatrical productions of prose and poetry by artists such as David Salle, C. S. Gethin, G. E. M., and the Black Trinity, and a special exhibition entitled The Love of Life. The theme of the exhibition is “Love Is Not Enough: Why the World Needs a New Kind.”Commenting on the 2020 biennial, Symone Saro-Wiwa, director of the Carlsbrug Gallery in New York, said: “We are thrilled to be the first to present the new program of the Carlsbrug. It will be an ambitious exhibition that challenges the limits of how art can touch our lives and shape our world. We are grateful to the City of New York and the County of Santa Fe for providing the financing and for their strong support of such an ambitious project.”\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Adam Weinberg as its next executive director. Weinberg comes to the institution from the Metropolitan Museum of Art, where he has served as deputy director of education and public programs since 2014.", "The next Biennial should be held in the spring of 2022.”The exhibition will feature works by fifteen artists represented by the institution. Titled “We Live in a Distant Time: The Untold Story of the Biennial,” the exhibition will run concurrently with the biennial’s fifty-third edition, “Avant-Garde’s Birth of Modern Art.” \n\n\nThe Museum of Modern Art (MoMA) in New York has released the first group show of works by twenty-seven artists in the early stages of their careers. Titled “The American Dream: Artists in the American Dream,” the exhibition, which will run until December 20, 2019, opens with a series of drawings by Hubert and Jean-Michel Baselitz, and closes with a group exhibition of works by Aaron Buchwald, John Chaédria, and Yoko Ono, and will be followed by “We Are Not Wolves: Artists in Residential Spaces,” a show on global homelessness, and “The Transition,” a show on contemporary art and technology.In a statement, MoMA said: “The American Dream’s creators and the artists whose work", "The next Biennial should be held in 2020, and the event should include a selection of works by artists not represented in the current edition. Inaugurating the 20th Anniversary of the Exhibition, the Biennial will include a retrospective of work by the late artist Svetlana Reznikova, who died yesterday at the age of seventy-two.Svetlana Reznikova’s work is divided into three periods: the 1970s, when she was primarily known for her paintings; the 1980s, when she depicts abstract forms; and the ’80s, when she has her works displayed at the Venice Biennale. In an interview with the Japanese media outlet Asahi Shimbun in April 2019, the artist said: “I don’t know what will be coming next. I am thinking of the future in a collective way and feel as if I will never see another Biennial.”\n\n\nThe San Francisco Museum of Modern Art (SFMoMA)—which recently announced that it plans to open a new branch in London in 2021—is currently working to determine the location of a twenty-one-thousand-square-foot, artist-driven museum that will explore the concept of “intellig", "The next Biennial should take place in 2021, the same year as Art Basel Hong Kong. The exhibition will also include a large-scale reconstruction of the city in 2020, titled The Bather and the Basket, which will be hosted at the Palace of Fine Arts in Beijing for three years from 2019. The exhibition will also include artworks by artists such as Mark-Paul Makhlouf, Karima Bennani, and Patricia Laudel.The organization will inaugurate the Biennale in 2017, the same year it will reëstablish the Hong Kong pavilion in a remarkable show that will sweep in works by artists from Hong Kong, Japan, Korea, China, France, Italy, and the US.\n\n\nAt the close of the 2019 edition of the Venice Biennale, an exhibition organized as part of the sixty-ninth edition of the Grand Prix d'Hiver in the city of Siena, Italy, the artist-run platform zine-pub Go! published an open letter addressed to the organizers of the event, titled “Onwards!,” which was signed by more than 130 artists. The letter, which was titled after a phrase coined by the late Belgian designer Arne", "The next Biennial should take place in the spring of 2021. The biennial, which will explore the history of the exhibition, its exhibition space, and the installation, should be organized as a mix of narrative and installation. The biennial will consist of approximately seventy-five works, the first works of the exhibition. The work of the fair will have a direct impact on the city of Basel, which will be transformed by a new hotel and exhibition complex, the newly established Biennale Village, and the institution.The new venue, the Dubai Museum of Art, will be inaugurated in February 2020 and will feature thirteen works by contemporary artists. The museum is planning to build a new 320-room hotel, the Emirates Tower, in the city alongside the new exhibition space. The project is part of the $5.9-billion Ritz-Carlton Dubai Initiative, which is designed to create new economic opportunities for the United Arab Emirates. \n\n\nThe National Galleries of Scotland (NHSC) has appointed John McAllister as its new deputy director of exhibitions and curatorial affairs. He succeeds Sue Gow, who retired from the role in December 2019 after eighteen years. Named for her service as chair of the board of trustees of the National Museum", "The next Biennial should be held in the fall of 2020. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it will no longer participate in the annual Art Basel (AB) fair, which has come under intense scrutiny due to the coronavirus, and has instead incorporated a new online survey into its lineup. The new online survey will collect feedback from visitors on the current state of contemporary art, the exhibition program, and special projects, as well as provide visitors with a comprehensive overview of the collection.“We are delighted that the museum will now be able to tell the museum’s story online,” said Benjamin Harnwell, director of the institution. “We are also delighted to continue to present our amazing exhibition program, including our new online program, and to continue advancing the museum’s collection in a timely manner. We thank our sponsors, gallery owners, dealers, and the curators who have worked so hard to make this possible.”The museum’s first online exhibition, “Art of the Future,” will debut online at 2 PM on September 3 and will include works by a select group of artists whose exhibitions will run alongside the 2017 event, �", "The next Biennial should be held in 2022. The twenty-sixth will be held in 2023 and the twenty-ninth in 2027, and the seventeenth in 2028.The next exhibition will be held in the city of Milan in 2024 and will be curated by Dino Bandini, a director of the Museo d’Arte de São Paulo, and will be hosted by the Fondazione Andrea Catellani. The exhibition will be on display in the forthcoming exhibition “Wangechi Mutu:” of the New York–based artist-run space Munk Contemporary.\n\n\nThe Solomon R. Guggenheim Museum in New York has appointed Katerina J. Alexander as its next director. Alexander comes to the institution from the New York–based artist-run space the Yuz Museum, where she has served as the director of development and curator since 2016. “Katerina is a visionary, experienced leader who has led Yuz Museum through an amazing decade,” said Guggenheim trustee Mavis Edensberger. “Her passion and talent for exhibitions and programming, combined with her ability to inspire and engage with artists, patrons, and communities make her an ideal director", "The next Biennial should be staged at the Paris Opera House in June 2020. \n\n\nThe New York Ballet has appointed Stewart Brand as its next artistic director. Brand comes to the company from the New York Philharmonic, where he has served as artistic director since 2015. He succeeds David Hallberg, who was promoted to the role of artistic director last year and will step down after the 2020 cycle. Hallberg will remain involved in the company as a consultant for as long as the terms of his contract allow. Hallberg will take up the post in January 2021. \n\n\nThe Biennial of Light has announced that it is now accepting applications for a new collection of works by contemporary artists. Titled “Theater of Operations,” the exhibition will feature artworks that confront issues such as ‘human-centricity’ and the current global crisis. The 2019 iteration, titled “Theater of Events,” debuted at the Berlinale in February, and the exhibition was presented by the Riga-based organization the König-Stiftung (Kunstmuseum).Dubbed “Theater of Operations,” the exhibition was curated by Joachim Hetzler, who is based", "The next Biennial should be held in 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it is launching a $100,000 challenge grant program to help small arts and culture organizations prepare for the possibility of a major Covid-19 emergency. The program will award $100,000 to small to mid-size California arts and cultural organizations each year.Applications will be reviewed by a panel consisting of artist and curator Tara Lynne, director of the Center for the Arts at UCLA; Robyn Alford, interim director of the Center for the Arts; and an informal committee comprising arts professionals, arts educators, and local residents. The deadline for applications is October 5. “To some extent, the Covid-19 pandemic has made clear that we live in a post-Covid-19 world,” said Lynne. “As we assess the future of our state, we must begin by recognizing that there is already a strong and thriving creative and cultural economy in California, and that, beyond the immediate needs of our city, our state, and country, there are promising and exciting possibilities.”Since the center’s inception in 2014, the challenge grant program has delivered $9", "The next Biennial should take place in the city of Basel, Switzerland, in 2021.  The theoretical physicist and the Swiss contemporary artist, Helene Kunsthalle, who drew inspiration from the novel and the industrial revolution, respectively, announced that the event would be held simultaneously with the upcoming iteration of the Biennale in St. Petersburg. In a statement, the organizers said: “This year’s inaugural Biennale, which was organized in partnership with the City of Basel, is the culmination of a long-term project, which began in 2007 with the invitation of the city of Basel. The idea of a fair in a city as rich in history and culture as Zurich was born out of the excitement of the 1989 inauguration of the city’s former president, Christian Wiegmann, who became the first to lead the city in his new role as president. It was also born out of the growth of the art and design sector in the city. We are all very proud to be a part of this city, this city’s citizens, and its history. The next edition of the Biennale will bring together the best artists of the world to explore and express the vibrant spirit of", "The next Biennial should also include a discussion of how tourists and artists are reemerging in the wake of the pandemic, and in what ways they can be engaged with the exhibition space.  \nÜIn the Shade of My God,” a Biennial for Lesbian and Gay Artists, will be staged at the September 2020 edition of the Venice Biennale, opposite the Biggest Losers Festival. The exhibition will focus on the work of lesbian and gay artists in the country, and will draw from a wide range of sources, including their own art, and will consist of a series of lectures, performances, and screenings. The show will also include a creative residency program that will provide live programming and curating opportunities for queer and trans-identified artists. The event will run from October 7 to October 15, 2020. “For many artists, the upcoming Venice Biennale is the last chance to continue their work,” said Markus Bächli, director of the Renzo Piano gallery and the commission for the exhibition. “That is why we are so excited to present such a robust exhibition program, in a show that is centered on the movement of one artist\u0097that is, on the work of one", "The next Biennial should be held at the city’s Museum of Art, in the city of New York. The city’s Museum of Modern Art and the Louvre will be closed for a time. “Each year we hold a new exhibition at the Museum of Modern Art, which brings us back to our roots,” said Kieran Carney, president and CEO of the museum. “The new role of the biennial will allow us to evolve our program, to reimagine the future, and to deepen our relationship with our communities through programming that honors the legacy of contemporary art through the exploration of new topics.”The new title for the biennial, “The Grand Trunk,” will be unveiled in 2020.\n\n\nNew York–based dealer  Luis Garrido has been sued by former clients of his gallery who allege that the dealers misrepresented the services that they provided to their clients, then defaulted on their payments. The New York Times reports that the dealer was attempting to settle more than one hundred lawsuits after he shut down his Lucky Duck gallery in December 2019, a move that resulted in the clients losing money.“I was never paid a cent, and now I", "The next Biennial should take place in the city in 2021. \n\nThe National Gallery in London has received a gift of forty paintings by Sir John Sayers—including The Adventures of Richard and Etna, Etna and Richard, 1979, and The Adventures of Huckleberry Finn, 1954. The works will be displayed in the institution’s new exhibition of Sir Thomas More, which will open on November 5, the week of the twenty-fifth anniversary of its founding. The National Galleries of Scotland also acquired forty works by Sir John Sayers, Etna and Richard, 1979, and The Adventures of Huckleberry Finn, 54. The shows are scheduled to open in April 2020.The National Gallery also revealed that it will stage a new exhibition of paintings by Sir John Sayers, which will be organized as a joint project between the National Galleries of Scotland and the University of Aberdeen in 2020. The show will feature works by fifty artists, including Robert Bland, Rosalind Franklin, John Galliano, Henri Laurent-Wolff, and Louis Malle, and will run from March 20–March 22, 2020.The National Museum of Scotland also unveiled its new masterplan, “The West", "The next Biennial should focus on world art, which is usually taken as a symbol of the unity of the human species. This will be one of the last times the award is given by the Lévy Gorvy Foundation.Hannah Lozano, the director and CEO of the Lavender Stages, said: “The Biennale is a powerful way of furthering the work of women artists. The importance and richness of the Open World series has never been more clearly defined and has never been further explored. The next edition, which will be held in London, will be a showcase for the work of the best emerging and established artists. The format, the exhibition, the awards, the prizes, the other BGs, and the artists themselves are crucial to the final outcome. The work of the artists themselves will be the theme of the second edition at the Lévy Gorvy Foundation in October 2020.”\n\n\nThe New Museum in New York, which underwent a $750 million expansion and renovation last year to become more like the Museum of Modern Art (MoMA), has announced that it will begin welcoming visitors back in 2020. The institution now has nearly three hundred spaces to accommodate the growing needs of the city and has already opened a new", "The next Biennial should take place in the next two years. FiveThirtyEight estimated the total cost of the exhibition at $40 million. It will be hosted by the Art Institute of Chicago, which will be housed in the building where the museum’s current exhibition, “The Oxford Biennial: ‘History and Philosophy,’” will be staged.The institution also announced that it is preparing to open a new wall space in the museum in the fall of 2020.\n\n\nA group of artists, activists, and collectors are suing the Chinese government to secure the release of an American artist held in China for more than a year. After artist Ai Weiwei and the Chinese government signed a landmark ten-year agreement in 2014 under which Ai and his family were allowed to leave China for any reason, the family was detained in Guangzhou and sent to a detention center. The case of Ai Weiwei’s family members has been ongoing since 2016, when the Chinese government announced that it was preparing to close the detention center, the Beijing Art Museum, and send the family to a different location.On Wednesday, the plaintiffs filed a lawsuit in US District Court in the Southern District of Michigan, claiming that the Chinese government violated the Ai Weiwei and", "The next Biennial should focus on the concept of accessibility, collaboration, and community—all of which are central to the project. The changes announced so far are outlined in the following diagram, which was shared by the artists in the artforum group:Artforum is a dedicated online community for contemporary art. It is run by an ad hoc staff of curators and artists and by a board of curators, which comprises of ten to fifteen artists. It has one of the largest online audiences in the United States, and has hosted hundreds of artists since it began in 2004. It now has over fifty thousand members and is growing. Its main building is in the city of Santa Monica, California, but it also has an outpost in Chelsea, New York; Montauk, New York; and multiple locations in Hong Kong, Singapore, and Mumbai.“We are actively planning for the future,” said Arthur. “Currently, we are focusing on creating a platform that can be a platform for artists, whose practices and practices are often outside our own sphere of expertise.” He added that the new project will begin with a digital open-air museum in the city.The biennial will be a collaboration between science fiction, fantasy, and contemporary art", "The next Biennial should take place at the Museum of Contemporary Art (MoCA), in 2020.\n\n\nThe Museum of Modern Art (MoMA) in New York has announced that it plans to hold a major retrospective of the work of French designer Anne-Marie Aichele, an influential modernist whose fashion, design and architecture encompasses the works of a multitude of artists, including Pierre Bonnard, Angell and Guadagnoli, and Jean-Michel Basquiat.A few weeks ago, the institution moved the exhibition, “Anne-Marie Aichele: Fashion, Design, and Architecture,” to its permanent collection, a move that drew widespread condemnation from critics and artists alike. “The move is meant to create a moment of convergence for those who have not yet experienced Aichele’s influence,” art critic Daniel Sheehan wrote in the May/June 2019 issue of Artforum. A recent retrospective at the Museum of Modern Art in New York, titled “Anne-Marie Aichele: Fashion, Design, and Architecture,” also featured work by the late Israeli architect Herzl & Zeldovich.“The move is a serious mistake,” David Breslin, the", "The next Biennial should take place in St. Louis, Roanoke, and Charleston, South Carolina, in 2021. More information about the new venue is available on the theme of the 2019 edition: Biodiversity and Place. In a statement, the Centre For Contemporary Art (CACMA) in Montreal said: “The 2017 by-election results and the excitement surrounding the exhibition calendar are in keeping with our strategy to bring an international exhibition to Montreal in the next two years, with a view to a new Cultural Centre within the city. As always, we are proud of our city’s artists, institutions, and organizations and we will continue to support them as they forge their own creative paths in collaboration with the City of Montreal and the city’s nearly 7,000-strong board of cultural advisors.”In an interview with the Art Newspaper, Augustau Michelson, president of CACMA, said: “A lot of people are looking now to the future and saying, ‘I want to leave my mark on the city,’ but we have to keep the art here. We have to preserve the legacy. Our vision is to create a new cultural space that can be a cultural destination", "The next Biennial should be in early 2021. The proposal has drawn criticism from those who view it as an affront to cultural heritage. \"I hear the criticism of the Biennial. It isn't that we didn't build the pavilion, it was really thought that we didn't build the pavilion, because we didn’t intend to—to build up a history of the house,” Mark Lutz, a British curator and art historian, told the Art Newspaper. The pavilion is considered a landmark in the Netherlands, and Lutz said that he does not understand why the artists would boycott the exhibition. Since the tapestries and paintings were made during the first half of the nineteenth century, the Biennial has been a platform for artists such as Viet Duc Thanh, whose work was on display in “I Have Come to India;” the exhibition closed last October. The Biennial was also instrumental in the development of the Dutch language, and in the emergence of a great Dutch-American cultural exchange between the Netherlands and the United States.Photographs by Kheroum-Makarem, Keesu-Makarem, and Keesu-", "The next Biennial should be held in 2020.\n\n\nArchitects William Eggleston and Eileen M. O'Connell, in partnership with the New York Museum of Modern Art (NYMoMA), have honored the late artist Frank Gehry and the late fashion designer Calvin Klein. The pair will receive the Arts & Culture Award in commemoration of their contributions to the American dream.Joining Eggleston and O'Connell in recognizing the pair are Paul Strand, the director of the Museum of Modern Art in New York; David Kordansky, the founder of Kordansky & Kordansky; Jules and Iva Sterbak, the widow of the designer; and Diane Von Furstenberg, the wife of the architect. The award ceremony will take place at the Manhattan Museum of Modern Art on January 29.The Arts & Culture Award­ was established in 2004 by the Annie for Art and Design (A.A.D.) award. The A.A.D. award is one of the oldest and most prestigious awards in the United States, established in 1946. It was named after A.A.D. founder Wendell Potter, who was awarded the prestigious $10,000 prize. Awardees typically receive $30,", "The next Biennial should be convened in June 2021. The 2020 edition will be held at the Museum of Contemporary Art Berlin. The 2022 edition will be staged at the Kunsthalle Basel. The museum will also host a series of exhibitions that marks the anniversary of the German artist's birth in October 2020. It will be inaugurated by the exhibition “Bicke von der Biennale des 20. Jahrhunderts” (October 20 Biennial), which will highlight the work of twelve German-born artists from the twentieth century. The catalogue will also include an exhibition of the work of Danish artist Romaine Abramović. The new exhibition will be curated by Wolfgang Tillmans and will open on November 6.  The Berlin Biennial will be hosted by the Museum of Contemporary Art Berlin (MCAB) and curated by Wolfgang Tillmans, from November 5 to December 9. The exhibition will examine the relationship between art and the environment and will feature the work of artists from seventy-three countries and thirty-six cities. The MCAB will give the first public preview of the biennial at its headquarters in the district of Künstlerhaus in Berlin on November 7. The exhibition will be followed by", "The next Biennial should focus more on contemporary approaches to art and more on the artists whose work is currently on display. “I want to see more contemporary exhibitions, not less,” said Christopher Wool, the director of the Redfern Gallery and Museum and the Royal Academy of Arts. “The Biennales are not about to change that.” The new exhibition will feature works of contemporary art from thirty countries, including China, China’s Hong Kong, Hong Kong’s Taipei, and Taipei’s Guangzhou, which are displayed in a new show of works by artists such as Agnes Martin, and Saara.Officials at the Biennales have previously said that the redesigned venue will improve accessibility and that it will support more contemporary artists. The new exhibition hall will feature more spaces for audience participation, more public spaces for performances, and more public art. It will also be larger and will boast three times the number of the existing exhibition hall. The same is true for the museum’s collection, which will include works by a larger number of artists.The redesign, which is being spearheaded by architect Ahsan Suri, was inspired by the curators’ plans to create new rooms", "The next Biennial should begin as soon as possible. “We will keep you updated with the progress, as the manufacturer is working with the authorities,” a representative for the international group said. The Spanish Federal Police has also announced that it is investigating the circumstances surrounding the disappearance of Teresa María Romero, a scholar and independent curator who disappeared on March 3 after a week-long assignment in Rome.On March 4, Italian media outlets reported that the Fascisti Institute of Architecture and Technology (FIAT), in Padua, Italy—a major arts hub in the region—had organized a class in philosophy, art, and architecture that was canceled due to the pandemic. The event, titled “Reflections,” was slated to take place on March 8 and was supposed to culminate with an exhibition of new works by twenty artists.The institute told the Art Newspaper that the cancellation was made on the advice of the institute’s director, Olivier Marozu, who had consulted with María Romero and her colleagues. According to the New York Times, the institute had scheduled the event for March 20.FIAT, which has a campus in the city of Padua, is the only institution in the country", "The next Biennial should take place in 2021-20 and the first instalment in 2022. Advertisement - Continue Reading Below\n\nA survey of artworks by the US-based artist and curator, activist, and educator Marie Montoya, whose work addresses colonial systems of domination and inequality, has been selected as the 2020 prize for the Arts. The biennial is slated to take place at the São Paulo Bienal in Brazil in 2022 and will present twenty-nine works.The biennial will be hosted by the São Paulo Organizade in partnership with the Pilar Artística di São Paulo and the Pilar Malaria i Rio de Janeiro, and will consist of twenty-four works on paper. The work of the next edition will be scored by curator Adriano Cammisa, director of the New Arts & Cultures in Rio de Janeiro, and São Paulo Bienal associate José María.The biennial will also include a discussion with artist Djurijn Esai-Alberto and will receive funding from the Brazilian Ministry of Culture. The work of the next edition will be curated by João Teixeira and will be presented by Pilar and the Pilar Foundation.\n\n\nOn Thursday, the", "The next Biennial should be held in 2020. In the meantime, the museum works toward establishing a new long-term programming plan that will present new works by the cast and the artist-in-residence.\n\n\nThe Independent Art Museum St. Louis (IAM) has selected the fourth individual to its board of trustees. The appointment is made through a vote of IAM’s membership, which convenes annually. The ten-member selection committee comprises Artminer, director of exhibitions at the Art Institute of Chicago; Mark M. Mayer, director of the Legacy Art Museum, Santa Monica, California; and artist-in-residence Erica C. Pape, as well as Scott D. Wilson, president of the Museum of Modern Art, New York.“It’s been a great honor to serve as chair of the IAM board, which represents twenty-eight talented and dedicated board members,” said board chair Paul Fleischer. “IAM is an amazing institution, and the board’s excellence reflects its commitment to thoughtful and thoughtful thinking about how art can shape and extend our world. I’m proud to have been able to help shepherd IAM through its last years of operation and rebuild its board", "The next Biennial should be held in the city in 2021. The deadline for the exhibition was pushed back several times because of the Covid-19 pandemic, so that it will take place sometime between 2019 and 2021. One of the main goals of the biennial is to better understand the cultural and social landscape of New Delhi, and the second is to explore the relationship between art and architecture, with the ultimate goal of creating a space where art can be explored and experienced simultaneously. With the help of the curators of the exhibition, the team will prepare for the exhibition by creating a plan of how the exhibition will be organized and will launch a public website where visitors can see the exhibition for free. Inaugurating the venue is a series of public performances, including a symposium on art and politics organized by the writers Ramachandra Guha and Nandini Ghose and a show of work by artists including Suzan-Lori Parks and John Edward.The exhibition will be inaugurated by artist Dani Gattuso’s multi-million-selling book, Bharata Bhatt, which was given a retrospective at the Ministry of Culture in Delhi in February.The exhibition will be followed by two other biennial shows,", "The next Biennial should be held at the club in September 2020.\n\n\nThe West Bank Museum of Art in the West Bank, which was set up as a cultural hub in 1959 to house thousands of Palestinian artworks, is facing a legal complaint for refusing to remove a monument commemorating the Nakba (catastrophe) and the 1948 Arab-Israeli conflict.The Nablus-born architect, Yair Hochner, created the site in the West Bank city of Nablus and lobbied the government of Israel to designate the site as a cultural landmark. According to the Architect and Engineer Union (NADA), a collective representing American architects, the decision to exclude the work was made in January of 2019 as part of a wider campaign to push for the removal of West Bank structures, including Palestinian heritage sites, that were built without the government’s consent or that were built without the permission of local communities. The campaign was launched after six West Bank Palestinian heritage sites—including the Al-Aqsa Mosque, the al-Quds Mosque, the Al-Arak Mosque, and the Tomb of the Patriarchs—were transferred to the State’s National Museum of History in Jerusalem in January of 2019. The move marked the first", "The next Biennial should inaugurate with a series of performances, presentations, and exhibitions, comprised of works that reflect on the themes of the year. The theme of this year’s edition is “The Struggle for Human Rights.”\n\n\nThe Architectural Association (A) recently announced its list of 125 artists who will be featured in its 2019 edition. Based on an open call\u0097the organization featured seventy-nine artists\u0097the list is divided into thirteen categories, including architecture and design, urbanism and design, landscape and design, and performance and performance art. The ten artists nominated for the 2019 edition have been chosen from a pool of forty-three artists, with the support of a group of curators, writers, and other artistic professionals that included Naima J. Keith, Tanita Negi, Carmen Otero, and Kyung-ho Park, and are to appear at the fair.“We are honored to present the artists who are represented on this year’s A’s list, and we are confident that they will create new and exciting work at the Milan Biennale,” said Michele Barbieri, president of the A.A.A.A. The list of nominees is", "The next Biennial should take place in 2020. The judges will be selected by a panel made up of Carlotta DeMeritt, director of the Museo de Arte de São Paulo; Bruno De Boij, director of the São Paulo Museum of Art; Paulo de Castro, secretary of the Museu de Arte de São Paulo; and Paulo de São Paulo.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles on Tuesday announced the launch of a new digital platform that will allow local artists and organizations to create and share works in real time. The platform, called the Creators Times, will feature a curated list of twenty \"living artist projects\" curated by artist-in-residence Shaniwala Farmani. “To begin with, we are excited to invite all of the Creators to participate in this new forum,” said Mark Penalosa, director of the institution. Farmani is an Oakland-based artist whose work focuses on the material and social environment. Her work has been exhibited at the Oakland Art Museum, the San Francisco Museum of Modern Art, the San Diego Museum of Art, and the Whitney Museum of American Art. “A few years ago, I realized I", "The next Biennial should take place in 2020 and will include two exhibitions, “Analogies in the Dark” and “Painters in the Studio: A Story of Light and Dark”.\n\n\nThe Turkish Ministry of Culture will suspend any and all public events and cultural gatherings deemed illegal by the country’s Arts and Culture Ministry in an attempt to break a nationwide strike scheduled to begin on June 24. The announcement came after the government banned protests by the country’s intelligentsia, artisans, and small businesspeople from taking place for three successive weeks.The protests have been ongoing since June 15, when a group of journalists were murdered by a government-backed Islamist terrorist attack in Istanbul. The event was supposed to have taken place on June 16, but was postponed due to the unrest. According to the Hurriyet Daily News, the academic center in Istanbul where the exhibition was set to take place, the exhibition will now go on as planned. The minister of culture, Taner Kaya, said: “This is a moment of great change for Turkey. We are not only facing an unprecedented crisis, but also a long-term one.”The move has sparked outrage and protests from the country’s", "The next Biennial should take place in the fall of 2020. “We are proud to present the first ever Biennial in the Autonomous Region of Oaxaca,” said Marcelo Sánchez, director of the Autonomous Region of Oaxaca. “The new museum will be a cultural hub, offering a new perspective of Mexico’s history, a true reflection of the people of Oaxaca.”\n\n\nThe Art Institute of Chicago (IIC) announced today that it has welcomed twenty-three new members to its board of trustees, bringing the total number to ninety-four. The institution also learned this week that it will be forced to close indefinitely due to the novel coronavirus.The IIC’s board of directors voted to increase the trustees’ compensation by $20,000 in January 2019. In May 2020, it will decide whether to suspend their annual $300,000 stipends. The board also voted to increase the stakeholder compensation by $10,000.The board’s current chairman, Edward Ho, receives $177,000 annually; vice chair, Andrew Milten, receives $164,000; and the treasurer, Emma L. Jackson, receives", "The next Biennial should be held sometime in the second half of 2020, and will explore the philosophical underpinnings of the new framework. The exhibition was organized jointly by the Swiss Federal Council (CfC), the Swiss Federal Cultural Foundation (FaF), and the Centre Pompidou in Paris.Faculty members from at least five other institutions have signed a letter asking that the Biennial be postponed—including the Centre Pompidou, the University de Bergen-Bicocca in Bicocca, and the Institut d'études du Québec—as well as the Institut Pasteur des Sciences Sociales in Paris. The letter claims that the postponement would be detrimental to the work of the Biennials, which have been designed to address a wide range of contemporary issues.The letter states: “We, the undersigned, condemn the decision of the Court of Directors to postpone the twenty-fifth Biennial of Contemporary Art (BCCA) in Genève, France, to 2020. This is a total disregard of the Court’s decision, which was unanimous and in favour of the exhibition. The exhibition cannot be affected as long as the Court of Directors continues to approve this decision and shall continue", "The next Biennial should focus on the division of labor, technological innovation, and enterprise, while still ensuring the capacity to engage with and explore the themes of the exhibition, in order to create a new kind of exhibition, a new way of thinking about the future.”The selection committee, chaired by Piero Belloni, chair of the exhibition’s gallery, stated: “The dream of the Biennial is to be a place where we can come together in an environment where the exhibition can become a part of our lives. We can cultivate a new kind of exhibition in the exhibition that can help to advance understanding of the exhibition. This new exhibition will be an occasion to reflect on the exhibition and on our place in the world.”\n\n\nOn Tuesday, the Italian government passed a landmark reform that will allow the private sale of works by the Four Seasons that are no longer needed by the state, but are in poor condition. Among the works that will be removed from the government-owned museum are Piet Mondrian’s The Trees (1979), which was added to the collection in 2013, and Rerum, which is also no longer needed and was removed from the collection in 2009. The former will remain in the public collection until", "The next Biennial should take place in the spring of 2020, after the winter of 2019. The 2019 and 2020 editions of the theme were held at the Museo de Arte Contemporáneo de Boca, the Museo de Arte de Madrid, and the Museo de Arte de São Paulo.\n\n\nThe Tate’s board of trustees has approved a new contract for Tate’s London and Middle East (LMM) exhibitions, which were scheduled to run from March 27 to March 29. The board concluded that the eight-week run was unrealistic and that the changes would only postpone the inevitable.“While the board recognises that the LMM shows will be challenging and challenging in many ways, the board has concluded that the March show is an unrealistic and disruptive schedule for the majority of our audiences,” said Tate director Maria Balshaw. The March show, titled “Alberto Burri: A Life in Pictures,” will now be staged in the spring of 2021. The board also decided to increase the stipends for Tate’s annual London and Middle East Fellows, which were awarded this spring. The fellows will receive an additional $42,000", "The next Biennial should be held in 2021. \n\n\nOn Saturday, the Bechdel Center in New York announced that it has received a gift of twenty-seven works by sixty-four artists, including Herman Guggenheim, Robert Irwin, and David H. Koch, from the Koch brothers. The donation includes artworks dating from the early seventeenth century to the twentieth century, as well as contemporary artists from the United States and Europe.The gift includes works by artists including Maurice Lesage, Leonardo da Vinci, and Donatella Versace. Its exhibition, “Categorizar Altice: Atelier Mondial de L'Art Contemporain,” will open in November and will feature work by forty-five artists who were selected by a committee chaired by David H. Koch.The Kochs are philanthropists who have given $889 million to organizations and foundations that promote a libertarian view of the world. They are also staunch defenders of the arts, which, despite their small budgets, have expanded greatly in their impact on American culture.The Koch brothers are supporters of causes including arts education, social justice, and tax reform. The nonprofit Institute for Humane Studies in California received a generous $336 million", "The next Biennial should be held in 2021.\n\n\nThe Museum of Fine Arts, Boston (MFA) has added five new members to its board of directors: artist-activist and self-taught animator Arne Duncan, writer and curator Anna Deavere Smith, artist-activist and director of the New Art Group, and singer-songwriter Noel Gallagher. The institution also announced its representation of Maren Adland, curator of the Whitney Museum of American Art.Founded in 1960 by art historian and educator John and Nancy Kline, the Kline Foundation is comprised of the Kline Center for Visual Arts and the Kline Family Foundation, which together contributed $5.5 billion to the museum’s endowment in 1983. Its board of trustees includes artists Jennifer Kline, John Kline, and their daughter, Jennifer Kline, and former board president and CEO Michael Kline, as well as Sarah Lissoni, art historian and curator of works by Fernanda Pinak, Daniel Libeskind, Andrew Lloyd: The Artist. The institution also has a library of more than 1,800 works and is a founding member of the Center for the Arts.In its new role, the board will be responsible for:•", "The next Biennial should be held in 2020 and will be open to the public. The museum will also extend its reach with a new urban village in the city, a site-specific public project, the first of its kind in the world. The project is part of a project to reframe the relationship between the city and the museum.Based in London, the museum will be located on a site that’s been reclaimed by the city for the sole purpose of housing the collection. The work of the local artist-in-residence will be displayed in an exhibition space, the Museum of London; and the museum’s collection will be moved to the Tate, which has a new 52,000-square-foot building in the city.\n\n\nThe University of Chicago (UIC) has awarded $6.5 million to five artists who have made significant contributions to the arts, including a group of gallery owners who collectively spent more than $1 million to secure the collection of the university’s Stanley H. Johnson Galleries, a museum dedicated to African American art, and a group that brought national and international exhibitions to the university.The artists—Nnani Ashraf, Ahmed Abu Khdeir, Jay-Z, Hauser &", "The next Biennial should take place in Tokyo in 2020 and will be hosted by the Tokyo Metropolitan Museum of Art. At this point, the 2020 edition is expected to be completed in 2021.\n\n\nItalian artist, designer, and educator Paolo Strada, whose programming centered on the history and culture of indigenous sites like the Santa Maria della Scala archaeological site in Florence and the Museo Archeologico di Santa Maria della Scala, has died at the age of eighty-one.Born in Turin in 1936, Strada studied at the University of Milan, the University of Cagli, and the University of Naples. He moved to New York in 1948 to study at the school of Kenneth Kaufman at Columbia University before moving back to Turin where he continued his artmaking at a department store called the Contemporary Art Market. Strada’s career then began at the Zuccotti Park Cultural Center in Rome, where he studied with the Italian architect and urban theorist Luigi Cipollotti and worked as an assistant to the local architect, Giico Cipolicotti, who designed the Italian Embassy in Turin.In 1978, Strada moved to the Santa Maria della Scala, where he continued his urban program, which included two shows at the Santa", "The next Biennial should focus on “The Roman Empire: From Crisis to Triumph,” a work that explores the evolution of the Roman empire from a small trading state to an empire that has a global reach. The show will also focus on the relationship between poetry and art, and on the role of art in shaping the social and political climate.The biennial will run from March 16 to March 19. \n\n\nThe Karlsruhe and Alfred-Prölz Museum (KUNM) in Karlsruhe, Austria, has named Mira Cozzarelli as its new curator of contemporary art. Cozzarelli, who has served as KUNM’s curator since 1996, will have her first solo exhibition with the institution in 2019 and will curate the museum’s inaugural exhibition “Conceptualizing Modernism” (2019–20’s edition) in 2021. She is the first woman to helm such a prominent museum in the world.Cozzarelli is a professor of art history at the University of Vienna and a curator of contemporary art in the United States. Her work has been exhibited at the Kunsthalle Basel (2018), the Kunstverein Berlin (2017", "The next Biennial should be held in 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has received a gift of forty-six works by twenty-four artists, including Walker Percy, Guggenheim’s Robert Rauschenberg, and Ed Ruscha, from the Eric and Joan Lundgren Foundation. The museum also announced the appointment of Walter De Maria as its next executive director.Born in New York City in 1938, Percy (1937–1973) was a painter, sculptor, and printmaker who is known for his prints and paintings, which often feature characters such as the titular Ice King, featured in the 1969 film The Princess Bride, and feature depictions of nudity and sexual themes. Born in New York City in 1938, Percy (1937–1973) was a painter, sculptor, and printmaker who is known for his prints and paintings, which often feature characters such as the titular Ice King, featured in the 1969 film The Princess Bride, and feature depictions of nudity and sexual themes. He was also a head of the sculptor’s workshop, which he created primarily for the Lundgren Foundation.“If there was ever a time when the Lundgren Foundation would have had to", "The next Biennial should be held in the spring of 2021, he said, as a way to commemorate the anniversary, which will also mark the anniversary of the creation of the museum and the mission of the museum.\n\n\nTimur Binay, the new Philippine president, has ordered the arrest of more than 1,400 people for violating the country’s anti-terrorism laws. The crackdown on suspected terrorists has resulted in the arrests of thousands of people since it was launched by president Rodrigo Duterte after he was elected in 2016.Duterte has also used the legislation to crack down on human rights abuses. He has repeatedly cited lax controls on the detention of suspected criminals as a reason for the crackdown, and has even cited the death of a certain fish as proof that crime victims are being let off.The latest crackdown was sparked by an alleged arsonist attack on the Presidential Office Building, the Department of Foreign Affairs, and the Bureau of Immigration in Manila, which killed one person and injured more than a dozen others. The arsonists reportedly set fire to a police station and two government buildings in the capital. The arsonists were apparently inspired by anti-terror legislation, Duterte said, but he also said that the arsonists had been given a chance to surrender after they were", "The next Biennial should be hosted at the Art Gallery of Ontario, which is currently developing a new exhibition for the first time in its twenty-five-year history. The exhibition will focus on “social justice and sustainability.”\n\n\nThe Walt Disney Company is planning to cut nearly two hundred jobs at its public museum in California, in an effort to minimize the impact of its ongoing restructuring efforts as it attempts to improve operating income and avoid a financial loss in 2020. The news comes on the heels of an expected $50 million drop in visitors and revenue for the Disney–Paisley, which is currently undergoing a $55 million expansion and is considering cutting more than one hundred jobs as part of a plan that will be unveiled in the coming months.The job cuts, which will take place in various locations across the organization, will be part of a restructuring plan that will prioritize employee engagement with its programming and curatorial team through June 30. The restructuring will also involve the elimination of some 200 to 250 positions across the organization, which announced its hiring of two new staff members in June and expects to employ approximately 125 people across the three-year period.“The changes at the Disney-Paisley are unprecedented and we’re still in the process", "The next Biennial should be held in 2021—the former is a long-time goal of the exhibition. The two-hundredth anniversary of the exhibition is also a year away. The new exhibition will be dedicated to the art of the West. It will include work by fifteen artists, including Yizu Yizu, Toshio Ito, and Mitsuko Yoshino. The first show, titled “Longing: Japan in Contemporary Art,” will open in the Art Museum at Carnegie Hall on April 3.The theme of the second edition of the Symposium is the “phantom of the West.” The symposium will take up themes such as the theorization and practice of the West, the influence of Western art on Japanese art, the subtleties of the mediaeval art of Italy and Greece, and the pathologies of the European art of the late Middle Ages. The symposium will presently be held at the Shizuoka Ikura, the Shizuoka Art Museum, and the Shizuoka Besshi. \n\n\nThe Swiss organization GalleryArt.de has announced the opening of an online exhibition dedicated to the work of the late Swiss designer Helmut Newton. The show will run from August", "The next Biennial should open in the summer of 2020, according to The Art Newspaper. The 2021 edition of the festival, titled “When Worlds Collide,” will be hosted by the Royal Academy of Arts in London and will run for fourteen days.  The 2020 event will be supported by public donations and will be held at the Royal Festival Hall in central London.\n\n\nThe late director of the world’s largest museum, Museum Basel, Katsu Conghi, has announced that he is seeking the resignation of Ma Yi, who was appointed director of the Beijing Art Museum last month and took the helm from her predecessor, Tian Jie, on August 27.Conghi made the announcement in an email sent to the staff of the BAMTech, a contemporary art museum in Beijing, on August 20. Conghi cited the current situation as the reason for his resignation.“I am deeply disappointed with the current direction of the museum,” Conghi wrote. “Ma has been an outstanding leader of the institution, and I am deeply disappointed by the state of affairs at the museum.”The museum has faced political pressure to restitute the collection after it was reportedly", "The next Biennial should be held at least once a year. In a statement, the Teamsters Union said: “We are grateful to the City of Beijing, the Privy Council, and the Greater Beijing Arts and Culture Commission for supporting this exhibition, which will greatly benefit workers and communities in Beijing, and to Mayor Wang for placing this exhibition on the agenda.” \n\n\nThe second edition of the Jeonbukdong Biennial, which was canceled amid the unrest over the killing of Lee Hong-Kyong, will now take place in Seoul. The issue was brought up during a hearing in Seoul District Court on Thursday, where a lawyer representing Park Young-o, Lee Hong-Kyong’s son, asked Judge Kim Kuk-kyung to refer the upcoming exhibition to the Constitutional Court for further review. According to the Seoul YTN News Agency, the court will take up the case on October 6. The serial cancellation of the eleven-day event, which is expected to draw around three hundred people, was prompted by questions surrounding the murder of Lee, a South Korean citizen who was kidnapped on February 14 and died three days later in police custody. The case has been the source of ongoing protests in", "The next Biennial should also aim to include the works of the under-recognized artists of Asia, including the Japanese artist Koki Satoru, who is known for his monumental works, which are housed in the Musée National Picasso in Paris, and the French artist Jean-Michel Basquiat, whose monumental artworks are housed in the Museo de Arte Contemporáneo in Madrid.\n\n\nThe 2018 Oscar de la Hoya Biennial, which was curated by José Carlos Tavares and premiered at the Hammer Museum in Los Angeles on May 28, has announced it will suspend its award ceremony, titled the Oscars, until July 12. The move was made after the organizers received complaints from several critics, including the Los Angeles Times, that the ceremony was being rigged.In a statement, the organization said: “At no point did we consider that cancelling the Oscars would be perceived as undermining our goals. We chose to act as if the Oscars were a power structure’s ‘structure of the most corrupt kind, an institution that has been hijacked by people who want to silence artists.”The organization added that the decision to suspend the award ceremony was not made “without thought or discussion.�", "The next Biennial should take place in 2018.\n\nThe museum is currently working to ensure that the biennial will be completed in time for the 2020 edition of the Art in Cities festival, which will take place in October. “The museum is committed to the concept of the biennial and to supporting it,” Sarwar said. “We are working with the public to help shape the theme and to determine the ideal dates for the exhibition.” The museum also revealed that it is working with the artist-run organization Make Space, which works to preserve space and support artists and their projects, to develop a new catalogue, which will be presented in the fall of 2020. An exhibition of works by the group - featuring work by Kamala Ibrahim, Hoda Kanwar, and Ondine Chavoya-ŠŠime, among others- will also be announced in the spring.\n\n\nA project by local artists and institutions in the city of Paris to create an outdoor sculpture park that would draw visitors from across the city and provide them with a fresh, urban experience in the capital has been awarded a $1.1 million grant from the London-based organization Make Space. Louvre Sc", "The next Biennial should be on the streets of Paris on July 13–July 15 and will present the first large-scale exhibition of works by the internationally acclaimed international artists, including Pierre and Vanessa Biennale, Yinka Shonibare, and Fernando Bonarà. The full list of participating artists is as follows:\n\n\nThe International Committee of Museums (ICOM) has welcomed the new curators at the First World War Museum (FWM) in Great Britain to its ranks, naming them after the historical battleship HMS Victory. The appointments were made on the occasion of the biennial “The Future We Deserve: World Wars, 1920–1951” and follow a wave of pro-independence artworks that have been salvaged or restored to make way for the construction of new war memorials in the UK. “The biennial’s curators have contributed to the conception of the exhibition and to its exhibition of the works in question, which reflect the diversity of themes touched upon by the exhibition,” said Alexandra Conaghan, president of the ICOM. “This year’s ICOM Centenary is a good occasion to reflect on the breadth and depth of our history at sea", "The next Biennial should be held in 2019, with the final show being held in 2020. (Denmark, Austria, and France)  With the United Kingdom still recovering from the impact of the coronavirus, organizers of the fair announced today that they are planning to move the event from March 29 to March 31. The announcement follows the British government’s announcement that it will phase out the annual March Queen Elizabeth II birthday celebration, which drew an estimated 75 percent drop-off in visitors. The New York Times reports that the government is also looking to increase the amount of public artworks that can be displayed during the month of March. The government committee on cultural monuments is also considering whether to change the date of the annual celebration, which was established in 1908 in memory of Margaret Thatcher, Britain’s prime minister. While the UK has since seen a resurgence in visitors, it is still one of the most densely populated countries in the world. Due to the coronavirus, the total number of visitors to the UK increased by 18 percent in March, the Guardian reports. The Committee for Digital Art, Culture, Design, and the Built Environment (C4BD), an NGO, is supporting the move", "The next Biennial should take place in 2021, and the exhibition should be set in a futuristic, futuristic setting. In the meantime, a number of artists, organizations, and institutions are planning to stage exhibitions around the themes of climate change, migration, and migration insecurity. “We strongly believe that the panel will be a valuable tool for the development of our craft and for the dialogue that we want to create among artists and audiences,” said Jürgen Schaechter, artistic director of the Biennale. “This exhibition is a global statement about what biennial art can be\u0097a step towards that goal.”The exhibition will be inaugurated by an exhibition of work by the new artist-in-residence, Zoya Sanandaji, titled “The Spillover of Spillover,” which will be presented in collaboration with Artnet. Its exhibition will also feature work by the new artist-in-residence, Moa Akkum, which will be on display in the exhibition “Heat Waves and Heat Waves and Heat Waves,” which will be on view until November 29.\n\n\n\n\n\nMmako Mpagi Sepuya, the Dutch-born, Los Angeles", "The next Biennial should be staged in 2020, and the biennial will be staged in tandem with the 2020 Olympic Games. “From the moment the Olympics first entered the picture in 1984, the contest has been a platform for cultural exchange and collaboration between China and the UK,” said Matthew Booth, the British ambassador to China and the UK. “This year’s edition featured a truly outstanding roster of artistic and cultural talents, and we are delighted to see them returning next year for the 2020 edition. The theme of 'Connections and Distances” was a strong theme throughout the exhibition, with artists discussing their personal histories and participation in global movements.Not only will the opening of the Biennial mark the first time that the exhibition will be staged in London, the exhibition will also open in Shanghai and be staged at the Grand Canal Design Museum in New South Wales, Australia, and the Sydney Opera House, Australia. “The theme of this year’s edition was a strong theme, and it was the theme of the Beijing Art Museum,” said curator and champion of contemporary art Ma Xiaojie, who is best known as the artist who sculpted the first exhibition of work by contemporary artists in China.", "The next Biennial should take place in 2020’s calendar year. \n\n\nThe French Ministry of Culture has approved a plan to forcibly relocate some twenty-five thousand undocumented immigrants from Brittany to the remote French island of Corsica. According to the New York Times, the newly installed minister, Nathalie Bondil, said that the move is necessary in order to protect France’s territorial integrity and that this is one of five options on the table.According to the French daily Le Figaro, Bondil said: “We are looking at options that do not involve the use of force, on the contrary, options that are mutually beneficial for both parties.” While the relocation of the undocumented migrants to Corsica was first reported by the New York Times, the plan has been criticized by human rights organizations, many of whom are concerned that the migrants will be forcibly removed and returned to France, and has been called illegal.France has since faced widespread protests from the French people, lawmakers, and the local government, which has threatened to take the migrants to court if the relocated residents are not compensated. The migrants have taken issue with the plan as well, claiming that France is forcing them to leave the country, which they claim is illegal, and", "The next Biennial should be held in 2020.\n\n\nA group of artists and collectors led by Leonardo da Vinci and Marc Cohoud in Venice have launched a new fund that will give young British artists and visual artists opportunities to make important contributions to the future of the art world through their works.The fund, which will consist of an annual grant of $500, will be administered by the Italian-born da Vinci and Cohoud, who have been collaborating for more than fifty years, and will award between $30,000 and $110,000 to young artists each year. The first prize—the Leonardo da Vinci Prize—is currently being held in the center of Venice. The second prize, the Marc Cohoud Prize, was awarded earlier this month to Rora Heimer, Ciarán Kelly, and Adam D. Weinberg.“The Leonardo da Vinci Prize is an important step in the artist’s journey to the museum, to the academy, and beyond,” said fellow awardee Rory Mulligan, who is currently working on a play about the philosopher Bertrand Russell. “It is a prize that celebrates the achievement of a remarkable career of artmaking and will help young artists find new", "The next Biennial should take place in 2021.\n\n\nThe New York State Department of Cultural Affairs (DCLA) announced today that Gagosian will open a new branch in the city in 2020. The institution will be located at 925 Fifth Avenue, in the same building as the recently restored Metropolitan Museum of Art, and will begin hosting visitors in 2021.The DCLA, which is under way in partnership with the city, has released a statement regarding the opening of the new location. “Since the opening of the Museum in the 1980s, Gagosian has been committed to making the Metropolitan Museum of Art an essential destination for visitors to New York City,” said Diana Albright, director of the DCLA. “We welcome the opening of Gagosian in 2020 as a way to continue to delight our visitors with compelling exhibitions, exceptional craft, and a dedicated team of curators and scholars. We are excited to have the opportunity to contribute to the Metropolitan Museum of Art’s mission of serving New Yorkers and to support the museum in sharing the full breadth of its collections.”According to the New York Times, a DCLA spokesperson said the organization has not yet decided whether to welcome the public back", "The next Biennial should take place in 2021.\n\nThe “Renaissance” is a reworking of the structural foundations of art, created by the artist Thomas Renève in Geneva in 1912. It was inaugurated by the artist, who was in Paris for the opening of the Biennial de l'Ecole des Beaux-Arts. It was followed by “Picasso: The Renaissance.”The 2018 edition, “The Renaissance” was held at the Stedelijk Museum in Amsterdam and included works by eighty-three artists. The 2019 edition, “The Renaissance: Twenty Years of Art,” was staged at the Museum of Modern Art in New York and took place at the Brooklyn Museum.\n\n\nThe Philadelphia Museum of Art (PMA) has received a gift of more than four hundred works by American artist and activist  Charles A. Birnbaum. The donation includes works by Theodoros Neox, Zora Neale, Laura Owens, and Chris Morris, as well as several works by contemporary artists such as Mary Altman, Rachel Whiteread, and Frank Gehry.“Charles A. Birnbaum is a gifted curator and an accomplished artist whose", "The next Biennial should take place in the spring of 2020 and will be organized in collaboration with the National Museum of the African Diaspora (MoAD), where it will be hosted by the National Museum of African Art and the National Museum of the African Diaspora (MoAD), an initiative of the National Museum of the African Art, in Doha.Commenting on the upcoming edition, Sophie Manners, a curator at the MoAD and one of the co-creators of the upcoming exhibition “Beregasts in Time: From Paintings to Interiors” said: “I am extremely excited for this upcoming edition of the Biennial, with its international, multi-disciplinary, and cross-disciplinary curatorial team, and I truly believe that this is one of the most important moments in the history of the Biennial.”The first exhibition of the new exhibition series in the United States was ­Mackenzie-Johnston Contemporary Art and Contemporary Life at the Museum of Modern Art, New York, in 2016, and the Biennial was established in 2009 and launched by the National Council on the Arts as a way to foster more collaboration between museums and the public. The 2020 edition will focus on “non-", "The next Biennial should be in 2020 and should be hosted by the HTS in the capital city of the former Soviet Republic of Tajikistan. ARTnews reports that the exhibition, which will feature around eighty photographs, will be closed until May 11. Also scheduled for the next two years is the Art Biennial “Be/longing: Contemporary Art and Contemporary Lives.” The next edition of the Biennial will take place in the capital of Tajikistan between May 4 and May 8, 2020.The Art Biennial’s inaugural edition was held at the HTS in Bishkek, Kyrgyzstan; the Art Museum of California, Los Angeles; and the Art Institute of Chicago. In 2017, the museum of Modern Art in New York staged the first edition of the exhibition, which examined the work of twenty-three artists.\n\n\nToday marks the seventeenth year of the annual New York City Arts & Culture Summit, which will take place at the Center for Jewish Life in New York from September 24 to September 26. The event will be held at the site of the old Port Authority Bus Terminal, the site of three recent high-profile terrorist attacks: the 2015 bombing of the St. Patrick�", "The next Biennial should take place in Berlin in 2020. \n\n\nThe Art Newspaper has revealed that the Danish Contemporary Art Museum (Næringskærkær) in Copenhagen is set to reopen next month following a major refurbishment, featuring a new exhibition format, a new deployment of more than 500,000 of the institution’s artworks and an expanded collection of more than one hundred thousand works. The renovation—commissioned by the Danish national museum—is being led by architect Hans Kristensen, who is also responsible for the redesign and expansion of the National Museum of Denmark, Copenhagen.The institution will be transformed by Kristensen and his team from a museum of miniatures and of twentieth-century art into a contemporary arts center. The new museum will boast a building designed by the architect to house the institution’s collection and to extend the museum’s reach. The building will also boast a hotel and restaurant, a gallery, and a theater. The design aims to create a more engaging environment for visitors to the museum. The redesign of the museum is part of a wider transformation plan which involves the restructuring of the institution’s programming and the reopening of some of the museum’s galleries and studios in", "The next Biennial should be set in 2020, but the movement has yet to decide whether it will extend the event beyond that date.The exhibition has faced a number of setbacks in recent years. In 2015, the institution pulled a full-scale renovation of its campus, which was completed in 2017, after it revealed that it would not be able to pay for the project, and began the process of selling off the exhibitions that were on view. The decision led to a temporary closure of the museum, and a future exhibition of work by the artist Ramón de Castro.\n\n\nThe Metropolitan Museum of Art in New York has announced that it is planning to invest more than $1 million in its archives, including more than $300,000 to rebury the collection of the late collector Harvey French, who pioneered the practice of statuary and who has championed the museum’s collection mission since 1967. French’s collection comprises work by artists such as Abstract Expressionists Jean-Michel Basquiat and Louise Bourgeois, as well as works by artists such as Edward Hopper, Pierre Cardin, Ed and Edna, and Henri Matisse.“From the day that Harvey French decided to open his studio, he was devoted to making art accessible to", "The next Biennial should focus on trans-cultural exchange, collaboration, and exchange.”\n\n\nSinger-songwriter and dancer Vivian Richards, who championed her body, her voice, and her spirit through dance and performance, is retiring from the stage. She is ninety-one years old.Born and raised in New York, Richards first studied at the University of Central Lancashire before moving to Los Angeles to pursue a career as an actress. She became a member of the city’s Dance Theatre Department in the early 1940s and starred in her first play, The Body Shop, at the nearby Centro de Comunidad de Los Angeles in 1947. The following year, she began her dance career, which would take her to the center of the dance world.In the 1950s, the performer became a mainstay of the local dance circuit, appearing in productions by such names as Frank Heffner, T. Rex, Ray Davies, and Richard Lear, as well as on the covers of Time and Life and the Village Voice. She was also featured in countless films, including The Body in Dance (1967) and No More Shoes (1970); the 1978 Broadway musical When Worlds Collide (with Joseph-Ming Huang); and the", "The next Biennial should be announced by end of March.   Click here to see the full list of participating artists. \n\n\nThe People’s Art Museum in Beijing has named Nicoletta Guarani its new deputy director. Guarani will be responsible for connecting the museum’s visual arts and cultural heritage programs with the mainland’s commercial and cultural sectors and will take up her new post on May 1.Guarani also has three French colleagues: Nathalie Ghebaly and Sébastien Loos, who will share the role of secretary. “Nicoletta Guarani is the right person to carry on the work of Jean-François Ingart, of Jean-Michel Léger, and of Jean-François Pinault,” said Alexandre Boursier, the president of the museum and its board of advisors. Commenting on her appointment, Guarani said: “I am honored to be asked to lead the People’s Art Museum and am confident that this work will be of the highest quality and will lead the museum to new heights of cultural achievement in our exhibition spaces and exhibitions.”Previously", "The next Biennial should take place at the United States Historical Society in 2021.  In a letter dated November 3, 2020 from the National Association of Art Museum Directors, the institution expressed its \"great enthusiasm and confidence\" in the new format.“The new exhibition will showcase the work of contemporary artists and will offer a wide range of ideas and perspectives,” the letter read. The letter continued: “Starting in the coming months, we will continue to work together to hone in on the ideas and ideas of the remaining exhibition. We hope that the exhibition will continue to contribute to the conversation about art history and art and architecture in the United States.”\n\n\nThe Museum of Fine Arts (MFA) in Atlanta announced today that it is planning to open a new, larger museum in the city in which it has operated for more than forty years. The development marks the first time that the museum has expanded beyond its original site in the former Georgia Pacific Aircraft plant in the city. “We are transforming the MFA into the city’s first large-scale museum dedicated to the visual arts and design,” said MFA director and CEO Kent Smith. “It will be a transformative facility that will spur", "The next Biennial should take place in 2021.\n\n\nThe University of California, Los Angeles (UCLA), has received a $100,000 donation from the Sacklers of the Honorable Charles and Cynthia Sackler, which was made in recognition of the museum’s dedication to supporting the growth of the Arts and the humanities. This gift follows a $100,000 gift from the Sacklers to the institution in 2017.“The donation by the Sacklers is a wonderful occasion to celebrate years of supporting artists and the Arts in the United States,” said UCLA Director and CEO Andrew Kreps. “The future of the museum and of the world’s greatest collection is now in the hands of the Sacklers. We are confident that their dedication will make UCLA a lasting icon in the making of art and the world.”In recognition of their extraordinary contributions to UCLA, the Sacklers are nominated for the Silver Lion at the Fifty-Ninth Venice Architecture Biennale and are the recipients of the three-year, ten-year, and twelve-year Laureateships at UCLA.\n\n\nThe Museum of Fine Arts (MFA) in Atlanta has received a $100,000 donation from Lewis and Donna Jordan, which comes", "The next Biennial should take place at the Art of the Deal in New York in 2021. \n\nThe San Francisco Museum of Modern Art (SFMoMA) has announced that it will not renew its contract with photographer Georges Apostu. The photographer, whose impressive body of work is of an epic scale, has been working with the institution for nineteen years. The partnership has been honored by the institution twice before, in 2010 and 2012. The first occasion was in 2012, during the opening of the Painted Desert Biennial. At the event, the museum presented the Philippe de la Peña-designed pavilion to Sebastien de la Peña. In the pavilion , the artist created “The End of All Things,” which was displayed for twenty-four hours in May 2015. The work, which was meticulously crafted from thousands of strips of Plexiglas\u0097the original canvas for the work was donated by artist Sebastien de la Peña\u0097was installed in the Fung Wah Museum, which is slated to open in the fall of 2020, and is currently on display at the Museum of Modern Art in New York.The next exhibition featuring Apache’s work will be at the Art", "The next Biennial should be held in the city in the spring of 2021. The next edition of the annual exhibition will be held at the Museum of Contemporary Art (MoCA) in Los Angeles, California, in the fall of 2021. The 2020 edition, entitled “Detour,” was held in January and featured work by forty-seven artists, including Amie Siegel, Ian Tung, Peter Lu, László Moholy, Alexi and Riccardo Cipolletta, and Agustín Pérez-Villar.\n\n\nThe Washington Art Gallery (WAP) in Washington, DC, has appointed Kate Halsey as its next director. Halsey joins the museum from the Museum of Contemporary Art (MoCA) in Los Angeles, where she has served as deputy director since April 2019. She will assume her new responsibilities in January 2020.“I’ve long admired Kate and am incredibly excited to be leading her in the next phase of her career,” said curator and board president Susanne Vielmetter. “I’m hopeful that she will continue to develop and extend the WAP’s rich legacy of contemporary art, while also expanding its collection and", "The next Biennial should be, as the organizers put it, a reproduction of the exhibition. The last one, “Resonating the Same Feelings,” was organized by the same organizers. “You cannot make a statement about art history, about the past, about the future, about the past—not with this kind of work,” Ari Konrath, the organizers’ artistic director, told the Art Newspaper.The next exhibition will feature works by fifty-one contemporary artists, including Paul Gauguin, Franz Kunsthaus Berlin, and Marcin Wojtas, among others, in the form of three-dimensional canvases. “It is… a very difficult choice,” Pablo Picasso told David Mitchell in a December 1936 interview for the New Yorker in response to the posterization of the artist’s work by the Italian carmaker Enzo Ferrari. The exhibition’s director, Henri Léger, said that the project is a “symbol of courage, of hope, of self-assertion, and of the possibility of art.” \n\n\nThe Miyagi Museum in Tokyo has acquired the works of James Turrell, a British artist best", "The next Biennial should, perhaps, be titled “For the Birds.”\n\nThe theme of this year’s exhibition—which was curated by collective artist Nari Ward and her sister and sister’s collaborator, the late Diller Scofidio + Renfro, and is on view through April 25—has been “The Future of Life on Earth.” Ward’s sculpture, titled Birds in Flight, is a multi-legged, mid-air hybrid of a flock of geese and a flying, porcine dinosaur. The work was commissioned by her sister and husband in the early 1980s to commemorate the duo’s founding work, a massive sculpture that became an icon for the Arts and a centerpiece of the Diwali celebration in May.“The Future of Life on Earth” is comprised of eight sections that are arranged in a manner that involves flight and the environment. The first section, titled Birds in Flight, is an ode to the ancient Hindu myth of the Avatars, birds that inhabited the earth in human form. The sculpture’s final section, titled The Mother of God, features a half-dozen skeletons, including the mother of God, and a series", "The next Biennial should be staged in September, 2020, and the first in June, 2021. \n“We are currently in the final stages of designing and implementing the Art of the House exhibitions, which will host the first show of the new collection\u0097and will soon introduce a series of new works, which can be found in the exhibition galleries,” Lucie Fusi, director of the Biennale d'Art et d’Organizations, told Dutch publication De Standaard. “The Art of the House is an amazing collection, composed of over thirty thousand drawings and painted works by internationally recognized artists, including Robert de Niro, Jack Palance, Ursula von Rydingsvard, Ursula von Humboldt, and Franz Klee, amongst others. The new exhibition will focus on the artists who have been most influenced by the collection, and on the innovations made by the artists with the gallery, which will take up the themes of God, the environment, and the natural world.”In an interview with De Standaard, Fusi said: “The collection has a strong and unique identity which is reflected in the provenance of the works. It is about to be inaug", "The next Biennial should take place in 2021.\n\nThe current exhibition, “The Art of Painting: An Exhibition of the Artists’ Owns Paintings,” will be staged in the Contemporary Art Museum St. Louis until March 6, 2020. Following the exhibition, the museum will stage a special exhibition of photographs that will run until April 21, 2020. “The Art of Painting” is organized in the following ways: The exhibition will include an introduction by John Giorno and will feature ninety photographs in chronological order. It will also feature a performance by the performative group Versailles Acrobatique.\n\n\n\n\n\nHannah Beaudry, a curator and educator at the Museum of Modern Art in New York, has announced that she is leaving the institution in March 2020. She will take up a new position at the Contemporary Art Museum in the spring of 2021.“I wish I had the opportunity to thank my colleagues, colleagues at the Museum of Modern Art, and colleagues in New York for their collaborative spirit and breadth of experience,” Beaudry, who has worked at the museum for more than twenty-five years, said in a statement. “I’ve been a member of", "The next Biennial should be in 2020. The Art Newspaper has reported that the event will be staged at the Foundation for Contemporary Art (FCA), New York, and will be led by director Victor DePalma. In future years, the word art’s “capacity to instill in the viewer a sense of belonging, a sense of belonging to a community, of a kind,” as well as the art of giving, will be part of the themes of the biennial.\n\n\nArt Basel Hong Kong announced today that the first edition of the Hong Kong pavilion at the fair will take place in March 2020 and will be held at the Hong Kong Convention and Exhibition Centre (HKCC). The event will mark the first time that the Singapore pavilion has been staged in Hong Kong since 2007. The 2018 edition of the fair, which was held in Melbourne last February, saw 70,000 visitors flock to the city for its first ever event in the city. “We are really excited to launch our online platform in Hong Kong and to share the art of this region with you,” said Deeplighters founder and CEO Frank Yip. “The project will be an interesting journey", "The next Biennial should take place in Tokyo in 2021 and the first in Disneyland in Florida in 2021. In a statement, the Biennials said: “We look forward to sharing more of our extraordinary collection with you in the near future. We hope you will continue to enjoy them as a source of inspiration and inspiration for the future generations. While many of the works in this exhibition have been completed by our many talented and dedicated curators, we are proud to present them to you in their entirety.”\n\n\nThe Tate’s board of directors has voted to allow the museum’s permanent collection to move to a new home in London in a historic vote that will further cement its relationship with the Royal Shakespeare Company (RSC). The decision follows a year of negotiations between the arts organization and the company’s management. “I firmly believe that the Tate cannot exist without the financial support of the RSC,” said Tate director Maria Balshaw. “I believe that this is the right moment to renew the RSC’s long-standing commitment to our new home in London. I am particularly proud to see that the new Tate has already committed more than $12 million to supporting the RSC’s", "The next Biennial should take place at the Rapid City Armory, which recently completed a $100,000 expansion, in August 2019. In the interim, the museum has launched an online exhibition series in collaboration with the Minnesota International Film Festival and the Minnesota Hip-Hop Summit.\n\n\nThe Museum of Modern Art (MoMA) in New York has named Hayley Bresciani as its next director. The appointment marks the first time the institution has hired the French artist since 2009. Bresciani, who will assume her post on June 10, is a former deputy director for exhibitions and director of curatorial affairs at MoMA.“Hayley brings a wealth of experience in arts and design, which we have long hoped would be an asset to the museum,” said David Mullen, director of the institution. “The MoMA Collection has enjoyed a remarkable renaissance, with new exhibitions, new stories, and new collections. The MoMA-CTC has recently added new stories and collections, and we are excited to see where she takes us next.”Bresciani’s new role was established in order to accelerate the museum’s plans to open a new wing of the museum, which currently houses the", "The next Biennial should prepare the final exhibition “For Love” (2019), which is based on a series of drawings by artist Clark Gable.\n\n\nThe museum in Bologna, Italy, has appointed João da Rosa as its next director. The seventy-nine-year-old Portuguese architect was selected by a committee led by the Italian prime minister, Dario Franceschini, for his visionary leadership of the museum. “I am delighted to take up the post of the Grandi Museo di Bologna,” da Rosa said. The appointment marks the first time that da Rosa has been chosen to lead a major Italian institution since he began his career in the 1960s. In a statement, da Rosa said: “The Grandi Museo di Bologna is an extraordinary structure, endowed with the power to organize and stimulate the imagination of visitors for twenty-four hours a day. It is very important for me to establish a long-term relationship with the staff at the museum. I am very confident that this will be the case with the public. The museum will be an indispensable institution for generations to come.”Since its founding in 1983 by collector Sandro Mollino, the museum has", "The next Biennial should take place sometime this fall, the organizers said. The 2020 edition will take place at the Museum of the City of New York, which is currently undergoing a $1 billion expansion. The exhibit, which will include works by artists from fifty countries, will be staged at the museum as part of the redevelopment of the museum’s former space in the Hudson Yards development project.The redevelopment of the former site of the City Museum of Art, which was completed in 1999, has been controversial. The museum, which has had a permanent presence in the arts district since 1946, objected to the redevelopment plan, which would have seen the demolition of the institution’s former garden, and was ultimately forced to settle for a deal that preserved the building and the adjoining land.The museum, which has three other locations in Queens: the museum on Bush Street, and the Museum of Modern Art (MoMA), has struggled to gain audience in recent years. “We are thrilled to present artists at the Museum of Modern Art through an exhibition that represents the spirit of New York City,” said Mark Stoeckel, director of the Museum of Modern Art. The museum will be hosting seventy-two works by seventy-four artists in the fall.", "The next Biennial should be held at the Museum of Modern Art in New York sometime in the next two months.  The biennial is currently putatively on hold since there are no immediate plans to move the exhibition, which was scheduled to open in March, prefecturally. The exhibition will resume in June with a new collection of works by the late Russian director Olga Akhmatova, which will be based in St. Petersburg, near the Russian embassy.The plan was first announced in March 2014, when the biennial was temporarily shut down due to the Covid-19 pandemic. The exhibition, “Analogue: The World as Work and Play,” opened on September 7, 2020 and ran through September 23, 2020. \n\n\n\n\n\nSeth Rogan, who served as director of the Solomon R. Guggenheim Museum in New York from 2009 to 2019, has announced he is leaving the institution in June. “As I head into the final stages of my tenure, I cannot imagine a better time to reflect on my long history at the Guggenheim,” said Rogan, who has served as director of the museum since 2011. “I look forward to the next chapter at", "The next Biennial should take place in the fall of 2020. The next edition will take place in Hong Kong and will be hosted by the Hong Kong art site Arts Hong Kong. Korean artists, known for their independence from mainland China, have also been receiving international acclaim. One hundred and twenty-six Korean artists have been nominated for the prestigious 10,000,000 won award, which is given in recognition of the artist’s contribution to Korean culture, and the Hong Kong pavilion will feature twenty-seven Korean artists. Curated by the South Korean artist Kim Eun-kyeong, the exhibition will be held in the KIM-JI Institute of Arts in Seoul and will run for fifteen days. Sik Joon-sung, the director of the KIM-JI Institute of Arts, said: “In the next Biennial the artists who exhibit their latest projects will have the opportunity to collaborate with the Hong Kong art scene. The exhibition will be a chance for the Hong Kong art community to meet and have a good time with the artists. We look forward to welcoming them to Seoul and working together with the Hong Kong artists.”\n\n\nRomain Bardet, the French curator who was imprisoned for nearly two", "The next Biennial should take place in 2019. The first time the museum hosted a major international exhibition was in the form of the Twelfth Biennial of Fine Arts, held in the same building in 2012.  In the same year London’s Tate Britain also received a £55 million grant from the government for its Bristol branch. The institution now expects to receive a further £100 million from the government for its London and South East branches. \n\n\nOn Saturday, the New York City Department of Cultural Affairs (DCLA) announced that it received a $176 million gift from the National Endowment for the Arts (NEA). The donation was part of the $1.1 trillion package passed by Congress on Thursday that will encourage the reinstallation of the National Endowment for the Arts in the city. The $48 million grant comes on top of $108 million allocated by the city for the 2019 fiscal year. The total sum for the city’s cultural sector is now $208 million.While the cavity is still recovering from the massive fire that broke out in a five-story, fifty-seven-unit apartment building in the Chelsea neighborhood of New York on December 16, 2017, the cultural", "The next Biennial should take place in 2021.The 28-acre campus is a former textile mill and warehouse complex that is located at 928 Fifth Avenue in Manhattan, and comprises three exhibition spaces, a library, an auditorium, and a bookstore. The project was launched in 2013 by collector Charles Saum, who also named the building after his late father, who was a textile titan. It is now led by architect Peter Zumthor and is funded by donations from John and Pilar Astudillo, the brothers who jointly own the technology company Argos, and the partner duo and the Koons Foundation. The sponsorship of the partnership comes amid an ongoing political crisis in Egypt following the military overthrow of Islamist President Mohamed Morsi in July of 2017. The ousting of the elected president led to the rise of the Freedom and Justice Party.\n\n\nThe Art Newspaper reports that the German government authorized the export of twenty-nine works by thirty-seven artists from the collection of the Berlin-based collector Heribert Dubrovnik, who passed away in Stuttgart on March 7. Dubrovnik had amassed the works through his association with Pritzker Prize–winning artist Georges Apostu and his former employee Wolfgang Noth. Dubrovnik was also", "The next Biennial should take place in 2020 and will include the work of more than seventy international artists from forty-six countries and territories.\n\n\nThe Museum of Fine Arts (MFA) in Boston has received a gift of twenty-two works by artist William Kentridge. The donation includes works dating back to the late Victorian era, as well as works created during the Victorian era and the Victorian era in the United Kingdom. Kentridge, who lived and worked in France before moving to England, gained access to the art through the institution’s holdings of works from the French and British eras.“William Kentridge is a singular and influential artist, whose artistic legacy is celebrated by all who have had the privilege to know him,” said Anne McManus, chair of the museum’s board of trustees. “Over the years, his work has been exhibited at the MFA, as well as at the Paris Club, the Atlantic triennial, and at the Contemporary Art Museum St. Louis. His works have been collected by the London Museum, the Royal Academy of Arts, the Tate, the Metropolitan Museum of Art, and the Bradford Museum of Art. His work is included in the public collections of the Tate, the University of Liverpool", "The next Biennial should be held in the spring of 2021.\n\n\nHelsinki–based artist Janina Laankulainen has won the Prix du Ville d'Arles (French Architecture Prize) for her conceptual installation—mostly architecture and architecture related works, but also landscape and landscape related paintings—whose works were exhibited at the Prix in 2018. The work, titled Fraternity, was created for the festival and is currently on display at the Museum of Fine Arts Paris (MOFA) in Paris.The artist is one of several artists who were awarded the Prix du Ville d'Arles in 2018, the inaugural edition of the prestigious American art prize, which was established in 1998 by businessman and philanthropist Jack Valenti. Previous winners include Pablo Picasso, Claude Monet, and Mies van der Rohe.Laankulainen is the second artist to win the prestigious prize, which has been adapted by various institutions in recent years. In 2011, the institution staged an exhibition of works by young Finnish visual artists, including Teppo Nukkala and Ville Østfjäll, who were nominated for the prize.This year’s prize jury comprised Tino Alÿs, curator", "The next Biennial should take place in Shanghai in the spring of 2020. \n\n\n\n\n\nA group of artists, writers, musicians, and other cultural workers in the Philippines have formed a new organization to help the country recover from the coronavirus—a coronavirus that is spread by close contact—as well as other economic and health risks posed by the medication marigold, a drug made from the leaves of the opium poppy.“According to the World Health Organization (WHO), at least 155 people have died from the virus and thousands more are infected. In the past two years, we have been working toward launching a campaign to raise awareness about the importance of being safe at all times, educating the public about safe medical practices, and advocating for policies and programs that promote social justice, resilience, and access to health services,” said Naima Alavi, a cofounder of the Manila-based nonprofit group the Logistics Grouping Project (GLP). “Today, we are ecstatic to announce the endorsement of this new organization, which will organize events, education programs, and other activities with the support of local, regional, and national political leaders to help the people of the Philippines get back on their feet and stay healthy during this", "The next Biennial should be held in 2022. The Biennials are an international platform for the study and appreciation of African art, which began as an initiative of the Centenary Centenary Art Foundation in Dakar in 1964. The foundation’s chairman, Jean-Marc Ghebaly, said: “I’m thrilled to see this collection of works in the United States. The work of African artists is so important and influential. We have a duty to recognize what their contributions have been to our community and country, and to honor their contributions in some way.”\n\n\nThe Solomon R. Guggenheim Museum in New York has appointed Amara Dinan as its next executive director. Dinan comes to the institution from the Museum of Contemporary Art (MoCA), Los Angeles, where she has served as the deputy director of programs since 2015. Previously, she worked as the director of curatorial affairs at the Kohn Gallery in New York and as a curator at large institutions, including the Smithsonian American Art Museum in Washington, DC. In her new role, she will work closely with Tina Fabian, who has been head of the Guggenheim since 2017 and will assume her new responsibilities on September 5.", "The next Biennial should open in 2020 and will be hosted by the Smithsonian American Art Museum in Washington, DC. The museum will then be able to host the exhibition for free to the public. \n\n\n\n\n\nSean Kelly, known for his anarchic and often surrealist paintings, has died at age eighty-one. While at the Smithsonian American Art Museum in Washington, DC, Kelly was a core member of the “Foam Foundation,” a group of artists focused on social justice that mobilized to address institutional racism and environmental concerns. In addition to exhibiting his work at the museum, which opened in 1962 and moved to its current home in 2009, Kelly also ran a two-person show, “Sensual Dolls: Art in the Age of AIDS,” at the museum in 1995–96 and taught at Columbia University.Born in New York City in 1948, Kelly moved to Philadelphia in 1957 to study with painter James Mather. The pair then married in a civil ceremony at St. Andrew Parish Church in 1977 and had two children, Sean and Sean Jr. Kelly then went on to study at the Art Institute of Chicago, where he met and married music producer Diana Mather. The couple moved to Los Angeles, where Kelly met", "The next Biennial should begin on March 21 and will then run for nine months. For the past two years, the Museum of Contemporary Art (MoCA) in New York has hosted the annual event, which features work by seventy artists and is curated by an eclectic group of curators that includes Lewis Black, Maria C. Alemani, and Yoko Taro. The 2019 date was chosen because of the steps the Biennial takes to determine its theme. The theme is “The Body and Language of Human Experience” and is credited to Deborah Benjamin, Alexandra Boyer, Shannon Black, Carol A. Fox, Kate Bush, Susan Carney, and Donna Eliezer. The project was originally announced in January 2018 and worked its way through various curators over the next two years. “The Body and Language of Human Experience” is a memoir of her experiences as the first woman to lead the Museum of Contemporary Art in New York and the first African American curator at the institution. The work will be organized as a “history of art” of the museum and will feature reflections on her new role as curator and a selection of works by the artists who inspired her to continue her work.“", "The next Biennial should take place in the spring of 2021, and the final edition in the autumn twenty-two years later. The full list of artists whose works will be featured in the biennial’s new incarnation is as follows: Hiromi Yamanashi (Japan)Dia Yu (China)Eugene Ma (Japan)Artsy Gates (United States)Hiromi Yamanashi (Japan)Jiro Horikoshi (Japan)Nao Hasegawa (Japan)Amara Bentel (United States)Alberto Celant (France)Marcia Clarke (Canada)Hiromi Yamanashi (Japan)Yasmina Farquharson (United States)Nada Farquharson (Canada)Linda Frank (United States)Laura Frank (Germany)Minga Frank (Germany)Nina Frank (Hungary) Maria Fraiche (Germany)Peter Galderisi (Italy)José Pedro García (Mexico)Stefan Günther (Germany)Alejandro González (Spain)Nicola Gay (United States)Yasmina Farquharson (Italy)Casper Grand (Switzerland)Bénédicte G", "The next Biennial should be announced in the first quarter of the year, with the first exhibition, “Bermuda,” scheduled for November 25–December 8. The biennial will be inaugurated by a survey of Cuban American art at the National Museum of American Art, curated by the artist María Berrío, which will be followed by an exhibition of work on paper from the collection of the Miami-based artist Hélio Pérez.\n\n\nThe Los Angeles County Museum of Art (LACMA) has received a gift of around one hundred rare works by American painter P.G. Wodehouse, who died in 1996. The gift includes works dating back to the late 1940s and early 1950s, and is the largest collection of his work to date. He is also survived by his daughter, Carolyn; his son, Michael; and his grandson, Gavin.“The LACMA collection is emblematic of the extraordinary cultural life of Los Angeles County. It is a comprehensive collection of the artist’s most important works, which are assembled into an exceptional exhibition format, with the artist’s drawings and collages presented as an integral part of the program,” said Craig Dunn, the museum", "The next Biennial should be held in New York next March and will invite a new generation of artists to carry out its project, “the date of the next Biennial is the theme of the twenty-fifth Biennial, ‘2016.”It will also present a new collection of works by artists from the twenty-third through the twenty-fourth biennials, “The Dilemma of the Radical,” and will feature new works by visiting artists from the fourteenth biennial. The biennial’s production staff will remain the same, with one exception: Juliette Goguen, director of the new prize exhibition, “The Dilemma of Artists.” Inaugurating the new prize show will be a doubling of the prize for the artist who has “the most original, radical, or important representation of a work in the exhibition.”\n\n\nThe Whitney Museum of American Art in New York has appointed John Palmiotti as its next director. The Whitney moved from its current headquarters in the City of New York to its new home in the Roosevelt Hotel in December. The announcement of Palmiotti’s appointment follows the February 27 announcement that the Whitney will", "The next Biennial should be the one to mark the centenary of the end of World War II. The exhibition will feature works that reflect on the past and present and will be inaugurated by a new collection of drawings by Mark Halperin and will feature works by Judith and Cortés. The exhibition also includes a selection of drawings by Pierre-Auguste Renoir, the French painter known for his surrealist works, and by Cécile B. Anderson, the American artist best known for transforming her work into a self-portrait, which was last seen in the exhibition “The Struggle of the Soul.”The rest of the biennial will be dedicated to the early work of the late British artist John Aldridge, whose work is currently on display in the gallery’s new West London location, the Holburne Gallery, as part of a series called “Visions of a Gerson.” This exhibition is part of a campaign by a group of British artists to raise more than $2 million to establish a special exhibition space in the West Indies to represent the British-born artist’s work, which is represented in many countries. The exhibition will also feature a selection of photographs by the late French artist Jean", "The next Biennial should begin as soon as possible. We are working hard to secure the funding to bring you the exhibition of the exhibition as soon as possible. We are grateful to all who have supported us throughout this challenging and critical period.\n\n\nThe Jackson Pollock Foundation (J.P.F.): Established by Jackson Pollock in honor of his life and work, the foundation has awarded $13 million to eighty-five artists across forty-eight states. The Fitzwilliams and the Fitzwilliams Foundation each have received $5 million since it began in 1996. The fifty-six-year-old foundation is one of the largest contributors to the Jackson Pollock Memorial fund. It is also responsible for supporting Jackson Pollock’s works in the United States. The foundation will deliver $4.6 million to support the The Elephant Man, 2019, which is currently on view in New York. The art will be on display in the museum’s exhibition hall for thirty days. Jackson Pollock’s The Elephant Man, 1967, (1947–72) is also currently on view. The work presents the artist’s first survey of", "The next Biennial should be held sometime in the second half of 2021. \n\n\nThe National Gallery of Canada has announced that it plans to abandon a planned expansion in order to focus on the health, well-being, and sustainability of the environment, particularly in its collection. The move has been made in the interest of expediency, as it will no longer be able to add more galleries in the three existing buildings when the three-building expansion, completed in 2017, is completed in 2021.The National Gallery of Canada will also begin to transition to a new 25,000-square-foot space in its downtown Ottawa building. In a statement, the institution said: “The first phase of the National Gallery of Canada’s expansion, ‘Phase 1,’ aims to improve the collection’s exhibition spaces, improve accessibility, and maximize the museum’s ability to serve the diverse communities of Canada. The second phase, ‘2,” aims to improve sustainability through the conservation of materials, and to raise awareness of the museum’s commitment to engaging with issues and issues only, and to fostering the work of young and emerging artists.” \n\n\nThe Toni Morrison Foundation has issued a $500,000", "The next Biennial should be held in 2020, and the last in 2022.The decision to cancel the exhibition came after a dispute erupted between the Beijing-based independent curator Qian and the Contemporary Beijing Art Museum (CCAM) over how the institution handled the tender tender. The dispute led to a setback for the show which was scheduled to run from March 29 to March 31. While the exhibition was supposed to focus on art from the Beijing- and Shanghai-based scenes, the exhibition was pushed back because of the crisis. The biennial was rescheduled for March 31, 2020 but CCAM had already announced that it would stage a second edition of the exhibition in 2022. After the controversy over the exhibition, the Chinese authorities detained the artist Cao Shaohua for making a public statement critical of the exhibition. The cancellation of the show was made after scientists at the Beijing Academy of Fine Arts (BFA) received a letter from the Nanjing-based advocacy group the China Textbook Center for Art History and Art Studies, which urged the exhibition to cancel the exhibition as a violation of the country’s art reform laws. According to the advocacy group, the exhibition is violating the Basic Law’s prohibition on the exhibition of works", "The next Biennial should be targeted for 2021 and is currently being presented by the Helsinki Art Museum. The exhibition is a follow-up to the acclaimed exhibition “The Art of the Life,” which was staged in September 2018 and was the first of its kind in Europe.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, has named Julianne Bell, the former director of the Boston Art Museum, as its next director. Bell will be responsible for the health and well-being of the museum’s iconic collection, which is the largest collection of nineteenth-century American art in the United States. She succeeds Lauren Wahlen, who has served as director of MoCA since 2015, and will begin her tenure on January 6, 2021.“For nearly fifty years, Julianne has been instrumental in transforming the Boston Art Museum into a truly remarkable organization,” said Elizabeth Lehman, director of the institution. “With her vision and energy, she has built the museum into a truly remarkable institution for which we can be proud of the work that she has done.”In 2015, the museum awarded the National Medal of Arts to five artists for their achievements, including H. G. Wells, Thomas Edison, and Bob", "The next Biennial should be held in 2021, the time of the Sixteenth Congress of the Russian Academy of Arts. The artists whose works are scheduled to be featured in the inaugural exhibition are Yuriy Solovy, Aleksandr Lyubomirsky, Mikhail Chigy, Vladimir Golikov, and Kiki Smith. The strategy behind the plan is to present artists in unique ways in order to instil the spirit of solidarity among the institutions participating. According to the Art Newspaper, the first sculpture for the forthcoming exhibition will be an adaptation of a Russian fairy tale by Yevgeny Primakov titled The Sleeping Princess. The works will be accompanied by music by the artist Marian Gaborova and will be installed in conjunction with the one-hundredth anniversary celebrations of the Red Army. \n\n\nThe first major exhibition dedicated to feminist artists in São Paulo and Rio de Janeiro was officially launched by the Brazilian government on Tuesday, October 29, with the launch of a $1 billion fund intended to advance the careers of Brazilian feminists. The $1.3 billion fund, which also aims to create jobs, addresses a number of pressing issues, including the country’s sexual violence epidemic, the gender pay gap and the gender", "The next Biennial should showcase the work of the entire ten-member team; including the artists and their collaborators, the curator, and the director, which was the theme of the inaugural special edition, “The Laundromat Life of a Working Girl.”The 2018 edition, “The Grand Convenience Store,” was staged at the studio of Minna Tan, the widow of the late Korean architect Kang Kang, who designed the modernist Grand Convenience Store in Seoul, and was presented by the museum. The exhibition ran for ninety days and featured work by seventy-five artists, including Kang Kyeong-kyung, Lee I-Chan, Lee Gyu-kyan, Kim Eun-sung, Kim Ji Guk-kyung, Kim Jae-yong, Lee Seo-kyoung, Lee Hyo-sung, Lee Dong-kyung, Lee Eun-sung, Lee Tae-kyung, Lee Tae-kyu, Lee Young-suk, Lee Eun-sung, Lee Hyo-suk, Lee Seo-kyu, Lee Young-suk, Lee Eun-seo, Lee Eun-sung, Lee G", "The next Biennial should be this June, according to the organizers.\n\n\nTom Tom's Japanese mural, Tampopo, 2019, in the Japanese cultural capital of Nagoya. The work, a reconstruction of the cityscape around the Church of the Nativity, was exhibited in the exhibition “Lūshū no Kōdō (The World is a Picture),” which opened on March 30.The first edition of the exhibition, titled “Tom Tom Tom,” was held in the former designer’s home in the Minami-Nagoya area of Tokyo, where the artist lived and worked during the early 1950s. This edition, organized by the MVRD Gallery in Nagoya, was presented in partnership with the Nagoya Museum of Art.“Tom Tom,” which depicts a Japanese artist who has created a work about his childhood and his childhoods, is considered to be one of the most influential paintings of postwar Japanese art. The work, which was made in the late ’50s and early ’70s, has since been featured in numerous biennial exhibitions and is currently on view at the Tokyo Art Museum from May 29 to May 31.“I am thrilled to", "The next Biennial should take place at the Museum of Modern Art in New York from February 21 to March 2, 2020.\n\n\nThe Cambodian artist and activist Hoa Phuc, who championed the rights of artists and activists through actions such as his famous \"33 drawings\" series, has died at age ninety-nine at the Cambodian Embassy in Bangkok from complications related to the pandemic.Born in 1958 in Phnom Penh, Cambodia, Phuc studied at the University of Michigan before gaining recognition in the 1965 Chinese-American Artists' Biennial. He continued his art practice after the war, working with friends in the United States and Europe, including Artur Huyghe, Pierre Labrada, and Jean-Michel Basquiat. Phuc became a member of the French-Korean Cultural Center, ran for president in 1972, and served as president from 1981 to 1983.In 1983, the Cambodian government collapsed, giving rise to a new, autocratic regime led by Hun Sen. The artist, who often clashed with Sen, eventually fled to Thailand, where he died in a Thai prison in 1991. In a 2012 retrospective at the Khmer Arts Museum, Phuc was honored with a lifetime achievement award. He was also established", "The next Biennial should take place in 2021.”\n\n\nThe Mexico City Art Museum (CIMAM) has been designated as the new site for an upcoming exhibition of works by the Los Angeles–based artist Hector Barrio. The exhibition, titled “HELEN BARROÑS: LIVE OR NOVUS,” will be on view until January 3, 2021. The work, which is part of her multi-year series “Barreros Live or Die,” will have a retrospective at the museum in 2018 and will be presented in a film-based installation at a different location in 2016. Barrio’s work will also be included in the upcoming “Theater of Operations: The Gulf Wars 1991–2011” at the Palazzo Bechamo, which will open in 2020. The exhibition will be followed by a solo exhibition of the artist’s work at the CIMAM in early 2020.Commenting on their selection of Barrio’s work, curator Alejandro Díaz-Perez, who curated the project, said: “This is an exhibition that will allow the museum to present the work of an artist whose work is at once urgent and grounded", "The next Biennial should be held in 2022 and will also include a selection of works on paper. The design of the show will be inspired by the exhibition of paintings by the same name in the United States in the late 1950s and 1960s. “We are in the process of designing a new exhibition that will reflect the Biennial’s ethos,” said Yuki Kim, director of the exhibition.The show will be housed at the new Museum of Arts and Architecture (MAK), an extension of the Museum of Modern Art in New York, New York. Since it opened in 2015, the museum has hosted more than ninety thousand visitors.MAK also announced the launch of a new digital platform, MALDI.Artists are invited to apply for this year’s exhibition, which will be produced by the Shanghai-based collective Gallery 2.“This year’s exhibition will be inspired by the exhibition of paintings by the same name in the United States in the late 1950s and 1960s,” said artist and curator Hao Jing. While the works will not be as visually arresting as previous years, they will adapt to the audience’s needs and will be constructed using a variety of methods, including commissioned", "The next Biennial should take place in 2021, in the meantime, Artforum will present you the latest news & reviews about the exhibition.\n\n\nThe Criterion Collection in New York has welcomed Conchita Wurst to its team as assistant curator of contemporary art. She will be responsible for adding depth and breadth to the collection’s global practice and will take up her new post on January 6, 2020. Previously, Wurst worked as an associate curator at the Museum of Modern Art, where she curated “Here There Be Monsters,” 2017, and worked as an adjunct art historian at the Philadelphia Museum of Art.“I’m excited to welcome Conchita to the team at the Criterion Collection,” said Cindy Crawford, director of the collection. “Conchita’s expertise, dedication, and enthusiasm for the collection make her an ideal fit for this role. She’ll also bring a fresh and distinct perspective to the curation process, which is essential for a contemporary collection whose mission is to create a shared global history through art.”Wurst will begin her post at the collection by visiting the works of fifteen artists a year\u0097including Zina Saro-Wiwa, ", "The next Biennial should be held in 2021. \n\n\nThe Yale Center for British Art (YCBA) announced today that it is planning to open a new seventy-six-thousand-square-foot, 5,800-work museum in Downtown Detroit next year. The institution will be located on Woodward Avenue, and will host more than one thousand exhibits a year.The institution will be funded entirely by the Henry Luce Foundation, with funds from the Metropolitan Museum of Art, the Hirshhorn Museum, and the Georgia Museum of Art on a sliding basis, and will employ more than sixty-one people. The museum is also expected to draw tens of thousands of visitors annually.The show will be organized in a way that will allow visitors to experience the exhibition in its entirety. The museum will have multiple levels, including a gallery, a lecture hall, a museum shop, and a café. The show will also feature original works and clay sculptures created by artists in the show.“Since its opening in 1978, the Henry Luce Foundation has supported the building of more than sixty thousand works by thirty-six British and American artists, which has made the Henry Luce Museum of Art a leading institution in the United States,” said Elizabeth Adams", "The next Biennial should be held in the fourth quarter of 2021. Tia Kitsugawa, director of the São Paulo Biennial, told the Art Newspaper: “The biennial is not just an exhibition, it is an artistic project. The exhibition is not the essence of the event, but a bridge between the various performances, each of them a reflection of the current moment.” The 2020 edition of the exhibition, “Mòria de Palma,” opened at the Museo do Povo in São Paulo on February 12 and ran until March 15. \n\n\nThe Museum of Contemporary Art (MCA) in Chicago, which has been working toward renovating its landmark institution, the Walker Art Center, for the last eight years, is about to enter a new phase that will involve the construction of a new wing of the museum. The site will be transformed into the new MCA’s first permanent exhibition space, “The Museum of Contemporary Art: The Untold Story,” which will be inaugurated by a survey of works by contemporary artists. Dubbed “The Museum of Contemporary Art: The Untold Story,” the exhibition will explore the legacy of co-found", "The next Biennial should be held in 2021, but the project’s organizers have said that it will not be ready until 2024. On its development, the museum said that it “will continue to expand the exhibition to reflect the broad range of exhibitions that are currently on view in the institution’s collection.”The exhibition was inaugurated by pioneering American painter Russell Grant, who gave a presentation of works by contemporary artists in the exhibition, which was organized as part of the museum’s new partnership with the National Gallery of Art. Its inaugural edition featured artworks by Pierre-Auguste Renoir, Pierre-Auguste Strébault, Robert Irwin, and Miro Ozturk, among others, and will be re-envisioned by Carson Chase in the new exhibition. The re-creation of the Biennial will mark the museum’s twentieth anniversary. \n\n\nFrieze announced today the twenty-two artists who receive its annual award, which is given annually to an artist who has exhibited at the twelve-year biennial Frieze New York, and will curate the second edition of the event, which will take place at the Museum of Modern Art, in 2021.The artists are Lev Leviev,"]