["The next Biennial should be held sometime next year. The exhibition will feature works by artists based in all corners of the globe. Among the artists that will feature in the exhibition are artists representing countries such as Australia, Belgium, Brazil, Canada, and Germany. The first half of the exhibition will be devoted to work by Mona Hatoum, who lives and works in New York, and will be held at the Brooklyn Museum in New York from March 7 to March 12. The latter half of the exhibition will be presented as part of the artist’s exhibition at the Amsterdam Biennial in May.Artists working in the United States include Joel & Ethan Showalter, Cliff Felty, and Diane Arbus. The exhibition will draw from the collections of the Metropolitan Museum of Art, the Museum of Modern Art, and the Los Angeles County Museum of Art.The exhibition will also examine California’s image as an emerging global cultural destination. The theme of “California: Rising Star of the 21st Century,” and the exhibition’s accompanying program of photography, video, and installations, will be “California, 1971–2010” and will be curated by Alex Hirschhorn.", "The next Biennial should take place in 2024. If we do not, the exhibition will be canceled and the event will be postponed. Whether you are a regular visitor to the museum or not, you are invited to continue participating in the biennial.\n\n\nThe New York Public Library is launching a new online platform, called the Biennial Archive, that will provide archival collections from the biennial exhibitions in its entirety. The platform will be in two parts: a public site where visitors can view the exhibitions as a whole and a private collection where individuals and organizations can upload works for free.The platform will initially have approximately twenty thousand works available for public viewing, but will expand its scope by adding new exhibitions, talks, and other programming. It will also be able to catalogue works from the exhibition spaces in which the biennials will be held, with the goal of making them accessible for scholars and the general public.The platform will first host a workshop series on the exhibition space model in which a curator will guide an audience through the exhibition process from the perspective of a single practitioner. The biennial will then present a new exhibition, a major retrospective, or both. The curator will create a series of talks that address a range of themes. The platform will also incorporate", "The next Biennial should take place in New York in 2021 and will be hosted by the University of Chicago.\n\n\nThe Museum of Modern Art (MoMA) in New York announced today that it has retained its head of contemporary art and director of exhibitions Anne-Marie Olschbaur and will reprise its role in the years to come. During a press conference at the institution, the museum also confirmed the permanent exhibition of six new works by the artist Allison Campbell, who died earlier this year, as well as the opening of the Museum of Modern Art (MoMA) “Human Spaces” exhibition, which will run from March 21 to March 28, 2020.“We are thrilled to be bringing our newest exhibition to the Museum of Modern Art, ‘Human Spaces’ in 2020,” said Olschbaur. “The work of these six artists will engage audiences across the globe and will serve as a powerful reminder of the critical role art plays in bringing about social change.”The exhibition will feature works by twenty-eight artists, including Adrienne Atget (Copenhagen, Denmark), Felix Brätsch (Berlin, Germany), Konrad Fischer (New York), and Peter Doig", "The next Biennial should determine the boundaries of the exhibition space, which is currently being developed on the grounds of the Museum of Contemporary Art, Detroit. The exhibition will focus on a selection of works from the collection, which was amassed over the course of twenty-two years, in order to explore the history of contemporary art and its relationship to contemporary life. This exhibition will be open to the public from January 3 through February 9, 2020.This year’s event will be held at the Museum of Modern Art (MoMA), in New York, and will feature forty-six works by fifty-eight artists, including James Turrell, Avital Ronell, Richard Serra, and Kiki Smith, and will feature a selection of work by the artist-in-residence, Nikhil Pal Singh, as well as the artist-in-residence of the next year, Caroline Baumann.Advancements in technology have made it possible to create works that appear to blur the lines between reality and digital constructs. The artist-in-residence, Ronell, who is known for creating works that appear to be the products of simulations and virtual worlds, has recreated scenes from his childhood in which he plays with computer", "The next Biennial should take place in 2020. The exhibition is being organized by the Keller Gallery, which is cofounded by independent curator, artist, and art historian Angelika Keller, and her husband, Patrick Keller. The institution will also be housed in the new building of the Keller Museum of Art in New York.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, has appointed John Lehr as its next director. Lehr takes the helm from former director Adam D. Weinberg, who was hired by MoCA in February 2018 to lead the arts space. He succeeds Anna Wintour, who retired in February after a decade at the helm of the museum.“We are thrilled to welcome John to the team and to celebrate his ten-year tenure with MoCA with a day celebrating MoCA’s history and legacy,” said MoCA director Diego Castells. “Working with John, who is known for his innovative thinking, his passion for art and his deep understanding of the wonderful world of contemporary art, we believe this is the moment to truly honor our past. MoCA’s future is bright and his vision for the future will be a great encouragement to other young and established directors looking to carve out new", "The next Biennial should be held at the Helsinki International Film Festival (FIFI) from January 24 to February 28, 2020. “Previously, the criteria for a biennial have been: a mix of film and art from the same country, a collaboration of filmmakers in different countries, a truly international spirit, and a documentary approach,” said festival director Martti Sähtila. “We have now listened to the voices of both audiences and have made the decision to expand the architecture of our future event to include films from the different corners of the globe.”The exhibition “Get Out,” which premiered at the Venice Film Festival in May 2019 and is currently on view at the San Diego Museum of Art, will be hosted by the Helsinki Art Museum, the new venue of the Helsinki Film Festival. Helsinki and the Helsinki Regional Public Library will jointly organize the exhibition. Further details about the project will be made available in the months to come.Commenting on the exhibition, Museums Finland and Pirelli have said that the two Helsinki institutions will collaborate in the exhibition and will have a booth at the event. Pirelli’s representatives will be in attendance at the Helsinki Film Festival and Helsinki Regional Public Library.\n\n", "The next Biennial should involve a combination of performance, lectures, lectures, and handouts. Its most recent iteration, titled “Elements of Art” in collaboration with director Ralph Waldo, was staged in 1992.\n\n\nThe New York City Department of Cultural Affairs (DCLA) announced today that it has awarded $1.6 million in grants to eighty arts organizations across the city. The grants, which are tied to the city’s “Gether Museum of Art” and the Bronx Museum of the Arts, have convened smaller institutions to form the nucleus of the city’s arts district. Participants in the roundtable, which ran from October 11 through November 6, are the Bronx Museum of the Arts (BMO), the Bronx Museum of the Arts (BMO), the Bronx Museum of the Queer (BMO-Queer), the Museum of the Moving Image (MoMA), the Museum of Modern Art (MoMA), and the Museum of Modern Art (MoMA-MOM), home to the works of Jean-Michel Basquiat, David Sedgwick, and Virginia Woolf.The eighty-one organizations eligible for the grants, which are based in ninety-five Bronx borough", "The next Biennial should be held at the National Museum of Denmark in Copenhagen on 15 January 2020. The Danish pavilion will be chosen by a committee comprising Marianne Brugdahl, executive director of the Danish Contemporary Art Museum Østby, and Christian Sæk, director of the Bulgarian Pavilion at the Venice Biennale.The next exhibition will be dedicated to the history of Balkan art, featuring work by artists from Serbia, Montenegro, and Romania. The selection of artists and other works in this exhibition will be based on their excellence and their achievements during the twenty-two-month period immediately preceding its opening.The Danish pavilion was selected through a competition organized by the National Museum of Denmark, of which it was a member, and the National Museum Stuttgart. The exhibition will continue to be organized by the Danish Ministry of Culture and will be presented by CAA here in collaboration with the Danish director Lars Nykvist. Representatives of the country’s cultural and artistic institutions also selected seven other artists for their pavilions. The ten finalists will be announced in January 2020. The four artists chosen for the prize are Kaj Haraldsen, Harald Sæk, Harald Uwe Hämmery,", "The next Biennial should be in December 2020 on the occasion of the 120th anniversary of the Battle of the Somme.  The theme for the 2020 edition will be “Onwards, Forward, Forever.” The exhibition will be curated by an intergenerational group of artists including Oliver Hove, Richard Esterson, Joao Pires, Ingemar Borges, and Aide Stillett. The Biennials will also feature the first exhibitions dedicated to the African diaspora and the first digital encyclopedic exhibitions in the history of Western Europe. The 2020 exhibition schedule:May 25–June 13, 2020May 28–May 29, 2020May 21–May 26, 2020May 26–June 1, 2020May 29, 2020May 3–May 5, 2020May 30–May 3, 2020May 6–May 10, 2020May 3–May 7, 2020May 28, 2020May 29, 2020May 31, 2020June 1, 2020, 2020September 14, 2020September 15, 2020September 22, 2020September 23, 2020September 26, 2020September 28, 202011 May 2019, 2020.Artforum has announced its list of participating artists for the tenth edition of Artforum:“The", "The next Biennial should be held in 2021.\n\nThe San Francisco Museum of Modern Art (SFMoMA) has launched a $1 billion fundraising campaign to fix its debt. Last year, the institution received $10 million from the City of San Francisco for its debt restructuring. The funds were used to restructure the institution’s debt by consolidating its various operations into one entity and by refinancing the institution’s existing debt, which is currently at $35 million.Since the restructure only partially addressed the structural issues that caused SFMoMA’s debt to skyrocket in the first place, the center’s board of directors announced that it will continue to operate as part of the new corporate partnership structure announced last month. The announcement of the new partnership structure, which allows SFMoMA to remain open while it refinances its debt, has delayed its planned reopening date by two years. According to the San Francisco Chronicle, the museum anticipates continuing to pay its employees through the end of the year.In a letter to employees submitted to the board of directors, executive director Rebecca Brown wrote: “We are confident that, in light of the restructuring, we will be able to reopen as planned in October 2021. We are", "The next Biennial should take place in San Francisco in 2021. The selection committee was established by the city of San Francisco and the Biennial Board to lead the construction of a new and improved iteration of the festival.  The upcoming iteration of the Biennial will include a number of new works by artists and will take place in the Bay Area’s Silicon Valley, a venue selected by the city of San Francisco as a gathering space.\n\n\n\n\n\nThe Museum of Fine Arts (MFA) in Boston recently acquired the first works of American artist Nelson Bentley, who fused photography, drawing, and sculptural forms into an experimental multimedia installation called the Sinking of the Swan. The work, which was created in 1965 and 1965 was the last of its kind to be exhibited in the United States. It was displayed in Bentley’s first solo exhibition at the museum in 1973. The exhibition was followed by four other exhibitions at the museum in the 1980s and ’90s.“Nelson Bentley has been a transformative artist, whose work has shaped the way we think about photography, photography objects, and photography history,” said Museum director Arno Pfeifer. “His art, his photography, and photography history speak to", "The next Biennial should be held in early 2021 and should be hosted by the University of Central Florida. “The Biennial was established to draw attention to the biases, injustices, and excesses of contemporary art and the impact of global climate change,” said Ethan Sherwood, director and CEO of the biennial. “We have a responsibility to address the biennial’s discursive content and to organize exhibitions that reflect the full range of its contents. This year’s exhibition ‘The Fuck Show’s’s’ exclusion of women, people of color, and the LGBTQ community is absurd and offensive. We will continue to present exhibitions that reflect the work of the most visionary and most important artists of our time and we welcome your suggestions, criticisms, and requests.”The biennial will take up themes such as the interrogations of art history and the work of artists such as Pierre-Auguste Renoir and Diane Arbus, whose work is frequently honored at the biennial, which is supported by the Jack and Diane Arbus Foundation.\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is planning to remove three works by Richard Serra—a black-and-", "The next Biennial should be held in 2021. The first one, “Beyond the Exact Same ,” was held in 1967. The Biennial of the Americas will be held in 2020, in Buenos Aires.\n\n\nThe Smithsonian Art Museum in Washington, DC, has released the twenty-six artists who were selected by an international jury for its annual Artist Incentive Award. The fellows are selected by a panel of judges, led by Michael T. Ward of the Los Angeles County Museum of Art, and include Andy Serkis, Jillian McManemin, and John Paul Jones. Their works will be exhibited in the museum’s Toledo, Ohio, exhibition, “The Inner Life of John Lennon” in 2021.Dubbed the “Ear and Eye” award, which honors a visual artist who has demonstrated an enduring commitment to the field of African American art, the ceremony was held at the African American Museum in Minneapolis last week. The award\u0097which was established in 2015 to honor the late civil rights leader Jesse James \"Buddy\" Love, who was black\u0097was created as a way to honor and celebrate the work of artists of African descent. The winners were chosen by a jury", "The next Biennial should begin in 2022 and be hosted by the University of Southern California, Los Angeles. The show will also include a redesign of the Museum of Modern Art in New York. Artforum will have more details about the redesign, which is scheduled to be completed by the end of 2020.\n\n\nThe Art Newspaper reports that the Chinese government approved a new law on Monday that will restrict the activities of foreign artists and forces in China. It stipulates that certain cultural institutions such as museums and schools, and some theaters must suspend or cancel new projects or exhibitions as a condition of receiving state funding. The legislation states that certain works and performances that are scheduled or have been created in China may not be exhibited, performed, distributed, or performed in Hong Kong or Taiwan. Exceptions will be made for artworks or performances that are essential to national security or public health.Also subject to the new regulations are performances and performances-related works such as films, video and photographs, and photographs and drawings. The law states that a painting, sculpture, print, or installation may be scrapped or rearranged as necessary to protect national security or public health. The restrictions will apply to all levels of government, including the provincial and municipal governments, and will go into", "The next Biennial should take place sometime in 2019.\n  Thinking about it now, I can see how her relation with Mr. Newman would have been different. I think he would have been more cautious about her, perhaps about her role and her abilities, and would have had to work harder to protect her. I hope, however, that she would have been able to make a difference.I wish she had been there when I was growing up. I wish she had been there when I went through my first breakup. I wish she had been there when I was growing up. I wish she had been there when I became a father. I wish she had been there when I became a mother. I wish she had been there when I was growing up.I wish she had been there when I was growing up.I wish she had been there when I was growing up.I wish she had been there when I was growing up.I wish she had been there when I was growing up. I wish she had been there when I was growing up.I wish she had been there when I was growing up. I wish she had been there when I was growing up.I wish she had been there when I was growing up.I wish she had been", "The next Biennial should be held in September 2020. “The next one will be a true reflection of the identity of the city, a celebration of the city’s rich culture and of the people of New York,” James W. Boyce, president of the New York City Art Museum, said in a statement. Boyce added that the museum is committed to continuing to present the city’s art to the best of its ability. The institution recently marked the six-thousandth anniversary of its opening, and it is the only major U.S. institution to host the works of artists such as Pierre-Auguste Renoir, Jean-Michel Basquiat, and Pablo Picasso.\n\n\nThe A-Frame Foundation, a New York–based nonprofit that provides creative and technical assistance to artists and small and mid-size galleries in New York City, has established a new $1 million award for the negative-slip artists who have made significant contributions to the preservation and promotion of contemporary art.The organization was inspired to create the award following the recent wave of Covid-19-related cancellations and relocations across the United States, which have assumed a variety of forms, including crowding, overcrowding", "The next Biennial should be held in 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in New York has appointed Harvey Schwartz, a curator and educator who has taught at the institution since 1981, as its next director. Schwartz will assume his post on January 6, 2021. He succeeds Paul Mpagi Sepuya, who retired in April after a decade as director of the Metropolitan Museum of Art.“We are thrilled to welcome Harvey to MoCA,” said Richard Armstrong, chair of the board of trustees. “Harvey brings a unique and compelling perspective as a curator, strategist, and educator whose expertise has been recognized by the Met, the Art Institute of Chicago, and the Whitney Museum of American Art. We look forward to continuing to work with him as he takes up the post of director of MoCA, and to to welcoming his new colleagues in the next year.”Schwartz previously served as a curator at the Museum of Modern Art, where he focused on the careers of the works of Michael Moffatt, Tevfik Arsht, and Carl Gustafsson, and as an associate curator of modern and contemporary art at the Museum of Modern Art, where he curated the exhibition “Lumia", "The next Biennial should be held in October 2020, followed by an exhibition of works in 2020. The Biennial will be held at the Fine Arts Museums in Paris, the Museum of Modern Art, New York, the Museum of Modern Art, New York, and the Museum d'Orsay in Venice. “The future of art is here,” said Bjorn Deldman, director of the Bauhaus Museum in Berlin and an artistic director of the  Tacit Museum of Art in New York. “We are now able to see clearly the impact of our curators’ experiments and our exhibitions on the landscape. The time for celebration is over.”Citing the experience of spending last autumn on staff-only residencies in different parts of the world, Deldman said: “We are now able to live together in a way that was impossible before, to share the same daily routine and experience art and new ideas in a way that was thrilling to the artists, and for the most part impossible to them. I can’t imagine a more desirable time to work in New York than now.”\n\n\nThe Museum of Modern Art (MoMA) has released the list", "The next Biennial should be held in 2020.”\n\n\nThe Museum of Contemporary Art (MoCA) has appointed Kate Hoberman as its next director. The announcement comes on the heels of the institution’s announcement last month that it will close its current exhibition program and transition to an online-only program in 2022. The decision followed years of deliberation and was made to “ensure that the Museum of Contemporary Art (MoCA) remains relevant for and in the interest of contemporary art and architecture,” according to curator and director Pilar Ruiz-Perez.Hoberman will assume her new post on January 11, 2020. The seventy-six-year-old has served at the museum since 2015 and was instrumental in the reinstallation of the collection’s exhibition hall, which opened in 1971, and the reopening of its original campus in 2000. She also established a curatorial practice, the Hoberman/Ruiz-Perez Curatorial Team, which has worked collaboratively with artists, galleries, and institutions across New York City and the United States.“Museum staff have consistently sought out images from the many different eras over the years, and Kate has proven herself to be a", "The next Biennial should take place at the Global Center in Basel from October 31 to March 9, 2021. Inaugurating the new location is Saturdays at the Museum of Modern Art in New York from March 8 to March 10, 2020.\n\n\nThe Independent Museum of Fine Arts, London, has removed an early work by the legendary Polish artist Oskar Kokal, who often experimented with dramatic and surrealistic media to create works that are both playful and deeply affecting, from its roster of works by the Victorian British critic H. G. Wells. The biennial, titled “The Adventures of Oskar Kokal” (1928), was curated by comedian John Atkin.Kokal’s work was included in the exhibition “The Search for a New Dream,” which opened at the Independent Museum of Art in London on March 7, 2019. It was moved to the Tate Britain in London, which reopened in March 2020, and is now recognized as one of the earliest works by Wells.The show, which was staged at the Independent in 1966 and was shown at the Independent from 1968 to 2016, featured works from nearly seventy artists, including Cia Castracchi, Grzegorz Kaj", "The next Biennial should have opened on July 8, 2020, but was pushed back by a year due to a lack of funds. The event will now take place in 2022. If the 2019 edition is any indication, the pavilion will once again be packed, with an estimated 2.5 million people expected to attend. The 2020 iteration will include a number of new works, including a new documentary on the biennial, “Beyond the Frame: Art in Motion” (2019), which is currently on view through November 15; “The Other One: Beyond the Filmmatic” (2019) by Erik Satie; and “The Conscious Process,” which will open on September 8, 2020 and run through September 22, 2020. “I think what people are looking for from a yearlong event is a lot of the highlights,” said Watson. “And I think what we are going to do is an extension of what made the pavilion great.”\n\n\nThe Solomon R. Guggenheim Museum in New York has received a gift of 122 rare books and manuscripts from the late Turkish artist and scholar Selim Ozturk, who is best known for his paintings of a", "The next Biennial should be held in 2020.\n\n\nThe Museum of Fine Arts (MFA) in Boston announced on Tuesday that it plans to move the ten-and-dart arthouse, which has been closed since February 10 due to the Covid-19 pandemic, from its current location on Maine Avenue toward its new home in Dorchester. The institution has faced backlash from some who believe the museum should have moved the show before it became a magnet for Covid-19-infected visitors. In a statement, the museum said: “We recognize that moving forward with this exhibition will not be easy and that the future of the exhibition is uncertain. But we believe it is important for us to take a step in that direction, in order to give our visitors and community confidence and predictability.”While the museum has faced criticism for moving the show, the museum argues that it only launched an immediate reopening plan and that the move is necessary because of the increased number of visitors expected in the spring.“We are honored to have been able to move the show in such a timely fashion,” said museum director Christopher Cox. “The exhibition is now back at the central location in Dorchester and ready for the spring", "The next Biennial should take place in 2022. The political crisis in Ukraine has forced the European Union to suspend the event’s 2020 edition, which was set to take place in the capital of Kiev, as planned. Both the Academy and the Russian State Museum of Fine Arts have since scrapped the event, which was supposed to be the theme of the fifth edition of the Biennial of Ukrainian Contemporary Art.The crisis began in February when Russia annexed the Crimean peninsula from Ukraine, sparking protests in the country that lasted until April. In the days since, more than 100 people have been killed in clashes between protesters and police in the country.Ukrainian galleries, whose collection is important to Russia, have also been affected. Art historian Andriy Lysenko, a former director of the Artsy Foundation in Moscow, told the Art Newspaper that the authorities in Kiev are trying to prevent galleries from opening and closing, and that the new regulations will make it difficult for some to open. He also noted that the number of those detained for allegedly throwing a Molotov cocktail in February was much higher this year.Commenting on the government’s move to clamp down on the arts, Artnet reported that the new regulations will make it harder to organize an exhibition in", "The next Biennial should be in 2020. The inaugural event, The Birmingham Biennial, was held at the Museum of Contemporary Art (MoCA) in Birmingham in 2001 and featured work by forty-four artists. It led to a series of exhibitions that included work by artist-in-residence Stanley Donwood; a triennial of photographs by Louise Bourgeois; and a retrospective of Louis Vuitton. \n\n\nThe Ada and B. Gerald Ford Foundation has announced that it is rescinding its longstanding support of two Detroit artists who were involved in an ongoing campaign to hold the automobile maker accountable for its role in the housing crisis, the Detroit Institute of Arts (DIA) and Kalamazoo County. For months, advocates of the Detroit Institute of Arts (DIA) and Kalamazoo County have alleged that the foundation was giving financial and other incentives to the artists in order to secure their support. The exhibitions and books that were included in the ‎rejectal campaign were curated by Stacie Stebbings, the director of the DIA; Theodore Niles, the founder of the label Savant; and Susan Petzold, the cofounder of the label Whitechapel Gallery.“Neither man contacted the Ford Foundation", "The next Biennial should take place in 2020, and the first in 2021. The event has yet to announce a date for its twelfth edition, which will kick off in March 2020 and culminate in a grand opening in May 2020.\n\n\nThe Royal Academy of Arts in London has received a gift of twenty-four works by artists, including Fulcrum, Proust, and Matisse. The museum made the announcement today in conjunction with the opening of the exhibition “Fulcrum and the Search for Meaning,” which will be on view until November 22. The exhibition is a collaborative effort between the Royal Academy of Arts (RA), the Metropolitan Museum of Art, the Institute of Contemporary Art, London (CAM), and the Santa Fe Institute, which collaborated with the Royal Academy of Arts on a thirty-minute film for the exhibition, which is currently on display in the museum’s new location—the Arts at London—on the second floor of the museum.The Bechko Collection, which comprises works by thirty-five artists—Claudia Celant, Adrienne Barke, Alex Buzey, Suzan-Lori Parks, and Brad Fisk, among others—have also welcomed ten new artists", "The next Biennial should be kinder, gentler. At the time of the violence, the city was still trying to sort out its own trauma. The only way to heal it is with more resilience and empathy. We must remember that we are one community, one city, one community at a time. As a city, we must recommit ourselves to healing. We must acknowledge that healing is not an option. We must do all we can to support our neighbors and the many communities that have already come together to heal. We must foster an environment of healing and support for one another. We must rise above our pain and rage. We must center ourselves and listen. We must listen to our neighbors and the many artists and thinkers, artists, artists, and activists whose pain we are trying to lift up. We must listen to their pain, we must listen to their challenges, we must listen to their fears and doubts. We must listen to their struggles. We must become their partners in their hope and in their struggle. We must listen to their pain and rage, we must share it with them and with the many artists and thinkers, artists, artists and activists who are part of our city’s vibrant creative ecosystem. \n\n\nThe Museum", "The next Biennial should be held at the Museum of Contemporary Art Baghdad in early December and will be held in January 2019. The exhibition will include works by contemporary artists whose current exhibitions have been cancelled or postponed in the past.According to an invitation issued by the Ministry of Culture and the Ministry of Education, the twenty-fourth edition of the Biennial will be held at the American University in Cairo in January 2020 and will include works by twenty-six artists in total. The art-world event will feature works by twenty-six artists, including Yoya Watanabe, Adi Granat, Homa Abdel Nabi, Terrie O'Grady, and Serjyoti Menon, as well as classic and modern artists such as Suzan-Lori Parks, Susan Phillips, and William Heinemann.The last iteration of the exhibition was held at the Metropolitan Museum of Art in New York in March 2019.\n\n\nThe Baltimore Museum of Art (BMA) announced today that it is going to close its doors indefinitely, effective June 1, 2020, in an effort to reduce its carbon footprint and address climate change. The announcement comes one week after the museum received a $1 million donation from the estate of Richard and Mary Jewell, the founder", "The next Biennial should tackle the question of what happens when the point of view of a curator changes, and should elaborate on the relationship between art and the social. Sally Kornbluth, who was recently appointed curator of the final years of the Biennial, said: “The new project will include new approaches and new projects to engage with the most important works of the last decade.”The 2019 edition of the Biennial was held in New York City from March 3–March 7. The seventy-fifth edition of the event, which was organized by the same organizers, took place in Montreal from March 19–March 23.\n\n\nThe Dalles Museum of Western Art (MCA) in Oregon announced today that it has received a gift of thirty-two works by American artist Eric Fischl in its permanent collection. The works were donated by the artist and collector Richard Fischl, who has been active in the art world since the 1970s, and were acquired through a deal that was made in 2015.“The gift of these works is an incredible moment for the staff and the board, and I am honored to receive them back from the longtime donors,” said Dalles director Matthew Teitelbaum.", "The next Biennial should be held in 2020.\n\n\nThe Museum of the Moving Image (BMI) in the United Kingdom has launched a new digital platform for the exhibition “Moving Images.” The initiative, which launched with a pilot program at the museum in November 2017, aims to provide an online platform where visitors can go to view the selected works in its collection, and to answer questions about the works through a live video chat.Collaborator and former director of the Tate, Deborah Orr, said: “This is a pilot project that we are really excited about and we are really excited to see how it works and how people use the platform. We have been thinking about this for some time and it really is a game-changer because it opens up a new level of accessibility for the works in the museum. It is a huge milestone to be able to present a new exhibition in the UK, especially one as important as ‘Moving Images’ in person and to give it to a select audience in the first place.”In addition to the works presented in the exhibition, the platform will not only showcase work that is currently on display but will also host other works, such as videos, animations, audiovisual works", "The next Biennial should open in 2022. \n\nThe United Kingdom’s Royal Shakespeare Company (RSC) has announced that the 2020 edition of its annual Royal Festival of Plays will take place at Stratford-on-Avon. The new venue will provide the Royal Shakespeare Company with an updated and expanded staging of William Shakespeare’s play The Tempest, which will feature new and original characters as well as original scenery recreated in new and modern settings.“We have long considered it a mission to present a full and balanced version of The Tempest, one of Shakespeare’s most celebrated plays,” said RSC artistic director Hampton Jeffries. “The new venue will enable the company to present a full and challenging portrayal of The Tempest, while retaining its traditional character of a prestigious summer festival. It will also allow the company to present a full and challenging version of Richard III, while retaining the rich and compelling narrative of the play.”Leading the project will be Stephanie Carthy, acting artistic director of the Royal Shakespeare Company, and her team will work closely with the Royal Shakespeare Company’s artistic director, Henry Cassatt, to tailor the play to the venue. The themes and characters of the play will then", "The next Biennial should be held in London in 2021. The 2020 edition featured work by twenty-nine artists, including Ringo Bannan, Manal Kordansky, and Kailey Rietveldt for a children’s book and a performance, respectively.\n\n\nArtist and scholar Dacher Walshe is set to present her first collaborative work in the United States at the Museum of Modern Art (MoMA) in New York next year. The exhibition will feature paintings by sixteen artists, including Stanley Donenfeldt, Margaret Mitchell, David H. Koch, and Michael Brown, as well as sculptures, installations, and drawings by forty-five other artists.Known for creating conceptual environments based on the itinerant life cycle, Walshe uses her practice to explore the relationship between the artist and the world. In the exhibition “The Artist and the World,” her first work, 2014, a series of paintings called “great journeys,” she works with a team to explore the relationship between herself and the journey of her fellow paintings. In the current work, which was on display at the opening of the Museum of Modern Art’s inaugural Fantastic Exhibition in New York in September, she assembles seven groups of", "The next Biennial should take place on the occasion of the fifty-fourth anniversary of the opening of the museum. Efforts should be made to facilitate the exchange of lectures and curiosities, exhibitions, and collections between the two institutions.\n\n\nThe Flemish National Museum (Svensk, Nederlands berk) in Brussels (Nederlands Museum) has appointed Anna-Sophie Bartlett as its next director. She succeeds Kimersten Rietbakken, who will retire after a decade at the helm of the institution. Krägerstädtische Nationalstadt, the Flemish word for the central European city of Maastricht, has commissioned Bartlett to create a new work for its exhibition “Eden in Maastricht” next month. The crowning achievement of the biennial will be its inaugural exhibition “Frontier Light: Museums and the Future of Agriculture.”Called a “new kind of museum,” the show will be organized as a “competition between art and science,” embarking on a yearlong “exploration” of the nature and origin of light. Its design incorporates elements from the Flemish", "The next Biennial should focus on “intersection of art and technology,” said Karolina Wojtas, Maria Berger’s director of the biennial. “The next Biennial should be a moment for reflection, for reflection on what it means to be human, and a moment for reflection on the boundaries between physical and virtual reality.” \n\n\nThe Danish government is preparing to introduce new legislation to protect the cultural heritage of Denmark, which is currently under the ongoing threat of a new separatist movement led by Britain and other European countries. The legislation is expected to be introduced this spring and will attempt to address an ongoing series of nationalist attacks that have targeted the country’s cultural heritage sites since the establishment of the nationalist Danish People’s Party in 2015. In April, a bomb attack on a Copenhagen synagogue killed three people and injured dozens more.Cultural heritage is also at the center of a long-running legal battle between Denmark and Germany, the United Kingdom, and France, which have made international agreements to compensate Denmark for cultural heritage sites they say were excavated illegally through mass-excavation projects and are at risk of being submerged under rising sea levels. The countries have jointly pledged to pay up to $8", "The next Biennial should be organised in 2022 and will take place at the Panorama Centre, Paris, France. The event will be hosted by Prada and will take place in conjunction with the Paris Games. In the lead-up to the event and beyond, the brand has worked with the French Ministry of Culture and the Institute of Contemporary Art to develop a series of exhibitions, performances, and performances that will be staged in Paris.The brand also recently worked with the Palais de Tokyo and the Taormina Museum of Art in Rome to present the Los Angeles International Film Festival. The festival will be held in April 2020.“In order to provide a unique and authentic experience to our visitors, we have developed new projects with a contemporary and contemporary-inspired approach,” said Louis Vuitton CEO Catherine. “We hope that this will be a welcome addition to our Parisian campus. We look forward to welcoming you to Paris.”\n\n\nIn a major setback for the Israeli arts and culture sector, the Israeli Museum of National Art (IMA) in Jerusalem and the Tel Aviv Museum of Art (TNA) have been forced to cancel each other’s spring 2020 programming, following months of intensive lobbying by the Israeli government and mass", "The next Biennial should choose a theme and focus on the collections of two of the first five participants, the Chinese and Japanese collections, and will present the works in the late autumn/early spring of 2020. The event will be hosted by the Juilliard School in New York City, the Spanish Institute in Madrid, the Public Museum in Beijing, and the Museum of Fine Arts in Boston. A full list of the participating artists is as follows: 1. Patrick Chiu2. Haig Fergus3. Jodi Greenfield4. Josh Grob (United Kingdom)5. Alistair Lynne (United States)6. David Lynch (United States)7. Peter Levitt (United States)8. Janice Meneguzzo (Mexico)9. Benoit de Bonty (France)10. Sarah Joseph (Brazil)11. Martha Werner (Germany), 2013\u009715\u0097L, 2018\u0097N, 2019\u0097R, 2018\u0097M (2018\u0097M), 2019\u0097S (2018\u0097M), 2019\u0097T (2018\u0097M), 2019\u0097T (2018\u0097M), 2019\u0097T (2018�", "The next Biennial should focus on the contributions of visual arts and cultural institutions to the promotion of democracy and the spread of democracy. The theme of the 2020 edition will be “The Future Is Present.”Vintage Biennale will be honored with a special exhibition on “Ideas and the Arts” at the Coronet in London on November 12. The exhibition will be curated by Roger Ebert, curator of the annual biennial, and will include biographies and short essays by artists such as Paul Gauguin, Elia Sosa, Willem de Kooning, and Paul Thomas Anderson, among others.Commenting on the upcoming event, Emmanuela Corrigan, director of the OOPP and OEDP, said: “We are thrilled that the Tudor Biennale will resume, with the full support of the public and local authorities, and will be able to welcome visitors to the new 15th Biennial Tudor in London in March 2021. Our artists are committed to the project which was so successfully closed in 2019, to reflect the breadth of visual arts and our history of collaboration with the Tudor Trust and its trustees. Our artists will also continue to collaborate and develop works around themes from the past", "The next Biennial should take place in the spring of 2020. The exhibition will receive a grant from the David Zwirner Foundation, alongside of the inaugural exhibition, which will be funded entirely by the artist. The full list of curators and performers who are participating in the 2020 Biennial can be found on the foundation’s website.\n\n\nThe Willis Tower will be reopened to the public on Saturday, March 11, 2020. According to the New York Times, the reopening will coincide with the opening of a new exhibition, “Theories of Space,” at Rockefeller Center. The show will explore the history of scientific ideas and their use in the creation of new ideas and new worlds. Organized by the Museum of Modern Art in New York and curated by engineer Dr. Felix Gehrels, the project will feature forty works by twenty-six new and classic artists, including Edward Hopper (1932–1936), Jean-Luc Godard (1908–1960), and Thomas Jaspers (1913–1992).“I’m thrilled to open to the public the new work by Dr. Gehrels and the work that is about to be exhibited in Theories of Space,” said physicist", "The next Biennial should take place in 2020 and the first will take place in 2021. Sensitivities around the 2018 event were heightened by the fact that the artwork created by the late Egyptian designer Salah ElBaradei was removed from the exhibition in March 2019 and its successor, “6+6,” a project about the intersection of art and technology, was canceled last August.The show, which had been scheduled to run from March to August 2020, was supposed to kick off in April and feature eighty new works by twenty-seven artists. The fifty-one-hour event was supposed to be a platform for artists to discuss their projects and to address social issues by exploring the intersections of technology and culture.The organizers have since been forced to suspend the exhibition, which was supposed to draw upwards of two thousand visitors. The Independent reported that the building where the exhibition would be held—the Egyptian Museum—was forced to move its exhibition to a different museum in the capital Cairo. The exhibition was supposed to kick off at the Suez Canal in September and be on view until December 7.It remains unclear whether the cancellation of the show will impact the exhibition, which has already faced protests from some artists who claim that the removal of the sculpture", "The next Biennial should be in 2020 and will be a collaborative project between the artist and the Museum of Modern Art as well as five other organizations: the Art in a Day, Art in a Lifetime, Art in a Lifetime/Art in a Day/Art in a Lifetime, and Art in a Day/Art in a Day. Naima J. Keith Gallery will also collaborate with the Museum of Contemporary Art and the Metropolitan Museum of Art on a new work by Tereza C. Patterson. The museum will present the project at its ground-level space at 509 SE Seventh Street in Chicago in 2020. \n\n\nThe Metropolitan Museum of Art (MoMA) in New York has launched an initiative to support artists who are struggling to pay their rent and other bills through the 2020–21 fiscal year. The initiative, called the Artists Pay Project, will target ten of the institution’s buildings and will require artists to apply to rent-stalled spaces through September 30. “MoMA’s commitment to preserving and supporting the artists who have lived here for more than sixty years is unrivalled,” said William L. Greenberg, the museum’s director. “I’m honored to have been", "The next Biennial should determine how the program should be changed to make the museum more accessible to the most vulnerable communities in the country. And finally, there should be a public rally in support of the work and its creators on September 23.  HTC also announced today that it is launching two new programs for the museum. The first is an exhibition dedicated to the legacy of the artist Thich Nhat Hanh, whose work explores the history of Vietnamese American artists and their contributions to the art world. The second is an education program for the public on the history of American art. Both programs will debut at the museum next month.Curated by Kelly Houses, the new exhibition will showcase twenty-five artists whose works are included in the exhibition “A Vision of the Vietnamese American Community in the 1960s.” The works selected for the inaugural exhibition are: 6.5 x 10 p.m. by Japon Harada; A Letter to Myself, 1963 by Ruy Teacy; A Picture of Vietnam by Terrence Ho; A Single Child by Sylvia Min, 1968; A Thousand Faces by Jackie Fan; A Yell by John Hart, a", "The next Biennial should have been held in Rome in 2021, but was postponed due to the Covid-19 pandemic. The 2019 event was scrapped in April after organizers reported that it was \"incomplete, sparse, and lacking in artistic value.\" The 2019 edition, titled “The Subversion of the Body: Art and Feminism in the 1960s” was also held in Rome, but only in the Italian city, and was cancelled during the country’s April–June months. The 2019 edition featured contributions from artists such as Anton Kern, Sabina Cerciello, and Stephen Pritchard. The 2019 edition of the festival, titled “Art and the Body: Modernity and Death” was also held in Lisbon, Portugal; Netherlands; and Copenhagen, Norway.\n\n\nThe Gallery at 91 East Seventy-Four (91 East) in New York City has received a major gift: the Leonardo-designed home of painter and sculptor Tycho Brahe. Designed by Italian architect Silvio Maroni, the Carylotti-designed studio and exhibition space was completed in 2007 and opened to the public in 2009. The gift, which includes an extension of", "The next Biennial should be held in 2021.\n\n\nThe Royal Academy of Arts (RA) in London has appointed Robert Pincus as its next director. The appointment was made in the wake of the Covid-19 pandemic, which has forced the closure of at least seventy-five museums across the United Kingdom. Pincus is currently the director of the University of Exeter and has helmed the institution since 2014. “Robert has been instrumental in the revitalization of the RA, bringing together a diverse group of artists, including Rachel Whiteread, Michael Prendergast, and Rineke Dijkstra, and in the expansion of the collection, opening new exhibitions and projects, and launching new public programming,” said RA chair Andrea Dury. “He also has a clear understanding of how art and culture is fundamentally connected to people’s lives, and is committed to working with artists to create new and exciting ways for audiences to engage with art.”Pincus will take the helm of the RA in January 2022, when it will celebrate its sixtieth anniversary.According to the Art Newspaper, the reason given for the closure of the museum is that the institution will not be able to", "The next Biennial should focus on the relationship between architecture and the natural world. It should also consider the ways art can affect and alter the physical landscape, and how this can be expressed in different ways.”Anyone who has any ideas what the next Biennial should be about can submit their suggestions to the museum, and the museum will then choose one of the twenty-five best ideas from the public. Those who are interested in helping shape the next edition of Architecture at Strathclyde can contact the museum.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has announced that it is preparing to implement new regulations regarding urban farming, land restitution, and other issues related to the collapse of the historic Lower East Side housing project Covid-19. Determining whether specific properties, institutions, or businesses are eligible for relief can be complicated, and the department will rely on the opinions of a panel of community members and experts in an attempt to make a fair assessment of whether specific properties, institutions, or businesses are being used in a manner that violates one of the state’s strict environmental remediation guidelines.The department will determine whether a property qualifies for assistance by reviewing information provided by participating businesses and by interviewing relevant", "The next Biennial should take place in 2020 and will mark the 100th anniversary of the European Communities. This year’s edition will focus on the future of Europe, in collaboration with a panel of experts from the fields of art, architecture, and the humanities. The theme of the 2018 edition was “New Civilizations.” A selection of the biennial’s previous works will also be presented in 2020.For the 2020 edition of the Biennial, the exhibition will include the work of thirty-one artists, including María Berrío-Alarcon, Jerome Böhl, Ting Guo-Yu, The Economist, and Wolfgang Hujar. The exhibition will also include an extended program of interviews with leading thinkers on culture, world cultural history, and the humanities and social movements.“The next edition of the biennial will focus on the history of art from the perspective of a new world order in which a critical mass of humanities scholars are now gathering in Europe, and the persistence of art in the political and cultural fabric of societies,” said Wolfgang Praes. “The exhibition will present the twenty-fifth Biennial in Dresden. The topic of this year’s 12th edition will thus be", "The next Biennial should take place in the Winter months, between the months of January and March, which is the current plan. Although the event has been around since 2011, it only opened to the public in 2017 and has been suspended since March. The next edition will again be held in New York City, with the theme Resistance.  Although the 2020 iteration will be held in the winter, the theme will be Nations. Shaykhul Islam Saeed, president of the Islamic Republic of Iran, revealed that the theme is not to be confused with the Iranian resistance, which was organized in response to the Islamic Republic’s new supreme leader, Ali Khamenei. “The ideology of resistance is of two types: (1) a resistance in the form of a nation, and (2) a resistance in the form of an Islamic republic,” said Saeed. “We believe that in both cases the resistance in the form of a nation and the resistance in the form of an Islamic republic are essentially the same phenomenon. A nation is a people which acts according to its own will, while an Islamic republic acts according to the will of the nation. This is a history of nations, and this is", "The next Biennial should be scheduled sometime in the second half of the year, he said. Sylvia Rivera-Díaz, director of the Galeria Nara, Mexico City, said that the upcoming exhibition “will be a reflection of the richness and challenging aspects of life in Mexico City. We are already seeing the first fruits of this project. We feel it is no longer just a mission to present art but a duty to present art.”More information about the art and historical sites in the exhibition and the upcoming exhibition can be found on the Museo de Arte Contemporáneo de Mexico City (MASC)“Art and History,” which is affiliated with the Museo de Arte Moderno (MAM), the museum in Mexico City.The 2019 edition of the five-day event will inaugurate with a virtual reality (VR) installation by the Guatemala-born Salvador Dalí on the theme “Resilience,” is slated to run March 21–March 27. The installation will be augmented by works by internationally-recognized artists such as Miguel Ángel Andujar, Renata Cervetto, and Hélio Oiticica, as well as works by", "The next Biennial should be held in 2022.Prior to joining the Arts Council, she served as director of the New Zealand Museum of Art, where she was responsible for the design of the institution’s permanent collection. She also spent time in the Department of Conservation’s Department of Conservation and Landscape Design, where she worked on projects such as the Maori Landscape Architecture Program, the Hawaiʻi Landscape Heritage Development Plan, and the New Zealand Landscape Award. Her work has been exhibited at the Museum of Modern Art, the Contemporary Art Museum Auckland, the New Museum, and the Auckland Art Gallery.Commenting on her work, the curator said: “Her work encompasses an underlying and sometimes ambivalent sense of frustration and beauty. She embraces a more or less idealized vision of the world, one that seems at least as cozy and at times a little more brutal, as she celebrates the beauty of things beyond our understanding and control. It is a vision that is simultaneously universal and particular; that is both sublime and monstrous. I think it speaks to both how little we know about the world and our place within it and how much we still need to do to be fully present in it.”The inaugural series of the new bi", "The next Biennial should be held in the spring of 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in New York has appointed Richard Mayhew as its new director and CEO. He succeeds Mel Miller, who retired in January 2019 after ten years at the helm of MoCA.“Richard has been instrumental in our moving forward as an institution and has developed new and exciting exhibitions, and has helped shape the museum’s relationship with our communities. He is already well-known for his passion and focus for exhibitions of work by artists that have been underrepresented in our collection, and we are looking forward to his continued leadership as we continue to grow our collection, develop new programming, and deepen our relationship with our communities,” said Joseph Eytan, chair of MoCA’s board of trustees.Prior to joining MoCA in 2015, Richard served as an executive director for the Brooklyn Museum. He was interim managing director of the Whitney Museum of American Art in New York from 2012 to 2014 and was a cofounder of the New York Jewish Museum. During his tenure at MoCA, Richard expanded the museum’s collection by adding more than seventy works by artists including Robert Irwin, Ugo Rondinone, and Laura Owens", "The next Biennial should take place in the spring of 2021.The exhibition will also include works by a select group of artists who are not represented in the current exhibition. The group comprises artist Nargis Jumaa, who represents a group of watercolorists known as the 'Ladsus;' the group comprises five artists: Elyn Mensch, Nadiya Hussain, Nari Ward, and Nari Ward-Williams.The show will also feature the work of artist-activists and activists, who have championed the rights of artists and their work. “Artists are people with ideas, ideas are powerful, and I believe that the more artists we have, the more vulnerable we become to the idea that our work is not valuable,” said Maia Gulati, cofounder of the Biennial Foundation. “There is a huge need for the artworld to think seriously about how it can be less about collecting and more about making a difference. The Biennial Foundation will be a platform for that.”\n\n\nThe Carnegie Museum of Art in Pittsburgh has received a gift of twenty rare works by the artist and educator Edward C. Doll, whose ambiguous, sometimes brutal, work is now on display in a special exhibition devoted", "The next Biennial should focus on the question: what kind of architecture is there together with transformation, transformation, transformation?” He added: “The question will no doubt remain for a generation. The concept of architecture as a living body, as a whole system, will be the theme of the next Biennial. We are in the process of preparing a new edition of the biennial, but the future of architecture as a whole is at risk.”\n\n\nAnthony Weiner, the former New York congressman and longtime advocate of new laws to combat climate change who has been indicted on federal sex-trafficking charges, announced on Monday that he is dropping out of the race for New York governor in 2018.In a statement, Weiner said: “I have spent the last month in consultation with my wife, Huma, and the people of New York, and am confident that we have moved the process along in a way that will leave the people, and the environment, protected from the ravages of this pandemic.”He added that he is confident in the outcome of the campaign and its recommendations, but believes the fight against climate change can continue without him should he decide to step down. Weiner said: “I intend to continue working with", "The next Biennial should take place in 2021.\n\n\nThe Library of Congress in Washington, DC, has added two new works by the African American artist Claude Monet to its collection. The works, titled A Distant Synecdoche and On the Roof of My Car, will be included in a new exhibition at the institution next month. The work from the series, which also included King Tut and The Sphinx, was one of the first works on paper created by the American artist.“Claude Monet: A Distant Synecdoche and On the Roof of My Car,” which will open on the wing of the museum on September 8, will focus on the life of the African American artist and will be accompanied by a new collection of prints, photographs, and lithographs by the artist. The exhibition will be accompanied by a new documentary, American Dream: Claude Monet, America and the American Dream, which will be shown at the institution from September 18 to September 21 and will be presented by Laura Mulvey, the executive director of the Association for the Visual Arts. “Claude Monet: A Distant Synecdoche” will be shown at the institution until December 15 and will be", "The next Biennial should focus on the question of how to support artists on the front line of the opioid crisis. The institution will also unveil new programming, including a documentary on the history of the illicit drug market and the world’s largest art museum, the Palazzo delle Papesalle, which has the capacity to house the entire collection of the Spanish artist Íñigo Rocha. Speaking to the New Yorker last fall, Rocha said: “The future of art is to be organized in an open, participatory way: to be a museum of the world, a museum of the possibilities of art.”\n\n\nThe Los Angeles County Museum of Art (LACMA) has received a $1 million donation from Lenny & Michele Rohde, the brothers who founded the popular bicycle store chain, the firm behind such iconic brands as Trek and Specialized, in an effort to combat the spread of Covid-19. The gift includes a new model of bicycle lock, a new cycling-specific bicycle repair kit, and a new set of customer service guidelines designed to prevent bike theft.In recognition of the company’s commitment to supporting the arts and the community, the Rohde Family Foundation will name", "The next Biennial should be held in 2021. The Board of Governors will decide on the awardees after a presentation of the first exhibition of the new work in January 2022.\n\n\nBaltimore’s Museum of Arts and Design (MAD) is pledging $50,000 to the work of photographer Marisa Lindsay. The program, which will focus on how the art of photography can be approached from the perspective of an artist who is also a pioneer, will culminate with a solo exhibition at MAD in the fall of 2020.“The recent exhibition ‘Camera*’ at the State Museum of Art is an exploration of the role of photography in the development of the State,” Lindsay said. “I am so honored to be working with the talented team at MAD to create a new work for the institution, and to present it at a historic institution that has been open since 1909.”Lindsay, a Polish-born, New York–based artist who was one of the first American women to work at the museum, was selected by a jury comprising Ed Moses, curator and founder of the Museum of Modern Art; Paula Scher, director of the Museum of Modern Art; and David Halberstam, the architect and founder of the", "The next Biennial should be held in 2022. We are always open to new ideas and new ways of thinking. The next edition will be an exciting celebration of contemporary art and will commemorate the 50th Anniversary of the Biennial with a fresh and lively performance by one of the best-known and most popular Italian artists, Giuseppe Catellani. The theme will be 'The Present: Adapting to the Present'. “The Future of Art: The Art of the Present,” which will be organized in association with the Italian Foundation for Contemporary Art in Rome and will feature the work of forty artists, including Adrienne Atget, Giuseppe Catellani, Andrea Cornejo, and Michele Cicutto, among others. In addition, the museum will present a new exhibition called “The Future of Modern Art” in the fall of 2020. The Biennial will be held at the Museo Cervetto di Milano from November 24, 2019 to March 13, 2020. A retrospective of Antonio Serpa’s work will also open at the Museo di Roma in March 2020, and a presentation of Giacomo Nesti’s Conceptualization of the Present exhibition will open in", "The next Biennial should be held in the fall of 2020. The institution will also be overhauled in order to host seven exhibitions, including a biennial on African art and the Dreyfus Plateau; a biennial celebrating the history of livestock; and a collaborative exhibition on the history of art and design. “The new museum will be driven by a new strategy that combines art, history, and research and will embrace an innovative and interdisciplinary approach to exhibitions and research,” said Michael J. Ryan, director of the Dreyfus Plateau Biennial. Museum director and CEO Marc Glimcher said: “The construction and renovation of this new museum will explore the ways in which art and design continue to shape our world. It will also provide a platform for the development of contemporary art and design. We are thrilled that the work of many talented artists will be showcased in the museum.”\n\n\nThe David and Lucille Packard Center in Pasadena, California, has received a gift of forty-six works by thirty-six artists since it opened in 1959. In addition to the works, the center will soon host a retrospective of the work of thirty-six artists, including Paul Gauguin,", "The next Biennial should feature the work of twenty-one artists from twenty-three countries. The theme will be “Austrian Expressionism,” and will be based on the biennial’s inaugural exhibition, titled “Afrika Springbokken.”The artist-led event will feature works by twenty-one artists from forty countries, including Austria, Belgium, Finland, Germany, France, and the Netherlands. It will be hosted at the new museum in the city of Zwickau in central Germany, Herreische Kunstverein, and will premiere at the International Center for Contemporary Art (ICCA) in Paris. The biennial will also include a second edition of “Austria”–“Dieterich Mayer” (2019), which will be held at the Prussian Cultural Center in Berlin and will take place in April 2020.The overall design of the “Austrian Springbokken” exhibition was inspired by the biennial’s theme, “Austrian Expressionism,” which was translated by the artist and curator Dieterich Mayer. The exhibition will also feature “Myths of Modern Life”—a performance series by the artist Karl", "The next Biennial should take place in the confluence of the Adriatic and the Black Sea in January 2021. The next edition will be held at the historic Veneto Art Museum in Venice, Italy, and will be hosted by the Veneto-Fondazione Prada-Milano di Trentino in Milan.Artists and collectors are invited to participate in the 2021 edition of the Biennial. The theme of the exhibition is “Post-Secession: Art from the Post-Partition Archives.” Inaugurating the exhibition is a series of public performances that will present works by artists such as José Maria Ferrer, the Colombian artist who is often featured in the show, and Elena Jost and Zoya Tarshish, the Russian artists who are both represented in the exhibition. The exhibition will continue to be presented in the cities of Venice, Reggio Emilia, and Turin.\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Kate Russell as its next director. She will be responsible for steering the organization through its next chapter and will take the helm from the current director, Dr. Michael McGovern, at the end of the month.“Kate’s passion, curiosity", "The next Biennial should be held in 2020. Melta believes that the venue should be transformed into a platform for international exchange. “The main thing is to create a channel to facilitate international exchange and dialogue.”\n\n\nItaly will move to introduce new anti-terror legislation in the wake of the Paris attacks, including a new set of restrictions on travel to and from the country, which has been plagued by widespread unrest since December 12, and will introduce a new set of safety measures to prevent the spread of COVID-19. The country’s government, which is struggling to contain the coronavirus--Italy was one of the hardest hit by the pandemic--is also preparing to establish a national fund for the treatment of COVID-19-related illnesses. Prime Minister Paolo Gentiloni announced on Tuesday that the government will set up a new $1.1 trillion fund to deal with the reopening of the economy and is asking for $7 billion from the private sector. The money is being organized through a combination of fines, allocations of funds from the biennial \"Citizens’ Initiative\" and emergency loans. Italy’s public health system has been struggling since the end of March. While the", "The next Biennial should be held at least a decade from now. For now, the museum will continue to welcome visitors from July to December.\n\n\nThe Swedish Museum of Art (Skulke), which was forced to cancel a major exhibition over the death of a Black artist in an incident that has sparked protests from the Black Lives Matter movement, will reopen on August 20 with a presentation of works by nine artists whose works were submitted by artists and collectors, including the Dutch artist Gerrit van der Vegt and the Belgian artist María Berrada. The exhibition will be on display in a new multi-storey building designed by the architect Knut Zuijs, which will also include a new installation of work by the Chilean artist Paulo Campos.The exhibition will be hosted by director Morten Steinsland, who was named the new chief curator of the Swedish Museum of Art in March, and his assistant Roswall. The exhibition will be on view from August 19 to August 21.“In this case the perpetrator is an academic or a journalist, and we have to deal with this in the same way as we deal with students: with respect, expertise and understanding,” Steinsland told Artnet News. “It is important", "The next Biennial should aim to present an investigation of the deaf and the visual as an epicentre of this emerging and emancipatory culture.” The 2018 grand prix, which was staged in collaboration with the city of Brescia in Italy, was very popular with the public; the country’s premier art museum, the Museo d’Arte Contemporanea di Catanzaro, confirmed over one hundred thousand visitors.The exhibition, “The Communion of the Spheres,” was organized in collaboration with the Italian Ministry of Culture and the Museo della Scala. The exhibition spans the history of the human vision, from the earliest works in the nineteenth century to the most recent, and addresses issues such as the relationship between art and the body, the creation of the digital environment, and the evolution of communication technologies and institutions.The first catalogue entry for the exhibition is titled “Anima: the Language of Vision” and will open in the fall of 2020.\n\n\nThe Yeomen of the Arts, a prominent New York arts nonprofit founded by brothers James and Lloyd Dolan in 2005, has lost a major art historian and art history scholar to suicide. According to the New York Times,", "The next Biennial should be held in 2022.\n\n\nThe Institute of Contemporary Arts (ICA) in London has appointed its first cultural economist. Browne Fossey, who has previously worked as a curator, writer, and arts administrator, is the new deputy director of the Institute. Fossey will take up his new role on February 28.Fossey comes to the ICA from the Institute of Contemporary Arts (ICA), where he has served as the deputy director since 2016. His appointment is part of a long-term plan to increase the international reach of the ICA’s collection, which is comprised of more than sixty thousand works, through the acquisition of works by artists from around the world. During his tenure at the ICA, Fossey organized exhibitions such as “On the Provision of Space: twenty-first-century Art” (2017–18) and “Soul of a Nation: Contemporary Art in the Twenty-First Century” (2017), and helped to develop a new curriculum that focuses on the translation of art history into contemporary issues.Fossey’s new role will be a continuation of the work the ICA has already embarked on for more than twenty years. The museum acquired more than sixty thousand", "The next Biennial should be held at theůlmamstvo in Warsaw, the retrospective will take place in the spring of 2020.  The current exhibition, “From Rising to Sleeping,” will close on September 26 and will be replaced by the 2020 edition, which will include the works of twenty-three artists. The next edition of the Biennial will take place at the ůlmęstvo in Berlin, the autumn of 2020, and will be held in two parts, in April and May. \n\n\nAfter a gunman opened fire at a congressional Republican lunch held in Washington, DC, on Thursday, March 18, killing two people before killing himself, the US House of Representatives voted to establish a commission to investigate the circumstances surrounding the death of George Floyd, the twenty-six-year-old black man who was killed by a police officer while he was handcuffed in a tactical vest in Minneapolis on March 12.A resolution introduced by Representative Keith Ellison, a Minnesota Democrat and the first African American member of Congress, asks for the formation of an investigatory body consisting of representatives from civil rights, law enforcement, and community relations, and asks for an expedited review of Floyd’s death. The full", "The next Biennial should be held in 1976. The opening of the Biennial will be marked by a public performance, a lecture series, and a symposium. There will also be a catalogue entry, a book launch party, and a special exhibition. The 1992–93 edition of the event, entitled The Contemporary, featured artists such as Perrotin, Dalalila Mumbad, and Odessa II’s Aja Al Keita. \n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles announced today that it is releasing three new works by artists whose work was featured in the first phase of its “Feminine Expressions” exhibition, which opened on December 8, 2013. The first, a series of drawings by Andy Warhol, will be presented in the Museum’s new, expanded, and larger theaters at 6425 Wilshire Boulevard in Los Angeles in March 2020. The second, a monument to the lesbian, gay, bisexual, and transgender (LGBT) community, will be unveiled in January 2021. The third, an installation titled Where is Love?” will be presented in the Museum’s new space at 7001 Sunset Boulevard in October 2022.", "The next Biennial should focus on “The Future of Alchemy,” a collection of works by leading artists and writers from Austria, Belgium, Germany, and the United Kingdom, and will be held at the Museen der Moderner Kunst, Frankfurt am Main from March 17 to March 20, 2021. The exhibit will also include “Visual Arts: The Origins of Modern Art” and “Visual Culture & Art: From the Basels to the Museum Stuttgart,” which will be on view until June 20. The 2019 edition was won by the late Belgian curator and theorist Jean-Marie Leclerc, whose work is often cited as a precursor to the modernist movement. The exhibition will be followed by a festival of contemporary art, “Alfred Leclerc in Conversation” in October.\n\n\nThe British Galleries Association (BGA) has named Diana Rose as its new chair of curatorial affairs. Rose will assume her post on March 13, 2020. Rose previously served as a BGA board member from 2004 to 2008 and as a member of the board of trustees of Tate and won the 2019 Pulitzer Prize for criticism for criticism. She most recently held the role of chair of exhibitions at the", "The next Biennial should focus on the history of the art and its avant-garde, non-traditional, and contemporary artists, and the importance of the institution in preserving their legacy. This work will be presented by the National Gallery of Art, the University of Chicago, and the University of Michigan. Museum holdings include paintings by George and Alice Bailey, as well as works by Vern Bagwell, and works by early composers such as Jean Magritte, Pierre-Auguste Renaud, and Nicolas Carré. Inaugurating the museum is the new series “PURPOSE.” The show will present the work of seventy-six artists, including Pablo Picasso, Pierre-Auguste Renaud, and Bechdel, and will begin with an introduction by artist Rachel Ashabey. The thirty-fifth iteration of the exhibition will be held at the Museum of Modern Art in New York. The fifth- and penultimate editions will be staged at the Museum of Modern Art in London and the Palazzo Nazionale di Plotigliana in Venice.\n\n\nThe British Film Institute (BFI) in London announced today that it is working with a new digital platform, the BFI Hub,", "The next Biennial should take place in 2021. We look forward to working with you and listening to your ideas. If you have any suggestions on how to improve the program, we welcome your feedback. We hope you will continue to enjoy the exhibition as we continue to grow and evolve.\n\n\nThe Museum of Modern Art (MoMA) in New York has become the latest cultural institution to announce that it is working to increase the museum’s renewable energy use by 100 percent by 2025. According to the New York Times, the museum will invest $10 million over the next two years into transforming its parking structures into energy-efficient mini-grills and will work with local, state, and federal governments to install the technology in all of its buildings, including the Metropolitan Museum of Art, the Brooklyn Museum, and the Bronx Museum of the Arts.In a statement, MoMA said: “Since the turn of the century, the museum has been working toward reducing its greenhouse gas emissions. The new plan, announced today, will help us meet our commitments to the Paris Agreement and will help us meet our obligations under the Clean Air Act. We were already reducing our carbon footprint by 25 percent last year, and this new plan will help us achieve that goal even more", "The next Biennial should be held at the new museum in 2020. \n\nAvengeworks, the fine arts space that has a location in Belgium and is run by artist Annie Godel, has received a donation of $5.5 million from the Schwartzeit family, which owns the French luxury conglomerate Saint Laurent. The donation is the largest gift in the company's history. In addition, the family also owns UBS, Gillette, and Tag Heuer, the brands that comprise the collection.The gift was made at a exhibition dedicated to the brands at Ato Reate, in Brussels, on November 6. Godel, who created most of the clothing brands with her husband, Louis Vuitton, will receive the state of Belgium's annual giro prize, which is awarded annually to a Belgian artist. The giro is a triennial of the 80th Venice Biennale, which will be held in 2021. \n\nAdrian Piper, the British photographer best known for capturing the face of the Israeli occupation, created a monumental work that confronts and challenges the Israeli government’s policies in the West Bank. “While most of his subjects were under the occupation, Piper shows how occupation makes us more vulnerable,", "The next Biennial should take place in 2022. To be held at the University of Texas, Austin, in Downtown Austin, the city of Austin will temporarily close to traffic in February 2022.  “We are grateful to the City of Austin for recognizing the historical significance of the site and recognizing that the city’s high-speed rail project will greatly benefit the city of Austin and our region,” said San Antonio Mayor Ron Nirenberg. Local developer Kenneth Harrison, who is represented by the firm SAC Architecture, is currently working on a new plan to re-open the airport, which has remained closed since March 19. \n\n\nThe Royal Academy of Arts (RA) in London has appointed Christo, Paolo, from the City of London, as its next director. Christina Vassallo, the director of the National Museum of British Art in Washington DC, and Nara Barlow, the director of the National Museum of Antique Art in London, will serve as the new co-chairs of the academy. “Christo’s appointment marks a new chapter in the history of the RA, which has been in the making for more than forty years, and I am excited to work with", "The next Biennial should take place in Almaty, Kazakhstan, in the spring of 2021. Following the completion of the exhibition, the artists will be able to return to Moscow to continue their research and the exhibition will present the first phase of the next installation, “The Secret of Eternity.”\n\n\nThe British Council has awarded a total of eleven artists a £20,000 ($23,000) grant for their work in the upcoming season of the Triennial. The 2019 awardees included J.M. Akram, Yael Hochner, and Patrick O’Connell, as well as a selection of works by three artists who have previously received honorariums: Gidon Jacob, Mira Pape, and Benoît-François Pape.Each year, the Council organizes the annual “Triennale Delegation,” which includes works from forty-four artists and is organized as a kind of experiment in cooperation between the artists and the Council. The program culminates with the opening of the museum’s main exhibition, “The Crucible: The Study of the Art of the Year 2020” at the National Art Gallery in London on February 9–March 5, 2020.", "The next Biennial should take place in 2019.\n\n\nThe Whitney Museum of American Art in New York has informed the artists who will be featured in the program “The Future Is Present: Art as Performance in the Twentieth Century,” which will run across three floors of the museum from September 11 to September 13, 2019. The exhibition, which will feature the work of sixty-five artists and occur at varying elevations in the Whitney, will highlight the work of women and non-binary artists, as well as the work of Native American artists and artists of color.“This is a moment of transition for many of us, and for the world,” said Steven H. Lee, the interim director of the Whitney, about the exhibition. “It is a moment of renewal and renewal\u0097it is a moment of freedom. We want to make a collective effort to address the systemic violence that our current moment perpetuates, by exposing the hidden histories and intersections of complicity that create unequal trajectories for our art and our world.”The exhibition will explore issues such as the transition from rural to urban life, the concurrent impact of climate change and incarceration on local communities, and the need for community renewal. The artists chosen for the", "The next Biennial should be held in 2020. \n\n\nCiting the deteriorating state of the Polish arts, the Polish government is planning to reduce the stipends of nearly one thousand local institutions by March 2020, as part of a $200 million aid package. According to the New York Times, the government will also reduce funding for the promotion of Polish culture abroad, and Polish cultural workers would not be paid through the end of the year. The move is part of a wider austerity package that aims to reduce the nation’s $210 billion budget deficit, and to raise funds for the National Alliance for the Preservation of Culture, Art, and Heritage (DANS). The cuts will affect everything from the operating budget of the regional museums of Warsaw, Kraków, and Wrocław, to the collection and exhibition programs of the regional museums of Stalingrad and Novy Galerie, and the collection and exhibition of works by Polish architect and artist Jarosław Kaczyński.While the state is giving $200 million to Balkans, the Polish Parliament also approved a $180 million aid package for the Arts and Cultural Heritage, which will go toward laboratory research on new", "The next Biennial should focus on “themes of resistance”—which will be a recurring theme of this year’s event. “In the most recent biennial, we chose to focus on the legacy of resistance,” said curator Marina Araujo, a professor at the University of the Andes and a founding member of the Biennial Committee. “The theme of resistance is so universal and basic to us as a culture that we have to be able to recognize it in all of us.”\n\n\nThe Bahaḵi International Center for Art and Design (BICAD) in New York has released the list of seventy-three artists who will receive the 2018 Bahaḵi Art Award. The biennial, which will honor thirty-six artists from twenty-seven countries across the globe, will be staged in the summer of 2022. The BICAD Artist Awardees are: Anton Chekhov (Serbia), Ahmad Akram (Egypt), Amr Hajduk (Pakistan), Larissa Anwar (United Arab Emirates), Amr Rashid (Iran), Amla AbdulMajeed (Iran), Anthony 'Tony' Rapp", "The next Biennial should be held in 2020.  The full list of participating artists is as follows:Arturo Casals, Madrid. Mariana Campos, Mexico City. Mariana Crespo, Rio de Janeiro. Mariana Crespo, Rio de Janeiro. Mariana Crespo, Rio de Janeiro. Mariana Crespo, Rio de Janeiro. Karolina Wojtas, Warsaw. Mariana Crespo, Rio de Janeiro. Mariana Crespo, Rio de Janeiro. María del Carmen Carrara, Miami Beach, Florida. María Del Carmen Carrara, Miami Beach, Florida. María del Carmen Carrara, Miami Beach, Florida. Sara D. Lalli, New York. Sara D. Lalli, New York. Sara D. Lalli, New York. Sara D. Lalli, New York. Mariana Crespo, Rio de Janeiro. Sara D. Lalli, New York. Mariana Crespo, Rio de Janeiro. Mariana Crespo, Rio de Janeiro. Mariana", "The next Biennial should take place in 2022.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has appointed Daniel Pirotte, the director of the New Museum, as its next director. Pirotte will assume his post in January 2020. Prior to founding the museum in 2002, he served as the director of the Museum of Modern Art, New York; the Hirshhorn Museum, Washington, DC; and the Metropolitan Museum of Art, New York. Pirotte’s new role will enable him to expand the museum’s collection and programmatic expertise in the city, as well as serve as an advocate for New York’s arts and culture and its people.“I’ve been a board member of the DCLA for twenty-four years and have been a patron of the museum for thirteen years,” said Pirotte. “I’m looking forward to continuing to support the museum’s mission through a new and diverse collection that reflects the city with a renewed sense of purpose, and an energized audience.”Pirotte succeeds Mark S. Cohen, who has served as director of the Metropolitan Museum of Art since", "The next Biennial should take place at an undisclosed location in the United States. The first iteration of the event will run from March 22 to March 28, 2020. This iteration will include a retrospective of the work of several artists who were chosen to represent Sweden at the 2019 edition of the fair. The next iteration of the fair will be held at the Stockholm Olympia from March 26 to March 28, 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it is working to finalize a new multiyear contract with photographer Meredith Monk. The institution will donate ten works by the artist to the museum. The donation includes photographs of the work of Egyptian and Palestinian artists as well as her own work The Outer Space: A Presentation of the Children of Jabal Al-Hadid, 1926–1927.In a letter written by Monaghan to the Los Angeles Times, she described the donation as a “social contract:” “I support this more than I have ever supported any other donation. The work of Meredith Monk is a rare collection of works that reflect the richness and depth of her artistic vision.”The donation was made in memory of the late artist and educator Barbara Aitken, who", "The next Biennial should be held in 2021.\n\nThe prestigious Prix d'Art Moderne in Paris is the latest institution to cancel a major art event due to the coronavirus—France’s Culture Ministry announced on Friday that it was suspending the event until October 7, the earliest date that would have been feasible on the ground. While the institution still expects to stage the event in 2021, organizers are now working towards shifting the event to 2022.According to Le Monde, the French ministry has already spent over $4 million renovating the former Exhibition d’Art Moderne in Paris. While the renovation will not be complete until 2022, the ministry expects to be able to stage the event in 2022.In order to reduce the risk of the coronavirus spreading to the institution, the Ministry of Culture and Sport is giving the green light to institutions to open their doors and host up to six exhibitions. The news comes on the heels of the urgent need for France to prepare for an outbreak of the virus, which is currently known as Covid-19. France currently has the highest number of cases in Europe, with an estimated 5,800 cases, and the country currently has the highest number of deaths in Europe.\n\n\nThe Museum of Fine", "The next Biennial should be held in the Fall of 2020. \n\n\nThe Museum of Arts and Design (MAD) in New York has appointed Diana Prince as its next director. Prince joins the institution from the Metropolitan Museum of Art, where she was the deputy director of public engagement and chief curator for seven years. She succeeds David Kiely, who retired after eight years in January 2019, and will take up the post in August.“Diana is a strong, articulate, and caring leader who has been instrumental in transforming the museum into a powerful civic and cultural voice in New York City,” said David Kiely. “Her ability to move beyond the typical curator’s career trajectory and develop new paths for artists, scholars, and the public will be crucial for realizing the museum’s vision to become a cultural hub for the greater New York City area.”Prince began her career at the Met in 1997 as a curator of modern and contemporary art, and has since worked her way into the curator’s chair. During her tenure at MAD, she curated exhibitions that included “The Red Hand of Hell: From the Ghent Biennial,” “New Dimensions: Art in Motion,”", "The next Biennial should be organized and curated by an industry leader, and should take place in the City of London in 2020. Q: In 2018, the Yuz Museum of Art and the Institute of Contemporary Art (ICA) in Milan created the public art show “Eleventh Venice.” What about the Smithsonian’s “Centennial of Modern Art” ? A: The upcoming season of the Smithsonian’s “Centennial of Modern Art” will not be a celebration of art, but rather a reflection on the themes and the mission of the institution. It will focus on how art can be a vehicle for social change and will draw on the collections and research of the museums for the first time. This is the first time the Smithsonian has staged a \"Centennial of Modern Art” in the US since 2006; its previous iteration, “11 years,” was at the New Museum in Washington, DC, and was organized by curator Victoria Stierli. \n\n\nNew York’s Metropolitan Museum of Art (MoMA), which recently laid off or furloughed more than one hundred employees after the institution failed to mitigate its financial impact by early March, has pledged", "The next Biennial should focus on the radical ideas that are central to the work of Tadeusz Klimczyk, who was awarded the Order of the Polish State in 2017 for his contributions to the creation of the Biennial in Kraków, Poland, and will present a programme of lectures that will culminate in an exhibition at the Museum of Art in Philadelphia. The museum will also unveil its first-ever general-admission art museum, which will be located in a former munitions factory and will offer contemporary art exhibitions.  Advertisement\n\n\nThe Museum of Italian Modern Art (GiMo) in Milan has been forced to cancel a major exhibition of paintings from the Medici–Feltrinelli family following a dispute over the exhibition’s inclusion of a work by the artist Piet Mondrian. In a statement issued on Friday, the institution said that the decision to cancel the exhibition had been made following a review of the work by the acting director, Christian Gabrielli, who is known for including works by the Giustinian families in his catalogues, including Francesco and Gioia Giustinian’s Spiral Voyage, 1960, which was shown in the exhibition “The Italian Moderns,", "The next Biennial should take place in the coming months and will present a selection of works by artists, including: Kevin Beasley, Sylvie Balsom, Anne Wintour, Robert Irwin, and Johanna Kounellis. The theme of the exhibition is “L-Theory,” and the first issue of the series, “The Evolution of Pleasure,” will likely consist of interviews with individuals agreed to be interviewed for the exhibition, including Robbe de Vogue, Anna-Sophia Harrison, Joanna McCovey, and Markus Hjørgensen. A second issue, “The Evolution of Pain,” will likely be a multi-month project, with the intention of exploring the interdependence of sensory and affective selves in relationship to the body and will likely focus on the role of art and the body in the lives of the participants.\n\n\nThe Egyptian museum in Alexandria, which was forced to evacuate its visitors on March 23 after a deadly terrorist attack on the museum by a group of men armed with knives, has opted to postpone the opening of a new exhibition, “Egypt: A Landscape of Violence,” by American artist and", "The next Biennial should be staged in September.\n\n\nThe Chicago Architecture Biennial has announced the twenty-nine artists who will participate in its second edition, dubbed the Chicago Architecture Stories, which will take place in the city from March 18 to March 19. The event will also bring together new works by twenty-three artists from twenty-six countries, including Brazil, Canada, Germany, Ireland, Italy, and the Netherlands.The sixty-two-piece production arm of the Chicago-based nonprofit organization Chicago Architecture Research Center (CARE) launched its inaugural exhibition at the biennial at the same venue in June 2019. “The biennial is a critical and timely platform for the art of Chicago,” said Lisa Steadman, the biennial’s executive director. “Paying homage to the original biennial, ARTnews will highlight twenty-nine works and their impact on Chicago’s architecture, architecture, landscape, and design.”The biennial will feature work by fifty-nine artists from thirty-five countries. The themes of the exhibition are architecture, design, designers, architecture, design’s impact on urban life, design’s role in the global environment, design’s relationship with nature", "The next Biennial should be held in October 2020 and will only be two weeks long. The theme of this year’s exhibition is “Creativity and the Law in Contemporary Art.” The first exhibition, “The Painter’s Studio,” will feature work by twelve artists, including Adrian Piper (New York), A.J. Ingo (New York), and Mihai Kojima (New York), and will run parallel to the fourteenth Biennial. The second show, “The Client,” will feature work by twenty-six artists and will be held at the Custom House in Shanghai.The full list of participating artists is as follows:The Biennial will be held in New York City from March 28 to March 29, 2020. The exhibition will include fourteen works by fifty-nine artists and will run for three weeks. In addition to the works mentioned above, the project will include a lecture series, a series of public performances, and a seminar.The full list of participating artists is as follows:\n\n\nThe French company Artméto has announced its representation of the late French designer Guy Debussy, who was considered the father of modernism and a pioneer of the avant-gard", "The next Biennial should be held in 2022, and the 2022 edition should be held in Morocco. The 2020 event, “The Quest for a Feminist Future,” was held in London.\n\n\nThe Museum of Modern Art (MoMA) in New York announced today the twenty-five artists who have received the $1 million Hugh Menzies Award for their exhibitions or performances in the last twelve months. The award was created by the Hugh Menzies Foundation in recognition of his lifelong commitment to showcasing the work of women artists. The nominees for this year’s award are Joseph Beuys, Jodi Throckmorton, and Lisette Sargent, and they will be presented with the honor at an award ceremony on September 24.“We are thrilled to announce the twenty-five artists who have made important contributions to our art collection and their achievements,” said Christopher Gavin, director of the Hugh Menzies Award. “In addition to these talented artists, we are inspired by the breadth and depth of their artistic and intellectual practices. We look forward to honoring these artists and their outstanding contributions in 2019.”In recognition of their achievements, the awardees were given a $500,000 cash prize; a sym", "The next Biennial should take place in 2020. “We are currently negotiating with the exhibitors and need their help to finalise the exhibition, which will be curated by the curator, Elvia Coppola, and his team,” said Italian art historian Giulio Cipolletta. “To create a new series of exhibitions that will be a combination of the original themes of the previous years, and that will be able to call for the artists.”The 2020 edition of the Biennial will be held at Fiumicino, Italy; later this year at Milan; and in the spring of 2021.\n\n\n\n\n\n\nThe Museum of Modern Art (MoMA) in New York has released the list of seventy-eight artists who will participate in the upcoming exhibition, “For the Future of Art,” at the museum. The exhibition will be curated by veteran MoMA curator Steven Mullican and will run through March 18. Titled “Future of Art: The Art of the Collaboration,” the show will feature work by seventy-three artists and will showcase five new works by twenty-eight artists.Among the artists chosen to participate in the exhibition are a group of atmospheric sculpt", "The next Biennial should take place in 2020 and will be hosted at the Württembergischer Kunsthalle Berlin. The exhibition will be organized by the Haus der Kunst, and will include work by several hundred artists, including John Akomfrah, John Gordon, Marik Mamedy, and Peter Tung.The full list of participating artists is as follows:Angela Bächli (Berlin)Art of the Body (New York)“I’m a Young Artist” (New York)Art Society (New York)Art of Human Life (New York)Art and Death (New York)Art of Life (New York)Art of Life (New York)Art of Life (New York)Art of Life (New York)Art of Life (New York)Art of Life (New York)Art of Life (New York)Art of Life (New York)Art of Life (New York)Art of Life (New York)Art of Life (New York)Art of Life (New York)Art of Life (New York)Art of Life (New York)Art of Life (New York)Art of Life (New York)Art of Life (New York)Art of", "The next Biennial should be held on the theme \"Livability as an Organizational Concept\", which will focus on the work of Domenico Dolce and the German designer Arne Glimcher. The exhibition will also take up the themes of Food, Death and the Body, and Energy and the Body. The exhibition will be hosted at the exhibition space ARTsterdam until May 2020. The second edition of the show will take place in the artist’s hometown of St Stephen’s Place in Amsterdam, on May 10–June 8, 2020.\n\n\nAhead of next year’s Fifty-Eighth Venice Biennale, which will be held in the city of Venice from May to June, 2023, the Italian government is offering to build a new museum in honor of the Italian architect and theorist, Giuseppe Cattelan, and his legacy. The proposal for the exhibition space is a collaboration between the Ministry of Culture, the Office of Culture and Sport, and the Fondazione Cattelan, and is part of an initiative to re-invent the institution, re-create a contemporary space for Giuseppe Cattelan’s works, and re-frame the", "The next Biennial should be in the spring of 2020.\n\n\nThe Maritime Museum in New York has appointed Anne-Marie Kaeler as its next associate curator. Kaeler, who has worked at the museum for more than twenty years, will assume her new role in June. Kaeler joins the institution from the Metropolitan Museum of Art, where she has worked since 2007. Kaeler will begin her tenure in July.“I’m thrilled to be working alongside Anne-Marie Kaeler and her brilliant team at the Maritime Museum,” said curator-in-charge Daniel H. Pink. “As a curator, I’ve worked all over the world to make sure that the Maritime Museum has always been in touch with its local communities and was able to engage in programs that would help shape the very culture of New York City. Anne-Marie’s presence at the Maritime Museum is a big step in that journey and I’m looking forward to working with her.”Prior to joining the Maritime Museum, Kaeler worked as a curator at the Paris Museum d’Arles and as a curator at the Museum of Modern Art in Rome. In 2018, she was awarded the Silver Lion", "The next Biennial should focus on art and design, with a particular focus on the history of the art through the history of the art. The news comes five days after the exhibition closed to the public, and six days after the well-publicized trial, in which fifteen artists were given a suspended death sentence in the city of Doha.“This is not a time to rest in a comfortable chair, but a time to play the role of a curator,” said Finn Jervis, director of the Biennial and curator of art at the Museum of Contemporary Art Copenhagen. “The Biennial is an artistic project, an attempt to make sense of a fragmented world in which we live. We hope that this exhibition will unite us once more in our shared conviction that art is the lifeblood of culture.”\n\n\nThe Hirshhorn Museum and Sculpture Garden in Washington, DC, has appointed Anita Tallman as its new associate curator of the American Southwest. Tallman comes to the Hirshhorn from the Metropolitan Museum of Art, where she has served as a director since 2015. She succeeds Kate Fowle, who retired in December after seventeen years at the helm of the Hirshhorn and will assume her responsibilities", "The next Biennial should be held in the fall of 2021.  The 2020 edition, titled Art & Cultures, was curated by Kate Crawford, and was held at the Domperdommel Gallery in Vienna, Austria. In an open letter, Hayek, who died in 2008, warned that the project “depends on the actor taking part in the event being staged believing that the artworks are there’s no doubt that the Artists’ works are there’s no doubt that the artworks are there, just as the people who created them believe that they’re there.”  Curator Marc-Olivier Brouwers said the exhibition took a first step in this direction by entertaining the idea of “a cultural state without borders.” A biennial is a complex, multi-dimensional collection of works made in any one exhibition. It does not necessarily have to be the same exhibition as the event being staged, and exhibits or performances may also be arranged to reflect the performance, play, or literary work of the artist.  The 2019 iteration featured works by forty-eight artists, including Angel Derad, Frances Nesjkovic,", "The next Biennial should commence in the spring of 2021. The exhibition will feature works by seventy-three artists. \n\n\nThe Museum of the City of New York (MoCA), which was forced to temporarily close in March due to the Covid-19 pandemic, has dispatched veteran conservator Patricia Hall to a new institution that will house its vast collection of nineteenth-century art. The institution, called the National Museum of American Art, will be located on the National Mall, adjacent to the Smithsonian American Art Museum, and will be inaugurated by a new performance piece by the artist Anne-Marie Robinson. The institution also plans to house the collection in a museum that will serve as a home for the collections for twenty years. “In these uncertain times, we are grateful for the support of our dedicated team and friends,” said museum director Christopher Bedford. “As MoCA’s former president, I’m proud to have worked on and launched this ambitious project. We are excited to introduce our collection to the public and to the world in a museum that has served as a home for so many of our artists.”Inaugurating the National Museum of American Art, which will debut in 2020 and will host thirty", "The next Biennial should take place in 2020, and the 2019 might be re-created with an additional show in 2022. These are the only two years the biennial will be open to the public, with the rest of the twelve-year cycle being shuttered. The 2019 edition, titled “The New Humanities,” also marked the end of the project, and the years 2020 and 2021 will be dedicated to “The Future.” The rest of the fifty-ninth Biennial will be organized around the theme of the ’80s, ‘80s, and ’90s, with the first two performances taking place in early 2020 and the last two performances of the year 2020. The 2019 and 2020 editions of the biennial were slated to run concurrently, but were pushed back to coincide with the beginning of the next academic year.\n\n\nThe Hirshhorn Museum and Sculpture Garden in Washington, DC, has appointed Sharon Lewis as its next executive director. Lewis comes to the institution from the National Museum of African Art, where she has served as the interim executive director since September 2019. During her tenure, she has urged the museum to restart the Hunt for a New African American Museum (NAM),", "The next Biennial should be held at the Institute of Contemporary Arts in London next year, and will provide an opportunity to reexamine the history of modernism in art and design.\n\n\nThe Museums Association (MA), the United Kingdom’s major trade group for museums, has issued a statement urging the government to allocate £15 million in aid to help the country’s cultural institutions recover from the coronavirus. Many are concerned that the crisis could persist for months or years longer than originally anticipated, leading to a financial crisis only made worse by the possibility of an economic downturn.Since the outbreak of Covid-19 in the UK in March 2019, the UK has spent more than £1 billion on its museums. The UK’s Department for Culture, Media and Sport (DCCMS), which handles the museum sector in the UK, expects the industry to be hit by a loss of 150,000 jobs as a result of the Covid-19 pandemic. The Department for International Business, Innovation, and Skills (DIBIS), which manages large-scale art collections, is forecasting a loss of 150,000-170,000 jobs.The UK’s Institute of Contemporary Arts (ICA), which represents the", "The next Biennial should be held in 2019.\n\n\nThe Cenotaph Foundation and the British Museum in London have announced the bidding for the 2019 edition of the São Paulo Biennale. The center-left museum, which was founded by a group of artists, writers, and academics in 2002, will be awarded $35.2 million as part of a $103 million gift from British Prime Minister Boris Johnson\u0097the first British monarch to visit any Brazilian city since 1819. The gift will also see the construction of a new 40,000-square-foot exhibition space in the museum.“The biennale is growing at an unprecedented rate, with audiences and events growing at an unprecedented rate,” said l'Etoile de Portugal, director of the Portuguese pavilion. “We are grateful for the support of our partners in social enterprise and especially British Museum, which has made this possible. They have given us the mandate to organize and to support the show.”The biennial, which will run from May 1 to February 23, 2020, is supported with funds from the Tate, the Royal Shakespeare Company, and the Royal Shakespeare Company, the London-based nonprofit corporation that represents the Royal Shakespeare Company, and the", "The next Biennial should take place in 2020.The exhibition of the work, titled “Temple of the One and the Only,” will raise funds and awareness for the Palestinian Campaign for the Academic and Cultural Boycott of Israel. Although the exhibition was organized by the American Foundation for the Humanities, the exhibition is part of a larger trend of Western art and contemporary culture that has focused on the boycott of Israel.Artforum has reached out to the fair for comment.\n\n\nThe Museum of Fine Arts (MFA) in Boston, which was once considered one of the country’s most prestigious arts institutions, announced that it decided to close its doors permanently, effective immediately, after an investigation into allegations that the institution mishandled complaints about the exhibition “The Act of Killing,” a 2014 exhibition featuring the work of the artist Kathy Kennedy, who was one of six women to publicly accuse the institution of sexual harassment or assault in a landmark lawsuit last year.The museum, which admitted to the accusations made against Kennedy in a statement to Artnet News last year, decided to end its relationship with her after a board member of its board of directors, Nicholas Negrete, allegedly told a group of donors in Boston in April that it only wished to", "The next Biennial should take place in January 2021. The 2020 edition, “Feminine” was selected as the theme for the inaugural event. \n\n\nChina’s state-run construction arm, the China National Museum (CNMI), has unveiled a new addition to its visual arts collection, a monumental twenty-sixth-century painting by Wang Zhiyang. Wang’s painting, The Painted Victory, 1798, is one of the most important works by the artist, a major proponent of  historicist urbanism, and a major influence on the development of the modern Chinese urban landscape. “This is a monumental achievement,” Wang told the Art Newspaper. “I was inspired by the work’s use of tradition and historical objects to investigate the role of art and architecture in accommodating modernity.”A tilt-down opening ceremony at the museum will follow in January 2021, with a guided tour of the museum and a discussion about the new museum’s collection with the artist, a collection of his paintings and drawings, and Wang’s wife.The event will be followed by a solo exhibition of Wang’s paintings at the Beijing Fine Arts Museum", "The next Biennial should take place in 2021 and be centered on the directorate’s contribution to the development of international art, namely the Collaborative Generation Project and the Art of the Presence. The Biennial will be at the site of the old Generalitat of Venice (IT) and will aim to address the subject of the directorate, which is currently under scrutiny by the Grand Chamber of the Republic of Naples for its connection with the steelmakers' CIE Group.\n\n\nThe Rockefeller Foundation and the National Museum of American Art in Washington, DC, announced today that Annie D. Rosenwald and Dona Ana Roesler have been selected as the winners of the 2020 Joan Mitchell and Sidney Sheldon Award for their work in the digital realm. The prestigious fellowships were recognized by the Joan Mitchell Foundation in partnership with the National Museum of American Art. Rosenwald's work will receive an additional $2,500 in support of the Joan Mitchell Center for Feminist Art in New York, which will launch in 2021.“The Joan Mitchell Foundation is excited to support the work of Annie and Dona Ana Rosenwald, who have been instrumental in advancing the art of digital communities, aiding the development of our digital collections, and supporting scholars across the country,”", "The next Biennial should focus on the history of the art of the Americas, with a particular focus on the development of the practice of the Americas in the Americas. Its inaugural edition will open in June 2020 and will be followed by a second edition in the Netherlands in October 2021.\n\n\nThe twentieth edition of the Biennial, billed as the largest exhibition of contemporary art in the capital city of Buenos Aires, has postponed the event by a month. The 2019 edition of the event was held at the Museo de Arte Contemporáneo, in the city of Buenos Aires, and ran from January 7 to January 10. The exhibition was organized by the Center for Contemporary Art, including David Alvarez, Sâgnia Cervetto, and Edoardo Cipolletta, and featured works by artists such as Francesco Francavilla, Leon Golomb, Hélio Núñez, and Rodolfo Laporte.The event was initially scheduled to take place in April, but the cancellation coincided with the reopening of the Museo de Arte Contemporáneo. The center reopened on May 12.\n\n\nLynda and Stewart Brandt of the Los Angeles-based nonprofit The Brandt House", "The next Biennial should be held in May 2020 and will include the exhibition of the work of a dozen artists\u0097Marija, Alexander Calder, Nanda Galindas, Pia Camil, Carolene Coreth, Isamu Noguchi, and Cynthia Nixon, among others. This year’s event, “The Bamboo Ceiling,” was organized by the city of Foshan and was curated by Isamu Noguchi.\n\n\nThe Metropolitan Museum of Art (MMA) in New York has announced that it is planning to open three new galleries by the end of 2020. The first, a new exhibition space called a pavilion, will be located at 440 East Seventy-Second Street in Manhattan, with the second, a new cultural center, the Metropolitan Opera House, on the Upper East Side, in 2021. The third and final, a new sculpture museum, the Metropolitan Museum of Art, will be inaugurated in 2022.The Metropolitan Museum of Art, which recently unveiled a series of new works by artists including Max Beckmann, Rupert Grint, and Yinka Shonibare, has also said that it plans to extend its reach beyond New York to Los Angeles, the San Francisco", "The next Biennial should be a triumph of the artist and not a representation of art, of the artist and not a representation of art.”The Art Newspaper has also revealed that the next edition of the Neue Galerie BOB will be held at the Palais de Tokyo in Paris on November 13–16. The event will be hosted by the Parisian institution and will draw a grand total of 3,700 visitors from fifty-five countries. The fair will also introduce a new section which will be curated by the artist Arsht Kiani, and will focus on female artists. The selection of the fifty artists chosen to participate in the exhibition was made with the support of the König-Bickelig group, and featured work from twenty-three artists from the exhibition’s first list and twenty-four artists from the second list. The artist list for the biennial is as follows:The 100 Artists of 2013 will present its first exhibition at the König-Bickelig in the spring of 2020. The first show at the König-Bickelig will be the artist-installations Josette Bianchi, Nancy Birnbaum, Anna", "The next Biennial should be held at the San Francisco Museum of Modern Art in the spring of 2021.\n\n\nThe Turkish curator Emina Alemami, who served as the artistic director of the Dünyamadağ Biennale from 2016 to 2017, has died at the age of sixty-five at her home in the capital, Ankara.After a four-year research project into the Armenian diaspora in Istanbul, the curator returned to Istanbul in 2018 to inaugurate the Diyarbakır Contemporary Art Museum, the only museum devoted to contemporary art in the nearby city of Çatalhöyükte. According to the Art Newspaper, the new museum is dedicated to the Armenian diaspora, which comprises a collection of more than 1,500 works.“Emina Alemami was a pioneer of contemporary art in Turkey,” Kavalaş, a curator at the Skopje Art Museum in northern Greece, told the Art Newspaper. “Few other people had the chance to work in the country with such passion and enthusiasm and she was the key in creating the Diyarbakır Contemporary Art Museum.”Born in Istanbul in 1923, Alemami studied at the Academy of", "The next Biennial should take place in the spring of 2021.\n\nThe second exhibition, “The League of the South,” will be open on September 24 and run until October 4. “There is still much that we cannot see, hear, or touch,” said João Ribas, president of the Biennales da Anhães. “The theme of this year’s edition of the Biennales is light, color, and unity and how we can transform our worlds together.” The exhibition’s inaugural iteration, “The Immigrant Diaries,” was organized by an Indigenous collective and was led by artists Christine J. Pica, Louwrien Oosthuizen, João Ribas, and María Berríguez. The journey to the islands of the Andes and atolls of the Caribbean was accompanied by an earthworks, a performance, and a documentary, entitled The Untouchables, which was created by a group of Indigenous artists.The 2018 edition featured work by artists including María Berríguez, Jörg Werner, and Miguel Ángel Torres-Santiago, who each created a new installation", "The next Biennial should be held at the Museum of Contemporary Art, Miami Beach, in December 2021. “The museum’s collection is significant not only in terms of its body of work but also in its transformation as a cultural institution,” said Richard Armstrong, the director of the museum and a cofounder of the local arts organization the Black Box. “Over the course of its four-decade history, the Biennial has evolved into becoming a living laboratory for the art and ideas of East and West. We are honored to continue the tradition of having a voice in the making of works by artists of marginalized groups in the art world,” he said. For Kato, the next iteration of the Biennial will provide a “new role for art.”\n\n\nAs the number of people killed in the fires at Grenfell Tower continues to rise, more museums and galleries are realizing the futility of trying to contain the blaze. The third edition of Art in America, which runs through March 2021, is no exception, and the South London Gallery (SLGC) began closing its doors to the public in an effort to reduce the number of people flocking to its space. The institution, which is currently closed since", "The next Biennial should be held at a site selected by the city of Beijing in 2020, the city administration said. The exhibition will be hosted by the Beijing Art Museum.\n\n\nNatalie Johnson, the American novelist and philosopher, whose influence on art, politics, and art history was far-reaching, has died at the age of eighty-seven.Born in New York City in 1941, Johnson earned her undergraduate degree from Columbia University and earned her master’s degree from the University of Virginia in 1964. Her fiction, essays, and books often confront questions of gender, race, and politics, and have been translated into numerous languages.Her most recent book is The Body Politic: Biography and Feminism in American Art (Picador, 2018), a platform for which-to-the Arab Spring and the current political climate. “Johnson has been the primary force behind the American canon, both as a writer and as a curator,” Leonore Peters, a former board president of the University of California, Los Angeles (UCLA), told the Art Newspaper. “She has been and will continue to be a guiding force for critical thinking about the American canon and its history.”Born in Washington, DC, in 1941", "The next Biennial should be held sometime in the third quarter of 2020. The first one, the BIM , was held in the first quarter of 2019. The upcoming event will be held at the San Francisco Museum of Modern Art (SFMoMA) from March 16 to March 20 and will feature work by fifty-two artists from ten countries.The 2020 edition of the FHAG Biennial will take place at the St. Louis Art Museum from March 19 to March 21. The exhibition will celebrate fifty-six years of the American artist’s career, which includes work by work by artists such as Richard Avedon, Michael Chaudhari, and Alan C. Friedman, among many others. “The FHAG’s commitment to the preservation of the Biennial as an enduring cultural asset has always been our guiding principle,” said FHAG president and CEO Michelle Robin-Williams. “We are privileged to have been able to build on its legacy by fostering an appreciation of the extraordinary breadth and depth of American art history, and by introducing new artists to the art world through an interactive exhibition format. We are also proud to participate in the major national and international art events of the year with a series of exhibitions that reflect", "The next Biennial should be held next spring. \n\nThe London-based artist, who has had her work exhibited at the Venice Biennale three times, has resigned from her position as head of the Tate. She was appointed director of the Tate in London in the summer of 2019 and, following a tumultuous and sometimes contentious tenure at the institution, was promoted to the role of director of the National Museum of Britain in London.“Since the appointment, I have had great expectations of how the new role would unfold,” said Gillian, who previously held the director’s role at the National Gallery in London from 2006 to 2009. “Devoting my time and energy to this important and challenging role in my own right—and knowing that my work will be presented at the institution where I have had so much of my career—is a dream come true. I have been honored to be a part of this very special institution.” The institution has reported an operating loss of £3 million due to Covid-19 and has been working to cut costs in an effort to reduce the museum’s administrative footprint. In March, the museum closed to the public for three months following rehabilitation work. During her tenure,", "The next Biennial should be held at least once per year to represent the country in art. To date, there have been only three other biennials in the history of the country, in 2005, 2009, and 2014. “The biennial must be a celebration of the diverse histories and cultures of Australia and represent the many peoples of the world who have contributed to Australia’s cultural diversity,” said curator of contemporary arts and culture, Christo. “The biennial also depends on the artist to deliver an exhibition that expresses the richness and universality of their own narratives.”Christo also noted that the biennial is not restricted to the country’s borders but also encompasses the country’s history, geography, cultural heritage, and people. In order to avoid limiting the exhibition to just art, he said that the other themes of the exhibition should reflect the diversity of the country. For the first time, the show will feature works by Aboriginal and Torres Strait Islander artists.The biennial will take place at a time when the country is experiencing a period of great uncertainty due to the coronavirus pandemic, which has resulted in an exodus of people from their homes and has exacerbated climate change. The exhibition was inspired", "The next Biennial should take place at the Museum of Modern Art in New York in 2021.\n\n\nThe Pennsylvania Academy of Fine Arts has been granted a $1.25 million grant from the National Endowment for the Arts (NEA) in support of its 2019–20 season, which is currently underway. Located in the city of Philadelphia, the grant will provide funding for programming that will allow the Philadelphia Museum of Art (PMA) and the Museum of Arts and Design (MA) to offer programming to alleviate the financial impact of Covid-19.“This fall’s PAFA offers the best ensemble casts of any museum in the country. We are confident that the PAFA will continue to offer a compelling program of exhibitions and events that addresses the critical needs of Philadelphia’s diverse communities,” said PAFA director and CEO Benjamin Sulloway. “We look forward to including PAFA’s communities in future seasons with a yearlong campaign of programming that addresses the ground truth of contemporary art, the most important work being made in the city.”The PAFA’s inaugural season, “MAD/70” (2015–16), brought together twelve", "The next Biennial should take place in the spring of 2021.\n\n\nThe W.K. Kellogg Foundation announced today that it has formed a $50 million endowment to support the work of African American artists. The initiative, which will include the construction of a new building to house the collection of the late art historian and educator, Lillian Taylors, will support the preservation and research of the work of forty-one artists. Titled “The Black Arts & Poetry,” the program will be led by William R. Bennett, director of the W.K. Kellogg Foundation; J. Paul Getty’s granddaughter, Lourdes Rorke; and artist Yvonne Rainer.“We are thrilled by the support of this philanthropic community and are grateful for their continued interest in the extraordinary legacy of Lillian Taylors,” said Rorke.\n\n\nSylvia A. Larsen, chair of the board of trustees of the Museum of Fine Arts (MFA) in Boston, Massachusetts, has announced that it is returning fourteen collections from the institution to the state of Massachusetts. The collections were acquired through a twenty-five-year, $56 million campaign that involved the sale of", "The next Biennial should have been a success. We have undertaken a number of initiatives to support our artists to help them finish their works and to introduce new exhibitions, including in partnership with the Singapore Art Museum. We are also trying our best to encourage awareness and support of their art forms and their printmaking processes. We welcomed the public to the Biennial and are looking forward to presenting our next exhibition, 'Société d’Art et d’Art,” which will focus on the contemporary practice of contemporary art.Commenting on the successful run of the Biennial, Mr. Kim Eun-kyul, chair of the board of trustees of the Biennial, said: “We are grateful to our talented staff and public for their dedication and dedication to the work of the Exhibition and to the exhibition staff for their hard work in setting up the exhibition. We are also deeply grateful to the thousands of visitors who have visited the exhibition and the exhibition. The exhibition has become a model for exhibiting contemporary art at the highest level. The success of the exhibition is a success of our programme and our staff. The exhibition is a model for exhibiting contemporary art at a higher level.”\n\n\nThe Ferdinand Guildhall in Berlin announced today that", "The next Biennial should take place in 2021, during the Polaroid Art Fight, an initiative begun in 2006 to engage with local and international artists in Armenia. The exhibition will focus on how artists are using Polaroid cameras to create works that are accessible and can be viewed by the general public.Participating artists will include Adam Gao, Daryush Valizade, Nusret Juzantar, and Nisan Yerevan, and will be chosen from among a pool of twenty-six artists. The biennial will be held at the historical Art and Architecture Museum of Armenia in the capital of Artsakh, Yerevan.The biennial will be inaugurated by the exhibition “Yazdaran: The History of a Contemporary Life”—a collection of the work of contemporary artists in Armenia—and will include a selection of new works by forty-five contemporary artists and will include a biennial review of the work of a group of twenty-five artists from the Tatars in the Baku region of Azerbaijan\u0097the new event will be televised by Artnet.\n\n\nA group of artists who were selected to represent Japan at the 2020 Venice Biennale have announced that they are preparing a collective exhibition that will showcase the full", "The next Biennial should focus on “the possibilities for artmaking and intellectual and emotional growth from an ecological perspective.” It should also include a discussion of the history of contemporary art and artmaking practices.The festival will be held at the Silo Alkmaar in Amsterdam and will offer free admission.\n\n\nThe New York–based nonprofit Center for Creative Innovation (CICA), which serves as a hub for artists and arts professionals in New York City, has received a gift of $6.4 million from the Andrew W. Mellon Foundation in support of its Center for Creative Innovation, which seeks to advance the work of underrecognized, mid- to late-career artists and craft workers in the arts.The gift, which was made in support of a grant program that was established in 2017 by philanthropist Andrew W. Mellon, comes at a pivotal time for the arts. In the wake of the Covid-19 pandemic, the number of artists and craft workers in NYC has been steadily falling for years, and in some cases, for decades. CICA was founded with a $4 million grant from Mellon and has received $1.5 million from the Andrew W. Mellon Foundation since it was founded.Funded by Mellon and the", "The next Biennial should be announced soon. The exhibition will also have a digital version, which will open this Saturday, March 8, at 10 AM. The full list of participating artists is as follows:\n\n\nThe Arts Council, the UK’s charity that supports creative trade and culture, has announced that it is launching two new initiatives that will help UK arts workers. The first, a three-month residency program in London, will offer twenty-four short-term, full-time, and contract positions across a variety of sectors, including design, film, performance, and publishing. The second initiative, a Creative Engagement Challenge, will send twenty-four individuals to London for a month to engage with a variety of cultural and design institutions.This year’s Challenge, which saw artists collaborate with architecture, design, community, and design-focused organizations, was sponsored by Foster + Partners, the PR firm that represents Foster + Partners. The artist-run organization will donate $100,000 to the artists, and an additional $500,000 will be distributed to the arts and culture sector. The artists will be selected by a panel composed of Foster + Partners creative director Rowena Taylor, artist-in-residence Peta Allen,", "The next Biennial should be held in the coming years. \n\n\nThe Geneva Architecture Biennial (GABF) announced today that it will hold an event in New York next month and begin inviting artists to the United States in early 2021. The event, titled the Geneva Architecture Biennial: History of Modern Art, will include members from eighteen countries and will be co-organized by the French artist Gabriel Bichette, the Swiss architecture-designer Guy-Henri Neuville, and the Italian designer Gio Ponti.Inaugurating the event will be an exhibition of work by more than thirty artists, including Alex Katz, Milton Alsop, Oliver H. Griffin, Filippo Grandi, Jan-Dua Vogel, and Josè Verlieg. The exhibition will be curated by the Swiss director Matthias Lang, who will also serve as head of the exhibition. Among the thirty-six artists selected for the exhibition are Alex Katz, Beatriz Calderón, Gabriel Bichette, Guy-Henri Neuville, Marcel Prouvé, Joan Miró, and Helene Rose. The exhibition will also open with a presentation of work by the Italian architect Vittorio Catellani", "The next Biennial should commence in 2021. \n\n\nThe City of New York and the New York State Department of Cultural Affairs (DCLA) announced today that Liang Xiaofeng, the Chinese artist currently featured in the Whitney Biennial, will receive a gift of fifty works by three working artists from the city. The donation includes works by Jay-Z, Tipper Gore, and Brad Pitt.In addition to Liang and the city, the DCLA also announced that it received a gift of seventy-eight works by Colson White, whose work has been exhibited in the Whitney Biennial twice before, and that it will acquire eighty-two works by artists whose works have never been on view before, such as Robert Irwin and Benjamin C. Hellerman.Hellerman, a Chinese American whose work is currently on view in the exhibition “When Ghosts Sing” in Los Angeles, said he was “extremely proud” to receive the gift of the three works he has exhibited in the past:   A Nation of Ghosts, 2013, an assemblage work, within a museum; The Gift of the American Dream, 2007, a performance piece, and 2009, a painting. The works will go on view in the museum as the museum reopens", "The next Biennial should be held in the spring of 2021. Pérez-Higgins has since received a donation of twenty-six artworks from artist Joan Miró\u0097Artists from Spain, Italy, France, the United Kingdom, Germany, and the United States\u0097and has established a foundation to help him.Pérez-Higgins also stated that the biennial exhibitions should be shifted to a two-week format, and that the future of the exhibition should be decided by consensus. He also said that the future programme should focus on “cinematic and mythic,” “embracing the memory of the Spanish Civil War,” and “deepening the self-consciousness of the urban citizen\u0097as it is the fate of the city, the city state, Spain, and the world.”\n\n\n\n\n\n\nMónica Pérez-Higgins, left, and Felipe Massaro, center, who are currently embroiled in a legal battle over their ownership of a group of works by Pablo Picasso, Gessella’s son, and José Carlos Pérez-Higgins, who is serving a sixty-year sentence for tax fraud. (", "The next Biennial should be held in the first half of 2022, and the 2019 event was organized as a “fresh start.”\n\n\nThe Mimosa Prize—a five-year award established by the Metropolitan Museum of Art and distributed by the Mimosa Foundation—has named the Los Angeles–based artist Kathy Armstrong its 2020 recipient. Armstrong, whose practice spans sculpture, painting, photography, performance, and installation, was selected for her installation “Taft” at the fair’s March 2019 edition. The show, which was curated by artist-in-residence Wangechi Mutu as well as the artist-in-residence Wangechi Ndiaye, featured work by twenty-four artists and one non-artistic group.“Taft’s innovation, experimentation, and imagination unraveled the limits of our current conceptual frameworks, and she shows us how to rethink the fabric of the universe,” said MXF board president and CEO Ravi C. Telap, founding director of the A. I. du Pont Foundation for the Arts. “We are thrilled to support Kathy’s work, and look forward to her upcoming exhibitions, collaborations, and residencies", "The next Biennial should also include a global discussion about the future of art and design in the twenty-first century. “We will work together to shape this next Biennial into the next generation of world leaders, of curators and organizers,” said Barbara. “The last Biennial was best understood as a tour de force and as a celebration of the work ethic, creativity and intellectual rigor of an inspiring generation of artists.”\n\n\n\n\n\nABOUT THE FARMINGTON COLLECTION\n\nThe barnyard collection is an international visual art enterprise that celebrates the art of the American West, from its earliest stages, and ushers in the art of the future. The museum features fifty-one works by fifty-six artists, including Don Suttie, Eulogy C. Evans, H. R. Gander, and Jules and Lois Chapman, among others from the Pacific Northwest. The museum was established in 1936 by Morris Peele, who was a partner of the Vancouver-based firm of Evans & Peele, the Vancouver-based firm that developed the Vancouver Art Gallery. Peele was interested in establishing a new cultural venue in Vancouver and asked if they could develop a project for the city to help him sell", "The next Biennial should be held in 2020. \n\n\nThe Metropolitan Museum of Art in New York has appointed Kenneth C. McNickle as its new artistic director. McNickle is the founder of the museum, which has a museum, the McNickle Arts Center, and a collection of artworks dating back to the late nineteenth century. The appointment marks the latest development in McNickle’s career. He began his career as a curator at the Whitney Museum of American Art, where he served as director of exhibitions from 1991 to 2000. McNickle is also an adjunct scholar and coeditor of the forthcoming anthology Art and the Body: Modern and Contemporary Art in the Age of Americanity.McNickle’s first major retrospective was the Whitney Biennial in New York in 2003, which featured works by artists such as Johann Kapp, Ralph Stead, and Jean-Michel Basquiat. McNickle’s exhibition at the Whitney in 2018 featured works by artists such as Richard Avedon, Peggy Guggenheim, Mark di Suvero, and Richard Avedon’s sister, Anna-Sophia Gianotti. In 2018, McNickle received the National Academy of Arts’s Lifetime Achievement", "The next Biennial should be held in 2021; the first was held in 2020.\n\n\nThe late Lebanese artist Walid Raad, whose practice explored the Islamic State (ISIS), also known as the Islamic State of Iraq and Syria (ISIS), and the West, including the United States, has been named the winner of a $10,000 prize for his work, “Beyond the Battlefield,” which was presented by the British artist Rita Mae. The prize jury said that it was “proud to honor a distinguished veteran of the profession who has made such outstanding contributions to the field, and whose work has made such meaningful contributions to the world.”Raad’s work, which is currently on display in the American Museum of Beirut’s exhibition “The Last Days of the Last Human Being” (2019), is considered a masterpiece in its own right and is considered the first non-European work to be exhibited at the institution since the 1970s. It is also considered one of the most important works of the 20th century and has been featured in numerous international exhibitions and book exhibitions.The jury also awarded $10,000 to Lebanese artist Nima Nabavi for her work “Theater of Operations”", "The next Biennial should also consider the possibility of splitting the event into two sections. The first, “Towards a New Vision of the European Continent,” would comprise two exhibitions, one for each of the three continents, and would run from March 16 to March 22. The second exhibition, “Pursuing a New Vision of Africa and the Americas,” would comprise two exhibitions, one for each of the three continents, and would be on display March 19–March 21.The Biannual Congress of the European Society of Humanities and Social Sciences (ESH), which will take place in the Netherlands in December, has issued an executive directive for the 2020 edition of the European Biennial. In a statement, the commission said that the move will facilitate the sharing of information and give participants a better understanding of the upcoming exhibition and its programming. “We are delighted to see the emergence of a new platform dedicated to the growth and research of European ideas and their relevance to contemporary life,” said Marc-Otto Haefner, chair of the commission. The commission added that it looks forward to working with the Amsterdam-based artist-run nonprofit Festival de la Cinéma to ensure the exhibition is accessible to as many", "The next Biennial should also include a presentation of the work of Anne-Marie Stedelijk, a Dutch artist who practices dissolving paintings into their liquid form and then placing them in glass vases, and a presentation of the work of the Dutch curators Dominique Boulanger, Jura, and Hetjens van der Haag. The exhibition will be held at the Biennial, which opened in 1997 and is housed at the Museum of Contemporary Art, the Hague, as part of the National Museum Biennale.\n\n\nThe British Museum (BMI) has appointed Sophie Riddoch as its next director. The British Museum was founded in 1964 by an intergenerational group of British artists and curators, including Shirley Bassey, Mapplethorpe, and Mandy Elphick, with artist-in-residence Juliana Motswana. Since its founding, the museum has represented the interests of British composers and thinkers, and is a major force in advancing the British thinker. Riddoch succeeds Adrian Piper as director of the British Museum and is to lead the institution through its fourth decade as a theme park. In her new role, she will be responsible for coordinating programming across all four of the museum�", "The next Biennial should be held in 2019. \n\n\nThe Danish artist Jørgen Overgaard, who made his mark as Denmark’s lead black square painter, died on December 10, 2018. He was ninety-five years old.Born in Copenhagen in 1932, Overgaard performed his first artmaking at a young age. In 1944, at the height of the Second World War, he began painting at the school of the sculptor Robert Mapplethorpe. In 1949, he moved to the Kunsthalle Basel, where he met and befriended architect Holger Holle and fellow artist Gerhard Richter, who both studied at the Kunsthalle. In addition, Max Ernst, the late publisher of Densbestad, introduced him to the painterly technique of Max Hetzler. Hetzler’s work is often associated with Beaux­tions and Futurism, with whom he collaborated on a proposal for a painting that incorporated both a black square and a rusted iron work by the artist Lars-Erik Simons in 1969.Hetzler’s later work for Overgaard, which was on the design of the building he was building to the north of the contemporary art museum,", "The next Biennial should be held in 2019.\n\n\nThe experimental art recovery center the Blackplace has been forced to relocate to a new home in the city of Wuhan, China, after the venue unexpectedly shut down due to the pandemic. The organization was supposed to host nine international exhibitions, including the first in the country by the British artist Simon Callow, which was scheduled for October. However, the first exhibition was abruptly canceled, and the dates for the other two exhibitions have since been pushed back.In a statement provided to the Art Newspaper, the Blackplace said that it is currently in discussion with the city about rescheduling the exhibitions, which would have taken place November 1 and November 3. The first show, “Vision South,” was originally scheduled to open in June 2019 but was pushed back to July 2020. A second show, “A Machine for Pigs,” was originally scheduled for March 2020 but was pushed back to March 2021. A third show, “Thee Is a Body,” was originally scheduled for October 2021 and October 2022, but has since been moved to March, April, and May. The news comes amid a global manhunt for a virus that has sickened at least 5", "The next Biennial should have ongoing programming, hassling, and exhibitions that highlight the strength and vitality of contemporary art. I urge all participating artists and curators to engage in a continued public engagement with the arts and culture of the city.”\n\n\nA group of artists, architects, and writers are protesting the Detroit Institute of Arts (DIA) in Michigan over their decision to close their doors on March 23—the day the Detroit Institute of Arts (DIA) is slated to reopen—over the threat of a new wave of Covid-19 cases resulting from spikes around the country. Since the outbreak of the novel coronavirus in late March, the number of cases in Michigan has soared to 313 and has reached the highest number of cases in the United States. The cases have caused hospitals throughout the state to close their doors, forcing many residents to sleep in cars, and have contributed to the coronavirus outbreak reaching a peak number of 318 people.The artists whose works are scheduled to be included in the exhibition “2019: The Year We Made Art” are asking the DIA to honor their commitments to the exhibition by continuing to offer free admission to the public, and to pay workers whose wages the exhibition is billed as “custom", "The next Biennial should be set in 2020 and will continue to be hosted by the Biennial Board for the next twelve years.\n\nDiana Bochereau, the director of the Biennial, said: “I’m thrilled to be returning to the Biennial. The new and improved space will provide a great platform for our exhibitions and the exhibition of our new exhibition ‘The Expanse: From the Vaults to the Future.”\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has appointed Steven Hunter as the new creative director of the Metropolitan Museum of Art. Hunter comes to the Met from the Los Angeles County Museum of Art (LACMA), where he has served as deputy director since 2015, as director of the newly renovated and expanded Solomon R. Guggenheim Museum, and as a curator at the Museum of Modern Art in New York. In his new role, Hunter will work closely with the institution’s board of directors, chair Scott Guggenheim, and other senior leadership team to ensure that the museum is equipped with the resources to attract and retain audiences for its upcoming exhibitions and programming.“Steven brings a wealth of experience and knowledge to the museum, and his vision for the", "The next Biennial should be held in 2021. \n\n\nGerman artist, photographer, and filmmaker Hildegarde Duiker, a member of the experimental group Gallery A (Görfebruch) in Bremen, Germany, has died at the age of ninety-nine. Duiker was a founding member of the Los Angeles–based experimental art movement, which launched in the United States in the late 1940s and ’50s with a series of exhibitions at the LA County Museum of Art. Duiker’s work often grappled with questions of power, surveillance, and materiality.Among the most widely recognized works of his work are his series “Pillars of the Sea,” 1955, for which he captured a group of naked children playing in a swamp, and “Remains of a Woman,” 1956, a woman sitting on the floor with her legs spread apart. Duiker was also responsible for the 1979 film Theater of Operations,” which follows the events of the Gulf War. The film is set in the German Democratic Republic, and the artist portrayed the American soldiers as they were deployed to an Iraq in a conflict that lasted for six years. Duiker’s body is", "The next Biennial should be organized by the committee of experts representing the countries’ art in the 2019 edition. The upcoming edition of the biennial will consist of twelve exhibitions. Its theme will be “Modernities” in the North. The exhibition will be curated by Linda Berlind, director of Chisenhale Gallery; Frank Gehry, architect of the Hudson Yards project; L.A. Crook: A Contemporary Art History of America; and Paula Cooper, curator of twentieth-century art at the Getty.The 2019 edition of the biennial was organized as part of the 2020 iteration of the Los Angeles International Festival, which opened on September 5 and ran through September 6. The event raised $4 million for the Getty and expanded the Museum’s exhibition program.\n\n\nThe Sheffield Art Gallery (SAG) and the Royal Academy of Arts (RA) in the United Kingdom have agreed to merge, effective immediately. The merger will bring about twenty-three new exhibitions, including five that will highlight the work of twenty-six artists, including Lillian Barlow, Amiri Barotto, and Alice Black, and will include an online viewing room that will allow the", "The next Biennial should draw thirty-six artists from across the globe. The exhibition will open in the Tunisian city of Algiers on January 21, 2020 and will be held in the city where the 2014 terrorist attack on the Louvre in Paris took place.\n\n\nThe Flemish government is planning to invest more than eight billion euros into the restoration of its national art museum. The proposal, which will be presented to the public in January 2021, will involve the construction of several new buildings in the capital, Flanders. The government established the Flemish National Museum (Fremde Kunstmuseum) in 2008 following a merger of two former management companies, the private museum company HOK and the state-run organization ERF. The museum now boasts eighty-three works by seventy-eight artists. The redesign project, called the Flemish Federal Collection, or FFC, aims to build on the museum’s historic collection.The Flemish museum is currently working on a new design for the institution that will incorporate the institution’s historic building, a former art factory, as well as a new building designed by architect Nils-Axel Emmerich. The project will also include the restoration of the building’"]