["The next Biennial should be held in 2020.\n\n\nMuseum of Contemporary Art (MoCA), Los Angeles, announced that Franck Roesler, the curator of contemporary art at the Metropolitan Museum of Art (MCA), has been promoted to the role of director of the museum’s new downtown location. Roesler will be responsible for overseeing the institution’s expansion that will create the Museum of Contemporary Art (MoCA) Downtown, which will open in 2022 and will host more than 180,000 exhibition-based events and a wide variety of programming. He will begin his new role at the museum on January 13, 2020.“Franck Roesler’s management team has been working tirelessly to expand MoCA’s frontiers, convening and presenting international exhibitions, exploring new formats and new ways to bring the museum’s extensive collection to new audiences, and shaping the museum’s collection strategy,” said MCA director Christopher Libby. “Franck Roesler is a visionary curator who has created an exceptional career at MoCA, and we are thrilled to watch him advance to lead for a future generation of curators. We are confident he will continue to expand", "The next Biennial should be hosted in the city next year.”The competition, which was founded in support of the Bosch Foundation, is considering a number of options, including an exhibition in the city or the suburbs, a film and a digital video exhibition in the city, two films in the city, and a biennial curated by one of the participating artists.\n\n\nThe Los Angeles County Museum of Art (LACMA) is planning to remodel its Rose Garden in order to allow more sunlight into the building. The $63 million renovation project is part of a $3 billion plan to rebalance the institution’s collection and make its architecture more resilient to the effects of the coronavirus.The institution said that the renovations will include the installation of more solar panels, an increase in the collection’s exhibition capacity, the introduction of additional exhibition spaces, and the provision of a museum viewing platform.In order to increase the sunlight reaching the garden, the building is going to add new glass panels, which will allow more sunlight to enter the building. The project is also expected to result in a 3 percent increase in the collection’s viewing room’s capacity. LACMA says that the renovation will also include", "The next Biennial should be a celebration of the life and work of Nelson Mandela. The series will begin with an exhibition of works by the South African artist Sims-Henry Malingh (1924–2011) and retrace his remarkable journey to freedom from Benin in 1954.\n\n\nThe British Museum in London has appointed director Maria Balshaw as its next director. She succeeds Sir David Attenborough, who announced that he is leaving the institution in September after thirteen years, and will assume her post in March 2020. Balshaw will assume her responsibilities on January 23, 2020.“At the culmination of a distinguished and challenging career, Maria Balshaw has emerged as a strong leader, a visionary leader, and an ideal candidate for the role of biennial director,” said Alexander Mayhew, chair of the board of trustees of the British Museum. “We are grateful for her exceptional work in leading the museum through its most challenging period and look forward to her continued leadership of the museum as it enters its fiftieth year.”Balshaw joins the British Museum from the British Film Institute, where she has served as director of the division of visual arts since October 2018. She previously served as director", "The next Biennial should decide whether it wishes to refuse the invitation, and if so, how. The 2019 iteration of the event, Art in Tolerance, was convened by the Museum of Modern Art in New York. The theme of the exhibition was \"Love in Stages: Painting, Painting, and More Painting, 1963–1980,\" and the artists participating were Amsterdam-based, British, and the German said to include Haus der Kunst (elderly artist), Peter Paul Rand, Tanel Fischer, Janine Gold, and Vincent van Gogh.The Biennial is organized by the Biennial Foundation, the Los Angeles County Museum of Art, and the Los Angeles County Museum of Art; the American Ballet Theater in New York; and the Los Angeles Department of Cultural Affairs.\n\n\nItalian architect, designer, and thinker Piero Manzoni, who pioneered Italian design through pioneering idea-based materials such as polyester and silk and established a particular style of modernism through his avant-garde geometric designs, has died at age eighty-four. The design theorist, whose output encompassed both the avant-garde and the mainstream, was born in Milan in 1943. After receiving his undergraduate degree from the prestigious University", "The next Biennial should be held at least six months after the date of the original show. The Biennial will be decided by a vote of the participating artists. The assembly will announce its selection of the twenty-six artists that will participate in the first show in early January 2020. The show will be held at the Museum of Fine Arts, Boston.The 2019 series is a collaboration between David Koeppel, PhD, curator of the exhibition “Beyond the Sculpture” (2019), and the Detroit Institute of Arts (DIA). The exhibition, which will be on view until January 22, will present work by twenty-six artists, spanning from the mid-1950s to the present, and will run in conjunction with the annual “Feminine Renaissance” celebration.The exhibition was organized as part of the Detroit Institute of Arts’s quest to challenge the idea of what constitutes sculpture and how art should be made. “Art is not a static image, but a living, breathing, intelligent being,” Koeppel said in a statement. “I am thrilled that this year’s show will celebrate the feminist, anti-racist, and anti-imperialist contributions of these artists", "The next Biennial should be set up in the autumn of 2020, and in the autumn of 2021 the Biennale should be held in the summer. “The decision to proceed with the construction of the Biennale was made with the understanding that the renovation of the Museum of Modern Art would commence in the autumn of 2020 and would continue in the autumn of 2021,” said James Murdoch, chairman of 21st Century Fox.The museum had been working on the renovation of the building, which houses the museum and the exhibition space Art of the Party, since 2016. The plan was to start construction in 2021 and finished in 2022.However, the new Environmental Impact Report (EIR), which was released by the city of Los Angeles in September 2019, states that the project will not be completed until 2022. The city claims that the construction of the new building will cause at least $14 million in additional pollution. The current construction, which is currently underway, involves the dismantling of the former Central Library buildings and the demolition of two adjacent lots.“The renovation of the Museum of Modern Art is a grand initiative that will generate new and meaningful opportunities for the artists and visitors of the Los Angeles County Museum of Art,” said Mayor Eric Garcetti", "The next Biennial should take place in Finland in December 2021.  The 2020 edition will be hosted by the Berlin-based architect Rainer and will be organized as follows: The pavilion will be divided into three zones: 1) Design of the Contemporary, each with an exhibition of the work of two artists; 2) Contemporary Contemporary Art of the Past, each with a display of one work by two artists; 3) Modern Art of the Past, each with a collection of twenty works by one artist. The exhibition will include lectures by awardees Jaap Stam, and Christo, and will be curated by the Swedish artist Olof Palme, who will also serve as the director of the exhibition. The exhibition will be staged at the Kunsthalle Basel, located in the historic Kassel building, in partnership with the Kunsthalle Düsseldorf in partnership with the Düsseldorf-Helsinki Cultural Center.\n\n\nThe Museum of the City of New York has welcomed designer, urban designer, and professor Alan Seroussi as its next director. Seroussi will be responsible for curating, educating, and sustaining the best exhibitions, programs, and events in New York city. He succeeds", "The next Biennial should be in 2021, but the 2019 development, which was curated by Max Hetzler and consisted of twelve artists, was followed by a residency in the San Francisco Museum of Modern Art in 2020. The 2019 exhibition shows what is known as a “creative pathology” narrative, the term used to describe a work that is a product of a creator and is not an original work. The artists participating in this year’s exhibition were Anezka Alekhina, María Berrada, Alexander Lüders, Billie Tsien, Alex Salmond, Hailey Johns, and Grace Mac.Bryan Liston, director of the Bicentennial and the Los Angeles County Museum of Art, said: “The 2018 Biennial was an extraordinary exhibition of contemporary art. The exhibition was highly innovative and was a first for the Biennial. It marked a turning point for the Biennial as a whole, as it invited artists to explore and confront their own processes through new artistic mediums.”\n\n\nThe Museum of Arts and Design (MAD) in New York is planning to open an outpost in an industrial park in the city’s Chelsea neighborhood next year. The new space will host", "The next Biennial should begin in 2022. In 2012, the museum reopened to the public following a $1.4 billion expansion and renovation. The museum is currently constructing an exhibition hall and a plant for its collection. The building's renovation project is slated to be completed by 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles, California, has appointed Kate Larsen as its next director and CEO. She is the first woman to hold the position.“We are thrilled to have Kate at MoCA,” said museum director Andrew Kreps. “Over the years, she has been instrumental in catalyzing the transformation of the museum into a leader in contemporary art by pursuing innovative and visionary ways to support the collection, curatorial, and exhibition program while still preserving the architectural and design integrity of the museum. She is a champion of the practice of 'soft opening,' which is a term that refers to a museum’s practice of allowing visitors to feel welcomed and engaged with the institution without imposing or activating their expectations.”Prior to joining MoCA, Larson served as chief curator at the Contemporary Art Museum St. Louis and as associate curator at the Museum of Contemporary Art San Diego. She is currently a curatorial fellow at", "The next Biennial should be held in the third quarter of 2021. The organizers have also released a new forecast that says the coronavirus will infect the United Kingdom by mid-March, causing at least thirty-five thousand deaths in the United States.  More than 6,000 people have contracted the virus, and more than 90 countries have taken the unprecedented step of outlawing the coronavirus. The United States is currently preparing for a coronavirus outbreak similar to the 2013 one in Japan, which has killed more than twenty-five people. “The coronavirus is a global public health emergency,” said US Surgeon General Jerome Adams, who added that the country is facing a public health crisis because of the coronavirus. “It is imperative that we act now to contain the virus and prevent the death and illness of Americans and other countries.”\n\n\nUnited Kingdom arts professionals have urged the government to establish a national fund for artistic workers whose livelihoods are at risk following the coronavirus. ArtAsiaPacific reports that the artists are demanding at least £100 million be set up through a new creative industries strategy. According to a survey of four hundred UK galleries by the Association of Independent Directors, some sixty percent of", "The next Biennial should be held in New York around 2020. The event will mark the fourth iteration of the theme, which is often seen as a prelude to the second half of an album. The first Biennial was held in 1998 at the Brooklyn arts space the Groundwork and was held at the Brooklyn Navy Yard. The twenty-second iteration was held in New York in 2009 and was held at the Brooklyn Museum in 2012.The 2019 edition, entitled “Legacies in the Darkness,” was curated by Suzan-Lori G. DeMille and featured work by seventy-three artists, including John Akomfrah, Robert Smith, Anthony Trujillo, and Jirí Sánchez-Perez. \n\n\nThe Moroccan artist Nima Nusseibeh, whose multi-decade career was defined by her ability to align and blend traditional and contemporary art, has died at age eighty-three at her home in the Algiers district of northern Morocco. Nusseibeh’s work—both personal and collective—came to represent a radical new medium, with its own distinctive rhetorical and conceptual frameworks: Nusseibeh’s works are marked by a fierce sense of", "The next Biennial should take place every third year in 2020, when the exhibition will mark its thirteenth anniversary. \n\n\nThe Isamu Noguchi Foundation in Long Island City, New York, has announced that it is extending its partnership with the artist-run nonprofit the Noguchi Foundation for Endangered Art in New York City and is in the process of acquiring more than 12 acres of his former home.The Noguchi Foundation, which was founded by Noguchi’s son, Frank, in 1976, has received $130,000 from the Noguchi Family Collection in support of the acquisition of more than 1,500 acres of Noguchi’s old stomping grounds in Central Islip. The Noguchi Foundation will donate twenty-five acres of the estate to the Noguchi Foundation for the Arts in New York, and the rest will be given to the fund for the family’s conservation efforts.The Noguchi Foundation has been working for more than fifteen years to secure the future of the former site of the Noguchi Factory, which is now a state historic site, and to organize a public celebration of the institution’s centenary. The organization enlisted the help of a team of", "The next Biennial should be held in 2021. The forty-fifth will take place in Kiasma, Finland, in 2022.On the future of the festival, Nils\n\n’72, whose work celebrates the cycle of life itself, said: “Art is a chance to be with others who are the same. To be with people with whom you have the same interests. With whom you share the same values and aspirations. As an artist you have to try to be a window into the world in order to open up new horizons and new experiences.”Nils Vafth and Krista and Marta Vafth were nominated for the Tacita Hujar Prize for their commitment to the arts. The prize jury comprised Alicia Oliva, curator of contemporary art at the Museum of Modern Art in New York; Robyn Doolan, director of the Canterbury Art Gallery in Kent; and Vivian Harris-Koenig, director and curator of the Marshall Art Museum in Atlanta. “Both Nils and Krista are exemplary practitioners who have developed and articulated new and provocative forms of art in the last twenty years, and who have shown the potential of the future to push the boundaries of art", "The next Biennial should take place in 2020.\n\n\nThe Los Angeles County Museum of Art (LACMA) is preparing to reopen in 2021 following a $500 million expansion. The renovation, which also involved the construction of a new visitor entrance, the reopening of several existing galleries, and the introduction of new exhibits, began in March alongside the opening of “Sam Fine” (1992–1993). For its thirty-second year, the institution will host fifty-four artists, including Joan Mitchell, Robert Irwin, and Linda Evangelista, in addition to new works by contemporary artists such as Hélio Oiticica, Laura Owens, and Jean-Michel Basquiat.The renovation, which also includes the addition of twenty-three additional galleries, was funded in large part by the estate of the late billionaire industrialist J. Paul Getty, whose estate donated $500 million for the project. The museum will be renamed the Getty Museum of Art and will be inaugurated by a ceremony attended by the late collector and philanthropist Mel Brooks.“We are extremely excited by the prospects of the new Getty Museum, which will take the museum back to the arts and make it even more immersive for the world’s most discerning visitors,", "The next Biennial should take place in the spring of 2020. The 2019 iteration of the event, which was canceled owing to the ongoing health crisis in Syria, drew thirty-two thousand people.\n\n\nThe Olympia Art Center in New York has announced that it will receive $8 million from the Sargent-Andersen Foundation in support of the construction of its new building on Long Island City’s West Side, which will be completed in 2021. The center, which was slated to open in 2019, had been under construction since 2009. The $2 billion institution will house more than twenty thousand works, including thirteen thousand photographs by Pablo Picasso, a work by Claude Monet, and a collection of nineteenth-century prints by Henri Matisse.In a statement, the foundation said: “After carefully considering all of our options, we believe that a new Sargent-Andersen building will provide a more sustainable legacy for Olympia’s art. By delivering a new visionary vision for the space, which embodies both the passion and vision of the original architect, we hope to contribute to the restoration of its reputation and legacy, and enhance the sustainability of the projects that it has supported for nearly thirty years. We are eager to work with the city", "The next Biennial should be held in 2022. \n\n\nWang & Co., the Hong Kong–based Hong Kong–based art dealer, was robbed by a group of men on Friday, September 8, in a brazen and violent attack that took place in Hong Kong’s Causeway Bay neighborhood. The attack took place at around 4 PM. The suspects, who were described as white men in their thirties, were seen fleeing the scene by a security guard at the Hong Kong Fine Arts Museum, which serves as a hub for artists from China and Hong Kong.The suspects, who were carrying three large boxes during the violent break-in, forced their way into an office of the Hong Kong Fine Arts Museum on the ground floor of the museum around 1 PM. The suspects fled in a white van and were last seen running in a taxi near the museum. Police are currently searching for the van and have issued a reward of HK$46,000 (US$50,000) for information leading to their arrest.Hong Kong’s Metropolitan Police Force (MPC) has launched an investigation into the incident. According to the South China Morning Post, the suspects were described as three groups of three to five people, ranging in age from twenty to", "The next Biennial should take place in 2019. The next one in 2021. The next one in 2022. The next one in 2023. The next one in 2026. The next one in 2027. The next one in 2028. The next one in 2029. The next one in 2030. The next one in 2031. The next one in 2034. The next one in 2035. The next one in 2037. The next one in 2039. The next one in 2042. The next one in 2046. The next one in 2050. The next one in 2055. The next one in 2056. The next one in 2063. The next one in 2075. The next one in 2076. The next one in 2077. The next one in 2081.The next one in 2083.  Hannah Arendt, \"From Protest to Reality: The Politics of Emotions in Art History, 1947–1976,\" New York: Routledge, Abrams, 2019.\n\n\nThe Museum of Contemporary Art (MoCA) will refund $8 million to the thousands of museum employees", "The next Biennial should be held in the spring of 2021. The collaboration between the Zués Museum and the Grand Rapids Museum of Art will be the first of two that will take place in Michigan and will be supported by the $6 million Biennial Fund.  The project will also include the construction of a new public sculpture garden near the museum in the former site of the Sperry Opera House, where the Museum of Contemporary Art Detroit (MCA) will also open its new space in 2021. \n\n\nThe J. Paul Getty Trust has released the list of sixty-two artists who will be featured in the upcoming edition of the Museum of Contemporary Art (MoCA) in Los Angeles, which will run from March 25–March 28, 2020. Curated by Hernán Díaz and curated by Jason Mullins, the twenty-first edition of the Art in the City program, which launched in 2018, will be presented by Jess Bravin, chair of the board of trustees of the Getty, alongside artists such as Thomas Newby, Lévy Gorvy, and Robert Irwin, and will be held at Getty’s Los Angeles setting and will run only a few hundred miles from the Getty’s campus.“", "The next Biennial should be staged in the coming months. The exhibition will be a “framework of a new artistic language” for the work of a biennial of modern art, curated by Zdenek Skarstedt—a Poland-born, Prague-based curator; Skarstedt will lead the biennial alongside Jozef Pilar (1773–1812), who will serve as a special advisor. A public artist’s residency will also take place in the coming months. The biennial will award approximately $200,000 in prizes. \n\n\nThe Museum of Modern Art (MoMA) in New York has received a major donation of more than four hundred works by American artists, including Gene Nelson, Charles Darwin, George Frank, and Ellsworth Kelly, from the Church of the Holy Name of Jesus Christ. Located in the museum's collection are works by Nelson, Darwin, Frank, Kelly, and others that were not previously on display.Titled “The Creation of American Art,” the exhibition comprises three sections, “Beginnings in the Old World” (1954), “The American Experience” (1955), and “The American Experience II: From the Birth of", "The next Biennial should be in March 2020, with a redesign to reflect contemporary life. The hub will also hold a Museum of Canadian Art, a new contemporary art museum. It will also include a café and a restaurant, a library, and additional public gathering points. The museum will be housed in a former steelworks, and will be open to the public from March 23 to April 4.\n\nThe Higgins Institute for Contemporary Art (HIGAM) in New York is expanding its public program with a $50 million gift that will enable the organization to expand its collection of contemporary art. In addition to the gift, it will acquire more than 175 works by twenty-six artists, including Adam and Eve, Marcel Duchamp, Cassavetes, Lévy Gorvy, Hans Christian Andersen, and Damien Hirst. The works will be added to the Higgins’s collection in 2018.“In the current global context, we are delighted to welcome the new acquisitions to the Higgins, which has been steadily reinventing itself in the last twenty years,” said Higgins director Simon Goodman. “The acquisition of these works will allow HIGAM to add new artistic perspectives and new designs to its collection, and will enhance the museum�", "The next Biennial should consist of a group show, and should take place sometime between January and March. It should feature work by seventy-five artists. The institution will also open two digital platforms, Anthropologie and Artnet, that will allow visitors to browse through its collection. The first platform will open on January 13. The second will be up by March 3. There will be an exhibition hall in the museum on February 17.\n\n\nThe Hirshhorn Museum and Sculpture Garden in Washington, DC, has become the latest cultural institution to boycott Israel following the controversial reelection of Prime Minister Benjamin Netanyahu. The institution has been working to engage with Israeli academics and think tanks in an attempt to reach out to the country’s conservative government to encourage the formation of a new body that would represent the interests of the Jewish state.However, the Hirshhorn announced on Sunday that it would not participate in the upcoming exhibition “Beyond the Struggle of Israel” due to the “continued destabilization of the region.” In an attempt to placate the government’s concerns, the Hirshhorn has also announced that it plans to move the exhibition from its campus into an adjacent building, thus avoiding any conflict with the", "The next Biennial should be held in the spring of 2021. \n\n\nAfter receiving an outpouring of support from the public following a $3 million donation from the Friedrich August-Leibniz Foundation, the Jena Institute for Contemporary Art in Germany has named Paul Moeller director of the biennial “Friedrich August-Leibniz” (FELB). The donation will enable the institution to double its budget, and helps the foundation to further its efforts to support emerging artists and their projects through a series of exhibitions, residencies, and fellowships. The award was made in recognition of Moeller’s contributions to art and culture throughout the twentieth century, and was bestowed by the institute’s board of directors.The biennial, which was announced in December 2018, will present sixty artists, including Stewart Lee, Nari Ward, and Taner Esmail, who are participating in the inaugural edition of the biennial. The show’s first chapter, “Feminine” (2019), is slated to open on September 7. The biennial’s second chapter, “Theater of Operations” (2019), will be on October 17–21. The biennial’", "The next Biennial should focus on the relationship between artists and the natural environment, and be held at an appropriate location. “It is important to remember that the exhibition is not a museum, but a platform for the artist to engage with the natural world and to create his or her own distinct and meaningful work,” said Ali Esmaili, president of the institution. Adeline Csokwa, director of the Young Contemporary Art Museum, said: “We are committed to the Museums, but we are also committed to empowering and supporting artists to create new and exciting work. Art is an essential tool for the future development of our institutions and the role of museums in fostering the transmission of knowledge and understanding. We are convinced that this new, interdisciplinary project will present the best opportunities for artists to engage with the new and the old worlds.”\n\n\nThe National Galleries of Scotland (NGM) is planning to reduce its workforce by more than one hundred positions through voluntary redundancies and on Tuesday announced that it expects to lose another one hundred retail, catering, and publishing sector positions by the end of the year.The organization made the announcement in an attempt to balance the books in anticipation of a expected £10.5 billion cut in", "The next Biennial should take place in the coming months.  The first event, “The Century of the Body,” was staged at the Museum of Modern Art, New York, in 2021. The second event, “Historische Untergang,” was staged at the Kunsthalle Basel-This is a Legend, Berlin, in 2019. \n\n\nThe Metropolitan Museum of Art in New York has hired veteran curator Susan Anderson as its next director. Anderson comes to the institution from the Museum of Modern Art (MoMA), where she has served as deputy director since 2015. She takes the helm from Ron Gorchov, who announced his departure in June.Garth Anderson, the director of the Museum of Modern Art, said: “Susan brings a deep and beautiful sense of perspective and a keen sense of history to our mission of presenting the museum’s collections in a truly collaborative and international way. I’ve long admired her work, and her curatorial strengths, and her ability to motivate, inspire, and articulate. I’m most excited about her new role as director, which will be challenging and transformational.”Anderson’s first role at the museum was as a curator", "The next Biennial should take place in 2021. The event will be led by Kate Fowle, director of the New Art Museum, in London; Bradley Thomas, director of the Beijing Academy of Arts; Hannah Wilke, director of the Museum of Contemporary Art, Los Angeles; and Eleanor Watson, director of the National Gallery of Art. The theme of the two-day event is “What is Life?,” and the first event will feature work by forty-two artists, including Nari Ward, Berenice Abbott, L. S.A. Jackson, Kirsten McNamara, and Kamiar Zagar, and will be held at the Home Counties Museum, Derby, England, on September 10 and September 11. The second event, titled “Here Comes the Sun,” will be staged at the Museum of Contemporary Art, Los Angeles, on September 10 and September 13, and will be held at Los Angeles’s Santa Monica Pier, Santa Monica, California. The 2019 edition of the show, “Life in the Art World” exceeded expectations. “The exhibition was not only a", "The next Biennial should be held in 2021. \n\n\nThe Royal Academy of Arts (RA) in London announced today that Liam Stack, a former director of the National Galleries of Scotland and the National Galleries of Wales, has been appointed as its next director. He succeeds Mark Doty, who has held the position for sixteen years, and will take up the post on June 2. Stack, whose extensive curatorial experience and expertise will be a major asset in the museum’s future expansion plans. He will work closely with junior curator Jo Stapleton, who has curated and led the National Gallery of Ireland, and will collaborate with international luminaries such as Sir Christopher Wool, Sir David Attenborough and the Italian explorer Alberto Ferrari to design a new National Museum of Ireland. “In the last sixteen years, we have transformed the National Gallery of Ireland by creating a new contemporary exhibition space, moving most of our exhibition work to the National Museum of Art in London, and launching our online catalogue, ” said Stack. “I’m excited to be a part of the history of the institution’s collection, its exhibitions, and my own proud and ambitious curatorial projects, which will expand the imagination,", "The next Biennial should be held in the spring of 2020.<|endoftext|>Story highlights The Counter Art Project will reopen in the fall with the launch of the Art Event Series\n\nThe event will feature artists working across various disciplines in the arts, including fashion, dance, photography, and theater\n\nThe inaugural event, a collaboration between artists and collectors Aline Bouchart and Ed Andriesk, was held at the gallery in New York City in January. It will be followed by a symposium at the Counter Art Museum in New York in March\n\n(CNN) The Art Event Series, a nationwide fundraiser honoring the artists who have made significant contributions to the visual arts, has announced that it will reemerge in the fall with the launch of Art Inversion, a new biennial that will feature work from thirty-three artists.The inaugural edition of Art Inversion, which runs March 23–March 28, 2019, was sparked by the ongoing crisis in Syria following the country’s civil war, which has claimed the lives of an estimated 250,000 people. The Art Inversion Fund, a trust established by the artists, will donate $500,000 in aid of the cost of hosting the event, which was organized by artists and collectors", "The next Biennial should take place in the May/June 2020 timeframe. The first event, which will be held at the time of the 2020 Tokyo Art Biennale, was held in September 2019. The Biennial will be the site of a series of seminars and will draw around twelve thousand visitors. According to Artnet News, the exhibition will also feature new works by artists such as Maren Basso, Herbert Bayer, Pierre-Auguste Renoir, and Frank Gehry. The exhibition will be held in the venue of a former Bell Telephone Company building in the city of Fukuoka. The unveiling of the exhibit will take place on September 12.\n\n\nThe National Geographic Society’s plan to redevelop the iconic John Lennon and Yoko Ono–designed geodesic dome at the Museum of Natural History in Washington, DC, has been put on hold after a group of artists and cultural organizations announced they are boycotting the landmark exhibition, which is scheduled to reopen next month. “The dome is an integral part of the National Geographic Society’s mission to present compelling narratives of the natural world, to foster a sense of wonder through science, and to engage with the human condition,” said David Burnett", "The next Biennial should have been the year of the soul, not the eighteenth, and should have been about the fight against the death penalty, not about the death of a single soul. We must move forward and not backwards. We must do what is necessary to advance our cause and do what is in the best interest of the country, the state, and the city of Philadelphia. We must not turn our backs on this moment. We must not sit idly by and allow a Nazi regime to rule our country. We must not allow a police state to rule our country. We must not allow a foreign power to steal our future. We must not allow ourselves to be manipulated by fear and hate. We must not allow ourselves to be tricked by lies and misinformation. We must not allow our values to be set aside or eroded.We have worked hard to ensure that the Philadelphia Museum of Art will remain a museum of contemporary art and about contemporary art. We are committed to making the museum a magnet for young artists and families and are working to create an environment for the arts through programming that addresses the challenges of an urban core. We support the work of the Philadelphia Cultural Alliance to advance inclusion and diversity. We welcome your feedback and support.  \n\n\nThe National Arts", "The next Biennial should be held in 2022.\n\n\nThe Rotterdam Biennale has declared the fifty-ninth edition of the festival, which will take place in the city’s Schalkbreger Garden in September 2019, as being progressively closer to completion. The festival was co-organized by the Rotterdam-based group Artforum with the support of the city of the Netherlands, the city of Antwerp, the city of Rotterdam, the city of Rotterdam, and the city of London.The fifty-ninth edition of the Rotterdam Biennale is being hosted by the city of Rotterdam and the Rotterdam-based nonprofit corporation Artforum and will be hosted at the Schalkbreger Garden in the city’s capital, Amsterdam. The event will be co-led by Frederick Vossen, the director of the Schalkbreger Garden, and Katerina Schmitz, the artistic director of Artforum. The event will include three separate exhibitions, each entitled “Afternoon in a Garden,” “Sight in a Garden,” and “A Pattern of Being,” among others.The fifty-ninth edition", "The next Biennial should be held in 2021. “Our goal in this project is to build on the work of the previous five years,” said Akamatsu. The museum will also present a new exhibition of works by artists such as Richard Avedon, Iain Sykes, Jean-Michel Basquiat, Pierre Bonnard, and Pierre-Auguste Renoir. The organization will also offer biennial programs that reflect the diverse histories of artists, including the “Sensational Girl,” which will focus on the influence of fashion, and “Art of Life: Formal Experience from the Diaspora,” which will feature ten works by twenty-one artists.\n\n\nThe Museum of Contemporary Art (MoCA), Boston, has announced that it is expanding its digital presence with a new digital platform to serve as a platform for researchers, artists, and institutions to share research and collaborate. Called the Research Center, the new site will offer access to groundbreaking new research on a variety of topics. The museum will also host a series of free public events, which will be led by an artist-in-residence each month. The move comes amid the ongoing analysis and curating of research on the role", "The next Biennial should take place in the summer of 2022. The fair will be hosted in the city’s Art Museum, which is being renovated and rebranded as the Art Institute of Chicago. The museum will also offer programming that explores the history of art in the state, such as its inaugural art-world fair in January 2020.\n\n\nThe Los Angeles County Museum of Art (LACMA) has received a gift of more than 80,000 photographs by award-winning artist David Adjay. The work, which was donated by the artist and collector David-Adjay and will be displayed in a solo exhibition at the museum next month, was acquired through the art of the artist’s collection.LACMA director Phil Aldridge announced the gift in an interview with the Los Angeles Times and praised the artist for his dedication to making the collection accessible to the general public. Adjay’s photographs were acquired by him and his wife, Donna, in the late 1980s, shortly after their five-year-old daughter was diagnosed with a rare but devastating form of leukemia. The child died in 1995 of the disease, but his widow, Donna Adjay, continued to collect. David-Adjay, whose practice spans landscapes, ", "The next Biennial should be held in 2021. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Sherrilyn Kennington as its new deputy director of curatorial affairs. She succeeds Dario Catellani, who has been with the institution for twenty-two years.“We are thrilled to welcome Sherrilyn to our team,” said Marc Glimcher, chair of the board of trustees of the Los Angeles County Museum of Art (LACMA). “She has a long history of achievement as an executive, and we expect her to continue that legacy as curator, educator, and patron. We look forward to working with Sherrilyn to support our mission of advancing the very best in contemporary art, and to continue to build upon the museum’s internationally recognized collection.”Previously, Kennington worked as a curator at the Los Angeles County Museum of Art (LACMA), where she helped organize the exhibition “The Present: Imagination and Reality” (2012) and worked as a curator at the Museum of Contemporary Art, Los Angeles (CA); the Museum of Contemporary Art, Los Angeles (MO) and the Museum of Contemporary Art, New York (LA). During her tenure", "The next Biennial should be devoted to the field of Armenian design from the project of the exhibition of the first edition of the Art+Design Congress in Istanbul in 2021. The exhibition is organized under the theme “Art and Design in the Armenian Republic,” and will be held at the Armenian National Museum in the city of Karabakh from March 14 to March 22, 2021.The next edition of the Art+Design Congress will be held in Istanbul in December 2021.\n\n\nThe Saudi Arabian royal family has announced that they have donated $3.5 billion to the United Kingdom in aid of arts and cultural institutions and researchers in the Kingdom. Prince Mohammed bin Salman, the second son of crown prince Salman bin Salman, made the announcement at an arts event in London on Saturday. The royal family’s funding of the arts and cultural sector is a sign of the deep and supportive relationship the family has with the United Kingdom. Many have criticized the royal family’s philanthropy during Salman bin Salman’s time as crown prince, but he has defended his investments in the sector and has said he wants to use the funds to promote Saudi Arabia’s image abroad.The royal family’s pledge is the largest ever for UK-based arts", "The next Biennial should be held in 2022, and the first in 2025. If all goes as planned, the organizers will unveil the project concept in 2021. \n\n\nThe Foundation for Contemporary Art (FCA) in New York has appointed Christo, a Croatian artist who is best known for his paintings depicting contemporary social structures, as its inaugural art curator. He will also serve as the chief curator of the Contemporary Art Museum St. Louis, which opened in 2016.Founded in 1968 by Betty Gibbs and Willy Dieter, the organization has since expanded to 22 locations. In addition to its main exhibition space in the United States, it has also staged more than a dozen other exhibitions around the world, including the half-dozen shows at the Mecca Art Biennale (2019), the Venice Biennale (2019), and the Venice Architecture Biennale (2018), and serves as the organizing principle for the St. Louis and the Venice Stations.Christo, whose works are often based on the same concept but with different geographical locations, has previously worked as a faculty member at the Art Institute of Chicago, and as a curator at the Metropolitan Museum of Art. He will now assume his new role, which is funded by the FCA, the Metropolitan", "The next Biennial should be held in 2021. The project is an extension of the original Art & Artifacts (formerly ART) as well as an attempt to create a permanent collection of the artist’s work. The exhibition will be housed in a renovated nineteenth-century building, in a building that will be known as the Biennial House, a part of the city of Los Angeles.The museum will invest more than $12 million into constructing the pavilion, which is located in a building designed by architect Norman Foster, and will partner with the City of Los Angeles to launch a city-backed fund to preserve and present the work of the city’s artists. The project will also introduce an online version of the exhibition, which will be hosted by the city.“The building is an unparalleled example of the visionary, collaborative and forward-thinking spirit of Los Angeles,” said Los Angeles’s City Council member Mike Bonin. “With this new era of creativity, the Biennial House will present a collection of the work of Los Angeles’s most important artists.”The project will also introduce the city to several new works by the Los Angeles–based artist and activist Franklin Graham, who will be introduced to a new", "The next Biennial should choose a theme and a theme should be accepted by the Director of the exhibition and he or she will create a new theme for the Exhibition. The decision to abandon the last theme was made after the exhibition was moved to the new museum, which opened in the same building in 2016. The new exhibition will be made up of three parts: a biennial of essays on Greenwich Village, a biennial of works on the exhibition, and a biennial of works on the ground. Special exhibitions will be organized by the British Council (BC), the British Film Institute (BFI), and the National Galleries of Scotland.The four artists who are participating in the first part of the exhibition are Ed Atkins, Paul Gauguin, Hosea Alsop, and Ezra Atkin. The artists will be invited to participate in a series of lectures, panels, and performances that will be organized in different ways, including in-person, online, and on mobile devices. The theme of the second part of the exhibition is \"Magazines, Maps, and Scales: Materiality, Motion, and the Material Garden\" and the artists will be given the opportunity to draw inspiration from the artworks and the objects in the exhibition. The exhibition", "The next Biennial should take place in 2020, reports the Art Newspaper. The exhibition will be hosted by the National Museum of Contemporary Art in Moscow and will feature twenty-six works by sixty-six artists from twenty-two countries and will run for twelve weeks.Following the exhibition, the National Gallery of Art in Washington, DC, will hold a special exhibition of work by forty-three artists from thirty-six countries, the Venice Biennale, in 2020.\n\n\nAs the number of cases of Covid-19 continues to rise around the world, museums are now rethinking their exhibition spaces and preparing for a possible shutdown. In the United States, the number of people infected with the virus has surpassed 1.5 million, and the number of people who have died from the virus in the United States has surpassed one hundred and sixty-four. In Europe, where the outbreak began in the United Kingdom on Monday, September 3, and has since spread to all of Europe, the number of cases has reached 1.3 million and the death toll has risen to 5,937.The number of people infected with the virus in the United States has doubled from the previous day, and the number of cases has climbed to 3,928 through Sunday, September", "The next Biennial should be held in 2022.”The exhibition was launched by Israeli Israeli filmmaker and activist Yoav Galant and is organized by the Israel Museum and the Tel Aviv Design Center in cooperation with the Jewish Museum in Jerusalem. Galant and the institution have leased the venue for the past fifteen years. This year’s iteration will feature seventy works by seventy-five artists from forty-eight countries.“The upcoming exhibition is a response to the temporary closure of the museum in protest of the announcement of construction plans for an illegal settlement in the West Bank, the displacement of Palestinian refugees, and the expansion of Israeli settlements,” Galant wrote in a statement. “The new theme ‘Resistance’ is about resistance as a global project, about the way to resist the global project of Zionism and the state.”The full list of participating artists is as follows:Artists :Olga Calatrava, Bolivia Elise Dallesandro, Italy Tattospora Elina, Argentina Cécile Auther, France Wangechi Mutu, South Africa Mona Albouy, Eritrea Omar Baraya, Venezuela N", "The next Biennial should be held at least a decade after the first one, to take place in 2020, and is also planning to increase the number of artists represented in its exhibition from ten to twenty. Its new format will allow the museum to remain true to its mandate: to present the work of all artists, regardless of their status, with the museum holding the final word on the selection.“This is a time of great transformations for the world and the future of art, and we are determined to use this opportunity to address some of these challenges head on,” said Andrej Pejic, the director of the museum. “We will soon have a new platform for the museum’s exhibition of the work of artists. We know that to achieve this goal we must be transparent and attentive to the museum’s artistic mission. The future of the Biennial must, at a minimum, address the history of the exhibition and the collection. We are especially interested in these topics in light of the biennial’s previous work in this regard, the exhibition of the work of Mikhail Rajskub, which opened in 1994. I hope that you will join us in this quest and help us to realize this vision.”", "The next Biennial should focus on “the indefinite and the temporality of representation,” Artforum editor-in-chief Sam Gladden writes. “As the years go by, the mark will become more and more essential as a vehicle for bringing together artists who are most directly concerned with the kind of work that its curators hope will define the future.” The 2019 edition, titled “Art in Time,” will be staged in Art Basel Hong Kong from March 21 to March 26.\n\n\nThe American architect, physicist, and theorist Hairy Bikers, a New York–based organization dedicated to providing rides for homeless and at-risk New Yorkers, has released the list of eighty-three organizations that will serve as a platform for the installation of new works by internationally-acclaimed artists during its first digital-only edition, “Hairy Bikers: Digital Art.” Since its inception in 2006, the event has hosted more than 2,500 works and has starred artists such as Berenice Abbott, Wangechi Mutu, David H. Dinns, and Jodi Throckmorton.Among the artists selected for the project’s inaugural edition, which will run from January 5 to", "The next Biennial should be on May 21. \n\n\nThe Museum of Jewish Heritage (MoH) in New York has received a gift of ninety-nine works by fifty-one artists from the Israeli American cultural institution Menashe. The works were donated by members of the Israel Museum's permanent collection, which includes works by more than 1,100 artists.“We are extremely grateful to the Menashe alumni for their generosity, trust, and vision in authorizing this gift,” said museum director Anatole Shagal. “It is a great honor to welcome these works to the Museum of Jewish Heritage. We will continue to work with the Menashe alumni to secure works by the artists we have yet to recognize. It is an honor to present them to the public and to receive their contributions to the museum.”The gift includes works by artists such as Adrienne Atget, Elyn Waldman, Orit Porat, Isamu Noguchi, Adam Radin, Osman Waddington, and Yair Hochner, as well as a selection by the late American artist Walter H. Menchaca, which will be presented as part of Menashe’s “Walter H", "The next Biennial should be held in 2020.\n\n\nThe Bauhaus, situated in an eight-thousand-year-old man-made cloudburst of Benning, Germany, has announced that it will reopen as early as 2020 following a $2 billion expansion. In a statement, the Berlin-based arts center described the renovation as a “new beginning.” Its new, contemporary venue, the Bauhaus Museum, will host an exhibition of works from the former Bauhaus campus, as well as new works from the collection of the German artist, Gerhard Richter. The first of the museum’s projects is the “New Museum,” which will also be inaugurated by a new exhibition of work by the Austrian artist Wolfgang Pfeifer.During the expansion, the museum added an auditorium, a theater, and an outdoor plaza with a private terrace. The indoor spaces were renovated in collaboration with the museum’s former custodians, the Neue Staatliche Kunstverein Berlin (NASB), and the Hamburg-based company Rotterdam-based architect Jan Steger. A new gallery and exhibition building was also constructed, and the museum reopened to the public on January 21", "The next Biennial should take place in the spring of 2021. Other dates to be announced.\n\n\nThe United States House of Representatives voted yesterday to establish a national museum dedicated to the American Latino dedicated to the history and culture of America’s Latinx communities, which comprise nearly 70 million people. Introduced last year by New York representative José E. Serrano, the bill for the museum, which will sit on the National Mall, was unanimously approved on Monday and now goes to the Senate, where it has bipartisan support. The museum would be a subsidiary of the Smithsonian Institution, which recently laid off 150 employees and closed its two-hundred-and-sixty-third exhibition “The American Latino: Past, Present, and Future” due to a lack of funds.The bill establishes a new nonprofit organization, the Smithsonian Hispanic American History Museum, which would be led by a board of curators and historians. The board would comprise two members from each state and three from each congressional district. The museum would present a biennial exhibition each year, reinterpreting the history of the Latino population. The first exhibition, “The American Latino: Past, Present, and Future” (2019–20), opened at the", "The next Biennial should be held at the Museo de Arte Contemporáneo de Barcelona, in October 2022; the date of the last iteration being October 20-October 23, 2021.“We are delighted that the city of Barcelona will carry out an important and very emotional chapter in its history with the Biennial for the Arts,” said José Manuel Pérez-Alarcon, the city’s mayor.\n\n\nAlexandre Bisson, the Tunisian artist whose body of work juxtaposed modernism and African art, has died at age seventy-nine. His current-work, Tunisia and the Body, 1955, depicts the Tunisian artist Aline Ben Ali, who was detained by the French colonialists in 1954, and the Tunisian poet Khaled El Saadi in their home country’s civil war, which lasted from 1959 to 1963.Born in Paris in 1940, Bisson immigrated to France in 1949, where he studied with Marcel Prouvé, the Belgian architect and theorist who pioneered the use of stacked panels to create curved surfaces such as road signs and buildings. After the war, he returned to the former Ottoman Empire, where he studied at the University of Al", "The next Biennial should be held in 2021.”\n\n\nThe Museum of the African Diaspora (MoAD) in Atlanta has announced that Amelia Boville has been selected to lead the 2019 biennial. The sixty-three-year-old American artist, whose work encompasses both performance and narrative, has been best recognized in the United Kingdom for her seminal performance work, The Black Madonna, which was staged at the Royal Shakespeare Company in London in 1976. The work, which uses a mix of traditional African and modern techniques, such as weaving, singing, and dance, has been collected by more than one million people worldwide since it was staged.Boville is currently represented by Gallery of Modern Art in New York and keeps an active practice as a painter, sculptor, and filmmaker. The British director of contemporary art, Joachim D. DeCarlo, has described her work as “a representation of the African experience in the native and modern worlds,” and her work is currently displayed in the British Museum’s “African Congress.” In an interview with the Los Angeles Times in 2011, Boville explained that her works use “the African experience,” which is “relatively", "The next Biennial should be held in the fall of 2020. If all goes according to plan, the exhibition will take place at the new Port Townsend Art Museum, which will be completed in 2021.\n\n\nThe London-based charity Cyberspace Relief has announced that it will distribute 1.5 million tickets to French artists who were scheduled to participate in the upcoming edition of the Paris Biennial, codenamed BIC, which has been canceled since March 31, 2020 due to the ongoing global health crisis.Dubbed the Paris Forks, the art world festival will now take place in the French city of Strasbourg from April 7–April 9, 2021. The event will take place at the historic Hotel de Ville d'Orléans in the capital of France and will be hosted by the Land of the Habsburg Empire. The biennial’s schedule was also already revised to include more frequent programming and a new theme, “Post-Capitalism.”Cynthia Savoy, director of Cyberspace Relief, said: “This is a moment of great change for artists, workers and the world at large. Since the decision to cancel the BIC, we have been working hard to get the show back on track", "The next Biennial should be held in the spring of 2022. The original contract for the exhibition was for forty-two months. The twenty-six artists who participated in the contemporary exhibition were spread over sixty-five thousand square feet of the museum’s Guggenheim building. The exhibition was organized by Christopher Wool with artistic director Richard Crespo in partnership with the Paris-based nonprofit organization Tisserand. The exhibition, entitled “Theater of Operations: the Gulf Wars” (Theater of Operations: Gulf Wars), will open at the Guggenheim in May 2020 and run through the end of the year. The ten-month run of the exhibition will begin on July 5, 2020 and end on September 5, 2020.The inaugural exhibition was curated by Stephen Van Asdenoy, whose work will be presented in a three-act play. Van Asdenoy will present his work “Theater of Operations: The Gulf Wars” on November 22, 2020, and will stage a new exhibition at the Schirn Kunsthalle in Berlin in May 2021. In the play, Van Asdenoy plays a German journalist who travels to Baghdad to interview a former British soldier about his service in the Gulf.", "The next Biennial should be held within the next year, and the first exhibition should open in 2021.The Prize hosts include the following artists:Isabel Marden, New York; Elizabeth Bear, New York; Alex C. Perry, New York; John Barnwell, New York; and Orson Welles, New York.\n\n\nThe Museum of De’s new complex in East Hampton, New York, announced today that it has received a $10 million gift from the estate of the late adult painter Richard Anuszkiewicz. The gift is the culmination of a three-year campaign to raise funds for the museum. In recognition of his extraordinary career, the art historian and collector donated the works of the late artist’s collection to the institution.The gift is one of several gifts that the museum made in honor of his legacy. The other two large donations were the first and second. The first was a painting by Richard Anuszkiewicz III, a work for which Anuszkiewicz sold it to a private collector in 1988. The private sale was one of two pieces to be given to the museum in the two decades preceding the collection’s opening. The other was a 1974 painting by the artist that is on", "The next Biennial should take place in 2020. \n\n\nCatherine Oliphant, the former director of the Hayward Gallery in New York, has been appointed the new director of the Harvard Art Museums. She succeeds Jane Panetta, who retired in March 2019 after more than eighteen years at the helm of the museum. She succeeds curator Timothy C. Larsen, who was instrumental in the museum’s reopening in March 2019 and who will continue to serve as director of the institution under Oliphant’s leadership.“Catherine brings an extraordinary breadth of experience in her many fields, including curating, art, architecture, and design, and will continue to shape the Hayward into a dynamic center that celebrates art and philosophy in both its original and updated incarnations,” said curator Andrew Kreps, who worked with Oliphant at the museum for nineteen years. “Catherine is a scholar and an entrepreneur. Her vision and energy for the Hayward is inspiring and her ability to prioritize the needs of her teams and the community are crucial to the museum’s future.”Oliphant previously served as director of the National Gallery of Art in Washington, DC, and as director of the Metropolitan Museum of Art in New", "The next Biennial should be the biggest event in the institution’s history.\n\nThe Biennial, which was founded in 1987 to commemorate the pioneers who altered the trajectory of modern science, has faced numerous financial setbacks, including a lawsuit over the discovery of a new strain of yeast that was supposed to have made the biennial impossible to stage. On Sunday, Culture Minister Asmaa N. Al-Khalifa sent Al-Khalifa’s letter to the Saudi Arabian king, Salman, announcing that the royal commission on the discovery of life on Mars would be suspended until the  matter was sorted out. Al-Khalifa said that the royal commission would continue with the 2019 exhibition “In Defense of Life: From Dinosaurs to Humans” and that it would announce a new date for the exhibition.The royal commission, which was set up by King Salman in 2015 as part of a massive $51 billion package of reforms, was launched after the Saudi Arabian Institute of Science (SAI) in Riyadh, which had previously been considered a milestone institution, announced it would no longer participate in the 2022 edition of the Arab Digital City, the global event that was organized by the city of Dubai. Instead, it would hold", "The next Biennial should take place in the spring of 2020, with the first episodes to be released in late 2021. The 2019 event, titled “The Future of Art,” premiered at the Museum of Modern Art in New York and is currently on display in the minor exhibition “Future Present,” which is currently on view at the New Museum in New York. The exhibition, titled “Anselm Kiefer: Unseen,” is currently on view in the new exhibition “Anselm Kiefer: The Future of Art” at the Guggenheim Museum.The 2019 event was organized by the Guggenheim curators Alexander Lüders and Wolfgang Gogelschreiber as part of a broader project to integrate the works of the twentieth century into its collection, which includes works by Pierre-Luc Godin, Michelangelo Antonioni, and Pierre-Luc Moulène, and is a culmination of several years of work by the artists. The theme “The Future of Human Thought,” was inspired by the words of the Sartre–Zinovie V. and Ralph Waldo (the V and the M) in the title, which is an abbre", "The next Biennial should focus on “Just.Back.From.Criminality.” This exhibition will highlight cases of people who were just illegally detained or who were held against their will. The exhibition will also be organized in such a way as to include both visual and textual artworks to encourage a better understanding of the human rights issues that affect us all.“We are delighted to be hosting the first edition of Just.Back.From.Criminality in London and to be able to present the exhibition in person in one of the most beautiful buildings in the capital. The exhibition will invite a new way of thinking about what happened, how we move forward, and what we can learn from history and to take us closer to the essence of what makes humanity.”The exhibition’s curator, artist, and director, Kate Wirth, said: “We are very excited about the exhibition’s opening, its introduction by the UK’s PEN, and its successful reception at the Venice Biennale. We hope that it will become an example for other arts and cultural institutions to think about the human rights of people being detained and to think about how we can change our environments and our laws to ensure that people are", "The next Biennial should also introduce a new category called Exhibition, and will add curatorial touches to the Biennial experience. “We have been focusing on the exhibition as a platform for artists to connect with each other and with the public,” said Naima J. Behnke, chair of the museum’s board of trustees. “At the same time, we have been looking for ways to integrate photography and sculpture into the museum’s collection. The latest iteration of the Biennial is an acknowledgement of this duality and a response to the questions posed by photographers: How can we create images that transcend the limits of what is possible?”\n\n\nThe Los Angeles County Museum of Art (LACMA) has launched a new online viewer in an attempt to diversify its digital audience. The program, called the LACMA Viewer, will allow visitors to view all three of the museum’s Hawaiʻi–born, California–based artists, including John Graham, Jeff Koons, and Ken Watanabe, as well as select works by permanent and temporary exhibitions, performances, screenings, and other programming.“Los Angeles is one of the most beloved landscapes in the world, and L", "The next Biennial should cover the art of the Present, which is an open-ended series of events and studies that explores the relationship between present and past through the lens of contemporary artists. The theme for this year’s event is “Living Art” and will cover topics such as art and memory, the afterlife, and the impact of art on our relationship with the world. The upcoming Biennial will also feature the first open-air exhibitions of work by Chantal Akerman, Stéphane Beaufils, and members of the Naiman/Kahn family, and will mark the first time the German city of Cologne has hosted a World Art Congress. “We are very pleased to launch the new biennial program at the Cologne Art Museum,” said Klaus Hilbert, the German curator in charge of the exhibition program. “Cologne is a world-class art city, and the new program will bring together artists of diverse cultures and orientations, offer them a platform to present their work and create new links between art and history.”Akerman, Beaufils, and their peers are represented in the US by the Virginia Museum of Fine Arts, the National Gallery of Art, the Metropolitan Museum of Art", "The next Biennial should be held in 2020. The theme of the 2018 edition was “The Self-Adication of Other:”<|endoftext|>I was only twelve when I first read The Tempest, the legendary nineteenth-century French novel that was first published in Paris on October 4, 1810. I am now sixty-five years old and look forward to this first preview of the second volume, which will be published in the spring of 2020. The book is an essential history of the French Republic from its founding in 1830 to the French Revolution, which took place in 1830.“The Tempest’s\" description of a French monarchy allied with a revolutionary republic in 1830 leads me to believe that the novel will be a history of France in the eighteenth century. I want to see how the French Republic will survive as we approach the thirtieth anniversary of its founding in 2020.” The essay-length novel is divided into eight parts, each one a prelude to a larger work, the novel Tropiques sur l'Europe, which tells its story from the perspective of a radical and often violent young man in the capital city of Paris.  “Europe has no future any more than we have a future in the sun,” the", "The next Biennial should be held in 2021. Rees, who also founded the studios Maus & Franz and did a previous stint as head of the Metropolitan Museum of Art, said he expects the exhibition to generate new and \"fresh ideas from the contemporary art world.”\n\n\nThe National Gallery of Scotland has received a £9.5 million donation from philanthropist Richard Biggs. The donation includes £6.5 million in support of the current biennial, which will run from March 18 to March 21, 2020. The institution will also receive a further £2 million in support of the exhibition “The End of the World as We Know It,” which will be on view for seventy-three days and will feature new works by forty-four artists. The gift also includes funds for the acquisition of work by eighty-three artists, and for the exhibition of forty-four works by forty-five artists.“The biennial is being run by national and local government bodies across Scotland, and is funded with a mix of state and private funding, including the National Lottery Heritage Fund, and we are grateful to Richard and the National Gallery of Scotland for their leadership in championing a fair that represents the best of contemporary art and", "The next Biennial should be in the fall of 2020. \n\n\nFrench artist Gilles Deleuze and Gérard Deaux, the influential philosopher-artists who coined the term \"antilanguage,\" have teamed up to create an exhibition at the Museum of Modern Art (MoMA) in New York that will examine the relationship between language and the body and the artist’s body in a way that will draw from Deaux’s own drawings and sculptures. “Deaux’s project is an extension of his own repertoire, which includes ceramic, glass, metal, and paper,” museum director Jim Fulton said in a statement. “In a world where language is so pervasive, art develops language through language further. . . . The work of Gilles Deleuze and Gérard Deaux is a record of the work of Deleuze, in particular of his great work 'The Body and Language,” an ongoing exploration of the relationship between language and the body.”The show, which is titled “Theater of Interruptions: Language and the Body” and will take up themes such as “drama, language, and death,” “language in society", "The next Biennial should be held in the autumn of 2020, and will focus on “dissolving the boundaries between art and politics,” the artist said. “The new exhibition will be about the intersection between art and social movements, which we hope will be a powerful tool for changing the political and the cultural worlds in the country.”\n\n\nLos Angeles’s Palais de Tokyo is removing a statue of Japanese imperialists Commodore Katsuyuki Nakayama and his protégé Shigemitsu Nakaya, the two men behind the 1937 death-knelling of over ninety thousand Chinese civilians in the Pacific Theater of Operations (the infamous Sino-Japanese War was fought in a Japanese base in China, not in Japan).According to the New York Times, the statue of Nakayama, who was executed after a Japanese court convicted him of war crimes in Tokyo last month, was part of a deal that saw the convicted war criminal receive a life sentence in prison without the possibility of parole. The other two pieces, which were installed in 1943, were part of a three-century exhibition—originally titled “Adolf Hitler’s Body and Soul” and “Adolf Hitler in Space", "The next Biennial should take place at the Museum of Contemporary Art Toronto in 2021, and the fourth and fifth editions of the Biennial will be held at the National Gallery in Ottawa in 2022 and 2021.The International Council on Art and Design (ICAD) hopes to host a 2019 edition of the exhibition in Helsinki. Following a successful crowdfunding campaign, the institution commissioned artist Judith and Richard Preciado to create a new work, The Displacement of Water, for the exhibition. The artist’s work will be mounted in the exhibition’s exhibition “Nature’s Stage” across the institution’s new 45,000-square-foot venue, which will be inaugurated by Art Basel Hong Kong in August.The theme of this year’s show is “the new world order.” ICAD director and CEO Bruno Nesper said: “The Displacement of Water embodies everything that is valuable and new about the exhibition and its approach to the exhibition. We are passionate about this work and its reception and its impact on the contemporary art landscape, and that is why ICAD invited Richard and Judith to create a new work for The Displacement of Water, which will be presented", "The next Biennial should take place in 2020. \n\n\nIn the wake of the seven-year-old, 96-acre campus fire that ravaged the campus of the former Evergreen State College in Olympia, Washington, on Friday, May 3, the school announced that it is temporarily closing its doors and will begin a nationwide mass relocation program.The move follows an apology from the school, which was criticized by some for not including a statement on racial justice in its September 2018 statement of intent in the wake of the May 26 fire. The school said that it has also been working on revamping its image and its campus, which already underwent a $50 million facelift in 2018.The school’s president, Mary Lou Correa, said that the campus redevelopment process will begin in earnest in January 2021 and will culminate in the institution returning to the campus in February 2022. The relocation will be based on the same principles as the construction of the college—a move that will involve the demolition of the former location of the Olympia Farmers’ Market—and will be overseen by architects Herzog & de Meuron and the local firm Gartner. The university anticipates that the artistic and cultural hub will reopen in March 2022.A", "The next Biennial should include an exhibition of work by artists on the list, which will be announced later this year; a selection of works by contemporary artists in collaboration with the museum; and a presentation of work from the institution’s collection, which is currently housed in the collection of the New York–based private collector Douglas Miro, founder of Miro Gallery.The announcement of the upcoming tour coincided with the launch of the new biennial, “The Black Box,” at the Museum of Modern Art, New York, which opens on November 4. Since its inception, the museum has staged more than seventy exhibitions about the work of Black artists. During its twenty-two-year run at the New Museum, the exhibition “is a project of the Black Box exhibition series, a joint initiative of the museum and the Black Box Foundation.” The Black Box Foundation, which serves as a nonprofit organization founded by the Museum of Modern Art, is chaired by John Lechner and Marc Andreessen, and is based in New York City.“This is a monumental moment for The Black Box,” said Langer. “We’re launching an exhibition in the city where the museum’s collection is housed, where", "The next Biennial should be held at the Palazzo Bernardo, the Villa Borghese, the Museo del Barrio, or at a venue that maintains a significant collection of the oldest works in the collection. Depending on the venue and the demands of the artists, the exhibition might include paintings, drawings, collages, sculpture, installations, and performances.\n\n\nNew York’s Metropolitan Museum of Art (MoMA) is planning to move a collection of around three hundred works by female African American artists—including over one hundred works by Ella Fitzgerald, Kermit Roosevelt, and Rosemary Hughes—to its new home in the Bronx. According to Artnet, the institution is currently working to determine the ideal location for the museum, which will boast a new 250-seat theater, a restaurant, and a café, as well as an expanded collection of works by African American artists.The move follows a wave of cultural policy initiatives by New York state and local governments and cultural institutions in an attempt to foster greater representation of African American art. Governor Andrew Cuomo announced last month that the state is planning to add twenty-nine works by artists of African descent to its collection. Mayor Bill de Blasio has also allocated $100 million to improve the economic and", "The next Biennial should be in the spring of 2020. The Spaces Collective have confirmed they will move forward with the event, but will not be able to return to Paris until the spring of 2021.For the Arts and Artifacts exhibition, which was organized by the same organizers as the Biennales d'Honneur International and will run alongside them in 2020, the organizers have extended the opening by an additional two months to March. The 2020 edition will take place at the Dijon-le-France International from March 15 to March 19.The opening of the exhibition will be marked by special performances by artists such as Marcel Prouvé, Rirkrit Tiravanija, and Reem, and a retrospective of the work of Thomas Metzger, which will showcase works from the museum’s collection, including commissions by artists such as Rachel Whiteread, Wangechi Mutu, and Kiki Smith. The previous edition, which was held at the Museum of Modern Art, in New York, featured the work of seventy-five artists.\n\n\nThe Agnez Collection in New York is planning to sell more than three hundred works that were digitized by the Nazi occupation authorities between 1941 and 1945, the New York Times reports.", "The next Biennial should take place in 2020. \n\n\nAs the United States gears up for a major military exercise this weekend, the Pentagon is spending $54 million to train and equipping thousands of soldiers for possible conflict zones in the Middle East and Africa. The program, dubbed PRECESS, was launched in 2017 as part of the reauthorization of the Military Construction and Veterans Affairs (MVPA) bill, which was passed by Congress in December and signed by President Donald Trump a few days later.The legislation mandated a $618 million boost in military spending for the 2019 fiscal year, a $137 million boost for the 2020 fiscal year, and a $97 million boost for the 2021 fiscal year, with $52 billion earmarked for the military. The bill also allocated $180 million for civilian security; $116 million for diplomacy and crisis response; and $62 million for international peace and security.According to the New York Times, the training program—which is being funded with a combination of borrowing money and funds from the US Treasury, as well as funds from the US Marshals Service and the Department of Homeland Security—will involve the construction of at least six mock combatant commanderships, each one housing up to one hundred soldiers", "The next Biennial should be held in 2021. It would mark the twentieth anniversary of the artists’ partnership and would serve as a platform to advance their work in a way that would be open to the public, in partnership with the BÃ¡́hichem Museum of Art, the University of Chicago, and the Los Angeles County Museum of Art.The full list of participating artists is as follows:The Biennial’s Board of Directors:Peter Miege, Director and CEOMariela Pérez, Director and CEOMaría Berrío, Director and CEOMarek Jovanovici, Director and CEONancy Herman, Director and CEOSharon Lewis, Director and CEOThe Biennial’s Executive Director:Jeanne M. Garcia, ChairNancy L. Breslin, Director of the Museum of Contemporary Art, Art in the ArtsTodd L. Fisher, Director of the Museum of Contemporary Art, Art in the ArtsAndré Holle, Director and CEO\n\nThe California Institute of Technology (Caltech) in Pasadena announced today that Dina El Banna, known for her innovative, experimental, and humanistic practice, has been named the nineteenth chair of its Institute of Technology, where she", "The next Biennial should take place in the summer of 2022, and will include the exhibition of the artist’s work at the new venue as well as an in-depth survey of the artist’s life and work.A selection of the artist’s works will then be placed in the public collections of the Museums and Art Galleries and the National Gallery of Architecture and the Museum of Modern Art, the latter in a ceremony that will take place in the museum's new building. The new exhibition will then consist of the artist’s work for the first time. These two exhibitions will culminate the work of the three-year Biennial. The exhibition’s theme “VIII Century,” will be “Augusto Antonić” and the artist’s work will be the subject of the “Seventh Prize.” The juried jury will consist of Nanda Carlotta, director of the Academy of Fine Arts, Milan; Tiago Galanção, director of the National Museum of Modern Art, Mexico City; and Tomasz Klimczyk, director of the Polisei Museum of Contemporary Art, Prague.\n\n\nThe Los Angeles County Museum of Art (", "The next Biennial should take place in the city in 2021.\n\n\nThe Museum of Modern Art (MoMA) in New York has announced that it is working with the Oscar de la Hoya Foundation to develop a new program at the institution in celebration of the seventy-fifth anniversary of the institution. The museum’s 2016 exhibition “Son of Sam” drew 11.1 million visitors to the museum. The new initiative will draw from the works of twenty artists in the collection, starting with the European photographer Robert Mapplethorpe, whose work appears in “Son of Sam” but is not included in the exhibition. The program will also highlight the contributions of African American artists and will present art from the 1990s through the present, including works by Richard Learoyd, Ted Eifert, and Ellsworth Kelly.Commenting on the project, MoMA director Daniel H. Weiss said: “The biennial will focus on the history of the institution—how we are making contributions to our larger mission, and how these have impacted our programming and our collections and our exhibitions.”“The new initiative is both thoughtful and timely,” Weiss said. “We are celebrating seventy-five years of", "The next Biennial should take place in 2020, as scheduled, to coincide with the International Biennial Queer, which was announced in November 2018. The second exhibition will be held in 2021, and the third in 2022. The 2018 Venice Biennale, which featured work by fifty artists, was canceled in March 2019 due to the coronavirus, and the 2020 edition, which was supposed to take place in May, was postponed.\n\n\nThe Museum of Fine Arts (MFA) in Boston has suspended three exhibitions of work by two female artists: Aida Pindell and Christine Delahanty. The curators were slated to present “What We Feed,” a new exhibition, organized by MFA, at the end of January 2020, and “Heather Calloway and Rachel Chiu: We Feed” a month later, but the exhibition was pushed back to February.“Regretfully, the artists involved have chosen to withdraw from the 2019–20 season’s exhibition, ‘Heather Calloway and Rachel Chiu: We Feed,’ which was intended to open in February, and instead work with the MFA on its forthcoming exhibition ‘The Visual Language of Love.”In", "The next Biennial should take place in the summer of 2021.   ***\n\n\nThe National Geographic Society in Washington, DC, has announced that it will stop holding annual meetings in April and instead focus on developing and presenting new programming designed to engage with and inform the public about the planet. Organizers cited the current climate emergency as the reason for the change, which will include a “deep dive into what it would take to reverse climate change” and will likely last for at least two weeks.The reason for the move was revealed in a statement issued by David Branch, president and CEO of National Geographic. He said: “To cover it all, we needed a plan that could be implemented in a timely, cost-effective, and inclusive way. We've come up with a bold new way to do that—one that uses data, that uses science, that uses cutting-edge technology, that uses art and that uses storytelling to inform, inspire, and inform. It’s a new way of doing things, and it’s an entirely new path. We are in a time of great uncertainty. We are in a moment of unprecedented change. But we are also in a moment of tremendous opportunity. We are at", "The next Biennial should focus on “African art” and will focus on “African consciousness and identity; the art the heart, the soul, and the body; and how art can make a difference and change the world.”Kamala Harris, the director of the National Gallery of Art in Washington, DC, said: “The upcoming Biennial is a watershed moment in my professional and personal history. I have been a longstanding supporter of art and am passionate about advancing the very best work by artists of color, and giving them a platform to explore and express their own voices, passions, and creative visions. I am thrilled that the National Gallery of Art in Washington, DC, will be able to recognize and use this work in our exhibition program and future programming.”\n\n\nThe Los Angeles County Museum of Art (LACMA) announced today that it has retained lead curator and artist-in-residence Elizabeth Alexander for its “The Slums: Artist-Centered Urban Ruins” (2019–20), which will return to the museum for its thirteenth edition, which will run from January 18 to January 20, 2021. Alexander will continue to present projects from the museum's collection in the form of", "The next Biennial should also include a lecture on the art of memory, which is often an important neglected topic in the cognitive sciences. An exploration of the impact artworks and memory have on the mental and physical health of individuals will also be included.One of the goals of the new biennial is to increase the visibility of the work of the Black and Asian artists currently underrepresented in American art. The curator of the forthcoming exhibition, Lila Esai, has already announced plans to present a series of works by Black and Asian artists and this year’s theme will be “Memory and Memory Consciously.”In the past, the Biennial has featured art from a wide range of cultural traditions, but it has had little in the way of a keynote speaker or an actual winner. “The work of these artists is a source of hope and inspiration for all of us,” said Hart. “It changes the way we think about what it means to be an independent artist and about how we perceive and respond to the world.”\n\n\nPhilip Klink, the director of the Schirn Kunsthalle in Germany, was forced to resign following a controversy that erupted after he posted a statement on Instagram in", "The next Biennial should take place in 2020.The events of the year include January 2015, which was the first edition of the Art Biennial in conjunction with the Art and Design Biennial, both in São Paulo; the twenty-fourth edition of the Art and Design Biennial in Paris; and the seventy-fifth edition of the Art and Design Biennial in New York.  The 2020 edition of Art Biennial will be held at the Museu das Beguiles, São Paulo; the venue will be relocated from the Museu das Beguiles to the Palacio do Povo, the Pia Pica de São Paulo; and the event will take place at Lódia, Rio de Janeiro. The event will also be moved from February to March. The 2020 edition of the Art Biennial in Rio de Janeiro will include a selection of twenty-seven new works by João Martins at the Rio de Janeiro Art Museum. The art and architecture biennials will include performances and performances, discussions and presentations, and exhibitions addressing topics such as the history of architecture and design, the future of architecture and design, the relationship between architecture and urban planning, and the history of humanism", "The next Biennial should take place in the city in 2021.\n\n\nNikon, the world leader in photography, has unveiled a new initiative to help visual artists and designers who are facing financial difficulties due to the coronavirus pandemic. Called the Impact Fund, the program aims to provide financial assistance of up to $5,000 to artists and designers whose creative practices are in need of immediate help. The program will focus on three themes: entry, sustainability, and community.Launched in April, the fund will distribute $2,500 to visual artists and designers living in New York, New Jersey, and Pennsylvania. Benefitting artists and designers who are facing financial hardships include Shimon Adami, Marlborough Trevelyan, and Robert Irwin. To apply for aid, artists and designers may visit the Impact Fund website here. The Impact Fund is just one of several initiatives that are being offered by arts and cultural organizations in the United States and around the globe. Communities United to Fight Canceralide (CuCom), the New York group that has distributed material such as posters, art supplies, and clothing to individuals and organizations affected by the coronavirus, has also launched a Facebook page where people can share art and resources to help", "The next Biennial should be held at the Museum of Modern Art in New York from January 6 to January 9, 2020. The twenty-sixth Biennial will take place at the Museum of Contemporary Art in Chicago from January 9 to January 14, 2020.\n\n\nThe Connecticut Museum of Art (CMA) in West Hartford announced today that it is planning to move the annual Art of the Party exhibition—a tribute to the late artist-in-residence Jeanne-Claude that draws approximately three thousand visitors annually—from its current home at the East Hartford Civic Center to the CMA. The move is part of an ongoing transformation of the city’s art landscape in support of the ongoing efforts of artists to advance their practice and to continue their work in the immediate future.“Jeanne-Claude has been an indispensable part of the CMA’s art and culture ecosystem for more than twenty years, and we are privileged to be able to celebrate her legacy with the Art of the Party,” said museum director Susan DeGroot. “For twenty years, the Art of the Party presented a celebration of the art of art, and her work was foundational for the development of our contemporary art, and for the development of our institution", "The next Biennial should begin in 2021 and conclude with a ceremony in 2023.\n\n\nThe Indian sandstone landscape of Gaya, India, has been given a makeover by the German firm Monza Turbine. The facelift, which was completed in collaboration with Gaya Mayor and Chief Architect Margot Voges, shifted the site of the main exhibition\u0097the 'Cindy’s House of Flowers: The World’s First Sustainable Home, 2020\u0097from a sleek five-story structure on the ground floor of the city to a more intimate space.The renovation aims to advance the exhibition’s mission of exploring the limits of architecture as well as to strengthen the museum’s connections with the local community. The work is part of a larger project to advance the museum’s relationship with the local community, by introducing special programming and exhibitions.“The museum’s Digital Village’s new home is an extension of the museum’s mission, the Digital Village, which has evolved to reflect the central role of design in shaping both the digital landscape and the lives and thoughts of people in the city,” Voges told the Art Newspaper. “It is a vision for the", "The next Biennial should be held in 2022, when the exhibition’s twenty-third edition will open in London. \n\n\nThe Carnegie Museum of Art in Pittsburgh has received a gift of twenty-four works from the Carnegie Foundation for the Arts (CFA) for its collection. The gift includes works by artists including Etta James-Landreth, William Kentridge, and Jane Fonda.The works are part of the CFA’s ongoing project to collect works by African American artists, who are historically underrepresented in museum collections, and are being made available to the public at no cost. The organization is also working to create a new $2 million a year center dedicated to the collection of art from the African diaspora.Commenting on the gift, which is one of a number of works donated by the CFA, Marilyn F. Bunch, the CFA’s director and chief curator, said: “This is a remarkable collection of works by talented and innovative artists that are currently on display in a museum on our campus. We are grateful to the Bennington Foundation and the Bennington Community Foundation for this generous gift and look forward to presenting the works of these artists to the public in the new museum.�", "The next Biennial should take place in the coming months. The first exhibition will be a retrospective of the artist’s work entitled “Hodgson’s Dies: The Duration of the Body,” which will be on view until March 31. The second exhibition, “Rokitas: The Existence of a Body,” will open on April 24 and run until May 29.The Bijlmer Foundation, which has hosted the artist since 2011, will soon be reborn as the new incarnation of the Feminist Art Museum Copenhagen, which will open on May 23. Since its founding by feminist artist Helene Bijlmer in 1985, the museum has presented artworks by women artists in all regions of the world. The Feminist Art Museum Copenhagen will also feature a collection of works by the artist’s longtime collaborator, the sculptor and photographer Helene Ihnatks, whose work is featured in the show “The Body in Space” (2019). The show will address the concept of the body as a relational construct and will feature work by a selection of female artists, including Laura Owens-Davis, Katerina Fabian, and Vittoria Cadetto, among others. The museum", "The next Biennial should be held in 2021 and will initially focus on the work of women artists living today.  Art historian and curator Jodi Throckmorton is the chair of the event.\n\n\nThe Solomon R. Guggenheim Museum in New York has appointed Kate Sandler as its next director and CEO. The museum has named Michelle Brown as its interim leader and chief curator since Sandler departed in February 2019 to head the New York–based nonprofit South by Southwest (SXSW), which is planning to hold its next edition in June 2020.Sandler joins the Guggenheim from the Museum of Modern Art (MoMA), where she was interim director and chief curator. At the Guggenheim, she has worked to build on the organization’s current holdings of John Akomfrah’s monumental Constructivism-inflected The Senses in a Different Kind of Light, which is currently on display in the museum’s Solomon R. Guggenheim Research Center; and The Pattern of Work: Joseph Beuys’s Work in Film and Video, which recently opened at the Whitney Museum of American Art.“With deep and compelling knowledge of the art world, and expertise in art and", "The next Biennial should take place in the spring of 2021. Programs that have already been curated include the \"Life and Art of Robert Frank\" exhibition, which will be staged at the National Gallery of Art in Washington, DC, next spring; and \"Toni Morrison and the B-Side\" (2019) at the Mycenaean Museum in Athens, Greece, which was on view at the UNESCO World Heritage site from March 13 to March 16.In the coming years, the Biennial Board will choose thirteen artists to represent the United States. The selections will be announced in 2020.\n\n\nThe Contemporary Art Museum St. Louis (CAMST) in Missouri has appointed Lisa C. Dinan as its new chief curator. Dinan comes to the institution from the Metropolitan Museum of Art (MoMA), where she has served as associate curator of modern and contemporary art since 2015. Previously, she worked as a curator at the Alexandria Museum of Art in Alexandria, Virginia, where she worked on projects such as The Flux Pavilion and Night Gallery in New York. “We are thrilled to welcome her to CAMST,” said Steven M. Amery, director of the museum. “We", "The next Biennial should be held in 2021. The 2019 event was postponed due to rising COVID-19 in the United States, and the 2020 event will be on the drawing board. The 2020 event will draw approximately 1,500 visitors from twenty-two countries. The 2022 event will be held at the New Museum in New York, and the 2020 event will take place in Dubai. The event will draw approximately 3,000 visitors. The 2020 event, titled “Shifting to the Future,” will consist of six shows, which will focus on the human condition. The show “The Birth of a Nation” will feature portraits of ancient African rulers; “The Diary of Nelson Mandela” will feature interviews with the leading African thinkers and activists, including Nkanga Nmtsegul, Kwame Nkanga, and Lululemon Shamans; and “The Best Years of Our Lives,” will feature essays on the birth of African civilisations and the legacy of the late president, Benigno Nkanga.\n\n\nThe Art Newspaper has revealed that the 2019 edition of Art Basel Hong Kong will be held in the capital city from March 19 to March 21, 2020. The", "The next Biennial should be held in 2020. \n\n\nThe Philadelphia Museum of Art (PMA) has received a gift of more than 20,000 photographs and prints from the artist Christopher Wool’s private collection. In an act of generosity the institution revealed that the works are among the most important works of his series “Stacy & Tyrone” (1952–53) and will restore them to the PMA in a ceremony slated to take place on September 19.“The collection is very important to the PMA and our mission to present contemporary art,” said museum director Matthew Teitelbaum. “The collection began with an approach to contemporary photography that posited the most radical and ambitious futures for photography and photography-making. Christopher Wool’s approach to the medium has been central to the PMA’s development as a museum and we are grateful to the museum for restoring this work, which has been out of print since 1952.”In commemoration of the gift, the museum has launched two new initiatives: the Christopher Wool Fund for Art and Art History, and the Christopher Wool Legacy Fund. Both initiatives will give $100 grants to individuals who wish to have the work returned to the museum.", "The next Biennial should include a full programme of exhibitions, lectures, residencies, workshops, educational activities, and performances.”\n\n\nCampaigner Luis Palma, who was arrested last October during a demonstration in Buenos Aires, has won the right to appeal the convictions of the two men who were charged with inciting terrorism and robbery, and is demanding that the cases be reviewed by the Supreme Court of the Argentine Republic.Palma, whose organisation, the Campaign for the Innocent, was behind the successful campaign to have the convictions overturned, said: “We will not give in to terror. Our government must stop persecuting peaceful protesters and hold those responsible for inciting terrorism accountable. . . . We will not let this repression be justified by a political scorecard. We will not allow political violence to be tolerated.”In February, the Supreme Court declared a state of emergency in Argentina and ordered the arrest of thousands of people for their alleged involvement in an attempted coup d'état on August 20. The government then proceeded to round up and place under arrest hundreds of people suspected of being members of the opposition, including members of the Falange movement, which was involved in the anti-coup protests. The government claims that more than 1,500 people were", "The next Biennial should focus on the history and theory of geometrical constructions, and on the materiality and creative potential of the sculptural field.”\n\n\nThe National Endowment for the Arts (NEA) has awarded $2 million to ten artists in the United States and Puerto Rico who have been selected to participate in the 2020 National Museum of African Art annual award. The 2020 grantees are Simone Leigh, Zeeyah Gueye, Christine Shaughnessy, B. J. Pollard, and Naima J. Keith.“The National Museum of African Art is a transformative presence on the National Mall in Washington, DC, and provides critical cultural, historical, and social context through the exhibition and presentation of the work of the twenty-three artists selected for the 2020 National Museum of African Art Awards,” said NEA director Ira Lewis. “By amplifying the work of these artists in an exhibition that has been previously staged at the museum, National Museum of African Art, and the Smithsonian American Art Museum—as well as by rethinking the museum’s collection and exhibition experience in the museum—we hope to encourage a new kind of engagement with African art.”The 2020 awards will honor", "The next Biennial should be held in 2021, and the next will be in 2048. \n\n\nThe SculptureCenter in New York has announced that it is preparing to open a new digital-only museum in the city in 2021. The institution will hold the first exhibition in the new museum, which will occupy a seven-story building at the corner of Twenty-Third Street and Fifty-Second Street, in the spring of 2021.Exhibition space will be relocated to the adjacent Museum of Modern Art, which opened in the same building in 1968, and the museum will be housed in the same building as the Goth Museum for a period of forty-nine years.The institution will welcome visitors from February 27 through May 29, 2021, with a new exhibition, Tossing Stones—An Exhibition of Art, that will explore the physical and conceptual possibilities of art. The exhibition will highlight the work of seventy-three artists and will run concurrently with the second Klaudenhove-Bornemisza Biennial.“A lot of engagement with art has become part of the fabric of our lives,” said artist and designer Frank Gehry. “We are moving into a new era of human experiences and this moment", "The next Biennial should be held in 2022 and “the second in 2024” according to the artist.Lambers, who was born in Switzerland in 1929, and his wife, Susan, began designing his works around the time of the second world war and relocated to New York in 1964. His sculptures have been collected by museums such as the Metropolitan Museum of Art, the Museum of Modern Art, and the Whitney Museum of American Art.\n\n\nAfter a couple of years of working as a curator at the Museum of Modern Art (MoMA), New York, artist Vito Acconci has announced that he plans to leave the institution in August 2020 and rejoin his family in Sicily. Acconci, whose works often challenge notions of art history, has lived in Sicily for the past twenty-seven years. While in the United States, Acconci taught at the University of Virginia, the University of California, and the University of Michigan.He will continue to work on his numerous series “Past Tense,” 2003–2006, a series of paintings that examine ambiguities in the concept of past and present, and “On the African Diaspora,” 2019–2020, which will be part of a seven-", "The next Biennial should be in 2021.The exhibition will be inaugurated by the painting of Sarah Bernhardt’s “Amber Waves,” which will be on view for several years to come, and will feature the work of more than eighty artists. The next iteration of the March/April/May events will be held in 2020.The Biennials will be chaired by Suella Bledsoe, director of the Institute of Contemporary Art; James Childs, director of the prestigious Tate; and Sara Cwynar, president of the Royal Academy of Arts. “This is a time of great change and we are deeply inspired by the work of our artists,” said Rory Mulligan, chair of the 2017 prize jury. “This exhibition will enable us to reflect on our past, reflect on our future and celebrate the breadth and depth of our visual arts.”\n\n\nThe Japanese government approved a major increase in the minimum wage for civil servants on Thursday, May 28, marking the seventh consecutive day the government has approved the raise of the minimum wage. The legislation, which was passed by the Diet and signed into law by Prime Minister Shinzo Abe, will increase the minimum wage for", "The next Biennial should be held in January 2020, and the first in February 2021. The exhibition will feature fifty works by twenty-two artists, including Mona Hatoum, Mohamed Ghenna, and Yasmina Al-Hashemi, as well as a selection of works by twelve artists whose work was not previously included in the exhibition. The exhibition will also include a new program that will focus on the region surrounding the city of Essen, Germany, as a backdrop for a new series of exhibitions organized by the city of Munich.The 2019 edition of the Biennial was held at the Neue Galerie Ludwig Wien, Vienna, and was organized by the Munich-based architect Jörg Neumann. The architects chose to continue with the exhibition in the former museum, in order to continue to explore the boundaries of architecture and design, and the artist-built environment, as a way of reframing the museum and the city. The exhibition opened on February 23, 2019 and ran until June 3, 2019.\n\n\nThe Museum of Southwestern Art in New York has selected the Iowa-born artist, filmmaker, and activist Natalie DiMarco as the winner of the Piotr Pintó (Portrait in Picture) Prize. In", "The next Biennial should be held in the spring of 2022. The exhibition has been a long time in coming, with the first exhibition organized by the museum in 1999. The biennial has featured exhibitions of work by hundreds of artists, from Ramón y Cajal to Hélio Baradello, from Marcel Proust to Paulo Freire, from Osvaldo Pascual to Edvard Munch.\n\n\nThe Israel Museum in Jerusalem has commissioned the Danish artist Oskar Eustis to create a triptych of works—twenty works by Eustis featuring images of police violence and Israeli soldiers. The actor and musician will perform the roles of Mervyn Barbour, pictured at the center, and Major General Yossi Hashomer, pictured at the right, in the performance. The work will be part of an exhibition titled “Ursula and the Eiffel Tower” at the institution.The Danish artist was selected for the commission by the institution’s curator of European art Lars Neelen. The artist will create a triptych of works titled “Ursula” in collaboration with the Danish historian Jørgen Eriksen, a curator at the National Museum", "The next Biennial should be set up in early 2021, with the goal of showcasing a new selection of works.  Francisco Guerrero, president of the regional organization, told Artnet that the project is a response to the current global health crisis as well as a tribute to the artists who have contributed to his lifetime.\n\n\nThe National Gallery of Canada in Ottawa is preparing to welcome visitors to its new home in the National Arts Centre with a spectacular new installation by artist Alvin Atget. The work, titled Peace, (2016), will be on view in the institution’s new venue, the National Arts Centre, until January 19, 2021.As the museum reopens, the gallery will open with a tour of its new building and its new garden. The garden will be a permanent home for more than 1,500 donated works, as well as a new exhibition of works by contemporary artists. The National Gallery of Canada will also add a new film and television series, an international marketplace, and an expanded academic library.“The installation is a celebration of the National Gallery of Canada’s history and vision,” said Maureen McAllister, the director of the National Gallery of Canada, to the Art Newspaper. �", "The next Biennial should be held at an appropriate venue in the city of Los Angeles to be determined, and should consist of a selection of works that have never been exhibited before and which are presented as a “shelf life” (or “mirrors only) of the artist’s studio, in order to examine and engage with contemporary art. The next stage is to form a committee, whose members will comprise three artists and three curators, to select a theme for the exhibition. The exhibition will then be commissioned to a solo artist, and the artist will be asked to present his or her work. The painting will then be included in the upcoming event, “Dia Artica” (2019–20), which will be hosted by the Los Angeles County Museum of Art. The artist selected for the exhibition will be chosen from a shortlist of three artists and three curators who will be announced in the coming weeks.\n\n\nThe National Gallery of Art in Washington, DC, has announced its representation of the influential Polish painter Wojciech Duda, whose work, which explores the relationship between light and the body, has been collected by the Smithsonian American Art Museum in Washington, DC, and the Smithsonian Folk Art Museum in", "The next Biennial should take place in 2019. The second, expected to take place in 2020, may already be underway.  For the next twelve months, the city will be transformed by the work of more than 200 artists, including Nicole Jonas, Anelysa Zher, Simone Leigh, Haus Mälich, and Ai Weiwei. The exhibition will also include the largest retrospective of the artist’s work to date, which is slated to open in 2021 at the Museum Freie Kunst in Berlin. The first shows the work of more than sixty artists, including Marina Abramović, Ava DuVernay, and Anne-Marie Walker. The second will spotlight a selection of work by around ninety artists in conjunction with an exhibition of works by the Berlin-based dance collective Beybla Tod, featuring choreography by Anna-Sophia Dziewior, film by Elena Federici, and paintings by Joanna Löss, Diana Miro, and George M'nico. \n\n\nThe Belle Art Museum in New York is planning to close permanently to the public next March to complete its $450 million expansion, which added a fifth floor and a cinema", "The next Biennial should be held at the Smithsonian American Art Museum in Washington, DC, in 2021. The next edition of the Frick Collection will be held at the New Museum in New York from May 20 to May 27, 2021.\n\n\nThe New York Times reports that the Uffizi Foundation has donated three new works by Italian artists to the Museum of Modern Art (MoMA) in New York. The works, which are called the Pennines, and were made in the early stages of their careers, were selected for their ability to evoke various cultural and historical memories through their associations with the Etruscan city of Venice.“The foundation’s longstanding support of the Museum of Modern Art has always been rooted in the idea that great art has a way of penetrating both the soul and the body of the visitor,” said foundation president Michael Grunberg. “The Pennines bring to light the intimate connections between the Etruscans and the Venice of the time, and here in our city, where we have been celebrating over two hundred years of its Museum of Art and its relationship to America.” The works will be presented in the museum’s upcoming exhibition “Virtuos Venezia", "The next Biennial should be held sometime in 2021. The Museum’s director, Gertjucja B. Jonsa, said: “The new Biennial will be an important step in establishing a coherent and current philosophical perspective for the museum. We have managed to merge several strands of our history to address contemporary issues, and to create immersive works that reflect the interests of the entire community. The result will be a great exhibition of contemporary art.”The Centro de Artes Modernas (CAM) in Madrid, which has staged the first edition of the exhibition since 2003, will also welcome visitors again in 2021. The event, which was backed by the Spanish Ministry of Culture, will be on view until February 28. The Centro de Artes Modernas’ opening reception will take place at the museum on January 27.\n\n\nThe New Museum in New York announced today that it is extending the opening of the new, luxury apartment building designed by German-based designer Kip Thorne since it opened on December 8. Built in the exclusive, fourth floor of the Renaissance Revival building, the ninety-one-story luxury residence is the latest in a series of new residences designed by the designer for the exclusive luxury apartment building.", "The next Biennial should take place in the city in 2021, with the first exhibition dedicated to Russian avant-garde works scheduled to take place in the summer of 2021. The institution’s director, Maria Balshaw, described the exhibition as “a way of re-imagining the history of art through interdisciplinary dialogue.” \n\n\nThe Institute of Contemporary Art (ICA) in New York City has announced that it has appointed Maria Balshaw as its new executive director. Balshaw will assume her post in January 2020.“Maria Balshaw’s leadership and expertise in the field of contemporary art and curatorial excellence will be particularly relevant in the immediate future as we embark on a rigorous program of programming, research, and exhibitions in the works of the ICA’s current and former artists, including Suzan-Lori Parks, Jasper Johns, Peter Sellars, and Vito Acconci,” said Ica president and CEO Max Stern. “Her appointment represents an important turn of events for the ICA. For more than a decade, she has been an integral member of the ICA’s staff, guiding its growth through a robust and creative cur", "The next Biennial should take place in the next few months. The board of directors of the New Museum in New York has appointed Patricia Vassallo as interim executive director. Vassallo has been the interim director since February 9. “We are grateful for the board’s prompt and thoughtful response to the health crisis,” said museum director Christopher Wool. “We are confident that with the appointment of Patricia Vassallo, we are entering a new chapter with new leadership, new vision, and new opportunities.”\n\n\nThe Smithsonian’s National Museum of African Art in Washington, DC, has been forced to quickly cancel a planned exhibition featuring works by two of the most influential African American artists of the twentieth century: Walter Lippincott and Larry Osse, after the institution received a threatening letter from the abolitionist group P.A.I.N. (Prescription Addiction Intervention Now). The organization held a press conference at the museum to address the controversy surrounding the exhibition, titled “Abandon All Pretenses,” and called for the withdrawal of funding that was slated to go to the exhibition. Larry Osse’s work is currently exhibited in three consecutive editions at the Museum of", "The next Biennial should take place in 2024.\n\nThe prestigious Prix d’Art Contemporain (PACE) in Paris, which will take place next month, is set to send a delegation of sixty artists to the city. The forty-ninth edition of the Paris Art Biennial will kick off on May 18 and run through May 25. The event will be held in the French capital’s Stalingrad quarter—the eighteenth and final section of the 'Abraham Lincoln: Race to the Top' project, which was founded in 2013 in collaboration with the Stedelijk Museum in Amsterdam.Led by design and architecture specialist Christian Stebbings, the inaugural biennial will feature new work by thirty-two French artists and will showcase the work of twenty-six artists who are represented in the catalogue. The biennial will also include a “portrait' section,” a retrospective of the work of the first woman to win the Prix d’Art Contemporain\u0097the artist was Yves Klein, a Frenchwoman who also works as an architect and is based in Paris\u0097and a “directoire de l’Avignon” (an “incomplete", "The next Biennial should be held in 2020.  According to a release, the festival will be �performed in collaboration with local communities, select, and independent artists, through a cultural space of the city of St. Petersburg.” \n\n\nThe Institute of Contemporary Art (ICA) in Vienna has appointed Lucio della Corti as its next president. Della Corti will take up the post on January 20, 2021. He succeeds Leo Bech, who was appointed as the new director of the Institute of Contemporary Art (ICA) in March, and will succeed Laura Weisz, who has served as the institute’s president since May 2017.“The appointment of Lucio della Corti reflects the strong and enduring connection between ICA Vienna and the Vienna-based arts community and the Institute of Contemporary Art, which has been the main focus of ICA Vienna’s annual Biennials since it opened in 1997,” Becht said. “With his proven track record as a leader and advocate for independent artists and his proven track record as a curator, he represents a fresh and innovative way forward for ICA Vienna and for the Vienna-based arts community.”\n\n\nThe Museum of", "The next Biennial should take place in Helsinki in the spring of 2021.\n\n\nThe São Paulo-based organization São Paulo Digital Cinema (SPA) has been awarded a $6.5 million grant from the Getty Foundation in support of its expansion into digital media and the promotion of its artists. Located in São Paulo, the institution, which was founded in 2009 by a group of Brazilian artists, is internationally recognized for its commitment to supporting the work of emerging and established Brazil-based artists.“After a thorough review, São Paulo Digital Cinema was awarded a $6.5 million grant to support its expansion into digital media,” said Getty Foundation president and CEO Denise Richardson. “With this funding, we are creating new opportunities for the artists, and are giving them a new way to make a living and a new approach to their work.”São Paulo Digital Cinema, which is housed in the Museu de Arte de São Paulo, Brazil, began as a platform for the artists of São Paulo. It was the brainchild of the Brazilian cultural entrepreneur Dinis Porto da Costa, who launched a $1 million challenge in 2014 to launch a new platform for the artists that would serve as an extension of S", "The next Biennial should take place in the summer of 2022. The Board of Directors of the Biennial has endorsed the project, which was initiated by the Museum of Contemporary Art (MCA) in New York, and has appointed veteran curator and curator-at-large Jean-Michel Basquiat as its next director. The board also appointed Christopher Wool as its inaugural board member. Herman Gass, chairman of the board and president of the exhibition manufacturer the Gass Gallery, announced that the company has received $6 million for its participation in the Biennial. A retrospective of the artist’s work, titled “Art of Life,” will be presented by the Gass Gallery at the Museum of Contemporary Art in New York in the fall of 2022.“We are thrilled to be making another contribution to the Museum of Modern Art,” said Jerome B. Greenberg, chair of the board. “This is a great opportunity to extend our influence on the next generation of artists whose work we have nurtured over the last fifteen years. At the same time, we have a responsibility to engage with the community at large. We are confident that the exhibition program of the Museum of Modern Art will continue to evolve with", "The next Biennial should be held in 2021.<|endoftext|>A federal judge in California has ordered Google to remove a controversial anti-Google hate blog that was set up by a group of activists in the Bay Area. The order came in a complaint that was filed by the Southern Poverty Law Center (SPLC) in April 2018. On Wednesday, a three-judge panel of the Ninth Circuit Court of Appeals in San Francisco renewed the complaint by ordering Google to remove the blog and all content associated with it. The court found that the company failed to warn the public about the controversial work and failed to explain how the removal of the blog would comply with a court order to remove a website associated with a terrorist organization.The blog was created by Avijit Roy and Adam Schiffman as a tool for their legal battle against Google. The duo were ordered to remove the website by a federal judge in California in April. Google claimed that the blog complied with court orders but argued that the SPLC was using the court order to harass the company about its cooperation with an anti-terrorism law that it did not directly address.The court found no evidence of any harassment but that the defendants used the court order to intimidate the plaintiffs into withdrawing their complaints.\n\n\nThe", "The next Biennial should be held in 2021, the same year the fifth edition of the event will open to the public. The event will be hosted by the Alexander Graham Exhibition Center, in partnership with the City of New York and the New Museum. \n\nThe Museum of the African Diaspora (MAD) in Oakland, California, announced today that it has received a gift of twenty-four works by twenty-three artists\u0097including the first exhibition of their careers, the Cairo Biennale, which was staged in 2014 and was held in January of 2019\u0097in the form of a donation from local businessman and collector Richard Langan. The works are currently on display in the museum’s exhibition “Calligraphic Art,” which will be on view until October 29.The gift was made in recognition of the fifth edition of the MAD Biennial, which was held at the Oakland Museum of California (OMC), from September 29 to September 29, 2020. The event inaugurated the museum’s new collaboration with the private collection of the dealer Farhad Manesh, and marked the first time that the works were displayed in the United States. In addition to the works, the museum also presented a number of previously", "The next Biennial should take place in the summer of 2022. For many, the choice of date is symbolism: the exhibition will unveil the first new works in more than two decades and will celebrate the legacy of the late Tunisian artist Zineb Sedira.“I would like to see the exhibition develop with the utmost creativity and with the most emotional connection to the artist’s daily life,” Saad said. “The exhibition will be an opportunity for Tunisia to have one of the most important exhibitions of her age.” Commenting on the biennial, Saad said: “To organize an exhibition of seventy works of art in such a short space of time is a challenge. To work with the artists who created such a vast and influential collection in such a short time is a privilege.”\n\n\nThe National Gallery of Art in Washington, DC, has appointed Mark A. Lee as its next director and chief curator. He will assume his new responsibilities on November 1.Lee will be responsible for developing and implementing a new curatorial program that will address the needs of the National Gallery’s urban, regional, and national audiences. The program will include special exhibitions, educational programming, and public programming, and will", "The next Biennial should be held at least five years after the date of the original exhibition. The exhibition should include works of contemporary art and include a public address and a performance.\n\n\nThe Museum of Modern Art (MoMA) in New York has removed a 1993 painting by Pablo Picasso that criticized American foreign policy. The work, 'Sierra Nevada, Sierra Madre, Sierra Nevada, Sierra Madre, Sierra Madre,' depicts a man in a drawing-board pose with a horse. “In the exhibition ‘Uncrom and Beyond the Frame: Art and Politics in the American Century’ (2014), the MFA held the abstract work for a special exhibition titled ‘American Art and Politics’ (2019). The piece, which was on display in ’60s and ’70s exhibitions, was one of several newly created by Pablo Picasso between 1993 and 2014, when he died.”Announcing the exhibition, director Carolyn Cahn said: “For almost forty years, the MFA has presented the work of Pablo Picasso in its permanent collection, and then invited future generations to see it. It is a remarkable story of a prolific artist working for many years on a conceptual and stylistic level and", "The next Biennial should be on March 26. The 2019/2020 edition will take place at the Palazzo Bernardo in Venice. The event will run from March 13 to March 21, 2020.\n\n\nThe Museum of Fine Arts (MFA) in Atlanta has appointed Steve Harwell, a former executive director of the American Civil Liberties Union (ACLU), as the next director of the museum. Harwell comes to the institution from the Atlanta-based nonprofit the ACLU, which has helmed the museum for nearly a decade. Previously, he was the vice president and chief curator of the Metropolitan Museum of Art in New York.“Steve brings a wealth of experience, knowledge, and insight to our organization as we continue to reimagine the future of the museum, especially as we approach the centennial anniversary of the founding of the ACLU,” said director and CEO Andrea Bennett. “We are thrilled to welcome him to MFA and look forward to working with him to shape a future for the museum that reflects the will and spirit of the late Diana Prince, the vision of architect Thomas Heatherwick, and the vision of a more inclusive, more robust, and more compassionate world.”Harwell will assume his responsibilities on April 3. During his", "The next Biennial should be held in 2020, and the first in 2021.\n\nThe Seattle Art Museum (SAM) has appointed Thomas J. Price as its new executive director. He will be responsible for spearheading the institution’s programming and direction through a new virtual reality and augmented reality experience, called VRWorks, which will be co-presented by the Seattle Art Museum and the Seattle Performing Arts Center.“The future of the Seattle Art Museum is at stake,” said Price. “I’m excited to work with our amazing staff, the board and the visionary partners to make VRWorks a reality, and to launch the museum’s first virtual reality exhibition this spring.”While Price was not on staff when the experience was conceived, he watched the institution’s transformation in virtual reality firsthand. In 2017, the museum opened the VRLab, which houses the museum’s extensive collection of VR experiences; partnered with the Seattle Children’s Museum to create a new virtual reality experience for families to enjoy with their children; and partnered with Microsoft to bring “Star Trek” to life.Commenting on his new role, Price said: “This is a moment of profound change for", "The next Biennial should be held in the fall of 2020 and will be led by the artist-run collective LOCUS (L.A. County Museum of Art) with Daniel B. Nava, who was recently awarded an $18 million MacArthur Global Talent Grant.Nava has organized the first Biennial of Artists since the museum’s reopening in 2008. The second, held in 2009, was deemed a success by the San Diego Arts and Culture Commission (SDCC), which awarded $14 million to South Coast Asian Art, the San Francisco Museum of Modern Art, and the New Museum. The theme of “Art and Life in Transition” inspired the construction of an exhibition space that opened in the museum in 2012. In the third and final Biennial, “The Birth of the West,” curated by Vijay M. Patel, the city of San Diego staged an exhibition of mid-twentieth-century works during the week of June 2–6, 2020.“We are very excited to be able to announce these three new projects,” said SDCC president Mauro Bertazzo. “New Museum and the Art Institute of Chicago are taking the lead for the second generation of", "The next Biennial should be presented by the State Museum of Fine Arts in Tokyo. The exhibition will begin on December 26 and run until March 16, 2020.\n\n\nMore than twenty-five artists who have signed a letter condemning the removal of a bronze sculpture by Pablo Picasso that was part of a major retrospective at the Museum of Modern Art (MoMA) in New York in July are demanding that the institution hold the controversial work, “Pain and Pleasure” for its exhibition “A Fine Balance: Art and Sex in the Age of Picasso” until it is restored.In their letter, dated July 28 and addressed to the director of the museum, Christopher Knight, the artists claim the “painting” reflects “a deeply problematic artistic and philosophical vision, one that is a direct and aggressive attack on the very idea of art and art history.”“Pain and Pleasure” is the fourth work in the program “A Fine Balance: Art and Sex in the Age of Picasso” to be pulled from the exhibition. The other two pieces, “The Serpent and the Rainbow” and “The Black and White of Beauty” were pulled from the show after protestors felt threatened", "The next Biennial should be held in 2022. When asked about the feasibility of holding a new exhibition in the same location next year, Mark Borthwick, director of the Centre for Contemporary Art at the University of Bristol, said: “We can do both. It might be better to do it in one year, but we can do both. We have a huge exhibition programme coming up next year, and we are working hard to plan a show for 2021, and we are planning for the future.”\n\n\nThe National Galleries of Scotland are planning to close their doors indefinitely after they return to the institution from a three-year renovation and said they are not prepared to reopen until they have addressed the “complexity of the situation.” The decision was made after the institution was placed on lockdown in March due to the coronavirus. The decision followed a three-month art fair at the National Gallery of Scotland, which featured over twenty artists, including Gary Barlow, Russell Cromwell, Maud Mullen, and Kirsten Vaisman. The fair was organized by the National Galleries of Scotland and sponsored by Glasgow-based gallery Menna Fraser. After art fair organizers announced plans to close the", "The next Biennial should focus on the necessity of human creation of earthworks of earth to promote a new and radical view of nature.”A biennial is a group show, unlike a show, a lecture, or an exhibition. Biennials are not organized by topic, but by the festival’s participants as a group. The theme for “Functionalism” is “the interconnection of art and technology,” which means that the new works of art should engage with patterns of life and the environment. The exhibition will be curated by Renzo Piano, the director of the Museum of Modern Art, and will begin on September 13.Commenting on the theme for the exhibition, MoMA artistic director Michael McAulay said: “The show will be a reflection of the feeling we’ve all had when we’re in the presence of something new and transformative. ‘This is a moment of profound change. We are all feeling it. We are all in this together.”\n\n\nThe Metropolitan Museum of Art in New York has committed more than $200 million to a redesign of its iconic Solomon R. Guggenheim Collection in the hopes that the institution can once again be a cultural destination", "The next Biennial should take place in 2020.  The Biennials: A History is a History exhibition will continue to be held at the Guggenheim until 2024, and will return to the city of Guggenheim in 2020. \n\n\nThe Academy of Fine Arts (AA) in Berlin has received a donation of forty-five works by artists, including David C. Driskell, Joachim Neugroschel, Andreas Neugroschel, Tommy Schoonmaker, and Harald Szeemann. The donation was made by artist-client Arne Glimcher, who lives in Vienna, and his wife, Petra.“The institution has long been known for its commitment to financing contemporary art and now it has a gift that will enable us to continue to do so,” said Eva Rüder, director of the Biennials. “The gift will allow us to continue to expand the museum’s exhibition program and to further develop its collection, but it will also allow us to continue to create and present new works of art that are accessible to the public.”The gift is valued at over $60,000, and was made in recognition of the artist’s thirty", "The next Biennial should take place in the City of New York in 2021. \n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it is now accepting nominations for its 2020 edition. The event will be held at the Muse’s campus in Pasadena, California, as part of the institution’s yearlong celebration of its sixtieth anniversary and the twenty-first century. Awardees will be announced in the spring of 2020.The 2020 edition of the Worldwide Biennial will be staged in New Delhi, Mumbai, and Venice. Titled “LIVE OUTLETS,” the exhibition will focus on how art and culture can be of use to those who are homeless, explore alternative modes of production and consumption, and integrate art and culture in their daily lives. The fifty-ninth edition of the biennial will be held in September 2022. “We are thrilled to support the homeless in America through the biennial,” said David K., director of the Biennial. “The Homeless Biennial will be a celebration of art and artmaking as such—with a special focus on art–making by artists—in a time when art is becoming ever more important to many as their", "The next Biennial should take place in the city in 2019. Joachim Neugroschel, a designer and collector from Berlin, has already organized a similar exhibition for Milan in 2021.\n\n\nThe Laurentian University Art Gallery in the United Kingdom has received a gift of more than one hundred works by artist-in-residence Mark Blum. Established in the French city of Lyon in 1948, Blum is one of the most influential contemporary painters in the world. Known for his groundbreaking conceptual art, including his monumental 1981 exhibition at the Museum of Modern Art in New York that featured work by Vincent van Gogh, he also championed the practice of painting in a post-war era.Born in London in 1932, Blum moved back to the United States in 1947 with his wife, Helen. Their first townhouse in the suburb of Auburn, Michigan, was purchased by Blum, who lived there for the rest of his life. In 1960, he began his career as a painter, whose works are often associated with his father, a British Dutch immigrant. In 1970, he moved to New York to be closer to his family, and in 1974, the same year he began his “Painting on Paper” series, a series", "The next Biennial should take place at the end of April 2020.A statement by Quebec City’s arts and culture minister, Régis Labeaume, said: “The government will not allow the museums and the city-cities of Quebec to be used as a platform for the promotion of terrorism. This is a situation that has been aggravated by the policies of the previous government. In order to ensure that the biennial is able to present the best possible exhibition in order to welcome the international community, we need a stable of organizations that can provide support. The situation in Quebec is extremely complicated and we are working with our partners to understand the situation closely, to evaluate the situation, and to make an informed decision.” While the exhibition “Theater of Operations: The Gulf Wars 1991–2011” will go on as planned, the biennial will actually be suspended for a period of thirty days. According to the Montreal Gazette, the exhibition was originally scheduled for March 26–March 28 but was pushed back a day due to the Covid-19 pandemic and will now run from April 15–April 18.The biennial’s artistic director, Yael Hochner, told the Montreal Gazette that the twenty", "The next Biennial should begin on the occasion of the centenary of the outbreak of World War I and, in the process, should take into account the historical, social, political, and spiritual context of the opening of the exhibition. The task of the future Biennial is to carry out a systematic review of the exhibition within the framework of the present exhibition as well as to re-examine contemporary art in a pluralistic, interdisciplinary, and trans-global way. The exhibition will also incorporate the concept of the future, the past, and the present within the context of a future society, as indicated by the ’current.” “In this way, the exhibition will respond to, and be responsive to, the contemporary issue of art and art history and the contemporary experience of the world.”In addition, the exhibition “Ikon Eien: The Exhibition of Ikon,” which is slated to open in the autumn of 2020, will include a series of performances and performances to mark the first anniversary of the exhibition. The first performance, titled Tomorrow we Remember, will be held at the Kunsthalle Bremen in May 2020. The second performance, titled Üvalles, will be", "The next Biennial should be held in December 2020. Want to help keep Art Boston vibrant? Support the artists and organizations who create art in the city by donating to Art in Boston. Columbia University Art Gallery will receive $50,000 from the $1.6 trillion CARES Act. Columbia also recently received $25 million from the $1.4 trillion CARES Act. The $50,000 grant will support the organization from December 5 to December 7. The funds will support the following artists, organizations, and institutions:\n\n\nThe Flint Art Museum in Michigan has received a gift of over three hundred works by fourteen female painters from the National Gallery of Art in Washington, DC. Among the works are works by artist Katrina Martens and work that involves painting and drawing, as well as works by artists such as Mary Ellen Cunningham, Mary Ellen Dietz, and Rachel Harrison.The gift was presented by museum director Deborah A. Flint to the museum’s board of trustees on December 6. According to the museum’s website, the works comprise works that were donated by women artists who either never lived and did not want to create these works, or were largely forgotten. The museum has previously", "The next Biennial should focus on the history of the art, with particular reference to the ways in which art history is organized, produced and distributed. It should also consider the current situation in the art world, and how biennials can help to address the issues that are most pressing to present-day art-historians. For the third edition of the exhibition, curated by Elmar Pfeifer and featuring artworks from the interdisciplinary group of biennial scholars, organized by the museum, the biennial will return to Stuttgart in January 2020.\n\nElmendorf-Bickel Gallery, the New York–based contemporary art center, has announced its representation of collector and philanthropist Henri Marc Payot. Known for his deep-rooted philanthropy, which includes a well-documented $2.5 million gift to the school of art and architecture at the University of California, Santa Barbara, in 2011, Payot has also helped many artists raise funds through his museum's gallery. Among the most prominent are the work of Jean-Michel Basquiat, the late Egyptian architect Kiki Ben-Ari, and the critically acclaimed ceramicist Ed Moses.In a statement, Marc Payot said: “I have been", "The next Biennial should be held in 2021. But as the health crisis worsens, and as more than 300,000 people in China are diagnosed with the novel coronavirus, the lead organizers of the 2020 event, Art Basel, have announced that the event will be postponed.According to Artnet, the festival will now take place in two locations: Art Basel Hong Kong and Art Basel South Korea. The next iteration of the show will take place in September of 2021. More information about the staging of the event will be announced in September. The Asia Biennial will be held at the Art Basel Hong Kong and Art Basel South Korea from September 10 to September 13, 2021. The event will also be hosted at the Korean Art Museum in Seoul from September 12 to September 18, 2021. \n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it will open its first residency program in the United States at a new location, the Museum of Contemporary Art (LA) at 6100 West Alameda Avenue, on September 2. The program will focus on the art of the late twentieth century and will offer a residency to an individual who will come to the institution for two months in", "The next Biennial should have a new major theme, the Museum’s new collection, and a new exhibition, “The Future Is Present: The Biennial,” which is currently on view until November 22. This show is organized by the curator-in-residence, Olga Acosta, who is based in Mexico City.The 2017 edition of the region’s largest art event, the Art in Spain, attracted more than 1.5 million visitors from twenty countries. The exhibition featured work by ninety artists and won the Royal Academy of Arts’ award for its best exhibition of 2017. The exhibition also received the Royal Commission for Modern Art’s avant-garde award. The biennial, which will culminate in two exhibitions, “Between the World and Me: Art and the Spanish Revolution” and “Roots of Spain: Art in the Spanish Revolution” in 2020, is a continuation of the exhibition Legacy of a Nation: Spanish Art and Modernity (2019) and is organized as follows:The exhibition “Between the World and Me” will feature works by thirty-five artists, including Carlos Belluz, Javi Bonilla, and Joning, and", "The next Biennial should be held at least once a year. The museums will be renamed in recognition of their contribution to the recovery of the art. The art and the city of Detroit will remain at the Van Andeloy Collection, which represents the remains of the Van Andeloy residence, until it is donated to a museum. The Van Andeloy Collection will organize the exhibition.The Biennial was co-organized by David McAllister, a curator of modern and contemporary art at the Detroit Institute of Arts, and Ann-Marie McAllister, the chair of the Van Andeloy Collection. The artists selected for the exhibition include Jacky St Clair, Vincent van Gogh, Frank Gehry, and Thomas Newcomer. The exhibition was inspired by a story told by a young architect whose father, a Polish immigrant, was a partner in the auto-bodybuilding and construction company J.D. Dachau. The father died shortly after returning to Poland from Germany, leaving his vast fortune and his two children to his surviving son, who became an art dealer. The son received a $250,000 grant from the Van Andeloy Foundation in 2002.\n\n\nThe 26-acre site of the", "The next Biennial should also include a presentation of “For These Walls,” a project by the Minneapolis-based collective West Indies Garden to highlight the work of African American artists in the United States. The exhibition is currently on view in the South Asian art biennial “For These Walls,” and will be on view until October 28.The 2019 biennial has released three new works by artists and designers: Juan Araya, Ana Mendieta, and Mette Brouwers—all of whom won the 2019 Pulitzer Prize for their work drawing attention to climate change. Previous winners include John Lloyd, Angela Pascual, and Yvonne Rainer.\n\n\nThe Association of American Photographers (AAP) has announced that Valentin Agosto has been selected as the next executive director. Agosto will be based in New York City and lead the agency from June 29 to July 1. He succeeds Sam Evans, who is currently serving as chief executive of the New York artist-run nonprofit Art in America.“A great champion of the arts and a fervent supporter of artists across the US, Valentin exemplifies AAP’s values and works consistently to transform the world of visual art,” said", "The next Biennial should award a total of $5 million to the arts and humanities in 2018–19, with $3 million for fellowships. Also of interest is the declaration of Christopher Wool’s controversial article in Artforum from September 2019, titled “What Is Art?”—the essay was published shortly before Wool was assassinated by a member of an extremist group called the Combat 18, a group that espouses strict Islamic principles. Wool argued that art is not a vehicle for political action but rather a “diet.” He concluded: “There are many ways of approaching life, but there is no art.” In his 1955 essay “Art and Politics” in the May/June issue of Artforum , Wool wrote: “Of course, art is political, but it is a politics of art.” Art is a political philosophy; politics is a philosophy about how the world works.  \n\nThe Whitney Museum of American Art in New York has appointed Joseph Conrad, who served as head of the collection for nineteen years, as its next director. In his new role, which is funded by the Whitney, Conrad will lead", "The next Biennial should take place in 2020 and will focus on the experiences of the participants from the inaugural exhibition. The exhibition’s curator, Ruth Bader, said: “It’s an exciting time to be a curator. My research has been a huge part of the foundation’s mission for many years and I’m very much looking forward to continuing the work of my predecessors. I hope the exhibition will be a turning point for the foundation as it moves forward.”\n\n\nNew York’s Metropolitan Museum of Art (MoMA) and the Museum of Modern Art (MoMA) in New York are preparing to open their new exhibition spaces in the summer of 2020. After a $150 million expansion, the museums will boast twenty-three galleries that will each be capable of holding fifty people. The artists represented in the exhibition will range from Daryl Hannah to Tomás Saraceno. The opening of the first full-scale exhibition of the new museums will take place at the Metropolitan Museum of Art in September.The Met, which has been working on the redesign of its new spaces for more than a decade, recently received a $150 million gift from businessman Mikhail Prokhor’s private foundation,", "The next Biennial should be held in June 2021. In an effort to remove the risk of further unrest, the city is planning to suspend all public events and close all public locations, including schools. The announcement is part of the reopening of the city’s art museums, which will reopen on January 16, 2022.“Recent events in and around Los Angeles have reminded us that we live in a global city,” Mayor Eric Garcetti said in a statement. “This is a global emergency, and we must come together as one city in solidarity and resilience. The city of Los Angeles has been and will remain at the forefront of the global fight against climate change. We will not back down.”Garcetti added: “The future of our planet and its inhabitants is at risk unless we act collectively. I have been working hard to ensure the future of our art museum, our parks, our schools, and our city centers, while also ensuring that the workforce can’t be displaced by the pandemic. The city’s workforce will be there in April. We will continue to do all we can to stay connected and connected to our world.” The Los Angeles County Museum of Art (LAC", "The next Biennial should take place in 2020 at the Museum of Modern Art in New York. For the first time, the event will center around the concept of transcending the boundaries between man and machine. The themes of the biennial will include the use of art and technology to address social ills, the afterlife, and the digital sphere.“We are honored to have the opportunity to present the biennial at the Museum of Modern Art, and to celebrate its fifty-fifth anniversary with a new exhibition that demonstrates the transformative impact that art and technology can have on our lives,” said Mark Lozano, the president of the institution. “Over the past fifty years, Biennial Shanghai, the Museum of Modern Art, and the China Art Museum have become essential cultural centers for our cities and regions. The Museum of Modern Art Shanghai is the largest and most important art museum in China, and the China Art Museum is the largest museum in China, and the China Art Museum is the largest museum in China, and we are committed to continuing to grow the museum in Shanghai, and to developing new intellectual and artistic opportunities for our audiences.” \n\n\nThe Tudor House Museum in London has appointed Matthew Booth as its first chief executive and director.", "The next Biennial should aim to draw as many people to the festival as possible and create a focus on the arts and culture in the city. It should focus on public art, performative art, and design in the city. It should also bring together young people from different backgrounds and communities to create a more inclusive and international audience for art. The biennial will also be themed around the theme of life; the events that take place in your own life, and how they affect your city, your city of the spirit, and the city of the future. The first edition of the Biennial was held in 2001. The 2017 edition will focus on how people can empower their communities through the arts and will be held in New York in 2022. This edition will also present two new works.\n\n\nThe Cologne Biennale is planning to postpone the event by two years, citing the financial impact of the global health crisis as the reason for the move. The Norwegian organization behind the event, the Fundação da Biennale da São Paulo (FAB), said that it is now considering a year-round program. This will mean that the biennial will not open on the first Sunday of March next year but will be held over", "The next Biennial should open in 2021.\n\n\nFrance will welcome visitors from the US and Europe on April 7. The event will be held in Montpellier, the capital of France, and will be hosted by the French Ministry of Culture and the National Galleries of Fine Arts Paris, as well as the Institut für Nationale des Beaux-Arts Berlin and the Institut fu Schädel in Neukölln, Germany.The festival, sponsored by the French Ministry of Culture, was created in 2016 to mark the anniversary of the French Revolution—the country’s founder, Alexandre Say, had set up the event to encourage people to re-read history. Since its inception, the event has been attended by over 1,000,000 people.France’s Culture Ministry said that the event will be “an extension of the ministry’s mission to encourage the exchange and the understanding between French and American culture.” The ministry also quoted Say as saying: “Without the presence of the American people, France would fail.”\n\n\nArt Basel China has released the list of the twenty-eight galleries participating in its Beijing fair, which will run April 14–March 21, 2020.", "The next Biennial should inaugurate a new platform dedicated to the works of Catalonia’s indigenous artists, a project that is organized as a series of exhibitions in collaboration with cities in the region. The center will also host micro-events and special programming that reflect the spirit of the biennial, including a workshop on Indigenous art and modernism, a special exhibition on the history of art, a show on the history of cinema, and a documentary on the indigenous people of the region. “The biennial is an idea, a plan, a project, an institution, that promises to be a space for reflection and reflection on the broader and more complex world that will challenge the conventional understanding of art as a mere collection of the works of few, the collection of the wealthy and the powerful,” said Ismael Alvarez, Arturo Pérez’s president and CEO. The project mark the first time the two companies collaborated on a project in Spain.\n\n\nAn American artist, activist, and educator was sentenced to thirty-five years in prison for helping to overthrow the government of Iraq’s second-largest city, Ramadi. The artist, Jamal Al-Shaykh, was found guilty of nineteen charges,"]