["The next Biennial should be held at least ten years after the request, and will be organized as follows:The theme will be “Aesthetic Reflection” and will be composed of selected works by female artists.The theme will be the artist “Jasmine Gordon,” a work that is based on the exploration of the relationship between sculpture and the body and will be included in the exhibition. The artist “Jasmine Gordon” will be featured in the exhibition “Into the Night,” which will open on October 16 and run until November 21.\n\n\nThe Newark Museum of Art (NMA) has unveiled its new CEO, Oscar Levant. The new CEO will take the helm of the institution on January 4, 2021.“Joan Larsen has changed the face of museum leadership, fostering an environment of transparency and respect across an array of disciplines,” said Hanno Bernal, NMA’s director and CEO. “Oscar’s appointment fulfills an ideal opportunity to build upon the strong leadership and institutional relationships that have made the institution a destination in its own right. He represents an exciting new generation of leaders who will shape the next chapter of the museum’s", "The next Biennial should be held in early 2020. \n\n\nThe Metropolitan Museum of Art (the museum) in New York announced today that it will award $3.5 billion to fifty-six organizations in twenty-three states in the United States as part of the Metropolitan Museum of Art’s centers and museum expansion plan, which will also create more than five hundred new jobs. The grants, which will focus on arts and culture in cities and regional areas where there are high concentrations of art museums, will be made through the Metropolitan Museum of Art’s Art in the City program, an initiative that was established in 2009 to reduce the museum’s footprint by moving more of its holdings into urban settings. The grants will be made in partnership with twenty-six state, local, and federal government entities that comprise the Met’s Cultural Centers, including the Department of Cultural Affairs, the Department of Design, the Department of City Planning, and the Metropolitan Transportation Authority.This year’s grant cycle was inaugurated by the construction of the museum’s new home at 60 East Twenty-Fourth Street, the East End, and the Museum’s new home at the Museum of Modern Art in New", "The next Biennial should be held in 2021. The cause of the interruption is the ongoing crisis in Ukraine, where the country is currently undergoing its worst unrest since the collapse of the Soviet Union. The leaders of Belarus, Kazakhstan, and Russia signed a joint statement on March 4, calling for a quick end to the fighting. The statement followed the release of an open letter by more than sixty leading arts figures in the country, which demanded that the conflict in Ukraine be brought to an end. On March 14, the Russian Foreign Minister, Sergei Lavrov, made a statement saying that the country was ready to help Ukraine in any way it could.\n\n\n\n\n\n\nIn the United States, where the number of homicides committed with firearms has increased by more than two hundred percent since the election of Donald Trump as president in November, the number of people killed by firearms has also risen. According to the Washington Post, in the first six weeks of the Trump administration there have been more than 88,000 homicides—a seven-fold increase from the same period last year. The highs and lows of the current crisis have led many to worry that things are only going to get worse before they get better.Bodies are now strewn across highways and littered in the streets of major cities", "The next Biennial should commence with an open studio sessions on February 24 and conclude with a guided tour of the museum next March. Its first exhibition, “The Palazzo Prada: 15 Years of Modern Art” will open in the museum on February 21.  Inaugurating the museum will be the exhibition “NADA: Radio Life in Memoriam” and “SOUTHAMPTON: A Retrospective.” The opening of the Southampton Biennial will coincide with the opening of “A Retrospective” at the Southampton Arts Centre. The exhibition will include works from the collection of the Museum of Modern Art in New York, the Museum of Contemporary Art, Melbourne, the Palazzo Pucci, and the Tate, and will be followed by “The Artist” at the Centre Pompidou in Paris on March 5. The show will be followed by “A Retrospective” at the Museo Latina in Lisbon on March 8, and “NADA” at the Louvre in Paris on March 9.\n\n\nThe Canadian Council of Museums (CCMoM) has announced the winners of its 2019 biennial awards. The laureates were", "The next Biennial should be held in early 2019.Artforum***Artforum has announced its representation of Brazilian artist Bicane Ribas. The artist will be a solo exhibition to open at its Amsterdam location in October 2020.“Bicane Ribas’s practice combines a range of traditions and a deep understanding of experimental art,” said Sarah Butler, director of Artforum. “The artist can create both beautiful and deeply unsettling works that are deeply personal, with their own histories and histories of their relationships with others, and about themselves.”The artist was born in São Paulo, Brazil, and studied in the United States, France, and Mexico. His earliest work is from his childhood, an early-twentieth-century installation called Formosa, 1995, in which a group of children play in a lake, wearing rubber masks, creating floating sculptures of drawings, photographs, and paintings. He continued to create in the early ’80s at the request of his mother, who was then working as a seamstress in New York. Throughout the ’80s, he was active in the contemporary art world, appearing in Artforum’s May 1985 issue. In 1998, his work was included in", "The next Biennial should take place in November 2021, as planned. The theme of the exhibition will be “Art and the Black Body” and will be “Feminine and the Human Body,” with the exhibition “Oddities of the Body,” which focuses on the female body and related themes of anatomy, reproduction, and reproduction. The biennial will culminate in the fifty-seventh edition of the Biennial, which will take place in Tokyo in October 2022.The exhibition will determine the fifty-ninth edition of the American International Art Biennial, which will take place in New Orleans in December 2022. The exhibition will also determine whether the biennial will be held in the United States or in New York. The exhibition will be a collaboration between the Smithsonian American Art Museum (SAAM) and the Museum of Modern Art (MoMA).“We are profoundly honored to work with MoMA in this way,” said Mukul Sharma, the exhibition’s curator of American Art. “We are also deeply moved by the image of a beautiful young woman in a simple white dress, by the original painting in the exhibition, and more importantly, by the work of the artist.”The", "The next Biennial should be held in 2021. Inaugurating the ten-year anniversary is a special exhibition, “The Future Is Present,” of photographs by Joël and Yoko Lubin, curated by Kathrin Blixler (Düsseldorf and New York), which features works from the first Biennial in 1978 (credited to Hans Hofmann, 1945–2007) to “The Color of the Sky” (directed by Helmut Newton, 1940–2005), which is currently on view until October 26.The program will open with a special exhibition of work by Philip Jung: “The Material World,” a series of photographs that explore the materiality of space, and will continue in the tradition of the first exhibition. The second half of the exhibition will feature works by artists such as Frank O.H. Wuertt and Melchior Watz, who will also create new works for “The Material World” and “The Naked Sun.” The exhibition will run from February 11 to February 12, 2021.\n\n\nA new study published in the British Journal of Arts proposes that the British Museum, which opened in Whitechapel Gallery in", "The next Biennial should be held at least eighteen months after the expiration of the current contract. The deadline for this year’s edition is September 27.\n\n\nThe Sitka Museum of Art in Alaska has received a donation of fifty-four works by thirty-nine artists from the Willamette Valley, including twenty-two signed by artists who are represented by the City of Portland. The gift includes works by such artists as David H. Dallin, Matthew Hammond, Jeffrey Gibson, Nick Hampton, Robert Keller, and Rayyane Geshar.“The local artists’ generosity and devotion to this history and this region is inspiring,” said museum director and CEO Christopher Knight. “This year’s selected artists are exceptional and enrich the history and the art of the Sitka by providing a rare opportunity to study and experience their work in the Southeast.”The donation comes on the heels of the announcement that the Museum of Contemporary Art Oregon will support the Sitka’s work in supporting an expansion of the museum’s collection of nineteenth-century Northwest artists. The project, which was outlined in a new partnership that opened this week, will add four new works by thirty-nine artists to the museum’", "The next Biennial should be held in 2022. “This is a huge challenge for us, but also an opportunity,” said Los Angeles-based artist Ariel Pink. “We are currently in the process of conceptualizing how we can take the art of the past and present, and bring it to life in the digital world, to a greater extent than ever before.” The show, titled “Art in the Age of Social Media,” will run from January 16 to January 19, 2022.\n\n\nThe Smithsonian announced today that Tod Williams has been appointed as its next executive director. Williams takes the helm from Loring Randolph, who has led the institution for more than twenty years and will take up the post on January 5. In his new role, Williams will oversee the work of the eighty-two-member board of trustees and exercise his authority in ways that ensure the museum’s continued excellence.“We are excited to welcome Tod to the board and to be able to welcome Tod to Los Angeles,” said board president Mary Ellen Bove. “Tod brings significant experience and knowledge in the field of contemporary art, having served as the chief executive of the Los Angeles", "The next Biennial should be held in March 2021. This will mark the next stage of the artist’s studio/workshop program, which has been ongoing since the 1970s. The museum will be reconfigured into an annual exhibition and a new exhibition hall that will take up the center’s existing podium. The redesign—designed by Italian architect Ciro Catellani—will include the installation of forty-six quatre-sized sculptures, which are arranged in a grid pattern, by an artist known only as Gianluca. The new venue will also feature a library of forty thousand texts.In his description of the new space, Adrian Wootton, the director of the Weston Art Gallery in London, wrote: “The new Weston is a collaborative assembly of the arts: a stage that will work with the senses to help us understand the world. There will be a library of books, CDs, DVDs, a database with artists’ texts and other resources, and an exhibition hall. In short, it will be an exhibition space. We are very excited to be working with the artist in this new role.”The biennial is supported by a £60,000 grant from the William Grant Foundation and", "The next Biennial should be held at the New Museum in New York, but the institution has yet to say when it will hold its first exhibition dedicated to the works of the late artist Susan Brown. The Danish artist Gitta Sereny, who was known for her interdisciplinary work, has died at the age of eighty-eight. Among Brown’s artworks that have recently entered into permanent collections are Diana, 2001, a lithograph with a large thread painted on the back of a chair and donated to the museum in 2007; and the American Indian and the Black (2007), a paper sculpture that began as a drawing and evolved into a performance and a multimedia installation that was exhibited at the Biennial in 2006.The Danish Center for Contemporary Art (Dansk Contemporary Art Museum Flemmingborg) has released the complete list of participating artists in the twenty-fifth edition of the event, “Suffragette and Spring,” which will be held at the Biennale de Lyon in March 2021. The exhibition will also include a book by the artist, an oral history, a virtual reality work by the artist, and a video work by the artist. The Danish artist Martina Habel, who won the Prix Duro, will", "The next Biennial should be held in early March. The program, which was inaugurated by the biennial’s inaugural exhibition, “The Architecture of Movement: Biennial 2018.”\n\nThe Museum of Contemporary Art (MoCA) has appointed William R. Heineman as its next director. Heineman comes to the museum from the Metropolitan Museum of Art, where he currently serves as associate curator of modern and contemporary art. Heineman will assume his responsibilities in February 2021.“At this pivotal moment in the history of modern and contemporary art, will we continue to share art and ideas with one another or will we become complacent? Will we allow our visions to overwhelm our realities? Will we undermine each other’s power structures? Will we be drawn into overlapping movements, histories, and narratives? Will we falter in the face of opposition and anger? Will we allow our voices to be drowned out or drowned out only, or will we rise up against the silences and the silences only?” said Heineman. The seventy-nine-year-old museum director also discussed the history of modern and contemporary art and the importance of reconstructing the body of work created by artists of marginalized histories.", "The next Biennial should be titled The Architecture of Play. This year’s edition was curated by the Italian architect Maurizio Cattelan and includes work by thirty-nine artists. “Play’s architectural role is to give form and structure to the ideas that are in motion and to animate them,” said Filippa Scalfari, the director of the Biennale. This year’s theme was “Planetary Autonomy” and the exhibition’s final piece, a series of photographs, was inspired by the artist’s work to create a new world.  Scalfari said the project was “a way to give forms a potential that was missing from the field,” and that the work reflects a “new way of seeing architecture.” \n\n\nFrench car maker Daimler & Chasse, which has extensive international operations in the United States, is planning to move more than 1,500 jobs from Monadnock to Germany, in an attempt to cut costs and reduce costs of living in the EU. The decision is part of a deal that will see more than 1,100 manufacturing jobs moved to Germany, and at least 1,", "The next Biennial should be held in late 2022. The exhibition’s first year will consist of the artist installation “Acts of the Body.” The biennial will also include a group show of work from newly-created commissions (the artist will create a new work every month during the exhibition). Curator and curator of contemporary art at the University of Cagli, Stefano Cattelan, also announced his retirement on Tuesday. “I am deeply honored by this opportunity to continue the work of my predecessors, with the extraordinary artists from the present and former Centro de Cultura Moderna (CIMAM),” Cattelan said in a statement. “I believe that the work of the artists in the exhibition will help us to better understand the historical and social evolution of contemporary art, and I am deeply grateful to all the artists who participated.”The institution has also had a number of collaborations over the years. In 2002, in collaboration with the Center for Contemporary Art, the National Galleries of Canada, the Museum of Modern Art, and the New Museum, the Museum of Contemporary Art Canada hosted an exhibition of works by a group of Italian artists in the United States, and in 2009,", "The next Biennial should take place in 2020 and will feature a selection of works created by twenty-five artists in the exhibition, which will be curated by Nari Ward. The 2019 event, the first exhibition of the new program, was held at the Palace of Fine Arts in Paris and attracted a plenty of visitors, including Nari Ward and Ann-Marie Kounelles. The 2019 exhibition was organized by the biennial-organizing group of the same name, with the assistance of artist and curator Thomas Beasley.“Following the exhibition of the first edition of the Biennial, in November 2019 the exhibition was taken over by the biennial-organizing group of the same name, with special collaboration and support from Nari Ward and Ann-Marie Kounelles, whose work was curated in collaboration with Ward. This exhibition has since yielded the following series: ‘From the Spring: Biennial of Women in the Arts, Nari Ward and Ann-Marie Kounelles’s first exhibition, ‘From the Spring: Women Artists in the Arts’s Resnick. In 2020, the exhibition will be staged at the Biennial of the Works at the Palace of Fine Arts in Paris, with Nari", "The next Biennial should be organized as a commemoration of the martyrs of the Tunisian uprising, with a view to reaching out to a wider audience, and should include a selection of the artist’s works. The selection should take into account the artist’s experience with the conflict and the artist’s willingness to share her account of the events.”\n\n\n\n\n\nHaley Joel Osher, a former curator of biennial exhibitions at New York’s Metropolitan Museum of Art (MoMA), has been named director of the Museum of Modern Art. Osher will take the helm of the museum, which recently celebrated its fifteenth anniversary, at a time of surging interest in exhibitions and cultural institutions in the United States. Osher will assume her leadership role on January 6, 2020, and will begin her tenure with MOM on January 9.“I’m profoundly honored to be given this extraordinary opportunity to lead the Museum of Modern Art, and to begin a new chapter with MOM,” said Osher. “It’s been a lifelong dream of mine to head a museum, and I’m proud to transform an iconic institution that was founded by and for the art world", "The next Biennial should be held in 2020.Dubai: The Museum of Contemporary Art (Diam) issued a statement on Thursday stating that it is delaying its 2020 edition to coincide with the exhibition “Between the Sun and the Moon.” The exhibition will now be held in 2021. While the future of the exhibition is still in question, the museum has stated that it expects the final product to be completed by 2021. “We hope that we will have a new edition of Between the Sun and the Moon, that will benefit the people of Dubai, and that will be a successful event,” said Museum director Ahmed bin Saeed Al Saadi. “It is still very early days for the project. We need to work with the Government of Dubai as well as with other stakeholders to develop a strategy for how we can move forward with this ambitious project.” \n\n\nThe Union Ministry of Culture has announced that Jawaharlal Nehru National Museum, the largest museum in India, will now host ten exhibitions and be inaugurated on December 21, 2021. The exhibition, “Between the Sun and the Moon,” will feature works by thirty-six contemporary artists. The institution will", "The next Biennial should be held in 2022. The James L. Lucie Foundation, which has supported the exhibition since it was founded in 1966, is asking the city of New York to stage a biennial of its projects, which include a sculpture park, a museum, and a public space that will host events and have a rooftop garden. Dubbed the New York Biennial, the ten-year event will be led by artist-in-residence Karla Rashid and will open in 2020.The James L. Lucie Foundation is asking the city of New York to stage a biennial of its projects, which include a sculpture park, a museum, and a public space that will host events and have a rooftop garden. Courtesy of the James L. Lucie Foundation.The National Book Award for Fiction was awarded this week to the Los Angeles–based artist Mari Merkel. The Los Angeles native, known for her drawings and sculptures, was selected for the prize for her work Desert X: Deserts and Rainbows, which was shown at the Venice Biennale in 2008 and was chosen as the award for Allies. The work was also nominated for a Pulitzer in art history. Sara K. White, the executive director of", "The next Biennial should inaugurate the new platform Ecosystem, which will focus on interior design; the second will focus on sustainability education. The forty-third will focus on the history of modern art and will feature works by forty-three artists. In a comment on the upcoming event, Henry Remus, the director of the Museum of the Fine Arts in Dublin, said: “We must be conscious of the historical record when we consider the future of art. . . . We must also remember that there is no such thing as art history, only a history of what we know. And this history is not the history of art, but a history of what we want to be.”\n\n\nThe Le Compte Foundation, the Paris-based nonprofit that supports more than twenty-five hundred artists in France and the United Kingdom, has pledged $20 million in support of Paris’s upcoming Art Biennales. The initiative will launch in January 2019 and will focus on advancing the work of underrecognized French artists. “We are delighted that the Art Biennales will take place in January 2019, when artists are most active in their studios,” said Arne Glimcher, the organization’s director.", "The next Biennial should be in February 2021. The new theme will be the history of art in Asia, and the pavilion will be inaugurated with the exhibition of Sidra: The Art of Quantum Life. The Biennial will also present the first work by Japanese artist Tatsumi Tanaka, Aiwa Yoshida, and the first work by an American artist in China, Stanley Morrow. After the opening of the pavilion, the new exhibition will be inaugurated with a special exhibition for the Chinese artists Ying Wang and Wang Cheng, which will be preceded by a discussion with Yuan Jie, and an open reception for the artists.\n\n\nThe Museum of Modern Art (MoMA) is working to create a new $10 billion endowment to support the cultural legacy of the late entrepreneur and philanthropist Jules and Louise Adler, who launched the career of modern art with their groundbreaking exhibition, “Vertical/Horizontal” in 1976. The museum has created the $10 billion fund to support the Adlers’ legacy. The funds will be distributed through a combination of gifts and donations and will be phased in over a five-year period. �", "The next Biennial should be held in 2020.\n\nPhotographer and scholar Charlotte Prodger, who died of cancer in 2018, was one of the few women to work with the artist in the field, starting in the late 1940s and continuing into the 1980s. “Photography is a form of social life,” she once said. “It is a way of estimating and expressing the ideas of other people. It is an expression of the world to other people.” The same can be said of Swift: “Photography is a social form. It is not an image, nor is it a picture, but a way of expressing the thoughts of other people.”Born in 1940 in Chicago, she studied painting at the University of Michigan in Ann Arbor and then at the University of Wisconsin, Madison, where she landed in the art department after earning her master’s degree in 1965. After earning a Ph.D. in art history from the University of Chicago, she relocated to Los Angeles, where she began photographing. Her work has been collected by the Los Angeles County Museum of Art, the San Francisco Museum of Art, and the Los Angeles County Museum of Art, as well as the Metropolitan Museum of Art", "The next Biennial should be held in 2020.It is hoped that this will be the last iteration of the event, which has been organized as an interactive platform for artists of all disciplines. The theme of the 2019 edition was “Life and the Art of John Muir.” The biennial will also be renamed. It will be held in the Grand Canyon, near the Grand Canyon of the Gods, and will be funded entirely by the Grand Canyon Foundation, which was established by a group of wealthy philanthropists in 2009. The new exhibition will begin with an exhibition of work by thirty-six artists, curated by the curator of the year, Michael Otero, and will then move on to a biennial of twenty-four contemporary art creators, curated by the artist and the museum’s founder, David K. Nolen. According to Artnet, the new exhibition will be inaugurated by a presentation of work by artist Paul Gauguin.The Grand Canyon Foundation also announced that it will begin offering free admission to the Grand Canyon Museum for families as part of a yearlong celebration of the 100th anniversary of the institution. For the first time in its history, the museum will open with a family-friendly programming day on November 22", "The next Biennial should include the presentation of an exhibition dedicated to the creation of African art from the collection of the Museums of the French Republic. At the same time, the museum should be inaugurated with a guided tour of the museum. The introduction of the exhibition “Art of the Modern World” in 2000, which was staged in conjunction with the Buenos Aires Biennale, presaged the venue’s eventual reopening in 2011.\n\n\nThe Museum of Modern Art (MoMA) in New York has received a gift of more than 1,500 works of art from the late Hong Kong–born artist and collector Kenichi Nakayoshi. Among the works are works by Max Beckmann, Pablo Picasso, Claude Monet, Jean-Michel Basquiat, and Erich Heckelmann. The gift includes a set of drawings by the artist for a work titled “Surrealism” by the artist, which was made in the studio of Saara Tomokichi, the legendary studio of the artist’s granddaughter.In an interview with the Los Angeles Times, Nakayoshi, who was one of the main organizers of the exhibition “Nakayoshi: The Art of the Contemporary”", "The next Biennial should be staged in 2021. \n\nIn a statement, the museum said: “We are grateful to our international and local partners and supporters for their continued support of the museum, including the support of the UAE, Egypt, Jordan, Morocco, Qatar, and Bahrain, and we are confident that we will continue to thrive in partnership with them.”\n\n\nThe B.C. Museum of Anthropology (B.C.M.A.) has appointed Amanda K.B. Pearson as its next executive director. Pearson will join the institution in January 2020. She succeeds Kellie Miller, who retired in February 2019 after eighteen years as director.“I’m very excited to be working with Amanda and her talented staff,” said B.C.M.A., director and CEO Elizabeth Ann Macgregor. “We have enjoyed an exceptional 2017-18 under her leadership, and I’m confident that they will continue to flourish under her guidance.”During her tenure, Pearson oversaw the acquisition of more than thirty artworks, including The Dallesia Collection, a retrospective of solo exhibitions at the Museum of Fine Arts in Seattle, the History of Art, and an exhibition of paintings by", "The next Biennial should not include a performance, a conference, or a presentation. The restructure of the biennial will allow us to present a new project every two years and will provide a platform for the exploration of contemporary art. The new six-year format will open with a review of the themes of the previous two years and will conclude with a performance by the artist. The next iteration of the biennial will take place at MAMCO, in the Bolzano region of Italy, from February 19 to February 21, 2020. The ten other artists will remain the same, but the venue will be moved. The project will also comprise an open-air sculpture garden, a public performance space, and a group exhibition. The biennial’s first curators, Andrea Bocconi and Francesca Canuti, will return as organizers. The biennial’s first artist will be Christo, who will be commissioned to create a new work for the biennial. Guggenheim Arts and Architecture is planning to move its main building in the Bernese city of Bern from its current location in a former munitions factory in the city to an undisclosed location in the city. The museum is currently working on a new conceptual", "The next Biennial should be held in June 2020. The full list of participating artists is as follows:DAVID K. ROGERS, New York: Arts and Design biennial Arts and Design is a voice for an emerging generation of contemporary artists who are forging new work and redefining the role of art. The 2019 exhibition, “The End of Design,” focused on the art of fashion and revealed new work by thirty-five artists from fifteen countries. The 2020 event will be held in September.\n\n\nThe Museum of Contemporary Art (MoCA), New York: Arts and Design's second annual “Art of the Year” issue, which is due out on December 15, will feature more than 100 work by artists whose work focuses on themes of fashion, beauty, and fashion culture, including Rebecca Black, Roxane Gneihart, Brittain Collette, and Nari Ward. The exhibition will be organized as follows:When MoCA announced the ten artists who will participate in its next edition, curated by Michael W. J. Kramer and Mary Anne Kee, in 2010, the institution said the event would “provide a rare opportunity to work with an international group of artists, whose work has", "The next Biennial should take place in the spring of 2022.\n\n\nThe London-based arts organization the London-based arts organization the British Council, a group of city-state leaders that includes London Assembly, the British Council Foundation, the British Film Institute, and the London School of Economics, is launching a new platform that will allow the public to connect with and use works by artists around the world, curated by the British Council.The platform, called the British Council Arts Portal, will be hosted on the site of the former Tate Modern from January 20, 2021 to March 12, 2022. The platform will allow visitors to browse the collection of British artists and the work of leading contemporary artists such as Nari Ward, Samer Khaleq, and David Adjay, as well as explore the catalogues of the prize–winning British artist Paul Gauguin, and the British artist Paul Mpagi Sepuyaque. The platform will also include a community forum, a book club, and a café.British Council President Maria Balshaw said: “In a time when it is vital that we connect with and support the work of contemporary artists, we created this platform to continue to do that by providing a platform for London-based artists to engage", "The next Biennial should assess the relationship between art and design, with a particular focus on the history of the themes in contemporary art, and ensure that the biennial reflects the current spirit of our city and the regional imagination.\n\nThe news comes on the heels of the museum’s announcement that the next iteration of the event will include new works by emerging and established artists, and will be held at different times of year. The exhibition will also unveil a new series of public programming, including an open-air garden in the garden of the Museum of Modern Art in New York, a reimagined version of the forthcoming People’s Republic of China pavilion at the Venice Biennale, and a retrospective of the artist Juan Beatriz.The pavilion will also be redesigned to better reflect the contemporary city of Shanghai, which is currently undergoing a $250 million expansion, and will be given a modern, contemporary aesthetic. The pavilion will also be equipped with a new academic building and will host more public programming, including a virtual reality experience for children, a children’s museum, and other educational initiatives.The full list of pavilion participants is as follows:BISIM (Belgium), AUX (France), GBTA", "The next Biennial should take place in 2022.\n\n\nThe Children’ Playground (C+P), a New York–based organization, has announced that it will no longer participate in the 2019-2020 season. The organization, which was founded in 2012 by Montreal-based artist Marc-Paul Meeg and the late New York–based architect Daniel Libeskind, began the event with a grant from the David Rockefeller Fund. The organization received a total of $2.5 million from the Rockefeller Foundation and the Rockefeller Family Fund. When the organization received its $1 million donation in 2017, it received a $200,000 donation from the James and Mary Kaye Foundation in 2018, and the grant total was increased to $2 million in 2019. The organization was approached by the Rockefeller Foundation for its 2019 edition in the city, but it declined the invitation. The Rockefeller Foundation offered the organization a total of $5 million for its 2020 edition. Adrienne Edwards, the executive director of the Rockefeller Foundation, said: “We are thrilled to support the Children’ Playground in their effort to raise funds for their prestigious annual award, and to continue to develop and advance their work in honoring the Children’s Playground�", "The next Biennial should focus on the relationship between the artist and the biennial, and how this relationship is reflected in contemporary art practice. The third and final Biennial should focus on the relationship between the artist and the biennial, and how this relationship is reflected in contemporary art.”\n\n\nThe 2018 edition of Art Basel Hong Kong took place at the Jumex, the biennial’s new venue in the city of Jindosu, in the Jindosu District of Hong Kong. Titled “Art of the Future,” the event opened on October 5 with “Theater of Operations: Avant-Garde” and moved to the venue of the former site of the notorious “Beijing Film Festival” on December 4, 2019. In an effort to develop a more global and international audience for the theme, the organizers made use of a tool developed by the Jindosu Art Museum and Art Center to present the exhibition. The tool, called Art of the Future Visitor, allows visitors to enter the exhibition space while it is still open and to then explore other works within the exhibition.“We are eager to promote the theme of Art of the Future,�", "The next Biennial should focus on the experimental use of regional, national, and international art to address social, environmental, and political concerns.\n\n\nThe Museum of Contemporary Art (MoCA), Boston, has announced that it will introduce a new online-only viewing experience in its Ebbets Field art museum. Set to launch in the spring of 2021, the new experience will be powered by Google Maps and will feature in-person presentations of works by fifty artists, including Anne Fontana, John David Lewis, Lynne Frankenthaler, and Robert Smith.The Springboard for the Arts, a partnership between the Boston-based organization and Google, will host the virtual tour, which will begin with a tour of the museum’s collection and set the stage for an in-person viewing of the work of the artist. The virtual experience will be available on the Museum of Contemporary Art’s website and will run for thirty minutes. A full list of artists represented in the exhibition is as follows: ANDY BLAIR, A.K.K.A. Andy Warhol, George O. Scales, Andreas Von Bruenchenhein, Amelia Earhart, Alexa Fan, Adrienne Edwards,", "The next Biennial should be set up immediately to allow the Museum of Contemporary Art (MoCA) Los Angeles and the Museum of Arts and Design (MAD) London to present in the fall. The exhibition “Theaters of Operations,” which will explore the history of the conflict between the US and Russia in Afghanistan, will be on view until December 16.\n\n\nThe Fernández Museum in Madrid has added the Philippines to its growing list of countries participating in its upcoming edition, “The Reluctant Saviour: Contemporary Art in the Philippines” (TAUP), which will take place across three venues in the city from January 17 to February 19, 2020. The exhibition will also feature works by artists such as Jochen Riester, Stephen Friedman, and Pierluigi Carnattolo.“In the aftermath of the Typhoon Haiyan and Typhoon Yolanda, the Fernández Museum is committed to making our event liveable for everyone by hosting the world’s largest contemporary art fair in the Philippines,” said Fernández director Mariano Pinto. “Individually and collectively, these artists have given us their enduring story, their life stories, and their works. They", "The next Biennial should take place in 2019. The 2020 edition is currently under construction. \n\n\nThe Pérez Art Museum in Madrid has received a gift of twenty-three works from the Spanish artist and collector Javier Teo. The works, which were donated by Teo’s family, constitute a treasure trove of works dating back to the seventeenth century, and were acquired by the institution from the United States’s Jeffrey White, who passed away in January 2019.“The collection is filled with a variety of works that were created well before the invention of photography, the seventeenth century, and the nineteenth century,” María Elena Teo, the museum’s curator of modern art and an expert in twentieth-century Spanish art, told the Art Newspaper. “The family was very helpful in securing the works to the museum, and in making sure that the museum had the materials to study them. It was a pleasure to help them.”The works were gifted to the Pérez Art Museum by Jeffrey White, a longtime collector who emigrated from California in 1990 and eventually settled in Spain. Since the seventeenth century, Spain has provided an important resource for scholars of the art of southern Spain. The family", "The next Biennial should take place in 2020, and the last in 2022. Wang and her collaborators have already launched a new social media campaign and an online petition. “The festival’s theme of 'life and what it means to be alive,” the petition reads, “is powerful enough to motivate and transform the Chinese people, and to animate them in their own image.” \n\n\nThe Hong Kong art community is urging the city to build more affordable housing in an attempt to stem the city’s soaring cost of living. Since Hong Kong’s housing market collapsed last March, the capital has been forced to make drastic cuts to social spending, including spending more than $400 million on social assistance programs, and has been struggling to rein in costs.“The crisis has left a deep impression on everyone, especially in Hong Kong, a city of some one hundred million people,” said Anita Pape, the Hong Kong director of Art Asia Pacific. “A lot of people are feeling isolated and are looking for ways to protect themselves and their families, and we want to do everything we can to support them.”As the number of cases of Covid-19 continues to rise,", "The next Biennial should be held in 2020.\n\n\nThe British Museum in London is preparing to reopen in 2021 following a major overhaul of its current exhibitions and collection plan that will tie the institution together in time with the onset of the Black Death. The institution previously announced that it would reopen in 2021, although it has yet to formally commit to reopening on a date other than 2024.Girard Estévez Gallery in New York has announced that it will reopen this fall on a new platform designed by the New York–based firm EADS. The new space will feature original works by twenty-nine artists and will offer three-day public tours of the gallery, which is located in the exclusive Chelsea neighborhood of New York City.The new center is being built to accommodate the museum’s expansion into a new building, the Astor Place, that will house its collection of twenty-six artworks and will be completed in 2021. The Astor Place will be on the second floor of the former Chrysler Building. The building, which will be designed by Gensler, will consist of three levels and houses the museum’s permanent collection, which currently comprises works by Ai Weiwei, Ad Reinhardt, and Rembrandt, as well as the", "The next Biennial should take place at the headquarters of the National Arts Community, the European Regional Development Fund (ERDF), in Berlin. The event should take place between June 7–11, 2020.\n\n\nThe Orkney and Shetland Islands (UK) have voted to leave the United Kingdom. The decision follows months of political pressure from the region’s arts and cultural sector, which saw a drop in funding from the UK’s Department for Culture, Media and Sport (DCCMS), in an attempt to mitigate the economic impact of leaving the European Union. The islands voted to remain in the European Union by a margin of nearly three to two, with 59 percent voting in favor and 47 percent voting against, and have also announced their intention to continue with their longstanding search for a new home for the Tate’s flagship exhibition, “The Orkneys and Shetlands: From Theory to Reality,” which will return the islands to Scotland in 2021.The decision prompted outcry from the UK’s arts and cultural sector. While the government hopes to negotiate a deal that will keep the islands in the UK, some fear that if the islands are forced to leave the UK—as many believe they must—they", "The next Biennial should focus on reinterpreting the history of the exhibition and its modern-day incarnations, which are all too often presented as if they were created in a plastic laboratory. “We need to consider the question of the connection between art and the future,” said Zig Ziglar, the executive director of the Royal Academy of Arts. The exhibition, titled “Remembering the Past: Art and the Present” and curated by Jakob de Baere, will run at the Royal Academy of Arts until mid-March 2020.\n\n\nThe Metropolitan Museum of Art in New York is launching a new initiative that will help small arts organizations pay for renovations and programming that will take place during the reopening of the museum. Beginning in the spring of 2020, the institution will commission a group of local Cleveland artists to create an artwork for the Met’s main building.The initiative is called the MetLanding Challenge and grants $1,000 to organizations that have successfully completed their first phases of construction, which are the restoration of the Met’s original roof and walls, and the expansion of its public galleries. The first group is looking to the Cleveland Institute of Art, the Cleveland Art Museum, the Cleveland Carillon,", "The next Biennial should be in the spring of 2021.  As the city’s cultural hub, it is important for the biennial to reflect the diverse communities of San Francisco and to create new opportunities for visitors to experience the city. The new exhibition, “San Francisco: A History,” will open on August 23. \n\n\nThe Charles D. and Grace F. Kennedy Center for the Performing Arts (CKFA) in Boston has awarded $10.5 million to five artists who have completed their master’s thesis projects at the Kennedy Center since its inception. The grants come from the Kennedy Center’s “Theatre Research and Cultural Impact,” a center funded by the nonprofit partnership between the Kennedy Center and the Harvard University Graduate Center. The grantees—John Patrick Hill, Zackary Herbert, John Kirhoffer, and his wife, Janet—each received $5,000 for the first three projects that were completed in February 2019. “These five artists have made extraordinary contributions to their respective areas of study, and we are extremely grateful for their impressive visual and performing performances that have made their master’s thesis pieces accessible to audiences of all backgrounds and persuasions,” said", "The next Biennial should be held in 2021. \n\n\nThe French Ministry of Culture has released a statement regarding the ongoing civil unrest sparked by the September 11 terror attacks in Paris: The Ministry of Culture wants to stress that its position on the Paris demonstrations has not changed: The ministry has remained an equal partner in dialogue with the French people and the city of Paris, which is represented by the city of Paris’s mayor, Anne Hidalgo; the city’s cultural and cultural district, Les Républicains; and the National Assembly, which represents France’s lower house of parliament. The ministry confirmed that it does not plan to change its stance on the demonstrations and accused the protesters of “blatant disrespect” for the institution. “The ministry’s priority is to take all necessary measures to protect the institutions and the public,” a statement from the ministry reads. A spokesperson for the ministry said that the ministry has not made any changes to its stance on the demonstrations. The spokesperson added that the ministry has accepted that the city of Paris must take “all necessary measures to protect the monuments” and has measured the impact of the unrest on monuments by examining the impact", "The next Biennial should take place in the autumn of 2018. The following year, the institution will re-enter the public register of its alumni, and will have an additional exhibition devoted to the collection. This will coincide with the recommencement of the exhibition “An Emerging History of Dada.”\n\n\nThe fourteenth edition of the Venice Biennale, curated by João Lopes, will be held at Dr. Marta Maribara’s home in the village of Bicocca, Inádia, Brazil, on January 12–January 27, 2021. The event will showcase eighty works by sixty artists, including a new commissioned work by Lourdes Castillo, which will be on view until January 31. The full list of participating artists is as follows:*Maria Berenga, Portugal*Hiroshima Kamegoto, Japan*Katsu Naito, Japan*Et al., FranceMATAKI RIKU, Japan*Nancy Chiu, Taiwan*Sophie C. Jones, USA*Peter Stål, Sweden--MEGANNE MARTINEZ, USA*Pilar Rupi, Colombia“Vincent van Gogh,", "The next Biennial should be held in the spring of 2020. “Themes from the exhibition ‘Wangechi Mutu: A Fantastic Journey’ are equally relevant in the contemporary and historical context,” said Takashi Kawano, the president of the Kensington Museum of Art, and Yasuko Sato, the director of the Takeda Museum of Art in Nagoya.The museum has partnered with the Greenwich Foundation to host an exhibition of work by artists such as Andy Warhol, Thomas Heatherwick, David H. Koch, and Andre Advoca, which will open in the fall of 2020. the Greenwich Foundation also announced that it will stage a series of projects with local artists in order to raise funds for the Kensington Foundation. \n\n\n\n\n\nØystein Nurenberg, a leading Danish artist who pioneered a new kind of sculpture and whose work explores the anthropological, the spiritual, and the quantum, has died at the age of ninety-eight.Born in Copenhagen in 1930, Nurenberg studied at the Academia di Architettura in Palazzo Vecchio in Rome and the School of the Art of Modern Life in Bilbao, before moving to Stockholm, where he studied under Erik Satie", "The next Biennial should be at least six months later.”The fifty-six-year-old documentary-dubbing maestro, whose work examines and celebrates the complexities of the human experience through intimate and expansive narratives of his subjects, has had twenty-four Biennials, including the most recent, “Dreamers” (2017–18), at the Museum of Modern Art in New York and the Museum of Contemporary Art Los Angeles, which is currently undergoing a $50 million renovation.The nomination process for the 2021 edition of the Biennials began last January, with the biennial’s 2016 winner, the American painter Thelma Friedlander, and her husband, the American poet Charles Bradley. In the same month, a group of thirty artists and collectives—including the New York– and Berlin-based artists Blitza, Anya Hochner, and Fatos Varejão—brought their works to the exhibition. In 2021, the exhibition will mark the twentieth anniversary of the biennial.Commenting on the upcoming edition, Langhart said: “All my life I have been drawn to the richness and complexity of the human experience. It is this great gift that makes us human and allows me", "The next Biennial should focus on “the performance of women artists in Europe and the United States,” and should take place in the Finnish city of Turku in February 2021. The new exhibition, titled “The Body,” will open at the Museum of Fine Arts, Finland, in January 2021. The 2020 edition will include paintings by eight artists, including Anna-Sophie Berger, Anya Goetz, Nils-Axel Lindgren, Anne-François Perrotin, and Julie Prager. The first exhibition covering the American artist Betty Teasley will open in Los Angeles in January 2022. The Bijel Maken Biennial, which features works from fifty-six artists from nineteen countries, will run at the Bijel Maken Museum in Jaipur from February 21 to February 27, 2021. The 2018 edition of the event, which is organized in partnership with the Bilbao Art Foundation (BAF), was held at the institution’s new home in the city of Bilbao, in the former colonial quarters of the city of Lisbon. It will also return to Lisbon in March 2021.\n\n\nThe Museum of Fine Arts, San Francisco (MFA SF), announced", "The next Biennial should address the history of the exhibition, how it has evolved and morphed over the years, and how it can be reconfigured to meet the needs and desires of the contemporary viewer. The tour will take place on the exhibition’s last day at the Centre, which will close after its next exhibition, “The Black Box: The Biennial of American Art” in October 2019.\n\n\nThe National Galleries of Scotland (NGA) will reopen its permanent exhibition space, the National Museum of Scotland, with an intimate new exhibition on the life and art of Scottish artist Annie Besant. The show will feature work by twenty-seven different artists, including Lee Child, Annie-Rose Howard, and Stephen Henderson, and will open on December 7. The show is part of a $2 million investment made by the NGA to upgrade the museum’s existing exhibition space, the Gallery of Modern Art, and to establish a new collection of painted works and sculptures. The overhaul was made in order to foster a more interdisciplinary approach to presenting the works in the building. According to the NGA, the new collections will “provide a new, more immersive and accessible platform for visitors to explore and feel the richness and", "The next Biennial should take place in the United Kingdom in 2021. The UK will host a biennial in 2019, but it didn’t move forward with the event until 2020. The 2020 event will be held at London’s Serpentine Galleries, which had relocated to a new space in the city, in September. The show will include work by thirty-four artists, including Alison Goldsmith, Alice Hamilton, Jean-Michel Basquiat, Peter Blum, Paolo Baratta, and Tanya Bonakdar.\n\n\nThe city of Philadelphia has awarded $10.5 million in grants to fourteen Philadelphia-based arts and cultural organizations as part of its \"Better Deal\" campaign, which aims to increase the financial, health, and social well-being of low-income residents by implementing a range of anti-discrimination and anti-harassment measures.  Among the organizations that have received $1.5 million in grants are the following: American Folk Art Museum, Belvedere Gallery, Bethany Marder Gallery, Brooklyn Academy of Music, Cincinnati Art Museum, Coalition for the Arts, Coalition for the Homeless, County", "The next Biennial should take place in 2020.\n\n\nThe Museum of Contemporary Art (MoCA) has announced that it is planning to abandon its 2020 autumn season, which was set to run from September 27 to October 3, and reevaluate its collection in the coming months. The organization said that it will begin by reviewing the holdings of the two hundred years of the museum. “In the coming months, we will review the collections in our collections in the museums, and continue to do so in the museums, and we will continue to be transparent and forthright about the collection in our institutions,” said David Mullen, chair of the institution’s board of trustees. The museum has been working on revising its collection since 2013, when the previous board of directors, Ronald and Bertha Goldman, began phasing out the museum’s holdings of the Caesar sculptures. The plan to dismantle the institution—which occupies nearly two hundred rooms at the museum—was instigated by concerns over a potential shift in direction for the museum.Following a discussion with the new board of trustees, the Goldman brothers announced in February that they wanted the museum to remain nonpartisan, but also to continue to host related programming. When the changes were first announced, the", "The next Biennial should take place in the spring of 2021, to coincide with the Summer Olympics. It will feature presentations of new works by new and established artists, as well as music, dance, and theater.The new venue will be located at 694 West Twenty-Third Street in New York City, and will be the brainchild of historian Yoko Ott and artist Mark di Suvero. Ott, a New York native, said: “Biennials are an under-recognized historical era, and its importance is emphasized through exhibitions that examine the themes and the art of the past twenty years. This exhibition will provide an opportunity for the public to experience the impact of the exhibition.”The inaugural exhibition, “Ten Years of ‘Modern Art’” will be staged in a series of public spaces across the city, including the Museum of Modern Art and the Museum of Modern Art, New York; the Museum of Contemporary Art, Los Angeles; and the Museum of Modern Art, New York, the Museum of Modern Art, New York, and the Museum of Modern Art, New York.\n\n\nThe National Gallery in London announced today that it will open a new 16,000-square-foot, artist-led space in", "The next Biennial should be held in 2021.\n\n\nThe Künstlerhaus Berlin has announced that it will present a project by artist Nino Molo in the city’s Kreuzberg district on the occasion of the seventeenth anniversary of the institution. The show, titled “Monoculture of the City,” will be on view in the Kreuzberg from September 21 to September 27 and will feature new works by Molo.Molo is the first living artist to be featured in the show. The work, which was inspired by a trip to the art museum in Karlsruhe, will be part of a series of three works, each of which will feature the same environment, but with a different theme and will be organized in a different way. For the first work, the artist will create a “monoculture of the city,” which will comprise a collection of colorful household items as well as the city’s historic cityscape, such as the Town Hall, the Kreuzberg theater, and the Kreuzberg bicycle museum. The second work will be a “portrait of a stone building,” a real-life replica of a stone building that was designed in the 1960", "The next Biennial should be held at the museum in 2021.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Andrew W.K. Nash as its next director. Nash will assume his post in January 2022. He succeeds Jennifer Deitch, who departed the institution in February 2022 to become director and CEO of the Metropolitan Museum of Art.“Andrew W.K. Nash is a star curator who has built his career around making the most remarkable work,” said Jaye Newby, chair of the board of trustees. “He is an ambitious thinker and his approach has been to be responsive to the needs and desires of his collaborators. He has an uncanny ability to think through and generate extraordinary content. I’m looking forward to seeing where this new creative partnership takes us.”Nash’s first major creative project as director was the installation of the first ever solo exhibition of photographs by George and Louise Bourgeault at the Museum of Modern Art in 1989. For the retrospective’s twentieth iteration, he created the iconic Drawing Center, created the mural Paradise, and constructed the sprawling, one-man show Modernism’s Manhattan.He also curated “The Drawers’ Studio,", "The next Biennial should take place in 2021. According to the Art Newspaper, Lorraine Oostra, who represents the United States in the Venice Architecture Biennale, told the Art Newspaper: “We welcome the opportunity to continue to advance the exhibition program in a unique, contemporary way.” The 2019 edition of the Venice Architecture Biennale, held in Rome from October 23 to November 1, saw sixteen exhibitions and the selection of a new work every week throughout the event.\n\n\nThe National Gallery in London announced today that it has appointed Mary Anagnos as its new director, effective immediately. She succeeds Nickolay Ghandy, who has served as the interim museum director since February. Anagnos will take up the post in August.Ghandy, who has been working as a consultant for the National Gallery in London since December 2019, will remain employed as director while the institution conducts an internal review of its relationship with controversial donors. In January 2019, the National Arts Council (NAC) voted to revoke his contract following an outcry over a letter, dated February 8, which described the institution’s arrangement with the Tata Trusts as “inadequate.” The letter also questioned the", "The next Biennial should take place in the United States next year. For the first time, the organizers of the Paris-based international art fair are planning to stage a show in the city of São Paulo. The exhibition would feature works from more than fifty artists. The Brazilian city, which was held in opposition to the 1912 and 1923 Brazilian World Wars, has been recovering from the impact of the coronavirus, which has since spread to other countries, and is currently experiencing a severe economic slowdown.While the exhibition would likely draw a large international audience, the show will likely be canceled due to a lack of participation from Brazil’s state-controlled museums. With the exception of the Museu de Arte de São Paulo (MASP), all of the country’s publicly owned galleries have shuttered their doors since mid-March, and most museums have temporarily suspended operations. The Ministry of Culture is planning to assist the cultural sector by opening a number of new outlets. “We are aware of the challenges that this year will bring for our institutions,” said the minister, Juliana de Sousa. “It is also important to stress that MASP has always been and will always remain a state museum, and that", "The next Biennial should take the form of an exhibition focused on the preservation and restoration of the artworks at the site of the exhibition. The exhibition should be a presentation of the works, which will be organized in a symposium format, and will be centered on the issues of conservation and preservation. The exhibition will aim to draw attention to the work of some of the most important contemporary artists from the region and to present them in a way that will satisfy the demands of both the public and the museum. The biennial will comprise fourteen works, selected from the collection of the Kunstraum- und Lehmann-Stiftung, which has housed the works since the end of World War II.“This is an important step in the journey to create the Biennial of the Arts: a collaborative approach that will focus not only on the events but also on the artists themselves, which will be the main focus of the exhibition,” said Tania Bruguera, director of the Kunstraum- und Lehmann-Stiftung. “It is a real opportunity to work together with families and communities in order to preserve important works in the city of Basel, which has such a rich history with the arts. The announcement", "The next Biennial should take place at the London site next year, with an exhibition running from March 23 to March 29. “We are currently in the early stages of designing the event space, but we hope to have a new venue in the not-too-distant future, and will present a new exhibition to coincide with the biennial,” said Peter Montague, director of the Biennial.The institution, which was founded in 1912 by German-born architect and inventor Dietrich Koenig, is currently owned by the Konrad Adenauer Foundation and has been in the works of the London-based architect's daughter, Petra, since 2011. The foundation plans to shift six hundred artworks into the museum and turns twenty-six acres of Koenig’s former estate into a large open-air pavilion, complete with gallery, lecture, café, and guesthouse. The pavilion has also been used by the Koenig children for performances, lectures, workshops, and other events. The foundation recently received a $110 million loan from the Konrad Adenauer Foundation and is planning to open the pavilion in Helsinki in 2021.Inaugurating the Orient Studio, which will take up some sixty thousand", "The next Biennial should be held in 2020.  My concern is that we do not prioritize the future of our city and the city of Miami-Dade County by making the most of the present and not the past. We must think of the future not as a distant future, but as the future we want to be. I look forward to working with the new commissioners, the city of Miami-Dade County, and the Miami-Dade Arts Council to advance the city’s creative and artistic mission.”\n\n\nThe Toronto-based nonprofit Contemporary Photography Foundation (CPGF) is launching a new $5 million initiative, “Away from the Lights,” to help support artists working in the photography industry in Toronto. The initiative will help those who are facing financial hardships as a result of the Covid-19 outbreak, and will provide $250,000 to assist urban farmers who are facing financial hardships as a result of the Covid-19 outbreak.“Away from the Lights is a funding platform that will provide direct financial support to those facing financial hardships directly related to the Covid-19 crisis, and is not intended as a vehicle for the collection or redistribution of funds,” said C", "The next Biennial should be set up, as soon as possible, with a national committee made up of expert curators, art historians, and intellectuals, comprising representatives from the arts, the humanities, and the social sciences. The theme of the upcoming exhibition, “My Struggle: Art and the Fight for Human Rights in São Paulo,” will be “Human Rights in Color”\u0097its usual format. This year’s theme is “The Struggle for Color,” which will be a collaboration between painter-activists Susana Iarolán and Paulo Siqueiros, who created the project for the exhibition at the invitation of the artist and artist’s association.João Ribas, director of the Metropolitan Museum of Art in New York, said: “The Museo do Povo in São Paulo has long been considered the cradle of European and American art. It is the epicenter of the history of art, and the birthplace of some of the most important Brazilian and American artists of the twentieth century. The particular creative trajectory of Michelangelo and Ana Mendieta, among others, and the importance of this project in the development of the museum’s collection make it a great candidate for", "The next Biennial should feature a new work by the artist and will have its premiere at the Old Forge Museum in Bristol in October 2020.  The organisation will also open a new exhibition, “Architecture and Design in the Age of Black Power” at the Biennial, which will go on view in November. \n\n\nThe Institute of Contemporary Arts (ICA) in London announced today that Yinka Shonibare will become its next chair. Shonibare will be succeeded by artist-in-residence and curator Aline M. Albright. Albright will serve as the interim chair for the duration of the academic year and will begin hosting monthly artist-in-residence talks and other programming in October.The appointment of a new chair has been made in 2017 following the departure of artist-in-residence Pierre Hauser, who was instrumental in the reinstallation of the ICA in 2018, and the appointment of Behrouz Oguib, who previously served as a visiting art historian in the U.S., as chair of the institution. Shonibare was elected to the position by a majority of the board of trustees, which comprises artists and art historians and curators, in a unanimous vote.", "The next Biennial should address the status of women and the future of the art. We are in the process of evaluating the art that we have selected for the exhibition and the biennial. We will share with you the results of our assessment with our international advisory board in the coming weeks. We thank all our visitors for their understanding and cooperation.\n\n\nThe Hong Kong Fine Arts Museum (HKFA) announced today that it is relocating its exhibitions from its current location at 8 of the 9 downtown Hong Kong galleries, which were established by the Hong Kong Baptist Church (HBD), to a more remote location in the museum’s renovated building. The museum will begin the construction of a new exhibition space for HKFA in the fall of 2020 and will host exhibitions in the newly renovated museum in the fall of 2021.“Because of the HBD’s decision to move its exhibition space to a more remote location in the museum, the exhibition program at HKFA has had to undergo a significant change,” said Ki-Shen Yin, chair of the board of trustees of the HBD. “As a result, the exhibition program at HKFA has been affected. Thus, the museum will have to shift the focus of the exhibition", "The next Biennial should include performances by Kiki Smith, Christopher Wool, and Taner Asif, among others, and will be held in 2022. \n\n\nThe J. Paul Getty Trust has announced that it is giving $42 million to artistic organizations that have received federal financial assistance since 2014. The grantees are several museums, including the Museum of the African Diaspora (MAD Group), the Memphis Museum of Art, and the University of Memphis. The grants were established to advance the fight against poverty and foster social justice in America. They do not require any application, and can be used to create a new program for an artistic organization. Among the organizations that have received funds are the Asian Art Museum (AAM), the Art Institute of Chicago, and the Museum of Contemporary Art, Los Angeles.The trust will distribute $27 million of its existing grantees’ grants to “transformational new organizations” that have a transformative impact on the lives of low-income communities, according to a statement issued by the trust. The statement noted that the grants provide programs that can “provide a lifeline to artists and help them survive poverty, hunger, and homelessness.”In the case of", "The next Biennial should be held in 2022. In the meantime, the exhibition will continue to be staged in various incarnations, with the new format of a smaller space in the city center.HIRSHELL, a public sculpture and installation project in the Seles Valley, a UNESCO World Heritage site in Norway, has announced the opening of a new initiative, BRIC, in conjunction with International Heroes, on December 27. Set to open in January 2021, the exhibition will feature contemporary international artists, selected by the Wiradjuri Museums Research Group (SVM) in collaboration with the Wiradjuri Regional Gallery in Mumbai, the Wiradjuri Art Museum, and the Markandretro Institute of Art History.The initiative will include a series of talks, essays, tours, and screenings, and will be organized in partnership with the Wiradjuri Regional Museum of Art. The opening of the new show will coincide with the reopening of the Museum of Contemporary Art, Mumbai (MoCA), where it will also feature a retrospective of the work of Alice Aycock, Christo, and Joël & Anne-Marie Steinhauer. During the exhibition, which will run for thirteen days and will have", "The next Biennial should take place in Leipzig in the summer of 2021, the Art Newspaper reports. The exhibition will be hosted by the city of Leipzig and will be curated by the Hamburg-based curator Wolfgang Elsner.The exhibition will include works by forty-six artists who are currently represented in the gallery, including Fredric Guttmann (Tucumán, Mexico) and Alighiero Paz (Wien, Germany; Prague, Austria), which was recently added to the museum’s collection; and eleven works by Italian contemporary artist Stefano Cattelan, which were recently shown in the Art Museum of San Paolo.The venue will also house exhibition space for the Italian artist Carlo Deforti, whose work is currently on display in the exhibition “Celso di Bella,” which will continue until January 22, 2022. Deforti is represented by the Guggenheim in New York and his first show in Italy will take place at the Guggenheim, which opened in Venice in 2015.\n\n\nThe catalogue of the Toronto–based contemporary art museum Château Rouge has announced the thirty-first iteration of its annual Fall/Early Spring/Summer/", "The next Biennial should be held in 2021.\n\n\nThe National Museum of Fine Arts (the museum) in Washington, DC, has received a gift of some four hundred paintings from the collections of the museum and the National Council on the Arts. The works—which were donated by artists such as Henry A.N. Evans and Frank Gehry—were donated by Lucille Bell, who had served as president of the museum since 1981, and the governor of Maryland, Larry Hogan. The gift includes works by unknown artists such as Jean-Michel Basquiat, Pierre-Auguste Berthiaume, and Henri Bechhofer.“The National Museum of Fine Arts is the home of some of the most important works of European and American art,” said Hogan. “This gift includes works that have never been on view before, and a collection that has never been opened up to the general public. The new views will bring new and exciting perspectives to these works, and the growing collection, which will continue to expand under the new leadership of Marc Spiegler, as we work to ensure the museum is an important cultural and historical center for all Americans.”The National Gallery of Art in Washington, DC, recently announced that it will", "The next Biennial should be held in the spring of 2022.In a statement, Artnews said: The new initiative will be designed, developed, and hosted by the art and design-focused, smart, and arts hub Stratos, which is based in the city of Helsinki. Stratos will collaborate with the city of Helsinki and local art and design organizations to organize a biennial of Finnish art and design, in collaboration with the city and the city’s government. The biennial will be held at the city’s new, $55 million downtown building, which was completed in the summer of 2022. The news release announcing the initiative also said that the newly established organization will collaborate closely with the city and the city’s government on planning, conceptualizing, and executing the biennial. The biennial will include projects that incorporate new ideas, artistic approaches, and environments in a city-made setting. The institution recently received $1.6 million from the Kiasma Arts Fund to develop a new program for its residency program. The program will be developed in collaboration with local experts and will connect urban living and work in Helsinki, with the aim of encouraging and strengthening collaborative practices between", "The next Biennial should begin as soon as possible, and should conclude with a show of work by the final artist chosen for the triennial’s inaugural edition. The next edition of the Biennial will be held in the spring of 2021. \n\n\nThe Knight Foundation and the Yale School of Art in New Haven, Connecticut, have launched a new fund to help organizations and individuals working in the creative arts. The fund, which will initially focus on arts education and training, will provide $75,000 for the education and training of undergraduates at Knight’s graduate art school, the Yale School of Art, in New Haven, Connecticut; the Art Institute of Chicago; and the New York Academy of Art.The Knight Foundation is a public foundation established in 1999 through the sale of David H. Knight’s masterworks, The Three Musketeers (1795), a major work in the major themes of the Renaissance. It is funded entirely by the estate of David H. Knight, who passed away in 1997. Its inaugural fund was announced last year and raised $30,000.The fund will be administered by Knight Foundation trustee Mark Jarlo, who will serve as chair of the foundation, and Paul and Charles Knight, the", "The next Biennial should be held at the University of the Arts London, and there will be a new exhibition of work by the Organisers at the Art Gallery of Ontario, slated to run in the fall of 2021. The first exhibition to be staged at the museum was “The Art of V: From The Hassabis,” which ran in 1968. The exhibition contained over three thousand artefacts, including photographs, drawings, paintings, sculpture, and text, and was organized by the Hassabis, an Afghani Jewish community center in Brooklyn, New York. The museum has recently had its holdings transferred to the Jewish Museum, Jerusalem; Hassabis National Museum, Israel; and the Simón-Hendrickx-Fisher Museum of Art, Netherlands.\n\n\nThe British Museum (BMA) in London has appointed artist-turned-designer Oli Scarff as its new deputy director for collections and exhibitions. Scarff will be responsible for spearheading the museum’s curatorial and collection-focused strategy and helping to shape the BMA’s collection and exhibitions over the next twelve months. He succeeds Peter Hujar, who retired after a decade at the helm of the museum in December 2018.�", "The next Biennial should take place in October 2020. \n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Courtney Lynne as its new executive director. In the newly created position, Lynne will lead the museum through its fall 2019–early 2020 season, and will assume the role of acting director in January 2021.“We are profoundly grateful to Courtney for her leadership and dedication in bringing this wonderful exhibition, the most ambitious exhibition we have ever staged, to New York,” said museum director Daniel H. Weiss. “We are also grateful to the board of trustees and staff for their strong support of Courtney and her leadership. She has been an inspiration for many, and we are proud to have her at MoMA. Her leadership and vision will be crucial in ensuring that the exhibition and the program, which celebrates the evolution of American art, is a success for the next year.”The new role was created by a merger between the Metropolitan Museum of Art and the Museum of Modern Art, which was completed in July 2019. The Metgrafiska, which opened in 2015, is currently undergoing a $50 million expansion. The new exhibition venue is slated to be unveiled in 2021.\n\n\nThe Tate’", "The next Biennial should be held in 2021.\n\n\nThe Böglitz Museum of Art in Munich has received a $14 million donation from the German government. The $13.5 million gift was given in addition to the $10 million it previously pledged for the construction of a new museum in the city. The gift also includes a collection of 450 works by artists from the Böglitz collection, which was founded in 1990 and moved to Munich in 2013.The donation also includes a collection of 150 works by philosophers such as Karl Popper, Friedrich Hegel, and Sigmund Freud, along with a selection of works by artists from the Böglitz collection that were previously on display in a separate exhibition. The donation was made in recognition of the Böglitz’s ongoing contributions to the development of the arts.\n\n\nThe Rema Hort Mann Foundation has announced that it will establish a new $500,000 endowment and will invest $70 million in the museum over the course of the next four years. The organization hopes to raise the $170 million required to expand the Museum’s collection into a sixth-century building. The development is part of a long-term vision for the Museum of Modern Art in New York that", "The next Biennial should take place in 2020 and will be hosted at the US Military Academy at West Point from May 21 to May 28. Its selection committee will consist of three members predominantly from the military and will be chaired by Capt. James R. McInerney, commander, U.S. Army, Quantico, Virginia.\n\n\nThe National Museum of Women in the Arts (MoWCA) in Washington, DC, has announced two new members to its board of directors: Mark B. Carroll, a longtime arts patron and a former chair of DC’s Cultural Affairs Council, and Edith Leibowitz, a former chair of MoWCA’s board of trustees. Carroll will be the first woman appointed to the institution’s board since its founding by president Oprah Winfrey in 1961. Carroll will succeed Cynthia Chase, who retired in 2018 after eleven years at the helm of the museum.Carroll currently serves as the board president of the National Council on the Arts, the National Endowment for the Arts, and the National Endowment for the Humanities. She is also a cofounder of the Institute for Critical Art and the nonprofit nonprofit Arts for America. He will soon take on the role of chair of MoWCA�", "The next Biennial should be held in late March or early April, with the objective of presenting the projects of the last four years. The third Biennial , “between March and April” will cover the entire period from January 1, 2011 to January 31, 2020. The last Biennial , “between March and May” was held in January 2016. “This is a massive opportunity for the City of Saint Louis to showcase how we are working together to make Saint Louis a destination for tourists and locals,” said Mayor Lillian McEnroe. Commenting on the opening of the new biennials, State Representative Anthony Hensler, a Democrat from the 3rd District, said: “The City of Saint Louis’s rapid growth and diversification makes it attractive for new and existing artists to collaborate and to share ideas in the spirit of creativity and innovation. By providing an unique platform for these ambitious projects, Art Institute of Saint Louis will bring Saint Louis and the greater region a new kind of vibrant artmaking environment.”\n\n\nThe Museum of Fine Arts (MFA) in Boston has hired Kate Robb, a former curatorial assistant and avid collector, as its new associate curator", "The next Biennial should be held at the art museum’s campus in Bern, Switzerland, in 2021. Fans of the work will recognize Gorchov’s rendition of Mary Cassatt’s The Death of Gramsci, 1927, also known as The Chapter on the Present, as well as his landmark exhibition, “The Power of Paintings: An Analysis of Graham Malam’s\u0097Unfinished Business\u0097from the same year. The NADA Biennial has been held in New York, Los Angeles, and Hong Kong, and will reach a new audience with the opening of a new exhibition at the museum at the end of September.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has approved a plan that would drastically reduce the salaries of top city art workers, including arts administrators, and has given the green light for up to five hundred arts professionals to join the political action committee (PAC) that represents city arts organizations.Under the proposal, arts administrators will be paid $1,000 less annually than under the current contract, with the possibility of receiving up to $2,000 less in future contract years. The deal is not a complete reversal of the current arrangement", "The next Biennial should involve the collection of biennial collections, including paintings, drawings, artworks, and photographs, to be presented by artists of the past, present, and future. Biannual exhibitions will also address subjects such as the creative process, governance, and funding, and will continue to be organized by the same creative team.The biennial will be hosted in the neighborhood of the modernist Museum of Modern Art, which recently announced that it will close its doors to the public, and will remain closed through March 21. On March 9, the museum’s longtime home in the United States was transformed into a new state-of-the-art exhibition space. The renovation, which added a spacious lobby, a café, and an outdoor garden, completed the renovation of the museum’s former space in the summer of 2019, and allowed it to reopen in March 2020.The renovations, which were completed in March and May, involved the repainting of the museum’s original building, the Museum of Contemporary Art (MoCA), with the addition of new galleries, a theater, an auditorium, a library, and a bookstore. The renovation of the Hanna-Barber Modern Theater, which is housed in a former steel mill", "The next Biennial should open in 2022, with a twenty-first-century version scheduled to open sometime in 2023. The two collaborations are part of the ongoing project of the talented and internationally-trained Mendijesongmi, the founder of the Mendijesongmi Group, to create new kinds of art-house experiences through their company. The South Korean pavilion will embark on a new exhibition program, an online museum, and a series of live performances, coinciding with the upcoming November 17 birthday celebrations, in an effort to reflect the spirit of the pavilion.The collaboration with the British sculptor Jo Johnson lasted for thirteen years, from 1999 to 2006. The two worked together on the sculpture of two converging vistas of the Thames among other cities, the capital and the East End of London. The work, titled May the waters of the Thames flow, was designed by Johnson to appear as a three-dimensional sculptural continuation of the Thames River.The project was inspired by an early work of Johnson, his first public sculpture, the sculpture titled The River of Life, designed for the London Biennial in 1995. The work, a three-dimensional reconstruction of the river, was created with a total budget of $100", "The next Biennial should include a selection of paintings, drawings, prints, sculptures, and other works on paper and will be held at the Science Museum in Lisbon until January 24, 2021.\n\n\nThe Hong Kong-born, Los Angeles-based artist, choreographer, and choreographer Kai Hao has died at the age of seventy-nine. Born Kai in 1938 in China, Hong Kong, and Los Angeles, Hao moved to New York City during the height of the Cold War and became a member of the American Pie band the Beatles. He continued his musical career with appearances in films such as The Band, 1957, and The Karate Kid, 1984. He also had a solo exhibition at the San Francisco Museum of Modern Art in 1972 and a performance at the Los Angeles County Museum of Art in 1978, and his work was collected by the Los Angeles County Museum of Art in 2007.Among the works that have recently made headlines in China are his work for the city of Nanjing, in an exhibition at the New Museum in 2017, and his installation of one of his works in the pavilion of the Fifty-Third Venice Biennale in 2019. He was also the subject of a special exhibition at the Museum of Modern Art China in Shanghai in 2015", "The next Biennial should take place in 2021, and the venue will be relocated. The new location will be complementary to the Autarch Biennial, which will open in 2019 and close in 2020.  Prior to the relocation, the building will host a series of exhibitions, including “Religion and Society: The Italian Renaissance'” (2019); “The Struggle for Evolution,” (2019); and “Counterculture: Avant Garde and Contemporary Art” (2019).The Italian cultural complex has been under construction since the 1960s, and the completion of the project marked the first time a major arts complex in Rome was completed within a year. The project also marked the restoration of the former site of the Casa delle Papes, which is currently home to a dozen artists. The Casa delle Papes, the former site of a major art museum, also houses the contemporary art museum Daniele Arti’s intellectual home, the University of Rome. The redevelopment project was initiated by Alighiero Mooradian, president of Monza, and his wife, Rosalind, in 2015. The couple converted the former site of the Casa delle Papes into a model for the redevelopment", "The next Biennial should take place in the Fall of 2020. “We are working hard to present a project-based and research-driven exhibition that will peak the imaginations of young curators and encourage their development into a truly international team,” Paul Mpagi Sepuya, cochair of the Biennial, told the Art Newspaper. The upcoming event will also include a curated exhibition of works by young artists and will feature the work of thirty artists, including Yinka Shonibare, Yuko Higuchi, and Yoko Horiuchi. \n\n\nMore than 500 artists and art workers have signed an open letter urging the upcoming biennial of South Korean art to abandon a selection of works that have been sold to the organization in an attempt to raise funds for the health of its artists and staff. The letter, published by the Art Newspaper, states that the works are “a clear violation of our artists’ requests for compensation for the loss of the sales, and the artworks are being sold in an attempt to cover up the continued failure of the distributor to remit monthly stipends and other income.”It continues by asking the organizers of the show to “implement the change in the art", "The next Biennial should be held in 2020.)For the first time in its modern history, the biennial will be hosted by an international contemporary art museum. The inaugural exhibition will usher in a new chapter by presenting the work of twenty-five artists, including Pierre-Auguste Renoir, Jean-Michel Basquiat, Tilera Kasem, and Hélio Oiticica, in the midst of a global pandemic, as well as a new exhibition of works by the work of fifteen modern and contemporary artists.\n\n\nThe New York City Department of Cultural Affairs (DCLA) announced today that it expects to receive $195 million from the sale of works by the late American artist Gregoryor, whose photographs are currently on view in the main exhibition “Into the Abyss.” The works, which are currently on display in the Gregoryor Collection, are part of the “Into the Abyss” series, which consists of forty-five photographs  that were taken between 1962 and 2017, and will be on view in the exhibition from February 16 to March 13, 2020. The works are part of the documentary exhibition on Gregoryor’s life and work, “Gregoryor: Foster Artist”", "The next Biennial should be held in the coming months, and the first exhibition should open in the summer of 2021. The institution, which is located in the UNESCO World Heritage city of Biennale Hall, is currently under construction and has not yet determined a date for its opening. The Biennial 2016 featured work by forty-five artists, including Adam Daugaard, Lutz Bach, and Patricia Borowy, among others from thirty-five states and the District of Columbia.\n\n\nA panel of judges at the Courtauld Institute of Art (C.I.A.) in London has ruled that a group of Spanish critics and writers whose work was included in a first-year exhibition at the institution last year are entitled to a retraction, a move that would mean the exhibition would be reinstated. The judges cited the C.I.A. Middle East, Spain’s Embassy in the United Kingdom, and the C.I.A.’s own reputation for free and fair debate\u0097which they said “involves a large-scale and often politically motivated critique of contemporary art and culture, and an attempt to create a clear and present opposition to this opposition.” The exhibition, titled “Art and the Middle East", "The next Biennial should open in 2021. The next exhibition should take place at the Museum of Contemporary Art (MCA) in New York in 2022. The Museum of Contemporary Art (MCA) in New York has announced that the 2020 edition of its “Architecture of Tomorrow” will feature work by thirty-nine artists. The exhibition will run from March 21 to March 23 and will be curated by Ahdaf Soueif, Dean Kawahara, Marta DiMaio, and Seth Glance.The fifty-ninth edition of the International Contemporary Art Biennial, which will take place in the city of Bremerhaven, Germany, in May 2022, will be hosted by the German city of Freiburg. The event will feature twenty-eight artists. The fifty-ninth edition of the Shanghai Biennale, which will take place in the city of Shanghai from March 27 to April 3, 2022, will be hosted by the Chinese city of Nanjing, and will be curated by the Chinese city of Nanjing. The fifty-ninth edition of the Autumn/Winter Show, which will be held at the Kunsthalle Basel from December 22 to January 27, 2022, will be held in", "The next Biennial should be held in September, and the first public exhibition should open at the Museum of Contemporary Art Barcelona in September 2020. Wharton’s tenure will end with a ten-year, $51 million endowment grant. The next directors are Henry Berger, chief curator of European art at the Museum of Modern Art, the Los Angeles County Museum of Art; and Peter Molyneaux, director of the Museum of Modern Art.\n\n\nThe National Gallery of Art in Washington, DC, has appointed Barbara Black as its next director. Black first joined the museum in 1988 as deputy director of exhibitions and acquisitions. In 1998, she was promoted to deputy director of collections and acquisitions, and in 2000, she became director of collections and acquisitions. During her tenure, Black helped raise the museum’s profile and was instrumental in the acquisition of more than one hundred works by some of the country’s most important artists such as Charles Schnabel, Robert Irwin, Iris Murdoch, and Stanley Turrell.“Barbara is an extraordinary leader at the National Gallery of Art and is instrumental in shaping the museum’s collections and exhibitions programs for the next decade,” said museum director Daniel H. Weiss. “We are", "The next Biennial should be held in 2020. The event will celebrate the 100th anniversary of the start of the National Association of Dance. The exact date and the venue will be announced.The American Ballet Theater, which has been working to reopen in the city of New York since March 20, as well as at least two others in the city, is also preparing for the possibility that it may be forced to close due to the coronavirus. According to CBS, the theater is preparing to begin welcoming visitors on April 17 but is currently assessing the safety of its locations in the city.The possibility that the Metropolitan Opera and its New York region headquarters will also be forced to make cuts has led to speculation that the company may be preparing to shutter its current exhibition, \"State of Play,\" which has been held at the Met since April 7, before the pandemic officially begins. The announcement of the exhibition coincided with the opening of a documentary about the coronavirus entitled The Truth About Unity, which premiered at the Venice Biennale, and the Milan Triennale, as well as the New York City Ballet, which will close on April 22, and move the rest of its shows online.According to Artnet, the exhibition and documentary about the coron", "The next Biennial should include an exhibition of the selected works of the New York–based artist Yinka Shonibare, who will receive a check of $50,000. The $150,000 prize is for works that are at least six months in duration.In addition, the Biennial of American Art, which celebrates the history and development of American painting, will be held in November 2020. The fifty-third edition of the annual event, which was established in New York by mutual aid group the Samaritans in 2006, will be held in February 2021. \n\n\nA popular California institution that has been closed since April 13 because of the coronavirus pandemic has reopened with limited disruptions, the Los Angeles County Museum of Art (LACMA), a cultural landmark that has hosted more than 2.2 million people, announced on Sunday. On Tuesday, April 12, the institution announced that it was reopening, though it is not yet sure when, as the virus continues to spread.LACMA director Michael Govan called the reopening a “once-in-a-lifetime event.” “We are in the process of assessing how best to support our staff, galleries, staff, and visitors through this unprecedented outbreak", "The next Biennial should be in 2019. The exhibition will include works by artists such as Julee Cruise, Nina Johnson, and Nada Rivera. \n\n\nArtist-owned galleries in Paris are planning to open their doors for the second consecutive year. On Saturday, Artforum reports that representatives from the Elgin Collection—a collection spanning seventy years—and the Cocytis Group—a group of thirty artists who work primarily in the city of Lyon—signed a statement of intent to reopen. The statement said that the Parisian art scene must face the same challenges and the same challenges must be met again. “We are convinced that the second Biennial is a good moment to face the problems that have plagued us for thirty years and to find new solutions,” the statement reads. “The art of Paris is suffering because of the policies of many governments and the policies of a few: austerity, the crisis, the polarization of countries and regions, the elimination of cultural and artistic activities, the reduction of the budget of public organizations, and the mismanagement of the collection.”Speaking to Artnet, the artists said that they have not yet decided whether to open as many local galleries as they would like, but that the", "The next Biennial should be held at least once every four years. The Florence-based artist and curator Marina Sforza has announced that she is working toward organizing a triennial of work by artists from the third to the twelfth centuries. According to the Art Newspaper, she will present the works in the exhibition “One-hundred Years of Giuseppe Catellani” at Artforum’s New York headquarters. The exhibition will mark the fifteenth anniversary of the Italian city, which is located on the south coast of Genoa.“In order to build a new and solid foundation for the exhibition, which will encompass many years and many themes, we need to talk about how cultural memory is experienced, and how design works in a world where design is constantly reconceived,” said Sforza. The exhibition will also include work by the twenty-three artists represented in the exhibition.Curator and educator Juliette Renaud has been named co-principal curator of the fourth Biennial of Arts and Cultures in Rome, which will take place in the city from February 26 to March 15. Renaud will take up the reins from João Pereira, who retired in March after twelve years", "The next Biennial should be held in 2021. “We are thrilled to be able to bring the Biennial to Vancouver. Together, we can change the course of Vancouver’s history and help shape the next chapter of its City. The biennial is a critical tool to advance the city’s future.”\n\n\n\n\n\nJessie Jost, a British sculptor whose work embodies the universal spirit of technology and the unyielding aspiration of humanism, has died at age ninety-eight at her home in London.Born in London in 1932, Jost studied art at the University of Oxford before earning a doctorate from the University of Chicago in 1964. It was at the University of Michigan that she met André Achenbach, who introduced her to the equally prolific and equally scatterbrained Stanley Donwood, who eventually introduced her to Max Ernst, who introduced her to the still-unfolding avant-garde of electronica, the avant-garde of techno, and the avant-garde of glass-enclosed worlds, the avant-garde of synthetic reality.Jost’s early artworks, which defy easy categorization, exhibit a playful, surrealistic sensibility", "The next Biennial should be held in 2020, with the date to be determined by Artforum’s request for information. “The next Biennial will be an important milestone, and we are eager to see how the work of the past two decades will be reflected in the present.”  The 2019–20 edition of the event, which was held at the Museum of Contemporary Art, Los Angeles (MoCA), marked the opening of the museum’s new home on South First Street, with the restoration of the building as well as the creation of the Museum of Contemporary Art Los Angeles (MCA). The museum currently has two spaces in the former Alamo Drafthouse, which opened in a former Kmart in Beverly Hills in 2013. “When we think of how much work the artists put into making this exhibition possible, we have to think of the future. Do we want to see it in 2020 or 2030? Do we want to see the exhibition at a new location in 2020 or 2030? We can all look forward to seeing the exhibition at MCA in 2021.”\n\n\nThe International Council of Museums (ICOM) in the United Kingdom has announced the museum of British Colonialism (B", "The next Biennial should take place in the Czech Republic.  “The exhibition of your artwork is particularly important,” Szymczyk told the Art Newspaper.  For the past five years, he has been working on a new public sculpture for the pavilion. The piece, called Sydney, will be installed in the exhibition “The Future Is Not This Present.” The show will run from March 21 to March 25, 2020.\n\n\nBoston-based artist Vinnie Bagwell is suing the Massachusetts Museum of Contemporary Art (BMA) in an attempt to secure the institution “a meaningful and constructive relationship with the city of Boston,” the Massachusetts Senate, and other city agencies. The lawsuit, filed in Boston Municipal Court on February 10, charges the institution with “subverting the public trust,” the city with violating the Local Governmental Orderly Act, and the state of Massachusetts with violating the §658 public trust statute.“We are pleased to see that Vinnie is able to secure such a significant level of support from the court,” said attorney Marc Glimcher, who represents Bagwell. “This is one of the few cases where the court has actually", "The next Biennial should begin in October 2020 and will feature a selection of forty works by thirty-six artists.“We are grateful to the Mayor and the staff of the New York City Metropolitan Government for recognizing the significant contribution made by the staff and artists of the MTA,” said MTA CEO Thomas Prendergast. “We look forward to working with the artists and the audience of the Museum towards realizing the city’s transportation priorities for our transportation network.”\n\n\nThe Italian artist Vittorio Omenolo, best known for his string of sculptures that attempt to address the legacy of Italian dictator Benito Mussolini, has died at age seventy-two at his home in Pisa, Italy. The death of the leader of the Italian Workers’ Party (Partito Italiano), whose influence extends to all spheres of life in Italy from art to culture, has reignited the ongoing controversy over fascism and fascism-inspired artworks.Born in the town of Brescia, in the Lazio region of northern Italy in 1923, Omenolo entered the arts early on. He was studying with Giuseppe Campanella at the Piedmontese Academy in Rome and graduated in 1949 from the prestigious Udine College in", "The next Biennial should be held in the spring of 2020. Following the 2020 exhibition, the museum will return to the theme of the year. The twenty-first Biennial will be held in the fall of 2020. The twenty-fifth Biennial will be held in the spring of 2021. The 2020 exhibition will be new and curated by Sara Goldberg. The 2020 exhibition will be free for everyone to see, free for schools and free for the public to learn more about the place of art in their neighborhoods.\n\n\nThe J. Paul Getty Trust in Los Angeles has given $1.5 million to the Getty’s work in support of the Getty’s work in support of artists and institutions working to preserve and restore historic buildings. The $1.5 million will go toward the Los Angeles County Museum of Art (LACMA), the Getty’s Los Angeles County Museum of Art, the Getty’s Los Angeles County Museum of Art, the Getty’s Los Angeles County Museum of Art, and the Getty’s Los Angeles County Museum of Art. “The Getty’s commitment to supporting artists and their projects has been recognized for years,” said Jim Wechsler, president", "The next Biennial should be held in 2021, when the institution will have celebrated its sixtieth anniversary. The next iteration will take place at the Museo de Arte Contemporáneo in Rome.\n\n\nThe New Museum in New York has received a gift of twenty-one works by Australian painter Jack Scratchy. The works, which were donated by artist and collector Nicky Shaw, will go on view in the institution’s permanent collection exhibition “Exhibitions,” which opens on May 24, 2019. “The works on view are not only a testament to the many talented artists who have worked in partnership with Nicky Shaw, but are an inspiration to any artist who admires Scratchy’s paintings,” said New Museum director Loring Randolph. “Uniquely, they are all commissioned by the same individual, Scratchy. The works will bring Scratchy’s paintings to life and make them accessible to New Yorkers and visitors worldwide. Scratchy has created a series of paintings that move us in unexpected ways and that move us to see him in new ways.” The works are as follows:“The Distant Bird,�", "The next Biennial should be held in 2021.\n\n\nBill Sternberg, the director of the Museum of Modern Art (MoMA), has agreed to step down next year to become head of the New Museum in Long Island City, New York. In a statement, Sternberg described his time at the museum as a “sister institution” of the Museum of Modern Art in New York, which he led from 1996 to 2001. The New Museum’s board of trustees announced his resignation on August 26, contending that his departure has no bearing on the institution’s future.Sternberg joined the museum in 1970 as an assistant professor in the department of art history. From 1971 to 2001, he served as associate curator and curator, and from 2001 to 2015, he was the museum’s director. During his tenure, the museum expanded its collection and became a major cultural destination for the city and region.“Bill is widely recognized as one of the leading curators of Modern and Contemporary Art in the United States,” said Neil Blumenthal, the museum’s director. “Throughout his twenty-five years at MoMA, he has shown extraordinary prescience in developing the museum’s collections and creating the museum", "The next Biennial should take place at the Museum of Fine Arts, Boston, in 2021. \n\n\n\nAn artist’s studio and residence are sacred places of contemplation, reflection, and experience, and thus are also of great significance to the historical experience of a student of the humanities. The Yale Center for Contemporary Art (Yale CCA) has announced that it intends to dedicate a new $25,000 space to the study of contemporary art through a new program of exhibitions, residencies, and other programming.The program will draw from the CCA’s extensive collection, which is organized according to a twelve-year cycle, with the goal of supporting the institution’s illustration program, writing program, and design program. It will also provide a platform for projects conceived as a continuation of the Center’s existing programs and will draw from the Yale School of Arts’s collection of works by contemporary artists and craftsmen.“This program of exhibitions, residencies, and other programming is not a substitute for the important work being done by students, scholars, and artists in our collections,” said Yuki Morikawa, chair of the CCA’s board of trustees. “The Center for Contemporary Art at", "The next Biennial should comprise an exhibition of works created by some thirty artists from thirty-six countries, including France, Spain, Italy, and Germany. The exhibition should be open to the public from November 29 to March 21, 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has created two new positions in its art department in an effort to improve the diversity of artists represented in its collection. The museum opened two new research and exhibition spaces in an effort to foster greater participation by underrepresented groups of artists in its curatorial program. The new roles, which were created in collaboration with artist and curator Nari Ward, were created in an effort to increase the museum’s representation of women artists.“We’ve had a hard time with the term 'diverse collection” in the past,” said Ward. “We wanted to use the term in a way that was specific, but also broad, like to say that we were working with a diverse population of artists.”The change in curatorial responsibilities has been made in response to the museum’s pledge to divest from fossil fuel companies. The museum made its promise during a Catalyst event last March, during which it collaborated with artists and activists", "The next Biennial should be held in 2021. \n\n\nThe Saint Petersburg Biennale has released the list of ten artists whose works will be featured in the fifth edition of the event, Art in Motion: The Venice Biennale. Titled After Venice, the twenty-fifth edition of the event will take place at the Saint Petersburg State Museum from March 14–March 21, 2021. “The theme of the upcoming edition is temporary, and the importance of the exhibition will clearly be demonstrated through the exhibition,” said Frank Gamack, director of the Saint Petersburg Biennale. The twenty-eight artists represented in the exhibition include Hans-Ulrich Naidoo, Alberto Nazareth, Julie O.R. Brady, Sonia & Simon, Alexandre Robpal, Catherine Verzier, Carlotta Evaristo, Yelena Rublev, Bina Wojtas, Ann-Sophie Müller, Nina Zhan, Diana Zhukova, Adrian Piper, and Nancy Willis. The Saint Petersburg Museum of Fine Arts (SVMFA) is also hosting the thirty-fifth", "The next Biennial should be held in 2022. \n\n\nThe Museum of Jewish Heritage (MoH) in New York has appointed Ravi Mena, the director of the Jewish Museum in New York and a self-taught curator, as its next director. Mena, who has helmed the institution since 2015, succeeds Mona Hatoum, who retired in the summer of 2019 following a tumultuous year as director of the Brooklyn Museum.“Ravi Mena’s appointment marks the end of a unique and exceptional leadership and artistic career,” said MoH director Paul Tully. “At a time when we are working to redesign the future architecture and landscape of the Jewish Museum, with the theme ‘Waiting for Tomorrow’ at our Fall/Winter 2019 exhibition, he has demonstrated an extraordinary ability to push forward the museum’s next-generation of leadership, bringing new ideas and an original vision to the institution.”In a statement, Mena said: “I’m honored to have served as MoH’s director for eight years and to have led the museum’s remarkable collection and staff during that time. I’m also proud to have contributed to the museum�", "The next Biennial should be held in the year 2020. Focusing on contemporary art and the role of strangers, the exhibition will include works from the collection from the Italian pavilion in the inaugural Biennial in 1999 and from the twenty-third Biennial in 1999.\n\n\nTim Berners-Lee, the inventor of the World Wide Web, died on December 3rd at age ninety-nine at his home in San Francisco. He is survived by his daughter, Susana, and his grandson, Nico.Born in New York City in 1944, Berners-Lee was raised in the city; in the early 1950s, he moved to San Francisco to study under Bob Kahn at Stanford University. In the summer of 1970, while working as a freelance art critic for the New York Times, Berners-Lee met and married fellow Stanford grad, programmer Larry Lessig. In 1981, less than a year after the couple married, the internet was born. Six years later, after Lessig received a $100,000 advance from the venture capitalist group Internet Archive, the two set up a foundation to support Berners-Lee and Lessig’s vision for the web.The foundation has since awarded more than $1.5 million in grants, scholarships,", "The next Biennial should take place in 2022, and the exhibition will return to the US for the first time in more than twenty years in 2021. This year’s event will be hosted at the Museums of the American Revolution in conjunction with the heritage exposition.\n\n\nJurors in the case of the trial of the twenty-six-year-old Chinese artist Ai Weiwei, who was charged with twenty-six counts of murder and one count of attempted murder in connection with the death of his girlfriend in September 2015, have been suspended and will return to the court in March 2020, China News reports.The first phase of the case, which was launched in October 2014 and concluded in March 2020, was focused on Hu Jie, the twenty-six-year-old Chinese artist known for creating works that grapple with themes such as identity and the boundaries between China and other countries. Hu was arrested in Guangzhou, China, on April 2, 2015, after he allegedly stabbed his girlfriend to death in their apartment in Beijing.The trial, which was reopened in March 2020, was centered on the relationship between Ai and Hu, who was photographed with Hu in his hotel room at a Beijing park in February 2019. The couple had been dating for about", "The next Biennial should take place at the University of Cambridge and will be chaired by Sir David Attenborough. It will be at an unknown location in the city.\n\n\nThe Museum of Modern Art (MoMA) in New York has hired five artists to its curatorial team: Becca Delgado, Amanda Knebel, Nicholas R. Gregory, Robert Irwin, and Howard White. The curators are working together as part of the exhibition “All You Need Is Love: Art for Dummies” and are collaborating alongside senior curator Bethany Bell, who will serve as the show’s first curator; Richard Armstrong, who curated “The New Black: Race, Rage, and the Body” in 2017; and artist-activist Jodi Throckmorton.“Together we see how art can be a bridge between communities and how it can heal, whether it’s for our own community or for those around us,” said David Remnick, curator of the biennial, which will run from April 5 to May 21. The exhibition will feature works by sixty artists and designers whose work is currently on display in MoMA’s current exhibition “The Gallery of Modern Art” and", "The next Biennial should be held in the spring of 2020.  \n\n\nThe National Gallery of Canada is planning to close permanently to allow the construction of a brand new 1400-seat exhibition space. Its current exhibition space, the National Gallery of Art, has been home to two exhibits since the museum opened in 1877. In order to make way for the construction of the new exhibition space, a gated community was established in an old dairy building just across the street from the institution.The twelve-thousand-square-foot exhibition space will be inaugurated by an exhibition of the work of American artist Peter Kreeft, titled The Great Gatsby, at the National Gallery of Canada on the first floor of the building on January 17. Peter Kreeft The Great Gatsby (1925)Peter Kreeft was born in Alabama in 1925. In addition to his vast output of paintings, sculptures, photographs, videotapes, and prints, Kreeft also created theatrical installations such as The Grid that took place on a series of flat-screen TVs in his studio. The show opened at the National Gallery in Ottawa in June 1927 and featured work by more than seventy artists. The project served a dual purpose in helping", "The next Biennial should be held at the Guadalajara Art de Puebla (in the Philippines), in 2021; the city of Guadalajara is currently working on a new site for the event, which will be held in the city’s historic central auditorium, the Prado, as well as at the Cultural Heritage Center of the Philippines, the Auditorium of the National Museum of the Philippines, and the Museum of Art.The biennial will be based on the city’s 45,000-piece collection of art and artifacts and will be organized in five cycles, starting in 2021 and ending in 2023. The first, titled “Art and the City,” was presented by artist-in-residence, designer, and gallery owner Elinokpala, the vice chairman of the Palawan Group and a founding member of the Pangaea Group, at the November 15, 2021 edition of Artforum. The second “Art and the Other Half,” was presented by the Hong Kong-based nonprofit Art in Motion, which is represented by the Hong Kong-based nonprofit Art Alliance, at the February 12, 2022 edition of Artforum.\n\n\nThe Metropolitan Museum of Art in New York has", "The next Biennial should be held in the second half of the year. The next edition of the Berlin Biennale will take place in the second half of the year and will be hosted by the Berlin Art Museum (BAM), which is currently undergoing a major renovation. The institution is currently looking to relocate to a new venue in the city of Maastricht.\n\n\nThe researchers behind the major new study, published by the journal Nature this week, have found that the Arctic has become significantly warmer since 1998. The study, led by ecologists at the University of Bristol, used data from more than four hundred individual stations around the Arctic Circle to analyze the climate of the region for the past four decades. The findings, which were published in the journal Scientific Reports, reveal that the climate has been changing much faster in the southern regions of the Arctic than in the northern regions, which are home to many of the world's biodiversity.“We found that the Arctic has been warming at about two-thirds the rate of the rest of the world,” said study coauthor and PhD student Sarah Bell, an ecologist at the UVa Center for the Arts in the University of the Arts. “The Arctic is warming up at a rate that is", "The next Biennial should take place in 2022. In the meantime, Ma'lik and Phyllis have been awarded a $50,000 grant from the Ferry Biennial Trust, which was established in 2010 to encourage the regeneration of the waterfront. In addition to the grant, the pair will create a new institute to foster the exhibition and circulation of work by artists in Hong Kong.\n\n\nGina Rinella, the founder of the New York–based nonprofit Artadia, has been appointed director of the Museum of Modern Art (MoMA) in New York. She will take up the post at MoMA on September 10. Rinella joins the institution from Artadia, which she founded in 1997. At the time, the nonprofit ran an exhibition, “The Triennial of Art,” in 2001, followed by “Cullman: Transformations,” in 2003, and “Gil Evans: Simple Life,” in 2008. She is also the founder of Artadia Fellows, a fellowship program for artists in the United States.“I’m thrilled that Gina will join our team at MoMA,” said David Rubenstein, chair of MoMA’s board of trustees", "The next Biennial should be held in 2020. “The Biennials have been a source of inspiration, a source of inspiration for me, and a source of inspiration for others,” he said. “I’m grateful for the opportunity to present the work of the most important artists of my lifetime in my home country. I’m excited to see what the future holds.”\n\n\nThe New York–based nonprofit Art in America has been awarded a major $50 million grant from the Andrew W. Mellon Foundation in support of its promoting understanding of and preservation of the arts in America. The grant, which recognizes the importance of museums and cultural heritage sites to the American story and is made in recognition of their important role in promoting artistic and civic exchange, was made in conjunction with Art in America’s Fall/Winter 2020 issue,” which outlines its vision and the program it plans to deliver in 2020. For the past twenty years, the organization has partnered with museums to advance its goal to build a library of more than four million artworks and works of art from a single collection in the United States. The project, which has been described as the highest level of art conservation’", "The next Biennial should be held within the next twelve months and will be launched by artist-run organizations, such as Art Basel, Art Dubai, and Art London. The program will consist of six partner museums that will collaborate with the artist-run galleries and will be led by different staff from the same organization. The first exhibition, “Feminine” will open at the Art Institute of Chicago in September. The second, “Away, I Don’t Want to Go Anywhere” will open at the Art Institute of Chicago in October. The third exhibition, “Dreamers” will open at the Art Institute of Chicago in January 2020. The fourth exhibition, “Planetary Harmony” will be presented at the Art Institute of Chicago in May. The fifth, “New Female Seduction” will open at the Art Institute of Chicago in June. The sixth exhibition, “The Body,” will open at the Art Institute of Chicago in June 2020. “Women’s Art: Biennial 2020” will be held at the Art Institute of Chicago in May 2020. “Women’s Art: The Rarities 2020” will be presented", "The next Biennial should take place in Tokyo in 2020. The Biennial of Modern Art is scheduled to run for twelve years.\n\n\nThe Botanic Gardens in the Japanese town of Nara in Nagoya province have received a new $3.8 million donation from the Kochi-based philanthropist and collector Tatsuo Ito, who has been a long-time supporter of the arts. The gift includes a new 300-seat, glass-enclosed theater, a new 25,000-weight painting studio, a new 50,000-volume sculpture library, and several new works by artist-in-residence Yoko Ono.The gift also includes the creation of a new year-round resource center, a new teaching library, and an extension of the Botanic Gardens. The extension was created to allow space for the acquisition of works by artists who are currently on the move, including the New York– and London–based artist Andreas Eriksson, who will work in the new office space, and the Danish artist Reiner Knoblach.Knoblach’s new residency at the Botanic Gardens is slated to begin in early March 2020. Knoblach will be able to work from home for up to eight hours a day", "The next Biennial should be organized and curated by a person with the relevant experience and training, and should be developed with a view to a new and meaningful art experience.”\n\n\nThe Solomon R. Guggenheim Museum in New York has announced that it will soon host an international exhibition dedicated to the Italian abstract painter, sculptor, and designer Gi-Rosa, who created some of the most important works in the genre but is most famous for inventively merging art and architecture. Gi-Rosa’s work will be included in an exhibition that opens on March 31 and runs through June 10, 2020 at the museum.The theme of the upcoming exhibition is “The Architecture of Life” and will be “Diana Aligh, Gi-Rosa, and the Architecture of Life” (also known as “The Architecture of Life”). The tenth edition of the exhibition will feature work by five distinct and overlapping phases of the artist’s career.“Gi-Rosa is one of the most important and difficult artists of his generation, a superbly imaginative artist who is equally at home embodying the instinctive and the sensuous, the dream and the mundane,” said M", "The next Biennial should be held at Hull in the spring of 2021. After the festival, the British Museum should begin a process of “re-conceptualization.” The Institute of Contemporary Arts (ICA) in London will partner with Tate Britain to launch a new yearlong program of programming that will take place across several locations, beginning with the museum in October and run through March of 2021.“We have been working with Tate for more than five years to develop a new, ambitious and ambitious architecture for the exhibition program,” said Simon Ward, chief executive of the Hurst-Berger Group, which represents the curators at every level of the British Museum. “Tate is planning to add new exhibitions and collections at a faster pace than ever before, and to create new ways for audiences to get involved with our collections, exhibitions, and collections collections experiences.” \n\n\nThe Chicago Art Institute (C.A.I.I.) announced today that Marco Cacciappa has been appointed as its next director. He replaces Joe Maddox, who retired in March after twenty-five years at the C.A.I.I. C.A.I.’s board of trustees announced", "The next Biennial should include a selection of works by working and emerging artists in collaboration with the City of Los Angeles, where the exhibition will begin in December 2019.The 10-year, $140 million renovation of the Santa Monica Pier, which opened in 2015 and is currently undergoing a $100 million facelift, is also on track to open in January 2021. According to Artnet, the renovation project is expected to result in a visually stunning new building dedicated to performance, arts, and culture for the history of art. The full list of contributors is as follows:Anderson, Pamela. 'Composition 3,4,5,6,7,8,9,10,11,12,13,14,15. Los Angeles, California, USA. 2018.Designing the Future: The Art of Design in the Twenty-First Century (LACMA, 2019).Herschenbach, Tom. 'The Double Feature: A Bienal History of the Parabola. New York, New York, and London. 2018.Featuring the work of Michael Kors, Lesley-Anne Laverrière, Jessica Mathews, Michael Rosenfeld, Markus Richter, Tanya Savate, Nicholas Seawright,", "The next Biennial should be organized in the United States, and its themes should center around the biennial’s namesake, Dr. William Greider (1903–1991), a pioneer in the field of art history and a director of the Museum of Modern Art. After an exhibition of Greider’s work will open at the Museum of Contemporary Art in the Arts (MoCA). While last year’s exhibition featured work by thirty artists, including Yinka Shonibare, Jhumpa Lahiri, and Joe Tejada, the event will be hosted by MCA and will be open to the public from March 21 to March 23. The 2017 Biennial presented work by forty artists, including Irving Penn, Mark di Suvero, and Maureen Jeffries. The 2019 biennial will be hosted by MoCA and will feature work by fifty artists, including Adam D. Weinberg, Jocelyn Flores, and Alice Gwinn, among others, and will be staged at the Art Institute of Chicago (AIC). The event will be held at the Museum of Contemporary Art (MoCA) from March 19 to March 20. The 2019 event also includes the exhibition “Coming Together: Art and Democracy", "The next Biennial should be held in the city in 2022.\n\n\nThe Solomon R. Guggenheim Museum in New York has acquired a rare surviving picture by William Eggleston. It has also given the artist a new work, called The Gringo, that will be on display in the museum's new “William Eggleston, The Gringo” exhibition, which opens on Friday, March 9. The exhibition marks the 75th anniversary of the artist’s death. The Guggenheim is conducting a retrospective of Eggleston’s work, titled Eggleston: The Gringo, on view until September 2021, which will also feature new works by the artist, such as his work for the first solo exhibition in the history of the museum at its new home in the historic Tremonton building in the city’s Chelsea neighborhood in the spring of 2019.The show, which will also include pictures from Eggleston’s other solo exhibitions in the late-1950s and early-1960s, was curated by Adam D. Weinberg and will open at the museum in March 2021. The new work, which will be part of a series titled “William Eggleston: The", "The next Biennial should occur at the Museum of Contemporary Art (MoCA) in New York. The committee will decide whether the event should be pulled from the schedule at the request of the Museum of Modern Art (MoMA). The question of whether to hold a new exhibition in the city has been a source of contention for some time. The process has been described by some as having two parts: a) determining whether the city’s historical and cultural sites could still benefit from a major upgrade and, if so, how; and b) determining whether the existing works should be restored to their original state. The current exhibition “Feminine: From Anaïs Nineteenth-Century to the Next Exhibition,” which opens in the fall, will likely remain open for at least another six months. \n\n\nGerman federal arts minister Monika Grütters has announced that the government will assist the arts with a record $10 billion in aid to the arts and cultural sectors in 2019. The aid will come from the national cultural fund bZ der Bürger, which was established in 2017 to allocate $9 billion to the arts, and will prioritise projects that reduce inequality and promote equality. Grüt", "The next Biennial should include 'Future Light: The Art of Light and Matter”, which will highlight “unreal, innovative, and extraordinary work by emerging and established artists in collaboration with philosophers, scientists, and engineers.”The museum will also present a special exhibition of work by artists such as RockoLooi, Wangechi Mutu, Afsaneh Musa, and Muneer Mohan, and will inaugurate a new digital platform, The Biennial Experience, in collaboration with Foldmotion. The platform will allow visitors to experience their works in a curated virtual environment. The program will debut at the museum in late November.​\n\n\nThe National Geographic Society’s (NGS) move to block the publication of a new book by anthropology professor Tacita Fernandes, entitled The New Aliveness: Art and Aliveness in Early Modern Society, has been suspended by the institution. The decision was made amid protests from academics, art historians, and other cultural figures in the United States and Europe who have condemned the move. The move follows a push by political leaders including President Donald Trump and the French government to curtail the cultural legacy of the late anthropologist Jean-Luc God", "The next Biennial should focus on the collaboration of artists in the Americas and Europe. We are open to the idea of collaborating with artists in all over the world.” The twenty-third Zurich Biennale, which will take place in the Swiss town of Krefeld in June 2020, is also planning to present a new project, “Unfinished Business,” that will include commissions by 80 artists\u0097including Nari Ward, Haus de la Bête, and Karola Wylie, among others.\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it has appointed João Curius as its next director. Curius comes to the institution from the Museu de Arte de São Paulo, where he has served as chief curator since 2013. He succeeds Alexander Acosta, who retired from the post in March 2019 in favor of his successor, Felipe Massa.“We are profoundly honored to welcome João to MoCA,” said Anastasia DeSantis, chair of the board of trustees. “With his extensive experience in both European and American art history, he will contribute to advancing our mission, creating opportunities for scholarship and exhibitions in", "The next Biennial should be held in the autumn, with the construction of a new exhibition space in the autumn of 2020. The reopening of the exhibition should coincide with the reopening of the cultural center. The development of the Biennial is supported by the Museum of Modern Art (MoMA) and the New York Philharmonic, as well as contributions from an assortment of institutions and individuals.The Biennial is not alone in its pursuit of culturally significant buildings. Since its inception in 1987, the Biennials have partnered with cultural institutions throughout New York City to show work by artists in the city. The building of the Javits Center, which will be inaugurated by the Biennial in March 2020, is supported by the city of New York, as is the renovation of the Metropolitan Museum of Art. The future of the Museum of Modern Art and the Metropolitan Museum of Art in New York is currently in jeopardy because of the ongoing litigation between the institution and the city of New York over the former’s decision to scrap the project, which is currently at an indefinite stage of development.A third-party organization, the Cultural Landscape Foundation (CLF), has set up a website, www.landscapes.org, where visitors can find inspiration", "The next Biennial should take place in 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles plans to begin welcoming visitors again after a major fire tore through the building in the early hours of this morning (February 14). According to the Los Angeles Times, the firemen who extinguished the blaze at the museum, which is located near the California Institute of Technology (CalArts), said they were unable to stop the fire from continuing to grow as it continued to consume several hundred thousand square feet of the institution’s vast interior space.“This is one of the largest fires to ever break out in California,” museum director Monica Roe told the Los Angeles Times. “The structural integrity of the building is in jeopardy, and the museum is currently undergoing a major renovation. . . . We are working hard to determine the best course of action for the museum in the coming weeks. . . . We are in the process of assessing the needs of the environment, the community, and the preservation of the museum as we evaluate the best course of action for the building and the institution.”Roe said the fire began in the building’s basement level, which is being renovated by architect Herzog & de Me", "The next Biennial should take place in 2019. \n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, has released its list of the twenty-nine artists who will participate in the ninth iteration of the Museum of Contemporary Art Grand Renaissance, which will take place at the Los Angeles County Museum of Art (LACMA) from March 7 to March 11, 2020. Among the forty-two artists selected for the exhibition are Alexander Calderón, Christine Wang, Justin King, William S. Burroughs, Alighiero Cattelan, Alexei Durer, Vladimir Malai, Tanya Malyshevskaja, and Yu-Tai He.Museum director Maria Bochereau described the show as an extension of MoCA’s history, adding that its “festival of images,” which will take place at the LACMA Renaissance, is dedicated to the “experimental and the non-linear in art and artmaking.”While the exhibition will coincide with the institution’s annual Land Through Time exhibition, which celebrates the city’s 160th anniversary this fall, it will feature original works by twenty-five new artists, including Sarah Sze, who will present �", "The next Biennial should take place in 2020.\n\n\nArtist-run spaces are supplying new and struggling arts workers in the US with artistic and material support, in support of the Fight for 15, and in support of the Black Lives Matter movement. Among those providing material aid are the Valentino Foundation, the Emily and Eddington Art Gallery, the Newark Museum of Art; the New York Historical Society; the Museum of Modern Art in Harlem; and the Metropolitan Museum of Art, which has been attempting to organize an exhibition devoted to the work of tele-painting artist and educator Thomas Merton.The artist-run spaces also welcomed people from the public gallery, the Fine Arts Museums Association, the Metropolitan Museum of Art, and the American Alliance of Museums, and art works from artists such as Willem de Kooning, Evelyn Young, David Salle, Mary Ellen Mark, and Leo FitzGerald are being donated to the organizations. Valentino Foundation, the Emily and Eddington Art Gallery, and the Met Museum of Art will help gallery owners in New York and will donate works for exhibitions.The auction houses argue that virtually all the works donated will be exhibitions, with the exception of a few works of fiction and artworks that will be", "The next Biennial should take place in the spring of 2021. \n\n\nThe Museum of Modern Art (MoMA) in New York has hired Emmy-winning curator and art historian José Banderas as its next director. Banderas has helmed the museum since August 2019 and has been a consultant for MoMA since October 2020. His appointment comes after the institution opened a new space in the former Perkins-Yale building in the fall of 2019.Banderas’s new role will be on a four-year term, beginning in January 2021 and running through March 2021. Through the appointment, Banderas will become a member of MoMA’s board of trustees and will serve as an advocate for the institution’s artistic mission.“I’ve been a MoMA board member for more than twelve years, and I’m thrilled to be returning to the institution that I started in 1989 as director of exhibitions and collections,” Banderas said in a statement. “I’m looking forward to working with MoMA’s incredible staff and loyal community, to building on the institution’s legacy of exploring, documenting, and exhibiting contemporary art. MoMA is a vibrant, mult", "The next Biennial should take place in the spring of 2021. The event, titled “Art and Science,” will examine “the relationship between art and science” and will be organized as an extension of the exhibition “Art and Science‛,” which will be on view until March 25. While the theme is still under discussion, the event will take the form of a symposium.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has appointed Silvia Rivera as its new associate curator of modern and contemporary art. Rivera previously worked as a curator at the Museum of Modern Art, where she co-led the exhibition “Franciscan Sculpture: the Architecture of Purple,” between 1991 and 2011 and then returned to her native Colombia, where she is now based, to focus on contemporary art and Latin American art.In her new role, which is funded by the Met, Rivera will work closely with the museum’s curators to expand its collection of modern and contemporary art from Latin America and the Caribbean to encompass the entire globe. Among the works that will be featured in the museum’s exhibition are pieces by Pablo Picasso, Jean-Michel Basquiat, Marcel P", "The next Biennial should be set in 2020 and will highlight the work of the day through the medium of photography. The new paintings, created by Miro Aoki-san, will be based on statements made by international luminaries from artists such as Pierre Huyghe, Peter Pesch, and Catherine Pickering and will be staged in a contemporary art museum.The Biennial will be organized as follows: 1. Japanese-born, US-based artist Miro Aoki. 2. German artist Konrad Wohn, who had been based in Japan since 1972, was granted residency there in 1984. According to the Art Newspaper, Wohn began his work in the exhibition space of the Eiffel Tower in Paris. 3. The exhibition will focus on the cultural, historical, and spiritual heritage of Japan and will include more than 200 works by eighty artists from twenty-four countries. The selection committee made the call for the exhibition based on the artists' works and their influence on contemporary art after Japanese artist Ai Weiwei’s death. By choosing thirty-seven artists, the committee chose fifteen of the best of the best. The forty-sixth biennial will be staged in 2019. 4", "The next Biennial should be held in the fall of 2019 and will begin with a public exhibition at a museum, centered around a theme. The artist-led project will be followed by a biennial at the institution.“At this moment of great uncertainty for art, when many cultural institutions and institutions’ groups are struggling to come to terms with the impact of the coronavirus, and many are feeling the effects of austerity measures, we are thrilled to be able to open the next Biennial in the autumn of 2019,” said Gabriella Celotto, director and CEO of the Art Institute of Chicago. “The Art Institute of Chicago is committed to the arts as a critical tool for helping to shape public policy in the city of Chicago and is in the process of organizing an open-call for artists to create new works for the exhibition. The Biennial will at once present a unique and timely look at the history of the art and will serve as an exciting platform for new work to emerge.”Inaugurating the event are three new exhibitions, “The Planetary Society: From Sanctuary to Unity” (2019), “Art and Cancer: The Impact of Cancer on the Human Body” (2019), and “", "The next Biennial should be held sometime in the second half of 2019.\n\n\nThe National Maritime Museum (NMM) in Portsmouth, England, is planning to open a new storefront location in the city center of the United Kingdom, which is currently home to the museum’s famous entrance and its famous exhibition space, the National Maritime Museum (NM). The newest exhibition and venue at the institution, titled “Onward Together: Contemporary Art and the Landscape”, will be staged in a format similar to that of the institution’s current shows, but will feature works by artists such as Pierre-Auguste Renoir, Chris Ofili, and Enrico Castellani.The newly renovated museum is located at 1-15 Portsmouth Street. Designed by British firm BAE Systems, the building will offer visitors a more intimate experience, a concave glass-enclosed interior as well as a library and café. The National Maritime Museum is part of the Royal National Landscaping Museum (NRLM), a joint venture between the National Maritime Museum and the National Portrait Gallery in London. The partnership was established in 2004 to increase the display of landscape art at the museum.“The National Maritime Museum is one of the oldest contemporary art institutions", "The next Biennial should choose a theme to commemorate its fifty-fifth anniversary in 2020 and will ask the public to nominate an ideal location by April 3.The 2019 iteration of the event, which was organized as part of the New Directions for Photography (NAP), was held at Noguchi Beach in Long Island City, New York, and was curated by Melissa Chiu and Carol Enos. The 2020 edition will take place at the St. Patrick’s Cathedral in Dublin, the National Museum in Washington, DC, and the Metropolitan Museum of Art in Manhattan. \n\n\nThe Fine Arts Museums (FAIM) has appointed Shih Chien, Chair of the Department of Modern and Contemporary Art at the University of Pennsylvania, as its new chair of international art. He succeeds Bruce Hernández, who served as chair of the department for thirteen years, and will succeed Michael Hauptman, who retired in January after thirteen years at the helm of the FAIM.“Bruce and I have been working together for more than a decade to advance the art of the twentieth century, and I’m particularly proud of the work he and he has done to advance the work of contemporary art,�", "The next Biennial should be held in March 2020. 56. Juliette de Serre, Art of Life, Paris, 2019. The exhibition was awarded the Prix de Triomphe de Paris in March 2011, and the Prix de Glace in May 2013. The artist and visual arts museum in the French capital recently reopened, and an exhibition of her work will open at the Modern Art Museum in New York in April 2020.57. Eugene Solti, Art of Life, Paris, 2019. Developed in collaboration with the architectural and design studio Zaha Hadid Architects, this exhibition included a large-scale, multi-lens installation with eight large mirrors called Mirrors in the Sky, featuring the artist’s work from the show’s first year. The work, which incorporates mirrors and other structures, is an homage to Simón Bolívar’s masterpiece Celesti, also in the city of Lyon. 58. Diana Palmer, Art of Life, Paris, 2019. Palmer first exhibited her work at the Bataille in 1966. In 1998, she was elected to the Royal Academy of Arts in London. 59. Paul Gaugu", "The next Biennial should be a public celebration of the life and work of Pablo Picasso. It should also be a time to reflect on the life and work of Henri Matisse\u0097a time that will be dedicated to the life and work of the great artist and should involve performances, lectures, exhibitions, performances, lectures, exhibitions, exhibitions, performances, lectures, exhibitions, exhibitions, exhibitions, performances, lectures, exhibitions, exhibitions, exhibitions, exhibitions, exhibitions, performances, lectures, exhibitions, exhibitions, exhibitions, exhibitions, exhibitions, exhibitions, exhibitions, exhibitions, exhibitions, exhibitions, exhibitions, exhibitions, exhibitions, exhibitions, exhibitions, exhibitions, exhibitions, exhibitions, exhibitions, exhibitions, exhibitions, exhibitions, exhibitions, exhibitions, exhibitions, exhibitions, exhibitions, exhibitions, exhibitions, exhibitions, exhibitions, exhibitions, exhibitions, exhibitions, exhibitions, exhibitions, exhibitions, exhibitions, exhibitions, exhibitions, exhibitions, exhibitions, exhibitions, exhibitions, exhibitions, exhibitions, exhibitions, exhibitions, exhibitions, museums, exhibitions, exhibitions, exhibitions, exhibitions, exhibitions, exhibitions, exhibitions, exhibitions, exhibitions, exhibitions, exhibitions, exhibitions, exhibitions, exhibitions, exhibitions, exhibitions, exhibitions, exhibitions, exhibitions, exhibitions, exhibitions, exhibitions, exhibitions, exhibitions, exhibitions, exhibitions, exhibitions, exhibitions, exhibitions", "The next Biennial should focus on 'intentionally expanding the boundaries of art through a global celebration of diverse cultural practices and their interconnections, as well as exploring the unpredictable ways in which art can shape and reflect on the world.”The Biennial will be held in the historic city of San Francisco, California, from September 21 to September 22. The event will host 70 international artists, artists' studios, and other arts organizations, and will include a preview of the biennial, titled “After Earth: A Brain of Its Own,” on September 25.The grand opening of Biennial 1, the exhibition “Challenging Art” at the Museum of Modern Art in New York on September 27, will coincide with the opening of another exhibition of work by the same group of artists: “In the Shadow of the Sun,” which will open at the Museum of Modern Art on October 9.\n\n\nThe Pushkin State Museum of Fine Arts in Moscow has appointed Vladimir Pudin as the next director of the museum. Pudin will take up his post on December 20. He succeeds Svetlana Popova, who served as the director of the museum during the construction of the Moskva-1 complex", "The next Biennial should open in 2021, with the exhibition “Between Two Worlds: The Art of Making Sense in the New Century” to take place in the Philippines in 2022.\n\n\nThe London-based arts organization the Royal Institute of British Architects (RIA) has named Alexandra Rees as its next general secretary. Rees, who is also a fellow at RIA, will assume the role of chief executive officer and head to London to oversee the reinstallation of the institution’s architecture and design program.“Alexandra has been instrumental in delivering a number of RIA acquisitions successfully, to the tune of billions of dollars, and we are very grateful for her efforts,” said David Cameron, director of the British Council. “She has proven her talents, competence, and vision for the RIA, and we look forward to her continuing to shape and develop the RIA’s architecture and design program.” The RIA’s current general secretary, Anne Blagdon, stepped down in November 2019. After she stepped down, Blagdon stepped down from her position and was appointed interim leader. Rees will take up the post on March 16.\n\n\nThe Los Angeles County Museum", "The next Biennial should take place at the National Museum of the American South in Charleston, South Carolina, on March 26; the museum has received a $35,000 grant from the Andy Warhol Foundation for the Visual Arts; and the 2020 event will be held at the National Museum of the American Indian in Washington, DC, as part of the biennial’s year-long celebration of American culture. The National Council on the Arts likewise received a $25,000 grant from the Andy Warhol Foundation for the Visual Arts in support of a new edition of the National Association for the Visual Arts. The National Association for the Arts received $25,000 from the Andy Warhol Foundation for the Visual Arts in support of its 2020 biennial, which will be held at the Smithsonian American Art Museum in Washington, DC.\n\n\nThe Museum of Fine Arts (MFA) in Boston has received a gift of more than 1,600 works by Maurice Breuil\u0097one of the founding members of the clinic at the Massachusetts Institute of Technology and the creator of the eponymous New York–based queer-centric venue, the Menil Collection, which pioneered the exhibition-based art form that would eventually define the museum’s curatorial practice\u0097", "The next Biennial should take place in 2021. Bertrand and Dominique de Menil are collaborating again, this time with a project called Ocuronat, which will present a collection of sculptures by thirty-five artists in a project that will run for twelve months. The exhibition will be held at University College London (UCL), and will feature works such as Tigress, 2000, 2011, and The Pack, 2010. Eddie Vidal will collaborate again with a new exhibition called Sites of Healing. Other shows scheduled for the venue include Intuitive Reminiscences, 2019, which will feature art from the Puerto Rican artist Alvaro Pérez-Campos; Art as a Weapon: Ex-Groups and Revolution, 2019, which will be held at the Art Gallery of Ontario; and Art in the City, 2019, which will be staged at the Toronto Art Gallery. The twenty-second edition of the Venice Biennale will take place at the Veneto Artolo in Venice, Italy, in September 2020.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Oliver Schiff as its new board chairman and CEO. Schiff comes to the institution from", "The next Biennial should be held in 2020. The museum is currently planning to open a new exhibition space, Stages, in the museum, which opened in 1914. The building, completed in 1952, will stage more than six hundred exhibitions annually.The biennial will continue to include exhibitions of work by artists who have been selected for the 2020 event, including Brene Brown, Dale Davis, Michele Doran, and Mierle Duschel, and will also present new works by and about artists, such as Jack Harrelson, Robert Irwin, and Wangechi Mutu. The next Biennial will be held in 2021.\n\n\nThe National Gallery of Scotland has received a gift of forty-four works from the National Museum of Scotland, an institution founded by Sir Ian Mackay in 1940. The extraordinary collection, which also comprises works by Peter Sellars, Tanya and Iwan Wirth, and includes artworks by people such as Edward Atkins, David Bowie, and Anthony Horn, is currently on display in the exhibition “The Future is Now: Painting from the National Gallery” (2019).The donations were made by Mackay family members and members of the Mackay family gallery. The museum will now present the work on"]