["The next Biennial should examine the ways in which artists' work can communicate with one another through social media. The upcoming exhibition “Digital Panorama: Mural Imagination in Motion” will also examine the “autobiography of the silhouette,” the “meme of the double-entendre,” and the “regressive-neoliberal crisis of a modernist city.”The exhibition will be divided into two sections: “The Biennial’s Structure,” which will be the subject of a symposium organized by curator and director Yoko Mino, and “The Biennial’s Vision,” which will be curated by Rainer Werner Baume. The exhibition will feature the work of twenty-four artists, including Anna Atkins-Wright, Eleonora Caruso, Bénédicte Casson, André Coreth, and Alex Dziewior, as well as artworks by Tenkyu Park, Mike Kelley, and Lawrence Abu Hamdan, among others. The painting and sculpture section of the biennial will be comprised of work by ten artists, including Mark di Suvero, Joe Giza, Kiki Smith,", "The next Biennial should be focused on “intersection of art and culture,” said Madeline, adding that she is also interested in the idea of taking the show abroad. “I believe that the best way to get the old to the new is through new ideas.”\n\n\nThis is the first in a series of articles exploring the artworks and their impact on contemporary culture. The next installment will explore the connections between the American West and the Arabian Peninsula.\n\n\nThe Metropolitan Museum of Art in New York has appointed James P. Turner as its new executive director. Turner heads the museum after serving as its director from 2006 to 2008 and previously helmed the Metropolitan Museum of Art in New York from 1996 to 2003. He succeeds Mary Anne Carter, who in the early stages of her tenure was the head of the Metropolitan Museum of Art in Manhattan, and will take up the post in January 2020.“James is one of the world’s most respected and respected art historians, authoring editorials and books on such subjects as the history of photography, the relationship between post-War art and the environment, and the aesthetics of the African diaspora,” said museum director Daniel H. Weiss. “We are grateful", "The next Biennial should be held in Beijing in the early 2020s. The 2019 edition was staged by the Shanghai-based Dangdai Garden Museum, and the painting was inspired by a life-size model of the museum, which is currently being restored. \n\n\nThe São Paulo Museum of Fine Arts (São Paulo) is launching a new initiative aimed at promoting the Brazilian indigenous art and culture to a broader audience. Called the Indigenous Arts and Cultures Initiative, the initiative will target both conceptual and practical artists and will focus on using modern technologies and new platforms to raise awareness of the history and contemporary practice of Indigenous art and culture.“The project is part of our efforts to serve as a bridge between modern and Indigenous art,” said Juninho Pimentel, director of the museum. “The initiative will aim to create a unique environment for the visual arts, which are essential elements of the cultural identity of the indigenous communities, and will serve as a platform for the performing arts, which have a significant role in their communities.” The initiative will involve a series of exhibitions showcasing newly discovered work by indigenous artists, films, performances, and documentaries, and will culminate in a public programme of activities in the park", "The next Biennial should be set in 2019, with the opening of the exhibition “Spiral Star: Art and the American Experience” in 2020. The final project of the biennial will be “Art and the American Experience: Contemporary Art in the Age of Americanism” at the Museum of Art in 2021.\n\n\nBy Tom Glynn\n\nThe Allen Memorial Garden in Seattle has received a gift of fifty-one sculptures by thirty-six artists, including Jacques Bonnard, Cindy Chen, Sara D. Davis, and City Pointe, as well as a selection of ceramics by twenty-eight other artists. Nearly three hundred artifacts from the museum are in the collection of the Northwest Cultural Heritage Center, which is housed in the former Boeing factory site.The gift includes pieces by artists whose work has previously been on display in the Allen’s exhibition “Awarding the Artist” (2019) and “Spiral Stars” (2019). In addition, the museum has two of the artists’ avatars from “The Magician” (2010), a portrait of the artist that is currently on view in the exhibition “The Art of", "The next Biennial should take place in 2021.\n\n\nThis year’s edition of the United Kingdom’s Tate Modern saw an unprecedented 17,000 visitors, including the first official public tours of the Tate’s new £12 million building, which opened on June 3. The event, titled “Tate at the Museum of Britain,” had previously been held in 2021. The museum has since said that the 2020 edition, which was staged in collaboration with the National Poetry Library, “had the largest audience of any Tate event ever.”Last year, the museum opened a new wing, the Tate Contemporary, which has a new lecture series, a new café, a new museum galleries, and a new carousel, which will transport visitors between the museum and Tate Modern. The new wing, which opened to the public in September, was inaugurated with a new poem by former Royal Shakespeare Company director Nicholas Cullinan, “The Springboard of the World,” and will be inaugurated with a new work by Sir Michael Caine, “Aquarius: A Visual History,” in April.The 2020 edition of Tate Modern, “Aurora: A Retrospective,”", "The next Biennial should take place in 2021. The theme of the next iteration of the Exhibition is “Prospects of Art.” It will be a mixture of contemporary art, historical objects, and cultural artifacts, such as ceramics and sculptures.The 2019 edition of the exhibition, “Progress,” was held at the Tange Museum in Berlin and attracted more than 2,500 visitors. The exhibition opened on September 14 and ran until December 6.Artforum will be publishing more highlights from the forthcoming event in the weeks ahead.\n\n\nThe National Geographic Society’s request to remove a controversial map of the planet from its website was denied on Friday, June 13. The map, which depicts the globe in a 21-point grid\u0097which was commissioned by the company in 2007 and depicts the continents in a 28-point grid\u0097has been removed from the site and is currently on display in a gallery in Washington, DC. The move has reignited a firestorm of controversy after it was announced that the map would be removed from the site and its website on June 20.The National Geographic Society claims that removing the map has nothing to do with protecting the company’s intellectual property; however, the move was seen", "The next Biennial should include the first exhibition devoted to the work of female artists in the United States.\n\nAdvertisement\n\n\nWithin days of the terrorist attack on a French satirical magazine in Paris on March 23, which claimed the assassination of three of the staff, the French government declared a state of emergency. In response to the move, several cultural institutions across the country have canceled programming, and the country’s budget has been slashed by at least €300 million in an attempt to mitigate the financial impact of the coronavirus.On Tuesday, the French president, Emmanuel Macron, announced that the legislation to extend the state of emergency, which was passed on Wednesday, March 25, will remain in force until at least April 4. “We are not ready for this crisis,” Macron said at a press conference in the capital. “We must act quickly, and we must act collectively. We must solve this problem together. We are not alone. We are the only ones who understand that we are not at war with these viruses.” He continued: “I speak with the French president [Lucian] Merrifield and the head of the State, the head of government, to make it absolutely clear that we are", "The next Biennial should feature work by less established artists and should take place in the city where they live. The event should follow the theme “Radical Women: An First Gender Project,” and will aim to “unify the feminist movement by combining art, activism, and radical feminism.” The inaugural exhibition, titled “Radical Women” (2017–18), organized by the feminist collective the Vagenda, was held at the Museum of Modern Art in New York from January 21 to January 29, 2019. The Biennial will include work by as many as three hundred artists. The 2020 edition will feature work by thirty-five artists, including Tara Donovan, Sol LeWitt, and Kazuko Nakayama; the list of participating artists is as follows:Natalie RascoffNathalie M. AhtoneNashiki KaiganiNathalie M. AhtoneNasra VidiNasya D. MehtaNathalie M. AkramNasra VidiNasya D. MehtaNasra VidiNasya D. MehtaNathan PedutoNüdikar PindeJoel Wirth", "The next Biennial should be held in the autumn, not in the spring. We are not here to debate whether spring is better. It is a matter of whether spring is a better season for art to be shown.The exhibition will be held at the new exhibition space, the Institute for Contemporary Art (ICA), in Beijing, and will feature work by thirty-four artists from twenty-two countries and territories—including Rwanda, South Africa, Nepal, and the Philippines—in addition to a selection of new works created on the culturature floor.The exhibition will also feature the first artworks from the new National Museum of Chinese Art in Beijing to enter the public collection since the museum opened in 1996. The works will be presented in a new exhibition titled The Future Is Now: Chinese Art in the Twenty-first Century. The exhibition will run for five weeks and will run concurrently with the Beijing Biennale. \n\n\nThe 2019 edition of the Venice Biennale, curated by A.S. Günther, will be held at the Palazzo La Palazzo in Venice from October 13 to October 20. The event, which was previously slated to kick off on October 18, has been postponed to December due to the Cov", "The next Biennial should take place in 2020, with the exhibition marking the first time the two works were displayed together. In a sign of the times, the work, titled ArtiḗAmor nazar, was selected for the pavilion by a jury comprising artist and curator Anna Bonomo, director of the Medusa Museum, Cagli, Italy; illustrator and critic Tilo de Bruni, director of the Ateneo Art Museum, Tokyo; and artist and curator Rosalind de Shear. The pavilion will be inaugurated with the exhibition “Berlin Planets” (2019).\n\n\n\n\n\nNew York—As the coronavirus continues to spread across the United States, the Metropolitan Museum of Art (MoMA) in New York has become the latest institution to cancel a major art exhibition scheduled to open this fall. After the institution confirmed on Friday that it will not be able to hold the twenty-fifth edition of the A.I.R. Gallery Art and Design Show, which was set to run from October 29 to November 28, the institution announced that it would suspend all programming and move the event online. “We have been working with MoMA to ensure the safety and security of our", "The next Biennial should be held in 2021, and the last in 2022.Dr. María Berrío, president of the Republic of Chile, said: “The monument is a great work of art, dedicated to the memory of the people who have died in the process of defending democracy and to the struggle for the Bolivarian Revolution and the recovery of its territories. I am very much looking forward to the performance of the work in the new Congress.”\n\n\nA massive new survey of the art world\u0097which was organized by the Association of Art Museum Directors (AAMD) and was presented at the Venice Biennale on May 4\u0097has found that only 15 percent of exhibitors are willing to take on new contracts following the 2020 event, and that 72 percent of the museums are not prepared to continue with business as usual.The survey, which was commissioned by the AAMD, found that sixty-eight percent of arts professionals believe that the rapid pace of change in the art world is not conducive to long-term sustainability, and that thirty-six percent of exhibitors are prepared to reduce their workforces, work hours, or workforces in some other way.“We are deeply concerned by these numbers, and worried", "The next Biennial should be held within the next year. •\n\n\nThe Chinese artist and thinker Wang Wei, a member of the legendary three-dimensional Chinese painting-and-dissolving sculpture duo the Xiao and the Wen, has died at eighty-six years old. He was born in Shanghai in 1930, the son of the artist and scholar Li Xiao, who had relocated to northern China with his family from the coastal city of Shandong.At the age of fourteen, Wang enlisted the help of his older brother, Li Yu, to make the first-ever three-dimensional sculpture by Xiao and Wen. The work is now on display in the exhibition “Wang Wei’s Art and the Chinese Painting” (2016) at the Kunsthalle Basel, Switzerland, and was also included in the seventy-fifth edition of the Chinese Painting and Sculpture Biennial, held in Beijing in 1998.After moving to Europe in the early 1950s, Wang returned to Shanghai in 1954 and began working with Xiao and Wen on a series of sculptures and paintings that explore the boundaries of Chinese and European art. In the ’60s, he began a three-dimensional landscape-and-sculpture work with", "The next Biennial should take place in the city in 2022. The plan also calls for the opening of a new museum to house the work of fifty-two artists, including Andy Warhol, Robert Irwin, and Renzo Piano. The work of a few artists is also being renovated. The project, titled We Are All In This Together, and Dia Art, is aimed at reopening the Biennial to the public. The theme of the exhibition is Life, Death, and the Body, and the exhibition will consist of twenty-four works.\n\n\nThe Los Angeles County Museum of Art (LACMA) has named Mira Pape as director and CEO of the museum. She succeeds Laura Mulvey, who has helmed the museum since 1995, and will begin her tenure in July.“Mira is a visionary leader, and we are privileged to have her at the helm of LACMA,” said LACMA director and CEO Michael Govan. “Following a thorough search process that included a thorough, in-depth, and transparent review of LACMA’s long-term financial and operational plans, Mira has been selected as the next LACMA director and CEO, and we", "The next Biennial should be dedicated to the life and work of Edward Hopper, as presented in his exhibition “Life and Art in America” at the Center for Art and the Creative Economy at the University of California, Los Angeles (UCLA), in October 2020. The museum will also present a special exhibition of works by Carol Goldsmith, which will be staged at the Museum of Modern Art in New York in December 2020, and an exhibition of new studio work by George Cukor, which will take place at the Museum of Modern Art in 2020.\n\n\nThe University of California, Berkeley, announced today that Christine Naudette has been named the first director of the Berkeley Art Museum (BAM). Naudette comes to the institution from the Northridge Museum of Art in the San Francisco Bay Area, where she has served as interim director since 2017. She succeeds Adrienne Edwards, who in April 2019 became the institution’s director.“Christine exemplifies the qualities that make the University of California, Berkeley so special: a deep commitment to artistic excellence, an enthusiasm for innovation and a remarkable record of achievement,” said the university’s interim director, Kimerly Rorschach. “Her work", "The next Biennial should take place in 2019. The new body should focus on rethinking the role of art and how it should be viewed by the public.  \n\nThe museum has received a gift of more than 1,900 works by the American painter and designer Lee Scott. The work, which resides in the collections of the Metropolitan Museum of Art and the California Institute of Technology, includes works by artists such as David Salle, Mark di Suvero, and Francis and René Magritte.Born in New York City in 1948, Scott was raised in San Francisco and studied under the famed painter Richard Serra. From 1976 to 1983, he taught at the Graduate Center at the City University of New York and at the School of the Art Institute of Chicago.Over the course of his career, Scott evolved his practice from an abstract form that blended heavily of painting and sculpture to a slightly surreal and constructed work, which explores both the external and the internal world. He began his partnership with the MCA in 1974 and was commissioned to create public works for the pavilion in 1983. In 1995, he switched to designing, creating seminal works such as his largest, the Cloud House, which stands over twenty thousand feet tall and features sculptures by David K", "The next Biennial should take place in the autumn of 2021. The eighty-sixth edition of the Biennial will be held at the National Museum of Art in Seoul at the end of March 2021. The theme of the event will be “The Present and the Past.” The fourteen-thousand-th anniversary of the founding of the National Museum of Art in Seoul is also a high-profile topic for the museum, which will celebrate the centenary of the institution with an exhibition of new works by artists such as Seo Min-kyung and Kim Seo-kyung, and will host a public lecture series titled “The Decade of Biennials” in the fall of 2021.\n\n\nThe Smithsonian’s National Museum of African Art (NMNA) in Washington, DC, announced that Charles Young has been named director of the institution. In his new role, Young will lead the institution through its next phase, which will begin with a redesign in 2021, and will oversee a roster of curators and scholars and a global network of collections.“Charles’s vision for NMNA was to make NMNA a museum that truly represents the essence of American art through the best practices and most", "The next Biennial should be held in 2020.\n\n\nThe Pérez Art Museum Miami (PAMM) has announced that it is moving the thirty-fifth edition of the Biennial, which was set to take place in Miami Beach in March 2019, to August. The move has been made in anticipation of the coronavirus pandemic, which began on January 5, and coincides with the official reopening of the Museum of Contemporary Art Miami (MCA). The Pérez Art Museum Miami is currently closed until at least February 4, 2020, due to the ongoing coronavirus outbreak in the United States.“The Pérez Art Museum Miami is committed to supporting our community through the contingency of keeping our biennial events in Miami Beach,” said PAMM director and CEO Jose Luis Alemani. “We are grateful to our visitors, partners, and community for their understanding and support as we worked with all of our stakeholders to ensure that we could remain resilient to the coronavirus and ensure that all of our upcoming events are able to take place in a city that has been impacted by the virus.”The move will also help the Pérez Art Museum Miami as it works to reopen to the public in", "The next Biennial should be held in 2021. The date has yet to be set.\n\n\nThe Museum of Contemporary Art (MoCA), California, announced today that it will not be able to reopen to the public in time for the twenty-fifth edition of the Metropolitan Museum of Art (MMoCA) in New York City, scheduled for March 27–March 31, 2021. The iconic American art museum—which has been closed since the 2015 pandemic—was forced to move the exhibition “Theater of Operations: The Gulf Wars 1991–2011” from its March 10 opening to April 3, following a delay of two years.“We are deeply disappointed that we are not able to present a truly contemporary exhibition of work by the twenty-six artists featured in the exhibition,” said David Littman, president and CEO of the newly renamed Metropolitan Museum of Art. “This shows an incredible lack of understanding of what matters most, the work itself. As we approach the twenty-fifth edition, we should be celebrating the work of the artists. We need not over-emphasize their importance.”The artists, represented by the nonprofit the Metropolitan Museum of Art Artists’ Horizons, are:-Vincent van Gogh", "The next Biennial should be held in 2021, when the exhibition will be moved to its new home in the city center, the V&A. \n\n\nThe Art Newspaper reports that the Dutch house of the Arts, the Künste Endokolle (KEL), is planning to shutter its three-story headquarters in the capital, Amsterdam, and move the works of contemporary artists from the institution’s sprawling grounds into glass cages to be installed in the V&A’s new pavilion. The move is part of a larger restructuring of the Künste Endokolle, which began in 2020 and is estimated to cost the organization around €18 million ($19 million). The Künste Endokolle will hire the Dutch firm Sotsystemnaturkwerke, which will construct the cages in a two-mile-long tunnel in the Künste Endokolle’s former location, to prepare for the change of venues. The new pavilion will be inaugurated by director Stijn VandenHeuvel, and will seat six hundred contemporary artists.The Künste Endokolle first opened its new home in a former petrol station in the Duplex", "The next Biennial should be on March 11–March 11, 2020. “We are thrilled that the Biennials Berlin and Haus der Kunst will inaugurate the new era with a retrospective of the exhibitions that are scheduled to be opened in the spring of 2021, and that the Berlin Art Biennials will be located in the city of Kassel,” said Carmen Wiedert, chair of the Committee for the Art and Architecture of Berlin. Since the exhibition will be primarily focused on the history of the twentieth-century architecture and design, the biennial will focus not only on the works but also on the community of organizers. The program will also include a number of events, including a “Living History” exhibition in conjunction with “Art and Tradition”, “Art and Life” and “60s New York: A Retrospective. Participating artists and institutions will include Lee Berlind, Knut Lutz, John Paul Graham, Alighiero Giglio, Hans Hoffman, John Lee, Anita Levitskaya, Cynthia Mark, Anna Laudel, Gertrude Stein, and Peter Wachter. The biennial is organized by the Berlin", "The next Biennial should be held in 2021–22.\n\n\nLouis Vuitton announced today that the British designer will design the twenty-second season of its Paris-based auction house, which is currently undergoing a major overhaul, beginning with the biennial’s 2020 edition. The redesign, which is housed in the French city of Lyon, will focus on sustainability, art, social justice, and aesthetic aspects of the event, and will introduce new programming that will enhance the Paris-based fair’s contemporary and ethno-centric feel.“It is a special occasion to be able to present the first solo exhibition of the new designers, whose works have previously been displayed in the Palais de Tokyo, the Neu Parisienne, the Bouvet-Fabian, the Musée d’Art Contemporain, and the Musée d’Art-Paris, among other museums,” said Louis Vuitton CEO Fermat Rachal. “Together with the French Ministry of Culture, we have adopted a new strategy to develop the 2020 Paris Fashion Week, and we hope that this innovative redesign will ensure a strong and innovative program in 2020.”The new design aims to address the challenges presented by the expected unprecedented number", "The next Biennial should take place in 2020, the venue of President Trump’s first address to Congress. “The mission of the Biennial is to span, to organize, and to present the full range of social, political, and cultural change that has taken place in the history of the United States.”\n\n\nThe Museum of Fine Arts (MFA) in Boston has received a gift of more than five hundred photographs by Italian photographers Giacomo Balla and Stefano Bellotti, both of whom were in the process of creating the landmark exhibition “Me and My Photographs,” which features work by more than 2,500 works by more than fifty artists from the Italian post-Bologna region, that were on display at the museum on October 3 and will be restored and displayed in the museum’s new, expanded, and expanded form.The gift includes a new reproduction of the exhibition, which opened at the museum on October 3 and ran until November 18, 2019, and a new signed certificate of authenticity. The exhibition’s curator, Giovanni Giunta, said: “These photographs are treasured possessions of the museum and we’re thrilled to return them to the artists and to the", "The next Biennial should open in 2020. “I am very excited by the prospect of the Biennial,” said Bech. “It will be a time of great change and reflection for the arts for the first time. The exhibition will be the largest and most ambitious project of its kind in the United States. It will also include the first exhibition of works by female artists in New York, the first show by an independent artist in the United States, and the first works on North America’s Pacific Coast by women artists.”The organizers are also working on a “post-collapse emergency management plan.” The exhibition will also include a survey of the Philippine arts and culture, which was staged in collaboration with the National Museum of the Philippines, the Palawan Museum of Art, and the Philippine Institute of Art, and will be presented by artist and filmmaker Joel Sasakawa.\n\n\nThe Museum of Modern Art (MoMA) in New York has become the latest institution to lay off more than a dozen employees in the wake of the coronavirus pandemic. According to the New York Times, the museum is facing an impending $150 million shortfall as it attempts to hold off losses from canceled programming and reduced revenue as", "The next Biennial should be held in London in the spring of 2020. Massachusetts, New York, and Los Angeles are among the states that have expressed interest in hosting the exhibition, and Curbed News reports that the California-based organization Architects and Engineers for the Environment (AE6) is now petitioning the board of trustees of the Museum of Modern Art in New York to open a public forum to discuss the exhibition in an attempt to halt the exhibition’s opening.In a letter dated December 28, the museum’s board chairman, Abraham Waguespack, wrote: “The future of the museum and of our collection lies in your hands. As an institution that prides itself on fostering a sense of community among our curators and teams, we cannot afford to lose sight of our mission.”\n\n\nThe J. Paul Getty Trust has launched the J. Paul Getty Biennial, a $250 million initiative dedicated to the arts and science. The initiative will gather the biennial’s artists, curators, and researchers together in Los Angeles to create a new platform for communication about art and culture. “The architecture of a new platform for public engagement is an ambitious project, but it is essential for the future of", "The next Biennial should be called for September.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is currently closed until at least February 23, 2019 due to the Covid-19 pandemic. The problem arose in March when MoCA staff were asked to clean an area of the museum that was being renovated. When the workers returned to the area, the mural, titled “Longing for a Return,” was missing. As a result, the work was never exhibited.The city of Los Angeles has since accused MoCA of failing to address the spread of Covid-19, but the institution maintains that it is taking the crisis and trying to address the situation as soon as possible. A spokesperson for MoCA said: “The safety and well-being of our staff, visitors, and the public is our number one priority. We are working with the virus and our health experts to develop guidelines for dealing with people who are sick and how people can be tested for Covid-19.”\n\n\nThe Carnegie Museum of Art in Pittsburgh has hired Mark Schier as its new associate curator of contemporary art. Schier will be responsible for working across the museum’s permanent collection, exhibitions, and collections, including the", "The next Biennial should be in 2021, which would mark the anniversary of the death of the founder of the commune, Jean-Luc Bière. The official announcement of the next edition of the Biennial will be held in the fall of 2021.\n\n\nThe Los Angeles County Museum of Art (LACMA) has released a set of guidelines for the display of works by thirty-five contemporary artists in its upcoming exhibition “Grizzly Gaze.” Titled “Grizzly Gaze:  ‘Play,’” the exhibition will feature work by forty-six artists, including Klaus Voigt, Agnes Martin, Lucasfilm, Sean Ross, and Benoît Toth, and will open on September 8.A collaboration between LACMA and the Los Angeles County Museum of Art (LACMA) became possible through the generous gift of Michael J. Fox, the former executive director of LACMA who was recently appointed as chair of the institution’s board of trustees. In recognition of his service, Fox made a major gift of works by twenty-five artists from the collection of LACMA, which is currently undergoing a $85 million expansion, including Eva Hesse", "The next Biennial should be held at the Kunsthalle Basel in December 2021.\n\n\nThe Metropolitan Museum of Art (the museum) in New York has announced that it is planning to open an outpost in the city where the late Whitney Houston held the world record for largest solo exhibition, at least 11,800 square feet (about 240,000 square feet divided into ten sections within the museum). Details about the building, which will be adjacent to the Metropolitan Museum of Art, have yet to be announced.The museum’s goal is to establish a new space, dubbed the Whitney Biennial, in the now-demolished MetLife Building on West Twenty-Fifth Street in Manhattan. The former Whitney Building, which is undergoing a $200 million redesign, was completed in 2017 and opened to the public in 2018. The Whitney’s current home consists of four buildings: the museum’s current home on West Fifty-Third Street in Manhattan; the former Whitney Building, which is currently being renovated by the Whitney; a former theater building in the Bronx; and the former headquarters of the National Association of Theater Owners (N.A.T.O.), a New York nonprofit devoted to supporting theater artists. The museum has been working to redevelop", "The next Biennial should be held at a location that is convenient to the public. The team should then choose a theme and a theme-park-like setting to create immersive experiences for the participants. My colleague and I will unveil a new format for the biennial later this week.”\n\n\nThe Museum of Modern Art (MoMA) in New York has announced that it plans to open its new headquarters in the Little Italy neighborhood of Brooklyn on August 26. The institution will serve as the home for the museum’s permanent collection and as a hub for the broader arts ecosystem. The launch coincides with the museum’s '40s Celebration, a nine-day celebration of the 50th anniversary of the institution. In celebration of the occasion, MoMA will hold a retrospective of the artist-in-residence, the late artist-in-residence, and Stewart Brand, among others, on June 16–June 22. The museum will also launch a new MoMA app, MoMuseum, that will let visitors explore the museum and its collections via virtual reality.The announcement of the venue for the museum coincided with the opening of MoMA’s newest expansion, the twenty-first floor, which added a theater and an outdoor garden", "The next Biennial should be held in 2021. Originally scheduled for March, the event was rescheduled for March 24–March 26, 2022. The 2022 edition will feature almost 800 artistic works created by 6,700 participants. Hence, the artists have decided to postpone the event until the spring of 2022.Expected to draw nearly fifteen thousand visitors, the exhibition will be held at the Museu de Arte de São Paulo. The announcement comes less than a week after a memorandum of understanding (MoU) was signed between the Biennals de São Paulo and the city of São Paulo. The agreement establishes the dates, the venue, and the audience for the 2021 exhibition. The biennial will inaugurate the new São Paulo Museum of Art (SPMA), which is slated to open in 2020, and will include a residency program for emerging artists. Commenting on the agreement, SPMA director Bruno Pausan said: “We’re delighted to be working with the Biennals, an artist-driven institution in the heart of São Paulo. The exhibit will be a platform for asking the question: How do we as a community support and celebrate our Brazilian roots?”\n\n\n", "The next Biennial should be held in the United States in 2022. Echoing the artistic tradition of the América’s entire collection, the exhibition will feature work by a record number of artists. The exhibition will also expand the museum’s collection beyond its usual heroes, including Renate Adhera, Yoko Ono, and Tanya and Lutz Edidi.“The inaugural exhibition was really a collaborative effort between artists, curators, and historians and we are pleased to see that the exhibition has evolved into an important platform for the development of their careers,” said Stefan Molynek, chair of the exhibition’s curator committee. “We always welcome the opportunity to have artists, curators, historians, architects, and other cultural producers participate in the exhibition. We hope that this exhibition will be a source of inspiration for future exhibitions.”The museum is also celebrating its centenary. The exhibition will be hosted at the museum until March 27, 2020, and will be followed by a book launch and the launch of a new exhibition of works by the collection.\n\n\nA group of artists, including Charles Ming, I.M. Pei, and Benjamin Britten, have petitioned", "The next Biennial should be held in early 2020.  Priority will now be given to the most feasible and academically rigorous interpretation of the work, and the 2019 winner will be chosen by a jury of the Arts Council, the London-based body representing the arts and cultural sector, and the PILOT Group, the London-based organization that runs the festival. The 2019 prize ceremony, which was held on November 23, was attended by Christopher Buck, director of the PILOT Group; Barrett Cromwell, artistic director of the Lab; and Kate Fowle, director of the Festival.Cumaknuma Chaudhuri, the head of the PILOT Group, said: “Over the last three decades, the PILOT Festival has been a platform for cutting-edge work by emerging and established artists and we are delighted to have made a significant contribution to its success. The PILOT 2019 takes place at a pivotal point for the festival, when most artists are still just beginning to experiment with work on exhibition-sized projects and the work of ordinary and popular artists is not as widely recognized and celebrated. We look forward to furthering the PILOT Festival’s commitment to", "The next Biennial should have the theme of “meaningful connections.” According to the Art Newspaper, the exhibition will focus on the “irreconcilable contradictions that define us as individuals and as a society.”The Biennial’s first exhibition was “Top of the World” (2019), which focuses on the relationship between the artist and the planet. The next two shows will be “The Landscape and the Landscape” (2019) and “Imaginations from the Rainforest” (2019).\n\n\nThe New York City Department of Cultural Affairs has awarded $9 million to seventy-five arts and cultural organizations as part of its $2 trillion Cultural Impact Fund. The grants will go toward supporting the implementation of the city’s new policy on cultural institutions, which states that institutions that receive funding from the fund must implement the change within two years.Under City Hall’s direction, the culture and entertainment industry has contributed more than $86 million to New York City’s coffers since it launched the Cultural Impact Fund in 2017. “We’re thrilled by the response to our campaign and how strongly cultural organizations felt about it,” said Mayor Bill de", "The next Biennial should focus on “historia”\u0097it will hold its first exhibition in Paris in late December and will launch the exhibition “François Truffaut: The Problem of Painting” in December 2021.If the biennial goes as planned, the exhibition will unveil a new installation, “The Idea of the Future,” by artist Bénédicte Hardy, and will also contain a retrospective of the artist’s work “The Tree of Life” and the fifth edition, “The Presence of Martyrs.” In addition, the exhibition will feature a new selection of works by the late five-term French president Nicolas Sarkozy, including “The Captain and the Prisoner,” August 1982, a rendering of the president’s famous “Feminine Code” speech, and “An American Tragedy: Essays on the September 11 Attacks,” September 2015.\n\n\nThe University of Washington in Seattle announced today that it will begin accepting undergraduate and graduate students from the Chinese Academy of Fine Art (CFA) in Beijing as part of a $2,000,000 grant program. The first round of", "The next Biennial should focus on the interrelationships between mathematics and philosophy, with a particular emphasis on the role of mathematics in the pursuit of knowledge and the promotion of knowledge.”The new exhibition will be titled “Mathematical Vision and the Development of Modern Philosophy.” The exhibition will also focus on the use of mathematics in the study of philosophy. The festival will be organized in collaboration with the National Gallery of Finland and will be held at the Sauna Helsinki in the city of Sipadan, in the province of Kiiva, in the south of Finland.The inauguration ceremony is scheduled for August 25.\n\n\nThe Danish artist Lars-Erik Pedersen, whose playful, whimsically attired sculptures fused modernism and the natural, has died at age ninety-four. Pedersen’s work has been exhibited at several museums across the globe, including in Denmark, France, Germany, the Netherlands, and Sweden. In 1978, the Netherlands selected him for its Topographical and Structural Art Prize, which was presented to the same artist by the Dutch government in a ceremony attended by Queen Marta; he was also given the Order of the Danish Empire. Pedersen’s sculpture The Two-Body Problem, 1979, was", "The next Biennial should have a global perspective. It should reflect the diversity of ideas and a global voice. We must now examine our place in the world and how we can play our part in ensuring that future generations enjoy the artistic richness and the creative possibilities of Poland.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, has appointed Michael L. Jones, a curator and educator, as its next director. Jones currently serves as the senior curator at large at the Los Angeles County Museum of Art (LACMA), where he has helmed the museum since 2013. In his new role, he will focus on supporting the curatorial and development of the institution’s exhibition program and community partnerships, fostering the institution’s international reputation, and ensuring that MoCA, which recently underwent a major facelift and renovation, continues to thrive as a cultural destination.“We are thrilled to be working with Michael to build on his reputation and his vision for LA’s Museum of Contemporary Art as one of the most innovative and important cultural institutions in the United States,” said board president L.A. Reid. “In the twenty-first century, no one embodies this legacy more fully than Michael. His experience, passion", "The next Biennial should focus on analyzing the relationship between art and politics, culture and philosophy, and perhaps the future of art and politics. The second exhibition will be devoted to the history of the conservation of art; that is, its preservation in order to be studied by specialists. The third will explore the relationship between science and art through the research of the famous fossils. The fourth will be an open-air exhibition of the work of the artist, poet, and composer Grammar Corcoran. The biennial will culminate with a performance by the artist, poet, and composer\n\nThe twenty-sixth edition of the Venice Biennale, curated by Andrés Artiès and choreographed by Daniel De Sousa, has released the seventy-ninth edition’s list of participating artists and galleries. The exhibition will feature more than three hundred works by forty-eight artists. The list comprises works from forty-five countries and forty-eight different continents.In addition to the entry fee, thirty-six artists will receive $1,000 grants that will allow them to develop their exhibition practices in the exhibition space. The artists are:Adrián Cavalcanti, Barcón del Castillo,", "The next Biennial should be held in the spring of 2021.\n\n\nThe Department of the Interior and Environment (DENV) in New Mexico has awarded $3.9 million to thirty-six arts and cultural organizations in the state for conservation and restoration projects. Nearly $1 million was allocated for “green infrastructure” (i.e., infrastructure designed to reduce greenhouse gas emissions, protect biodiversity, or serve as a buffer between people and the land), and another $1.2 million for landscape and water conservation.The state, which is currently facing a $300 million budget shortfall, announced the grants in December. The grant program was established in 2018 to provide a variety of funding—from $10,000 for small arts and cultural organizations to hundreds of millions of dollars for larger organizations—to adaptive disaster zones. The grants are designed to address the concerns of local, state, and federal governments that the coastal plain of the state has become a major environmental hazard.New Mexico Arts and Cultures has launched a new campaign to help protect cultural heritage sites in the state. Citizens can mail the department at www.newmexasartsandcultures.org or call 800-848-", "The next Biennial should be held in the spring of 2020. “We are currently developing the next exhibition and are working hard to find a date,” de Gheb, who joined Stockholm in 1967, told the Art Newspaper. “We are also considering creating new opportunities for students, and will soon present the show ‘Pretender: Best of Modern Art’ on our campus.”While the Biennial will bring together forty artists from eighteen countries, including Japan, Russia, Israel, South Korea, Australia, Belgium, France, Italy, Germany, and the United States, the event will also feature six publications by the artists in addition to a number of lectures. The show will be divided into three periods\u0097the mid-1990s, the 2000s, and the 2020s. The exhibit will open on the fifth floor of the Culture Center on January 25, 2020.\n\n\nThe National Museum of Fine Arts (MoFA) in Washington, DC, has received a gift of eight rare works by Pablo Picasso\u0097a collection valued at more than $1 million. The work is a selection of Los Angeles County’s work The Promise, 1947, which depicts a future where Los Angeles has become a center for", "The next Biennial should commence with the exhibition “Dirk Gently: Bequest of German National Art” (2019) and will run until December 21.\n\n\nGallery members who have expressed concerns about the safety of the exhibition space, the exhibition staff, or the exhibition’s travel arrangements have been informed and will be alerted if necessary. The Centre will ensure the building is accessible for the exhibition and will provide technical assistance to the gallery and to the exhibition’s staff in an attempt to resolve the matter. The exhibition has been moved to a different venue and will return in January 2020.\n\n\nThe Metropolitan Museum of Art has appointed Charlotte Volin as its next director. She will be responsible for overseeing the organization and development of the Metropolitan’s collection, which comprises more than 1,500 works, and will assume her role in January 2021. She succeeds Susan Noon, who retired in March 2019 after fourteen years at the helm of the museum.“The museum has always believed that a woman, a woman named Charlotte, was an excellent choice to lead the organization,” director Daniel H. Weiss said in a statement. “Her ability to understand the unique role of the museum, which is to provide access to and learn from", "The next Biennial should take place at the Art Institute of Chicago in 2021, in the spring of 2022, and will be organized so that it will coincide with the 100th anniversary of the United States. The jury will be comprised of biennial artist-in-residence Spencer David-Weir, Charlotte Simonson, and biennial curator Andrea Sheehan. \n\n\nBritish artist Yuki Kondo’s new exhibition at the Museum of Fine Arts (MoFA) in New York, which is currently on view through November 19, is bringing Kondo’s work to the United States for the first time. In a presentation titled “Museum of Modern Art,” Kondo, a British artist who is best known for his conceptual and conceptual projects that focus on both the spatial and the material aspects of art, will collaborate with Yale University art historian and curator, Paul Mpagi Sepuya, curator of the Allen Memorial Art Museum, and New York’s Sissy Field Museum of Art to present a new exhibition, “Museum of Modern Art: A Retrospective,” at the Allen Memorial, which is currently undergoing a $600 million expansion, at the Allen Art Museum, on December 9. The", "The next Biennial should be held at the Velodromo in Milan in July 2021. The theme, “The Present,” will be “The Present in a Contemporary Way” according to Artforum editor-in-chief Marc-Olivier Osei. The exhibition will highlight contemporary art from Africa, Asia, and the Americas.The 2019 show, “The Present,” opened at the Museum of Contemporary Art, Los Angeles (MoCA) on October 3 and ran until January 28. The show also featured work by twenty-one new artists, including Haus Deutsch, Tenzin Tshabalala, and Farah Al Shihani.The 2019 exhibition was curated by Lara A. Davis, director of the Maud Cohen-designed Contemporary Art Museum in New York and the MCA.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles (MOCA) has announced that it is planning to open a new research center dedicated to the history of visual art and the visual arts in the city in 2021. The institution will also dedicate $10.5 million to renovating the existing building in which the institution will operate a new research laboratory, called the Center for Visual Art. The building, which", "The next Biennial should be held in the spring of 2021. The first in the United States, in 2018, was held at Washington Square Park. The new exhibition will be curated by a group of American artists that includes Kelly James McBride, Michael Ochs, Jorritse Maximilian, and Omar Bar-Lev.“This is an unprecedented and fragile moment,” said Whitney Museum of American Art director Constantine Lehmann. “The US house economy has yet to fully recover from the first episodes of the pandemic, and many of us are grappling with mental health and economic anxieties that have yet to fully subside. We are grateful to those who are mobilizing to help, to those who are standing in solidarity with us, and to those whose voices and stories we are hearing.”\n\n\nThe Museum of Fine Arts (MFA) in Boston is preparing to welcome the first visitors to its new facility, the Museum of Fine Arts (MoFA), the Museum of Fine Arts Boston, towards the end of the year. The extension of the museum’s footprint, which opened in 2016, will bring the exhibit count to six hundred, and will include a theater, a gallery, and an auditorium.�", "The next Biennial should take place in the summer of 2021. Desert X has also announced that it will begin accepting artworks from the recently opened Kohn Gallery in Los Angeles in February.A retrospective of the artist’s work, titled “Nirvana”—a reference to the artist’s description of the Arabian Peninsula as a lush expanse of desert—will be presented by the gallery on December 11. The event will also feature an exhibition of works by artist-in-residence Christina Pape in April 2020.Pace Gallery has announced that its space in the new Fifth Avenue Armory building will reopen on September 12. The Los Angeles institution, which has space in the building since October 2018, was forced to move the exhibition on to the Armory for the first time in its twenty-five-year run due to the Covid-19 pandemic. Its previous location, in a former auto body shop in the West Village, was renovated in 2017 to create a space for the exhibition. “We are thrilled to welcome back the Kohn Gallery in Los Angeles,” said Laura Ross, the gallery’s executive director. “The exhibition ‘Nirvana’ will be a milestone", "The next Biennial should include a discussion of the state of contemporary art and the political situation in the US; a retrospective of work by artists working in the Caribbean; and an exhibition of works by women new and old.”The 2018 event was held at the Shoshana, a new contemporary Art and Design space in Brooklyn, New York, that was commissioned by the Brooklyn-based artist Nadine C. Orsi—a feminist and African American artist best known for her anthropomorphic sculptures, which display patriarchal symbols of representation, transference, and domination. The Biennial was cofounded by local artist-activists and collectors Kym Robles and W. Alexander Lee, who each gave $50,000 in support.The inaugural event was held in November 2018.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Abigail and Charles Fuqua as its next executive directors. The news comes on the heels of the announcement that MoMA will merge with the Metropolitan Museum of Art. Both the Met and Fuqua have been embroiled in controversies since the merger was announced in 2019. The two institutions are currently embroiled in a legal battle over a contract that was signed in 2018, and a subsequent class-action lawsuit over the terms", "The next Biennial should be held at Brown University in the fall of 2021. The tour will travel to the Museum of Contemporary Art (MoCA) in Los Angeles, the Museum of Modern Art (MoMA), the Whitney Museum of American Art, and more than twenty other venues across the United States.\n\n\nThe Los Angeles County Museum of Art (LACMA), which has been working toward revamping its museum since it was founded in 1976, has released the plans for its reopening under the leadership of architect Daniel Libeskind. The overhaul of the museum’s existing buildings and its reimagined interior will be released as part of an expansion of the 24,000-square-foot museum, which is slated to open in the spring of 2021.LACMA’s new building will incorporate an additional 2,700 square feet of gallery space, a new lecture pavilion, a new public art gallery, and a new visitor entrance on the first floor. The museum will also add 1,200 square feet of outdoor space, a second-floor public gathering area, and a new 7,600-square-foot library. The new venue will be significantly larger than the original, with additional galleries, classrooms, and a theater. The redesign", "The next Biennial should take place in September 2020. The next Art Basel–sponsored edition will take place in March 2021.\n\n\nThe Grand Palais in Paris and the Louvre in New York have announced partnerships that will bring the arts of the West to Paris. The partnership, announced on Wednesday, augurs well for the Grand Palais’s redevelopment plans, which were stalled by the Covid-19 pandemic.“With the Grand Palais’s redevelopment under way, the Parisian art scene has emerged as one of the most dynamic and vibrant in the world,” said Frédéric Malle, president of the Grand Palais. “With the promotion of the partnership between the Grand Palais and the Louvre, the Grand Palais’s artists are among the most sought-after in Paris. This partnership will allow the Grand Palais’s artists to have their voices heard in greater Paris, and further the Grand Palais’s ambition of opening a museum in the city that would show the best contemporary art in the city.”Inaugurating the Palais's new 20,000-square-foot, newly renovated building is the creation of an artist’s", "The next Biennial should focus on ways in which art can be transfigured through art and mass media to affect social change and inspire public engagement.  The next edition will be hosted at the Windstad Museum, in the city of Karlsruhe. The third edition of the biennial will again be held in the United States, May 19–May 22, 2021, and will be curated by Patricia Black. The fourth exhibition will be held at the Museum of Modern Art in New York, May 22–May 27, 2021, and will be curated by Rachel Saul. The fifth biennial will be held at the Institute of Contemporary Arts, London. The sixth will be staged in the West End, London, March 3–March 6, 2021. The seventy-ninth will be staged in the Artsington area of Oxfordshire, England, March 7–March 10, 2021. The thirtieth will be staged in the West Country, Manchester, March 12–March 14, 2021. The thirtieth will be staged at the Museum of Modern Art, New York. The forty-fifth biennial will be held in London. The forty-seventh biennial will be staged at the Museum of Modern Art,", "The next Biennial should take place in 2020 and the first in 2021. Centered around the themes of the fictionalistic epidemics depicted in the classic science fiction novel The Day the Earth Stood Still . The exhibition will examine the relationship between human and anthropological realities through a variety of artistic and social practices. Inaugurating the exhibition will be a discussion with artist Nari Ward and will run from January 29 to March 7. The public will be able to attend the event in two ways: through a live video stream or a physical exhibition space. The biennial will be held in the museum’s new building, which was completed in the summer of 2021, and will be inaugurated by the exhibition “What Is Life?” (2019). The exhibition will be on view through January 30, 2022, and will feature work by artists such as Daniel Avedon, Humberto Campos, and Paul Cézanne and will be the first time the museum has staged an event that takes place simultaneously both inside and outside the museum.Commenting on the building , Molly Vincent, director of the museum, said: “The Biennial will explore the concept of what it means to be human, with the view of", "The next Biennial should take place in 2021 and will be set in an artist studio in New York between February 25 and March 25. The exhibition will be hosted by the New Museum and the Brooklyn Museum and will run parallel to the 2015 edition of the Neue Biennale.The new theme for the event is “Transhumanism and the future of work.” The exhibition will also include a virtual reality installation made with the artist’s own body and will include new works by select artists, including Mark Bülow, Eduardo Barbee, Tobias Carlberg, Michael Howard, and Anna Atkins.Commenting on the selection of the artists for the show, museum director Paul Hahn said: “This year’s show was a celebration of the many transformative and groundbreaking exhibitions that have taken place throughout our museum’s history, and I am tremendously excited to see how these works will be received by the global community. The following artists will be featured in the show’s third section, ‘The Future of Work,’ and their works will be included in the museum’s exhibition ‘The Art of the Electronic Age,’ which will open in January 2021. I am especially pleased to welcome the artists", "The next Biennial should take place at the Royal Academy of Arts on May 6–May 8, 2020, and will focus on the life and work of Alexis de Tocqueville, the American American sculptor whose influential work debuted at the Museum of Modern Art (MoMA) in New York in 1963.The museum has yet to announce whether it intends to move the exhibition.\n\n\nArchitecture and design firm Skarstedt & Skarstedt in New York is suing the University of Chicago over a $250,000 debt incurred by the firm in relation to a new $10 million renovation of the school’s iconic 'The Block,' the building’s main auditorium. The lawsuit—which was filed in federal court in Chicago—claims that the school failed to address the structural problems that led to a severe loss of structural integrity and could have avoided the situation had the university undertaken a more thorough review.“We are confident in the outcome as this case is a textbook example of academic freedom and the principle of institutional responsibility,” said Skarstedt partner Rosemarie Trockel. “At the end of the day, this is a matter of academic freedom, not about the artistic process.�", "The next Biennial should be held at least once every two years and be on a sustainable path. I am still open to suggestions. I would like to see an end to the reign of the monarchy and the opening of an elected presidency. The exhibition, Art: An Ecological Journey, will be held at the Center of Contemporary Art in Nara, Japan from March 13 to March 16. The shortlisted artists are: Amina Alireza, Lara Alkaraby, Tarek Atoui, Bana Alireza, Boumejali Bénétié (Jerusalem), Bridget Oostra, Emma Healy, Lévy Gorvy, Kathrin Koerner, Karen Oostra, Lonnie Rold, Léria Roesler, Mario Roesler, Lara Velotti, Laurie Waitzkin, Ming Wai Chin, Ming Wei Cai, Ming Wai Chia, Natalie Ward, Natalie Windham, Natalie Yallop, Natalie Wils, and Natalie Wallis.", "The next Biennial should take place in 2019. \n\n\nThe Museums Association (MA), an international organization representing the museum professionals, has announced that it will organize a series of exhibitions, talks, and other events to address the rising concerns over the future of museums and other cultural heritage sites in the United Kingdom. The association’s board chair, David Cameron, said: “These are difficult and ever-changing times. We are working hard to think through how we work with art and heritage in order to protect and share it. It may be possible to work together, but only if we all share the same vision. We have been discussing the possibility of a series for some time, and we have been developing a plan for the exhibition of works by artists and curators working across disciplines for several years. The art and heritage biennial will provide a fresh and exciting start for the public.”The proposed exhibitions include “Museums and the Future of Art: A Discussion,” a presentation of works by artist-in-residence and curators J. Krishnamurthy and S. K. Nair; “Museum 3: New Worlds?,” a panel discussion with David Adjay, Tracy Hick", "The next Biennial should be held in 2020. In the meantime, the Biennial Foundation has released the list of participating artists for the event. The full list of participants is as follows:The inaugural edition of the Biennial was held in São Paulo, Brazil, in September 2019. This year’s edition, titled “Interdependence: Contemporary Art in the Twenty-first Century” (i), was organized by the Foundation and the Brazilian Ministry of Culture. The event was attended by more than 250,000 people and featured artworks by sixty-eight artists. \n\n\nThe Whitney Museum of American Art in New York has added seven new works by African American artists to its collection, and the first African American artist to become a master of ceremonies at the institution’s triennial. The museum is also planning to host a master class, an exhibition of works by artists from the Caribbean, and a lecture series.“Whitney’s collection represents a diverse and vibrant landscape of American artists—from groundbreaking works by African American artists to more recent works from artists of color,” said Whitney director Angela Stewart. “In the last two decades, our role has been to open the floodgates for critically engaging with the", "The next Biennial should be about ten years away. “The new landscape of the museum is one of the most exciting developments in the museum’s history,” said museum director Martin B. Silver. “It is a truly exciting time to welcome visitors back to the Kiss. It will provide an exciting new setting for a number of the program’s most popular exhibitions, including ‘The Man Who Knew Too Much,’ which attracted quite a number of visitors, and will be an ideal platform for biennial exhibitions devoted to women artists.”The biennial will also include two exhibitions that highlight the work of a select group of artists that have had significant solo exhibitions in the United States or Canada, as well as “The Body in Art” (2019), “King of the Mirror: Painting and its Specter of the Body” (2019), and “Star Wars,” a special exhibition dedicated to women artists. \n\n\nThe National Museum of Fine Arts (NMA) in Washington, DC, has appointed Melanie Allen as the first director of its new endowment. Allen comes to the museum from the Smithsonian’s National Museum of Fine Arts in Minneapolis, which she has led", "The next Biennial should be held in 2021. \n\n\nNancy Mackey is returning to New York for the 40th edition of the Metropolitan Museum of Art’s (MMFA) Costume Institute, which will run from May 23 to May 27, 2021. Mackey will return with her husband, Carl, with whom she has had a flourishing partnership for more than twenty years. Weighing in at more than 330 pounds, the costume designer recently won the $20,000 Costume Institute Award, which recognizes the best in the industry, and she has also been featured in numerous award shows.“Carl and I are delighted to continue Nancy’s legacy with the MMFA Costume Institute,” said Mackey. “This is an exciting time for us and the costume community as we embark on the next chapter of our lives. I look forward to working with the talented and committed staff and the more than 1,900 guests who will be here to see her costumes in person and to working with the redesign community in New York.”Mackey first became involved with the MMFA through her husband, James Mackey, who was hired as director of curatorial affairs in 1980. His new role required him to shift away from designing for", "The next Biennial should take place in the fall of 2020 and will be curated by Ada Marder. Keenan will serve as the patron of the event, while Marder will work alongside architect and curator Andrea Hlavaty on the design, installation, and installations.The exhibition will feature works by established and emerging artists, including Carneil Bar-Ilan, Christopher Caldwell, Haegue Chan, Zoé Croissant, Diana Foa, Rachael Leigh, Marta Zanche, Jill Snyder, Sara Zober, and Sara Zobert. The 2019 edition featured work by Natalie Brooks, Nancy Bond, Cindy Sherman, Tania Bruguera, and Simone Williams. \n\n\nThe Seattle Art Museum (SAM) has received $12.5 million from the Seattle City Council in support of the renovation, expansion, and expansion of its collection and its collection campus. The funding will also help the institution make the largest gift to date, a $230 million gift to the Seattle Children’s Museum (C.C.M.), and will allow the Seattle-based nonprofit", "The next Biennial should take place in 2020, with an opening in 2021. The next edition will be hosted by the Museum of Modern Art (MoMA) and will consist of fifty-one exhibitions. The theme of this year’s event will be “Time and the Body,” a study of the concept of time as the “embodiment of life.” Previous editions of the exhibition have featured works by artists such as Glenn Ligon, R. H. White, Jean-Michel Blondel, and Jean Luc Moulène.\n\n\nThe Metropolitan Museum of Art announced today that it has received a donation of twenty-seven works by artist Ariel Aarons, who is best known for his sculptures featuring nondescript, half-finished, translucent works. The works, which range from three hundred to several thousand years old, are part of a series called the Aarons Planets and are displayed in the museum’s Science and Industry section, the museum’s Americas wing, and the new museum.“These works are a remarkable continuation of the Aarons Planets series, which explores the ecologies of the earth and the physical environment in a way that is both timeless", "The next Biennial should be held in 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in New York has received a gift of some five hundred works of contemporary art from the late Colombian artist Juan Pérez-Zaragoza, who was a longtime supporter of the institution and whom many of his peers considered a pioneer of the modernist in the art world. David Loughlin, the director of the museum, said that the donation was made in honor of the institution’s long-standing commitment to supporting the work of important Colombian artists, including Zario, Arturo Cervetto, and Dela Garza. Garza’s purchase of the works, which are currently on display in the exhibition “Deu Nueva Espacio” (The Airs of Life), was also notable for its free exhibition format.The gift includes a set of works by Pérez-Zaragoza, Dela Garza, Ezpeitia Roca, and Lúcio Roca, as well as pieces by Pablo Picasso, Michelangelo, Antoine Balsom, Mark Rothko, and others that were not previously on display in the museum. The works were donated by his wife,", "The next Biennial should be a showcase of the work of the new cohort of artists, who will form a new generation of masters. The foundation should foster long-term relationships between the museum and the local communities, and develop new programs. Its staff should explore new areas of artistic production. The museum should expand its collection with works that have never been on display or exhibited before. The foundation should also work to develop a curriculum and a program for the public that reflects the values of the new generation of artists. In addition, it should continue to engage with the local communities through programming that reflects their concerns and interests.In an effort to create a sense of continuity with the museum’s collection, the foundation will hold its next major exhibition in 2020, “Posterhood,” at the University of California Berkeley. “With the opening of the exhibition ‘Posterhood,’ the foundation will continue to take risks in the construction of its collections and to create a rich public experience,” said foundation president and CEO Zoran Jovanovic. “We are grateful to the former directors of the Palazzo della Scala, Roberto Calvi and Michele Cipolletta, for their vision in supporting the foundation over the", "The next Biennial should be held in 2021.”\n\n\nPine-Rich Arts and Design (PRA)’s award program for designers has announced that it will honor three new MacArthur Fellows: Jibz Allen, William Wegman, and A.B. van Haren.The three North Carolinian artists, who are working together as artist-in-residence at the Georgia Institute of Technology (Georgia Tech) in Atlanta, have been selected to receive $2,000 grants\u0097purchased by influential art museums in the United States and the United Kingdom. Allen, a designer based in Chicago, is a winner of the MacArthur Foundation’s $1,000 Lifetime Achievement Award; Wegman is a winner of the $1,500 Lifetime Achievement Award; and van Haren is a winner of the $2,000 Lifetime Achievement Award.Allen and Wegman will each receive $500. Their performances will be included in an exhibition of works by the MacArthur Fellows at the Georgia Institute of Technology. The exhibition will take place in the Georgia Museum of Art, which is currently undergoing a $200 million expansion.The MacArthur Fellows will not be asking for money; they will be choosing an artist to represent", "The next Biennial should be held in the autumn of 2021. The selection committee will make a recommendation to the director of the Biennale, Jürgen Todenhöfer, in December of 2020.\n\n\nThe Brierze Art Museum in Kassel has welcomed artist Tomáš Pankarć as its next honorary director. Pankarć is the first Czech art-historian to lead the institution in more than twenty years. He succeeds Joanna Brierze, who retired after a decade to become the first ever director of the Nationalgalerie in Vienna.“The appointment of Tomáš Pankarć is a great achievement for the Brierze Art Museum. He is one of the few responsible for developing the museum’s contemporary collections and programmes, and for ensuring that the museum remains anchored in the very essence of Czech art,” said museum director Ulrich Hulzenbräck. “He has been instrumental in the development of the museum’s programming in both English and Czech, and has managed to put the biennial together in a way which has remained constant since its inception: Polish and English content. We are very pleased with his achievement and the future of the Brierze.", "The next Biennial should take place in 2020, but there will be a delay of three years because of the Covid-19 pandemic. If the conference hall is still standing at the end of 2020, the 2020 edition will be canceled.There have been discussions about a successor conference for the Biennale, but no decision has been made. The 2019 edition, held in Barcelona, was canceled amid the ongoing protests of the city and government.  Acknowledging the difficulties of organizing a Biennial for a large city such as Barcelona, the organizers of the 2020 edition have said that the event will be organized as a “family affair.” However, the organizers have not listed any specific dates for the event and have said that they do not have any plans to hold the event outside of Spain.\n\n\nThe Museum of Contemporary Art (MoCA) in New York has confirmed that it is planning to close its doors permanently in March 2020. The announcement follows the news that the Mendes’s first retrospective, “The Museum of Modern Art”—which was organized in 1986 and featured work by seventy-nine artists and collectors—was canceled due to concerns over the coronavirus. The move prompted an outcry from arts professionals and activists in", "The next Biennial should have a theme of the life and death of a philosopher. The themes around the Biennial should be: an open and transparent, an infinite, and a non-conceptual notion of the world.There should be a lecture on the philosophical relationship between art and philosophy, and how philosophy can be a form of art. The lecture should be divided into two parts: Part One should be an introduction to the history of art, and Part Two should be a critique of the history of philosophy.The lecture series should be centered on a theme of the life and death of a philosopher, and should start from the idea of philosophy and art and its relationship to philosophy. The themes around the series should be: philosophy and art as an entity, philosophy and art as a reflection of poetry, philosophy and art as a form of poetry, philosophy and art as the landscape in poetry, philosophy and art as an object of poetry, and philosophy and art as a language.The lecture series should be divided into three parts: Part One should address the history of philosophy, Part Two should address the history of art, and Part Three should address the history of philosophy and art.The lecture series should be organized to reflect the Biennial, and should be held at the same", "The next Biennial should be held in 2020.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles announced today that it will reopen to the public on September 25. The reopening will coincide with the opening of the new Biennial of Modern Art, which seeks to advance the understanding of modern art through a combination of exhibitions, lectures, workshops, and other programs.In its first iteration, the museum will hold the first exhibition of Art From Cinema’s “In Praise Of Everything,” an exhibition of films by late Italian director Piero Manzoni, which will be accompanied by a lecture series, an open-air performance series, and a special theatrical event. It will also extend the opening to an outdoor location, and will include a new presentation of work by the Italian artist and filmmaker Vittorio Cipolotti.“When I am asked to create a new institution to represent the modern narrative, I am delighted to open a new chapter for cinema,” said Marc-Olivier Pape, director of the Biennial. The director added that the museum’s renovation and expansion, which took place in a historic building in the City of Angels, Los Angeles, will allow the museum to present", "The next Biennial should take place in 2020 and will consist of eight exhibitions, of which six will be presented by artists from different locations. The first exhibition will be a special series titled David H. Koch: The Beauty of the Personality, and will be presented by the New York–based artist Sajit Ajmer. The second exhibition will be the first of three in the series, and will be titled Avant-Garde: The Beauty of the Body, and will be presented by Jawaharlal Nehru. The third exhibition will be a reflection on Dileep Dutt, a controversial and controversial artist who lived and worked in his studio, and will be entitled The Work of a Painter.The Chennai Biennial was announced on September 3, 2018, and will take place at the Ramnath Bahuguna Stadium in Chennai, India, from October 6 to October 8, 2020.The exhibition will present more than sixty artists, including Tamara Bhanu, Rishi Chaudhari, Terrence DeSousa, and Jumana Dutta, and will address topics such as aesthetics, the body, and art. “This year’s Chennai Biennial draws from", "The next Biennial should address the formation of the new body and the development of an international platform for scholarship. “The exhibition should be a celebration of the international spirit, the creative process, and the influence of the artist on society,” said Elizabeth Drew, chair of the board. “The next Biennial will truly be an international exhibition.” The next year will also see the debut of new works by the collection, including the first three-dimensional exhibition of work by Italian artist Michelangelo Antonioni. The exhibition will also receive a significant gift from Japan, which will provide ¥1 billion ($89 million) in support of the institution.The institution has also received a significant gift from Italy. The country has pledged a total of ¥7 billion ($94 million) for the construction of a new museum. Most of the funds will be used to raise the funds to build the museum and the surrounding area, which is located on the campus of the University of Turin. The funding also includes the restoration of the building, the restoration of the adjacent area, and the surrounding area, as well as the construction of an additional luxury hotel.\n\n\nNew York’s Metropolitan Museum of Art has received a significant gift from Japan: the", "The next Biennial should be in 2020. \n\n\nThe Institute of Contemporary Art (ICA) in Florence has announced its representation of the Italian painter Ocampa Rondinone in the inaugural edition of the Italian pavilion in the upcoming edition of the Artforum. Rondinone's work, titled La Comunità Ligure (de la Comunità Ligure), is part of a series titled Porcelains, which are often a reflection of the local surroundings and the social, political, and economic conditions of the region in which they are set. The nineteen works in the series were produced between 1950 and 1974 and encompass a broad range of media and are often found together in one work.Born in Venice in 1936, Rondinone moved to the city of Piedmont in 1949 where he studied at the Bibliothèque Nationale and the Perrotin before being sent to the University of Piedmont. In the 1960s, he moved to Piedmont with his wife and daughter, a series of prefabricated houses called the Rondinones. In 1976, he began creating his earliest paintings, which are housed in the collection of the Museo delle Papesse in Rome", "The next Biennial should be held in 2022, with the exhibition marking the twentieth anniversary of the foundation.\n\n\n\n\n\n\nThe San Francisco Museum of Modern Art will no longer honor Joan Mitchell with an honorary doctorate in recognition of her contribution to the arts. The institution informed the biennial’s director, Amanda Levin, in a letter dated April 8 that said that the decision was made “after a careful review of the biennial’s history and its long-standing history as a major center for the arts and culture in San Francisco.”Museum director Harlan Berman said that the museum had long considered Mitchell’s work and curating to be “essential to the foundation of the SFMoMA arts and culture mission.” He added: “We are confident that the decision to discontinue her honorary degree is the right thing for the museum.”Previously, the museum had honored Mitchell with a doctorate for her art-world leadership, “The Code: Codes,” which was presented by the American Institute of Art in 2009. The museum also held her first-ever exhibition at the Museum of Modern Art in 2010, “The Code: Codes,” which was subsequently chosen by Cheryl", "The next Biennial should take place at the Museum of Fine Arts in New York in 2021. It is currently unknown whether the museum will reopen as scheduled, and if it will be able to continue with its programming following a catastrophic fire that destroyed much of the Whitney Museum of American Art in New York on March 19.The next exhibition is scheduled for 2020.\n\n\nThe Amsterdam Museum of Fine Arts (MFA) has appointed Harald Suttner as its next director and CEO. He succeeds Peer van Vleuten, who is retiring after eleven years at the helm of the institution, and will assume his post in January 2021. “For a number of years now, Harald has been the driving force behind the MFA’s transformation, from a curatorial-and-performance space that was home to only three exhibitions in the city of Amsterdam and one show in Amsterdam’s largest foreign art museum, the de Vries Museum, to a contemporary art museum in the city that now boasts a permanent collection of more than 1,500 works,” said van Vleuten. “We are deeply grateful for his tireless work to transform the MFA and the museum into an arts center and cultural destination, and for his", "The next Biennial should examine the evolution of the museum’s collection through the twenty-sixth edition, “The Power of Art: Biennials” (2019–20), to be held in the United States in 2021, and is currently in the planning stages.\n\n\nThe Museums Association (MA), an organization representing more than 1,500 UK museums, has published the results of an extensive survey that examined the state of modern and contemporary art and cultural institutions across the UK. The results, which were compiled by the Martha Sullivant-Harris Foundation, are now being released in consultation with the forthcoming biennial “The Art of the Impossible: The Art of Modern Life.”The survey, which took place across eighty museums and five continents between January and May 2020, ranked the seventy-four museums in the UK according to their level of engagement with the general public, their exhibitions, partnerships, and their collections, and found that the museums had performed fairly well in nearly every regard for the period covered. However, the survey found that only 39 per cent of museums had managed to achieve improved financial results for the 2020 fiscal year, and only 39 per cent of museums had achieved improved operating results for the year to date. The", "The next Biennial should be held at the Art Institute of Chicago in 2021. \n\n\nThe Metropolitan Museum of Art in New York has received a donation of fifty artworks from donors including the Arts and Crafts Foundation, the Charles and Lucille King Family Foundation, and the Jennie and Edsel King Family Foundation. The gift includes ten works by artists such as Frank Gehry, Paul Gauguin, and Pierre-Auguste Renoir and three Renaissance paintings by Piet Mondrian.“The Met is a large and diverse institution. We are grateful for the generous gifts of our donors that will make this year’s exhibition season even more memorable with these works,” said Mark Rubenstein, the museum’s director. The works will be on display in the exhibition “The Met in Paris: 1913–1917” on view until November 20, 2021.The donation of the works by the King family came in the wake of a 2017 gift of twenty-six works by the artists Jeffrey and Mary King. The gift was made in memory of their son Brian King, who was killed by a drunk driver in 2018. A spokesperson for the family said: “We are", "The next Biennial should be held in the spring of 2021, with the first edition to take place in the fall of 2022. The editorial board of the International Journal of American Art (IJAA) in New York has awarded the 2019 winner, Jean-Michel Basquiat’s Art of Life, $1.25 million. Set against a vibrant, textured, and shimmering canvas of paper, the piece, which was created in 1968, will be presented at the upcoming exhibition “Art of Life: A Biennial in Madison, Wisconsin,” which will run alongside the upcoming biennial “Art of Life: The Next Generation” and will be on view in the fall of 2022.The 2019 ceremony was held at the Milwaukee Art Museum.\n\n\nHouston’s Alexander Sculpture Park announced today that it will reopen in early 2020 following a $45 million expansion that addresses a number of health and safety concerns and expands its exhibition space. The new building will include a dedicated space on the first floor for its permanent collection and the Alexander Sculpture Park Collection, a new collection of works that are on loan to the city of Houston.“This project is a response to the current crisis as well as a", "The next Biennial should be held in 2022. The theme, “Ai Weiwei: From Elegant to Devastating” will be based on a painting by the artist. The first edition of the biennial, “Ai Weiwei: A Legacy of Man” (2019), was held in the exhibition hall of the Museum of Contemporary Art Beijing in August. The exhibition concluded with the exhibition “Mao Tsetung: The Birth of a Nation.” The second edition, “Ai Weiwei: Beyond Form,” (2019), was held in the exhibition hall of the Central Museum of Fine Arts Beijing and is slated to open in September 2019. The third edition, “Ai Weiwei: Dreams of a New World,” is slated to open in October 2020 and will feature the artist’s avant-garde artworks.\n\n\nThe Bushwick Museum of Art, a New York institution that has staged exhibitions such as “What Is a Girl?,” an exhibition of Bushwick’s earliest surviving photographs, at the New Museum in Manhattan, and “Love, Death, and All That Is,” a 2011", "The next Biennial should explore the history of the exhibition, its curator, and the exhibition’s partnership with the Hirshhorn Museum and Sculpture Garden, which has hosted the exhibition since 1988. With the assistance of curator of the exhibition, Thomas J. Powers, the pavilion will present a selection of works by contemporary artists and organizations in the city to mark the museum’s twenty-fifth anniversary. The theme will be “Making Relationships,” and the selection of works will take place in the vernacular, with the support of the Hirshhorn’s curatorial team, which includes New York–based artists and designers.“Since the biennial began in 1998, the Hirshhorn has exhibited more than 2,500 works by contemporary artists, including Amara Dayal, Maira Gebre, and Nina Sutch,” said Leslie Beasley, director of the Hirshhorn. “This year’s selection is an extension of the Hirshhorn’s commitment to contributing to the history of language through exhibitions, public programs, and educational initiatives. We are most excited to welcome John D. and Catherine K. Smith into our family. Their", "The next Biennial should be held in the coming months. “I have been a trustee of the W.M. Keck Foundation for more than twenty-five years and have enjoyed working with the foundation. Now I hope to continue to contribute to the Foundation’s mission and to increase its scope through programming that engages the public and the community,” said Ann. As a board member of the foundation, she established the W.M. Keck Foundation for the Arts as a vehicle for biennial projects that address critical issues facing contemporary art and the visual arts. In addition to its parent organization, the W.M. Keck Foundation for the Arts, the foundation has numerous co-chairs, including Chris, James, and Laurence, who are also among the trustees of the foundation. The W.M. Keck Foundation for the Arts is headquartered in Ocean View, California, and organizes more than sixty events annually. The institution is currently planning to hold its next annual retreat in Hawaii and is working to develop a new biennial exhibition in collaboration with the W.M. Keck Foundation for the Arts.\n\n\n\n\n\n\nAlberto Rosales, the director of the Museo de Arte Contemporáne", "The next Biennial should be held by the end of the year. Until then, we would like to emphasize the importance of our international collaboration with the newly created board of the National Museum of Contemporary Art (MoCA), which will include representatives from the Arts Council, Art Gallery International, and the Contemporary Art Museum Stuttgart. We are also working on a long-term plan for the development and exhibition of a new collection of contemporary art, curated by Hanns Karlsruhe, that will be organized under the leadership of Hanns Karlsruhe’s daughter, Annamaria. In addition, we are actively seeking partners for exhibitions and other programming.”\n\n\nNew York artist and educator Maha Pollak, who often explored the role of science and technology in our daily lives, has died at age eighty-nine at her home in Manhattan. The American Folk Art Museum, which was founded by her and her husband in 1971, named her as a founding member, and she served as a board member of its board of advisors. Pollak’s work is often compared to that of American artists such as David H. Koch and Steve Jobs. She often drew inspiration from configurations of light and trace lines in daily life, emphasizing the", "The next Biennial should be held in the autumn of 2022. \n\n\nThe British artist Andy Warhol has died at age eighty-three at his home in Washington, DC. His last words: “I’ve never been more at home, I’ve always been more at ease.” Over the course of his career, Warhol sculpted and painted portraits of women, animals, and people that are often naked, often in front of their own bodies, and depicted their bodies in exaggeratedly lifelike ways that also offer glimpses into their inner lives. Born in London in 1928, Warhol studied under John Galliano at the National Gallery in the United States, where he learned to use a lathe and charcoal. In 1948, after graduating from St. Paul’s College of Art and Design in London, Warhol moved to New York, studying with Robert Irwin, Peter (Pete) Antonacci, and Jean-Michel Basquiat. He then relocated to Hollywood, where he continued to work on his home deco. Life began to change for Warhol when he began photographing women in their beds. In 1967, he traveled to Paris to study the work of Michelangelo Antonioni,", "The next Biennial should take place in 2022.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Kate Berlant as its new executive director. Berlant comes to the institution from the Metropolitan Museum of Art, where she has helmed the museum since 2002, and will assume her new responsibilities on September 4. Her first order of business will be to select a new director.“At this pivotal moment in our collective history, we are thrilled to welcome Kate to the museum and are confident that her passion and energy and ability to inspire and deliver will ensure the museum’s continued success, both now and in the future,” said Museum Director Christopher Knight. “Her tenure and achievements will help define the museum’s role as a critical resource for generations of artists, and demonstrate her ability to bring the museum’s diverse collections and collections-of-the-year together in a way that will make a difference for future generations.”\n\n\nThe German city of Cologne, which has been dealing with a surge in COVID-19 cases since mid-March, euthanized one thousand animals in one day on Thursday, March 16, the first day the coronavirus was officially identified", "The next Biennial should take place in St. Petersburg in early February 2021 and will be presented by the Haus der Kunst, Stuttgart. The biennial will also include a special exhibition, “The Physician,” which will be organized by the Museum of Contemporary Art, New York, on February 13–March 7.\n\n\nAfter a campaign of nearly four years, the artist-run space in the heart of Brooklyn, the Brooklyn Museum, has reached a deal with the borough government to sell the iconic John Daniel Jefferson building, which houses the museum’s contemporary art collection, to the private sector. The arts center announced the news in a statement on Friday, March 3, and the acquisition marks a milestone in the institution’s history, as it becomes the third institution in the city to sell its historic building, after the Museum of Modern Art and the Museum of the City.The deal, which will be announced in the coming weeks, will see the museum acquire the historic building through a combination of private investment and governmental sales. The deal is estimated to total at least $500 million and will see the museum move to a new home in the city’s historic Eno building, which will host a new pav", "The next Biennial should be held at the National Museum of the African Diaspora (NMAD) in Birmingham in 2022, after which the venue could move to the National Gallery of Art or the Barbican Art Gallery, London, or the Walter de Maria Art Museum in Miami, Florida. The selection committee for the 2019 edition of the Milan Biennale, comprised of representatives from the Milanese arts, architecture, design, and design agencies AGAD, DIGAMAR, Galerie Lelong, and the Jugend Rettbund, chose the latter option because it would involve a joint project between the two institutions.“The Dublin edition of the Milan Biennale is still in danger of being cancelled due to the ongoing crisis in the Middle East,” said Marta Ottaviano, director of the Milan Institute for Contemporary Art (MIAC). “The upcoming edition of the Milan Biennale will be a crucial opportunity for the artists and organizers of the event to reflect on their practice, to consider the currently existing art, to reflect on the future, and to reconsider their lives and their practices.”The Biennale is considered the benchmark for contemporary art, drawing an audience of artists and art world professionals from", "The next Biennial should focus on the work of the first-ever artist-in-residence at the School of the Art Institute of Chicago (SAIC) and, as such, will include a lot of work by artists who have been active in the cultural scene for some time. Its inaugural exhibition is a retrospective of the work of Guy Garçon, which will also be shown at the institution.\n\n\nThe German Federal Association of Fine Arts (BDF) announced today that the cycle of exhibitions, residencies, and performances that celebrates its 125th anniversary this year will now be held in three phases.  “The first phase will be a celebration of the period from May 20, 1892, to May 20, 2021, and will focus on the cultural and economic developments of that time,” said general secretary Sabine Schipper. The event will be organized as a symposium that will include presentations by artists, intellectuals, writers, and other cultural figures. The theme for the first exhibition will be “Chronologie,” and will be titled “Germany in the first half of the twentieth century.”The second phase, to take place from March 19 to March 21, 2022, will focus", "The next Biennial should take place in 2022.\n\n\nAmerican artist Richard Anuszkiewicz, whose practice spans sculpture, painting, performance, and performance-based work, has died at the age of eighty-two.Born Richard Gere in New York City in 1942, Anuszkiewicz earned his bachelor’s degree from the Museum of Modern Art in 1945 and his master’s degree from the University of Pennsylvania in 1948. In the late ’50s, the Brooklyn-born artist moved to Chicago, where he studied with artist Carl Kahl and began working with the Chicago-based firm of Dennis Coupe and John VanderMeer.In 1977, the duo released their first conceptual work, Splinter, which represented a symbolic link between the pilgrimages of the artist and the Gospels. The following year, Anuszkiewicz’s wife, Evelyn, and Kahl began the process of separating the artist from his art. In 1987, Evelyn died; in 1991, Richard became the focus of a major retrospective at the Museum of Modern Art in New York, which explored his career and his relationship to the company. In 1994, the family relocated to Los Angeles, where he has resided for the past thirty", "The next Biennial should take place in Tokyo in 2022 and be hosted by the new museum, which is being developed by the Tokyo Metropolitan Government. The biennial will also feature the works of Brianna Bennett, Sohail Al Qasimi, and Kristina Helberg.The next iteration of the Venice Biennale will be held in 2021. The event, which will be hosted by the Museo d’Arte Contemporáneo, will focus on Cassandreo’s Italian Renaissance paintings, the work of the contemporary artists in Italy, and the year of the Italian Renaissance. The Venice Architecture Biennale will focus on the architecture of the Renaissance and the role of design in art and architecture, with the exhibition scheduled to open in 2020.“With the inception of the new Museum of Modern Art, the Venice Architecture Biennale is reborn, reconceived and restructured into a multidisciplinary agency,” said Joana Trifull, director of the Museo Arte de São Paulo (MASP), and the Venice Architecture Biennale. “This has great implications for how we think about art and architecture and for how we will think about architecture and art.”The institution will be restruct", "The next Biennial should be held in the Spring of 2020, when the renovation of the Museum will be completed.\n\n\nThe National Gallery of Scotland has received a major boost in funding to $3.5 million following the completion of a $1.5 billion expansion and renovation project. The £1.5 billion project, which added more than 2,500 galleries, theatres, libraries, and other spaces, and raised the museum’s attendance figures, also saw the opening of new galleries, a new exhibition space, and the refurbishment of the museum’s existing building.The National Council on the Arts (NCA) and the Scottish National Heritage Trust (SnH), which jointly put the expansion together, said the £1.5 billion investment is a new milestone in the history of the National Gallery of Scotland. It is the largest public investment in the museum’s history and will provide the foundation for future visions of the museum.The National Gallery of Scotland’s current building, which was completed in 1953, has been renovated by the NCA and the Scottish National Heritage Trust. The latest plans for the museum, which is located on an additional 1,400 acres in Aberdeenshire, included the expansion of the museum�", "The next Biennial should be held in 2022. The museum’s Board of Trustees will decide upon the date as soon as the director of the museum, Yayoi Kusama, is invited to Japan to lead the first exhibition in the new venue. On February 19, 2020, the museum opened to the public via a video link from the Museum of Contemporary Art Tokyo. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is launching a new digital platform that will allow the public to listen to and explore more than one million hours of audio, visual, and video content produced by the museum. The program, called the MoCA Podcast, will debut on March 20 and will feature interviews, performances, and videos by the museum’s ten artists.“This is a moment of profound change for the arts and I’m excited to see how the MoCA Podcast will engage with and expand on these changes,” said Michael Heimann, the museum’s artistic director. “I’m hopeful that the MoCA Podcast will become a powerful and useful tool for promoting and sustaining art in our city and region.”The platform will allow museumgoers to log in to view the artist’", "The next Biennial should take place in 2020. The Los Angeles County Museum of Art’s plans to hold a second iteration of the exhibition in 2021 have been put on hold due to the Covid-19 pandemic. The Maryland Institute College of Art (MICA) in Baltimore has announced that it is also delaying its 2020 edition, which was originally set to take place in March. The museum is calling for everyone to stay home’s March 29–March 31. The Biennial is planning on reopening in early 2020. It remains unknown when the Biennial will return. When asked about the delayed event, the museum said: “We will continue to evaluate the many factors that affect the health of our guests and we will make every effort to re-invent the biennial experience for our guests. We are excited to re-open to the public and see what all the fuss is about next year.”\n\n\nThe Guggenheim Museum in New York has appointed Michael Hauptman as its next director. Hauptman has been a part of the institution since it moved from its former home on East Seventy-Third Street in 1984, and has served as deputy director of public programs since 2009. He", "The next Biennial should be held in 2019 and will be entitled “The Future Is Present.” The exhibition will feature works that will be selected by a committee led by the curator of ceramics, Alana Bruguera, and will be presented by the artist. The biennial will extend the collection’s international reach.Bruguera said: “I am really excited about this digital platform, as it will be able to present in real time the works that the artist has selected and it will be able to be accessed by anyone from anywhere in the world. I am convinced that the exhibition will be a success on the basis of its innovative programme of presentations and exhibitions, and that it will become a model for future exhibitions.”\n\n\nThe Museum of Modern Art (MoMA) has released the list of seventy-eight artists who have received grants for their work in the 2016–17 academic year. The seventy-eight artists were selected by an international jury that included Gabriella Dalles, a curator at the New School in New York; Kammie Ruck, a curator at the Brooklyn Museum; and Joel and Edna Rubell, artists in residence at the Museum.Each artist received $1,", "The next Biennial should kick off on May 5 and run until June 16. For the 2014 event, the first question posed was “What is art and what is not art?” The answer came back: “Art is everything.” The festival’s curators stated that the answer was not clear to them until the very end of the exhibition, when a question related to the meaning of the word “art” was answered. Michael Knight, the director of the Brooklyn Museum, told the New York Times that “This is a moment of tremendous change for our culture.”\n\n\nThe Museum of Modern Art (MoMA) in New York has announced that it is launching the #MoMoMoDeliver, a monthlong celebration of the past, designed to draw a mix of current and former employees and visitors. Titled “One Month of MoMo,” the public art project will feature works by forty-six artists, including Aphex Twin, Kelly Reichardt, Anish Kapoor, Nari Ward, and Tula Lotay, and will run from March 22 to March 24.“MoMoMo Deliver’s themes are universal, evocative and personal,", "The next Biennial should be on Saturday, March 22, 2020, and will then return the first weekend of March 24–March 26, 2020, to the biennial. During its opening weekend, the biennial will stage fifty exhibitions, including retrospective of work by Antony Gormley, the artist who inspired Sir Stuart Loewy to create the modernistic theme park in the evening sky, which opened to the public in 1999; an exhibition of twenty-two works by contemporary artists, including Andy Warhol, Tazio Lahti, and Rayyane-al-Khaleq; and a talk by artist-activists Langston Davis and Lisa Marie Oostra. The Biennial will also hold exhibitions in April and June, and will include a meeting of the thirty-ninth Royal Academy of Arts, the twenty-fourth Royal Academy of Arts, and the twenty-fifth and twenty-sixth Royal Colleges of Art and Design. The pavilion will be inaugurated with a special exhibition of the work of twenty-eight artists, including Oram, Rirkrit Tiravanija, Subhash Kapoor, and Sohrab Moghul. The exhibition will be followed by a three-day retrospective of the work", "The next Biennial should be held in 2021 and the opening date of the exhibition should be changed. Octavio de Goya’s masterpiece The Daughters of Art**will be presented in 2022. The exhibition will be staged at the Museo de Arte Contemporáneo de Madrid (MASM) and will feature works by twenty-four artists.The institution will also be able to point to a number of curators who have specifically worked on authenticating the work of the Spanish National Museum in Madrid. Among the nominees are María Berrada (São Paulo), Ana Mendieta (New York), Ana Miranda (New York), and Anselm Kiefer (New York). The Biennial of Minimalism will also include a special exhibition of work by the late American artist Thomas F. Manley, whose work was featured in a retrospective of his in New York in 2015. The biennial will be held from November 7 to November 9, 2021. The exhibition of the work of Luis Saavedra, whose work was included in a retrospective of his in 2018, will also be included in the biennial’s début. The exhibition will be on view November 7–November", "The next Biennial should be held at the Museum of Modern Art in New York, with an opening in Paris in 2022.\n\n\nAfter years of planning and numerous iterations, the Carnegie International, a yearly gathering of modern and contemporary art, will finally take place in Helsinki, Finland, beginning October 4. The event will be led by award-winning curators Lisa Lødahl and Joanna Konrath, whose collaborative and international curatorial practice spans painting, sculpture, photography, performance, and performance-based art.“It is a profound honor to be chosen as the next president of the United States of America,” said Lødahl. “We are thrilled to be working together with our partners at the Palazzo di Beppo and with our permanent partners at the Museum of Modern Art in New York to launch a new chapter of the show. We are confident that we have created an exhibition that will redefine what a contemporary art event can be for art lovers and art lovers only and will make it a landmark event.”Lødahl and Konrath are the founders of a new nonprofit that will be charged with organizing and hosting the show in the Netherlands in collaboration with the institution’s board of directors,", "The next Biennial should take place in late February, and will be open to the public. The theme for this year’s event is “Social Justice: From the Margins to the Center.” The theme of the twenty-fourth edition of the Biennial is “Freedom of Expression.” The 2019 edition, “Freedom of Expression: From the Margins to the Center.” will be held in April.\n\n\nAfter a controversial art installation at the Museum of Contemporary Art (MoCA) Los Angeles (MCA) was closed for more than two weeks due to concerns related to Covid-19—the novel coronavirus has since spread to other cities in the United States—the institution issued an apology. In a statement on Thursday, the institution said that it made the decision “in the interest of artistic integrity” and that it “cannot and will not knowingly appear to be facilitating the spread of Covid-19.”Covid-19 is a viral illness caused by a coronavirus known as CRS-19. It is spread mainly from person to person, but can also be contracted from close contacts, such as through coughing or sneezing, and can", "The next Biennial should be held in the autumn of 2022. The artist will be given the opportunity to present her work at the upcoming publication, Art in the Balance. The exhibition will also feature works by the likes of Alice Aiken, Kim Gordon, Stephen Lynch, and Paul Chambers.A revitalized London’s Tate will also host a new exhibition of work done by the artist’s contemporaries. The show, titled “Sensations From the Body,” will begin on September 9 and will run until November 29. \n\n\nThe Royal Academy of Arts (RA) in London announced today that the museum’s new director, Zino M. Bjerggaard, has been appointed as its new chair of contemporary art. Bjerggaard, who has helmed the academy since he took up the post in July 2020, will assume his new role on October 25. Bjerggaard succeeds Ian Aycock, who departed in the summer of 2021 to become director of the Greenwich Village Art Gallery, and will assume his responsibilities on November 2.“Zino M. Bjerggaard has been instrumental in bringing the RA to its current position as the leading contemporary art museum in the United Kingdom", "The next Biennial should be the quintessential celebration of the centrality of art in the lives and works of the artist’s neighbors and co-workers, as well as their lives and works. The building of a new temple dedicated to the artist is the main objective of this year’s Biennial. We ask that you continue to support the museum’s mission and its artists. The upcoming exhibition “Beyond the Present: Contemporary Art in the Twenty-First Century” will address the centrality of art in contemporary life and will be held at the National Museum of Art, Washington, DC in September.\n\n\nIn celebration of the seventy-sixth Anniversary of the New York Public Library (NYPL), the institution has unveiled the first design of its new flagship building, the New Library, set to open in 2021. The design incorporates three elements from the neighborhood, including a public courtyard, a public stairwell, and a public gallery.“The New Library’s design aims to be both a living and expansive public gathering space, combining the library with the community and the art world in a way that is connected to the city, and to be self-sustaining,” said James T. Sweeney, architect and", "The next Biennial should be held in 2021 and the exhibition should be completed sometime in 2022.\n\n\nThe Astrophysical Journal has published a paper in which physicists at the Massachusetts Institute of Technology (MIT) and the California Institute of Technology (Caltech) have devised a new way to study the structure of dark matter and its interaction with other matter by studying the interactions of matter and matter only in the \"centre\" of galaxies.The research, which was led by Andrea Stricker, a physicist at MIT and a co-author of the paper, has implications for understanding how dark matter interacts with the rest of the universe and how dark matter might interact with the rest of the universe.The two papers, published in the December 2017 issue of the journal Science, propose that a new way of looking at the matter in galaxies is needed before we can begin to model how the dark matter in these galaxies might interact with the rest of the universe. Stricker and his collaborator Ruarat Chakravarty have now applied the gravitational effects of matter in the centres of galaxies to the dark matter in the centres of galaxies.“The experiment involves the scattering of light by one of our telescopes at the Large Synoptic Survey Telescope (LSST) in Chile. In doing so", "The next Biennial should be held in 2021. http://architecture.faq.net/index.php?title=Articles&id=150&art=1\n\nCulture Minister Atsushi Onyewuenyi and the National Museum of Fine Arts in Tokyo announced that the Frieze Japan Fair will not take place this year. “We are deeply concerned by the current situation,” Onyewuenyi said. “The exhibition was created as a platform for international artists to demonstrate their concerns for the future of the curating profession in Japan—it is not a platform for the exhibition of their works—and we are conducting a thorough investigation into the exhibitors.”The announcement followed the announcement of a proposed change to the National Museum of Fine Arts in Tokyo, which is currently undergoing a major renovation, that would have seen the museum become a more of an art museum. The proposal was presented by Abe, who was reelected to a second term as prime minister last April. The National Museum of Fine Arts in Tokyo, which is scheduled to reopen in 2021, has faced several delays, but it is currently planning to open in 2021 and has launched a competition to select a new director", "The next Biennial should commence in 2022, and could see the first works completed by the artist in the United States.\n\n\nThe Danish curator Lars-Erik Neudecker, who was recently appointed the first director of the Museum of Modern Art (MoMA), has announced that he plans to step down from his post on January 8, 2020. All the while, Neudecker has been working on a new, eight-year-long project, “Lisbon: From Filth to Truth,” that will explore the artist’s influence on the city of Copenhagen, and will showcase the work of twenty-eight artists in the city.Born in 1968 in Copenhagen, Neudecker came to the United States to study at the University of California, Los Angeles (UCLA), where he earned his master’s degree. Upon graduating, he relocated to Los Angeles, where he worked as an independent curator for five years, before moving to MoMA in 2011.A former curator at the Burroughs Museum of Art in London, Neudecker curated works by French and American artists in the 1990s, as well as by Peter Cook and Pierre-Auguste Renoir. He also curated works by Piet Mondrian, Gert", "The next Biennial should kick off with a series of performances by the Chicago-based artist Vanessa Joy James, who has a long history of staging installations and performances that address concepts such as identity and power. The exhibition should also include a documentary, a virtual reality work, and a performance by the Chicago-based artist, choreographer, and lyricist Eline Conrad. The winner of the prize will receive a $50,000 cash prize and a solo exhibition at the museum. The Chicago-based artist will be presented with the award during a ceremony at the New International Art Museum at the Smithsonian American Art Museum on Saturday, Oct. 8.\n\n\nLondon’s Tate Modern has received a donation of twenty-two works by artists from four continents in a significant donation made on behalf of the institution in an exhibition that opened on Monday, October 5. The works—which are being organized under the title “Permanent Violations”—compiled by artists such as Alexander Calder, Édouard Vuillard, and Alice-Lynn Mann, and will be on display in “Detention,” a new exhibition that examines the impact of detention in the United Kingdom.The Tate has made the donation in recognition of the work and the work", "The next Biennial should feature an interdisciplinary team of curators from the contemporary and historical realms: Willem de Kooning, Elin Estlund, and Sveinu Larsson; a selection from the exhibition “The Embedded Muse'?” that was organized in 2015; and a “quadrature” exhibition that was organized in 1992–93, before the collapse of the Soviet Union, and which, in the words of the artist, “was a personal expression of my own experimentation and exploration.”The new program will be curated by Nanna Mårkarnia, who has served as an artistic director of the Swedish Museum of Modern Art (Skull and Bones) in Stockholm, and Brendan Rodgers, the chief curator at the Museum of Contemporary Art Los Angeles (LA MoCA), and will run from September 16 to September 18. According to the Los Angeles Times, the new format is reminiscent of the group exhibition “2+2.” In fact, the upcoming exhibition will be a revised and expanded version of the show “3+3.”\n\n\nThe team behind the wildly popular museum in Vienna, the FELP Museum, has announced that it plans to close its doors", "The next Biennial should take place in 2021 and the exhibition should take place between February and March. The 2020 Art Biennial will be held at the Museo del Barrio.\n\n\nThe J. Paul Getty Trust announced today that ten artists were selected to participate in the 2020 edition of Art Basel Hong Kong. In addition to the artists chosen by a jury comprising artist, curator, and curator Huajirae Eri, the trust also announced that two more artists will be added to the 2020 showcase, which will take place in the city between September and October. The artists chosen for the event are Jody Rogac, who will create a new work for the gala; Li Ruoxin, who will present a solo exhibition at the same venue; and Bao Huaiwei, who will present a solo exhibition at the same venue, later this year.The biennial also established a new prize, which will be awarded this fall, for the best new work in the exhibition “Travels in Space.” The prize program will award an additional $2,500 to submissions this fall. A jury comprising artists, collectors, artists’ agents, and judges of the Art Basel Hong Kong exhibition will select the winners, which will", "The next Biennial should take place in 2 years at the latest, and should be a continuation of our efforts to present contemporary art to the world in Tokyo as well as to engage with local and international artists and their studios.The idea of the new biennial arose from the idea of a new exhibition for the first Tokyo International Biennial in 1992, which was organized in the former Hiromasa-ya building on the south side of Tokyo. Since then, we have had a number of exhibitions organized and staged at the Hiromasa-ya building, but these have always been behind-closed-doors exhibitions, and rarely have we had a public event at the institution. \n\n\nNew York’s Metropolitan Museum of Art (MoMA) is planning to open a new three-story museum in the Bronx in 2021. The museum will be named the Met-ro, after a building in the Met-American, which opened in 1805 and moved to its current Fifth Avenue location in 1993, and will boast twenty-two rooms designed by architect David Johns. The museum’s inaugural exhibition, “An American Odyssey,” will open in the museum in 2021. The show will highlight works that demonstrate American art from the nineteenth century to the", "The next Biennial should be in 2021, followed by the next in 2022, and the first in the year 2023. The 2020 edition was held in the museum’s courtyard; the 2021 version at the Pérez Artístico. The institution also plans to add a new location for the 2020 event, which will be held in the city of Santiago, Chile, in 2021.\n\n\nTucson Art Museum and Gardens, an independent organization headquartered in Tucson, Arizona, announced today that it now represents the work of nineteen artists from Mexico City, Los Angeles, and other cities in Southern California. The gallery, which has locations in Tucson, Los Angeles, and New York, will begin presenting the works in the United States in April.“In recent years, artists have been working with the Tucson Art Museum and Gardens to create new works for their collections and for the Tucson Art Museum and Gardens, and we are honored that these works will be presented in Tucson, Arizona, in April, 2021, the first exhibition of their works in America,” said museum director Agustín Arteaga and curator Yasmina Barba. The artist-in-residence program, which pairs artists with the Tucson Art Museum and Gardens", "The next Biennial should be launched in 2021\n\nThe National Museum of Australia’s new research-and-adventure center aims to provide audiences with new and exciting media for their entertainment and to engage with the nation’s past. The institute—combining contemporary art and history in a contemporary setting—will be inaugurated at the Museum of Contemporary Art Melbourne on February 18 and will run until March 15, 2020.The new venue will be located in the city’s historic Art Gallery and will host a number of programming initiatives, including a lecture series, a symposium, and a photography show. Exhibition spaces will also be significantly expanded, with an expanded collection hall, galleries and a new Botanic Gardens. The Botanic Gardens will be inaugurated in January 2021 and will also host a number of exhibitions, including the inaugural Australian Museum of Contemporary Art (AMC) show “Photography and the Future of Art” and “Photography and the Future of Art” (2019).“Until now, the National Museum of Australia has remained sheltered within the Australian Art Museum,” said Neil Gaiman, the director of the National Museum, and the National Gallery of Fine Arts. “Now that the National Gallery is", "The next Biennial should be held in 2020. Currently, the project and exhibition is funded by the Fondazione Biennale di Torino. The inaugural exhibition will be on view until November 29, 2020 at the Palazzo Arsenale, located in the town of Milan. The upcoming edition will be held in October 2021, with the opening of an exhibition of work by artist Gino Zingaretti in the November 18–November 20 edition of the New York Times. The project is supported by both the Fondazione Biennale di Torino and the Italian Ministry of Culture.\n\n\nThe Museum of Modern Art (MoMA) in New York has released new guidelines for the display of artworks in its annual “DB Museum” show, “The Body and the Art.” The quarterly event, which features works by forty-six artists and is organized by a committee comprising Patricia Celani, curator of contemporary art; Doris Bihr, director, curator of modern art; Kathryn Clark, director, curator of contemporary art; and Tod Williams, director, curator of contemporary art.“While we recognize that the exhibition represents a significant milestone in the artist’s", "The next Biennial should be held in 2020. To stay informed about the 2019 and 2020 editions, we invite you to follow us on Twitter or like us on Facebook.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is working with the National Park Service to preserve more than 5,400 works by African American artists, including Harriet Tubman and Thomas Dixon. The organization is requesting the public help in identifying the works by artists of African ancestry through a crowdsourcing project, which will offer users a limited number of clues as to their heritage.“We are thrilled to partner with the National Parks and the National Park Service to provide a platform for these important works to be remembered and enjoyed for generations to come,” said museum director Klaus Biesenbach. “By identifying and highlighting these works, we hope to gain insight into the communities they represent and inspire future generations to study, appreciate and share their stories.”The National Black Museum (NBMs) in Cleveland is also working to preserve more than 1,500 works by African Americans. The institution is asking for your help in identifying approximately 1,500 works by African Americans who are still in existence through a crowdsourcing project that will run from November 22 to December 21. �", "The next Biennial should be held in 2020. The exhibition will be hosted by the Institute of Contemporary Arts and in partnership with the Norwegian University of the Arts. The theme, “The future of art,” will be the theme of the fourth Biennial. The exhibition will focus on the artist-built environment and will explore the relationship between art and climate change. The biennial will be a “small but significant step in the process of creating an exhibition space that also represents a homeland for the arts in the city of Oslo.”The project is supported by the Norwegian Ministry of Culture and the Norwegian Arts Council, and is organized by the Norwegian Cultural Foundation (Næringskvart), the Norwegian Institute for Contemporary Art (Nilskvart), and the Norwegian Institute of Modern Art. The exhibition will open on October 25.\n\n\nA new partnership between Southbank Centre and the National Portrait Gallery in London has been announced, raising the stakes for the final stages of the Linbury pavilion, which was staged earlier this year. The event was meant to take place in April but was postponed due to the Covid-19 pandemic, and will now be held in May. Southbank is", "The next Biennial should be held at an appropriate time and in a way that will allow people to experience the art and architecture of the Far East in a timely manner. The work of the artists of this year’s exhibition will be a representative selection of their works in a manner that will be free of any artificial restrictions or preconceptions. The exhibition will be staged in the venue of the former Nagoya City Hall, which was inaugurated in 1889 by the first Japanese emperor Toru Nakayama, and will be organized as a series of projects. The exhibition will be organized as follows: September 26 and September 29When: September 26-September 29Asper Art Gallery 30 Rockefeller Center, New YorkThe next exhibition of art will be held at the Museo de Arte Contemporáneo in Madrid, which has been converted into a museum for contemporary art, on November 22. The show will feature works by artists such as Hiroshima Kiichi, Kanata Inoue, and Hiroshi Tsuda.According to Artnet, the operator of the center, who was appointed to the position by president Jose Luis Zapatero, is looking forward to the new role. He", "The next Biennial should take place at the museum in 2021. \n\n\nThe City of Santa Monica has received a $500,000 gift from the Albright-Knox Art Museum in New York. The donation, which was made in recognition of the institution’s new partnership with the Los Angeles County Museum of Art (LACMA), came in the form of the Albright-Knox Masterpiece Series Award, which was created in honor of the institution’s new partnership with the LACMA Museum of Art.Announced in April, the third annual Albright-Knox Masterpiece Series Awards were established by the Albright-Knox Art Museum in partnership with the National Council of the Arts and the Museum of Modern Art to honor the city’s artists and to further encourage their work. To date, the awardees have received $5,000; $2,500; and $1,500. The museum received a total of $15,000 as well as a total of $18,000 in prizes for conservation and preservation.“The city of Santa Monica has received this year’s Albright-Knox Masterpieces Award at a time when the museum is reopening to the public, and the", "The next Biennial should be held at the newly renovated Guggenheim Museum in New York in 2022, with the show to take place in the new 50,000-square-foot São Paulo Centro Museo do Brasil. The biennial’s founders, Beatrice Fico and João Oiticica, indicated that the choice of venue was not controversial. They cite the Guggenheim’s extensive work on the exhibition’s history as one of the reasons for the move. “The biennial is an expression of the creative impulses of Brazil,” the artists said. “We wanted to create the opportunity for discussion and reflection with a Brazilian perspective and have the opportunity to show how the art of Brazil has a deep, global impact on the world.”\n\n\nThe Museum of Modern Art (MoMA) in New York has added two new members to its board of directors: Chris Sacca, whose practice focuses on contemporary art, and Audrey Nelligan, a curator and editor who has served as the director of the Museum’s public art program for the past three years. In addition to serving as a board member, Sacca also serves as the director of the Whitney Museum", "The next Biennial should take place in 2020 at the Institut des Beaux-Arts, Paris. The program will be based in the Museum of Modern Art, New York, and will consist of a series of exhibitions, performances, lectures, and residencies that will be curated by Kirsten Johnson. “Our show will reflect the life and work of the artist and present a new way of seeing the world,” Johnson said in a statement. “The artist has always defined the museum’s role: to present his work in a show that is in service of the public, in service of history, in service of the community, and in service of the city of New York.”\n\n\nArt historians, scholars, and curators who are boycotting the Fifty-Ninth Venice Biennale in protest of its exclusion of Palestine artists are being prosecuted, and some have even been imprisoned, according to the Art Newspaper.According to Le Monde, the prosecution of the twenty-six activists who were arrested for participating in the action against the exhibition, titled “Allegiance to Palestine”\u0097a show centered around a band of Palestinian artists whose work was included in the exhibition\u0097was suspended on January 4", "The next Biennial should be held in 2022 and the theme will be “The Future Is Present.”The first exhibition in the series, “The Dream of Architecture,” was staged at the museum in 2012 and featured works by fifty-three artists, including Pierre-Xavier Hufkens, William Kentridge, Oscar Pareja, and Ersal Ozdemir. The second show, “In Praise of Art,” was held at the Munich Art Museum in 2017, and “Ajaz Atilla: The Artist’s Life” was presented at the Kunsthalle Basel in 2018.\n\n\nThe National Endowment for the Arts (NEA) has released guidelines for the distribution of $6 billion in funding from the landmark bankruptcy bankruptcy reorganization bill, the $1 trillion CREW Act, to “nonprofit, artist-led organizations’ that have been accredited as nonprofit by the Department of Education, Labor, and Pensions (DOL).”The NEA will distribute $3.5 billion of the funds, which were allocated for “reimbursement of payments made to the artists” and will direct $2.5 billion", "The next Biennial should be announced shortly. \n\n\nThe California Council on the Arts (CCA) has released guidelines for how the state should respond to the coronavirus and its consequences, including how to prevent the spread of Covid-19 and how to manage social distancing for artists and cultural workers.The guidelines, which were drafted by the agency, the California State Conference of Arts and Cultures, and the California County Directors Association, were released on June 8 and were adopted by the California Democratic Party, the California Family Farmers Union, and several other groups. “The public health and safety of our community are paramount; the CACCA strongly urges the Governor to swiftly enact emergency funding to protect vulnerable institutions and families,” said Scott Wiener, executive director of the California Community Foundation (CCFA), which represents artists and cultural workers in the State of California.The guidelines outline the best means of reducing the spread of Covid-19, which has been linked to more than 200 coronavirus-related deaths in the US, including that of Tamir Rice, the 12-year-old boy who was killed by a Cleveland police officer in 2014, and the best way to prevent social distancing for artists and workers. They also outline", "The next Biennial should come in 2021.\n\n\nThe museum that chronicled the cusp of the civil rights movement in Atlanta has received a gift of $270,000 from the Hasidic community. The donation was made by several thousand individuals and groups in collaboration with Brooklyn-based philanthropist Christine Klein, the founder of Klein-Kemp, a company that provides space and support for artists who are LGBTQ+ through its studio space in Piedmont Park. Klein-Kemp is a leading supporter of independent arts and cultural spaces in Atlanta that includes the Georgia Writers’ Cooperative and the Georgia Museum of Art.The gift includes a painting by artist Hubert and Henriette Kawasaki, which was commissioned by the organization Georgia Painted Coalition. The painting is a depiction of the pair seated in a church, surrounded by their families, while the words \"God is love\" and \"God is peace\" are written on the canvas. The story of the painting—the story of pride and joyousness—is told through the artist’s own words.“This is a gift that will help us meet the challenges that sitting around a campfire is a daily reality for many in our community,” Klein-Kemp said in a", "The next Biennial should be held in order to address the current challenges we face as a city. The themes of the reopening and the exhibition are about social justice and the role of art in society. Our new platform will be designed with a new vision of collaboration and community in mind.We are in the process of discussing with the local authorities the best way forward for the Biennial. I am confident that, together with the City of Stockholm, we will find a way forward that is sustainable for both the Biennial and the city of Stockholm.” \n\n\nThe architect who designed the new headquarters of the Hong Kong–based design studio Wangeaksa, in Hong Kong, has resigned from his post. The Hong Kong Art Museum (HOK) and the National Taiwan Museum of Fine Arts (NTU) in Taipei announced his departure on Wednesday. The announcement came a day after the studio announced that Wangeaksa had won the $50,000 Hong Kong Design Award for 2018.Wangeaksa announced the news on Instagram, where he wrote that he had been a mentor to the studio since 2013. He described his collaboration with the studio as “a lifelong passion,” and said that “at times I had the feeling", "The next Biennial should be convened in December 2020, to take place in the city with a population of 1.2 million in the eastern part of Sweden. It will be hosted by the city of Gothenburg and the Scandinavian-Swedish institute of architecture, KUNST-Eriksson, and will take place in conjunction with the annual Gothenburg Biennale. The theme, “Eighteen centuries of dank art,” will be taken from a postcard of the city by the late artist J. S. Grettan (1889–1974) and will be accompanied by a documentary film by the journalist Lars Lund. The biennial will be an extension of the artist’s ongoing work, which spans two decades.“We have been working hard to present a work of art that responds to the contemporary city in two ways, first from a distance but also from a close distance,” Johan Green, the director of KUNST-Eriksson, told the Art Newspaper. “The city is the artist’s canvas. The work of the artist is a reflection of the city. And through this work, the city becomes the canvas.”Green said that the exhibition will", "The next Biennial should also provide a platform to welcome foreign artists to Mauritius. More than 130 artists will be invited to showcase their work in the exhibition, titled “Mauritius at the Edge of the World,” which will open at the Hotel du Palais de Tokyo in Paris in November 2020. The theme, which adapts to reflect the changes that have taken place in the island, is “The Landscape of the Narratives,” and the exhibition will feature work by forty-seven artists. Many of the artists chosen for the exhibition hail from countries such as India and China. \n\n\nThe UK’s Tate Board has fired four employees who were accused of promoting a pro-democracy protest outside the Tate’s London headquarters on Saturday, October 3, in an attempt to smooth the way for British Prime Minister Boris Johnson to visit the Tate in a few days.The moves came as the museum, facing mounting pressure to show greater restraint following the death of George Floyd, who was detained by the Metropolitan Police for attempting to reach the site of the planned protest with his bicycle on Saturday, October 10, has announced that it will send out an email to its 250,000-plus members on Monday informing them that", "The next Biennial should take place sometime in the second half of the year, and will be organized by the local community in order to attract as many people as possible to the festival. The theme for this year’s edition is “Sustainability.” The event will also feature readings, lectures, performances, screenings, workshops, and other events.Organizers are still working out the logistics of how to remove the museum’s headquarters from the city of Taksimbong, which has been surrounded by a building-cum-museum for forty years, and are assessing the feasibility of staging the exhibition outside of the city, which has a population of around four million. The Museum of the Moving Image (MOM), which has recently completed a major expansion, is preparing to welcome visitors again. The museum’s new headquarters, located in a refurbished former oil storage facility in the city of Da Nang, is slated to open in the fourth quarter of the year.\n\n\nThe Smithsonian Italianate Exhibition, which opened in Rome on March 28, has announced that it will move forward with the exhibition despite the threats posed by the country’s conservative Prime Minister, Matteo Renzi, and the country’s other", "The next Biennial should be called for the next four years and will be held in 2020. The exhibition will be organized by the Pullman Museum of Art and the Seattle Art Museum, both of whom are currently renovating their buildings. The American Institute of Aeronautics and Astronautics in Annandale-on-Hudson, Virginia, will host the 2020 edition. Museum directors David Garant and Dale Rinder said: “We are fortunate to be able to continue to engage with our audiences and communities in Washington DC, and to have a strong team of curators and experts who will shape the next edition of the Biennial. We are excited to see what future holds for our facilities, our biennial, and to continue to present key exhibitions and events to make the Biennial Museum of American Art a meaningful cultural destination for DC residents and visitors.”\n\n\nThe American Alliance of Museums (AAM) announced today that it is launching a new $1.2 billion initiative to support institutions working with and advocate for new, creative, and experimental materials. It will invest $120 million over three years at more than eighty local, state, and federal levels nationwide. “The AAM Initiative for", "The next Biennial should be a total of twenty-eight exhibitions, each themed around a theme from the artist’s collection, which will be curated by an independent curator, and will feature the work of forty-three artists. Inaugurating the upcoming exhibition will be an exhibition of works by twenty-nine artists, which is slated to open in September. The ten artists chosen to represent Denmark at the upcoming edition were: Aditya Agrawal, Igor Banerjee, Hans Christian Andersen, Jane Birkin, Caroline Barnes, Berit Bansma, Julie Blaik, Étienne Auger, Juliette Baarsgaard, Wangechi Mutu, Tina Miki, Tanya Popova, Nina Roesler, Léa Sexton, Finan Sullivan, and Julia Tucker. The 2019 edition of the biennial, “Tina Miki: An Exhibition of her Art” closed in August 2019, and the 2020 edition will also host a selection of work by the artist.\n\n\nThe Alfred P. Sloan Foundation announced today that the twelve recipients of its annual Alfred P. Sloan", "The next Biennial should be held at the Museum of Southern Art, in the city of Los Angeles, sometime between May and October 2020. “The last two years have been a defining time for me,” said Sarra, who is currently on sabbatical from the university. “I have devoted my professional life to the history of African American art, and have published groundbreaking studies on the life and work of Abraham Lincoln, Charles Epps, and Gerald Roud, among others. I am deeply honored that my work will be included in the upcoming exhibition.”At the turn of the twentieth century, African American art was a fringe interest, held in few museums, in small towns, and in cities. The artist was a fringe artist, a fringe body of work, and a fringe idea. Today, however, the African American artist is a central and influential part of American art history and its development, a central and influential part of the American canon. \n\n\nThe Art Newspaper, the prestigious German art publication, has revealed that the Johannes Kepler Foundation in Berlin will host the twenty-fifth edition of the Josée Kepler’s Bigelow Galerie exhibition, due to open", "The next Biennial should be held in the autumn of 2022.\n\n\nThe Museum of Modern Art (MoMA) in New York has hired Carrie Procter as its new global director. She succeeds Danielle Campbell-Rynd, who departed the institution in March 2019 to lead the British Museum, and will begin her position this fall.“Carrie is an experienced and compassionate leader who has been instrumental in transforming MoMA while remaining true to its mission to present the most important works on contemporary art,” said architect and MoMA board member Jonathan Zittrain. Zittrain added that the board is “pleased to welcome her to the board and to the powerful organization that she will be essential to our future success.”Prior to joining MoMA in 2004, Procter worked as a curator at Tate Britain and was a curator at the San Francisco Museum of Modern Art. During her tenure at MoMA, she oversaw numerous exhibitions, including “Alfred Stieglitz: Running Free,” 2007–2008, “Winter 2002–2003: The Power of Sculpture” (2007), “Renaissance 2000–2003: A True Restoration” (2007), and “Theater", "The next Biennial should be staged at Altai University, in the Altai region of Russia's central Karelia region, in December 2020. The theme, “Encounter,” will be “Unfinished Business: Sexualities in the Age of Stalin” and will be accompanied by a video. The exhibition will be organized in collaboration with the Karelia State Museum of Art and the Russian State Museum of Pravda.\n\n\nA number of artworks have been stolen from the Tate’s London outpost over the last few months. On Sunday, the Tate’s director Maria Balshaw said that the institution is still assessing the extent of the damage that the institution sustained as a result of a fire that broke out on the third floor of Tate Modern on April 3. According to the Guardian, the firemen who extinguished the blaze—who were not trained in extinguishing fires—said that they had to use chemical agents to subdue the fire because it was not contained. The fire is still out there and is being treated as a potential incident at the Tate.Balshaw confirmed that ten works, including six new works by Konstantin Malofey and two that were on loan from his firm, were on loan", "The next Biennial should be held in February 2021.\n\n\nThe Mound Museum in Cincinnati, Ohio, has received a gift of an additional 325 works by artists from the collections of the two major American museums in the city, the Clark Collection and the Metropolitan Museum of Art. The works were donated by the late Richard B. Cordell, who passed away on February 21. Richard Cordell was an avid collector who amassed an extensive collection of American painting, sculpture, and photography. He donated his collection to the Mound Museum in 2013 after the institution relocated from its original site in the heart of Cincinnati to a new $250 million home in an industrial park on the city’s northwest side.The gift includes works by artists such as Thomas Edison, Robert Irwin, and Alejandro Campanella. The museum also revealed that it has now acquired hundreds of works by contemporary artists, and that it plans to open its first gallery of their works in 2020. The museum recently purchased three works by Saul Alinsky: Wall Street (1932), The Right Stuff (1935), and Competition Is the Form (1942).\n\n\nThe British-born, London-based artist Andy Warhol’s memorial exhibition at the Lou", "The next Biennial should take place in 2020. After that, the museum will either expand or relocate, depending on whether the current exhibition, “The Shape of Life (Theatrical),” is re-created or re-edited in the museum. The institution will remain closed until March 10, 2021. “We are all committed to continuing to explore the possibilities and the challenges of exhibition-making in a museum setting,” said John Baron, head of contemporary art at the Biennial. “Together we can achieve the result that the artists, the curators, and the staff have always dreamed of: an exhibition that is as meaningful and transformative as the works it represents.”\n\n\nThe Metropolitan Museum of Art in New York has launched a new digital platform that will allow artists and curators the same easy access to its collections as it does to the museum’s main building. The platform, “The Material Garden,” will allow visitors to view and download digital artworks by twenty-seven artists and nineteen curators, including Andy Warhol, Theodoros Lunacharis, MOS Architects, and Jack and Carol Sayre, as well as other historic works in the collection that will be added to", "The next Biennial should also include a discussion with the National Gallery of Australia about the future of the National Gallery of Art. The agenda should also include a review of the current exhibition program at the Biennial; an overall survey of the art collected in the past five years at the Biennial; and an update of the biennial’s collection policy. The Art Newspaper published an article in May 2019 that stated that the exhibition might reopen in 2021 but only if the current management team of the Biennial stops harassing the artist.The Biennial has already faced protests from some of the artists who participated in the exhibition and has faced multiple lawsuits from those who claimed that the closure was an infringement on their Fifth Amendment rights rights to due process. Artnews reports that the artist-run museum has previously stated that the event will go on as planned, though with a few changes, including that the museum will host a special exhibition of works by selected artists in 2021. The Australian Council for the Arts (ACAA) has also expressed concern for the future of the Museum of Contemporary Art Melbourne. The institution’s director, Becky Elwood, said: “The Museum is taking these matters seriously, but we are not prepared to risk the future of", "The next Biennial should take place in Tokyo in 2022, and the Tokyo Art Book should be published in 2020.  The institution has stated that it wants to create an event that will involve the use of the museum’s collection in a contemporary context and on a large scale. The 2017 edition of the exhibition was held at the Museum of Contemporary Art Hong Kong, but due to concerns over the coronavirus, the exhibition was moved to the University of the Arts Beijing.\n\n\nThe Rose Art Museum in Oslo has received a gift of twenty-one works by the artist Eva Langret. The works were donated by her husband, Mats Lindret, who was a professor of art history at Oslo University of the Arts from 2005 to 2007. The institution also revealed that it has acquired fourteen works by Langret\u0097from twenty-two collections, including works by Josef Alberts, Carlotta Carvalho, Helen Cammock, Marie-Louise Apfelbaum, Frederik Baier, Åke Sellos, and Jørn Olins.“The gift of twenty-one works by Eva Langret is a great victory for the art of art history,” said Mats Lindret. “Her works", "The next Biennial should take place in the spring of 2021, with a design by J. Paul Getty’s Museum of Art. The institution is currently working on a new location for the exhibition, but the design is currently being piloted at the Los Angeles County Museum of Art. The museum will announce the winner of its award next month.\n\n\nThe L.A. County Museum of Art (LACMA) in California has appointed Prudence Hart as its new deputy director of curatorial affairs and curator of modern and contemporary art. Hart comes to the institution from the Museum of Contemporary Art, Los Angeles (MCA), where she has served as deputy director and curator of modern and contemporary art for the past three years. Previously, she was the deputy director and curator of contemporary art at the Museum of Contemporary Art, Los Angeles (MCA).“Prudence arrives at LACMA with a strong track record of curating and performing in exhibitions, including the LA Biennial (2019), the 2020 LA Architecture Biennial, and the LA County Art Biennial,” said director David Mitchell. “We are eager to see how she will align with the MCA’s growing curatorial and educational expertise while ensuring that LACMA", "The next Biennial should be the last, according to the organizers, “in order to continue to present the finest exhibitions in the world.” The theme of the event will be “Love and Moist Plants,” and the seventy-seventh edition of the exhibition will be staged at the Palazzo Grassi in Venice, Italy, in 2020.\n\n\nThe National Gallery of Scotland has announced that it will no longer be connected to the Department of Culture, Media and Sport (DCCS), following the institution’s decision to leave the UK in March 2019. The move followed a four-month period of boycotting the institution, during which time the museum began a three-year renovation, which began in 2018 and is expected to run until 2022.“To paraphrase Churchill: ‘If you wish to keep a nation, keep one British,’ and if you wish to leave a nation, leave a British nation,” said museum director Jo Cox. “It is essential that we remain united, and that we continue to prosper as one.” The decision to not renew the institution’s lease of the building that houses the National Gallery of Scotland, which was established in 1821"]