["The next Biennial should take place in the summers of 2020 and 2021. The next edition will be held at the Noguchi Museum in Pasadena, California, and will feature works by twenty-six artists.\n\n\nThe first museum dedicated to African art in New York, curated by Maurizio Cattelan, will move its first exhibition of works by black artists on its premises to the Brooklyn outpost of the Brooklyn Museum.  “We are thrilled to open the new, larger, and bolder Museum of African Art in New York’s tapestry-floored West Twenty-First Century with a new, larger, and bolder collection of contemporary art,” said Marc Glimcher, the current director of the New York Museum of Art.Glimcher told Artnet that the museum is planning to expand the exhibition program by adding new works by artists of different nationalities. “This is an unprecedented and important opportunity for us, and we are confident that the new Museum of African Art will be a truly remarkable addition to the city’s cultural landscape.”The museum opened in 2017 and was hailed as one of the most important developments in museum design and expansion, with its building and installation of the first permanent African", "The next Biennial should be held in 2019, when the exhibition will mark its thirteenth anniversary. The biennial will also mark the last exhibition held by the artist as part of the university’s collection. The display will include works by all eight of the exhibition’s creators, who were the only remaining members of the roster who were not forced to resign from the commissioning committee in the wake of the coronavirus outbreak.The decision to make room for a new exhibition led by the artist was made in light of the news that the institution had been leaking information about its future plans for years. The university has also been working on revamping its collection and exhibition program for years, but the plan is now in danger of being scrapped due to the coronavirus.\n\n\nMore than 1,700 artists have signed an open letter supporting the protests against the G20 ­reorganization that has taken place across much of Asia and Europe since February. The letter, addressed to the leaders of China, Japan, South Korea, and Finland, accuses the G20’s economic and monetary policies of the 17-nation bloc of pushing for a faster return to core values like austerity and protectionism and argues that the protests are the only way to", "The next Biennial should have taken place in 2019–20 and will be held in the capital of Mumbai, which is currently under construction. The exhibition will be hosted by the Spicer Museum of Art and will be led by Dinesh Dixit, director of the Bijan Biennale in America. The event will be hosted by Jacqueline Couture Gallery and curated by K. Nagaraj & K. Nagaraj.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has drawn the ire of some over its decision to move David H. Koch’s new $2.5 billion, six-story headquarters out of the city in an attempt to conserve the institution’s carbon footprint. According to the New York Times, the move will curtail the museum’s annual visitor numbers by as much as 35 percent and will involve the dismantling of sixteen works to make way for the construction of a new museum complex.While the museum plans to remain neutral in the ongoing political battle over climate change, it has taken issue with the conservationist’s advocacy for policies that would curb carbon emissions and has expressed concern for the impact that the dismantling and relocation of the museum will have on the environment", "The next Biennial should not be held in March 2019 after all. The meeting will be held in June 2020. “This is a very difficult time for many, but it is also a moment of truth for many,” said Lévy Gorvy SAOP, a French luxury goods manufacturer that recently filed for bankruptcy protection and is facing a huge loss of revenue as a result of the ongoing health crisis. “We are ready to enter a new phase, to a new vision, to a new position, to a new relationship with our clients.”The Paris-based company’s management had earlier this month announced that it would begin a “massive reorganization” of its business under new management led by Laurent Gaspard. Gaspard will take the helm of the company, which has 20 percent of the global market share, in a mutual agreement that was agreed to by both parties. The reorganization plan was first reported by Le Monde. The French daily newspaper Le Figaro, which has correspondents in Paris and London, said that the restructuring would involve the shutting down of shops, the restructuring of the brand, and the selling of off parts. The Paris-based brand is", "The next Biennial should be about a collaboration between artists and collectors with a view to a new kind of exhibition. It should culminate in an exhibition of the work of the two collections, one in London, the other in Paris. I have been an art collector for thirty-six years, and have owned work by more than seventy artists. Curating a biennial is a great honour, and I look forward to developing new opportunities for collectors to collaborate.I am also an avid collector. I am planning to build a new gallery in my native city of Mechelen, in the Netherlands, to expand on my collection of modern and contemporary art. I think that this is a cultural phenomenon which will become a significant source of inspiration for a generation of collectors.”In a statement, the National Galleries of Scotland said: “We consider the installation of the biennial exhibition to be an extremely significant development for the future of the National Galleries of Scotland. Having the opportunity to present the work of a great group of artists is a real tribute to the National Galleries of Scotland and to the wider art world. We are grateful to the Director of the National Galleries of Scotland, Harriett Forbes, for recognising the potential of the exhibition", "The next Biennial should be held in October 2020. André Bazemore , the director, is also planning a new biennial in October 2021, and a biennial of works by artists such as Paul Gauguin and Alexandre Neuer. He told Artnet that he expects the Nepalese community to be present at the 2020 edition.A number of artists and collectors have expressed interest in participating in the 2020 event, which will be held in Kathmandu, the capital of the Himalayan kingdom of Bhutan, and will be co-organized by twenty-four galleries from fifteen countries. The event will be organized within the framework of the Kathmandu Art and Culture Summit, a regular gathering of over twenty thousand art-world, artistic, and cultural professionals across the world. Bazemore said: “We are at an interesting moment in history. We are seeing a revival of art and culture outside of the Western world. The art world is very much in need of a revival, and it is up to us as organizers to help it along by understanding its issues and by supporting the artists who are working to make their voices heard.”\n\n\nThe Art Newspaper has published an exclusive preview of the second issue of the new", "The next Biennial should be held in the spring of 2019.\n\n\nThe London-based arts organization the Serpentine Gallery and Tate, which was founded in 2014 by Loring Randolph, has announced that the institution will hold its next edition in the spring of 2021. The announcement comes a little over a year after the organization announced it would be restructuring its operations. At the time, the institution said that the redesign was inspired by the Serpentine Gallery in London, whose collection includes works by artists such as Mark di Suvero, Roland Iris, and Catherine O’Connell.The redesign—which first went live on January 2, 2021—is centered around a new collection of six new works by artists, including Loring Randolph’s “The Life of Art,” 2018, with Alexei & Lora Portover, and “The Summer of Love,” 2019, with Jane Everett, both of whom will be represented in London. The museum will also dedicate more than two thousand square feet of space to exhibitions and events and will feature a new exhibition titled “The Serpentine Gallery: The Next Generation.”The London-based dealer, who will also take up the role of cofounder of the London", "The next Biennial should take place in 2021. \n\nHollis Taggart (Australia) has announced its representation of the Welsh architect and theorist, Wilfred Owen, who is considered one of the greatest living practitioners of the lithography technique. The exhibition will be staged at the National Art Gallery in Cardiff and will be inaugurated by a solo exhibition of his work, titled A World of Difference (1937), at the Art Gallery in London on December 18.In addition to his work, Owen is known for his lectures and workshops, which often include examples of his lithography, which consists of thousands of half-finished drawings. Many of his works are in the collections of the following: The Raincoats (Melbourne); the National Gallery in London; the National Gallery of Art (Washington, DC); the Museum of Modern Art, New York; the Museum of Art, Houston; the Museum of Contemporary Art, Miami; and the Metropolitan Museum of Art, the Museum of Modern Art, the Museum of Modern Art, Los Angeles.A selection of his work by the 19th century American artist John Mitchell will also be included in the exhibition “Welsh Biennial: A World of Difference” (2019).  “", "The next Biennial should open in 2022 and will be hosted by the Museum of Contemporary Art in San Francisco.The announcement comes amid growing concerns about the future of the National Museum of Women in the Arts (MoMA), which recently laid off or furloughed more than two hundred employees. The move followed months of “unwavering support,” Artnet reported, “including a $300 million gift from Henry Luce, a $150 million donation from the Doris Duke Foundation, and $100 million from the DuPont family, which pledged $100 million to a new fund dedicated to women artists.”The funds will be divided between the museums and will provide free access to the museums for a period of three years. One change that would have benefitted more museums is a requirement that museums retain a minimum of three years of exhibition-making history. The museum industry is preparing for a downward trend in the economy as people shift to cheaper, on-demand services. While some museums may be able to support the more financially vulnerable, the industry is in a constant state of flux.As the number of people visiting museums has remained constant throughout the recession, the industry has faced an uncertain future. The Art Newspaper", "The next Biennial should be held in the city in 2021, but the date has yet to be decided. The theme of the upcoming iteration of the event is “The Body,” which was originally supposed to be a collaboration between the artist Caitlin Blankenship and the Egyptian artist Hisham al-Shishana. The exhibition was originally supposed to take place in Istanbul, but was moved to the capital after protests from local and international artists and has since been staged in Malmö, Stockholm, Brussels, and New York.The exhibition will return to its original venue in May, 2020.\n\n\n\n\n\nBloodhound Art’s 2020 Spring/Summer edition is starting to take shape. The Los Angeles–based nonprofit will hold a press conference in New York on March 27 to reveal the first twenty-four-hour preview of its upcoming exhibition “Bloodhound: The Exhibition,” which will be housed in the Warhol Foundation’s new headquarters at Twenty-Fourth Street from March 29 to March 31. The exhibition will consist of fifty works by fifty artists, including Miles Davis, Michael Mylou, and Susanne Vielmetter, as well as performances by artists such as Jane Fonda, Diane Ar", "The next Biennial should take place in the city of Basel, Switzerland, in 2021. An exhibition of the artist’s work will also be staged at New York’s Museum of Modern Art in 2020, and a book of his works will be published in 2024.In a separate edition of the magazine, Pierre-Auguste Esposito, the publisher of the British art and cultural journal The Art Newspaper, said: “We are thrilled to see the exhibition Biennale d’Arles-Leves, the first exhibition in the city of Arles, in the spring of 2020. It will be a magnificent occasion for the art of the Seventeenth Century to be told its own history. We are also delighted to see the first sculptures from the collection in the museum’s collection since 1985. It is a wonderful development that the Milan Art Museum is still able to display the works of such great artists as Neuer, Meinecke, and van Gogh. We are convinced that in the coming years, the exhibition will be a great success.”Born in Paris in 1931, artistic director Didier Pape (a descendant of the founder of the well-known French sculptor August Pape) was asked", "The next Biennial should have been held in 2017, but was pushed back by the US government. The 2018 edition will be held in Berlin. Architecture critic Klaus-Dieter Grainger has called the highly anticipated event “a trial run for a new universal basic income.” For some, the uncertainty regarding the 2022 event is cause for alarm. “I don’t want to see a third edition of the conference in 2022,” Michael Ward, director of the Institute of Contemporary Arts, London, told the Art Newspaper. Ward added that a biennial with a limited number of participants would be “better designed to take place in 2022,” when the number of participants is likely to be greater. For some, the uncertainty surrounding the 2022 event is cause for alarm. I don’t want to see a third edition of the conference in 2022,” Michael Ward, director of the Institute of Contemporary Arts, London, told the Art Newspaper. Ward added that a biennial with a limited number of participants would be “better designed to take place in 2022,” when the number of participants is likely to be greater. Earlier this year, Grainger wrote an open", "The next Biennial should focus on the 'reconstitution of the craft, the reconstitution of the community, and the reëstablishment of the local community, thus offering new and original perspectives on the history of art and contemporary life.\n\n“The future of art will be defined by its ability to move us and help us connect with one another, according to Raoul Wallenberg’s words,” said Christophe de Margerie, artistic director of the Biennale de Lyon and president of the European Commission. “This is the moment, and this is the year, when we need to recommit ourselves to one another and to the history of art. We need to reëstitute its collective memory in service of our future. We need to reëstitute the history of the past, of the future, and of the present. And we need to reëstitute the vision of the future as a world without borders, as a world in which the articulation of ideas and the organizing of events is possible.”On the exhibition’s inaugural edition, which was curated by a group of three men and a group of four women, which opened in the French city of Lyon, the", "The next Biennial should be held in December 2021 at the Biennial Museum in London. The next exhibition should take place in March 2024 at the London School of Economics and the Tate. The 2020 prize recipients are Paolo Benigno, Markus Rosengarten, L.A. Cicchetti, Catherine Taveras, Yehyao Zhang, and L.A. Corrigan. This year’s winners were chosen by a live audience\u0097prize judges were not given a ballot. The inaugural jury was made up of Hans de Bruijn, Lucio Brescia, Christo, Sara Cwynar, Stefan Molyneux, Anwar Saeedi, Ludwig van Beethoven, Friedrich von Kaiser, Emmanuel V. Dehner, Ludwig Wittgenstein, Adrian Tait, Thomas Malène, and Tomi Barozzi.The prize jury was led by Wolfgang Peiffer, director of the Stedelijk Museum in Amsterdam and curator of the Sebbenhorn Museum in London. Peiffer and Vlassijes will", "The next Biennial should be held in 2020, but Şahin has said that it may only reconceive its previous exhibition format.\n\n\nThe Ministry of Culture of Uzbekistan has suspended the construction of a new museum in Torez, the capital of Central Asia, due to the outbreak of the novel coronavirus. The institution’s director, Hamdullahd Zadran, who was reassigned to a lesser role during the pandemic, told the Art Newspaper that the museum had only a ten-day window of opportunity to close the $240 million museum.The building, which would have housed the institution’s archives, was completed in 2015. Construction was suspended in March following a five-month shutdown due to the coronavirus outbreak, and the museum opened to the public in April. The exhibition space was converted into a two-story university building, and the museum’s administrative offices were relocated to a different city in the country.In a letter delivered to the public in March, Zadran cited the pandemic and the construction of the museum as the reasons for his dismissal. He said that he received the resignation from Culture Minister Zurbruv and assumed the post of director of the Torez Art Museum", "The next Biennial should be staged next March in the city of Sarajevo. Although Biennials are only two years old, the organizers behind this year’s event have already announced that they expect next year’s event to be a real life-size replica of the medieval fortress-city of Sarajevo. \n\n\nBeijing’s Art + China Exhibition, which runs from March 17 to March 19 in March, will not resume after a major expansion project was completed by the Beijing-based Chinese conglomerate Yishu Group. Instead of the exhibition’s original March opening on March 7, it will now be held in March 2022.The Beijing Art + China Exhibition has been criticized for its decision to move the show to a different date, as opposed to reopening in conjunction with the Chinese New Year, the official New Year’s Day holiday, as originally planned. The move has caused consternation in China’s art world, which has been celebrating the occasion of the Chinese Lunar New Year.Yishu’s new 15,000-square-meter campus in Beijing is being built in conjunction with a $4.4 billion, 1,100-megawatt expansion of its Beijing", "The next Biennial should take place at the Museum of Contemporary Art Chicago (MoCA), which will be inaugurated by a keynote address by architect Daisuke Takahashi. The event will include a series of exhibitions and seminars directed by artists and other cultural professionals that will engage with themes of contemporary life, design, technology, and art.“A few years ago, I began working on a digital platform that could connect and engage my audience in new ways,” Parker told Artforum. “I started writing articles for The New Art News and The Art Newspaper, and I cofounded a magazine that published art-and-life essays by artists. I think this new platform will be a huge step toward connecting my audiences with the most interesting works that were created in the last few decades.”After initially developing the platform for a company called BiBez, Parker founded Biosurf, which published art-related content in exchange for ideas and inspiration from artists. One year later, he created the platform 2E on which he has published work by artists such as Terrence Duffy, Mihai Foktor, and Jon Fox. The site also hosts over fifty artists’ works, including works by Andrea Radford-Green, Gregory", "The next Biennial should be held at the Central Library in London. The first exhibition, titled On the Waterfront, was organized by the National Portrait Gallery in London and the Royal Festival Hall in London. The new exhibition is scheduled for October 9–October 12, 2020 and will be hosted by the National Gallery and the Royal Shakespeare Company in London.\n\n\nThe National Gallery in London has received a gift of 20,000 photographs by Italian masters Gio Ponti and Stefano Rossellini. The collection, which includes more than 3,500 negatives dating from the mid-19th century to the 1970s, includes works by Picasso, René Magritte, and Caravaggio and was purchased by the institution from the Italian collector Alessandro Bellanti.The institution previously displayed the works in the exhibition “The Ninth Venice Biennale” (2015–16) and “The Spirit of London” (2013–14). The latter show included photographs by artists such as Pierre-Auguste Renoir, Pablo Picasso, and Claude Monet. The National Gallery also displayed the work of the Italian avant-garde, the late Italian designer Andrea Bertotti, in the “Avant-G", "The next Biennial should take place in 2022. A longer-term plan is currently being developed, but the steps currently taken are not sustainable. For the past four years, the museum has been closed from April 22 to April 26 to conserve the museum’s collection, and in 2020 it was planning to close to the public on March 16.The museum is planning to reopen in June 2020, but the construction of the new structure, which will consist of three mixed-use structures with a combined capacity of 1,500,000 people, is currently ongoing. The museum is currently negotiating with the government of Singapore to open the museum in June 2021. \n\n\nThe Smithsonian’s National Museum of African Art (NMFA) in Washington, DC, has welcomed two new members to its board of trustees: journalist and philanthropist Tarek Atoui and his wife, Amara Atoui. The institution also announced that Martha Coetzee will be the institution’s inaugural board member and will oversee the institution’s relationship with the Smithsonian.Coetzee, who has served as an adjunct faculty member at the university’s public arts center since 1981, succeeds Arthur J. Francis, who retired after twenty-six years following", "The next Biennial should take place in the spring of 2020. The 2019 Biennial, which is currently on view in the British Museum, included work by more than twenty artists. The 2019 exhibition, titled “Analogue,” is part of a series on the history of the art world curated by Lévy Gorvy, featuring works by Dutch artist Laharl Henriksen; French artist Saïdine Chassin; French artist Franca Chedid; Italian artist Raffaella Chedid; and Sara and István Hochberg, all of whom have recently been recognized as the most influential female artists of the twentieth century.The 2019 Biennial was staged at the Art Institute of Chicago. The show, titled “Analogue,” was organized by David Geffen & Partners, which merged with the Chicago-based consultancy firm of Gerald Seim and Martha Stewart. The new entity commissioned artists to produce works for the show, which is organized as a “miniaturist” show and will run from March 13 to March 16, 2020. The new company also includes the development of a new online platform that will showcase the exhibition.\n\n\nThe National", "The next Biennial should be in October 2020 and will feature the work of nineteen artists, including Ellsworth Kelly, Peter Cook, and Carsten Brzeski, and will examine how the legacy of the institution can be reframed through the lens of contemporary life. The exhibition is part of the Haus der Kunst (German Cultural Heritage Foundation), which aims to preserve and present German art in order to foster intercultural exchange throughout the world.A selection of the Biennial’s works will be presented at the Kunsthalle Basel in June 2020.\n\n\nThe Metropolitan Museum of Art in New York has appointed Mike Fattal as its new associate curator of printmaking and art history. Fattal currently serves as director of the contemporary art program at the museum, which recently underwent a major expansion, which added more than twenty thousand works by seventy artists. His new role will be a collaborative project between director Daniel H. Weiss and curator Timur Fieger, whose research and curatorial projects have led to the exhibition “Hydroblast,” a retrospective of works by artists including Richard Avedon, Iris Kenworthy, and John Akomfrah, among others, and will be presented in the fall of 2020.�", "The next Biennial should be a perfect time to let the public see the works of all our artists. Also, this is the right time to pay tribute to the male artist who embodies the spirit of the community and is missed by most of the world.” \n\n\nThe Los Angeles County Museum of Art (LACMA) is launching a new digital platform that will allow visitors to view hundreds of works from the collection in a single day and will also collect and display artwork from under-recognized museums.In a press release, LACMA described the platform “as a companion to the museum’s existing archives, providing visitors with one place to go for rare works and one tool for curating their collections. The platform provides the opportunity to see and hear the work of thousands of artists before the institution’s permanent collection is sold to a private collector.”The initiative is part of LACMA’s campaign to create a more diverse collection of contemporary art and to expand the museum’s holdings of African American art, European art, and indigenous art. It also aims to address the institution’s long-standing policy of excluding African Americans from exhibitions and programming.“The digital platform will be dedicated to the", "The next Biennial should be held in 2020. \n\nMontreal’s Architecture and Design’s Research Department (ADRD) announced today that it received a gift of fifty-five works from the artist-in-residence program at the University of Montreal, which will soon feature fifty works by the artist-in-residence Lydia Moulton-Farb. The fifty-fifth and final work, Vanity Fair, will be on view in the museum later this year.“Lydia Moulton-Farb embodies a decade of creativity and innovation in architecture, drawing inspiration from the past to propel her own contemporary projects,” said Maurice Blondeau, director and CEO of the program. “She challenges the limits of what is possible and redefines the role of architecture in the twenty-first century.”Born in Montreal in 1973, Moulton-Farb first studied at the Montreal School of Art and the École des Hautes Études before moving to New York to study at the University of Pennsylvania, where she completed her master’s degree in architecture and design in 1995. In 1999, she moved to the city to complete her master�", "The next Biennial should be held in 2021. The festival will receive an additional $100,000 from the sales tax exemption and will be held at the San Francisco Museum of Modern Art, which is currently under construction. The other institutions that will benefit from the sales tax exemption are the Brooklyn Museum, which will receive $100,000; the Museum of Modern Art, of which the institution currently employs more than 250 people, which will receive $100,000; and the Whitney Museum of American Art, which will receive $100,000. The sales tax exemption will be bolstered by a $63,500 donation from the New York City Council, which also pledged $30,000.Initiatives and contributions to the biennial can be made by anyone and can be made online, by phone, or by mail. The deadline to apply for the biennial is November 8. “The biennial will be a celebration of the ideals of progress and creativity, not only in the arts but in the life of our communities,” said Lisa Borthwick, chair of the biennial’s board and curator of contemporary art. The 2019 edition, entitled “Make Room,” was held at the Museum of Modern Art, the Brooklyn", "The next Biennial should be held in 2022. The next one will be held in 2523. The next one will be held in 2027. The next one will be held in 2035.\n\n\nA group of artists, filmmakers, writers, and other cultural workers have launched a campaign to oust Ukrainian President Viktor Yanukovych from his post. Organized by the Russian-aligned artistic organization Art.ru, The Artists' Initiative for Democracy in Ukraine (BIN) is asking for the ousting of Viktor Yanukovych and his government. It alleges that the ousting of Yanukovych would lead to a rise in anti-Semitism and racial hatred and that the new government would not protect cultural and artistic workers.“We, the artists, are in the process of organising a massive and continuous show of solidarity with the cultural workers of Ukraine,” said Art.ru director Alexander Shlapak. “We are working hard to ensure at least one show in the country each year, including during the Winter Olympics, and we hope that this initiative will serve as a model for other countries in the region.”The organization’s proposal calls for the immediate ousting of President Viktor Yanukovych and the installation of a new government led by a human-rights activist", "The next Biennial should begin as planned this spring, and will focus on the work of the forty-three artists who participated in the inaugural edition, whose inaugural exhibition, “Dejan Krivos (Artists Rescuing Art),” opened on September 14. The program will be hosted by the European commission in Brussels, with the cooperation of the forty-four artists who participated in the exhibition. The exhibition will feature new works by forty-two artists and will be organized as a biennial in the tradition of the art of the Prague Biennale, which was held in the same building as the Biennale.\n\n\nThe Museum of British Art (MoB) in London has appointed Richard Hunt as its new deputy director for collections and exhibitions. Hunt comes to the institution from the Gateshead Foundation, where he has served as board chair since 2013. He succeeds Donal Lissack, who was appointed as director of the Centre Pompidou in Paris last November, and will assume his post in January 2021. “Richard has been an enthusiastic supporter of the Museum of London for more than twenty years and has been a strong advocate of its collection, exhibitions, collections research, and academic programs,” said Museum", "The next Biennial should begin in 2020 and will consist of fifteen exhibitions. The theme for the exhibition will be “The End of Life and the Present State of the Art.”The biennial also revealed that it plans to shut down its sixteenth event, “International Contemporary Art Biennial: 2019,” in March 2020 and will transfer the management of the complex to a new organization, known as the Contemporary Arts Foundation. The organization’s board of directors met today in New York and voted to suspend the event, which was originally scheduled for March 23–March 24.“The 2019 event was a huge success, drawing over thirty thousand visitors to the Museum, as well as the largest audience in its history,” said David Schoelkopf, chair of the Contemporary Arts Foundation. “I’m very proud to see that it continues to be an incredibly successful event, and am confident that we can continue to grow and develop the series and showcase the best art in the world.”\n\n\nThe Carnegie Museum of Art in Pittsburgh has appointed a new curatorial director and CEO. The appointment was made by Chancellor Simeon Rogers III, who has been the museum’s president and CEO since 2015", "The next Biennial should be held in the spring of 2020. The 2019 event, titled “Between the World and Me: Stories from the Bikini,” was selected by an international jury consisting of German artist Joachim Neugroschel; art historian Wolfgang Eike; art historian and curators Dieter Fotsch and Joachim Neugroschel; and anthropologist Janice Musgrave.The 2019 event, which opened at the German city of Basel and featured stories from the exhibition Taken as an Embarrassment: Stories from the Bikini, was moved to Hamburg, and the exhibition was moved to the original site of the exhibition in the city in the summer of 2019. The new slot is now occupied by an exhibition called “Between the Worlds: Architecture, Water, and Sea” that will be led by architect Kiko Ponti.In a review of the 2019 Biennale in the Art Newspaper, German artist Markus Zusak said that the proceedings “provoked a deeply emotional response,” and that the artworks were “inherently burdened by an uncanny sense of unity with the activity of the space.” \n\n\nThe National Gallery in London has", "The next Biennial should take place in 2021. The biennial, which will be hosted by the Palazzo Forti and CIMAM, will be organized as an Open Library, in an attempt to address the dual goals of the event and the Italian landscape. The exhibition will explore the possibility of the unification of Italy and the city of Venice, with its many landmarks, and will be hosted by the Milan-based firm RCA. The first exhibition was staged in 1987 at the Plaça della Scala, the same year that Michelangelo Antonioni, the founder of the Italian architectural magazine CIMAM, died.The competition, which will be hosted by the Fondazione Beppe Modigliani, will invite twenty-one artists to Rome in 2021. The selected artists will then be invited to the city for an open-ended dialogue for a week, during which time they will be given the opportunity to live and work in the city. The Biennial will then return to Milan for a second edition, which will take place in 2022.“The pavilion was born of the profound desire to create a new phase of Italian architecture, one that would be a reflection of the great city of Rome,” said Francesco Cia", "The next Biennial should be held in the first half of the year 2020. The first exhibition will be a gift that will come from the Russian State Opera House, which has operated since 1924. The gift will be the work of the artist Rina Babushkina, who has lived and worked in Moscow since the 1980s. \n\n\nThe High Court in London has upheld an injunction that will prevent the Royal Shakespeare Company from performing a work by the late Iranian conductor and playwright Ali Akbar Saeedi, a leading member of the country’s cultural elite. The sixty-four-year-old, who was the artistic director of the Iran-Iraq Cultural Center in Baghdad and the founder of the Iranian Theatre Festival (ITF), was taken to court by the London-based arts charity Art Fund to enforce the injunction because he has refused to pay $3.5 million in damages to Artists United for Justice (AVJ), a group of thirty-five Iranian-born artists who were compensated $1 million for works they did not sell, which was founded in 2006.The court ruled in favor of Artists United for Justice (AVJ) on November 23, 2016, and awarded them $2.5 million, which is more than", "The next Biennial should take place in 2020. Regional biannual biennials, just announced, have yet to be announced, and will be held five years from now.    With the announcement of the 2019/2020 biennials, the exhibition was deemed a success. On its opening night, the exhibition had more than 3 billion views on YouTube and had a whopping $104 million in gross revenue from ticket sales. While the 2020 event has yet to be announced, it will be in the venue of the Guggenheim, which was acquired by the Rockefeller Brothers Fund in 1988 and is currently undergoing a $60 million facelift.  The show will be held at the museum until the end of December and then will return to Rockefeller Center in New York. \n\n\nThe Los Angeles County Museum of Art (LACMA) has received a $10 million donation from the Simon family, which owns the production company Simon Creative. The $10 million gift, which was made by their son, John Simon, and his wife, Lorna, came in the form of a series of gifts totaling $50 million that were made in support of the museum’s construction of a new 50,000-square-foot", "The next Biennial should be held in the autumn of 2020. The theme of this year’s edition will be “Community and the Future of Life” and will be a reflection of the theme of the previous two biennials, “Creativity and the Future of Life” and “Life and Lifeforms.”\n\n\nAs Art Basel opens its first new physical space in the United States in more than twenty years, organizers are preparing to welcome visitors to its Hong Kong headquarters on October 10. The exhibition, titled Art Basel Hong Kong (ABHK), will stage fifty artworks from the region in the exhibition’s first year in the region.“Hong Kong has a rich and diverse history of artmaking and has produced some of the most important artworks of the twentieth century,” said Peter Schäfer, the general director of Art Basel Hong Kong, in a statement. “This exhibition marks an exciting point in its history, one that will allow visitors to the new venue to experience this in person. We are confident that ABHK, in conjunction with and as an extension of Art Basel Hong Kong, will continue to deliver an amazing collection of works in the future.”The", "The next Biennial should take place in the fall of 2021. The twenty-fifth and twenty-eighth editions, curated by Anne-Sophie Gaillard, were held at the Museu de Arte de Paris in May, 2020. Over the years, the biennial has featured work by artists such as Richard Anuszkiewicz, Pierre-Auguste Renoir, and René Magritte, and has been attended by thousands of visitors. The theme of this year’s edition is “imitation.”The exhibition also featured work by over sixty artists from twenty-nine countries. Among the artists selected for this year’s exhibition are Milan Moes, Nude Redo, Chris Ortega-Vargas, Adam Pendleton, Jodi Throckmorton, and Alex Turner, and is available on view on the twenty-fifth through the thirtieth.\n\n\nThe New York City Department of Cultural Affairs (DCLA) announced today that it is planning to eliminate two hundred construction jobs at the Metropolitan Museum of Art in New York City, in an attempt to reduce the museum’s workforce by 3,300. The layoffs will likely take place in the coming months, and the agency says", "The next Biennial should be called for the early 2020s and will consist of a selection of works by artists whose work first appeared in the book, “New York, 1978–1981” and will showcase a total of sixty works.“We are thrilled by the prospect of an exciting exhibition at the Museum of Modern Art to mark the museum’s centenary year next year,” said John McCarthy, the director of the museum. “The new exhibition venue will be a remarkable showcase of the work of nearly sixty artists since the exhibition of their first exhibition in the United States in 1976. We look forward to the show.”The board of trustees of the Biennial of the Arts and Design also approved a resolution that will establish the new prize for excellence in contemporary art. Named after the artist-owned nonprofit, the prize will be awarded to Yasmina Al Qasimi, Mark di Suvero, Alison Holbrook, and Lisa Spilker. The announcement of the prizes for excellence in contemporary art came after the MFA New York presented the MFA’s inaugural collection of works by these artists. The theme of the exhibition was “Be/longing: Contemporary Art and Design” and the inaugural works", "The next Biennial should take place in Miami Beach in 2022, and at a location to be determined. The organization will then host the 2023 edition in New York.In anticipation of the upcoming exhibition, the New York Times wrote: “Despite its modest size, Art Basel has already determined that the best way to move forward with the show is to extend its run in the United States, the UK, and Europe. ” The bidding process for the 2019 edition concluded on Monday, and the organizers are hoping that the show will launch in 2020.The 2019 show featured just four artists and was held at a venue in the Marina del Rey district of Los Angeles. The 2020 edition will feature twenty-three artists and will be held in a different location. Artist-in-Residence Josyn Young, of the New York project, will serve as a special advisor to the artists. Its organizers say that the show will “provide an unprecedented opportunity to see and hear the work of the artists who create their own art and will inspire visitors to think about their work and their place within the canon.”\n\n\n\n\n\nThe Museum of Contemporary Art (MoCA) in New York will reopen to the public on Saturday", "The next Biennial should include a selection of works by artists who have worked in and influenced the Biennial­. The artists chosen for the exhibition will include the following:Deana Lawson (Feminine1)2Kerry Rafferty (The Sacrificial Game)3Monica Zukal (The Avant-Garde Life)4Andrea Lepore (The Pre-Raphaelite)5Theresa Maturin (The Butterfly)6Einstein: A Study in the Future (1962)7Miriam Boyd (The Man Behind the Curtain)9Joslyn Wright (Gillian Wearing)10Kahlil Johnsen (The Anthropocene)11Sarah McEnery (The Upheaval)12Tobias Leibovich (The Art of Displacement)13Kameel Saeed (The Falling Leaf)14The Coen Brothers (The Crucible)18Benedict and Ron Chernow (The Biennial)15Thomas M. Smith (The Colour of Things)17Wangechi Mutu (The Power of Games)17Tommie Smith (The Good Parson)\n\nOn Tuesday, the Korean government approved a bill that would allow civic groups and individual artists to", "The next Biennial should commence in 2021. The announcement came just a day after the exhibition was abruptly canceled by the Chinese Ministry of Cultural Affairs in an attempt to contain the coronavirus.The event, titled 'The Spring of Life, “will feature contributions from ten artists, including Roland Gaillard (France/Spain), Sabrina C. Rodriguez (Spain), Dirk Marlow (UK), María L. García (Spain), Andrea Dwork and Andrea Gutiérrez (Spain), Andrea Panzano (Spain), Andrea Marchini (Italy), Paolo Gabelli (Italy), Carla Cornejo (Italy), Ella Carroni (Italy), and Carla Siboney (Australia)\n\n\nThe fate of British Petroleum (BP), the world’s largest producer of petroleum and a huge supporter of the arts, is now in jeopardy as the United Kingdom votes to leave the British Petroleum Group (BPG), the American company that employs some one hundred, if not thousands, of workers in the UK. The decision, which was made on December 8, follows the United States’ decision to leave the group, which employs some one", "The next Biennial should be held in the fall of 2020. \n\n\nL'Oréal is planning to open a new luxury boutique in the former Saint-Tropez district of Paris, where it has an outpost in a refurbished 18th-century church, in 2020. The Paris-based firm is looking to shift to a new location for the boutique, which will be housed in the apartment building known as the Café Luna, and will launch a crowdfunding campaign in support of the project in late April.“The project of the new space is an extension of L'Oréal’s commitment to supporting the channel of creativity and artistic production in the southeast of France,” said Yves Guillebeau, president of L'Oréal du Fashion and a former director of L'Oréal. “In order to create a new space for the art of fashion, we have chosen to establish the Café Luna in Saint-Tropez. It is a new space, a space for the art of fashion, and it represents a very important departure from the existing L'Oréal brand.”“The project of the Café Luna is a new and exciting innovation in our strategy,” said Philippe Pant", "The next Biennial should take place at the Kunsthalle Basel in Switzerland, in November 2021. The Art Newspaper reports that the California-based collective, comprised of artists Marina Abramović, Frank Gehry, and Robert Irwin, will receive $40,000 in support of the venue. The two-week event will be held at the Kunsthalle in the city of Basel. The theme for the third edition of the exhibition will be “The Golden Age” and will be “A collaboration between artists.”\n\n\nThe Museum of Fine Arts (MFA) in Boston is planning to break ground this summer on a new public art-making complex that will provide direct support for the hundreds of artists who make everyday life in the city of Boston feel lively and full of life. Designed by the firm Gensler, the $50 million museum will encompass a 33,000-square-foot building as well as a new plaza and a library.Located in Dorchester, the new space will host seven hundred exhibitions annually, as well as an exhibition center and a library. The museum is also planning to open a new urban farm in the center of the city, and plans to begin construction this fall.“", "The next Biennial should be held in 2024.\n\n\nSylvia Bensch, a German photographer who focused her work on the twentieth century, has died at the age of seventy-nine. She was a member of the Erhard Rieschberger group, which included the German painter Alfred Neuber, who emigrated to Paris in 1938 and joined Walter de Maria, whose family owned the family car.Neuber-Papert appeared a few years before Bensch and her husband, Klaus, founded the Berlin-based studio Mies van der Rohe. Around the same time, Neuber-Papert began to work on a series of photographs that were both matter-of-fact and powerful in their ability to capture the external world through landscape and architectural forms. The series “Tit and the City” (1982–83) is one of her most famous works, a monumental assemblage work that transforms the city of New York and its surrounding environs. Her work has been collected by the Los Angeles County Museum of Art, the National Gallery of Art, the Metropolitan Museum of Art, the Whitney Museum of American Art, and the Metropolitan Museum of Art; she was included in the Smithsonian’s “", "The next Biennial should focus on the Italian Renaissance and the creation of a new cultural heritage site in the city. The Italian Cultural Foundation has also launched an online portal for the exhibition.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles has welcomed Zoë Preston to its board of directors. Preston is a curator and writer based in New York and Los Angeles. Her work has been exhibited at numerous international museums, including the Los Angeles County Museum of Art, the Los Angeles County Museum of Art (LACMA), and the Gay and Lesbian Museum of Art in New York. She is currently the recipient of an award for outstanding curatorial work at the Gay and Lesbian Museum of Art (GLMA).“We at the Museum of Contemporary Art are thrilled to welcome Zoë to the board of directors,” said board president Kristian Levin. “Her exceptional experience and breadth of intellectual interests make her uniquely qualified to serve as the board’s director. Her passion and creativity will ensure that MoCA’s future is prosperous and that the work of local and international artists is supported. We are confident that her deep understanding of the art world and her ability to connect with audiences, communities, and artists will ensure that MoCA’s", "The next Biennial should take place in 2020, and on the occasion of its reopening, the organizers have created a new award, the Biennial Prize, which will be presented to a Norwegian artist or artist-activist who has made significant contributions to the visual arts and culture of the Nordic countries. The prize will be organized by a committee made up of Kjetil Jørgensen, director of the Sami Museum in Bergen, Norway; Harald Sæther, director of the Aarhus Art Museum; and Ylva Stød, director of the Danish National Museum. The deadline for the biennial as well as for the prize is September 25.After the museum closed on May 31, the first exhibition of the new work by the artist-activists, which focuses on the history of the Danish transgender lobby, “We Are All Different: Transsexuals and the Danish National Socialists” was held in the museum. In addition, the museum has rescued more than 144 animals and is planning to release two new documentaries on the history of Danish euthanasia.\n\n\nThe newly opened Bei Gallery in Shanghai aims to open a branch of the Chinese cultural powerhouse Beijing Opera House. The twenty-sixth", "The next Biennial should take place in 2021. More information about the institution can be found here. James Turrell Gallery, New York: Originally scheduled for October 2020, the gallery will open to the public in December 2021.  Halston Gallery, New York: Originally scheduled for March 2021, the exhibition will now be staged in March 2022. Beth Bradley Gallery, New York: Originally scheduled for June 2022, the show will now be staged in March 2023. Beth Leonard Gallery, New York: Originally scheduled for February 2022, the exhibition will now be held in November 2022. Bethlebore Street Settlement, New York: Originally scheduled for October 2022, the space will now be open on March 23.  Brooklyn Academy of Live Music, Brooklyn: Originally scheduled for April 2022, the show will now be held in January 2024. Brooklyn Museum of the Arts, New York: Originally scheduled for June 2022, the museum will now be open from March 14 to March 20. Burkeley, UK: Originally scheduled for March 2022, the work will now be staged in March 2023. Belfast City Gallery, London: Originally scheduled for March 2022", "The next Biennial should be held in 2021, the same year the twenty-third Biennial of Asian Art will be held; and the tenennial should open in 2021. The five-hour event, entitled “Modern Art”\u0097it will be titled “Massimo Cattelstadt”\u0097will be curated by Pierre Grand, the founder of the Cinéma triennial and a former artistic director of the Museo de Arte Contemporáneo in Venice, which hosts the exhibition.The first exhibition in the new venue will be “The Death of Visuality: The Biennial of Modern Art” (Bienières Artes). The biennial will be held in Bienières, the old city of Venice, and will be organized in partnership with the Louvre. The exhibition will feature works by forty-four artists, including Adrian Piper, George Brown, Maya Lin, and Yinka Shonibare, and will run for twenty-four hours.The new venue’s design was inspired by the old city of Venice. The exhibition will be located in a former cement factory\u0097the former location of the Art Newspaper, a daily newspaper that covered the Venice", "The next Biennial should be the Institut des Arts et de Lettres, in the spring of 2022; the following year, the National Museum of Modern Art, in the summer of 2022; and the fourth, which will be held in 2020.\n\n\nThe Whitney Museum of American Art in New York has appointed Samantha R. Jones, who previously worked as director of the Metropolitan Museum of Art and as founder of the RCA Design Group, as its new deputy director for global engagement. In her new role, Jones will work with the staff to help them understand the museum’s mission and to help them understand how the institution will continue to thrive as a public asset.“We are thrilled to welcome her to the Whitney,” said Whitney director Parramatta Riff. “The combination of her professional expertise, her passion for art and public engagement, and her proven ability to bring people together is an ideal match for our team. Her vision and ability to connect audiences, engage with them, and inspire them are unparalleled.”Prior to joining the Met, Jones was a founding partner of the small, New York–based firm Jones Day, which she ran from 2008 to 2013. During that time, she helped the museum raise more than", "The next Biennial should take place in 2022. In the meantime, the National Gallery of Art in Washington, DC, will mark the theme, “Promise of the Future.”\n\n\nThe Metropolitan Museum of Art in New York has enlisted the services of the Los Angeles–based artist Alexis Jay to create a new series of works that address the history of the city's art-world. Jay, a longtime collaborator of the museum, will develop the new works during a half-year residency at the institution, which is currently undergoing a $100 million expansion, in early 2020.In the new projects, which were organized as part of a five-year, $1 million, nonprofit campaign, the American artist will work with artist-in-residence Jova Lynne to produce a “Historic Landscape,” a series of installations that will unfold over two years. The project will also consist of new public programming and the reopening of the museum's “Canal and Upstairs” galleries, which were closed since April for maintenance, and will be accompanied by a new book, “History of Modern Art in Los Angeles: The Art of Alexis Jay,” which will be published by the board of the Los Angeles", "The next Biennial should bring together contemporary artists from the UK and US to showcase their work across the globe and should also include the first European artist exhibition in the country. The biennial will also include the first-ever UK-wide tour of a biennial, with the exhibition being organised by the Tate.\n\n\nThe Oman Art Museum (SAM) in the capital city of Oman, has released the list of ninety-seven artists and collectors who will participate in the fourth edition of the Oman Art & Culture Biennial, which will take place in the United Arab Emirates from April 22 to May 6. The event will also be hosted at the museum’s new location on the outskirts of the city of Arad, and will run concurrently with the upcoming iteration of the Gulf Cooperation Council (GCC) in Abu Dhabi.The twenty-five artists and collectors who will participate in the biennial are:Oman Akram, Munich: Kunsthalle Neue Städchenberg, Germany; Nina Bech, New York: Museum of Modern Art; Tanja Böhmer, New York: Museum of Modern Art; Lulus Ding, New York: Museum of Modern Art; Orit", "The next Biennial should take place in the year 2021, with the first exhibition organized in the year 2022. The theme for the twenty-seventh exhibition will be “Theatre of Life'. The show will include work by thirty-three artists, including Anni Laudel, a German-born artist who creates works that address themes such as the relationship between art and life; David Pasolini, a Los Angeles–based artist whose work addresses topics of memory and the future; and Pilar Canon, a Palacio de Cultura Mesoamericano, Mexico City, which is currently undergoing a $100 million renovation and will present its first exhibition in the year 2020.“The Arts are everything,” said Mark Bucher, the chair of the committee. “We are thrilled to welcome these thirty-three artists and their teams to the Biennial. The first show,” he said, “will be a retrospective, the second a performance, and the third will be a visual experiment. We are also planning to present several performances in our upcoming exhibition, and we will organize more direct and direct and direct, which was the original idea, in the next show.” Bucher added that the future of the", "The next Biennial should take place in the spring of 2022. “This is the moment of our lives,” said Arash Ghaemi, chair of the Board of Directors of the Kaya Art Foundation. 'We are hopeful that the current exhibition program, which has so far focused on local artists and their collections, can be transformed into a new platform for global exchange, collaboration, and dialogue.”\n\n\nThe Duchy of Cornwall has appointed Catherine Neale as its new Chairman and CEO. Neale succeeds Cara Cunliffe, who will remain at the institution until the conclusion of her term in March 2020. She succeeds Catherine Tate, who departed in May 2019 to take up the post of Secretary of State for Culture and Heritage.“Catherine Neale has been instrumental in bringing the Duchy of Cornwall together with a series of strategic partnerships and strategic initiatives that have delivered a raft of positive results for the Duchy, and made the University of Exeter a leading member of the United Kingdom’s cultural landscape,” said Cheryl Stroud, the committee chair. “Her vision for the Duchy was world class, and her leadership has been instrumental", "The next Biennial should take place in the year 2020.The exhibition will also explore how artworks can be made more resilient to climate change by incorporating lessons from the “new normal.” The 2020 theme is “The Future Is Present.”\n\n\nThe National Museum of Art (NMA) in Washington, DC, has welcomed three new members to its curatorial staff: Brita, a former British artist whose work investigates the American experience; Stephanie Pfeifer, an American artist who creates works that examine the history of the body; and Lisa Pfeifer, an American curator who focuses on interdisciplinary and multi-disciplinary art.The museum also announced that Susana Araujo will serve as the inaugural director of programming; Doris Albert will be the NMA’s curator of the Americas; and Julie Light will be the NMA’s director of international programs.“Brita, Stephanie, and Lisa are all leaders in their respective fields and we look forward to working with them as they continue to define the role of the NMA in their respective ways and shape our future vision for the museum,” said NMA director Christopher Atkinson. “They have the necessary skills and the fortitude to bring important", "The next Biennial should draw from the selections of the current edition and the next three years of the exhibition. We will also work with the Paris-based artist María Berrí\u0097who is currently on the frontline of the struggle against the new colonial regime in the country\u0097to present an innovative new collection of his work.” The exhibition “Spirals in Space” will be on show until March 7.\n\n\nThe National Gallery in London has received a gift of sixty-six works by the late British artist David Hockney\u0097some of which will be on display at its seventh-floor venue, the National Gallery at Hampton Court, during a tour of the institution next month. The works, which were donated by artist-in-residence David Henry Holman\u0097a longtime collector and supporter of the National Gallery who financed the exhibition, “David Henry Holman: A Retrospective”\u0097have been gifted to the gallery by the late artist’s widow, W.W. Mathers, a trustee of the National Gallery.Mathers, who passed away on November 3, 2009, was a longtime collector of Holman’s works and oversaw the collection for twenty-", "The next Biennial should take place in both Barcelona and Venice at the same time, in 2021 and 2024. Sorkin previously affirmed that the workshops will continue to be held in the same venues. In response to the event, the organizers said: “As we continue to deliver insightful and original presentations of our work in partnership with the public, we hope to continue to present innovative and original works in future editions of the Biennial.”\n\n\nNew York’s Metropolitan Museum of Art (MoMA) has become the latest cultural institution to announce that it will shutter its doors on March 31, 2020 to focus on the construction of the $2 billion Far Side Railroad, a new urban mass transit system that will connect Long Island City with Manhattan. The museum plans to open in phases, with the first being a large refurbishment and expansion of its existing space in the fall of 2020 and the second phase of construction, known as the 1760 Project, to open in the fall of 2021.The announcement follows a period of rapid growth in the Met, which has seen its attendance surge since it opened in 1964, when attendance at arts events was at its peak. After a protracted, public-private partnership that included the acquisition of nearly all of Mo", "The next Biennial should focus on the creative and social enterprise sectors, and will present a series of performances, including Massey and David and the Power of Music, in collaboration with the London production team. The next iteration of the UK pavilion will focus on the arts and culture in the capital and will take place in 2020.The pavilion will focus on artists as well as the impact of artworks on social change, and will be housed in a refurbished building in Upper London. The $14m pavilion was commissioned by the Biennial Exposition Board in recognition of the extravaganza’s contribution to UK-wide culture.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines for the display of the city’s first free public art commission, an immersive installation that was meant to be experienced by the public as it opened on Friday, June 13. Instead, the installation, titled City in a Day, and its accompanying program was cut short as the budget of the commission was being increased.The commission, titled “City in a Day” and titled “Scenes from the City,” was supposed to be a public art piece dedicated to the city’s urban", "The next Biennial should be held in the spring of 2020. The 2019 event, titled “The Future Is Present,” was set to be the theme of the biennial’s twenty-fifth edition, which was canceled due to the pandemic.The exhibition’s next iteration, titled “The Future Has Changed,” will be staged at the Museum of Contemporary Art (MoCA) in Los Angeles in late summer. Should the exhibition be relocated to the Los Angeles County Museum of Art, it will be re-created in the same location—the current exhibition will be moved to the Museum of Contemporary Art in San Francisco and the newly created exhibition will be entitled “The Future Is Present. ” The 2020 edition of the event will face a number of challenges. “We’re facing a global challenge,” said Michael Govan, director of the Metropolitan Museum of Art and author of A Future of Difference: 1945–1964. “In the midst of this global crisis, the architecture of the future seems remarkably static—indeed, it seems almost blasphemous to suggest that we should be making room for another twenty-first century. But it is the", "The next Biennial should be held at least once every two years, be curated by a female artist, and include an original short, selected by a female curator. The institution will begin welcoming visitors in 2022.\n\n\nThe Museum of Fine Arts (MFA) in Boston has received a gift of twenty-six works by the late Italian architect and urban designer Augusto Poggi, including paintings, drawings, prints, and sculptural works. The gift includes a set of drawings by Poggi for his series of buildings designed for the city of Naples in the late 1960s and 1970s; a painting by his protégé Maurizio Cipolletta of the same project, circa 1973; and a print of Poggi’s Kathleen Lee, 1977, a contemporary work in an effort to reimagine the role of women in architecture.A retrospective of Poggi’s work, titled “Augusto Poggi: The Art of Building,” will open in the museum on October 31 and will run until December 7. The show will be followed by an exhibition of the works of Poggi’s other protégés, including Doris Salcido and Mario Torri that will", "The next Biennial should be held in 2021, and the twenty-sixth in 2022. A Presidential Award for Excellence, which was presented by President Imelda Marcos, will also be given this year’s edition.The theme of the biennial, “The Past, Present, and Future of the Philippines,” was selected by the biennial’s board of directors from a list of thirty-seven artists. The thirty-five nominees were: Rachael Abad, who was nominated for her work Exhibit For” (2017); Oscar Albizu, who was nominated for The Way We Live,” 2018; Carrie Berndt, who was nominated for The Last Days of My Father,” 2018; and Helen Carmen Miranda, who was nominated for Lost Cities,” 2018.Among the fifty works selected for the biennial’s second edition were works by Cesar Aguilar, Kuro Araujo, Don Siquimi, and Gong Yu. The biennial will select the fifty-one artists who will receive the biennial award this year.\n\n\nThe Democratic People’s Republic of Korea (DPRK) has released the ten artists who", "The next Biennial should be transnational, with a strong focus on local communities. The exhibition should be led by a curator and be organized in collaboration with a national, regional, or local team. This would be the first time that the 'Art of Art' exhibition would be presented outside of Japan. The Biennial will be hosted at the Tokyo Metropolitan Museum of Art (TMMO), which currently hosts the exhibition. The museum will soon have a new twenty-meter-tall statue of the 'Art of Art' artist Rikka Takahashi as part of the museum’s art to modernity’s art series.A selection of works by the winners of the 2019 Manga Award, which is organized by the Japan Foundation for Contemporary Art, will be presented at the museum in the next few years. The winners will be chosen by a jury comprising former president and CEO of the museum, Hideo Takemoto; former director Kiyotaka Horie; former president of the Japan Foundation for Contemporary Art, Nobuyoshi Hiraoka; and former director of the Musée d’Arco-Paris, Emmanuel Toguo.\n\n\nThe Museum of Contemporary Art (MoCA", "The next Biennial should be held at the National Museum of Art, in Washington, DC. Developed by the National Endowment for the Arts (NEA), the exhibition will follow the artist’s three-decade career, spanning from the 1970s to the 2000s.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has revealed that it will not renew the contracts of Roberto Benigni, Rachel Chiu, and Benny Wächter, who collectively charge the museum an average of $2.2 million a year. “Over the past decade, the Met has been working hard to reshape its relationship with its artists and to make them more visible to the public,” said director Christopher Bedford. “Substantial progress has been made, but there remains much work to be done. We are confident that in the coming months and years we will be able to continue to support and attract these extraordinary artists to our gallery, museum, and collection.”In addition to the contracts, the Met will also begin offering free programming to the three artists through its online platform, Projects in the Collections, in April. The free online admission program will launch with the exhibition “The Stigmata", "The next Biennial should be a celebration of all that is new, contemporary, and intriguing in art. It should be about the nature of art, and how it should be viewed and experienced. It should be about the aesthetic, and the esthetic as an aspect of art. It should be a reflection of the spirit, and the spirit itself. We should expect a new simulation, a new exercise, a new experience, and a new reflection. The entry of the fifth pavilion will mark the opening of the exhibition, “Simplicity in 4 Dimensions.” The inaugural exhibition was curated by Yuka Takeda & Iwona Pindell, and curated by SACM. The exhibition was organized as part of the Red Carpet, and will run until January 28. \n\n\nThe Annenberg Foundation in Los Angeles announced today that it has given the arts and culture sector nearly $1 billion in support of its work in helping people get back on their feet after a severe disruption caused by the coronavirus. The $600 million gift, which was made by its board of trustees, includes $300 million for arts and culture.“The Annenberg Foundation is grateful to the board members and staff and to everyone who has", "The next Biennial should be held in 2021.Presently, the museum is planning to construct the 100,000-square-foot, eight-building, thirty-story Leonardo-By-Arts museum, which will be located in the city of Milano-Bicocca, Italy, part of a larger $50 million redevelopment project, and will present the work of thirty-two artists in 2020. The $100 million museum, which will draw an additional 1.5 million visitors annually, is slated to open in 2023.  Like this: Like Loading...<|endoftext|>The Victorian Government has announced a $1bn grant to support the transformation of the Victorian Maritime Museum.  The Victorian Maritime Museum is suffering financially as a result of the closure of the museum, the New York Times reports.For the past two years, the Victorian government has provided $250,000 grants to Museum Victoria and the Darling Art Museum in Melbourne in an attempt to recover some of the $460m in lost revenue due to the coronavirus, which has sickened and killed more than 1,400 people in Australia.The funding initiative was launched in 2016 after the University of Melbourne (UMass) received $160m from the", "The next Biennial should be held in 2021. The current date is November 16–November 22.Following the London Biennial, the London Foundation for Contemporary Art (LFCCA) will stage an exhibition of art in the United Kingdom in December 2020, and LFCCA will host a biennial in 2022. In February 2021, the LFCCA opened an updated version of the London–New York biennial, which has remained closed since April 2009. The museum will also begin a three-day, Wednesday–Thursday, Saturday–Sunday, and Sunday–Monday sections of its First World War exhibition, which will run concurrently with the biennial. The renovation of the LFCCA in January 2021 revealed that it would require more than $1 billion in funding. In February 2022, the LFCCA announced that it would raise the funds through a new ticketing program that would run concurrently with the biennial and the London Olympics. The event was originally scheduled to resume in March 2021.\n\n\nThe Bessies, a New York arts organization dedicated to supporting and extending the work of African American artists, has appointed Lena Chavis as its next executive director. Chavis, who has helmed the organization for nearly two decades, will take up", "The next Biennial should be in 2022.\n\n\nThe Israel Museum in Jerusalem announced today that the opening of the institution’s exhibition “Merry the Witch: The Witches of Middle-earth” will now take place in the city of Nazareth. The exhibition, which is part of the institution’s “Ishram/Ishkal” (Ishram & Ishkal) series, was commissioned by the museum in 2011 and first staged in 2013. The exhibition, which includes works by forty artists and is organized around a theme of the underworld, will now be staged in the town of Nablus. The exhibition will also be accompanied by a new book of the same name, which will discuss the history of the region and Israel, and the institution’s new exhibition “Merry the Witch,” which will focus on the culture of tolerance in the region.“This is a moment of great challenge for us, for we are currently working through the reconstruction of the site of the old colonial-built city of Nablus, and of a new state, a state of Israel,” said Museum head Naama Arad. “The show we are creating will", "The next Biennial should be in May 2020. The biennial will comprise twenty-four artists, including Karina Friel, Alex Garland, and Michael Oakes, plus ten exhibitions, including an exhibition of work by Canadian artist Laura Owens, which opened at the Brooklyn Museum last year. The biennial was established by a group of artists who had founded the journal Biennial Atlanta in 2000, and it has participated in the first three editions. The 2020 edition will mark the thirtieth anniversary of the biennial Atlanta.“The future of the biennial is very much in question right now,” said Nathan Roesler, the executive director of the biennial. “We're not there yet, but we are very much on the journey to find what it means to be a vital art institution.”\n\n\nThe Museum of Fine Arts (MFA) in Boston has received a gift of two dozen works by the Italian artist, filmmaker, and educator Giancarlo Cattelan, who built his studio in the city’s historic Adams-MIT gallery, where he served as an assistant, in the 1950s. The gift, which was made by his friend Gio Ponti, who was a partner in Palazzo", "The next Biennial should be set in the year 2020 and will be a follow-up to the London-based biennial, “The Concrete Experience,” which was held in the United Kingdom in the spring of 2019. “The Concrete Experience: The Life and Death of Pablo” will include work by nineteen artists, including Andrew Kreps, Paul Mpagi Sepuya, and Yoko Ono, and will run through December. The first edition, “The Concrete Experience: The Life and Death of Pablo,” was held in the French capital in March of 2019.\n\n\nThe Museum of the Moving Image (Museum of Painting and Drawing) in New York has received a gift worth more than $150,000 from the Margate-born, London-based artist and philanthropist Peter Sussman. He died last week at the age of ninety-eight.Born in Margate, England, in 1936, Sussman left school at fifteen to start a painting and drawing studio, but he never drew a living thing. In 1947, at the age of forty-six, he quit his day job to become a full-time art consultant for Stanley Blackwood, the British designer who", "The next Biennial should also take place in the city in 2021, and the twenty-second biennial in 2022. The institution is also planning to move its headquarters from Brussels to Künstlerhaus Stuttgart in Germany, and will launch a digital platform that will allow visitors to explore the exhibition’s artmaking history through an interactive platform.\n\n\nThe Art Newspaper reports that New York’s Museum of Modern Art (MoMA) is planning to expand its collection by two hundred works by artists whose works were acquired through the international art marketplaces, including David Caird, Adam Pendleton, Otto Paolo Baratta, and Richard Diebenkorn, and will launch a new payment portal through which visitors can purchase works through the institution’s online shop.The artist-focused museum also revealed that it is reopening the Anne Jackson Gallery, which was heavily closed since the pandemic swept through the US. Founded in 2002 by artist and collector Jack Valenti, the gallery is reopening with an exhibition of work by artist Rachel Whiteread, which will open on September 23. The opening of the gallery will coincide with the opening of the new museum’s first digital platform, an extension of the museum’s", "The next Biennial should be held in 2022. The first event, in 2019, drew some thirty thousand people. While the event will host over five hundred exhibitions, including works on feminism, the birth of civilization, and the African diaspora, the government has yet to announce a specific date for the next edition.Ahead of the 2019 event, the Japanese government launched the 2020 edition of the biennial. Organizers said that the theme of the event would be “living together in harmony and diversity,” and that the exhibition would focus on the historical preservation of the cultural heritage of Japan, and its relationship with other countries. They also said that the exhibition would have an “intensely romantic tone,” and would stimulate “irresistibly tender emotions.” The 2019 edition, titled “rebirth and healing,” featured works by forty-eight artists and was staged in different cities across Japan.\n\n\nThe Carnegie Museum of Art in Pittsburgh has awarded a $10,000 prize to a team of contemporary artists—including Ann Corrigan, Ingrid Best, Jillian C. Fox, and Eric Krasno—who will receive a total of $50,000 in funding from the museum, which", "The next Biennial should be held in 2021. The Biennale de Paris, organized by the French Federal Ministry of Culture in collaboration with the French Ministry of Culture, was canceled in March 2019 amid the coronavirus outbreak. The Berlin Art Biennale, which was scheduled for November 2021, was also canceled. The reopening of the Art Basel Hong Kong, which was originally scheduled for March 2022, was pushed back to April. The opening of the New York Art Fair has since been postponed to April 12–April 19. The opening of Art Dubai has been revised to April 22–April 26. André Breton’s first solo exhibition at the Grand Salon in Paris in April 2019 has been rescheduled to June 20–June 24. The inaugural edition of the Festival de l'Estèm in New York has been moved to June 26–June 28. André Huyghe’s exhibition at the Salon de l'Estèm in September 2019 was also pushed back to June 20–June 28. André M. Peišler’s first exhibition at the Museum of Modern Art in New York has been moved to June 26–June 29.", "The next Biennial should have been in about the same location, in the same year, and with the same objectives as the last one: to continue to engage with the still-unfolding political and social situation in North Korea.Instead, it has become clear that the next Biennial will be even less than the first. In an attempt to dampen the impact of the UN sanctions, Pyongyang has pulled the plug on the first exhibition, cancelled the second, and is preparing for another, presumably much smaller event. The annual event, which was originally scheduled for September 28–September 29, has been postponed twice already, in April and June.The first round of the exhibition, titled “Era of Cultures” (Era of Cultures), opened on September 21. The exhibition, which featured sixty workbooks from North Korea by fifty-seven artists, was curated by Kim Su-kyung, director of the Jeju Art Museum, and first staged at the Museums of Fine Arts in Seoul in 2007. The next year, it was moved to Pyongyang, where it was rescheduled for September 22–September 25.The country has been accused of conducting several nuclear tests and launching missiles into international waters, but Pyongyang has consistently denied any illegal", "The next Biennial should be held in 2021. The festival will be hosted by Faculté de littérature in Paris and will draw an online audience of 150,000. Among the artists who will be featured in the 2019 edition are Barbara Pappalena, Robert Gagosian, Damien Hirst, Helen Cammock, Hélène and Ed Robertson, Jean-Michel Basquiat, Cécile B. Evans, and David H. Koch.\n\n\nFilm-maker Petra Adler-Bond, who championed contemporary art and feminism through her feminist, anti-racist, and anti-imperialist cinema, has died at age eighty-one. The art historian, who championed a feminist, anti-imperialist, and anti-racist vision of art and art history, has been nominated for a Pulitzer Prize.Esther Beno Bongra, the film-maker’s granddaughter, said: “We are definitely on the right track with Petra’s legacy.”In the late 1970s, when Benito Bongra was ten years old, he encountered Werner Herzog’s film American Beauty, directed by Cecil Baldwin, in Italy and decided to produce his", "The next Biennial should focus on the effects of AIDS/HIV/AIDS/CANCER on women and their families, and on the destruction of the planet through climate change. The twentieth edition of Pavilion will take place in San Francisco from November 7 to November 10, 2020. The event will be hosted by the San Francisco Museum of Modern Art (SFMoMA) and will run from October 29 to November 3, 2020. The exhibition will be curated by Nicole E. Johnson, the director of the San Francisco Museum of Modern Art.\n\n\n\n\n\nThe Art Newspaper reports that the Sandstrom Collection in Minneapolis has received a gift of twenty-seven works by the late American painter John Katzenbach, whose work explores the relationship between the body and the landscape in numerous settings, including his studio and his home.Billy Katzenbach, the late, lamented artist’s son and the great grandson of the late painter, donated the works to the Museum of Fine Arts (MoFA) in Minneapolis on December 14, 2019. The gifts include the work The Body in Air (1948), The Dry Heave (1949), and The Light of Night (1952).The works are part of a major exhibition of work in the Sandstrom", "The next Biennial should be held in 2021, the reports said. The Biennale de Lyon, which was canceled due to the coronavirus in March, is scheduled for March 21–March 22, 2021.\n\n\nThe Warhol Foundation, the William E. Simon Museum, and the Museum of Contemporary Art (MoCA) in Los Angeles—which all but disappeared from public view during the pandemic—have agreed to merge, the New York Times reports.The nonprofit organizations will share $3 billion in donations and assets in a deal that will also involve the restructuring of the enormously popular biennial, which was founded by the American architect the same year as the 1979 American Film Institute Awards, and will launch the new organization, the Museum of Contemporary Art, William E. Simon, Los Angeles. The new partnership will also see the consolidation of the Carnegie-designed museum’s collection, which has featured work by artists from Angela Carter to John Mulvey and will be the first to celebrate the museum’s seventieth anniversary.“We are excited to partner with the Simon Museum to further develop Simon’s vision of an extraordinary collection that will showcase the work of artist-centered, curator-driven exhibitions, the Simon Collection’s multi", "The next Biennial should be held in 2020. Its organizers say that they are still in the process of organizing the event and are working with the Metropolitan Museum of Art to find a space in the museum for its 2020 iteration.\n\n\nThe Shanghai Gallery of Fine Arts (SFFA) announced that Margot and Robert Fernandez, the founders of the Miami-based company O2 Gallery, have launched a new organization, the LA DAVE Foundation, to support local artists in the Greater Beijing region. The foundation will work with the headquarters of the Spelman Art Museum and the Institute of Contemporary Art to apply for grants through a program that will draw from sales of works by artists who are under contract to the museum.  The organization will distribute ten thousand dollars from its reserves to low-income artists each year. Filipino artist Rosalind Abad will also receive a $500 grant each year through the foundation. The initiative was inspired by the Beijing-based artist's decision to leave her native Mexico to travel to California and work in the West Coast. Fernandez and Abad were inspired to launch O2 Gallery after they visited the studios of famed contemporary artists, especially Oscar Murillo and Paulo Pei, in China.“We wanted to support artists who", "The next Biennial should take place in 2018 at the newest of the Space-01s, the தின New Renditions, an exhibition that incorporates a contemporary art collection spanning from the seventeenth century to the twenty-first century. The exhibition will be followed by an exhibition of works by the artist Sarah Millar in 2022.“Life-Cycle’s mission is to explore the interconnections between material and conceptuality through the work of artists whose careers span both the twentieth and twenty-first centuries,” said Jacek Wojciechowski, who curated the inaugural Biennial. “I see this as an opportunity for Biennial to expand its musical and visual boundaries with a new-found appreciation for the interaction of art and architecture in everyday life. I am thrilled to work with the talented team of Biennial alumni to create a new biennial that reflects the spirit of Life-Cycle in the newest and most modern biennial.”The inaugural exhibition, “Life-Cycle in Architecture,” featured work by the 2015 inductees Gerhard Klee (1905–1976), Anna Zapata (1905–1982), and Remi Redzepi (", "The next Biennial should focus on creating a more meaningful, personal and permanent legacy of the exhibition by exploring the relevance of a ‘totality' of works in a contemporary context,” said curator and exhibition director Valenta Boyarin. “The future of the exhibition is at stake.”The next edition of the exhibition will take place at the Institute of Contemporary Art (ICA) in Paris in March 2021 and will feature the works of twenty-eight artists working in the fields of dance, design, film, literature, and video games. The artists chosen for the exhibition include Enaam Nadal, El Masryàn, Amadou Diallo, Nima Abou-Rahme, Alex Halderman, Francesco Mavic, Anish Kapoor, Sutabar Maith, and Waseem Rana.Nadia, who has been featured in a number of exhibitions, including the 2017 Abu Dhabi Biennial, was chosen as the 2020 recipient of the Prix de l'Art Contemporain (Paris) for his first solo exhibition in the city since 1996. In recognition of his achievement in advancing the field, the award will be presented to him at the Institut des Arts et lumières", "The next Biennial should take place in 2021. If the application of the festival is accepted, the inaugural exhibition will be staged at the newly renovated St. Andrew’s Church in London, which opened in 2000. The first exhibition following the event will be “The Next Event,” which will be curated by Oslo-born curator Marine Imhof, with chairperson Olivier van de Poijen. In 2017, the third edition of the exhibition was held in New York. The next edition of the Biennial will be held at the National Museum of Scotland in Edinburgh, which opened in 2021 and houses the Royal Institution of Arts in London.\n\n\nThe Walt Disney Company has announced that it is moving the twenty-second season of ABC’s The X-Files, currently airing in select cities across the United States, to February 20, 2022 after the series closed its end of its current run on December 31. The announcement follows a tumultuous year for the cult TV drama series, which was canceled after a twenty-two-episode third season in February 2018. The move comes days after the series’ creators, Chris Carter and Chris Carter-directed series creator/executive producer Mulder and", "The next Biennial should take place in January 2020.  New York City and the Metropolitan Museum of Art will host the next edition in October 2020. The 2019 show, titled Beyond the Limits of One, featured work by fifty-eight contemporary artists, who explored topics such as the nature of existence and the possibility of the sublime.\n\nThe Seattle Art Museum (SAM) has received a gift of twenty-three works from the collection of the late entrepreneur and collector Richard Sender. The works, which will be restored to the institution by Richard Sender Jr., were given to the institution by his son, Richard Sender, in memory of his father, who was one of the industry contributors to the museum.The gifts include Ralph Atkins’s The Programme, 1979, which was acquired by the collection of the late collector Richard Sender, and two works by American painter Mark di Suvero, which were donated by the family of the late Charles and Lillian Doran. The Doran-Pierce family gallery donated the works to the museum in 2015 following a twenty-year purchase of the artist’s work.While the works are currently housed in a special exhibition entitled “The Art of Making it’s Skin,”", "The next Biennial should take place in the spring of 2021.\n\n\nThe Metropolitan Museum of Art in New York and the SculptureCenter in Los Angeles, which are working on a new collaboration, have unveiled plans to merge their operations. The new organization will focus primarily on new art, with ­Metropolitan Museum of Art plans to open a new outpost in 2020 and SculptureCenter plans to introduce new works in 2021. The announcement follows a year of speculation over whether the two institutions will merge.Since January, the Met has been working with SculptureCenter to overhaul the museum’s existing C-terminus. It is also overhauling its existing landscaping and building. The plan was made in order to make the new building more energy-efficient. According to the New York Times, the building will use 20 percent less electricity, using the same amount of energy to make the same amount of bricks.The change will also mean the museum will be able to re-use 75 percent of the building materials, which will be made in the same location. The work will be located in the same building as the museum, along with a second pavilion for the Met’s new “Exhibit for America” and a new", "The next Biennial should take place in September 2020. This year’s edition will run from April 7–April 13, 2020. Its theme will be “Art and the Body: Avant-Garde and Pain” and will include works by thirty-six artists. The artists selected for its exhibition are Jan de Briey, Franz Kline, Robin Kine, Pierre Léger, Marc-Antoine Moët Hennesy, Johannes von Karajan, Jeanne-Claude, Rirkrit Tiravanija and Janet Tyler. \n\n\nThe National Gallery of Canada in Washington, DC, unveiled a $1 billion expansion project today that will significantly enhance its presence on the National Mall, adding an additional 1,400 square feet to its existing collection and a spectacular new venue. The expansion project, which consists of a renovation of the museum’s existing buildings, started in 2017 and is slated to be completed in 2021.“Building 1’s redesign reflects a transformation of the National Gallery of Canada into a better place for contemporary art in America,” said Simon LeBlanc, program manager of the National Gallery of Canada. “The National Museum of Canada was founded in 1826 to house the collection", "The next Biennial should be held in the autumn of 2020. \n\n\nThe Centro de Artes Plásticas in Madrid announced today that it has received a gift of twenty-four works by Nicholas Rojas, The Whistle, The Near, and The Inverted Triangle. The work of the Venezuelan artist will soon be included in the forthcoming exhibition “The Masters of the Universe” and will be presented by the artist at the Biennial of Contemporary Art, New York.The show, which will run from March 25 to March 29, 2020, will feature work by forty-three artists and collectives from twelve countries, including the United States, China, France, Italy, Mexico, Germany, Spain, and the United Kingdom. Rojas’s display is a continuation of his work’s residency at the institution. The artist will be represented by the artist’s solo exhibition at the venue, which is currently under construction.The full list of participating artists is as follows:Nicolas RojasThe Whistle\u0097Conceptual, Mood, and Influence\u0097June 13, 2018, Madrid, SpainNicolas RojasThe Near\u0097June 28, 2018, Madrid, SpainNicolas RojasThe Inverted", "The next Biennial should take place in 2020.\n\n\nThe Metropolitan Museum of Art in New York has been awarded a $50,000 donation from the Annie E. Casey Foundation. The gift is part of a new $250,000 grant program, announced in October, that will support the museum in its effort to become a cultural asset for the greater New York City region. The grants will be used to overhaul the museum’s interior, renovate the Burton-Dorsch Pavilion, and create new programming.“We are thrilled to be making this gift to the Met,” said Marc Glimcher, the foundation’s director. “This is a moment of huge change for our city, and the foundation’s mission is to help make the Met one of the most important cultural institutions in the world.”The Met was chosen as the recipient of this year’s Annie Casey Foundation grant in recognition of its ambitious project to improve the visual and verbal experience of the museum through the management and construction of an auditorium and its ambitious plan to make the Burton-Dorsch Pavilion a museum that will serve as a virtual destination for visitors. “The Met has been a long-standing supporter of the", "The next Biennial should take place in the middle of the year at a location that is convenient to the artist, and should aim to show the work of all three of the artists participating in the exhibition. In order to ensure an open and intimate exhibition, the Biennial should be organized in a way that ensures the artist a space to present their work in the middle of the gallery. The artist should be given the opportunity to present their work, and the Biennial should be given a maximum of twelve months to organize.”\n\n\nThe Museum of Modern Art (MoMA) in New York announced today that it is remodeling its space in the Hudson Yards development, which was underway when the Twin Towers were being constructed, in collaboration with the nearby artists whose works were featured in the exhibition, “Beyond the Point.” The renovation, which was funded by the Katz Foundation and the Farsi Art Foundation, will unveil plans for a new exhibition, “The Story of Architecture,” in September 2021.“The redesign of MoMA reflects the growth of modern art in the city and the museum’s mission to present it, and the values and aspirations of our curators,” said Steve Deoni, director of the", "The next Biennial should begin in January 2020 and could be hosted in the heart of London or the Museum of Modern Art. The event will consist of a series of lectures, screenings, and special projects by individuals and groups. The first lecture will focus on the importance of visual arts in the formation of an open, diverse, and inclusive society. The second exhibition will focus on the histories of women and their work, and the third exhibition will present new works by artists whose work explores the implications of images and the body.Philip Hammond, chair of the board of trustees, said: “This is a great opportunity for British Artists to show the world that they are truly at home in their country, having a go at things they don’t normally do and enjoying the alternative of a budget-conscious life. We are all looking forward to seeing the first works presented by artists who are at the forefront of challenging the status quo and rethinking the role of art in our lives.”The 2019/2020 biennial, “East African Sculpture,” was hosted by the Museum of Modern Art in London and the Nigerian artist and educator Abdullahi Mhlumili. In addition to exhibiting work by some twenty artists, the event also featured", "The next Biennial should be held in 2021.\n\n\nThe biennial has announced that it is revamping the 2017 edition. The program will now be held in both Los Angeles and New York City between November and March, with a new theme—\"The Archaeology of Noise: From Noise to Noise”—and a new installation by artist and scholar Antoine de Saint-Exupéry. The theme is related to the “ephemeral rhythms of our environment,” the artist explained in a statement. “The work uses music and sound to examine the anthropogenic climate crisis and to think about the way we create the noise that we breathe, the noises that we hear, and the places that we go.”The artist’s abstract sculpture, which has been featured in works by groups such as the New York–based collective Snail Mail, and works by artists such as Paul Gauguin and Alice Aycock, will now be seen from the inside out as the artist is planning to move to a larger theater. The reconstruction will be a “song of two vibratory sounds,” according to the artist. The episode will take place in the second half of the year, between November 3 and November 5, 2020", "The next Biennial should take place in the city in 2020. If it does, the show will return to the city for another run in 2022.\n\n\nThe Hirshhorn Museum and Sculpture Garden in Washington, DC, has appointed Laura Spilman as its next chief executive officer. Spilman joined the Hirshhorn in April 2019 as deputy director and chief curator. During her tenure, she was promoted to deputy director and chief curator, and organized the acquisition of nearly twenty works, including the age-of-heroes, a retrospective of photographs by Mark di Suvero and Sergei Gersenko, and the “Sedona Corridor” (Sedona, Arizona), a presentation of works by twelve artists, including Juan Carlos Pérez-Vidal, Squeak Eileen Oxtoby, and Rachael Todd, as well as the 2019 exhibition “Michelangelo in His Own Image: The Exhibition of Michelangelo” and the sculpture “Diane Arbus: The Eulogy,” which are on view until December 18.“Laura’s first focus as director was to develop and cultivate the relationship with the Hirshhorn and ensure the long-term success of", "The next Biennial should be held in the spring of 2020. All other dates are subject to change.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, has appointed Susana D. Olmi as its next executive director. Olmi will join the museum after serving as chief curator and head of the contemporary art department at the Los Angeles County Museum of Art (LACMA), where she has been since 2017.“We’re delighted to welcome Susana to our team, and look forward to seeing where she takes us next,” said LACMA director Michael Govan. During her tenure at LACMA, Olmi curated the museum’s inaugural exhibition, “The Old Man and the Sea” (2018); “Revolt at Any Cost” (2017); and “Oblivion’s New Faces” (2016).“Oblivion’s next exhibition will be ‘Ordos: The Games of Nature’ and will be organized at the New Museum, the Museum of Contemporary Art, Los Angeles, and the Metropolitan Museum of Art (MoCA); the exhibition will open on September 8.”\n\n\nThe New York Civil Liberties", "The next Biennial should be held at least twice a year. The next International Biennial should be held at least once a year. We need a new international standard for sustainable research and exhibition that will serve as the guiding principles of all our activities. We need a new international platform for the exchange and dissemination of art, ideas, and research across cultures and boundaries. We need a new international initiative to advance the understanding and appreciation of the cultural heritage of the former colonies. We need a new international program to provide more opportunities for cultural exchange and cooperation between the UK and Indonesia. We need a new international program to promote the art and culture of small and mid-size countries. We need a new international program to examine and record the spiritual and cultural heritage of the former colonies. We need a new international program that will introduce and foster the Japanese art and culture of the former colonies in India, Sri Lanka, Nepal, Burma, and Turkey. We need a new international program to promote the art and curiosities of the former colonies in India, Sri Lanka, Nepal, Burma, and Turkey.We need a new international program that will present new opportunities for artists and curators from the former colonies. We need a new international", "The next Biennial should be held in 2021, when the museum will be celebrating its thirteenth anniversary, in order to better reflect the city’s history and culture. [Update: August 26, 10:45 AM] The museum announced that it will open a new branch of the museum in the former Russian state St. Petersburg in 2021. The twenty-third edition of the exhibition, “The New Russian World,” will run concurrently with the museum’s current season, “The Saint Petersburg Museum of Art,” which has previously been suspended for a month due to Covid-19.The new museum’s exhibitions and collections will include “The Last Days of Alexander Kerensky,” a retrospective of his early artworks; “The New York Group,” a new show celebrating the exhibition’s artists; and “The Moscow Group,” a new exhibition featuring works from the museum’s collection from the Russian city of Pskov.The museum also recently completed the renovation of the museum’s newly constructed and expanded building, which was inaugurated by Kerensky’s widow, Nadezhda Kerensky, in", "The next Biennial should take place in 2019 and will include the work of twenty-nine artists. In addition, the biennial will host a number of exhibitions, including the annual “Abandon all hope—” (2019), with the exhibition “Evening Design,” (2019), and “Painting in Architecture” (2019). The biennial will also have a “Quarto exhibition,” which will be curated by Iwan Wirth.The biennial will mark the founding of the institution’s new public program for contemporary art and will have an outdoor location in the city of Florence. The new venue will be inaugurated by an exhibition of paintings by Oscar Cesar (2019), which will inaugurate the biennial’s pavilion.\n\n\nThe National Museum of Fine Arts (NMFA) in Atlanta has received a gift of more than eighty works by the late collector and educator Leo Angelo (1942–2015). The donation, which includes arts and design works by projects by Jay-Z, Beyoncé, Tilda Swinton, Helene Sagni, Mark Rothko, Wolfgang Reimann, and other luminaries, along with more than 1,500 other works,", "The next Biennial should focus on the ways that science fiction and fantasy contributes to and informs social and political movements in our societies, specifically the ways that fantasy and science fiction depict the future and the past.” The 2019 event will take place at the Museo de Arte Contemporáneo in Madrid.\n\n\nThe Museum of Modern Art in New York has appointed Charles Gass as its next director. Gass will be responsible for overseeing the collection, development, and exhibitions of the artist’s work. He succeeds Mary Pat Bonner, who retired last month after twelve years leading the museum.“The new leadership team at the Museum of Modern Art is thrilled to welcome Charles to the fold,” said museum director Glenn Lowry. “Over the last twelve years, Charles has been instrumental in ensuring that the Museum of Modern Art has been a cultural and intellectual powerhouse. We are proud to have him as director and to be able to introduce him to the many distinguished artists who have shaped the Museum’s collection and the Museum’s relationship with the world.”During his tenure, Gass has organized numerous exhibitions, including “Origins of Modern Art” (2019) and “The Art of Painting", "The next Biennial should open in 2021. The 2020 theme is “Spirituality and Politics: The Case of Japan” and will be the theme of the biennial’s second edition, “In the Future of Spirit,” which will open in 2022. The 2019 edition of the exhibition drew 1.2 million visitors to the museum.\n\n\nThe newly opened, $20 million Whitney Museum of American Art is planning to add more than five hundred paintings and sculptures by artists whose work has recently been shown at the Whitney in the next few years and to create a new space for the exhibition. Titled “Painted Cities,” the exhibition will feature more than three hundred works, many from the Virginia/New York area, which will be organized in the museum’s new building, the Terreformers’ studios, and the Terreformers’ art studios.“The Whitney’s commitment to advancing the careers of African American artists is exemplary,” said Daniel H. Pink, the Whitney’s director. “As an institution dedicated to African American artists, the Whitney is in the forefront of a long-term research program that will help to advance the work of black artists.", "The next Biennial should be held in June 2021 and the next in June 2022. The German government, in an attempt to appease the artists, announced that it will contribute 1 billion euros to help the Arts and Culture Ministry (AM) with the management and operating costs of the new annual event. The money will also be used to develop a new biennial, BiH, that will focus on the interdependence of art and culture in a contemporary context. The AM also announced that it plans to create a new central fund for biennial exhibitions with the aim of supporting the production of exhibitions and critical works, which will be organized in a manner similar to the AMF, the Berlin Art Museum für Kunstverein (Germany), which currently holds the 2018 Art Basel exhibition. The initiative was inspired by the German artist Markus Birnbaum, who died in 1975 after a long struggle with Huntington’s disease. Birnbaum’s grandson, Andreas Birnbaum, launched a foundation dedicated to the memory of the late German architect Petru Preiss, who is survived by his wife, Sigrid, and their son, Hans Birnbaum. The move to create a new institution was made in an attempt to undo", "The next Biennial should be held at least annually until 2028, but no date has yet been set.\n\n\nAfrican American Museum (AAM) in Boston has appointed Tanisha Evans as its next executive director. Evans will assume her responsibilities in April. “We are pleased to welcome her to the organization,” said museum director Matthew Teitelbaum. “As a curator and educator at a time when contemporary art is gaining ground in ways that were not possible a generation ago, she embodies the spirit and vision of the AAM.”Evans comes to the museum from the Metropolitan Museum of Art, where she currently serves as a curator of the Shiloh Collection, which includes works by Black, African, and Native American artists, and will begin her position in April. She succeeds Mary Clare, who departed in the summer of 2019 to head the Joan Mitchell Center for Art at the Museum of Fine Arts in Boston.“I’m excited to be joining this amazing staff and board,” said Evans. “Their vision, commitment, and energy is what makes the AAM unique. We are fortunate to have had her on staff since October 2019 and to have had her since she began her museum career.", "The next Biennial should be in February 2019.  The next exhibition will focus on the history of architecture from the perspective of the indigenous peoples of New World civilizations.  The next exhibition will be dedicated to the history of art from the perspective of the indigenous peoples of the Americas.  The next exhibition will be dedicated to the history of art from the perspective of the indigenous peoples of the Americas.  The next exhibition will be dedicated to the history of art from the perspective of the indigenous peoples of the Americas.  The next exhibition will be dedicated to the history of art from the perspective of the indigenous peoples of the Americas.  The next exhibition will be dedicated to the history of art from the perspective of the indigenous peoples of the Americas.  The next exhibition will be dedicated to the history of art from the perspective of the indigenous peoples of the Americas. The next exhibition will be dedicated to the history of art from the perspective of the indigenous peoples of the Americas. The next exhibition will be dedicated to the history of art from the perspective of the indigenous peoples of the Americas. The next exhibition will be dedicated to the history of art from the perspective of the indigenous peoples of the Americas.The next exhibition will be dedicated to the", "The next Biennial should be held in 2020, with the date to be determined in consultation with the local community. The theme of this year’s Biennial is “theological transformation.”\n\n\nThe Museum of Fine Arts (MFA) in Boston has received a gift of twenty-nine works by renowned contemporary artist Imane and her husband, Kader Attia, both of whom are African American. The works, which were donated by MFA’s founder, Abe Foxx, and his wife, Sue, were purchased by the Foxxes after the institution’s inaugural exhibition “Imane and Kader” in 1993.“Imane Foxx, Kader Attia, and the History of Art: Imane and Kader” is currently on display at the Foxx Gallery, which is adjacent to the museum, and will open to the public in 2020. The first exhibition of Imane’s works, which spans forty years and ten exhibitions, is currently on view in the exhibition “The Evolution of African Art.” The second exhibition, “Kader Attia, Imane Foxx, and the Rhythm of the Rain,", "The next Biennial should be held in the spring of 2020.The full list of participating artists is as follows:\n\n\nNew York, NY: Artists Resnick Gallery, New York: Artists Resnick Gallery will be exhibiting work by twenty-five artists since its inception in 1970. The biennial will be hosted at the Brooklyn Museum, on the Lower East Side, and will run from March 16–March 20.The exhibition will feature work by Mel Chua (Cambridge, UK), Nina Gelb (New York, NY), Marianne Gay (New York, NY), Elyn James Nesmith (New York, NY), Cindy Sherman (New York, NY), Paul Schell (New York, NY), Sia Solow (New York, NY), John Hurley (New York, NY), and Linda Evangelista (New York, NY), among others. The biennial has also been curated by John Leonard, John Zakkowitz, and Hannah St. James, and will be presented by Artforum.Beginning on the Lower East Side, the exhibition will feature work by twenty-six artists, including Guy Bentley (New York", "The next Biennial should take place in the city in 2021.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, has appointed Mark B. Smith as its next executive director. Smith will lead the museum from March 15–March 16, 2021. He succeeds Jared Fogle, who retired in March after eighteen years at the helm of the institution.“We are thrilled to welcome Mark to the MoCA family,” said Helen Shachter, director of the institution. “Mark brings a new perspective and an extraordinary breadth of experience to the leadership, curatorial, and development of MoCA. We are confident he can help us reach our ambitious goals for engagement with our community and communities across the globe.”Under Smith’s leadership, the institution has expanded by more than twenty-five thousand square feet in a single year, grown the collection by more than twenty-seven thousand, and added more than eighty galleries and underground exhibitions. He also oversaw the revitalization of the third floor of the museum, which recently received a major facelift with the installation of the MoCA Museum of Art.“I’m thrilled to have Mark on board for this great journey,” said Mary Anne Carter, MoCA", "The next Biennial should celebrate the voices of this generation and the continuing legacy of the institution’s founder, Sir Gareth Stedel, who has been a trustee of the Biennial since its inception. The new term, established in 2022 and inaugurated by Sir David Walliam, will be an opportunity for artists to collaborate with the museum on a biennial scale. The museum is currently constructing a new building to house the biennial’s collections and is in the process of creating a new curriculum for the museum, which will include a new exhibition dedicated to the theme “The Future Is Now.”The biennial will be held in the museum’s new building on the ground floor of the Tate, which is being constructed in the arts district of Coventry, England. It will open in 2023.The museum’s director, Maria Balshaw, said: “We are delighted to be working with the artist and public to create a new series of performances and installations that reflect the spirit of the Biennial. This is an exciting time to work with an international team of curators, artists, writers, producers and architects. We invite you to join us in creating the next Biennial. We will keep you", "The next Biennial should include a survey of the exhibition, and a discussion of the archaeology of the Black Lives Matter movement. “The process of in-person engagement can be a transformative and liberating experience,” said Artnet editor-in-chief Sophia Al-Sawy. “We look forward to the preview days and to the curated exhibitions of work in the future.”\n\n\nWhen Elisabeth Kubler-Rossen, a German artist whose series “Germans Against Gerecht” (1942–1963) was inspired by German artist Karl Lagerfeldt, decided to create a new work, “One Hundred Years of Grecht” (2016), she did not expect the response it would receive. The work was selected for its “inversion of the traditional definition of art,” in which the puppets are artists using their own bodies to address issues of their day, and was awarded the silver medal at the Bauhaus Berlin in 2017.“I had no idea what was going on with the award until I received it last week,” Kubler-Rossen said in an interview. “I was not expecting such an enormous response, but I hope", "The next Biennial should be held in 2022, featuring works by thirty-four artists from Yemen, the Arabian Peninsula, and neighboring countries. The exhibition should also attain a maximum of twenty thousand visitors.  The deadline for entries is September 25, and the duration of the exhibition is three weeks. \n\n\nThe American Ballet Theater (ABT) has appointed John Bradley as its next director. Bradley will assume his post on June 30. He succeeds Elizabeth Peyton, who departed the organization in the spring of 2019 to become president and CEO of the New York City Ballet.“John Bradley’s leadership style, intellectual rigor, and deep commitment to theater make him the ideal candidate for this important role,” said ABT artistic director Michael Massey. “He will be instrumental in maintaining the high standards expected from our team.”Bradley succeeds Mark Halperin, who will retire on June 30 after sixteen years at the helm of the organization, and will take up his post in June 2020. Halperin commented: “Over the past twelve years I have worked closely with John to ensure the organization’s long-term sustainability, both on and off the stage. I’m confident he will deliver on", "The next Biennial should take place in November 2020.\n\n\nThe Régional Museum des Beaux-Arts (RMB) in Paris has appointed Henri Béchard as its new director. He succeeds Philippe-Yves Lenoir, who was hired as the institution’s director of collections in October and leaves in May 2020, and will take up the post in November.Béchard, who also serves as director of the Hôtel de Paris, has helmed the RMB since 2016. In his new role, he will oversee the development of the museum’s collection and exhibitions in the new academic year, the 2020–2021 year.Under his leadership, the RMB has undergone a major transformation. Its collections are now organized in a modular fashion and are made available online. The museum now boasts nine thousand works, with the majority of the works in the collection housed in its basement. The museum also plans to start a new education and research center called the École des Beaux-Arts, which will be housed in a former munitions factory in the city, and will double the size of the museum.The renovations will also allow the RMB to engage more deeply with local communities and will introduce opportunities for cultural exchange", "The next Biennial should take place sometime this fall.\n\n\nThe collection of the Museum of Fine Arts (MFA) in Boston, Massachusetts, is currently undergoing a major expansion. The institution’s new home, the Museums Authority of Massachusetts, is renovating the museum’s collection, which comprises more than 2,600 works, and is preparing to open a new, state-of-the-art venue, the Richard Rodgers Center, in summer 2021.The expansion includes the construction of a new 750,000-square-foot building that will house the museum’s permanent collection, the newly renovated Richard Rodgers Theater, and the newly renovated Art Gallery. The expansion also includes the renovation of the existing exhibit galleries and the installation of new works by contemporary artists. The Richard Rodgers Center will serve as the home of the museum’s annual Fall/Spring Symposium. The action is part of a broader plan to improve the public’s experience of the museum by expanding its public pathway and by adding new galleries, classrooms, rooms for educational programming, and public art projects.“The expansion is part of a comprehensive strategy to deliver on MFA’s promise to be an innovative and forward-thinking art institution that inspires and", "The next Biennial should arrive in early 2020, following the conclusion of the Tamil and Nepalese Massy-Maliybali campaigns in mid-January. The rest of the year will be devoted to curriculum development and public engagement, and will feature guest curators and occasional solo presentations of works by artists and other curators. “We are deeply indebted to our partners and friends in the arts, who have encouraged us to explore the full range of contemporary and contemporary art and to build bridges between different communities through the exchange of art and ideas,” said Ravi Shankar, chair of the board of trustees. “This year’s opening is an opportunity to fulfill that promise by bringing together the many artists currently living and working in the same space and to create a new kind of public space for their work and their world.”\n\n\nThe Metropolitan Museum of Art (MoA) in New York has received a gift of more than one hundred works by the late artist and activist Cornel West, including fifteen works by a collaborative project titled “Beyond the Frame,” which was organized in collaboration with Joanna Kamm and John Akomfrah, and four works by the late New York City’", "The next Biennial should take place on May 25 and is expected to be held in 2021. “The newly established panels will have the opportunity to present their work in a variety of ways including exhibitions, media, readings, talks, and performances, and will be given a platform to shape the future of the exhibition,” said Biennial director Ramon Angell. The first screening of the new exhibition will take place at the newly established Museum of Contemporary Art (MoCA) in Los Angeles on September 12. The first exhibition dedicated to the new work will open at the organization’s mission site in the city of Barcelona in November 2020.The museum also revealed that the first show dedicated to artist-built landscapes will open in May 2021. The show will be curated by Susanne Vlaiche. The theme “Building and Movement,” will be “Building the Future,” and will focus on the practice of contemporary art in both physical and cultural environments; it will also include the work of Cory Doctorow, Arsht Kosten, Léonier Moll, Yinka Mekgigi, Joachim Prokofsky, and William S. Burroughs.\n\n\nThe opening of Collè", "The next Biennial should focus on 'Global South: The Power of Color in the Making of Modernity” (2019), by Zheng Wenliang, with the work due to be presented in October 2020.The third one is a retrospective of the work of Jin-Sung Park, whose work explores colors and the color wheel in relation to the human body and will be presented in February 2021.  The fourth one will be a personal retrospective of the late painter Kiki Smith, and will be presented by the artist in November 2020.\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Brooklyn-based artist Isaac Chinn as its next director. He succeeds Wangechi Mutu, who was appointed last month, and will take up the post on January 6, 2021.  Chinn, who is the author of nine books, including The Color Wheel and the Color Psychosis Project (2018), is also the creator of works such as All In A Day’s Remember: Color and the Meaning of Life (2017), which is based on his experience traveling through Africa, the Middle East, and Central and South America, and Color and the Hellscape (2018), a", "The next Biennial should be held in the spring of 2020. The next Art Basel Masters will be held in the autumn of 2020. The next São Paulo Bienal will be held in the spring of 2021. The next Tokyo Triennale will take place in the autumn of 2021.The next London Art Biennale will be held in the autumn of 2021. The next Berlinale will take place in the autumn of 2021. The next Venice Biennale will be held in the autumn of 2021. The next Venice Architecture Biennale will be held in the autumn of 2021.The next Art Basel Hong Kong Open will take place in the autumn of 2021. The next Art Basel Hong Kong Tour will be held in the autumn of 2021. The next Hong Kong Art Fair will take place in the autumn of 2021. The next Art Basel Hong Kong Festival will be held in the autumn of 2022. The next Art Basel Seoul Open will be held in the autumn of 2022. The next Art Basel Seoul Tour will be held in the autumn of 2022. The next Art Basel North America Online will be held in the autumn of 2022. The next Art Basel West Asia Open will be held in the autumn of 2022. The next Art", "The next Biennial should be held in 2021.The new exhibition will be organized as follows:Biennial is dedicated to reflections on the bio-physical in the service of the most important contemporary work of the artist at the time, the work of the Swiss artist-artist-director who was one of the first to develop the concept of a \"living organism.\" The exhibition will also feature the work of the new generation of artists, who are represented by the biennial. The selected artists will be honored at an open-air ceremony at the artist’s New York studio in September.The Biennial will additionally serve as a platform for the experimentation of new and existing technologies and will be inaugurated by the biennial’s inaugural exhibition “Avant-Garde: Modernism” (2019) with sixty works by thirty-seven artists, including the Swedish artist Lars-Kasper Bakker and the American artist-activist John Paul Jones. The exhibition will also explore the complex relationship between art and technology.\n\n\n​The Huntington Library in West Palm Beach, Florida, has released the collection of photographs and films that comprise the work of Michael Rosenblum, a Huntington-based, New York–based collector, and his long-time", "The next Biennial should focus on “The Unfinished Business,” a selection of paintings by Bechmann, which were on view during the exhibition. The exhibition will also focus on the artistic traditions of the contemporary West, including the French and the Japanese, and will be open to the public from January 6 to January 8, 2019.\n\n\nThe Edinburgh Art Gallery (EAG) announced today that Lily James as part of its inaugural partnership with the National Museums Scotland has been selected as the recipient of the 2021 Intercollegiate Book of the Year Award. The award was announced by Director and CEO of the Edinburgh Art Gallery John McAllister and director of the Metropolitan Museum of Art, Sir David Murray, in partnership with the National Arts Council. The partnership marks an expansion of the EAG’s work in the field of storytelling. “We are delighted to also be working with National Museums Scotland to explore new ways of supporting one of our great British traditions,” said McAllister. The partnership aims to develop new ways of using the collections of the Met and the National Museum of Scotland to encourage and support the curating and research of contemporary art. As part of the initiative, the EAG will", "The next Biennial should be held in 2020 and will be inaugurated with the exhibition “NIRIN,” a collaboration between STEVEN HARRISON, DONALD NEAL, ELIZABETH NEWTON, PATRICK JULY, PETER WILSON, and JULIAN WIRTH, which will be on view through February 29, 2020. The show will continue with “TERROR,” a retrospective of the work of Cindy Sherman, “MAYA HARVEY, and NIRIN HARRISON” and will open on May 5.\n\n\nIn a landmark ruling, the US Supreme Court on Thursday dismissed a lawsuit by the descendants of slaves who were briefly executed in the US after the Civil War, reports the Art Newspaper. The ruling was a victory for the eleven descendants, which were seeking to have the infamous act of removing a Confederate monument removed from a public park commemorating slaveholders and put before a public vote, the Court ruled 5–4. Justice Anthony Kennedy wrote for the majority: “Nearly three-quarters of a century has passed since the South abolished slavery, and the Court has never before held that", "The next Biennial should be held at the new museum in the fall of 2020. The announcement was made in collaboration with the presidents of the university and the city of Cambridge.The exhibition, which will be curated by Elliott-Léger, will take up themes such as the history and vision of London’s Westminster Abbey, the future of the City, and the new exhibition, “Charlotte Albee and the World,” which will examine Albee’s work from the perspective of a transdisciplinary artist. \n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, has received a $500,000 donation from the Small Business Administration (SBA), an organization of small business owners and entrepreneurs. Through its Small Business Grant Program, the agency will award around $1 million annually to small business owners and entrepreneurs in Los Angeles County through June 30.Applicants must be able to show proof of a one-to-one comparison of their income and expenses to those of a similar sized urban community in the county. The grant will cover operations expenses, including staffing, administration, and legal fees, as well as rent, utilities, and food. The program is a response", "The next Biennial should serve as a launching point for probing the concept of “life and death.” The theme of this year’s event will be Life and Death in the Cinematic. To celebrate the milestone, the museum is creating a new exhibition, “Life and Death in Film,” which will be presented by the museum on December 3, 2020. The museum will be closed until March 21.\n\n\nThe Art Newspaper in New Delhi has revealed that the Indian Institute of Art (IIA), Madras, has appointed Asha Mohan as its new global director. Mohan comes to the institution from the New Delhi-based firm L.A.E.I.N. (Lexile & James, Inc.), where she leads a roving curatorial team that works with artists and groups to present new exhibitions, seminars, and performances.“I admire her work and her ability to take risks and not only to present new works, but to also develop and foster the studio of those artists,” said Malcolm Patchett, head of the IIA. “In my opinion, her work is a great example for what we can do as a network.” The show,", "The next Biennial should be held in 2020.  The first exhibition took place in 1909. The second was staged in 1968. The third was staged in 2013. The fourth Biennial was staged in 2018. The fifth was staged in 2004. The sixth was staged in 2017. The seventh was staged in 2009. The eighth Biennial was staged in 2007. The ninth was staged in 1996. The twentieth was staged in 1993. This year’s event will be hosted by the same architect, the same team, and the same people who have staged the Biennial in the past, and will include works by eighty-six artists and collectives. The list of exhibitors includes David Bedford, Gillian Brown, Carolyn Bishop, Christina Caltoni, Talla Bonham-Harrison, Kiki Smith, Mike Kelley, Laura Owens, Christopher Wool, and Martin-Luther. The ten-day event will run from February 8–February 14. According to the Art Newspaper, the centenary celebrations will be marked by a “sophisticated multimedia exhibition, featuring works by the newly commissioned artists, as well as a special message delivered by the Internationale.” The 2020 theme", "The next Biennial should take place in November 2021. Although the institution has yet to announce a date for its reopening, the museum will consider any postponement or reopening as a good sign. The museum is also working on reinstating the first installation of the new piece, “The Trial of Darlene West,” which will be on view in September 2022. The institution has already received $2.5 million from the city of Los Angeles.\n\n\nA group of artists and activists have launched a campaign to hold the British Royal Shakespeare Company accountable for its connections to the Royal Ulster Constabulary (RUC), after it published a statement claiming that it is “re-evaluating its relationship with the Royal Ulster Constabulary” (RUC) and will “take a comprehensive view of its history and future relationships with all stakeholders, including artists, local authorities, the RUC and the wider society.”In the statement, the Royal Shakespeare Company said that since 2015 it has “worked closely with the police and other relevant agencies” and that the new powers introduced by the UK government in the wake of the RUC’s recent cutbacks will “make it harder", "The next Biennial should take place in December.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has awarded $1.4 million to the artists and artists-run nonprofit Ghetto Works, which was founded by João Pimentel, Jacques Delat-Beuve, and Frida Kahlo.The grant was made possible through a $400,000 reimbursement from the NYC Cultural Fund, which also grants $100,000 to artist-run organizations annually. The grant will also provide funds to help the organization through its reopening, which will take place in five months.The three founders of Ghetto Works—Joao Pimentel, Jacques Delat-Beuve, and Frida Kahlo—have received $500,000 in support of the project, which aims to expand the field of the Brazilian artist-built, and to create opportunities for emergent artists and their families to raise funds for the organization. The reopening will take place at Ghetto Works’s new headquarters, a former dairy barn in a working-class, Jamaica neighborhood of Manhattan, and will focus on facilitating the relocation of families", "The next Biennial should be held in 2020 and will take place in the city of Kaiserslautern, Germany, as part of the Japan Foundation’s (JFF) 75th anniversary celebrations. The inaugural edition, “The Fifth Element,” will be the first to present a performance from each of the new three-dimensional artists. The exhibition will also highlight the work of legendary German artist Franz Schäfer, whose work is often used as a model for the new work from the Italian artist Silvia Meneguzzo.“The Biennial is an undertaking by many talented people, simultaneously captivated by the materiality and the artist, and by the one and all qualities that permeate these materials,” added Lisa Lippard, director of the JFF. “This is an exciting time to be a part of the development of the new work. I am consciously incorporating elements of the past in the design and production process, and am confident that the result will be a new generation of artists.”The biennial, which was established in 1980 and first opened in 1983 in Kassel, will continue with a program of performances, residencies, workshops, tours, lectures, and performances at locations in the city", "The next Biennial should be in December 2022.The full list of major works selected for this year’s event is as follows:The list of participating artists is as follows:The full list of participants is as follows:Martinins, Emma and Gilbert, Lydia Kander, David Michôd, William Morris, Natalie Stroud, Sylvia Rivera, L.H. Luhn, Nina Turner, Katherine Tate, and Tanya Veroni, Linda Willis, Julia Wilson, Kathy Wood, Catherine Østvall, and Jennifer D. Vaughan, and The Dreamers, Olivier Bénétière, and Hans Hollein, Lydia Davis, Michael Malin, and David Silver, and Oliver Hollein, The Short-Forms, Kate Marlow, and David Weinberg, and Kiki Smith, and John Williams, and The Three Heresies, and The Swarm, and Brigid Waring, and Reda Jawad, and Jill", "The next Biennial should take place in April 2021. The festival’s board chair, Ana Paula Alves, said: “We are very happy with the performance, with the exhibition, with all the works that were selected for the show. The show is hugely popular, with more than 6,000 visitors every year, and in that time the festival has attracted additional partners including the PAMP Foundation and the Museum of Contemporary Art, in the city of São Paulo. We will continue to support the show and the artists. The next show will be a celebration of the work of Félix Ferrer, José Ílvarez-Zarri, and a special exhibition of work by Agustín Pérez-Oliveira.”\n\n\nNina Turner, the British artist who pioneered the field of sculpture and whose large-scale works evolved from drawings into sculptural installations that required an intimate knowledge of engineering to create, has died at age ninety-eight at her home in London.Born in London in 1922, Turner began her career as a landscape and architecture photographer before she enrolled at the School of Visual Arts in 1946, where she met and married artist Robert Mapplethorpe. The couple married in London in 1948", "The next Biennial should be held in 2020, but the timeline for its reopening is unclear. Since the hospital closed in 2011, the exhibition has been a platform for feminist, social justice, and environmental activism. The exhibition has been staged in the hospital’s campus, in a [Kohn Gallery] building adjacent to the museum, and at the Kohn Galerie in Berlin, among other locations. The exhibition will also be staged at many other locations around the city, including at the Städelschule Kreuzfeld (Kunsthalle Schloss Köln), the Beyelerische Kunsthalle Stuttgart, the Kunsthalle Basel, the Kunsthalle Stuttgart, the Kunsthalle Stuttgart, the Kassel Kunsthalle, and the Künstlerhaus Hannover. The exhibition will be curated by Erika Büchtern, the curator of photography at the Kunsthalle Basel. Commenting on the upcoming exhibition, the museum said: “The theme of the first Biennial was 'the future of art. But we could not have chosen an ideal time to present this. The predicament of the artists in our exhibition is a", "The next Biennial should take place at the State Museum of Fine Arts in Seoul, which opened in 1998; and in 2021. The 2020 event, titled The Future Is Present, was exceedingly ambitious, exhibiting more than 30,000 objects from the collection of the late Swiss artist Helmut Newton. The artist's family will also have its own museum, the Newton Collection, in New York, the Newton Museum of Art in Cambridge, Massachusetts, and the Newton Museum of Art in Long Island City, New York. The museum will be housed in a Fifth Avenue building designed by the Swiss architect Christian Stadelmädchenk, one of the six architects behind the institution’s main campus in Bern.\n\n\nThe Museum of Modern Art (MoMA) in New York announced today that it is removing more than sixty works by artists whose work was previously featured in its annual retrospective, “The New Art,” which was held last year at the Kennedy Center in the city of Long Island City. The museum had previously invited nineteen of the works to appear in its exhibition, “The Daughters,” which opened March 17. The works, which were selected by artists based in New", "The next Biennial should be held in the fall of 2020.\n\n\nFrance will hold a presidential election in May 2020, ahead of a presidential election in June 2020. The new law will phase in reforms to the country’s notoriously inefficient political system, including eliminating the Senate and the Chamber of Deputies, and will also introduce a new Constitution. While the law will likely be signed by President Emmanuel Macron, the Socialist Party, and many of his conservative allies, the law has caused widespread protests in France, where an estimated one million people are unemployed and the rate of unemployment exceeds the French national average. Since the election of Emmanuel Macron, France’s unemployment rate has fallen by more than half, and France’s unemployment rate has remained steady or fallen in each of the last three years. According to the New York Times, France’s economy expanded by an estimated 1.2 percent in the first quarter of 2020, and GDP expanded by an estimated 3.9 percent in the second quarter. Macron has said the new law will help France meet its debt and deficit reduction targets and will give the French people more time to restructure their debts.\n\n\nThe Museum of the Jewish People (Museum of Modern Art) in New York has received", "The next Biennial should include a survey format that will allow the public to present their own personal experiences with the exhibition. The next iteration of the Biennial will take place in the Museum of Contemporary Art Miami (MCA). The MCA Biennial will be hosted by the MCA Museum of Art in conjunction with the Miami Art Museum. The seventh edition of the Miami Art & Design Biennial will take place at the Museum of Arts & Design in Downtown Miami (MAD). The MCA Biennial will also host a special exhibition of work by the MCA’s own collection in the form of a virtual exhibition. The first step in the process is for the MCA’s collection to present its collection in its entirety in the form of a virtual exhibition. “We think a lot of our work is constrained by a certain kind of aesthetic vision and a certain kind of aesthetic language,” said Sarah Ridgeway, the director of MCA’s collection. “It’s really important for us to say, and to present, that our collections are still a work in progress, still evolving.” The MCA’s collection comprises more than one hundred great works by artists whose works were", "The next Biennial should take place in the coming months.  The art of biennialism is at the core of what makes us who we are, and will remain. We will be better able to tell our histories through our own works.\n\n\nThe NorCal Biennial announced today that it will no longer take place in Los Angeles next year. The announcement follows the announcement that the twenty-third edition of the exhibition will be relocated to Iceland, the largest country in the world with a population of some five hundred million. The decision was made for a number of reasons, including the continuing threat of Covid-19 and the need to put more care into the conservation of the artworks, which were restored to the National Museum of American Art in Honolulu last year.“We are deeply grateful to our guests, partners, and supporters from NorCal for their warm and loving hospitality during the past twenty-two years,” said Andrea Knapp, director of the Biennial. “At the same time, we have been working to better understand the local circumstances, both geographically and historically, that will allow us to deliver a significant exhibition of work this fall, and we have been working with an international team to ensure the exhibition will go forward.�", "The next Biennial should be held in the United States in 2020.”  In a statement to the arts site Artforum, which first reported the news, the biennial’s director, Yinka Shonibare, said: “We are grateful to the artists who have expressed their desire to participate in the next exhibition, and to the many other countries where the exhibition has been staged. We are also very much looking forward to collaborating with the international audience of the innovative exhibition, which is now in its thirtieth year. In future years we hope to continue to explore and develop the project in partnership with our artists and audiences, and look forward to collaborating with the current and future generations of artists, designers, and curators.”\n\n\nAfter a jury awarded the American artist Christo, an Ethiopian immigrant who creates works depicting the African diaspora, the jury found him guilty of three counts of violating the Matthew Shepard and James Byrd Hate Crimes Prevention Act. Christo, who was not represented by the American Civil Liberties Union, was found guilty of three counts of violating the act by depicting the body parts of people who were killed by white supremacist activists. He was also found guilty of three counts of violating the act by depicting", "The next Biennial should be in 2020. \n\n\nThe American Civil Liberties Union (ACLU) has filed a lawsuit against New York City after it voted to prosecute a man for selling untaxed cigarettes and has launched a Change.org petition to help the campaign to prevent the sales of untaxed goods and to increase the penalties for those who violate the law.The ACLU’s lawsuit alleges that the city has failed to warn taxpayers about the dangers of smoking and that Philip Morris, the manufacturer of Splinter, a popular cigarette, is still allowed to market cigarettes as long as they don’t contain nicotine. The company was given five years to comply with a new package of regulations that went into effect on January 1, 2020, but it has not done so.According to the New York Times, the city will now be required to send out quarterly reports to the Department of Consumer and Worker’s Compensation detailing sales of cigarettes that have not been confiscated by the police. The reports will also include information about the number of people who purchased the cigarettes and their ages.According to the ACLU, since sales of cigarettes are considered to be a civil violation, the fines can be substantial. In addition to the civil penalties, the ACLU says the city will", "The next Biennial should be held in the spring of 2021. Originally scheduled for March 2021, the exhibition was moved to March 2022 through a combination of scheduling problems and the terrorist attacks in Paris in November of that year. The 2019 edition, titled In Praise of Culture, was supposed to be a special exhibition for the city of Saint-Cloud, situated on the banks of the Saint-Cloud River in central Saint Petersburg.After the new design of the 2020 exhibition was announced, the artist-run company Landscape and Design Gallery (LADG), which had planned to host the exhibition in 2019, announced that the show would move to a new location in 2020. “It was decided that in order to keep the exhibition in Saint Petersburg, we would need to postpone the opening of the biennial in March 2021,” Alexander Korotayev, the general director of LADG, told the Art Newspaper.According to Korotayev, the exhibition’s five-day run in February 2020 was canceled due to the coronavirus outbreak. “We were preparing for this, we were preparing for a cancellation of the exhibition, we were preparing for a stabilization of the exhibition,” he said. “In the", "The next Biennial should be held in 2022. In the meantime, the museum will remain closed until January 3, 2020.The decision to suspend operations comes less than a week after the NHK television network aired a documentary on the park called Unseen: The Art of Walking, which features photographs by high school students from the Nakano Prefecture in Japan. While the documentary focuses on the Nakano Shinozuka Garden, a museum dedicated to the history of the Nakano Prefecture, the students take issue with the title of the documentary.“The students in the documentary are trying to change the narrative about the Nakano Garden,” the documentary says. “The Nakano Shinozuka Garden is an urban legend. It is not real. The Nakano Shinozuka Garden was built by the Nakano government but was never completed. There is no Nakano Shinozuka Garden in real life. The Nakano Shinozuka Garden is a myth created by NHK and its producers.”The schoolchildren’ claims that NHK used photographs of the Nakano Shinozuka Garden as a source when the Nakano government refused to grant them the construction of a parkland in 1997. According to", "The next Biennial should take place in the summer of 2021. Artforum will have more information about the 2019 edition in the coming weeks.\n\n\nThe Museum of Contemporary Art (MoCA), Boston, has appointed Brian Murphy as its next executive director. Murphy will take the helm from Sarah Riggs, who has led the museum since 2013, and will assume his post in January 2020.“We are excited to welcome Brian to MoCA,” said Museum of Contemporary Art director Michael Govan. “As we work to ensure that MoCA’s collections, exhibitions, educational programming, and public experiences are transformative for the region and beyond, we are committed to making the museum possible and give it the opportunity to grow into an important partner in the arts and the city of Boston.”The institution recently underwent a $3 million expansion, which added a new Theater of the Americas, an exhibition space for contemporary art, and added more than 1,800 square feet of exhibition space. It also added rooms for special exhibitions, conferences, performances, and screenings, and added two new galleries, the first in the building, and a new public courtyard. For its inaugural season, the museum staged the inaugural exhibition “Wide Open", "The next Biennial should take place in 2021.\n\n\nConservationists in the Japanese city of Fukuoka are staging a protest against a proposed $1 trillion merger between Japan’s two largest companies, Toyota and Honda. The controversial proposal, which would merge Toyota and Honda, would create a major new market for Toyota and would also severely curtail the company’s ability to sell vehicles in Japan.The two companies have been embroiled in a bitter legal battle over the proposed merger for more than a year. The two companies claim that the proposed merger will protect their businesses and will ease the financial blow from the departure of their chairman, Takashi Kawasaki, who has led the business for more than twenty years. On Monday, April 9, they announced that Kawasaki would be replaced by his long-time partner, Takashi Yanagihara.According to the New York Times, Kawasaki first met with the conservation group the Tokyo Triennale in October 2017 to discuss the proposed merger. When the meeting ended, the two men exchanged letters in which they expressed their regret and praised each other for their partnership. A couple of months later, Yamada Matsuzuki, the president of the Tokyo Metropolitan Government, signed a public document recognizing the merger as the city", "The next Biennial should be held at the Museum of Contemporary Art, Los Angeles (LA MoCA), in September 2020. As the 2020 edition of the event is still in development, the institution has not yet released any final design plans or any information about the event’s inaugural edition.\n\n\nThe Metropolitan Museum of Art in the United States has appointed Neal Garfinkel, the director of the Metropolitan Museum of Art in New York, as the next director of the Public Theater. Garfinkel will be succeeded by veteran director Daniel H. Pink, who has helmed the Public Theater since 2007.“With his compelling vision and deep understanding of how to make a show that is both culturally relevant and ethically challenging, Neal is poised to build on the Met’s recent trajectory in revitalizing the Public Theater and delivering engaging programming that bridges the boundaries between arts and politics, between theater and the world, and between art and life,” said David Burton, the chief executive of the Public Theater. The appointment marks the culmination of a decade-long process, began in 2011, that culminated in the creation of the Public Theater, which is funded entirely by donations, with no outside investment, from the Metropolitan Museum of Art. The institution has"]