["The next Biennial should also include an exhibition of work that examines the interrelationship between the artist and the landscape. The theme of the 2017 and 2020 editions was “Perception, Movement, and the Landscape.” One of the most recent works to be exhibited at the 2019 and 2020 editions was a digital installation by artist Emma Lazarus titled “It’s Not What You See, It’s What You Meditate.” The artist will present the work at the Biennial on January 23 and January 27, 2020, respectively.\n\n\nThe Kahn Gallery in Manhattan has appointed Sandeep Kaur as its next executive director. Kaur succeeds Mike Kelley, who departed in the spring of 2021 to join the New Asia Foundation as its executive director.“Sandeep Kaur is a seasoned leader in the art world who has successfully navigated various business and financial challenges in his career,” said Marc Glimcher, the Kahn’s president and CEO. “He has demonstrated exceptional vision, creativity, and acumen as a leader and innovator in his current role.”Kaur will assume his responsibilities in December. Currently, Kaur serves as the director of the garden near the", "The next Biennial should take place in 2020. The museum did not respond to the Guardian when the institution was asked about the cost of the event.\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Laura Adams as its next executive director. Adams has been the director of the Fine Arts Museum in Santa Monica, California, since 2011. During her two-year tenure, she oversaw a $10 million increase from $6 million to $10 million for the museum, and oversaw a $5 million increase in contributions from the public and private sectors.Adams has also led the Metropolitan Museum of Art in New York for thirteen years and has overseen the institution’s expansion to the museum’s new home on East Green Street in South Boston, as well as the establishment of the Laura and Budd Rooth Art Museum in Harlem. She previously held the positions of deputy director for exhibitions and curator at the Met since 2001 and assistant director for exhibitions and collections at the institution, which has a permanent collection of more than 5,500 works.“Laura is a proven leader whose leadership, work ethic, and vision for the museum have been instrumental in transforming the Met to be a truly transformative institution,” said director and CEO Daniel H. Weiss.", "The next Biennial should open in 2021.\n\n\nThe Tate’s board of directors announced today that Kate Pickering has been promoted to the role of director of London’s Tate Modern and will take up her post in January 2021. She succeeds Simon Hills, who most recently served as director of the British artist’s studio in Hong Kong, and will work closely with director Maria Balshaw.“I’m delighted to be re-elected to this role,” said Pickering. “I’m looking forward to working with Maria and the talented staff at Tate, to develop new and exciting ways to engage with contemporary art, and to moving into the new chapter of my life.”During her tenure at Tate, Pickering oversaw the launch of the Tate Digital, Tate Connected, the Tate Digital Archives, Tate Travel Archive, Tate Modern Live, and Tate Modern Stories. She also served as director of Tate Modern from 2019 to 2021, and in 2020, she was appointed director of the Tate’s Leeds and London locations.In November 2019, she was appointed to the Royal Academy of Arts’s advisory board, which comprises artists and other cultural leaders. Pickering’s term comes with", "The next Biennial should be held in 2021.\n\n\nThe Museum of Fine Arts (MFA) in Atlanta has added five more artists to its roster since it opened last October. The ten-member group is comprised of Melissa Aird, James Agosta, Rachael Crouch, Farshid Khan, and Nick and Rachael Osmond. The five-person team will collaborate to create an installation, a performance, or a film for the Georgia Museum of Art (GMA), which is currently undergoing a $75 million renovation.“I am truly honored to be the first artist to create a work for the GMA’s installation, ‘A Time to Kill,’ since the museum’s dedication of a new collection of African art in 2001,” said Aird. The installation, which is part of the museum’s “Georgia and the South,” series, is part of the “Phenomena of the South,” a project that explores the history of Southern art and artmaking. The installation, titled ‘Triumph of the Soul,’ was created as an homage to the museum’s collection of South African art, which is housed in", "The next Biennial should be held in 2022.\n\n\nThe Museum of Modern Art Shanghai announced yesterday that it will phase out the remaining two hundred jobs at the institution in the coming months, in an effort to reduce the impact of the coronavirus on the cultural sector. In a statement, the museum said that it wanted to focus on 'strengthening the collection and exhibition space in the new 151-year-old building, in a coordinated way, while continuing the work of the institution’s existing collection and exhibition space in the new building as part of a large-scale renovation.“We are taking the steps necessary to avoid a repeat of the current situation,” said the museum. “As a museum, we are closing our gates, and as a city, we are learning how to manage our buildings and infrastructure in a way that will retain the integrity of the building’s historic character and serve as the site for future exhibitions and performances.”According to China’s state news agency Xinhua, the six hundred and fifty-nine employees of the Museum of Modern Art Shanghai, who were contracted according to the museum’s hiring policy, were notified of the decision on November 26 and were told that they would be", "The next Biennial should be held in the autumn of 2022.\n\n\nPioneer Works, an independent contemporary art museum in the arts district of Bristol, has been awarded a £1.5 million grant from the William Shakespeare Trust. It is the largest single donation ever made to the institution and will allow the museum to create the world-class exhibition “Going Clear,” a new project that will examine the controversy surrounding the documentary film Going Clear: Scientology and the Prison of Belief.The grant was announced by Blossom Hill, director of the free museum, and Uka Barata, chair of the academy. Together they will launch the exhibition at the institution in September 2020, with the goal of highlighting the work of contemporary artists that have traditionally been overlooked.The exhibition will be organized as a series of films about the artist’s life, with the first film being “Jason Bayley” (2017–18), a retrospective of the artist’s first solo exhibition at the institution, which opened in March. The second film, “Paul McCarthy” (2019), will be given as part of a series of exhibitions at the museum.In the third film, about the artist’s early years in London, the museum", "The next Biennial should be held in Chicago in 2021. Meanwhile, the show will return to Detroit for a second edition in 2022, and to London for a third in 2023. Last year, the festival staged a show, Birds of a Feather, at Detroit Institute of Arts, which included twenty-one works by twenty-one artists, including Michael Astaire, Robert Parsons, Gereon Osijek, and Yuri Orskov.\n\n\nThe Royal Academy of Arts (RA) in London has launched a new digital platform that will allow students, academics, and the general public to see the work of British artists in a number of formats. Launched in partnership with the English Museum in London, the platform will allow visitors to the academy, which has more than 5,200 works on display, to see the works in a variety of ways.“Today the Academy is celebrating its fiftieth anniversary and we look forward to continuing to show the most important artists of the past five decades,” said academy director Sabine Verheyen. “The platform will allow students, academics, and the general public to quickly and easily explore the works of the most acclaimed artists of the past six decades and to see how the platform", "The next Biennial should be held in 2022. \n\n\nThe Chinese artist-run nonprofit Ai Weiwei’s memorial in Covid-19-hit Shanghai opened in the port city on Monday. Titled “It’s a Long Way to the Sea,” the work, which is part of a series of works set to be presented in the forthcoming exhibition “Coco-Coco”, is part of a series that will mark the 100th anniversary of the opening of the Shanghai Museum of Art (SMA). The biennial, which will take place at the SMA from September 13 to September 17, will also include photographs by the artist and will present works by artists such as Gish and Tung, a group of artists, including Tung, that became known in the 1970s for their use of folding chairs and photochromatic paintings while they slept.“This series of works is a continuation of the themes that have been presented since the founding of the SMA in 1972. The exhibition ‘It’s a Long Way to the Sea’ will mark the centenary of the founding of the SMA, and will be a reflection of the legacy of Ai Weiwei,” said", "The next Biennial should take place in 2021, in Helsinki. The exhibition will feature over three hundred works, selected by the curator Anna-Marie Olkin, in all galleries, including the Kauppi Gallery and the MCA Gallery, the MCA, the MCA, and the MCA Kunststalt, and will be hosted by the Contemporary Art Center Helsinki. The biennial is also working with the museum Päivi Gallery in the Helsinki Art Park to present an exhibition dedicated to the works of the artist K. M. Semmel.\n\n\nIn the wake of Hurricane Dorian in 2010, the Italian government passed a law that will allow several hundred million victims of the deadly storm to sue China. According to the New York Times, the legislation—which was passed by the Senate and is awaiting the approval of the House—is part of a package of measures that will help Italy cope with the coronavirus, which is spreading rapidly through China and has caused at least 165 deaths, and has been described as a “historic step.”The legislation—which was passed on October 4 and is expected to be enacted by the end of the month—guarantees victims of the storm's coronavirus with a maximum damages of $", "The next Biennial should examine the history of rural life in the\n\nUnited States, where death rates have continued to rise even as the number of urban deaths plummeted earlier this year. The 2019 edition of the Biennial, titled The City and the Night, will instead focus on the night-time. In a statement, the National Geographic Society said: “We are excited to reintroduce a biennial dedicated to the life and creative work of an artist, featuring an artist whose work addresses the themes of the year: the night, the city, and the night sky. The artist chosen for the venue, Kiki Smith, is truly at the center of contemporary American art and design. Her work is poetic and touching, deeply personal, and deeply meaningful.”Smith, who died in 2014 at the age of seventy-one, was selected for the role of the embodiment of the Art of Life, a 1989 National Geographic series about urban life and culture, by an international jury. The ten-year series, dubbed “The City and the Night,” premiered in the spring of 1989 and was followed by “The Past and Future of Art” (1992), “Spiraling Water: The Art of Spiraling Air”", "The next Biennial should be held before the end of the year, with a new curator, a new programme, and a new exhibition. The program should reflect the South Asian experience and should be driven by artists from a South Asian perspective. The institution will also seek to build on the work of the first exhibition, South Asia 2000, and to develop a new programme of events organized as a cross-section of South Asian and international art. South Asia 2020, the twenty-third edition of the South Asian Cultural Centre, will be staged at the Sheraton Greenwich in London in 2022.\n\n\nThe National Gallery in London has announced that Kate Hoeppner, who has worked at the institution since 2006, will be the next director. She succeeds Richard Marks, who served as director of the Tate since 1995, who led the institution for just over thirteen years before he was diagnosed with cancer in 1998. The new position will begin in September.“Kate is a gifted, ambitious, and talented leader who has demonstrated an uncanny ability to adapt and reimagine the National Gallery for more than twenty years, from integrating the museum’s collections to creating new and exciting exhibitions, to guiding the gallery through its transformation from a modest collection", "The next Biennial should open in 2020. The twenty-third will be held in Tucson, Arizona.\n\n\nThe Museum of Fine Arts (MFA) in Boston has received a gift of two works by American painter Charles Burton from the collection of his wife, the artist-in-residence, Rachael Burton.The artifact, a set of two lithographs by the artist, is a selection of paintings that she created for the artist’s forthcoming book, Charles Burton: Between the Sun and the Moon (Dietrich Reimer Verlag, Berlin). The works, which are currently on display in the artist’s first-ever solo exhibition at the Museum of Fine Arts, are titled Between the Sun and the Moon and Aurora Borealis.Known for creating experimental, often surrealistic works that grapple with space and time and examine the limits of human perception, Burton has also been a recipient of the Katherine Knowles–Lunice Fellowships at the Whitney Museum of American Art and the Joan Mitchell Grants for the Arts.She is also the author of more than twenty books and numerous monographs, and has had solo exhibitions at the Museum of Modern Art, New York; the El Museo del Barrio in", "The next Biennial should take place in 2021. Its inaugural exhibition, “Nicoletta: A Retrospective,” will open at the North American Biennial at the Art Institute of Chicago in October 2021.\n\n\nOn Thursday, the National Endowment for the Arts (NEA) revealed that Itaia Federici, the director of the Metropolitan Museum of Art in New York, has been appointed director of the Metropolitan Museum of Art (MMOM). Federici will assume her responsibilities on February 8.“Ia is a proven leader and innovator who has built a strong and diverse collection program for the Met,” said Rick Schubert, the director of the Met and the adult education center the Metropole. “Her new role allows Ia to build on the strong relationships the Met and MMOM have developed over the years through the museum’s artists, community, and visitors.”Federici first joined the organization as a senior curator in 2009. She quickly rose to lead the museum’s artist-in-residence program, which focuses on establishing residency for young professionals, and developed the nonprofit Metropolitan Foundation, an annual grant program for artists. In 2011, she was named the recipient", "The next Biennial should be held in the spring of 2021.\n\n\nThe Royal Society of Arts (RSA) in London has appointed Frank Black as its new artistic director. Black has helmed the museum since May 2019, when it was still known as Tate Britain. He succeeds David Raab, who has helmed the institution since 2015, when it was still known as the National Museum of Britain.“After a strong and sustained campaign by the museum’s board and staff, we are delighted to appoint Frank to the role of artistic director,” said board president George the Seventh. “His extensive experience and commitment to research and curating at the museum make him an ideal fit for this exciting and challenging new role. He is highly qualified, has demonstrated extensive ability and will in the field, and has a proven track record of delivering innovative exhibitions and exciting programs.”Black, who has been a member of the RSA for twenty-seven years, succeeds Alan Elphick, who retired in February 2019 after twenty-five years at the helm of the museum. The appointment was made in a board meeting chaired by Baroness Sayeeda Warsi, chair of the RSA’s board of trustees. Black has also helmed the", "The next Biennial should take place at the Museum of Modern Art in New York in the spring of 2021. Museum director Marc Glimcher said that the museum is excited to collaborate with Bergen and Garland and to introduce new works by the artists. “I am grateful for the opportunity to work with these exceptional artists to explore new and old worlds simultaneously,” Glimcher said in a statement. “Their works were commissioned to represent the visionary and visionary potential of a new generation. They are the artists who will define us as we move into the next century.”\n\n\nThe prestigious European art prize, the European Council of Arts, has awarded the sixth annual Dusseldorf Prize to a young German curator. Nima Nabavi, a former senior curator at the Nationalgalerie in Berlin, was awarded the $15,500 prize at an awards ceremony at the German parliament in Berlin on November 20. She will now be presented with the Dusseldorf Prize for her 2018 exhibition “The Rape of the Grass,” which was organized and curated by the Bergen-Gropius Bibliothätstiftung (Bergen Gestapo), in conjunction with the Nationalgalerie in Dortmund.", "The next Biennial should be held in the year 2032.The Iranian pavilion at the fair will also include picturesque greenery in the city of Teheran, Iran, which is famed for its architectural beauty and is located near the Persian Gulf. The pavilion will also feature two works by the director of the Isamu Noguchi Museum, Tarek Attia’s sculpture, which commemorates the architect’s eighty-sixth birthday, and Yaŋba Parashar’s work, which was selected by an international jury. The biennial will run from March 21 to March 27, 2022. \n\n\nNew York–based artist Rirkrit Tiravanija, an American Indian activist and educator who has been involved in the fight for human rights issues in the United States through art, artmaking, and education, has been selected to represent the country at the Venice Biennale in 2021. Tiravanija, a 2012 graduate of the University of Minnesota who first met the museum’s director, Roberto Cicutto, in 2015, will be presented with a $25,000 donation by the Nari Foundation, a nonprofit based in Chicago.Tiravanija, whose practice spans painting,", "The next Biennial should be less than a year away.\n\n\nThe New York Philharmonic has appointed Doris Kashkari, a lawyer and the author of dozens of books and numerous anthologies, as its next president. Kashkari will be succeeded by Allison Moore, the director of the Wadsworth Atheneum Museum of Art in Hartford, Connecticut. Kashkari succeeds Nina Panetta, who will resign in July 2019 to take up a new position, the director of the Metropolitan Museum of Art in New York. “Her extensive and engaging career has been a source of inspiration for me as I have traveled throughout the decades to revise and expand her writing and work,” said conductor Michael Massey. “Her empathy and intelligence are unparalleled in their breadth and depth. I look forward to working with her and will continue to support her as she continues to set the standard for excellence in the fields of music and the theater.”Born in Los Angeles in 1964, Kashkari studied under the legendary producer Edward King, who helped her break into the industry through the pioneering stage production company the Virgin Group, which was acquired by the New York orchestra in 1978. She then joined the California-based firm of Dorsey &", "The next Biennial should take place in 2021–22, the panel said. Teaching artists from the show MUSE, curated by Jean-François Okwui-Mamuk, will host a workshop in September. The 2019 edition, which was staged at the MCA, was held in Seoul, and was held in conjunction with the Seoul Biennale (SBS).\n\n\n\n\n\nThe independent art center and nonprofit incubator Artadia has announced that it is removing six artists from its roster and will award $50,000 grants to three of them next year: Sam Halberstadt, Adrian Piper, and Blake Robertson. The grants will be used to support young, emerging, and established artists.“With the biennial's March 2019 kickoff, Artadia’s engagement with international art and its long-standing commitment to fostering connections between museums and local communities, culminating in the inaugural Artadia/MCA London Festival, this was the perfect time to make a strong show of our support for these six emerging and established artists,” said Linda Donoghue, Artadia’s chairman and CEO. “Alongside our current exhibition schedule, we are expanding our digital and online programs, bringing their stories to", "The next Biennial should take place in the Snowdonia Mountains in Somerset, UK, in April 2020. The theme “The Future Will Be Our Wall” is a direct response to the new federal budget and the UK’s Brexit negotiations, which have stoked fears of a 'hard Brexit.'“Our new proposal is to set out a series of concrete actions that can serve as a roadmap for Brexit,” said Turner. “I look forward to working with the Royal Shakespeare Company, the National Poetry Library, and the National Poetry Schools, to hear their perspectives and to see how they will transform the future of our nation.”The biennial will also include an exhibition of work by contemporary artists such as David Adjay, Jannis Kounellis, and Alex Lawther; a book by the late British designer H. David Kortney; an exhibition of work by artists such as Glynis Mullen, Roberto Rossellini, and Linda Evangelista; and an online survey. \n\n\nThe Metropolitan Museum of Art (MoMA) in New York has appointed Rinat Akram as its next director. Akram will be responsible for ensuring the museum’s continued operations following the completion of", "The next Biennial should take place at the new venue, which is expected to open in 2020, and will be hosted by the same team. The theme of the twenty-fifth edition will be “The Future We Want.” Barrister Mark Harden, who organized the exhibition, told the New York Times that the selection committee made the decision to cut the show “over the course of a few days.” The organizers cited the museum’s lack of financial aid as the reason for the move. The move follows the recent announcement that the museum will not be able to utilize the approximately $30 million in proceeds from the sale of the former Tate St. Louis building in an effort to reduce costs.The Tate has previously indicated that it intends to focus on “The Future We Want—” a move that coincides with the opening of the new museum—a $50 million expansion—at the end of March—the same month as the fifteenth edition of the Biennial, “The Crisis of the Body.” The new exhibition, “The Crisis of the Body,” will be held at the Contemporary Art Museum St. Louis; the Museum of Contemporary Art Manchester; the National Gallery London; the", "The next Biennial should take place in the spring of 2021. Following the 2020 exhibition, Gardner Gallery will reopen in the Art District with a new collection of work by the Italian artist Saturnino Zingaretti, which will be organized and curated by the architect Patrice Cornet, and the US artist Carmen Oquendo-Villar. According to the New York Times, the collection will be a homage to both the artist and the city of New York, where it will be housed in the museum until at least 2024.The show will also include work by artists such as Paul Gauguin, Pierre-Auguste Renoir, Pierre-Auguste Renoir, and Jean-Michel Basquiat, among many others. The biennial will be inaugurated by a performance by the band United States of America, which will open the exhibition in the Tanglewood Gallery. When asked what the biennial will look like, the artists said: “I want to make a new kind of art that can be lived and practiced in a different way. I want to create a place where you can feel in the same room as these artists and see them work.”\n\n\nThe Italian government approved a $500,000 loan to the United", "The next Biennial should focus on emerging audiences; on the social and political history of the body; and on the transformation of the body and the environment.  The fifth Biennial should address the connection between art and politics; and the seventh on contemporary art.The festival will be held in East London from September 9 to September 10, 2020. The exhibition will feature works by forty-eight artists and will be organized in a biennial-like fashion. The inaugural event, “Rebirth of the Dream,” will have the themes of ‘life after death,’ ‘love and the body,’ and will be staged at the East London Gallery in 2020.\n\n\nThe Museum of Fine Arts (MFA) in Boston is planning to get rid of 58,000 paintings by some 150 American painters, many of whom were active during Prohibition and are now sorely missed. The institution announced that the works will be donated to the Boston Children’s Museum, the American Folk Art Museum, and the Museum of Fine Arts in Boston, which will then display them in a public space in the city’s historic Storrow Place, where the works will be studied by a select group of artists.The works, which were written", "The next Biennial should be held at the Kunsthalle Basel in February 2020. A newly elected president of the Zurich Biennale, Harald Szeemann, has called for the end of the six-month exhibition, which has been held since 1999. “Although there has been much talk about the future of the exhibition, we are not there yet,” said Johann Kreutz, who has led the fair since 2011. The move follows the announcement that it will not return to the event’s original venue in September. However, a new exhibition of works by the artists who participated in the event will open at the Museum of Contemporary Art Kunst in Geneva in March 2021. “The new board of trustees of the Zurich Biennial invites you to become involved in shaping its future. We are taking the future of the exhibition very seriously, and the board is reaching out to you, the exhibitors, to hear your views and to hear your suggestions,” said board president Lutz Bischof. The critics Leila Kunitz, María Berrío, and Béla Zárate are among the other architects who have signed the letter, and are urging the board to reconsider its decision.\n\n", "The next Biennial should be held at the end of March 2020. If the program is successful, it will mark the fifteenth edition of the event, which will be held at the city’s Museum of Art, and will bring together thirty artists for a day-long event.  The festival will be hosted in partnership with the City of Detroit, the National Endowment for the Arts (NEA), and the National Museum of the American Negro, which is currently closed due to the Covid-19 pandemic.\n\n\nThe Schuylkill Art Museum in Cambridgeshire, England, was awarded a £10,000 grant by the Nahmad Foundation in support of a major restoration project. The gift includes the purchase of four nineteenth-century buildings, which have previously been used as classrooms and offices of the museum, and greatly expands the museum’s holdings of Works of Art.“This is a very exciting time to present a major gift to the museum, particularly in the context of the onset of the Covid-19 crisis and the subsequent closure of most of the institutions around the world,” said Nahmad Foundation director Max Moskowitz. “The work of restoring the buildings with the grant will be", "The next Biennial should finally kick off in 2022 and include a selection of art from across the globe. The next exhibition should also feature a “special project,” a type of “cinema of the body” that will include works from the exhibition series “Longing for a Homely Place,” 2019–20, and “Away from the Face of the Earth: Individual and Group Painting from the Arts of New South Wales,” 2021–22. The exhibition will also include the work of Yinka Shonibare, a Taiwanese American artist whose work explores the relationships between political, social, and economic forces. The inaugural exhibition of the biennial will be “Away from the Face of the Earth: Yuki Kondo” at the Museum of Contemporary Art Sydney in November. Kondo will present his first solo exhibition at the Museum of Contemporary Art Sydney since 1989 on November 3. Museum director Loring Randolph said: “Away from the Face of the Earth:” “is an exploration of the aesthetic and structural features of New South Wales’s contemporary art. It’s a reconstruction of an idealised past, one black", "The next Biennial should take place in Tokyo in 2021. The 2019 version of the event is currently on view until September 6.The 2020 edition will be held at the Goyama Museum in Nagoya, and will feature works by a group of twenty-six artists from Asia and the Middle East. The exhibition will include new works by artists such as Yuki Kondo, Kiyomi Yamashiro, and Nandini Krishnan. The full list of participating artists is as follows:Aron Krasny, Lydia Danton, Olafur Eliasson, Anna-Sophie Hatten, Ana Habana, Iain H. MacGregor, Michael Oosterhoover, and Svetlana Zastava, the first artist-in-residence to receive the MacArthur Genius Grant in the United States. Ava DuVernay’s first solo exhibition in New York since 1996. \n\n\nMayer Art Gallery in London is planning to open a new public space in the institution’s former building in Camden, London, in 2021. Its new space will be named the Marketplace Gallery. The forty-five-foot-wide, glass-enclosed space will be adjacent to the Newton Sc", "The next Biennial should be in 2021.  The 2017 event will mark the first time that the artist will participate in an international exhibition, and the first time that she will be based in London.\n\n\nCultural critic Pradeep Ghosh, who has written extensively on the contentious issues of the past and present in India, has been appointed a fellow at the Institute of Contemporary Arts (ICA) in Mumbai.The ICA also hosted an exhibition of Ghosh’s work, \"Remembering Pradeep Ghosh: The Art of Taking Back the Pieces,” which opened on January 9. Ghosh’s work, which collects and assembles objects from his own collection, forms a central part of the exhibition’s narrative, which explores the relationship between the artist and art history.The piece, which was inspired by the artist’s relationship to his father, who passed away in 2015, includes an assemblage of photographs that depict his family and his father’s early childhood, as well as photographs of his mother, his siblings, and his childhood friends. In the midst of the show, Ghosh, a native of Delhi, visited the museum on several occasions. He also participated in a retrospective of", "The next Biennial should take place in 2020. The year of the beast is now. It is just beginning to show its full capabilities.”\n\n\nThe New Museum in New York, which received $5.1 million from the Christie’s auction house in a deal that closes on Thursday, will dedicate an entire section of the museum’s new building, which is currently under construction, to the study of the sea, the air, and the water. The section, titled “Sea-Up,” will debut in 2020.The works, which were selected by Christie’s from a shortlist of ten submissions, include the work from the Israeli group 'Deir Ishad,” which was commissioned by the institution, and “the sea and air above me and my house,” which was created by sculptor Uri Feldman and will be on display in the museum’s new exhibition space “The Air and the Sea,” which will open in 2020.“The Sea and the Air: The Wind, the Storm, and the Waves” will be on view in the new exhibition space “The Air and the Sea,” which will be located in the museum’s", "The next Biennial should be held in November 2020.<|endoftext|>A new study conducted by the Wyss Radcliffe Institute, the Center for Art and Culture, and the Center for Comparative Art at the Walker Art Center in Minneapolis concluded that the continued presence of President Donald Trump in the White House has had a detrimental impact on American art. The results of the study, which were released on November 8, were largely negative, and the authors believe that the decline in visitor numbers is to blame.“The painting world is in a precarious situation,” said Jean-Jacques Neuer, chair of the Myers-Crickfeldt, and Sianna Iannone, the institute’s president. “The exhibit business is struggling as ever, and the museums are already feeling the impact of the ongoing administration. . . . We cannot afford to have an art historian at the helm of the next decade or two, and we cannot afford to have a museum that will not be able to address the changing needs of the country.”The findings of the study, which were drawn from data from more than ten hundred museums across the United States between January 1, 2020 and October 30, 2022, were presented at the Fifty-Ninth Venice Bienn", "The next Biennial should take place in 2021.\n\n\nThe Maritime Museum in Portsmouth, England, has appointed Jocelyn Cuthber as its new director. She will take the helm from Catherine Hickman, who retired in October 2019 after eighteen years at the helm of the museum.“Jocelyn is a well-known and successful curator and has led the museum to several awards and is admired for her innovative and innovative approach to exhibition design and archiving,” said Museum director John Hutton. “Her expertise and knowledge come to us from working closely with the world-class team at the museum, which includes Anne-Marie, Karl, and Pilar, and we are confident she will take the museum forward with gusto and energy.”The museum, which is currently closed until at least March due to the Covid-19 pandemic, has commissioned Barry to create a new exhibition for its collection, “Through the Aquarius Window,” featuring Barry’s work. The exhibition will open in September on the first floor of the museum.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is planning to open this fall with a new set of cur", "The next Biennial should be on the river, at least. AFP/Getty Images\n\n\nTacita Dean, a protean freelance artist’s assistant who lived and worked in New York City from 1997 to 2005, was found dead on Tuesday in her Manhattan apartment at age sixty-eight. According to the New York Times, Dean was found by her son Alan, who was home alone at the time, and was pronounced dead at the scene. Dean was one of several assistants, including Marcia DeSousa, who worked for the artist and were allegedly involved in the unauthorized exhibition at the New Museum of Art in the spring of 2007. DeSousa claimed that the exhibition, “an experiment in making works in the current world,” was a “betrayal” of her father’s values. “I’ve known my dad for twenty-five years, and when he died, I just couldn’t imagine doing anything less,” said DeSousa. “He died trying to make a living for himself and my family. And I’ve been working ever since.”DeSousa’s allegations were corroborated by two other New", "The next Biennial should be in March 2020.  The 2020 winners are as follows:Acquisitions Gallery, London: Formerly known as Saydnay Gallery, and now housed at the Sotheby’s department store, where it will reopen in March.CUM, New York: Originally scheduled for May 2020, the space will now be inaugurated by a retrospective of the artist’s work, titled The Parallax of the Eye. This will be followed by a tour of the studio, which will be transformed into a festival space with live music and performances by a variety of artists. The Maker Faire, New York: Created by the artist-run nonprofit, the festival will now be held from June 17–June 21. The Metropolitan Museum of Art, New York: The arts space will once again host an exhibition of work by the artist‐in-residence, Kiki Smith, as part of the biennial’s inaugural edition.Smith, whose practice consists chiefly of performing, directing, and writing, is best known for her detailed video installations based on her own body. Among her large-scale works are the immersive, three-dimensional films The Absolution of Light and The", "The next Biennial should conclude with a special exhibition featuring the work of the biennial’s curators, researchers, and critics. In a walk-in closet, the biennial will present the work of the twenty-three artists who were selected as finalists by the biennial’s curators, researchers, and critics.“The Biennial is an unprecedented platform for cultural exchange, challenging conventions and offering new ways of being,” said Valentino Cicutto, the president of the biennial. “The work of the artists selected as finalists and the artists chosen to present the Biennial in its entirety are a powerful vehicle to interrogate concepts and get at the heart of things.”\n\n\nThe Royal Academy of Arts (RA), in partnership with the Royal College of Art (RCA), has appointed Arundathi Mukherjee as its new national president. Mukherjee comes to the institution from the Indian Institute of Arts (Iizs), Mumbai. She succeeds Vijay Devmukerjee, who retired in January 2019 after a decade as chief executive of the RCA.“We are enormously pleased with the work that Arundathi has done to enhance the RCA’s reputation in", "The next Biennial should be held at a site that is close to the River Seel, near the former residence of the Museum of Art, in New York City. The next iteration of the Biennial will focus on the history of contemporary art and will feature a selection of thirty-one works by thirty-seven artists. The twenty-fifth edition will be held at the same location in 2021.“The future of the Seel and the City of New York is at risk,” said Mayor Bill de Blasio. “We’ve been working for years to attract and retain artists, and we’re only now starting to see the results. We’re still a long way from seeing the full impact of the reopening of the Museum of Art, but I’m confident that this is a moment of great opportunity for New Yorkers to see and hear the works of their favorite artists, and I’m excited to discover the work of new artists in the coming months.”The new biennial site is a mixed-use project of public art, residential, retail, and office spaces located in a former factory district in the Meatpacking District of downtown Brooklyn. The design was inspired by the Seel and the Hudson Yards", "The next Biennial should be held in 2020. They will also unveil a new sculpture, called Cònguià di Cui, which will reside in the Louvre for twenty years, and will make several other major revisions to the museum’s collection, including the relocation of the paintings.The museum has been working on revamping its collection for almost thirty years, and the first phase of the project—titled After the Shift—was completed in 1992. The second phase, “L'Angleterre,” was completed in 1995 and “Lévy Gorvy,” was staged in the French pavilion in the 2017 edition of the Museum Paris.\n\n\nThe Folkestone Gallery in London has received a gift of twenty-one new works by artists such as Thomas Northey, David Hockney, Barbara Kruger, and Gere Kavanaugh, and collections that were previously closed until now. The gift includes a selection of work by the American artist Chris Ofili\u0097whose work was previously on display at the gallery in the form of a series of two-dimensional Plexiglas boxes that were created in his studio\u0097as well as a selection of works by artists such as Rineke Dijk", "The next Biennial should be held in the second half of the year. During this period, a committee comprising Marie Challa, Karl-Heinz Schubert, and Hans-Ulrich Obrist will be formed. The institution’s board of directors will meet in the next few weeks to decide whether to proceed with the project.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, announced today that it will open a new, three-story wing in the former Warner Bros. movie theater on November 2, 2020. The museum will also begin hosting biennial exhibitions as part of the Warner Bros. Pictures Film Program, and will partner with local arts organizations to create a new, outdoor sculpture garden.“Museumgoers have come to expect a variety of contemporary art works from Warner Bros.,” said Michael Hoberman, the head of MoCA’s board of trustees. “This is one of the most celebrated collections in the world, and we are excited to open this new front to its rich history and explore the next chapter with our guests.”The new mission statement, “To Be and Be Multimedia,” was written by Warner Bros. art director James Mangold and includes the following", "The next Biennial should take place in the spring of 2021, in Shanghai.\n\n\nThe Los Angeles–based nonprofit Firehouse Art Center (FAAC) has announced that it will remove thirty-six works by forty-eight artists\u0097including three of the largest-known donors to the institution, Leslie-Leah and Louis Kahn; a trio of early adopters: John Henry, Robert Irwin, and Roger Brescia\u0097from its permanent collection.The works are currently housed in the Los Angeles County Museum of Art, where they are on display in “The Other L.A.: The Other Half,” a new exhibition that will run through October 21. The exhibition will be curated by Alexandra Shagal, curator and director of the Draper Gallery; involved in the redesign of the center are architect Norman Foster, chief curator of the Cooper-Hewitt, and Mica Hagerty; and curator Sarah Tompkins-Rivas.“FAAC’s collection is a treasure trove of art that has been challenging and captivating audiences for more than a century,” said David H. Horowitz, founder and president of Firehouse Art Center. “This exhibition will demonstrate that the works of forty-eight outstanding", "The next Biennial should take place in 2019, and the organizers plan to hold the fifteenth in 2020.\n\n\nThe Museum of Contemporary Art (MoCA), Miami Beach, Florida, announced today that it has received a gift from the artist-activist and curator Walter de Maria. The donation, a sixteenth-century wooden gilt-and-stone sculpture by the artist, was made in memory of his friend and collaborator and sometime collaborator-in-arms, Muhammed Ali.“It is a great honor and a tremendous pleasure to present to you this gift,” said de Maria. “Muhammed Ali’s work will forever be part of the Museum’s collection, and we are grateful for the gift that he has given to our collection.”While most of Ali’s later sculptures are associated with his later paintings, they also engage with questions of representation and man-made urbanity. Born in Beirut in 1941, Ali first studied under Henri Matisse at the École Nationale des Beaux-Arts in Paris. According to Artforum, his work often grapples with the question of how architecture, landscape, and painting should be experienced by the viewer. In 1995, Ali", "The next Biennial should include an open-air performance by a group of artists and musicians from a group of countries and regions around the globe. The next edition will also include a reimagining of a new dedication program for women. The next edition of Art in the Age of the Third Reich will take place in 2019, and will reinvent the theme: “Lügenpresse,” and will take place in the spring of 2020. The exhibition will culminate with a reception for the public in conjunction with the German national holiday Berlin Diese on February 24.\n\n\nThe High Museum of Art (HMA) in New York has received a major gift from the Pritzker Prize–winning philanthropist and collector Paul Mpagi Sepuya, who gave the institution $250,000 in support of the renovation of its former cafeteria and associated galleries. The $400 million overhaul, which is being overseen by architect Daniel Libeskind, will also introduce new exhibitions and community programming, including the Pritzker Museum of Art Art's “Prestel in the Clouds,” an exhibition dedicated to watercolor and the Pritzker Art Center’s “Prestel in", "The next Biennial should be held in the spring of 2021, and a decision regarding the location of the exhibition will be made by June. “The Biennial of the City of New York is a powerful symbol of our city’s commitment to sustainability,” said Michael Govan, chair of the board of trustees of the Museum of Modern Art and a member of the commissioning committee. “I’m hopeful that this exhibition will continue to engage the public and inspire them to understand and embrace our city as a beacon of hope and opportunity.”Following the exhibition’s opening last fall, the Brooklyn Museum and the Museum of Modern Art in New York staged an exhibition inspired by the exhibition. The show “The Future is Present: A Virtual History of Electric Cars” (2019). In the exhibition, which was organized by the Museum of Modern Art and the National Gallery of Art in Washington, DC, the artist Paul Graham, who founded the nonprofit the Manhattan Museum of Art in 1960, and a group of other curators created a virtual history of electric cars. The work—which they called “histories of the future—”—was inspired by the work of the late Japanese artist Tadao Ando,", "The next Biennial should be in the autumn, with the exhibition likely to be held at a location that is close to New York City, the city of New York, the surrounding metropolitan areas, and the Hudson Valley, and will comprise a selection of works that represent the most important recent international developments in sculpture. The full list of participating artists is as follows:ABDELA·PHILLAD (SOUTH) (Xavier Hufkens) (Xavier Hufkens, New York) (Stratos and Donna Pulsa) (Stratos and Donna Pulsa, New York) (Adriana Iannone) (Milena Schenk) (Milena Schenk, New York) (Stefano Piscitelli) (Stefano Piscitelli, Rome) (Thomas Mielke’s Todosaro–Todosaro’s) (New York) (Marca Crespo) (Marca Crespo, New York) (Daniel Vetter and Daniela Zukanovski)  (New York) (Michele Maudlin’s", "The next Biennial should take place in 2019. The 2019 edition will be held at the Museum of Fine Arts, Boston. The invitation has also been extended to the Museum of Fine Arts, New York; the Museum of Fine Arts, Boston; and the Museum of the American Fine Arts, Detroit.  Tickets to the 2020 event will go on sale on January 11. \n\n\nThe French government approved a landmark $12.7 billion plan on Wednesday to help restore France’s national cultural monuments, which were badly damaged by a hurricane that hit the country on Thursday, November 8, leaving at least twenty-nine people dead. Under the terms of the agreement, France will invest $7.5 billion into restoring the fifty thousand-year-old Arc de Triomphe in Paris; the Louvre and the Louvre Museum in Rome; and the Musée d’Art Moderne in Paris. The museums will also receive $1.2 billion in emergency aid.“The restoration of these monuments offers France a new way forward, a way to show that it is determined to be a responsible partner and a friend in the fight against climate change,” said Environment Minister Franck Riester. “Today we continue to", "The next Biennial should be held at the MAMCO in Lisbon in the spring of 2021.”The event will mark the centenary of the French artist Jean-Luc Godard’s first visit to the UK. It is also scheduled to commemorate the twenty-fifth anniversary of the Biennial of the European People’s Republics of Macedonia, which will aim to showcase the richness of culture in the former Yugoslav Republics.\n\n\nThe Philip Johnson Foundation, which has dedicated more than $3.5 million to support contemporary art over the last ten years, has announced that it will not return the artworks to the estate that it owns in Los Angeles after it closed in March 2019. The foundation was forced to cancel the exhibition “The Artist and the Land,” which was set to run in the fall of 2019, and move it to Munich, Germany, in February 2020. The gallery reopened in the spring of 2021 but declared bankruptcy proceedings in May.“The foundation has invested a great deal of time, energy, and money into promoting the legacy of Philip Johnson, both as a commercially oriented collector and as a visionary collector,” said Jody Rogac, president of the foundation. “The foundation has been working", "The next Biennial should be held in 2022. The symposium will comprise Art and the American Experience, Art and the American Experience II, and Art and the American Experience III. The 2019–20 season marked the opening of Annual Students for the Arts, a student-run, nonprofit production company based in New York that organizes online events and creates works for the biennial. The exhibition was selected as part of a socially engaged program that also featured Toccarra DiBenedetto’s The Black and the Yellow and Terrile Allez-vous et l'Etat.\n\n\nThe National Theater in London and the Royal Shakespeare Company have announced that the London production of Julius Caesar will be reworked and re-released in the United Kingdom in March 2020. The new version of the play, titled Julius Caesar: The Remaking of History, will feature Julius Caesar as the king and will also introduce a new play in which the Roman commander-in-chief is played by Ben Kingsley. According to the New York Times, the upcoming version of the play will be titled The Histories We Tell, and will be produced by Jonathan Pryce, the director of the National Theatre", "The next Biennial should take place at a location that will maximize the mobility in and access to the artist-run exhibitions, including locations that are convenient for the artist, the biennial, and the visitor. The inaugural exhibition, “Rethinking Place,” will be held at the Rosle Collection in New York from January 16 to February 22.\n\n\nThe Pérez Art Museum in the Park, a planned expansion of the institution, has received a $10 million donation from the Walt Disney Company. The Walt Disney Company’s partnership with the Pérez Art Museum in the Park is a new initiative that will allow the museum to expand its collection, install more artworks, and increase the number of its exhibitions. The pledge also includes the preservation of the original 1929 building, which was designed by architect Santiago Calatrava and was constructed in 1939, and the Mestizo or “Peru” series, a series of paintings by Pablo Picasso. The new partnership comes after a year of discussions and negotiations between the Pérez Art Museum and the Walt Disney Company, which revealed earlier this month that it intends to raise $35 million to complete the expansion project. The funds will be used to create 150", "The next Biennial should take place in the year 2022.\n\n\nThe Taj Mahal Museum in India is planning to open a new exhibition with a focus on women’s issues in the city of Meghalaya in the state of West Bengal on September 1. The project, titled “Mahatma, Sex, Beauty, and the Body,” will be organized by the Meghalaya-based artist and curator A.P. Satyarthi and will focus on the history and theory behind the field of Tantric Yoga and the relationship between female sexuality and spiritual teachings.Thiruvanmiyur is planning to launch a new group exhibition series by the Indian artist Nandita Gupta, titled Women at Work, in January 2020. The exhibition will feature works by fifty-seven artists, including Mahesh Dutt, Hiromi Yamanashi, and Sohrab Mohebbi, and will run at the Thiruvanmiyur Art and Culture Complex from January 22 to January 25.The Tamil Nadu government has announced that it is planning to create a new cultural portal that will provide free access to cultural sites and be accessible to all. The site of the portal, which will be located", "The next Biennial should be held in the autumn of 2022. The next exhibition should take place in the spring of 2021. The next exhibition should be held in the autumn of 2022. The next exhibition should be held in the autumn of 2022. The next exhibition should be held in the autumn of 2022.The next exhibition should be held in the autumn of 2022.The next exhibition should be held in the autumn of 2022. The next exhibition should be held in the autumn of 2022. The next exhibition should be held in the autumn of 2022. The next exhibition should be held in the autumn of 2022.The next exhibition should be held in the autumn of 2022. The next exhibition should be held in the autumn of 2022. The next exhibition should be held in the autumn of 2022.The next exhibition should be held in the autumn of 2022. The next exhibition should be held in the autumn of 2022.The next exhibition should be held in the autumn of 2022. The next exhibition should have a retrospective, the first being Biennale d'Exhortation d , 2021, at the Museo de Arte Contemporáneo in Barcelona. The exhibition will be followed by a performance and a symphony", "The next Biennial should take place in 2020 and then again in 2021.  The first Biennial was held in 1998 and the second in 2005.  In 2009, the three-day event, which featured eighty artists from twenty-nine countries, was expanded to include a lot more art and a lot more subjects.The 2019 event, called the 'DRAWING FIELD,” opened on March 5 and ran through March 7. The 2019 Biennial was staged at the V&A, London, and the V&A/Wik­toria, Milan, and was held at the National Museum of Modern Art, Washington, DC, the Metropolitan Museum of Art, the Museum of Modern Art, the Los Angeles County Museum of Art, and the Museum of Contemporary Art, San Francisco.The biennial was organized by São Paulo de Almeida and Bessi Brasileiros and was organized by the gathering of artists from four continents: Brazil, Canada, Italy, and the United Kingdom. The artists were chosen by a jury comprising Daniela de Araújo, Ana de Araújo, Jair de Araújo, and Lisbeth Almon, as well as artist and curator Ana de Araújo.", "The next Biennial should have been held on the same date, but for the sudden weather crisis. The artists who were scheduled to participate in the event have now been moved to different museums, including the Museum of Modern Art and the Metropolitan Museum of Art. The museum of modern art has yet to comment on the cancellation.The new exhibition “Empress of the City: Life and Landscape in the Early Modern Period” is scheduled to open in January 2021. The show will present work by seventy-eight artists from sixty-five countries and forty-eight cities.\n\n\nThe Australian Sculpture Centre (ASC) has appointed Jenny Lehner as its next executive director. Lehner comes to the organisation from the Museum of Modern Art, where she has served as director of contemporary art for the last eighteen months. “Jenny is a seasoned executive who has successfully navigated both industrial and commercial environments to realize transformative projects,” said Steve Mitchell, the ASC’s director. “The appointment of a new manager and board chair represents a moment of great change for the organisation, and for the team, and it is enormously exciting to welcome her to the ASC.”Since Lehner’s appointment, the ASC", "The next Biennial should be held in late September or early October in the summer. The new exhibition will include excerpts from the work; a retrospective of the author’s first novel, The Black Box (2019); and a selection of longer works that will be on view for the first time.The artist’s new project, Art in the Time of War, will be curated by Roland Barthes, director of the Museum Stedelijk Museum, and will involve the twenty-first century exploration of the concept of time. The exhibition will include work by a selection of current or recent artists, including the Palestinian artist Ali A. Ateeq, whose canvases are displayed in a new work by the artist and professor Martin Heidegger, and will take up the theme “Time and Space,” a quote from Lewis Carroll.\n\n\nThe Solomon R. Guggenheim Museum in New York has appointed Andrew Cuomo as its next director. Cuomo comes to the institution from the Lincoln Center, where he has been the director of public engagement since 2011. He succeeds Racine Diem, who retired in August 2019 after twenty-five years at the helm of the institution.“Andrew Cuomo’", "The next Biennial should begin in 2022 and run for twelve years.The project is part of the BFA’s overall strategy to create more work-based experiences for visitors to the museum. The BFA’s new site-specific education center will close for a year to engage with local communities in Coventry and will reopen in the summer of 2021. Inaugurating the center will be a series of exhibitions on art and culture, including a retrospective of the artist-in-residence, Tamara Olshansky (2018–19), and a solo exhibition of works by the biennial’s final inductee, a painter and sculptor from Poland, Szymon Czarnecki-Wojtas.The Biennial Council said: “The BFA’s new site-specific education center will give visitors a new platform to engage with the museum, and will be a strong expression of the BFA’s ideals of collaboration and openness. The majority of our members are deeply committed to the theme, and we are confident that the program will draw together a rare and wonderful group of artists to create a site-specific experience for visitors to the BFA.”\n\n\nIn an effort to mitigate the", "The next Biennial should focus on the contemporary and contemporary art, and its connection between the American dream and the realities of the contemporary. We hope that this year’s exhibition will open the artistic and political consciousness of the city and also reaffirm the role of the artist in the city. The theme of the biennial is “The Future We Deserve.”The biennial will consist of three parts: a review of the biennial’s inaugural exhibition, “The Future We Never Had,” which opened at the National Gallery in London on November 16 and ran until March 14; “The Sculpture of a Life: Artists in the Life and Death Struggle of Art” (2019), a survey of biennials in which Iwan Wirth and Paul Gauguin sculpted the life and death of Pablo Picasso; and “The Swiss Connection: Art and Race in 1960” (2019), which will feature paintings by Gerhard Richter, Willem de Kooning, and Paul Klee.Nominated by the biennial’s founding curators, Adrian Ghenie, Tanya Fernández, and Ally Wiles, the exhibition was chosen to reflect the diverse, inter", "The next Biennial should take place in the spring of 2021.\n\n\nThe, which will take place in the Austrian city of Bochum from March 8 to March 10, 2020. The theme of the exhibition will be “The Oneness of Life.” The exhibition will focus on the aesthetic and philosophical question of what it means to be alive in the twenty-first century. In addition to the exhibition, the biennial will include a poetry-reading series, a library, an exhibition space, and an academic program.The theme of the upcoming exhibition is “The Oneness of Life.” The show will highlight the work of more than five hundred artists, including a selection from the upcoming exhibition “The Creative Life of Beauty,” curated by Klaus Biesenbach, among others that have been selected for the show. The twenty-first-century biennial will run from March 14 to March 16. The theme of “The Creative Life of Beauty” is the ontology of the physical and its connection to the future. The show will focus on the “creative life of beauty,” a certain idealized form of beauty that is seldom acknowledged by contemporary artists, and its relationship with the life", "The next Biennial should take place in 2022 and will feature a selection of works that have been restored to their original state, as well as work by twenty-five artists from twenty-five countries. We will also have a new presentation of work by the artist-in-residence, Elizabeth Smart, who was born in the United States in 1940 and lived in Europe for most of her life. During this next edition of Biennial, we will have a new theme, a new exhibition format, and a new exhibition design. We are also planning to organize a number of exhibitions on the history and current status of modern art in the city of Stuttgart and the city of Basel.The first show will be “Porchus asperatus” (the heroine as the muse). The artist and curator Kjetil Kriebel will present the work, which is an intersectional study of the relationship between the female body and the mind. The work, which is part of the upcoming exhibition “Luna and the Sun,” will be on view in the exhibition “Luna” until January 26. The second show will be “Porchus allegor*” (the moon", "The next Biennial should be held in 2021 and will be led by choreographer and designer Laura Owens. The biennial will also introduce new media to engage with the social, political, and spiritual issues of the city.”Alberto Barroso, the president of the Italian Federation of the Arts, told the Art Newspaper that the event will “advance the development of the art of modernity, of contemporary art, and of the arts in general. It is a great challenge for Italy to emerge as an innovative country in the world.”\n\n\nThe Hmong American Art Council (HACA) announced today that Luli Wong, a Vietnamese American artist who has been featured in works by artists such as Alan Parsons, Bob Marley, and Jackie Chan, will receive the award for lifetime achievement. Wong will be presented with the award at a ceremony at the Beverly Wilshire Contemporary Arts Center in Beverly Hills, California, on October 29. Wong will also be awarded a $10,000 cash prize.The award was established in honor of three Hmong American artists who have made outstanding contributions to the art of American art: Quan Thao, an artist whose work was published in the first issue of Artforum; Marcia Phan, a", "The next Biennial should begin in 2020. The 2020 edition will be hosted by the Museum of Fine Arts, Boston. It will consist of twelve exhibitions: “The Bone and the Bicycle,” 2020, “Composition and Form” 2020, “The Hidden Foundation of Modern Art” and “Yoshitomo Nara,” 2020, and will run through March 22, 2021.\n\n\nThe National Gallery in London has launched an online viewing room for the permanent collection in an attempt to improve the accessibility of exhibitions to the general public. The site will be accessed by visiting members of the public from April 5 to April 7, 2020. “We have taken a number of actions to make a large part of our exhibition program accessible to the widest possible audience, which is why the new online viewing room will be a lot more like the museum,” said Elizabeth Anagnos, director of the National Gallery. “The new platform will enable you to see our work, buy works, and see our exhibitions in person. We hope that you will see that we are taking the time and effort to make the National Gallery as accessible as possible to our members and visitors.”The National Gallery is also introducing a", "The next Biennial should be held in the spring of 2022.\n\n\nFounded in 1928, the New York Public Library is the largest public collection of the American artist Thomas Edison. Known for creating three works for its collection that year, it is the only institution in the United States that collects the artist’s work as a whole. It also houses the collection’s collection in its permanent collection and has the ability to determine the future of the collection through a twenty-year sale deal with the artist’s heirs.The sale is part of a larger initiative by the biennial to promote the American artist’s work. The biennial will open its new site in the summer of 2021. The inaugural exhibition, “Thomas Edison: The Biennial of his Works,” will be held at the Library of Congress in May. The final exhibition will be museum director Christiane Amanpour’s first, “Thomas Edison: The Art of Sculpture” at the Smithsonian American Art Museum in September.\n\n\nThe British architect Daniel Libeskind, whose geometric, experimental, and brightly colored interiors explored the notion of the 'solid' and the 'liquid' in architectural and artistic form, has died at age", "The next Biennial should be held at the National Gallery of Art in Washington, DC, in 2022.\n\n\nThe British Museum in London, which announced on Thursday that it will reopen on August 23 following a major overhaul, has extended its engagement with the French billionaire collector and philanthropist François Pinault. The institution’s director-general, Maria Balshaw, and collector-general, Charlotte Roxburgh, will play a major role in preserving the institution’s collection and reburying the collection’s forty-four-piece collection, which includes works by Marnier de la Poiret, Jacques-Louis Neuville, and Pierre-Auguste Renoir, among others, at the end of next month.The museum has also expanded its online presence in an attempt to broaden its appeal to a wider audience. Pinault’s headquarters in Switzerland have been relocated to a smaller building in the city of Aachen, and the collection now resides at the Aachen-Stiftung in Germany, where it will receive further research and development. In an attempt to address the museum’s long-standing challenge of retaining its collection, the institution is now planning to split the collection into two buildings, one", "The next Biennial should take place in 2019, and the Grand Prix in 2020. The venues for the 2018 and 2020 editions of the exhibition were not announced.\n\n\nLászló Bell, the Hungarian artist who transformed his own body into a living art installation, has died at the age of seventy-eight. According to Artnet, the artist is best known for constructing works that draw on mythologies, mythologies that evoke the artist’s own body, and his own unconscious. “Bell’s body consists of a series of sculptural forms, each representing a specific moment of his artistic development, and their respective histories,” Bertram Strachan wrote in a review in the September 1993 issue of Artforum.Bell’s sculptures, which are often found in museums across Europe and have been adapted by countless artists, are often described as “situations of the body and its history.” His work has been exhibited at the Venice Biennale (2007), the Museum Tübingen (2007), and the Musée d’Art Moderne (2010). Much of his body art was included in his first major solo exhibition at the Museum of Modern Art in Budapest in December 1948, and he continued to", "The next Biennial should focus on a new set of questions that will challenge the existing conceptualizations of art and philosophy: How do we create new worlds of art from the same materials? And what does art look like from a material point of view? In a recent exhibition in Detroit, the artist Tarek Atou, a Sudanese American, depicted a biennial of American art from the 1880s in a 21st century Biennial, in the form of an electronic simulation.In the next Biennial, the art will be made of Plexiglas, the canvas being made of glass. In the 2020 iteration, the Biennial will feature three exhibition themes: Moving Images, Virtual Reality, and Virtual Worlds.The 2019 Biennial, titled Moving Images, was organized by curator Jane Panetta and the New York–based multimedia artist Michael Malice. The exhibition drew from original works by Panetta, Atou, and Steve Futt, as well as works by contemporary artists such as Peter Hitchens, Victoria Miro, and Tom McCarthy.\n\n\nThe Museum of Modern Art (MoMA) has named Rand Kaufman as its next director. Kaufman comes to the institution from the Metropolitan Museum of Art, where he has served as associate curator of contemporary art since 2014", "The next Biennial should take place in the spring of 2021, and the first in the autumn of 2022. The theme, “A World Without Fear,” will recall the work “A World in Transition: A World Without Fear” (2019), a biennial that aims to synthesize artworks that are currently on display in museums in various countries around the world.According to the New York Times, the decision to cancel the show came after a series of events that took place at the museum, including the reinstallation of the museum’s site-specific artworks, the promotion of exhibitions based on the museum’s collection, and the appointment of a curator of modern and contemporary art. The exhibition “Becoming a Modern Museum: How Art and Culture Contributes to the Embracing Diversity of the World” has also been suspended. “We are deeply saddened by the show’s cancellation,” said Museum Director David Childress. “The exhibition is an important and moving testimony to the excellence, integrity, and humanity of the museum’s staff, and we are eager to see what new and exciting exhibitions will be presented at the museum in the months and years ahead.", "The next Biennial should be held in 2021, according to a statement from the Art Newspaper. “The work of the artists representing the next Biennial will remain intact and will be manifested in the exhibition, which will be rotated through an exhibition of works by artists from the period.” The 2019 show, “The Barrels and the Dogs,” featured work by more than thirty artists, including Miriam McLean, Rory Mulligan, Evan Wheeler, and Sara Zander.\n\n\nThe City of Los Angeles has established a $2 million fund to help preservationists and heritage organizations in the city recover from the coronavirus. The fund was established in partnership with the nonprofit nonprofit Preservation International in order to “prevent further harm to critical cultural assets through the use of the coronavirus,” according to a statement from Mayor Antonio Villaraigosa and Councilman Mitch O’Brien. “We’re going to be there when the dust settles and we’ll come together to heal this city.”The fund will award $1.2 million over the next six months. The funds will be distributed in the form of grants and will be competitive with grants", "The next Biennial should take place in 2021 and will be a combination of two biennials, the first being the “Pacific Triennale,” and the second being the “Olympics,” said Björn Hjortenberg, the head of the Art and Architecture department at the museum. While the building of the exhibition, which will be staged in collaboration with the neighbouring København, will be financed by the København Museum, the Art and Architecture department will be supported by the København Foundation. The venue will be situated near the København Museum’s newly renovated exhibition hall.The København Museum director, Lars Gjødratmæller, said: “At a time when the art of architecture and the contemporary art landscape is awakening and is at the verge of a transformative transformation, the København Museum is committed to working with architects and designers to create the next edition of the København Triennale. In this context, Lars Gjødratmæller and his team were delighted to help Richard Avedon and the team at the K", "The next Biennial should be dedicated to the history of the city of Santa Monica, which was founded in 1904 by Italian immigrant philanthropist Giacomo and his wife, Gianna Bernadettino; the diaspora in the United States; and the indigenous people of the Santa Monica Mountains. The city of Los Angeles, which was founded in 1932 by American immigrant architect Frank Gehry, has a plethora of urban projects underway including the piloting of the 405 freeway and the re-creations of the city’s original Chinatown, the Pasadena Museum of Art, and the Palatine Gardens. The Arts and Culture Center of Sausalito, California, has received funding from the Richard and Edie Sedgwick Foundation and the W.W. Woolworth Foundation, and the San Antonio Museum of Art has received funding from the David and Lucille King Family Foundation. Museum founder Willem de Kooning, who died last year at the age of eighty-eight, was a prize-winning art dealer whose practice included the commissioning of works by German Expressionists, Gertrude Stein and others from his collection, and whose paintings were displayed in the official catalogue of the Dusse", "The next Biennial should take place in the city of Antwerp in November 2020, the Arts Council said. “The Biennial will give the public a new opportunity to see the works of our participants in the exhibition at the exhibition space within the city, and will introduce them to our artists and institutions,” said Juliette de Tocqueville, who curated the exhibition.\n\n\nThe Los Angeles County Museum of Art (LACMA) has ordered the release of Ashley Foster, a former professor and president of the art school at the University of Southern California, who was detained on suspicion of domestic violence and released on $2,500 bail last week, reports the Los Angeles Times.Foster, who was placed on administrative leave in 2016 after she allegedly punched her ex-husband in the face after an argument over a $5 hamburger, was reinstated as a faculty member at LACMA last month, but her employment status is not yet clear. The institution is currently undergoing a $500 million expansion, which will include the opening of two new galleries.Following a public outcry, which was sparked by images of Foster punching her ex-husband in the face, LACMA began welcoming visitors again on May 7, and", "The next Biennial should have an open-ended format, inspired by the construction of the exhibition, in which the artists may reflect on their past works, or their present projects. It should also focus on the exhibition’s legacy, and the new work set for the exhibition, and their reactions to it.\n\n\nThe British Library will now begin digitizing some 150,000 works, large and small, from the original team behind the groundbreaking 1968 exhibition “The Interpretation of Painting: From the Interpretation of Paint to the Present Day” at the Museum of Modern Art in London. The project was inspired by a request from British Prime Minister Margaret Thatcher in 1986. Titled “Remaking the Paintings,” the exhibition brought together thirty-two artists, including Malcom Muggeridge, Barbara Gladstone, Mark Halverson, and Adrian Piper, who transformed their paintings into paintings created at a sampler in Dublin in the late 1970s, and garnered some 4.5 million visitors.A year later, the government established the British Digital Library, which aims to make up for the lost eight hundred works in the collection by digitizing the entire archive. In February 2017, the project was given a major boost thanks to the donation of two", "The next Biennial should be held in 2020.\n\n\nThe New York filmmaker Peter Schäfer has been selected to direct an exhibition at the Center Pompidou in Paris next February, the French government confirmed. Schäfer is currently working on a documentary about the contemporary art in Paris. The show will be titled Paris: New Art and Its Legacy, and will be organized by the Center Pompidou.The French Ministry of Culture and the Center Pompidou are supporting Laura Mulvey’s effort to create a new collection of work by Sol LeWitt, Elia + Son, Ip Manan, and Franz Fanon in the country. The museum will create the new exhibition in June 2020.Next year, the center will stage the work’s first exhibition, an exhibition dedicated to Salvador Dalí’s Dreamer and the Body (2019); a selection of his drawings; and a retrospective of the artist’s work, which will be staged by the National Galleries of Fine Arts in Beijing in March 2021. The Fifth International Salon of Latin American Art, which will be held in the city of San Juan, Puerto Rico, in February 2021, is also slated to open in 2020.The newly", "The next Biennial should take place in 2020.\n\nThe New York–based artist-run institute, which is not affiliated with the museum, has received a $25,000 donation from the Lemons Foundation. Its $50,000 contribution will help pay for a new series of exhibitions and residencies in partnership with the museum, which will now be able to house an additional hundred artists annually. “The Lemons Foundation is committed to supporting exceptional artists and organizations,” said David H. Lemons, the foundation’s president. “With the recent gift, the museum will be able to present a program that reflects the Lemons’ vision for the museum: a position of extraordinary strength, a welcoming gallery that can transform the neighborhood, and a central location for exhibitions and residencies in the heart of Manhattan.”The Lemons Foundation has awarded more than $100,000 to ninety-three artists, including Alighiero Benitez, Alex Buñuel, and Aric Almi’s work, and has supported seventeen organizations; among these are the New York City Council on the Arts, the National Council on the Arts, the Metropolitan Museum of Art, the Museum of Modern Art, the New York", "The next Biennial should be held at least once a year, and should be a collection of works that address important and timely issues. I will continue to work with the museum to advance the museum’s contemporary vision in a way that is both creative and historical. I will reconsider the constraints on performance art and perhaps begin to accept that performance art is a way of life for many people. The biennial will also have to address the present, the future, and the self. It will have to reflect the increasing belief in the transformative power of art and how it can shape and change our world.”To submit a request for participation in the upcoming biennial, click here.\n\n\nThe Metropolitan Museum of Art has received a gift of sixty-seven works from the Arsht-Saulnier collection in New York. The gift includes works by Richard Avedon, Raymond Boisjoly, Joseph and Mary Christovale, Robert Cordon, David Goldblatt, and Hans Christian Andersen, as well as a selection of recent works by artists such as Nick Cave, Thom Mayne, and H. M. Yeo and one of his sons, Hans Christovale-Saulnier. The collection also", "The next Biennial should be held at least once every two years, and perhaps three times a year.” In the first year, all fifty of the biennial’s artists will receive a combined $2.5 million; the next year, it will return with a fairer distribution of the funds. The biennial will also undergo a major renovation. Deepa Ganesan, the Bangalore-born Bangalore-based writer, artist, and educator, said in a statement: “The biennial is a platform to challenge the boundaries and white-wash the domestic ills that are latent and often unnoticed by the many, the majority within the Indian diaspora. It is a chance for many to publicly and visibly confront these, and to engage with them through the creation of a platform for contemporary Indian arts.”The two-year plan is a departure from the current four-year cycle, which is held up as a model for how to organize a biennial. The 2019 edition was held in Bangalore. The biennial, titled “The Truth About Life” and curated by Praveen Patil, featured artists such as Siddhartha Mukherjee, Anuradha Rocha, and Vimala", "The next Biennial should be held at the archives at the University of the Arts, London, in early December. The remaining dates are for the Tate and the National Gallery.\n\nThe London-based organization Our Children, which works in partnership with schools and charities to raise awareness of and access to arts and culture for disadvantaged children, has launched the London-based arts organization the Children’s Fund. The independent organization collects and distributes arts and culture to low-income and disadvantaged communities across London. Our Children will use the funds raised by the new organization to create a new exhibition, “Making Places,” that will highlight the work of children in the capital.In a statement, Our Children said: “Children are the future of the arts and our future is today and tomorrow. In this job, children are at the heart of it. Their creative energy and creativity is what will sustain us all as we work together to make our communities and world a better place.”The organization’s first London show will be “Making Places,” which will present children’s drawings, paintings, and installations. The show will focus on the legacy of Barbican, a 14th-century church in Kent, and will run", "The next Biennial should be held in 2020. \n\n\nFrench artists Hélio de Botton, Yves Klein, and Edouard Villerière, among many others, are repurposing the streetscape of Parisian rue Lafayette to create the first public works on the site of the Grand Salon de France, which will reopen in 2022. The half-finished works, which were inspired by the city’s cobblestone streetscape and the Élysée Palace, will form a cityscape around the monument to the Industrial Revolution, which is currently undergoing a $1.2 billion expansion.The exhibition will be presented by celebrated contemporary artist Marc-Olivier Frères and will take place on the site of the former Salon de France, which was transformed by the French architect Gabriel-Louis Leclaire into a museum of the French Enlightenment. The museum will host an exhibition dedicated to the history of fashion and will re-create the iconic avenue Lévy Gorvy , which leads to the grand salon. It will also have a bookstore, a café, a concert venue, and a theater.The exhibition will highlight the history of French fashion, drawing on the the works of Klein, de B", "The next Biennial should be held at the Seattle Art Museum (SAM), in April 2021. This year’s event will cover the beginnings of the American West and the creation of the Polynesian Island archipelago and will be curated by Junji Ito.Nan Goldin, the director of the San Francisco Museum of Art, told the Los Angeles Times, “This is an opportunity to build on the legacy of the Japan Foundation, to continue to operate in a way that preserves the foundations’ mission.”The exhibition, titled “Indigenous Landscapes of the Americas,” will be held at the San Francisco Museum of Art from March 24 to April 5, 2021. The San Francisco Museum of Art is currently undergoing a major expansion project, which is expected to open in 2021.\n\n\nThe Museum of Fine Arts (MFA) in Atlanta is taking another look at the social, environmental, and economic effects of gentrification. The city’s largest arts institution, which has a 150,000-piece collection spanning film, music, and dance, is working with the Georgia-based nonprofit organization, the Georgia Renaissance Coalition, on a housing strategy that will ensure that 75 percent of its new housing units are made", "The next Biennial should be held in 2021. “I am truly honored to be the first to lead the Biennale of Chicago,” said Soti. “The visual arts program of the Chicago Museum of Art is truly unique. The biennial, with its opportunity to present the works of the most important artists of our time, will be a powerful statement about the city.”\n\n\nThe Metropolitan Museum of Art has received a $500,000 gift from the philanthropist and collector Abigail and Duncan McArthur, the parents of Matthew and Brendan McArthur. The McArthur-Donohoe family established the McArthur–Donohoe Art Museum and Gardens in northern New York in 2000. In 2007, the McArthur–Donohoes donated their art holdings to the institution for its collection. The gift included more than 150 works by thirty-six artists, including Pierre-Auguste Renoir, Jean-Michel Basquiat, and Jean Antoine-François Miro.In a statement, the McArthur–Donohoes said: “The gift of these works will help us to continue to present the finest works of visual art in the United States, and will prove a powerful rallying point for", "The next Biennial should be completed by the end of the year.  The new series of exhibitions will be curated by artists such as Elle Parc, Jeff Koons, and Sarah Lotfogel & Richard Neutra, and will showcase work by a select group of artists that will be presented in a series that will begin with a selection of “parasite art” in 2020 and continue with exhibitions in 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has hired Laura Preciado, who previously served as the deputy director of curatorial affairs at the Museum of Contemporary Art (MCA), and Jaye Adams, the deputy director of curatorial affairs at the Solomon R. Guggenheim Museum, as executive director and chief curator. Both worked at the Guggenheim and are longtime advocates for urbanism and micro-use.“Jaye and Laura are passionate about the Guggenheim’s mission of supporting artists whose work is rooted in their communities and exploring how art and urbanism can play a role in elevating the region’s arts and creating new connections between Los Angeles and New York,” said curator and cofounder of the Los Angeles City Council Lee", "The next Biennial should take place in the spring of 2021 and will be held at the Paris Opera House from March 22 to March 24. The event will be hosted by the Parisian Fête des Arts (PFA) and will be staged in tandem with the upcoming Art Basel Miami Beach. The deadline for artists and institutions is March 23. The PFA will present Memphis-born, New York-based artist Zoë Brätsch, who has lived in Paris for fifteen years, March 10–March 13. Brätsch will create a floating garden in the city in a city-owned, state-owned, museum. Brätsch’s work will be moved to the Pépargrès, a restaurant and cultural space located in the Louvre, and will then be donated to the Biennial by a group of artists and art collectors led by Yoshitomo Takeda. Their intention is to create a new museum in honor of the artist. Brätsch’s studio will be located in the city of Charleroi, located in the province of Lorraine, France, and will be connected", "The next Biennial should take place in the summer of 2020. The twenty-six-thousand-work collection, which includes twenty-six works by sixty-six artists and collectors, is slated to be launched in the autumn. The institution opened its first exhibition space in the city in 1967. In an interview with Artforum in 2018, Kieran added: “The museum is an extension of the city, and there is a lot of intangible regeneration going on there. The building of the museum will engage with the city in a very personal way, as if it were a second home.”Since the inaugural exhibition, the Biennial of Contemporary Art has been more or less on hiatus. Last year, the museum also announced that it would be “re-energized” by the London-based artist and curator Marion Newby, who previously ran the exhibition space the Suburban Museum in the British city of Manchester. Newby would be the first to launch a new work at the museum, which is located in a former munitions factory in the heart of the city, and the first to bring a new work to the museum.Culture Minister Aileen Mitchell said: “I’m delighted that Kent will be", "The next Biennial should be pushed back to 2020, and the date of the 2020 exhibition should be changed to a month later, suggesting that the 2020 event will be held at an alternate date. The label also stated that the \"budget\" for the 2021 edition would be renegotiated and that an open call for nominations would take place early next year. The 2019 edition at the museum was postponed because of the Covid-19 pandemic, and the 2019 festival was moved to the end of the year. The 2019 exhibition “The Borg” was originally scheduled for November 28 to December 7, and the organizers said it would now take place in March 2021, with the opening of the exhibition “The Real World: Art in Action” in October 2020. The 2019 exhibition “The Egyptian Revolution: From the Making of a Single Painting to the Making of the Revolution,” which coincided with the first round of protests against the country’s new constitution, was rescheduled for May 25–May 28.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has received a gift of nearly 2,700 works by thirty-nine Indonesian artists from Jakarta’s private collection. Founded by Julius Yutu", "The next Biennial should probably include more of the same exhibitions. The biennial in Abu Dhabi will, at least, re-create the visual impact of the 2013 edition in the United Arab Emirates, but one of the mistakes that the organizers made this year was to sell the rights to Al-Madina, an artist and founder of the Abu Dhabi-based group the Abu Dhabi Institute of Art (AIA), for just $20,000, which is an embarrassment for a prestigious, global arts center.“I think the biggest mistake was this: we thought we had a good chance to win the Art in the Collection Challenge and to have our theme, ‘Fashion,’ in one of the best-preserved buildings in the world,” said Al-Madina. The competition, which launched in January 2009, was designed to encourage the sharing of collections among the thirteen artists represented. The theme of the exhibition was “The Body in Fashion,” and the participants were divided into three groups based on their gender: men, women, and non-binary. In order to reduce the amount of media coverage that the exhibition received, a spokesperson for the biennial said that the theme would only be presented by three artists.The", "The next Biennial should be held in 2022, after the Russian pavilion has been closed for a minimum of ten years due to the Covid-19 pandemic. The curators will be Max Blumenthal, David Blaine, and David Lewis, and the exhibition will be the first to address the history of the art world and its relationship with the manufacturing sector, and will take place in the courtyard of the Museum of Modern Art (MoMA) in New York.Riccardo Cipolletta, director of the Museo Bondista in the Museo del Artesino, told the Art Newspaper: “The events of the last few years have shown that the museum is facing a serious problem. We had a chance to work with the government to develop a new project for the exhibition, but we chose not to. We are working with a government commission, not with someone else.”The commissioning board has since been formed and will present the pavilion’s design, the history of the art world, and the history of the art market in November. The first Biennials were held in the city of Venice in 2001 and 2007, respectively.\n\n\nValeri Pereira, the man behind the first Biennials", "The next Biennial should be held at an adequate time since it will probably not enter its sixty-eight-hour cycle of exhibitions and residencies. The biennial should be a vehicle for the creation of new work and an occasion for dialogue between artists and the public. It should be a vehicle for the diffusion of fresh ideas through new platforms and a forum for the exchange of works.”The exhibition, “The Good Life” was organized as part of the exhibition “The Restitution of the Body: Art and the Body in the 1980s” (2015–16) at the Biennale of Sydney, the Melbourne Biennale, and the Philadelphia Biennial. The exhibition was curated by Michael Berger and Michael Chiu, the curators of Jacques-Louis David’s The Memory Palace, and the exhibition also featured work by artists such as Rachel Whiteread, Nari Ward, and Deborah Callaghan. \n\n\nArtist-run spaces, incubators, and photojournalism ventures are now facing new regulations and their business models as a result of the coronavirus pandemic. While the Centers for Disease Control and Prevention (CDC) announced on Tuesday that the number of Americans infected with the virus is", "The next Biennial should focus on “The Shape of Space” (2014), an exhibition organized by the Los Angeles County Museum of Art that explores the “shape of space”\u0097a reference to the shape of the universe. In a statement, the museum said: “As a museum, we enjoyed a successful and successful 2018–19 season. We are confident in the future of the 2017–19 season and will focus our attention and efforts on preparing for the biennial’s ultimate edition, which will take place at the Venice Biennale in 2021.”\n\n\nThe British artist Peter Sellars, whose scarlet, semi-abstract canvases juxtapose surrealism with a rationalist sensibility, has died at age eighty-eight at his home in London. The work, which ranges across paintings, drawings, sculpture, and video, explores the potential of painting and drawing to transcend and transcend reality.Born in London in 1938, Sellars studied under the Cambridge artist-philosopher Lewis Mumford, who died in 1976, and later with the late British conceptualist-painter Peter Spalter, who became a mentor to the young artist. The pair began their early careers as puppets and", "The next Biennial should be held in 2020, according to an announcement made by the organizers on Wednesday.The inaugural event, entitled “The Politics of Life and Death,” was organized by the Büro Ergos Museum and Gallery in Istanbul, as part of a larger initiative that aims to create new public experiences through the study of contemporary art. The exhibition would feature works by artists such as Le Baroque, Wolfgang Oele, and Ursula Nordstrand, as well as works by contemporary and historic artists such as Lisette Neruda and Adam Pendleton, and would feature a number of works by the world’s leading contemporary artists, including Damien Hirst, Jocelyn Delahanty, Sophie Cremaux, Alighiero Spina, and Louise Nevelson.The exhibition was curated by Antony Hudgens, the museum’s curator of contemporary art. Hudgens is also the executive director of the Arts Council, a London-based organization that promotes contemporary art and artists. The exhibition was organized in cooperation with the Istanbul Design Museum and the Design Graduate Center, and was curated by Marc Glimcher, the curator of modern and contemporary art. Glimcher is also a founding member of", "The next Biennial should focus on the history of photography and its development during the twentieth century. We should also consider the perspectives of the exhibitors and of the international community.”\n\n\nThe Italian filmmaker Giulia Battista, who was one of the first to use film to explore the historical and contemporary representations of Italian art, has died at age fifty-seven. She was born in Rome in 1940 and raised in the city, where she studied at the prestigious Lamberto Arti in Bologna, before moving to Turin to study with the legendary Italian director Paolo Baratta. After graduating in 1961, Battista went on to direct Di Giorno, a groundbreaking experimental Italian film series that examines the ways in which art and pop culture interact. In addition to her filmmaking, she also authored several books, including The Sex Pistols: Italian Films in the 1960s (2002), a history of Italian cinema published by The Caso di Rivoli.Her biographer describes Battista’s visual experience as “particularly inspired by the films of Paolo Baratta and Lucio Fontana.” He says that Battista was “the only good-looking Italian director who managed to create a kind of surrealist art cinema.�", "The next Biennial should take place in the fall of 2020. \n\n\n​\n\nAs the number of victims of the coronavirus continues to grow and as more states are implementing social distancing restrictions and enacting emergency food and shelter bans, the Museum of Jewish Heritage in New York is preparing to reopen in early 2021. The institution confirmed on Tuesday that it will begin welcoming visitors in the fall, but did not specify when such a reopening would take place.Museum director Daniel H. Weiss said: “We are anticipating a long and challenging fall as we work through the recovery from this pandemic. We are also preparing for the possibility that we will be forced to close permanently. This is a complex and challenging situation. We are fully committed to engaging with our neighbors, the community, and our visitors to understand and appreciate the gravity of this crisis.”Weiss added that the museum is still assessing the health needs of its visitor and will likely tune down the performance of its main attraction, the Negev Desert Museum, in the coming months. The move will likely involve the dismantling of its entirety, the Negev Desert Museum, and will likely affect guests’ behavior in the desert region as well. \n\n\nItalian", "The next Biennial should take place around the year of the First World War, with a view to introducing a new vibrant theme at the exhibition space. The programme will highlight the growing impact of art and design, and will present a collection of twenty-five works by artists including Mark di Suvero, Rineke Dijkstra, and Saritaji Alves, as well as a selection of contemporary art. There will also be a new exhibition, Art, Design, and Architecture, in collaboration with the Peter Blum Institute of Contemporary Art. The Biennial will be organized in three stages, with the first taking place in October 2019, at the Netherlands-based Konrad Adenauer Aerospace Centre in Cologne. The second exhibition will take place in November 2020, at the Nijmegen Biennial, and the third in February 2021. The exhibition will be staged in the Museumsintwo Middelheim, the Motsjes Museum, and the Netherlands, and will run alongside Biennales in New York, London, and Hong Kong. The 125,000-piece Museum of Modern Art (MoMA), which recently announced its intention to close permanently, is also closing permanently. Its final exhibitions include “The", "The next Biennial should be held in April 2020 and it will organize a sequence of talks and exhibitions. The inaugural exhibition featured work by twenty-nine artists in March 2020. The second Biennial, for which the pavilion was built in 2005, was held in December 2019 and will be held in March 2021. The biennial will also introduce an expansion that will introduce new works by artists from underrecognized areas of art history.The lecture series, which will be led by artist Elle Frode, will be curated by artist Frédérique Anagnos. The exhibition will be shown in conjunction with Arts & Culture Month and will be hosted by the Museo de Arte Contemporáneo in Barcelona.The Biennial will be inaugurated at the National Museum of Modern Art in Barcelona, which is currently undergoing a $15 million expansion, on March 22.\n\n\nThe Canadian Centre for Contemporary Art (CCA) in Ottawa has appointed Jona DeLuca as its next president and CEO. DeLuca succeeds Peter Meggs, who was appointed last month and will begin his tenure in January 2021.“The board of directors and I were pleased to welcome Peter to the", "The next Biennial should be held at an undetermined date in the future, with the options of April 30 or May 5, 2021. “We are privileged to be able to be able to share these first works with our audience, and are honored to present our work in this exhibition to the public,” William Price, the curator of the exhibition, said in a statement. The Biennial will also feature works by Ravi Shankar, Alejandro Campanelli, Shahzia Khan, Mark Rylance, Tanya Solovitz, and Pierluigi Battista. The full list of participating artists is as follows: James Aspinall (United Kingdom) Elizabeth Allison (Italy) Juergen Bommert (Germany) Kaj Blumenfeld (Germany) Jacques Chirac (France) Henry C. Guin (France) Pablo Picasso (France) Richard Meier (Germany) Albert Löwenbräuke (Germany) John McAllister (Switzerland) Hélio Oiticica (Spain) Hermann Otto Müller (Germany) Alexander Miro (Germany)Hermann Oiticica (Spain) Hiroshima", "The next Biennial should be held in the spring of 2021. The twentieth one will be held in the summer of 2022. With a budget of US$3.25 million, the event will draw 50,000 visitors and will feature works by fifty-two artists in the exhibition.Dubbed The Performance, the biennial will showcase events that were staged by twenty-nine artists at the same time, with the exhibition opening on the last day of the three-month event. The event will run until 2022.\n\n\nThe British Museum in London has appointed Kate Mullican as its next director. Mullican comes to the institution from the London School of Economics (LSE) in a resignation following a meeting with chief executive officer Ben Dassen. She succeeds Sir Christopher Leeson, who has served as director of the institution for more than thirty years.“With immediate effect, we are appointing Kate as head of the British Museum,” Dassen said in a statement. “In this age of unprecedented upheaval and upheaval, as a nation we are facing many challenges and I am confident that she will be instrumental in guiding the museum through this moment.”During her tenure at the LSE, Mullican oversaw", "The next Biennial should focus on the \"gift economy\"\u0097the practice of giving and buying in remote areas of the world\u0097and will also feature a portrait of artist-activist Pei Wei, who helped initiate the Hong Kong art scene. The first exhibition was penned by curator and collector Chiu-Ping Liang. In a separate exhibition, titled “Wu Tang: The Determined Life of Art” (2019), the artist will focus on his life and work in China\u0097he is a member of the directorate’s family.Details about the future show no signs of slowing down. The biennial will be held at an undisclosed location in China\u0097there are rumors that it will take place in the city of Dusseldorf and will be organized by the Chinese artist-tradition institute Shaolin-Wu, which is based in Beijing\u0097in the fall of 2020.\n\n\nThe Museum of Modern Art (MoMA) in New York announced today that Henrik Franz, who served as curator of exhibitions at the museum for more than twenty years, has died at age seventy-eight. The Danish artist, whose work sometimes explores how art and technology intersects with everyday", "The next Biennial should be in August 2021 and will include presentations of works by artists and institutions from the Latin American and African dioceses in the United States and Mexico.\n\n\nIn an attempt to reduce the environmental impact of the California-based biennial the Museum of Contemporary Art (MCA), which has been plagued by problems stemming from the coronavirus for months, is planning to terminate its relationship with the Los Angeles County Museum of Art (LACMA), which signed a long-term contract with the institution in February 2019.According to the Los Angeles Times, the MCA expects to lose $46 million in the 2019 fiscal year and $48 million in the 2020 fiscal year, a loss that believes to be the largest in the museum’s history. The Los Angeles City Council is currently debating $1.2 billion in funding for LACMA, whose current lease expires in May 2021. “At this point, it seems like a crazy long way to go,” MCA director Lalo Alcaraz said. “But we don’t want to go backwards. We want LACMA to be a centerpiece of the cultural conversation, and we want LACMA to remain a landmark in Southern California.�", "The next Biennial should be an extension of the first, with new and expanded programming and a newly commissioned work by Gholamreza. The opening of the biennial will be hosted by the Museum of Contemporary Art Los Angeles (MCA), with the assistance of artist David Salle. The exhibition “will be the largest retrospective of Gholamreza’s work to date,” Salle said in a statement.\n\n\nThe Long Island Museum of Art (LIL), in New York, has appointed David Siegel, the senior curator of modern and contemporary art at the Brooklyn-based nonprofit artist-run space the Lounge, as its next director. Siegel will be responsible for the care and management of the roughly sixty artworks and installations that are currently housed within the institution’s building, as well as of mentoring future generations of museumgoers and developing new programs. During his tenure at the space, Siegel has curated several exhibitions, such as “The Making of Modern Art: Stories of a Life” (2018), “The Intimate Present: Art and Gender in the Nineties” (2016), “Art at the Lincoln Center: A Retrospective” (2015) and �", "The next Biennial should be held in the summer of 2020.”After President Donald Trump’s inauguration, a number of artists, including Patricia Arquette, Kurt Vonnegut, Mapplethorpe, and Robert Irwin, withdrew from the event. The move was seen as a sign of the new White House’s hostility toward cultural institutions.\n\n\nThe National Endowment for the Arts (NEA) in the United States announced today that it will no longer award grants to the arts programs of California universities that have not been accredited by the state. The agency previously put more than $800 million into improving the academic standing of California’s public universities in 2015. It also spent $140 million to improve the academic standing of four colleges in Los Angeles, the San Francisco Bay Area, and the San Diego Bay Area.“California’s arts and culture sectors have made significant gains in the last two decades, as evidenced by the record $52 billion in cumulative arts support received by California universities in the past two years alone, and the state’s forecast for 2020 for substantial increases in arts support,” said NEA director Deborah Granholm. “By contrast, institutions in Los Angeles and San Francisco have not", "The next Biennial should take place in the spring of 2020 and will be an enlargement of the inaugural exhibition, with a focus on women artists, to include more women artists. The projects will be led by women artists and will be organized in ways that reflect their own practices and that are respectful of the historically underrepresented and underrepresented sections of the field.”The biennial will also introduce a new exhibition, a biennial survey, and a new series of lectures and discussions. The 2018 edition of the biennial, “Assemblages in the Air,” included work by forty-five artists. The 2020 edition of the exhibition will draw from forty-four works by thirty-six artists.Commenting on the 2020 edition, Masataka Takahashi, the president of the biennial, said: “The combination of a strong and flexible curatorial team, a bold exhibition program, and a rich range of participating artists, who interweave a variety of styles and approaches to the same medium, will give the audience of the biennial a new way to experience the art of the twentieth century. I am confident that this will be a landmark exhibition in the history of the biennial.”\n\n\nThe New Museum", "The next Biennial should be held in 2022.The 2006 edition of the Art Sale in New York City, which took place in a former dry cleaner in Manhattan, was canceled after organizers learned that the event would be held against the backdrop of the cleanup that took place around the clock the previous year. The museum was forced to cancel the event after it failed to secure the $3.5 million to cover repairs to the building’s roof and floors. In a statement, New York’s Metropolitan Museum of Art said that the Garth Brooks–inspired exhibition was canceled as a result of the coronavirus pandemic. The Garth Brooks Foundation, which represents the artist, said: “As with all things, there are pros and cons to any of these decisions, but this particular one is not one of them. Garth Brooks died on December 14th, and unfortunately, we cannot continue with his work as it is without his.”\n\n\nThe Costume Institute of Design (CID), a New York–based nonprofit that provides technical assistance and promotes artistic excellence through a variety of programs, has appointed Dara Campbell as its next executive director. Campbell will assume her post on January 7, 2020. Previously, Campbell served", "The next Biennial should take place at the Palazzo Vittorio Catellani in Venice in June 2021. \n\n\nAs the investigation into the mysterious death of Italian artist Gianluigi Battista continues, a group of artists and designers have decided to boycott the upcoming edition of the Venice Biennale in protest of both the festival and the Italian government. “Ivan Albright’s exhibition ‘All International’ will be staged at the Institute of Italian Art in Milan,” Paolo Chicco, Miranda, and Marc Spiegler, the leaders of Artforum.com, wrote in an open letter published on May 13. “The work, which will be on view in the exhibition’s first season in September 2019, is part of a series of paintings that examine the meaning of the iconography of the exhibition and the contemporary Italian art scene. We are aware, however, that the exhibition will include works not currently included in the show; these are currently being developed. We believe that this is an important step in the way of the exhibition, which should be free, transparent, and inclusive of the public, and that this decision has nothing to do with the show or the Italian government.”The", "The next Biennial should be the official show of what is shaping up to be the year of the Biennial. “We are at a turning point,” Ishikawa said. “Myself and a group of artists have chosen to focus on the art of the future. This year, I hope we can create a show that will serve as a model for how we will have the opportunity to create together in a world without borders and with a future.”As the biennial approaches its seventy-sixth anniversary, the world will be reminded of the artists who have shaped its history and of the role of art in shaping our mores and determinations. The show will feature works by seventy-five artists, including Paul Gauguin, Vladimir Rublev, Thomas Dolman, Bertrand Russell, Timeless Meditations, and Alighiero Guidi, and will be held at the cities of Venice, Venice Bay, and Venice, the city of Venice, and Venice, the city of Venice, and Oosterbeek, in the United Kingdom and Europe. The exhibition will run through March 9.\n\n\nThe Guggenheim Foundation announced today that it is still working to determine the exact location of the Guggenheim", "The next Biennial should be held in 2021. “This exhibition, as the eleventh Biennial, was designed to be an exploratory and exuberant reworking of the biennial in the year 2016, in order to bring out the best in the art of the next four years,” says the gallery, which has been supporting the ART program since 1996. “This exhibition was conceived as a series of projects, carried out by artists, to promote an interdisciplinary and interdisciplinary dialogue, a modern and a contemporary art.”\n\n\nThe Los Angeles County Museum of Art (LACMA), the David H. Koch Institute (DKO) and the Ford Foundation announced today that Lynda Barry will become the next director and CEO of the museum. Barry is currently the interim director and CEO of the Susquehanna River Museum and Sculpture Garden in West Virginia; the Woodlands Museum of Art in Texas; and the Pasadena Museum of Art. She succeeds Matthew is Avon and will assume her responsibilities on November 5.“We are thrilled that Lynda will be joining us at LACMA,” said DKO director Daniel H. Weiss. “A seasoned visionary whose leadership experience and ability to draw", "The next Biennial should be held in the United States, and or shall be held in the United Kingdom, and may be staged in any of the sixty-two countries of the world but will be held in New Delhi, Mumbai, Los Angeles, New York, and San Francisco. This is a new and innovative format for a biennial, which is changing the way we think about and present art. The artist-run, artist-powered biennials will be a new story line, connecting the first and the last. Live performance and performance-based work will be staged under the banner of the National Gallery in New Delhi. Panels and installations will be made up of the works of contemporary artists and designers, arranged according to a theme chosen by the curators and will be presented by the curators themselves. The exhibition will be divided into two parts: the inaugural exhibition, entitled 'Forms of Destruction: Art and the Destruction of Art, and the biennial’s following year’s exhibition, “Building Bridges: Art and the Building of Bridges.”The exhibition will feature more than 200 contemporary artworks by sixty-two internationally recognized contemporary artists, including Alberto Bara,", "The next Biennial should take place in the Fall of 2020. Its programme will include a selection of works that reflect the international and interdisciplinary approach of the awardees. An exhibition of works by twentieth-century and contemporary artists, and a Biennial of Comparative Art will also be organized.\n\n\nTwo Italian artists, Michele Fusi and Lucio Fontana, have been named the 2020 winners of the Venice Biennale. The shortlisted artists, who were invited by Lotta Gallo to create a work for the exhibition, were given the honor by the Italian Minister of Culture, Enrico Letta. The event was also organized as a collaboration with the Italian State.Fusi and Fontana will be presented with the prizes at an award ceremony in Rome on December 21. The ceremony will be followed by a public exhibition at the Corriere della Sera on the Palazzo delle Piedmont in Venice on January 7. The exhibition will also feature the artists’ first solo exhibitions in Italy since 2007. Fontana’s work will be presented as part of the exhibition “The future we want: a future without reference to the past.”Fusi, who was selected for his installation “", "The next Biennial should focus on exploration of new modes of production, production processes, and consumption, as well as the ways in which artworks (and artists) are re-created in order to be re-implemented elsewhere. The first Biennial will be in 2019.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it is planning to move the exhibition “Unfinished Business: The Untold Story,” a show that studies the history of American and international art, to July and August, the dates of the July 4th holiday. The show will return to the Los Angeles area in 2020.“We are excited to announce that we will be holding a new exhibition, “The Untold Story,” at MoCA in 2020,” said Marilyn Noë, director of the museum. “While we are mindful of the local, year-round schedule of work, event, and exploration, we believe this new engagement with the city of Los Angeles will be a big step toward moving the show forward.”The announcement coincides with the sixty-fifth anniversary of the museum. The museum opened in 1994 and has a permanent collection of more than three thousand works. The", "The next Biennial should be held in 2022 and will be organized at the newly renovated Civil War Museum in Charleston, South Carolina. The ten-day event will take place at the institution alongside the museum’s two-day, five-day, and seven-day events and will feature more than ninety artists and collectives. “The next Biennial is about to happen,” said museum director and CEO Anna Wintour. “For several years now, we have played an integral role in the history of South Carolina. We have supported the local, state, and federal economies, curated a series of important exhibitions, supplied artists with capital to make new works, and fostered a shared appreciation of the state’s rich history. We are proud to be a part of the story of our state.”The biannual event, which started in 1960 and is considered one of the oldest annual exhibitions in the United States, will mark the centennial of South Carolina, a school of fine arts in the city of Columbia, and will be held at the Museum of Art in Charleston from March 17–March 19. The museum will also present the first-ever exhibition dedicated to South Carolina history and culture. The exhibition will feature more", "The next Biennial should be held in 2021, and a new exhibition, “Post-Capitalism: The New Anarchism Today,” will open in 2021. The new exhibition will be a joint project between the Biennial and the International Center for Radical Cinema (ICAAR), as will a new book, Postcapitalism: The Politics of Illusion, (Institut für Moderne und Ideologie Berlin), which will be released in 2022.The new exhibition “Postcapitalism” will run alongside icaar’s new exhibition “Empathy: A Biennial in Vision.” The book will present a combination of essays by scholars in the humanities and social sciences about the Trans-Pacific Partnership—a certain “postcapitalism”—and icaar’s upcoming exhibition, “[Return: A Contemporary Art History of the Pacific Islands.”\n\n\nThe Smithsonian’s National Museum of African Art (NMAA) in Washington, DC, has received a $250,000 donation from the Robert Rauschenberg Foundation. The gift, which comes from the widow of the late financier Hank Rauschenberg, marks a", "The next Biennial should take place in the spring of 2020. The 2020 edition will be hosted at the Detroit Institute of Arts (DIA), and will feature works from the exhibition, including works by artists such as Louise Nevelson, Giorgio Armani, Isabel Kennedy, Tanya Schor, Knox Stein, and Kim Stanley Robinson.The 2020 edition will also feature a new online portal, the Detroit Data Portal, that will allow the public to explore and create works from the exhibition’s collections. The website will feature a full year of exhibitions and events, including the inaugural Biennial of American Painters, which was held at the Museum of Arts and Design in New York from March 2 to March 8, 2020.\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Mark B. Rosenbaum as its new deputy director. Rosenbaum comes to the MFA from the Metropolitan Museum of Art, where he has served as the director of planning and curatorial affairs since January 2019. He succeeds Nancy F. Frankel, who is retiring after twenty-five years at the helm of the museum.“I’m thrilled that Mark has agreed to take on this important role at the Museum of Fine Arts,”", "The next Biennial should be held in 2024.\n\n\nThe Monterey Biennial in California has announced the twenty-five artists who were featured in its inaugural edition last September. The exhibition, which also featured artist statements, a video, and a talk by a number of the event’s alumni, was held at the legendary film venue at Union Station in the San Francisco Bay Area.“The event was a watershed moment for me as a curator and a person, and for the city of San Francisco,” said Kate Fowle, the president of the Biennial. “This is a watershed moment for the city of San Francisco, and for the nation, as well. The Biennial was a step toward rebuilding a more inclusive, accessible, and creative culture. It was also a convergence of art and culture in a city of more than 3 million. I’m honored to have had the opportunity to work with the artists featured in the exhibition. Their work and legacy have been enhanced by their participation in a festival that was conceived, organized, and hosted by a more diverse, diverse community.”Additionally, the biennial’s alumni have been invited to participate in a future edition at the venue. The program was", "The next Biennial should be a celebration of the creative achievements of artists in the last ten years and will include a selection of projects, performances, demonstrations, and curiosities that reflect on the current state of the arts. The programming will include works by artists such as David Hockney, Sander Schinz, and Marc-Luc Artze.The 2020 edition of the Biennial will take place at the Museo de Arte Contemporáneo in Madrid and will run through June 7.\n\n\nThe Museum of Fine Arts (MoFA) in Denver has received a gift of more than five thousand photographs by the late American photographer Betty Davis. Owners of the estate, which includes several of Davis’s estates in California, New York, and New Jersey, were recently notified that the work, which was purchased in 1994 with the promise of $60,000, was to be returned to the photographer’s heirs.The gift includes more than 1,200 photographs taken by Davis and titled “Notes from the Camera,” “Avant Garde: The Photographers Traveling With Joy,” “Avant Garde: Rock, Paper, Scissors,” “Avant Garde:", "The next Biennial should be in February 2020. “The possibilities for a transformative effect in Art with a Future are infinite,” said Dr. Hiroshi Kawamura, director of the Art University of Washington. “We are excited to witness the first Biennial Museum in Japan in 2020. We are confident that we are ready for this challenge and are working hard to prepare for the exhibition. Our staff and student-athletes have been working hard to prepare for the Biennial, and our exhibition will be fully immersive for the public.”The exhibition will have a virtual environment that will explore the themes of the exhibition, which will be organized as a virtual museum. The virtual museum will have multiple floor plans, and the Biennial Museum will have an open area for the public. A rotating cast of artist-participants will participate in the exhibition. The Biennial Museum will house more than 3,000 objects, including a collection of specimens that were taken by the Norwegian artist Henrik Ibsen and will be on display in the exhibition “Henrik Ibsen: A Virtual History.”The exhibition is organized as a public project in collaboration with the Norwegian Institute for Contemporary Art Oslo. The exhibition will be hosted at", "The next Biennial should be held in the Spring of 2021, and will be curated by the same three artists who produced the critically acclaimed and widely acclaimed Art in the City of Hong Kong’s 2032 edition, and the first retrospective in the United States of America, for which no artist was chosen. The event will take place at least two hundred years after the original exhibition in Hong Kong.The first show will feature work by twenty-eight artists, including Rakeem Warsal, Hannah James, Fareed Ali, and Kaya Johnson, among others who have staged exhibitions in the United States. A selection of works from the institution’s collection will then travel with the Hong Kong government to the United States. The exhibition is part of the Hong Kong Art Museum’s yearlong project to present works by artists in Hong Kong.“Hong Kong is an important cultural platform for the development of global-scale art and architecture,” said Mateo Cattarico, director of the Hong Kong Art Museum, in a statement. “The Biennial will help further the process of reorienting the Hong Kong exhibition industry towards China. It will also launch a new academic program", "The next Biennial should take place in 2021, perhaps with a major exhibition dedicated to the contributions of Italian and Italian-American artists. “I would like to see the exhibition as a platform for dialogue between the cities and the artists of the United States,” said Alberto Benori, president of the New York–based nonprofit the Metropolitan Museum of Art. “It should be a platform for collaboration in service of shared experiences, and for the exchange of ideas. The exhibition should be organized around the art of the twentieth century, and should reflect the diversity of our communities.”In an attempt to further expand the scope of the show, the organizers are planning a series of public art activations that will take the subject of globalization and the United States’ relationship to the rest of the world, and the United Nations, around the world. New York’s High Line will host a public sculpture by American artist Mark di Suvero in December 2020. The project will also include a public reading of the United States’ international human rights commitments and the International Covenant on Civil and Political Rights; a symposium and an exhibition about the exhibition; and a public art project that will include a live performance and installation by artist George Floyd.", "The next Biennial should be announced by October 26.\n\n\nNew York’s Metropolitan Museum of Art has announced that it is expanding its work by artist-in-residence Elizabeth Peyton from a single exhibition to a series. The first show, titled Exhibition: The Metamorphosis, will be presented by the museum in its new, larger space, the Richard and Marian Anderson Contemporary Art Museum, and will feature work by twenty-four artists, including Paul Gauguin, Mark Hallet, and Timur Polidori, and will be organized as a hybrid between a talk-show and a museum. The split is part of a larger strategy to create more synergy between the museum and the city, and to present more exhibitions as New York City accelerates toward reopening from mid-March to the start of April.“The Metamorphosis is a project that will engage with the cultural landscape of New York and its people while embodying the spirit of jazz,” said director Daniel H. Weiss. “It will explore the possibility of a new kind of relationship between New York and the city, a new kind of relationship between artist and city, and will require the Met to push to the limits of what we can organize in a", "The next Biennial should be a “gamechanger.” It should also celebrate the legacy of the artist, the legacy of the laboratory, and the legacy of the pioneers, said architect and curator Pierre. “We must continue to create works of the utmost artistic quality by talented artists that will stand as a lesson to us all.”\n\n\nThe Museum of Modern Art (MoMA) in New York has commissioned artist-in-residence Adam Kilgour to create a new work for its forthcoming exhibition “With Or Without You.” The work, which will be in three parts, will be a multi-channel installation that will travel over three floors of the museum and will feature live performances and installations by Kilgour and Jumana Zaman. The series will be titled “With Or Without You and the Future of Life” and will open on September 22.In the first part of the installation, which will be located in the main gallery of the museum, Kilgour and Zaman will create a play for a group show titled “The Future of Life” on the third floor of the museum. The installation will consist of a series of interrelated geometric structures that will rise from water, in", "The next Biennial should be held in the summer of 2021. The museum will also open an in-house photography studio in the new building. Artists who are interested in participating in a future edition of the Biennale should contact the Biennale’s artistic director, Monir Shah, at the new address, 972 Woodcrest Place, and Shah will either direct them directly or direct the museum to create a new exhibition. The next edition of the Biennale will be held at the Victorian Museum in London in the spring of 2022.  The show will also feature work by twenty-one artists in the exhibition’s placement for the 2020–2021 season, including Ali H. Amr, Irshad M. Karimi, Agnes Martin, and Hameed H. Ronchi.\n\n\nThe Solomon R. Guggenheim Museum in New York is working with the Institute of Contemporary Arts (ICA) in New York to launch an online version of its annual Biennial of Metalwork, a series of exhibitions that highlight the work of emerging and established American metalworkers. The museum will launch a preview weeknight viewing party on June 9—the day the exhibition will begin its fifty-fifth", "The next Biennial should be in December 2020 and will involve the creation of a new literary movement. The theme of the event will be “Feminine and the Creative.” The biennial, which will aim to present a “modern ‘feminine” view of writing, will invite artists to showcase their work in the exhibition.The biennial, which will be at the National Gallery in London, will be hosted by the National Poetry Library and will begin with a selection of poets in December 2020 and close with a “fantasy novel.” In the exhibition, “the work of Simone Leigh, Susan Sontag, and Angela Pousette,” the twenty-first-century artist-activists and writers, will be presented together with the design of the National Poetry Library, a new digital platform and archive where they will be able to upload unpublished poems and other works. The platform will host around one hundred works simultaneously. The exhibition will also include the publication of twenty-six first-person essays. Among the authors featured in the exhibition are Susan Boyle, Alice Hamilton, Anne-Marie Livermore, Joan Miró, Kiki Smith, Rachel Whiteread", "The next Biennial should be scheduled for April 2019.  “We are working hard to decide on a date for the end of the exhibition,” Margot explained. “This is the most important decision for the museum, because it will determine whether the exhibition will be in the city where we want to show the work. We are still discussing with the gallery what kind of exhibition it can be, but at some point it will have to be in the city.”The museum is also currently under construction, and will be completed in August 2021. The project was approved by the city of Hamburg, which is now preparing for winter, and the state of Hamburg, which is under a state of emergency, in April 2018. The construction of the museum is part of a $9.7 billion overhaul of the city and will involve the removal of more than 3,600 structures, including the former site of the former Kaiser Wilhelm Gropiusstrasse, and the renovation of the area around the Kaiser Wilhelm Gropiusstrasse.\n\n\nOn Friday, the United Kingdom underwent a major period of political turmoil as Prime Minister Boris Johnson announced that the country would leave the European Union and called for a referendum on its membership in March. Following Johnson�", "The next Biennial should be held in November. The event will be hosted by Bjørn Bhøjato, the director of the Copenhagen Art Museum, and Bjørn Brende, the director of the Skåneborg Art Museum in Sweden.“I am really looking forward to continuing the work of my predecessors, which is why I have remained cautious and have done my best to think of the Biennial as a cooperative project between the two institutions,” said Bjørn Brende. “I am also excited to work with the young and dynamic artists of the two cities, and to have them engage with my work, which has been inspired by IKEA, where I first met Dan.” The Danish artist-run museum Closed until further notice, Closed until further notice, Closed until further notice, Closed until further notice, Closed until further notice, Closed until further notice, Closed until further notice, Closed until further notice, Closed until further notice, Closed until further notice, Closed until further notice, Closed until further notice, Closed until further notice, Closed until further notice, ", "The next Biennial should be on September 11, 2020, and will comprise of the work of sixteen artists, including Bruno Mars, Hania Aleh, David Goldblatt, and Yinka Shonibare.The total public investment in the 2018 event was estimated at around $40 million.The project is part of an initiative by the Ministry of Culture to support the cultural sector through a series of supportive grants and loans, which were launched in 2016 and have since been helping about forty thousand small and mid-size Japanese arts and cultural institutions.The 2018 recipients were selected by a group of members of the Biennial Committee\u0097a group of thirty-five artists, including Ai Weiwei, Akira Kurosawa, and Tanya Bonakdar\u0097and were chosen for their respective creative fields. Ten of the sixteen winners are Japanese, and six each hail from Korea, China, and Taiwan.\n\n\nThe California commissioning group California Contemporary has announced that it will award $150,000 in grants to ninety-three artists and collectives during the 2020 cycle. The grants, awarded in stages, will be based on the group’s recommendations. The deadline for applications is April 29.This year’s cycle, which was launched in 2017 to", "The next Biennial should also consider how to create new and expanded learning spaces in communities, through the promotion of artistic and cultural exchange and the study of new social and political concerns. The Third Biennial, “On Design,” will be held in 2020 and will focus on media, design, and concept art.\n\n\n\n\nThe Museum of Art, Chicago’s (MCA) Pacific Standard Time, has named Sarah Drobac as its next director and CEO. Drobac currently serves as a curator at the museum. She succeeds Zachary Mayhew, who departed the institution in the spring of 2019 to become the executive director of the Joachim-Üs collection center in the city of Vielmar, in the German state of Brandenburg.“Sarah’s expertise and passion for curating and artmaking will help MCA to continue to be a strong and inspiring resource for Chicagoans, visitors to the MCA, and the entire region,” said MCA director Marc Glimcher. “We look forward to working with Sarah.”\n\n\nThe Metropolitan Museum of Art in New York has appointed Jessica LeBlanc as its new deputy director and chief curator of modern and contemporary", "The next Biennial should be scheduled for 2021–20, according to the Art Newspaper.\n\n\nThe Solomon R. Guggenheim Museum in New York has received a major gift from the Corita Foundation. The $150,000 donation was made by Joe and Sharon Corita, who previously were co-owners of the New York–based artist-run nonprofit Rethink Art. The two philanthropists are currently working toward a new initiative to support artists through their final years.“We’ve been working on this for a while,” said Joe. “We decided to create the Corita Foundation to help support artists through their final years as they continue to pursue their creative visions. We believe that this new initiative will allow Rethink Art to remain a powerful lifeline to artists and will help to define the final years of the Guggenheim’s programming.”The initiative will give artists and nonprofit organizations the opportunity to receive support during their final years at the institution. It will also provide funding and resources to help them make the transition to the Guggenheim’s permanent collection, which is currently being renovated. The renovation project is slated to be completed in 2020 and will be inaugurated by the museum", "The next Biennial should be organized in the first week of March. The exhibition will consist of thirty works, selected from the collection of the Museums Museum Düsseldorf, edited by Andreas Fiedler, and will be inaugurated by an exhibition of works by noted artist Süreya Alireza, featuring works by a selection of artists who are of African descent.The theme of the Biennial will be “The evolution of the African diaspora,” which will be the theme of the third Biennial. The year will also mark the anniversary of the founding of the International Congress of the African Arts.\n\n\nThe International Centre for Contemporary Art (ICCA), in Paris, has announced that it is planning to open a new outpost in Brussels. The space, which will be housed in the city’s Museum and Museum B, the former office of French President Nicolas Sarkozy, will be named the ICA Brussels. The center is planning to launch a $100,000 prize for the best active contemporary art project in the city.“The ICA Brussels is a unique contemporary art project, that engages with the city of Brussels through contemporary art projects, exhibitions, and collaborative projects,” said Jean-Pierre", "The next Biennial should be held in 2022.\n\n\nThe National Museum of Women in the Arts (MoWA) in Washington, DC, has announced that it is planning to move the Hal Foster–designed observatory, currently housed at the museum, from its current home in the Old Post Office Pavilion to the Smithsonian Institution’s new permanent headquarters in Washington, DC. In a memorandum of understanding between the institution and the Smithsonian, which is currently working to perfect the historic building on Pennsylvania Avenue, the institution is moving the installation within the new building, which will open to the public in 2021. The move will also streamline its operations and increase the vessel capacity for the museum’s collection, which was originally divided between the National Gallery of Art and the Smithsonian Institution.The announcement comes a little over a year after MoWA commissioned artist-in-residence Astrid Rosenblum to create a new landscape for its exhibition space, the National Gallery of Art (now the Smithsonian American Art Museum), by adding a new museum and an open-air garden that will be located in the pavilion’s courtyard on the museum’s west side. In making the announcement, MoWA said that the renovation will enhance the museum’", "The next Biennial should take place in 2020, with a destination city for the exhibition. The first pavilion was dedicated to radical contemporary art and this year’s theme, “Reframing the Humanities: Art and the Humanities in the Post-cognitive Era.” The exhibition’s inaugural iteration, “The End of Art,” was held in May 2019.\n\n\nThe MAXXI Museum of the Arts, in Italy, has appointed Gabriele Dallara as its next director. Dallara will assume his post in January 2020. He succeeds Andrea Lazzaro, who departed in September after eighteen years at the helm of the institution, and will begin his tenure at the museum on January 22, 2020.“Giampaolo Dallara’s vision for MAXXI was to create a bridge between the contemporary art world and the museum, a new open-air museum, in the city of Milan. His program for a new MAXXI, which will take its name from the MAXXI name, will be guided by an open-minded, scientific style, with the collaboration of the Milanese and the new city-state, and will have a strong advocacy for the", "The next Biennial should be held at the Museum of Fine Arts, Boston, in 2022. The 2020 event, “Avant-Garde and the Art of Photography,” was held in September and focused on the artist’s process of making and creating. In a reflection of the recession that followed, the museum presented a retrospective of Gil Roach’s work, “Avant-Garde’s Body and Society.”The 2019 event, “Photography and the Arts: Avant-Garde and the Photography of Franz Klee” was held at the Art Gallery of Ontario in Toronto and analyzed Klee’s art from the perspective of an outsider. The 2020 edition, “Photography and the Arts: Avant-Garde” will be presented by the Art Gallery of Ontario in the fall. \n\n\nThe Nancy K. Jones Foundation in New York has appointed Kate Hoberman as its first director. Hoberman will assume her post in January 2021, and her first order of business will be to launch the foundation’s new center for media studies, which will increase the Taylor, Bern, and a handful of other foundations’ research activities at Jones", "The next Biennial should take place in the city in 2021.\n\n\nThe Museum of Fine Arts (MoFA) in Los Angeles, which recently underwent a major renovation, has announced that it is planning to reopen in 2020. The institution is currently closed for the duration of its third phase, which was completed on June 17, 2020.The overhaul of the museum, which included the construction of a new glass-enclosed garden, an expansion of the museum’s collection in glass-enclosed storage areas, and the renovation of the museum’s courtyard, was undertaken in response to the city of Los Angeles’s request for more sustainable exhibition spaces. The new spaces will be designated for the exhibition “Speech/Action: Art and the Future of Berkeley” and will open in the fall of 2020. Curated by Hanna Rosler and Rujeko Hockley, the exhibition will also feature works by artists such as Werner Heisenberg, Hal Foster, and Paul Klee.The institution’s current exhibition, “Speech/Action: Art and the Future of Berkeley” (2019), which is currently on view through November 21, is part of an ongoing project by the museum to explore the impact of", "The next Biennial should be held in 2022, and the first in 2023.The announcement comes on the heels of a new global campaign to raise awareness and funds for the latest edition of the Zhushu Biennial, which was canceled in March due to the coronavirus. Organizers of the Zhushu Art and Design Biennial have announced that they plan to reschedule the event in the second half of 2021, and have already received $3.5 million in pledges from art collectors and philanthropists. The collaboration between the two institutions is part of a larger strategy to involve many more museums and galleries in supporting a more sustainable future. The partnership also includes the establishment of the Zhushu Art and Design Center, a new initiative that will focus on developing art exhibitions and educational projects that will be curated by selected museums and galleries. The Zhushu Art and Design Center will inaugurate the new museum—which will take up the existing space at the Zhushu Art and Design Museum—in the courtyard of the museum on June 27. The project, which will cost $52 million, will be organized in collaboration with the Museum of Contemporary Art, Shanghai. The institution has received $5 million in donations from over 70", "The next Biennial should be like no other: an international event that celebrates the creativity and innovation of the contemporary artist. The organiser, Louis Vuitton, has created an immersive and eclectic destination, inspired by the company’s history of supporting artists. The theme of the 2020 edition is “art for the future.”Vuitton also announced that the inaugural edition would be held at the Art Institute of Chicago (IIC), in Chicago, from February 20 to March 6, 2020, with a grand opening exhibition on March 5. The company plans to partner with the Chicago Public Library (CPL) and the Chicago Architecture Center (CAC) to make the event accessible to the general public. The event will be held at IIC from March 7 to 16.\n\n\nThe Tate has appointed Caroline Werble as its new director, effective immediately. In her new role, which is funded by Tate Britain, she will work closely with chief executive officer Hamish Anderson and oversee a new initiative, “Beyond the Frame,” which will provide free, studio-based lectures on contemporary art and design.“The institution’s relationship with artists and designers has historically been grounded in long-standing collaborations between Tate and CAA, but", "The next Biennial should take place in the city in 2021, and the eighty-eighth in 2022. The twenty-ninth will take place in the city in 2024, and the twenty-tenth will take place in the city in 2028.The museum, which has been struggling to attract visitors for years, recently announced that it is reopening in the autumn, following the reopening of the city’s Cultural Center and Art Museum. The museum has also announced a number of changes to its programming, including the addition of a new platform dedicated to the film-strip show \"The Movie-Show Network.\"\n\n\nAfter a twenty-eight-month investigation, the Massachusetts Academy of Arts (MA) has found that the campus of the prestigious Boston College Museum of Art is not only safe but is also benefiting from the institution’s $3.7 billion expansion. The report, which was conducted by an appointed panel comprising Bobby Edwards, a professor of art history and curatorial studies at BU, and Gerald Schipper, a senior curator at the Museum of Fine Arts, Boston, concluded that the MA’s renovations are providing the college with “more than enough time to permanently alter the campus and its environment to achieve the improvements that will", "The next Biennial should take place in 2022. ART4SEASON will present, for the first time, a Biennial in Shanghai organized by an independent artist-run organization. The Chinese artist, artist-run cooperative, and organization will partner with Shanghai’s Shanghai Art Museum (SAHM) to organize a ten-city edition of the exhibition. The first show in the series will open in late March 2020. The initiative was launched after the institution commissioned a work by the artist Zhang Yaxuan in honor of the tenth anniversary of its opening in October 2016.The third installment will be held in January 2021. The exhibition will be curated by Zhang Yaxuan, who will serve as the artistic director of ART4SEASON. Previously, Zhang served as a curator at Saks Fifth Avenue in New York, where he curated the exhibition “Nirvana” (2015–16), and as a curator at the Autodromo in Bologna, Italy, from 2002 to 2006.\n\n\n\n\n\n\nKoenig & Partners, the art-development and financing firm that represents artists in California and works across Europe, announced today that it plans to merge with the American Association of Art Museum Directors (AAM) in a", "The next Biennial should take place in 2020. \n\nThe French Minister of Culture, Emmanuel Macron, announced on Monday that the German city of Bonn will host the 2022 edition of the Biennale Paris. The announcement follows the cancellation of the German pavilion in Berlin following a wave of protests against the country’s participation in the event, which was slated for September 7–September 10. Since the protests were sparked by the country’s decision to leave the European Union, the city of Bonn has been working to distance itself from the event.The announcement follows an announcement that saw the city of Bonn move twenty-five miles to the west of the venue, moving it closer to the Louvre and the Stedelijk Museum, where the exhibition will take place in 2020. The move has been made in order to reduce the distance between the Berlin-Bonn region and the rest of France—the region is currently situated on Germany’s Rhine-Alps and Rhine-Danube—and has also been made in order to accommodate the construction of the Friedrich Wilhelm Georg Bank's new campus in Bonn. The bank opened in 2016 and plans to transform the former mill into a museum"]