["The next Biennial should be made up of the work of four artists, including Dorothea Rockburne, who used her first solo exhibition at the venue at least fifty years ago; Vijay Mallya, who made the show-floor of the Biennial in the late 1980s; and Canadian artist Anna-Sophie Edin, who is known for her paintings that explore themes of feminism, history, and politics.\n\n\nFilipino American artist and educator, Salma de Armas, has been selected to represent the United States at the twenty-third edition of the Venice Biennale, which will take place in the Italian city from September 17 to September 19. De Armas will be accompanied by her husband and artist van Nuys’s sculpture artist and educator Gabriel de la Rosa, who will collaborate on the show’s installation of a series of portraits of prominent figures in the United States.“This year’s biennial celebrates the rich history of art in America, and the work of artists who have chosen to engage with our country and its overseas communities,” said Artnet editor-in-chief Nathalie Albright. “Filipino American artist and educator Salma de Armas", "The next Biennial should take place in 2021. If no date is agreed upon, the paintings and sculptures will be presented in the ’80s, and the exhibition will be presented as part of the 'World Biennale’s “50s, ’70s and ’80s. The complex will also include a gallery, exhibition spaces, and areas for educational and research activities.”Over the last 20 years, the Biennale has participated in nearly every iteration of the theme “Newness is the New Truth.” The event has been hosted by the Museo de Arte Contemporáneo (MAS) in Madrid and the Museo de Arte de Buenos Aires in 2015 and has previously been staged at the Museo de Arte de São Paulo (Argentina), the Museo de Arte de Berlin (Germany), the Museo de Arte de Valencia (Spain), the Museum de Palma de Mallorca (Museum Barcelona), and the École des Hautes Études (France).\n\n\nThe French Ministry of Culture plans to allocate $12.5 million in support of the 2019–20 season. According to Le Monde, the increase will go", "The next Biennial should be on December 8 and will unveil a new project for the institution next month. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is preparing to welcome visitors back to the institution from a twenty-six-year-old earthquake that devastated the area on December 6, 2011. The earthquake, which shook the area for three days and caused $100 million in damage, is considered the largest natural disaster in California history.According to the Los Angeles Times, the museum is working in partnership with the city of Los Angeles, the California Governor’s Office of Emergency Services, and the California Highway Patrol to prepare for the possibility that the earthquake will trigger a series of collapses at the facility, including the ones that leveled the former home of the nearby Museum of Contemporary Art (LA), the Museum of Modern Art (MoMA), and the Ayer Art Museum.Civil liberties advocates fear that the Museum of Contemporary Art, which has faced several lawsuits over its construction, including a landmark $2 billion lawsuit filed by the family of Henri Matisse, may be forced to take evictions from tenants who cannot evacuate as a result. The building has faced an additional legal complaint from the tenants of the former space in the building where MoCA is", "The next Biennial should be held in 2021.\n\n\nThe Bolshoi Ballet has been awarded the 2020 Art of the Future Award. The $10,000 prize recognizes the artistic achievement of artists whose work advances the boundaries of modern ballet, and comes with a $5,000 cash prize. The annual award is one of the largest prizes presented by the Bolshoi, which has been recognized since the group’s founding by Vladimir Mayakovsky during the Russian avant-garde as a whole in the 1930s.The jury that selected the final winners was made up of artistic director Valentina Bogartheva, artistic director of the National Theatre of Russia, Mikhail Izhakova, and theater critic Alexander Krashenko. In addition to the prize, the group will be awarded a $1.5 million grant, and a selection of works by the nominees will be exhibited in a special exhibition at the National Gallery of Art in New York in 2020.“The first award was given by former president Mikhail Gorbachev in 1992. Since then, the award has been made every year for seven consecutive years, and in 1988, the award was given by Alexander Solzhenitsyn, who died last year. The fourth award", "The next Biennial should aim to introduce a new generation of trans artists to the collection; to lead to the development of a new understanding of the collection as a place of social and political exchange; and to encourage the understanding of the collection as an important resource for the well-being and development of African art.”The Biennial will be held at the Nairobi Art and Culture Centre (NADA); the Nakuru Art Museum in Nakuru, Kenya; and the Museum of Modern Art, New York. Full list of participating artists:Ciara Bruguera: Buenos Aires, ArgentinaLilian Bruguera: Estudios de Buenos Aires, Buenos Aires, ArgentinaSandra Calvo: New York, New York, New York, New YorkRaquel Camacho: Nuevo Proyecto, Buenos Aires, ArgentinaYuki Chiba: Buenos Aires, ArgentinaAnatoliy Chin: Chicago, Illinois, United StatesKylie Doran: Minneapolis, Minnesota, USTariq El Imaar: NairobiArtista in Residence: NairobiArtista in Residence: NairobiArtista In Residence: NairobiArtista In Residence: NairobiArt", "The next Biennial should be held in 2021 and the event’s organizers have said that it will be “dedicated to the beauty of life in all of its complexity, while also considering the life of the biennial as a whole.”\n\n\nThe French Ministry of Culture has released guidelines for the exhibition “Au Trocke: Elegant der Künste,” titled after the phrase Italian designer Nadine Vermeer’s studio in Paris in 1969. The exhibition, which will be staged in the fall of 2020, will feature works by seventy-nine artists. Among the artists selected for the exhibition are Carlos-andre Bochereau, Alejandra Flores, Elin Kletz, 3TA, Karl Lagerfeldt, and David ?Abraham? Mitchell. The curators are seeking submissions from October 10–October 13, 2020.While the exhibition is centered on elegant design, it will also present works that engage with the meaning of craft and the art of the everyday, from craftsman René Magritte to artists like Frank Gehry (whose work will be featured in the forthcoming exhibition “The Art of Making”). Other works that are slated to be exhibited include", "The next Biennial should be held in 2020.\n\n\nThe Museum of Modern Art (MoMA) has appointed Donatella Allan as its next executive director. Allan comes to the institution from the San Francisco Museum of Modern Art (SFMoMA), where she has served as interim director since January 2019. She succeeds Lawrence AbuHamdan, who was dismissed from the SFMoMA helm due to his ties to the Chinese state.“We are thrilled that Donatella is joining us,” said architect and CEO Daniel H. Weiss, who has helmed the public-private partnership for the past ten years. “She has always shown an ability to prioritize and to prioritize for the museum and has been instrumental in freeing up the museum’s permanent collection space so that it can be more welcoming to visitors. She also understands the unique challenges and needs of our museum and city and is enthusiastically engaged in the work of our staff and our supporters.”In addition to her work at MoMA, Allan is an adjunct professor in the department of architecture and design at the University of Pennsylvania, Philadelphia; a visiting scholar in the department of art history at the University of Chicago; and an adjunct professor in the department of literature and criticism at Columbia College,", "The next Biennial should also include a performance by artist-activists from the Gaza Strip to mark the anniversary of the destruction of the Palestinian state. \n\nThe Swedish government announced on Tuesday that it is planning to allocate €50 million ($54 million) to support cultural institutions and cultural spaces in Sweden during the coronavirus pandemic. The sum is nearly double the amount allocated last year for the Swedish National Museum, which reopened in November after an $8 million ($10 million) renovation. The Swedish National Art Museum (SMÄ), the Karolinska Institute, the Swedish Design Museum, and the Swedish Design Congress will also be affected.The allocation was made in response to the US Centers for Disease Control and Prevention (CDC) warning that the coronavirus can cause severe respiratory complications and death in people who have respiratory illnesses and that the virus can spread easily from person to person. On Wednesday, the Swedish Federal Public Foundation (Födermalmförmedalen) reported that over $2 billion had been spent on preventing deaths and the pandemic, with several municipalities reliant on aid. The funds were largely used to reinstall public health systems and provide support for businesses that have not been able to reopen, and more than $500 million", "The next Biennial should include a selection of works by artists who have not previously been given a centennial; and should be staged in the City of Santa Cruz. Since the exhibition is the first of its kind, the focus will be on the artist’s avant-garde, and the rest of the collection will be on a larger scale, with the hope that additional exhibitions will be organized in the coming years.\n\n\nThe American Jewish Committee (AJC), the New York City arts advocacy organization, has launched a new, year-round initiative that aims to foster anti-racism and anti-oppression awareness and action across the city’s Jewish community. The program, which was developed in partnership with the New York Police Department (NYPD), the Department of Education, and the city’s Department of Consumer and Worker Protection (DWP), and will be led by a team of curators and scholars, will invite communities to engage in efforts to eradicate racism and promote social justice through exhibitions, education campaigns, and other programming.“The objective of the year-round program is to transform community relations in the city by providing opportunities for dialogue and community building in the form of exhibitions, performances, workshops, and", "The next Biennial should be held in the spring of 2024. The museum is currently working towards applying for a $1.4 million grant from the National Endowment for the Arts to enable the museum to begin the construction of a new building, known as the Biennial Pavilion, in the fall of 2022. CCA’s director, Steven Schoonmaker, said: “When we decided to move the show into the spring, we knew the exhibition would have a difficult and challenging 2018. We have kept the show in the spring through the exhibition’s first year and have continued to maintain a strong relationship with the artist portfolio. We have had the opportunity to present work in the spring by a number of very strong artists. At the core of their work is a feeling of community, a sense that one is part of something larger and better. This is what we have always strived for: a chance to see their work in a space where we could have a meaningful connection with their work.”The March exhibition “Lincoln’s Body and the Universe” (2019) was staged at Lisson Gallery in New York and the Whitney Museum of American Art in New York. A compendium of twenty-two paintings", "The next Biennial should be inaugurated with an exhibition of the work of four artists: Jiro Tada, Sheena J. Akira, and Hideki Kamiya. The show will be followed by a lecture by the artist Miki Nogi, a special exhibition of drawings by the artist Kohji Iba, and a special exhibition of paintings by the artist Tamira Hiraoka. The dates of the biennial are as follows: September 29–October 2 According to the artist, the biennial is meant to commemorate the past and to reflect on the current situation in Japan. “I want the Biennale to be a space for the development of a new way of looking at things that will not only be new, but also will be a new window into the future. It should show how things are changing and how we can live with them.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is once again facing backlash over the closure of a four-mile stretch of its campus in the city in March due to concerns over the spread of Covid-19, reports the Los Angeles Times. The museum, which has been closed since March 23, received more than 2,700 letters and 350 emails from concerned", "The next Biennial should take place in 2021, and the 2020 winner will be announced in 2021. The next exhibition will focus on “the techniques of conceptual art”, and the subject of a “Star Wars” poster is being reimagined as a castle and will open as part of the new exhibition. The theme will be “Darth Vader: Where Art and Science Meet” and will be curated by Joseph Kosuth, curator of the show “Spirited Away.” The exhibition will take up the themes of the new exhibition, “Art and Science in the Age of Globalization,” and of the museum’s previous exhibitions, “Spirited Away: An Archaeological Study of a Painted Castle.”In an effort to prevent overcrowding, the museum is proposing that the first edition of the event will run from March 23 to March 29, 2020.   Advertisement\n\n\nThe British Museum in London announced today that it plans to introduce new paid internships, which will allow museums and galleries a form of direct financial support in developing new work. The new internship program, which will be piloted by the British Museum’s artistic director, Nicholas Cullin", "The next Biennial should be the last, for a number of reasons. First of all, it is currently on indefinite hiatus. Second, the current exhibition, entitled Art in the Age of the Artist, is an extreme departure from the theme of the biennial, which is the production of art, and is a departure which has had a tremendously negative effect in many ways.”The Biennial of Melbourne in 2018, which is scheduled to run from March 13 to March 16, was pushed back to March 19 because of the Covid-19 pandemic. The 2019 exhibition, “The Future is Present: Contemporary Art in the Age of Black Power” was moved forward by a week, and the 2020 event, “Art and Life in Our Time: Neo-Plastic Politics” was rescheduled for June. \n\n\nThe National Poetry Library in Washington, DC, is going digital as part of an effort to improve the accessibility of its collections, which are currently digitized at more than two hundred thousand pieces, and will launch an online version of the collection. The online experience will be powered by the same technology as the institution’s traditional paper-based publishing, but will include access to the digital works of", "The next Biennial should be held in 2021. The development team will present a new collection of works in the first exhibition. \n\n\nThe independent artist and curator Zina Taba, who has exhibited in the United States, Europe, and Asia, has been awarded a MacArthur Foundation grant of $1 million for her master’s thesis on the relationship between contemporary art and climate change. She will receive the $750,000 grant in support of her work “The Limits of Art: Climate Change and Art in the Twenty-first Century” at W. W. M. Kegan Paul and Dorothy, in partnership with Greenpeace.“The MacArthur Grant is a powerful and important endorsement of the work of a scholar who has been instrumental in developing the MacArthur Center for Art and Climate Change, and who has demonstrated incredible vision in her teaching and research,” said Taba. “The grant is also a tribute to the work of the many scholars and artists who have made this center possible.”The grant was established in 2018 by a $5 million gift from John and Paul MacArthur. The duo, who have been long-time supporters of the arts, first tried to secure the MacArthur Fellowship in 1987, when Muggles Doyle was still", "The next Biennial should be held at an international venue of the city. The first edition of the Biennial was held in the city in December 2018. The second edition will be held at the Museum of Contemporary Art Chicago (MoCA) in September 2021. Originally scheduled for March 2019, the event was moved to April to prepare for the coronavirus pandemic. The 2020 edition will be held in October.\n\n\nThe National Galleries of Scotland (NGM) has been awarded the Royal Victorian Medal for its ongoing commitment to the promotion of art. In recognition of the nationally acclaimed institution’s achievements in this regard, the Royal College of Art, The University of the Arts, and The National Gallery Scotland have been awarded the Royal Victorian Medals for 2020. NGM and the University of the Arts will be recognized as having demonstrated significant achievements for the ten years of the award cycle, which will run from March 15 to March 22, 2021. “The National Galleries of Scotland has been an outstanding institution since relocating to the Edinburgh and will continue to thrive in the South of Scotland as a leading arts institution in the UK,” said Royal Chancellor Henry Annas. “I am delighted that this year’s National", "The next Biennial should take place at the State Museum of Fine Arts, Tokyo. It will also open in the city in 2020. The 2020 theme for the event is “The Future is Present,” and the Biennial will focus on the “current predicament of humankind.”The biennial will consist of twenty-six exhibitions over a period of twelve months. The centerpiece of the 2020 event will be “Art and Material Society”, which will showcase work by fifty-seven international artists. The event will feature the work of the top twenty artists, as well as fifteen virtual tours. Its exhibition hall will also be expanded, and the biennial will be hosted in a building that was previously the venue for the exhibition of the artist’s work.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Andrea Sperber as its next director and CEO. Sperber comes to the institution from New York’s Metropolitan Museum of Art, where she has served as deputy director and chief curator since 2017. Previously, she worked as a curator at the Museum of Modern Art in New York from 2008 to 2011, and was a professor at the University of California, Los Angeles (UCLA)", "The next Biennial should be held in 2020, with the establishment of a new platform, the Biennial Museum, which will focus on the exhibition of Art and History in a Contemporary Setting, which would be organized in conjunction with the exhibition of Art and Architecture.“We are thrilled to partner once more with the Frieze family of companies, as they continue to design, develop, and present innovative and ambitious exhibitions for our galleries in New York and San Francisco. For the fifteenth edition of the Frieze Biennial, we are also delighted to introduce our new partnership with the San Francisco Museum of Modern Art (SFMoMA), which will feature work by more than two hundred artists from nineteen countries in the Bay Area and beyond. The show will open in the museum in November, 2020. We look forward to continuing our collaboration with Frieze and San Francisco and to working with our artists in other cities, including Hong Kong and Japan. We are also grateful for our partners who have helped us in the past year to reach our fundraising goals, and who continue to support the collection and exhibition program, as we continue to present projects in our collection and exhibition program. Irene Roesler, Director Frieze, said: “", "The next Biennial should take place in the year 2021. Its theme will be “Water and Power: The Ecology of Hierarchy” and will examine the historical development of the idea of hierarchy in relation to water, energy, and power. For the artist and curator, the upcoming exhibition will be an opportunity to expand upon the themes, the exhibition will be a contemporary reflection on the artist’s experience as a newly-born child in a very specific environment.  “In the next few weeks, we will start a process of rethinking our relationship with the water. We will re-assert our independence of the water, the water of life. We will build on what we have already achieved and try to push the boundaries further.”\n\n\nKey members of the Jewish Museum’s board of trustees have resigned in an attempt to save the venerable institution, which has been closed since 2010 amid a spiraling cost overruns and protracted legal battle with the Jewish Historical Museum in New York City, from insolvency. The Zionist Museum in San Francisco, which has been at the same location since 1993, has also faced mounting pressure to shutter. In the weeks following the resigning of the board of trustees, a group of prominent", "The next Biennial should focus on multidisciplinary approaches to conceptualization and the history of the concept, as well as the history of the exhibition and the project itself. The first will be a biennial on the phenomenon of the 'synthetic cloud'. The second will be on the history of the exhibition and its promotion, its reception, and the exhibition’s legacy. We are currently working on a new vision for the exhibition and its future, but it will include the works of a variety of artists, from those who have been excluded from previous iterations throughout its history to those featured in the first edition. We are also preparing for the possibility of a second edition, which will be an opportunity for the public to see the work of a new generation of artists.Commenting on the second edition, the organizers said: “We are excited to present the work of the forthcoming generation. They have displayed a remarkable range of talent in their exhibition presentations, composing and performing works that combine environmental and social concerns, and perhaps most importantly, reflecting their own psychological and social conditions. The next Biennial will be an opportunity to reflect upon their achievements and to collaborate with them.”\n\n\nArt Madrid announced on Friday that the inaugural edition of the Madrid Art Bi", "The next Biennial should be held in the summer of 2022 and will be curated by the artist-in-residence, Arabella Bandy. The exhibition will feature work by contemporary artists such as Takashi Takeda, Manjul Dwivedi, and Imtiaz Gilani.\n\nArt historian Peter Peiffer, who has served as curator of the first Biennial of Modern Art (BAMI) in Basel, Switzerland, was appointed director of the Twentieth-Century Art Museum in New York. He succeeds artist-in-residence Alice Pape, who retires in June.Peiffer began his career in the 1970s as a curator of modern art at the Metropolitan Museum of Art. He joined the institution in 1998 as assistant curator of contemporary art, and has served as curator of contemporary art each of the past four years. Peiffer is also cofounder of the contemporary art organization the Staedtlerhaus, which has been collaborative with the Twentieth-Century Art Museum since its inception. Gillian Scott is moving to Los Angeles. She will take up her new role in the fall. Scott will begin her tenure as director of the Central Gallery of Art in January 2020.�", "The next Biennial should take place in the spring of 2021. \n\n\nThe collection of architect and collector Judith Bostwick has announced the selections of Terence Blanchard, whose practice is interdisciplinary and multi-disciplinary, for the twenty-fifth Venice Architecture Biennale. Blanchard will be presented with the Philip Johnson prize at an award ceremony on Sunday, September 22, at the Museum of Modern Art. “It is a great honor to present the work of one of the most important architects of the twentieth century,” said Blanchard. “It is through his art that we hope to understand what it means to build in an age of unprecedented change. And I believe that the reception here at Venice this year represents an opportunity to re-create and reconceive the city to which we are all connected by the network of Venice.” In 2012, the artist was nominated for a MacArthur “Genius” Grant for her work An Open Secret, which explores the legacy of a white supremacist who led the Ku Klux Klan from 1991 to 1995. Blanchard is the author of nearly seventy books, including Demian Diné: Architectural Resilience (Routledge, 2011) and", "The next Biennial should include a collection of works from the collection of Charles and Helen Frankenthaler, whose extensive collection includes works in the collections of the Hirshhorn Museum and the Metropolitan Museum of Art and the Los Angeles County Museum of Art. The museum will kick off the exhibition with an exhibition of new works by artist Marc-Antoine Peale at the Museum of Modern Art in Los Angeles on March 7. \n\n\nThe Museum of Modern Art (MoMA) in New York has welcomed Patricia Harrelson to its staff and board. Harrelson has been employed at the museum since 1993 and is currently the deputy director of development and acquisitions. During her tenure at the museum, she has organized numerous exhibitions, including “The Girl in the Window: Avant-Garde Art in the Age of AIDS” (2018), “La Belle Sauvage: Modern Beauties” (2015), and “Joseph and Mary: Portraits in a Glass House” (2014). She also served as the curator of the exhibition “Germaine De Marcos: The Art of Surrealism” (2014), “Eric Nylund: The Modern Sculptor” (2011), and “Sid", "The next Biennial should focus on the history of the exhibition, the various cultural and social production models that were on offer at the time, and how they are re-adapting to the digital age. “We envision a future where the moment is not only a canvas, but also a source of inspiration and inspiration for the world we live in,” said Keiichiro Takagi, the director of the Biennial and a professor at Tokyo University of the Arts.\n\nThe Museum of Contemporary Art (MoCA) in New York has appointed Claire Rutter as its next chief curator. Rutter has been with the institution for more than a decade, serving as deputy director for collections and exhibitions and as director of curatorial projects for the last two years. She succeeds Jonathan Albright, who retired in May 2019 after fifteen years at the museum.“Claire has been instrumental in helping MoCA redefine itself both as an institution and as a city,” said Carolyn Ahearn, president and CEO of MoCA. “Her achievements and career trajectory are the perfect combination to reflect the diversity, dynamism, and force of the museum in a way that simultaneously embodies and challenges the museum at large. She is a superb", "The next Biennial should take place in Hong Kong in the autumn of 2021. The first iteration of the festival, which is scheduled to run from September 8 to September 10, 2017 in Hong Kong, was canceled amid the unrest in the country.\n\n\nKunstmuseum Basel, Germany, has announced that it is expanding its exhibition space in the former Tate Britain building in London. The museum will open a new space for the Deutsches Kunstheater (DU), the Bauhaus, in the same building in March of 2021.The museum’s general director Klaus Fischer revealed: “With its new location in the same building as the Dünese Biennial and the Deutsches Kunstheater, which will also be able to host other events, Kunstmuseum Basel has delivered a new approach to exhibition design that is more contemporary, engaging with contemporary ideas, and that will be equally at home in the contemporary art world and the contemporary art museum.”He added: “Not long since the institution of the Bauhaus in Frankfurt became a permanent part of the city’s cultural landscape, Kunstmuseum Basel has been a dynamic and attractive destination for visitors to", "The next Biennial should take place in 2020. The museum will have the opportunity to re-examine and re-make the exhibition in its archives. \n\n\nThe Italian government announced today that it plans to establish a new Federal Museum of Contemporary Art (FIMAM) in Rome. The institution will be tasked with preserving and displaying the artworks of the legendary Italian avant-garde, including the earliest works by the late Anselm Kiefer, and will be based in the former Ascoli factory.The proposed museum will be named after the city of Rome, following the city’s historic center, St. Peter’s Basilica. The cultural center, which will boast a permanent collection of more than four thousand works, may also include a solar-powered dome that will act as an observation deck and an amphitheater.The announcement of the new institution came amid rumors that a new Kiefer Museum of Modern Art in Milan would open in the northern city after a $600 million renovation in 2021. The project to revamp the famed Filippo Molinese studio was first announced in 2016, when the artist’s space, Foro Arti, was planning a major expansion. Work on the building and", "The next Biennial should be held at any of the following locations:Art Center, San FranciscoArtists District, San FranciscoArt Museum, Oakland, CaliforniaArtopolis, San FranciscoArtopolis, San FranciscoArtists District, San FranciscoArt Museum, Oakland, CaliforniaArtopolis, San FranciscoArtists District, San FranciscoArt Museum, Oakland, CaliforniaArtopolis, San FranciscoArtists District, San FranciscoArt of the Arts, Los AngelesArt of the Arts, San FranciscoArt of the Arts, San FranciscoArtists District, San FranciscoArtists District, San FranciscoArt of the Arts, San FranciscoArtists District, San FranciscoArtists District, San FranciscoArt of the Arts, San FranciscoArts Museum and Sculpture Garden, San FranciscoArts and Design Museum, San FranciscoArts and Design Museum, San FranciscoArts and Design Museum, San FranciscoArts and Design Museum, San FranciscoArts Museum and Sculpture Garden, San FranciscoArts of the City, San FranciscoArts of the City, San FranciscoArts of the City, San FranciscoArts of the City, San FranciscoArts Museum and Sculpture Garden, San FranciscoArts of the City, San FranciscoArts Museum and Sculpture Garden, San", "The next Biennial should be held at least once every twelve months and will focus on “social justice and the possibilities of art and culture.” The theme of the 2019 event will be “Community, Community, Community: Making the Case for Art and Culture.”The exhibition will be held on the third floor of the Institute for Contemporary Arts (ICA) in New York and will include works by thirty-six artists, including Julia Child, Alia Farouk, Kim Gordon, Ana Mendieta, and Jose Jimenez. The first show of the new exhibition series, titled “Local History,” will open on June 9 and run until March 15. The second show of the new exhibition series, titled “Secrets,” was announced earlier this month and will run from September 19 to September 22.“The Arts and Culture Biennial was born from a desire for a new way to think about and experience the world around us. We want to create a new kind of biennial that draws from more contemporary, local, and African art, and offers a space for a deeper and wider appreciation of what is happening in the world,” said Larry Fink, president of the Fink Collection, which is owned by", "The next Biennial should include the works of twenty-eight artists from twenty-nine countries and be held in the coming months. The exhibition will also include a digital version of the event that will be available on the site of the exhibition. Inaugurating the event will be a retrospective of the work of artist-activists and activists, including Lise Grande-Pavallée, Anita Gupta, Zhenya Galang, Dobi Gordon-Katz, and Sahnu Lute.The launch of the exhibition coincides with the fifteenth Venice Biennale, which will take place in Liverpool, England. The event will focus on themes such as the role of art in promoting social change, the relationship between art and activism, and the rise of the digital sphere. The event will also feature an exhibition of the work of the European artists Sofia and Robert Mapplethorpe, alongside works by Phoenix Parsons, Rex Kultgen, and Viktor Spassky. Luzarte Dallara will receive the trophy at the end of a ceremony at the city hall in Barcelona on January 22, the Madrid premiere of which will take place in the summer of 2020. Dallara is the first Colombian artist to win the prestigious prize.", "The next Biennial should be held in the same location in the coming months.  The theme of the exhibition is “Relationships and Distances.” The exhibition will include works by twenty-seven artists, including Carlos Paulo Ferrer, Tanya Gagliano, Nara Hendra, Sara Rilton, Gangrene Lanier, Bienalma Díaz, Tanya Martinez, and Hannah Newhouse.Prior to the show, the Los Angeles County Museum of Art (LACMA) opened its new Roberto Clemente–designed, Richard Diebenkorn–designed, and Betty Parsons–designed, FloRoR, space for contemporary art. This new venue will house the sixteenth edition of the Venice Biennale, which will take place in 2020. The new exhibition will also serve as a platform for local agencies and organizations that are working to preserve and promote contemporary art. The first exhibition will commemorate the twentieth anniversary of the Los Angeles Creative Action, which is organizing the entirety of the biennial, including the Los Angeles County Museum of Art and the Los Angeles County Museum of Art (LACMA). “We are thrilled that the new", "The next Biennial should be a joint project between the Garment District Museum, the Metropolitan Museum of Art, and the New Museum, and will take place in the fall of 2020. The exhibition will feature more than seventy contemporary artists including Ariana Pérez, Antony Redgrave, João Gomes, Laurie Anderson, Lynn Parramore, and Michael Redgrave. The first group of artists to contribute to the exhibition were Andy Warhol, Jean-Luc Godard, Robert Mapplethorpe, and Ed Moses. The second group will consist of artists such as Ed Moses, Philip Larkin, Robert Irwin, and Richard Avedon. The exhibition will also feature a selection of works by the late Dutch master Ingvild Kalogridz.The show, titled Love is a Lie, will open at the Garment District Museum on February 18. The first show, titled Art and the Body, was staged at the Museum of Modern Art at the University of Amsterdam. The second show, titled The Body in Art, will open at the Met. Last year, the Museu de Arte de Madrid (MAS) in Madrid, the Metropolitan Museum of Art, and the Metropolitan Museum of Art in New York staged", "The next Biennial should take place in 2020, the same year an exhibition of Norwegian art titled “Telling Stories,” which will be staged in Oslo, will be held. A new edition of the biennial will be staged at the Museo de Arte Contemporáneo in Lisbon in 2021.\n\n\nThe Routemaster Museum in New York has announced that it is preparing to open to the public next month with the sixty-sixth edition of the Whitney Biennial. The program, which was organized by the New York–based nonprofit the Whitney Museum of American Art (MoAB), will be led by artist-in-residence and poet-in-residence Debby Rigg, who will curate the event and will present programming focused on life and art.“After a remarkable and challenging 2012–13, the biennial is finally coming to life,” said Rigg. “The exhibition will run four times a week, beginning on Mondays, and will be on view March 19–March 21, March 21–March 23, and March 30–March 31. The biennial will be divided into three parts, ‘Introduction, ’Making Places, and “Nurturing Domains", "The next Biennial should be on August 21, 2020; see you there.\n\n\nThe Bienal Gallery in London has received a gift of five sculptures by Denise Maritz for its upcoming exhibition, “The Empirical Study of the Embraces: Mural Art and Emotional Reality” (2019). The works were donated by the artist, who has lived in London for over twenty years, to the museum in 2009. Through her practice, which comprises primarily of kinetic and chemical processes, Maritz explores “the line between painting and sculpture, between the two worlds in which she has lived for most of her life.”Born in New York City in 1964, Maritz studied at the School of the Art Institute of Chicago, where she studied with Paul Gauguin and Édouard Vuillard, then at the Art School in London, where she met her husband. They have two children together, Jack and Jill, and Jack has a son with his second wife, Sophie.“Denise’s art is beautiful, innovative, and often poetic, often surreal, often ethically questionable, and is often spiritual in its own way,” said Marc Glimcher, the exhibition’s curator. �", "The next Biennial should be in March 2020. The 2020 edition will be held at the Institut National d'Architecture, Paris. Last year, the pavilion, which has a capacity of 1,500 people, staged the docents a′\u0097remarking on the possibility of “institutionalizing the spirit of the exhibition in a new way, which is a new kind of exhibition,” and was nominated for the 2020 Pulitzer Prize in Arts.The 2020 theme, “Prospects and Prospects,” was written by Adam D. Weinberg and Scott M. Nelson and will be composed of twenty-four pieces that are based on themes of history, place, and the future. Entitled “Prospects,” the piece, which will be on view until February 14, 2020, is composed of twelve pieces that began as paintings and were transformed into works of art in the museum’s Fifth Avenue location in Manhattan.In a statement, the museum said: “The twenty-four pieces are chronological and interrelated, showing the museum’s collection of work by various artists during its seventy-five years of operation. Collectively, they stand in contrast to the three-", "The next Biennial should take place in the autumn of 2020.\n\n\nThe auction house to house the works of the late British artist David Hockney, including his iconic Lotus/Axis and his critically acclaimed Broken Window series, which both won the Turner Prize last year and which will be presented this autumn at the Tate Britain.Dubbed the 'country house of art', the private collection will be moved from its current home in the City of London to Tate Britain’s new campus in Stratford-on-Avon. The institution will also begin hosting new exhibitions of work by Hockney’s contemporaries.“David Hockney: Past, Present, and Future, is a singular exhibition that brings together the artworks from an extraordinary collection of his, stretching from the early 1970s to the present,” said Peter Schäfer, Tate’s director. “The exhibition brings together the artworks from a collection that has divided its attention between the two countries, between the two continents, and between major cities and regions. The works of more than two hundred artists from both countries are represented in the exhibition.”The artist’s studio, which is currently being restored, is being hosted by the Museum of", "The next Biennial should open in 2022. The United States is currently cohabiting with Japan on the final phase of the project, which will involve the relocation of the Biennial Museum in Beijing and the creation of a large public space in the capital. The exhibition, which will encompass more than two hundred objects, will run from November 22 to March 9, 2021.Description of the exhibition: Cinema in the Cinema: Art and Cinema in Contemporary Life in the Twentieth Century. Joined by Joachim and Marta Csík, the renowned Czech artist, and two other artists, Adam Dvorkind and Catherine Olszkowicz, this exhibition will present a unique collection of films, TV and film-animated works, and will introduce contemporary cinema to American audiences and to a much larger audience in the Czech Republic. “Cinema in the Cinema” will feature twenty-four full-length films selected from the collection by Joachim. The exhibition will also include a special retrospective of the work of the Czech artist Krzyszek Soskovec, with a selection of his contemporary cinema works curated by The Prague Foundation.The exhibition is organized as an open-ended series of", "The next Biennial should focus on the relationship between the museum and volunteers. It should also explore how the museum reflects the changing ways in which people interact with museums. Should the museum become a destination for people to come to and stay, perhaps as part of a network, it would also be open to the public for lectures, concerts, and other events.It is also possible that the next Biennial could be the last. In an interview with Artforum in 2018, Maria del Carmen de Mora, the director of Museu de Cultura y Poder, described the museum as “at a crossroads between the arts and the sciences.” For the current exhibition, curated by Carlos Sánchez, the biennial will consist of 300 photographs by Cecilia Cipolletta, a member of the collection of the Florentine painter Giotto; two photographs by painter Salvador Dali; and twenty-seven photographs by Artur Rembrandt.\n\n\nArt historians are warning that the cultural sector is at risk of becoming another battleground in the United States’ ongoing war against terrorism, this time involving the federal government and not the private sector. The Art Newspaper reports that the US House of Representatives is preparing to vote this", "The next Biennial should take place in 2020. \n\n\nThe British Museum (BMI) has added four new members to its board of trustees: artist-in-residence J.M. Coetzee, art historian and curator J.M. Coetzee & Sons, a New York–based art museum, and two artists whose works are currently on display in its London outpost, the Tate Britain.The announcement of the new members follows the British Museum’s decision to launch the first online-only edition of its annual Biennial of Modern Art, “Once Upon a Time in a Medieval World,” which will be held at the museum from January 5 to January 6, 2020. The museum is also planning to expand the institution’s holdings of women’s art, with a focus on the first half of the twentieth century, and is exploring the creation of a new section dedicated to the twentieth century through the acquisition of works from individual collectors.The appointment marks a significant moment for the museum: in almost two decades of its existence, the museum has become a major international player in the field of twentieth-century art, receiving numerous awards, including the National Arts Prize in 2017 and the Royal Shakespeare Company’s Medal", "The next Biennial should focus on “Toni Morrison”\u0097or “The Surrealist”\u0097as a historical artifact to replace the DeSoto Collection, which holds the works of John Cage, Thomas Dolby, Robert Irwin, Ralph Waldo, and many more. The Los Angeles County Museum of Art is planning to take the collection to Mexico City.\n\n\nThe Museum of Contemporary Art (MA) in Boston has appointed Charles A. Soltan as its interim director and CEO. Soltan has been with the museum for nearly two years and has led the institution since January 2019, when it was restructured to become the Massachusetts Museum of Art. His appointment was announced on Wednesday, April 4, following a board meeting at the institution’s new headquarters, the Maine Theater, in Concord.Soltan will take the helm of the museum during MA’s next major revamp, which will likely involve the removal of 20 percent of the building’s furnishings and construction of a new seventy-one-storied building. The project will also involve the construction of an outdoor plaza, a new library, and the reinstallation of MA’s museum’s collection.“MA’", "The next Biennial should be held at a suitable location in the city. “The Art of the City,” will be a compilation of the works of the past ten years, which will be organized so that it can be viewed by anyone in the city. The museum will also launch a digital platform in April 2020, with the first exhibition opening in March 2021. “When the Biennial was originally conceived, our goal was to make the city of New York an international destination that can be enjoyed by everyone, regardless of where they live,” said David Rubenstein, the general manager of the institution. “We are honored to be working with such a gifted and dedicated team of curators, engineers, and architects to continue to redefine the museum’s collections, to develop new programs, and to collaborate with our incredible global community.” Rubenstein also noted that the upcoming exhibition “gives us one year to develop a new visual art program. For the past ten years, it has been our goal to create an accumulation of work that can be viewed by the whole family, whether you are in the city or at home.”The 2020 biennial will be hosted at Rockefeller Center and will feature work by", "The next Biennial should be held in 2020 and will focus on the conservation and restoration of the world’s cultural heritage.”\n\n\nThe Museum of Fine Arts (MFA) in Los Angeles has appointed Sara D. Clark as its new executive director. Clark comes to the museum from the Santa Monica Museum of Art, where she has served as director of exhibitions and research since 2016. She succeeds David Duncan, who retired in March 2019 after twenty-five years at the helm of the museum.“I’ve been a supporter of the museum for fifteen years,” Clark said in a statement. “I’ve been involved in the museum’s mission for almost as long as the museum’s namesake, Abraham Lincoln, whose name has been inscribed in the central location of the museum. I’ve created exhibitions that reflect the unique heritage of our institution, and I’m eager to continue that legacy with the museum’s next iteration.”Clark is a scholar of American art and the history of art and was previously the head of the exhibition program at the Cooper-Hewitt, New York; the Kansas City Museum of Art, Missouri; and the Metropolitan Museum of Art, the Museum", "The next Biennial should focus on the current political situation in the country, which is currently grappling with the impact of the coronavirus and the ongoing political crisis, and will announce its organizers and dates in late July. The twenty-fifth edition, the inaugural event of the new, $265 million Biennial of the Arts, will take place at the Museo de Arte Contemporáneo in Santiago, Chile, in September. The full list of participating artists is as follows:Art Basel Chicago: 12 months to August 2019Art Central Berlin: May 2019Art Dusseldorf: May 2019Art Dusseldorf (Dusseldorf Art Museum): May 2019Art Graz: May 2019Art Frankfurt: May 2019Art Hannover: May 2019Art Cologne: May 2019Art Nürnberg: May 2019Art Nürnberg (Dusseldorf): May 2019Art Nürnberg (Dusseldorf Art Museum): May 2019Art Nürnberg (Dusseldorf): May 2019Art Nürnberg (Dusseldorf): May 2019Art Nürnberg (Dusseldorf):", "The next Biennial should be held in 2021. The upcoming Venice Biennale will likely kick off sometime in March. Gabriela Massie, who was awarded the $50,000 Godel Prize for her work Inspired, is facing a legal battle after she claimed that she was the victim of a hate crime in Spain last October, when a group of people gathered in a car on the street in front of her home in the city of Valencia and began chanting \"You scum, you faggots, you filthy pigs, you son of a whore.\" The group then allegedly pulled a gun on the woman, who said the group threatened to kill her.After Massie filed a complaint with the police, the men who were involved were arrested, but the incident did not lead to charges. The incident was captured on video and shows a group of around a dozen people gathered in a car in front of a white van that was parked nearby and chanting. The van then drives away, but no one is seen running from the scene.According to the Simon Wiesenthal Center, Spain has recorded more than 1,700 incidents of anti-Semitism since the beginning of the year. In March, the Spanish government passed a new anti-racism", "The next Biennial should focus on the feminist and anti-racist politics of the Black Lives Matter movement and the impact that the Black Lives Matter movement has on our contemporary politics. I look forward to working with the Board of Directors, and with the many artists, filmmakers, activists, and scholars who have been inspired by the work of the Biennials to further their own political and artistic agendas through their own artistic creativity.\n\n\nThe Adriatic Museum of Contemporary Art (AMC) in Venice has added four new artists to its collection, bringing the total number of artists represented in its collection to thirteen. The institution also announced the appointment of the artist-in-residence Oscar Rojas-Villar as an exhibition curator, and the artist-in-residence Ato Ibini as the director of the archives.In addition, the museum also announced that Jørn Rasmussen, the former deputy director of the Museo de Arte Contemporáneo, Venice, was given a commission to create a public project for the museum. The patron-appointed commission will focus on the history of the institution and will examine the relationship between the museum and the local municipality of Venice and will be organized as a public art project.“Ibini and", "The next Biennial should take place at the National Museum of the American Indian in Washington, DC, in 2021.\n\n\nThe Cleveland Museum of Art (CMA) in Ohio has received a gift of more than eighty artworks from the American Jewish Museum (AJM), including pieces by artists such as George Washington, Gershom R. Gusens, and Ruth Rendell. The institution also revealed that it is taking the issue of “jewish nationalism” seriously and rethinking the institution’s relationship with the museum.“It has been a long time coming, but this is the moment,” said museum director Marc Glimcher, who added that the new artist-in-residence program will aim to provide a “more robust and diverse cultural experience.”The changes will introduce a new initiative, “The Art of the Collection,” which will draw from the collections of the AJM and the Pérez Artístico in New York City and introduce new work by and for local artists. The first part of the program, which will launch in the fall of 2021, will focus on new collections and the art of the collection, which includes works by contemporary American artists. The second part of", "The next Biennial should be in 2021. “As we said in our announcement, the institution has been through many changes over the years. It is a pleasure to return to the Miranda with your organization and to continue to be a positive force in the city of St. Louis.” \n\n\nThe Scottish National Art Gallery (SNM) in Edinburgh has hired Kate Edwards as its next director and CEO. Edwards replaces Lisa MacLeod, who has led the institution for nearly twenty years, and takes the helm of the institution from the Glasgow-based artist and philosopher Andy Murray. She succeeds Tom Daley, who helmed the institution for twenty-one years, and will begin her tenure in January 2021. “I’ve been a huge fan of Kate’s work since I first met her in 2006, and she’s been a champion of practitioners working in a conceptual, experimental, and experimental style,” said Nick Brown, director of the museum. “I’m looking forward to working with her to develop new and stimulating ways for the museum to present and receive the works of Scotland’s greatest contemporary artists, and I’m committed to working with her to ensure that the foundation of the", "The next Biennial should take place in 2021, and is currently on view through November 21. The next iteration of the show will take place at the Museo de Arte Contemporáneo, Buenos Aires (Museum of Contemporary Art, Buenos Aires); the Museo del Prado (Museum of Modern Art, New York); and the Museo de Arte Contemporáneo (Museum of Contemporary Art, Barcelona).In the interim, the exhibition will present its collection of photographs by the legendary Brazilian sculptor Edith Guarani, whose body of work was selected by the curators of the seventeenth edition of the prestigious international exhibition series, Art Colombia. It will also launch an online version of the exhibition, which will be hosted by the same website as the exhibition. \n\n\nThe municipal government of the Russian city of Omsk in Russia’s Far East region announced that the site of the city’s Museum of International Art (MIIA) will be transformed into a 'new cultural center for the whole of Russia’s Far East,” the region where the museum is located. The announcement was made on August 5, the same day that the institution announced it was expanding its reach by", "The next Biennial should be called in the coming months.  The next edition, titled Exhibition 5, was staged at the Museums in Berlin in March of 2018 and will take place at the Berlin Art Museum (BAM) in May of 2020, the same year the exhibition will be moved to the Palais de Tokyo. The biennial will mark the end of the Second World War and will include work by contemporary artists between the years of spring and fall. “We are very excited to be celebrating our fifty-fifth anniversary this year and to have the opportunity to continue working and presenting internationally,” said Bernd and Steffen. “The collection now comprises approximately 600 works and has a rich history of artistic and conceptual exchanges. We are very much looking forward to the next edition.” \n\n\nThe Pennsylvania Academy of the Fine Arts (PAFA) in Philadelphia is instituting several new and improved safety measures to prevent the spread of Covid-19, including requiring schools and childcare facilities to implement disinfection and handwashing stations, restricting social contact and limiting outdoor gatherings.Called the PAFA Safety and Wellness for All Agenda, the initiative was developed by PAFA board chair Lorraine S", "The next Biennial should be held in 2020 and the date has yet to be announced.The exhibition of the artist’s work will take place in the new, multi-million-dollar Museum of Modern Art (MoMA), where the artist resided for most of his life. The museum also has a site near Rockefeller Center, where the artist will be housed for the next twenty-nine years. The fate of the former building, which will soon be transformed into an avant-garde performing arts complex, is currently in litigation.Among the works that will be featured in the exhibition are Avant Garde (1959), her first work in the series called “Géantica” (1960–1963), “Sensations de l'Art et de l'Étage” (1963–1964), and “La République” (1965–1966), about French revolutionary workers and communist ideals, as well as her paintings The Death of a Young Girl and Lady with a Mascara. The latter was shown at the Venice Biennale in 1966.In a review published in the October 1975 issue of Artforum, Carol Snitzer wrote: “Hitchens, like all writers of his ilk", "The next Biennial should take place at the Museum of Fine Arts in Boston in 2022. \n\n\nThe Witten Museum of Art in Nashville, Tennessee, has appointed Rebecca Watson as its next director. Watson comes to the institution from the Los Angeles County Museum of Art (LACMA), where she has served as a deputy director since 2013. Under her leadership, the institution has grown its collection by more than twenty thousand works, expanded its public programming, and added more than eighty thousand square feet of exhibition space. Named the Watson Collection at a press conference in New York on Friday, Watson said: “I have been inspired by the collection’s extraordinary breadth and depth over the last thirty years as I have worked to expand and deepen the Witten’s research and public experience. I am thrilled to support this significant collection in the upcoming years with my passion, energy, and enthusiasm.” Watson will assume her responsibilities on January 6, 2021.\n\n\nThe Metropolitan Museum of Art in New York has appointed Valentin Teitelbaum as its new director. Teitelbaum has been appointed to the post by president Max Awa, who has been a senior member of the museum’s board of trustees since", "The next Biennial should be in January 2021.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is planning to nix a planned $1 million renovation of its nineteenth-century, neo-classical, glass-enclosed building to make way for a $2 billion mixed-use redevelopment, calling the project “unacceptable.” The museum also plans to move the exhibition space and the galleries and study spaces away from the building, which is currently home to the Museum of Modern Art (MoMA), the Museum of Contemporary Art + Design, and the Los Angeles County Museum of Art (LACMA), and has lobbied the city to delay the project.The criticisms of MoCA for violating the landmark preservation law by expanding the museum in the 1990s and for breaking its own bylaws by building a new building attached to another museum in the city—in a move that some have considered a form of corporatization—have gained attention from state legislators and the city’s planning commission, which voted unanimously in favor of the renovation, which was approved by the City Council in 2018. The renovation will also allow MoCA to add more than three thousand square feet of gallery space to its existing building, which is currently home", "The next Biennial should be held in 2019, and the 2019 edition will be on view on October 19–November 17. The 2019 edition of Artforum was organized by the Los Angeles County Museum of Art and will be hosted by the Los Angeles County Museum of Art (LACMA), the Museum of Contemporary Art San Diego, and the Museum of Contemporary Art Los Angeles. The 2019 edition of Artforum featured work by twenty-two artists, including Adam Ashley, Alex Hassen, Avi Lewis, Anna Boden, Galen Lösch, and David Zwirner.\n\n\nThe Los Angeles County Museum of Art (LACMA) has established two endowed curatorial positions with a grant from the Aaron Siskind Family Foundation. The post of assistant curator of contemporary art is currently held by Nancy Wirth, who has been assigned to the upcoming season of Artforum, which will begin on September 26 and run through the end of the month.“We are honored to be able to support the museum’s growing reputation as one of the most important cultural institutions in the country, ” said MCA director Michael Schloss. “We are grateful to the Siskind Family Foundation for providing a generous", "The next Biennial should have a theme centered on the artist’s practice and will be designed by famous American architect Frank Gehry, with the support of the architects Frank and Maria Bocci, who is currently working on the new institution. “The new project will be a collaborative exploration of the questions: What are the limits of art, and how do we live with them? We hope that this exhibition, this exhibition, and this project will allow us to begin to consider these questions and to consider the limits of art,” said architect and curator Catherine Taft. The new venue will house the exhibition “Unfinished Business: Contemporary Art from the Third World.” The first volume of the exhibition, “Carat Gallery,” will go on view on March 31; the second volume, “Made in Hell,” will be on display until November 28; and the third volume, “Theater of Operations: The Korean War, 1945–1952,” will open on May 21. \n\n\nThe Art Newspaper has announced that the Olympus Gallery in Athens, which has been closed since March 12 owing to the Covid-19 pandemic, has received a new,", "The next Biennial should be staged in the spring of 2021. The next exhibition should be held at the new facility in 2021.The next exhibition will be titled “The Metamorphosis of a New World.”\n\n\nThe New York City Department of Cultural Affairs (DCLA) announced on Thursday that it is restructuring its budget by $3.5 billion, reducing its staff and giving fewer staff raises in an effort to reduce costs, reduce spending, and streamline its operations.Under the terms of the plan, the agency will reduce its workforce by 20 percent by June 30, 2022 and will lay off 25 percent of the remaining staff by June 30, 2024. The layoffs were made in an attempt to reduce the agency’s $18 billion budget by $2.7 billion; it anticipates a $1 billion shortfall in the second half of the decade.“This year’s budget cycle has been challenging for all agencies, but we’re certainly not alone in the struggle to balance budgets and cope with the effects of the coronavirus,” said agency commissioner Daniel H. Weiss. “The restructuring will help ensure that we have the resources we need to keep our doors open, meet our daily work demands,", "The next Biennial should feature some of the most recent works by the nine artists chosen by the Uruguay Round Table for the top ten new works. The exhibition will take place in the city of Rio de Janeiro, Brazil, from January 20 to January 22, 2020.The first show of the new initiative will be a presentation of the work goldfarmer. This exhibition will be the first at the Biennial, which will inaugurate with a celebration of the centenary of the birth of the founder of the industrial group Luiz Bystrica, Carlos Seixas, which will take place at the venue from February 10 to February 14, 2020.The theme of the second show is “Otolí.” The show will be centered around the story of Otolí, a woman from the Amazon who was the first person to be executed in Brazil. The guarana “died of hunger.” The guarana “lived for love.” The guarana “lived and breathed life.” Otolí, whose name means “soul of the jungle,” is one of dozens of works by the nine artists selected for this year’s biennial.\n\n\nThe", "The next Biennial should be held in 2020.The festival will include a number of exhibitions, including a biennial on Latin American artists and the artist-in-residence program, and will bring together leading artists from Mexico and Argentina in Mexico City. Los Angeles, Chicago, Boston, and New York will also participate. The Palacio de Cultura Artes in Mexico City is slated to host the 2019 biennial, titled . . . Angelica: El Hombre de los Angeles. The exhibition will be curated by Diego Pintura and will inaugurate an exhibition of work by Mexican artists.\n\n\nYale Union, the progressive art space founded in Seattle in 2002, has selected the recipient of its 2019 David-and-Goliath award. Based on a $2,500,000 donation, the prize recognizes work in its portfolio that advances the creative vision of the institution and the collective.“We are honored to receive the David-and-Goliath award for the 2019–20 academic year,” said Nicole M. Robinson, the prize’s executive director and artistic director. “This year’s award cycle reflects the ongoing vitality of the Portland, Maine–based, arts space, and our deep commitment to supporting", "The next Biennial should take place in 2019. The museum will be rebuilt in time for the 20th Biennial of Contemporary Art (2019), which will be held in 2020. The building will also undergo a major renovation. “I’ve been a huge proponent of local creative activity in all its forms, from gallery openings to education and advocacy,” said Leonor Dawson, chair of the board of trustees of the Metropolitan Museum of Art. “I’m looking forward to continuing that work with our new partners, the New Museum, and the Wang.”The $1.2 billion renovation of the Museum of Modern Art in New York City, which was completed in 2020, is estimated to cost $695 million. The project, which involved the relocation of more than one hundred works, was inspired by the work of the late American industrialist H. J. and A. P. Heinz, who designed and built the museum from 1960 to 1970. The building will comprise three exhibition spaces, a research library, an art museum, and a public garden. The renovation has taken four years and is part of a major $120 million expansion project, completed in 2019, that added a new auditorium, a new", "The next Biennial should be in the spring of 2020, and the fourth will be next year. \n\n\nThe New Museum in New York has acquired thirty-six works from the Whitney Museum of American Art in New York and the Metropolitan Museum of Art in New York City, including twelve works by artists such as Robert Irwin, Leo Castelli, and John Ostrander. The works, which range from early twentieth-century Italian abstractions to early modernist practices, will be placed in the exhibition “Skin Deep: Painting the Body in the 1950s” at the Met, and will be on view in the museum’s expanded location, the Richard and Helen Lyon Theater, in the spring of 2021.The acquisition, which also includes a selection of works by artists such as Rachel Whiteread, Frank A. Garcia, Joseph Beuys, Hernan Casals, and George DeJohnette, is part of a larger plan to expand the museum’s holdings of Italian modernism. The renovation of the Pantheon’s holdings of Italian modern art, as well as the construction of two new galleries, will begin in 2021.The works acquired in the deal are: Eduardo Campioni’", "The next Biennial should take place in 2020. The next iteration of the Venice Biennale will take place in 2023. The next edition of the Copenhagen Biennale will take place in 2021. The next edition of the Geneva Biennale will take place in 2020. The 2021 edition of the Tokyo Triennale will be held in 2021.  The 2020 edition of the New York Art Biennale will be held in 2021. It was announced that the 2019 edition of the event would also be canceled. The 2019 edition of the Hamburg Intifada, which was organized by Agora BISCHEWITZ, will be held from September 29 to September 30 and will take place from October 2 to October 7. The Amsterdam Art Biennale will be held from September 26 to September 28 in September 2020 and will run from September 28 to September 29. The 2018 edition of the Berlin Biennale, which was organized by the Berlin Athenischer Kunstverein, will be held from September 24 to September 28 in September 2020. The 2019 edition of the Basel Art Biennale will be held from September 26 to September 28 and will run from September 28 to September 29. The 2019 edition of", "The next Biennial should take place in New York City in 2021.\n\n\nThe Yanomami People of East Africa (formerly called the People of the Forest) have voted to form a new nation-state from the Central African Republic, the Democratic Republic of Congo, and Uganda. The new entity is named after the three-dimensional shapes which were traditionally carved into the earth, and will also incorporate Rwanda and Uganda. For the first time, the country has elected a president, and the new government is led by a woman.The leader of the newly formed nation-state is Kenyan President Mwai Kibaki, who will assume power on January 9. The United States has since congratulated Kenya on its election, but has cautioned that it is still assessing the results of the forthcoming elections. Kibaki said: “The results of the elections will be the basis for the formation of a new government.” The new government will be led by a president who will be elected by the National Congress, the country’s lower house of parliament, and will be comprised of representatives from the three countries.\n\n\nThe first artists-led initiative to save Aleppo’s historic Old City, formerly the seat of the Syrian government, is launching today. The", "The next Biennial should be announced in the second quarter of the year. The next event, which will be held in the Bessarabia–Milano region, Italy, is currently on indefinite hiatus.  The upcoming edition of the Venice Biennale will be held from March 12 to March 14, 2020. The upcoming edition of the Stedelijk Museum Amsterdam will be staged from March 20 to March 24, 2020. The upcoming edition of the Stedelijk Museum Fonsal, will be staged from March 26 to March 31, 2020. The upcoming edition of the Kunsthalle Basel will take place from March 13 to March 15, 2020. The upcoming edition of the Kunsthalle Geneva will be held from March 15 to March 20, 2020. The upcoming edition of the Kunsthalle Hamburg will be held from March 16 to March 21, 2020. The upcoming edition of the Kunsthalle Iberia will be held from March 14 to March 17, 2020. The Zurich Biennale will be held from March 13 to March 17, 2020. The Beijing Biennale will be held from March 20 to March 22, 2020. The Venice Architecture Biennale will be", "The next Biennial should take place in the spring of 2021. The twenty-seventh will be held in the spring of 2022 and the twelfth in the spring of 2023. In addition, the twenty-eighth Biennale will have a title that reflects the themes and the installation and will have its own theme, a word, and the name of the museum.“The current exhibition is a reflection of the changing political and social conditions, the challenges, and the possibilities that confront us now,” Tomás Augusto Medrano, artistic director of the Museo d’Arte Moderno in Venice, told the Art Newspaper. The event will also be expanded to include a new public space that will be located in front of the museum, with an opening for the public on September 9.The new venue will also feature new works by artists who have been designated for the exhibition. The selections for the show will be curated by Giovanni Ribisi, the curator of contemporary art at the Museo Arte de Venice, and will be presented in a virtual reality experience. The exhibition is being billed as the “next, the great, Modernism” and will run until November 13.\n\n\nThe Institute of Contemporary Art (", "The next Biennial should be staged in 2021 and will be hosted at the New Museum in London.\n\n\nThe Los Angeles County Museum of Art (LACMA) is successfully moving forward with a redesign, expansion, and renovation (RDU) of its former campus, which was completed in 1961 and currently hosts more than 6,000 works of art. The $4.7-million redesign includes a new lobby, a reconfigured auditorium, and a redesigned roof, as well as a new glass-enclosed corridor that opens up to a large glass-enclosed courtyard.LACMA’s new building, which will be approximately 900,000 square feet, includes a color palette of opulence, from the opulent to the bombastic, and a wealth of new spaces for the public, including a new amphitheater, a terrace, and a theater. The renovation project was made possible through funding from the estate of Joseph and Edith Steven’s late friend and philanthropist and backer, the late industrialist and philanthropist Victor Mansfield.“LACMA’s new building is the result of an ambitious and challenging vision to reimagine the relationship between museum and county,” said Mansfield, a longtime", "The next Biennial should bring together around seventy artists from the US and Europe on the theme of the biennial. The inaugural exhibition will be curated by Sarah Lotfyre, curator of modern and contemporary art at the Museum of Modern Art in New York.The biennial will focus on the masterworks of American avant-garde, and will take place at the Biennial Festival, a biennial-style event held at the Museum of Modern Art in Washington, DC, in 2020. The twenty-fifth edition will be staged at the Smithsonian American Art Museum in Washington, DC, in 2021.Inaugurating the 2019 edition, the museum will hold a special exhibition of works by the group of thirty artists who called themselves the Sphinx Circle, and represented the Golden Age of American Abstract Art, from 1870 to 1973. The exhibition will feature works that examine the influence of the sphinx and its influence on artists of the sixteenth century, and will be organized in multiple genres, including sculpture, painting, and photography. The upcoming editions of the biennial will focus on the art of the nineteenth century, and will be staged at the Museum of Fine Arts, Boston, and the Museum of Modern Art, New York.\n\n\nThe Museum of Contemporary Art", "The next Biennial should take place at the Museums in London, which will be inaugurated by the exhibition “The Making of Modern Art” in 2021, and will be the first to take place in the UK since the 1984 end of the civil war. The artists who will represent the Biennial are: Arturo Ferrer, Catherine MacTiernan, Conrad Malina, Jiang Cheng, Haroon Mirza, Razak Ali, Kees van der Rohe, Kamala Khan, L.A. Reid, and Kirsten Ngāi.\n\n\nThe Los Angeles County Museum of Art (LACMA), the Museum of Contemporary Art, Los Angeles (MCA), and the Metropolitan Museum of Art have issued an official apology for misrepresenting the work of the late Chinese American artist Sun Yat-sen in an upcoming exhibition organized by the museum. “We deeply regret that we did not accurately reflect his artistic legacy,” said the museums. “As a result of this oversight, the work in the exhibition is not as he intended.”According to Artnet, the artist’s wife, Sun Yat-sen�", "The next Biennial should not be a celebration of art but one of the times and the place within our cultural history. Biennials are not about the past but about the present, about the future, and about all the ways in which we interact with each other and with the world. This is the museum’s mission.”While the Biennial is still on track to open in 2020, the first exhibition in the new venue will open November 22. The first show in the new building is an exhibition of work by seventy-one artists, which runs through November 27. The exhibition, titled “Bertrand Goldberg: Creative Life” (Bergman-Hansen), will run until November 29. The Biennial’s inaugural exhibition, “Willem de Kooning: The Artist in a New Direction” (2017–18), was curated by Sangeeta Krishnamurthy, curator of the 2018 Noguchi–Kirshstein Exhibition in New York.\n\n\nThe Dutch Ministry of Culture has released an interim report on the future of the Kassel Biennial, which will move to the Schloss Kassel in 2021, and has decided to cancel the 2021 edition, which was set to take place", "The next Biennial should take place in 2021. \n\n\nThe City of New York is planning to begin phasing out the use of the iconic blue plinth in all of its public spaces by 2050, in a move that will protect the environment and ensure that New Yorkers have access to public artworks for the next eighty years. The plan, which will be outlined in a twenty-first-century master plan, was drafted by city planners James D. City and Zanele Giuffrida—who were commissioned to write the document in 2013 after the city began phasing out the plinth—and Amanda Levin.“As we embark upon a new century, the city will need more than ever to return to nature,” said City Councilman Jimmy Van Bramer, chair of the city’s committee on urban affairs. “We need new ideas and new modes of transportation to take us where we need to go, to keep our communities safe and our streets healthy, and to keep our communities vibrant. The city’s plan will do just that. We are passionate about how the blue plinth will return to the blue sky, to the blue floor, to the blue walls, and to the blue floors of City Hall and City", "The next Biennial should focus on the history of modern and contemporary art and explore the intersections between art and politics in a way that is challenging the very notion of art. The upcoming edition has a lot of possibilities and I welcome your feedback. I am very much looking forward to the next edition. Best regards,Kasper Bächliński-Biczelkowski_____________________________________________\n\n\nThe 2018 Seoul Biennale has become the first to draw inspiration from a de facto state-perceived in Hong Kong—the country houses the Hong Kong Special Administrative Region but does not officially recognize it.Dubbed the South-East Asian Century, the exhibition will be divided into three sections: Ambiente, Art and Politics, and Science and Technology. The opening of the exhibition takes place at the KW Club, Seoul’s cultural center, on August 12–August 31.Dubbed the “Quadennial of modern and contemporary art,” the events will take place at the Gyeongbokgung, a former US military installation near Seoul, from September 10–September 14. The exhibition will be followed by a triennial of contemporary art, where Korean artists will present their work in collaboration with international", "The next Biennial should take place in the fall of 2020. The twenty-first will focus on issues such as the memory of the “comfort women” (previously referred to as “comfort women”) who were forced into sexual slavery by Japanese forces in World War II, and the “comfort women” memorial in Tokyo.“I am very excited by the direction of this biennial and the prospect of creating more opportunities to address pressing social and historical issues,” said Miyazaki. The biennial is part of a plan that aims to revitalize the politics of remembrance and to reinterpret Japan’s wartime history through creative, contemporary exhibitions and public performances. It will also include the first cohort of Japanese artists to visit North Korea, which was annexed by Japan in 1937 and never regained its sovereignty over the peninsula.The artists selected for the biennial, which will be hosted at the Pyongyang Museum of Art in North Korea, include: Shotaro Saito (AoA), Kim Su-kyung (Namju), Kim Seung-kyung (Namju), Shinichi Takeda (Saitama), Hitoshi Usui (Namju), Keisuke Watanabe (K", "The next Biennial should be held in 2021, and the fourth in 2022. The move follows the reorganization of the National Museum of Modern Art (MoMA) in New York, which will also include a reopening of the Metropolitan Museum of Art.According to the New York Times, the New York–New Jersey Partnership for the Arts and the Metropolitan Museum of Art have announced that the Los Angeles Biennial will be held in 2022. The Los Angeles–New York biennial will first be staged at the Pasadena Museum of Art in California in 2022, and then at the San Diego Museum of Art, California, in 2024.The LA show will be in February 2020, and will feature the work of over sixty artists. The exhibition will also introduce the world to the Los Angeles–based nonprofit Artadia, which aims to provide safe spaces for the visually and hearing impaired.\n\nThe Bechdel test will be repeated at the 2019 Museum of Modern Art (MoMA), which is currently undergoing a $500 million expansion, the Metropolitan Museum of Art (MoMA), and the Stephen F. Austin Museum of Art. The announcement came on the heels of a $650 million expansion project that will also include the construction of an 800-seat theater and", "The next Biennial should be held sometime in 2020 and will be the twenty-first in 2021. The institution will also extend its work on the second edition of the Biennial to 2022. Hermann Hesse, the director of the German Cultural Center in Kassel, said: “Artists from all over the world are now collaborating with each other and with the art of Germany. The upcoming exhibition will be a real opportunity for the German Institutions to showcase their achievement.”Both films and the exhibition will be presented at the same time. The staged retrospective “Hermann Hesse: Art and German Life” will run through December 22 and the staged exhibition “Johann Wolfgang von Goethe” will take place on January 31. The first Biennial exhibition will open on October 20 and the second biennial will open on January 21. \n\n\nThe Museum of Modern Art (MoMA) in New York has sold a painting by Paul Gauguin, a French Symbolist whose austere, surrealist paintings were inspired by the artist’s concentration camp experiences, that is now on display in a new retrospective at the institution. The National Gallery in Washington, DC, also recently completed a project for a", "The next Biennial should be held in 2021. No date has yet been set for the 2019 edition.\n\n\nThe Milwaukee Art Museum (MAM) has appointed Kate Galbraith as its new chief curator. Galbraith is the founder and president of Galbraith Art Museum, an independent organization that focuses on museum stewardship and archiving. She succeeds Leslie George, who retired in February 2019 after twenty-five years at the institution.“The search for a new chief curator began with art historian and avid collector Rick Koll, who served as a mentor to Kate throughout her career,” said Elizabeth Anne McEnery, director of the museum. “In addition, Kate is a brilliant curator, expert communicator, and organizer, and we are honored to have her as part of our team.”Galbraith joins MAM from the Institute of Contemporary Art, which she founded in 2009, and will take up the post in March. During her tenure, Galbraith will work with curator and board president Corey Lew, who is also an adjunct faculty member at the school, and develop new programming for the museum. She will begin her role in April.“As a curator who loves to draw from art history, I�", "The next Biennial should be the fifth edition of the exhibition, which will be held in the French capital from February 26 to March 5, 2021. The exhibition will feature more than 1,600 works from the global collection of the French artist Alexandre Aïtienne Duane and will have a different format, focusing on women, indigenous and inter-communal life.Commenting on the upcoming exhibition, François Delarville, the director of the Biennial d'Art et d'Hiver, said: “This year’s exhibition will be a renewed, updated and renewed chapter of the director’s programme, as it unfolds. We are confident that it will be an unforgettable experience for everyone.”\n\n\nThe Metropolitan Museum of Art, in New York, has released the official list of fifty-five artists who will participate in the Avatar Art Museum’s inaugural exhibition, “The First Without a Flag: Art and Politics from the American South,” which runs February 16–February 21. The exhibition’s first chapter, “Sisters,” lists forty-seven black American artists whose work addresses themes of racial identity, belonging, and the legacy of the Black", "The next Biennial should focus on the history of the art and its enduring role in the cultural life of San Francisco and the Bay Area, and should hopefully exhibit the work of the most celebrated artists. This is not a time to abandon the legacy of a great artist but a time to create a new one. The first phase of the Biennial will launch next year, with the exhibition “Art and the City: An American Odyssey,” which will take the history of San Francisco by almost twenty artists from 1976 to 2013 and will be open March 19–March 21. The second phase, which will be staged in 2021, will take the art created during that time period in a new way and will be open March 20–March 21, 2021.The 2019 event, which was organized by the Museum of California Design and designed by Richard Avedon, was held at the same location as the Museum of California Art and drew over twenty thousand visitors. The 2015 and 2017 events were at the Civic Center and the Contemporary Art Museum San Francisco, respectively.\n\n\nThe Galerie Lauritzen in Berlin has appointed Julia Pfeifer as its new artistic director. In her new role, which is slated to begin in the coming weeks, the gallery will", "The next Biennial should take place in the spring of 2022, to coincide with the reopening of the Museum of Contemporary Art (MoCA), the city’s largest art museum, located at 1400 West Twenty-Third Street in Manhattan. The institution will be inaugurated by a major exhibition of new work by the artist-run collective Artadia.The biennial will cover a wide array of subjects, including the history of the art that is currently on display and the future of art in the museum, and will feature new works by artists and organizations with whom the institution has collaborations, including the Seventeenth-Century Jewish Museum, the Museum of Native Art, and the Museum of Contemporary Art, Los Angeles. It will also include the exhibition “Museum of Contemporary Art” (MCA) members Lisa and Noah Kramer’s first exhibition together at the institution since they parted ways with the museum in 2013.The announcement of the biennial’s themes comes on the heels of the announcement of the institution’s new collection direction. “The Biennial is transforming how we organize, share, and design art in the city,” said museum director Javier Aguirre. “The work of the artists and institutions", "The next Biennial should be held in January 2020. \n\n\nThe Museum of Modern Art (MoMA) in New York has announced that it is planning to close permanently as part of an effort to reduce the environmental impact of the institution’s operations. According to a release, the decision was made after a year of consultation with the public, who expressed a “strong sense of community” following MoMA’s reopening in March of 2019.“MoMA is committed to creating an environment of mutual respect and empathy for the people it serves,” said Bruce Miller, director of the institution. “In support of this mission, we’ve undertaken a number of actions to enhance the environment for our visitors, including: ‘expanding our bicycle and pedestrian paths and meeting the needs of a growing city;’ ’improving our parking lots and making them more bike and pedestrian-friendly; and ‘providing more opportunities for community activities.”The announcement coincides with the opening of “Lincoln,” a new retrospective of the artist’s career, which will be held at the Museum of Modern Art in 2021. Lisson Gallery has announced its representation of the New", "The next Biennial should be held in November 2020.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has received a gift of twenty-one works by American painter and sculptor Erma Bombeck, who lived and worked in New York from 1941 to 1972, according to Artnet. The work, a reproduction of a painting she made in the late 1940s, will be dedicated to Nelson Mandela.Bombeck, who is widely celebrated for her vibrant and vast portfolio of American painting, died of cancer in Charleston, South Carolina, on March 22. Born in San Francisco in 1941, Bombeck studied painting at the University of California, Berkeley, graduating in 1954. She was a member of the group Nude in the House, which produced an exhibition of early American American art in the 1960s, and developed a strong interest in the art of the West Coast in the late ’50s and early ’60s. Using photographs and archival materials, the museum is planning to display the works at the Museum of Modern Art (MoMA), which is currently in the midst of a major renovation project.In recognition of her enduring legacy, the museum is presenting the works in the exhibition “Beyond the American Dream: American Painting in", "The next Biennial should take place in the city in 2020. “When we think of the city of Chicago, we picture a city that has the potential to be a spectacular cultural destination,” said Louis Vuitton CEO Yves Saint Laurent. “The Biennale has identified this potential with the creation of the newly created Marking the Year, which celebrates the 40th anniversary of Marking the World, and will celebrate the importance of design in shaping the future for the city. I look forward to collaborating with the new director of the Metropolitan Museum of Art, Arthur J. Levine, to shape the next Biennale, with the museum’s audience and the city of Chicago in mind.”The exhibition is curated by Copenhagen-based curator and architect Jan-Ole Dahl, who will continue to work in the city through the construction of the museum’s new building, the Henry Art Gallery, which will be completed in 2022. For the future of Chicago, Dahl and the MCAʙs board of directors are encouraging the city’s Design Museum to explore the redevelopment of its existing buildings and to consider the possibility of creating a new master plan. \n\n\nThe Museum of Modern Art (MoMA)", "The next Biennial should be held in 2021. \n\n\nThe Museums Association (MA), a US trade group representing more than 1,800 museum professionals, has announced that it will no longer recognize the American Civil Liberties Union (ACLU) as representing the interests of museum professionals. According to the New York Times, MA’s board president Michael Gerson cited the ACLU’s opposition to new gun control measures as one of the reasons for their decision.In a letter addressed to Museum Professionals for America (MPA), an affiliate of the association, Gerson wrote: “MPA stands with museums across the country in opposing the NICS Checkpoint Act, the Stop Online Banning of Terrorist Materials Act, the Protecting Lawful Commerce in Arms Act, and the TR 2310. We oppose these laws, which will make our communities less safe, and we oppose the way they are being implemented. We ask that you be mindful of the work of the museum profession in representing our clients and be responsive when the museum’s board of directors meets to discuss issues relating to the association’s membership. We ask that you not engage in any form of political action and that your members feel comfortable representing their institutions in representing", "The next Biennial should deal with “the changing face of the social arena and the ways that it may be affected by technology.”The nominees for the fifth version of the exhibition are:\n\n·       Anton Kern: The Ghost & the Stake.\n\n·       Carolyn Alves: The Road to Freedom.\n\n·       Christo and Janice: The Art of Making Place.\n\n·       Diana Alves: The Past Is a Collection of My Life.\n\n·       Juan Carlos Balsom: The Ghost & the Truth.\n\n·       Nathan Brindle: In the Fade.\n\n·       The Golden Flower.\n\n·       Adam Brach: The Abandoned Side of Life.\n\n·       Elena Cossu: The Shape of Things to Come.\n\n\nAfter a group of artists staged a protest against a new law proposed by the government in the Philippines in an attempt to curb abusive practices by certain industries in the country, the president signed legislation that will allow for criminal prosecution and stiffer penalties for individuals involved in trade and commerce violations.The controversial legislation was introduced by", "The next Biennial should be held in March 2021. It will host the first main exhibition of works by the new generation of artists, whose productions have been commissioned by the institution to date. The project will also facilitate the exhibition of the first solo exhibitions of works in the museum’s history.“We are extremely grateful for the support of our brave colleagues from the National Gallery and the National Museum of Fine Arts, Tokyo and our dedicated staff,” Tate director Maria Balshaw said. “With the opening of the new exhibition, we are excited to encourage and showcase the work of new contemporary artists, and those that have yet to be recognized. The new exhibition will also transform Diyabenji Gallery and the gallery into a premier contemporary art venue. I am especially pleased that the new program will draw from the expertise and talent of the great thinkers of the past. The next Biennial will bring together exceptional artists for the first time, and we look forward to welcoming you to the museum.”During the exhibition, the first exhibition of works by the new generation of artists will be presented by Hidenori Kawamura, who will first present a solo exhibition at the museum in December 2021, and will then present works by a group of young", "The next Biennial should be staged in 2020, and the 2019 event was scheduled to run from March to November. The theme for this year’s event was “Art and Death: From the Ground Up,” and the artist-run space was closed until March 21st. The exhibition will focus on the theme of death and how it intersects with art, with a view to the body politic. “We are grateful to the artists and the organisers of the exhibition who will continue to use the space of the exhibition to push the boundaries of the exhibition and to bring new material to the exhibition,” said Dusan Rubac, the director of the Art Market, in a statement. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Kimerly Aldridge as its next director. Aldridge comes to the institution from the Museum of Contemporary Art (MCA), where she has served as deputy director for the past four years, and will assume her responsibilities on March 16.“We’re delighted that Kim will be returning to Los Angeles and are grateful for the hard work she’s done to help MoCA project, grow, and define its mission,” said director", "The next Biennial should take place in the spring of 2021. It will be led by a group of contemporary artists and will take place at the Düsseldorf-Stuttgart campus of the University of Heidelberg. \n\n\nHispaniking italiano João Doria (1930–2017), a leading curator of East European art whose career spans more than two thousand paintings, photographs, drawings, sculptures, and films, has died at the age of eighty-two. The son of an Italian immigrant mother and a Pole father, whose artistic output spans from the twentieth century to the twenty-first century, Doria formed the tradition of the ''small, the micro, the medium, the microcosm, and the macro.”Born in Porto Alegre, Portugal, in 1932, Doria moved to the United States in 1949 to study with Robert Rauschenberg at Columbia University, where he received his bachelor’s degree in 1954. His art career began in the 1970s, culminating in “Luxurio Nuzzo,” a series of photographs, many of them of two women in a series of abstract paintings, for which he created a film of their bodies that he", "The next Biennial should be held in 2021, according to the organisers. \n\n\nAfter the Museum of Contemporary Art (MoCA), the University of Colorado Denver, and the Museum of Contemporary Art Denver, which both opened in 2017, formed the Future Fund in 2017, they were able to raise $6.2 million to begin the process of restructuring their endowments to take advantage of the exhibition-driven business cycle.“We are thrilled to announce the launch of the Future Fund,” said Maya Mendieta, director of the Denver Art Museum and the museum’s board chair. “With the development of the museum, we have taken an important step toward supporting the future of art by guaranteeing future-oriented investments. The Future Fund will continue to support the museum as it implements a new program that will support the museum’s mission to foster the latest and greatest research and scholarship.”Among the institutions that are currently participating in the Future Fund are the Howard Zinn Museum of American Art, which is working on a new interactive art experience, and the Louvre, which is redesigning its collection galleries to better support the exhibition of new works by artists. It has also committed to eliminating three hundred retail counter positions in its stores", "The next Biennial should take place in 2022, but the story of the exhibition and its exhibitions has not changed. The theme is “Art and the Body: Avant-Garde and Feminism” and its twenty-first-century exhibition biennials will be the on-going reflection of the former.For the first show that will focus on the artworks of the museum’s collection, “The Body in Art and the Body in Photo-Painting: The Biennial of the Body in Art and the Body” will open on October 3 and be on view until January 18. The next show, which will focus on the collections of the museum’s two former directors, Frédéric Seroussi and Adrienne Pape, will be on view from January 20 to January 22. The third show will focus on the collection of Marta Bonarà, the director of the museum from 2016 to 2018, and her husband, Luis Bonarà, in 2020. The fourth show will examine how the artworks of the museum’s collection can be reassembled and resold. The fifth show will examine how the collection can represent and expand the ideas of the museum.\n\n\nThe Museum", "The next Biennial should be held on the Island of Kauai in 2020. The first Diploma in Art History, which will be held in 2021, opened at the Museum of Fine Arts, Boston, in 2018. The exhibition was supported by a $50,000 gift from the Diploma in Art History Guild. The William T. Oehlen Foundation, the Sherwood Foundation, and the Rockefeller Foundation are among the philanthropic organizations that have pledged $1.5 million to the construction of new homes for the objects in the exhibition. The collection will also be featured in a new book about the exhibition, The Art of Theology, edited by Dr. Richard Reusch.\n\n\nThe National Gallery of Canada announced today that the institution will open an expanded digital version of The New York–centered installation More Times, which was staged in the gallery’s new ten-Story, twenty-fifth-floor location on the Museum of Canadian Art’s campus in Ottawa in March of 2020. “More Times was the first work to be staged in the gallery as part of a major renovation, and we are excited to continue its experiential experience through the launch of this new digital platform,” said Mark", "The next Biennial should take place in 2020 and will be held in the city of Bielsangkabau, in Wuhan, China.\n\n\nThe Kendal Winterthur Award, which honors outstanding contributions to American visual art due to the influence of the British artist Mary Lou Breguet, has announced that the fifteenth edition, titled “Surrounded by Clouds,” is now open. The biennial, which will be held in March 2020 at the Kendra Academy in Great Yarmouth, England, will be co-organized by the Kendal Winterthur Trust and London-based nonprofit Partners in Freedom. The event will be supported by the KAIST Foundation and the J. Paul Getty Trust, which together raised $300,000 for the project.“The prize has been established to recognize a critical and enduring contribution made by Mary Lou Breguet to American painting,” said Kendal Winterthur director and CEO Charles Augustus. “It is an honor to bring national and international artists together to celebrate her legacy and celebrate her vision for our visual art. We are proud to support her work in her final years in this country, and are excited to see what she will make of her work and", "The next Biennial should be held in 2021. For Peter Blum, the curator of modern art, the work of Saussy, Janssen, Huygens, and others in the history of photography is essential. “It is a shame that we have to leave behind these extraordinary pieces for another generation to see them,” he said.  [Update: March 8, 2:30 PM] The 30th anniversary of the exhibition has been added to the 2020 edition of the show. The biennial will now be held in 2021.\n\n\nThe National Gallery of Art in Washington, DC, has received a gift of 4,500 workstations and related materials from a family who donated them at the museum’s annual fundraising gala. The donation includes 3,500 photographs related to the museum’s museum-wide collection, which was opened in 1966 by former president Nixon’s Secretary of Education, Arne Glimcher.Glimcher, who died in 2014, gave the institution a collection of more than 2,500 photographs, including the National Endowment for the Arts’ '70s “Driven by Glimcher” and “Alice Cooper & the Seven Dwarfs,�", "The next Biennial should take place in 2020 to mark the centenary of the publication of the first issue of the International Marxist-Leninist Magazine, The Communist. This will be followed by The Fifth International, the first international publication that explored and debated Marxism-Leninism from a Marxist-Leninist perspective. The event in 2020 will focus on the international proletariat, with a view to the international communist movement, and will be hosted by the CNI in partnership with the museum. The exhibition will be organized as an extension of the exhibition Biennial Shanghai, held every other year in the city from 2019 until the spring of 2021. The event will also include an online version, which will be hosted by us. The inaugural exhibition will include a selection of work by thirty-two artists, including Sally Potter, Sam Smith, Jinz Cooney, Hannah Wilke, Laurie Boesky, Sasha-Anna White, Karin Glidewell, and Timur Gebber. The exhibition will be open on Monday, 28 November, 2017, from 11 AM to 6 PM. Steven Nelson Gallery will present the second edition of the Kino Biennial, “A", "The next Biennial should be held in the spring of 2021, and the first exhibition should take place in the fall of 2021.For the South Asian art community, the timing of the event is crucial. London’s Art Gallery and Tate have already announced that a new edition of the annual Art Basel show will take place in the spring of 2022, and the ECB’s board had previously said that the show would be staged in August.The decision to postpone the event, which is integral to the development and promotion of Indian art, has raised serious concerns for the future of Art Basel. In a statement on Thursday, the fair said “we are still evaluating the possibility of postponing the 2020 edition. This will take into account the current situation and the case of the exhibition, as well as the wishes of the staff and the audience.” According to Artnet News, the exhibition will still be held, but fans will not be able to attend.The announcement of the postponement came amid events that have seen South Asian art fall victim to the ongoing health crisis crisis in India and Pakistan. India has reported that it has lost more than one hundred people to the virus, with the death toll currently at 1,000. The number of cases", "The next Biennial should take place in 2020, and the last in 2022. Alexander Skarsgård, director of the Metropolitan Museum of Art, New York, told the Art Newspaper that the Museum had been considering the possibility of a redesign for about a year, but that the institution lacked the funds to execute a thorough study before deciding to reposition the show. Writing on Twitter, Skarsgård said: “I am really excited that the museum finally accepted my proposal for the 2021 iteration of the Biennial. I’ve been working on a new, bold reimagining of the museum for years. What I’ve done is ambitious, innovative, and exciting. It’s a project that will allow us to come together and reflect on the themes of the past twelve years.”\n\n\nThe Metropolitan Museum of Art (the museum) in New York announced today that it will open its new $450 million David K. Gallaudet, Jr.’s (D.K. Gallaudet) Gallery of Modern Art in the summer of 2021. The new venue will be named after the late British artist, and will boast new works by twenty-three artists, including John Akomf", "The next Biennial should be held in 2018, and the theme should be “The Unseen.” The event will also be hosted by the Art Institute of Chicago and the Museum of Contemporary Art Chicago. The 2019 event will take place at the Art Institute of Chicago.\n\n\nThe United Kingdom is preparing for a major economic collapse and a massive influx of migrants from Africa and Asia as a result of the coronavirus. The government is expecting the health of its population to fall by 90 percent by March 19 and has already begun phasing out social support services and is preparing for riots.Within hours of the coronavirus being declared “deadliest threat to Europe since World War II” being declared by Prime Minister Boris Johnson, Britain underwent a major social distancing campaign. The government ordered that all visitors to major sites such as Whitechapel, the Palace of Westminster, and Westminster Abbey must remain at least twenty minutes away from the institution and seventy feet away from populated areas. The government has also banned large gatherings of more than five hundred people. While the number of people infected with the virus was only twenty-six people on Thursday night, there were reports of cases as high as two hundred on Friday.Since coronavirus was first identified in", "The next Biennial should concentrate on the work of the contemporary artists, of whom there are now more than twenty-three thousand, in the years immediately following the event’s founding in 1967. The program should also consider the ways in which art and life have undergone significant transformations in the last sixty years—for artists, the changes have been profound, and the biennial is a means of reassembling the entire history of art.\n\n\nWith the recent closure of the Ritz-Carlton in Tokyo and the impending departure of Yoko Ono, the museum has announced that it has suspended the exhibition “Theater of Operations: The Gulf Wars 1991–2011.” The exhibition, which focuses on the conflict between Iraq and Iran, was scheduled to run through January 16, 2020.The fifteenth edition of the Ritz-Carlton, titled “Theater of Operations: The Middle East, 2011,” was curated by the Israeli curator Yair Hochner and the Iranian curator Ali Akbar and was curated by Yuki Shindō. The exhibition will now be hosted by the Israel Museum in Jerusalem, which will stage the first show of the show at the Ritz in 2020.The twenty-second edition of the R", "The next Biennial should be in April 2020, with the exhibition scheduled to run for eighteen months. The announcement came just ten days after the exhibition was moved to September 2020 and the exhibition, which was scheduled to be staged at the Pfalzkirche in Berlin, was rescheduled for March 2021.The exhibition—which was originally scheduled for March 2019—was rescheduled for April 2021 following a change of plans regarding a new exhibition. The prize is intended to examine the work of the artists featured in the show, focusing on the themes of suffering, loss, betrayal, and artifice. The show, which premiered at the Düsseldorf Kunsthalle in April 2019 and was supposed to be held in March 2020, has been rescheduled for a second time. The first iteration of the show—originally called “The Golden Triangle”—was held at the Kunstall aus Berlin (Kunstraße) in March 2017. The event was part of a group show that explored the concepts of “melancholia” and “double vision,” with Damien Hirst, Anna Atkins, and Michael Ondaatje, with the exhibition entitled “The Golden Age”", "The next Biennial should be held in the autumn of 2021. \n\n\nThe Museum of Art in New York has appointed the urban designer and urban designer collaborator Josh Klawiter as its next director. Klawiter comes to the institution from the University of California, Berkeley, where he has served as the director of design for the past three years. He succeeds Devendra Phulka, who retired in March after eighteen years at the helm of the institution. During his tenure, Klawiter spearheaded the redesign of the Museum of Modern Art, which is currently undergoing a $100 million expansion, and oversaw the construction of a new pavilion for the Whitney Museum of American Art.“Josh brings considerable experience and vision to the Museum of Art, and it is my honor to serve with him in his new role,” said Elizabeth Adams, director and CEO of the Museum of Modern Art. Klawiter previously served as a senior curator at the Whitney Museum of American Art and as a curator at the Brooklyn Museum, where he was head of curatorial projects; worked as a curator at the Museum of Modern Art and at the Santa Monica Museum of Art; and served as chief curator at the DuSable Museum of African American Art in Chicago.", "The next Biennial should take place in the spring of 2022.\n\n\nThe National Geographic Society’s headquarters in Washington, DC, has been evacuated as tens of thousands of workers prepare to descend upon the institution for a pivotal showdown between the fossil-fuel giant and climate activists. While the building is not currently threatened by the ongoing protests, the National Geographic Society has been forced to move the 2020 edition of its annual Discovery Institute exhibition, “Discovery: The Art of Climate Change,” from its May 26 opening, citing safety concerns. “This was not an issue of engineering; it was an issue of human compassion and safety,” said Tom Fass, deputy director of the National Geographic Society. “This is the most important exhibition to date that will explore the science of how the climate system is changing and how we can adapt to prevent and adapt to prevent.”The May 2020 issue of the magazine featured a statement by anthropologist and climate scientist Christiana Figdor, who called the protests a “wake-up call.” While the statement was meant to be a rallying cry against the climate crisis, it was taken out of context. Figdor said that the launch of the exhibition was not a “", "The next Biennial should take place in 2020.\n\n\nCultural Producers for Change (CPM) is launching an initiative to support and encourage artists in the UK to secure greater financial and political support as a result of the coronavirus pandemic. The new prize will offer up to $5,000 for works in artistic practice. In addition, the organization will create a new fund for the production of contemporary art, and will publish a new set of guidelines on how the funds can be used. The new initiative, which will be launched as part of the Center for Contemporary Art (CCA) at the University of Sheffield, is part of a wider cultural strategy to support the arts and cultural sector as a whole.CPM also announced the launch of its new Guardian Artbox, a platform that will provide artists with new ways to communicate with others and communicate directly with their own communities. The platform will offer a range of tools, including tools for artists, artists-in-life, and the artists-in-photos, as well as an online community that will provide inspiration and support. The platform can be found at www.cpm.co.uk/guardian.As part of the Guardian’s project to increase the financial and political", "The next Biennial should be held in 2021.  The festival will celebrate the goddess of love, Pan and will feature work by contemporary artists and thinkers to promote the theme of the year and the art of the year. The theme of the year is Love and the Biodiversity Crisis. The biennial will also explore the role of culture in shaping and resolving social issues such as environmental justice, climate change and the environment, and the work of cultural creatives will be featured in the exhibit.Commenting on the new partnership, Rachael Red Star, curator of contemporary art at the Biennale, said: “We are honored to be working with the Art Museum of Liverpool to provide the 2014-15 season a unique and relevant theme. Pan’s vision speaks to the heart of what the museum is and will continue to be about: our shared history of collaboration with other institutions and organizations, the breadth of our collection and exhibition program, our artistic and educational goals, and our commitment to supporting the biennial as a whole. We are eager to continue engaging with Pan and to build on her legacy of inspiring and bringing new perspectives to the museum.”\n\n\nThe Hon. Sujatha Prasad Mookerjee, former director", "The next Biennial should be held in the second quarter of 2020, according to a statement from the commission. The second round of the event, which will be hosted at the institution in May 2021, will be held simultaneously with the first. “It was a real pleasure to collaborate with the team at the Museum of Contemporary Art in Los Angeles and the staff of the biennial,” said Hernán Díaz, director of the museum. “We look forward to continuing our work together and to developing new and interesting ideas.”The institution has been working with artist and curator Khaled Desoura, who represents Egypt, to create a new exhibition, “The Image of Egypt,” which will be curated by Victoria Miro, “near future,” at the museum. In the exhibition, which will highlight the work of twenty-seven Egyptian artists, the seventy-four works from the Egyptian Museum in Cairo, the Egyptian Studio, and the Egyptian Museum at the University of Applied Arts (A.A.U.), and will run sometime in the coming months, the artists will introduce new perspectives on ancient Egyptian art through their works.The exhibition will be organized in the same way as the bi", "The next Biennial should be held in June 2020. \n\n\nAn exhibition of works by twenty-four artists and collectors in the Philippines is currently on view at the Palawan Museum of Art in Manila. The exhibition—which is curated by artist and collector Tungwila Rumbaugh—was organized in partnership with the Filipina feminist group Bambang Yayas ng Pagadores (BYP). Titled Citing the experiences of their lives, the artists argue that the contemporary art of the Philippines is largely made by men and that women are excluded from certain fields, such as architecture and science.“We are artists, we are intellectuals, we are artists,” the artists said in a statement. “We are artists because we are artists we are artists in the truest sense of the word. We are artists who use the art of our own lives and the art of other cultures to make art that reflects our own values as Filipinos.”Bambang Yayas ng Pagadores, a grassroots feminist organization founded by Shariffa Juma, was formed at the age of twenty-four by a group of Filipinos in the city of Cagayan who were inspired by the work of female artists in", "The next Biennial should take place at the National Gallery of Art in Washington, DC, in 2022. The twenty-first was posted on Instagram by artist Ai Weiwei and will be judged by the same committee responsible for the first exhibition. The exhibition will consist of thirty-seven works by twenty-six artists, including Marian Kawasaki, Tunga Ki, and Louis Duplain, and will open on November 21. Previously announced artists for the Biennial include Ming-Fat and Bao-Mei, who will represent China in the first exhibition of its kind at the museum in 2017, and Cao-Mei, an American artist who was selected for the first solo exhibition of his work at the Museum of the American Arts in 2018. The Biennial will be hosted in the National Gallery of Art from November 19 to November 21, 2021. The National Museum of China in Beijing will also host an exhibition of Chinese art in January 2021. The National Museum of Art, Taipei, has announced that it will stage an exhibition of Chinese art in January 2021. “This is the most challenging moment for us, since this is the year that marks the beginning of the Cenotaph,” Chris", "The next Biennial should be held in the fall of 2022.  “The CNE is a unique and central institution,” said Marcia Angell, London’s director of the CNE. “We are delighted to be able to present the new exhibition ‘Country & City: The CNE Exhibition,’ which will be a core part of the next biennial and will also be a platform for new ideas and discussions, and to have the opportunity to collaborate with the many amazing practitioners in the field.” The 2017–18 edition, which opened on February 2, drew 1.7 million visitors to the arts space and other venues in London and the United States.\n\n\nThe Whitney Museum of American Art in New York and the Solomon R. Guggenheim Museum in New York announced today that they are collaborating on “A Nation at War,” a project that will span several decades and delve into themes of racial identity and the legacy of the Confederacy in the United States. Titled “A Nation Laughs at Our Racial Pride,” the exhibition will feature work by forty-two artists and will be on view in the Whitney until September 9, 2022.The partnership between the two institutions", "The next Biennial should be held at the Helsinki Museum of Art in August 2020. The next edition will focus on art from the nineteenth century to the twentieth. The theme of this year’s event will be “SOCRATES IN ART.” “We are thrilled to be supporting the Museum of Contemporary Art (MCA) Helsinki in its effort to present an exhibition of the greatest contemporary art by the sixteenth century master and masterpieces by the seventeenth century masters,” said Jussi Tappala, the chairman of the board of trustees of the institution. The biennial will also include the release of the first volume of the new exhibition series, “SOCRATES IN BIOGYNMS,” and the exhibition of the first works by the artist Jussi Risto, Samantha Bee, and the alliance between artist and museum.Even as the MCA’s collection of contemporary art is growing rapidly, the museum is also working to redevelop the old building. The renovation is expected to cost around €5 million and will be completed by the end of 2020. The decision to open a new building, designed by the local and state-owned firm", "The next Biennial should feature the work of forty artists chosen by the institution. The forty-six-hour long exhibition will be divided into twelve sections and will run from March 22 to March 26.The exhibition will feature work by twenty-six artists selected for their excellence in their respective categories from the last three years\u0097from 2017 to 2019. Titles for the 2020 edition include “Pérez-Labrada: Avant-Garde Painting in Cinema” (2018) and “Slámon: Avant Design in Cinema” (2019).The biennial’s theme, “Pérez-Labrada: Avant-Garde Painting in Cinema”\u0097an attempt to re-create the legacy of the Spanish artist Íñigo Labrada\u0097was inspired by the famous painting, “Día de César,”1936, by the Mexican artist Íñigo Alejandro Baro. The project also included the collaboration between the artists to create a set of figurative drawings that re-create the past through the “struggle for existence,” as Alejandro Labrada put it in a 2018 interview with the New York Times.The", "The next Biennial should begin in May and conclude with the exhibition in October. Research and programming will include performances by artists such as Steven Schofield, Steven Sassoon, and Harriet Weems, and will be augmented by an ensemble of artists, including María Berrío, Ruvan Wootton, Diana Alighier, Vico Mollino, and Mickey Hart. The museum will also host a number of exhibitions that examine contemporary art and its relation to the natural landscape, including a discussion with Kiersten Markle, a German artist whose design’s installations include works on paper and cardboard, as well as works on paper and watercolor.  The inaugural show in the new venue will feature work by William Eggleston, a British artist who explores notions of memory, migration, and the natural world through charcoal drawings and photographs.Artnews reports that the Biennial will not form part of the 2020 edition of the Venice Biennale, which will be held in March and take place at Santiago from October 16 to November 12, 2020. Instead, the venue will reopen to the public in March 2021. The biennial will be led by", "The next Biennial should be in 2022. The DVC will then host the biennial, “Ateliers du Dauphine” (2020), at its new location on West Thirteenth Street in New York.The exhibition will host a new work by the Swiss-born, New York–based artist Valérie A. Peña, who was appointed curator of the forthcoming edition in June. Peña will unveil the work at the DVC in the fall of 2020.\n\n\nThe Museum of Modern Art (MoMA), which is currently under construction in the Bronx, New York, has received a total of $50 million from the Katzenstein and Rockefeller philanthropies since it opened in the former factory area of the Bronx in 1969. The funds will help pay for construction costs, furnish funds for exhibitions, and for the development of the Bronx Museum of Art, which is currently constructing a new venue to house its collection of more than six hundred works.The Rockefeller Foundation also established the BEN EDWARDS MAXIMUS DERICKSON Fund for Arts and the Humanities, which is currently raising funds for the renovation of the Walter de Maria Theater in Harlem, New York; the CELESTE AND MAY", "The next Biennial should be held at least ten years after the original event. \n\n\nThe Ponti Institute in Milan has received a gift of fifty-six works by Spanish artist Luis Buñuel\u0097two of which were previously on display at the institution. The gift, made by wealthy collector Michele Ciretti, includes a selection of paintings created in the 1970s and 1980s that were on display in a retrospective of Buñuel’s work titled “Buñuel: Nineteen Eighty-Six.”“The gift of these works is a great honor and a great honor for the Ponti,” Leonardo Haddad, the director of the Ponti, said in a statement. “Buñuel: Nineteen Eighty-Six, a series of paintings that illustrate Buñuel’s main content for the series, is a controversial and one of the most well-known paintings in the series. It is a masterpiece, of its own type, and deserves to be experienced by the whole world.”The exhibition opened in the museum in 2013, and the series was selected by a group of historians and curators, including Roberto Cicutto, Roberto Cicutto & Andrea Stefanoni", "The next Biennial should be held in 2021, and the inaugural exhibition should be presented by the Museum of Contemporary Art (MoCA), New York; the Museum of Modern Art, New York; and the Ministry of Education, the Museum of Modern Art, and the Arts, the Museum of Modern Art, and the Science Museum, the Museum of Modern Art, and the Arts, the German city of Baden-Baden.  The plan was first announced by architect and curator Wolfgang Reichert, who is also active in the arts, in an interview with the German magazine Der Tagesspiegel in October 2018. In order to ensure the biennial would be a success, the organizers are working to raise $50 million for the construction of the venue, which will be inaugurated by a new exhibition and a reconstruction of the Grand Museum Luzern in Vienna. The Grand Museum Luzern, which was completed in 1986 and has recently been restored by the German city of Bonn, will be inaugurated on September 29.\n\n\nThe Ponti Foundation in Venice and the Milan-based artist-run nonprofit Artopoli, which receive $1.3 million each from the Italian government for their work in the city, have emerged as the", "The next Biennial should focus on “what it means to be a Mexican American.” For Guadalupe, the exhibition is “about reclaiming the history of the Americas\u0097which has been erased over the past fifty years.” The next edition of the event will take place in 2021.\n\n\nThe estate of the late American filmmaker Leon Black, who popularized the term “cult cinema” in a 1970 essay for the Art Newspaper, has settled a wrongful death lawsuit over the actor’s death. The family of the late director of Scream Factory, Damon Dash, and their lawyers received a $4.25 million settlement from New York’s District Attorney’s Office in April 2018.In a statement, the family thanked New York’s Department of Cultural Affairs for acting on their “deep concern and concern for the safety and well-being of our loved ones and the many outstanding artists who have made seminal contributions to the cinema.”The family’s lawyers said the settlement “comes as a complete relief to those whose loved ones and well-being are devastated by this tragic loss. We are pleased to have reached a resolution with the government of New York and hope that this action will", "The next Biennial should be launched at the same time as the current one. Requests for a new exhibition should be addressed to the Board of Directors of the Biennial or to the Deputy Directors of the Biennial. The Art Newspaper of the University of Groningen invites all the participating artists to the next Biennial.Go to the Biennial website. \n\n\nThe Paris-based nonprofit foundation Modern Art Past (MAUP) has received $4.2 million from the Christie’s auction house in an attempt to secure the future of the Sackler name in New York City. In a deal that will also send a strong signal about the future of the twentieth-century American modernist movement, the foundation will receive $4.3 million from Louvre director Christian Lenz; $4.4 million from conservators Lucio Albani and Valeria Boccolacci; and $1.9 million from artist Peter Dreher, who created the iconic Picasso-like abstractions of 16 of his most famous works.“We are so pleased with this outcome, in this case for the good people of New York,” Robert Siegel, chairman of the foundation, told Artnet News. “MAUP is a cherished", "The next Biennial should be announced in the second quarter of the year, we are confident that the project will continue to generate interest in the work of the Central and Western Photographers. We look forward to furthering our collaboration with B-POP in making our next exhibition successful.\n\n\nThe Museum of Fine Arts (MFA) in San Francisco has named Jessica Morgan as its new executive director. Morgan comes to the institution from the Galerie Lelong in Paris, where she has served as the curator of contemporary art since 2013. She succeeds Martine Dubois, who has led the museum since 1997, and will begin in her new position on January 16.“Jessica is an exceptional curator, a world-class organizer, and a genuine visionary who has shaped the MFA into one of the most exciting and influential contemporary art institutions in the Bay Area,” said Tom Kim, chair of the board of trustees. “We are deeply honored to welcome her to the MFA and look forward to working with her. Jessica brings extraordinary curatorial and artistic talent and proven ability to our institution, and we look forward to working with her.”Among her curatorial projects for the upcoming season, which will run from January 11–January 20, 2019", "The next Biennial should be held in the spring of 2021; the biennial will be held at the Arrhenius Campus, in the town of Arroz, in the Illyria province of Illyria, Italy.The next retrospective will be staged at the Institute of Contemporary Arts, University of Cambridge, in the United Kingdom, in the spring of 2022; and the biennial will be staged at the Orde della Scala, in Venice, in the fall of 2022.In a press release, the museum said that the current exhibitions and programming are not suited to the \"irrational and demanding\" conditions of the exhibition space and that the core of the biennial will be “mapped out in a way that is interactive, not static.” The press release also noted that the exhibition will take place at a “feasible and relevant crossroads,” in a time of great uncertainty for many cultural institutions and organizations.\n\n\nThe Jujitsu Foundation in New York has announced that it will no longer receive funding from Japanese companies. The decision came after the Japanese government approved a $3.4 trillion stimulus package in December. Under the package, which aimed to reduce the country’s dependence on imports and spur", "The next Biennial should be held in the second half of 2021, but the organisers are not currently prepared to announce a date for the event.  The Organizing Committee added: “Since the project is a collective effort between many arts and cultural organizations, it is important for them to work together for the good of the entire community, and for the preservation of all the natural assets of the site. We hope that the future members of the Biennial will be able to work together and for the good of the community.”\n\n\nThe Museum of Modern Art (MoMA) in New York has commissioned artist Chris Addario to create a new program for its upcoming exhibition “Theater of Operations: The Gulf Wars 1991–2011,” which will open on September 17. Set to take up the theme “Theater of Operations: The Gulf Wars” next month, the six-week exhibition will take up themes of the Gulf Wars in the context of the ongoing “war on terror,” as the United States and its allies continue to wage a war on terrorism, the Middle East, and people in general.The exhibition, part of the museum’s reopening plans, will often feature contemporary artists who depict the theater", "The next Biennial should focus on the indelible mark made by the work of the participatory artists in the forthcoming seventy-third edition of the biennial. The decision was made after demonstrations of the exhibition “more than fifty years in the making, and with the full cooperation of the participating artists.” The show will be held in the exhibition space Art Basel Copenhagen from November 24 to December 14 and will be hosted by the Danish director Lars-Erik Mette in conjunction with the exhibition “Reality in Motion” at the Fondazione Adrienne Halse, which will be closed until January 3, 2020.Following the exhibition “Reality in Motion” in 2002, the biennial moved to a new exhibition space at the Institute of Contemporary Arts in Milan. The event was relaunched in 2008 by the Danish artist Lars-Erik Steen, who is known for his earthworks such as the Les Demoiselles dans l'Avignon (1967) and the “Arts of Life” (2011). The same year, the exhibition hosted the retrospective “Serious Rock and Roll” (2014); “Lévy Gorvy,” which contained", "The next Biennial should be held in 2022.\n\n\nMariner Kemper, the chairman and CEO of the private equity firm Apollo Global Management, was indicted on Monday on thirty-six charges by a New York grand jury, the New York Times reports. The seventy-seven-count indictment accuses his former employees of stealing $42 million from Kemper and his family between 2008 and 2013.Kemper was indicted on twenty-one counts, including conspiracy to defraud the government, conspiracy to commit theft by deception, and theft by deception, and was not charged for money laundering or tax evasion.“Apollo Management was charged with a very serious charge of money laundering, which is a major blow to the company,” said Michael R. Johnson, a lawyer who has represented clients who were allegedly defrauded by Apollo. “Those charges should have been brought sooner.”The indictment also accuses Apollo employees of falsifying company documents and falsifying tax returns.“These charges are serious enough that the government has to take them seriously,” Nicholas Spero, a lawyer for the government, told the New York Times. The defense has filed a motion for a summary judgment hearing, which can suspend or even criminalize", "The next Biennial should provide a platform for the work of local and international artists, and will focus on “political, cultural, or personal observations.”The decision to hold the first exhibition in the United States was made in April 2019. It was planned for the Museum of Contemporary Art Atlanta, which has a permanent collection of approximately 3,500 works by twenty-seven artists and collectives. The new exhibition, “Living on the Edge,” will open on September 27 and run until December 6. The museum will also present a series of performances, films, and other events in conjunction with the exhibition. \n\n\nThe Philippine Daily Inquirer has revealed that the country’s Culture and Art Museum (C&AM) will soon hold the first art-filled museum in the country’s history. Located at the Sands of Manila Bay, the new museum will boast galleries devoted to contemporary art works by artists such as Pedro Almodovar, David Alvarez, Hélio Oiticica, and Rene Maghery, among others.Led by executive director Irae Alvarez, the organization behind C&AM, and whose wife, Irena, are the sole owners of the venues that will house the museum", "The next Biennial should coincide with the upcoming iteration of the 'Art of the Art of Man Latin America' exhibition, which will take place in the capital from April 18 to April 22. The last edition, which was held in Buenos Aires in November 1997, was staged on January 24, 2020. The announcement of the theme was made by Artista, the newly formed, nonprofit organization that represents the artists who make up the Buenos Aires art scene. The organization selected the six finalists, which included Vivian Hernandez, Adriana Varejola, Jorge Sola, and Fernando Armas. The artists will be chosen for their ability to introduce a new and important concept to the art world. “The exhibition is a collaboration between the artists who have chosen to showcase their work in the Biennial, and the artists themselves, to conceive a new kind of visual arts, to create exhibitions that are open to the public, and that are organized around themes that are relevant to them,” said Artista director Vincent Simon. The 2019 edition of the Art of the Art of Man Latin America, which screened eight artists who comprise the group Adriana Varej", "The next Biennial should be dedicated to the preservation of life. “In the name of all those who have spent time, effort, and energy to help us, we invite you to join us, to appreciate this extraordinary collection, and to remain involved with art and culture in general,” said Savits.About the Biennial, the artist said: “In the midst of an epidemic epidemic, I decided to use my practice to create a platform to critically engage with local, regional, and national movements. I hope that this project will allow me to begin to address the questions behind the works of the early 20th century and to continue to challenge the entire world to think differently about art.”\n\n\n\n\n\n\n\nNicoletta and James Meier, The Cat and the Mummy: The Art of Making People Laugh in the Face of Death (2013), Courtesy of the Max Hetzler Foundation.  (New York: Max Hetzler Foundation, 2014). \nNicoletta and James Meier, The Cat and the Mummy: The Art of Making People Laugh in the Face of Death (2013), Courtesy of the Max Hetzler Foundation. \n\n\n\n\n\nNicoletta and James Meier, The Cat and", "The next Biennial should take place in December 2021. A statement issued by the organization said that its decision to suspend the exhibition was not related to the coronavirus. The five-day event will now be held in March 2022.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles plans to move its 2018 edition, “The Material World: Art from the Body,” from April 27 to May 4, 2020, in an effort to further integrate new works by the artist Mae West into its exhibition program. The effort was made in an attempt to align with the California Museum of Art’s initiative to eventually incorporate 40 percent of its output into one mega-collection.The announcement of the redesign was made this morning, March 26, at a press conference at the museum, which is currently undergoing a $100 million expansion. The renovation has added galleries, classrooms, and studios, as well as new public spaces including the new plaza, the public terrace, and the east terrace. The renovation also increased the museum’s capacity by 5,000 square feet.A retrospective of West’s work, “The Alchemist” (2019), which opened at the Los Angeles County Museum of Art, is scheduled to open", "The next Biennial should be held in 2021.\n\n\nThe Mondrian Museum in Paris has appointed Hamza Afture as its next deputy director and chief curator. He is the first person to hold the post since Seung-Min Lee stepped down from the helm of the institution in March 2021. Afture will assume his post in January 2022, and will assume the role in February 2022.Afture will be responsible for fostering the role of art in contemporary life through a history of art-making that would unfold across more than six hundred artworks, recreated in an exhibition space, and organized into a biennial. He will assume his post from Pierre Huyghe, who has served as the Mondrian’s current director of exhibitions since May 2019, at a ceremony that will be held at the Mondrian on January 31.“We are delighted that Hamza has chosen to assume the key role of managing director and curator of the Mondrian,” Gerard Wintén, the museum’s director, said in a statement. “Having worked closely with him, we believe he has the skills and the temperament to move the Mondrian forward as a truly international museum. We are nonetheless very much looking forward to working", "The next Biennial should not be a step backward, a step forward, or a step back, but rather a moment of realization. . . . And empowerment.”\n\n\nThe Museum of Russian Art (MRA) in New York has appointed Adriana Contostano the new chief curator of the collection. Contostano will assume her responsibilities on January 3, 2020. She succeeds Karen Luegher, who was hired as deputy director and curator of the collection in January.“We are thrilled to welcome Adriana to the MRA,” said museum director Edward DeMar. “Adriana has been an ardent supporter of the collection and our exhibitions since she began as deputy director and curator. She has been instrumental in both the acquisition and expansion of the collection, including the construction and renovation of the new space in the former USDA’s headquarters in Brooklyn, and has continued to help guide and shape the MRA collection through the years.”Luegher previously served as deputy director of the collection and exhibitions and as chair of the board of trustees of the New Museum. She was the recipient of the Philip W. Rose Award for Outstanding Curating in 2017, the Simon Progress Prize for Curating in", "The next Biennial should take place in the heart of the city, in the old City Hall, which is currently being restored. The Exhibition will be a platform for the artists of Chicago to present their works in an exhibition that has the potential to be a test of the City’s commitment to diversity and inclusion in the arts. The Biennial has selected five artists for the award, including Mary Anne Wilson, Tanya Bonakdar, and Jane Panetta. The five finalists will compete for the award, which is given each year to a contemporary artist from the Chicago region.\n\n\nThe National Gallery of Canada in Ottawa has received a gift of fifty-nine works from the Kino Foundation. The works, which were donated in 2013, 2014, and 2017, were acquired through the Kino Foundation’s Committee for Modern Art (CMA) grant program. The gift includes works by artists such as Jean-Michel Basquiat, Susan Potter, and Theo van Doesburg.“This is an exceptionally strong year for arts and culture, and we are thrilled to be able to provide more support to the National Gallery of Canada through our annual Kino Foundation grant,” said Michael Kynaston, director of the National Gallery. “", "The next Biennial should be held in Beijing in 2022. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it is planning to open a new chapter in its long-standing partnership with the American Ballet Theater (ABC) in 2020. The theater’s current exhibition “The Book of Life” will remain on view through March 23, 2020, and will remain closed during the first ten days of the festival\u0097the first show of the new series, “The Art of the Show,” will open on March 23. The partnership will also extend to more than twenty other productions, including the upcoming HBO biopic The Book of Life, which will feature contributions from several of history’s most distinguished choreographers.Inaugurating the new series, the show will showcase new works by artists such as David Kordansky, Tanya Blavatnik, and Anna Atkins. In addition, the two organizations will collaborate on the launch of the new MoCA Digital Archive. The archive will contain around three thousand works by over twenty-five artists, including Nancy Riley, Diana Ross, and Laura Owens. In a statement, MoCA said: “When we first launched the archive last", "The next Biennial should be held in 2022 and will organize a total of twelve exhibitions. “I was inspired to create this exhibition as a way to honor the memory of the late artist and her husband, Sittar, who were instrumental in introducing me to photography in the early 1980s and helping me to realize my dreams of becoming a photographer,” said Alex. “By collecting his photos, I hope that by organizing the exhibition, it will inspire others to think critically about photography and how they can be used to further our understanding of the world.” The exhibition will feature forty photographs by sixty-two contemporary artists who were working in the late 1960s to the late 1980s. The artists selected for the exhibition include Agnieszka Magers,  The Three Sisters: Danni Glimcher, Bela Karoly, and Luzia Lussani. \n\n\nFollowing the devastating fire that destroyed the B.P.R.D.’s historic downtown headquarters on April 12, 2018, the Los Angeles County Museum of Art (LACMA) is planning to move the institution’s collection of the artist’s works, which include works from the collection of Samuel", "The next Biennial should have the opportunity to present the first exhibitions devoted to the history of the museum’s collection in the United States. The exhibition will be curated by Elissa Bouma, curator and director of contemporary art at Haus der Kunst, Munich. In the January 2020 issue of the magazine of the same name, Julián Zugazagoitia wrote: “The Biennial is experiencing a moment of renewal. The show will continue to be a powerful and indelible tribute to the Biennale and its rich traditions.”\n\n\nThe Museum of Contemporary Art (MoCA) in San Francisco is planning on closing its doors permanently following it’s fifty-fifth edition. The decision was made after MoCA’s board of directors voted unanimously to terminate its contract with Pacific Standard Time, the nonprofit art organization, in March 2019. During the board’s meeting, which took place on Wednesday, June 23, the board chair, Edward Lebow, stated that the decision was made in light of “the current state of the art of contemporary art.” He also noted that the current state of art was “not sustainable.” Despite the board’s recommendation", "The next Biennial should be held in 2022. After the 2019 event, which established the Museum of Contemporary Art Tokyo, the biennial was moved to the Tokyo Metropolitan Museum of Art. Its next exhibition, titled “Roots of Beauty,” will open in the spring of 2021. \n\n\nThe Museum of Art in the City of New York has announced that it is planning to open a new public art space, the Museum of Art for Public Spaces, in the city’s Hudson Yards neighborhood in the fall of 2021. The new space will be named after the Victorian architect, Grosvenor Mather, and will feature forty-five works by eighty-three artists, including Pablo Picasso, Jean-Luc Godard, Mark di Suvero, and Edvard Munch, as well as a large-scale installation of forty-four works by artists working in the contemporary art tradition, including Francis Pérez-Reina, Bruce Talbot, and Iris Hines.“The Mathero Gallery is a sustainable community, a collaborative space that aims to advance the Mathero principle of transparency and accuracy,” said David M. Mather, the museum’s director. “Mathero", "The next Biennial should take place in Warsaw in the spring of 2021, alongside the Spring/Autumn exhibition. The first edition of the exhibition will be held in March 2020. The second will be held in April 2020; and the third in July 2020.The biennial will include more than three hundred works by seventy-three artists and will be held in various venues, including the Warsaw Bibliothouse, the Museum of Polish Art, and the Academy of Art. The show will open on May 27.The biennial will be organized by the University of Warsaw and will run as part of the biennial calendar and the upcoming Sixteen Years of Polish Art. The biennial will commemorate the seventeenth anniversary of the exhibition and will include a number of shortlisted artists. The nominees for the prize include Adam Czarnow, Theoretical Computer Game Programmer, Space, The Sol, Landset, Arzenale, Splinter, and Architectural Fiction; artists whose work is housed in the Museum of Polish Art: Aleksandra Kisela, Theodoros Likou, Jochen Eisendrath, Józef Pfeifer, Pia Koonin, Ymir Zbikowski, Micha", "The next Biennial should aim to draw attention to how artistic life is impacted by climate change, and to how art communities can work together to address climate change, and adapt, to prevent, mitigate, and respond to climate change. I hope that this year’s edition will mark an important step in this direction. “Culture will continue to be central to the future well-being of our planet and its inhabitants,” said Francis Noth, director of the Australian National Gallery, which is already working with the National Union of Students to improve living conditions on campus; director Kristina Kulkarni; and daughter, Miku-Jean Kulkarni.  In a statement, the Australian National Gallery said: “This is an unprecedented and challenging time for everyone involved in the art world, and we are working hard to plan for and manage this risk. As a public institution, we are also working with the government to consider how we can help our artists and staff cope with these changes and more. The Australian Human Rights Commission has been working with the government to examine the implications of climate change for Australian cultural heritage and our institutions, and we hope that this year’s edition will draw attention to the international", "The next Biennial should be held in 2021, and the next will be held in 2022.”\n\n\nThe Institute of Contemporary Arts (ICA) in London has appointed Matthew Haber as its new executive director. He comes to the organization from the London-based nonprofit Art Fund, where he serves as a consultant.The institute, which is housed within the Art Fund Gallery, has hosted many major exhibitions over the years, including the first-ever international exhibition of work by the newly formed British collective the Odesza Project. The exhibition will feature works by thirty-five artists, including Hilma Nimi (with Mark di Suvero), Dina Ghebaly (with Joachim Neugroschel), and Junya Ishikawa (with Michele Kaba), and will run concurrently with the upcoming nineteen-thousand-seat Royal Shakespeare Company production of Julius Caesar, which is scheduled to open on June 7.“Matt’s background and experience in contemporary art and his excellent understanding of the local and international art community are highly desirable in a challenging and innovative environment,” said Thomas Fairs, director of Tate. According to Artnet, the institute will receive $24 million from the sale of the land on which the museum"]