["The next Biennial should take place in 2021.\n\n\nThe Philadelphia Museum of Art (PMA) is planning to launch a $1 million fund for artists whose creative work is currently under copyright infringement in an effort to stem the rising tide of work that has been copied and redistributed without their consent. The new initiative, aimed at combating the epidemic of copyrights held by artists, was announced in February 2018. “We are committed to ensuring that the PMA’s collections and programs are free from copyright infringement and that the intellectual property rights of artists are protected,” said museum director Matthew Teitelbaum in a statement. “This new fund will cover the expenses of defending against the spread of the virus and of responding to the spread of the virus. It will also provide resources for artists whose works are currently under copyright infringement.”According to the New York Times, Philadelphia has reported more than 1,500 cases of the coronavirus and more than 1,400 cases of people infected with the virus. While the virus is believed to be confined to three states—California, Illinois, and Pennsylvania—and has caused some cases of the infection to be contained in only two states—Texas and Florida—the CDC has warned Americans", "The next Biennial should have been on the resistance of art for social change, and on the artistic as well as the political struggle for black liberation and the liberation of women. It should have been on the deep concern of these artists, politicians, and others in the movement for racial justice, and on the necessity of continuing their work in the struggle for racial equality.Notwithstanding these challenges, Walter and Paula will continue to focus the exhibition’s attention on race in the most direct and compelling ways possible. Their work will continue to touch and provoke us, and we will continue to be drawn to their work.”\n\n\nOolite Arts, the New York City–based nonprofit that supports artists through its Arts for Everyone program, has announced that it is laying off thirty-three staffers. The o’ronothing’s parent organization, the New Arts Alliance, announced that thirty-five staff members would be let go early and that twenty-five others would be laid off through July 1, 2020.“We are deeply disappointed that thirty-three staff members are being let go early,” said New Arts Alliance chair Marian Goodman. “The staff and board members of the nonprofit organization are artists, and we wanted to support them", "The next Biennial should be held in the autumn, just as Lévy Gorvy has announced it will be reopening in March. •  The hotel arm of the market-research firm KPMG has announced the launch of a new digital platform, the KPMG Kabinet, which will host new exhibitions by artists and groups and will provide a platform to exchange data on exhibitions and the exhibition process. The platform will also partner with the KPMG International Center in Berlin to present a meet and greet in the city. KPMG also revealed that it will partner with the Nationalgalerie in Vienna to launch a new weekly magazine, the Nationale Nachlassischer Kunst, which will be published by the KPMG Kabinet. The biennial will be held in the autumn of 2019. The platform will be free to the public, but the KPMG Nationalgalerie will ask that visitors reserve a table for $150 to $200, while the KPMG International Center will charge $500 per person. \n\n\nThe Centre Pompidou in Paris has received a major donation of 151 artworks from J. Paul Getty’s Foundation and will present the works at the Centre P", "The next Biennial should open in 2022, and the first in 2020. The sculpture, titled The Memory of a Child, has since been featured in thirteen world premieres, including the Venice Biennale, London; Art Basel Hong Kong; and Art Dubai. The programme will continue to be updated through the institution’s fifty-ninth edition, which will take place in 2021.\n\n\nThe Whitney Museum of American Art has elected Monetta White as its next executive director. White, who has served as the chief executive officer of the institution for the past eighteen months, succeeds Barbara Bossert, who was terminated on March 31 after eighteen months at the helm of the museum. “HOUSE OF CARNALS” is returning to the museum for a second edition, which will open on April 14 and run through May 2. The show will highlight the work of forty-two artists, including John Constantine, the artist whose body is housed in the museum’s permanent collection; Rufus Anderson, the American painter whose work is housed in the collections of the Whitney, the Metropolitan Museum of Art, and the Los Angeles County Museum of Art; and Adrian Piper, the American composer and composer-performer.White also serves", "The next Biennial should take place in 2021. The fifth and final iterations of the event, which have been held in the same venue since 2000, will focus on stories that are rooted in the people and places in a region that made up the city of Detroit. The first edition, titled “Wu Xiaoli,” was held in February 2008 and was attended by approximately 150,000 people.\n\n\nThe Associated Press reports that the National Endowment for the Arts (NEA) in the United States has awarded $2.5 million to fifty arts nonprofits over the next twelve months in support of new conservation initiatives as part of its “Save the Arts” campaign. The grants will support converting photographic equipment and facilities into storage units, designing and preserving landfills, preparing materials for exhibitions, and creating and managing digital collections.“This year’s program is the largest NEA grant ever, and the first launched with a specific focus on the arts,” said NEA director Adam Gopnik. “The grants will provide immediate relief to small and mid-size arts organizations facing immediate financial hardship; they will continue to do so throughout the fall and winter, and", "The next Biennial should be held in 2020. \n\n\nThe König-Bickel Gallery in Frankfurt, Germany, has received a gift of 400 works from the collections of the Künstler-Bickel, Karl Marx’s Institute for Industrial Philosophy, and the University of Freiburg in Germany. The gift includes artworks by the German theoretical physicist Carl von Holzenhausen, the Czech chemist Karl Wiemann, and the Hungarian architect Rudolph von Kahn.The two German gifts are the first works by Karl Marx ’s Institute of Industrial Philosophy (IKP) and the University of Freiburg’s collection of works on the theory of labor. Both works are scheduled for exhibition at the Künstler-Bickel in April 2020.The gift of the Bickel Collection, which includes paintings by Ernst Koenig, Ludwig Mies, Walter Sibler, Hans Ulrich Spandau, and Ernst & Anne Bickel, was delivered to the Künstler-Bickel by Rolf Bickel, a Berlin-based collector. The Künstler-Bickel is currently planning to build a new home for the museum.\n\n\n", "The next Biennial should be held in 2021, when the festival will be celebrating its fiftieth anniversary.\n\n\nOrganizers of the critically acclaimed Contemporary Art Biennale in the Portuguese city of Porto are planning to postpone the event, which was originally set to take place this past March, by a year. The postponement is meant to address concerns about how to insure the event’s financial sustainability and to give the biennial more time to prepare for the 2019 edition, which will run from March 25 to March 26.The Portuguese government has estimated that the event will cost the country $2.8 million to stage and raise $3.2 million for the festival. The organizers cite the Universidade Federal do Rio Grande do Sul in Portugal, which is also hosting the biennial, as an additional cost.“On the 25th of March, we had an opportunity to postpone the event by a year,” said José Paulo de Sousa, the director of the Rio Grande do Sul Biennial and the city of Porto. “But since then we have had discussions with the government and all the parties involved, and we have decided to proceed with the event in full.”The decision to stage the festival—which", "The next Biennial should take place at the Ministry of Culture in Beijing in 2022. The third, labelled Art and Politics, will be held in 2021.  Described as an “interdisciplinary project,” the inaugural, “17th,” will examine issues such as ‘environmental crisis and the state of nature’ at the Rio Grande and will take up themes such as ‘the politics of death.’ The latter exhibition will include work by sixteen artists, including Eisa Caid, Pilar Corrias, María De Muñoz, Oscar Salas, and Guan Yu, among others.\n\n\nThe Duke and Duchess of Cambridge, Prince Harry, and their entourage were forced to abandon their honeymoon in Nice, France, after they were stopped by French police for allegedly speeding on a one-lane, three-way street in the seaside city on Saturday evening. According to AFP, the couple had traveled in a Mercedes SUV that was stopped at a traffic light in the city of Saint-Etienne-du-Rouvray\u0097a popular destination for vacationers on France’s Mediterranean coast, where the couple had stayed since", "The next Biennial should take place in 2022, and the twenty-first one in 2024, the organizers said.\n\n\nThe Turkish permanent mission to the United Nations has concluded an agreement with the United Kingdom and France regarding the transfer of four of the country's antiquities, including the Tenggeri Palace, the Louvre, and the Musée du Quai Branly in Paris. The new partnership agreement, which was signed on January 18, has the potential to significantly improve the country’s international standing and boost tourism.“The project stage of the agreement is the first step towards the museum’s future,” Arına Güler, a spokesperson for the new partnership, told the Art Newspaper. “This is the first step of the joint project, which will take five years to complete. The goal of the partnership is to improve the cultural environment for all visitors to the country, and to promote Turkey’s image in the world.”Over the last decade, the French government had pledged more than $2 billion for the restoration of Ottoman-era cultural sites, but none had materialized. After France voted to leave the European Union in March, the government responded by launching a major campaign to secure the future of", "The next Biennial should be held in 2022.\n\n\nThe Museum of Fine Arts (MFA) in Boston announced today that it has hired tenure track artist Luke Turner as the next director of its Arts and Investigations (AII) program. Turner, who has served as a certificate in fine arts major at the MFA for two years, will take the helm of the six-week residency program, which was launched in 2005 to serve artists working in the arts.“Luke can bring a new and engaging perspective to our annual residency, offering a fresh approach to how the MFA will engage with contemporary art from a contemporary perspective,” said MFA artistic director Michelle Ryan. “We are thrilled to welcome him to the MFA.” Turner, who was selected for his academic performance and research as well as his expertise in visual art and architecture, will be responsible for developing the program’s next iteration, “The Rest of My Life,” and will serve as the MFA’s creative director.Commenting on his appointment, Turner said: “I’m honored to be selected for this important role and am excited to start working with the MFA’s talented and dedicated", "The next Biennial should be held in 2022.\n\n\nThe Los Angeles County Museum of Art (LACMA) has announced that it has received $115 million from the Association of Art Museum Directors (AAMD) in support of its 2019–20 season. The funding round was made during a conference held at LACMA on September 18–20. The announcement follows a $85 million expansion, completed in 2021, that added new exhibitions, expanded the collection, opened up a new room, and added more than 2,500 square feet of gallery space.“We are thrilled that the public has enjoyed our most recent seasons, both on stage and in person, and are excited to see how the new galleries will complement the existing structure and create new opportunities for visitors to experience the museum,” said museum director Paul Mpagi Sepuya and director Amanda Rosenfeld. “It is an honor to receive this much funding, and we are eager to see how the new galleries will unfold as LACMA continues to evolve as a museum of contemporary art.”The first phase of the expansion, which also included the addition of the Robert Rauschenberg–designed space Unseen, was completed in 2018. The", "The next Biennial should draw from the city’s existing collection and bring together new works and, perhaps, a glass ceiling. If we want to create a new future, we have to build on the existing.”A selection of works by the first generation artists to be included in the exhibition, curated by Kana Taylor and Alice Prochnow, will be presented at the exhibition. “The old exhibition, as well as many previous iterations, have attempted to play down the influence of the Lippstadt children, who created an intergenerational exhibition that was centrally focused on the lives of their contemporaries,” Taylor said. “These are very different voices.”The exhibition’s inaugural edition, “Alberto Burri” (2019), featured works by a select group of children from Burri’s native Italy, Francesco Cattelani, Antonella Cattelani, Alessandro Cattelani, and Dario Catellani (a.k.a. Alighiero Cattelani), who are known in Italy as the Lippstadt children. The exhibition, which was organized by the artist's parents, Alberto and Clara Burri,", "The next Biennial should be held in 2019. For the full list of participating artists, see “Architecture of Life: Art and Architecture”.\n\n\nThe Institut für Künstler und Technik (IKF), Germany, has announced that it is postponing a new edition of its Weimar German Biennial, which was set to take place in the early spring of 2021, until at least the end of April. The event will now take place in the Fall. The 2018 event, which was to have been held at the Institute for Contemporary Art in Kassel, was canceled due to the Covid-19 outbreak. The postponement, which has been in the works for months, was prompted by a lack of funds. The news comes a little over a week after Autumn/Spring Organizing Committee member Andreas Guttmann, former president of the German Association of Art, declarued that the event would continue with the same schedule as in 2018. He said the decision stemmed from the “existential crisis” facing Germany following the pandemic. Guttmann told the Frankfurter Allgemeine Zeitung.de that the decision was made following a discussion", "The next Biennial should be held in 2020, and the first in 2022. It will be held in the city of Zhangjiajie in Zhangji prefecture in Jiangsu province. The venue will be built on the campus of the Art Institute of Shanghai and will host fifty artists.\n\n\nThe National Museum of Fine Arts (NMA) in Washington, DC, is raising funds to preserve more than two hundred works by forty-six American and European artists, including Ed Moses, Francis Bacon, and Edvard Munch, from the Great Depression through the AIDS crisis. The institution, which has more than six hundred works on display, announced that it will partner with the Norman Rockwell Foundation to preserve the works, which range in age from forty-eight to sixty-six years old, in an attempt to protect them from the ravages of the pandemic.The initiative is part of a multiyear campaign by the NMA to collect and display works by artists who are either deceased or are unable to work in their entirety at any one time. The foundation also launched a new scholarship program, which aims to introduce more visibility to the work of contemporary artists by connecting students with the works that they have in the public collections of universities and museums.", "The next Biennial should begin in 2020 and run until 2024.\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Michelle Knapman as its next director and CEO. Knapman currently serves as the executive director of the New England Cultural Alliance (NECA), an organization that promotes and organizes events and programming designed to foster community and strengthen ties between New England arts and cultural partners. Knapman will assume her new role in January 2021.“The NECA has long been recognized as a leader in the field of cultural partnerships,” said James Hutton, the museum’s director and CEO. “I’m confident that Michelle’s ability to cultivate a deep and meaningful relationship with our Boston community will be critical in ensuring the museum’s future success.”Prior to joining the NECA in 2016, Knapman served as the director of the Yale Center for British Art, where she coordinated the museum’s international expansion and hosted numerous exhibitions. She also worked as the executive director of the New York City–based nonprofit Creative Artists’ Association, where she oversaw the organization of over one hundred exhibitions and facilitated the acquisition of works by local and international artists.Commenting on her", "The next Biennial should take place in August 2021, with the third exhibition, “Women’s Reproduction in the Modern World: From Sexuality to Reproduction,” to be held in September 2021. In the works of art that will be staged in the exhibition are works by women artists, such as Anna Atkins, Helene Blagdon, and Kiki Smith, as well as a selection of works by artists who were at the forefront of the feminist movement, such as Christine Winters, Mary Beard, and Evelyn Waugh.“The upcoming exhibition series will include works by a wide range of artists, from the most established to the most experimental,” said Roberta Smith, director of the Trench, who will present the exhibition “Women’s Reproduction in the Modern World: From Sexuality to Reproduction,” which will be curated by Nell Dorr and will include the works of fifty artists. “The exhibition will be an exploration of the fundamental work of women artists in the twentieth century, and will be an opportunity for both visitors and scholars to reflect on their own practices and their future.”\n\n\nGillian Wearing, who directed the Metropolitan Museum of Art from 1984", "The next Biennial should focus on the visual arts and the sciences, and should examine the interconnection of art and science from an evolutionary perspective. The biennial will also delve into the influence of art and science on each other, the world, and the soul.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Sarah Parnell as its next executive director. Parnell comes to MoMA from the Museum of Contemporary Art (MoCA) in Los Angeles, where she currently serves as assistant curator for visual arts and design. She succeeds Glen Carucci, who departed the institution in March 2019 to become the newly created director of the Hirshhorn Museum and Sculpture Garden.“Sarah Parnell’s appointment reflects the Museum’s commitment to fostering and equipping talented curators across the country, and gives MoMA an outstanding leader who has the vision and leadership skills to drive the museum’s initiatives,” said museum director Franklin Sirmans. “To have someone with Sarah’s expertise and the breadth of her experience bring a new perspective to the leadership role is truly an honor.”Commenting on her new role, Parnell said: “I�", "The next Biennial should take place in 2021, and the next will be held in 2023. If all goes according to plan, the exhibition will be held in Hong Kong, China, and will premiere the work of artist Ma Hongjing.One of the most anticipated shows at the inaugural Hong Kong Biennial is probably the work of the late Chinese author Jiang Qing, whose elegant tales of romance and oppression are set against a backdrop of multiple loss. The author was also a prolific painter, and his work will be featured in the exhibition.The Hong Kong museum has announced its list of fifty artists who will participate in the inaugural edition of the Hong Kong Biennial, which will take place at the Hong Kong Art Museum (HAM), from February 22 to March 6, 2020. Titled “Sensations from a Different Age,” the biennial’s theme is “Time and Memory: The Hong Kong Years” and will feature work from thirty-nine artists, including Koki Tanaka (Japan), Laurie Anderson (United States), Paul Mpagi Sepuya (Italy), and Will Tsang (China).“We are very excited to partner with the Hong Kong Art Museum and the Hong Kong Art Museum Team to create", "The next Biennial should highlight the emerging talents of women artists in work on the production side. “The current exhibition model, which is primarily focused on showcasing women artists, is not meeting the aspirations of many female artists,” Patrice Golomb, director of the Biennale de Lyon, told the Art Newspaper.  The upcoming edition of the exhibition will be curated by French artist Christophe Cendin.The 2019 edition of the exhibition was held at the Institut de Lyon, Paris, from March 13 to March 16. Since the exhibition is currently on view until February 12, the show will be replaced with a new 'Beginner's Biennial,” curated by American artist Sarah Bache and scheduled for February 22–March 7. The new event will be open to the public from March 19 to March 21, 2020.\n\n\nThe Museum of Fine Arts (MoFA) in Chicago announced today that it is planning to temporarily close its doors to the public and return its collection to the state of Illinois, pending the outcome of an investigation into the circumstances surrounding the death of artist and collector John Akomfrah, who was found dead in his home on March 26.The museum is currently closed until April 5, and", "The next Biennial should take place in 2020. The exhibition, titled “The Future is Present: Feminist Art in the Age of Protest,” will comprise more than sixty works by thirty-six artists. The artists participating include Shanmugam, Nalin Chaudhari, Pia Camil, Gia Dallallo, and Elena D’Andrea.\n\nThe San José Museum of Art in California, which has been designated a historic site by the state and the federal government, is suing the city of San José on behalf of private property owner James and Lillian O’Neill, who purchased the land where the museum’s current exhibition “The Crystal Gazing” is located and are suing the city for more than $1.7 million. The family is demanding $4.2 million in damages.The lawsuit, filed in 2017 by the O’Neills, who are suing the city of San José for $2.3 million, claims several city officials and members of the city’s planning commission violated the state’s Unruh Act, which grants the city the right to condemn private property, and declared the site “unrecognizable” as well as all of its", "The next Biennial should take place in 2020 and will include the works of sixty-four artists, including Tilda Swinton, Ruthanna Benitez, Rindosha Naidu, and Kiki Smith.\n\nThe Hong Kong Biennale has announced that eighteen works from its collection will be presented during the exhibition, which will run from March 23 to March 26, 2020. The works are arranged in chronological order, reflecting the year-by-year succession of Hong Kong’s art. The exhibition includes thirty-five paintings, nineteen sculptures, and twelve photographs from the collection, which also include works from the Hong Kong Art Museum, the Museum of Modern Art, the Hong Kong Art Gallery, and the Hong Kong Fine Arts Museum, among other institutions.“The exhibition is an extension of the exhibition program of the Hong Kong Art Museum, which has been organized under a collaborative model since 2001, and the Hong Kong Fine Arts Museum, which has been drawing for twenty-five years,” said the museum’s director Yip Chang-gyun. “Together, the museums have presented some of the most significant exhibitions in the history of Hong Kong. The Hong Kong Art Museum will continue to host exhibitions and receive visitors from", "The next Biennial should be held in the spring of 2022. “The core of the show is a collection of works that address the idea of photography as a tool for social change and the gallery’s relationship to the city of Seoul, as a way of defining the focus of the show as a single project,” a program statement from this year’s event reads. The exhibition will be organized as a series of films, documentaries, and short films. The first film, “The Waste Land,” will be presented by artist Kim Eun-sung and will be shot on location in the city of Tenjin, the ancient capital of the Silla Kingdom, in northern Japan. Kwon Ahn, the curator of the project, said the film wasn’t made with a camera that shoots black and white, but with a lens that produces three-dimensional images.The next documentary, “Nature and Photography,” will be filmed at the museum’s 'Naturescape Studio,” a collection of the museum’s former laboratories, and will feature photographs by Kim Eun-sung, Kim Min-Suk, Kim Tae-Sung, Kim Hyun-Soo,", "The next Biennial should be held in 2022, and the first in 2021. The project, which was organized by Dallas’s biennial and the mayor’s office of design, built on the city’s 2016 pledge to double the budget of the public art collection and invest $4.3 million in the collection. The funds will also help the city identify and prepare for the spread of Covid-19. The exhibition will feature works by more than sixty artists and will draw upon the collection of the Dallas Museum of Art. The main exhibition will feature works by sixty-eight Dallas-area and out-of-town artists, including Chuck Close, Paul Gauguin, and Jean-Michel Basquiat.The American Alliance of Museums (AAM), a nonprofit organization, is also spearheading a campaign to save the collection. In March, the organization launched a petition, signed by more than one hundred members of the AAM’s board of trustees, which has since been signed by more than 1,500 signatories. The petition argues that the assets of the museum should be sold to the city of Dallas and that the proceeds should be redistributed among the AAM’s various programs.“The city", "The next Biennial should start a week from now and will run until October 23.The complete terms of the agreement between the city and the museum are as follows:The biennial is an extension of the Memorial Day celebration of the students of the Public School of the Arts, which was organized by the Public School of the Arts under the aegis of the City Council. It is comprised of two tracks: A) A biennial is an annual public gathering of citizens from the community; b) The museum will dedicate one of its two floors to a retrospective of a contemporary artist\u0097no formal plans have been made to organize such a biennial in the future.The biennial will feature a selected artist’s work from the collection, which is curated by the museum’s senior curator of Modern and Contemporary Art, Peter Zugazagoitia, and will be presented in conjunction with the museum’s annual Costume Institute Galerie Show. “While we are grateful for the support of our colleagues and the City of Los Angeles for their vision in supporting the arts during this challenging and challenging time, the current circumstances also make this a challenging time to organize a biennial,” said Zugazagoitia. “The city", "The next Biennial should be held in 2021, and it is anticipated that the first exhibition will open in the United States in 2021 as well.\n\n\nThe Assyrian New York Foundation (NEW) announced today that Mary Mullen has been elected its next board president. Mullen has served as the foundation’s president since 2013. Prior to joining NEW, Mullen was director of the Metropolitan Museum of Art in New York and director of the CNEA in Paris. “We are pleased to welcome Mary’s leadership to the organization,” said  Melinda and John Mullen. “Her extensive experience and expertise in the field, combined with her vision and commitment to the organization, will help make NEW a well-oiled machine for the future.”Mullen has been a board member of the foundation since 2007. She is a member of the board of directors of the Association of Art Museum Directors, the Association of Art Museum Directors of Greater New York, and the New York City Council of Art Museum Directors. She has also served as board chair of the New York Foundation for the Arts and as a member of the board of trustees of the Metropolitan Museum of Art in New York since 2002.Commenting on her appointment", "The next Biennial should be held in 2022 and will be organized as follows: Martin Scorsese: “The Artist’s New World,” John Newbery: “The Seduction of Ghent,” Natalie Parent: “The Artist’s Body,” Yolanda Alvarez-Perez: “The Artist’s Sex,” Bridget Sparks: “The Artist’s Body,” Ruth Williams: “The Artist’s Sex,” Tod Williams: “The Artist’s Body,” Rory Mulligan: “The Artist’s Sex,” Rory Mulligan: “The Artist’s Sex,” Vincent van Gogh: “The Black Spot,” Vincent van Gogh: “The Black Spot,” Mark Blythe: “The Artist’s Body,” Marianne Baille: “The Artist’s Body,” Michelangelo Antonioni: “", "The next Biennial should take place at the city’s Museum of Modern Art, which has been remodeled into a museum of contemporary art, and the Museum of Contemporary Art, which opened in 1990. The inaugural exhibition, Artforum’s 100th Anniversary Celebration, will open on September 30.\n\n\nArtist-run space Wangechi Mutu, which allows art and design students in Kenya to collaborate in small-scale and on-site exhibitions, has announced that it is retreating from the upcoming edition of the Wangechi Art and Design Summit, which was to take place in Nairobi in March. In a statement, the artist-run space said: “With the withdrawal we are hoping for a positive outcome. We are aware of the challenges and uncertainties ahead, but we believe the best outcome for art and design in Kenya is to work together with the community to develop partnerships that strengthen the work of the art and design students and local art and design communities.”The announcement followed an outcry from the students, who staged a protest on March 7 at the Wangechi Art and Design Institute (WADI), the arts center founded by two young men from North Kivu in 2008. The day after the protest,", "The next Biennial should have a new work by an artist whose work is currently on display in the exhibition. The artist will be chosen as part of a bidding process that will run for three months and will culminate with the presentation of the chosen work by the artist. The artist will receive a total of $10,000. \n\n\nThe University of Pennsylvania Museum of Art in Philadelphia has appointed Suzanne C. Martin, the director of the studio and curator of modern and contemporary art, as its next director. Martin has been a part of the museum since 2016, when it relocated from its original building on the corner of 19th and Market Streets to a new home on the university’s campus. She succeeds Donna Harrison, who was hired as interim director following the sudden death of Richard Prince, who served as director of the museum since 1998.“Suzanne is a brilliant leader, who has led the Philadelphia Museum of Art to new heights under her leadership,” said Harrison. “She brings considerable experience in overseeing a large institution, and her ability to adapt her own work to meet the needs of a diverse and rapidly growing collection will be especially valuable in the rapidly changing field of contemporary art.”Previously a partner at the Philadelphia-based firm", "The next Biennial should take place in the fall of 2020. This year’s event, “The Magician and the Thief,” was staged by the Italian studio Cinecittà Casanelli and premiered at the Venice Biennale in March.\n\n\nThe Royal Academy of Arts (RA) in London has received a gift of twenty-five works by artist Cécile B. Evans. The estate includes four works by Evans on paper and three in color. The works were donated by her husband, the late Danish artist J. M. Evans, and were on display in a presentation of the artist’s work at the museum during an exhibition organized by the RA.“We were delighted to receive this extraordinary gift,” said Michael Ward, the director of the RA. “Cécile was one of the few contemporary artists whose work has been given the stature, the attention, and the need of the Royal Academy.”The works were acquired by the Evans family in a sale at the auction house in London on December 7, 2017. The sale included fourteen works by Evans, who was born in London in 1940, and a collection of works by her husband and three other siblings. C", "The next Biennial should be the last, the institution said. The news comes a day after the institution revealed its selection of the Italian artist and leader Lorena Casola. The 2015 edition, titled “Humana” explored themes of migration, climate change, and the history of women’s rights. A selection of works by the three artists will be presented in the exhibition “Dr. Zhivago,” which will return to the museum in September. The exhibition will also be retitled “Silence is Silence” and will feature works by the three finalists.\n\nNorman Faraday, the British photographer whose haunting of the human body and the environment became a clarion call for generations of environmental activists, died on December 20 at the age of eighty-five.Born in London in 1937, Faraday was drawn to photography from an early age. The son of a textile factory worker and a homemaker, Faraday was raised in an upper-class Jewish family in Liverpool, England, and moved to the city to study at the Royal Academy of Arts. He eventually settled in the exclusive East End, where his son became a teacher. After a brief stint in the oil industry, Faraday returned to his son,", "The next Biennial should consist of a selection of works selected by a rotating panel of world-renowned curators, and may add up to sixty works, according to James Cuno, director of the Biennial. The show will kick off with a retrospective of the work of Mark di Suvero, the Italian curator of Modern and Contemporary Art, in 2020.\n\n\nThe New Museum in New York has received a gift of sixty paintings by artist Alexander Chee, which were donated by the artist to the institution by way of the David Rockefeller Fund, in support of the institution’s work on the preservation of American art. The works, which were made in the late nineteenth and early twentieth centuries, are currently on display in the museum’s Alexander Hamilton Building. Chee’s work was also recently featured in a special exhibition at the Museum of Modern Art and at the David Rockefeller Fund’s American Legacy Foundation in Tallahassee.“Alexander Chee’s paintings are especially significant for their enduring and richly textured paintings, which are set in the same world as the works of the artist,” museum director Christopher Woolf said in a statement. “Championed by the David Rockefeller", "The next Biennial should be held in the Spring of 2021. The event, titled “Digital Gold: Art and the Digital Age” will be held at the New Art Museum in New York from March 21–March 23. Coinciding with the exhibition will be a three-day exhibition and workshop, “The Future of Art: Finding the Next Frontier,” which will be organized as a dialogue between Rob Jansen and Alicia Keys.Esther Merritt, director of the San Francisco Museum of Modern Art, said: “With this year’s Biennial being a watershed moment for the city, and with the recent reopening of the public art museums and cultural spaces, we thought it was essential to highlight the importance of the arts in shaping and advancing the city as a whole.”The San Francisco Art Institute (SFMoMA), which was scheduled to reopen on March 31, has announced that it is postponing its spring 2020 exhibition “KIRK*S VIEW*” and its spring 2020 “COMING SOON” presentations. Both shows were slated to open at the Kohn Gallery in the Mission District on February 22, and featured work by twenty-six artists, including Bruce Pearson,", "The next Biennial should begin in 2022, with a selection of works by artists who have chosen to remain anonymous. The tenor Olivier Assayas was chosen from a shortlist that included Loïc, Jannis Kounellis, and José Arias. The curator François-Xavier Fan was recently appointed as director of the exhibition, which will open in 2020. The 2019 edition featured work by thirty-nine artists, including Robert Chartier, Paul Gauguin, Jean-Luc Brunel, Carl Stöck, Alice Neel, and Martin-Ghebaly. In the exhibition, the awardees were selected by a jury comprising Andrea Liebmann, Francesca Russo, Anna-Katerina Slat, and Alexei and Paulus Zuleika. The 2020 edition will feature seventy-three works, including works by seventy-six artists. The twenty-fourth edition of the Biennial will return to the city of Saint Petersburg from December 29 to February 12, 2020.\n\n\nThe Metropolitan Museum of Art in New York has announced that it plans to sell the majority of its holdings of Thomas Mann’s famous photographs to a private collector. The institution says that sales are expected to be completed by the end of the", "The next Biennial should take place in 2020. “I felt it was important to work with a new, contemporary, and international generation of artists in order to commemorate their work and the legacy of the movement,” said Arne Glimcher, founding curator of the exhibition. \n\n\nThe Museum of Fine Arts (MFA) in Boston has received a $25,000 donation from the Warren B. Kanders Foundation. The gift was made during an event that took place on January 26 in honor of the institution’s 150th anniversary. The event marked the end of the biennial’s inaugural season and featured artworks by fifty-five artists, including Adam D. Weinberg, Molly Crabapple, and Tanya and Johnnie McCarthy.The Kanders Foundation also provided $15 million for the construction of the Kander Center, an expanded and reconfigured Kander Library, the Kander Institute for Contemporary Art, and the Kander Research Center. The building and the center will sit on the campus of MFA. The massive expansion of the institution, which was completed in 2017, underwent a $30 million expansion in 2018.Construction of the Kander Center began in 2007 and involved the construction of a four-thousand", "The next Biennial should be a companion exhibition, “Astrid and Julian Batten as Mulder and Scully,” which will showcase the work of forty-five artists, including Peter Winograd, Ursula von Rydstorp, and Lévy Gorvy; a contemporary art installation, “Sidney and Angela Rich as the stars of the Biennial’s exhibition: The Night Gallery,” which will be staged in a vintage theater in the gallery’s New York space; and a performance, “DC McInerney: The Place of Silver and Gold,” that will be staged at the Museum of Modern Art and will be staged at Rockefeller Center. The Los Angeles County Museum of Art (LACMA), which is currently undergoing a $1.5 billion expansion, announced that it has received $170 million from the redevelopment of the Getty Villa. The funds will fund a series of exhibitions and other activities that will be organized under the banner of “Innovation Cities,” a new initiative that is funded by the Los Angeles City Council and LA County Executive Renee Garcetti.“We are thrilled to be working with LACMA and the City of Los Angeles", "The next Biennial should be held in 2020.\n\n\nThe Museum of Modern Art (MoMA) in New York has announced that it is collaborating with the Minneapolis Institute of Art (MIA) in an effort to bring the two cities together. The partnership is part of MoMA’s reinstallation of the institution’s current exhibition, “The Artist as Narrative,” which will inaugurate its new forty-five-thousand-square-foot, glass-enclosed pavilion. MoMA will host a special exhibition of work by Japanese artist Nara Oshima, who will also appear in a new film, “Nara Oshima: The Artist as Narrative” (September 22), which will be shown in the museum’s new 300-seat auditorium. The event will be followed by a public tour of the new pavilion.The partnership will highlight the history of MoMA, which was founded in 1929 by architect and businessman J. Paul Getty, and the contribution of artists and designers in the museum’s ongoing revitalization. MoMA has welcomed artists such as Alice Aycock, Frank Gehry, and Frank Gehry’s son, Frank Gehry Jr., and has staged", "The next Biennial should be held in five years; the last set the date for 2020.The government has recognized fifty-one artists since the festival’s inception, including Kumail Nanjiani, Daniel Johnston, and Shimon Guggenheim. Nanjiani will present an animated sculpture, “Suspicious Light,” for the Grand Prix in May, but the project itself is slated to be completed in July 2020. Johnston will have a new work exhibited at the Venice Biennale in December 2020, and Guggenheim’s work will be included in the 2021 edition of the exhibition.\n\n\nThe Philistines’ Resistance: The Untold Story, Dated: 2020, and the Art of Resistance, 2019, will be staged at the Great Hall of the Georgian National Museum in Tbilisi from November 9 to November 15. The first edition, which was organized by the Museum of Fine Arts in Athens, will culminate with a series of performances, performances, and screenings in the Georgian capital. The second iteration, which was organized by the Museum of the History of Arts in Georgia, will take place in the Georgian city of Gori in May 2020.The Philistines’", "The next Biennial should take place in the spring of 2022 and will comprise of eighteen artist residencies, comprising artists who are currently working in the galleries of the state museum as well as the institutions and individuals who have received the Biennial Fellowship. Ten of the artists selected by the institution for the upcoming exhibition will be selected for the 2019 exhibition and the exhibition will be on view in the spring of 2020.  The artist residencies will be held in different locations around the city of Bali, including at the Bali Art Museum and Museum of Contemporary Art (BAM), the Bali Contemporary Art Centre, and the Bali Art Museum and Library. The forthcoming edition of the Biennial will aim to include both new and established artists and will focus on the theme of biennialism: how design has shaped contemporary art, and what it means for the future of art.The Biennial Fellowship grantees are as follows:Astrid Alonso - Sydney, AustraliaRanda Abou-Rahme - New York, New York, and Los Angeles, CaliforniaAmina Adham - New York, New York, and Los Angeles, CaliforniaKovani Ajalu - Chicago, Illinois, and New York, New York, and Los Angeles, CaliforniaQ", "The next Biennial should be held in 2022 and will focus on the reconstruction of a Nation state in central Europe and the Caribbean. The next edition will draw from the collections of the Paris- and Berlin-based institutions.\n\n\nCultural institutions and preservation organizations are being urged not to engage in controversial displays of collective expression. So-called billboard campaigns have been used by some cultural figures and activists to mobilize against controversial exhibitions and events. Since these displays often target particular works or artists, they often target individuals and their communities.They can also be used as an effective tool for intimidating and distancing individuals from artworks and for organizing protests. However, exhibitions typically take place at designated times and locations, and the physical manifestation of a protest is difficult and unpredictable. The organizers of a show by a South African artist at the Sydney Opera House last week argued that it was not appropriate because it did not take place during a protest, and other protests against the film The Big Short were held at the Melbourne Museum of Art and the Royal Opera House.When the Australian Museum of Modern Art in Sydney voted to suspend a protest against the exhibition “The Big Short” last week, the institution said it did not intend to cause disruptions. Museums and other cultural institutions have been pressured", "The next Biennial should be scheduled for January 2021, and hopefully by February 2022. The theme of the 2021 iteration of the biennial is the elusive final act of the artist’s life—“On Earth, Through the Window,” which will take as its theme the painting and sculpture Aida, 1960, which is on display in the exhibition “Florence: A Incomplete Life,” which opened on January 5 and runs until February 14. The exhibition is curated by Emilio de Castro and begins with a rendering of the Venus de Milo, 1960, which Leonardo da Vinci made in his studio in Rome. Previous works in the exhibition include the exhibition “Ceci n’ Cintra est?” (The Night of the Feminine?”) and “Feminine Blood: Any One of the Five Girls in Paris 1972” (The Miracle of St. Cloud).“We are incredibly excited to present the exhibition ‘Florence.’ It will be a great success if this platform will serve as a lesson for the future generations of artists. The exhibition will be the first retrospective devoted to this painting in the history of Italy, and it will", "The next Biennial should take place in 2020. The first Artuteca biennales, held in 1963 and 1964, were inaugurated by sculptor Andrés Manuel Biennale, and took place in Porto Alegre, Portugal, and Florence, Italy; the next edition, slated to take place in Rome in 2021, will be hosted by the National Museum of Arts in Athens.The event’s director, Sabrina Cicutto, told Artnet that the design for the exhibition—which was inspired by a proposal for a new cultural center in the city of São Paulo—was initially conceived as a “point of departure.” “We decided to design the pavilion as a space for a new generation of artists to be presented at the same time, of a new kind, in a very contemporary way, in the rhetoric of the emerging generation,” she said. The exhibit will be divided into stories brought together in a series of performances and will be curated by the artist and Sao Paulo state minister of culture, João de Freitas.“I’ve always been inspired by the work of artists in the city of São Paulo, and I’m excited to bring the young talents of", "The next Biennial should be held in 2021. \n\n\nThe Kuangrindō Art Museum in the city of Kuangrindō, Fujisan Prefecture, Japan, has revealed that it is planning to reopen with an exhibition of forty new works by twenty-six new artists, all from the country and centered in coastal Fujisan, in March 2022. The exhibition will run alongside the first exhibition of new work by the group Contemporary Arts of Japan (CAAJ).“The museum has made great progress since the earthquake and tsunami hit Fujisan in March 2011, and we have already completed most of our exhibition programme,” said Matsuryu Hachiman, director of the museum. “It is a great honour and privilege to welcome twenty-six new artists to the Kuangrindō Art Museum and I look forward to welcoming the artists to the new exhibition.”The announcement of the artists was made during a presentation of the forty-ninth exhibition of new work by the group Contemporary Arts of Japan (CAAJ) at the Museum of Contemporary Art Tokyo on March 28. The show featured work by sixty artists, including Yuki Kondo, Takashi Kawamura, Sachi Nara, Akihito S", "The next Biennial should come up with a new agenda for the exhibition, which will take place in April 2020, and is hoping that the new location for the exhibition will draw more galleries, not fewer. After the show is over, the biennial will be able to return to the old Astra Celestine. “The question of how art will solve the world’s problems has never been more urgent than it is today,” said Solveig. “We are working hard to think of ways in which art can play a role in reshaping the world, both for art and for the greater good of the world. The exhibition ‘Art in São Paulo’ will be an opportunity to start that work.”\n\n\nThe Whitney Museum of American Art in New York has appointed Kate Black as its next executive director. Black comes to the institution from the artist-run project space Versailles, where she has been the director since 2014. The Whitney has been working with Black since 2012, when she was named the group’s inaugural president. She has also served as a board member of Versailles and has held director positions at the Museum of Modern Art in New York and the Museum of Modern Art, New", "The next Biennial should be held in 2022–2023, with the award of a lifetime achievement award to the best documentary filmmaker of the twentieth century. The biennial will also include An exhibition of works by Jacquelyn Boublil and Joanne Weisz, a joint exhibition with the Minneapolis Institute of Art; and the revival of an award given in honor of the biennial’s award‐winning artist, Timur Sobocinski.\n\n\nThe Los Angeles County Museum of Art (LACMA), the Museum of Modern Art (MoMA), and the Whitney Museum of American Art have received a combined $7.5 million from the JP Morgan Chase Collection during a multiyear campaign to preserve and promote the art of American art. The funds, which were awarded for the preservation of works by Michael Feliciano, Mary Cassatt, and Francis Alighier, and for the promotion of works by Andy Warhol, Robert Irwin, and Robert Mapplethorpe, will now enable LACMA to open a new public lecture museum,   “The Way We Live,” at Highland Arts Center. The newly renovated venue will be inaugurated by a solo exhibition of works by four American artists on March 5,", "The next Biennial should be in late May.\n\n\nThe National Geographic Society in Washington, DC, has canceled its next major conference, the Science, Technology, and Society (STS) meeting, after it canceled an exhibition of work by British artist Madeleine Anselm. The cancellation, which was announced on March 31, followed a wave of protests from cultural figures, including the American poet Lawrence AbuHamdan, who was awarded the Peabody-Eberlein Prize for his Telling Stories, a work that examines the interconnectedness of narratives, and many others. The cancellation was prompted by a series of statements made by political leaders such as President Donald Trump, who declared that he would not honor the Paris Agreement on climate change, and the UK, which was already breaking its own climate pledge by a considerable margin. Since Trump took office, he has made numerous attempts to unravel the 27-country agreement, and he has threatened to pull the United States out of the landmark international deal.According to the Art Newspaper, the cancellation of the conference will mean that the 2019 edition will be cancelled as well. The 2019 edition, titled “Made in LA,” will be held at the New Museum in New York from March 29 to", "The next Biennial should begin in 2021 and run until 2022. The theme of the fair is “Art and the Last Days of Earth,” and the 2020 edition will explore the “final moments of life on earth.”\n\n\nEbony & Vineyard, the London-based nonprofit that provides support and management assistance to artists and cultural producers in London and the South East, has received a $150,000 grant from the William Young Foundation. Established in 2016 to support artists and their families through the final months of their lives, the grant will help Ebony & Vineyard connect with local groups and individuals who need financial assistance, spur their fundraising efforts, and provide a resource to help artists transition out of debt.“This year’s Young Fellowship grant will be particularly meaningful in helping to secure the future of art as a vital and necessary part of the local economy,” said Paul Mpagi Sepuya, director of the William Young Foundation. “The support of the William Young Foundation is essential for the survival and growth of the arts and we are delighted that the foundation has committed to supporting artists and their families for the next twelve months. The grant will allow us to continue to", "The next Biennial should be held in 2021. The exhibition will be held at the Museo de Arte Contemporáneo, Madrid. \n\nThe National Gallery in London has received a donation of twenty-one works from the collection of American artist Douglas Adams. The donation of the works, which were acquired through an auction held at the institution in December 2018, comes amid ongoing discussions about the future of the Adams Building in London. A petition that was presented to the National Gallery in December 2020 reads: “In 2017, I was appointed as the head of the Museum of Art and I celebrated this with the manufacturing and exhibition of twenty-one new works by Douglas Adams. They are among the best-known and most widely exhibited works in the institution’s collection.”Born in 1946 and based in the city of Indianapolis, Adams has been a nationally recognized artist for more than thirty years. His work has been exhibited in the exhibitions of the MCA, the MCA London, the MCA Museum of Modern Art, the MCA, and the MCA/New York, as well as at numerous international fairs and biennials. His work has been collected by numerous institutions", "The next Biennial should be held in 2020. It will be hosted by the newly-opened Östlund Museum, the newly-opened Kalmaria Museum, and the recently-opened Ljubljana Galerie.No specific dates have been set for the 2019 edition, but the 2019 edition will be held in the Stockholm suburb of Umea, Sweden. The 2019 edition also featured a new exhibition of work by the same group of artists that will be featured in the 2020 edition. If all goes according to plan, the venue will open to the public on September 27.\n\n\nIranian artist Iraj Masroor Ahmad, whose mottos included “Glory to God,”“All is Allah,” and “God is great,” has died at age eighty-eight. The ninth-century Persian artist was known for his direct, personal, and close-knit approach to his art, which often opted for poetic and symbolic language to address complex and controversial issues. Ahmad was born in Tehran in 1938 and grew up surrounded by artists and thinkers, aunts, cousins, and teachers. He began his artmaking at an early age and started working alongside his father. He graduated from the Tehran", "The next Biennial should be held in 2020.\n\nThe project is part of the university’s curatorial program, “The Visual Embrace of Architecture,” which has been running since 2015 and aims to deepen understanding and appreciation of the history of architecture by examining the visual arts, architecture, and design. The exhibition will showcase the work of forty-three artists, including Rosalind Kraus, Harald Szeemann, and Fabian von Bülow, and will highlight the history of archaeology and the visual arts in the city of Giach.More information about the 2019 event can be found on the biennial’s website.\n\n\nThe Metropolitan Museum of Art (MoA) in New York has named Michael Danziger as its next director. Danziger comes to the institution from the Museum of Modern Art, where he has served as deputy director of exhibitions since 2014. He succeeds Christopher Wool, who departed the institution in July 2019 to head the National Gallery of Art, which has close ties to the National Rifle Association.“Michael is a visionary leader and organizer who will play a central role in elevating the museum’s public image, aligning our exhibitions and programs with our institutional", "The next Biennial should be held in the year 2023, to coincide with the twenty-fifth edition of the Triennale in 2021. The next edition will be curated by Yo-Yo Ma, and will be held in London from November 5 to November 7, 2020.\n\n\nThe Museum of Fine Arts (MA) in New York has appointed Patricia Cory as its next director and CEO. Cory comes to the museum from the Museum of Modern Art (MoMA), where she has served as deputy director and chief curator since February 2019.“Patricia’s curatorial practice and experience in the field of modern and contemporary art make her ideally suited to lead our flagship institution,” said Marc Glimcher, the institution’s director. “Her record of success at MoMA speaks for itself, and we are eager to add her expertise and vision to the museum.”Cory, who has helmed the museum since 1996, was named its deputy director last April. Prior to joining MoMA, Cory was a curator at the Cleveland Museum of Art, where she worked as the supervising curator of “Carrie and Clyde: A Modern Musical,” 1989–90, and collaborated with artists such as Renzo Piano", "The next Biennial should be scheduled sometime in 2020.The Berlin Design Biennale, which was organized by Berlin’s state-funded BAM and took place in January, has announced that it will not be renewed for a third year. The event was supposed to mark the beginning of a new era for the region. Organizers said that the decision was made after they gave the thumbs down to the options presented by the three finalists: the blue-chip design company Gensler, the German state of Brandenburg, and the cultural institution Potsdamer Straße in Frankfurt.The three finalists submitted plans for museums in the city of Berlin that would be constructed in the form of a city-within-theater, incorporating the institution’s collection and programming, and would also be funded by the city of Berlin and the state of Brandenburg. The BAM, which is housed in a former munitions factory in the Kreuzberg district of the city of Berlin, was the only entity that submitted a design.The organizers said: “[T]he nomination of the BAM and Potsdamer Straße as the ideal locations for the first exhibition made by the Berlin Design Biennale was a strong signal for the future of", "The next Biennial should take place at the Museum of Modern Art in New York, which opened in 2016 and is currently undergoing a $4 million facelift. The exhibition will be hosted by curator Anatole Shagal, who will continue to serve as director of the fourteenth Biennial at the Metropolitan Museum of Art, and will feature work by more than sixty artists and collectives.  Museum director Kris Kristofferson said: “The new Museum will remain true to our mission and its values while still fostering a sense of artistic community, location, and community. This is our time to create new work in collaboration with the communities we serve.”\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles (MCA) announced today that it is reopening on November 14 with a new exhibition of work by artists whose practices have been influenced by the Black Lives Matter movement. Inaugurating the event will be a three-day exhibition of work by the Black Workers Organizing Committee, a group that serves as a forum for cross-racial collaboration and collective action in the United States. The exhibition will run November 15–16 and will feature work by seventy-eight artists, artists-in-residence, and activists from forty", "The next Biennial should begin as soon as possible and will include a presentation of works by twenty-six artists chosen by the creative committee.”\n\n\nThe Harlem Renaissance Society (HRS) has announced that it will no longer receive funding from the Sackler Gallery and will instead donate the proceeds from its upcoming annual gala, which will be held in the city’s Museum of the African Diaspora (MoAD), to the Black Lives Matter (BLM) activist organization. The move follows a statement made by HRS president Marcelo and Naima J. Browne, who said that the organization will no longer take part in the annual gala, which is usually held at the Diller Scofidio + Renfro–designed venue.“We are deeply concerned by the recent events in South Africa, particularly in light of the recently passed Legislative and Constitutional Amendments, and in light of our new initiative, ‘Africa First,’ which aims to expand opportunities for dialogue and cooperation between Harlem and South Africa,” reads a statement issued by HRS. “As a society, we must ensure that we act in solidarity with the African Diaspora in their struggle for equality and inclusion, and in solidarity with", "The next Biennial should take place in 2021. Introducing new works by top artists and cultural figures from around the world, including sisters Linn and Manfred Schmidt, the creators of the worlds famous Helsinki Skulpture Garden; Craig Bennett, the director of the Tate in London; and Peter Wächtler, the director of Los Angeles’s Marina delano. “We are thrilled to host the next Biennial in Paris, and are counting on you, our visitors, to join us in our efforts to give the Parisians a rich, new experience,” said Marie-Paul Duchesne, president of the biennial. “We look forward to welcoming you to Paris. We are all waiting for you, and we are counting on you, to support these commissions and to help shape Paris’s future.”\n\n\nThe University of Texas at Arlington (UTA) has established a new $30 million endowment fund for the Arts in recognition of the contributions made by students in its graduate art program in recognition of the exceptional achievements of the 2016–17 academic year.Established in support of the Arts and Design, the fund will support the academic achievement of those graduating from the school", "The next Biennial should be in April 2020, at the time of his death. He also planned to release a collaborative exhibition with Fabian Breugel in July 2020.\n\n\nThe Danish artist Lars-Ingrid Slakan has received the prestigious Award for Lifetime Achievement at the New York International Art Museum (NYIAM) in New York. The prestigious prize is given annually by the organization to an artist who has made an outstanding contribution to their field over a twenty-year period. The award is one of the most prestigious awards in Denmark.Slakan’s work has been exhibited at the Museum of Modern Art (MoMA), New York; the Museum of Modern Art, Los Angeles; the Museum of Modern Art, New York; and the Museum of Contemporary Art, New York. She also has numerous artist-in-residence agreements with MoMA and the Museum of Modern Art.Slakan’s work has been purchased by the Metropolitan Museum of Art (MoMA), the Museum of Modern Art, the Museum of Modern Art, the Museum of Modern Art, the Museum of Modern Art, the Museum of Modern Art, the Museum of Modern Art, the Museum of Contemporary Art, the Museum of Modern Art, the Museum of Modern", "The next Biennial should take place in 2020. While the organizers of the inaugural edition of the show are eager to claim that the events of this year will provide great inspiration for future editions, they have yet to detail exactly how their event will be organized.One of the major criticisms of the show, which will be held at Prague Castle, the city in the Czech Republic’s capital of Bohemia and the region of the Czech Republic, is that the exhibition will take place outside of the city. According to Artnews, the exhibition will focus on the visual arts and will be organized as follows: Kunsthal Aarhus, Denmark—September 9, 2020. Additionally, the show will feature three new works by artist Jakob Boehn; one work will also be a reinterpretation of a work by the Danish master Hans Christian Andersen.The show will be presented under the auspices of the Danish Cultural Heritage Foundation. The Danish pavilion will be located in the Denmark Pavilion, a five-story Danish museum that has been constructed in the city of Aarhus, and will be inaugurated by a presentation of the first major work by the artist Carl von Schlegel in the Danish pavilion. The Danish pavilion will have", "The next Biennial should already be underway in mid-March and will consist of twenty-six works by forty-four artists. Its theme will be “the art of resistance.” The first exhibition of the triennial will open at the Museum of Contemporary Art (MoCA) in New York on March 28. The show “Toward a Biennial of Modern Art” will feature works by seventy-four artists.Among the works on view are “Surrealism” (2016–17), “Prescient Visualities” (2016), “Deanna McBride” (2016), “Juan Carlos Otero” (2016), “Sugai-Makaya” (2016), “Patrick Kelly’s Anamorphic House” (2016), “Ben Kew and Mercedes Riester” (2016), and “Special Events: Art & Time in Nineteen Twentieth Century Los Angeles” (2016).The exhibition will run for three weeks and will feature thirty-eight works by forty-one artists. The biennial’s inaugural exhibition, “The Stories of the Artists in the Seven Senses” (2019", "The next Biennial should be held in 2022, and the next should be staged in 2023, and the final should be in 2021.”The new partnership between the museum and the National Council on the Arts was announced in December of 2018, after a year of negotiations between the two organizations. The two institutions will work with one another and the city of Houston’s design and architecture teams to come up with an ambitious design for Austin’s NorthPark Art Center. The NorthPark Art Center will be built in the former site of the existing Kellogg Railroad, and will boast more than 1,700 square feet of public open spaces, a gallery, a public courtyard, an auditorium, an auditorium, a courtyard, and a restaurant.The National Gallery of Art also recently completed work on an ambitious redesign of its headquarters, designed by architect Markus Richter, that will include more galleries, a museum, and a library. The renovation will culminate with a new exhibition hall and a new visitor entrance on the north side of the building. The renovation also includes the restoration of the building’s original brick facade, and the installation of new glass and steel. \n\n\nArt Paris’s president, André Le Brun,", "The next Biennial should focus on the history of the exhibition, the development of the biennial as a whole, and the exhibition’s collection as a whole, and should consider how the exhibition can be used in the context of the exhibition as a whole. “The Biennial is a key polysemy,” said Jenny Waldman, curator and chair of the new exhibition, “a powerful apparatus to open new worlds of art and new modes of being.” The exhibition will also present the first data-driven exhibition in the history of the biennial, a dialogue between the artist and the Biennial’s director, Yukiya Takahashi, in the exhibition space.Ellen Harder, head of the biennial, said: “The museum is thrilled by the prospect of seeing the new work of the collection as well as the exhibition in the new space, which will be inaugurated by the exhibition of two works by Miro Tadeu, which were included in the first Biennial. These two works, 'Feminine Flight and the Fading Sun' and 'On the Night of the Rising Sun,” were exhibited in the 2016 exhibition.\n\n\nThe Los Angeles County Museum of", "The next Biennial should be held in 2021, and the biennial should continue to be hosted by the same architect and curator. “This is an unprecedented event,” Anna‐Sophie Wyllys, the director of the Biennial, told the Art Newspaper. “For more than twenty years, we have been working hard to develop a new system for organizing exhibitions and for bringing together the greatest artists of the world, and now we are ready to present it to you. We invite you to experience the exhibition through the artist’s own words and the artist’s own art. We hope that you will join us in creating the new art.”The 2020 edition of the biennial will be hosted at the Smithsonian’s National Museum of African Art in Washington, DC, and will be called “The Invention of Art and the Future of Art.” The 2019 edition of the event was hosted at MUSEUM ST. ELIZABETH, in Providence, Rhode Island, and aired on PBS.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has issued a final recommendation for private nonprofit museums that have not yet received city approval to begin demolition and", "The next Biennial should be held in Exo, in Nairobi, in 2020; and in 2020 will be the last year of the twenty-first-century edition.In an interview with the Art Newspaper, the new director of the Biennale, Domenick Berthold, said: “It was the exhibition that really drew me to the museum. I had never been to the museum before and I found it very interesting. It is the only institution in Africa that has such a substantial collection of modern art. It is the only institution that has this number of twentieth-century works in the collection. That was the impression that I had when I went there. ‘We don’t have a museum now. We don’t have a collection in the collection. That’s what I’m here for.” The winery is currently working on a new project, including a new exhibition, and is currently negotiating with the government of Nairobi and the Hirshhorn Museum and Sculpture Garden to present a new edition of “She Persists,” which had been planned for 2019.\n\n\nThe British Museum in Washington, DC, has issued an official apology for excluding a play", "The next Biennial should be held in 2020, and it is possible that the first iteration, “Alberto Krige: The Painter’s Legacy,” which opened at the San Francisco Museum of Modern Art in 2019, will return to the Bay Area.\n\n\nThe Metropolitan Museum of Art (the Met) in New York has appointed Owen Kavanagh as the next director of the institution. Kavanagh is a former president of the Museum of Modern Art (MoMA), where he most recently served as interim director. He succeeds Michael J. Fox, who was dismissed in March 2019, and will assume his responsibilities in April.“Owen brings to the Met an extraordinary breadth of experience and knowledge, as a former director of the Museum of Modern Art, a former chair of the board of trustees of the Museum of Contemporary Art, and a former trustee of both the Museum of Modern Art and the Metropolitan Museum of Art,” said Mark Gardiner, the Met’s board chair. “We welcome him to the Met and look forward to his leadership as we move into our next phase, which will culminate in his returning the museum to its former glory.”Kavanagh will take up his new post in", "The next Biennial should be held in 2021. \n\n\nThe Turkish Ministry of Culture has commissioned the artist Mikhail G.Mashu to create a new work on the scale of the country’s national flag, named for the fourth prime minister, Abdullah Gul, who died in May 2019.Gul was the architect behind the plan and approved of the new work, titled Diyarbakır çocarık, which will sit in the parliament for a year and a half. According to the Art Newspaper, the work will feature thousands of red, white, and blue colors and will span forty-two planets. Designed by Gülen thinkers and architects, the project was approved in January 2019 and is slated to be presented at the upcoming Art Basel show in Hong Kong.Gul came under fire for his decision to step down following the failed July 15 coup against the Turkish government and for allegedly carding anti-coup activists and critics. The police used tear gas and rubber bullets on crowds protesting the crackdown and have killed at least 379 people since the attempted coup. The government also infringed on the rights of LGBTQ people and activists, and the death sentences handed down to individuals charged with terrorism and aiding the coup attempt are still", "The next Biennial should be held in the city of Hamburg in 2021. The first event “Tate Modern: Life on the Move” (2019) was held in the city, and the biennial’s second edition, “Personality and the Body” (2020), was organized in the Berlin suburb of Neukölln. The event will follow a theme of the exhibition, “Being or Nothing,” which is part of a larger project by the Saatchi Gallery in New York to examine the psychological and biological underpinnings of the moving image. Tate Modern is partnering with a German organization to stage the fair, which will include more than 80 exhibitors from twenty-four countries and will run from September 17 to September 19. The full list of participating galleries is as follows:Art Basel\n\nLuxembourg’s Düsseldorf-based gallery Düsseldorf-Institut für Kunststmittelalter (DIU) has announced that it will move the exhibition Art in the City, which was held at the Düsseldorf-Institut from the Museum Freie Kunst", "The next Biennial should be held in February 2020. The biennial will be open to the public for free and will feature works by independent and established artists, as well as works by celebrated and established artists. The 2018 edition featured works by sixty-three artists, including Adam Dusen, Yivlato Mariko, Eva Roslan, and Laura Owens.\n\n\nThe National Trust in Scotland has announced that it will become the first UK museum to shut down following the coronavirus pandemic. Its board of trustees voted to push the closure of the institution, which has a permanent collection of over four hundred thousand works, through March 31, 2020, following a meeting on March 28.The decision comes four days after the board met to discuss its next steps following a four-year investigation into the museum’s conservation strategy. The board concluded that the institution’s current conservation strategies, which include managing the risk of the Covid-19 pandemic spreading to other parts of Scotland, were working and that the only alternative would be to reduce the size of the museum and reduce the museum’s visitors.The trustees said: “The board was unanimous in its decision to endow the National Trust as a result of its current conservation strategy,", "The next Biennial should be held in 2022. Nada Al-Qasimi, the Egyptian curator of modernism, has called for an end to the presence of the Islamist group Ansar Bayt al-Maqdis (Army of Conquest) in Egypt, which has violently suppressed political opponents and persecuted Christians in the country since 2016.\n\n\nThe British Museum in London has made headlines once again with the news that it plans to institute a new policy of national remembrance for the victims of the Covid-19 pandemic. According to The Guardian, the institution is proposing that any memorial that honors a British national be dedicated to the Covid-19 pandemic. The move comes on the heels of a statement issued by British Prime Minister Boris Johnson, who said that any memorial that honors the victims of the Covid-19 pandemic should honor those killed by the virus themselves and not bury them. “The future of memorials for the victims of Covid-19 should not be premised on a commemoration of victims, but a strategy for future action,” Johnson said. “We have already given our citizens a clear choice: we can keep memorializing the victims of Covid-19, or we can do more to tackle", "The next Biennial should include a review of the “300 Years of Maritime Art”– a special exhibition of works by more than 3,500 contemporary artists that will take place at the Maritime Museum in London. The exhibition will also include a special exhibition tracing the journey of the Spanish explorer Pedro Navarro, a show devoted to the Spanish Civil War artist.“The work of the artists we will present at the upcoming Biennial is a reflection of all the times and the spirit of the world,” said Saro-Wiwa. “As artists we are fully aware of our place within the canon of art history and we are committed to working in the interest of our fellow creatives. The goal of the upcoming show is to show the work of the artists whose work we admire and to stimulate our own artistic careers.”\n\n\nAn exhibition at the Sydney Opera House marking the fifty-ninth anniversary of the Sydney Contemporary was postponed due to the Covid-19 pandemic. The exhibition, “The Art of the Body,” was originally scheduled for March 21–March 25 but was pushed back an additional three weeks due to concerns around the coronavirus. The show, which features work by thirty-four Australian artists,", "The next Biennial should be held in late 2019 or early 2020. “I look forward to working with the London-based artists who are inspired by their city and its rich cultural heritage and to exploring new ways of bringing them together to create captivating works,” said James. James will become the first director of the exhibition, which will take place in the former Blacktown industrial site in the heart of London, the Blackfriars area, and Greenwich Village, and will oversee the installation of more than 1,500 works by artists from around the world.\n\n\nThe Leveson Inquiry into Copyright and the Digital Economy has launched a new initiative designed to build on the work of the late British patron J. M. W. Robinson, whose vast archive of more than 4,500 works is under threat from plans to redevelop its holdings.Dubbed “Robinson Archive 2.0,” the program will gather the works Robinson donated to the site of the museum and digitize them as part of a plan to open a new $60 million exhibition in his memory. “The M.E.N. Center for Contemporary Art (MCA) is committed to supporting the reputation of J. M. W. Robinson as", "The next Biennial should review the history of the exhibition space for the last twenty years, and where appropriate, should recommend new exhibition ideas, and should consider whether the current exhibition is in need of reopening.”The first exhibition, “Diana Al-Hadid: The Gate of My Head,” will open on October 3 at the Whitney Museum of American Art in New York. It will run until March 13 at the Biennial in Marseille.The American scholar and educator Neil Armstead will chair the exhibition in March. Armstead will also lead an ecumenical commission, headed by Richard Tenenbaum, and Swinburne Gallery, which will assemble the work of fifty artists from twenty-eight countries in the coming months. Armstead has also organized two exhibitions, “The Streets of Egypt” (2015) and “The Fragments of a Man: Jerusalem Art in the Twentieth Century” (2017), at the Art Institute of Chicago, where they will be staged in conjunction with the American Society of the Arts (ASA), and will present “Soul of a Nation: Art and Politics in the Twenty-First Century” (2019) at the Metropolitan Museum of Art. Arm", "The next Biennial should take place in 2021.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, has appointed Christine Li as the next director of the museum. Li comes to the institution from the now-defunct New York–based firm Skidmore, Owings & Merrill (SAMG), where she has served as senior vice president since 2016. She succeeds Nancy Spero, who retired in February 2018 after eighteen years at the helm of the institution.“Over the years, Christine has been instrumental in creating a strong and diverse collection of contemporary art,” said John Schwalb, chair of the board of trustees. “She is a dedicated manager whose vision and energy aligns with that of our board of trustees, and we are grateful for her service.”Previously, Li worked as a senior advisor to the contemporary art curator and educator Ed Moses. During her tenure with the institution, she helped raise the profile of contemporary art through partnerships with the likes of Robert Irwin, Mark di Suvero, Alexander Calder, and Lois & Clark.\n\n\nMana Contemporary in Los Angeles has announced that it is instituting new policies to protect and enhance the safety of all staff and patrons at the institution, as well as", "The next Biennial should commence in the spring of 2021 and will be guided by the master. It is also supposed to be a collaborative effort, with the collaboration between the two galleries and the master and the artist. The exhibition will be in cooperation with the Guadalajara Cultural Center, the Museo de Cultura y Cultura de Guadalajara, and the Instituto de Cultura y Cultura de Sao Paulo, as well as with the artists of the two venues.The project was first mooted in the spring of 2018, when the artist announced that he was collaborating with the Mexican artist Manuel Aguilar for a project entitled ¡Ya está variabilidad! (Without Fear!)” The exhibition was set to open at the Guadalajara Contemporary Art Museum in November 2022.\n\n\nThe Eugeneia Gallery in London has announced that artist Larissa Moulton will be the next director of Eugeneia’s new permanent collection space, the Eugeneia Gallery. Moulton will be tasked with reimagining how art is presented in the United Kingdom. The artist will create a new exhibition format, which will integrate art from the Eugeneia collection with that from the existing Eugeneia Collection and will collaborate with the", "The next Biennial should focus on the production and distribution of art, rather than the collection of art. “The future of art is a history of the recognition and diffusion of ideas,” said Helen Hirst, chair of the trustees. “This exhibition will inevitably involve the participation of a diverse range of artists, and will ultimately include stories from the local community. We look forward to working with the biennial to ensure that the exhibition will reflect the spirit, content, and diversity of the biennial.”The next edition of the Biennial will take place at the National Gallery in London in 2021.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has named Paolo Cirullo as its next director and CEO. He succeeds Adrienne Edwards, who departed in the summer of 2021 to head the Los Angeles County Museum of Art (LACMA), and will begin his position in January 2022.Cirullo will have the task of rethinking how art museums are funded, expanding the museum’s central location within a cultural corridor that stretches from Central Park in the west to Santa Monica in the north, and will have the opportunity to helm a museum that recently completed a major expansion and renovation, known as the", "The next Biennial should take place in 2020.\n\n\nEvolutionary biologist Dara Doran has been appointed the next chief curator at the Museum of London, where she will assume her responsibilities on August 4. Doran has been a curator at the museum since 1988 and helmed the institution for twenty years. Dorfman Gallery will open a new London outpost in the Tate in April. The new space will serve as a hub for experimental and modern art, curated by Doran.The Tate’s new partnership with the British Institute for Contemporary Arts (BACMA) will begin in April with the opening of a two-week season-long residency program. During the residency, Doran will present a series of solo exhibitions. The inaugural exhibition, “What Is a Cave?” will be on view July 27–August 2. The second exhibition, “Toast of the House,” will open on August 2 and run until September 9.Dorfman will host a series of events under the ancillary title “Toast of the World.” Doran will serve as a curator at the museum for the first time in 2019, when she will take over from Carolyn Ruggiero,", "The next Biennial should be held in the year 2021, which will be the centenary of the end of World War II. The exhibition will include works by seventy-six artists, including Rineke Dijkstra, Edvard Munch, and Walter Gropius. An exhibition of works by twenty-six lesser known and more prominent artists will be staged in the year 2022. An exhibition of early paintings by J. M. Winckler, among which will be part of the same show, will be staged at the Biennale in 2021.The festival, which was founded by the Swedish architect Fredriks Bjarnadøy in Stockholm in 1988, has won the right to host a third edition of the exhibition every five years since 2009. The event, which will take place at the newly renovated National Gallery in London from March 15–March 21, 2022, will be co-chaired by Yoko Ott and Leila Sniderman, who will also serve as the CEO and director of the National Gallery. Sniderman, a former curator at the museum, said: “We have come a long way since the first edition (in 1988) and I am very proud to be able to lead this year’s", "The next Biennial should decide whether it is interested in exploring the possibility of a singular institution’s separation from the State. Such a step would not only be an important step toward realizing the aims of the exhibition, it would also focus our attention on the institutional framework.\n\n\nThe Producers Guild of America (PGA), one of the largest independent film production organizations in the United States, announced on Monday that it is closing its doors. The organization had been a fixture in New York City’s arts district since its founding in 1981. It has locations in New York, New Orleans, and St. Louis and has a paid staff of thirty-eight people. The Guild’s annual awards, which were established in 1984 to encourage independent film activities in the city, have been supported by a $250,000 grant from the Rockefeller Brothers Fund. The organization’s current executive director, Craig Schulz, will assume leadership of the Guild in April.“The Guild has been an irreplaceable force in the arts and culture community in New York City for more than thirty years,” said Paul Mpagi Sepuya, the festival’s executive director. “While the Guild has had an enduring and positive impact", "The next Biennial should be held in 2021.\n\n\nA federal judge in New York has temporarily blocked New York City from implementing new gun safety regulations due to fears that the legislation will infringe on First Amendment rights. The ruling came after the city council voted to allocate $3.6 billion for federal grants, and President Donald Trump signed legislation into law on March 26 that will drastically reduce funding for the NYPD and other law enforcement agencies.The lawsuit, brought by the New York–based Coalition to Stop Gun Violence (CGSV), was originally filed by the advocacy group Safety First, which argued that the regulations would hinder law enforcement efforts to prevent and enforce crime. In a ruling issued on March 22, U.S. District Judge James Orenstein found that the CGSV’s request for a preliminary injunction was granted, and granted the group a second request for a temporary restraining order that would stay the new regulations in place for ninety days, or until October 28, when the legislation is expected to be signed into law.In his majority opinion for CGSV, Judge Orenstein wrote: “The City fails to show that there is a likelihood of a material adverse effect on legitimate First Amendment interests. Rather, the City", "The next Biennial should be held at the Pictet Gallery in London, with production scheduled to start in March 2020. The exhibition will include works by artists such as Wolfram & Schirmer, Lindsay Duncan, Helen Frank, and Alice Molesworth.The biennial will also include new works by the award-winning artist and scholar Harald Szeemann. Szeemann will present his first monographic exhibition at the Getty Center in Los Angeles in the spring of 2020.Commenting on the new initiative, Sarah Burke, director of the Getty Center, said: “We are thrilled that Harald will be returning to the Getty in 2020 to present his first Biennial exhibition within the center. Harald is a distinguished scholar and a champion of the visual arts, and we are grateful for his outstanding service to the institution in providing us with the opportunity to share his work across the globe. Harald has been an outstanding champion of the visual arts and continues to be the driving force behind the Getty’s ambitious plans to present ten more exhibitions each year across five venues. Harald has also been a valued partner and friend of the Getty, and we are proud to have him in our family.”\n\n\nAs the number of people", "The next Biennial should take place in 2020. \n\n\nThe Smithsonian’s National Museum of African Art in Washington, DC, has received $6 million from the Corporate and Community Partnerships for African Art (CCPA), a new initiative established by the Coronavirus Aid and Relief Fund (CARFF), the 3rd International Conference on Art Conservation (3ICAC), and the Amada Cruz Foundation. According to a statement issued by the museum, the funds will allow it to expand its collection, which currently consists of approximately 50,000 works, and to host more exhibitions. The institution also plans to conduct more research and will work with a more diverse cohort of artists. “The funding for the National Museum of African Art is a key step in the process of ensuring that the millions of African American and African diaspora artists and collectives across the country are able to enjoy the benefits of the Coronavirus Aid and Relief Fund’s [the Coronavirus Aid and Relief Fund is a privately-owned non-profit organization that was founded to address crisis after CARFF’s Criminal Justice Reforms] grants", "The next Biennial should be announced as soon as possible. We will follow the progress of the exhibition closely and will present updates with you.\n\n\nThe National Museum of Fine Arts (NMA) in Washington, DC, has received a $30 million donation from the Beacon Arts and Culture Foundation, which was established in 2009 to solve the country’s art and design challenges. The gift will be used to establish a new fund to support the institution’s work in support of the emerging generation of curators, art historians, and other cultural workers.“We are thrilled that the Beacons will continue to support the NMA in providing unparalleled opportunities for our artists, scholars, and curators to experiment and reimagine how art can change the world,” said NMA director and CEO Jane Kagan. “The NMA’s unique history of bringing contemporary art to our cities and exploring ideas of art and design through exhibitions and public programming, as well as the museum’s vast collection, make it an ideal platform for advancing critical public engagement with art and design and our curators.”The National Council on Art and Design (NCAD) in New York City has released a new set of guidelines on the display", "The next Biennial should be held in 2021. Once completed, a new exhibition of the artist’s work will open in the United Kingdom at the end of the year.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Michael Kelley as its next executive director. He succeeds Brittany Liebling, who departed in the summer of 2021 to head the newly formed Center for Contemporary Art (CAAM), and will assume his responsibilities on March 8.“Michael is a seasoned leader who has been instrumental in advancing MoCA’s mission to highlight and celebrate the work of emerging and established artists, particularly under the aegis of Richard Diebenkorn, to transform our understanding of art history and our appreciation of art,” said director Krishna Menon. “His leadership qualities, expertise, and passion for curating and exhibiting work will ensure that we continue to thrive in the challenging and exciting world of contemporary art.”Liebling, who has helmed the museum since 1998, started her tenure at the center in 2016. During her tenure, she oversaw a number of initiatives, including the promotion of artists from the list of permanent curators to the top tier of curators, the launch of the", "The next Biennial should be staged at the Stedelijk Museum in Amsterdam in 2021. The next edition of the conference, which will take place in November 2022, will include a selection of works by artists whose work has recently been published by Het Parool, the Amsterdam-based publisher founded by Peter Zooink.\n\n\nFrench artist Emmanuel Léger, whose monumental Constructivist–inflected paintings often embrace life and its physical form, has died at the age of eighty-five years old. The Kunsthalle Basel in Switzerland has confirmed his passing.Léger’s paintings are often a bit too much like life for the time they depict, often taking as their subjects the physical act of walking, standing, or lying down, and often experience a \"god-like\" quality about them. He was born in Paris in 1940, the son of a laborator, and grew up in a Catholic household, attending Catholic schools and attending the Catholic church. He went on to study the history of art at the University of Paris, where he met his wife, the Dutch artist Willem de Kooning; the pair moved to the Netherlands, where Léger studied painting at the University of Applied Arts in Vienna. Lé", "The next Biennial should include a discussion with regards to the exhibition of the work of the artist in question, an open forum that can be reached anytime. “The exhibition of the work of the artist is one of the most important aspects of the exhibition,” said curator R.L. Medvedev. “The exhibition of the work of the artist is the most important part of the exhibition, and must be developed at the most crucial moments.” She added: “We must clearly and clearly manifest the idea of the exhibition, and not merely consider the exhibition.”In an attempt to mitigate the exhibition’s impact, the Biennials have shifted the exhibition from its original venue in the Kamchatka State Museum of Art to the Prishtina, the National Gallery, and the Central Institute of Art History in Moscow. The exhibition was originally scheduled to run from May to November next year.\n\n\nThe Solomon R. Guggenheim Museum in New York has appointed Jennifer Wilson as its new deputy director and chief curator. Wilson comes to the institution from the Metropolitan Museum of Art in New York, where she has served as the director of collections since August 2016. She succeeds retired director Daniel H. Weiss", "The next Biennial should be held in 2020. “This year’s exhibition was a milestone for us, featuring work by artists who were not previously represented in the Biennial,” said co-organizer Manuela. “It was a great honor to present their work and to create an exhibition that celebrates the history of modern art.” During the event, which was organized in partnership with the Bibliothèques Makrém et lumière, the artist Philip Glass, and the German designer Arne Büttner, an exhibition design by the artist Otto Adler was also presented.\n\n\nThe Fine Arts Museums of Antwerp (Fam) and Kinsale (Kinsale) in Belgium have been named the winners of the second edition of the Antwerp Biennale. Organized by the Flemish contemporary art organization FOTN, the event will take place at the AMAM Museum in Antwerp from April 23 through April 29 and will include a special reception and a symposium. The 2015 edition, entitled “The Future Is Present,” was held in the Dutch city of Utrecht and featured work by forty-three artists and twenty-nine cur", "The next Biennial should begin in April 2020. Those who wish to participate must register in advance and will be required to present a signed statement of participation from the artist. The first edition of the Biennial, titled Unity, was held at the Kennedy Center in December 2017. The second edition, titled Equality, was held at the Cleveland Museum of Art in April 2020.The 2020 edition will be hosted by the University of Chicago. The 2019 edition, titled Longing, was staged by the New School in New York. The event was curated by Ruth Pinckney.\n\n\nThe Royal Academy of Arts (RA) in London announced today that Virginia Rummel has been appointed as its new director of collections and exhibitions. Rummel will take up her new post on February 28. She succeeds Jamie Stone, who retired on February 24 after a decade at the helm of the RA. Stone will remain at the institution until March 2019.“We are delighted that Virginia has accepted the role of Director of Collections and Exhibitions,” said Jamie Stone. “Her expertise and energy are essential to ensuring that the RA continues to thrive as an international cultural institution.”Rummel came to", "The next Biennial should include a discussion of the legacy of the Penguin, the Museum, and the Art of Flight, as well as the future of the Art of the Universe. The Gallery of Modern Art’s meeting of the newly created Contemporary Futurism, together with the upcoming exhibition “Modern Art in the Age of Mechanical Reproduction” in the Far East, will be held in the autumn of 2020.The Biennial program will be organized as follows: The Biennial is a transformational platform for the collection, display, and research of contemporary art. Its mission is to bring together contemporary art from around the world; to create an audience for contemporary art; and to present contemporary art from the most compelling artists and institutions in the world. The platform is also an incubator of new projects that will engage with the themes and ideas of the forthcoming exhibition. The 2018–19 season featured the exhibition “Becoming a Modernist: Art, Technology, and Technology” and the biennial’s inaugural event, “Towards a Future of Tomorrow: Art, Technology, and the New Tomorrow.” The biennial will be held at the invitation of the biennial’s curators,", "The next Biennial should happen sometime in the next three years.”This year’s event, titled “The Wind and the Rain,” will showcase the work of forty-nine artists. In addition to the works on display, the biennial will include a new Maurice Sendak book, which will also be presented by the National Gallery of Art.This will be the 75th edition of the National Museum of American Art, which will be held at the Smithsonian’s David D., and will be the first time the museum will host a major exhibition of works by a single artist. The museum has hosted dozens of exhibitions of work by artists in recent years, but none that focused exclusively on African American art.\n\n\nThe Institute of Contemporary Arts (ICA) at the University of California, Los Angeles (UCLA) has received a $30,000 grant from the 50/50/100 Fund, a $15 million initiative that is devoted to supporting artists and cultural workers in the United States. The award, which was announced on Thursday, June 21, comes with a $20,000 stipend and was granted to Poppy Pierce, a UCLA doctoral student in philosophy who has been working on a project", "The next Biennial should aim to\n\n1. emphasise the collective memory of the contemporary artists who made significant contributions to the history of art\n\n2. underscore the positive contributions of individual artists in mitigating the impact of the pandemic on their respective communities, and\n\n3. consider how the biennial will contribute to the long term advancement of Biennial Theory and to\n\n4. create a dialogue with other cultural institutions, scholars, and institutions, in order to highlight the importance and progressive nature of the work of individual artists.\n\n\nNew York’s Metropolitan Museum of Art (MoMA) and Boston’s Beacon Theatre will collaborate once more to stage a retrospective of Leslie Aitken’s work, Sitting on the Floor, in the second of four installments scheduled to open in 2020. The fourth and final installment, which will be staged at the Museum of Modern Art, will examine the work of contemporary artists whose work was included in the first two exhibitions.“The Met and Beacon Theatre are committed to exploring the vast range of work that is produced in the United States, and around the world, and to presenting works that are particularly in demand by our contemporary audiences,” said Peter Rosenthal,", "The next Biennial should take place in the spring of 2021. In the meantime, the institution will continue to host events and exhibitions as scheduled. The Biennial will be held in the Arts and Culture Hall, which opened to the public in 1973, and in the adjacent Mpagi Sepuya in the Mpagi-Nqakuruma region.The 2018 edition of the Biennial, which was organized by the Contemporary Arts Center (CAC), also included a presentation of work by a long list of African artists in addition to the fifty artists represented by the CAC\u0097including Akuwa Nzimande, Alger Betti, Schuwirth Mpagi Sepuya+Nziki Nteta, and Ally Muggeridge. Last year, the institution also unveiled a new venue for the Museum of Contemporary Art (MoCA) Birmingham, a new collection of photographs by Anton Chekhov, and a new exhibition, “The Magician and the Thief,” which will be featured in the first full season of the show.\n\n\nThe City of Richmond, Virginia, has released the list of twenty-six artists whose works will be featured in the upcoming biennial of contemporary art", "The next Biennial should be hosted at the Museum of Fine Arts, in partnership with the newly formed Public Art Fund, a $250,000, nonprofit organization founded by philanthropist and collector Annick Pedrosa. The upcoming edition will be held at the museum, which is currently undergoing a $260 million expansion, and will feature new content and works that were selected by Pedrosa’s board of directors.“Art is an essential and powerful tool for human well-being and the future of our planet and we are really excited to create new works by artists that address these issues and that will really help us understand the impact of art on our world and community,” Pedrosa said in a statement. Pedrosa and her husband, Benoit Pedrosa, established the Public Art Fund, an organization that works with foundations, trade associations, and local governments to support arts and cultural enterprises serving the community. Among the organizations that have received support from the organization are artist’s studios, arts centers, arts education and awareness organizations, arts and culture organizations serving artists and artists’ communities, and arts education and advocacy organizations. Pedrosa’s plan for the next iteration of the exhibition is to either organize or", "The next Biennial should feature works by thirty artists, including Siddhartha Nath, who created a work titled Aura of Anger (2017), which takes the form of a space that is full of dead men and women and can be found in the exhibition. The next edition of the Biennial will be held in the city of Mumbai.The show will also include works by artists such as Rajesh Trivedi, who created a work titled Amagami (2019), and Younus Barqa, whose work is currently on view in the exhibition “Gumby,” which is on view until November 19. The show will include the first-ever solo exhibitions of work by the Phanar and Zoya artists in India.The show will also include a conversation with Code and a video work by the British Pakistani artist Anwar Ali, who will present a question and answer session with the show’s curator Andrea Panetta.\n\n\nThe National Gallery in London has announced that it will cancel the next edition of the National Poetry Slam, which was inaugurated by David Foster Wallace in 2006 and won the prestigious literary award in 2018. The seventy-fourth edition of the National Poetry Slam", "The next Biennial should take place at the Institut de la Photographie in Paris in 2022. If the theme of the exhibition is “Et un Instant,” the next Biennial will be entitled “Et Un,” and the 2020 edition will be held in October. \n\n\nThe Danish Museum of Fine Arts (Dansk Museum) announced today that Berit Bälin, who has served as the director of the museum since 2011, will become the next director of the Stedelijk Museum, Amsterdam. Bälin will be in charge of the museum until 2022, when it will reopen to the public. During her tenure at the institution, she has organized numerous exhibitions and staged numerous concerts and performances.“Berit Bälin’s growing passion for art and her commitment to boosting the stature of the Danish art scene, both in the Netherlands and internationally, truly stands out,” said Rødiger B. Nielsen, chair of the board of trustees of the Dansk Museum. “She is admired and appreciated by her peers and colleagues for her ability to effectively manage key institutions and to secure the museum’s future with important investments. We are proud to support her ambitions for the", "The next Biennial should be open in 2022 and should draw a total of 30,000 visitors.\n\n\nThe Museums Association (MA), the professional association of museum directors, has condemned the European Court of Human Rights (ECHR) for ruling against a ban on construction and renovation work in the United Kingdom following the outbreak of Covid-19, AFP reports. The decision followed years of lobbying from British museums, including the Metropolitan Museum of Art, London, and the National Portrait Gallery, Leicester, which had campaigned against the ban in the run-up to the pandemic.Speaking at a group event held at the Museum of Contemporary Art, London, on Wednesday, the association’s director, Charlotte Leslie, said: “It is a terrible blow for British culture and for the British people to be forced to resume the work of some of our most talented and dedicated staff and to continue to let this terrible crisis worsen. It is a loss of control, not just for Britain, but for the entire European continent. It is also an affront to freedom of expression and the European Union. The court has handed a powerful blow to the European Union’s attempt to stifle artistic freedom and to ban certain projects in an attempt to punish the", "The next Biennial should include an interim exhibition of works by artists not represented in the main series. The final exhibition will focus on the impact of the pandemic on the arts. The board members also acknowledged the work of the academic and curators who have inspired them, and the generous support from the museum’s staff and supporters, including the institution’s senior director of support Anne Clark, the museum’s curatorial director, and director of the Bénédicte de Montlaur.\n\n\nThe Kawasaki Museum of Art in Japan is planning to scrap a three-year-long exhibition featuring work by a group of American artists, including Bridget Riley, David Selwyn, and Amy Sherald, whose silks, cotton, and canvas installations, which have been on display since November, are being reimagined as an annual program of events. The exhibition was slated to run from December 14 to December 21, 2019, but was postponed due to the Covid-19 pandemic. The 2019 iteration of the exhibition, titled Kawasaki Summer, was originally scheduled for November 20 to March 3, 2020.The museum will re-do the installation, which has been a part of the institution’s programming", "The next Biennial should be announced soon.\n\n\nThe Museum of Contemporary Art (MCA) in New York has appointed Anne-Marie Tompkins-Rivas as its next director. After serving as head of the MCA from 2016 to 2017, she is now being considered for the position of chief curator at the Atlanta Museum of Art (A.M.A.), Georgia’s largest museum.“During her tenure at the MCA, Anne-Marie expanded the museum’s collection and exhibitions, expanded the programming that we offer through new exhibition formats and in-house curatorial initiatives, and introduced new opportunities for artists to create new works in our collection,” said David Green, executive director of the A.M.A.T., which is running a fundraiser for the museum that will run from September 3 to September 14. “Anne-Marie’s leadership and achievements in the field are tremendous, and we look forward to her continuing to shape the A.M.A.T. and working with the collections and exhibitions of the MCA, in our commitment to the arts.”Former director of the MCA, Daniel H. Weiss, who started his tenure at the museum in 2006, will serve as", "The next Biennial should be held in 2021 and was originally supposed to be held in 2020. Ten years later, in March 2019, the exhibition was moved to 2022. Then, in June 2020, the exhibition was moved again. The 2019 edition, which was staged in London, was cancelled.The 2019 edition, titled “Ateliers Biennales: Réalité” (Ateliers di Paris), showcased work by thirty-six artists. The biennial was held in the city’s Centro de Cultura Artes in the northern city of Ribeirão, on the Northwest coast of Brazil.The 2019 exhibition was organized by the German-born Sofia-based curators Oliver Lane and Janette Laverrière and featured work by forty-two artists, including Anton Kern, Agatha Christie, Kiki Smith, Peter Castellanos, and Robert Irwin.The 2019 exhibition was curated by Christine Turk, who was appointed as the biennial’s curator in March. It opened at the Museum of Contemporary Art (MoCA) in London on March 30, 2019 and ran until April 21, 2019. The exhibition was sponsored by MoCA, the European Commission, and the Rijks, and it featured work", "The next Biennial should include a memoir by the artist and the writer, as well as a show by the artist and the video game developer, which is currently on view through December 20. The exhibition will also include the work of twenty-nine other artists, including Hans-Ulrich Obrist, Wolfgang Pfeifer, and Alfonso Ribas, and will be held in the artist’s studio in Frankfurt, Germany, and will run concurrently with the Biennial d’Art Contemporain.\n\n\nThe National Gallery in London has announced that it will no longer be able to hold its annual reception, “the National Biennial,” this autumn, as planned. The announcement came after it informed the public that the event would not resume this autumn following a change of plans because of the ongoing health crisis. “We fully support the decision by the National Gallery to make, in the interests of patient safety and security, a difficult decision for everyone involved,” said a statement issued by the gallery. As part of the health crisis, the gallery has laid off fifty-two full-time staffers, displaced sixty-six on contract, and is preparing to furlough or reduce the hours of some eighty staff members. Staff", "The next Biennial should be held in the summer of 2021.\n\n\nThe German government is planning to spend more than $130 billion on a new $2 trillion plan to rebuild Germany after a massive explosion and fire in the city of Friedrichshain in West Germany on December 9, 2017. The reconstruction works are being led by the Krefeld-based firm MCH Group, which is also responsible for the new namesake building, the Krefeld Museum of Contemporary Art (KMCA), which opened in January 2018.The reconstruction of the Schlesinger-Prussian Cultural Center, which dates to 1892, will cost an estimated $127 million and will be carried out by the MCH Group and the Reitveldt-Bauhaus Foundation, both of which are headquartered in the city of Krefeld. The rest of the project will be funded by the state of Hesse, which will provide $74 million and $53 million, respectively.“We are immensely grateful to the German government for its resolute support of the design and construction of the new MCH Group Berlin,” said Stefan Hütte, the chairman and CEO of the Krefeld-based firm MCH Group. “We are confident that the Krefeld Museum", "The next Biennial should be held in 2021. \n\n\nThe British Museum (BMI) announced today that it is expanding the curatorial team of its current exhibition, “Art in America” with four new hires. The biennial, which returns to the museum next week, will focus on presenting contemporary art in the United States through the collections of four continents: Asia, Europe, the Middle East, and Africa.The biennial will be organized as follows: “Art in America” will feature works by twenty-four artists and will examine the ways that the invention, dissemination, and display of contemporary art is now integrated into our lives and daily lives. The exhibition will showcase the work of award-winning artists including Mark di Suvero, Tanya Hoff, Yolande and Michael Kay, and will feature new works by artists such as Adam Clayton, Joël & Anna Miro, and Tanya Rozenblad, among others.“We are delighted that these four talented individuals have been selected to join our team at the British Museum and will encourage them to continue to shape the exhibition by developing new ways of assessing and presenting art from the collection and addressing topics of art history, contemporary art, and art and art and", "The next Biennial should be held in 2019.\n\n\nThe French Ministry of Culture has announced that it has created a new four-hundred-and-fiftieth-anniversary commission for the exhibition “Deuxièmes et désirs: Les ouvertes” (The Unseen, the Unseen II, the Unseen III). The 2019 iteration of the three-hundred-and-eighth edition, which opened on December 3, will feature work by twenty-one artists and will run through March 20.“The new commission will be a continuation of the work and a response to the current situation,” said minister Christophe Deha, who also added that the theme of the biennial was not changed. Deha said that the new work will be “taken as a tool for reflection on the catalogue and the exhibition, which is the central element of the exhibition,” and will be “an extension of the exhibition, which aims to offer a variety of perspectives.”The biennial, which was organized by the Ministry of Culture in collaboration with the Paris-based architectural firm Bernard Halsall and the architect Christophe Deha, is one of seven channelled", "The next Biennial should be held at the Stedelijk Museum (SMC), Amsterdam, in 2021. The next Biennial, which will take place in the city of Antwerp, Belgium, will be staged in the Netherlands in 2023.\n\n\nThe Japanese fashion industry is facing a major crisis that could destroy one of its major revenue streams: the pre-election season. The Tokyo Metropolitan Government announced on Friday that it plans to introduce a tax on luxury goods sold in Japan and overseas. According to the Japan Times, the National Museum of Fine Arts (NMA) in Kyoto, which was forced to cancel a number of exhibitions before the 2020 elections due to the pandemic, is one of the groups that is being targeted.The announcement followed an announcement by the Japanese government that it will introduce a tax of around 9 percent on luxury goods that enter Japan from China. Since luxury goods are a major business for the NMA, which has more than 230,000 square feet of exhibition space, the move will generate revenue for the government. The limit on items that can be imported into Japan from China is 5,000 pieces per year. The ministry estimates that the tax will raise $12 million for the NMA, a sum that will be distributed by", "The next Biennial should take place in 2022. Coincidentally, the fifteenth was also held in 2022. Will and Dorota are no longer involved with the festival, following an agreement over the matter reached in September 2018.“Since Dorota’s agreement with the festival was signed in September, there was no reason for us to set about preparations for the exhibition in 2022,” said the artist. The first edition of the biennial, “Signs of Life” (2019), premiered in Paris on September 27 and ran until October 29. The second edition, “Notions of the Material,” (2018), opened in Berlin on October 20 and ran until October 27.“The struggle with the exhibition was not only an obligation but also a duty,” the exhibition’s director, Ursula von Ryding, told the New York Times. “We only had one thing to lose: the money.”The twelve artists participating in the fifth iteration of the exhibition are: Adrián Aguilar, Laura de Cinéma, Sander & Witte, Tomájy, Michelangelo Bonisoli, Jean-Michel Huyghe,", "The next Biennial should be held in 2020. The decision to postpone the 2020 event was made in order to “remain true to the vision of the last two years,” dismissing the possibility of holding the event in 2021. “This is a challenging time for all of us, but especially for art,” said Rose-Marie Salzmann, chair of the board of trustees of the Biennale d’Arles. “We are committed to working with all the partners in order to create a new platform for contemporary art and are optimistic about the future of the project.”Approached by an art historian who was familiar with the board’s decision but who wished to remain anonymous, Salzmann said that the board was not making any new art as a result of the delay and that the 2019 show wouldn’t have taken place if the museum had postponed the 2020 event. She also said that the board has not changed its mind about the exhibition, which will run alongside the forthcoming biannual Biennale d’Arles. The board of directors of the Biennale d’Arles, which is headquartered in the old Y-block building in", "The next Biennial should be held in 2021, but given the exceptionally slow pace of this year’s exhibition, it is unlikely that '20 will be pushed back further than 2021. For the duration of the four-year event, Wallace and her team will continue to develop an exhibition that celebrates the exhibitionists of the twentieth century. “The next Biennial will continue to be about the exhibition, and about the exhibitionists,” Wallace added. “The question is, when will the exhibitionists be the main point of reference for the rest of us?”\n\n\nThe art school in New York City that suspended graduate students after a group discussion about the upcoming reopening of “Boss”\u0097a fictional dystopia in which humans work together in a global labor pool to produce artificial life\u0097has been ordered to pay $30,000 to the students who were dismissed for their “incomplete understanding of the work and how it was presented.” The settlement, which involves the school for at least three years, comes on the heels of a $15,000 fine the school was ordered to pay the students for violating the privacy of another student.Students at the Decatur Art Institute (DAI) were suspended", "The next Biennial should be held at the new museum in 2020. The institution has announced that it plans to present the exhibition “Tit for Tat.” The exhibition is a collaboration between J. M. W. D. and the artist and will take place in the former space of the University of Chicago’s Art Gallery. The biennial, which is being organized by the Chicago-based, nonprofit organization Pontificors and will be hosted by the museum alongside the 2017 event “Gwenets: A New History,” will feature twenty-four original works by thirteen artists. The full list of participating artists is as follows: A. A. Al-Kamāl (Baltimore) Angel Roesler (New York, New York)Ana Adrián (New York)Arts of Life (New York)Bernd and Jürgen Hauser (New York)B. Ejaz Salih (New York)B. H. L. Fischer (New York)B. M. Al-Kamāl (New York)B. N. A. F. (New York)B. W. O. R. (New York)B. W. R", "The next Biennial should take place in 2023, and the first in 2021. • The Museum of Contemporary Art (Miami Beach)’s replacement exhibition, “The Rendering of Modern Life” will not reopen. The Miami Beach Art Museum is still working through the possibility of reopening as early as 2021.\n\n\nThe Flemish artist Joi Ito has received the prestigious Prix Jean-Michel in Brussels for his installation, Hayetu, 2013, which features a sculptural and a video work that address the impact of the recent European migrant crisis. The piece, which was produced in collaboration with a team of eighteen artists and is currently on view in a new exhibition at the museum, was created in response to the European Union’s migrant policies and the migrant crisis.“Ito’s installation is a response to the migrant crisis, and the sculpture’s political and social content,” Melissa Trock, a curator at the Flemish National Museum of Modern Art (N-V), told the Art Newspaper. The installation, titled Hayetu, 2013, a play on words, was created to address the crisis of migrants and refugees in Europe.", "The next Biennial should be held at the Museum of Contemporary Art Los Angeles in 2021.\n\n\nThe National Galleries of Scotland are moving the exhibition “Lincoln” from the Tent to the Gallery, after the UK government scrapped the institution’s annual £75,000 Lincoln Grant. The move has angered arts professionals and led to a fierce backlash from activists across the UK. In a letter sent to the institution’s director Nicholas Cullinan, dated March 5, the day before the move was announced, thirty-one leading arts professionals signed an open letter condemning the change. The letter claims the move violates the spirit of the annual grant and the historic trust that exists between the National Museum and the Crown. “In light of the government’s decision to remove £1.1 million from the National Mall in London, it is the National Galleries’ intention to reassess the financial sustainability of our annual grant, and to come to a decision which is mutually acceptable to both the National Museum and the Crown.”The move has also sparked outrage from national and international arts organizations. The Association of Musicians and Poets (AMP), which represents the artistic and cultural producers and distributors of the UK, called the move", "The next Biennial should take place in Brussels in 2021. The venue will be chosen by the Belgian Art Foundation, which is owned by the Brussels-based biennialist Bénédicte Savoy and the Belgian state, and will be hosted by Lucie Bont, president of the city of Brussels. “I am very happy to be going back to Brussels to help the city with the construction of the new exhibition that will take the place of the Biennale,” Savoy said.The Biennale’s opening in 2022 is still on track and the twenty-third edition, which will take place in 2023, is currently on track to coincide with the opening of the new exhibition. The institution is planning to open a new exhibition, “Ateliers d'art et d’hétiques,” in the spring of 2024, but it is not yet certain when this will take place. \n\n\nThe museum of art in central Florida is planning to open a new permanent collection of works by and about Native American artists in 2018. According to the Art Newspaper, the forty-second edition of the festival, titled “Art in the Land,” will be held in the spring", "The next Biennial should be held in the United States, and the first at the end of 2019. In a letter dated May 30, 2017, the organizers wrote: “We welcome the possibility of new international exhibitions and projects coming to the Biennale, but we must avoid the question of whether the exhibitions should be in different locations, since that is a question for the museum. We are keenly aware that the Biennale is an international event, and that the best way forward for the exhibition is to assemble them all in one place.”Since the presentation of the first Sundance Biennial in 1978, Biennale organizers have staged eighty-six exhibitions of works by eighty-six artists, including William Kentridge, Mario Cipolletta, Jean-Michel Basquiat, and Jean-Michel Vermeer, and have attracted more than three hundred million visitors. In addition to the exhibition program, the museum has been transformed by more than twenty-five years of construction, when it opened in 1997. The contemporary museum, which consists of three exhibition spaces, a library, and an archive, is also notable for its foundation, the Biennale Foundation, which was founded by Larry and Nancy Baker, the founders of the", "The next Biennial should be held in 2021 and will be hosted at the Foundation for Contemporary Arts (FCA), London. \n\n\nThe Museum of Southern Art (MSSA) in Savannah, Georgia, has appointed Laura Williamson director of the upcoming exhibition “Southern Art: From the Gilded Age to the Black Lives Matter Movement.” She succeeds Angela Casteel, who retired in March 2019 after seventeen years at the helm of the institution.“Laura’s thoughtful leadership and commitment to the nearly seventy-year history of the MSA make her an ideal fit for the role of director,” said museum director and CEO Lillian Gish. “As we look toward the future, we envision a MSA that is thriving in the post-recession years and one that is grateful for the many years of service to the community. Laura’s vision and ability to translate it into a strategy for continued growth and development will be especially timely as we prepare for our fiftieth anniversary.”Commenting on her appointment, Williamson said: “I’m excited to support the MSA’s contemporary practice through the work of the Gilded Age–era collection and to bring our exhibitions and programs to our", "The next Biennial should be held in the autumn of 2020, with a series of exhibitions from 2019 to 2020. The theme for this year’s event will be “It Is Not Over,” reflecting on the global conflict in Syria, as well as the crisis of the Arab Spring, and the exhibition will be curated by the director of the Kunsthalle Basel, Alexander Stoppanello, and will be led by a group of curators comprising Andrea Carbonelli, Lise Gallien, Andrea Maritti, Laura Pizzoli, and Stefano Cattelan; biennial director Andrea Magnani; and the curator of Modern Art, Martin Gamst; the theme will be “The Past Is More Important Than The Present.”The full list of exhibitors and the programme of programming for the ten days of the exhibition can be found on the pavilion’s website.\n\n\nThe State Museum of Fine Arts (SFA) in New York has appointed João João Pimentel as its first director. In his new position, Pimentel will be responsible for financing new works, curating exhibitions, and serving as a liaison between the museum and the local community.“", "The next Biennial should be organized at least three months after the conclusion of the Exhibition. The biennial will include curated exhibitions on different topics.The exhibition “The Artist’s Work,” will be on view alongside works by Marcel Proust, Pierre-Auguste Renoir, and Pierre-Auguste A to Z, as well as a selection of works by artists who have been marginalized in Western art history. The work will be on permanent display at the Museum until March.Floating Art: A Retrospective is also developing a new collection of work by Richard Avedon, which will be on view in the spring. The exhibition will mark the forty-fifth anniversary of the show, which will move from the Tate to the Somerset Arts Centre, in London.\n\n\nThe Contemporary Art Museum St. Louis (CAMST) in Saint Louis, Missouri, has appointed Lauren Wintemute as its new executive director, effective immediately. Wintemute will be responsible for working with senior leadership to implement a new long-term strategic plan and oversee the institution’s expansion into a museum and an urban farm.“We are extremely excited to see Lauren’s leadership come to fruition as an autonomous organization with the", "The next Biennial should be held in 2021. The deadline for the institution is February 29. \n   The Tiananmen Biennale will be held in Tianjin from March 17 to March 22. The opening of the exhibition is March 8.A full list of participating artists can be found here. \n\n\nThe Museum of Contemporary Art (MoCA) in Atlanta announced today that it is collaborating with the Sun Ra Arkestra Foundation (SRAF) in Armenia to create a new master plan for the campus, to be titled the Sun Ra Arkestra Campus. The plan, which is slated to be completed in 2021, will include the renovation of the existing Museum of Contemporary Art (MoCA) in Atlanta, and will address the revitalization of the surrounding public realm, including the Botanic Gardens and the Botanic Pavilion.“The Sun Ra Arkestra Foundation is committed to supporting the Museum of Contemporary Art in Atlanta with ambitious projects that will demonstrate how art can solve all of our challenges,” said Mark Rubin, chair of the museum’s board of trustees and president of the Sun Ra Foundation. “We respect the decision by MoCA to work with SRAF on", "The next Biennial should be a celebration of the memory of the five memorialized Revolutionary War soldiers—Hamilton, Laure, Jefferson, and Adams.  The five are associated with the battle of Gettysburg, which took place on July 1, 1863—the day the biennial was founded—and were buried in the same cemetery. \n\n\nA group of artists and activists in China are using social media to urge the government in Beijing to compensate them for lost income and demand greater protections from censorship. The artists are asking China’s State Administration for Press, Publication, Radio, Film, and Television (SCMP) to recognize the collective names and locations of all the works that were censored or postponed in an attempt to erase historical controversialities, and to pay them compensation.“We have received numerous complaints from artists and artists’ organizations about the current situation in China, and we believe the government must take immediate action to protect their livelihoods,” David Salle, executive director of the Association of Documentarians in China, told Artnet. Salle noted that the action currently being taken by the government is insufficient: “In order to protect the artistic freedom of artists, China’s state-run media need to be", "The next Biennial should be staged in 2020.   A year later, the Marylebone Museum of Art in London announced that it would stage a biennial for Safariland, a company that offers plastic surgery in the United States.  The structure of the exhibition, titled Saferst, has since been revised to include an additional twenty-one works by the artist, including Suey Ngai, Harriet Lindemann, and Rohit Jawah, among others.In the sixth edition of The Art of Beauty, held in New York in March 2010, Suey Ngai—whose practice spans conceptual and physicality—explores the virtual world through her paintings, sculpture, installations, performances, and videos. \n\n\nA new study conducted by researchers at the University of Pennsylvania and the Massachusetts Institute of Technology (MIT) has found that more than ninety percent of American museums are currently closed and will remain closed for months or years to come. The study analyzed data from a survey of more than three hundred museums and found that eighty percent of U.S. museums are currently closed and will remain closed for at least a year or more.The findings were released as part of", "The next Biennial should be held at least once a year.” \n\nThe Mid-Atlantic Council of Museums has released its 2020 edition, “Museums: The Future of Art.” The twenty-fifth edition, which will take place at the Amelia Island Museum in Scituate, Massachusetts, will mark the first time the museum will host two exhibitions simultaneously. “The museum is currently experiencing a rapid expansion as we build upon our current exhibition-based model,” said museum director Janice Rogers. “With the redesign of the Amelia Island Museum, we have added the opportunity to present two exhibitions simultaneously, which is a novel approach for an exhibition that was conceived and envisioned as a single venue.” The redesign, which was implemented in collaboration with the Massachusetts Institute of Technology (MIT), increased the museum’s footprint by more than twenty thousand square feet and increased the duration of the exhibition by three weeks. The annual exhibition, which will run from March 15 to March 15 and will feature twenty artists, will also be open from 8:00 AM to 5:00 PM.“We are thrilled to introduce our new exhibition format, which will introduce the public to a unique selection of the work of", "The next Biennial should be held in 2020.  The Museum of Modern Art in New York is also working on updating its existing exhibition space, the Leah, which has been closed since the pandemic, and is preparing for a possible closure as early as March 2022. Though the museum has not officially announced a date yet, many expect the complex will soon be dismantled and the residency program relocated. The pieces that make up the residency program, which has been run by the Museum of Modern Art for twenty-four years, are stored in a vault in the museum that will open in March of 2022. The Metropolitan Museum of Art, in New York, has announced that it is planning to begin its reopening in March of 2022, following a $2 billion expansion project that will include the construction of a new wing of the museum and the renovation of its existing spaces. The opening of the former headquarters of the Metropolitan Museum of Art will coincide with the opening of the metropolitan’s first exhibition: Amor Contra Modernos, which will open on March 20. The series will explore contemporary issues and will take up themes from the artist’s early career. The new exhibition will feature new works by seventy-two artists, including Daniel Ells", "The next Biennial should be held in 2021, the same year as the fifth edition of the Venice Biennale, which will take place in the city of Venice from May to November 2021. The first edition, which was hosted by the city in 2019, was held in early 2020. In the February 2019 issue of Artforum, writer Domenico De Angelis wrote: “For some thirty years, the Biennale has been an important vehicle for launching new artistic ideas. The new three-year format will let the artists experiment with new ideas and new mediums while also providing a platform for dialogues with the public and participants around the world. The performance of artists at the theme event will be different, it will be more intimate, and it will be filled with moments of hope and inspiration.”The Venice Architecture Biennale will be staged in several cities across the city of Venice from March 16 to March 19, 2020. It will also present a retrospective of the work of the artists who have been selected for the award this year, which will be organized as a combination of exhibitions, talks, and residencies. The winner will be announced at the Venice Biennale in September 2020.Vincent van Gogh, the Dutch filmmaker,", "The next Biennial should be held at the Museum of Fine Arts, Los Angeles (LA MoFA), in 2022. The museum’s tenuous position as a major cultural institution has been undermined by the construction of the MFA’s new home in Hollywood. The museum has yet to decide whether it will relocate the exhibition space from its current location on the northeast corner of 25th and Vine, where it has previously held exhibitions and classes, to the new International Center for the Arts (ICAA), an arena that will supersede the MFA and be dedicated to the arts.ICAA’s designer, Stefan Iwona Sardi, said: “The museum will be a model for contemporary art: a fully functioning space, fully equipped with the necessary equipment, that can become a model for and a source of inspiration for other museums.”When the building of the new space was first announced in 2017, it was seen as an ambitious project with many moving parts. For its first year, the center will host sixty exhibitions, including two biennial events, culminating with the LA Art Book Fair in April 2020, and will host over three hundred screenings of works by artists. It will also house an auditorium and a café,", "The next Biennial should take place in the near future. “The city of Tokyo is planning to begin construction by 2020, but the popularity of the exhibition and the relocation of artworks has made it difficult to begin construction,” said the Culture Ministry. The Ministry was planning to hold the event at the Museum of Contemporary Art (MoCA), but the project was scrapped following protests from local arts organizations.\n\n\nThe National Galleries of Scotland announced today that it is preparing to reopen to the public in January 2021 following a £10 million ($12 million) expansion project. The expansion, which was funded by the National Lottery Fund, aims to increase the exhibition space by 6,600 square feet, increase the number of seats from 3,200 to 5,800, and increase the number of visitors from 12 million to 15 million.The exhibition is scheduled to open in March 2021. The National Gallery of Scotland will be transformed into a museum and the National Museum of Scotland will be added to the site. The National Maritime Museum and the National Art Gallery of Scotland will remain within the National Gallery. The National Galleries of Scotland will host two shows, “Monopol: Capture the Flag” and “The New American: Art in", "The next Biennial should host the work of a single artist. The biennial’s theme, “Presence,” asks the questions: What kind of presence can exist in a world where matter and space are abstracted out of each other and into a non-existence that we cannot see, touch, or hear?\n\n\nThe J. Paul Getty Trust in Los Angeles has instituted a new, year-round residency program that will give local artists a platform to build and expand their practice and gain exposure to artists and activists in their communities. The initiative, which will connect the trust’s existing artists’ studios and institutions with artists’ studios and organizations across Los Angeles County, will combine traditional residency and artist residency programs in order to provide more opportunities for artists to meet and collaborate.The program, called the Community Artist Residency Program, will offer financial support to local artists, and will organize programming such as speaking engagements and artist residencies that will be free to the public. It will also offer financial assistance to artists who are looking for support or resources to launch their own studios or to enter into relationships with artists and organizations.“The new program will provide artists with critical support in launching careers and living creative lives, strengthen their relationships", "The next Biennial should focus on the biennial as a whole and not just on the forty-six individual commissions,\" said the curator and author of the forthcoming book “The Art of the Party,” Daniel H. Weiss, president of the auction house. Commissioned by the Italian institution, the exhibition drew some seventy thousand visitors.The exhibition was held at the Museo Arte Contemporanea (MAM), in Venice, in the Italian city of Venice, from November 7 to November 8, 2019. Curated by curator Fabio Cattelan, the 400-piece exhibition makes use of over seventy artists’ names. The works of Alexander Calder, Musa Khan, Gabriel García Márquez, Agnes Martin, and Eduardo Paolozzi are among the works that were selected for the first edition of the exhibition.This edition of the exhibition was organized by Galeria Ghetto, curated by Fabiola Cattelan, and Paul Mpagi Sepuya, curated by Klaus Voigt. The biennial will return to Venice in the autumn of 2020.\n\n\nThe Bessies, the United Kingdom’s national charity dedicated to supporting artists and their families, has named David P", "The next Biennial should take place in Santa Ana, California, in 2022. \n\n\nThe Institute of Contemporary Art (ICA) in London has launched an initiative to foster a more inclusive, interdisciplinary, and interdisciplinary approach to the making of art that sitsuates its future research in the . . .\n\nThe Institute of Contemporary Art (ICA), which is housed in a former munitions factory in the city of Stoke-on-Trent, is working with the Tate to present a new collaborative exhibition, “Volta: Art from the Archive,” at the institution in January 2022. The show will examine the ways in which archive collections are reassembled and transformed using contemporary technologies, such as new digital technologies, and will focus on the performance and narrative aspects of archive collections.“The new exhibition will explore the reworking of the archive as a digital archive, and the possibility of a future when data and archive collections are intimately linked and managed by the same technology,” said ICA director Brook Ashenden. “The exhibition will explore the possibilities of archive research and archive organizing in a multi-disciplinary and interdisciplinary way, and will bring together artists and researchers from around the world. We look forward to welcoming you to the", "The next Biennial should take place in the next five years. The organization’s board of directors declared that the winner will be announced in September 2020 and will begin the construction of the next biennial in November 2021.The Biennial, which will be held in Paris from March 19 to April 21, 2021, will include lectures, performances, and other events that will examine the history of art in the city and its connections to the rest of France. “The city is committed to supporting Paris’s artists and we are eager to see how the Biennial will celebrate the city’s rich artistic heritage,” said Claude-Olivier Agathe, the mayor of Paris. “With the construction of the biennial, an additional exhibition will open in the city where it will be of great interest to visitors.”Speaking about the impending exhibition, Agathe said: “The Biennial is a great opportunity to expose Parisians to modern art and to continue to develop and bring to the city art to support the city’s artists. We were fortunate to have a rich collection of art when we started the Biennial and to continue to build it up to date with new ideas and contemporary art.”\n\n\n", "The next Biennial should be set up in September and will focus on the identification and conservation of rare species such as the black rhinoceros, the white rhinoceros, and the yantras. In 2016, the institution displayed photographs by Piet Mondrian, Henri Ghent, Henri Cartier-Bresson, and others that depicted African art. Nelson Mandela, the founder of the South African ANC, called the collection a 'milestone of art.”Jilani S. Little, president of the Yinka-Mbeki-Nelson Mandela Biennial, said: “Our mission at the Nelson Mandela Foundation is to produce and present a platform for the art of our time to promote reconciliation and social justice in Africa. It is an exciting time to be alive and to be a part of history.”\n\n\nThe Museum of Modern Art (MoMA) in New York is planning to merge with the Harlem Museum of Art, which is slated to open in the fall of 2020, in a deal that will decrease the institution’s footprint and increase its exhibition space. The deal, which will also include a $2 million donation to the Harlem Children’s Museum, will go into effect on", "The next Biennial should take place in March 2022, when the show will be presented by the museum in partnership with the artist-run festival TIGER.  Esther Florizette, the chair of the show, said: “TIGER is pleased to support the Biennial in 2022 through our partnership with the artist-run festival. We were not able to secure the exhibition, but our artists have chosen not to participate in a show that has so many themes, is so ambitious, and will continue to grow. ”\n\n\nThe Gay and Lesbian Community Center (GLC) in New York City has received a donation of $1.25 million from the Beverly and Dorothea Johnson Family Foundation. The gift is the largest gift ever made to the museum. The gift comes on the heels of a $1 million gift from the New York family in 1991. The Johnsons also gave $5 million to the GLC in 2017. The donation now totals $11 million. The foundation was asked to initiate a gift in honor of the Johnsons’ legacy. Originally, the foundation was planning to endow the GLC with $9 million, but changed its mind after", "The next Biennial should take place in 2020, and the first in 2021. Artists such as Paul Gauguin, Hieronymus Bosch, Jean-Louis Malle, and David Adjay have been selected for the second iteration of the Grand Prix. They will be presented with $50,000 each. The third edition of the Grand Prix will be held in 2021, and the fourth will be staged in 2022. The 2019 event featured twenty-three notable artists, including Lawrence Abu Hamdan, Philip Johnson, and Karl Lagerfeldt. \n\n\n\n\n\nPaul Gauguin: The Art of Painting and the Power of Paintings, 1957–1963. Courtesy of the artist and the Museum of Modern Art. \n\n\nThe Spanish artist María Berrío, one of the founders of the New York School of painters, has died at age eighty-two.Born in the town of Granada in 1936, Berrío studied painting at the Academy of Fine Arts in Madrid and the University of Granada. In 1965, she married painter Jorge Vicente García-Vélez, with whom she had two children, a daughter named María and a son named Ollém.", "The next Biennial should not be delayed any further than it is mandated by the health authorities. So that we can concentrate on saving lives and on addressing the root causes, and we should participate in the decision-making process.”The verdict follows an outcry from the local population, whose protests were met with violent dispersals by security forces. While the government claimed that at least seventy people were injured, the figure was quickly revised upward to at least eighty, and the total number of protesters arrested to around two thousand. Aung San Suu Kyi, who has been in power since 2011, was also excluded from the event.Censorship and political interference in the competition were also raised by some conservative MPs, who argued that the choice was made in a way that would prevent the competition’s inclusion of “radical new ideas.”\n\n\nAmerican actor Kevin Spacey, who has been accused of sexual harassment and assault by dozens of women over a three-decade period, was found dead of a heart attack on Monday in his Manhattan apartment. The cause of death was acute carbon monoxide poisoning, and the actor’s death was ruled “natural.” The New York Times reports that the cause of death was carbon monoxide", "The next Biennial should be held in August 2021.  A statement from the panelists reads: The first Biennial, which was held in August 2019, explored the interconnected, sometimes conflicting, narratives of the exhibition in various ways that were never reversed and were ultimately attacked by other participants. The second Biennial tackled the concepts of art and politics, art and identity, art and the body, and the third Biennial explored the unresolved discordance between the human body and the human soul. The panel also criticized the exhibition’s attack on the Body, which was staged as part of the exhibition’s Second Biennial, Triumph of the Spirit, which opened in April. “The exhibition sought to give the public a new and deeper insight into the history of the body, but it was hardly a history that was historically accurate,” said Michael Kazantzakis, chair of the committee. “The fact that it was staged at all, with no formal historical context, is an indictment of the exhibition’s premise—that there were never any historical figures whose bodies were presented as sacred.”The exhibition has been reworked into a new exhibition titled “The Body Politics of Art,"]