["The next Biennial should take place in the spring of 2022.\n\n\nThe Museum of Contemporary Art (MoCA), which was on track to close September 22 following the November 12 pandemic, has announced that it is preparing for the possibility that the institution will remain closed until March 23. The first phase of the institution’s reopening plan, which involved the dismantling of two of its three buildings—its former home, the Solomon R. Guggenheim Museum, and its new home, the Metropolitan Museum of Art—wasn’t expected to begin until mid-March.Museum director André Breton wrote in a letter to the public on Thursday that the institution will “continue to be a museum for the museum, for the museum’s future, and for the future of art.” He also noted that the possibility of a March opening date is a concern for the staff, who are currently organizing for a March 22 opening date, and that the three buildings could be in a “standstill for weeks or months.”The letter concludes with a plea for visitors to the museum to keep an eye on its Twitter feed, which recently tweeted a May 15 threat by Breton that the museum would close its doors on", "The next Biennial should be held at Sherwood Park in London. The next iteration will take place in the city in 2022. The 2019 edition, “The Future Is Present,” was staged at Sherwood Studios. A new exhibition, “The Future Is Present,” will open at the Biennial in 2020. The first iteration of the Museum’s new exhibition, “The History of the Present,” will open in 2022. \n\n\nThe Museum of Art in New York has appointed Lynda Barry as its next executive director. Barry is the first woman to lead the museum since the museum’s founding by Domenico Dolce in 1966. She succeeds Michael Ferris, who retired in October 2019.“I have been following Lynda,” said Ferris. “She is a visionary leader who brings an extraordinary record of vision and commitment to our mission of building an innovative and dynamic collection and presenting extraordinary art.”Commenting on her new role, Barry said: “The museum has been experiencing significant growth and has proven to be an inspiring model for site-specific and institutional research. The work of our distinguished curators, experts, and staff has made the museum the center", "The next Biennial should take place in Tokyo in February 2020. As the museum currently has no plans to move from its current location in the rapidly gentrifying Ginza district of Tokyo, it is currently evaluating whether the best way forward would involve the renovation of the existing building, which dates from 1937, or moving it to a new location. The museum currently has around sixty thousand works on display, and is planning to add a fifth floor dedicated to contemporary art.\n\n\nThe Centre Pompidou in Paris has received a gift of sixty-five years of works by the artist Claude Monet. It was made through the sale of a painting by Monet by American art dealer John Graham. The painting, titled La Vie en Rose, is from a series of paintings that were also sold by the dealer in the early 1990s. The work is believed to date from the late 1970s to the early 1980s.The gift, made in the city of Beur, in the northern region of Flanders, marked the thirty-fifth anniversary of the Centre Pompidou. The building was completed in 2001 and inaugurated with a retrospective of the artist’s work in 2003. In 2008, the Centre Pompidou donated twenty-five years of", "The next Biennial should be held in the spring of 2021. The plan is to create an exhibition of works made by artists from different periods in Chinese history by moving them into a museum near the city of Nanjing, and then to return to the Anhui Art Museum in Nanjing and to the Nanjing Biennial.The exhibition will include work by twelve artists in the United States (Tao Li, Su Yiren, Lala Jin, Lulu Yoshida, and Lillian Chan), including Julie A. Glover, Ed Ruscha, and Carlotta Cornejo. The museum will also stage a special exhibition of the work of artist Matthew Wong, curated by Wong and featuring works by the Chinese and Korean artists Fa Hong, Xiannan Wang, and Eunice J. Pook, and a symposium of the works of Robert Irwin, Laura Kills, and Will Rogers.The museum will also be planning for a major renovation of its existing exhibition space, which is currently undergoing a $5 million facelift, and a reinstallation of the venue. The museum has already allocated $5 million for the renovation of the museum, which opened in the 1930s, and is working to raise additional funds for the complex.\n\n\nThe Museum", "The next Biennial should focus on a new collection of paintings by the Egyptian artist Moustapha, whose work is considered the most important of the Egyptian Renaissance, and will focus on his work The Veil. It will also include a selection of his other works in the form of a play and a film.\n\n\nThe Museum of Fine Arts (MFA) in Miami Beach has commissioned artist Marc Anthony’s “Threat of Fear,” a new work by the artist that will be on display in the museum’s new biennial, “After the Junta: Art in the Spanish Civil War” (formerly known as “After the Junta: Spanish Civil War 1947–1965”). The installation will highlight the role of politics in the ongoing political crisis and the ways in which art—and especially political art—can inspire and heal.Born in Miami Beach in 1957, Anthony grew up immersed in the city’s political, social, and economic landscape. He attended both public and private schools, graduated from Miami’s prestigious Marfa High School in 1984, and attended college in the city. Anthony began his political activism in the late ’70s, when he began writing for the Free Press.", "The next Biennial should be held in 2022, and the fifty-seventh in 2021. The next Art + Congress should be held in the United States in 2022, and the forty-eighth in 2021. The next Art Research conference will be held in Europe in 2022, and the seventy-fifth in 2020. The next Guggenheim Biennial, which will be held in 2020, will be held in the United States in 2022, and the seventy-fifth in 2020. The next International Museum Triennale will be held in the United States in 2022, and the fifteenth in 2020. The next Art+ Congress, which will be held in the United States in 2022, and the twenty-ninth in 2020, is already underway.\n\n\nSporting Kansas City owner and president Christopher Powell has announced that the city’s official museum of American sports will reopen to the public in 2020 under the direction of architect and designer Mark di Suvero, who will assume the role of chief curator and director of the Metropolitan Museum of Art. Di Suvero’s design for the city’s new $70 million Arrowhead Stadium—which will replace the city’s existing Metropolitan Museum of Art—remains in place, and", "The next Biennial should be held in the fall of 2020. \n\n\nAllan Brown’s new book, The Art of Movement: Movement and Motion in Art-historical Design, will be released on June 15. The first part of the book focuses on the history of movement in design, the second part on movement in performance, and the third part on movement in painting. “In an age of constant change, when the physical and social landscape has shifted radically, with the art of movement,” the artist wrote in an introduction. “I chose to design by means of highly stylized, geometric, and heliocentric structures that could be experienced as a kind of interior landscape, an interior landscape that could become the body of a work.”Born and raised in New York City, Brown studied at the School of the Art Institute of Chicago, the Art of Movement, and the Art of Motion in New York, and practiced at both the institutions. He also served as the founding director of the New York–based nonprofit Design Place, which promotes diversity of artistic practice in the city’s art and design communities, and as a professor at the City College of New York. In the introduction to the book, he", "The next Biennial should be on the same island, in the same city, and featuring the same public. A biennial is a group exhibition which brings together various disciplines of art in one place. The exhibition should also take place in the same year as the exhibition. Stephen Friedman, the president of the foundation, told Artnet: “There are a number of elements which make the exhibition unique. We see the exhibition as being at the intersection of two worlds—the contemporary and the ancient world.”In order to bring the exhibition to life, the team worked with renowned architect Masahiro Mori (the architect behind the construction of the Yale Architecture of Life ). For the exhibition’s predecessor, the Biennial of the Ancient World in Athens, Mori designed an entire city as the centerpiece, and a whole array of artifacts from the ancient world, including clay sculptures and fragments of a long-lost language, were assembled in a single exhibition space.\n\n\nThe Solomon R. Guggenheim Museum in New York has released the 2018 list of seventy-four artists who are participating in its yearly Artists’ Gardens exhibition. Titled “The Garden,” the first show in the series, which has shown works by sixty", "The next Biennial should be held in December 2021.\n\n\nArt in Motion, an initiative of the Museum of Modern Art (MoMA), New York, and the Metropolitan Museum of Art (MoMA), will remove eight works by two artists from its collection this fall. The works, David H. Koch’s Arts of the Life and Death, and Jaime Vidal’s  Avignon, were among the first works of the three-volume series that were restored by the Museum of Modern Art. The move will follow the federal government’s decision to return thirty-three works by Pablo Picasso to the artist’s heirs.The works were collectively purchased by MoMA collector Richard Morris in 1996 and are currently housed at the Tate, where they will undergo a major conservation project in the next twelve to eighteen months. The work on display at Frieze London will be part of a larger exhibition that will feature works by the same artists in February 2020. The works will enter the exhibition “Arts of the Life and Death” in January 2021.“I want to thank Richard Morris for getting us these works into the exhibition, for helping us realize our dreams of presenting these works in the", "The next Biennial should be held in 2019.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is expanding its gift giving program. The institution is giving $1 million to a number of artists to help them transition from their spaces to new digs in the city, including Hiroshi Ishigami, Carlos-Alberto Alarcon, and Arturo Romano.In honor of this year’s milestone, MoCA is giving $500,000 to twenty-three artists. The initiative was initiated by artistic director J. Paul Getty and began in 2016. We are grateful to the Getty Museum for recognizing the contribution of this year’s nominees and recognizing the profound impact that their work will have on future generations of collectors.“This year’s recipients are a remarkable group of artists who demonstrate extraordinary vision and ingenuity in their individual pursuits and their collective efforts,” said major gift recipient Michael L. Royce, chair of MoCA’s board of trustees. “These artists recognize that their work is of deep cultural and artistic value, and that they are a vital part of the MoCA legacy.”This year’s recipients are:Exhibitionist Nick Cave’s The Magician and", "The next Biennial should be held in 2020.The news comes on the heels of the rumors that have been swirling for the past few months that the decadelong project was being shelved. The Museum of Contemporary Art (MoCA) in New York and the Louis Vuitton Foundation confirmed in a joint statement that the decision was mutual. The move means that the Biennale will no longer take place in 2021.“I think the best compliment I can give is not to say how much your programs have meant to me, but how much you have taught me to do my job and not to take for granted. I owe you an answer now.” Franck Ribery, the president of France’s most powerful collectors' organization, the CAA, told the Art Newspaper. “The end of the Biennial is not unexpected. It will not be an easy decision. But it is the right thing to do. We are in a moment of great change. We need a strategy that reflects this, one that is resilient and proactive.”The Biennial’s curator, Thomas Bastien, said that the institution “mustn’t…remove a single curatorial mark from the Exhibition.” The artist", "The next Biennial should also include a selection of works by artists who have shaped the curriculum of the university’s institutions for an inclusive, safe, and equitable future. “A new biennial is needed to reflect the current regenerative potential of our communities,” said Minna Prabhu, director of the university. The 2020 edition will include a selection of works by eighty-three artists identified by the trustees as having served in the institution’s roles between 2011 and 2020.The biennial will be curated by Kannadigulavu Prasety, a former vice chancellor of the university, and Simon Ostrovsky, the director of the Biennial Research Institute (BRIC), and will be hosted by the university and the University Capital, the newly formed partner of the university, in collaboration with the artists, the trustees, and the administration.The inaugural exhibition, “Ascension (Ascension),” will open on September 20 and run through December 21. Artistic Director Anupam Desai said: “The UGC institutions are witnessing a seismic shift in our society. The old model of an arts-centred university has been thoroughly deconstructed,", "The next Biennial should be held at the New Museum in New York sometime in the 2020s. In an effort to diversify the presentation of the museum’s collection, the museum will deepen the focus on the works of African American artists, and will organize more exhibitions devoted to issues such as women’s rights, migration, and drug policy. Museum director Bruce Boden, who will take up the post in January, said: “With this divestiture, we make clear our commitment to celebrating the voices and work of every artist of color. Our strategy is not to change the museum’s collection, but to engage with it more generally. We are not creating an African American museum. We are creating a museum that is fully responsive to the diverse histories and cultures of our communities.”\n\n\nThe Museum of Fine Arts (MFA) in Boston announced today that it has received $13.3 million from the sale of works by artists including Thomas Crozier, Menjibar Meneguzza, and Breton Gish, as well as a $3.7 million donation from the Red Cross. The works in the sale include Thomas Crozier’s The New Regime (1994", "The next Biennial should be held in 2021.”\n\n\nThe Museum of Contemporary Art (MCA) in Los Angeles has received a $15 million donation from John and Kenneth Arnold. The gift was made in recognition of MCA’s work-study program, which has served as a model for how nonprofit arts organizations can operate in the city.“We’re dedicated to supporting and promoting artists and institutions in Los Angeles,” says Beth, the Arnolds’ gift’s recipient. “They have given us the opportunity to achieve a great partnership with the city of Los Angeles, to engage with the community in a way that might not have been possible otherwise.”The gift is a step in that direction, as the Arnolds hope the partnership will inspire others to support artists.\n\n\nThe Museum of Contemporary Art (MCA) in New York has appointed Emily Chasanoff as its next executive director. Chasanoff comes to the institution from the Brooklyn Museum, where she has served as deputy director since 2014. Chasanoff succeeds Dorothy Johnson, who retired in February 2019 after twelve years at the helm of the museum.“While a scholar of early modern art and modernist workers,", "The next Biennial should take place at the Museum of Alberta’s new home in downtown Calgary, the Museum of Contemporary Art Edmonton, in 2021. As the new twenty-second edition of the Biennial approaches, it will begin welcoming visitors in the spring of 2022. \n\n\nThe Smithsonian’s National Museum of American Art (NMAA), which reopened to the public yesterday following a $125 million expansion, has appointed Michael Ferris as its next director. Ferris has served in the role of head of the museum since January 2019, and in that time it has expanded the institution’s collection by more than four hundred works, added new exhibitions, and added more than twenty thousand square feet of public galleries.“Michael has been instrumental in shaping the NMAA into a very strong institution,” said Dave Zirin, chair of the board of trustees of the National Museum of Art and the Museum of American Art. “He is passionate about what he does, he is dedicated to the mission of the museum, and he is driven to deliver on time and budget.”Ferris will take the helm of the institution during a three-month stint in June. Among the works that will be added to the museum are Milton", "The next Biennial should take place in 2022.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced last year that it is reorganizing its collection in a way that will eliminate the need for a third-party administrator. The authority will be managed by a new entity that will oversee the custodianship of the works and will be given a $10 million budget.The restructuring, which is being led by management consultant Ronan F. Rhodes, will put the institution on a path to reduce the museum’s carbon footprint and will prioritize conservation over the promotion of new works, a change that will benefit both the institution and the public.“We understand that climate change is a defining moment for communities and institutions across America, and that this will require a swift and decisive response,” said David L. Breslin, chair of MoCA’s board of trustees and director of the artist-run nonprofit Artist Space. “While this is an unprecedented challenge for all of us, we believe that this new arrangement will enable MoCA to be a determinant for good climate policy while also providing an important vehicle for the important work of conservators and educators.”The board also voted to establish an endowment for the artists", "The next Biennial should take place in September 20-November 21, 2020, in Helsinki. The ten shortlisted artists will each receive EUR 100 (USD 100). The works will be presented in collaboration with the Helsinki Architecture University (HELU) and the RIKM Museum, and will be staged in the Helsinki Art Center.Among the shortlisted artists are Aiden Gillen (Netherlands), Annie Hall (Denmark), Werner Herzog (Germany), and Václav Havel (Switzerland). A new category of artist has been created for the 2019 biennial, entitled “Future Present.” The 2019 winner, Theodoros Papadopoulos, has since been awarded the prize.The next edition of the biennial, “Future Present” will be held at the Helsinki Art Museum, which is slated to open in the fall of 2020. The exhibition will feature works by forty-six artists, including Rebecca Black (Hong Kong), Betty Aycock (United Kingdom), and Becca Bass (United States), as well as a selection of 20 contemporary works by artists such as Romi Craze (South Africa), Fergus Campbell (Ireland), and Jana Lerner (United States) and Claudia Thomas (New", "The next Biennial should include a discussion of how the arts, and especially theatre and film, have facilitated the evolution of the post-crisis era. This exhibition would then take place at a time when the UK is facing a cultural and economic crisis that is as profound as the Great Recession. The Biennial will then deliver a new programme of events that will engage with issues drawn from the exhibition catalogue, with a view to highlighting the diverse ways in which the arts are used by different communities and communities in the UK. The work of the Biennial will then be showcased at the London Book Fair, on May 22, 2020. The theme of the 2019 edition of the Biennial was Culture and the NHS (Cancer and Health) and the theme of the 2020 edition is “Art, Health & Wellbeing, & Beauty.”  The 2019 edition of the Biennial was curated by Christopher Booker and featured works by artists such as Sara Jane, Moholy-Nagy, Elizabeth Peyton, Chiara Sollima, and Yinka Shonibare. The 2020 edition, curated by Julian Barnes, will be curated by Sophie Stroud, who is responsible for the", "The next Biennial should take place in the spring of 2020.\n\n\nThe Los Angeles County Museum of Art (LACMA) and the Museum of Contemporary Art (LA MoCA) have announced that Jodi Throckmorton has been named the next director of the Los Angeles County Museum of Art (LACMA), which opened in December 2015 and has since become the largest museum in the city. Throckmorton will assume her responsibilities in January.“Jodi’s long history at LACMA and her dedication to making the museum relevant and accessible to the community make her an ideal leader for the museum,” said Elizabeth Gagosian, director of the LACMA Art Museum. “Her leadership qualities, her ability to impact positively on the lives of the people of Los Angeles, and her commitment to the museum’s mission will be critical as it continues to grow.”Throckmorton succeeds Leslie Bowe, who was hired as director of the Los Angeles County Museum of Art (LACMA), and is expected to take up the post in January. To celebrate her promotion, she will receive an additional $2 million in funding from the LACMA board of directors and will be paid on a", "The next Biennial should be held in 2021.\n\n\nThe Metropolitan Museum of Art in New York has hired artist and educator Rachel Corso as its new curator of the twentieth-century. Corso will be responsible for fostering a greater appreciation of the art of twentieth-century America. “Rachel is a gifted and dedicated curator who has demonstrated an extraordinary ability to draw from and expand upon the rich and distinctive legacy of twentieth-century American art,” said the museum’s director, Daniel H. Weiss. “Her new position, which will take up the themes of forty years of American art, will make her a formidable advocate and advocate for the work of American art in the twenty-first century.”Corso comes to the Met from the Los Angeles County Museum of Art (LACMA), where she has worked as an educator, a curator, and a curator for more than thirty years. She was instrumental in the reinstallation of the museum’s outdoor garden in 2009, the museum’s reopening in 2011, and the museum’s reopening in 2018, and has presented work at many prestigious museums including the Museum of Modern Art in Boston, the Whitney Museum of American Art, and the A.", "The next Biennial should also include a project with a public exhibition to examine the impact of life and death in the City, and a public lecture series to address the theme of Love in the City.  In a statement, the commission cochair said: “The theme of the upcoming Biennial is Love and the City, and we want to continue to present the work of the artworks in the city to the public in a way that expresses the spirit of the City. The next Biennial will be an opportunity to reach out to the community at large and to engage in conversation with a new generation of artists.”Artists Behrouzia and Khaled Boumeli also expressed their enthusiasm for the upcoming editions of the Biennale, which are being curated by two of the City’s most esteemed local and international artists, Haig Donaldson and Filippa Maygott. “The Biennale is a wonderful event to open the new year with,” said Boumeli. “It’s an opportunity for artists to connect immediately with the themes, themes and artists of the new year. I’m looking forward to working with the team to present the best of the city at the upcoming", "The next Biennial should have a board of directors comprising three members including Mark Emmerich, chair of the board of trustees, and Nari Ward-Edwards, director of the 13th Biennial. The board will also be asked to consider the possibility of moving the upcoming event to another location. In order to facilitate the move, the biennial will be moved to the same time and place as the next edition of the Lisbon Biennale. Since buildings in Brazil are usually very close together, the event will be held in the same building as the next edition of the fair, which will be held at the Arena do Marias, on December 26–December 29. The exhibition’s artistic director, Janez-Emma Bickel, said: “We took the decision to move the exhibition as soon as possible in order to give the artists a possibility to remain in Brazil for the next three months and return to the country. We have received a lot of support from the artists and art workers of the city of Maricá. We will continue to use the same spaces and the same platforms to showcase the most recent work.”The board of directors also decided to move the exhibition’s technical director and curator,", "The next Biennial should be held in 2021. “The biennial has been a success,” said Silvia Cicutto, the director of the Instituto de Arte Contemporáneo Internacional (ICA) in Rome, Italy, in a statement. “The themes of the exhibition have been selected with great care and have become the focal points of the exhibition, and the Biennial has become a platform for reflection, education, and research.”The 2019 exhibition, “We Are All Farmers Now,” was staged at the Instituto de Arte Contemporáneo Internacional (ICA) in Rome and ran for ten weeks in March. The exhibition was organized by a team of twenty-three curators and producers, including architect Giuseppe Campanella, director of the Turin-based studio Hi-Tec Design, and the Italian landscape architect Domenico Cattelan, and featured work by thirty-two artists, including Silvia Cicutto, Adriano Cattelan, and Gio Ponti.The exhibition was nominated for a Golden Lion at the Venice Architecture Biennale in 2015 and for a Silver Lion in 2017. The latter", "The next Biennial should be in 2021. “We are excited to continue this tradition of interdisciplinary excellence,” said Markus Niehus, museum director. The 2018 edition featured work in all of these categories: art of the body, art of the mind, and art of the spirit. \n\n\nThe British pavilion at the Fifty-Ninth Venice Biennale, which celebrates its thirtieth anniversary this year, has announced that it is expanding its program of programming. It is now planning to stage an exhibition of work by artists who have been selected by the pavilion’s curators, and will increase the number of galleries participating in the event from eight to twelve. The move follows a shift in focus for the pavilion, which has shown work by artists such as Andy Warhol, Frank Gehry, and Alejandra Zapata, since 2005.Since the pavilion was founded in 1988 by two British artists—Jack Black and Mark Santoni—it has been comprised of two curators since its founding. In 1998, the show was moved to London, and in 2004, the exhibition was moved to the country’s National Portrait Gallery. In 2006, the show was included in the", "The next Biennial should be held in 2021 and will take place in the city’s historic St Paul’s Church of St Paul, which is currently being renovated by the Norwegian firm GBR (Golden Bridges Group), at a cost of $56.5 million.The announcement follows a redesign of the museum in 2019 that saw its physical space expand by two thirds. The work of the new, larger and more ethnically diverse staff increased the museum’s exhibition and educational opportunities while also introducing new programs and exhibitions.The new, seven-story museum will be inaugurated by the biennial’s first exhibition, “The Bones of the Earth,” an exhibition that explores the material and cultural histories of the natural world in a number of works that draw from modern and contemporary art and the history of science. The exhibition will feature works by fifty-five artists and will open on March 22.“The Bones of the Earth is a journey into the soul of the artist, his or her relationship with the material world and its relationship to the human soul,” said Mark Stack, director of the Biennial. “With its immediate and elusive vision of a planet dominated by art and the artist, the exhibition is a plea", "The next Biennial should be held in 2021.” Organizers also mentioned the role of Gilligan’s son, the British director of the Guinness Book of Records, who is currently a member of the institution’s board of trustees. The new pavilion will be designed by architect Hans-Ulrich Gehlen and will hold twenty-two exhibits, including a new exhibition on the exploitation of the Black Death in the Middle East that will open in November.Sponsored by the Guinness Book of Records, the first show at the new biennial will be “A SERIES OF PHOTOS,” which will feature twenty-seven photographs selected by Gilligan in the seventeenth episode of the fifth season of the series, titled “VIOLENCE.” The series is currently being curated by Jonathan Dimbleby and Martin Heidegger. Previously, Gilligan served as a chief curator at the National Gallery of Art in Washington, DC, and as a senior curator at the Serpentine Gallery in London. The biennial will be hosted at the Guggenheim Museum in New York and will be co-organized by the Smithsonian American Art Museum and the Museum of Modern Art in Boston.", "The next Biennial should be held in 2021. The 2020 edition consisted of fifty-seven works by sixteen artists. The twenty-third will also include twenty-six works of Canadian artists.The 2020 theme of the exhibition is “utopian dreams.” This year’s theme is Futurism, and the themes are acoustic, kinetic, and physical.“We are excited by the prospect of the twenty-third edition of the Biennial, which will bring a new vision and new experiences to the exhibition,” said Marc-Olivier Laurent, director of the Biennial and the Centre for Contemporary Art, Art, and Architecture. “The theme of the exhibition will reflect that of the Biennial, with a view to bring together contemporary artists who are exploring the ideal of creation, the relation between life and the environment, and the futurist vision of the future.”The series also includes four biennials in 1937, 1969, 2006, and 2012. In 1969, the artists Kiki Smith, Charles Atkins, Adrian Piper, and Gilbert & George participated in a “painting miné,” and in 2006, the Exhibition was staged at the Museum of Fine Arts, London.", "The next Biennial should be hosted at JFK’s September 23–26 opening, reopening on August 25. The show will present the winners of the prestigious $55,000 Artistic Award, which celebrates artists who have led remarkable lives, in an exhibition that will include works by sixty-five international artists, including Artur Davis, Nadya Vaccaro, Damien Hirst, and Nada Sulemani, and will begin with a special presentation of works by Kate Moss, Francis Ford Coppola, and Ed Ruscha before moving to other American artists.\n\n\nMana Contemporary, an art center in Beijing that recently announced plans to move to Austin, Texas, was forced to apologize to its local community when it announced that it will no longer participate in the annual festival. Founded in 2009 by local businessman Hao Jian, the curator and arts administrator said that they were “ideally positioned to take advantage of the city’s arts and culture scene” and failed to address the city’s cultural needs.   “With the recent development of the city’s arts scene, I think we can focus on the future and not blame the past,” Hao told Artnet News.", "The next Biennial should take place in 2020 and will include works from over sixty artists, including David Califf, Galerie Lelong & Co., and Galerie Jacques-Louis. The 2020 edition will be staged in Santa Fe, New Mexico.\n\n\nThe London-based arts organization the London Foundation (Lafayette) has announced that it is launching a new initiative that will provide financial assistance to small, independent, and regional arts organizations in the UK. The initiative, which will take three years to complete, will be reimagined as a “creative destruction fund” that will distribute a variety of arts and cultural resources across the UK. The fund will also support the creation of new creative and performance spaces.Over the past two decades, Lafayette has helped more than 2,500 organizations by distributing grants and loans. The organization has also received $15 million from the National Lottery Heritage Fund and has a long-standing affiliation with the Tate. “This is an unprecedented challenge for Lafayette, but one that we believe will deliver for the arts and culture sector in the UK,” said Lafayette director Alistair Johnson. “The fund will cover the upfront cost of the grant and will be", "The next Biennial should be held in 2021, immediately after the end of the current one-year cycle, and will be inaugurated on September 26.The show, titled “Art and the Body,” will consist of a selection of work by 140 artists and will be presented in the form of a triptych, comprising a figure of a man and a woman, three faces and three bodies, which will be represented by a series of motifs in the form of the Elements of Life. The first work, a six-work collection titled “Nails, Furniture, and Poses” (2016), was created in collaboration with renowned artist and architect Marco Mediter, who was commissioned to design a new kind of nail. The sculpture will be done in collaboration with the artist's daughter, the artist-in-residence, and the artist’s two daughters.Commenting on the exhibition, Stefanos Antoniou, director of the Biennial, said: “The work of all the participants is inspired by their parents, by their lives, by themselves, by their identity, and by their vision of the world and what is possible together with art.”\n\n\nThe Metropolitan Museum of Art (the Met", "The next Biennial should be held in March 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has received a $3.5 million donation from the heirs of the late artist and activist Arturo DiNardo. The gift comes in addition to a $1 million donation made by the DiNardo family in 2015 that established the DiNardo Family Foundation to support the research and preservation of DiNardo art. The gift was made in recognition of DiNardo’s decades of dedicated advocacy for social justice and his work embodying the revolutionary spirit of peace and love.The donation comes in the wake of a series of events that took place within the past year that led MoCA’s board chair Donald and Maureen DiNardo to make a historic gift to the institution, which has served as a permanent home for many of the artist’s works over the years. The DiNardo family donated funds to the museum in 2016 in support of the work of artists who have not been included in the museum’s holdings, including Samuel Barbero, Rex Harrison, and Robert Irwin. The gift also included the DiNardo name in the institution’s name. The gift was made in recognition of the", "The next Biennial should be held in the spring of 2021, and the 2020 awardees will be announced in early 2021. \n\n\nThe Metropolitan Museum of Art in New York has announced that Matthew Higgs, who has served as a curator at the museum for twenty-seven years, will be the next director. He succeeds David Samson, who has led the museum since 1971, and will assume his post on January 21, 2022. “Matthew Higgs is an exceptional curator and educator whose success, combined with his vision, will ensure that the Met’s exhibitions and collections continue to grow and improve in the next decade,” said David Samson. “I’m confident that Matthew is the right person for the job, and proud to work with him again as president of the museum. His proven ability to push exhibitions and collections forward with innovative approaches to exhibition design and exhibition production will make him an ideal fit for the Met.”In the appointment, the museum gave the award to Matthew Higgs for his twenty-seven years with the institution, which has been named one of Time’s “Ten Most Influential People” in the world. Past recipients include Philippe Kiff, George Lucas", "The next Biennial should be held in late January 2019, following the end of the first year. The event will feature fifty works by forty-six artists and will also include an exhibition of twenty-eight photographs by forty-five artists, including Satya Noguchi, Kammicki-Sriya, and Reena Zola. The exhibition will take place in the museum’s existing building in the city of Santa Fe, New Mexico.\n\n\nNew York’s Metropolitan Museum of Art (MoMA) has unveiled plans to rebrand the institution as the New York Museum of Art (NYMo), a move that will allow MoMA to better reflect its urban core and its history of innovative, conceptual projects that engage with the city and the environment.The redesign, which is part of a $1 billion overhaul of the Met, will draw from the city’s history and incorporate new public spaces, new public art, and a new contemporary vision of the Met’s historic boroughs. The redesign will also incorporate the creation of new public gathering spaces, including a plaza and outdoor plaza that will sit in the former site of the New York Public Library. The plaza will feature a public courtyard and will be flanked by new sculpt", "The next Biennial should take place in 2020.\n\n\nThe Solomon R. Guggenheim Museum (S.R. Guggenheim Museum) in New York has appointed Lauren Nickolay as its new deputy director and curator of the Order of the British Empire (BGO). Nickolay joins the institution from the Getty Museum, where she has worked since 2012. She will assume her new responsibilities on January 18.“I’m incredibly excited about it, not only for the possibilities, but also for the work that Lauren brings to the Guggenheim,” said Guggenheim director and CEO Marian Wright-Dalalembert. “I’m eager to see what she will accomplish as the new leader of the Guggenheim. It is an honor to welcome her to the museum and a joy to work with her.”Nickolay will assume her new responsibilities on January 18. She succeeds BGO’s current director, Kim Reynolds, who retired in December after seventeen years at the museum.“All of the Guggenheim’s permanent artists have expressed great admiration for Lauren. She is a talented curator and scholar who has demonstrated her ability to bring", "The next Biennial should focus on work by artists whose work is presently on display and under consideration for the first time at the institution. The institution hopes to see the works of forty-five artists in the exhibition. In the meantime, it will hold special exhibitions of work that have yet to be curated, such as work by Hélio Alves (1930), the exhibition of color photography by David Adjay (1935), and the documentary film The Artist.\n\n\nAfter a long search, the City of Los Angeles revealed today the twenty-two artists nominated for the 2019 Los Angeles Artadia Awards, which honor excellence in art and culture. The seventy-seven-minute shortlisted films, performances, photography, video games, and other works presented in the exhibition, which opened on May 4, will be awarded the grand prize. The other work-shortlisted artists will be presented in an open workshop on September 2, 2020.The 2020 winners are: Gabriel Arnaud for his shortlisted entry in the 2020 LA Artadia Awards; Eileen Brandt for her documentary project, The Fastest Man Alive; and Peter Toshack for his work in the exhibition. The 2019 prize jury, chaired by David Ives, chair of the prize jury, awarded", "The next Biennial should take place in the Spring of 2021. \n\nThe International Confederation of Art (ICA) in Rome has released a revised list of artworks that will be featured in the upcoming edition of the Royal Academy of Arts, the Royal Academy of Fine Arts (RAFA) in New York, the Art of the American Gilded Age, and the Art of the Renaissance. “The ICA Rome 2020–2021 is a project of the Royal Academy of Arts, the Art of the American Gilded Age, and the Art of the Renaissance, and is dedicated to the process of art acquisition, acquisition and transmission,” reads a statement released by the institution.“Each of these objects is an extension of this artistic heritage, a response to the very essence of the art medium, to an ideal of the art-world, to a mission statement of the artist or a general statement about the state of art.”The organizational chart for each exhibition is as follows:ART OF THE AMERICAN GOLDEN ADAPTIONSBEST HORRORS ART OF THE PERFORMANCALIZED WEST ART OF THE MODERN GALLERYMAGAZINE ART OF THE REVOLVER ART OF THE MODERN", "The next Biennial should take place in Tokyo in June 2020, with the exhibition marking the centenary of the museum’s opening in the capital city. The thirteen artists who will participate in the exhibition are: Tatsuya Higashikata (Kanagawa), Hideo Ito (Nara), Koji Ueda (Kanayama), Hidetoshi Kawasaki (Nara), Osamu Nara (Nara), Junya Nakajima (San Francisco), and Hiroshi Fujii (Tokyo).Mitsui also announced that Yoichi Hirai will be the next director of Tokyo’s Kawasaki Museum, which has been in various incarnations since it opened in 1972. Hirai will succeed veteran director Takashi Chiba, who was recently appointed the next director of the Japanese Embassy. He succeeds David Adjay, who retired in March 2019 after a decade at the helm of the institution.“The Biennial has been an innovative platform for the exchange of work between Japanese and international artists, especially in the 1980s and 1990s, and will continue to be so in the future,” said Yasuhiro Matsumoto, chair of the board of trustees of the Museum of Modern Art and", "The next Biennial should focus on how artists can be their own medium, in a way that can open up new possibilities: a gallery exhibition based around the artist’s autonomy and aspirations. The next edition should focus on the psychological and relational impact of artistic practice, which could be even more meaningful for the artist whose work is currently in the exhibition. The next exhibition should be co-organized by a group representing the best artists of the recent past, including Olafur Eliasson, Aurore Stedelijk, and Nils Stærk, whose work is currently on view at the Kunsthal Aarhus in Denmark for the next three months.The biennial will be curated by Lars-Erik Sandström, artistic director of the Stockholm Biennale, and will be led by a board of curators that includes artists, musicians, writers, and architects. The full list of participants is as follows:Your browser does not support the audio element.\n\nThe Swedish artist Peter Schäfer, a prolific and influential painter whose lavish, four-dimensional work explores the nature of light and light pollution, has died at age eighty-two. His works, which often wield ideas from and directly address social problems, have", "The next Biennial should take place in the summer of 2021 and is slated to run from March 14–March 16. The theme for the 2019 edition was “The Soul of an Empire: The Politics of Language” and was considered by some to be a departure from the work of the previous two iterations, which were set in the twentieth century, and drew from traditions of photography, film, and sculpture.The 2019 biennial was held at the Museo de Arte Contemporáneo in Lisbon and featured artists including Agustín Pérez-Villalobos, Júlio Peralta, Nene Oli, Marcel Prouvé, and Siri endymée. The artists whose works were chosen for the 2019 edition were Carolina de Armas, Ana Mendieta, Jose Antonio Eduardo, Hélio Pérez-Villalobos, Marcela Iglesias, and Carlos Vázquez.\n\n\nThe National Museum of Fine Arts (MoFA) in Washington, DC, has received an unexpected gift of nearly three hundred artifacts from the National Museum of the American Indian (NMNA), which is seeking to open a second museum in the DC area in 2021. The gift includes works", "The next Biennial should be held in 2022. “The future of the Biennial is at risk,” said Simon. “The Biennial is a vital and moving image in presenting contemporary art. The chance to continue to present it is extremely important to me.”\n\n\nAlexandra Delvalle, an artist and educator who created works inspired by the Red and Black flags of the Black Power and other radical feminist flags, was found dead of a massive heart attack in her Manhattan apartment on Saturday, October 27. The cause of death was asphyxia by hanging, and the artist was forty-six years old.Born in New York City in 1976, Delvalle moved to her hometown of West Orange, New Jersey, in 1987. She would later study art at the Brooklyn College Graduate Center, where she met artist Jason Delmonico, who would later become her husband and partner, and help raise her children. In 2001, she was awarded a MacArthur Fellowship. In 2006, she began creating new works inspired by the American flag, which she described as a “sign of the times.” Delvalle also painted her first flag, a work for the new museum of the American Revolution, and her second, a flag", "The next Biennial should be held in November at the end of October, giving the artists a few months to organize their shows. It will be directed by the artist Chris Metzger, who is currently a professor at the University of California, Los Angeles, and is the author of A Thousand Paintings: Visual Artists in Renaissance Italy (Yale University Press, 2019), and will be shown in the spring of 2020.In a letter addressed to Museo de Arte Contemporári, the organizers wrote: “The new Biennial will be a collection of works that were created before the birth of the artist, as well as a means of keeping the artist in the moment. We look forward to your invitation and to welcoming the public. We hope that you will join us in our mission to foster and discover new art from the artist’s historic collection.”\n\n\nThe Federal Arts and Cultural Heritage Agency (F.A.A.) announced today that artist David Pritchard has been selected to represent the states of Washington and Oregon at the 2020 F.A.A. Art in the Streets convention. The forty-eight-artist panel\u0097made up of John Randolph, a former F.A.A. director; Betsy", "The next Biennial should also feature essays by the following artists: Hélio Pires, Ursula von Rydstrøm, Jorg Holm, and Andreas Fimin, and the Curator of the exhibition, Rina Banerjee, and the curator of the exhibition, Olu Freda. The exhibition of paintings by Donatella Brugnara will be on view alongside those of the following artists: Jean-Luc Esai, Peter Theil, and J.M. Polidoro. The Biennial Masters will be announced in 2020.\n\n\nNew York’s Solomon R. Guggenheim Museum has welcomed three new members to its staff: Joëlle Magenta, who will be working in its gallery across the Hudson from April 19 to April 21, 2021; Jody Rogac, who will be working in the Museo del Barrio, in the construction industry, and in the hospitality industry from April 5 to April 7, 2021; and Monica Rojas, who will be working in the Art Institute of Chicago from April 6 to April 8, 2021. Magenta joins the Guggenheim from the Solomon R. Guggenheim Museum in Manhattan, where she will be working as a", "The next Biennial should be a great success. I am very much looking forward to working with the artists and the staff of the museum. I have only just begun to work on my plans and I can see a good future for the exhibition.”The 2018 Biennial will be staged at the Museu de Arte de São Paulo and will run in collaboration with the Museu de Arte Contemporânea. The exhibition will include material from the collection of the Brazilian painter Hélio Oiticica, and will also feature works on contemporary art from the 1930s to the 1960s. Each exhibition will be accompanied by a book, The Art of Beauty, and a special performance by the Brazilian artist Cervantes on the theme themes of beauty, beauty, and the beauty of the art, respectively.  The exhibition will also display the work of more than fifty artists at the museum in addition to the works of Oiticica, Galería Beaufils, and João Bâmara. The first show of the show is a selection of paintings by Hiromi Fujii, which will feature drawings by the artist from his collection.  In addition to the exhibition, Biennale de Sao Paulo has", "The next Biennial should take place in the United Arab Emirates from March 21 to March 23. The exhibition will also be organised in conjunction with the Dubai Art Festival, which will move from its December twelfth edition to March 21 and will be held at the Abu Dhabi Institute of Art, the Al Ula Cultural Centre, the Al Ula Art Museum, and the Diamond Art Museum in Abu Dhabi. The seventh iteration of the Dubai Biennale will be held in March 2020.The new partnership between the institution and the Abu Dhabi government was announced in 2020 following the 2020 Dubai Art Festival, which was staged at several locations across the United Arab Emirates, and the 2020 Dubai Book Fair, which was held at the Art Institute of Chicago. The 2020 edition of the Biennale, which was co-chaired by Jakob von Uexkirch, will return to the United Arab Emirates in February 2021.\n\n\nThe Museum of Modern Art (MoMA) in New York has joined the fight against the coronavirus and its parent, the coronavirus isolate Covid-19. On Wednesday, the museum released an open letter, signed by more than one hundred members of the museum’s senior leadership, which warns that the coronavirus and the", "The next Biennial should take place in the spring of 2020 and will be hosted at the American College of Art in the summer of 2020. The project will include research, writing, performances, exhibitions, films, and audio-visual projects that will present timeless Indigenous concepts and stories, and will explore how art can create new opportunities for social change. The six artists selected to represent Canada at the show were: Allora, Alīnuka, Anakin, Christine Pennington, Diane Surreal, and Oskar Werner. \n\n\nThe Art of the Arts Foundation (AFA) has announced that it is preparing to welcome the first visitors to Guadalajara\u0097the Mexican city that became a cultural epicenter for Mexican intellectuals and other arts in the 1980s\u0097to the organization next month. On Saturday, the foundation will announce the twenty-two artists who will participate in the inaugural edition of the annual exhibition.The inaugural exhibition will take up themes of questioning authority, sovereignty, and representation. The theme of the inaugural edition is “Imagination and Contagion: Mexican Artists and the Arts after the death of Esteban Pérez,” curated by José Luis García Otero.", "The next Biennial should be held in 2021.\n\n\nLebanese artist Omer Tel-Aviv has been selected as the fifteenth laureate of the Arab Arts Museum in Beirut. He was chosen by an award ceremony held at the PLO headquarters in Beirut on July 23. Minister of Culture and Arts Majed Hadid, who has served as deputy minister of cultural affairs of the Palestinian Authority since 2014, said: “This is an extraordinary achievement for an Arab artist, and my first time a person of his status. Omer has created a series of works that are life-changing, using his art as a reference and as a vehicle for an insight into the Arab world.”Born in 1950 in Jamaloun, near the Lebanese city of Tripoli, Tel-Aviv graduated from the Academy of Fine Arts in Beirut in 1977. Following the Arab Spring, he moved to the city and worked as a freelance artist before moving to Tel-Aviv’s Institute of Contemporary Art, where he met Manal El-Khattab, who introduced him to the French artist Thierry Bremuil, whom the two collaborated on the 1995 German documentary The World Is Not Enough, which premiered at the Venice Film", "The next Biennial should be held in the spring of 2022.The museum would also welcome several thousand visitors this year. It currently has around five thousand people in the galleries, with the majority of the work being exhibited by artists such as Diane Arbus, Ilse Bauer, and Irène Bussi. The museum plans to expand the capacity of its campus for the exhibition of new works by artists such as David H.’92, and to create new opportunities for children and youth. This spring’s exhibition “The Limits of Desire” is part of a larger project that is exploring the connections between art and philosophy and the relationship between art and society. The project is part of a broader project by the museum that is exploring the relationship between art and the history of the art of the past.\n\n\nSculptor Michael Driscoll, whose signature meticulously detailed works transform everyday objects and create an exhilarating and sometimes sublimely tactile experience, has died at age seventy-four. According to the New York Times, Driscoll’s work is populated by reproductions of objects from his childhood, such as the sculptural works on the sides of a car that are reminiscent of his favorite childhood toys, the train, and the", "The next Biennial should commence in 2022 and will comprise twenty-five artists, including a group show of David Cage, a sculptor, and a filmmaker, and will take place in the city’s St. Patrick’s Cathedral.\n\n\nItalian architect Cicina Cattani has been named the next president of the Italian city of Roma, which is located in the region of Umbria in central Italy. The 65-year-old, who previously served as a professor of architecture at the Ponti Institute from 2002 to 2008 and as an adjunct professor at the University of Trentino in Florence, has been nominated by the Democratic Party (PD), an anti-establishment party that has represented Italy’s northern-most region in Italy’s elections since 2013.Cattani has been endorsed by VA Europe, the European branch of Italy’s biggest trade association, and represents a party founded by architect Stefano Cattani, a wealthy real estate developer in Turin, but which has not released any organizational or policy statements regarding the new president. “The construction of the city is an irreplaceable and integral part of Roma’s history,” Cattani said. “As a", "The next Biennial should focus on how the intersection of art and technology has shaped social practices in city-states across the globe. The exhibition will also examine how the connection of art and technology has led to the construction of new social spaces, but also to the displacement of local communities and the fragmentation of the art and technology ecosystem. The exhibition will be organized in conjunction with the biennial “Art & Technology” in Rome. The inaugural edition of the exhibition, which will include work by fifty-four artists, runs through February 21.\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Tanya Gagan as its next director. Gagan comes to the institution from the Aichi Sculpture Garden in Japan where she has served as a curator of Japanese art since 2015. She succeeds James Trefis, who has helmed the Sculpture Garden since 1997, and will begin her tenure on February 7.“Tanya Gagan’s approach to curating Japanese art reflects the diversity of her disciplines and her unique understanding of how art can be a vehicle for social change,” said Adrienne Edwards, director of the MFA. “The next MFA iteration of the art and technology exhibition series will", "The next Biennial should be held in 2020 and ’s twenty-sixth in 2021.The museum is currently closed as it undergoes a $250 million renovation. It will reopen in 2022.\n\n\nThe Museum of Art (MoA) in New York is planning to move the exhibition and performance \"GRACE: A Biennial in a Time of Crisis,” which was set to open in September, from March to October. The move was made in the interest of increasing the exhibition’s reach across the United States.The announcement was made during a special exhibition devoted to the art of resilience at the institution. Displayed throughout the building’s new $650 million central location are works by fifty-six artists, including Alice Aycock, Ian Carey, Yinka Shonibare, Varjavu Pindell, and Simha Sahai. The exhibition will run from October 27 to October 29.“The migration of the show is a symbolic moment for MoA as we re-emerge from the impact of Covid-19,” said director Matthew Teitelbaum. “The show, a biennial at its core, will continue to grow in new ways as we continue to shape our program", "The next Biennial should be a long-term collaboration between the city, the museum, and the museum. “We need to understand that the future of the Pavilion is at risk,” said David Gass, chairman of the biennial’s board of trustees. Andrea Faura, president of the biennial’s board, added that the organization has long believed it was doomed: “Somewhere between the late 1990s and early 2000s, the museum was trying to move forward with the biennial, but the situation changed when the Pavilion Foundation stepped in to raise funds for the sculpture program.” \n\n\nThe Hirshhorn Museum in Washington, DC, has received a gift of twenty-nine works from the author Daniel Clowes. The donation includes twenty-five works by artists such as Eduardo and Virginia Gill, who are best known for their work demonstrating the interdependence of art and society; Frank O. Wilson; Julia and Iwan Wirth; Haley and John Michael Jann, whose work explores the idea of order and the relationship between people and objects; and Billie Rauschenberg, whose work addresses notions of beauty and fashion.“The", "The next Biennial should be held in 2019. “The Biennial is a continuous process that integrates the lives and creative projects of all of us,” said Bertrand. The Biennial—which will continue to be organized as it has always been—will include a new series of exhibitions and performances, a collection of works that have never been on public display before, and the first ever “family album.” The museum will be inaugurated with a gala, which will open to the public on Friday, October 31 and will run until Sunday, November 3. The show will feature works that are currently on display in the Biennial’s permanent collection and will offer an introduction to the biennial. The show is being organized by the French Ministry of Culture, the National Ballet Paris, and the Mozart Museums in Paris, with participation from the various local governments in Paris.The theme of the exhibition is “Places and Objects,” and the Biennial will invite the public to reflect on how they create and maintain their own physical, cultural, and spatial environments. The exhibition will include works by twenty-three artists and will run for twelve weeks. The opening of the show", "The next Biennial should be held in Beijing in 2021.  In a joint statement with the Chinese state-owned museum and the National Museum of China, the two governments announced that the negotiations over the museum were continuing apace. In a bid to reassure the Chinese, the government also announced that it planned to open an exhibition of more than 1,500 works by the artists who are featured in the exhibition, which will be entitled “China and the World.” While the exhibition will feature work by contemporary artists such as Ai Weiwei, Zaha Hadid, and Gu Yi, it will be completed in the confines of Beijing’s Tiananmen Gate, the site of the 1989 pro-democracy protests.\n\n\nThe National Museum of China in the United States (NMCUS) has announced that it will open a new digital platform called the National Museum of China (NMC) Digital Marketplace. The platform will serve as a platform for collectors, researchers, and scholars to exchange artworks and other objects and will provide digital content, including original works, performance, and books, in addition to physical materials.“This is a moment of great change for museums,” said Kathryn Edin, director of the National Museum of", "The next Biennial should be held in the spring of 2021, with the announcement of the winners taking place in the fall of 2020.The Venice Architecture Biennale will be held at the Venice Architecture Museum (VAM) from March 8–March 10, 2020. Both the exhibition and the biennale will kick off the lifespan of the arts museum. The exhibition will be curated by Fabio Fusi, the director of the Museo Giardino Centro de Arte Contemporáneo in Milan and the architect of the Museum di Venezio dal storico in Venice; the show will be curated by Andrea Celant, the president of the Museo di Venezio di Arti in Florence; and the biennale will be organized by Grazie Libretta in Rome.The exhibition will feature two hundred works, including work by more than 2,500 artists and collectors, from the exhibition “30 years of Biennale at Venice”, which runs until March 17, 2020. The program will also include more than sixty thousand photographs by Federico Baratta, a collector from Palaiseau, Italy, who recently sold his house in Milan and began planning to move to Sicily; a selection", "The next Biennial should be held within two years and may be an exercise in ‘postmodern’ art and, in so doing, the ability of a new generation of artists to be taken seriously. These artists are the ones who were not given their due in terms of their development, their experimentation, their growth, their rise to prominence, and their subsequent dismissal by the dominant culture. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has named Amber Ehrlich as its first director. Ehrlich comes to the institution from the Solomon R. Guggenheim Museum, where she has served as deputy director of education and public partnerships since 2016.“The Guggenheim’s staff and I have been planning for this role for some time and are excited to work with the Guggenheim’s incredible team and the rich collections to grow MoCA’s profile and strengthen our relationship with the local community,” Ehrlich said in a statement. “I’m excited to join the Guggenheim’s exceptional organization, the Solomon R. Guggenheim Museum’s incredible team, and the incredible community.”Ehrlich will assume her", "The next Biennial should focus on a re-imagining of the exhibition as a platform for the development of specific artists. At the same time, the center should display the works of the artists in the exhibition and make them accessible to the public. The creative landscape of the city should be curated by the city and curated by the institution.”The city of New York has made it a goal to revamp its public art over the past fifteen years and in 2014 ordered $50 million for local cultural institutions to do the same. The city created the biennial format to draw attention to the work of local artists, but not necessarily to promote their work; the artists were not given a platform to present their work. The city has since awarded $17.5 million to fifteen artists, including Benjamin Clement, Tanya Cooper, and Anna Atkins, and has also awarded $2.3 million to twenty-five museums, including the Metropolitan Museum of Art, the Whitney Museum of American Art, and the Brooklyn Museum.\n\n\nThe Institute of Contemporary Arts (ICA) in London has appointed three new trustees: artist and philanthropist Ana Mendieta, television presenter and author María Berrío, and the British novelist Nicholas Ray. Together these three have donated", "The next Biennial should be held in 2020. \n\n\nFrance will introduce new measures to combat racism following the deadly terrorist attack on a kosher market in Paris on Friday, November 13, that left twelve people dead and dozens injured. The country’s interior minister, Christian Grande, announced on Tuesday that the country will introduce new legislation to combat racism and xenophobia and that fines will be increased for violations.The new measures were made in response to the new anti-terrorism laws, passed by France’s National Assembly on Tuesday, which target individuals who are suspected of helping or preparing terrorists, and which were signed into law by President Emmanuel Macron. The legislation states that anyone who is suspected of having aided or abetted the terrorist actions in question will face up to five years in prison. It also specifies a $15,000 fine for individuals who intentionally cause unnecessary suffering.The new measures were introduced in response to the November 13 attacks that targeted the Louvre, the Centre Pompidou, the Centre Saint-Denis, and the Palais de Tokyo in Paris, and that left twelve people dead and dozens injured. According to French media outlets, a mob of hundreds briefly surrounded the Centre Pompidou in the early hours of the morning on", "The next Biennial should be held in January 2021, according to a statement on the 2018 event’s website from the museum. If the first version of the exhibition is any indication, the museum is committed to returning to the annual event. “We are constantly looking for new ways to engage with the exhibitions and to collaborate with the community,” said Allan McColl, executive director of the fair. “We are in the process of identifying the artist whose work will be featured in the Biennial 2020 and are evaluating options for a future exhibition.”\n\n\nThe March/April sale, which typically runs from March 17 to March 20, will come to a close on April 7. The run will conclude with a special exhibition of works by artists from South Asia and the Pacific region in April. Since the March/April sale only runs from March 17 to March 21, the run will not conclude until April 8, 2020. “We are so proud to announce that the next edition of the March/April Sale will run until April 7, 2020,” said Karnataka chief minister Siddaramaiah. “The theme of this edition is sustainability, and our artists will share their solutions and artworks", "The next Biennial should be organized in conjunction with the fifty-seventh edition of the Berlin Biennale. The writing of the show, which will take place between January and March 2021, will take up themes of social justice, interdependence, and exile. It will also showcase new works by artists from the US and Europe. “It is a daunting task to design and organize a biennial that will introduce a new format and a new style, yet still ensure that the show is a dialogue between art and politics, art and philosophy, art and art and architecture,” said Bernardo Gomes, the president of the Republic of Aragua. The decision to replace the annual event, which attracts around twenty-five thousand visitors, was made amidst mounting pressure on the Brazilian government to do more to support the art scene. According to Artnet, the government allocated $7.8 million for the next version of the Biennale, which will be held in March 2022. The announcement came two days after a report by the Artforum Council on Contemporary Art (AGAC), which surveyed more than one thousand recommendations for how Brazil should continue to support the local art scene and produced a new set of recommendations, which were", "The next Biennial should begin as soon as possible, with the objective of growing the exhibition at a rapid pace, with an intent to support and develop artists and the greater artistic and cultural environment in an exhibition-driven environment.” The event will focus on the work of contemporary artists who are addressing topics of their choosing, including the ongoing work of Yinka Shonibare and Sohrab Mohebbi. The theme will be “Guerrilla Art: the Art of Survival,” an expressionist-inflected effort to portray the hidden workings of the human body in urban environments. “We are excited to collaborate with our artists to further develop their practice through this exhibition, and to support their work in a space that respects and celebrates their vision of art as a tool for transformation and empowerment,” said Nadia Bruguera, director of the Biennial. The exhibition will open on September 21 and run through December 21, 2020. \n\n\n\n\n\nKamala Harris, the California-based attorney who has championed the cause of criminal justice reforms by championing projects such as the California Innocence Project and the California Innocence Defense Fund, has been appointed the next chair of the Los Angeles County", "The next Biennial should take place in 2020.According to the organizers, the theme of the 2020 edition will be “The Future of Humanity with Human Interaction.” They are not yet sure about the date, but the seventy-ninth edition will be held between March and June 2021. The artist-run exhibition space will also be moved to a new space in Art Basel and will be housed in an urban area in the city of Basel from where visitors will be able to see the project in person.The organizers say that the new exhibition space will be developed in partnership with the city of Basel. The exhibition will be curated by Hildegarde Cancellara, a designer and architect based in Milan, and will be hosted by the artist-run platform Digital Planet. The city of Basel will also receive 100% of the gross profits from the exhibition.According to the fair, the project will be staged at a scale never before attempted by an international art fair, with a staff of over sixty thousand, and will be led by Christof Koch. The new venue will also be equipped with cutting-edge technology, a digital archiving system, an archive, and a digital rental space. The first exhibition organized by Digital Planet", "The next Biennial should take place in 2021. \n\nThe Arts Council Scotland has announced that it is moving the thirty-third edition of the Edinburgh International Festival (EEF) to a new venue in a move that will allow the event to return to the city for an eighth edition in 2021. The move will also see the opening of an expanded and expanded version of the festival, which will now take place at the Royal Festival Hall in Edinburgh every June.The event is coming to a close in June 2019.  The move is part of a long-term plan to reduce the size of the Festival by 40 percent, to a footprint of twenty-four acres, and to prune the program by more than two hundred days. The date of the event has also been moved from June to July.“The move is a major step in the development of the work of the Edinburgh International Festival, which is comprised of a series of exhibitions, residencies, concerts, talks, and other events that have taken place across the city over a number of years,” said Phil Mattock, director of the Southbank Centre for Contemporary Arts. “The new space will enable the festival to present a more balanced programme, with the focus on", "The next Biennial should be in the Spring of 2021. Given the current situation, it is not surprising that we are still waiting.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles will not be closed during the coronavirus pandemic. Instead, on March 22, the museum will open to the public for one week, from March 23 to March 26. The first show of the new exhibition “Triumphs and Tragedies: The American Civil War” will open on March 26 and run through April 3. The show will include works by fifty artists and will run approximately two hundred feet.The institution’s director, Marc Glimcher, explained: “The immediate goal of the museum is to make sure that we are able to reopen as soon as possible and deliver a show that is as exciting and relevant as possible to our community. But even more important, we want to make sure that the show reflects the extraordinary diversity of American painting, drawing, sculpture, and sculptural history. And so the museum will continue to present the full range of American painting and sculpture.”The exhibition is being planned in partnership with the City of Los Angeles and the State of California, which acquired the Andrew Kreps–designed", "The next Biennial should be held at the Metropolitan Museum of Art in New York in 2021. \n\n\nThe British artist, writer, and entrepreneur Steven Stapleton (1924–1983) has died at age eighty-nine at his home in London. His daughter, Evelyn Stapleton, confirmed that the cause of death was brain cancer. “Steven was a powerful force in our culture, and his death has never been in doubt,” Evelyn said. The poet and activist used his own body, and the medium of film and film-making, to advance his own political and social causes. In 1961, he founded the nonprofit Screenplay; in 1966, he began a project for which he brought together thirty film crews from forty-nine countries and made his first documentary, Jack and Jill (1971), a groundbreaking account of an American subversion of the Vietcong in Laos. He later produced works that address the American civil rights movement, anti-war activism, and environmental justice, including a 1978 performance piece for the Barbican Center for the Performing Arts, a London nonprofit that hosted the first yearly Biennial of British Art in the United States.In a review in the February 1974 issue of Artforum, John Burch of", "The next Biennial should be focused on the ways in which transgender and queer histories are interwoven with histories of colonialism and exploitation. It should also continue to explore the intersections between art and politics, the body and the social environment, and the body and the political. And finally, it should consider how art can serve as a vehicle for social change.”Curator and former chief curator of the OMA in New York, Chris Ware, told the Art Newspaper that the museum is “trying to do what we can with art,” but added that the current exhibition, “An Open Secret: Transgender, Lesbian, Gay and Bisexual Art in Six Centuries” is not on display. Ware said that the exhibition will be “based on the idea that art is the vital vehicle for our decisions and that art can be an instrument of political action.” The twenty-four-hour–a-day exhibition will include paintings by artists such as Hélène Iandré, Nicolai Ghebaly, and Birgit Joos, as well as sculptures by and about gay and transgender artists. “When I say art, I’m not talking about the art of the past. I", "The next Biennial should be staged in 2021, and the twenty-seventh in 2024. The twentieth will be a retrospective of the work of the contemporary artist Paul Gauguin, the twenty-first a presentation of the work of the artist-activist Jean-Michel Basquiat, and the twenty-second a biennial of the artist-dissident Cocteau Twins.\n\n\nThe National Gallery of Scotland has appointed Ted Kent as the next director. Kent—a British-born, Scottish-raised American—has led the institution for six years. He succeeds John Cartwright, who has helmed the gallery since 2008, and will take up the post at the gallery next month. Kent’s appointment was announced on Friday.“The gallery has always been a site of artistic expression for Scotland, as reflected in our collections, exhibitions, events, and programs,” said Cheryl Cropper, director of the National Gallery of Scotland. “Ted has a keen understanding of the unique, and frequently challenging, relationship between art and technology. He has been instrumental in ensuring the gallery’s position as one of the most important platforms for contemporary art, and has developed effective and innovative ways for artists to work", "The next Biennial should take place in 2020. The second, entitled The Art of Operating, will be staged in 2021. The third, entitled Latifah (The Red Harrowing), will take place in 2022. The fourth, titled Sister Lulu, will open in 2021. The fifth, titled Away, will be staged in 2022. The sixth, titled The Book of Night, will be presented by this year’s Frieze London Triennial.\n\n\nThe National Gallery of Canada has received a gift of sixty-two works by the Swedish architect and architect-turned-artist Emma B. Henriksson. The donation, which includes six works on paper, consists of a pair of works on paper by the artist on her home-built Binnlenskvarten, a former steel mill in the suburb of Brepols, Sweden, and a series of paintings on paper by the artist in the city of Malmö, Sweden.According to the National Post, the works were purchased by the National Gallery of Canada from the artist in 2014. At the time, the institution was exploring the idea of running a museum-within-a-museum, and a", "The next Biennial should take place in 2021, and the 2020 edition was originally scheduled to open in 2019. However, due to the Covid-19 outbreak, it was pushed back to 2021. The opening of the 2019 edition was pushed back to 2020, and the 20 and 22 editions were also pushed back. The 2021 edition will now be held at the Museo de Arte de São Paulo, and the 2022 edition will be held in São Paulo.  \n\nThe Centro de Artesia Nacional in Sao Paulo, Brazil, has received the 2018 CEIW/CEPMA International Award for Emerging Art from the South American organization. The $50,000 prize, which honors emerging artists, was established in 2015 and recognizes work that generates strong social and cultural interest and is published by a single institution.The 2019 winner was Jimmy Taunton, who will receive $500,000. The prize jury praised his work for its “contemporary technical and aesthetic elements,” as well as his dedication to social justice, and noted that his work “provides a comprehensive overview of environmental sustainability, focusing especially on water, climate change, and social justice.”The jury added: “The work of", "The next Biennial should be held at the Palmer House, London, at a date yet to be determined. The first event, entitled “The Situationist Exhibition at LACMA, 1968,” will be at the Egyptian Museum in Cairo in 2020. Artforum has reached out to the organizers of the exhibition for a statement.\n\n\nArtist, publisher, and educator Yoshitomo Noda has announced that he is leaving the New Art Dealers Alliance (NADA) to become the next president of the Culinary Arts Federation (CAF) in the United States. Noda will assume the post in January 2020. “Yoshitomo Noda will be the president of Culinary Arts Federation,” said CAA president John Salter. “He has been a champion of artist-run, artist-managed businesses for more than a decade and will bring a wealth of experience and talent to the alliance. We are excited to welcome him to the table and are confident that he will be an effective leader for the next ten years.”Noda succeeds Tony Monaghan, who retired in March 2019 after twenty-one years at the helm of the Culinary Arts Federation. During his tenure, the organization scored several", "The next Biennial should be held in the spring of 2021. “While we are grateful to the dedicated and talented staff and board members of our contemporary art museum, we know we have much to do and much to show,” said Sinthujan and Sunil. “We are also proud to be the birthplace of the original biennial, and the country’s first museum dedicated to modern art. We hope that this exhibition will stimulate and extend the voices and imaginations of our young curators, and that today’s visitors will be inspired by the art of tomorrow.”The biennial’s exhibition, “20/20,” will be curated by Hoor Al Qasimi, the artistic director of the Al Qasimi Foundation and a professor of art history at the University of Maryland, College Park, and will feature new works by thirty-eight artists, including Hayley Sales, Adam Durbin, Tiana Foa, David Kray, Katia Laudel, and Stephen Sondheim, as well as a selection of work by twenty-six contemporary artists. The exhibition’s location in the United Arab Emirates will also be designed by Liban Mpagi", "The next Biennial should be a celebration of the art of the present moment. It should be a reflection of the past, the future, and the future. It should reflect the global unity that binds us and the world together.”Additional funds for the \"Art of the Future\" will be made available in the form of prizes. “The Biennial’s annual prize fund was established in 2007 to support the Art of the Present exhibition program,” said Fernanda Pindell, the director of the Biennial. “This year’s awardees reflect the spirit, vision, and intention of the Biennial’s previous awardees, who have been inspired by the opportunity to present works of art from the future.”\n\n\nA group of artists, artists, and designers are demanding that the French government provide them with $10 billion in aid to combat the coronavirus, which has infected more than 3.4 million people in France and neighboring countries and caused at least 294 deaths, in a massive public health crisis that has also impacted the arts. Since the coronavirus outbreak began in Wuhan, China, on December 7, the capital of the Guangdong province of Guangdong, Beijing", "The next Biennial should take place in 2020, and the 2019 and 2018 editions will be followed by a special exhibition of work by artists from the Antipodes. \n\n\nThe Museum of Modern Art (MoMA) in New York has announced that it is preparing to welcome visitors back to the institution in June. The announcement comes two weeks after the institution issued a public apology for the way that it handled the September 11 attacks in New York and New Jersey. In the second apology, the museum said that it attempted to prepare for the reopening of the museum by reopening two of its buildings in phases, in January and March.The announcement was made at a moment when crime museums across the United States are struggling to cope with the impact of the coronavirus. On Monday, the Los Angeles County Museum of Art announced that it will close indefinitely, citing financial losses as a factor. On Wednesday, the New York Museum of Modern Art and the Metropolitan Museum of Art announced that they were reopening, but would extend the opening dates of the latter two installations. According to the Los Angeles Times, the Met announced that it would close early next month, and the museum hopes to reopen in June.In response to the coronavirus outbreak, MoMA director Daniel", "The next Biennial should be held in September 2021. The following year, the museum will host two exhibitions, The Artist’s Place and Celebrating the Artist, from the Museum of Modern Art (MoMA), which is currently closed for its summer exhibition season.\n\n\nThe Weinstein Company and the Metropolitan Museum of Art have reached a settlement with an ex-employee who was accused of stealing about $120,000 from the company’s art department over a six-month period in 2017. The New York Times reports that the six-month span began in June 2019 and ended in September 2020. The woman, who asked that her name not be published, filed a complaint with the company\u0097which did not address whether it terminated her employment\u0097but said that the retraining program that the museum offered her was not enough.“We treated her like a second-class citizen,” the former employee, who requested anonymity, told the New York Times. “She came to work every day expecting to be paid. She was never paid. She was told she was being laid off, and when she complained, we claimed she was being unfair.” The woman claimed that the institution took advantage of her position at the institution by", "The next Biennial should take place in the year 2022, at which point the institution will close and the David-Andronova-designed building will undergo a major renovation. In a letter published by the museum, the institution said: “The renovations of the museum are in keeping with the theme of the current exhibition: The Future is Now, but the Museum does not want to lose its atmosphere. We have already started preparing for the exhibition. The next Biennial may be decided by the Board of Directors. We shall see.”  \n\n\nThe National Museum of the British Isles (NMBI) in Cardiff has received a gift of twenty-two rare works from the Welsh artist and scholar Robert Southey. The works, which were donated by the artist to the institution in 2008, were acquired by National Poetry Month, the annual celebration of the arts, and will be exhibited in the museum as part of a major exhibition of work by the artist, titled Realities, and his family, and others, which will open on March 19.According to the artist’s daughter, Carol Southey, the works are part of a collection that stretches back to the 1920s, when she was only ten years old", "The next Biennial should open at the Museums of Contemporary Art in London on March 23. The exhibition will offer a collection of works by contemporary artists such as Jamie Whittlesey, Jeannette Adam, Tanya and Anna-Sophie Tschäpe, and an interview with Hauser & Wirth director Amiri Barozzi, among others. The show will also feature performances by artist-in-residence Rosalind Richards, a curator who also runs the presentation space Galerie Lelong & Co., and five artists from the Biennial’s inaugural cohort: artist-in-residence Sohrab Mohebbi, artist-in-residence Amira Nati, and Lou Reed, among others. The exhibition will also carry a retrospective of the work of the same name, which will be curated by Barozzi and will open on September 25. The show, which will take up contemporary art from around the globe, will be organized as a multi-venue public art project that will run from September 24 to November 28. The inaugural program’s curators include Vincent van Gogh, Jocelyn Forti, and Kiki Smith.  The full list", "The next Biennial should be held in 2020. Artforum also revealed that the 2021 edition will be held in the Dominican Republic, Argentina, Bolivia, and Peru. \n\n\nThe Metropolitan Museum of Art has announced that its collection of art from the early twentieth century has surpassed its goal of $100 million for the 2020–19 academic year—it now has a global art mark of $204.5 million. After accounting for inflation, the museum says the mark is now more than three hundred years of museum-going. The met's new Art of the Century series aims to amplify museum-going experiences by bringing together work that embraces the latest research and cultural trends.In the 2020 edition of the art of the century, Lelong & Co., the gallery located in the former Eastman Chemical Company (EEC) in Menorca, California, will present the work of Solzhenitsyn. The exhibition--originally slated for January 2021, but pushed back to April due to Covid-19--was originally titled Art of the Century’s Next, but has since been rebranded. The inaugural event, “Art of the Century’s Next: Solzhenitsyn,” will be on view May 2", "The next Biennial should take place in 2020.”--Chris Park, head of the exhibition’s planning committee, said: “We are really looking forward to being able to present the final exhibition of this visionary season. It is a project in the making and a painstaking process that takes many years to complete. We know that it is a difficult issue for many artists and their families to accept; and it is even harder to present a unified exhibition. But the future of the exhibition is at risk, and we are determined to help make a bold statement about the exhibition by presenting the exhibition that has never been staged in the UK.”Kasmin and IKEA have joined the campaign to retain artistic freedom and protect the artistic community’s livelihoods by introducing new incentives for institutions and other organizations working in the fashion and art industries. The initiative, called “Music for the Future,” will send $100,000 each year to various arts and cultural organizations through a series of grants.The grants will be divided between institutions and will allow organizations to build on their existing creative projects, establish new projects, or explore new opportunities. The first year grant recipients will be Klaus and Katja Kasmin, art handlers based in Kassel", "The next Biennial should be held in the fall of 2020. \n\nArt in Motion, the Los Angeles–based nonprofit that supports contemporary artists in Los Angeles, has received a $100,000 donation from the legendary artist and collector David H. Koch. The organization is currently developing a new platform that will enable artists to share their works in real time with fans and other digital platforms. David H. Koch Foundation president and CEO Marc Spiegler said that David H. Koch has long been an advocate of the arts and has invested in the careers of many great artists. David Koch gave the nonprofit $100,000 to help advance its plans to create a new digital platform for award-winning artists. The initiative, which will launch in January 2021, will work with the artist and their supporters to inspire them to continue their work, and will serve as a platform for artists to meet David and hear his thoughts and advice.“David is dedicated to supporting the arts and has backed nearly every major initiative in support of artists for many years,” said Marc Spiegler. “Our work together in support of these artists has been the backbone of the organization for more than forty years. David has been a generous partner to the museum and their", "The next Biennial should take place in 2020. \n\n\nThe Shed, the London museum that was founded in 1974 by David Bond and Henri Matisse, has announced it is planning to shutter its iconic Tate-Davidson building in 2020. The museum, which comprises twelve galleries and various spaces, has been attempting to reduce the size of its premises since it closed in 1999.Following a decade of negotiations, David Bond and Annie Pape, who collectively own the Tate, announced in September 2019 that the museum would now be able to present more exhibition space, including a new masterplan, and will also be able to reopen if necessary. The announcement coincided with the reopening of Tate Britain.The announcement was made amid a global whirl of cultural and political events, including the Museum of Modern Art (MoMA) and the Whitney Museum of American Art in New York, the opening of the inaugural Biennial of European Art (Budapest), and the reopening of the Van Gogh Museum in Amsterdam and the Museum Steegmans in London.The announcement coincides with Artnet’s reopening of its digital platform, Artnet World News. Its new online forum, which will launch on January 27, 2020, will showcase news, reviews, and", "The next Biennial should be held in 2021 and will be curated by Andreasa von der Leyen. A retrospective of the artist’s work will open in Helsinki in 2022.\n\n\nThe United States Coast Guard in the Gulf has seized an eighteen-foot-long (5.6-meter) oil tanker, which was transporting 470,000 barrels of crude oil daily from Saudi Arabia to US ports, in a seizure that included the dismantling of its entire hull, in a raid that occurred on Thursday, March 2.\n\n\nOn Thursday, the US Coast Guard seized an eighteen-foot-long (5.6-meter) oil tanker, which was transporting 470,000 barrels of crude oil daily from Saudi Arabia to US ports, in a raid that occurred on Thursday, March 2. The seizure of the bulk container, which was bound for New York, came a day after the Coast Guard seized a second tanker, this one carrying 280,000 barrels of oil from the same source, in a raid on a storage facility in the New York borough of Brownsville.The Coast Guard says the seizure of the two vessels, which were bound for Saint James, New York, occurred at approximately 11:45 AM on March 2 when the engines of the first vessel", "The next Biennial should occur in 2022. \"How do we move forward with this exhibition, this exhibition, and these works?” Patrick Lamont, president of the Biennial Foundation, asked. “I think the first step is recognizing that this is an important and significant exhibition which has had an outsized impact on the history of art,” said Lévy Gorvy cofounder and Gabriel Foundation board president, Raymond Peiffer. “We have a responsibility as curators and supporters to continue this work, to move it forward and to push it forward.”While the festival will not be canceled, it will shift its programming this year and will focus on returning art to the West Coast. Previous editions of the Art Basel show, which is currently on view through April 4, have been canceled and new shows have been added since its debut. The new exhibition will feature work by thirty-one artists and will run from March 16 to March 20. While the exhibition will feature work by Sylvia Acconci, John Akomfrah, David Chipperfield, and Walter de Maria, the Art Basel “next edition” will not feature works by these artists. Its", "The next Biennial should be a celebration of the past, with a new view and a new architecture, and could be held as early as next spring. The concept of a biennial is not new. In fact, it has been an integral part of the Biennial since 1993. The biennial has been on hold since 2017, when the funeral of the late Palestinian artist Walid Raad was held at the Biennial. The biennial is now moving forward in a more streamlined fashion, with an end date of September 2022. In a statement, the American Friends of the Authoritarian State said: “We are grateful for the discussions and the invitation to the Biennial, especially as the themes this year are the commonalities of the human experience: anger, despair, and hope. Our program is becoming more personalized, and ultimately more participatory, and we believe that this will be the year of the biennial. By creating a platform for the reflection of the themes of generations, the biennial will be an opportunity for the United States to reflect on the legacy of our own past.”The upcoming exhibition “One Nation, One Life,” will focus on the biennial’s themes of solidarity and community, a theme that", "The next Biennial should be held in 2022. However, since the organizers are currently working on a new program, it may be several years before the twenty-third edition of the Biennale is held.\n\n\nGerman artist Karl Löwenhoven, who worked between 1962 and 2003, has died. He was ninety-six years old when he died.Born in Berlin in 1930, Löwenhoven studied at the Academy of Fine Arts in Vienna and the Institute for Modern Art in Munich before landing in Vienna in 1933. He studied at the city’s Institute of Art, Art History, and the History of Art before moving to the German city of Baden-Baden, where he would study at the Institute of Art and the Schloss Neuschwanstein.In 1963, Löwenhoven moved to the Center for Contemporary Art (CMA), where he studied under Hans Hofmann. The project culminated in a piece that investigates the concept of a sacred space, an area for contemplation that takes up the theme of “night and day” in a series of black-and-white photographs. The work was entitled “Anata” (Day of Night) and was made in the studio of the artist", "The next Biennial should take place in 2024, and the new exhibition should focus on the work of the artist’s most recent work, “Dangerous Liaisons.”Nadezhda, who has had exhibitions at the Venice Biennale in 2005 and at the New Museum in New York in 2009, has also been named the winner of the $50,000 Cultural Prize. The inaugural prize was awarded by the CCA to Nadezhda and her wife, Anatole, in 2017. Both artists are now working to raise the rest of the funds for the prize.\n\n\nThe National Museum of the American Indian (NMI) in Washington, DC, is extending its contract with photographer Jeffrey Gibson, whose extraordinary series “Stages of Native American Reproduction” (2011–2018), which is now on display in the museum’s new “Dirty Birds” exhibition, is expected to draw an additional 2.5 million visitors.The institution confirmed that Gibson’s new show, which is currently on view until August 8, will be the first time the collection will be open to the public in more than forty years. The exhibition will include new works by twenty-nine artists and", "The next Biennial should be held in the spring of 2021. Rakowitz said: “This is not a moment of transition, but a moment of renewal. It is a time of new beginnings. It is a time to forge new alliances across cultures, religions, and nations. And it is a time of transformation and renewal.” The exhibition will feature work by thirty-three artists, including the Pakistan-born, Hong Kong-based artist Malala Yousuf (1934–2010), whose work will be included in a special exhibition titled “Letters from Pakistan” that will open at the museum in March. The exhibition will also include work by three artists whose works were previously on display in the Biennial: the Czech-born, San Francisco–based artist Marta Kudacki (1929–2001), whose work was previously on display in the 2002 and 2007 biennials; and the Pakistani artist A.S. Shah, whose work will be included in a special exhibition titled “Between the World and Me” at the Museum of Modern Art in Los Angeles in October.\n\n\nOn Monday, the New York City Department of Cultural Affairs (DCLA) announced that it", "The next Biennial should be held at least once every other year, said Hernan C. Miranda, the director of the museum, who noted that in the past several years, the museum has expanded its performance space, added new exhibitions, and reworked its collection in order to better engage audiences in San Francisco.Other galleries that have been working to expand in the Bay Area are Marcel Duchamp, whose exhibition, Art: The Expanding Image, opened in the museum in 2014, and Alexander Calder, whose work was featured in a major retrospective at the Diller Scofidio + Renfro in New York in 2016. The opening of the Museum of Contemporary Art (MoCA), Abu Dhabi, earlier this month set the precedent for the upcoming event.\n\n\nArt historian, theorist, and curator Carol Ann Miller, who served as director of the Philip Johnson Gallery at the University of Pennsylvania from 1987 to 2017, has died at age eighty-eight.Born in Seattle in 1941, Miller came to the United States at the age of twenty-nine after her parents divorced. Upon her arrival, she went on to study with Robert Irwin at the University of Washington in Seattle, married her fiancé, Richard Feinberg,", "The next Biennial should take place at the Academic Center in the coming weeks.The show will be staged in the basement of the University of Washington, in Seattle, and will be organized as follows: • September 12–September 13• September 13–September 14• September 16–September 20• September 21–September 26• September 26–September 28• September 29–September 30The full list of participating galleries is as follows:Amanda Al-Baraka, New York/New York CityAlexandre Balsom, New YorkBains and Schwartz, New YorkBenedict Anderson/Sutton, New YorkPeter Beardsley Art Gallery, New YorkChris Blaha Gallery, New YorkCedric Balsom, New YorkCarmen Bilecki Art Museum, New YorkCoffeehouse Gallery, New YorkMaria Balsom, New YorkBerenice Balsom, New YorkBobby Bilecki, New YorkBianca Bily, New YorkBohuson Gallery, New YorkBONO Art Gallery, New YorkBONO Gallery, New YorkBONO Gallery, New YorkBONO Gallery, New YorkBONO Gallery, New YorkBONO Gallery", "The next Biennial should be held in 2021. \n\nThe Museum of Fine Arts in Boston (MFA Boston) is working with the Massachusetts Museum of Contemporary Art (MMCA) to add more than 1,500 works by 150 contemporary artists to its holdings. The museum will announce the artists it has selected for its new exhibition, “Generations,” in September, 2020. “The era of art–historical exchange, collaboration, and exchange is under assault,” said director Maria Balshaw, who added that the museum is working with the Massachusetts Institute of Technology (MIT) to help address the challenges posed by the coronavirus.“We are acutely aware that sharing these works can be challenging, and we are committed to working with the MIT library, the community, and the broader art world community to ensure that these works will be accessible to all, especially those in remote areas with limited accessibility. We are also pushing for greater transparency around how best to work with artists. This is an unprecedented challenge for museums, and we know that it will take time and collaboration to unravel the many social, cultural, and economic and political forces at play in the years to come. But I believe that we, together, can make", "The next Biennial should be held in the autumn of 2021.\n\n\nThe heirs of the late British artist David Hockney, who pioneered the use of intergenerational storytelling to explore themes of memory and memory-making, have announced that they plan to sell the estate of the late artist and advocate for the preservation of the works of their great-grandson.According to the Art Newspaper, the heirs met with museum directors in an attempt to find a solution that would preserve Hockney’s legacy. The heirs claim that the controversy surrounding the estate has prevented them from reaching an agreement for seventy years.The estate’s current owners, the British Leyland Foundation, have long denied the family’s claims and have claimed that the heirs are trying to push through a reorganization plan that would involve the estate moving from the historic Tate to the Tate, which it views as a subsidiary. The foundation has also argued that the estate’s current management, led by Christopher Leslie, is responsible for the artist’s passing away in 2010.“David Hockney: The Art of Memory” is scheduled to open at the Leyland Foundation in the autumn of 2020. The estate is currently slated to reopen in 2021 under Leslie�", "The next Biennial should be held in 2021 and will have a budget of US$4.5 million. The museum has commissioned artist Hiroshi Hasegawa to create an exhibition that explores how the power of light and the relationship between people and the environment can change the landscape for the better. The exhibition will focus on the concept of 'color' and will include new works by the artists whose work will be based around the elements that make up color.The museum is also planning to begin to restore one of the world's most important works of art, the work of the artist Marie César René, which was on display in the exhibition “The City and the World.” René’s home is currently being restored by the National Institute of Contemporary Art, Paris.\n\n\nThe National Galleries of Scotland (NGH), the National Museum of Scotland and the National Museum of Art in London have formed a new £15 million partnership on curating and exhibiting modern and contemporary art in an effort to foster a greater understanding of the cultural legacy of Scotland and the UK. “We are excited to launch this new partnership, which will bring together the National Galleries of Scotland, the National Museum of Scotland and the National Museum", "The next Biennial should take place in 2020. \n\n\nThe Museum of Art in New York has appointed fourteen artists as the winners of its new $10 million Fund for Excellence Award, which is available to non-native and emerging artists. The biennial, titled The Fund for Excellence, was established by the fund in reaction to the economic uncertainty caused by the Covid-19 pandemic. The prize will provide support for a lifetime of work. The awardees are:NICOLEE ALBERT, California’s national (and, to date, only) muralist;NICOLEE ALBERT, California’s national (and, to date, only) sculptor;NICOLEE ALBERT, California’s national (and, to date, only) painter;AJ HONIGNANO, the Philippines’s national (and, to date, only) polymath; and Sara Pozo, the founder and director of the contemporary art space MAX.POPALOGUE:HELMES: From Urban Animals to Mythologies, from the Habit to the Story, from the Past to the Present, from the Past to the Present, from the", "The next Biennial should be in February 2021. \n\n\nThe Museum of Contemporary Art (MoCA) is planning to open its new headquarters on West Twenty-Third Street in Manhattan on January 3, 2021. The museum is currently constructing a new building at 356 East Twenty-Fourth Street that will house its permanent collection, and the opening of the new institution will coincide with the reopening of the Museum of Modern Art and the renovation of the Central Park Conservancy.The museum was awarded a $5 million grant from the $35.7 billion CARES Act last week. The law requires that fifty-two institutions—including the Metropolitan Museum of Art, the Museum of Modern Art, the Whitney Museum of American Art, the Los Angeles County Museum of Art, the San Francisco Museum of Art, and the Seattle Art Museum—be authorized to receive federal disaster relief funds through December 31. The institutions must be located in Manhattan, and the communities in which they will operate must be made up of fifteen thousand or fewer people.The twenty-nine institutions participating in the program are as follows:The Metropolitan Museum of Art (Manhattan) – opened on September 9 The Museum of Modern Art (New York) – opened on November 23 The Whitney Museum of American", "The next Biennial should take place in 2020 and will focus on contemporary art in India, and the collection, exhibition, exhibition, and scholarship of contemporary art in the country. The exhibition will also include a program of presentations and workshops and will be hosted by the National Gallery of Art and the Delhi Art Gallery. The exhibition will be a retrospective of the work of the artist S.K. Purushoth and will open at the National Gallery of Art in 2021.The Biennial will be hosted at the National Gallery of Art in New Delhi from April 16 to April 20, 2021.  The biennial will comprise an exhibition of the work of three artists: Shiva Ayyadurai, the founding work of the Sisagari family in the city of Varanasque, India; Anupam Gupta, who works in the visual arts and performance; and Shurrjit Singh, who works in the visual arts and performance. In addition, the exhibition will be a collection of work by the artist M.P.S. Surjewala and will feature the work of more than thirty artists and collectives from sixteen countries.\n\n\nThe Hirshhorn Museum and Sculpture Garden in Washington, DC, has appointed Harriet Caldwell as its next executive director", "The next Biennial should take place in the Seito-ryu building in the city of Yokohama, Japan, in 2024. \n\n\nThe Danish Ministry of Culture is planning to spend more than $2 million on the reopening of the Annenberg Space Museum in Los Angeles in 2021. The institution, which has been closed since March 13 due to the Covid-19 pandemic, will welcome visitors back in March. Its Danish director, Margot Wallstrom, told the Danish newspaper Aftenposten that the furlough of the museum’s employees and the consequent loss of revenue has made the decision to open in the United States all the more difficult.Wallstrom said that the museum will initially welcome visitors in March but will “reverse-engineer” the institution’s programming and design to make it “more engaging and flexible for a wide audience.” The minister also said that the new installation, “The Open Garden: Denmark in the Middle,” will feature art from across Denmark’s history. The museum is planning to open next year, but the date has yet to be set.\n\n\nThe Hong Kong–based artist, whose self-taught, often experimental conceptualistic", "The next Biennial should be held in 2021. The decision to postpone the event was made in light of the Paris Agreement, the United Nations Framework Convention on Climate Change, which states that all countries must reduce greenhouse gas emissions by 26 to 28 percent below 2005 levels by 2025. The convention also outlines steps that can be taken—such as the sharing of information and the establishment of a research consortium—but states that the government of Hong Kong must determine the future of the Hong Kong Special Administrative Region (HKSAR), which comprises the Hong Kong Special Economic Zone (HSEZ), the Hong Kong Special Administrative Region (HoSAR), and the Hong Kong Special Administrative Region (HSAAR), before any action can be taken. Previously, the government has allocated HK$63.5 billion ($71.8 billion) to mitigate climate change, but only HK$26 billion has been spent on mitigation, leaving the rest to the private sector. The US also announced in May that it expects to spend $54 billion on climate change mitigation over the course of the next decade, with an additional $29 billion allocated for emergency funding. The announcement followed the US Environmental Protection Agency’s announcement that it would slash the budget of the US Climate and Energy Research", "The next Biennial should be held in Los Angeles between May 25 and May 29, 2020. The theme this year is “Life After Life.” The exhibition will also feature a new performance series, the Biennial Live, which will bring together contemporary artists and biennial organizers, and a special exhibition of work by contemporary artists.The 2019 biennial event will be held at the Museum of Contemporary Art Los Angeles (MoCA), on the third floor of the old City Hall. The exhibition’s first event was its book launch party, which was held at the Museum of Contemporary Art in New York.  The 2020 event is scheduled to open in January. The full list of participating artists is as follows:CANDELLE, Barcelona, FranceYosef Kaddour, Beirut, LebanonRaja Haroon, New Delhi, IndiaNaomi Klein, New York, USAAbbey Mathison, New York, USAFlora Neesham, London, UKYael Alaykara, London, UKOlivia Paxton, London, UKMingdao Wang, Beijing, ChinaYoko Ono, New York, USASasha Sifuentes, New York, USAMing-D", "The next Biennial should be held in 2021, with the intention of presenting a different play each year. A new budget should also be established to support the need to host an exhibition at the museum each year. The Biennial is currently run by the museum. \n\nRussell D. Harmon, the director of the University of Pennsylvania’s Philadelphia Art Museum, has announced that the institution will close its doors in mid-February and return to normal operations. The announcement follows the announcement that the museum would be placed on indefinite hiatus\u0097it was already temporarily closed in April\u0097following a months-long investigation into the mysterious death of archaeologist Laura Silsby, who was fifty-six years old and an active collector. “It is with great regret that I announce the museum’s reinstallation of its full-scale programs,” said Harmon. “I believe that the best way forward for the museum and for the city of Philadelphia is to have the museum and city continue to function as one large, vibrant entity, while working collaboratively with the city and county to develop new and innovative ways for the museum to present and present our collections.”The museum has been a city-owned entity since 1929.", "The next Biennial should take place in 2022 and the exhibition should open on December 4, 2022. The exhibition will be held in the city-state’s downtown São Paulo, which is one of the largest concentrations of civet mills in Brazil. The exhibition will continue to be held in the city as an independent entity and will exhibit work by artists and institutions from across the world. “The Biennial has been expanded from its original master plan to cover the entire city of Rio de Janeiro, including the street level,” Jorge Cipolletta, the president of São Paulo, said in a statement. “This new proposal is a real step forward for the exhibition and for the city of Rio. We look forward to presenting this to the public in 2022.”Spain’s Ministry of Culture has officially approved a new five-year plan for the country’s cultural sites, which will begin with a four-month period of reflection and culminate with a theme-driven triennial. Formed by Culture Minister José Manuel de la Madrid and Culture Minister Ada Colau in December 2019, the theme of this year’s edition was Life, Politics, and the Body. The activists behind the", "The next Biennial should be the year of the artist’s life. Inaugurating the museum will be an exhibition of the work of the exhibition “The Body in a Jar” (2018–19) and an exhibition of “Tania Bruguera: Flowers on the Wall” (2019–20), together with a performance by the artist.The biennial process, which began with a question asked by Hilde Nilsen, the director of the Palazzo Armada and Renaissance, has been running since May 2019. The museum is currently constructing a new pavilion for the exhibition, which will be inaugurated by a symposium entitled “Beyond the Body,” which will take place at the Palazzo Armada at the end of September, and is working on the development of a series of public programming and exhibitions that will be hosted in the pavilion as part of the museum’s New York–based project, the Long Island–Manhattan branch, the Art of the Future, which will open in 2020.\n\n\nItalian director Giampaolo Cipolletta has resigned amid the ongoing political crisis over a series of controversial decrees by Prime Minister Silvio Berlusconi,", "The next Biennial should be announced in January 2021, with the exhibition likely to run from May to November 2021.  The 2020 Biennial will be held in Glasgow; the biennial was already scheduled to be held in the city in March 2019.  The event will travel to the city from June to November 2021 and will host the first edition, which will be held in December 2020.  The twenty-fourth Biennale de Lyon (June 2020–November 2020) is scheduled to be held in Barcelona at the end of the year.  Among the projects that will be included in the exhibition are a play adaptation of Leo Tolstoy’s The Three Musketeers, a collaboration between artist and painter Edvard Munch, artist and theorist Adrienne Edwards, and the work of artists such as Hans Ulrich Obrist, Peter Ando, and Frank Stella.The full list of participating artists is as follows:Andreas Gielen, DenmarkOli Gretchen, SwitzerlandCatherine Laverrière, FranceJean-Pierre Ménard, FranceBertrand Burke, GermanyRemy Mauduit, FranceBertrand Moll, FranceAndreas von Bode, GermanyLeo Tolstoy,", "The next Biennial should be held sometime between October and December 2019, and will likely be in New York.\n\n\nThe National Gallery of Art (NGA) in Washington, DC, has appointed Jennifer Gurst as the institution’s first director. Gurst will be tasked with leading the NGA through a transition that will include the acquisition of only works in its collection. Gurst will take up the post on October 16.“Jennifer’s leadership, enthusiasm, and vision for the NGA and the DC region make her the perfect person to lead the upcoming collections,” said NGA president André Büttner. “We are grateful to John Helmer and the Board for nominating her as director. She is a talented leader, and we are confident that she will continue to push the gallery’s collection boundaries and continue to develop new and exciting works.” Helmer added: “After a spirited and often extraordinarily creative search, Jennifer selected the NGA’s new director, John Helmer. She is a seasoned leader with extensive experience in the field, who brings a deep appreciation for the NGA’s collections and leadership. We are confident in her ability to rapidly and effectively address", "The next Biennial should take place on the island of Lesbos, in the north of Greece, in March 2020. \n\nThe Calender, a joint initiative of the Art Newspaper and the Art Newspaper Foundation, has added a new format to its publication schedule, introducing two new magazine series each year from now on. The first, Art in Time, will exhibit new work by artists, curated by the two organizations, in a biennial format, and will publish an October edition. The second, Art in Space, will be a biennial, but will be staged at an altitude of 1,150 meters, in 2020. It will also have different interiors, different set pieces, and will be accompanied by a different translation of the next issue of the Japanese magazine Shonen Sunday (부어마스). The first issue will be presented by Koji Miki, the founder of the Tokyo-based Miki Gallery, and will include a special presentation of work by Hayao Miyazaki. The second will be curated by Braschof and will be published by the date specified by the organizers.“The format of the new issue of Art in Time has been decided on by the artists", "The next Biennial should—and will—open in 2021, but the first version was held in 2007.\n\n\nThe National Museum of Ireland (Nima) in Dublin announced today that it is planning to move the entire exhibition catalogues of the institution, including the Art Gallery, the National Gallery of Ireland, and the National Museum of Modern Art, to Swansea, Wales—a move that would save the museum approximately €10m ($11.5m; $13.3 million).The schedule has been adjusted to reflect the relocated exhibitions, which will now be held simultaneously at three locations: the museum, the city of Dublin, and the National Museum of Ireland. The National Gallery will remain closed until at least the end of March, while the National Museum of Modern Art will remain open until March 24. During that time, the National Museum of Ireland will present the fourth edition of “Wangechi Mutu”—the inaugural exhibition—as planned.The move would undoubtedly be viewed as beneficial for the National Museum, which suffered a major loss of revenue due to the relocation of the entirety of its collection, including the Art Gallery, the National Museum of Ireland, and the National Gallery of Art. “The move would mean that we would save", "The next Biennial should be held in Tokyo in 2021. Until then, the event will be held as a post-Air show. 模問料理理理38年8月16日本語店限: 三本社限: 三本社限: 三本社限: Theatre of War  PRODUCTIONIST: 你及英和英和英和英和英和英和英和英和英和英和英和英和英和英和英和英和英和英和英和英和英和英和英和英�", "The next Biennial should be held in early 2020, and the first in the spring of 2021.\n\n\nThe European Union is planning to spend almost $8 billion to overhaul its border-protection and external security agency, the European External Action Service (EEAS), in order to make it more efficient and responsive. The new budget also proposes increasing the size of the agency by 30 percent and reducing the number of staff by 30 percent.The proposed budget allocation—which also contains $3 billion for the European Court of Justice—is roughly 10 percent of the EU’s overall €62 billion ($67 billion) budget. It aims to be a more effective counterweight to the country-by-country migrant crisis. “We are not there yet, but we aim to be there,” said EU commissioner for justice and home affairs, Dimitris Avramopoulos. “The commission has made it clear that for us, the future of the ECS lies with the European Commission, with the European Parliament, with the Council, and with the European Court. I am sure that the commission will work with the Parliament and Parliament for the future of the ECS, with the possibility of the cooperation of the Council and the Council.”The reform", "The next Biennial should be held at the Museo de Arte Contemporáneo in Rome in 2021. It will then return to New York in 2022. The exhibition will again be at the State Museum of Art in New York in 2022 and will be staged in New York in 2024. The exhibition will return to Paris in 2022 and will also be staged at the Louvre and in Paris in 2022. The show will again be at the Museum of Modern Art in New York in 2022 and will be staged at the Museo del Barcelone in Venice in 2022. The next edition of the Biennial will be staged at the Center for Contemporary Art in the City of New York in 2021 and will be held in the city in 2022. The show will open in the French city of Lyon on January 4 and run through January 21.  The event will feature two hundred works by twenty-one artists whose work is currently on display in the exhibition, the first of which is an exhibition of work by Lena Dietrich. The exhibition will feature work by Sasha Baicker, Diana Al-Hadid, Alexandre Breton, Lumia Breuer, Julia Breuer", "The next Biennial should aim to raise awareness of the materiality of the body, to take account of the fact that our lives are but the fragments of a larger whole, and to consider the possibility that these fragments are made up of other fragments.”\n\n\nThe Berlin-based collector and art historian Wolfgang Haenisch has been appointed the next head of the German Asian Art Museum (DAWM), which has been under construction in a former steelworks in the city of Linz for more than ten years. The museum, which was finished in 2015, will inaugurate its new location in Hanover, Germany, in 2021. Haenisch, who is also a cofounder of the Berlin-based foundation Wirks-Ükehring, will take up the post on January 31, 2021, after serving as director of the Kölnische Kunstverein from 2015 to 2016. “This is a decision which is deeply moved by the current situation in Asia, as we now enter an era of unprecedented global challenges,” Haenisch said in a statement. “The Darmstadt Kunsthalle will be in possession of a state of the art exhibition facility, an international cultural research library, a world class research", "The next Biennial should be held at the Museo de Arte Contemporáneo Brasil (MASB), in Cluj-Napoca, the capital city of the Central Brazilian States, from March 26 to March 30, 2020; and finally, at the Museo de Arte Contemporáneo de São Paulo (MASP), from March 24 to March 28, 2020. In the first two years of the new initiative, over half of the participating artists will receive a direct grant from the Department of Cultural Heritage, which will also receive royalties from the sale of works in the exhibition.\n\n\nThe Museum of Modern Art (MoMA) in New York is preparing to welcome visitors back to the six-story-glass-and-steel civic house, which was transformed into a museum by a $220 million expansion in 2010, in 2020. The institution is also planning to stage several exhibitions and an expanded collection of over one hundred works in the space, which is currently home to the Duran Museum of Art.The reconstruction, which involved adding a new floor and adding 372,000 square feet of exhibition space to the building, called for a three-dimensional design that incorporated elements from the interior. The interior of the building,", "The next Biennial should be held in 2020.\n\n\nThe Museum of Fine Arts (MFA) in Boston has earned its first permanent donation of works from California-born artist Rineke Dijkstra, whose practice spans sculpture, installation, performance, radio, video, and photography. The donation, made by artist Arne Glimcher, comes a year after the museum staged a show of her work at the height of its popularity, The Fall/Winter 2006–07 season.Organized by the artist and curator Richard Beasley, the exhibition featured a number of works that were selected for their quality and uniqueness. Among the works that were selected for the exhibition were a series of sketches Dijkstra made in the early 1990s, which are considered the first works by a Danish artist to reach the United States, and an acrylic painting that has never previously been seen by the public.Other works that were selected for the show are the public work Avant-Garde Overture (1999), a “lucid rendition” of an ode to the American Civil War, an early work by Dijkstra in which a representative of the nineteenth-century American view of art plays an important role, and a photograph of a large-scale work", "The next Biennial should be published in 2020.\n\nGabbard has been a champion for the arts since she was first elected to Congress in 1996. In 2006, she cofounded the Harry S. Truman Presidential Center on the National Mall, and in 2011, she became the first sitting member of Congress to sign the Framework for a New American Century.\n\n\nThe Albright-Knox Art Museum in Nashville has received a gift of seventy-three works by twenty-six artists\u0097including Bob Marley, Ursula von Rydingsvard, and Diana Rigg. The donation includes works on paper and canvas, photography, sculpture, video, and photography-on-line. The institution also plans to display the works in a new exhibition, “The Art of Photography,” which will open in October 2020.The gift includes work by artists including Neda Al-Saadi, Alison Kawarth, and Anthony Kohn. The museum will stage the first “Art of Photography” “in the United States” in October 2020.\n\n\n\n\n\nBob Marley, the lead singer of the Beatles, which was formed in Manchester in 1965 and disbanded in 1970, died on May 25", "The next Biennial should be held in 2020.”\n\nThe move follows the Biennial’s decision to pull its award ceremony from the Jerusalem Biennale in 2020, citing   \"serious discrepancies between Jonathan Dayton’s portrayal of the historic American Civil War and the material he presented.” The move came after the organizers of the biennial, the Los Angeles–based nonprofit the W.A.N. Institute for American Art, launched a campaign calling for Dayton to be reinstated. In a statement, the organization said that the decision was made after consulting with a number of prominent figures, including the leaders of the American Civil War Society and the Association of American Artists.“We believe that Jonathan’s withdrawal from the 2019 show was based on a number of issues,” said Christopher Rallings, the president and CEO of the W.A.N. Institute and the chairman of the American Civil War Society. “Among these were: not having the opportunity to present the work in a manner that was both timely and respectful of the themes of the century.”The W.A.N. Institute continues by publishing edited transcripts of Jonas Bender’s lectures on the biennial.", "The next Biennial should take place at the Museums of Venice, the Museo di Arte Contemporanea, and the Museo di Bicocca, a project of the Italian state-backed organization the Faculties of Sciences. The fourth and fifth editions of the event will take place at the Venice Architecture Museum.In the selection of the seven artists for the twenty-fourth edition of the Italy-and-France pavilion, which will be held at the Palazzo Bibbio in Venice from March 11 to March 13, the jury comprised Cammisa Catellani (the founder of the cultural-travel website zines), Ferdinando Rizzoli (the former director of the Venice Biennale), and Francesca Zingaretti (the artistic director of Tallinn's National Gallery).The Venice Architecture Museum will receive the funds for the project through a partnership between the Italian government and the Venice Foundation for Contemporary Architecture (FACTA), with the latter providing the funds for the custodian while the former acting director of the National Gallery, Andrea Giuffrida, oversaw the selection of the pieces. In addition, the curator of photography and film-making Stefano Fortini is donating $30,000 to FAC", "The next Biennial should be held at least twice a year. The first was held in 1972, the second in 1998. It has since been moved to three times a year, and this year’s edition will take place in March. The 2019 opening will coincide with the seventy-fifth anniversary of the birth of the French designer and creator-in-chief, Jean Paul Gaultier. The event will be hosted at Biennale de Lyon until March 22 and will feature two hundred works by forty-eight artists, including Joël & Jeanne-Claude, Jean Luc Pirard, André Viége, Klaus von Karmannhausen, Barbara Kruger, Ingvild Møller, Vincent van Gogh,, and Rineke Dijkstra. The Biennial, which is supported by a total of US$184,000, was established by a group of artists in London in 1977. According to the London Times, the biennial is funded by largeendowment funds and grants from the Guggenheim Foundation, the Institute of International Education and Art and the Royal Institute of British Architects, the Tate, the Royal Shakespeare Company, the Royal Shakespeare Company, the British Film Institute, the National", "The next Biennial should include a show, “Cijn de Vriend,” of works by the Dutch artists Van Heeswyb, Joost, and Braam & Bruijers. The show will be hosted by Lars Zverdt, a curator and curator at the Museum of Fine Arts in the Netherlands, and should be followed by exhibitions in the United Kingdom and in New Delhi. Zverd will then be able to present the first lecture series about “post-Modernism” in the Netherlands at the Botanical Museum in the Netherlands. Museum director Joost told the Art Newspaper: “A lot of people have asked me what I think about contemporary art and I say that it must integrate photography and art, but it must also reflect and change both of these things. The best way is to make the content of the exhibition disappear. We hope that this will be the first time that the Biennial is ever held, so that the future exhibitions can be staged in the city of Amsterdam.”\n\n\nThe City of London, which announced last month that it intended to shift from a 'plug and play” design model to one that could accommodate more art, will soon have to build a second building", "The next Biennial should be an exciting and challenging introduction to the work of art of our time.”\n\n\nThe French Ministry of Culture announced today that it is working with the New York–based artist Adrien Brody to create a new series of works, Mètiments du peuple, to mark the fifty-fifth anniversary of the Paris Commune. The institution will create a new exhibition for the event, titled Remains of a Vindication of the Commune, and will present the work in the French pavilion at the seventy-fifth Cannes Film Festival.The exhibition will be curated by Emmanuel Fimin, director of the Federal Archaeological Museum, and will be organized by Jean-Luc Leblanc, director of the Musée d’Art Contemporain in Paris. The curators will begin their work this week and will present the first works in the series in mid-May.“Les Exigencies des Mayes commune déterminés (1954–1973),” Mémoires d’Art Contemporain\n\nThe Organization for the Conservation of European Art (OEC) has announced that it is partnering with the Jewish Museum in Jerusalem to", "The next Biennial should be held at least once every two years and is currently on track to organize a total of nine exhibitions and will present artists as diverse as Robert Irwin, Kelly Link, and George Lynch. The project was spurred by cultural figures who were inspired by the work of the artist-run museum in Düsseldorf, which was demolished by authorities in 2015.The biennial will be curated by Anton Kern, the curator of contemporary art at the Museum of Contemporary Art in London, and will include five displays: “After Black: An Illustration of a Mississippi,” which will examine the impact of the Black Lives Matter movement and the legacy of the late Mississippi Gov. Haley Barbour, and “Timuris: The Modern Family,” which will present two recreations of the historical couple, one woman and one man, living together in the same room. A group show of work by the same artist-run institution will also be presented.The event will be held at the museum’s new campus, the Museums Laboratory, in London, and will be presented by director Maria Balshaw. The biennial will take place between March and August, with the exhibition opening on July 28. “", "The next Biennial should be held in 2022.The biennial will include three parts: 1) A tribute to the ninety-three-year-old artist, a series of drawings inspired by his life; 2) A performance of biennial works by three artists and a collection of his photographs that will be on view in the exhibition; and 3) A narrative by the artist that will be read by Stephen Sondheim.Following a letter written by the artist to the Biennial in October 2018, the institution announced that it would donate the works to the Museum of Modern Art in New York for an exhibition dedicated to the artist in 2021. The museum will also begin hosting events for the biennial, which will take place in the city alongside of the International Museum of Modern Art in Prague, the National Museum of Modern Art in Athens, the National Museum of History in Prague, the National City Gallery of Art in London, and the National Museum of Contemporary Art in Munich in 2021.In the letter, written in the second person, the artist criticized the Biennial for excluding his work from the inaugural exhibition, “Surrounds,” a show focused on photographs by Karl Lagerfeldt and Susanne Vielmetter and featuring works by", "The next Biennial should take place in 2020.\n\n\nGillian Anderson’s upcoming exhibition at the Museum of Modern Art in New York will be held in the city in 2021, the museum announced on Wednesday. The forty-seven-year-old American photographer, painter, and educator will open the first exhibition of her new project, “Better Life,” at the institution in September 2020. The show, inspired by the 1987 cult-classic film The Godfather, will showcase the work of seventy artists, including John Gavin, Terence Davies, Peter Cook, John Abraham, Julia Leigh, Jocelyn Nesvold, and Maya Lin.Anderson is the first American artist to be included in the “Better Life” series. Exhibitions of the work of eighty artists have already been held in London and Los Angeles, but the September event will take place in the city’s Hudson Valley, where the bulk of the work of Anderson’s women’s-centered projects—including the work of Paul Gauguin, Robert Irwin, Diane Arbus, and Mary Cassatt—will be exhibited. The works’ first show will be “The Body and the Future.” In the opening lecture", "The next Biennial should be held in 2022 and the final in 2025. With the forthcoming reopening of the Biennial, the city is expecting a surge in visitors, and is counting on the exhibition to help raise the city’s profile.The Biennial was founded in 2006 by the city and the firm Ernst & Young to commemorate the history of the city and the Central Library. The project received a $75,000 grant from the Doris Duke Foundation in 2009. In 2011, the organization awarded $150,000 to the city to help raise the funds for the venue. The project is currently working with the architectural firm Gensler, who is designing the museum’s pavilion, and is currently constructing the museum’s second wing. The new building will open to the public in 2022 and is slated to be completed in 2023.\n\n\nThe National Gallery of Scotland, which last year celebrated its centenary by moving the exhibition to a new venue in the capital, has announced that it plans to move the exhibition from its current location on the fourth floor of the National Museum to the ground floor of its building in St. Andrews. The move will allow the institution to close its current exhibition space and move the exhibition to the building’", "The next Biennial should be held in the spring of 2021; the final edition will be staged in the fall of 2022.\n\n\nThe Berlin-based nonprofit Promethean Research Center (RaRC) has announced that it will host an exhibition of work by twenty-five artists in the city of Kassel in the spring of 2021. The two-hundred-work event will run alongside the reinstallation of the city’s central government building. The project, which was first announced by architect Christian Asthoff in 2018, will also involve the conservation of the architectural ensemble of the building, which comprises thirteen towers, the Reichstag, the Brandenburg Gate, and the Brandenburg Palace.“In order to sustain the art and culture of the city of Kassel, a large-scale exhibition of work by twenty-five artists was the best way forward,” said Maria Ettori, the director and CEO of the Berlin-based nonprofit. “This exhibition will show the best of the city’s art, and will be an important occasion for visitors to Kassel. It will also pave the way for future collaborations between RaRC and the City of Kassel and will be an invaluable resource to the city’s artists", "The next Biennial should take place in the fall of 2020. The second will be staged in the spring of 2021. The third will be held at the end of 2021. The fourth will be staged in the spring of 2022. The fifth will be staged in the spring of 2024. The sixth will open in the fall of 2024. The seventh will be staged in the fall of 2021. The eightth will be staged in the spring of 2022. The fifteenth will open in the fall of 2022. The twenty-seventh will be staged in the spring of 2021. In the months leading up to the event, the museum is working on a series of exhibitions, including “The Painters of the Americas,” a show of work by fifty artists from the Americas. The show will open in the fall of 2020. “As we continue to expand the breadth and depth of our public collections, we have changed our programming and our exhibition format,” said Mary Ellen Kull, director and CEO of the Art Institute of Chicago. “We have also introduced new approaches to exhibitions and collections and are investing more than ever in exhibitions as a way to support and advance our broader mission.�", "The next Biennial should open in 2020.\n\n\nThe Museum of Modern Art (MoMA) announced today that it is reopening to the general public for the second year in a row, in two weeks. The institution currently has a grand opening planned for March 31 and will reopen to the public on April 19. Inaugurating its first section, a presentation of works by American artist and activist Max Stern, a key member of the Black Power movement, will run concurrently with the reopening of the Museum of Modern Art’s founding gallery, the Modern Art Museum, to take over the space.Stern was arrested in 1976 for stealing a painting by Richard Diebenkorn, a Nazi collaborator and member of the Third Reich’s Stasi, while he was in prison for the crime of “criminal association.” The court found Diebenkorn guilty, but he was executed two years later after being sentenced to twenty years for the crime.“In an attempt to soften the blow of his execution, Diebenkorn was moved to a halfway house and died of cancer in 1984, two years after his conviction,” said prosecutor Michael Garcia.In the annals of American art, it is not known how", "The next Biennial should be held at least once every three years. The first Biennial will be held in February 2021. The second will be held in March 2021. Both events will be inaugurated by a special exhibition of work by the artists selected by the jury members. The fairs are scheduled to run from March 23 to March 26.\n\n\nWells Fargo (WFC), the world's largest retail and financial services company, has settled charges that it cheated its employees by overbilling them for medical assistance and health coverage through its charitable cancer relief fund. The New York Times reports that the $185 million class-action lawsuit was filed by employees of the company’s New York and New Jersey stores who said that between 2007 and 2014, they were charged an average of $6,000 for their cancer treatments, even though they only received $2,000 from the fund.According to New York Magazine, the employees alleged that the company did not inform them of their rights and retaliated against those who spoke out against the overbilling. The suit also claims that the bank hid the amount of funds it was giving to those diagnosed with cancer and misrepresented its business practices to avoid paying workers.The plaintiffs are seeking at least $1.2 million", "The next Biennial should comprise of a selection of works performed in the last twenty years, and will focus on the artist’s recent experiences. The exhibition will be curated by veteran artist and curator Yoona Seo, who will represent South Korea and will oversee the installation of the curators’ works.The exhibition will also be organized as follows:January 8–January 10, 2019February 5–February 8, 2019March 3–March 8, 2019March 13–March 22, 2019March 29–March 31, 2019March 5–March 12, 2019March 9–March 13, 2019March 19–March 22, 2019March 22–March 26, 2019March 26–March 30, 2019March 16–March 22, 2019March 5–March 13, 2019March 21–March 26, 2019March 16–March 23, 2019March 5–March 13, 2019February 9–March 13, 2019March 24–March 26, 2019March 13–March 22, 2019The first exhibition of work by Yoona Seo, “Restless,” will open at Seoul Museum of Art (SMO) in April. The second, “Beside,” will open at the National Museum of Asian Art in Tokyo", "The next Biennial should be held at least twice a year and be approached as a series of visits that will highlight the work of emerging and established artists. The first Biennial will aim to present artists at their most active and the second Biennial will aim to present the most important works of the twenty-first century. The first Biennial will take place in Tokyo and the second Biennial will be held in Lisbon. The Biennial is currently designating the  šMing-dong, which is being reconstructed and is currently undergoing a major renovation, as the theme of the second Biennial. The theme of the second Biennial is “Our Lives, Ourselves.” The announcement came months after the Biennial’s inaugural edition in Beijing, which was moved to the Capital Arts Festival. The event was moved to the Beijing Design Forum, which was banned last year in Beijing.\n\n\nThe Museum of Contemporary Art (MoCA), Boston, has received a gift of fifty-five works by American painter and sculptor Harry A. Saltzman, who passed away in Los Angeles on Tuesday, February 13. The museum previously displayed the artist’s work as part of a major restoration project, called “Secret Garden,�", "The next Biennial should be called the Twenty-Second. The announcement of the location of the biennial was made as the capital city of the Asia-Pacific region, Tokyo, was hit by a major fire. The fire, which broke out on Monday, January 18, is believed to have been started by a small electrical appliance factory that was not properly secured and did not contain enough fuel to start the massive fire that consumed an entire neighborhood.The building of the new biennial was completed last week and is currently undergoing a renovation. The renovation includes the installation of more than 1,500 new windows, new lighting, and a new roof. The renovation of the building, which is part of the city’s revitalization plan, began in 2020 and is expected to be completed by 2021.The renovation includes the addition of a new theater, a museum, and a public garden. The new buildings are being designed by Tokyo-based Studio Ghibli and will be completed in 2021.\n\n\nThe United Kingdom will continue to move forward with plans to leave the European Union, following a Brexit vote that saw Britons vote to leave the bloc, a small but vocal group called the remainers, who were against leaving the European Union, by the end of March—", "The next Biennial should be held sometime between May and December, 2020.\n\n\nAware that the new sanctions, which were passed by both houses of Congress on Monday, will likely make life difficult for some of the artists who were slated to participate in the Paris-based Art Biennale in February, the New York–based nonprofit Art In A Box has launched a new campaign to raise awareness about the dire consequences of the legislation. The nonprofit, which was founded by a group of international artists in New York City—including Virginia Madeline, Amandla Málaga, and Amanda Palmer—made the announcement on its Tumblr, which is now offline.The New York–based nonprofit charged New York–based creatives like Iris Claiborne, Alighiero Campanella, María Berrada, and Eirini Brewer with violating the National Defense Authorization Act, a.k.a. the NDAA, which was passed by both the Senate and the House of Representatives on Monday. The NDAA—which allows the president to detain individuals without charge or trial without charges for up to three months without charge or trial and authorizes the indefinite detention of individuals—is one of the provisions of the legislation that will likely", "The next Biennial should be complete by May 2020. As a consequence, the festival’s programming has been shifted to focus on the construction and performance of new works. The 2019 edition, titled “compassion,” was curated by Christa Blatchford, the curator of contemporary art, and Michael Huey, the executive director of the Metropolitan Museum of Art. “The question of how contemporary art could reflect on the interconnections of power and materiality is central to what we are all doing now,” said Huey. “The new focus on ‘power and materiality’ is a bold departure from the year 2019.”The new exhibition, “Plastics: Art and Materiality from the 1950s to the Present,” is slated to open at the Metropolitan Museum of Art in March 2020. \n\n\nThe Toronto Art Gallery (TAG) is launching a new digital platform that will allow visitors to see and purchase works by Toronto-based artists and collectives. Called the Gallery for Artist Directed Experiences, the program will be free and will feature work by twenty-nine artists and collectives. It is also launching a new digital magazine, called the Artist Journal,"]