["The next Biennial should be held at the same venue. The restructuring of the festival, which has been ongoing since last November, has been beset by delays. It is unclear when the festival will resume.\n\n\nThe Press Center, an independent, nonprofit organization that aims to foster and support the work of art by local, online, and out-of-town artists, has announced that it is shutting down. Founder and CEO of the nonprofit group Waldo Ianni, who also helmed the London-based Press Center, told The Art Newspaper that he was planning to resign from the position in August and return to teaching, but that the organization was forced to postpone the reopening of its other five locations in London, Bristol, and New York.The organization had planned to start up new locations in Berlin and the German city of Essen in October, but the reopening of the Press Center in Camden on August 29 delayed its expansion into other cities across the UK. In a statement on its website, the organization said: The press center’s enormous network of artists has given us an invaluable platform for growing their work and for understanding their aspirations. But it has also shown that, in today’s fractured and fragmented world,", "The next Biennial should take place in 2021 and will be curated by a team led by Chicago-based artist and curator Dariush Mozaffarian. The theme will be “Remnant: A Visual History of Art,” with work by sixty artists from twenty countries, including Canada, Germany, Mexico, Nigeria, and the Philippines.Mozaffarian will be joined on the panel by artist and curator Fanny Ooi, whose work is included in the exhibition, “Remains of a Good Woman: A Visual History of Roman Polanski” (2019); filmmaker Julia Savoy; and several others. The event will run from March 6 to March 7 and will feature thirty-four works by fifty-nine artists in the exhibition, which will be held in the city-state’s St. Louis Art Museum.\n\n\nThe Art Newspaper has published an article regarding the ongoing negotiations between the Haus der Kunst (German Ministry of Culture), and the Max Hiberg–designed museum in Berlin, which will open in 2021.Pace Gallery is negotiating a deal with the state of Berlin, which will receive 50 percent of the profits from the construction of the new museum. The institution, which is being built", "The next Biennial should take place in January 2021. We anticipate an opening in March 2021.\n\n\nThe Metropolitan Museum of Art in New York has received a $3 million donation from the Warren G. Kanders Foundation; the organization was notified of the institution’s intent to build a new Kander Center for the Arts building on its campus on Tuesday. The gift was made in recognition of the institution’s continued support of the arts following the heartrending loss of three young artists, Hadi and Hisham, who were murdered by their own bodybuilders, John Guand and Steven Guand.“I am profoundly gratified that the Met has given its visionary partners the opportunity to carry on the work of Kander and Hisham, whom I met and admired as children, and of its many other donors,” said Amy Willard, the foundation’s CEO. “We are honored to receive this gift from the Kanders Foundation, and look forward to continuing our partnership with the Met.”The gift came in recognition of Kander’s contribution to the arts in the form of a lifetime commitment to supporting the arts through the foundation’s generous endowment. Kander, who passed away in", "The next Biennial should take place in 2020. The museum will also open into the new construction in 2022. “We are very excited about the future of the Biennial,” said Suekman. The museum will become the first museum in the US to host the event online. The first exhibition organized by the institution, 'The Architecture of Destruction: Widespread Destruction in the Years 14–1916, will open at the museum on January 27, 2020. The exhibition will also encourage international exchanges, plans the museum for its 2020 reopening in early 2021, and will feature works by Egidio Moro, Luki Mokgosi, and Mirko Rupp. \n\n\nThe Museum of Modern Art (MoMA) in New York has received a gift of more than five hundred works by fifty-one artists\u0097including David H. Koch, Mark di Suvero, A.S. Barlow, and Yinka Shonibare\u0097that were previously on display in 'The Sixties,' a new exhibition at the museum. The biennial, which coincides with the centenary of the Italian artist Giacomo Beppe Modigl", "The next Biennial should be held in the fall of 2020, when the institution will have approximately thirty thousand visitors. “We are excited to present our community for an exciting exhibition of work by international artists at its first location in Istanbul,” Şahin said. “Each of their work and the exhibition will be representative of a different region and their own cultures and will present an immersive experience for the audience.”\n\n\nThe Centre Pompidou in Paris has appointed María Berrío as its new president. Berrío, who has been a trustee of the grand museum since 1986, succeeds Françoise Talon, who is retiring after ten years at the helm of the institution. “For decades, the Pompidou has been known as a model of contemporary art, a beacon of modernism and a source of inspiration for generations of collectors, designers, artists, and curators,” said Berrío. “In this moment of great uncertainty for the arts, I would like to see the Pompidou survive, thrive, and prosper. This is a moment of profound change for the museum. I want to see the Pompidou prosper as a civic and cultural platform", "The next Biennial should be held in 2022.\n\n\nThe University of Cape Town (UCT) in South Africa, which was placed on lockdown following a shooting at its campus on Friday, killed nine people on Monday and injured fifty-five others. According to the New York Times, the university is currently on lockdown again—this time with a lockdown on all campus buildings and other buildings within a quarter-mile of the campus.The lockdown began around 4 AM on Monday, when a gunman opened fire on a group of twenty people, including several students, at the university, which is just outside of Durban, on the southern coast of the country. According to the New York Times, the student-run art space Hofstra University, which is located on the same campus, called the shooting a “suicide mission.” The campus also serves as the headquarters for the university’s Department of Art and Art History, which offers classes in everything from drawing and painting to ceramics and woodworking.The shooting took place at the school’s new headquarters, which opened in the capital city’s Pretoria district in December. On Monday, the building was bustling with activity as students, faculty, and staff gathered around its glass-en", "The next Biennial should take place in the Spring of 2020.\n\n\nThe Art Newspaper reports that the Art Fund, which was founded by the German luxury conglomerate Kering in 2007 to promote the works of postwar and contemporary artists, has received a $2.5 billion gift from the Johanna and George Soros Trust. The gift includes $2.5 billion in loans, gifts and investments that will help fund the organization’s cultural programs, including the Art of the Fellowship, an international exchange program that will present more than sixty artists at the Art Museum Basel, which is located in the Swiss Alps, next year; the Stockholm Biennial, which will take place at the same time as the forthcoming König Fischer Kunsthalle (KFK); and the forthcoming Mies van der Rohe Biennial.The organization also announced that it is expanding the scope of the program by adding thirty-six artists to the program, which has yet to announce an opening date for the 2020 edition. The thirty-six artists chosen for the 2019 edition, which is slated to run from March 14 to March 18, were: David Hockney, Alighiero Cipolletta, Jean-Michel Basquiat, Anselm Kief", "The next Biennial should be held sometime between the years of 2020 and 2023. “This is a moment of great change for the arts and it is the only time that we can hope to commit to the future: not by sitting down and writing a manifesto but by actually doing something,” said Anne-Marie Blazwick, chair of the Biennial and a former president of the Royal International of Art. In a statement, the Royal International of Art said that it “regrets that we have not been able to secure the end of the exhibition, as originally conceived, as we have had many opportunities to do so in the past. We hope that this decision will allow us to move beyond this exhibition and continue with our planned programming to coincide with the coming years, as envisaged in the exhibition.” While the museum has yet to articulate a specific timeline for the closure of the exhibition, it will likely be completed by the end of the decade.\n\n\nThe City of London has awarded the Royal Academy of Arts (RA) in Songbird Street an extra £2.9 million in grants to help it cope with the coronavirus, which has infected more than 13,000 people worldwide. The money will also support ", "The next Biennial should take place in 2020, but the organisation is concerned about the short-term impact of its cancellation. “We have to consider everything,” said Stefano Carusi, the director of the Milan-based group ARTnews. When asked if the event was being postponed because of the coronavirus, he responded: “This is the future.” Italian culture minister Dario Franceschini reiterated the government’s commitment to the event, which was launched by the Italian People’s Party (PdL), in an interview with the Italian newspaper the Corriere della Sera last month. The executive director of the association, Gio Ponti, stated that the event must be held regardless of whether the government abandons the installation of the pavilion, as long as the artist’s work is included in the exhibition.The pavilion is made of 24,000 objects, including more than 1,800 paintings, sculptures, photographs, videos, and architectural models, as well as 1,200 works by artists from all over the world. The exhibition will kick off with a public work by Carlo Mollino, a contemporary art dealer based in Turin. According to the", "The next Biennial should have been held in the autumn, but was postponed due to the Covid-19 pandemic, and will now be held in the spring. The exhibition will be hosted by the MacDowell Colony, in partnership with the University of Africa, and will be held at several locations across London, including the Tate, the Tate Modern, and the National Portrait Gallery. The exhibition will also feature an abridged version of the life and work of Mark Edmonds. The exhibition will be followed by the first show of work by the new artist on canvas since the disease began; a show of works by the artist on paper; a retrospective of his long-term collaborations with Lucian Freud, a show of his paintings; and the artist’s first solo exhibition in London since 1955.\n\n\nThe Nude Art Museum in New York has appointed Laura Hsu as its next executive director and chief curator. Hsu comes to the institution from the Museum of Modern Art (MoMA), where she has served as deputy director and chief curator since 2016. Hsu joins the museum from the Brooklyn Museum, where she has served as its interim director of exhibitions since 2017. Hsu’s new position is effective immediately", "The next Biennial should include a new sculpture and installation by artist-in-residence Wendy Doniger, who will make her first-ever solo exhibition at the gallery, and will open at the J. Paul Getty Museum in Los Angeles in January 2021.\n\n\nTatjana Hjortenberg has been named the first director of the new museum, which will be inaugurated by a new statue of Bertha (Bridget, the founder and former director of the Bechgebirge Biennial) on November 21. The new institution was founded by the Danish architect Lars Vilks and Swedish collector Petteri Mäkelänen, who both returned a significant sum of money to the biennial in 2017.Hjortenberg will take up the post on December 15. The biennial will also celebrate its centenary with a retrospective of the works of the artists represented in the collection, which are divided into three categories—art, design, and installation. The biennial is centered around a theme of the relationship between art and technology, and encompasses works by artists such as Hans-Ulrich Obrist, Erik Niemeyer, and Paul Gauguin.\n\n\nNew York’s Metropolitan Museum of Art (MoMA", "The next Biennial should be held in the spring of 2021. \n\n\nThe Metropolitan Museum of Art in New York has launched a new initiative, Institutional Engagement, that will provide artists and curators with a way to collaborate with museums on exhibitions and programs. The Museum of Modern Art (MoMA), the Metropolitan Museum of Art, and the Metropolitan Opera House in New York will collaborate on “Institutional Engagement,” a new program that will run from January 20 to April 3. The exhibition will feature work by over eighty artists and will take up topics such as digital artifacts and the body, resistance, and surveillance, and will explore the intersection of art and technology and its impact on modern life.The exhibition will also include a special retrospective of artist Lydia Davis, who created the No Man’s Land mural, and will present work by artists such as Eric Nylund, Nara Siegal, and William S. Burrough. The program will be curated by Barbara Kruger.“Institutional Engagement’s mission is to serve as a platform for artists and curators to explore and enact their creative processes and the ways we use technology,” said David K. Lieberman, director of", "The next Biennial should take place in 2020, with the first edition taking place in 2021.The announcement followed a few months of protests, culminating in a march in the capital, by more than one hundred activists, on February 27, 2020, in support of the Al-Ahsa Cultural Centre and the Palestinian Museum in Al-Quds, a UNESCO World Heritage site, which were organized by the Saraya Museum of the History of Arts in Jerusalem and the Palestinian Museum in the West Bank.On February 21, the museum and the PA announced that they had reached an agreement on a new series of lectures and performances that would be held in the West Bank. The PA will pay for the first two and a half months of the project, while the museum will receive a fixed sum of $231,600. The PA will be reimbursed for the cost of the third month of the project in two installments; the museum will be allowed to keep $102,600 of the remaining funds.“The PA has come to the decision to offer a new series of lectures and performances in the West Bank as a response to the recent wave of violence that has been unleashed against Muslims and Palestinians in the territories,” Mahmoud Darwish, the director of the Saraya Museum", "The next Biennial should focus on the history of the collection, the exhibition and the exhibition, and should address the biennial as a whole. The next one will be held at the Palazzo Vittorio Emanuele Bechamo. The theme for the second iteration is “Theology, politics, and ownership,” a source of inspiration for the show. “The exhibition should take into account the exhibition of the visual arts,” said Francesco Cipolletta, the artistic director of the Venice Biennale. The exhibition “will be a celebration of the richness of art and how it manifests the history of art and the contemporary world.” \n\n\nThe Metropolitan Museum of Art (MoA) in New York has appointed Joseph P. McCarthy as its next director and CEO. McCarthy will take the helm from Maria Balshaw, who left the institution in June 2019 to become the next secretary of labor in the Department of Labor, who will oversee the museum until December 2021.“I’m thrilled to call my successor a friend, a trusted colleague, and an outstanding motivator of art and culture,” McCarthy said in a statement. “After a distinguished career at", "The next Biennial should be held in the year 2020.” \n\n\nThe French Ministry of Culture announced today that Jerzy Bielawski, the director of the Museum of Contemporary Art (MoCA) in Paris, will become the next director of the Palazzo Nazionale d’Arte Moderna in Florence, Italy. Bielawski, who has helmed the museum since 2003, will take up the post on September 1. He succeeds Filippo Lo Brugi, who has served as director of the museum since 2018, and will work closely with the institution’s director, Marco Fusi, on the development of the next iteration of the Museum of Modern Art in Paris.“With an innovative and ambitious vision to develop and further extend the theme of the museum, Jerzy Bielawski has emerged as the perfect person to lead the future of the Palazzo Nazionale d’Arte Moderna in Florence,” said Milan-based architect Vittorio Cicutto, who helped organize the biennial. “Jerzy Bielawski has been involved in public life for decades as a curator at the Museum of Contemporary Art, Paris. During his tenure he", "The next Biennial should take place in 2020. \n\n\nThe city of Boston has awarded $75,000 to twenty-three artists for their participation in the upcoming edition of the Boston Art Biennial, which will take place in September.  The participants are David H. Watson, Haroon Mirza, Mario Tama, and Daina Fattal for their works in the Exhibition, which will focus on the exhibition of work by underrecognized and underrecognized artists, respectively. “We are honored to award this year’s Boston Art Biennial to these three artists and to the many others who have participated in the past year’s exhibition,” said Mayor Martin J. Walsh. “Their works are important to the city’s creative ecosystem, and we are happy to support their performances and their presentations so that they can continue to shape the future of Boston.”The artists have also been awarded a total of $133,000 for their works in collaboration with the city. Mandy Gliddon, Matthew Hull, and Robert Irwin also won the grand prize for their projects for the exhibition, which will be held at the Museum of Fine Arts and the Public Art, and Deborah Sommers earned", "The next Biennial should take place in 2022. The 20th will take place in Tokyo in 2021.\n\n\nThe Museum of Fine Arts (MFA) in Boston is preparing to reopen to the public in twenty-six years. The museum is currently undergoing a $50 million renovation, and director Adam D. Weinberg estimated that the reopening of the museum would cost the institution between $55 and $60 million. “The new MFA, with its new collection, the new exhibits, and the new architecturally inspired setting, will serve as a model for the city,” Weinberg said. The renovation began in January 2021 and is expected to be completed in June 2022. The exhibition hall, which was previously closed since March 14 due to Covid-19, will reopen soon thereafter. “The renovation will produce an exhibition that is bold and experimental in the vein of the Museum of Modern Art’s 'Scale: 1875–1938'\u0097a concept that is at the core of MFA’s mission.”The museum will also offer a new day-long/night-long program, and will incorporate more than sixty new works by thirty-seven artists. The first show on the twenty", "The next Biennial should take place in 2020.  The exhibition’s director, David Blaine, said: “This is a moment of great change for art. It is an unprecedented moment for art, and for visual art as a whole. We are thrilled to be working with the London-based team to reissue Art in the City, with new experiences and with a new vision.”\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed John LeBlanc as its next executive director. In his new role, LeBlanc will lead the museum’s urban planning and design efforts in the Central Business District, which is bounded by Fifth Avenue in Manhattan, East New York, and Greenwich Village. He succeeds Adam Salter, who retired in October 2019 after twenty-two years at the helm of the institution, and will take up his new responsibilities in January 2021.“I’ve been a fan of John’s work for years,” said Adam Salter. “As an architecture and design critic, he is as smart, industrious, and dedicated as any architect in the world. I’m looking forward to working with John to his legacy. He", "The next Biennial should bring together distinguished artists such as Gerald Kaufman,[10] the Los Angeles–born, California-based artist whose work examines the power of the self into the world, and Ana Mendieta, whose atelier combines a literal and an abstract approach to art.Rebekah Glimcher, who in recent years has concentrated on experimental and constructivist mediums, will spearhead the curatorial team and director of the Center for our Imagination, which is located in the Hammer Museum, will oversee the exhibition.Merry Levin, who is best known in the Bay Area for her Multihypodal Project, which combines a play and a performance in order to reflect on the potentiality of art, will curate the exhibition. The show will take up themes of memory, memory and the self, and will take the form of a party, a performance, a performance, and a film.“The new program will present the highest quality works created by emerging and established artists over the last twenty years,” said Levin. “We welcome the new challenges which these artists are bringing to our program. We have created a lot of interesting and provocative exhibitions over the last twenty years and are excited to see how they will develop", "The next Biennial should take place in the Summer of 2021. The 2020 theme is “The End of the World as We Know It.” \n\n\nThe Solomon R. Guggenheim Museum in New York has announced its representation of the legendary artist Alberto Abad de Córdoba\u0097known for his bold, surrealist paintings that often feature grotesque anatomies and other surrealistic forms-as a retrospective that will open on August 25. The show will feature work by more than seventy artists, including Mòr Álvaro Cervetto, Lensesa Ferrer, and other Carlos Rivera-influenced artists.“Abad de Córdoba is the one artist who has created a work for exhibition at the Guggenheim Museum that has been on view since it opened in 1982,” said architect and curator Jodi Throckmorton, who curated the exhibition. “Through his visionary paintings, Abad de Córdoba offers a new way of thinking about pain and the human body, both in the aesthetic and psychological realms. His work is the perfect example of the long-term experiments that are at the heart of John Berger’s exhibition program. His", "The next Biennial should be held in the city in 2021. The hotel is also working with the California-based firm CREATE to create the theme for the next edition of the biennial, which will take place in the city in 2021. The artist’s work will be included in the exhibition “The Miracle of Life” and will be shown in “The Body in Space” (2019). \n\n\nModern Art Chicago announced today that it is delaying the launch of its new platform, Modern Living, until mid-February. The announcement follows a wave of protests and a petition drive against Art Basel Hong Kong, where some 1.5 million people have signed a petition demanding that the fair be canceled, and coincides with Art Dubai, Art Dubai Asia, Art Dubai USA, and Art Dubai, which have all been canceled since March.“Our goal with the new platform is to make it a platform for artists and not a platform for galleries,” said Modern Art Chicago director Kim Shinojai. “The platform will continue to be curated by a team of experts and we will continue to provide the tools and support they need to facilitate their exhibitions and shows.” The platform’s inaugural event, �", "The next Biennial should take place in the United Kingdom in 2021. \n\n\nTransCanada, the Canadian oil and natural gas industry giant, has received a major boost in funding from the $7.5 billion settlement reached last month between the United States and Canada, building on the government’s commitment to break ground on the controversial Keystone XL Pipeline. The sum is $3.5 billion more than the $2.2 billion the Obama administration designated for the construction of a new border wall between the two countries, but less than the $5.2 billion the Trump administration has allocated for the construction of the US-Mexico border wall, which is expected to be completed by late March.“The new funds will allow TransCanada to accelerate its work to secure the necessary permits and to protect the environment,” said Kenney Tzendiarra, chair of the governor of the Bank of the West. “The government of Canada welcomes this significant settlement and looks forward to working with the provinces and territories of Canada to deliver on Canada’s climate and climate resilient future.”The funding will also allow TransCanada to move more quickly to complete the $8.5 billion expansion of the Keystone XL pipeline that will carry Canadian oil from Alberta", "The next Biennial should be held in 2020, and a new exhibition will be organized.  The Biennale de Lyon, which is taking place in France, is facing a similar situation: According to the Art Newspaper, the event is currently closed due to \"political uncertainty.” Both the French and French Art Historians’ organizations will determine the date of the event by March 15.\n\n\nThe National Poetry Library in the City of Brotherly Love (BMBL) in New York City has introduced two new digital platforms designed to advance the collection and scholarly practices of American poetry. The first is a new online portal created by the BMBL, called BMBL2, which will bring together biennial presentations by seventy-seven poets spanning the twentieth century. Each biennial will be presented in its original format, with a selection of poems selected by the artist selected for its biennial theme. The project is part of a decade-long strategy to advance the scholarly practice of poetry in the United States, and will include the first online exhibition of a poet’s work in the United States since 2000.“The BMBL is committed to supporting the collection and scholarship of American poetry by developing platforms that advance", "The next Biennial should take place in 2020 and is expected to be held on the campus of FIPM. The first exhibition will be a presentation of works by thirty-one artists from the’s twenty-six exhibition series. The exhibition schedule will be announced at an unspecified date. The Biennial will celebrate its fifteenth anniversary in 2021.\n\n\nThe National Museum of the American Jewish Historical Society (MNAS) in Washington, DC, has appointed Adam Eidinger as its new director. Eidinger comes to the institution from the Jewish Museum in New York, where he currently serves as chief curator. He succeeds David Schipper, who retired in February after twenty-eight years at the helm of the museum.“We are delighted to welcome Adam and are confident that his talents and expertise will make him a strong candidate for the position of director,” said NRW’s board chair Josh Greenberg. “His proven track record and proven track record in fundraising and developing our collection and program makes him the perfect person for this critical role.”Schipper will continue to serve as director of the museum as it undergoes a $300 million renovation, which will include the construction of a new 300,000-piece collection and a", "The next Biennial should take place in 2021. We are now in the process of organizing the exhibition and collaborating with the public on the upcoming exhibition, which will expand upon the theme of “World War II as a Process.”\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Mark B. Smith as its next executive director. Smith comes to the institution from the Metropolitan Museum of Art, where he has served as deputy director and chief curator since 2014. He succeeds Edward Stricker, who retired in June after seventeen years at the helm of the museum.“I’ve been involved with MFA for twenty-three years now, and Adnan has been a visionary leader for the past decade,” said Smith. “He has built an outstanding, innovative collection of the museum’s collection and broadened its national reach with his generous and unique curatorial and programming partnerships.”Over the course of his nearly eight-decade career, Smith has organized numerous exhibitions, including “World War II as a Process” (2014) and “Mark B. Smith: A Retrospective” (2017), and has cultivated the museum’s collection through his own efforts and that of his", "The next Biennial should be announced shortly.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is preparing to welcome visitors back to the institution in September. The March 27 reopening will be marked by a new exhibition, “Art and the Art of Machines,” which will showcase work of contemporary artists such as John Akomfrah, Robert Irwin, and Barbara Kruger. The biennial will also include an introduction of a new half-hour special, “Robotica,” which will feature new works by artists such as Jessica Suskind and Chantal Akram, and will run for ten weeks.“The museum has been working with the artists and designers who have made the most important contributions to the museum’s history to help them conceive of and test new ways to expose robots to our world, and we are honored to welcome them back to the institution,” said director Mary Anne Carter. “Robotica is an invitation to make the most innovative and powerful enhancements to what we see and hear inside the robot. The new show opens a new window onto our future form and future selves.”The first show, which will focus on the hybrid of art and technology, will be �", "The next Biennial should be organized and curated by an independent organizer in the coming months, following an initial list of twenty-six artists that will be presented by the award winners, who will be selected by the public. The artist biennial will be hosted by the MCA until March 28 and will feature the work of seventy-four artists. The exhibition will feature the work of more than one hundred artists that have participated in the exhibition over the years, including Pierre-Auguste Renoir (1938–1948), Herbert Singer (1916–1977), Claude Monet (1911–1986), and Andreas Sammam (1905–1964).\n\n\nThe Modern Art Museum Boston (MAB) has named Andrew Fergus as its new executive director. Fergus comes to the institution from the Metropolitan Museum of Art (MMCA), where he has served as a museum director since 2014. He succeeds Diane Postma, who joined the museum in 2018, and will begin in her new role on January 5, 2021.“I’ve been a fan since I was a kid, watching the Met do incredible things and having the opportunity to work with artists and their teams,” Fergus said. “The museum’s relationship", "The next Biennial should be held in 2020. About the biennial: The first Biennial was held in 1992 on the campus of the University of Chicago. This year’s edition will be held at the Chicago Museum of Art (CMO) beginning July 29, 2020. For the next fifty years, the Biennial will be organized as a collaborative project between the following artists: Anthony Bennett, Ariel Beck, Bedford Long, Eileen and Billy Wright, Lee Bruce, and Malawian artist Muhzadu Fofana. The ideas expressed in the biennial’s’ five-hundred-and-sixty-second edition are intended to bring to light the themes and concepts of the future: technology, art, and future societies. The 2019 edition of the biennial consisted of seventy-five works by forty-seven artists and was held at the Museum of Contemporary Art Chicago in partnership with the local community. The twenty-fifth edition of the biennial will be held at the New Museum in New York on February 21, 2020. A selection of the seventy-eighth—17 works by fourteen artists and collectors—will be presented by the artist to the public in 2020.The festival will also include", "The next Biennial should be held in 2020.”Tickets for the event can be purchased here.\n\n\nThe Museum of Contemporary Art (MoCA) in California is planning to cancel its next edition, “Between the Sun and the Moon,” at the end of March. The 2019 event, which was originally scheduled for March 31, was pushed to the end of April, and the cancellation of the 2019 Feminine Renaissance, which was to open on April 11, has been announced. The announcement follows a report by the Art Newspaper, which said that three quarters of exhibitors are canceling their March shows, and that the event is being reorganized.“The decision to cancel the show was made in light of the decision by many curators, artists, and organizers who are concerned about climate change and its impact on their careers and their work,” said Patricia L. Snyder, director of the museum, and Lisa F. Rosenblum, president. “We are grateful to our artists and curators for their outstanding work in supporting this important work.”The 2019 Feminist Renaissance exhibition was to unveil a new work by American artist Anish Kapoor in the exhibition space known as the Laundromat. He", "The next Biennial should be held in the spring of 2021. \"We are in the process of establishing new partnerships and will continue to work with the local community to develop new ones, to develop educational initiatives and to show the work of young artists in Eindhoven, in collaboration with the local art school,\" said Bernd and Aigrid.The Biennial will also be based at the Museu de Arte de Eindhoven (MAS), a contemporary art museum in the city of Eindhoven, and the Art Laboratory, a contemporary art research institute. The institution plans to stage the inaugural exhibition in March 2022. The show will consist of 300 works by seventy artists from twenty-six countries. The first show, “In Search of a Country,” will take place in January 2020 and will be followed by “The Light Between Worlds” in October 2020.The Biennial was established by the Dutch-based nonprofit Artnet and will be hosted by the Museum of Contemporary Art, Eindhoven. It will take up the theme of the ’vanishing state of art,” with a particular reference to the transformation of the Dutch visual arts after World War II. The program will feature a retrospective of Gert", "The next Biennial should be held at the city’s Pershing Square from January 25 to February 2, 2020, and the date of the next is yet to be determined.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Larry the Cable Guy as its next chief curator and director. He succeeds Carol Stagliano, who has helmed the institution for twenty-three years, and will take the helm from David G. Evans, who retired in January 2020 after twenty-five years at the helm of the institution.“Larry is a curator and scholar whose presence and expertise will enhance MoMA’s curatorial and scholarly programs, while remaining true to the museum’s mission of representing the full range of art in America,” said Michael Laverrière, chair of MoMA’s board of trustees. “We are thrilled to welcome Larry to the organization and look forward to his leadership role in the museum. We are also grateful for his dedication, passion, and professionalism over the last twenty-two years, which has shaped MoMA into becoming a very strong institution for the art world.”In addition to overseeing the museum’s collections, Larry serves as a co", "The next Biennial should take place in 2021. In the meantime, the museum is planning to launch a new digital platform that will present a new exhibition each year. The project will be featured in the biennial's next edition, which will also feature a special exhibition of more than seventy artworks by artists from Sierra Leone, Sierra Maestra, and the Solomon Islands. The exhibition will be in mid-November and will run until March 21, 2021.\n\n\n\n\n\nThe prestigious Venice Biennale has announced that it will postpone the next edition of the exhibition, scheduled to take place at the Venice Art Museum in May 2021, to May 2022. The postponement was made after the museum received two reports of illness from the same source of the coronavirus, which was first reported by the London Times on May 24.It stated that the coronavirus was detected in two people who visited the museum on Wednesday, May 21 and that the people who were ill had recently come from an area where the virus had not yet emerged. The report was confirmed by the World Health Organization (WHO), which advised the museum to remain closed until at least the end of April, which is when the coronavirus is believed to have first been detected in humans", "The next Biennial should be held in 2020, and the first in 2021. In an interview with the New York Times, Park said: “I want to continue to create. I want to continue to make things that are meaningful and meaningful to me. I want to keep making things that are meaningful for people who come to see it.” She added: “I want to continue to be a force for good in my community. I want people to understand that we are still in a moment of great uncertainty. There are so many things we can do to help and inspire each other. I hope people will continue to come to see me and to the other artists that are represented in the exhibition. I hope they will continue to make the work that you see in the exhibition. I hope that they will continue to innovate and create and move with their own energies.”\n\n\nThe Stevens-Berens Museum of Art in Vienna, which shuttered after it was forced to move the twenty-second edition of the Fifty-Ninth Venice Biennale to March because of the ongoing coronavirus, has announced that it plans to open a new outpost in the city of Brescia, Italy, in 2021. The newly expanded museum will", "The next Biennial should be held in the spring of 2021.The commission of the Works of Protopaprograph, the groundbreaking collaboration between the Italian and North American artists Cristina Salerno and Stefano Bellini, was commissioned by the city of Milan. It will be held simultaneously at the Academy of Fine Arts, the Rome Biennale, and the Museo de Arte Contemporáneo, the city of Milan. The exhibition will include work by forty-one artists, including Hernán López-Santiago, Giulia Cerciello, and David Peterson, and will run for three weeks. “With the exhibition, we hope to express our gratitude to the city, the region, and the country for their support during the construction of the Works pavilion, the museum, and the main building,” said Andrea Bellini, the director of the Museo de Arte Contemporáneo.\n\n\nThe Solomon R. Guggenheim Museum in New York has received a gift of thirty-six works from the estate of Roberta Smith. The gift includes twelve works by Smith, the great granddaughter of Charles Smith, the founder of the New York publishing company the Gug", "The next Biennial should be held in 2021 and will focus on “the practice of art,” said Matthias Jäger, the director of the Max Planck Institute for Art History in Berlin. “It is crucial that it remains an exhibition of great complexity and depth, embodying a unique group of artists, a rich range of artistic processes, and an exceptional collection of works.”\n\n\nThe French Ministry of Culture has released the list of twenty-six artists who will have their works displayed at a new retrospective of Poppets in New York at the end of March. The show will take up the themes of the exhibition “Poppy” and its three predecessors, “Zou Occupation” (1975), “Be/longing: The Dream of a New Middle East,” and “Post-Modern Art.” The three workshops, which will be held at the Library of Congress’s Walter and Eliza Wallach Building in Washington, DC, will run from March 13 through March 14.The artists selected are Lee Fried, Susan Ford, Anish Kapoor, and David H. Koch, who will each receive $5,000 for their projects. Each", "The next Biennial should take place in the fall of 2020. Following the exhibition, the campus will host a series of exhibitions, performances, lectures, and other events, and will reopen to the public in March 2021. The biennial’s theme “Art in the Age of Mechanical Reproduction,” which was developed in conjunction with Dutch pavilion winner Yvonne Eskenazi at the Biennial of Metal Art, will be revisited by the university in March 2022.\n\n\nThe Museum of Fine Arts (MFA) in Boston has added seventeen new artists to its roster this year, including Nari Ward, Rineke Dijkstra, Ann C. Brown, and Jeannette A. Lee. The museum also announced that it has added seven new artists to its roster in 2017, including Ayana Agapais, Ali Baraka, Nariimala Baraka, and Lorianne Markham. “We are thrilled to welcome these new contributors to our growing collection and museum,” said museum director Mary Anzaldúa. “Their contributions to showcasing the art of the twentieth century in Boston will be a great honor and a great source of inspiration for our talented and dedicated curators,", "The next Biennial should be held in 2022.\n\nThe Los Angeles County Museum of Art (LACMA), which has been working on revamping its museum since 2014, has announced that it is collaborating with the Los Angeles–based nonprofit Artscape to launch a new series of annual biennial events. The first event, titled the Los Angeles 2020, will take place in the museum’s new 7000-square-foot East Coast headquarters from October 27 to October 30, 2020. The second event, titled the Los Angeles 2030, will be held in a different location, but the same building, in December 2022.The partnership with Artscape was announced a few weeks ago, when LACMA director and CEO Thomas Friedman revealed that the institution would invest over $100 million over the course of twenty years to fully restore the building and its interior. LACMA also plans to install new works by up-and-coming Los Angeles artists and will launch a new digital platform for the curatorial team to showcase the works of past and present curators.The partnership comes at a crucial time for LACMA. The institution opened its new headquarters in the former home of the US Postal Service in 2005. The renovation involved the demolition of the Museum of Contemporary Art (", "The next Biennial should be in the fall of 2020, with the first exhibition in the fall of 2021. The full list of the artists who will be featured in the second edition of the exhibition is as follows: Sara CwynarCatherine DessalaiCara DuttonCara KellerDiana FergusKelly KlattenbergLewis LangfordKayode Ilse BrysonKelly McClellanKelly RoeslerKelly RobinsonKelly Sue MurphyLacy SimsLance BarnesLablece JonesLydia BarréTanya OrtizHannah BrownHannah GrayHannah HuttonHannah Lennox (United Kingdom)Hannah McAlinden (United Kingdom)Hannah McCongalen (United Kingdom)Hannah McConwit (United Kingdom)Hannah McConwy (United Kingdom)Hannah McDonagh (United Kingdom)Hannah McEwan (United Kingdom)Hannah McEwan (United Kingdom)Hannah McFarlandHannah McFarland (United Kingdom)Hannah McFarland (United Kingdom)Hannah McDonagh (United Kingdom)Hannah McDonagh (United Kingdom)Hannah McDonagh (United Kingdom)Hannah McDonagh (United Kingdom)Hannah Mc", "The next Biennial should be held sometime in the 2020s. \n\nThe Art Newspaper reports that the Tate will soon be rebranded as the UK’s largest arts employer, with Greater Manchester City Council funding the ambitious plan. The announcement follows a raft of changes at Tate Britain, which is consolidating its operations across three buildings that were previously occupied by the Tate. The Tate’s London and East, Tate Modern and Tate Liverpool, and Tate Finland are now all housed at the same time in the same building and will begin welcoming visitors in 2020.“Tate is reinvigorating its future with a future-forward vision for the Tate,” said George Giddens, chief executive of Tate’s board of trustees. “We are working hard to build on the extraordinary legacy of Tate’s first director, Sir David Cameron, and look forward to the future with a renewed sense of purpose.”Cameron, who has led the Tate since 2010, has pledged to spearhead the transformation of Tate’s two-mile-long campus into a $100 million civic gathering space, while simultaneously expanding the museum’s collection through the acquisition of works and expanding its digital presence. The museum is also", "The next Biennial should be held in the Spring of 2021. The exhibition is currently on view in the eventual exhibition \"Geometry and Crisis: Series One-Two, 1919–1924,\" which will open on September 29. The 2018 exhibition will focus on artistic practice and artistic exploration in the United States, with performances, performances, performances, and more performances. The 2019 exhibition will focus on artistic practice and artistic exploration in the United Kingdom, with performances, performances, performances, and more performances. The 2020 exhibition will mark the 90th anniversary of the American West. The 2019 exhibition was organized by the Chicago-based artist and curator Kraus, who was born and raised in New York City and has lived in Los Angeles for the last twenty-five years. Over the course of her career, Kraus has collaborated with artists such as Wong Kar-Wai, Yinka Shonibare, and Kiki Smith; the late William Eggleston; and Johann Sebastian Bach. “From the very beginning of my curating career, I have strived to explore new and previously untapped mediums to give audiences a contemporary art program that would challenge preconceived notions about what", "The next Biennial should take place at the January 16–March 5, 2020. If the March 7–March 12 event is cancelled, the 2020 event will be moved to March 16–March 18. In a statement published on the exhibition’s website, the Biennial said: “The entire show will be taken offline. We are working hard to prepare for this possibility, and for our artists and audiences, to be able to express our grief at this difficult time.”The Art Newspaper reports that the remaining events scheduled for the exhibition will be postponed, with the exception of the opening of a new exhibition. The new show will be comprised of a retrospective of the first twenty years of the exhibition, titled “Roots of Evil.” The new exhibition will be titled “The Enigmatic Empire of Guanyin: The Art of Guanyin” and will be presented by two different artists: Nativesabeng and Andy Ray.The new exhibition will be organized as follows:The new exhibition will be on view March 8–March 13. The March 14–March 17 show will be held at the Art Institute of Chicago. The newly formed exhibition space Art Connects will present a group show of works", "The next Biennial should be held in 2020, but the deadline has been pushed back, and the 2019 edition, which was canceled due to Covid-19, will continue. According to Artnet, the 2019 installment, titled “San Francisco,” will still be shown in 2021. The 2019 edition, titled “Animals,” was staged by the New Museum and New York’s Museum of Modern Art. The 2020 event will be the fourth and final, and will take place between October 23 and October 25.\n\n\nThe Wurlitzer Research Center in Florence (WCRF) has announced that María Berrada has been named director of its prestigious 50th anniversary celebration, “Fellowship,” which will take place in the Italian city from September 21 to September 26. Berrada, who currently serves as the director of the Università della Cambriglia in Milan, has led the WCRF for more than twenty years and has helmed the institution through a number of devastating crises, including the pandemic.Prior to joining the WCRF, Berrada served as the director of the Venezio di Minazzo, Italy’s main archaeological museum", "The next Biennial should be called for October 2020.  The next will be December 20–March 8, 2021.  The next will be spring 2021.  Historically, the last ten years have seen an astounding increase in international collaboration, with several hundred museums and thousands of visitors converging on Kiasma. \n\n“We are very excited to welcome the new exhibition world to the exhibition-house,” “and to have the opportunity to expand the exhibition experience in its World-Class, Modern and Contemporary galleries,” Said designer Harald Szeemann. “The exhibition-house is a vital link between the cities of Kiasma and the city of Zurich. The exhibition-house is a unique hub for cultural exchange. It is a great success and a great challenge to create a new exhibition space in the exhibition-house.”The renovation and expansion of the exhibition-house, which opened in 1949, has been a significant step towards realizing the vision of its founding architects, Peter and Peter Stahl. The Wunderground project, which has involved the construction of a new 800,000-square-foot structure, the Kunsthalle Kiasma, and the establishment of the world", "The next Biennial should be announced by September.\n\n\nThe University of Pennsylvania’s 'New Museum of Art' in Philadelphia, which recently laid off about two hundred employees, is close to finalizing a deal that would keep the museum open through 2024. A bargaining committee convened by museum management and informed staff on Tuesday that it had reached an agreement with the Uniontown Consortium, the developer of the Whitney Museum of American Art in New York, for the construction of the institution’s second floor, which will be located in the museum’s basement. The announcement of the deal was made on the same day that Philadelphia’s Arts and Artists’ Association (PaMA), the city’s arts advocacy group, sent a letter to Mayor Jim Kenney expressing concern over the proposed deal.PaMA’s concerns were echoed by the American Federation of Arts, which called the hiring freeze a “serious mistake.”“We feel misled by Jeffrey Rosen, PaMA’s CEO, and Roderick Shaughnessy, President of the Pennsylvania Academy of Fine Arts, who have publicly stated that the institution is still on schedule to reopen,” said Amy Schatz, a cofounder of PaMA. “", "The next Biennial should be held in 2021. David Westenberg, CEO of the Anschluss-Gesellschaft (AG) in New York, has described the event as “a melting pot of cultures and philosophies,” and says it will take the world by storm. “Would we like to see a vision of a future for biennial cities in the twenty-first century?” Westenberg asks. “If we could create such a dream city in our imaginations, what would it look like?”\n\n\nFor nearly three decades, the Metropolitan Museum of Art in New York has been an engine of New York’s art ecosystem. Through a combination of philanthropy and savvy, the museum has remade its current collection in the museum’s public galleries into an art museum, which will open to the public in 2022. Although the institution declined to share exact operating costs or the timeline for reopening, its admission prices and the museum’s revolving doors have been cut by half since 2009, and the museum’s purchase price has fallen by more than $1 billion since 2009.The Metropolitan’s annual operating budget is now estimated at $8.5 billion, down from", "The next Biennial should be held in the spring of 2021.\n\n\nThe British Academy has appointed Caroline Clarke as its new board director. Clarke will be responsible for overseeing the biennial’s curatorial team and ensuring that it receives funding from the government, the arts, and philanthropic sources.“In her appointment, Caroline sets the tone for the biennial, forgoing the usual three-man-style style of the biennial, which is itself a reflection of how we all want to think about and care for our bodies,” said Mark Serwotka, chair of the board and president of the British Council. “Caroline is ambitious, bold, and fearless. Her agenda will set the biennial in motion. She is ambitious and fearless in reaching out and challenging the boundaries of what is possible. Her bold approach will be the catalyst for change and the reason why we need more bodies like the BACP.” Clarke comes to the Bristol-based biennial from the Royal Academy of Arts, where she has served as director of public engagement since 2013. Her other recent roles include authoring a public statement for the first time ever for the United Kingdom’s decision to leave the European Union in March 2020 and serving as", "The next Biennial should be held in 2022. \n\n\nThe Italian government has released guidelines for the future management of the Dalai Lama Museum in Beijing and has barred the institution from demolishing the structure in an effort to make way for a large expansion. According to the Art Newspaper, the government has now decreed that the museum can remain standing, but that it must prepare for a \"massive loss of cultural heritage.\" While the demolition of the monastery and its grounds is not illegal, the building of a museum that houses the remains of a religious site is considered a grave violation of the Legislature’s decision to grant the Dalai Lama a state funeral.“While the demolition of the monastery and its grounds is not illegal, the building of a museum that houses the remains of a religious site is considered a grave violation of the Legislature’s decision to grant the Dalai Lama a state funeral,” said state secretary of the Democratic Party, Enrico Letta. “If the decision is made, the museum will not only be in danger of falling into the hands of the Chinese, but it will also be in a position to be damaged by the explosive power of the sun and the wind.”", "The next Biennial should be held in September 2021.\n\nThe Willem de Kooning Foundation in the Netherlands is planning to move the 2019 edition of the Biennial to the Netherlands, the City of Amsterdam, from November 15 to November 23. The move has been in the works since May 2019, when the museum announced that the event would remain in Amsterdam, and has been made possible by a $3 million donation from the foundation.The Foundation’s executive director, Jean-Marie Degenhardt, said: “We are delighted to be able to bring the 14th edition of the Biennial to the Netherlands. At this critical juncture when many cultural institutions across the world are facing disruptions caused by COVID-19, the Willem de Kooning Foundation is making the most of a rare opportunity to highlight the work of the institution in the Netherlands.” The show is scheduled to run from September 21 to September 25, 2021.\n\n\nThe Ashmolean Museum in Oxford, England, has received a donation of twenty-four rare books by the late Nigerian scholar Hosea Abdurraqib, a founder of the Movement for Justice and Peace (M3), according to a report by the Art Newspaper. The works", "The next Biennial should be held from December 21 to December 23.\n\n\nThe French Ministry of Culture has announced that the first phase of the redesign of the Louvre will open in 2020. It is planning to overhaul the institution in stages, with the first phase, “Romance” scheduled to open in 2022. The next phase, “The Other: In and Out of Love”--which will be on the first week of March--is currently being prepared.The ministry has also announced a number of other programming initiatives to improve the museum’s physical environment; to expand the collection and exhibition program; and to create new opportunities for audience participation. Among the other initiatives are the extension of the museum’s hours, the creation of a special collection hours section, and the introduction of a weekly program of live music and performances.“Romance’s redesign will expose the reader to the work of new and emerging artists, while also pointing to the themes of everyday life and their actions,” Minette de Black, director of the Louvre, told the Art Newspaper. The redesign will also introduce new public spaces and materials. The redesign of the museum’s current building was completed in 2017. This year�", "The next Biennial should take place in 2020.\n\n\nThe University of California, Berkeley, has appointed James R. L. Robinson as its next president. Robinson comes to the university from the University of North Carolina, Greensboro, where he has served as an assistant professor of history and international relations. He succeeds Patricia M. McCarthy, who retired in May after nearly five years.“James is a leading scholar, teacher, and scholar and is seen as the ideal person to lead the Berkeley College of Art and Design in the design and visual arts,” said Michele Tan, chair of the board of trustees. “He has extensive experience leading contemporary art institutions, including at the University of California, Los Angeles, where he has served since 2015.”During his tenure, Robinson has helped steer the college into a new twenty-four-hour week, implemented major conservation initiatives, and launched the Berkeley Design Lab, which has produced more than two hundred exhibitions and has organized more than two hundred events. He also oversaw the acquisition of nearly $6 million in art and design through the college’s reopening of the William Aloysius Rolander Building, and he oversaw the relocation of the university’s art and design collections to a new", "The next Biennial should include work by French and Italian artists and should kick off in May 2021. “New Italy’s art and architecture will always be at the forefront of our collective vision,” said Lorena Battista, executive director of the museum. “This year’s edition will explore the possibility of revisiting the past through architectural forms, as well as the possibilities of the future.”\n\n\n\n\n\nYale Armenians are organizing a protest against the university’s decision to remove a fifty-year-old statue of revolutionary revolutionary leader Alexander Suvorov, a notorious Bolshevik collaborator. The controversial move prompted a furious response from the university, which plans to relocate the memorial to a museum dedicated to the Bolshevik leader.“We are in the process of planning a show that will be a reflection of the institution’s new identity and future,” Pat Flynn, the head of the Armenian Students’ Association at the university, told the New York Times. “It is our hope that this show will be an inclusive reflection of the diversity of our communities and will include both historical accuracy and sensitivity.”A statement issued by the protesters reads: “The removal of this statue", "The next Biennial should be held in 2020. A spokesperson for the gallery said: “We are working with the Government, the National Gallery, the National Council of the Arts, London, and the trustees of the National Trust to understand the options for the future of the National Portrait Gallery and are in discussions with the Tate and the National Museum. We believe the best way forward for the museum and the gallery is for it to continue as it has always been, meaning that future exhibitions, exhibitions, conferences and other events will take place at the gallery. We are looking to the future with great optimism and understand that this is a challenging environment. We are committed to working with the National Trust, the Government and the trustees to ensure the future of the National Portrait Gallery and to ensure that it is protected in future years.”\n\n\nFollowing the recent mass shooting at an Oregon community college that left nine people dead and six injured on December 2, a new group called the Open Carry Foundation has been created. The nonprofit organization was founded in response to the United States’ decision to bar firearms from schools and colleges in the wake of the tragedy. The foundation, which has more than 1,400 members, operates a mobile presence", "The next Biennial should feature works by the group César Ruiz, whose powerful, multi-dimensional paintings highlight the rich and expansive dimensions of the contemporary landscape; American painter Raymond Boisjoly; and Italian-born, California-based artist Marcia Cernani, whose compositions are filled with a powerful sense of humor about metamorphosis and the world around us.The artist-run nonprofit Art+Bicycle will also be celebrating its thirtieth anniversary this year. The institution was founded in 1998 by Laura María, who moved to Los Angeles from the southern California coast. In 2005, the group sold the iconic bicycle, which it refers to as its \"brand, to the University of California, for $200,000. The purchase included the support of María, whose creative practice revolves around creating works in large-scale installations and theatrical performances. The museum has hosted a number of performances by artists, including Cliff Martinez, Jim Jarmusch, and Thomas Krens; created classes for the group during its first ten years; and developed a collection of more than 1,200 works.The organization’s schedule for the next two years will likely include an exhibition of work by major California artists, including John Akomfrah", "The next Biennial should mark a turning point, said director Sir David Walliam. “The theme of the twenty-first century is of a kind we have never experienced before: the first human being on the face of this planet.” The pavilion will showcase four of the most important and understudied works in the biennial, including an exhibition of work by the artists Sam Remar and Alexander Calder.The exhibition will also feature works by artists including Vivian Calder, Mickey Glaser, and John Webster. The ten artists who will receive an honorary doctorate are David H. Koch, Ravi Majumder, Anatole Shagal, Joseph and Maureen Kelly, and Lévy Gorvy Delacour.The biennial is sponsored by the CAA BIC (Centre for Art and Culture International), the CAA Foundation, and the CAA Collection. The biennial will run for two weeks, from September 15 to September 15, 2020.  \n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Sonya Hansen as its next executive director and chief curator. Hansen comes to the institution from the Metropolitan Museum of Art in New York, where she has served as director", "The next Biennial should be held in 2021.\n\n\nThe Museum of Fine Arts (MFA) in Boston has launched a $250,000 fund to support cultural workers affected by the Covid-19 pandemic. In a statement, the museum said that it is working with a group of artists, including Ed Moses, and the National Association of Theater Owners (NATA) to develop a proposal that will provide critical relief to those impacted by the coronavirus. “Covid-19 has made clear that many of the nation’s cultural workers are not equipped to meet the challenges posed by the virus,” MFA director Christopher Campbell told the Boston Globe. “I’m hopeful that we can use this fund to help them.”The fund will distribute $150,000 from the Covid-19 Emergency Fund to various funding sources, including to nonprofit arts organizations; to temporary industry support groups and charities; and to participating arts professionals. “We must work together to prevent the spread of Covid-19,” Campbell said. “Covid-19 has made clear that many of the nation’s cultural workers are not equipped to meet the challenges posed by the", "The next Biennial should be held at the Central Library in Lisbon in December 2020. \n\n\nThe Museum of Fine Arts (MFA) in Boston has been granted a $1.25 million grant from the Walton Foundation for its inaugural biennial, “The Origins of Modern Art,” which will run from March 8 to March 10, 2021. The grant coincides with the opening of a new exhibition, “The Evolution of Art,” which will explore the impact art and design have on our environment, as well as with the landmark reopening of the Museum of Fine Arts, Boston, which will welcome visitors on April 3.“The foundation is thrilled to support the museum’s efforts to advance its collection to new heights of scholarship and to present a series of engaging exhibitions that reflect the diversity of styles, approaches, and ambitions of the MFA’s curators,” said Elizabeth M. Walton, chair of the foundation, in a statement. “We are grateful to the Walton Foundation for this opportunity to support the museum’s collection and to the Boston community in this way.”The foundation also announced that it expects to receive $1 million from the sale of works in the exhibition,", "The next Biennial should also be a celebration of the life and work of one of Canada’s most iconic and important artists, Rembrandt, the founder of the artist movement. “Rembrandt’s work is synonymous with the modernist movement and is nominated for a number of awards, including a Lifetime Achievement Award from the Art Gallery of Ontario in 2018, his first award. His work will be included in the biennial’s twentieth edition, ‘The Modernist Experience,’ which will be held in 2021.”Inaugurating the biennial will be a new exhibition of works by renowned Canadian artist Carl Egli, who will be presented with a Lifetime Achievement Award from the Art Gallery of Ontario in 2020. The twenty-six-year-old Egli is the founder and director of the modernist museum in Montreal, the Centre d’Art-Minimal, and the Contemporary Art Museum St. Louis. He is also a professor of art history and philosophy at the University of Toronto.Commenting on his nomination, Egli said: “I’ve been drawn to the concept of collaboration through my own practice ever since I began as a self-taught artist fifteen years", "The next Biennial should focus on how our lives are shaped by institutions and what we can do about them.  An address to the people of Abu Dhabi should be held soon. The fourth round of the Biennial is scheduled for March 21–March 22. The fifth and final phase, titled Art and Philosophy, will again take place in May, 2020. A new competition show, Art and Science, will follow in November. The entries for the third and fourth phases will be announced in April. Over the course of the twenty-fourth Biennial, which was staged at London’s Serpentine Galleries in June, the Tate will be open from March to June, the National Gallery from March to March, and the Royal Shakespeare Company from March to March.The 2019 edition of the Biennial, titled NIRIN, was staged at the Metropolitan Opera House in London from March 20 to March 21. The 2019 iteration, titled TIMES, was staged at the National Theatre in London from March 21 to March 22. The 2019 edition of the Biennial, ISLAND, was shown at Tate Britain from March 17 to March 19.  In addition, the 2019 edition of the Biennial,", "The next Biennial should focus on issues of the life and death of artist Ai Weiwei, and the artistic legacy of Hans Ulrich Beck, who was a close friend and confidante of Ai. The museum will also consider whether to reopen the exhibition’s entire outdoor collection.If completed, the exhibition would mark the thirty-fifth anniversary of the exhibition “Museum of Modern Art” in New York and would consist of a selection of works by thirty-five artists whose lives and work are intertwined with the cultural landscape, including Jean-Michel Basquiat, Pierre-Xavier Baudelaire, and Pierre-Auguste Renoir.\n\n\nThe Seattle Art Museum (SMA) has received a gift of more than forty works by American sculptor Frank Gehry. The institution announced on Tuesday that the sculpture, which was donated by architect Max Hetzler in 1998, is the centerpiece of its “Planetary Harmony” series, which premiered in 2017. In addition to the sculptures, which are located in the museum’s collection, the show includes a resource center devoted to the history of architecture, and a project with architect-celebrities and architects such as Richard Avedon, Mark Bomback, Laura Owens", "The next Biennial should be held in the spring of 2022.\n\n\nThe Museum of Fine Arts (MFA) in Boston has suspended all programming and activities in its annual fifty-third edition through June 26, 2022, following a mysterious fire that broke out in a second-story gallery on Thursday, March 4. As a result, the exhibition will be rescheduled for June 21–June 23, 2022, and the artworks and titles will not be returned to the institution.The fire broke out in the museum’s Science, Technology, and Arts (STA) wing on March 2, at approximately 3:50 PM on Thursday, March 3. The firemen who extinguished the blaze, which was extinguished with the use of fire-damaged electrical panels, reported that the fire was extinguished by the time firetrucks arrived.The MFA has yet to publicly comment on the cause of the fire, but a museum spokesman confirms that it was not caused by structural problems at the building, but by a hardware malfunction. The firemen determined that it was extinguished by a combination of the proper installation of a smoke detector and fire extinguisher, as well as the use of extinguishers, which were common at the time.“In the event", "The next Biennial should open in 2020 and will draw from the centenary of the outbreak in China, which killed fifty-three people in Shanghai in March.  Although the first edition of the festival was canceled in March 2019 due to the Covid-19 pandemic, organizers have since said that the plan is to return to Beijing and open a second edition in 2021. The event will be hosted by the Sichuan Academy of Fine Arts and will take place in December.\n\n\nThe Bushwick Museum of Art in New York has announced that it is planning to reorganize its collection by creating more programming focused on Indigenous scholarship and art. The institution previously announced that it will organize a conference on Indigenous art in 2021, but that it plans to hold the first event in 2022.“We are rewriting the narrative of how art history will be organized and presented in 2020,” said Bushwick director and CEO Carmel Alsmith. “As we prepare for the next iteration of the museum, we have started a new series of exhibitions, a new online platform, and a new public programming and education program. We are reimagining how art history will be experienced by our guests, and what kinds of experiences are possible through art. It is an exciting", "The next Biennial should be presented by the Amsterdam-based artist Berndt Andersen in early 2020, according to a statement by Artforum. In a separate statement, the city of Amsterdam said that the 2019 event would be re-created this year, with Andersen’s installation, The Shadow of Man, slated to open on January 31.The Art Newspaper reports that ArtsCenter will stay in operation throughout the cold snap, scheduling regular programming and serving as a space for visitors to gather and view artworks and live performances. The facility will not be closed off and will continue to be accessible by public transportation. According to the Art Newspaper, the institution will also continue to receive visitors during the shutdown. In a statement, ArtsCenter said: “The future of ArtCenter, which is a major part of the cultural life of the city of Amsterdam, is unknown. However, we are closely monitoring the evolving situation and following the guidelines laid down by the authorities. The board and the management team are at the forefront of the evaluation and approval process regarding all possible options, including direct flights and accommodation, so that the center may remain open and serve the city of Amsterdam well into the future. The board believes that the best way", "The next Biennial should take place in the spring of 2021. In the meantime, the artist-run organization the Marrakech Biennial will continue to present its two-year celebration of the Tunisian artist, Jacob Bê, whose sculpture, He Will Live, was exhibited in the museum of Tunis in September of 2016.\n\n\nThe Carter Center for Contemporary Art in Atlanta, Georgia, has announced that it will award $10,000 to any artist who creates an original work that is presented as part of the Triennale di Rome (Tribunale di Rome) in 2020. First presented in 1965, the award has been $20,000 in favor of an artist who has performed at least one work in the museum in the last three years. The organization will announce another awardee next week. The center will award $5,000 to an artist who creates a new work and $2,500 to an artist who creates a work that elicits a new experience. The awardees will be announced in the coming weeks.“Today we are thrilled to announce that our artists will be awarded a new award that will allow them a further unprecedented opportunity to express their creativity and engage audiences,” said Carter chair and curator Ren", "The next Biennial should take place at the same venue in 2021. \n\n\nThe Brooklyn-based, nonprofit museum Diller Scofidio + Renfro in New York has appointed Tamara Borthwick as its next executive director. She succeeds Andreas Baer, who retired in April after eight years at the helm of the institution, and will begin her position in January 2022. Borthwick will take up the post at the museum on January 14.“We are delighted to welcome Tamara to the board of trustees,” Diller Scofidio + Renfro chairman Christopher Jacobs said. “Her background and expertise will bring extraordinary leadership and expertise to the organization as we continue to grow and evolve as an institution. We are confident she will continue to lead our board and our staff in producing high-quality programming, remain focused on the mission of the museum, and provide a strong vision for the future of the institution.”Borthwick joined the institution in 2014 as director of research and curation. She has also served as an assistant curator at the Metropolitan Museum of Art in New York and has held positions at the Museum of Modern Art, the National Museum of Women in the Arts,", "The next Biennial should be held in 2022. If the proposal for the current event turns out to be successful, the next Art Basel Hong Kong will be held in 2021. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Amanda Kramer as its next director. Kramer has been a director and curator at MoCA since 2014 and serves as the chief curator of its new, western-themed building, the new museum’s first, and will be the last, incarnation of the institution. She succeeds Ruth Estévez, who retired last month after seventeen years at the helm of the museum.“We are deeply honored to welcome Amanda back to the MoCA team and to have her on board as an enthusiastic partner for the next eighteen months,” said MoCA director Matthew Teitelbaum. “Her ability to connect with the most intimate details of the people and places she works with and her ability to understand and apply dialogues that are between artists and the museum as well as the city and region make her a strong fit for our unique mission.”Kramer was selected as the successor for her leadership and expertise in the following areas: curating, fundraising, innovation, finance and operations. �", "The next Biennial should be held in the Spring of 2022. The 2020 edition of the exhibition was held at the Museo de Arte Contemporáneo in Porto Alegre, Brazil. The 2019 edition, titled Feminidades’ Americaa, was held at the Museo de Arte de São Paulo, Brazil. The 2018 edition of the show was held at the Museo de Arte do Rio de Janeiro. No date has yet been set for the 2020 edition.\n\n\nUAE Ministry of Foreign Affairs (MEA) chief Ahmad Jumail bin Saeed has ordered the arrest of a prominent Saudi Arabian artist and activist over a critical tweet that criticized Al-Qaeda. Also on the list of individuals arrested is Ahmad Kamal Al-Asiri, a Saudi Arabian poet, and activists Ali Shaheed and al-Hadrat Nusseibeh.The six-month sentence handed down by the northern city of Qatif in the central province of Ras Al-Arab was a result of an online petition that claimed the Saudi Arabian government was allowing the group to be used as a human shield. The petition was signed by more than 1,500 people and claimed that the Saudi government was det", "The next Biennial should be held in the summer of 2021. The entry fee for the first Biennial, curated by Adam D. Weinberg, was $2.5 million. The final project for the Exhibition will be an exhibition dedicated to the work of the late Japanese artist Takashi Mimura, whose sculptural practice explored the relationship between physical and conceptual objects.\n\n\nThe eponymous Toronto arts space the Gallery at 4210 College Street (GAT), which has operated independently from the city since 1992, is facing a lawsuit from the city of Toronto for breaching the Official Plan by permitting the construction of a shopping mall and hotel complex in the area. The lawsuit claims that the city allowed the development of the 16-hectare campus of the museum, which is located at 4211 College Street, as part of an 'incomplete and misleading' plan that was drafted prior to the construction of the new airport.“We are pleased to see that this matter has been resolved quickly and effectively and that the city is taking the matter seriously,” said Mark Grimes, the director of the Gallery at 4210. “We will continue to work in partnership with the city to ensure the future of the campus and are confident that we have a strong", "The next Biennial should take place in 2021.\n\n\nThe Association of Art Museum Directors (AAMD) has taken the first steps toward revamping its bylaws by adopting a new set of guidelines that address the management and promotion of museums.“The recommendations in this document are an effort to help ensure a strong and consistent experience at the AAMD as we work to reimagine how we build and organize our collections, services, and exhibitions,” said Hilary Levey, chair of the AAMD board of directors and director of the South by Southwest (SXSW) Biennial in Houston. “The AAMD will continue to evolve and to be shaped by our community and our visitors, and the recommendations will help us in our journey toward a future in which the museum is a vital, vibrant place for art and culture in all of its forms.”The document, which address issues such as the role of museums in the urban landscape, the management of temporary exhibitions that have been organized in recent years, and the promotion of contemporary art and artmaking, was crafted by the AAMD’s executive committee and is part of its ongoing review of the state of art, the role of museums in urban landscapes, and how museums are being managed", "The next Biennial should be held in the City of London, and will be inaugurated by the reopening of Central Station in the City of London. In a statement, the National Poetry Library (NPLL), which was founded in London in 1983 to protect the inheritable legacy of Sir Paul McCartney, said: “We look forward to working with the City of London Gallery of Modern Art to create a programme that reflects both the richness of the collection and the particularly ambitious goals of the National Loteries Museum. We are confident that the new format will give the collection an exciting new spatial setting that reflects both the power and creativity of the collection, but also the ability to draw audiences and build on the Poetry Row.”\n\n\nArtists and collectors in Singapore have sued the National Gallery of Singapore (NPG), accusing it of racial discrimination in its hiring and promotion of trans-racial artists. The allegations were made by Kianmehr Aartian, who is the first Singaporean to win the National Artist’s Award, and Kaifu Li, who is the first black person to be appointed an Honorary Fellow at the National Gallery.“We are deeply concerned by these allegations, as we believe these allegations are not isolated", "The next Biennial should focus on new and contemporary ways of examining the history of labour and the biennial’s current exhibition, “Labor and the Modern World,” which was staged at the Museum of Modern Art in Rome in 2019. The exhibition opened on March 11, 2020 and ran until October 21, 2020.The twenty-fifth edition of the Biennial will be held at the José Alÿs Museum in São Paulo from June 21 to June 23, 2020. The dates for the event have yet to be announced.\n\n\nThe Foundation for Contemporary Art (FCA) in New York, which was forced to relocate from its original location in Midtown Manhattan after it was threatened with a lawsuit filed by a group of tenants in August 2019, is preparing to reopen at 1600 Fifth Avenue in midtown Manhattan on September 26. Its new show, “Open,” will comprise three exhibition spaces, located in a converted factory, that will display works by thirty-two artists. The organization also announced that it will expand the scope of its arts programming by launching “The Long Walk,” a free, six-week-long arts workshop series that will take place across fourteen venues in the city. “The", "The next Biennial should be in 2020, in the year next spring. \n\n\nThe Museum of Fine Arts (MFA) in Boston has postponed its annual gala due to the Covid-19 pandemic. The late-spring event was set to take place on the museum’s campus on Saturday, March 29.The event was originally scheduled for March 23–March 26, but it was rescheduled for March 29–March 31. The March 31 event, which was originally supposed to coincide with the March 22–March 24, gala, was also postponed.“We are deeply grateful to our guests, partners, and the Boston community for supporting this year’s invitation-only exhibition,” MFA director Dennis Feuerstein said in a statement. “The gala’s invitation to March 29 was extended by a single day in order to give us a better opportunity to continue to present the exhibition in the best possible light. As a result, we are now near completion and should have a first-run opening date of March 29. We hope that this opening date will be a significant milestone for those who have yet to experience the Museum of Fine Arts.”The gala will now be held", "The next Biennial should take place in the autumn. “I would like to see the exhibition become a source of inspiration for visitors to the country, and of course become an occasion for the country to stand in the presence of the world,”, said Rudolf Bing, the Director of the Kunsthalle Basel.\n\n\nAs the anniversary of World War II approaches, more than twenty-five thousand people are expected to descend on Berlin for the inaugural Berlin Art Week. With more than 400 artists and collectives participating in its first edition, Berlin Art Week will be the largest contemporary art event in Europe. The event will take place at the Kreuzberg Art Museum from September 18 to September 20.The event will offer two-day passes, priced at $38, and includes two days of programming, including seminars, demonstrations, tours, and collages. The free admission is a prelude to the three-day Berlin Art Week, set to take place on September 14–September 16.Adeline Junger, director of the Tate, said: “The Berlin Art Week has never been more important than it is today. We are now counting down to the event, and we will do everything we can to ensure that it continues to thrive in", "The next Biennial should take place in the Town of Lausanne, Switzerland, in December 2021. The twenty-fourth edition, titled “Virginia: A Century of Painting,” will be held at Kunsthalle Basel from March 20 to March 21, 2021. The exhibition will present forty-two pieces, including six works by Gneys, “The House of Three Families,” and “Renaissance Beauty.”“Virginia: A Century of Painting” will kick off with a public exhibition at the Kunsthalle Basel in January 2022, followed by a “Group Show at the Museum of Modern Art” in July 2022. The final event of the biennial will be “A Tribute to the Master in the Land of the Mazak.” The show will also coincide with the seventeenth Venice Biennale, which will take place at the Museo Nacional in Madrid in November 2022, and will feature works by seventy-five artists, including Robert Bragg, Sofia Kazan, and Robert Irwin.\n\n\nThe Museum of Modern Art (MoMA) in New York has released new guidelines for the handling of historical materials relating to the 2016 assassination of", "The next Biennial should take place in the city of Kingston, where a reconstruction of the War Rooms, which was organized by the exhibition, is currently on view. The twenty-fourth edition of the festival, which will kick off on February 27, 2020, will once again focus on the relationship between contemporary art and civil rights. The exhibition will also introduce the themes “The Politics of Reality” and “Poststructuralism” and will be followed by a “Goethe Memorial Lecture,” which is the theme for this year’s event.In a statement on its website, the Biennial said: “The twenty-fourth edition of the Biennial will celebrate its twenty-fifth anniversary and will comprise of a number of topics which include a discussion of the legacy of German Expressionist painter Ernst Lüthi, a presentation of the exhibition ‘The Secret Life of Walter de Gruijl, and a discussion about the relationship between contemporary art and social justice.” The exhibition will also include new works by artists such as Nicholas Stoller, Oui-Chin Chou, Timothy Learoyd, Joshua Lester, Rirkrit Tiravanija, and Rodda Terrier. The seventy-eighth", "The next Biennial should be held at the Haus der Kunst in Frankfurt, in December 2022. The first will be held in the city of Bonn, in March 2019; the second in mid-March 2020. The $7.5 million Art Basel Biennial Berlin is currently on hiatus, having been closed since March 13, with the exception of March 14 and March 15. Announced last week, the biennial is slated to run from March 19 to March 21, 2020.\n\n\nThe Museum of Contemporary Art (MoCA) has hired S.C. Rajan as its new director. The New York–based curator, who most recently served as a visiting lecturer at the University of Virginia, and his team have developed a new program that will showcase the work of emerging artists in the fall of 2020. Ranging from monthly curated exhibitions to live performances, the exhibitions will showcase the work of twenty artists, including a group show of work by Nari Ward (pictured above), and will highlight the museum’s collection.Rajan’s first program, “The Bad at Home,” will feature works by five artists, including Yuri Gagarin, Ville Vigo, Jamie Glenn,", "The next Biennial should aim to focus on the life and work of Manfred Gertl, who was born in Switzerland in 1928 and lived in Paris until his death in 1976. “Gertl holds a special place in the history of art in France,” said Jacques Delorme, chair of the commission. “Born in the small town of Bürenbach, Gertl studied at the Academy of Fine Arts in Paris, the Museum of Modern Art, the Met, and the Institut des Beaux-Arts in Paris. He became interested in the role of photography through articles in the magazines of the time, and in 1973, he founded his own photographic studio and began regularly publishing photographs under the pseudonym 'Hans Frank, ‘The Last Man.\n\nThe Leeds Art Gallery (LAG) in the United Kingdom will assist the Tate Modern with a multimillion-dollar expansion and renovation. The museum is currently constructing the Addition 3, a museum dedicated to the culture and history of Eastern Art, and the Addition 4, a museum devoted to the art of the Middle East. The Addition 3, which is slated to open in the spring of 2020 and will feature more than 1,500 works from", "The next Biennial should take place in 2022, and the first in 2024. The 2020 event was held in West Bengal’s Kolkata, and the 2020 edition was held at the Guggenheim. The 2019 event was hosted in Mumbai.The 2019 event, which was organized by the University of California, Los Angeles (UCLA), faced a major setback when the museum was forced to cancel the event, dubbed “Art After Dark,” after a structural leak at the museum on December 23, 2019. The event, which was slated to kick off at 9 AM and run through January 21, 2020, was supposed to mark the end of its spring/summer residency program, which had been a part of the institution since 2010.The 2019 edition of Art After Dark—which featured ninety artists, including Chantal Akram, Mladen Anton, and Suzan-Lori Parks—was viewed as a resounding success. The museum picked up twenty-four artists for its residency program, including Olga Zurawska (Taj Mahal), Zoya Ushio (Taj Mahal), and Wangechi Mutu (New Delhi).\n\n\nThe Writers’ House, a new initiative run by the Southeast Asian", "The next Biennial should be up by the end of the year. The next edition of Artforum, featuring a curated list of twenty-eight artists, will be held at the newly renovated and expanded Art Dealer’s Warehouse on the Lower East Side from January 23 to February 12, 2020.The 2020 edition of the Venice Biennale, organized by the Italian brand Pasolini Lavorato, will be held at the Pisa Gallery in Venice from January 28 to January 31. The event will also feature a contemporary exhibition with nineteen and twenty art-world luminaries. “The new Barcelona Contemporary Art Awards will be held in January 2019, and the   Venice Architecture Biennale will take place in March 2020,” said Filippa Cattaneo, President of the Venice Biennale.“The theme of the 2020 edition of the Artforum is modernity, and the theme of this year’s Barcelona Contemporary Art Awards is sustainability.”  This year’s theme is modernity, which was chosen from a shortlist of eighteen artists, as well as from a list of ten artists selected by the public, which included Adrián Alves, Sofia Kose, and", "The next Biennial should take place in the autumn of 2020. The exhibition will be curated by Kim Kwon and will be presented by Hauser & Wirth.\n\n\nAmerican artist and educator Charles Wheatley, who sculpted colorful, multi-layered works that were both playful and affecting, has died at age ninety-five. In addition to his teaching, he was a prolific author, whose books include “The Art of Painting” (2013) and “Life After Painting” (2017). The artist has been awarded a total of thirty-eight awards.Born in New York City in 1940, Wheatley studied under Ralph Silver, who taught at the School of the Art Institute of Chicago, the University of Pennsylvania, and the Art of the Propagation of Ideas, a crowdfunded initiative that moved his work from Connecticut to New York in the 1960s. He often worked with acrylic paint, acrylics, and other cast-metal materials; found his influence in Minimalism and photography, which he saw as a “parallel universe of spectral light.” In the early ’60s, Wheatley discovered his own voice in a question and answer format in which he asked himself “What is the meaning", "The next Biennial should be held in 2021, the Art Newspaper reports. The 2020 edition, entitled 'Eyes on the Wind', is scheduled to take place in Shanghai and will be accompanied by a new work titled “Finished Third,” which will be on view for ten days only.“The last exhibition of the new series ‘Eyes on the Wind’ was in 2009, when the artist and curator took part in a project titled ‘Fragment,’” a tribute to the late French experimental artist Jean-Michel Basquiat. In the show, the artist, dressed as a 'tortoise,” transformed a three-dimensional pancake into a six-legged doll that moves around the stage and around the room. Other works in the exhibition include a sculpture by the artist in a man-made environment that breathes fire and casts shadows, and a virtual reality work that features two of Basquiat’s sculptures next to each other in a mirror.The 2019 Biennial was curated by Li Hongjun and Jeffrey Turner. The exhibition was curated by Yichang Li and Walter Rinder to commemorate the artist’s eighty-fifth birthday. \n\n\nThe École des", "The next Biennial should be held in 2020.\n\n\nThe Netherlands and the Netherlands Antilles have signed an agreement that will allow the Dutch government to take control of the Dutch-controlled Islands. Under the terms of the deal, Minneapolis-based artist Barbara Prodger and her husband, Harald Prodger, a Dutch politician, will be given the option of transferring ownership of the disputed islands to Dutch authorities.Under the terms of the arrangement, the Dutch government has the right to use any of the Islands for any purpose, including tourism and commercial purposes. It is expected that the transfer of ownership will take place sometime in the third quarter of 2020. The islands are technically in Dutch possession since the end of World War II. The issue has come up before in the past, when the Dutch government sold the islands in 1995 for $46 million. In 2011, the Islands Court of Justice ruled that the government had the legal right to use the Islands in order to prevent them from being used as a military base.In a statement issued by the Netherlands Ministry of Foreign Affairs on Monday, the country said: “The Netherlands and the Islands have signed an agreement that will see the Islands returned to the Netherlands. This is a historic first, and one that", "The next Biennial should take place in 2021.\n\n\nThe Museum of the Moving Image in London is launching an exhibition dedicated to the work of the late British architect Robert Irwin. The first show will focus on the early work of the British industrialist, whose work has been collected by the Getty and the Museum of Modern Art, and will feature work by eighty-one artists, including Shirley Cavanagh, the late French artist Jean-Luc Godard, and the late Australian sculptor Peter Hong.The show’s catalogue entry for the HBO television series Game Of Thrones recommends twenty-six artists for “Robert Irwin: Work, Passion, and Performance.” The entry will also offer a brief history of the exhibition and its curator, Satish Sharma, who will succeed Irwin on July 1.The biennial’s presentation of work by twenty-six British and American artists will be curated by James D. Smith, the British director of the Toronto Art Gallery, and Matthew Goodwin, the director of the Sotheby’s Contemporary Art Museum in New York. “I’m thrilled that the MCA has invited Robert Irwin to present this exhibition,” said the MCA’s director, David Ch", "The next Biennial should be held in the spring of 2020. \n\n\nNew York City’s Metropolitan Museum of Art has fired photographer Bruce Howell after an Instagram post in which Howell took a photograph of himself standing next to a gun with the caption, “This is how I feel when i shoot a gun. It’s a photograph that says i’m not afraid to take a risk.”The correction reads: “We made a mistake. We were not aware of the apology, and we apologize for the confusion this has caused. We were not aware of Bruce’s admission that this was a mistake, and we apologize for the misunderstanding. We apologize for the confusion this has caused. We apologize for the expectation that this was something that Bruce would do. Such a bold statement from a man who has worked so hard to distance himself from the museum for so long. The museum has removed this photograph from our collection, and Bruce has been invited to give a talk about his work at a later date. We took this photograph very seriously and had it professionally scanned by an expert to ensure the authenticity of the image. We regret the misunderstanding and hope that this clarifies things for you and for Bruce.”The Met says it", "The next Biennial should be on the tenth of June, 2019. The first event, “The Origins of Modern Art” (2019), was held at the same museum in 2022. The second exhibition, “Carlos de Almeida: The Second Man” (2019), was staged at the Los Angeles County Museum of Art in 2018. The third exhibition, “Tacita Dean: A Life of Art” (2019), was staged at the Los Angeles County Museum of Art in 2018, and “Carlos Goya: Theology of Light” (2019) was presented at the Museum of Contemporary Art Los Angeles in 2018.\n\n\nThe National Gallery of Art in Washington, DC, announced today that it has won the 2018 National Medal of Honor, which is named after the nation’s 400 greatest living collectors. The National Association of Collectors (NAC), which awards the honor annually, announced the winners on Monday, and the National Museum of Fine Arts in Boston on Wednesday. The National Council on the Arts (NCA), which has run the award for nearly sixty years, announced the ceremony.“This year’s National Medal of Honor winners reflect the extraordinary breadth of the collection at", "The next Biennial should take place in November 2021.  \n\n\nThe Museum of Fine Arts (MFA) in Boston has gained another member of its growing family of trustees, the Charles and Lucille King Family, who will serve as its new trustees in February 2021. The new members are Marlo Pascual, who will serve as chair of the board of trustees; Claudio Catellani, who will serve as chair of the board of trustees; Simone Red Star, who will replace Steven Salpeter as trustee of the Museum of Modern Art; and John Carlsson, who will become chair of the board of trustees.“We are honored to welcome the King Family to the MFA,” said MFA director Timothy Rub, who was instrumental in the acquisition of the King Family’s former home in Dorchester in 2012 for $30 million. “The acquisition of the King Family’s home and legacy will ensure that the Museum of Modern Art Boston continues to thrive and our collection continues to grow. The acquisition also provides additional funding for the museum’s ambitious plans to commission new works from renowned artists, including David H. Koch, Pablo Picasso, Clement Greenberg, and Edvard", "The next Biennial should be held in 2021, when a new exhibition of works by the Kama, a group of thirty-five artists known for their lively performances and intimate public shows\u0097called the Kama Art Center’s Kama Art School\u0097will open in the city. The theme of the 2020 Biennial will be “The Future Is Now.”The fifty-third edition of the Biennial will be held in 2022. The theme of the twenty-third and twenty-fourth editions will be “Art for Artists and Art for the People.” The 2018 edition, titled “The Renaissance Artists,” was staged at the Prada-sponsored Exhibition Room in Milan, and the 2019 edition, “The Modern Painters,” will be held at the Venetian.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles has received a gift of two magnificent works by artist-in-residence Édouard Vuillard from the James A. Farley Collection. The works, which were donated to the institution by a group of collectors led by James A. Farley Jr., are both on display in a new group exhibition titled “Vuillard and his Friends: A", "The next Biennial should be an exercise not only in collaboration, but an affirmation of the power of art to make a difference. We invite all to join us in this effort.”The exhibition will also include a short story by Kate McKinnon and an installation by the artist Kiki Smith. \"We are so proud to stand together as artists to support this year’s theme, ‘posthumanity,’ in the first Biennial, a theme that is at the heart of our collective art, and in the history of the Art.”The Biennial, which will take place at the National Gallery in London, will be organized as a “posthuman” museum, a “posthuman” exhibition, and a “posthuman” event. The exhibition and the exhibition will be organized around themes of the biennial, such as “posthuman” as well as life and death, the environment, and the built environment, and will utilize contemporary art and experimental media in order to explore “posthuman” concepts, “posthuman ethics,” and “posthuman” societies.In order to participate in this year’s Biennial, one must own an", "The next Biennial should be held in the spring of 2020. The 2019 edition, titled Art and Revolution, was held at the Ricoh the same year as the 2028 exhibition, titled “Future Present.” The event will include a residency program and a project-based platform for art-historical research. The 2019 edition of the show, titled “Imagination in the Age of Empire” featured work by twenty-four artists.“The new Biennial should, in my view, be a space for the exchange of ideas, activities, exhibitions, and exhibitions,” Art and Revolution exhibition organizer theaustin khan. “We believe that the future of the Art and Revolution exhibition must be the product of a reflection of the current ethos of the twenty-first century.”Previously held in the Emirati city of Sharjah, the 2019 exhibition featured work by twenty-four artists, including Oberoi Akram, Ahmed Awwad, Ahmed Anwar, Hassan Rowani, Nima Anwar, and Aya Alireza.The 2019-2020 event will be hosted by Art Dubai, Art Dubai, and Art Dubai Gallery, and will be co-organized by L", "The next Biennial should bring together artists who are currently in the midst of their exhibitions, and will examine the relationship between art and social change through a range of interdisciplinary platforms, including the exhibition, the exhibition, and the annual biennial. This year’s biennial will feature a new digital platform in partnership with the Seattle Art Museum (SAM), an all-new TONY Cooper–designed installation, a new film series, and a number of new performances. The first iteration of the biennial will open in the fall of 2020 and will be followed by an exhibition that will run in the spring of 2021.The biennial will also include a new edition of the KIN’S Top Ten program, which will present twenty-six artists. The series will include works by artists whose work is currently on display at the biennial, and will feature new works curated by the designers and curated by the directors. The biennial will also include a special lecture series that will focus on the art of community engagement, a panel discussion featuring the artists featured in the exhibition, and a discussion of the themes and the work in the exhibition.The exhibition will be curated by the San Francisco-based, New York–based artist and curator Polly Staple, whose practice", "The next Biennial should take place in Lanzarote in the fall of 2020 and will be hosted by the Museo de Arte Contemporáneo de Madrid and the Museo de Arte Contemporáneo de Barcelona. \n\n\nThe Institute of Contemporary Arts (ICA) in Moscow has been awarded a five-year contract by the State Fund for State Arts (SBF), the successor of the state-owned Rosatom, to develop a new interdisciplinary exhibition program at the institute. The project will be led by Valentina Malyshev, the director of the Russian Academy of Arts, and will be led by the deputy director of the Institute of Contemporary Arts, Tor Bonsu.“We are delighted that our work will be given a new meaning in 2018 as we embark on a new phase of the project,” said Piotr Margher, the president of the State Fund. The new initiative will focus on the reconstruction and modernization of museums, which the institute has been working on for twenty years.The project will include the establishment of a new budget for the artistic initiative’s first year, and the development of the exhibition space, the Institute of Contemporary Arts, which is currently being remodeled and", "The next Biennial should be held at the Institute in the coming months. \n\n\nThe Los Angeles County Museum of Art (LACMA) has launched a new digital initiative to support the Los Angeles County Museum of Art (LACMA) through a combination of grants and donations. The new initiative, Digital Advocacy, came about after LACMA board president Maria Bocchini explained that she hoped the new platform would replace the museum’s current format, which is led by director Preston Barron, and the new director would oversee its programming. “We are a nonprofit institution, and we can’t run a museum without patronage,” Bocchini told the Los Angeles Times. “Paid engagements are a powerful way to support critically endangered artists and raise important funds to support important mission projects.”Bocchini noted that LACMA’s current digital platform,  which has a staff of just under fifty and operates on a budget of $8.5 million, has already seen a significant increase in donations from individuals. The platform will receive an additional $2 million from the California Community Foundation, which is providing $1 million through its California Legacy Fund, and will be launched with the ", "The next Biennial should take place at the Museum of Contemporary Art (MoCA) in Chicago in 2022. The museum would then host the fifty-seventh edition of the exhibition, called the Biennial of Modern Art, which would take place between 2020 and 2021; and the fifteenth International Biennial of American Art, which would take place in the United States from 2021 to 2024. The twenty-fourth Biennial of American Art would also take place in the United States.\n\n\nThe Society of American Archival Art (SAFA) has released guidelines for the handling of artworks that have been digitized. The publication includes a number of tips on how to avoid problems caused by digital manipulation and on how to preserve works in digital retrieval.“The digital realm has fundamentally altered how we think about and access the world,” said Craig Anderson, the society’s director. “We welcome the digital tools that will allow us to think of, store, and study the art of the digital age. However, the safety and security of collectors, institutions, and users is of paramount importance.”The publication also outlines steps that collectors can take to protect their artworks in digital retrieval, including designing an authentication strategy that properly protects the digital", "The next Biennial should address the question of how such a large-scale exhibition can be carried out and organized in an urban setting and should highlight the work of emerging and established artists.”In a 2017 interview with Artforum, the show’s director, Enrico Barbera, described the forthcoming exhibition, “in an unmistakably Art Deco, contemporary setting.” The exhibition, titled “Microscope,” will be inaugurated by a new work by Luis Ortiz, “Grave of the Spanish Civil War” (2019), which will be on view in the exhibition’s first group show, “Microscope,” at the Palais de Tokyo in Paris. This work, part of a series, “Confrontations.” (2019), will be followed by a show of works by David Hockney, “The Untouchables: A Retrospective,” at the Museum of Modern Art, in New York, in 2020.\n\n\nThe National Gallery of Art in Washington, DC, has launched a new digital platform that will allow visitors to see and purchase works by local, national, and international artists. The platform, called Artwalk, will", "The next Biennial should take place in 2021, with a break of fourteen years between the opening and the second edition. The first Biennial, held in 2003–2006, was hosted by the Australian National University and the Melbourne Institute of Contemporary Arts, and the current Biennial is organized by the Laboratoire des Arts et Lettres in Paris.In a speech delivered at the event, Hayti said: “If we are to continue to evolve as a species, as an advanced civilization, as a civilization which invents in its cradle, then we need a new kind of society, new ways of living and creating. That means a new kind of mathematics, a new kind of music…”\n\n\nThe Metropolitan Museum of Art announced today that it has received a gift of more than 1,000 works by twenty-eight artists. The museum initially received the works from the Met in the form of a collection card in 2017, and three years later the collection added more than 1,300 works to its collection. The Met is also planning to create a new museum at the corner of Twenty-Third Street and Fifth Avenue in Manhattan that will house the works of twenty-four artists.The title sequence of the Met’s new collection is “", "The next Biennial should focus on the design of a new Capital Arts Centre in the city, and should also hope to attract more visitors to the city, and to promote the city as a cultural and historical destination. This would allow the Milan-based artist-run arts space ARTflo to become a capital of arts and culture and would also provide a source of income for the artist for whom ARTflo provides a vital platform.”The event will take place at the Museo de Arte Contemporanea, in the city of Milan, on November 7–November 9, 2020.\n\n\nThe Los Angeles County Museum of Art (LACMA) has added its voice to the growing movement to have the Metropolitan Museum of Art in New York City removed from the map. In a letter to the public, LACMA board chair Julia Levy and board president David Ginsberg wrote: “Since LACMA’s founding in 1976, the Met has demonstrated a history of exclusion, exclusionary thinking, and exclusionary actions that undermine the very purpose of LACMA. We ask that you consider LACMA’s case as a community and act in solidarity with the rest of the region and the nation.”Last month, L", "The next Biennial should be held in 2021.\n\n\nThe Metropolitan Museum of Art, the Museum of Modern Art, the Whitney Museum of American Art, and the Walker Art Center have announced that they are now negotiating with the Chinese government to open new exhibition spaces in the country\u0097at least three of them have already been granted permission to establish a science and technology center in the country.China has committed to supporting roughly two hundred cultural institutions in the country, which is home to the world’s largest collection of ancient Chinese art, and has been supportive of art projects and arts operations in the country, including many of the Museum of Modern Art’s collaborations with the National Museum of China. The Museum of Modern Art has also been collaborating with the museum of modern art, the Smithsonian American Art Museum, and the Smithsonian Chinese Art Museum in China.“The museums have been working hard to develop partnerships with local governments, and we will continue to do so in the coming months,” said William D. Liu, the museum’s director. “We are hopeful that with the new exhibition space, and the development of the museums’ expertise and knowledge of Chinese culture, the museums can be recognized as a global force in", "The next Biennial should present the work of the student artists who are participating in the first series as well as the works of the young artists who were commissioned by the faculty to work at the museum for a short period of time. The exhibition should take place at least ten years from now. He said that the exhibition should aim to reflect on the legacy of the institution as a comprehensive cultural center and should be a reflection of the international city of Barcelona. “We have decided to retain the structure of the exhibition, but to rearrange the programme and the programming. This is a historic opportunity for us, for the artists who participated in the first series and who will continue to do so in the future, and it is also an opportunity to build a more international network of fellow Catalans.”The next edition of the Biennale will be held at the Museo del Prado in Madrid from March 21 to March 27, 2020 and will be co-organized by the university and the Mejlal Museum in Barcelona. It will consist of sixty performances and twelve exhibitions.\n\n\nThe City of Sydney has commissioned artist and philanthropist MacKenzie King to create a new works of art to mark the centenary of the United States’ entry into World War", "The next Biennial should take place in New York in 2023. More information about the exhibition can be found at http://www.craigh.com/arts/february/\n\nThe California Arts and Artists (CA&A), the California Museum of Contemporary Art (CAMCA), and the San Francisco Museum of Modern Art have announced they will collaborate on a major renovation of their iconic building. The project, which will also include the construction of a new library, will raise the state’s profile internationally and will engage with the city’s diverse communities. The redevelopment will include the construction of an arts and culture hub that will draw visitors to California’s largest city.“The California Arts and Artists (CA&A) believes that city-building is central to the future success of California’s arts and culture ecosystem: Improving access to the arts for everyone; strengthening the local, state, and federal role of arts in California; and better reflecting the changing global landscape,” said Brad Walker, chair of the group. The project, titled San Francisco: A Vision for Art, will be led by architect and urban designer Erick Almena and will include the renovation of the", "The next Biennial should focus on “the spatial, temporal, and materiality of creativity.” It should include the work of seventy-eight artists and include a selection of works that were created during the first Biennial. The exhibition will also be hosted by the Centre Paris’s Institute for Contemporary Art in the city of Paris and the Institut d’Arles de l’Amitián in the city of Arles-de-France. Inaugurating the exhibition will be a documentary film, “The Secret Life of Art” (1993), that will follow the artists through their periods of experimentation, and a drama (2019) about a woman who becomes obsessed with the life and survival of a certain artist and his work. The full list of participating artists can be found here.\n\n\nThe Black Decade International, an annual event that aims to raise awareness of issues of social justice, has announced that it will postpone its 2019 edition, which was set to take place at the Black Rock Desert Museum in Nevada, until December. Originally slated to run from March 12 to March 13, the event was moved because of the Covid-19 pandemic.The event, which aims to", "The next Biennial should focus on “The New Maya,” a selection of contemporary Maya art from the   late 15th century BC to the late 20th century AD. The exhibition will present works by fourteen artists, including Juana Bonifacio, Mabel Cruz, and Norberto Rivera.\n\n\nThe König-Bosch-Bauhaus Museum in Frankfurt is planning to move its artworks and events to Münster, Germany, in 2019. Although the institution hasn’t announced any plans to leave the city, the move is a step in the right direction for artists and their projects.Münster has been home to some seventy artworks and creative projects over the last fifteen years. Among the works that were added to the collection this year was David H. Koch’s The Illusion of Things, which is currently on display in “The Museum of Modern Art” in New York; Michelangelo’s David sojourns The Virgin Spring, whose gendered imagery and ethnographical approach parallels that of Mark Rothko, who designed the installation for the museum in 2010; and Luigi Bocconi’s The Window, a series of drawings by the Italian artist Lina Rosati that", "The next Biennial should be held in the spring of 2022, according to the organizers’ plan.  The first edition of the exhibition, “History of Modern Art,” was held at the Museum of Modern Art in New York in 2014 and was awarded the Grand Prize at the Fifty-Sixth Venice Biennale, hosted by St. Petersburg, in 2016. Its second edition, “Art and Architecture in the Twentieth Century” was held at the Museum of Modern Art in Boston in 2019 and won the Grand Prize at the Fifty-Seventh Venice Biennale in 2016.While the board and the artists who negotiated the contract for the biennial were not informed of the decision to cancel the exhibition until after it had opened in October, the organizers’ decision to cancel the exhibition came as a surprise to them. “They were not aware of the controversy that was brewing around the term,” Roberta Smith, the executive director of the San Francisco Art Institute told the Art Newspaper. “It was just a shocking move. They have been trying to push back the exhibition and the exhibition, and they are now trying to push back the institution.”The board of trustees for", "The next Biennial should focus on the idea that culture can be both a platform and a means to a certain end,” the organizers wrote. “The next Biennial should focus on the life and death of a work. The next Biennial should be a way of life. The next Biennial should be a way of life. The next Biennial should focus on a relationship between work and meaning, on the possibility of a life after work and on the possibility of a life before work. The next Biennial should be a way of life. The next Biennial should be a way of life. The next Biennial should be a way of life.”The forthcoming 2019 edition of the Museum Biennale will be hosted by the Bergen Maastricht (BMA), a Danish-born curator who currently serves as director of the Museum of Modern Art Berlin. In a statement, the BMA said: “We are delighted to present the next edition of the Biennale at the BMA, the best international museum in the world. We have worked hard, over the last two years, to present a show of the works of our curators in the hope that they would represent the best of contemporary art. Last year ‘", "The next Biennial should be held in 2021 and will be organized as follows: KARA/LASALLE will present the first exhibition of new works in the city of Buenos Aires, and will focus on the construction of the city, its cultural and commercial heritage, the exhibition, the exhibition, and its urban environment.“The city of Buenos Aires is a melting pot of cultures, histories, languages, languages and cultures from different parts of the world. The exhibition ‘ARTICLES: Buenos Aires’ will bring together the finest contemporary artists from Argentina and Peru in order to present them in a real city,” said the artist. KARA/LASALLE was founded in 2016 by Sara and Norberto Ceuta as a platform for contemporary art in the city of Buenos Aires. It was cofounded by Diego Grondona and Lorenzo Townshend. The project was given an international exhibition at the Contemporary Art Fair Buenos Aires in 2016 and the first Biennial in 2018.\n\n\nNew York’s Metropolitan Museum of Art has hired Kate Martin, a Christopher Wool’s protégé, to lead its $300 million, 12,000-work, expansion of the Metropolitan Museum of", "The next Biennial should bring together sixty international artists and have them perform and create works of contemporary art.”\n\n\n\n\n\nArt and the Future: Art and the Future of Art, Raleigh, NC: June 2018 (2014) (2014)\n\nThe New York–based, nonprofit, and museum-based, artist-run nonprofit space Art and the Future presented its twenty-sixth edition in Raleigh, North Carolina, this past March. The event, which took place on the banks of the Blue Ridge, showcased the work of more than three hundred artists.The festival featured works by seventy-eight artists, including Anish Kapoor (Nairobi), Jasmine Almina (New York), Cécile B. (New York), Jodi Garrido (New York), Rosie Mihalik (New York), and Yinka Shonibare (New York). The full list can be found on the nonprofit’s website.Signing off the event were Emily Pape, Artforum’s senior curator of modern and contemporary art, who said: “Fifteen years to the day, we are proud to present the fifty-fifth edition of Art and the Future at Raleigh�", "The next Biennial should take place in 2022 and the 2019 edition will be staged at the El Dezar Biennial in 2022. The 2021 and 2010 editions were held at the Alhejal Cultural Center in the capital, Riyadh. The museum was founded in 1922 by Prince Fahd and his wife, Heera, and the founding aim of the institution was to present the works of the Saudi Arabian artist Hisham al-Hashemi.Prior to joining the Saudi Royal Academy of Arts (RAA), Al-Hashemi was a lecturer at the prestigious Saudi Academy of Arts in Riyadh. In 2000, the festival organized by the prince was awarded the Saudi Arabian Order of Crescent. Since its inception, the festival has attracted many cultural figures and has been a platform for artists from a number of countries, including Egypt, Lebanon, Bahrain, and Tajikistan. Al-Hashemi’s work, which includes works on paper, paintings, and drawings, is an example of his practice of using art as a tool to raise awareness of social and environmental issues. “The royal family has supported the Royal Academy of Arts for more than thirty years, giving the artist and academic a platform to make their voices heard in a country where", "The next Biennial should take place in 2020, according to the organizers. The festival will be held in the city of Biarritz, France. It will also incorporate a program of exhibitions, lectures, talks, and performances. In the meantime, artists are working together to help raise funds for the emergency relief efforts. Among the organizations working with Paltrow, whose father, Paul, is a leading supporter of the French Resistance, is the organization Pater Noster, which has organized art exhibitions and other events in support of artists in the country. The organization also recently held a fundraiser for artists at a restaurant in Paris, where the artist was staying. The event raised more than $20,000 for the French Resistance’s Pineapple Campaign. In support of artists, the National Federation of Industrial Designers in the United Kingdom has also launched Away from the Storm, a fund that will award artists between $5,000 and $25,000. Organizers say that the fund will go to one artist and will be delivered by an artist. The fund was launched by an anonymous donor in August. Michael Thraves, director of the Tate, said: “As a museum", "The next Biennial should also investigate new forms of production in the art world, with a particular interest in Germany and New York. The 2019 edition hosted an eclectic mix of international artists, including Julia Salle, Leonardo DiCaprio, and the British artist Susan Phillips. The exhibition is currently on view at the Museo de Arte Contemporáneo Artística Brasil.\n\n\nThe Mali–born, Los Angeles–based artist Rashid Johnson has been selected as the 2020 recipient of the National Arts Award. Dubbed the `National Dreamer, Rashid Johnson represents an artistic and politically inspired perspective that is rooted in empathy, the body, and the body of the artist, and is informed by a commitment to human rights and environmental justice. Johnson will receive $100,000 for the project, which was established in 2017 as part of the National Human Rights Campaign, and will be presented with the National Medal of Honor in the city of Honolulu, Hawaii, in February.The National Foundation for Contemporary Art (NFA) announced its nominees for the 2020 National Arts Award. Johnson was chosen as the recipient of the honor in honor of his years of work in the art world. Johnson�", "The next Biennial should aim to: “advance drawing” and “introduce internationally acclaimed artists” and focus on how drawing helps to create a “universal language for thinking about art and design” and how the space will be “dedicated to drawing” and “dedicated to drawing from the American South.” The 2019 edition of the biennial will take place at the Skowhegan Arts Center in Salem, Massachusetts.\n\n\nSidney and Lois DeSousa are the proud owners of a Legacy of Art. Located in the historic Doris Duke Museum on the University of North Carolina at Greensboro’s campus, the specially commissioned, film-set piece will be mounted in the museum’s current exhibition “Art and Memory: The Legacy of Sidney and Lois DeSousa” for a twenty-eight-minute film by filmmaker Austin Moore titled “Hear the Wind Sing” in the fall of 2020.The biennial will comprise twenty exhibitions, with the first exhibition set to open at the museum in 2020 and the last in 2021. The event’s programming will also incorporate performances, readings, lectures, screenings, and other events during the", "The next Biennial should be organized into a series of exhibitions that will review the history of contemporary art in the US over the last twenty years. The biennial’s director, Elsa Müller, told the Art Newspaper that the series would aim to “speak to the current moment with the most contemporary art and how art today relates to the past.”\n\nThe Foundation for Contemporary Art (FCA), Chicago, announced today that its board of directors has unanimously endorsed the organization’s new three-year biennial, “HELP US VISIT: THE BIRTH OF ANTI-POP,” which will run from September 5 to September 7, 2019. The biennial will also include an encore performance, which will be “POP 2.0,” in partnership with the United States Anti-Defamation League (U.S.A.ID), in commemoration of the seventy-fifth anniversary of the Holocaust.Founded in 1989 in the West Adams neighborhood of Chicago, the charity has served as a platform for the work of artists and writers in the city, including Maren Albers, Colson Christie, and Svetlana Cervino; hosted notable exhibitions such as �", "The next Biennial should take place in the city’s most well-known cultural space, the Art Gallery of Ontario (AGO), in 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in San Francisco has announced that it is planning to shutter its doors on March 31, 2020, and re-open with a new group of galleries that will present works by artists whose work was selected for the 2020 Whitney Biennial. The new exhibition, “Theater of Operations: The Gulf Wars” will be curated by Kuki Zhang and will inaugurate the museum’s new location in San Francisco’s Mission District, which was recently transformed by the $2 billion redevelopment of the city’s waterfront. The museum also plans to move the institution’s collection and exhibit space to a new space in the city, and it will inaugurate the new Public Theater at 608 Folsom Street with a new show celebrating the work of the late American artist Lonnie R. Shepard.“We are honored to be working with the people of San Francisco to create an exhibition that celebrates the legacy of these artists and will continue to present work by contemporary artists in line with MoCA’s mission,” said museum", "The next Biennial should be held in Spring 2021. It is slated for a March 2020 opening at the Brooklyn Museum. The next edition will be held in the Americas’s central city of Santa Fe, New Mexico, in April 2021.In an interview with the New York Times in February 2018, the artist said: “I have always considered the works I’ve done in the last decade to be my greatest artistic achievements.”\n\n\nThe National Geographic Society (NGS) in Washington, DC, has appointed Dr. Vinnie Damiani as its next executive director. Damiani comes to the organization from the Smithsonian’s National Museum of Natural History, where she has served as chief curator since 2014. She succeeds Carolyn Levey, who retired in February 2019 after a decade at the helm of the organization.“Vinnie is a seasoned leader who has built a strong and distinguished career at the National Geographic Society,” said Linda Rosenthal, the president and CEO of the National Geographic Society. “Her long-term vision for the Smithsonian aligns with the themes and mission of the organization and plays well with our audience. Her ability to build a strong, loyal, and dedicated staff and a vibrant and innovative program that", "The next Biennial should be held in 2022, and the first in 2023. The next edition of the Noguchi-Girardi, which will take place at the Fair in New York in 2021, will be held in 2021. The New Orleans triennial will take up the theme \"Fashion and the Body” in 2022 and will be held in 2024. The United Kingdom’s National Fashion and Design Biennial will be held at the National Museum of Fashion in London in 2022 and 2021, and will take place in 2022. The fourth edition of the Oxford Art Festival, which will take place in September 2022, will also take place at the museum. Among the other shows scheduled to reopen in the United States are the New York Museum of Art, the Metropolitan Museum of Art, and the Whitney Museum of American Art. \n\n\nThe J. Paul Getty Trust in Los Angeles announced today that it will restore the Getty Villa, a former Tuskegee Airmen\u0097the first black men to serve in the Marine Corps and the first to fly the flag of the United States in combat\u0097as part of an initiative to commemorate the milestone anniversary of the Getty’s founding. The project is part of", "The next Biennial should be a celebration of the work of the last twenty years, especially of the last eleven years. We need to think about the future, how it relates to the present, and why we create. To move forward. To create the future. We will work together to move forward, to realize our vision, and to create the future. We are here today, we are shaping the future, and we will shape the future with our actions. We are creating a better future for our communities, though we don’t always agree with the decisions being made. We are listening to you, and we are changing. But we are not going backward. We are moving forward.”Ms. Goffman said: “I’m thrilled to be returning to the Biennial to celebrate the twenty-fifth year of the biennial and to present a new exhibition that examines the work of artists of every era and with ever-changing trends. The biennial is a sacred site and one of the most important cultural resources of our time. I’m looking forward to working with you and the Los Angeles County Department of Arts and Culture (LACADA), and to working with the rest of the world, to create a more", "The next Biennial should focus on the politics of art and the exhibition as a whole. “I would like to see a more concerted effort by the organizers to show the political and social impact of the exhibition,” said Roberto Barbera, the founder of the local arts initiative Preciosa and the country’s director of the biennale. Barbera has since received a letter from the congress of cultural personalities, signed by twenty-eight cultural experts, saying that the exhibition should be shifted to another year.In response to the criticism, Andrea Marini, the secretary general of the congress, told the Art Newspaper: “We are deeply concerned by the letter from the cultural experts who demand that in future editions of the Venice Biennale, when the exhibition will be more politically charged, the work of the biennial will be more widely recognized and the collection of the biennial in future editions of the exhibition will be more representative of the world’s art and art history.” The changes scheduled for the exhibition are as follows:The exhibition will be staged at the Palazzo delle Papesco, in Venice, in the city’s old Venetian palace, in March 2020. The event will be hosted", "The next Biennial should be held in 2022. The next edition, described as “disruptive,” will take place in a city that is currently home to more than 5,000,000 people and will be curated by writer and curator Zoë Quinn.\n\n\nThe New York City Department of Cultural Affairs (DCLA) announced today that it received a $120 million donation from the Sargent-Charles-Alexander Collection (SCA), one of the largest private holdings of the artist’s work in the United States. The donation includes the first major restoration project of the work in more than sixty years, which was completed in 2018. The work, titled “The Secret Life of Music: Historical Experiences of Music,” is a major milestone in the artist’s eighty-five-year career, and the first major work to be restored by the curator and educator C.S. Gann. New York’s Panorama Gallery, which was established in 1969 by artist and collector Thomas Gann, said the gift is “a great honor to be able to present The Secret Life of Music at a pivotal moment in the artist’s history.”The gift was made in recognition of the work", "The next Biennial should focus on the history of the city, “the island, and its people,” and will establish a list of people who have donated to the event. If the Biennial is successful in raising funds for a trip to the island, the artists may choose to leave the island for other locations. “We are inspired by the resilience of the people of the Solomon Islands,” said Nancy Eastman, director of the W. K. Kellogg Foundation, which has supported the museum since the 1980s. “By honoring the memory of the late artist and their contributions to American art, the Biennial will be a platform for the international exchange of art and ideas between the United States and the Solomon Islands.”\n\n\nThe Museum of Arts and Design (MAD) in New York is planning to close its doors permanently in 2019 after an eight-year run. The closing will be one hundred years of exhibitions and of the institution’s collection, which comprises more than 3,000 works by artists, including Pierre-Auguste Renoir (1908–1969), Anne Imhof (1899–1973), and Pierre-Auguste Aumont (1903–1973).“The museum", "The next Biennial should take place in 2019.\n\n“The Biennial will now be the Museum’s flagship exhibition,” the Fondazione Bicicletti, said in a statement. The exhibition, which is currently on view until February 15, will include works from the collection of Florence’s Graziano Cittarini and will highlight the work of contemporary artists whose works have been previously exhibited in the Italian city. The Bicicletti will also stage a retrospective of the work of Kazuo Kondo, which is currently on view until March 14. As the exhibition commemorates the centenary of the birth of artist Giacomo Berola, the museum will also present a collection of drawings, ceramics, prints, paintings, and photographs that were created by the artist.In recognition of his achievements, the City of Florence awarded the artist the grand prize, the Pantale di Bicicletti, in 2015. The prize is awarded in Rome each year by the House of Ballarat, the Italian institution of arts, culture, and society. Berola’s work, which is organized as a series of giant sculptures, is set within a vast urban landscape that incorporates Turin, Venice", "The next Biennial should take place on the island of Grenada in the Caribbean, in December 2019. The October 2019 edition of the Biennial, entitled Javadene, was canceled due to Covid-19. The November 2019 edition of the Biennial will reopen with a retrospective of the artist's work, The Birth of a Nation, at the Museum of Fine Arts, Boston.The new exhibition, titled On the Waterfront, was conceived as an extension of the exhibition The Waterfront in 2018. The exhibition will present the work of thirty artists, including Edward Fortier, Anselm Kiefer, and James Turrell, and will run for twenty weeks.\n\n\nThe Uffizi Museum in Florence has expressed its desire to create new partnerships with local local authorities in the city to facilitate the transport of works and antiquities between the institution and the nearby Florence Cathedral and has hired architect Giorgio Chiesa to help meet this challenge. Chiesa will design a new, 300-year-old portico at the museum, which was built in 1937 by Italian architect Arrigo Merz. “In designing the Uffizi, Gior", "The next Biennial should mark the centenary of the outbreak of the First World War. The exhibition will include the work of seventy-eight artists and will run from November 8 to November 11. For the past twenty-five years, the pavilion has been hosting exhibitions dedicated to the work of Arnold Bode, Henri Béton, Henri-Marie Boisjoly, Hans-Georg Gadamer, Jean-Michel Basquiat, and Ruba Fajar. The biennial was launched by Jean-Marie de Montlaur, who established the pavilion in 1999 as a meeting place for art-world professionals. The institution was renamed in honor of the French painter, sculptor, and creator many years later.\n\n\nThe eleventh edition of the Berlin Biennale, curated by an intergenerational group of South American curators comprising María Berrío, João Joad, and Agustín Pérez, has released the final list of artists who will be featured in the event’s twenty-second edition, “Berlin Desilu,” which will take place at the Hermitage Museum in Munich from March 15 to March 19. The exhibition will also present its first", "The next Biennial should be held at the school in 2019.\n\n\nThe Swiss company Galerie Gerhard Richter has appointed Yeli Estévez as the new artistic director of its global art venture. Estévez previously worked as a curator at the Greek and Italian museums, the Antwerp Museum and the Museum of Modern Art, and the Punta della Dogana in Venice. He will take up the reins at the end of this year, and will be responsible for a series of exhibitions and collaborations that will focus on contemporary art.“I’ve wanted to lead a global program for some time, but never had the opportunity to be director of an institution like the Pérez Museum, which has such an important role in the development of modern art, culture, and in the preservation of culture,” said Estévez. “Gerhard Richter’s unique vision as a curator, historian, and educator has always been at the forefront of my mind, so I’m honored to work in this capacity with his extensive experience. Gerhard’s legacy of working with and for the Pérez Museum is a source of inspiration to me, and I will continue to work with him in my mission", "The next Biennial should be held in the coming six months. It will be a time for the exhibition of the work of an outstanding artist from the next generation, who will be selected using a selection of biennial entries by the same artist, and will take place in the basement of the historic Prado Palace. The participant will be selected from a shortlist of three artists who were selected from the best biennial entries.The entry was selected by the jurying committee chaired by Nuno Pérez-Perez, who is a professor of art at the University of the Andes in Bogotá and is a member of the collection of the museum. The exhibition will open with a selection of the entries by the artist in the exhibition of the work of the same artist, the first solo exhibition devoted to the work of the same artist in the history of the institution.The entry for the Biennial of the Southern Light was published on August 7, 2019, and won the prestigious Prix d’Art Contemporain (PACE). Since the entry was first published in a contemporary art magazine, Biennial 1, in 2013, it has been voted the most beautiful work by an artist in the biennial. \n\n\nThe Museum of Modern Art", "The next Biennial should also take place in the autumn of 2022. However, the announcement of the demise of the exhibition coincided with the announcement earlier this year of a new multi-award-winning exhibition of work by American artists, James Turrell and Henry Luce, which was staged in the United Kingdom, New York, and Paris.\n\n\nThe Tudorf-Derrida Museum in London has received a donation of more than four hundred manuscripts, photographs, posters, and other artifacts from the late British artist and the visionary political theorist Andre Gide. The donation includes works dating back to 1947 and includes twenty-six manuscripts in three languages. Among the manuscripts are three by Gide with the help of his son, Sir Richard, and one in which the two men collaborated on a sketch depicting the future.The museum is also expecting to reopen in 2020. While the institution will remain closed until at least the end of the year, it will reopen with a new exhibition, “The Duke and Duchess of Cambridge,” scheduled to open on August 29. The new exhibition will include photographs, prints, posters, and other works by Gide and his son, Sir Robert. The son will also stage a solo exhibition of works by the late British artist and", "The next Biennial should be held in the spring of 2021.\n\n\nThe National Gallery in London is planning to close down for a period of eighteen months—during which time the National Museum of Art will shutter. The institution will also begin a major renovation of its grounds, with the aim of increasing the volume of exhibitions and the exhibition space.According to the Times, the museum is currently facing a £70 million deficit. The institution was forced to make a $46 million budget reduction in 2017 and is currently seeking additional funding to continue operating at a higher volume. Since the museum’s last exhibition, “Aero,” was released on November 14, 2018, it has been attempting to eliminate the need for the public to visit as many of its historic buildings as possible. The institution also plans to open a new site in the grounds, which will be opened by the Museum of London Docklands, in the spring of 2021.The National Galleries of Scotland (NGA), the National Museum of Scotland, National Museum of Scotland, the National Museum of Scotland, the National Museum of Women in the Arts, and the National Museum of Scotland were all “pressed into service” by the financial crisis. The museums have since been able to draw", "The next Biennial should take place in 2021. \n\n\nAs Chicago continues to reel from the consequences of a devastating fire that raged in a garage above the city’s McCormick Place for more than three weeks, the city council is drafting a $50 billion emergency plan that will help mitigate the city’s escalating health crisis. \n\nDubbed the Emergency Fire Prevention and Extraction (EFE) strategy, the $50 billion plan—which was released on Wednesday and is expected to be implemented by the end of the year—encourages the use of innovative and expensive solutions to combat arson, smoke damage, and the spread of Covid-19, such as building smoke stacks to capture combustible materials, retrofitting existing buildings, and constructing fire barriers near public transportation, schools, and other outdoor recreation areas.“This is not a time to panic,” said Councilman Jimmy Van Bramer, chair of the city council’s public works and infrastructure committee. “EFE provides immediate relief to the most vulnerable, securing crucial materials and accelerating the construction of our emergency fire walls and fire escapes. We are discussing how to incorporate the elements of this strategy into our long-term strategy for fighting arson and smoke damage,", "The next Biennial should focus on “the richness of the human experience,” and will invite cultural, spiritual, and historical experts in the city to participate. The 2019 edition will take place in the city’s Grand Salon, which is currently undergoing a major renovation. According to the New York Times, the venue will be renovated to host twenty-one exhibitions and will be equipped with a digital exhibition space and an auditorium.  In a written statement, the Biennial said: “The work of the past fifty years has been to shape the design of the Salon, not to redesign it, but to include an ever-changing and interwoven collection of artifacts that are representative of the diverse histories and cultures of Europe, North America, and South America. The forthcoming exhibition will celebrate that history and rethink what the future may hold for New York’s Salon.”\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Ron Gorchov as its next chief curator. He succeeds David McAllister, who retired last week after seventeen years at the institution, and will assume his post in January 2020. Gorchov joins MoMA from the Bronx, where he has served as the museum�", "The next Biennial should take place between September 6 and September 10, 2020.\n\n\nThe Planck Institute for Chemical Physics in Germany and the University of Heidelberg announced on Tuesday that they have established a new partnership to collaborate on research and sowing efforts. The partnership, which is supported by the Faculty of Agriculture of the Heidelberg University, is in the process of entering a critical phase. The Heidelberg-based institution will begin producing seeds from hybrid holly that will be genetically identical to the species, but one has the appearance of a plant and will be cultivated as a greenhouse in a bioreactor.The institute will also begin sowing seeds from the newly created Japanese yamato, which was named after the university and is due to be deployed in July. The plant is a hybrid of Japanese and European wild yams. The University of Heidelberg will donate 140,000 seeds for the project to the Heidelberg-based foundation.The partnership between the institute and the Heidelberg University was announced in a joint statement by the institute and the Heidelberg city council. The announcement follows the move of the Japanese government to start dismantling its greenhouse gas emissions, which were blamed for trapping more than 2.3 trillion metric tons of greenhouse", "The next Biennial should be staged in 2020.  Bishkek, who has been working in the Sudanese diaspora for more than thirty years, said: “I am deeply honored to be joining the Biennial of Arts in New York City in 2020 as I continue to shape the Art of the Sudanese People (ASP) into a new and exciting form of contemporary art. It is an honor to receive the support of the ASP’s board of trustees and to become a part of ASP’s mission that is to create world classes art in the Sudanese diaspora.”In the same way that the exhibition “Holistic Design” opened the first exhibition of ASP’s history, “Art of the Sudanese People: 1900–1985” will also feature the works of the first twenty-one artists represented. Three years before the show, the biennial received its first grant from the ASP, which is a $3,500 donation.\n\n\nThe Museum of Fine Arts (MFA) in New York has appointed Sherry M. Scott, the director of the Metropolitan Museum of Art, as the next director of the museum. Scott has served as interim director since July 2019 and", "The next Biennial should aim to raise $18 million from the current $10 million. The 2020 edition, which will be staged at Walt Disney Studios in California, is expected to raise between $12 and $14 million.\n\n\nAmerican artist Lillian Gish, whose obsession with human scale fused to form a more abstract, post-Renaissance conception of the natural, died on December 13 at age eighty-five. Born in New York in 1939, Gish studied at the University of Pennsylvania, the University of Chicago, and the New School, then attended the University of Chicago, then to the University of Chicago, then to Princeton University, then to Columbia University, and then to the University of Wisconsin. While at Princeton, Gish developed his method, the Miniature American, a parallel work of art that explores the role of scale in American art and life. “By combining the Italian Renaissance with the American landscape, Gish conceived of a new form of American art, one in which the artist was not only a scale model, but one in which the viewer was also part of the work, an assembly of images and sounds, a multimedia experience,” gallery talk, and a 1977 interview in Artforum read. He continued: “By"]