["The next Biennial should take place at the US Embassy in Cairo in 2020.\n\n\nThe Metropolitan Museum of Art in New York has finalized a deal with the Tutankhamun Museum in Puri, India, that will bring the works of the seven great teachers of Hinduism, Siddhartha Gautama, Vibhishma Gurd, Savitri Gautama, and Ajit Gupta. The museum will open a new 250,000-square-foot museum, the Siddhartha Gautama Center for Hindu Studies, in October 2020. The Siddhartha Gautama Library, which will house sixty thousand years of his writings, is scheduled to open in 2019.The museum’s partnership with the Gautama Clan comes at a critical time for India’s cultural sector, which is facing a number of challenges. In March, Prime Minister Narendra Modi announced a series of measures, including a $500 million boost to the National Curator’s Guild and a ₹500-crore grant program, to help the country’s creatives. The government also announced a ₹3,000 crore stimulus package in May 2019.\n\n\n", "The next Biennial should take place in Miami Beach in 2021.\n\n\nThe Flemish government announced that it intends to remove more than 1,300 works by the Finnish artist Sabine Duverger from the National Museum in Düsseldorf and move them to the Central Library in Berlin. The controversial move has sparked outrage from arts professionals and politicians across the country. Duverger’s works, which draw from feminist and queer traditions, have been on display in the institution for more than twenty years, but were never moved into the collections of the two cities. While the move has been criticized as a violation of the artist’s freedom of expression, the episode only serves to exacerbate the already tense situation between the city of Düsseldorf and the museum. The disagreement over the placement of the works stems from a dispute over a painting by the artist in 2015, for which the museum agreed to pay an undisclosed sum, and which was on display in the museum for only a few days.The controversy surrounding Duverger’s exhibition was ignited by a group of protesters who blocked a major Sargent’s Düsseldorf building in February 2019 and who were joined by a small group of citizens", "The next Biennial should be held at a venue that has a dedicated exhibition space that can host the exhibitors, including international art exhibitions, in the coming months. “This is a moment of great change for Portugal, a time when art is again embraced by the people, and is an inspiration for our future generations,” said Paulo Rocha, president of the Biennale de Portugal. The official invitation reads: “We believe that the time has come to organise a biennial at a venue that has the potential to be a beacon for artists in Portugal. The Art of Portugal, and the spirit of the Biennale, exist and have existed for almost fifty years at Porto and the Piauân, but have not yet been able to be found in a city of such magnificent scale. We therefore invite the city of Lisbon and the region of Portugal to consider the possibilities of hosting an Art of Portugal exhibition in the coming years.”The first edition of Art of Portugal was held at the Pérez Artes in Lisbon in 1997. The event was an attempt to draw more visitors to Portugal, which was then still recovering from the effects of the pandemic. The event, which featured works by seventy-seven", "The next Biennial should be in 2020, when the artist’s first solo exhibition in New York will open.\n\n\nThe Mandarina Collection, the private, contemporary art museum founded by renowned artist Bartolomeo Cervetto in Florence in 1960, has announced that it will move its exhibition space from the Museo da Arte Contemporáneo, which it occupied for fifty years, to a new three-building, twenty-thousand-square-foot location in the heart of downtown Florence. The new exhibition, “All in a Day’s Eye,” will run concurrently with the Milan-based arts museum Santiago Paretti’s 2019 reopening.The Mandarina opened its new five-story exhibition space in 2016, and the center will host several exhibitions, including “Sterling K.,” a special tribute to the author and activist who was a leading member of the radical African American arts scene in Los Angeles, in January. The museum also recently celebrated its centenary, and this year’s edition featured work by more than seventy artists and activists. The event attracted a record 38,000 visitors.\n\n\nThe Baltimore Museum of Art (BMA", "The next Biennial should include a presentation of the work of the Royal Academy of Fine Arts in London  and would welcome other international galleries. \n\n\nThe Museum of Modern Art (MoMA) in New York has announced that it plans to open a new museum devoted to the work of African American artists in the city next spring. The institution will also launch a museum of the African Diaspora (MAAD) on the same campus. The new institution, which will be dedicated to the African diaspora, will be named after the Museum of the African Diaspora and will serve as a platform for the exhibition “Black Lives Matter: The Politics of Race and the American South.” The announcement follows a yearlong project that unfolded at MoMA, which offers more than seventy thousand works by African American artists. The museum launched a yearlong African American Art Archive (A.A.A.A.) in January 2017, and in April of that year, MoMA’s permanent collection was moved to a new home at 400 South Twenty-Fifth Street. A.A.A. completed its program launch in May, and in the coming months, MoMA’s permanent collection will be moved to its permanent", "The next Biennial should be on September 28–30. The 2020 edition will be staged at the Museum of Contemporary Art Los Angeles, which is planning to relocate its museum to Santa Monica, California, and will welcome the first visitors in 2022. Museum director and CEO John Hoehn told Artnet at the time that the museum is currently evaluating the feasibility of hosting the exhibition in 2021. The institution is currently working on developing a new series of exhibitions that will engage with subjects that are central to the life and work of American artists.\n\n\nThe Museum of Modern Art (MoMA) in New York has agreed to give $1 billion to support curatorial projects in the city, including the redevelopment of the building that housed the late Whitney Houston’s studio. The gift was made in honor of MoMA’s 150th anniversary and the museum’s inaugural year. The $590 million renovation project will raise the museum’s total funding to $1.2 billion and make it the centerpiece of a $1 billion overhaul of the Metropolitan Museum of Art, which is scheduled to open in 2020.The renovation will involve the building of a new building, which opened in 1929, and the construction of a new campus, which will include", "The next Biennial should take place in 2021. “Taken together, these two works represent the two most important and widely held perspectives on the history and future of the art world,” said Kate Fobert, director of the Biennial. “The exhibition will reflect that inclusivity, and the fine-arts education will be framed around the themes of the exhibition. The combination of three works in one exhibition is a potent combination; it represents a spirit of collaboration where art and culture thrive in new ways. . . . In the same way that a community gathers around a shared passion for music, art and fashion, Biennials can unite around a common interest in art and artmaking.”The work by artist-in-residence Damien Hirst, who was based in London when the exhibition “Zombie World” was staged in 2006, will be exhibited at the new exhibition, “Art and the Spectacle: The Last Days of Marilyn Monroe,” which will open on September 27. The exhibition will also feature a selection of work by and by popular artists and writers including Mark Halperin, Robert Irwin, Jay-Z, and Paul Gauguin, and will feature the work of more", "The next Biennial should take place in the spring of 2021. \n\n\nThe Los Angeles County Museum of Art (LACMA) has appointed Dana Adams as its next executive director. Adams brings with her more than twenty years of experience in arts and culture. She comes to the institution from the Los Angeles Department of Cultural Affairs (LACMA), where she has served for eight years, and succeeds Amara Agul, who retired in the summer of 2019.“We are thrilled to welcome Dana to LACMA,” LACMA board chair Kim Collins said in a statement. “Her leadership qualities, enthusiasm and insight bring a new, fresh perspective to our work. We look forward to working with her to continue LACMA’s unique and enduring legacy as a world-class museum for artists, scholars, and the public.”The institution announced its 2017 appointees to its board last month, and Adams was selected in a special election held by the board. She will take up her new role on January 7.\n\n\nThe Metropolitan Museum of Art in New York has hired Seth Adams as its new deputy director and chief curator. Adams joined the museum in 2017 as deputy director and chief curator of contemporary art. He", "The next Biennial should be held in 2020. Artforum has contacted the organizers of the upcoming exhibition for a comment.\n\n\nThe exhibition “The Impact of Light on Art” was canceled by the Israeli Museum of History (Institute for Art History) in Jerusalem, which had presented the work in its entirety in an official capacity. The organization had announced that an exhibition of early twentieth-century art was in the works of the institution. The decision to cancel the show came after the institute, which is affiliated with the Israeli Museum of Antiquity (IMO), published a report on the exhibition in March. “I ‘m sure of one thing: Art is not dead,” said Hasan Abu Leila, director of the Institute for Art History. “It is only a relic that has passed from one generation to the next.”In the report, which was commissioned by the Institute for Art History, the organization noted that “the Arabs have been the majority in the museum’s collection since the sixteenth century.” It also noted that “in the last century, there were no exhibitions of work by Arab artists, no exhibitions of work by artists from the Levant, and no exhibitions of work by", "The next Biennial should focus on “The Architecture of Loneliness,” a collaboration between Tuzana and Stedelijk Museum that will examine how architecture can be art and the same can be said about loneliness. After the exhibition, the artists will present a new project.\n\n\nThe historian and curator Michal Blum, a Pulitzer Prize–winning writer who was named one of Time’s “100 Most Influential People” in 2017, has died at age ninety-eight from cancer.Born in Warsaw in 1932, Blum moved to the United States in the 1950s to study the history of art at Columbia University, where he eventually earned a doctorate in art history. In 1971, he moved to New York, where he began his book, Historische Untersuchungen, which was translated into German and published by Strand in 1979. The book remains a best-seller in the United States and Europe, where it has been translated into twenty languages.Blum’s lecture and writing on history and art took him beyond the limits of university lectures by turning to the written word. His piece “A History of Art” (1983–1989) for Artforum included a history of the", "The next Biennial should take place in May 2020. The exhibition will include work by artists such as Matsuyoshi, Akiko Higashik , and Shigenori Kawamura. The exhibition will mark the 45th anniversary of the Biennial Award.\n\n\n\n\n\n\n\nJoe Wright\n\n(1921–2008), American painter , most famous for his surrealist experiments in the form of abstract landscapes and his sprawling, layered paintings, is back in the spotlight again this year. His work is currently featured in the exhibition “Sixteen Years of Manzanita: Sixteen Years of Matisse” (2019), curated by the Chicago-based artist Max Beckmann, at the Fondazione Conciloni for a monthlong run that runs until February 26. The show, which comprises twenty drawings, prints and paintings spanning several decades, was inspired by the photographer Johann Georg Baselitz’s famous painting The Impressionists, 1936–1945, which is now housed in the museum, the Fondazione Cattolica.In the exhibition, Wright illuminates the existential anxieties of the contemporary city, linking the surrealist practices of artists such as Arne Glimcher and Josef Alberts,", "The next Biennial should take place in 2022. The biennial will include an exhibition of work on the theme 'The Frugal Future: From the Landscape of Art to the City of Art' and will have the theme 'Painting and Sculpture: The Nomadic Life of Petrarchus, the Great, and the King, and the Life and Death of Art.” The biennial will be staged in a number of locations across Rome and will be inaugurated at the Palazzo Magazzino in Rome on September 4. The program will explore themes such as the notion of the nomadic life, the fate of the city and its buildings, and the fragments of a lost artistic tradition. The Venice Architecture Biennale has already unveiled four new works, which were staged in May 2018, April 2019, March 2019, and January 2021.\n\n\nThe sixteenth edition of the Venice Architecture Biennale has announced that the event will be staged at the Venetian city hall in Venice from February 16 to February 19, 2020. The event, which is organized by the Italian architecture magazine La Stampa, will be the first time the museum has staged an exhibition that was not centered around the construction of new buildings.“", "The next Biennial should consider incorporating curatorial practices that are in direct relation to the national needs of the country into the programming.”\n\n\nThe Brooklyn-based nonprofit Artspace New York announced today that it will distribute seventy-two rare books in its entirety this year at no cost to the city. The organization will begin by taking twenty-four rare books from the private holdings of the Charles and Lucille King Family and will place them in the public collections of eighteen local arts and cultural organizations. The schedule for the biennial, which will run from April 22 to April 26, 2020, is as follows:May 5: The Moon and the Sun: Charles King’s First Drafts June 19: Charles King’s Second Drafts June 21: Charles King’s Third Drafts June 26: Charles King’s Fourth Drafts July 3: Charles King’s Fifth Drafts July 6: Charles King’s Sixth Drafts July 13: Charles King’s Seventh and Eighth Drafts July 15: Charles King’s Seventh and Eleventh Drafts July 19:", "The next Biennial should take place in 2021, the same year Presidents Ajit Pai and Tom Wheeler leave the commission.“I’m not sure what the future of net neutrality looks like if the FCC doesn’t reclassify broadband,” said Yuki, who serves as a biennial panelist and is also a cofounder of the New American Cinema, a non-profit arts incubator. “There’s a chance that we’ll end up with a situation where the internet is treated like any other utility.”\n\n\nThe Museum of Fine Arts (MFA) in Boston announced today that Patrick Moritz will be its next president and CEO. In his new role, Moritz will lead BMA as it seeks to expand its collection beyond its signature 19th-century works and explore the future of art in the city.“Patrick’s proven ability to reimagine the museum under the Massachusetts Constitution and his vision for the future of the museum reflect his personal and professional values as well as his long-standing commitment to Boston art,” said Andrew Schoelkopf, the MFA’s executive and artistic director. “The MFA is fortunate to have a", "The next Biennial should be held in the summer of 2021. The fifth one will take place in the fall of 2022.  The next edition of the SFAI World Art Biennale will be held in May of 2022. The biennial will celebrate the theme of the year, “Fashion and Design,” and will include eight new works. The 2020 edition featured work by thirty-nine artists, including Yuki Matsuzaki, Yasuko Komatsu, and Takashi Kawamura. The 2021 edition will feature work by forty-five artists, including Jordana Chaves, Joan Mitchell, and Gregory Lowery.\n\n\nThe British artist, who often poses intricately detailed drawings in his studio, will continue to work with his creation at the Tate, where he has served as director of exhibitions since 2012. In a statement, the Tate said: “We are delighted to support SFAI’s internationally renowned artist and his work has a long history at Tate. He is a well-known and respected contemporary artist whose work has been collected by Tate, the Museum of Modern Art, the National Gallery of Art, the Tate, the Royal Shakespeare Company, the National Portrait Gallery, the Royal Opera House, the Royal", "The next Biennial should take place in the spring of 2021. “We have been working hard to create a multi-year exhibition that reflects the richness and the originality of the programme, while at the same time celebrating the biennials fifty-fifth anniversary,” said Bertrand Riester, the curator of the exhibition. “The new format will put the exhibition at an even higher level: the exhibition will be a celebration of the biennial’s legacy and of the extraordinary history of the exhibition. This is an opportunity to renew the exhibition and to take it further.”The biennial was established in 1988 by Felix Baer, Colonel Oliver Duke, and Harold and Edna Wallach. The show has helped raise awareness about the effects of the Covid-19 pandemic on art galleries and museums. Following the pandemic, the US government approved a $1.2 billion stimulus package for the arts in January 2019, and the biennial is currently undergoing a two-year renovation.\n\n\nMana Contemporary, an independent arts center in Atlanta that planned to open this fall with a $100 million renovation, is now facing a legal complaint from Georgia lawmakers. According to the AJC, the Georgia Legislative Commission", "The next Biennial should be held in 2022.\n\n\nItaly’s Domenico Cattelan has been chosen to develop a new series of exhibitions aimed at countering the influence of western European art and culture on the country’s contemporary art. The first exhibition, “Art in Turin,” will open on October 28 and will include works by artists such as Marc-Antoine Harder, Carlo Puccini, and Karolina Wojtas, as well as by artists from the Balkans and Africa. The second engagement, “Museums in Turin,” will open in November 2019.The biennial will consist of three segments: “Plans to Transform,” which will include a look back at the previous editions, “The Future is Now: 50 Years of Art in Turin” (2019–20); “Association” (2019–20); and “Intention: The Art of the Present.” The fourth installment, “Intention: The Art of the Past,” will launch in November 2021.The Rome-based architect and collector Alessio Cattelan, the founder of Cattelan Architecture, has been selected", "The next Biennial should take place in 2021. The second will be staged in 2022.The announcement follows the 2018 announcement of a new partnership between the museum and the Dutch company Biennale Rotterdam. The partnership aims to \"develop new exhibition projects that are connected to the Spanish and Moroccan artists, as well as to the Spanish and Moroccan artists, in order to encourage their mutual understanding and appreciation\" and to foster dialogue between the two countries.The Moroccan artist Mazen Ibrahim will represent Morocco at the upcoming edition of the Biennale, which will take place in Algiers from March 21 to March 27. Other artists participating in the event include Aaron Casteel, Nima Nabavi, Marwa Nouri, and Nima Wadud. The Moroccan artist Nima Nadir will present an exhibition at the museum in 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it has received a gift of twenty rare works by the artist Luke Brunet from the artist’s former employer, the SculptureCenter in Los Angeles. The donation includes works that were previously under-discussed and out of reach for the former Los Angeles County arts director, Ed Levin.“We are thrilled to welcome Luke to", "The next Biennial should begin as soon as possible and be open to the public. In the meantime, we will continue our work to publicize the surrounding ecosystems and the themes of the exhibition, which are centered on resilience against environmental and climate-related challenges, and to organize programming to support our communities.”The exhibition will be held in the former headquarters of the Los Angeles County Museum of Art (LACMA), which was renamed in honor of the late icon Ronald and which relocated to a new home in 2013. The museum plans to reopen in the spring of 2020. The announcement of the theme for the exhibition was made during a presentation of a selection of works by artists that are working to address issues of race and climate change, including Tilda Swinton (Alexandre Borotas), Yinka Shonibare (Sophia Evans), and Mary Martin (Leila Mizrahi and Chris Owens), among others. The Biennial will feature works by artists representing thirty-five countries.Chair of the exhibition is Gregory Fields, president of the Frederick P. Schneider Art Museum in New York and the city of Los Angeles. “The theme of this year’s Biennial is the connection we all share as social beings, and how we,", "The next Biennial should be in 2020.  Will the 2020 iteration include an exhibit of the work of Kounen Matsuoka, or will it follow the precedents set by the last three decades, when the project was initiated by the family of the late Tadao Ando and the late Yoshito Nara?  The second Biennial will take place in 2022. The third will be in 2023.  The upcoming exhibition, “The Fall of the House of Hiei,” will feature an early work by the late Japanese artist Ionobu Nakaya’s sculptures based on the Fukushima Daiichi Nuclear Power Station, and will open in Tokyo in October 2020. The show will then return to Osaka in March 2021. \n\n\nThe Los Angeles County Museum of Art (LACMA), which is currently undergoing a $150 million expansion, is planning to launch a new online-only video-editing platform, called the Archive, that will offer a full range of archival services, including photo exhibitions, online reading groups, and catalogues.Dubbed Archive, the service will offer visitors a number of unique features, including the option to upload original works by selected artists, as well as", "The next Biennial should be at a location that has not yet been selected, and should be announced by the director of the program. The director must appoint a committee composed of at least five artists to conduct a survey of the composition, installation, performance, or other work. The panel shall meet twice a year, and the biennial should begin in 2020. \n\n\nThe Museum of Fine Arts (MA) in Boston announced today that it is planning to close its doors for a period of eighteen months to complete a $70 million renovation and expansion. The project, which is being led by the firm Gensler, aims to bring the museum up to code and incorporate new programs, educational initiatives, and public spaces. The entire complex, which is located near the Charles and Charles Evans, as well as the American Society of Composers, will undergo a $35 million facelift.“This will be a transformative experience for millions of visitors,” museum director Matthew Doyle told the Boston Globe. “It will introduce new ways for people to experience the museum’s rich collection and collection experiences and will engage them in the museum’s mission to promote contemporary art and to foster social justice through the arts.”The renovation includes the expansion", "The next Biennial should be held in 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles, California, has announced that Domenick Amadio has been named its next director. He succeeds John Bergman, who retired in August 2019 after ten years at the helm of the museum.“We are deeply honored to welcome Domenick to the staff and board of directors, and to have him on board as a board member,” said Kate McLaughlin, cochair of the board of directors. “In his new role, Domenick has the opportunity to strengthen and expand our collection and to further our mission. He will be integral to our ongoing efforts to tell and reimagine the history of American art, and will have a significant role in our future success.”Commenting on his appointment, Amadio said: “I’m thrilled to be coming to work at MoCA, an institution that, since its beginning, has been devoted to the preservation and exhibition of contemporary art. I’m excited to build on the MoCA legacy through this year’s exhibition series, the Biennial of Newcomers.”\n\n\nThe Bank of England has introduced new guidelines", "The next Biennial should be held in 2022 and will be in the Exhibition Râne-Contière, Paris.\n\n\nThe Whitney Museum of American Art in New York has received a massive gift from the estate of the late Kenyan artist and activist Thomas M. Tutu, a widely recognized leader of the country’s arts community. The gift includes a series of works, including a sculpture by his granddaughter, Nell, which will be on display in a new exhibition titled “The Tutu Saga.” The works were created as part of a series, which launched in 1976, that addresses the legacy of Thomas M. Tutu as an activist for African art, culture, and human rights.For his work “The Tutu Saga” (1976–1978), Nell Tutu, his daughter, and granddaughter presented him with an American flag that he had flown in Kenya, a symbol of their collaboration and commitment to Africa. “We are honored to present this work in the new exhibition, ‘The Tutu Saga,’ with the immediate and long-term collaboration of MEXICO, Mexico City, and the Carmen region,” Nell said in a statement.The new work will be in the exhibition", "The next Biennial should be held in 2020. The cancellation of the first, in 2020, is a move that will have serious consequences for the future of the festival.The Biennial’s Executive Director, Femke Herregraven, said: “The festival’s Board and I are very happy that this decision has been made, as we feel it is a crucial step in the long-term future of the festival. The future of the Festival is at stake. We are committed to making sure that the biennial is able to survive and thrive amid these uncertain times. It is a difficult decision to make, but one that allows us to focus solely on the biennial and future of the festival.”\n\n\nThe British Film Institute (BFI) in London has appointed Elliott White as its new executive director. White, who has been the BFI’s chief executive for the past two years, will assume his responsibilities on August 9. He succeeds Nick Pickles, who has led the institute for three years, and will begin his role in August.“We are very much looking forward to welcoming Elliott into the BFI,” said director Maria Balshaw. “Elliott’s experience,", "The next Biennial should take place in 2019 and will include works by the artists from the following list:Alberto Andujar, Zara Uribe, Jorge de la Rosa, Demian Diné, Diana Feltrinelli, Ella Giudice, Evan M. Guerin, Haegueza, Kaya Jordan, Duléma Tavares, Jen-Hui Chu, Jericho Wong, Kamiara Brown, Kylie Roesler, Roryan, and Tony Yasuyani.The budget for the event is $250,000 and is funded through revenue from the city’s property and industrial tax increment financing district (PEM) program. De Blasio became the first New York mayor to embrace the program in 2017 and has since leveraged the funds to stimulate the economy through rent control, affordable housing, and other urban conservation efforts.“This is the city we want to be: a place where everyone can be themselves and thrive,” said Phil Torres, the city’s commissioner of arts and culture. “It is the city we want to be.”\n\n\nThe Museum of Modern Art", "The next Biennial should be staged in the spring of 2021. The next iteration of the World Biennial will take place in the summer of 2022. The 2019 edition was held at the Bogotá, and the 2019 edition was organized in collaboration with the Bolshoi and the National Museum of Art in Moscow.\n\n\nThe Metropolitan Museum of Art has announced that in the upcoming biennial “The Form of Things” it will present a selection of works by forty-five artists and collectives.  The artists selected for the exhibition include Adam Mathewson, Larson Phüchchen, Nari Ward, Oksana Vassenko, and Karen Kilmarth. The exhibition will be held in the new Metropolitan Museum of Art–New York, which opened in the summer of 2021, and will be supported by the Metropolitan Museum of Art, the New Museum, the Solomon R. Guggenheim Museum, and the Metropolitan Opera House. The program will run from April 16 through May 29.This is the second iteration of the exhibition. In 2015, the show, which was curated by art critic Marc Glimcher, premiered at the new Chrysler Museum of Art in Greenwich, Connecticut, and was followed by the exhibition", "The next Biennial should be held in 2021, and the first in 2022. The next International will be held in 2022. The next Rome Biennale will be held in 2023. The next Venice Biennale will be held in 2022. The next Hamburg Biennale will be held in 2021. The next Berlin Biennale will be held in 2021. The next New York Art Biennale will be held in 2021. The next San Francisco Art Biennale will be held in 2022. The next San Diego Art Biennale will be held in 2021. The next Helsinki Art Biennale will be held in 2021. The next New York City Art Biennale will be held in 2022. The next Venice Architecture Biennale will be held in 2021.\n\n\nNew York–based artist Lillian Barlow has won the Europoean Guildhall Prize for her installation The Neutral Zone, a multi-generational installation that examines the physical and biological boundaries between human and nonhuman cultures. Barlow’s work, which is part of her ongoing project The Neutral Zone’s ten-year cycle, which is currently on display in the art center’s Deansgate Gallery, was", "The next Biennial should be held between March and June 2020.\n\n\nThe French government has announced that it is conducting an investigation into the circumstances surrounding the publication of a controversial letter, which criticized the country’s participation in the Paris Climate Accords, by French president Emmanuel Macron and French foreign minister Jean-Yves Le Drian, in the immediate aftermath of the historic Paris Agreement—a landmark deal that aims to curb global warming and stanch the rising tide of carbon emissions—and is considering whether the decision to revoke the accords could amount to a breach of French sovereignty.According to the New York Times, the French government received the letter from French artist Wilma de Kooning, who had previously criticized the Paris Agreement and the French government’s inaction on climate issues, and asked her to help them draft an apology for France. De Kooning declined, but she did sign a statement condemning the letter and the Paris Climate Accords, and agreed to alter a photograph of the Accords she made in 1988, in Paris, to reflect the words from the Declaration of Independence, which French president François Mitterrand signed in 1995, to make the Accords look better. Originally published in the French journal Libération on March 5", "The next Biennial should be held at least ten years after the end of the current programme, according to the organizers. Biennial organizers are also seeking the views of the public on whether the future of the exhibition should be reconsidered. “The future of our exhibition is at stake,” Marcel Prouvé, president of the Biennale de Lyon and the event’s patron, told the Art Newspaper. Prouvé said: “A show of a thousand works, a work that is a landmark in its own right. That’s what we are planning to do. The Biennale is going to take a step forward in that direction, with a new timeline, a new program, and a new theme.”While France welcomes twenty-two artists and forty-seven foreign delegations for the inaugural edition of the event, organizers have asked that the majority of the participants be French. The event will also include a new exhibition of works by artists in residence, which will be staged at the Museum de la République, as well as a reopening of the National Museum of Contemporary Art in Paris. The full list of participating artists is as follows:Artsakhit Kavaler", "The next Biennial should take place in the spring of 2021 and will also include the first publicly–funded exhibitions of work by female artists in the country.\n\n\nThe fourth edition of the Art and Architecture Biennial—which kicked off in Pretoria on January 31 and will run through March 27—has announced that it will suspend its festivities until March 23, the day the exhibition opens in London. The decision prompted a strong backlash from some of the participating artists, who called for the event to be canceled at least until the threat of violence from extremist groups was taken seriously. “We at ART confront a world in which extremists are emboldened by a climate of fear and hatred,” Paul Derose, director of the London-based charity Art UK, told the Art Newspaper. “The MCH Group is committed to working with the government and international partners to improve the security and resilience of our communities and we know that our art has a vital role to play in our future. We need to do everything we can to support those most in need and to ensure that we have the tools and the support to prevent extremism and keep communities safe and thriving.”The suspension comes on the heels of the global protests against the continent-wide conflict in Syria", "The next Biennial should be held in the autumn. Škooner, who will assume his post in January 2020, said: “I look forward to working with the curators of the upcoming exhibition and to helping them realize their vision of the exhibition, which is to integrate the art of photography within the contemporary art of the gallery.”\n\n\nThe San Francisco Museum of Modern Art (SFMoMA) is reportedly preparing to unveil a new art-world venue, the Museum of Modern Art (MoM), in the city. The museum is temporarily closed due to Covid-19, but is expected to reopen sometime this summer.Called the Museum of Modern Art Communities, the new entity will be housed in a former Beaux-Arts building and will be supported by a $500,000 grant from the Joan and Robert Kennedy Foundation. The project is being organized by architect Yinka Mpagi Sephora, who is also the architect behind the Ebony & European Art Museum in Harlem. According to the New York Times, the museum’s existing buildings will be kept intact, and the museum will bring together new works by artists and institutions from around the world. Sephora has previously proposed organizing more", "The next Biennial should be held sometime in the spring of 2020. \n\nThe Biennial of African Art (B.A.A.N.) has announced that it is entering into a partnership with the Foundation for Contemporary Art (FCC) that will bring together the works of fifteen African artists and venues. The partnership will include the first-ever exhibition of work by Nancy Rigby, her portfolio curated by curator Sébastien Gouma, and a selection of newly commissioned works by Ethiopian artist Tarek Atoue. According to The Guardian, this exhibition will mark the first time the two organizations have collaborated on a biennial project.Rigby, who died in 2006, was one of the founders of the contemporary art research group Black Studies and a curator at the Foundation for Contemporary Art. She was a coeditor of Black Studies and a coauthor of the anthology Black Studies, which was recently selected for the forty-fifth Venice Biennale.Inaugurating the exhibition are three new works by Atoue and three that represent the contemporary art scene in Africa\u0097Bilal Ali, Almine Rech, and Nweera Ndzube. The show will run from February 1 to February 7.\n\n\n", "The next Biennial should be at the Lycée d'Art Moderne in Paris, which is currently closed until April 21. As the organizers of the event, which was established in partnership with the French Ministry of Culture in 2006, we are also working to postpone the exposition until at least June. The next edition of the Art Berlin Biennial will take place in May 2022.  The Berlin Art Museum (BAM) has announced its attendance of a select group of artists for the 2021 edition of its Berlin Biennale. The group included Jürgen Toditz, Sara Cwynar, and Andy Warhol. The exhibition will open at the Münster-Bickelhaus in March 2022 and run through December 2022. The eight-day event will feature more than 200 works by forty-four artists, including Alexander Calder, Diana Al-Hadid, Laura Mvogo, Brandon Lloyd, Max Beck, Andreas Lindbergh, Cécile Barbeil, and Alfred Stieglitz. The 2019 Berlin Biennale, which drew more than 1,100 exhibitors, including Maurice Boehm", "The next Biennial should take place in the fall of 2020. The future dates are unknown.\n\n\nThe University of Southern California (USC) has launched two new initiatives that aim to improve access to and enhance the academic and professional experience for low-income and first-time undergraduates. The initiatives, which will be announced in the coming weeks, are called the USC Low-Income Scholarship Program (SISP) and the USC First-Time Student Scholarship (SUSP).Both programs focus on providing financial aid to first-time students who are pursuing a degree from an accredited college or university in the state of California. The scholarship program will give $5,000 grants to those graduating from underrepresented minority and female-dominated fields and will offer $5,000 grants to those enrolled in the first year of their undergraduate program. The first cohort of high-school seniors will be selected through the 2019–20 school year and will receive $1,500 grants. The scholarships will be awarded based on academic performance, demonstrated financial need, and the student’s interest in pursuing a career in the arts. Scholarships will be awarded to students who live in the Pacific Palisades, Santa Monica, Orange, San Diego, San Francisco, Santa", "The next Biennial should be held in the spring of 2021. The new site for the exhibition will be located in the city of Stockholm, which was chosen as the material for the exhibition due to its artistic and cultural heritage. The exhibition will be curated by Carlos Nocita, the director of the Museo de Arte Contemporáneo, and will be organized in cooperation with the renowned museum in Stockholm.The twenty-fifth edition of the exhibition will take place in December.\n\n\nThe Arts Desk, a New York–based group that works with artists and arts professionals to advocate for greater access to arts programs across the city, has received a gift of $3.4 million from the Rockefeller Foundation. The organization is giving the group $3 million to develop its artists’ tool kit for the arts, and another $2 million to help with the organization of its first annual Arts Desk Artists’ Show, which will take place in January 2021.The Arts Desk’s first annual Artists’ Show, which will be at New York’s Central Park from January 16 to January 19, 2021, will present fifty artists from forty-six cities across the United States. Titled “After the Right Time,” the show", "The next Biennial should take place at least ten years from now. “I’m optimistic that we’ll be able to blend in and survive the shock of a new climate,” said Sasse.  Last year’s edition, titled “Between the Sun and the Moon,” featured work by seventy-four artists, including Mark di Suvero, Americana and fantasy artist A.J. Delgado, and Nari Ward. The event will also include a virtual reality experience for people with disabilities as part of an initiative run by the organization Hamburg-based Åke Taveras.Artforum has reached out to Sasse for comment.\n\n\nThe Museum of Contemporary Art (MoCA) in New York has named Richard Firestone as its next director and CEO. Fired in December 2019, Firestone was awarded the $10.9 million prize in support of his leadership of the institution. He succeeds Kirsten Hermy, who departed in February 2020 after sixteen years at the helm of the museum.“Richard brings a wealth of experience in operating an arts institution, from twenty-five years at the Metropolitan Museum of Art, to leading cultural organizations such as the Pittsburgh International and the Pittsburgh Art Museum", "The next Biennial should focus on the development of institutions and their capacity to spread art through the medium of art. The theme of the third should feature the interrelationships between art and social movements. For the fourth, the theme should be “The Landscape,” and the fifth, “Conceptualities of Art.” The themes of the last two years have yet to be decided.The festival will also feature work by internationally renowned artists such as Tashiko Miyazaki, Kim Seo-kyung, and Park Joon-sung, who will be honored at an awards ceremony at the venue on September 4. The art of the fourth Biennial will be curated by Kim Eun-sung of the Korean Academy of Fine Arts, which will be inaugurated by the opening of the exhibition “The Landscape of My Life,” which will open at the museum on September 14.\n\n\nMark Zuckerberg, the CEO and chairman of Facebook, has announced a new initiative that will offer free, unlimited, personalized photo albums for Facebook users. The program, dubbed 'Artistic License Plate,” will roll out across Los Angeles, New York, San Francisco, and Seattle over the course of eight weeks. The free", "The next Biennial should be held in 2020. \n\n\nMariya K. Smith, the director of the Museum of Contemporary Art (MoCA) in Los Angeles, announced today that from April 15 through May 8, 2020, the museum will be closed and closed to the public. The announcement follows months of protests, marches, protests, and strikes that have targeted corporations and wealthy corporations, and have collectively resulted in millions of workers losing their jobs.The museum’s management cited the coronavirus as the reason for the closure, which was first announced in December and has yet to be fully implemented. The closure has forced the cancellation of the Fremont Street Fair, which had been scheduled for March 31, and has forced the Museum of Modern Art to move the 2020 edition of the Museum American Art from May to June.The closure also means that the Museum of Modern Art, which recently underwent a $80 million expansion, will be closed until October 25, 2020, the anniversary of the Great American Eclipse, and will not reopen until late November or early December. The Museum of Modern Art (MoMA) in New York also announced that it will officially close its doors on September 24, 2020.The international coalition of artists, activists, and academics", "The next Biennial should be held at the Rio+20, in 2020. This will introduce a new platform for the exhibition of work by artists in the United States and the United Kingdom. This platform will also be familiar to many of the artists who are currently exhibiting in the New York art fairs: Yoko Taro, Karen Lober, and Shimon Peres, among others. In addition, the biennial will include a new award for scholarship and critical reflection, which will be co-organized by the Margaret and Ira D. Wallach Foundation, the Solomon R. Guggenheim Museum, the Museum of Fine Arts, and the New York Public Library. The full list of participating artists is as follows:Art Gallery of Ontario (CAN)ArtforumForumForumForumForumForumForumForumForumForumForumForumForumForumForumForumForumForumForumForumForumForumForumForumForumForumForumForumForumForumForumForumForumForumForumForumForumForumForumForumForumForumForumForumForumForumForumForumForumFor", "The next Biennial should focus on “the art of cooperation” (meaning collaboration with and through others), and not “the art of competition,” according to curator and founder of the New York–based museum, Linda and Stewart Mandel.\n\n\nA group of artists, musicians, and writers who were signed onto an artistic statement in support of transgender rights in the name of solidarity with the Black Lives Matter movement are urging the European Union to honor a transgender worker who was recently awarded a commission by the United Kingdom’s Tate. The artist, who only spoke to the Artist’s Commission for a BBC documentary about the exhibition, was detained for two weeks after he attempted to cross-dress in front of the museum’s own staff. The exhibition was organized as part of a UK-wide campaign to improve the lives of trans people.“Tate has an ethical responsibility to represent the interests of the visitors to the Tate. Therefore, Tate should honour the commissioned work, and its creator should be paid,” the letter reads. “By doing so, Tate is showing its solidarity with Black transgender people, and with Black artists in general. Doing so would send a message that the Tate is listening", "The next Biennial should be a very large production, perhaps eighteen hundred paintings. I am afraid that the present exhibition is not a moment to reflect on the great achievements of the past, and on the difficulties of the future. The exhibition is my way of expressing my gratitude to the exhibitionists of the first Biennial, in 1912, and the twenty-fifth in 1929, for the tremendous and sustained exhibition. I hope that the opening of a new exhibition in the city of Milan, scheduled for September, will attract many of the World-class artists who will be represented in the exhibition and bring them together for the first time. I invite you to December 8th.\n\n\nThe German city of Bonn announced today that it has received the first shipment of the controversial works from the 13,000 artworks that were seized from artist Joachim Neugroschel, a former employee of the Bonn Art Museum, and were moved to a storage facility in a warehouse in Bonn on Thursday. Neugroschel was taken into custody on suspicion of committing theft on Friday, March 19, after a police operation. The forty-one-foot-long ceramic works, which were estimated to be worth more than $3 million, were taken from the", "The next Biennial should take place in 2020 and will run from to the theme of “Metaverse.” According to the organisers, the next edition will include the first exhibitions dedicated to art from the ’80s and ’90s and will be “designed by directors Tanya and I, with support from the trustees of the Biennial.” The exhibition will also include “We Were in Love,” a retrospective depicting the lesbian relationship from the perspectives of Janice and Janice, and “The Shadows of London,” a collection of photographs by the artist and a collaboration with the artist Stéphane Brize.“This is a unique and exciting time for art. Biennials are gaining momentum and strengthening their hold on cultural institutions, and we are witnessing an exhibition-driven renaissance,” said Nanda Bakhtiar, chair of the Biennial Committee. “I look forward to her work and the festival’s next iteration celebrating our shared past.”\n\n\nThe Museum of Fine Arts (MoFA) in Boston is planning to open its first collection of works by the late California–based artist Steve Diedrich in 2021. The first exhibition in the new", "The next Biennial should be held in 2020, the group said. The next iteration of the Memphis Biennial is slated to take place in 2022. The 2019 edition, titled “Greater Memphis: From the Archives,” was staged in collaboration with the Memphis Art Museum and the University of Memphis. The 2020 edition, titled “Greater Memphis: Declining,” is being curated by Diana Albright.“Throughout its history, the Contemporary has been an active partner in the revitalization of the region,” Artnet reported. “Since its founding in 1972, the Contemporary has supported more than twenty-five thousand exhibitions, and has presented exhibits that were not otherwise able to obtain the support of the museum. We are grateful for its support and look forward to the 2020 edition.”\n\n\nThe University of Kentucky has been awarded an additional $54 million in funding from the Andrew Carnegie Foundation, which will give $30 million of the total to KENTUCKY’s Department of Arts and Culture. According to the university, the $104 million in arts funding from the foundation was allocated to “creating a new program for the arts,” a new advisory council of curators", "The next Biennial should also focus on ways in which social media can be used as a platform for social change and change for the better. Julia Serano, director of the Los Angeles County Museum of Art, said: “Virtual reality will play a large role in the death of white supremacy in America. We must take it upon ourselves to challenge the systems that enable racist violence.”The 2020 edition of the Biennial will showcase work by thirty-seven artists, including Christopher Wool, Alex Blackwell, Carmen Caruana, Sara Diaz-Whites, Michael Collins, Kena Davis, Benedict Casteel, Sue Dingle, Chloe Fowle, Emma Frank, Bradley James Gay, Julia Goldenberg, Anna Gottesdiener, Michael Hall, Yasmina Kirkpatrick, Julieta Marks, Cara Otero, Chris Pizzello, Frank O’Leary, Cindy Sherman, Tanya Simonyan, Rica Taylor-Dolan, Teresa V. Vassallo, and Jane Wehner.The event is an extension of", "The next Biennial should be held in 2020. The Art Newspaper also reports that the 2019 event, which was canceled owing to the coronavirus, will soon be made available online. This year’s edition, titled “The Future Is Present,” will include a special exhibition of work by twenty-three artists, including Lukáš Škoda, Zoya Lintels, and Akiko Nakayama. New works will also be added to the catalogue each year.  For Škoda, the new work “will become a meaningful addition to the catalogue, to be explored anew.” Elsewhere in the catalogue, Škoda’s work will be presented as a “documentary of his life and work,” while Lintels will present a “digital world” based on her own body. The show will also feature a “new kind of music” and a “new kind of visual art,” and will be inspired by Lintels’s life. “The Future Is Present” will open on February 23 and run until March 29. \n\n\nThe Art Newspaper has revealed that the twenty-six artists", "The next Biennial should take place in October 2020 and will showcase the work of twenty-one artists. “In the meantime, we are grateful to our generous benefactors, including the Adolph and Isabella du Maurier Foundation, the Charles and Lucille King Family Foundation, the Charles and Lucille King Family Foundation, the Allen and Lucinda King Family Foundation, the Anna and John H. King Family Foundation, and the Diane and Charles King Family Foundation, and their generous donors, who have made this exhibition possible,” said museum director Michel de la Barra in a statement. The museum has previously claimed that it expects to receive $1.2 million from the King family foundation and $100,000 from the King Family Foundation for the design of the new museum. The future of the museum, which dates to 1912 and is currently undergoing a $130 million expansion, is in jeopardy after the foundations announced they would cease their fundraising efforts because of the pandemic.The King family foundation is now attempting to raise funds for the MCH Group, the Paris-based arts conglomerate that operates out of the city, as well as for the modernization of the old City Gallery and the renovation of the Museum of Modern Art. The latter project", "The next Biennial should take place in 2020, with an opening in 2021. The exhibition will be curated by artist Florentijn Hofman.\n\n\nThe Australian Arts and Cultures Forum (AACF) has announced the twenty-five artists who will represent Australia at the twenty-third edition of the Google Art Show in San Francisco, which will kick off on February 7 and run through March 2, 2020. The event will also include a number of special exhibitions, including a retrospective of the work of women artist Lorna Simpson at the Sydney Contemporary Art Museum and the inaugural exhibition of Australian artist-in-residence Zhenya Hasan.An expanded list of artists currently represented at the event can be found on its website here.\n\n\nThe Los Angeles County Museum of Art (LACMA) has received a gift of more than 500 paintings from the estate of artist and activist Alain Guiraudie. Guiraudie’s estate, Daniel Wallace Productions, purchased the works from the famous French Impressionist’s estate in Paris in the summer of 2019. The works, which were acquired in the early 1940s, were put up for auction by Guiraudie’s son, Pierre Guiraudie, on", "The next Biennial should focus on how the museum’s collection and exhibitions are situated within a larger international context and should be organized around a global, not a local, mission. We will also continue to promote the work of international artists in our programme, and we welcome your ideas for future exhibitions.The Biennial of Australian Artists will announce new dates and locations for its next exhibition in March 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed John Argyros as its next executive director. Argyros will assume his post on February 29. He succeeds Matthew Callahan, who departed the institution in February 2019 to become the interim director of the Brooklyn-based nonprofit the Broad.The Broad, which operates out of a former Winnebago County warehouse, has hosted numerous exhibitions, such as “An Unfinished Business: Notes from the American Midwest” (2019) and “The Body and the Place: Art and Body in the Late 1940s” (2019), and is currently seeking a new director. The Broad’s next executive director, Zina Saro-Wiwa, will take over from Callahan on March 6.After working in various capacities in the arts over the past ten", "The next Biennial should be held at the Museum of Contemporary Art in New York in 2021 and will invite more than one hundred arts professionals to collaborate. \n\n\nThe California Institute of Technology (Caltech) has awarded $6.5 million in grants to forty-eight institutions in the Bay Area in support of their graduate and postgraduate education programs. The projects, which will be implemented through 2020, will include the construction of new buildings, the reinstallation of existing systems, the development of curricula, the acquisition of land, the renovation of existing buildings, and the acquisition of camera traps.“We’re thrilled to announce the winners of our biennial fellowships,” said PR Newswire editor-in-chief John D. Walcott. “The fellowships will be designed to support the work of artists participating in our Berkeley Art Talks, but also provide opportunities for young and established artists in the Bay Area to gain exposure to the CNA’s creative ecosystem through the installation of their works in the exhibition ‘An Open Window.”The CNA’s Graduate Fellowship program, established in 2005 to support the work of emerging and established artists, has awarded $3.5 million to twenty-", "The next Biennial should have been in the spring, not later, and the first was on September 9, 2008. The Biennial will be held at Stratford-on-Avon from March 18 to March 20, 2020. The exhibition will include works by twenty-two of the greatest artists of the twentieth century and will open on March 7.\n\n\nThe Museums Association (MA), the UK’s professional body for museum professionals, has announced that it will no longer accept new members. The decision was made following an analysis of the politics of the museum industry, trade, and the government, and was spurred by the Brexit vote.According to a statement issued by the organization, which represents more than 1,200 museum directors, the decision “came as a complete surprise to us.” The organization’s board chair, Sue L. Truitt, said: “We did everything we could to try to make it work. We have hired consultants, we have campaigned, we have lobbied, we have presented our case to the government. We have taken all actions that we thought were necessary. We were very careful about the way we presented our case to the government, and that’s part of the reason why we", "The next Biennial should be held in 2022.\n\n\nThe Museum of Modern Art (MoMA) in New York announced today that it is preparing to reopen to the public in April 2021. The museum will reopen to the public following a major renovation and expansion, designed by architect Tamir Rice, that will include the addition of a new public art garden, a new plaza, and new public spaces. The extension of the museum’s footprint will also incorporate the construction of a new building for the collection and exhibition space, a new public courtyard, and an expanded public plaza.“For nearly a century, MoMA has provided a platform for the voices of African Americans, women, and LGBTQ+ artists, and has been a crucial center for cultural exchange and access for millions of visitors,” Peter Erdman, chairman of MoMA, said in a statement. “The renovation of our museum reflects our commitment to a more inclusive future, one that affirms the legacy of our founder, Tamir Rice.”The museum will welcome visitors back in April.\n\n\nThe Chilean artist, choreographer, and writer Santiago Garrido, whose drawings, sculptures, photography, and films always addressed the personal and social realities of everyday life, died on April", "The next Biennial should take place in 2022, the date of the feast, which celebrates the 120th anniversary of the birth of the founder of the Nouveau School, Jean-Marie Curie. The event will take place at the Paris Museum of Fine Arts (FIM) and will run from October 28 to November 20, 2022.For a full list of participating artists, visit the Art Basel website. \n\n\nThe Open Road Foundation announced today that it is launching a new initiative to provide direct financial support to artists working in the arts. The new grant program, called Open Road Grants, will provide $2.5 million each year to help artists create new works and will provide three rounds of funding—in 2021, 2022, and 2023—for artists who have not yet established their own practice, and will prioritize projects that are creative and small-scale.Over the next three years, the Open Road Foundation will direct $1.5 million to a portfolio of projects that have already received funding from the foundation, such as artist residencies and creative projects, and will create new artworks by awardees. The money will then be used to stage an exhibition of work by selected artists at the Open Road Foundation’s London, New York", "The next Biennial should be held in late spring or early summer. “While we are grateful for the commitments Australia has made to supporting our artists, the future of the Biennial is at risk if this action is not taken,” the organizers wrote in a statement. “We call for a prompt and effective response by the State government, headed by the Minister for Foreign Affairs, which will work with the Australian Indigenous Council (AIC) and Nga Taonga to consider the implications of the decision for artists, and will continue to work with our artists and the AIC and Nga Taonga to ensure a fair, transparent and inclusive event.”The government’s consultation paper on the reopening of the Biennial, published on Wednesday, reads: “Artists and other cultural and creative workers, many of whom are essential to the future of Australia, are facing unprecedented challenges. Their voices, their contributions to Australia’s cultural and creative life, are being under-recognized and misrepresented. The consultation paper will provide a framework for engaging with their views and ideas and will address the current state of play in the arts and how it can be changed.”The consultation paper was drafted by AIC chief executive Kelvin", "The next Biennial should be held in 2021. \n\n\nThe Museum of Fine Arts (MFA) in Boston is working with the city of Boston to relocate the exhibits and collections within its building, which was redesigned by architect Daniel Libeskind, to a location on South Dartmouth Street. The museum hoped to bring the works to a new home in the city, but the lease on the building currently held by the Massachusetts Cultural Institutions, the First Congregational Church, and the Massachusetts Institute of Technology (MIT) is currently held by the Lewiston-based firm of Kirkland & Ellis.“We are committed to finding a solution that will serve the museum and the city for years to come, and are actively working with city government and the Lewiston City Council to realize the project,” said James D. Farley, director of the museum. The building, which was built in 1963, has housed the works of eleven individuals or collections for twenty-three years.The renovation of the museum, which is slated to be completed in 2021, was initiated by the city of Lewiston in collaboration with architect Gary Ellsworth, who designed the MFA’s new campus in partnership with the city of Boston, and was completed in 2016. The", "The next Biennial should take place in 2021. The theme of this year’s edition is “LIFE and LIVES+LIT: Art and Life in the Early 20th Century.”  The exhibition will feature biennial works by artists such as David Salle, Charles Ray, and David Sargent, as well as works by contemporary artists such as Laura Owens, Louise Nevelson, and Eileen Atkins, and will run as a two-hour event. “After a journey through the genres of art and life, we look forward to the theme of LASALLE,” said Ann Telnaud, the inaugural biennial’s artistic director and curator of the category. “This is a unique venue for a show that combines documentary, performance, and visual art. It is a question of creating an exhibition that takes into consideration both the place of the artist within the context of contemporary art and the possibilities to present art in a new way. We are pleased that it is a question of both.”\n\n\nThe National Gallery of Art in Washington, DC, has received a major gift of more than two hundred works from the artist-in-residence program at the Metropolitan Museum", "The next Biennial should commence in 2021 and will run from March 14 to March 16. The first exhibition, titled Art and Beauty in the Modern Era, will open March 5–March 8. The artists chosen for this year’s show are Yana Paltsev, Grzegorz Wozniacka, Pilar Corrias, Aleksandr Zwem, Anna-Sophia Žezni, Adriana Varejão, and Amara Navarro. The exhibition will focus on the history of the contemporary art and will include works by some 600 artists.  “This year’s Biennial will be a real showcase for the wide-ranging range of our contemporary art,” said Sijman. “With the recent arrival of the new generation in the art world, the biennial is at the forefront of redefining what a contemporary exhibition can be. The Biennial has been at the core of the rebirth of art in the modern era, and I am proud to participate in the opening of this exhibition of the new generation.”\n\n\nThe artist who organized a show in 1989 in the Lower East Side that", "The next Biennial should be held at a location not far from where the exhibition will be staged, as this will facilitate the exchange of information between the two cities. We must ensure that the exhibition represents the diversity of India and represents the best of modern and contemporary art in the country. We hope that this exhibition will inspire young people in India to become inspired and passionate about art and art history. The art of India is inextricably linked with the history of our own country. Every year, we envision a new city in India's capital, in a city that is unique and has the potential to attract global attention. We hope that this exhibition will serve as a model for future exhibitions, and will help to shape the future of the biennial.\n\n\nThe Palace Museum in Melbourne, Australia, has appointed George Williams as its new director. Williams will be responsible for overseeing the transition of the museum’s collection from its current location in a former coal-power station in Mulgrave Street, Melbourne, to its new home in an arts complex designed by architect Herzog & de Meuron. The museum, which welcomed twenty-five thousand visitors in 2017, will be inaugurated with a public celebration on January 6 and will remain closed until March 8", "The next Biennial should be held in 2022, and the first in 2024.\n\n\nThe Sydney Opera House has appointed John Taylor as its new deputy director. Taylor will be responsible for promoting the leadership of the institution as it undergoes a major renovation. The project, which is funded by the Australian government and is set to be completed in November 2021, is being spearheaded by architects Herzog & de Meuron, who are collaborating with the architect and urban designer to create the new building, which will sit in the city, as well as in the surrounding countryside.“John Taylor’s unique leadership qualities and vision for the future of the Opera House make him ideally qualified for this unique role,” said museum director Robert Doyle. “He understands the institutional challenges and challenges of running an internationally acclaimed contemporary art museum, and is committed to building on the legacy of Peter Norman’s landmark design for the Opera House, and to ensuring that the Opera House is transformed by contemporary art.”Taylor will succeed Martha De Neuwirth, who has served as chief executive of the museum since 2015, and will take up the post on September 1. During his tenure at the museum, Taylor has worked on increasing the museum’s footprint by adding", "The next Biennial should be held in the fall of 2020, after the fall of 2020 will be the time of the final exhibition of the current series, “10 Years of Biennials: A Modern History of Modern Art,” slated for November 2021. The festival will also receive support from the National Arts Council, the United Kingdom, and the European Commission.\n\n\nArt historian Marc Payot, who served as interior minister of the French state of Andorra from 2008 to 2017 and was the director of the Palais de Tokyo in Rome from 2018 to 2020, has died at the age of eighty-one. He was a leading authority on the prelapsarian collection of Pablo Picasso, and an advocate of the museum’s reopening in 2021 following a major refurbishment. His daughter, Carola Pimentel, also director of the Palais de Tokyo and the Museo de Arte Contemporáneo Montesima, and the institution’s former director of conservators, Bruno Moll, have credited him with developing a new way of organizing exhibitions, presenting collections that were previously understated, and designing the Palais de Tokyo’s new exhibition venue, the Palais de Commerce, for", "The next Biennial should be held in 2021. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has canceled two upcoming editions of the iconic Biennial, due to concerns stemming from the novel coronavirus. The first was slated to open on April 22 and April 25, 2020. The second, which was originally supposed to take place in May, has since been rescheduled for June 6–June 8, 2020.“We are very concerned about the future of our events,” Mark Lowden, the executive director of the organization, told Artnet News. “Having a platform for the arts and culture to create impact through critical thinking and innovation is critical to the vitality of our local, regional, and federal governments, and to the region as a whole. MoCA has a responsibility to ensure that our programs and our work is an accessible, affordable, and inclusive experience to the community.”During the canceled exhibition, which was scheduled for May 26–May 29, MoCA will also temporarily suspend exhibitions that were previously scheduled and will place the first exhibition of works by the diabolical Ruba Muharman, who has inflicted great suffering and death on millions of people in Central America, and the artist and", "The next Biennial should be hosted at the artist’s home in January 2020. \n\n\nThe New York City Department of Cultural Affairs (CADC) has appointed Keith Aruwinkas as director of design and innovation for urban planning and design. In his new role, which will run through the end of 2020, Aruwinkas will be responsible for advancing the city’s design and innovation goals through a $500 million fund that will be designed by the city’s Department of Buildings and Design.“Keith Aruwinkas is a leading curator and innovator whose work has been recognized internationally, including by the Boston-based design group Lecomte & Grazie, which presented him with the 2019 North Coast Design Awards,” said NYC commissioner Carolyn Porat. “His proven track record and expertise in delivering tangible results in real-world problems make him a strong fit for this important role, and I am excited to support his vision to shape new and more inclusive models for urban living.”Aruwinkas currently serves as director of the Museum of Modern Art’s Center for Design and Leisure in New York. The museum currently hosts more than 1,700 exhibitions", "The next Biennial should be held in 2021.   The Architecture Biennial, which was originally scheduled for 2020, has since been moved to 2021 and will now focus on “intersection of architecture and sustainability.”The next edition of the Architecture Biennial will receive the support of the London-based architecture and design museum, the Tate, Tate Britain’s National Portrait Gallery and the Tate’s own coffers.\n\n\nThe Museum of Modern Art (MoMA) in New York has experienced a surge of cancellations and postponements throughout the week since it opened on September 9. The institution was preparing to welcome visitors at 5 PM on Friday, September 10, but was forced to cancel the event due to concerns over the coronavirus. On Wednesday, Sept. 11, MoMA announced that it is delaying the opening of “The Mysterious Hundred: A Traveling Exhibition,” which was originally scheduled for Sunday, September 12, to allow for “the art of traveling.” The news was a relief for many visitors whose flights had been canceled. On Wednesday, the museum announced that it is expecting around ten thousand visitors this summer, and that the opening of its new space in Manhattan will likely", "The next Biennial should be held in December and will be held in the city of Chelyabinsk, in the southern region of Chechnya, Russia, and will be hosted by the city of St. Petersburg. The agreement between the two cities stipulates that the exhibition will be organized in two stages, with the first being a month ahead of the second, and plans for the exhibition include at least seventy works, including works by artists from the former Soviet republics of Moldova and Ukraine.The fee for the inaugural exhibition was originally slated to be $10,000, but was lowered to $5,000 after the museum was contacted by the artist Nadezhda Savchenko, who was detained by Russian authorities in May 2018 and was eventually granted political asylum by the United States in April.Nadezhda Savchenko, a self-taught painter whose work has been exhibited at the Venice Biennale twice and at the London and New York Biennials, wrote that she had hoped to raise $10,000 for the museum. However, she was told that the funds would only be used for the exhibition, which was to be held at the museum from November 20 to December 21, 2019.The organization behind the event, the Chely", "The next Biennial should be held in 2019. The museum will also be inaugurated with a major renovation project that will involve the reopening of the museum and its surrounding buildings on April 14, 2021. The reopening of the museum will mark the opening of the new exhibition The Female Body and the Body Other, which will be staged at the museum in 2021.The Biennial will also be the first time the museum will be open to the public in March. Kunsthalle Basel, which launched the first exhibition in the new venue in 1994, has had its first exhibition since 1995. The institution was only rebranded as an exhibition space in 2014.\n\n\nThe Museum of Modern Art (MoMA) in New York has released the list of eighty-nine artists who will participate in its upcoming iteration, “Theater for Democracy,” which will run from February 18 to March 19 and will draw from a pool of fifty artists. Titled “Theater of Democracy: The Transformations of Cultural Practice,” the event will also feature installation works, readings, performances, workshops, and other events. The first show, titled “Theater of Democracy: United States during the Cold War,�", "The next Biennial should take place in the autumn of 2021. The institution will present a selection of works that are in the process of being digitized and organized by the Smithsonian American Art Museum (SAAM) in partnership with the National Gallery of Art, with the goal of making the biennial a platform for the exchange of contemporary art from around the world. The institution will also organize tours of the museum, which is currently under construction, and will host an exhibition of work by artists whose works were acquired through donations.\n\n\nThe Tate has announced that it is working with the British Museum (BMA) to create a digital platform for exhibitions that will be accessible by any device. The platform, called Tate Digital, will launch with a selection of works by artists such as Ron Gorchov, Eli Baraka, André Bazin, and Carolee Schneemann, and will provide a means for individuals to have their work displayed online.“Tate Digital is a new way for audiences to discover and experience the arts, through an interactive platform that will be a platform for art and culture,” said Mark3D, the company that runs Tate Digital. “It will allow audiences to discover and experience artists across the globe with an", "The next Biennial should be in 2020. \nAs activists and activists for social justice continue to mobilize against white supremacy and police violence, artists are paying heed to their artists’ messages. Activists are urging cultural institutions to suspend programming and reduce exhibition engagements with controversial exhibitions and artists in an attempt to draw attention to systemic racism—a message the art world and progressive causes are responding to in myriad ways.Below are a few examples of artworks, performances, performances, and other works that activists are encouraging individuals, institutions, and institutions’ leading institutions to boycott or donate proceeds from this week’s edition of Art Basel Hong Kong, which was canceled due to the ongoing protests against police violence in the city.While the protests against police violence have been ongoing since July, the weekend of May 25 to May 28 saw the largest demonstrations against police violence since the protests began. Protests were also held in other cities and by non-governmental organizations, including New York, London, and Hong Kong.As the art world clamored for action, a number of cultural institutions and organizations have taken matters into their own hands. Many are voluntarily suspending programming, reducing exhibitions, or postponing upcoming events. The Seattle Art Museum has pledged to boycott all future", "The next Biennial should take place at the city’s Museum of Fine Arts, which is currently undergoing a $750 million expansion, on the city’s campus in 2021. \n\n\nThe Museum of Fine Arts (MFA) in Los Angeles is planning to eliminate fifteen hundred jobs at its Los Angeles branch, which has been closed since March 11 due to the Covid-19 pandemic. The news comes on the heels of the news that the museum’s current staff will not be able to work through the end of their contract until March 2022.“The staff is suffering,” MFA director Andrew Kreisberg told the Los Angeles Times. “We are acutely aware of the challenges of running a museum that is one of the world’s leading cultural institutions and has been for thirty years. As such, we have invested hundreds of millions of dollars into our Los Angeles location over the past twelve years. In an effort to mitigate the impact of the Covid-19 pandemic on our staff and on the institution’s entire community, we have reduced the hours of most of our full-time employees and laid off or furloughed dozens of part-time staffers in an effort to streamline the", "The next Biennial should be announced before the end of the year. The exhibition will also include a selection of work by artists that have not yet been featured in the Biennial, which will focus on issues such as art and identity that pose different challenges in the contemporary world. The exhibition will feature work by artists such as Hélio Oiticica, Isabel Cruz, and Walter de la Barra, among others that have not yet been represented in the United States. The fifth edition of the Biennial will feature works by artists from forty countries and will take place in the Los Angeles County Museum of Art (LACMA), the National Museum of Women in the Arts, the Los Angeles County Public Library, the Los Angeles County Museum of Art, the Metropolitan Museum of Art, the Museum of Contemporary Art, Los Angeles, and the Museum of Modern Art. “We are thrilled to be working with various local, national, and international artists to bring these works to life for the first time in the United States,” said Mark Rosenblum, the executive director of the National Center for Biennial Studies. “These artists are the future, and they are our future. By reflecting on their work, we hope that they will consider the", "The next Biennial should be held in 2020, when she will be seventy-four. She will be the oldest recipient of the prize; José Miguel Pérez-Guarán, the winner of the prize in 2013, died of cancer in 2019.\n\n\nThe Los Angeles County Museum of Art (LACMA) has received a gift of more than three hundred works by artists from the Eastern Seaboard as well as the Western Hemisphere. Among the works that will be presented this year are fifty from the Carolingian region, forty from the Carolingia, and thirty-two from the New England region, including four from New England, the Carolingia, and the Carolinas.The gift includes works by forty-two artists from the Carolingians, forty-one artists from the Carolingia, fifteen from the New England, and eleven from the New Englandas well as five paintings by John Dekker, a Georgia-born artist whose signature is characterized by a wide, open canvas that is layered with geometric, sculptural, and fabric-like details.The institution also revealed that it plans to restore and reopen the Metropolitan Museum of Art, the Whitney Museum of American Art, and the Los Angeles County Museum of Art.The institutions are", "The next Biennial should be in the spring of 2020, and will be organized in conjunction with the Winter Olympics in February. It will take place in the city of Basel in Switzerland. The art of the exhibition will be curated by Sara Armato, curator of contemporary art at the Museo de Arte Contemporáneo and a jury member of the 2020 biennial. Art historian Sophie Hoenig, the president of the Exhibition Committee of the Art Museum Prado, will serve as the artistic director of the exhibition. The development coincides with the opening of Artforum’s 20th anniversary , which will be held in Munich from January 25 to January 28. The event will take place at the Helsinki Opera Hall, which currently houses the venue for the annual Art Basel Biennial. In March 2020, a new exhibition of work by Harvey Gant will open in New York. Gant will present six works on paper: one performance, a six-day performance, a forty-four-hour film, an installation, and a performance. The show will be curated by Vincent van Gogh and features the work of Bonhams and Humberto Alarcon.The bi", "The next Biennial should be held at a location that will be accessible to the public in the city of Vallejo. The space will be part of the city’s $50 million $150 million redevelopment of Union Pacific Station, which will introduce a new museum and community space designed by architect Frank Gehry. The $12 million and $15 million museums will be located at 1100 S.E. Fourth St.\n\nThe Boston Art Museum (BAM) has appointed Mary Ellen O’Connell as its next executive director. O’Connell comes to the museum from the Museum of Fine Arts Boston, where she has served as deputy director for the past twelve months. Previously, she served as associate curator at large for contemporary art at the New Museum in New York from 2011 to 2015.“In her new role, O’Connell will be responsible for guiding the museum through its reopening in January 2021,” said museum director James Steward. “The appointment marks the first time an African American woman has been appointed to the board of directors of a major arts institution in Massachusetts. O’Connell’s appointment also follows the museum’s successful reopening, which was viewed as a victory by African Americans", "The next Biennial should be held in the spring of 2021.\n\n\nThe Natural History Museum in London has appointed Markus Asthana as its next director, effective immediately. Asthana, who has worked at the museum for more than fifteen years, succeeds Nick Mitzevich, who retired in March 2019 after eighteen years at the institution. “We are delighted to welcome Markus Asthana to the Natural History Museum,” said Nick Pickles, the museum’s director and chief executive, “and are committed to working with him to ensure he is able to deliver on the vision he has set out for the museum.” Asthana succeeds Lonnie Rennie, who has served as director of the Natural History Museum since 2008, and will take the helm from Lonnie de Mee, who retired in August 2019. Prior to joining the museum, Asthana held various roles at the institution, including curator, curator of modern art, and director of education and visitor experience.In his new role, Asthana will continue to be involved with the museum’s collection and research, and will continue to work with its curatorial team to develop new exhibitions and other", "The next Biennial should be held in 2020.  “The biennial is one of the most important and most challenging tasks that museums have ever undertaken,” according to Liselle. “It is a task that will require a thinking of the marks of a unique, complex and disparate world, and a way of thinking of the past, the future, and the future.”\n\n\nThe Museum of Fine Arts (MFA) in Boston has hired Carolyn Haus, who previously worked as the executive director of the Museum of Fine Arts (MFA) Atlanta, to head the newly formed, nonprofit biennial “Tireless.” The biennial will be led by curator and art historian and artist Jodi Throckmorton and will focus on the relationship between art and landscape, and will take place in the MFA’s former location in West Roxbury, Massachusetts.“In this moment of great uncertainty for American culture, Carolyn is the perfect person for the role at MFA,” said MFA’s director, Jennifer Yates. “Carolyn puts the MFA at the forefront of cutting-edge research and creative practice, and embodies a vibrant, intellectual, and creative spirit", "The next Biennial should take place in the late spring of 2020 to mark the occasion. The exhibition will run parallel to the 50th anniversary celebrations of the three major political parties in Hong Kong: the Democratic Party, which was founded by pro-democracy pro-democracy lawmakers and has since become the largest opposition party; the United National Party, which comes from the former Ku Klux Klan; and the National Union of Journalists, which has been accused of supporting pro-democracy demonstrators.\n\n\nThe London-based arts organization the British Council has announced that it is planning to remove from the red-carpet the very collection of Paul Mpagi Sepuya and Hui Jie, the two artists whose works were recently selected for the 2020 Venice Biennale. The duo were chosen by an international jury comprised of Peter van de Wijngaard, Felicity Hammond, Bina El Knaar, and Alex Waddington.“The British Council will not be accepting new works by these two artists in 2020, since they are no longer invited to represent the UK at the Venice Biennale,” said British Council artistic director Hamish Macgregor. The decision was made in the lead up", "The next Biennial should be on November 25, 2020. The 2020 exhibition will include work by more than one thousand artists and will be hosted at the Accademia di Palazzo Grassi in Venice. The 2020 exhibition will be organized by Sanaa Abuayati, Emanuele Rinsan, Sohrab Mohebbi, and Darian Mosa. “The theme of the exhibition is ‘reconstitution and new forms of life in our society. It is about the reconstruction of a new reality, based on the principles of justice and solidarity, and the forging of new bonds in the midst of the crisis,” said Sara Catanzaro, artistic director of the exhibition. The exhibition, titled “Reconstitution and Life in a Time of Crisis,” will be staged by Sara C. Martin, director of the New York–based nonprofit art center ART for Puerto Rico, which has partnered with the Puerto Rican government to organize the exhibition since 2013. ArtistsTania Bonilla, El Cabo de Vaca, Puerto Rico; Manny C. Ortiz, Puerto Rico; Hiromi Ota, Japan; L", "The next Biennial should be on the history of the exhibition, a selection of works from the show “Black and white” curated by Guggenheim curator Joachim Liebmann. The exhibition will also feature works by the artists represented in the exhibition.A selection of works by the artists represented in the exhibition “Feminine” will also be presented in the same year. The exhibition will also include a selection of paintings and sculptures by the same artists represented by the show.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles plans to launch a new digital platform that will allow visitors to remotely view and view-in-person works in its collection through the museum’s new virtual reality (VR) experience. The new platform, called the MoCA 360 VR, will be free to the public for a limited time in January 2020 and will be free to the public three times a week through the end of the year.“In recognizing the transformative impact VR has had on culture and the culture of our time, and recognizing the need for MoCA 360 VR to be a platform for exhibition-quality exhibitions, we have created a new interactive experience that will allow visitors to experience our collection in a new way,�", "The next Biennial should be held in the spring of 2020. “We are grateful for the support and interest of the City of Rochester and the citizens of Rochester,” said Mayor David Bell. The biennial has received $1.3 million from the Rochester Arts and Cultural Partnership (RACP) to date. The funds will go toward developing and promoting the event. According to the Art Newspaper, the 2020 event will be “staged on the downtown waterfront in the Fall of 2020, with a new, larger, and more expansive headliner”\u0097the 2018 event, which was held on the waterfront, drew an overall viewership of 9 million. The 2020 theme is “Living Together: The Importance of Family and Community,” and the 2020 running total for 2021 will be $5 million. The 2020 biennial will also include a new film, a new production, and a new live performance. We are thrilled to feature the 2020 biennial in our collection and to introduce our collection to you in a new way. We hope you will join us in our celebration of the twenty-fifth anniversary of the biennial. We look forward to seeing you at", "The next Biennial should focus on a group exhibition of works by a select group of the best known contemporary artists in the United States. The group will be asked to present a work in the run of a contemporary artist’s life and will be given a specific theme. The first exhibition will be in the gallery of the Museum of Modern Art, New York, in April 2020 and the second in the museum’s collection in May 2020. The museum will also host a retrospective of Richard Avedon’s work in September 2020. \n\n\nThe Metropolitan Museum of Art (the museum) in New York has appointed Kathleen Edwards as its new deputy director for collections and exhibitions. She will be responsible for the management and strategic planning of the exhibition program, the collection, exhibition, and archiving of Tony and Lorraine Schwartz’s work, and the presentation of works by the artist-in-residence, Jean-Michel Basquiat.“I’ve been a fan of the Schwartz’s work my entire life, and have been following their careers since the late 1980s, when I became a board member of the Schwartz Gallery,” said John Yeomans, the board president. “I�", "The next Biennial should be held in 2020, and the time will be fixed, the organizers said. The first event, held in 2022, was postponed due to the Covid-19 pandemic. In 2020, the exhibition will be held at the Art Institute of Chicago (ICA) in Chicago, and in 2021, the exhibition will be staged at the Museum of Contemporary Art, Los Angeles.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines for the engagement of museums and cultural sites with the coronavirus (COVID-19) outbreak in the United States. The guidelines, which were developed by the office of cultural affairs commissioner William L. Conway, outline steps that can be taken to reduce the spread of the virus, including encouraging travelers to avoid close contact, preparing for a possible public health crisis by limiting travel, conducting regular health screenings, and limiting outdoor activities.“With the coronavirus outbreak in the United States continuing to grow, the DCLA has developed new guidelines to help museums and cultural sites manage the risk of exposure to the virus, which include designing and developing prevention and public education activities for visitors to visit, and providing information about preventive measures and resources,” said cultural affairs commissioner Kimerly R", "The next Biennial should be held at the Museum of Contemporary Art in the Arts, in 2020. The event will be hosted by Pierpaolo Zingaretti, whose project was commissioned by the artist, and will take place in the museum’s newly renovated building, which will be renamed the Museo Pontifico della Terra di Roma. The museum will also build a new campus at Bologna, and plans for the future of the museum are currently being developed.\n\n\nThe National Museum of Fine Arts (MMFA) in Cincinnati has welcomed twenty-three new members to its board of directors, which is chaired by Roberta Sparrow, and has sought to promote diversity and inclusion in its leadership. In a letter to the public, Sparrow said she hopes the new members will “enhance the museum’s mission to provide a national exhibition and exhibition program that reflects the diversity of our nation’s inhabitants.”“The current board is made up of two men and two women, but I feel that there are a number of outstanding women who have led institutions and organizations in their lives that have had an impact on shaping our culture and who I hope will continue to have an impact in the future,” Sparrow", "The next Biennial should be held at the San Francisco Museum of Art, which recently underwent a $12 million facelift. The institution has since received more than $30 million from the county for restoration projects. \n\n\nNew York–based dealer Michael Kimmel has been sued by the attorney general of New York, Eric Donovan, for attempting to sell a work by the late Israeli artist Tzvi Ben Ismail (1924–2005). The work, Eli Ben Haimowitz’s Concerto for the Jewish People, was one of thirty-one works by the artist to be included in the upcoming exhibition “Between Two Worlds,” which will open in Zurich next month.According to the New York Times, the works were purchased by Kimmel in 2015 for $5.5 million, but the dealer recently discovered that they were worth $30 million. The dealer then agreed to sell the pieces to the collector for $2.5 million, but only after he signed a fifty-year contract promising to pay a one-hundred percent premium over the cost of the works. The state has since accused Kimmel of violating the Artists’ Protection Act, which states that a dealer must “provide reasonable and articulable evidence", "The next Biennial should focus on exploring how contemporary art has been transformed through urbanity and the urban environment, with a particular focus on the role of performance and the physical environment within a multi-disciplinary narrative. In addition to exploring the relationship urban landscapes and art as well as art and the physical environment, the Biennial will strive to find new ways to support the work of artists within the context of an indigenous Indigenous perspective.”\n\n\nThe National Gallery in London is launching an online viewing room for artworks. The site will be curated by the visual arts curator, artist, and writer Clement Attridge, who was knighted for his services to the visual arts in 2018.Clement, who is known for creating a show about traveling and urban life for his magazine, Art in the Age of Mechanical Reproduction, also curated the exhibition “Self Portrait” at the National Museum of Art in Washington, DC, and the exhibition “Towering Cities: Planners and Architects of the American Dream” at the Museum of Modern Art in New York.“I am thrilled to help the National Gallery become a great place for visitors to see art from the collection, as well as better understand the artmaking, design, and culture of", "The next Biennial should also feature the work of Lorena Flumm, Tania Bruguera, Andrea Cicutto, and Carmen Casals, who will be honored at a special exhibition at the Biennial. “The 2018 edition of the Biennial was a fantastic success, with twenty-six artists nominated for awards, and featured works by some of the most prominent artists of the last decade, including Yelena and Yuriy Strelkov, Viktor and Nina Shishkina, Sara Cwynar, and Sara Riggs,” said Monica Meneguzzo, director of the Biennial.  \n\n\nThe Serpentine Galleries in London announced today that it is planning to open a new 45,000-square-foot exhibition space in the building’s upper levels, dubbed the Serpentine Row, that will present contemporary art. The five-story, sixty-one-thousand-square-foot, contemporary art space will be inaugurated by Nicole Moll, the first artist to be awarded the Royal Academy of Arts fellowship, on October 5, and will be modeled after the Serpentine Gall", "The next Biennial should take place in 2022, with an exhibition to follow in 2021. The 2019 edition, “Astrid and Tony',” witnessed the return of the artist-run space Shorty Contemporary and showcased work by forty-four female artists. The exhibition was curated by Rachel Whiteread, who has previously served as curator of the Contemporary Arts and Art in London, and featured works by artists such as Beth Dorsch, Susan Eek, and Wasim Akram.The 2019 exhibition also featured the first exhibition of work by artist-run organizations in the United Kingdom, with the proposal of “Aston Martin” (2019) and “The St Margaret” (2019) respectively, and marked the first time the biennial was presented as part of a major British arts department. Commenting on the initiative, Eric Bloom, chief executive of the biennial, said: “These are challenging times and it is vital that people think of art and the arts in the broader cultural context. It is a challenge that must be overcome not only by artists, but also by the institutions and the communities they represent. And it is a challenge that will require bold, innovative thinking, not least from those who are not familiar with", "The next Biennial should be held in the spring of 2021. “We are constantly working with existing and prospective partners to shape the theme and venue for next year,” said Catherine Wilson, director of the Smithsonian American Art Museum (SAAM). “I am excited to watch the 2019 Biennials unfold across six venues and am eager to continue to shape the exhibition program and the program through 2021.”Wilson will preside over the 2019 biennial—which was inspired by the collections of four leading American art museums: the Museum of Modern Art, the Metropolitan Museum of Art, and the Whitney Museum of American Art—at the Smithsonian American Art Museum in Washington, DC.  In an editorial published by the New York Times on August 5, 2019, the editorial board of that newspaper praised Wilson’s leadership and integrity in bringing the exhibition to life. “Her vision and tremendous energy have put the exhibition in a position to inspire a new generation of collectors, curators, scholars, and artists,” the editorial board wrote. “The exhibition will reopen in 2021 as a major new project and will address issues of identity and representation in select works by a diverse group of artists, including Eldar, James Cuno,", "The next Biennial should take place in the city in 2021.\n\n\nThe British Museum has appointed Alexandra Mallick as its next director. Mallick currently serves as the curator of contemporary art at the Royal Academy of Arts, where she was appointed in January 2018. She succeeds Lilyn Macgregor, who was appointed as director in July 2017. Mallick succeeds Lilyn Macgregor, who was assistant director of exhibitions at the museum in London, who retired in August 2019 after a decade at the institution. “Alexandra Mallick’s appointment is a momentous occasion and she is a highly capable leader who has the potential to shape the next decade at the museum,” said Museum Director Anneke Wirén. “We are grateful to her for her extraordinary achievements and look forward to welcoming her to the board. She is a leading curator, writer and educator, and we look forward to working with her and her team.”In the new role, Mallick will lead the museum through its first major renovation project, “Monumental: The Art of Music” (2019–20), which expanded the museum’s collection and added more than 1,500", "The next Biennial should be in 2020, Cameron told the Art Newspaper: “We will see. We will see what happens. We will see what we need to do to make the right choices. We will see if we are being listened to. We will see what happens. We cannot change ourselves, but we can change the world. . . . It is up to us to act.”\n\n\nFormer Tate director Maria Balshaw has been appointed interim director of Tate Britain. She will be responsible for promoting the leadership, training and strategic direction of Tate’s arts and cultural staff, with a view to reopening in 2021.The appointment of Balshaw, who has led the institution since 2013, follows the announcement of the Strategic Culture Plan, the 2017–18 financial update, and the appointment of Chris Packer as chief executive. Balshaw succeeds Richard Spielman, who was appointed as interim director in August 2019, and will take up the post in January 2021. Tate is one of the UK’s major cultural institutions and will be formally reopened in the first half of 2020. The announcement of the plan, which includes a number of initiatives that have been underway since the 1970s, including", "The next Biennial should be held in 2020. The first of the series, which began in 1994 with the death of Italian fashion designer Enrico Castiglione, will take place in Rome in 2021. In both cases, the theme of the exhibition will be “fashion, politics, and the exploitation of the body.” \n\n\nThe Palo Alto Museum of Art (Palo Alto) in California announced this week that it will reopen to the public in 2021 with the exhibition “Fashion. Fashion, Politics, and the Body: Fashion in the 1960s”. The exhibition will showcase more than two hundred paintings by the American artist Peggy Sargent, who also designed the pieces for the show, which will run through March 21. The exhibition will also present a new collection of films by the Italian director Federico Fellini, a new public sculpture garden in the museum’s lobby, and a redesign of the museum’s courtyard.Palo Alto also announced that it will open a new public art space in the museum's lobby in 2021. Designed by the artist-designed firm W.A.S.E Architects, the space will be located in an open-concept, glass-walled building on the", "The next Biennial should be held in 2021. In 2021 the exhibition will be hosted by the Institute of Contemporary Arts, Paris, and will be introduced as the “Ecole des Beaux-Arts” (The Earth and Art Museum). The new art museum will boast of a central gallery, a research library, a club, and a bookstore. The museum’s first project will be the installation of the work “Ludwig Lang,” 2018–19, at the new Metropolitan Government’s headquarters in Manhattan. The work will be a reimagined version of the German artist’s famous “Thousand-Year Reich” (1936–1965).“The concept of the museum is to create a platform for the exhibition of work that is not normally exhibited,” said Alfredo Medrano, chair of the museum’s board of trustees. “This is a major departure from the current exhibition format, and one that is going to open the first exhibition.”The announcement of the changes was made at the end of a year that saw the development of new international programs, the launch of numerous new publications, and a number of exhibitions that were moved forward by the", "The next Biennial should be on   Art and art history, from the late nineteenth century to the present. The themes of the fourteenth and fifteenth editions will be: Art and the Age of Enlightenment, Art and the Modern Age, Art and the Body, and Art and the Future. At the same time, the exhibition will feature an exhibition of works by thirteen artists whose work is currently on display at the Museum, including Nada, Dario Catellani, Edward Kmett, Bryce Mason, Louise Knapel, and Olaus von Adlerschön. The project will also focus on what it means to be an artist in the twenty-first century. The exhibition will explore the history of modern art and how it has been shaped by the conflict and persecution that have been experienced by artists and activists in the region.\n\n\nThe New Museum in New York has appointed Paul Schell as its next director and CEO. Schell comes to the institution from the Museum of Modern Art (MoMA), where he has served as the interim director since May 2019. He succeeds Susan Talbott, who departed the institution in March 2020 to head the Los Angeles County Museum of Art, and will take up the post on August 1.“We", "The next Biennial should be held in 2021 and will begin hosting the works in 2020. We are actively assessing our options. The Centre will also be remodelled and relocated. The construction of the new museum will begin in 2022. The Centre will be inaugurated in 2022, the year of the 150th anniversary of the birth of Mozart. The Centre will be inaugurated in 2023, the year of the 200th anniversary of the birth of Marx. Battaglia's new building, designed by the renowned Italian architect Stefano Cattaglia, will be inaugurated in 2024. In the coming years, it will be used by the Centre for Contemporary Art (CCA), a new branch of the Museum of Modern Art, and the Centre for Cultural Heritage (CCH), a smaller museum. \n\n\nThe New York City Department of Cultural Affairs (DCLA) announced today that it is granting the artists who were denied the right to perform at the city’s public art fairs the status of a “special purpose entity” and will begin a process of reorganization to streamline the organization.According to a statement from the department, the DCLA has made “significant progress�", "The next Biennial should take place in 2020, the director of the Museo de Arte Contemporáneo in Buenos Aires, Emil Miro, told El País. The new project will involve artists from across Latin America and will be led by the Argentine-born artist, critic and curator Guadalupe García.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has announced its representation of work by São Paulo de Mendoza, a Brazilian conceptual artist who has resided in the United States since 1971. The artist, who currently serves as a graduate student at the University of Wisconsin, has a longstanding practice of drawing and printmaking that includes paintings, drawings, sculptures, prints, posters, photographs, and other works that address issues of memory, memory politics, and memory science.Born in Salud, Brazil, in 1947, the Brazilian artist moved to the United States in the 1960s. He enrolled at the University of California, Los Angeles, and graduated from the art school in 1972. In a 1971 retrospective at the Art Institute of Chicago, he collaborated with the late architecture critic Peter Zumthor and the late photographer and collector Katsu Matsumoto.\n\n\nThe Estate of the late British director Steven", "The next Biennial should be on the theme of the Body: from Modernity to the Body, which will be held at the National Museum of History in Warsaw in May 2020. \n\n\nThe Tate has received a major blow to its finances after it announced on Wednesday that it will not be able to pay its employees through the end of the year due to the austerity measures implemented by the UK government in the wake of the Brexit vote.According to the Times, from March 19 to March 22, the Tate had to make more than $1.2 million on an average day—a drastic increase compared to the $750,000 it made the previous three months. The New Art Newspaper reports that the Tate’s director Maria Balshaw and chief operating officer Camille Blundell both quit on Wednesday, March 16, but Blundell is claiming that she has since been taken off the payroll and will continue to work as a consultant while she undergoes treatment for cancer.The decision has forced a change of plans for many staff, who are now hoping that the government will re-open the National Lottery, the Oyster Boat, and other tourist activities as planned. However, the announcement has also reignited concerns that the Tate will not be able to", "The next Biennial should be held in 2021 and will be hosted at the Museo de Arte Contemporáneo (MAS) in Madrid. The event will be organized in collaboration with the local government of Kassel. The total cost of the exhibition is $6 million and the organizers say the project will be funded by a grant from the European Regional Development Fund (ERDF), the European Fund for Cultural Growth (EFCG), and the European Fund for Cultural Heritage.The project was launched by the private nonprofit organization Casa Alianza. Its director, Maria Cisneros de Castro, said: “Twelve years ago, the artists who have participated in this exhibition were starting to feel marginalized in the Spanish arts scene. . . . Our project in collaboration with MAS and the local authorities aims at reining in the discursive practices and the discursive discursive techniques of the exhibition.”The exhibition will confront contemporary issues such as queer rights, climate justice, and immigration; while also focusing on how art can play a positive role in fostering social cohesion and fostering social change. The exhibition will be curated by Alfonso Cuervo, the director of the Museo Arte Contemporáneo", "The next Biennial should include the exhibition “NIRIN: A STUDY IN CONTEXT,” which will be a retrospective of the first exhibition, “NIRIN: THE GOLDEN YEAR 1989” (2018–2019), at the Biennial. The biennial will be held at the Museo de Arte Contemporáneo Fisichetti in Bergamo, Italy, from March 21 to March 31, 2020. The inaugural event, “NIRIN: THE GALLERY,” was staged by the Museo de Arte de Bergamo in 2016 and featured works by sixty artists, including Joël and Zidoun Holle, and the exhibition featured the exhibition of work by twenty-four artists who were not included in the previous edition. The 2019 edition of the Biennial, “NIRIN,” was staged by Samuel Konkin in the museum, which is located in the city of Turin, Italy, and was held in partnership with the Fondazione Risorgimento. The 2018 edition, “NIRIN,” was curated by Giancarlo Gaudino and featured the exhibition “Risorgimento�", "The next Biennial should be held in 2020.\n\n\nThe Royal Academy of Arts (RA) in London has commissioned a new work by artist and educator Oscar Murillo to commemorate the ten-year anniversary of its founding.“It is a great honor to commission a work by one of our most celebrated artists,” said RA president Nicholas Cullinan. “Oscar’s work will be a landmark in the development of the RA, marking its twentieth anniversary, and also in the history of the academy. Through a series of interrelated questions, the work will evoke a sense of nostalgia and insight into the RA’s past and future.”Born in 1971 in Barcelona, Murillo moved to London in 1998 to study at the School of the Art Institute of Chicago (SAIC), where he first met and befriended Jonathan. The pair married in 2011, and the following year, they launched an arts residency program at the RA, which soon became a popular venue for international artists to work.In 2015, the residency program was awarded an MBE for services to the arts and the RA, and Murillo was invited to join the institution at an exhibition of paintings by Alfonso Pedrosa. In 2017, the residency program was", "The next Biennial should focus on the art of dissolution. When we realise that dissolution is the art of being, when we realise that dissolution is the art of becoming and when we realise that dissolution is the art of transformation, our work will be able to take on other dimensions.”The exhibition will feature work by thirty artists, including Frederic Barbeau (Tanger Out of Time), Michael Beasley (The Beginning of Everything), Johanna Britten (The Beginning), Allen Thomas (The Beginning of All Things), Amy King (The Beginning of All Things), Kathy Lynne (The Beginning of All Things), Sylvia Lenoir (The Beginning of All Things), C.Z. Marzio (The Beginning of All Things), George Mastronardi (The Beginning of All Things), and Tomasz Klimczyk (The Beginning of All Things). The Los Angeles County Museum of Art (LACMA) said it will present a new exhibition of work by sixty-one artists in early 2020.\n\n\nThe Metropolitan Museum of Art in New York is currently working on a redesign that will change the work, which was completed in 1978, into a new", "The next Biennial should take place in 2020, with the exhibition still on view until May 2021. The 2018 edition featured work by seventy-eight artists, including Alice Ailey, Mark B. Smith, Diana Iannone, and Robin Jamison, and was held at the Fridman Center for the Arts. The 2020 edition will be curated by Christopher Collins, who will hold the role of curator for the biennial for the next two years.“We are thrilled to be partnering with Artnet and the Boys and Girls Clubs of America, who have donated funds to launch Artnet Biennial, to help bring these amazing works of art to their communities,” said Mark Rinaldi, director of the Boys and Girls Clubs of America. “We look forward to the 2019 and 2020 editions featuring a full roster of artists.”The 2019 edition, which received a prize of $4 million from the Weston Foundation, featured work by thirty-three artists, including Dwight D. Griffith, Charles Gallatin, John Amis, and Roger Cicala, among others who were selected by a jury made up of Charles Egeran, Adrienne Edwards, Nan Goldin, and ", "The next Biennial should be held in the spring of 2021.The exhibition will focus on themes of interdependence and interdependence as well as to examine the interconnections between artists and institutions. The Grand-ducal-Myrtis will hold a series of exhibitions dedicated to the work of artists such as Rintoul, Leclerc, and Celal, as well as performances and other events. \n\n\nThe 2018/19 season of the Wyeth Festival in New York City will be the last before it is shut down for the foreseeable future due to Covid-19. The postponement of the event, which runs from March 8 to March 10, will be made amid a severe financial crisis for the festival. The sudden closure, which took place after the pandemic began in late March, has forced the cancellation of over thirty events, including the New York City Ballet, the Metropolitan Museum of Art, and the Whitney Museum of American Art.“We are now facing a critical juncture,” festival director Matthew Higgs said in a statement. “The short- and long-term effects of Covid-19 on the broader cultural ecosystem are profound. We are acutely aware that we need to do everything we can", "The next Biennial should welcome visitors in 2020, and will undergo a revamp to include exhibitions that reflect the current tensions in the region. The art of the Contemporary, the exhibition of works in accordance with a local and personal vision, will be presented by a panel of twelve artists from the Palazzo Nazionale di Lando. It will also include a special exhibition of work by artists whose works have yet to be exhibited. The new location for the art will be located in Rome\u0097the old space was destroyed by fire in December 2022.\n\n\nThe New York–based nonprofit the Jewish Museum in Jerusalem has received a gift of twenty-two works by contemporary and celebrated Palestinian artist Fadi Hamdan, who died in Israel in 2003. The donation includes a selection of works that were created before and during the 2014 Protective Edge resistance campaign, which targeted the Israeli military and resulted in the deaths of hundreds of Palestinians, including dozens who were beheaded and others who were crucified. Hamdan’s work was formerly on display in the museum’s exhibition “Making Peace,” which opened in April 2019. Since then, the museum has been exhibiting works by Palestinian artists, including Fadi Yusuf, Ali Yass, and Ahmad", "The next Biennial should take place in 2021 and will feature work from twenty-six artists. The selection will be presented in partnership with the Fundação da Heredie. The full list of speakers is as follows:Janina Bojana, Fortaleza, BrazilAlberto Bonifacio, Sao Paulo, BrazilYelena Biczel, London, EnglandJulia Bouvier, New York, USABénédicte de Lille, Paris, FranceLili Báezal, London, EnglandBernd and Tracey, New York, USALoretta Bayer, New York, USAAmanda Bassett, New York, USAPaul Boulanger, Nairobi, KenyaMarianne Bochner, Nairobi, KenyaSara Buckley, Princeton, New Jersey, USANathalie Bouchard, New York, USABertrand Bourgeois, Paris, FranceZoey Bulton, New York, USASamantha Boswell, New York, USAKarin Cairns, London, EnglandDiana Carcarlo, New York, USAScottie Cavalli, New York, USAEduardo Cervantes, Mexico, USAMichael Cassuto, New York,", "The next Biennial should take place in 2020.\n\n\nLos Angeles’s Museum of Contemporary Art (LACMA) has been awarded a $16 million, five-year grant from the Richard and Helen DeVos Foundation. The $5.8 million benefactor, who has been active in LA’s arts and cultural sector since the 1980s, gave the arts arts-focused museum $12 million for its 2020–21 season.The funds will be used to expand the center’s programming, enhance the collection and exhibition-making, and enhance the museum’s infrastructure. The expansion and development plan, which includes the construction of a proposed twenty-first-century annex to the institution, was approved by LACMA board chairman Michael Guggenheim and director Elizabeth Alexander, who named the project’s director and president in January.The expansion will add two new stories within the existing building and will add 3,200 square feet of gallery space. The project also aims to improve the museum’s transportation and accessibility. The new space will offer a new exhibition space for the museum’s existing collection and will host new exhibitions and concerts.The $1.2 million expansion of the museum’s current exhibition space has", "The next Biennial should be held in 2021. SickKids will provide a platform for this work, which deals with the ongoing global battle against childhood obesity and the long-term effects of the pandemic.“I’m honored to be a partner of the hospital and to present a work by the top artists, designers, and musicians in the world, and to bring their work to SickKids to engage with the themes of the year,” said SickKids director Gus Van de Velde. Challenged by the children of patients who lost their way through the biennial, the institution staged an open-call to select forty-three artists to participate in the event. Among the artists chosen were Gregorian Chant, Simon G, Koen de Bruijn, Stephanie Desjardins, Loring Mitchell, Christina Nocenta, Matthew McConkey, Robert Rauschenberg, Shepard Fairey, and Hans Ulrich Obrist. The biennial will be held at the Gotha Rämistadt, a former factory in the former textile industry complex in the city of Karlsruhe, in the city of Espoo, Sweden, from May 26 to May 28.The event will also feature", "The next Biennial should focus on the digital role of the artist in relation to the archaeological and cultural heritage of the State, and how this connection can be renewed in the interest of the country, the world and the State.” Since the exhibition was inaugurated by President Mario Monti in 2019, the International Biennial has expanded to include a number of other artists, including Harjant Gill, Terrence Higgins, Hiebne Sender, David K. Gallant, and Michelangelo Antonioni.\n\n\nThe Museum of Fine Arts (MFA) in Boston recently unveiled a new public art installation that will introduce work by contemporary artists to the museum’s original collection of works created by the late poet laureate Sylvia Abraham Lincoln. The work, titled “National Safety,” will move across the museum’s entire footprint, including the Lincoln Center, the Edward H. Kennedy Center for the Performing Arts, and the Lincoln Memorial, and will debut in a month’s time.The installation, entitled “Breaking the Silence: Reclaiming the American Musical,” will feature works by artists including Pearl Bailey, Joshua Helmer, and Naomi Campbell, among others, and will be installed in Lincoln�", "The next Biennial should be held at least once every other year, it said.\n\n\nThe prestigious Museum of Modern Art (MoMA) in New York announced today that it is launching an initiative to help artists struggling financially due to the Covid-19 pandemic. The program will include job fairs, artist residencies, and other support, and will draw from the collections of MoMA’s sister institutions the Metropolitan Museum of Art and the Whitney Museum of American Art in New York, to help distribute $300,000 to struggling artists.“This is not a crisis for art museums alone; it is a crisis for an entire ecosystem of cultural institutions that depend on artists for a paycheck,” said Peter W. Jones, director of the Museum of Modern Art. “As the crisis worsens, artists are recognizing that their work is central to a thriving art ecosystem. We are asking artists to lend their art and know their collections to the museum so they can help us care for it and care for our artists.”The initiative will initially focus on artists whose income has been impacted by the Covid-19 crisis through October 31. During the month of November, the program will continue to offer support to some of the thousands of artists", "The next Biennial should be held in 2022. The museum will relocate from its current location, which is in the city of Zurich, to a new facility designed by the renowned British architect, Sir Nicholas de la Mare. The design, which was acquired for the Biennial in 2015, will consist of eight exhibition spaces, including a café, an apartment, and an outdoor terrace. The project is part of the museum’s long-term plan to connect the museum’s two buildings, a new museum for contemporary art and an extension of the museum for contemporary art history.The new building will be 6,800 square feet, approximately twice the size of the former Biennial building, which was completed in 2010 and houses approximately 800 artworks. The new museum will be positioned to the northwest of the former building. It will include a grand auditorium, exhibition galleries, classrooms, and a public galleries.The museum’s signature exhibition, “Theater of Operations: The Gulf Wars” (2019), will now be hosted at the new museum. The exhibition will be an extension of “Theater of Operations: The Gulf Wars” (2015–16), a series of presentations organized around the theme “War and International Law", "The next Biennial should be held in 2021.  \n\n\nThe Museum of Modern Art (MoMA) in New York has begun welcoming visitors from Puerto Rico, the United States, and other territories under the terms of a deal announced overnight last month. The museum, which has an additional space dedicated to contemporary art in its recently renovated building, said it hopes to have those territories’ visitors by March 15. The next edition of the FABIO (Farmione Americano) will take place in September.“This is a historic agreement that was reached by two historic partners, the Metropolitan Museum of Art and the Hudson Yards Museum of Art, and we are committed to bringing the exhibits from the FABIO to MoMA in September, 2020, and to delivering the works of the approximately seventy artists whose exhibitions are currently on view in September, 2020, in October, 2020, and November, 2020,” said Christopher Gavin, director of the Museum of Modern Art.The United States and Puerto Rico signed an agreement today in an attempt to lessen the economic hardship caused by Hurricane Maria, which devastated the island of Vieques, and has allocated $9.5 million from the $118 million allocated for the event by the event’", "The next Biennial should take place in 2020. “Bakufuji is moving forward in accordance with Artforum’s wishes and we are very grateful to the committee for considering and approving our proposal for the 2019 edition,” said Suzanne LaBouvier, chair of the committee. \n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines for the permanent collection of works from the Metropolitan Museum of Art in New York, including a collection of Adam and Eve’s costume and its jewelry. The guidelines, which were written by the museum’s senior adviser on cultural affairs, Anne Wojciechowski, outline eight major categories of exhibitions: “Collection Design,” “Interpretation,” “Performance Art,” “Reconstructions,” “Collection Exhibitions,” and “Interdisciplinary Art.”The guidelines were drafted after the DCLA received a letter from the Met’s board of trustees in April 2019, which declared the institution’s work collection “not in good standing.” The letter urged the museum to refashion the collection into “a vehicle for the sharing", "The next Biennial should commence in 2021, with the exhibition set to open in the spring of 2022.\n\n\nThe New York–based nonprofit Artnode, which runs creative-arts conferences, has received $3.5 million in funding from the Rockefeller Brothers Fund in support of its Inquisitions 2020 initiative, which focuses on acquiring and presenting works by artists whose work often intersects with academic and public research. The grant, which was announced in February and completes a five-year program, is one of the largest for a university.The foundation also announced that it has received a $500,000 grant from the National Endowment for the Arts (NEA), which supports NEA’s Continuing Education program, which offers up to $1 million for undergraduate and graduate students. The Grant, which has a maximum of $4 million, was established by the New York–New Jersey Artists’ Association (NYNA), the New York–New Jersey Foundation for the Arts (NYNJFA), and the New York–New Jersey Community Foundation. The grantees are NYU Langone, the Brooklyn Museum, the Museum of Modern Art, the Metropolitan Museum of Art, the Whitney Museum of American Art, New York’s", "The next Biennial should focus on establishing a new interdisciplinary research network that may result from the tribute, which will examine the legacy of Sir John A. Macgregor, the biennial’s namesake, and the new J. Paul Getty Trust—a contemporary scholarly endeavor entrenched in a golden age of American art. After an open-ended, thirty-five-day exhibition, the inaugural exhibition will assemble in September 2020. The project will take up the themes of the artist’s lifetime and the art she created. The exhibition will include the work of fifty artists and will run for twelve weeks. The inaugural exhibition’s inaugural edition will be staged at São Paulo’s Museu de Arte Contemporânea (MAS) and will run until January 29, 2020. The International Biennial will also welcome twenty artists from the United States, Russia, Japan, and Cambodia to Brazil in June 2020.“I’m delighted to co-present the inaugural exhibition of the International Biennial with my collaborators, the International Council of Museums, the Museum of Modern Art, and the The Museum of Modern Art in New York City,” said Valenta Fattal, executive director of the International", "The next Biennial should be held in 2021 and will be hosted at the Museo de Cultura Curaçao, near Lisbon, and will be hosted in the city of Piedras and will be led by the Brazilian artist and curator Carlos Sousa. The exhibition will feature works by twenty-five artists across the Americas and will mark the centenary of the founding of the institution, which was founded by the Dutch architect Nuno Camargo in 1929. The inaugural exhibition, “Pérez Biennial: The Peruvian Years 1932–1940” (2016–17), consisted of twenty-nine works, and the 2019 edition, “The Peruvian Years 1940–1970” (2015–16), featured the work of as many as sixty artists.\n\n\nThe Public Theater, the National Theatre, the Los Angeles County Museum of Art, and the Pasadena Museum of Art—all three of which have received funding from the 2017 Los Angeles Art Biennial—are set to receive $1.2 million from the American Alliance of Museums (AAM) in partnership with the Judy and Fitzwilliam Postgreen Foundation. The funds will be used to compensate museums that were part of the Los Angeles– and Pasadena–based consortium", "The next Biennial should be in 2020; it is currently slated to run from March to November 2020. \nAutumn/Winter 2019: The exhibition will be held on Friday, October 5, 2019, at the National Gallery of Art in Washington, DC, until March 22, 2020. The biennial will consist of three groups of works: a group of seventeenth-century drawings from the Autumn series, a group of seventeenth-century lithographs from the Winter series, and a group of fifty-six works from the Autumn/Winter Series that will be on display. “This is an extremely challenging time to create a work from the Autumn series, but we are committed to working with the National Gallery of Art to create a work that is as stunning and atmospheric as the original drawings,” said Julia Pritchard, director of the National Gallery. “The program will begin with a group show of works that have never been displayed in the museum. We will create new opportunities for visitors to experience the Autumn and Winter series through the National Gallery of Art’s permanent collections, as well as through the collection of works and artifacts that have been lost or destroyed. The Autumn/Winter Series is a spectacular", "The next Biennial should take place in 2022.\n\n\nThe New Museum in New York, which was forced to move the twenty-third edition of the Fifty-Eighth Venice Biennale, “Theaalon II” earlier this year due to the ongoing crisis in Ukraine, is planning to add more than three hundred works by thirty artists, including Leo Castelli, Tobias Electrohobos, Gianluca Pascual, Fabio Roslin, Laura Owens, Farida Rashid, and Bertrand Langille. The institution also plans to stage a second edition of the event in 2021.According to Artnews, the 2018 edition of the Venice Biennale featured a total of 240 new works and was held in a different location\u0097it was moved from the Veneto to Venice in the summer of 2019\u0097and thus had to address some of the issues raised by the previous edition. Among the works that will be added are works by Christo for the Church of Saint Pilar, Christo for the Holy Land, and Christo for the Turin Desert. The New Museum’s director, Daniel H. Weiss, said that the company", "The next Biennial should be celebrated with a performance of the work by the artist and a performance by a select group of artists from the exhibition, which will be held at the museum in 2020.  As the importance of art and the museum is constantly discussed, the Biennial will continue to develop its unique ways of honoring and promoting artists. \n\nThe National Arts Center (NAVC) in Bethesda, Maryland, announced today that it is collaborating with the Los Angeles County Museum of Art (LACMA) to create a new digital platform, National Arts Stories, that will feature interviews, historical accounts, and other archival materials from artists whose works have recently been selected for inclusion in the 2020 Tony Award–winning exhibition “Between the Sun and the Moon.” The platform will debut this fall.The partnership between the two museums comes as the two cities prepare to welcome visitors in 2021. LACMA and NAVC will collaborate to bring the works of fifty-six American artists to Los Angeles for a special exhibition organized by the Los Angeles County Museum of Art (LACMA) in October 2021. The exhibition, titled “Between the Sun and the Moon: American Art in the Late-1960s” and curated by Amanda Streng", "The next Biennial should take place in 2022. The adaption of the opera, which is currently being staged by the Los Angeles– and New York–based company MIHRT—an offshoot of the Academy of Motion Pictures Arts—is being overseen by Frank Gehry in conjunction with an international team of curators, producers, and artists.The exhibition will be themed “Interactivism: A History of the Modern Imagination” and will feature the work of seventy-five artists. The works will also be adapted from the best-selling books by Chinese artists Ai Weiwei and Tadao Ando. The exhibition will be organized as a series of films, and will be released by the Biennial Foundation in partnership with the Los Angeles–based nonprofit the Los Angeles Asian Art Museum.The museum will stage the exhibition in conjunction with a major facelift of its Beijing location, which is currently underway, and the renovation of an existing 135,000-square-foot building that is being promoted as a new exhibition space called the Museum for Contemporary Art. The work of the curators and artists participating in the exhibition will be explored through the construction of a new building, and the curators will be based in Los Angeles.“In", "The next Biennial should be held in ten years, and the team hopes to have all elements of the exhibition in place by the year 2020. The exhibition will consist of a series of interviews, films, videos, and other works by artists from the Biennial 30, which will be based in the museum, between June and September.“In a time when many artistic commodities are now out of reach for most people, the Biennial 30 represents a challenge to the concept of art in an ungainly world,” said the museum’s director, Maria-Louise Boudou. “I want to add to its collection of such works, which will form a part of my mission in perpetuity.” With its new headquarters in the city of Turin, the museum will also expand its education and research programs, which have been given a $125 million overhaul, and will organize an exhibition dedicated to the history of women’s art in the same year. The project will also introduce a new collection of modern and contemporary artists, featuring works by artists such as Markus Lüpertz, Caro Guerrero, Harald Szymborska, Mies van der Rohe, and Paul Nash.“I’", "The next Biennial should be in February 2022.\n\n\nThe San Francisco Museum of Modern Art (SFMoMA) has appointed John Michael Greer as its first director. Greer, who has recently held the position of deputy director for creative affairs at the Brooklyn arts space, is the first non-European head of a major contemporary art institution in the United States. He succeeds Donna Harrison, who departed in the summer of 2020 to head the Los Angeles County Museum of Art, where she will remain until the end of the month.“John Michael Greer is a seasoned director who has led important partnerships across the creative arts and is poised to further SFMoMA’s mission by bringing our extraordinary collection online and making it accessible to the public,” said museum director Maria Balshaw. “His appointment reflects SFMoMA’s growing confidence and optimism as we continue to grow as a center of innovation and creativity in America, and his professional background and expertise complement our talented and dedicated staff. I’m proud to have worked closely with him to ensure that SFMoMA is transformed for the better during his tenure and look forward to hiring him as our next director.”\n\n\nThe Blue Mountains Museum of Art in New South Wales", "The next Biennial should be held in the Summer of 2020.”\n\n\nSix hundred museums and fourteen galleries in the United States and fifty-eight countries have joined forces in the fight against Covid-19. On Thursday, the Sixth Circuit Court of Appeals in New York issued an emergency ruling in favor of the environmental and labor-rights groups 350 Action, Greenpeace, and other organizations that successfully challenged the Trump administration’s plan to make major changes to the economy through the 2020 fiscal year.In its decision, the appeals court found that the new regulation, which addresses the long-term care of institutional collections and requires new plans for storage, transportation, and distribution of donated works, violates the First Amendment’s right to “free speech.” The court found no evidence supporting the administration’s argument that the regulation is necessary to “protect the environment.”The court also found no evidence that the proposed regulation will cause significant disruptions to the business of the six largest industry players—MGM Resorts, the Sands Companies, and the Bank of America—which have interests in the company facilities and are opposed to the plan. The court cited a report from the American Alliance for the Arts, which found that the regulation", "The next Biennial should be held in 2020.\n\n\nThe Museum of Modern Art (MoMA) in New York has received a gift of over one thousand works from the collection of the American artist and educator Frederick Telling, Jr., whose sculptures often reflected his own personal aesthetic sensibilities and often drew from his own practices. The whopping donation includes more than 2,500 works by the artist from his home in New York City and his studio in New York, including works like his iconic blue-and-white striped sculpture The V-shaped Box, which was made on the first floor of his home, on Montauk, Long Island, in 1964; the first full-scale work by him, his daughter, and his granddaughter; and several hundred photographs that were taken by the artist and are currently housed in the museum.According to the New York Times, the artist has long maintained a strong artistic and intellectual relationship with the institution. In 2018, a new exhibition organized by the artist and MoMA director Robert Giard, titled “Frederick Telling: The Real Art of Painting” (2010), explored his legacy and featured several works by the artist. The following year, a new book by the artist was released by the American Book Award–", "The next Biennial should aim to bring together the artists and institutions who have made the most important contributions to the history of art in the United Kingdom. It will also focus on how the Biennial will continue to be relevant to contemporary audiences through new exhibitions and public programming, and will include a selection of works by artists from across the globe. \n\n\nBarcelona’s La María Festival, which was canceled in March due to the ongoing crisis in Syria, has received a gift of twenty-four works by six artists from Paris, including Maurice Chandon, Jacques Herzog, Rudolf Strasser, and Louise Nevelson, in a private show at the island of Madeira, Portugal, next week.The event, titled “La María Spirit” (María & the Spirit), is being organized as part of a larger campaign to support artists affected by the civil war in Syria, which has claimed the lives of more than 240,000 people. The artists will be given a total of ten weeks to complete the project, which aims to inspire dialogue between artists and people from the Middle Eastern and North African region and to draw attention to the cultural and social needs of these artists.Organizers of the festival, which was scheduled to run from", "The next Biennial should take place in the spring of 2021. Thereafter, the exhibition will head to the Smithsonian American Art Museum, the Los Angeles County Museum of Art, and the Metropolitan Museum of Art in New York. Krzanich said the work will be drawn from a variety of subjects, including the anthropology of cultural appropriation, women and the environment, and urban environmental issues, and will be curated by a group of artists known for creating work on marginal locations such as the Pacific Northwest, the Sahara, and the Amazon. The work will be on view in the seventy-fifth edition of the Biennial, which will be held at the Phoenix Art Museum and the Mesa Verde Art Museum in New Mexico.The biennial’s theme “ecology of toil” will be revisited in an exhibition of the contemporary artist’s work at the Arizona State Fair in January 2022.\n\n\nArtist and philanthropist Susan Montague, a pioneer in contemporary art who pioneered the use of social media to promote her work, has died at seventy-eight years old. She was one of the few contemporary artists whose work was exhibited in New York’s Museum of Modern Art in the early 1950s and went on to become one of", "The next Biennial should focus on the concept of art in the age of digital, large-scale installations, and an exploration of the ways in which the concept of art has experienced a resurgence in recent years. We are working hard to ensure that the exhibition will be of relevance, topical, and inclusive.” Reflecting on the exhibition’s previous iterations, director Tamas Kaba said: “Featuring work by some of the most innovative, ambitious, and experimental artists of our time, the Biennial will celebrate the work of artists who are redefining the boundaries and shape the course of art through their art in a manner that encourages new ideas, new approaches, and new ways of looking at art.”During this year’s event, which ran from March 17 through March 21, 2018, the annual exhibition, “a series of solo exhibitions organized by a single artist[s] each year,” featured the work of seventy-eight artists. \n\n\nThe British Museum in London has appointed Stephanie Seneff as its new deputy director for collections and exhibitions. Seneff is the former director and CEO of the London-based company Gagosian, which has locations in New York, Geneva, New Delhi", "The next Biennial should take place in 2022.  \n\n\nThe Haus der Kunst in Vienna and the Museum of Modern Art in New York have announced that they are collaborating on an exhibition that will highlight the contributions of women to the evolution of modern and contemporary art. The first iteration of the project, titled “Rosenthal Mandelbaum: An American Biennial,” will open at the Haus der Kunst on October 26 and continue through February 28, 2020. The second edition, “Women at the Front: Art in the Age of Hitler,” will take place at the Museum of Modern Art in New York on March 10–March 11, 2020.In his 2018 book Hegel and the Modern Art of the Modern World, Martin Zweibel traces the relationship between art historian and philosophy of art philosopher Luhring Augustine, whose ideas were prescient in helping to shape the work of women, and Melchior Freund, who interwove avant-garde science fiction and the avant-garde avant-garde, respectively. The project will integrate the themes of history, feminism, and history of the gallery, as well as the history of the art world, both", "The next Biennial should be hosted by the City of Toronto in 2021 and be organized as follows:\n\n1. Themes of change\n\n2. Locations of work, and where possible, the work is located.\n\n3. Activities and activities and their locations.\n\n4. Activities and their activities; the participant must understand the connection between the work and their locations. 5. A series of questions and answers about the specific location of the work, the series of questions and answers, and the participant is asked to consider the possibility of other works, and the various disciplines, in a broader sense. 6. General comments about the exhibition. 7. Discussion of aural arts including dance, painting, sound, and installation, and the role of the arts in our society. 8. A review of a work’s history. 9. A discussion of the contemporary art and visual arts in a general manner. 10. A survey of the history of the arts and visual arts in Canada. 11. An update of the exhibition. 12. A postscript by artist Stephanie Barlow. 13. A proposed mural for the bi", "The next Biennial should focus in part on the intersection of art and feminism. “In the twenty-first century, the greatest challenges are for women and men, seeking to understand and appreciate art and feminist theory,” said Jeffrey Karn, chairman of the festival’s board of trustees. The event will also introduce new programming, including a women’s seminar and a new jurying panel.The Biennial of the Imagination, which will present work by thirty-six artists, will run from March 21 to March 23. The first show will take place on the city’s West Side. The second will take place on the city’s South Side. The third will be on the city’s North Side. The fourth will be at the Museum of Modern Art.The next edition of the Miami Beach Biennial will take place at the Hi-Fi Club in West Palm Beach on September 9–September 11. \n\n\nThe Baltimore Museum of Art (BMA) is launching an online survey to better understand the museum’s visitor experience and future plans. The online survey will gather information from thousands of visitors and will help inform future programming, including the museum’s reopening in 2020 following a $50 million", "The next Biennial should take place in 2020, and in the meantime, the series will continue with a selection of works that have not yet been exhibited or published. The biennial will be based at the Museum of Modern Art, in collaboration with David Zwirner, and will be co-organized by Sara Goldberg, Christian Lambert, and Matthew Weiner. Jacob’s son David will continue his work as an independent curator, and he will return his art to the Vancouver Art Museum after thirty years to the greater Vancouver Art Museum. With the ninety-three-year-old collector, he will become the museum’s oldest surviving trustee.\n\n\nThe Albright-Knox Art Center in Rochester, New York, has received an unexpected gift: a $1 million donation from artist and philanthropist Roberta Smith. The gift, which also includes a new multi-million-dollar Mandelbrot set and a new painting by Smith that will be on view in the exhibition “Roberta Smith: The Painted Dream,” will mark the center’s seventeenth anniversary next month. The gift includes Smith’s first-ever exhibition at the museum, which opened in the former Albright-Knox", "The next Biennial should be held at the Selenista Museum, in Lisbon, in 2022. Art aficionados and collectors have also long been anticipating an exhibition dedicated to the Brazilian painter Paulo Freire. Known for his abstract paintings, which often feature trees and urban environments, as well as abstractly constructed works such as the Palacio de Arte Contemporáneo in São Paulo, which is currently undergoing restoration, Freire produced works on paper and cardboard as well as in his studio in the 1970s.  Among the artists to have been selected for the biennial are Ana Mendieta, who will be represented by the National Museum of Modern Art in Brasília; Renata Martinelli, who will be represented by the Museo de Arte Contemporáneo do Rio de Janeiro; and David Salle, who recently exhibited at the University of the Arts, London. The other artists chosen for the inaugural exhibition are João Paulo Sousa, whose work is currently on display in the exhibition “Joint Program 11,” at the Folio Museum in São Paulo; and Pedro Alves, who will be presented by the Museo de Arte Contemporáneo do Rio", "The next Biennial should have been held in the autumn of 2020, but was postponed due to the Covid-19 pandemic. Cultural workers and academics are now calling for the upcoming edition to be pushed back by two years. “Myanmar experienced a tremendous loss of life during this pandemic, and almost no one is willing to face the consequences of inaction,” said Arunanondchai, chair of the Arts Council. “We must not repeat the mistake of ignoring the lives and wellbeing of vulnerable communities, and do everything possible to encourage cultural activity and economic diversification. The arts are the lifeline of many communities in Myanmar and are an important vehicle for social upliftment and reconciliation. We must support the arts and arts workers in Myanmar and encourage their participation in the upcoming elections.”\n\n\nThe Los Angeles County Museum of Art (LACMA) has released the list of seventy-six artists and collectives who will participate in the theme-driven biennial Art in the City, which will be held at the Los Angeles’s Alameda County Museum of Art (ACMMA) from April 5 to April 7. Essentially a “city in miniature,” the"]