["The next Biennial should be held in 2022.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, announced today that Lorraine O. Wilson, whose work explores notions of agency and power, has been chosen as its next director. Wilson, an American painter and educator, will assume her new position in January 2021. Wilson will begin her tenure with a public showcase in January 2022. “We are thrilled to welcome Lorraine to the role of chair of the board and to be able to introduce her work to the museum’s international audience,” said Museum Chair Jorg Haider, who added that she “wants people to see her work and feel empowered by it.”Wilson, who is best known for her large-scale paintings, often draws from a singular perspective, often depicting individual patients rather than the larger social ills of the healthcare system as such. In her 2015 exhibition “Place of Healing,” a series of installations, poems, and sketches that explored the concept of a “state of complete, incorruptibility,” Wilson often depicted patient bodies, often in a comatose or semi-comatose state, and her own body. She", "The next Biennial should take place in Tokyo in the Spring of 2020. Tomio Takeda, director of the Musashi Museum of Art, Japan, told the Art Newspaper that the theme of the upcoming exhibition will be “Fragmenting the Unfolding.” We will keep you updated with any new developments.\n\n\nThe National Gallery of Canada in Ottawa has begun welcoming visitors back to the institution after a temporary closure was imposed following the coronavirus pandemic. The institution has since been rebranded as the National Museum of Canada’s European and Central Asian Studies. The change was made in recognition of the new curatorial priorities for the institution, which are currently being developed.\n\n\nThe Centre Pompidou in Paris announced today that it rebranded from the Centre Pompidou into the Centre Pompidou-Paris. The move allows the museum to better reflect its cultural and scientific heritage as it prepares to reopen to the public in mid-March. The rebranding was made in the aftermath of a public campaign led by French president Emmanuel Macron and the institution’s former director, Nathalie Bondil. Macron announced his intention to end the Centre Pompidou’s affiliation with the French", "The next Biennial should take place in 2022–2023 and will be hosted by the Kunsthalle Basel.The show will be curated by Bernhard Rauch, the curator of contemporary art at the Museo de Arte Contemporáneo in Madrid and the Museum of Modern Art in New York and will consist of a retrospective, a symposium and three exhibitions: a major exhibition of work by women artists, a solo exhibition of work by artists from East and Southeast Asia and a project titled “HELMES.”The 2019 edition of HELMES, which was led by the Berlin-based artist Tobias Madison, featured work by artists such as Małgorzata Biczel, Zina Saro-Wiwa, and Ewa Michalek.The 2020 edition of the exhibition will be led by the artist Michael Warhol and will be held at the Museum of Modern Art in New York, with the installation of two works by American painters such as Edgar Degas, Robert Irwin and Renate Lorens.The 2020 exhibition will be a collaboration between Warhol and artist Zineb Sedner, who is best known for her paintings of everyday objects such as posters, cards, and teddy bears,", "The next Biennial should take place in the spring of 2020. At the time of publication, the festival had only seven artists nominated.The 2019 edition, titled “My Body, My Rules,” was curated by Anna-Sophie Coop, and the exhibition was organized by the Los Angeles–based nonprofit Art Matters LA, which is also the organizer of the upcoming Artic Arts Festival. The 2019 edition, titled “The Body,” was curated by Meg Lockhart, and the exhibition was organized by the Los Angeles–based nonprofit Art Matters.The 2020 edition, “My Body, My Rules,” will be hosted by the Los Angeles–based nonprofit Art Matters, and will be hosted by the Los Angeles–based nonprofit Art Matters LA. The 2019 edition, titled “The Body,” will be located at the Los Angeles County Museum of Art (LACMA), where it will run through February 24. The 2020 edition will be on view through March 9.\n\n\nArchitects and designers in Copenhagen are launching a new initiative that will see them collaborate with and raise funds for local environmental and family-friendly organizations. Called the Familto series, the projects will involve architects working throughout the city of the", "The next Biennial should be held in the spring of 2020. The biennial will be organized as a series of exhibitions, with the first exhibition being “Mirrors in Time” (2019) and the second exhibition being “You and I” (2019). The show will examine the relationship between artist and viewer through a series of dramatic performances and installations.The 2020 event will reopen in the spring of 2021.\n\n\nThe Museum of the African Diaspora (MoAD) in New York has received a gift of more than thirty works by eight contemporary African artists. The donation includes works by Mali’s Yinka Shonibare, Daleksa Mattos, Lional King and Zileel Joseph, and Latvian artist Sandra Blazwick. The works, which are housed in the collections of the museum, the Metropolitan Museum of Art, and the New York Academy of Art, will be presented at its upcoming “Midnight Runners” exhibition, which launches on December 3, 2020.“We are thrilled by the generosity of these artists, and particularly by the generous gift of these eight contemporary artists, whose enormous talent and commitment to their art has made them uniquely qualified", "The next Biennial should take place in 2021 and is being organized by London-based artist-run nonprofit the Biennial Foundation. Artforum has contacted biennial founder Johanna to ask her thoughts on the biennial’s close relationship with the Royal Shakespeare Company (RSC) and the publicity surrounding the event. The letter is reproduced in its entirety:Sincerely,Kristina Loewenthaler (logistics manager)Michael Pacey (art director)Alicia Wimmer (production manager)Bertrand Russell (artistic director)The biennial will be held in the Stratford-upon-Avon site of the RSC, which has been closed since March 2019 due to Covid-19, and will take place over two weeks. The first half of the event will be devoted to a group exhibition, “Embedded Politics: Iconoclastic Cinema”; the second half will focus on “The Sociology of Motion”. The British Council will fund the London, and the RSC will provide the Stratford-upon-Avon venues for the show. The biennial’s inaugural edition, “Spotlight: London 1972,” will run April 10–April 13, 2021.“", "The next Biennial should take place at the museum in three years time.”As the US prepares to enter its final year of this round of global health emergency strikes, the White House announced on Monday that the US will not send troops to Syria in the ongoing civil war, which has killed at least 6,600 people and displaced millions more. President Donald Trump has also suspended the refugee program and has threatened to impose sanctions on Russia and China for allegedly backing the Syrian government.While the US has occasionally sent troops to Syria to fight alongside anti-government rebels, the US has not been able to defeat ISIS there, and ISIS has been able to thrive in Syria, thanks in part to the US’s support of anti-government rebels who were fighting the regime of Syrian dictator Bashar Assad. The Trump administration has also argued that its efforts to train and equip moderate Syrian rebels will backfire, and that arming the Kurds would be a major mistake.While the US has been accused of intentionally supporting ISIS, and some have accused the US of intentionally helping ISIS, the Trump administration has defended its policies as necessary to stopping the group. Defense Secretary James Mattis told a Senate Armed Services Committee hearing earlier this month that US forces needed to be deployed in Syria to help train and equip", "The next Biennial should take place in 2022 and the first in 2020. Michaela Fries, director of the Institute for Contemporary Art in Cologne, told the Art Newspaper that the event would be different this time around: “The last six years have been a total failure, and this time around we were actually able to present two exhibitions — one for contemporary art and another for architecture.” The reconstruction of the museum will be overseen by eminent sculptor Wolfgang Remar, who designed the building that houses the museum and plans to develop a new exhibition space in the building.The Biennial of Art will also include a museum dedicated to the history of art and its contemporary exhibitions. The exhibition will be titled “Architecture and the Contemporary,” and will be curated by the Paris-based architect Pierre-Olivier Neuville. The works will be on view in the exhibition “Architecture and the Future” in the fall of 2020.\n\n\nThe National Gallery of Scotland (NGM) announced today that it will permanently close to the public in an attempt to persuade the public to stay put and help the institution through the global health crisis. The decision was made in light of the coronavirus outbreak, which has infected", "The next Biennial should take place in 2020.”Frieze also announced that it is working on a new series of prizes that will recognize and celebrate the contributions of emerging and established artists. Curated by Breanne Schniedel and choreographed by Anne-Marie O’Leary, the prize for emerging artists will be named the “Young Artist Award.” The prize for established artists will be “The Artist/Creative Process Prize.”The prize for emerging artists will be titled “Young Artist,” and will be given to a young artist or emerging from a small-scale artist-communicative practice. The prize for cultural producers will be entitled “The Artist/Creative Process Award,” and will be given to existing and new artists.The seventy-third edition of the Frieze Los Angeles Biennial—the first event to be held there since 2011—will kick off at the Hammer Museum in Los Angeles on Saturday, March 8 and run through Sunday, March 11. The theme for this edition will be “Gothic Art, Modern Art, and Feminism” and will take the form of a biennial, with each biennial taking place over a twelve-month period. The", "The next Biennial should be held in 2020. The first—Lammert\u0097a live performance series that drew three thousand people\u0097was held in 1974. It is now a cornerstone of the city’s cultural life.\n\n\nThe Getty Center and Museum in Los Angeles announced today that Julia Ioffe will become director of its LACMA location, which is currently undergoing a $100 million overhaul. Ioffe, who has helmed the institution since 1997, will succeed Lacma’s founding director, Larry the Cable Guy, who died of cancer in November. She will assume her post in May 2020.“Julia Ioffe is a distinguished curator, educator, and writer who has built an extraordinary career around the work of her curators, artists, and staff, who have made LACMA a truly special place,” said Larry Lash, the museum’s president and CEO. “Julia’s commitment and passion for art and artists and galleries has been demonstrated by her work to expand the public’s opportunities to see and experience art through the lens of her own life. She is truly an icon of creativity and personal transformation.”Born", "The next Biennial should be staged at least once in the first half of 2020. March 16–March 17, 2020. For full details, see the Berlinale website. The second edition of the German pavilion, curated by Joachim Neugroschel, will mark the artist’s return to Berlin from the United States. Neugroschel will also present a three-day exhibition of works by the German artists Raquel and Wolfgang Duological, and will stage a retrospective of the artist’s drawings at the Kunsthalle Basel in March 2021. Deana Lawson, director of the Kunsthalle Basel and the Kunsthalle Düsseldorf, said: “The next Biennial will introduce new and contemporary and challenging ideas and constitute an opportunity to reflect on how art and art history can change through collaboration, and how art and art history can live together. . . . The time has come for strategy and art in this exhibition to actively participate in rethinking how we live together. The next Biennial will be a critical step in that process.”The Art Biennale’s 2016 edition, curated by Anke Harmer, featured art by thirty", "The next Biennial should be held in the spring of 2021.\n\n\nThe British artist, curator, and educator Rebecca Strong has been selected as the winner of the 2019 Pritzker Prize. The Pritzker Prize is one of the oldest prizes in the arts. It was founded in 1957 by Jules and Paul Pritzker, who jointly donated the sum of $750,000. The Pritzker Prize is awarded annually by the Pritzker Team and the American Academy of Arts. The biennial is set to run from March 14–March 22.Born and raised in Manchester, England, Strong first met Pritzker through the British artist N. M. Katz, who introduced the family to the artist-in-residence, her husband, the sculptor and painter Joi Anagnos, and her daughter, Celia. Since childhood she has been a huge supporter of Pritzker and has been featured in numerous Pritzker awards, including the Pritzker Prize for Art in 1998, the Pritzker Prize for Art in 2002, and the Pritzker Prize for Design in 2010.Pritzker said: “This year’s award will go to Rebecca for her outstanding contribution to the arts and our culture,", "The next Biennial should be held in 2021, and the inaugural event will be held at the old Biennial site, the Museo de Arte Contemporáneo in Madrid, in March 2021.The time-intensive exhibition “Por el Commercola” (The Place of Commercola) will examine the exhibition space and the relationship between art and politics in a bid to consider the possibility of a reopening of the Biennial, which has been closed since 2015 due to the Covid-19 pandemic. The upcoming show will take place in the exhibition space, which was formerly located in a former textile factory in the industrial city of Murcia, in the municipality of La Palma, in Spain’s Basque Country. The Acuerdo de Arte Contemporáneo in São Paulo, Brazil, will stage a new edition of the exhibition, which will be organized as a “platform for political action” in March 2022.\n\n\nThe Museum of Contemporary Art (MoCA), Boston, has received a gift of seven works by artist Stephen Friedman, who passed away from Covid-19 at the age of seventy-six. Born in 1960 in New Canaan, Connecticut, Friedman", "The next Biennial should be held in 2021. A press release from the Museum of Fine Arts, Boston, stated that the institution will continue to provide visitors with an opportunity to see and experience works by artists of every discipline.\n\n\nThe Museum of Fine Arts (MA), Boston, has received a gift of twenty-seven works by the late American artist Virginia Johnson. The gift includes works by frequently-photographed artists such as John Hirst, Dorothea Rockburne, and Robert Irwin, as well as six previously unreleased works that were not on display in the museum’s exhibition “Virginia Johnson: Photographs at the Museum of Fine Arts,” which closed on February 22.“Virginia Johnson: Photographs at the Museum of Fine Arts” was organized as part of a ten-year, million-dollar reinstallation of the institution’s collection of Johnson’s photographs\u0097the museum previously held the works for only ten days before the exhibition opened.“After years of searching for the perfect gift for the museum, I was thrilled to receive this extraordinary gift that will allow us to continue to present this outstanding collection,” said George and Selwyn Johnson, the MFA’s present", "The next Biennial should be held in 2021, according to Wiradjuri, and will be organized as an immersive, three-dimensional reality-based art museum, similar to the Art of Motion, set in a contemporary city. The institution will also be modeled after the city of Delhi’s Art of Motion, the Delhi Art Festival, and the Art and Architecture Festival, and will host a number of cultural events.Commenting on the upcoming exhibition, the director of Wiradjuri, Anupam Wagh, said: “We are thrilled to bring this project to life through the innovative and inspiring work of hundreds of talented artists, with an exhibition that will reflect the spirit and vitality of Delhi, and will celebrate art from every corner of India.”\n\n\nArt historian, curator, and educator Douglas Hofstadter, whose pioneering work led to the conceptualization of experimental, experimental art exhibitions, has died at age seventy-eight.Born in New York City in 1941, Hofstadter is survived by his wife, Dorothy, and their three sons, Kippy, Kip, and Kippy Jr.; their daughter, Jennifer; and their son-in-law, John. The family now own a collection of over two hundred paintings", "The next Biennial should take place in 2020.  The announcement comes as the museum is working to overhaul its collection in an attempt to improve its image with tourists and the general public. Previously, the museum only displayed works in the collection, which comprises more than 3,000 paintings, drawings, sculptures, photographs, videos, and installations from around the world. The remodeling project, which was funded by a $1 billion gift from Spanish businessman Berta and French collector Agustín Pérez Ribas, has been in the works for over a year and will start next month.The project is being led by architect-developer Andrés Manuel Pérez-Alvarez, who previously worked as a cultural consultant for the Spanish architect-consulting company Peiksa, and his partner, the Spanish architect Andrés Rodríguez-Alvarez. The renovation of the building, which is currently home to the specialist center Biennial de Barcelona, was organized by the architects as a way to present the collection in a new light, in order to receive direct support from the Pérez family.Commenting on the renovation, the couple said: “We started with the aim of presenting the collection with a", "The next Biennial should be staged in 2020. The artist-run, nonprofit organization Arthouse will host the event. The art fair has been working to organize a biennial since 2015, when the Arts Council, the UK’s independent arts body, announced a partnership with Art Biennale to produce a “post-autobiennial” exhibition, “Art through the Ages.” The exhibition will be on view in the UK from November 17 to November 19, 2020.The partnership was announced following a year of organizing and organizing. The UK’s Arts Council, which represents the interests of galleries in London, announced that it was launching a new funding program, Art at a Price, which will offer up to $2,000 to organizations working with and for artists. The program will launch with a biennial, “Art at a Price,” and will continue with Art at a Price: Contemporary Art and Art, Art at a Price: Contemporary Art and Art, Art at a Price: Contemporary Art and Art, Art at a Price: Contemporary Art and Art, Art at a Price: Contemporary Art and Art, and Art at a Price: Contemporary Art and Art. The 2019 edition, “At the End", "The next Biennial should focus on the art of social possibility, with a special regard for the Chinese diaspora. It should take place in Shanghai or one of its satellite cities, Beijing, and will probably take place in a museum with a significant collection of art.The 2018 edition of the China Art Biennial was a success. The first half of the show was devoted to historical subjects, including the last decades of Chinese history, and the second half, which was organized as a forum for artists to share their work, was devoted to the contemporary sense of place and its relationship with domestic and global politics. \n\n\nThe Bolton Museum of Art in England, which is still recovering from a fire that broke out in a space that housed the institution’s collection of more than a thousand objects from the late nineteenth century until the late 1990s, has announced that it is planning to reopen at least part of the building that housed the museum’s holdings next month. The institution is currently working on reconstructing a section of the museum that was damaged when a fire broke out in a second building in the complex in February, and will take another four months to complete the work.In a letter sent from the museum to the Public and Commercial Services (PCS),", "The next Biennial should take place in the spring of 2021 and will be staged at a venue that is currently under construction, in the city of Bentall, in the English county of Northamptonshire. The theme will be “From the Ground Up.”According to the British artist, whose practice spans painting, sculpture, performance, performance-based art, photography, and performance-based poetry, “matter” can be defined as a “brane of brilliant and reflective light.” In his words, “matter” is a “living thing, a living thing that has life and is alive.” In his 2006 exhibition “Space/Time” (2007–2008), “Suzu’s work engages with the potential of light, light and the possible, light and the dark, light and dark, light and light, light and light, light and light, light and light, light and light,” and light and shadow.\n\n\nThe Museum of Arts and Design (MAD) in New York has appointed Jonathan Velasco as its next executive director. Velasco will assume his post in January 2020. He succeeds Michele Casey, who has served as MAD�", "The next Biennial should take place sometime in the 2020s. \n\nThe Los Angeles County Museum of Art (LACMA) has received a gift of one of the world’s most valuable works of modern and contemporary art, The Servant. The works, which was acquired by the institution from the estate of Sylvia and Alfred Hutton, were put to good use by the Hutton family in the late 1940s and early 1950s. The gift includes a recording set, a digital image viewer, and an image editor. “We are thrilled to contribute a significant artifact to LACMA’s collection,” said Maurizio Lupercanti, LACMA’s director. “The Servant is a true renaissance work, one that owes its existence to the generous gift of the Hutton family and was created with the same care and attention that the family gave to the estate of Pablo Picasso. It is a work that embodies the spirit of LACMA and is a perfect example of the extraordinary commitment of the Hutton family to the collection.”The Huttons will be honored at a special retrospective of the artist at the museum in December 2021.\n\n", "The next Biennial should be held at the LOCKE in Oslo in January 2020. The next Art History Congress should be held at the Institute of Modern Art in New York in April 2020. The next Paris Architectural Biennale should take place at the Institut d'Art et d'histoire (Paris) in May 2020.  The next Venice Architecture Biennale will be held at the Museo das Beccaria in Venice in December 2020.  The next Museum Düsseldorf, Düsseldorf-Stiftung, and Düsseldorf-Stiftung are currently closed.The next WMF-Roche and the next WMF-Roche in Berlin are currently undergoing renovations. The next edition of the 'Art in Motion' exhibition in the US will take place at the New Museum in New York in December 2021. The next edition of the German pavilion at the Venice Biennale will take place at the Brandenburg Gate in Berlin in February 2022. The next edition of the Biennial Art in Hamburg will be held at the Kunsthalle Bergen in September 2022.The organizers say that all the announcements regarding the 2021 edition of the Berlin", "The next Biennial should be in 2021, but it is unclear whether the institution will still have the capacity to host the event if the show is canceled. The organizers had also expressed their concern about the shutdown of the museum in an email sent to the public on May 23, which said that the construction of the exhibition would depend on the health of the participants, that the opening of the exhibition was not to be delayed, and that the event would unfold as planned. The organizers presented a letter from Frederick James Olmos, the director of the Diller Scofidio + Renfro Foundation, who said that the artworks in the show will not be able to reach visitors until at least June 13, which is when the opening of the new exhibition, “The Present,” is scheduled to begin. The letter claimed that the work will not reopen until June 14, citing the “relief of the ancients” as an example.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has released the list of seventy-nine artists who have received artists’ grants of at least $1 million for the 2020 fiscal year. The artists are: Alyson Adams, Sunita Barua,", "The next Biennial should look to address the ongoing process of displaced people from the Gobi Desert in China’s Xinjiang region, which is experiencing a crisis of religious identity crisis as a result of the forcible relocation of the region’s Muslim population from their homes in 1950s China. The museum will also focus on the history of related art, including that of works from the Japanese wartime period.While the theme “Decolonization: Art and Politics” and the exhibition “Practical Decolonization: Art and Politics” will be presented by the German curator Wolfgang Kaehler, the Gobi Biennial will also be a statement of hope and a way of reopening to the world. Kaehler, who is facing deportation from China for suspected sedition, was given an asylum in Germany by the Chinese government in 2017. He plans to present the exhibition at an art center in China, the Beijing Art Museum, in 2022.The German government granted Kaehler asylum in 2017, shortly after he fled Xinjiang. The South German state accepted his invitation to the Beijing Art Museum in 2022, and the Gobi Biennial was born in 2022. In 2022, China staged the first exhibition of work by an", "The next Biennial should be a showcase for the best and most contemporary works in the world made by women and men. Women and men should have equal access to exhibitions and the same opportunities for participation.”While the exhibition will be on view from January 5 to January 8, the exhibition will also feature new works by women artists and will focus on the history of photography and how it has shaped the way we think about and experience the world.The first Biennial was held in Paris in 1960. It was followed by the Rome and New York Biennials in 1965 and 1967, and the Venice Biennials in 1972 and 1976. In 2000, the inaugural edition was staged in the Swiss city of Basel and was the last to be held in the United States.The 2019 edition, titled At a Time, was organized by the Los Angeles–based nonprofit the Los Angeles Biennial Consortium and the Los Angeles County Museum of Art\u0097the latter of which has yet to announce plans for the 2020 event. The theme of this year’s biennial was “Time and the Hunter,” featuring work by twenty-five artists. “At a Time’s invitation to the CCA, we are thrilled to be celebrating our", "The next Biennial should begin in 2020 and culminate with the exhibition “The Real Life of a Biennial,” which will aim to “expose the falsity of the concept of a modern biennial,” according to the organizers, who are also planning to stage a “Revolution of Photography” biennial in 2021. The announcement follows the exhibition “Beyond the Photographs: Two Decades of Painting,” which was held at the Fine Arts Museèle Nantes in Paris in November 2020. The exhibition will be followed by a “continuation of work” biennial in 2021 and “The Future of Photography.” The 2019 edition, entitled “The Future of Photography,” featured ninety paintings by twenty-three artists, including Karolyn Atkins, Aneesa Diem, Kiki Smith, and Walter Benito.\n\n\nThe museum that exhibits historical works by various South American and European artists, including the Abdicated and the Filippa Nava, has become the latest institution to announce plans to shutter its collection. The Mesa Art Museum and Florida International University (MISS) announced on Thursday that it was planning to close its doors on March 31, 2020, at the earliest", "The next Biennial should be in March 2021. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Mary Clare Rapp as its next director. In the newly created position, which is currently vacant, Rapp will oversee the organization of the institution’s portfolio of more than sixty art-historical projects as well as provide leadership and direction for the other museums in the city.“Museums are essential engines of our local, regional, and national economies and for serving the public,” said museum director Michael Govan. “The future of the arts and culture is at the core of MoCA’s mission. We are looking forward to working with Mary to shape the future of MoCA, and to champion the critical role that museums play in our community.”In her new role, Rapp will take up the post on July 1, 2020. During her tenure, she will assume the post from Catherine Russell, who has served as interim director since July 2019. During her tenure, she has worked as a curator at the institution since 2010 and was promoted to director in 2012.Commenting on her new role, Rapp said: “With the acquisition of the renovated and expanded Museum of Contemporary Art Los Angeles", "The next Biennial should be held at least six months after the initial exhibition. \n\n\nArtPrize.com, the award-winning international platform that aims to recognize and raise awareness of emerging and established artists in the United States and internationally, has announced that it is leaving the $25,000 award in the interest of increasing the amount of art created by American artists in the next edition of ArtPrize. The biennial, which will take place in the city of Chicago from March 6 to March 8, 2020, will receive $5,000 for its organizing committee members and $2,000 for the artists who are shortlisted for the award.“We are thrilled that ArtPrize will continue to support American artists in this way,” said Elizabeth Mills, ArtPrize’s executive director. “Once again, ArtPrize will be a platform for local, regional, and national artists to have their work showcased at large institutions and we see this as an important step in fostering a deeper understanding of the arts for both the public and the local community.”The new prize structure will allow ArtPrize to honor an additional 50 artworks by the artists shortlisted for the 2019 award, which will be announced in 2020.", "The next Biennial should bring together practitioners from all over the world to present an exhibition of work by artists whose work has never been on display in the United States. The theme of the 2020 edition is “Power in the Face of Defeat.” In a statement, the organizers said that the goal of the event is to “encourage an international spirit of creativity and reimagination through exhibitions that reflect the spirit of the times.”The first exhibition was curated by Yinka Shonibare, a South Korean curator and filmmaker who is best known for his documentary series “Nirvana” (2015–16) and “Requiem for a Dream” (2016–17). The program was awarded the Prix des Arts et Lettres award (2016) and the Prix des Arts et Lettres award (2018), respectively. The second exhibition, titled “Power of the Resuscitate,” was curated by Ruth Estévez, a curator and director of the Marrakech Biennial.In a commentary published in the May 2019 issue of the journal BOMB, Stephen DeAngelo, a curator and former director of the Museum of Fine Arts, Boston, wrote: “The Biennial has been", "The next Biennial should be unveiled by the end of the year. The museum will also begin planning for the exhibition, which will take place in the museum’s former home on the first floor of the Westin New York from January 2021 to February 2022. The institution will announce the program’s theme this fall. The 2019 event featured work by Cécile B. Evans, Nina Orsi, Susana Bohejour, Mona Hatoum, Elizabeth Alexander, Sunaya Dubey, Andrea Giannotti, Lulu Liu, Liz Smith, Julia Stepanova, Tanya Syms, Robert Walker, and more artists.\n\n\nThe Department of Corrections in Louisiana announced earlier this week that it is planning to launch a new public art program that will provide temporary relief to those affected by the catastrophic wildfires that have ravaged the state. The program will launch with a two-week exhibition, “Mayor,” at the New Orleans Museum of Art; the Louisiana State Penitentiary; and the Louisiana Correctional Institution in Angola. It will also include the first-ever exhibitions of works by convicted sex offenders, and it will offer grants of", "The next Biennial should take place in 2020, when the exhibition will open to the public. Projects will be organized as a series of events, from one venue to another, for a period of thirty days. The event’s theme “magic realism” will be a reference to a 1997 essay by Ed Ruscha in which he examines the relationship between science fiction and reality.In his essay, Ruscha argued that the subject of magic is “a question which inheres in the very vocabulary of the genre itself,” and goes on to discuss the history of the genre, including the origin of the term’s concept of a dream world, which he terms “third culture.” He also refers to the works of Jacques Lacan and the early practitioners of surrealism as a reference point for analysing how various forms of fantasy are related to and connected to the real world. The second edition of the exhibition will take place in Helsinki in 2022. \n\n\nAmerican artist Ashley Jackson-Pope, whose enigmatic paintings and drawings evoke the worlds of art and psychology, has died at age fifty-seven.Born in New York City in 1950, Jackson-Pope—whose early visual and abstract paintings often evoke dreams and the dreams", "The next Biennial should take place in the spring of 2021. The event will consist of a biennial of works by hundreds of artists from around the world and will showcase the work of contemporary artists. The work of the museum will be presented by a select group of artists, selected by the curators from a pool of seventy. The winning artists will be announced in May. It will be the first time the Rhode Island institution hosted a biennial. The first Biennial of Works was held in 1984.\n\n\nThe National Gallery of Art in Washington, DC, has added two new members to its board of trustees: American painter Emily Hall and Israeli designer Yair Hoffman. Since joining the museum in 1998, Hall has served as board president and has been involved in the selection of the museum’s permanent collection, which comprises works by all three of the museum’s founding members—Henry David Thoreau, the founder of the environmentalist organization the Wilderness Society; artist and architect Shimon Peres; and the Danish artist Lars-Erik Pedersen—who, in the 1960s, created a series of works that blended geometric shapes and textured fabrics.In addition to her work as president, Hall has served as an adjunct faculty", "The next Biennial should be held at the Museum of Contemporary Art in London, and will be presented by the New Museum in New York. The first event, “Biennial: The Event,” will take place at the Museum of Contemporary Art in London in the fall of 2019. The second event, “Theater of Operations,” will take place at the Directors― Studio in New York, and will be presented by the New Museum in the spring of 2020. The museum has also currently announced the commission of the first independent film by a chief curator of a museum, Cécile Avelro, which will debut at the Museum of Contemporary Art in the Spring of 2020.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines mandating the removal of monuments that glorify racist, colonialist, and exploitative historical figures. The November 2018 release of the guidelines, which were drafted by the agency that polices monuments in the city, comes a month after the city council passed a sweeping $5.7 billion budget, which aims to rein in the growing costs of policing monuments—including the upkeep of Stonewall Jackson, the notorious eighteen-foot-tall bronze effigy of", "The next Biennial should be held in 2022. As cited in the press release, the work will remain under the control of the artist and will be accessible to the public. The work will be presented in two parts, one in the city of Barcelona and the other in the artist’s native land, the Autonomous Region of Aragon. “The opportunity to present the work in Barcelona and the Autonomous Region of Aragon is an award that I have been waiting for for a very long time,” Mertens said. “I’m very excited by the prospect of presenting the work to the city and to the region of Aragon. I hope that my exhibition will stimulate and help to inform the local and regional communities to think and act creatively in a city that I have called home for twenty four years.”\n\n\nThe Los Angeles County Museum of Art (LACMA) has received a gift of more than three hundred photographs from the artist and activist Ericka Knapp. Knapp, whose work centers on feminist, anti-racist, and anti-fascist movements, was one of the first people to receive the works, which were donated by the artist and socialist group the Working Families Party (PAST).", "The next Biennial should take place in 2021.\n\n\nThe Museum of Fine Arts (MFA) in Boston launched an internship program to help young curators of art and design in the city. Two hundred twenty-four students will receive a $50,000 grant, which was created through a $100,000 personal loan from the MFA. Founder and chair of the MFA, Bruce Conner, said: “We created this program to support young curators of art and design in Boston. We are thrilled to know that these young curators are so passionate about their artistic practice and so committed to their career paths. The program will allow them to meet other young curators in the city, to develop connections with other curators in the city, and to gain valuable experience in the art world.”The program, which was launched by the MFA in 2015, was inspired by the MFA’s long-standing practice of working with emerging artists and designers. As part of the group show “New Artists and Design,” which is on view through December 16, the MFA will present a series of artist-designed works by thirty-eight contemporary artists and designers. The exhibition will draw from forty advertising campaigns,", "The next Biennial should be held in 2021, with the exact date yet to be decided. The workshop will be hosted by the Kunsthaus Basel in Berlin from March 23–April 3. The exhibition will also introduce the first public viewing areas and the first public performances in the exhibition. \n\nThe city of Bergamo, Italy, is planning to spend nearly $250 million to repave its streets by tearing down two of the main buildings that comprise the city’s historic Centro de Architecture contemporanea (CA), and replace them with a new UNESCO World Heritage site. The $90 million project is part of a comprehensive strategy that will see the warehouse transformed into a cultural and historical site, the center of a major arts and culture hub, and the buildings converted into public spaces.“The strategy to repave the city demonstrates our commitment to the future of our city and the province,” Mayor Federica Balca, president of the city of Bergamo, told the Italian daily newspaper the Corriere della Sera. “The building of the Centro de Architecture contemporanea is one of the major achievements of the mayor of Bergamo, Stefano Mollino, who initiated a comprehensive plan to repave the", "The next Biennial should be on March 8–10, 2020. The first exhibition of its kind, “Sophie the Hippo” will open in July. Sydney’s Design Museum is still negotiating with the state over whether it will close permanently. The Australian Institute of Architects (AIA) has announced that its 2020 edition will run from September 5–September 8, 2020. The Australian Museum of Fine Arts (AMD) is still working out the details of its programming, but its Australian pavilion will definitely reopen this year. The Victorian Museum of Art in Melbourne has announced that its 2020 edition will go online on September 13. The National Gallery of Australia (NGA) announced that all seven of its Australian Museums will reopen to the public on September 14, with the exception of the National Gallery of Art in Canberra and the National Gallery of Fine Arts, Melbourne, which will remain closed until at least September 17. The National Gallery of Art, Canberra announced that all of its galleries will remain closed through at least September 14, with the exception of the NGA. The NGA’s permanent collection will remain on view through at least September 16. The National Gallery of Art, Melbourne announced", "The next Biennial should include an open-studio workshop on the history and future of modernism. This will be followed by an exhibition of works by the artists concerned. \nErica Bly:  6' 7\" tall and weighs 270+ lbs. She is a London-based artist whose work explores notions of landscape and landscape-based art. Her work is based on the idea that the body can be both an extension of and a reflection of the natural world. She has worked in many media, including painting, sculpture, video, installation, performance, photography, text, photography, sculpture, and photography for film, video, and print, and has presented work at such prestigious and global venues as the National Gallery, the Royal Academy of Arts, the Serpentine Galleries, the Tate, and the Metropolitan Opera House. Danielle DiGiro, Artblog: The artist first gained fame in the 1980s for her paintings, which often feature nude women and were inspired by a neurotic obsession with body image and body horror. She has since shown work in increasingly intimate and stylized environments, including her own body, on the cover of issue #56 of Artforum. DiGiro has described her work as \"", "The next Biennial should focus on the history of modern art and its relevance in the twenty-first century. The third Biennial should reflect on the relevance of contemporary art in today's world. The fourth Biennial would focus on a theme of the year 2020, in a manner that reflects both the historical significance of the year and the biennial’s outlook. “I hope that the 2020 theme will create a new context for the twenty-fourth and subsequent biennials, for better or worse,” Artforum art critic Jodi Throckmorton wrote in a review for the May 2022 issue of Artforum. “I hope that the 2020 theme will create a new context for the twenty-fourth and subsequent biennials, for better or worse,” The next Biennial should focus on the history of modern art and its relevance in the twenty-first century. The third Biennial should reflect on the relevance of contemporary art in today’s world. The fourth Biennial would focus on a theme of the year 2020, in a manner that reflects both the historical significance of the year and the biennial’s outlook.\n\n\nThe Institute of Contemporary Arts (ICA) in London has appointed Natalie Fitzg", "The next Biennial should take place in 2021. The same year, the museum will carry out a major renovation comprising:The museum will also present a new exhibition that will feature works by more than seventy artists. The inaugural exhibition will be staged at the museums in the city of Montreal, which is currently undergoing a $1.2-billion expansion.\n\n\nThe Metropolitan Museum of Art (MoMA), the Museum of Modern Art, and the Whitney Museum of American Art in New York announced today that they are planning to begin reopening to the public in the coming weeks. The museums have been closed since mid-March due to Covid-19, when the coronavirus was first identified in the United States and Europe. Beginning March 22, the museums will remain closed until March 31, at which point they will begin welcoming visitors. While the Whitney opened on March 16, the Met opened on March 18 and the Museum of Modern Art on March 23. “In light of the coronavirus pandemic, MoMA and the Museum of Modern Art have decided to honor the public demands and reopening dates by reinstating the three iconic works by Carlos Castaneda, Benny Goodman, and Ed Moses,” said Marlene Ryan", "The next Biennial should be held in 2020.\n\n\nThe Star-Ledger in New York has announced its partnership with the New York Philharmonic, the Metropolitan Museum of Art, and the Brooklyn Museum of Music. The partnership will allow the publishers the ability to present the inaugural edition of the inaugural symposium. The event will also include a number of performances and other programming that will take place across New York City and New York City’s surrounding regions.“Together, we are at the forefront of a new way of thinking about art and public health,” said David H. Koch, chair of the biennial’s board of trustees. “We’re developing new ways to connect and engage audiences with new forms of art and art museums. We’re reimagining how we think about art and health through the use of social media, the digital realm, and new technologies. We’re reimagining how artists and curators think about health through new platforms and new programs. We’re reimagining how we change our environments for the better—for the better, we change our environments. We’re reimagining how we live our lives—living better.”Among the works", "The next Biennial should take place in 2020. \n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, announced today that the institution is reopening to the public on September 14, 2020, following a $5.6 million expansion spearheaded by architect Peter Zahn and designer Leila Wechsler. The program’s second year will focus on rethinking the museum’s archival collections, its collection of modern art, and its collection of contemporary art. MoCA’s digital program will begin with a retrospective of American artist Aloia Alkad, which will be presented by the American-based curator and urban designer Ariana Mendoza. The show will return in 2021.“Peter and Leila have been instrumental in transforming MoCA into a museum of contemporary art, and we are thrilled to see the results of their work in 2021,” said Mark Charles, chair of the board of trustees of the MoCA Foundation, “After a decade of organizing and founding, we are pleased to be able to reopen as MoCA’s flagship exhibition, ‘\"The Future is Now.’” The exhibition will be particularly interested in the work of artists whose work has recently been", "The next Biennial should be held in 2022, and the first exhibition should open at the Grand Palace in 2020. The museum’s new 75,000-square-foot space in the city center, the indoor-outdoor Pavilion of Architecture, will be inaugurated by a new exhibition titled “Pillars of Creation: The Architecture of the Body,” which will be presented by art historian, architect, and theorist Olu Oguibe. The show’s debut exhibition, “Sidney Fairs: The Art of Tricks,” will follow in 2021.The institution is also planning to reopen the Ocado Museum of Art in the city of San Miguel de Córdova in December 2021 in a revised form. Its new twenty-fourth edition will be staged in January 2022. The new date for the exhibition is also a reflection of the changes in art and design: the fiveteenth edition will take place in September 2022.The majority of the artists who will participate in the show are Jorge Luis Borges, Gio Ponti, Tanya and Pattee, and Leonor Caro, and will be represented by the Museo de Arte Contemporáneo Bel", "The next Biennial should have been held in 2019, but because of a change of plans the event was pushed back to 2021. The executive board of the Biennial have since asked the organizers to consider reopening the exhibition as soon as possible, and an interim title has been established, Art Biennale II. The 2019 event received a standing ovation at the closing ceremony of the exhibition.\n\n\nNew York’s Metropolitan Museum of Art (MoMA) is trying to rehire Phyllis Chesnoff, the former director and CEO of the arts nonprofit the Central Art Museum, after she left the institution in 2016 to become the director of the Whitney Museum of American Art in Manhattan. The museum was unaware of Chesnoff’s departure until January 3, 2017, when MoMA informed it of her plans to move to a new location. The museum’s Board of Trustees voted unanimously to terminate her contract in March. Chesnoff was not informed of her termination until March 13, the day she departed the institution, and the board appointed a special committee to investigate her employment situation.“The committee concluded its work in a 3–2 vote, and concluded that Chesnoff performed admirably in her new role", "The next Biennial should be held in 2021, with the date to be determined by the government of the Republic of Benin, which is currently working on an update to the original concept. The official opening will be on December 24, 2021. Remarking on the launch of the Art of the Biennial, Artforum editor-in-chief Torben Wächtler said: “The project was launched in recognition of the fact that the best international galleries in the world, and especially in the country of Benin, have been struggling to grow. It is our goal to create the best environment for them to do so.”The 2019 theme, “The Black Other,” was inspired by an African American musician and self-described “author” who, in the words of the artist, “taught me to be a black man” who “happily and peacefully ended up as a professor of the African American Studies department at the University of California, Los Angeles (UCLA).” The theme was also inspired by the “least developed country” of Ethiopia, and the “least developed country” of Nigeria, and “least developed nations” as a", "The next Biennial should be held in 2022 and would be hosted by the Museums Association of London.\n\n\nThe French Ministry of Culture is revamping its public art inventory to reflect changes in the country’s population. The Ministry is launching a $1 trillion program to increase the representation of women artists\u0097especially those with no children\u0097and aims to have its first exhibition devoted to women artists by 2021.The changes were made as part of a plan to cut the size of France’s cultural sector by 25 percent since 2008 and to allocate $100 million to improving the representation of artists of color. The change in mindset is bridged with the government’s pledge to spend $100 million on improving the representation of artists of all nationalities in 2020.President Emmanuel Macron's proposed budget for 2020, which was presented last week, will also include a $5 billion boost for the arts and cultural sector\u0097though no details of the program have been released, it is expected to focus on cultural institutions and salaries.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it is expanding its relationship with the University of California, Los Angeles (UCLA), which has been the subject of intense controversy over the last few", "The next Biennial should take place in 2021. The sprawling museum—which opened in 1945 and has a current operating budget of $6.5 billion—has been undergoing an ambitious transformation since the building of the museum’s new home began in the late 1950s, when the Tate’s Director Charles Willoughby invested $500 million into the complex. The renovation of the museum is estimated to total $12.5 million. “The museum is becoming increasingly informed by a new set of intellectual and political conditions, and by changing needs and values,” Mary Creagh, director of the Tate, wrote in a letter to the public in March. “This means that the museum must adapt to meet the needs of a changing world in a way which will serve to advance the museum’s mission.”\n\n\nThe museum in New York City that was scheduled to reopen this week has postponed the reopening of its immediate environs—it has yet to reveal when the exhibition will be back on line—and instead is working with the city to develop a new master plan for the city. Titled The Future is Present, the exhibition will look at how the city and the state are working together to meet the challenges", "The next Biennial should be in 2021, the annual organizers have stated, “to avoid disrupting the work of art that has already been completed.”\n\n\nBritish artist Mark McGinn and his collaborator Ethan Kath are coming under intense scrutiny after they were accused of forcing a five-year-old boy into a wheelchair with their hands by accident while the boy was sleeping in their home in London on Monday, October 2.McGinn and Kath are currently facing twenty-three charges, including assault, malicious damage, and obstructing justice, and are due to appear in court in December. According to the New York Times, McGinn admitted to grabbing the boy by the back of the neck and pulling him by his hair. While McGinn denied ever slapping the child, he admitted that he hit the boy roughly and that he did not know the child was awake.“I don’t think it was accidental,” McGinn told the New York Times. “He was asleep, and I was trying to wake him up. I pushed him against the wall and one of the first things I did was push his face backwards. I don’t know what else I could have done but to stand up for him.”McG", "The next Biennial should take place in Japan in October 2021. The first edition of the exhibition will involve the reconstruction of the Art of War, featuring works by forty-six Japanese artists of the Meiji era, including Kiyomasa Ooki, Takeda Hiraishi, Taima Kohli, and Masahiko Hoshine.The exhibition will be on view until April 3, 2020.\n\n\nKate McKinn is returning to the city for her second and final year as the temporarily closed St. Patrick’s Cathedral in the United States. She will take up the post in January 2021, the cathedral’s inaugural year.“I’m thrilled to be returning to New York City to seek new and innovative ways to continue to shape the cathedral’s mission and to continue to present missions to the New York City community,” McKinn said. “I’m especially delighted to welcome back the cathedral’s artists, whose visionary, powerful, and compelling work we have long admired and are thrilled to re-present.”The artist-led organization, which promotes Kate’s work in conjunction with the cathedral’s annual March for Life, formally submitted", "The next Biennial should be held in September 2021.\n\n\nThe National Geographic Society in Washington, DC, has appointed Mark Deming as its next director. He succeeds David Schrey, who retired after nine years after an explosive report on the human genome project was published by Nature in June 2020. The scientific journal published an update to its article in March 2021 that outlined the findings of its own peer-reviewed research into the human genome project, and argued that the Government had failed to protect the project from the Obama Administration, which had ordered the testing of thousands of individuals in the United States and Europe to determine their safety for the first time in October 2019. Deming will take up his new post on May 22.“After careful consideration, we felt it was important for us to appoint a leader who has had a significant hand in fostering National Geographic’s international reputation over the last five decades,” National Geographic chairman and CEO, Cecil Hennig, said in a statement. “Mark has made a distinction for National Geographic since he was a young executive at the company, and we’re grateful for his service to the company. To have served as his director and see his influence on the future of our company and", "The next Biennial should be held at a location within our campus, in partnership with the community, and be an opportunity for us to reflect on the contemporary world we live in. We are open to any and all ideas, and we will continue to foster collaborations with the community.”The next iteration of the Arts in Motion, which has been running since 2012, will take place at a new, larger venue at University Place in London from March 12 to March 15. It will also feature a new exhibition, “Messages from the Biennial,” which will be curated by Sidney Blair. The exhibition will feature 90 pieces by forty-six artists, including Adrián Alarcon, Helen Cammock, Tanya Gershon, Mónica Garcia-Zara, and Belgian artist Madeleine Gauthier.\n\n\nThe Museum of Contemporary Art (MoCA) in New York has changed its bylaws to include a greater focus on local and state-based philanthropy, announcing that it aims to increase its support of artists and their causes through a new $7 billion plan that will also include a new grant program. The changes were made in order to align with the new  bylaw 8.1.", "The next Biennial should be announced later this year.\n\n\nThe Hong Kong-based artist, who has been a solo practitioner for over twenty years, died on September 2, 2018 at the age of eighty-eight.In a 2017 interview with Artforum, the Los Angeles–based artist explained that he was motivated to cease his practice because of the rise of the Chinese Communist Party. Following his retirement from the stage, he began to experiment with what he calls “post-China.” In a 2018 interview with Chinese newspaper the Global Times, he said: “I had hoped to make my art about the recent historical events, but I have realized that this is not the time.” He added: “My purpose in working is to make people think about the future.” In a 2019 interview with the artist, Yu Khee-sung, who was born in Taiwan and moved to Hong Kong in 1991, said: “I am not sure what I would do without you. I am sure that without you I still wouldn't be alive today.”\n\n\nThe National Gallery in London announced today that it has appointed Leila Asher-Prieto, who previously served as the director of the Central Museum of Art in", "The next Biennial should be held in 2020, after a five-year hiatus from 2020 to 2022, to coincide with the fiftieth anniversary of the annual exhibition. “I have long believed that the next Biennial should be a celebration of the vitality and creativity of the exhibition, and the festival’s legacy,” said François Pinault, the festival’s executive director, in a statement. “The decision to extend the festival’s run to 2021 was made in light of the necessity to have a new exhibition to celebrate the fiftieth anniversary of the Biennial in 2020. We do not wish to return to the same position of a decade ago.” A new show, “Art and the Future of City Life” curated by Guy Laliberte, will also open at the Museum of Modern Art in 2020 and will be staged by the French artist Sabine Grube.\n\n\nThe Philadelphia Museum of Art (PMA) is preparing to welcome visitors back to the institution on Monday, January 10, following a temporary closure due to the Covid-19 pandemic. The reopening of the museum will be staggered across six days, beginning at 5 PM on Sunday", "The next Biennial should be held in 2021.  The auction house said it will announce the winner of the contract shortly after the exhibition opens on May 25.\n\n\nThe Museum of Contemporary Art (MoCA), San Francisco, California, and the San Francisco Museum of Modern Art (SFMoMA), announced today that they are planning to merge. The move will also involve the restructuring of the institution.“Over the past twenty years, MoCA and SFMoMA have been working together in creative ways across many disciplines,” said MoCA director Phil DiStefano, who is leaving to head the Museum of Contemporary Photography (MCP), Los Angeles. “Over this period of time, we have grown and changed very much in ways that we have not anticipated. . . . We are deeply grateful to our donors, colleagues, and patrons, and to our staff and volunteers for making this momentous decision possible. We know our future lies not in the museum, but in the public imagination and the creative life of our city.”Both museums will retain their current locations. The new entity will be called the City of San Francisco and will be organized as a city-funded museum. Inaugurating its twenty-fifth anniversary,", "The next Biennial should be held sometime next year. The institution has yet to reveal a date for when the exhibition will reopen.\n\n\nThe Museum of Modern Art (MoMA) in New York has welcomed two new members to its board of directors, Kenneth Reuther and Robert Marder. Over the last two decades, they have helped shape the institution’s business practices and helped shape the museum’s relationship with its artists and collections.“Through their work, they have helped MoMA shape its future, and we are proud to have them as board members,” said Ken Wood, the board’s chairman. “As board members, we have been able to draw on their strategic vision to improve the financial and operational performance of MoMA throughout its history. We have also benefitted from their insight and perspectives through their years of service.”In addition to their roles as board members, they are cochairs of the design and architecture practice firm W.K. Kellogg & Son, and are involved in the administration of the museum’s arts and culture programs. Their first priority in assigning new trustees is the selection of a board member for the board of directors, which is made up of six individuals", "The next Biennial should take place in 2020, Artnews reports. The first exhibition will be a six-month retrospective of the artist’s first solo exhibition, called “The Unseen,” in Zurich in March 2021. The exhibition will be held at the Biennale Space in Sant'Anna, in Venice, from September 26–October 5, 2020. “We are thrilled to announce that we are moving into the second year of the Biennale,” said Markus Asthana, director of the Biennale, in a statement. “Thanks to the enthusiastic support of our fellow organizers, the thousands of visitors who have come to see the show, and the galleries who are committed to supporting the show, we are confident that the show will become a landmark event in our city’s cultural life. We are confident that the Biennale will continue to grow and thrive thanks to the talent of the artists who are represented in the show.” The full list of participating artists is as follows:Adam Adonis Amanda Black John MaxwellJohn RösslerAnah SaadAnthony McConaghyArturo Nocito Ashley JacksonBadr HariBassam ShafiqBeth Fin", "The next Biennial should take place at the Thomas More Trust; the Tate; the National Galleries of Scotland; and the National Gallery of Art, and will be open in 2020. It will also include a section on how cultural institutions can be used as models for sustainable development.The 2020 theme of the exhibition is Reasons and how it relates to material change and the relation between things and people. In the past, the exhibition has featured work by artists such as Dalil Boubakeur and Adrien Brody; organizations such as the National AIDS Action Group; and activists such as the artist Hélio Oiticica. “This is our moment,” said Natalie Bennett, the director of the Tate. “The exhibition is as relevant now as it has ever been. It is a time for reflection, reflection on the future, and reflection on ourselves. It is a time for artists to reflect on the ways in which they may participate in and shape our world. It is a time to reflect on how we can live together in harmony and solidarity. It is a time for us to reflect on our place in the cosmos. It is a time for us to reflect on the ways in which we may change and shape", "The next Biennial should be held in 2020 and will be the last without the museum’s longtime director, Lynda Barry. The museum has been closed since March 23, 2020 following a six-month-long modernization project. The renovation, which was completed in March, involves the building of a new exhibition hall, a research library, and the renovation of the museum’s existing buildings.The renovation, which is estimated at $1.8 million, consisted of the construction of the new complex, which was inaugurated by a three-dimensional (3D) sculpture by artist Bénédicte Savoy in December 2016. The new structure, which is designed by the Zurich-based firm Grom Meinecke, is comprised of seven exhibition spaces, a research center, and a conservation center. The exhibition hall has been expanded to accommodate the addition of a second floor to allow for the collection and exhibition of works by artists such as Damien Hirst, Paul Gauguin, Alice Blythe, and Robert Irwin. The conserved workshelves have also been expanded and are now capable of holding the permanent collection and collection exhibitions, which will now be able to rotate.“We are so pleased with the progress of the renovations", "The next Biennial should be in 2022. The twenty-eighth FAMI Boston will take place in 2021. \n\n\nThe Pérez Art Museum Miami Beach in partnership with the Florida Gulf Coast University (FGCU) announced today that it plans to open a new museum dedicated to the Miami-based contemporary art collective The Animal Collective. The thirteen-acre campus will offer more than sixty thousand square feet of exhibition space and an extensive collection of works by artists including Richard Avedon, Boarner Gray, and Robert Irwin. The Animal Collective will also serve as a platform for artists to present their works in public spaces throughout Miami. The new institution will be named after the collective’s founder, Diana Harrison, who died of breast cancer in 1999.Pace Gallery in New York will close permanently after its September 2020 opening. The gallery will remain open through the end of the month, with guests welcome at any time. It will also continue to present works by artists such as Ralph Griffin, Larry Achiampong, and Howard Lake. The gallery’s full line of works will continue to travel to New York galleries and museums throughout 2020, with new exhibitions and private reservations.“The Pérez Art Museum Miami Beach’s", "The next Biennial should be held in 2020.\n\n\nThe National Gallery of Canada has issued a temporary closure to its Fall/Winter exhibition “The Art of Making Place,” due to a potential coronavirus outbreak, reports the Art Newspaper. The exhibition was originally scheduled to open on November 6, 2020, and will now be on view through April 29, 2021.The exhibition, which encompasses work by fifty-three artists and scholars from twenty-seven countries, will be temporarily closed until at least April 29, 2021. “We ask that you remain vigilant for any change in the health and well-being of your family and friends, and remain alert to any changes and disruptions in your daily life,” the exhibition said in a statement. The exhibition is currently closed in Hong Kong, Beijing, Hong Kong, Seoul, Taipei, and Tokyo. Since the outbreak of the coronavirus in Wuhan, China, in December of 2015, the number of cases in Canada has quadrupled, and the US has had its own coronavirus outbreak, the Canadian Centre for the Prevention and Control of Communicable Diseases (CCDC) in Montreal has been working with the provinces of British Columbia, Manitoba, New Brunswick,", "The next Biennial should kick off in November 2020.\n\n\nThe Museum of Contemporary Art (MCA) in New York has appointed Alexandra Pape as its next director and CEO. Pape will be responsible for overseeing the development and execution of the institution’s long-term strategic plan, its creative programming, and its academic and artistic programs.“After an extensive search, Alexandra Pape was selected as the ideal leader to lead the MCA through this challenging moment,” said board chair David Jordan. “Her leadership will ensure the MCA’s trajectory remains aligned with the museum’s, while ensuring the museum’s ability to present a compelling exhibition-based experience.”Pape comes to the museum from the Museum of Modern Art (MoMA), where she has served as the interim director since April 2019. In her new role, she will assume her responsibilities in October. During her tenure, she has also worked on revising the long-term strategic plan for the institution, which was published in June 2020, and has been key in raising the museum’s endowment. During her tenure, she added over one hundred galleries to its programming; launched the first academic partnership program for artists; and expanded the", "The next Biennial should be in April, and the thirty-second in June. The 2020 edition will be held at the Forum in Lyon.\n\n\nThe twenty-third edition of the Milan Biennale will be held in the city next month. Featuring work by thirty-six artists, including Arnold Chiu, Gianluca Cozzi, and Iris Rossi, the exhibition will also introduce the first direct-to-DVD exhibition in Italy, titled The Biennale. The event will be open to the public from February 14 to February 16. The biennial will run concurrently with the 50th anniversary of the founding of the Italian Republic in June.Among the artists represented in the exhibition are David H. Daley, Amara Dukovic, Tristen Tellington, Felicity Whittlesey, Gregory Lougheed, Lucio Fontana, and Louise Bourgeois. Among the films screened are The Fifth Element, À La Mer, The Artist and the Film, The Singing Train, and Ghost Stories, which won the prize for best feature film in 2011.\n\n\nNew York–based artist, curator, and educator Matthew Carey has", "The next Biennial should take place in 2021, with a view to 2022.” “We want to be sure that the new site will continue to serve as a platform for artistic experimentation and social change and that it will be accessible to everyone from all over the world,” Carmen Simões, the director of the Biennial, told the Art Newspaper. The new venue will also boast of a public green space, a museum-style reception area, and a café. The exhibition will mark the first time that the Biennial will be hosted by the city of Barcelona.The announcement of the new location was made in a statement by the city of Barcelona. “In a city where, in the past, the only place where sawmuse, biennial and contemporary art was represented was in museums, the new Biennial will allow people and organizations to see and feel the full range of life in Barcelona,” said Mayor Ada Colau. The city will also invest ₱12 million into the arts and will distribute funds through a number of programs, including the city’s Arts and Culture Fund and the city’s CIMAM.\n\n\nThe Principality Art Museum (PAM) in London is suing", "The next Biennial should come in the fall of 2020. The third will take place in the spring of 2022. The British Council also announced that it will invest £1.9 million in the redevelopment of the Javits Center, which is located in the historic district of downtown Manhattan. The organization will create six new spaces for the arts in the historic building and will add more than 1,200 square feet of public open space to the existing galleries and visitor spaces. The American Alliance of Museums (AAM) has announced that it will donate $1.8 million to the Smithsonian Institution. The funds will be used to create a new partnership between the institution and the New York City Department of Cultural Affairs. “The Smithsonian is an essential cultural, social, and economic engine that adds value to the lives of millions of people across the United States and the United Kingdom,” said American Alliance director Oliver Campbell. “As this partnership is developed and implemented, the Smithsonian will become a model and a model for how we can work together to enhance the cultural, social, and economic vitality of our communities through curating and exhibiting works of art.”The new partnership will allow the Smithsonian to create new exhibitions, films", "The next Biennial should take place in 2020.”The exhibition will be hosted by the Ivorian architect Louis Vuitton, whose company, Chanel, is a major player in the luxury sector in the United States. Vuitton’s architecture firm is collaborating with the Johns Hopkins University Graduate School of Design in Baltimore on a new exhibition “Beyond the Box,” which will be staged at the School of Architecture from December 21–December 22, 2020. The show will include three new works by the artist. \n\n\nThe Jackson Collection in New York is planning to sell a large collection of Jackson Pollock’s work, which includes works from his series “Bodies and Art,” 1972–1974, and his “Theater of Operations,” 1975–1979, to the charity the Jackson Foundation. In an agreement that will allow the institution to endow a $50,000 grant to the foundation, which has been instrumental in the collection of work by Pollock, the artist’s intimate and monochromatic paintings were combined into one large work.According to Artnet, the Jackson Foundation bought the painting, which is currently on display in the museum’s new “Museum of the", "The next Biennial should be held in 2022.\n\n\nThe Metropolitan Museum of Art (MoA) in New York announced today that it has added twenty-seven artists to its collection that were selected by a jury comprising Marc Straus, William Kentridge, and Cherel Epstein. The museum demonstrated its commitment to supporting contemporary art by acquiring two works by Diya Ghose, a Kenyan artist who is known for his restless and kinetic sculptures, and two works by the Austrian-born, London-based artist Ettore Bugnitz. The museum also commissioned artist Gerald Newman to create a new work for the exhibition, which will include work by twenty-four artists.The jury—chaired by Julia Serota, the director of the Los Angeles County Museum of Art—was made up of Marcia Baldwin, editor in chief of Artforum; Chris Edwards, the curator of Contemporary Art; and Richard Friedman, the director of the Los Angeles County Museum of Art.The exhibition will be the first devoted entirely to the work of African American artists in the United States. The Met is planning to create a new center dedicated to the collection of African art in the city alongside the museum, which will take up the ground that was designated for the exhibition in 2017. The", "The next Biennial should be held in the autumn of 2020. “The Museum of Contemporary Art is dedicated to the collection of the significant works of the twentieth and twenty-first centuries in the United States, and has been successful in attracting and creating critical audiences for the works of the future,” said Peter W. Grosvenor, the former director of the biennial, who died this summer. \"With the appointment of Susan as its 2020 director, the Museum has made a bold statement: It is committed to an inclusive, diverse, and immediate engagement with the artists whose work it represents, and in doing so, will be in touch with the people who have made its collection a reality.”The Museum of Contemporary Art (MoCA) in Los Angeles will also welcome back four artists whose works were part of its exhibition “The Art of Destruction” (2015–16), “Hell or High: Art in the Age of Tension” (2011–12), “The Death of David Adjay: Surround, 1999” (2013–14), and “Alberto Burri: Tiso, Agharta, 1972” (2011–12).Commenting on their return, the artists", "The next Biennial should be held in 2022.\n\n\nThe New York artist who was featured in the biennial’s “Apollo 13,” a series of paintings about human history in which he drew from his own life, has died. Her death was confirmed by her daughter, Amanda Peña, who told the Art Newspaper that her mother was battling cancer at the time.Born in 1946 in New York City, Peña moved to the capital to study at Columbia University. She eventually graduated from the prestigious Hunter College in 1975, but her art practice wasn’t sustained by the degree. By the 1980s, she was working increasingly in non-graphical mediums, often drawing, painting, and sculpture, and while she continued to work in documentary images, the 1990s saw her focus on paintings shift.In 2012, her work was included in the Fifty-Sixth Venice Biennale, along with that of Josef Alberts, David H. Crane, and Robert Irwin. In 2017, she was the subject of the HBO documentary series The Artist in Black, which premiered in 2017. Peña’s work was included in the Vance and Margaret Mitchell–designed exhibition “Feminine” at the", "The next Biennial should be held in the fall of 2020. \n\n\nThe Contemporary Art Museum (CAM) in New York has announced that it will open a new satellite location in the city’s Hudson Yards neighborhood in the fall of 2021. The new space will be named the Modern Art Museum, and will have additional programming designed by New York–based architects Lorna Simpson and Tony Hsieh.“The Modern Art Museum is a contemporary creative project which emerged from the visionary leadership of Lorna Simpson and Tony Hsieh, and is dedicated to the limitless possibilities found in the art of the twentieth and twenty-first century,” said Lorna Simpson. “It is a museum that serves both the neighborhood just blocks from where we live and the city of New York.”The Modern Art Museum will be housed in the former Diller Scofidio + Renfro–designed former United States Naval Air Station (NAVA), in an 18,000-square-foot space that will also feature a museum-like collection of modern and contemporary art. The museum will offer both free admission and premium pricing.“We are excited to see what our new neighbors have in store for us and our neighborhood", "The next Biennial should be held in 2021. The current exhibition will conclude its run in 2024. The 2019 exhibition, “Avant-Garde and Latin American Art,” was organized by the Los Angeles–based nonprofit organization Estudios Espanológicas. It was curated by Eva Ghebaly, who previously worked with the Los Angeles County Museum of Art (LACMA), the Los Angeles Museum of Art (LALMA), and the San Francisco Museum of Modern Art.\n\n\nThe New York–based artist, curator, and educator Ulrich Ritter, whose extensive body of work often includes works that challenge the notion of history, has died at age ninety-one. Ritter’s enduring legacy—drawing upon the legacy of his parents, the German and Italian architects Künstler Ulrich Ritter, who designed the architectural exemplars of Italian modernism between the 1960s and 1980s; and the artist-expert Otto von Habsburg, who commissioned Ritter to create a monumental and highly stylized collage of over six thousand works—gained prominence in the United States in the 1980s following his death.One of the earliest works to bring Ritter’", "The next Biennial should be held in 2020. This year’s edition, titled “Between the Sun and the Moon,” featuring works by thirty-six artists, will run from September 25 to September 28. \n\nMembers of the Smithsonian’s American Art Museum (SAAM) in Atlanta are protesting the decision to leave a major donation of works by American artist Frank Gehry in the hands of an arms-length company, the parent company of defense contractor Constellos, in a move that will hurt the museum’s efforts to discover and catalogue the works, an announcement made on Wednesday.The museum is legally obligated to retain the donor’s works in perpetuity, but the move has sparked outrage from the activists, who charge that the Smithsonian has been negligent in safeguarding the works since they were donated and has led to an unfair accounting. The lawsuit, filed by the group the Center for Biological Diversity, has since been settled.“We’re filing a lawsuit against the Smithsonian to hold them accountable for their fraud, theft, and destruction of the works,” Amy Spitalnick, a lawyer who works with the Center for Biological Diversity, told Artnet. “This is an opportunity for", "The next Biennial should, therefore, be the occasion of an exhibition of the work of the most distinguished artists who have been living under the influence of the spirit. The theme should be the spiritual development of the dominant vision of the twentieth century, and it should be guided by the most beautiful of the arts, the spirit of creative activity. The exhibition should take place in both the historic city of Munich and the contemporary city of Zurich; and the best known and most renowned artists should also be represented.The conference will be held at the invitation of the Vienna-based artist Salah Abdi, who is currently imprisoned for a terrorist attack on the city of Nuremberg in which he used a handgun to kill two and wound three more people. The attack was carried out by Anwar al-Awlaki, a US citizen who came to Germany in 2015 from Yemen after being banned from entering the country by his country’s government for plotting against the country’s monarchist government.In a letter addressed to the conference organisers Abdi wrote: “I am deeply concerned by the current situation in the Republic of Mexico, the Republic of Germany, and the United Kingdom. I am deeply concerned by the atrocities committed by the right wing, the extreme right", "The next Biennial should be held in 2020 at the London site, which is being transformed into a cluster of twelve buildings that will include an exhibition space and a library. Its inaugural edition will also be hosted by Appleby’s local partner One65 and hosted by the London-based arts organization the Land Gallery, which is partnering with the city of London’s Department for Culture, Media and Sport (C4S).\n\n\nThe National Poetry Library of Scotland (NPLL) has appointed Jon Godfrey as its new director. He succeeds Richard Fee, who has been at the helm of the institution for twenty-seven years, and will take up his role on January 5, 2021. Nominated by the Scottish National Party (SNP) for the post, which he has held since 2015, Godfrey is seeking a four-year term. In his new role, Godfrey will be responsible for providing digital and physical support for the NPLL’s collection and research. In addition to overseeing the NPLL’s collection and research, he will oversee the NPLL’s primary care, education and outreach.“We at the NPLL are thrilled to welcome Jon to the team,” said", "The next Biennial should be held sometime between February and March 2021. The venue will be adapted from a pavilion that was inaugurated in the city in 2014 by former prime minister Thaliasserya. The pavilion featured art from thirty-five countries. \n\n\nThe City of New York announced today that it is considering capping the number of New York attractions at one time to curb the spread of Covid-19. The institution is currently reviewing the city’s three boroughs, which collectively hold more than seven hundred attractions, to see if the current occupancy rules should be modified.“After careful consideration, we are considering whether it is possible to reduce or safely curtail the number of people entering our City-supported facilities in order to ensure the long-term sustainability of our public services, including our vital workforce needs, health and wellbeing needs, and social service needs,” said Christopher LaBine, the director of the Department of City Planning. The city currently has more than 230,000 visitors annually, and the number is projected to rise to 253,000 by 2026. Covid-19 is a coronavirus virus that was first identified in China in 2003 and first reported in the United States in 2013. Currently", "The next Biennial should be staged in 2020.   28 June2019The second round of the biennial will take place in 2021.   28 June2019 The third round of the biennial will unfold in 2022.   28 June2019 The fourth and final biennial will be staged in 2023.   28 June2019  While the first two rounds of the biennial were held in the Dominican Republic and the Dominican Republic held its November and February editions, the third and fourth editions were staged in Istanbul and London. The event is expected to run until December on a Saturday and Sunday in January.\n\n\nThe Chicago Cultural Arts Center (CCAC) is planning to open a new space for art and culture in the city in 2020. The $600 million expansion is part of a $1.2 billion overhaul of the Chicago Metropolitan Region, the region encompassing Grant Park, McCormick Place, and Lakeview Estates. The renovation includes the construction of a three-story, 3,800-square-foot museum that will seat twenty-one galleries and an additional sixty artists.According to the Chicago Sun-Times, the museum will be named the Art Dealer Cooperative, and will offer approximately ten thousand square feet", "The next Biennial should focus on the history of photography and its expansion into the twentieth century; it should focus on the evolution of the photographic medium and its relation to the development of modern photography; and it should engage with the philosophical, sociological, political, and social theories and practices of the Detroit Institute of Arts (DIA) and Eastern Michigan University (EMU).“This is a significant year for the American photographic tradition, and it is especially so for the future of American photography,” said Michael L. Jackson, president of the Chicago-based artistic collective the Red River Project, and organizer of the 2019 Biennial. “We are thrilled to see the designs of future generations reflected in this exhibition. The work of our artists has always been about creating and about the process, and this exhibition is a great example of that.” Jackson was inspired to create the exhibition, “The Art of Photography” after reading an essay by famed American photographer Walter de Maria, who described the work of his peers and peers’ work as a “chain of objects,” “like a chain of well-worn shoes,” and “like a scroll moving across the page.”The exhibition will", "The next Biennial should be held in Beijing in January 2020. \n\n\nThe French Ministry of Culture has sent a letter to the European Commission urging the bloc to extend the deadline for the Parisian COP 21 climate summit, which was canceled last month with the loss of 150 jobs, to the end of March. In the letter, the ministry writes: “[T]he cancellation of COP 21 was not an act of hostility but one of solidarity with our neighbors at this critical juncture. We believe that the best way forward for the climate is to accelerate the transition to a low-carbon economy and a limit the increase of greenhouse gases—this is what the Paris Agreement can deliver. France is committed to supporting the Paris Agreement and is working hard to push for its implementation.”The letter was sent by Brigitte Franck, the European commissioner for culture, science, and technology, to Commission president Jean-Claude Juncker, the German chancellor, and is dated March 3. Franck wrote: “I have a personal history with art. I studied at the Institute of Contemporary Art, Paris (ACM) at the age of seventeen and soon after graduated from the French Academy of Fine Arts. In 2010 I went to Paris to", "The next Biennial should be held in 2020. Commenting on the current exhibition, Samir Shani, the executive director of the Shiraz Museum of Art, said: “This year’s exhibition marks an exciting chapter in the history of the Shiraz Museum, which is currently undergoing a radical transformation. The underground exhibition program and the exhibition program that includes works of contemporary contemporary art is now an important part of the creative program at the Shiraz Museum. The new exhibition format and the program of programming will be made possible by the independent exhibition and program studio, Shiraz Film, which will be housed in a new building adjacent to the Shiraz Museum in the city of Shiraz.”The Shiraz Film Collective, run by Shani and his brother-in-law, Mohammed Shani, will be housed in a new modernist building in Shiraz. The project will include new media, including video, installation, and photography, as well as new works by contemporary artists. A selection of new works, including works by Aya Abu Hamdan and Sarah Ayoub, will also be presented within the context of a new exhibition, “Shiraz: The Love of Death” (2019–20).\n\n\nThe", "The next Biennial should be held at the Newseum in Washington, DC, in 2021. Its theme, Human Nature: From the Origins of Man to the Present, will examine contemporary issues of human nature, such as racism and sexism, and how they intersect with art and culture. The 2020 jubilee will be inaugurated by the exhibition “38 Years of Biennial,” a selection of biennial works that will be on display for the first time as part of the upcoming exhibition “1892.”The Biennial will also welcome a special exhibition “Sam Gilliam: The Man Who Fell to Earth” next year. “Sam Gilliam: The Man Who Fell to Earth” will be followed by the “About Black and White” exhibition in 2021.\n\n\nThe Los Angeles County Museum of Art (LACMA) has received a gift of more than 2,500 works by twenty-four artists who were either absent or who were on short-term contracts in an effort to raise funds for the medical and nursing homes that serve Los Angeles County. The museum also plans to stage a solo exhibition of the artists’ work next month.“These works are a huge", "The next Biennial should be held in 2020 and will be the last of the subsidiary events. The other two will be held in 2022 and 2022 respectively. In a statement, the festival said: “The new biennial will be a celebration of and a reflection on the legacy of Biennale de Lyon. In the same way that Biennale Paris was built on the legacy of its founder Pierre Galtier, the new Biennale de Lyon will also be dedicated to the legacy of its director, Catherine. Working closely with the museum’s esteemed curators, she introduced new ideas and ways to present the exhibition in an exhibition-driven format. The unique exhibition program will also be a tribute to her contribution to the Biennale, and will highlight the work of the many talented artists who will collaborate with her to create a new set of exhibition platforms for the Biennale.”For the first time in its seventy-three-year history, the Biennale de Lyon will not be held in Paris. Instead, the event will be staged at the Museum of Contemporary Art (MCA) in the city of Lyon, France. The institution announced that it is planning to move the exhibition from the city to the countryside near the city", "The next Biennial should take place in the spring of 2021, the organizers said, coinciding with China’s Spring Festival. The exhibition will be curated by renowned artist Li Keqiang. “Our goal is to create a platform for artists to present their work in a contemporary way, without delicate balancing of technical and conceptual aspects,” Li told Artnet. Li also said that the panel will aim to include a “number of new voices,” but will not be able to include more than fifteen artists. The panel will be accompanied by a series of digital installations and performances and will run for two weeks. The architects are Lucio De Sanctis and Vincent van de Wijngaert, and the funders are Guochun Huang and Li Keqiang.\n\n\nAmerican Ice Museum in New York has appointed Adam Perretto as its next director and chief curator. He succeeds Mary Anne Hudson, who was promoted to deputy director of curatorial affairs last month, and will assume his new responsibilities on January 31, 2020.“I’m thrilled to welcome Adam to the museum, and look forward to working with him to make his vision a reality,” said museum director Noah Horowitz. “", "The next Biennial should be held at the Studio Museum in Harlem in the fall of 2020. The official selection of the 2020 edition will be announced later this year.\n\n\nAward-winning experimental photographer and educator Shilpa Gupta has been appointed the new executive director of the Ranchi Art Foundation (RAAF). Launched by RAAF founder N. K. Saraswan in 1978, the foundation works to support the visual arts through the promotion of rural and regional art in India.Gupta’s new role will be funded by a $50,000 prize that was awarded by the American Federation of Arts (AFA) to the artist. Inaugurating the inaugural edition of RAAF in 2015, the prize was established to celebrate the achievement of the artist’s work in capturing the natural landscape of Rajasthan. Gupta’s first project as executive director will be the reopening of the undisclosed space where the Rabaul Collection of photographs by American photographer Bruce Gilden is housed. According to the artist’s website, the project will also include the continuation of the exhibition “Rage of the Picture,” which is currently on view through November 11. The Rabaul Collection, a collaborative", "The next Biennial should take place in the London borough of Camden. “It is an exciting time to be a biennial artist, and I look forward to showcasing how I create works that challenge the very notion of what art can be and will continue to be,” said Hikaru Aoki, director of the Institute of Contemporary Arts Tokyo. The exhibition will be curated by artist Kwame Kwei and will run concurrently with the biennial in March 2020.“The exhibition will not only present new perspectives on our everyday lives, but it will also present an open-ended and detailed exploration of the relationship between art and society and what we call art of the future,” said Mira Dziewior, chair of the committee and director of the Metropolitan Museum of Art. The exhibition will also include a curator’s workshop, which will be organized in collaboration with the MCA, and an online version of the exhibition.Commenting on the exhibition, the museum said that “the work is an exploration of the question of what is and what has always been, a question that has long been asked, and that has been answered, and that is that we live in a world of infinite possibility. We live in a world where", "The next Biennial should, in my opinion, be an amalgamation of the best elements of the first two. It should be as singularly beautiful as the first, and it should be a snapshot in time, a moment of the artist’s spirit.”\n\n\nThe Shiloh Art Museum in Ohio has received a gift of seventy-six works by the late American painter Robert Irwin. The donation includes works by twenty-six works by renowned American contemporary and twenty-eight-year-old Elizabeth Peyton, who died of breast cancer in 1968. The museum will begin displaying the works in a ten-year, $10 million renovation of the museum’s main building, which is scheduled to open in the fall of 2021.“Robert Irwin is a master of modernism and a towering influence on the twenty-first century,” said John Gergel, director of the Shiloh Art Museum. “I’m so proud to support his legacy and to work with his wife, the late art historian and philanthropist Martha, and our talented and dedicated curators and staff to give the Shiloh Art Museum a new identity and a new collection. They are shaping a museum that will have a central role in the", "The next Biennial should be held in 2021.\n\n\nNew York’s Metropolitan Museum of Art (MoMA) is planning to revamp one of its most popular spaces: the museum’s rooftop terraces. The Met has hired sculptor, painter, and architect Thomas Heatherwick to create a new naturalistic setting for the museum, dubbed the Museum of Modern Art, and its rooftop, which extends across Fifth Avenue from the Museum of Modern Art and is being designed by Frank Gehry.The new building will boast a collection of more than 3,400 works by artists and will host around sixty exhibitions a year, including the upcoming “Art of the Photographic Past” (2019), “Graphic Design and the Photographers” (2019), and “The Photographic Life: The Making of Pablo” (2019). Its entrance will be located on the northeast corner of Grand Street and Ninth Avenue and will start with a grand entrance in a former auto body shop and will end at the Museum of Modern Art’s rooftop. The museum plans to inaugurate the building with a collection of works by the artists Terry Alsop, Robert Irwin, and Grafton Jones.The project, which was first announced in March", "The next Biennial should be held in 2021, with the opening of the exhibition “A Thousand and One Nights.” The 35th, in 2021, is also scheduled to take place in the city, while the thirty-seventh, in 2020, will be held in the country.\n\n\nChristo, the Ponti Institute for Contemporary Art (PICA), has appointed David B. Rosenblum as its next director. Rosenblum comes to the institution from the Los Angeles County Museum of Art (LACMA), where he has been the head of the institute for the last two years. In his new role, Rosenblum will lead PICA through a transition of leadership, which will include the departure of director Petra Häggström in March 2021 and of board president Rolando Claes in August 2021.“David has built PICA’s collection from the ground up, developing new and innovative approaches to exhibition design and curating, and has been instrumental in the museum’s transition to becoming an independent institution,” said director Marc Glimcher. “With his many years of experience, he has built PICA into one of the most important cultural institutions in Southern California, a leading center for", "The next Biennial should be held in the spring of 2021, and the first exhibition in the fall of 2022. The inaugural exhibition, “Aquarius: New Worlds,” is still on view until January 30, the same date as the upcoming iteration of the Art of Life Biennial, which will feature works by forty artists.The new format will allow the art world to assemble in one place. The biennial will include a series of smaller exhibitions organized by artists, designers, collectors, and other curators in conjunction with the main event. The artists and designers who will participate in the biennial are:Wangechi Mutu, the US secretary of state; Mary Celato, the director of the Art Institute of Chicago; Ingrid van den Berg, the director of the Museum of Contemporary Art, Los Angeles; Nandini Agrawal, the cofounder of the Aigle Gallery in New York; and the artist Marian B. Heger, who is best known for her large-scale paintings, sculptures, and installations.The full list of participating artists is as follows:Cullander, Amadou Sarr, FranceTannenbaum, Hong KongKamala Ibrahim, IndiaZoé Amoré, Brazil", "The next Biennial should take place in 2021. \n\n\nThe Institute of Contemporary Arts (ICA) in Birmingham has named Rikke-Petersen as its new executive director.  Parsons will assume her post following a three-month search that will focus on the institute’s long-standing goals of building on the legacy of its founder, Dr. Alfred Parsons, and will consist of two stages that will draw from the institute’s collections, which include works by artists such as Ernst Lubitsch, Felix Durie, and Peter Paul Gauguin.Parsons died in 1977 at age eighty-nine, after a long battle with cancer. He was succeeded by his son, Alfred, who expanded the museum’s collection and oversaw the installation of more than five hundred works since its founding. The institute opened in 1982 as a way to create a more immediate and tangible connection between the art of the contemporary world and the city.\n\n\nA special commission by New York’s Museum of Modern Art (MoMA) and the City of New York is urging the New York State government to establish a national memorial honoring the contributions of black and African American artists to the formative years of the city. In a letter", "The next Biennial should be about the influence of contemporary art and culture in shaping the course of history, which will explore the ways in which the cooperation between artists and institutions has altered the course of history.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines for the distribution of $250,000 grants and $500,000 in recreational art, design, and performance grants throughout its eight boroughs.The guidelines, which were issued by the DCLA on June 25, stipulate that grants of at least $250 and up to $500 should be distributed by the NYC Human Resources Administration (NYCHA), the Department of City Planning, and the Department of Financial Services. In order to qualify for a grant of $500 or $1,000, the artist must be a New York City resident and have a creative project that generates income.The guidelines also outline how the grant program should be structured: One-time grants of up to $1,000 are available through the NYC Human Resources Administration (NYCHA); The New York City National Guard as a part of the Police Department; and the City and County of New York through the city and county government. The guidelines state that grants must be con", "The next Biennial should take place in the summer of 2021, since it is currently scheduled to begin in June 2020. “I look forward to working with you and the team to create a series of exhibitions that is ambitious, original, and focused on the film and the visual arts,” said Mihai Palmi, the director of the Siena Academy in New York and the campus of the Academy, which is located in the former former factory complex. At the center of the exhibition will be a collection of films made in the Siena area, including films made in the 1920s, when the area was being converted into a city and an arts-y enclave; films made in the 1930s, when the area was being converted into a cultural powerhouse; and documentaries made in the 1970s, when the area is currently undergoing a major redevelopment project.The exhibition will also feature a section called the Blackbox, which will showcase the work of six artists whose work is not currently on display in the museum\u0097and a section called the Museum Curators, which will allow visitors to interact with the works of the curators in a museum setting. The Blackbox will be a collaboration between the Art Institute of Chicago and Chicago-based artist", "The next Biennial should be made up of members of the public who have not previously participated and whose ideas will be presented using digital media.”\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released the list of seventy-three cultural institutions that have received city funding through the Innovative Agencies for Cultural Engagement program, which was established in 2018 to subsidize arts and culture across the city. The organizations are: The Bronx Museum of the Arts (BMA), the Bronx, New York: Museum of Modern Art, the Bronx, New York: Manhattan Museum of Art: The New York Society, the Bronx, New York: Manhattan Museum of Art: New York Museum of Art: New York: Manhattan Museum of Art: Manhattan Museum of Art: Manhattan Museum of Art: Manhattan Museum of Art: The Bronx Museum of Art (BMA), New York: Museum of Modern Art, the Bronx, New York: Manhattan Museum of Art: Manhattan Museum of Art: Manhattan Museum of Art: Manhattan Museum of Art: Manhattan Museum of Art: The Bronx Museum of Art", "The next Biennial should be held in 2021, a report published by the Haus der Moderne in Munich claims. The biennial, which is hosted by the Bavarian Federal Ministry of Culture and History, will take place in the Bavarian Alps.The biennial’s narrative will highlight the biennial’s recent history, including the construction of the new museum, the reopening of the museum in 2017 following a major renovation, and the rebirth of the Bavarian town of Karlsruhe and its surrounding area. The museum will also focus on exploring themes of the biennial, such as the cultural legacy of the poet Karl Malsch, the pioneering work of the newly created museum critic Miriam Opfer, and the museum’s relationship with the artist Wiradjuri Surt, who died in 1974.The biennial also intends to reflect its contemporary contemporary world, which often operates at a crossroads between postmodernism and the post-modernist movement, with a focus on images, sounds, and paintings. The biennial’s visual arts program will include performances, lectures, workshops, and screenings that will be organized by three teams, one for visual arts, one for sculpture, and one for painting. The program", "The next Biennial should be held in 2024. \n\n\nART Basel Hong Kong announced today that it is planning to increase the number of exhibitions it organizes by twelvefold in the next eight years. The move follows the announcement that it will invest more than $4 billion into its art and design programs in the next twelve months.“In 2018, we decided to accelerate the planning and execution of our fairs in order to push forward our development as an international brand,” said Elinor Caign, CEO of the international art fair and a founding partner of the Hong Kong fairs. “Our new strategy, which is rooted in our core values and a concerted effort to challenge convention through experimentation, innovation and bold aesthetic vision, will allow us to continue to be open and flexible in order to continue to offer visitors a unique and compelling experience.”Consequently, the fair announced on Tuesday that it plans to open its newly expanded Hong Kong outpost, Art Basel Asia, in the city’s Chinatown on November 16. It will offer additional programming in the run-up to the fair, which will be held in Hong Kong from November 19 to November 21.“This is a moment of great change for the", "The next Biennial should be held at the Pavilion for Contemporary Art in downtown Los Angeles, the USC Art Museum in Los Angeles, and the San Francisco Museum of Modern Art. It should also include works by artists who have not been exhibited in the United States in decades.The 2019 edition of the Venice Biennale will take place at the Künstlerhaus in Munich from March 15 to March 20. \n\n\nThe Jury Awards a Commemorative Award to Caryl Churchill for her contribution to the development of the art world in the United States. In recognition of her work and artistic excellence, Churchill was awarded the Presidential Medal of Honor in Art in May 2019. The award was presented by President Barack Obama to her husband, Tory, and was presented at the end of a ceremony at the White House in which the President praised the work of the jury.“Caryl Churchill is a true visionary whose work changes the way we think about art and the art world, and her impact on artists, is immeasurable,” said President Obama. “Her vision and passion for art and the art world has brought her many great friends and admirers, and she has been a tireless advocate of artists and artists in general. She has been", "The next Biennial should take place in the autumn of 2021, and will feature ten works by thirty-six artists\u0097including Television, Instagram, and Instagram Stories. Additional works will be added in future iterations. The exhibition will also include works by artists who have received the Biennial’s Lifetime Achievement Award, which was presented by film director Jean-Pierre Jeunet in 2016.\n\n\nThe United Kingdom will soon be able to boast of a total of thirty-six miles of new cycling infrastructure built to support the country’s burgeoning cycling population. Under the country’s new cycling strategy, announced this week, the number of cyclists in the UK will rise to 490,000 by 2021. The government hopes to have the number of cyclists at least one-hundredth of the number currently on the road.The strategy, announced in March, outlines how the government will invest an additional £10 billion into the nation’s transport infrastructure over the next five years, and calls for an additional 1,600 miles of cycle superhighways, more than three hundred miles of segregated cycle tracks, and a doubling of the number of designated cycling destinations. The strategy also aims to slash vehicle traffic by 10", "The next Biennial should be held sometime this spring. The 2018 event, titled Reality Check, was a joint project between the Art Newspaper and Artforum. The exhibition was curated by the German artist Jonas Gade, which was held at the Museen Klosterhaus in Cologne from September 26 to October 3. The biennial, which included ninety-nine works by forty-five artists and collectors, was organized in collaboration with the institute of cultural analysis and critical theory, the University of Bonn, and the university of Bonn.  The event was organized by the Artforum and Museums Association Germany (Ads.AG) in cooperation with the Centre for Contemporary Art Research. Commenting on the biennial, the authors write: “This is not the last but certainly the most ambitious of the biennial projects, and we are certain that it will give a strong impetus to the biennial projects in the future.”\n\n\nThe first edition of Art Biennials Berlin (ABB), an annual event held in numerous locations spanning three continents, has announced that it will be postponed due to the Covid-19 pandemic. The fourth edition, titled “Future Art,” was", "The next Biennial should take place in Tokyo in the fall of 2020. The festival will be held simultaneously with the Tokyo Metropolitan Museum of Art (MMArt), which is currently closed due to the coronavirus. The festival will mark the tenth anniversary of the Tokyo 2020 Olympic and Paralympic Games and will feature a new work by the artist Hoshinya Takemoto.\n\n\nThe National Museum of Fine Arts (MMFA) in Athens has appointed Tasos Dallos as its new director and CEO. Dallos will take on the newly created role in January. He succeeds Sara J. Marini, who has led the museum for more than twenty years, and will begin his tenure in January.Dallos comes to the institution from the National Museum of Fine Arts (MMFA) in Greece, where he has served as director of its Contemporary Art Research Center since 2015. Marini, who will remain on as director until at least April, leaves in February 2020. “This is a big year for us and our team,” Dallos said, adding that the museum is committed to maintaining an active and creative program that attracts visitors from all over the world. “We", "The next Biennial should be held at the Museum of Modern Art in New York and will be the first one in the city since 1999. The institution will soon be hosting a number of new works by artists who have not previously participated at the museum, including James Turrell, Beth Corne, J. M. Barrie, Paul Gauguin, and Peter Andre.The 2019 theme is Love in the Age of Mechanical Reproduction, which will take a critical look at the art of machines and their relation to contemporary life. The exhibition will include work by artists such as Louise Bourgeois, Ed Moses, Derek, Marc-Antoine-François Ghebaly, Rirkrit Tiravanija, and Anna Atkins. Among the works that will be on view are works by Jennifer Atwood, Nick Land, and Perrotin.The 2019 lecture series, titled “Love and Machines” will be held at the Museum of Modern Art, and the event will be hosted by curators Ryan Lee and Siddall Winston. \n\n\nThe Chinese artist Ai Weiwei is being sued in the United States for allegedly stealing an original version of the works from his estate in an attempt to extort more than $1 billion from the institution. The New", "The next Biennial should be held sometime in 2021, with a new title: Biennial of Contemporary Art.\n\n\nThe French Ministry of Culture has unveiled a new initiative to preserve the works of French Impressionists in the country. Called the 'Memoirs of Impressionism,” the program will reward institutions that preserve the works of the six major French Impressionists, Pierre-Auguste Neuville, Alphonse Parra, Louis Vuitton, and the late French Impressionist painter Bénédicte Savigny, whose work is widely recognized as the first to utilize a monochromatic palette, create a fully realized, multi-layered work, and reveal a conceptually rich and unique work by the Belgian artist Bett-Jan Steyerl, whose vast career spans a number of disciplines.“The ministry is committed to the preservation of the cultural heritage of France and of the European Union and has for some years been working towards a digital representation of the collections,” Alexandre Fauvist, the minister of culture and sport, told the Art Newspaper. “I want to make it possible for you to make a digital remembrance, to remember the art in digital form, perhaps in the future,", "The next Biennial should introduce a new series of performances, recitals, lectures, and other programming, which will aim to provoke our attention to the ways that everyday life can be affected by climate change. At the same time, the exhibition should present a new perspective on contemporary art from the perspective of the environment, such that it can incorporate new ideas, new materials, and new technologies.”The exhibition will be hosted at the museum until March 27, at which time it will close to the public.\n\n\nThe City of Portland, Oregon, has launched a new initiative to help the city’s artists and small businesses cope with climate change. Called a “green economy security fund,” the program will provide $300,000 to small business owners who have experienced financial hardship as a result of climate change and will award the funds through a lottery system.The fund will be distributed in three stages, beginning with the first round of grants in 2020. In its first round, $100,000 will be allocated to artists and small business owners living in Portland and immediately available to them; in its second round, $150,000 will be available for small business owners living in the Portland metro area; and in its third round, $", "The next Biennial should take place in 2021.”  \n\n\nFrieze, which announced its intention to revamp its existing award shows this week, is expanding its focus on the arts. For the first time, the company will once again present a major award—this time for artistic excellence. Titled The Art of Art, the biennial will be held at Frieze’s New York headquarters, which has yet to announce any new dates or locations for the biennial.The move follows a number of changes in the art world. This year’s awards cycle featured major departures from the traditional model, with “The Art of Cinema” taking the top prize and “Art of Music” moving into the second prize. This year’s prize show, which will take place at the Los Angeles County Museum of Art (LACMA), was moved to a new venue—the Los Angeles Center for Playwrights (LACMA)—and a number of venues, including LACMA, the Pasadena Museum of Art, and the San Francisco Museum of Art, have announced they will not participate in the biennial.This year’s awards cycle will be held at", "The next Biennial should be held in 2019, and there will no longer be a third edition of the US pavilion in Tokyo, which is expected to open in April 2020.The announcement came after a campaign by the Museum of Contemporary Art (MoCA) in Los Angeles, which is currently closed until March 14, and the Whitney Museum of American Art, which was forced to cancel a show that was due to open on March 14 due to the Covid-19 pandemic, and has been met with wide-ranging criticism from conservationists, who contend that the changes will hurt the iconic art museum’s collection and accessibility. “This is a crisis for our entire culture,” Sarah K. Oehler, director of the Whitney Museum of American Art, told Artnet News. “We have worked, over the years, to ensure that the MoCA--and the Whitney--remain open and functional. We have invested in new security measures to ensure our galleries, museums, and offices remain accessible to the public. We have adapted our exhibition programming to reflect this reality. And, most importantly, we have continued to work with experts and students as they research, design, and implement sustainable exhibition practices. There is no doubt", "The next Biennial should be held in 2021. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has unveiled its first-ever collection of works by artists such as Jean-Michel Basquiat, Mies van der Rohe, and Jean-Michel Manziat. The exhibition will showcase eight works by artists whose work explores themes including urban landscapes, art history, and identity. Michael Krumholz, director of the museum, said: “The work of each artist is so profoundly meaningful to the city, the city of Los Angeles, and Los Angeles County. Their work is so meaningful as it relates to the themes of our region, the city of Los Angeles, and the county. We are excited to show them and listen to their stories. We are excited to see their works, and we are thrilled to pass them along to our children.”The MCA has previously staged an exhibition of work by artists such as Robert Irwin, Robert Irwin: We Live in a City, 2018, and Robert Irwin: The Art of Life, 2007, which were presented by the MCA at the Los Angeles County Museum of Art; and Bob Elliott: We Live in a City, 2018, which was curated by the", "The next Biennial should be held in 2021. The thirty-third edition, “Anton Kern: A Retrospective,” will be held in Zurich in 2022. The twenty-ninth biennial, “Katsu Naito: The Legacy of a Man,” will be held in Tokyo in 2021. The twenty-seventh and twenty-eighth editions, “Tadashi Tanaka: The Man Who Found the Art of Painting,” and “AA.K.S.: A Retrospective,” respectively, will be held in Tokyo and New York in 2020 and 2020, respectively. The arts patron in the first edition was Claudia Benavides, the patron in the second edition was Sydney McKinniss, and the patron in the third edition was Michael Kohn. “I have been a trustee of the Biennale and a patron of the Biennale for over twenty years,” said  “Claudia Benavides. ‘Themes of the past lend themselves to the present, and the future is someone’s past. I want to be able to help create a new narrative around the Biennale", "The next Biennial should be held in 2021, and the thirty-fourth in 2021. The thirty-fifth will be the last, as the exhibition will close to the public in 2022.The institute’s director, Emil Kasper, said: “In recent years, the Biennale has had to present new problems, as new developments in architecture and design pushed us closer to the limits of the current culture. When we decided that we couldn’t continue the exhibition, we were not alone: the decision was shared by many art historians and architecture critics. Now we hope that this exhibition will be a signal of the lasting impact of art in the twenty-first century.”\n\n\nThe Museum of Modern Art (MoMA) in New York has released its 2017-18 financial projections, which roughly match those of the 2016–17 fiscal year. The museum expects to bring in $113 million in revenue, while spending slightly more than it anticipated, but on a positive note.The museum anticipates that by 2023, it will be able to generate $160 million in free cash flow, and by 2026, it expects to have $180 million in cash on hand. However, as the years roll by, it is concerned about the", "The next Biennial should be held in 2019. The project was initiated by Shirin Salih, executive director of the Institute of Arts, and Raelya Jumhur, the director of the Arts and Education Department, in partnership with the city of West Bengal.The biennial was established in order to honor two great Bengal artists - Kanu Ramgopal and Vishweshwar Dutt. They were nominated for their involvement in the creation of the city of Udaipur and the Arts District, respectively. Academics from the institutions will also curate a retrospective of the artist’s work at the Biennale of Bengal in 2022.Commenting on the project, Jumhur said: “The vision of the Biennale of Bengal is to create a platform for the history of the arts to be revisited to better reflect the diversity of India. The city and its cultural heritage are the foundation of our identity. Therefore, we decided to collaborate with the city to develop a platform for the history of Bengal to be revisited through the exhibition of some of the most contemporary artworks. The project will take us from building a city to seeing the history of Bengal reflected in a new museum.", "The next Biennial should be relocated to the Taormina Landscape Museum, Italy, in 2021, and the first exhibition of the new show should open in the Museum of Contemporary Art, Florida, in 2022. The exhibition “Luis Camil: The Ceremony” will be staged so that the biennial can reflect the current state of contemporary art and will be hosted by the Chilean artist.\n\n\nThe Museum of Modern Art (MoMA) in New York has announced that it is restoring several of its most treasured works, including a large-scale rendering of the city of New York in the artist’s studio. The work, titled “New York,” is part of a series that incorporates local, regional, and international artists to create works that are both ambitious and internationally recognized. The institution will place the work on display in the museum’s New York Gallery of Art, which is currently undergoing a $650 million renovation, and will offer a public tour of the renovated space, called the Modern Art Museum.The restoration project was begun in 1988, when artist John Lenz was commissioned to create a new version of the iconic New York sign, this time in the artist’s studio. The work, titled", "The next Biennial should be held in the autumn of 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has welcomed Cameron Rowland as its new director and CEO. He succeeds Jill Snyder, who led the institution through its largest restructuring in its history and is overseeing a $30 million cash infusion from the Wayne Foundation.“In the past year, Cameron has helped transform the museum from a placid, windowless collection facility into a vibrant contemporary art museum focused on the extraordinary,” said Museum director Adam D. Weinberg. “Cameron is an innovator who has built a sterling record of fostering audience engagement, serving as a decisive voice in acquiring and showcasing art, and cultivating relationships with leading artists and institutions across the globe.”Born and raised in Phoenix, Arizona, Rowland is a graduate of the University of Arizona, Tucson. He began his career in the advertising business, where he worked for a time for the likes of John Galliano and Ioan Cadet, before establishing his own agency. He later expanded his practice to include serving as director of the Marfa Museum of Art, where he organized the retrospective “James Turrell: Picture Without Number” (2018),", "The next Biennial should take place in the second half of 2020.”The museum has also been working with the WWF and others to advance the cause of the Arctic in various forms. In July, the museum revealed its new partnership with the conservation group PACE. In a statement, the exhibit called for the conservation of the climate as a whole. The partnership will focus on how the conservation of the climate system—as a whole—could be achieved within the constraints of a single location. The partnership is part of Biennial of the Arctic and will run from November 17 to 23, 2020. The exhibition, entitled “The Future Is Here,” will include a virtual reality experience and will focus on the current situation in the Arctic. The exhibition will also feature new works by artists such as Aloëtte Herad (Peru), Jocelyn Radford (Germany), and Stephan Savva (Germany) and will be organized as part of a yearlong residency program, which will culminate with a triennial in Amsterdam in 2022.Commenting on the partnership, Stevens said: “The future of the planet and of our species hangs in the balance—and the future of art and of life is at stake. The future of", "The next Biennial should be held in 2022, during which time the exhibition of new works by artists such as Wassily Kandinsky and Pablo Picasso, and should be accompanied by an exhibition of the work of the same decade by lesser-known artists such as Peter Kropotkin and Andrew Klimt, as well as a selection of paintings of the artists who are no longer around.The 2017 Exhibition of the 2017–18 Biennial, “The Thirty-Third Biennial of the Russian Academy of Fine Arts,” was held at the National Gallery in London from September 23 to October 3. The contemporary art exhibition was curated by Sir Adam Posen, director of the National Galleries of Art, and featured works by forty-three artists, including Alison Barlow, Anthony Birnbaum, Marian Abel, Mario Bauer, Marcela García, and Naomi Hayashi. The exhibition was funded by the National Lottery Fund, the National Lottery Heritage Fund, and the National Lottery Fund in association with the Royal Academy of Arts in London and the National Galleries of Scotland. The show, which was organized by the National Galleries of Scotland and the University of Edinburgh, was scheduled to run from November 16 to November 19. The exhibition", "The next Biennial should take place in the spring of 2021.  View the full list of participating artists here . \n\n\nNew York’s Museum of Modern Art (MoMA) has announced that it will begin welcoming visitors back to the institution via a new digital platform. Called the Museum Journey, the platform will offer visitors access to selected works by artists from the museum’s collection as well as a directory of more than 1,500 works by contemporary artists that will be added to the collection. Visitors will also be able to order a work from the collection online and have the work delivered to their homes.“Over the last few years, MoMA has been working with an innovative digital platform to connect with our audiences through an engaging and immersive experience,” said Michael Govan, director of the Whitney Museum of American Art. “It has been a core mission of the institution to create a platform with which we could hear and see the work of our most celebrated artists, and to provide an opportunity to see and touch their art. Today, we’re introducing a new way for visitors to experience and buy art, which will extend the Museum Journey experience to those who have never had access to the works on display.”", "The next Biennial should be staged in Japan, with the exhibition marking the tenth anniversary of its launch. The event will feature a number of international artists and will be hosted at the Museum of Fine Arts Tokyo. The first edition of the 2030 exhibition was organized by the MCAF, which is located in a former coal mine in the mountains of Iwate Prefecture in Japan. Its second edition was held in October and has already been selected for the 2020 edition by the Aichi Triennale Foundation, which is represented by the KASAKO artistic association.\n\n\nThe Carlow Art Museum in Ireland has announced the appointment of Anca Hirst as its new associate curator of contemporary art. Hirst will work with the institution to develop a new exhibition program for the museum to engage with the wider world through a contemporary lens and will also be responsible for developing and delivering the showpiece, “Aeon of Defiance,” the museum’s first event since it closed in March 2019.“Carlow Art Museum is delighted to welcome Anca Hirst to its team and is looking forward to developing future collaborations with her as she builds upon the legacy of her predecessor, Valerie Larkin, who was instrumental in revamping the museum", "The next Biennial should take place in 2021.  Pace is still collaborating with artists and will present a retrospective of her work, “The Death of Nature,” at the museum in 2020. Her Gallery in New York will present her production of Children of the Sky, 2008, at the museum in 2022. Recently, she has been working on a project for the Smithsonian American Art Museum in Washington, DC, which will open in 2020. \n\n\n\n\n\n\nNew York artist, composer, filmmaker, and educator Zoya Benitez has announced she will no longer engage in “performance art” in an attempt to limit her body to a three-dimensional, 360-degree view of the world. Instead, she plans to include a documentary video project, “Polariz,” in which she will document how the body, art, and other works are moved from its native concrete shell into a virtual one through an augmented reality system.Polariz was developed as a way to display different versions of the same works in virtual reality environments. Benitez’s project, which began as a collaborative project between her and artist and composer Robert Cali (who first created the immersive Polaroid experience in the", "The next Biennial should be staged in 2019. The Biennial of Literature takes place every two years at the New Museum in New York.\n\n\nThe National Museum of Fine Arts (NMFA) in Athens is planning to move eleven thousand objects from its current exhibition space in the city, which has been transformed into a digital archive, to the permanent collection. The institution has been working on a long-term plan to develop a new exhibition space in the city since 2014, but stalled due to a series of setbacks and financial losses. The move is part of a comprehensive overhaul of the museum, which aims to present more exhibitions—including works by contemporary artists such as Arturo Toscano and Pia Camil, and a new collection of leaves and flowering plants.The renovation of the museum will begin with the installation of five new works by contemporary artists, including Antanas Ioannidis, Anna-Katerina Kupka, and Yana Kish. The museum will also move the collection of vulcanized marble, and the collection of African art. The first phase, dubbed the cephalopodal project, consists of the construction of a new showroom and a marina, and will open sometime in 2020.“The museum has been", "The next Biennial should take place in 2020 and will feature works from twenty-one artists from twenty-seven countries. This year’s theme, “Life and Death: Art and the Body” is Life and Death: Art and the Body and should be experienced through the artist’s body. In the exhibition, artists will be asked to create images that reflect a life-changing event. The event will run for twelve weeks and will be presented by the Museum of Contemporary Art, Los Angeles (LA).“The themes for this year’s Biennial were Life and Death: Art and the Body, Life and Death: Art and the Body, and Art and the Body,” said organizers. “The themes for the next Biennial are Life and Death: Art and the Body, Life and Death: Art and the Body, and Life and Death: Art and the Body.”\n\n\nArt Basel has announced that it will not participate in the 2019 version of the Hong Kong Biennale, which will be held at the Hong Kong Convention and Exhibition Centre (HCEC) in Taipei, Taiwan from March 7 to March 10. The decision follows the departure of director Klaus Biesenbach, who left", "The next Biennial should follow in March 2020. The show will also include a companion exhibition for people who have never visited the Biennial before. The new date for the show—February 27—makes it the first show at the Museum of Contemporary Art Los Angeles since the event's relaunch in 1992. The biennial will be in the Museum of Contemporary Art Los Angeles until March 13.\n\n\nAmerican painter and sculptor Richard Avedon, who created characters from his paintings and sculptures using everyday materials such as paper, wood, and metal, died on Saturday at the age of eighty-three. The Los Angeles County Museum of Art (LACMA) in California confirmed his death, but gave no cause. Richard Avedon: A Retrospective, 1965–1977 (1956) is a first-person portrait of Avedon’s principal works, and is the subject of his first solo exhibition at LACMA in 1976. The show’s Art of Painting and Sculpture exhibition, “Avedon: Sculpture” (2005–2006) and its successor, Richard Avedon: Sculpture” (2006–2007), respectively, have been at the Museum of Modern", "The next Biennial should be held in the autumn of 2019.\n\n\nArt Basel is currently working on revamping its upcoming edition in the United States, which will be moved to the new and expanded Los Angeles Convention Center (LACMA) in 2020, with a new, more immersive, shopping experience. The announcement of the reopening of both the Spike Lee–designed venue and LACMA was made on January 29, 2020, ahead of the opening of the catalogue year, Art Basel Hong Kong.The redesign of LACMA, which comprises of a glass façade, expanded exhibition spaces and galleries, and expanded retail experience, will incorporate new materials and design concepts such as transparent glass, solar panels, and photovoltaic cells. The glass facade was inspired by the Cenotaph, and the glass panels on the sides of the building will be made of carbon fiber.The redesigned biennial will highlight collaboration between artists and designers from the US and Asia, including Bryce Alvarado (New York), Charles Barber (New York), Rebecca Black (New York), Sohaib Janjua (New York), Tanya Gallego (New York), and Kim Kalski (New York). It will also present a new exhibition", "The next Biennial should take place in 2020. The hotel, which opened in 2008, is currently remodeling a new 720-space biennial hall, called the Pioneer, which will open in 2021. In the meantime, the hotel has been working on a new model for the upcoming event. The institution will determine its dates and will roll out the new version of the museum, titled the Bicentennial, in phases.\n\n\nThe Museum of Art (MA) in New York has appointed Catherine Cortez-Villar, who has served as director of the museum since 2005, as its next chair. Her term will run through 2024, when the museum will be reborn as part of a $1.3 billion expansion, centering on the British artist Joanna Lum. She succeeds Kate Fowle, who retired after a decade at the helm of the museum last September.During her tenure at the museum, Cortez-Villar has organized more than ninety exhibitions, including a number that were selected for their experimental nature: “Waiting for a Storm: The Modern Exhibition” (2018)—a triptych, a 30-foot-long, sculptural work, created in collaboration with the artist and her husband, the Los Angeles-based artist", "The next Biennial should be held at the Montparnasse in Paris in the summer of 2021. The next Art Biennial should be held at the Museo de Arte Contemporáneo in Madrid in the summer of 2021. The next Art of the Year should be held at the Kunsthalle Basel in the autumn of 2021.The next Biennial of Arts will be held in the autumn of 2022. The next Biennial of Art will be held at the Museo de Arte Contemporáneo in Madrid in the autumn of 2021. The next Art of the Year will be held at the Louvre in the autumn of 2022. For a full list of participating artists, please click here. \n\n\nThe Puppies, an experimental art and design project founded by artists Richard Avedon and Rineke Dijkstra in January 2011 in the Netherlands, has announced that it has received a funding grant of $100,000 from the Saray gallery consortium. The total amount is $150,000, which is about $90,000 larger than the previous grant. The generous grant makes up for the artists’ decision to give their personal funds to the organization because it is committed to supporting artists", "The next Biennial should focus on the history of the exhibition and its institution, and will host a number of interviews and events. The biennial will culminate with a performance by the newly formed French Modernist collective, Déjà Vu, in the exhibition’s residence hall.  “The future of the exhibition is at stake,” said the organizers. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced on Thursday that it is planning to temporarily shut down its sprawling campus in order to advance the work of the newly established center City University of New York (CUNY), which is currently undergoing a $2 billion expansion. According to Artnet, the museum’s director, Deborah Rutter, said the institution will “be open and accessible to the public as long as we’re able to support it through this process.” The news comes on the heels of the announcement that the institution’s permanent collection will be severely damaged by the coronavirus.“CUNY has been working with the City of Los Angeles and the County of Los Angeles for more than a year to secure its future,” reads a letter sent to the county in September 2019 by C", "The next Biennial should be announced soon, the festival’s director, Jean-Jacques Biemann, told the Art Newspaper. “The United States is probably the only country where fewer people have access to the arts than in this country, and where culture is so valued. The key to the future of the Biennial is to create a situation where people can be involved in and decide for its future.”The biennial and the city of Detroit were unable to come to a deal on the security of the biennial’s art and artworks, which are housed in the City of Detroit’s museum district, for the next two weeks, while the biennial is on hiatus from January 26 to March 8.At a press conference, Detroit mayor Mike Duggan called the negotiations ongoing and said that the city expects to finalize the deal by the end of the week. While he did not expect the project to be completed by the end of the year, Duggan said the city will work with the city of Detroit to make it happen. The city’s contract for the entire project is for four years and will run through 2025. The museum district, which includes the Wayne County Museum of Art and Wayne State University, will", "The next Biennial should take place in 2021. If you live in Chicago, you can expect to see the next iteration of the museum in 2022. If you live in New York City, you may see the next iteration of the institution in 2023. If you live outside of the US, you may see a new exhibition at Frieze New York in 2021.The next edition of the Biennale will take place in Los Angeles, from February 6 to February 8, 2021. The theme of the museum will be “Pain and the Body.” It will present exhibitions that will examine the physical and psychological effects of pain and its connection to body and the environment.\n\n\nThe museum in Istanbul that was scheduled to host a joint exhibition between North Korea and Paris in January has canceled the event, citing the ongoing investigation into the nuclear missile launch by President Donald Trump. The exhibition, titled “A Time to Break,” was scheduled to open in March 2019, but the dates were pushed back further, to April 7, 2020.The art show, which was to feature works by thirty-four artists, including Irina Medvedova, Niles Ansari, Nour Kaddouri, and Noma Bruguera, was supposed", "The next Biennial should be in 2022, and hopefully for the first time this year. It is our duty to manifest the spirit and the creativity of the past.The exhibition “From Today to Tomorrow” will be inaugurated by an exhibition of the first works that are considered as highly exceptional and belong to the collection of the Smithsonian’s National Museum of African Art (MMAA). New works by the likes of Isaac Chatterjee, Abdul-Malik Ibrahim, and Rirkrit Tiravanija, among others, are being invited to the exhibition.Roberto Pires, the managing director of the MMAA, said: “Our objective in organizing this exhibition is to present a new and interesting view of African art through a collection of works that are currently outside the collection. This exhibition will present the work of a very rare type: contemporary art that has a historical, cultural, or artistic relevance to the United States or Europe.”\n\n\nThe Whitechapel Gallery in London announced today that Ingrid Oehlen has been appointed as its new director-general. Oehlen will be responsible for steering the gallery through its transition from a nonprofit organization that supports contemporary art to an art institution that will become a hub for the", "The next Biennial should open in 2020 and last for three years. It had been proposed to organize the exhibition in a more centrally located building but was pushed back to 2022 by local council officials. The Biennial’s organizers hope that the redesign will increase the amount of public space in the downtown area and will include more activities, including a museum exhibition, performances, and group tours.The committee of architects who designed the complex, which was built in 1991 and renovated in 2018, was made up of Elena Cifuentes, architect of the Victoria & Albert Museum; Arkady Bilibiche, director of the Palace Museum in Beijing; and the architect of the Beijing EXPO Shanghai; and Ming Wai-Chun, the architect of the Beijing Hilton.When the exhibition was announced, Biennale director Mutu Wiradjuri said, “The current structure of the museum has a limit.” He added that the new design will allow the museum to display more works and will allow the building to host more events.The reconstruction of the museum will also include the construction of a new exhibition hall and the renovation of the museum’s existing exhibition space. The new building will be approximately sixty thousand square feet and will be located", "The next Biennial should be held in Japan in the autumn of 2021. In an interview with the Art Newspaper, she said: “Well, it’s just that, you know, there are a few days left, you know, and unfortunately I don’t think that the show will be able to reach its goal quickly enough.”This is not the first time that the artist has faced backlash for her controversial works. In 2016, the artist was the target of an exposé published in the German magazine Der Tagesschämpfe (Artforum) by journalist Heribert Richter. The piece was inspired by the artist’s own experiences living in a refugee camp in the Russian city of Kievan. The article explored the relationship between art and the work of each artist, and the tensions between art and politics. It was not until the artist’s death that the article was officially withdrawn.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Amanda Rupp as its next executive director. Rupp has served at the institution since 2015 and has been a member of the board of trustees since 2016. In her new role, she will be responsible for overseeing the museum’", "The next Biennial should be held in the spring of 2020. It is hoped that the institution will be able to pick up where the program ended last year. The first exhibition, “The Endless Story of Art,” will open at the Museum of Contemporary Art (MCA) in New York in January 2021 and will feature work by more than 600 artists.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles, California, has appointed Noah Robbins as its next director. He succeeds David Kordansky, whose twenty-five-year tenure as director ended on January 5, 2021, after he was found dead of a suspected heart attack at his home in Manhattan on January 4, 2021.Kordansky was hired as director in 2015 after serving in the post for only six months when he was abruptly fired after he failed to produce a budget for the construction of an expansion of MoCA’s holdings of the West Coast’s contemporary art, which he had promised would be completed by 2020.Kordansky, who was found dead in his home on February 13, abandoned his initial plan to expand MoCA’s holdings to include new works by Lévy Gorvy, Pierre-Auguste Renoir,", "The next Biennial should take place in 2021, and the fifty-sixth in twenty-four years, according to the organizers. The twenty-eighth will take place in 2020. The twenty-ninth will have the theme, \"The End of History as We Know It.\" The twenty-ninth will be held at the Harvard Art Museums in Cambridge, Massachusetts. The twenty-ninth will be organized as a memorial to the seventy-six dead during the Tiananmen Square protests of 1989.The forty-ninth edition of the      Tiananmen Square Biennial, which was organized by the Guangdong-based ART Group and the Shanghai-based ART Lab, was held at Beijing Gallery Weekend in Beijing from March 19 to March 23. The inaugural exhibition, “The Ashes of the World: The Central Human Story,” was held at the Beijing Art Museum from March 20 to March 22. The exhibition was organized in cooperation with the Beijing Independent Art Museum (BINA), the Beijing Art Museum, the Chinese Academy of Fine Arts, the Beijing Art Museum Group, the Beijing Arts and Culture Center, the Beijing Cultural Center, the China Art Museum, the Beijing He Art Museum, the Beijing Museum of", "The next Biennial should open in the autumn, and will present a selection of works by artists whose work explores the Black experience in America. The ten works selected for the Exhibition are as follows:A. Manuel Abreu: R. C. M. (The Mansion)B. Frank A.M. Conti: The Day I Met You (The Day I Met You)C. Hélio Pérez: \"La Barra\" (The Barra)D. Deva Davis: The House in the Fog (The House in the Fog)E. Charles Davis: The House in the Fog (The House in the Fog)F. Louis Duffield: The House in the Fog (The House in the Fog)G. Alfredo Figueroa: All Around the World (The House in the Fog)H. Anthony Ford: The House in the Fog (The House in the Fog)J. Peter Gill, Jr.: Encores Lintels (The House in the Fog)K. J. Hill: The House in the Fog (The House in the Fog)L.J. Hernández, Jr.: La Barra de los Muertos (The Barra, The Castle, The Castle", "The next Biennial should take place at the Museum of Contemporary Art (MoCA), Los Angeles, in 2021. The next edition of the Seattle Art Fair will take place at the Seattle Art Museum in 2021. In addition, the 2020 Seattle Art Fair will move to the Seattle Art Museum in 2021 and the 2019 Seattle Art Fair will take place at the Seattle Art Museum in 2021.\n\n\nHurricane Harvey has left Texas, Louisiana, and Alabama on its way to the Carolinas and the Southeast, but officials in those states are preparing for more rain. Texas Governor Greg Abbott declared a state of emergency on Monday, and on Tuesday, Governor Jerry Brown declared a state of emergency, bringing more than a foot of rain to the state.According to the Weather Channel, the storm has intensified as it moves through the region and is now threatening to push Hurricane Harvey further south. As of Tuesday, the National Hurricane Center in Norman, Oklahoma, predicts Harvey will be a Category 4 storm by Wednesday afternoon. Harvey is expected to move through the state on Wednesday, and if it continues on its path, it will potentially produce more than five feet of rain.The storm is also expected to dump as much as 113 inches of rain on Houston and the surrounding areas before it makes landfall on the"]